[
  {
    "url": "https://www.9news.com.au/world/court-finds-trumps-tariffs-an-illegal-use-of-emergency-power-but-leaves-them-in-place-for-now/d04a116d-2b8b-4ca2-954a-4e4fc8867ac3",
    "title": "Trump's tariffs 'illegal use of emergency power'",
    "publish_date": "Sat, 30 Aug 2025 00:23:59 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "A US federal appeals court has ruled that Donald Trump had no legal right to impose sweeping tariffs on almost every country on earth, but left in place for now his effort to build a protectionist wall around the American economy.\n\nThe US Court of Appeals for the Federal Circuit ruled Trump wasn't legally allowed to declare national emergencies and impose import taxes on almost every nation, a ruling that largely upheld a May decision by a specialised federal trade court in New York.\n\n\"It seems unlikely that Congress intended to ... grant the President unlimited authority to impose tariffs,\" the judges wrote in a 7-4 ruling.\n\nThe ruling complicates Trump's ambitions to upend decades of American trade policy completely on his own. (Getty)\n\nBut they did not strike down the tariffs immediately, allowing his administration time to appeal to the Supreme Court.\n\nThe US president vowed to do just that. \"If allowed to stand, this Decision would literally destroy the United States of America,\" Trump wrote on his social media platform.\n\nWhite House spokesman Kush Desai said Trump had acted lawfully, and \"we look forward to ultimate victory on this matter.\"\n\nAn attorney for small businesses affected by the tariffs, on the other hand, said the ruling shows Trump doesn't have unlimited power to impose tariffs on his own.\n\n\"This decision protects American businesses and consumers from the uncertainty and harm caused by these unlawful tariffs,\" said Jeffrey Schwab, director of litigation at the Liberty Justice Centre.\n\nPutting pressure on allies\n\nThe ruling complicates Trump's ambitions to upend decades of American trade policy completely on his own.\n\nTrump has alternative laws for imposing import taxes, but they would limit the speed and severity with which he could act.\n\nHis tariffs — and the erratic way he's rolled them out — have shaken global markets, alienated US trading partners and allies and raised fears of higher prices and slower economic growth.\n\nBut he's also used the levies to pressure the European Union, Japan and other countries into accepting one-sided trade deals and to bring tens of billions of dollars into the federal Treasury to help pay for the massive tax cuts he signed into law July 4.\n\n\"While existing trade deals may not automatically unravel, the administration could lose a pillar of its negotiating strategy, which may embolden foreign governments to resist future demands, delay implementation of prior commitments, or even seek to renegotiate terms,\" Ashley Akers, senior counsel at the Holland & Knight law firm and a former Justice Department trial lawyer, said before the appeals court decision.\n\nThe government has argued that if the tariffs are struck down, it might have to refund some of the import taxes that it's collected, delivering a financial blow to the US Treasury.\n\n\"It would be 1929 all over again, a GREAT DEPRESSION!\" Trump said in a previous post on Truth Social.\n\nA dissent from the judges who disagreed with Friday's ruling clears a possible legal path for Trump, concluding that the 1977 law allowing for emergency actions \"is not an unconstitutional delegation of legislative authority under the Supreme Court's decisions,\" which have allowed the legislature to grant some tariffing authorities to the US president.\n\nRevenue from tariffs now totals $159 billion, more than double what it was at the same point the year before.\n\nIndeed, the Justice Department warned in a legal filing this month that revoking the tariffs could mean \"financial ruin\" for the United States.\n\nWhat tariffs are in question\n\nThe ruling involves two sets of import taxes, both of which Trump justified by declaring a national emergency under the 1977 International Emergency Economic Powers Act (IEEPA):\n\n—The sweeping tariffs he announced April 2 — \"Liberation Day,'' he called it — when he imposed \"reciprocal'' tariffs of up to 50 per cent on countries with which the United States runs trade deficits and a \"baseline'' 10 per cent tariff on just about everyone else. Those tariff rates have since been revised by Trump, in some cases after trade negotiations, and generally went into effect August 7.\n\nThe national emergency underlying the tariffs, Trump said, was the long-running gap between what the US sells and what it buys from the rest of the world.\n\nThe US president started to levy modified the tariff rates in August, but goods from countries with which the US runs a surplus also face the taxes.\n\nThe \"trafficking tariffs'' he announced on February 1 on imports from Canada, China, and Mexico, and later refined.\n\nThe plaintiffs argued that the emergency power law does not authorize the use of tariffs. (Getty)\n\nThese were designed to get those countries to do more to stop what he declared a national emergency: the illegal flow of drugs and immigrants across their borders into the United States.\n\nThe Constitution gives Congress the power to impose taxes, including tariffs. But over decades, lawmakers have ceded authorities to the president, and Trump has made the most of the power vacuum.\n\nBut Trump's assertion that IEEPA essentially gives him unlimited power to tax imports quickly drew legal challenges at least seven cases.\n\nNo president had ever used the law to justify tariffs, though IEEPA had been used frequently to impose export restrictions and other sanctions on US adversaries such as Iran and North Korea.\n\nThe plaintiffs argued that the emergency power law does not authorise the use of tariffs.\n\nThey also noted that the trade deficit hardly meets the definition of an \"unusual and extraordinary'' threat that would justify declaring an emergency under the law.\n\nThe United States, after all, has run trade deficits in which it buys more from foreign countries than it sells them for 49 straight years, and in good times and bad.\n\nEmergency powers\n\nThe Trump administration argued that courts approved former US President Richard Nixon's emergency use of tariffs in a 1971 economic crisis that arose from the chaos that followed his decision to end a policy linking the US dollar to the price of gold.\n\nThe Nixon administration successfully cited its authority under the 1917 Trading With Enemy Act, which preceded and supplied some of the legal language used in IEEPA.\n\nIn May, the US Court of International Trade in New York rejected the argument, ruling that Trump's Liberation Day tariffs \"exceed any authority granted to the President'' under the emergency powers law.\n\nIn reaching its decision, the trade court combined two challenges, one by five businesses and one by 12 US states, into a single case.\n\nIn the case of the drug trafficking and immigration tariffs on Canada, China, and Mexico, the trade court ruled that the levies did not meet IEEPA's requirement that they \"deal with'' the problem they were supposed to address.\n\nThe court challenge does not cover other Trump tariffs, including levies on foreign steel, aluminium, and autos that the US president imposed after Commerce Department investigations concluded that those imports were threats to US national security.\n\nThe court challenge does not cover other Trump tariffs, including levies on foreign steel, aluminium and autos (Getty)\n\nNor does it include tariffs that Trump imposed on China in his first term, and Former US president Joe Biden kept, after a government investigation concluded that the Chinese used unfair practices to give their own technology firms an edge over rivals from the United States and other Western countries.\n\nTrump could potentially cite alternative authorities to impose import taxes, though they are more limited.\n\nSection 122 of the Trade Act of 1974, for instance, allows the US president to tax imports from countries with which the US runs big trade deficits at 15 per cent for 150 days.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/peter-overton-9news-sydney-dominates-6pm-ratings-presenter-reaches-35year-career-milestone/e8f7d0b8-564d-487a-becf-32d7008ba43b",
    "title": "'I'm just me. That's it, no trick': Peter Overton's 15 years on top",
    "publish_date": "Fri, 29 Aug 2025 21:06:07 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": "P﻿eter Overton has dominated ratings in Sydney for 15 years and been a constant presence at Nine for 35 years.\n\nMost know the ﻿59-year-old for delivering 9News Sydney's 6pm bulletin, or being the former reporter for 60 Minutes.\n\nBut to the people who know and love him, he is the same person on and off-air.\n\nREAD MORE: ﻿ Great weather divide across Australia taking hold\n\nP﻿eter Overton has dominated screens for 35 years and ratings for 15 years. (9News)\n\n\"I've never changed. That's what my father says to me. He says 'You've never changed from being the young boy to the school student to the university student, to the young sports reporter to the great jobs in Australian commercial television',\" he said.\n\nThe oldest of four siblings to parents who always kept them in line, Overton believes his upbringing and transparency are the ﻿reasons why he has resonated so much with the Australian audience.\n\n\"I'm just me,\" he said.\n\n\"That's it, no trick. It's just being true to who you are. ﻿I think it adds to the trust. ﻿\n\n\"The viewers are the smartest people in the house, and they can pick an imposter at 100 miles away.\"\n\nFrom a young sports reporter in 1991 to a 60 Minutes reporter for almost a decade, Overton has now led 9News to claim the number one ratings in Sydney for the 15th consecutive year.\n\nREAD MORE: ﻿ Huge profit jump for Qantas powered by surging travel demand\n\nPeter Overton has entered his 35th year in his career. (Cameron Williams/@camjwilliams)\n\nIt was a welcome accolade for the respected presenter as he ticked off another year in his career.\n\n\"I still pinch myself,\" he said.\n\n\"After 35 years, I reckon that's pretty darn cool to be able to say I love going to work every single day.\"\n\nOverton fondly reflects on the stories he has shared throughout his career, which have taken him across the world and resonated across Australia.\n\nFrom his coverage on the forgotten generation of cancer sufferers to mental health issues, he ﻿was able to see the real-life outcomes of his hard work.\n\n\"I was doing a story in Paris and Australians would come up to me in the airport or hotel and say thank you for doing that story,\" he said.\n\n\"And that meant a lot to me.\"\n\nREAD MORE: ﻿ Uber rolls out rideshare for teens across Australia\n\nPeter Overton reporting for 60 Minutes in New York City. (Nine)\n\nCo-hosting Queen Elizabeth's funeral with Tracy Grimshaw would remain one of his biggest stories.\n\n\"We were on air for 12 or 13 hours non-stop ad libbing,\" he recalled.\n\n\"We had massive technical challenges, and we couldn't see anything or hear anything, and we still had to keep pedalling hard, but we did it, and I think Trace and I were both really proud of that.\"﻿\n\nOverton still begins each day ﻿listening to the radio, driven by the adrenaline and challenges that come with the job.\n\n\"﻿You're not always going to get it right in those environments,\" he admitted.\n\n\"But you give it your best, you do it authentically, and you do it as a team.\"\n\nPeter Overton at the 65th Logies Awards on August 3. (Getty Images for TV WEEK Logies)\n\nDespite his recent scare with melanoma and a polyp, Overton said he is not ready to part with the job he loves or the success so soon.\n\n\"I've got a few more years left,\" he said.\n\n\"Fifteen years as the dominant number one in the Sydney market is a real tribute to the people I work alongside, and we don't take anything for granted.\n\n\"I treat every night as opening night. That's what we do, all of us, and it's paying a lovely dividend for us all.\" ﻿\n\nWhen Overton finally goes home for the day, he said he is \"just dad\" to his two girls. ﻿\n\n\"It's really nice. They're not blindsided or impressed,\" he said. ﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/sol-natural-foods-darra-board-has-free-coffee-and-meals-to-claim/f05d646e-5ad3-4e36-a0f1-3b4488ef82a8",
    "title": "'There's no criteria': The cafe offering free coffee and meals to struggling customers",
    "publish_date": "Fri, 29 Aug 2025 21:06:31 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "At a bustling cafe in Brisbane's south-west, anyone having a bad day can walk out with a free coffee or meal. ﻿\n\nJess and Soffie Cutler have been the proud owners of Sol Natural Foods in Darra for the past eight years.\n\nIn recent years, they began noticing their customers were increasingly struggling, both financially and mentally.\n\nREAD MORE: ﻿ More than half of employers approached by staff about right to disconnect\n\nJess and Soffie Cutler a pay it forward board up in their cafe. (Supplied)\n\n\"We got a lot of support for our business, but we also felt like we were a pretty big pillar in the community, so we just wanted to provide something that would help support the community that supported us,\" Jess said.\n\nThe couple decided to introduce a \"pay it forward\" board in their cafe, which was put together by a regular customer.\n\nThe board is pinned with receipts for drinks or meals paid in advance by customers wanting to pay it forward.﻿\n\nSomeone in need can claim a receipt.\n\nJess said the board was not just for those doing it incredibly tough, but for anyone who may be having a bad day.\n\n\"It's not necessarily for people who are struggling financially. They don't have to be homeless,\" she said.\n\n\"There's no criteria. You could just be having a rough day. People come in, and we can tell they're visibly upset.\n\nREAD MORE: ﻿ Popular video app slapped with formal warning over child grooming concerns\n\nJess and Soffie Cutler are the proud owners of Sol Natural Foods in Darra. (Supplied)\n\n\"We also have a lot of people who want to give, in some way, back to the community, so it provides that to them, as well as supporting people in the community that need to just have a coffee, something normal to make them feel good for the﻿ day.\"\n\nCurrently, the ﻿cafe has about 15 receipts up for coffees, meals and cakes.\n\nJess said ﻿she has always wanted the cafe to feel like an extended family for her staff and customers.\n\n\"I think social connection is really important for mental health and just feeling connected and part of something bigger﻿,\" she said.\n\n\"You don't realise how much of an impact you make being someone's barista every day, but we've made a lot of friends﻿.\n\n\"This, to us, has never just been a cafe.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/best-rewards-programs-australia-flybuys-everyday-rewards-myer-priceline-david-jones-dan-murphys/b1a72a1c-d961-44eb-982f-0089e229e2ec",
    "title": "Australia's best rewards programs have been revealed",
    "publish_date": "Fri, 29 Aug 2025 10:07:03 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "The best ranked rewards programs in Australia have been revealed and Flybuys took out the top spot for the third year running.\n\nBut if you were hoping to learn how the airline loyalty programs ranked﻿, you might be disappointed.\n\nCanstar Blue surveyed more than 2700 Australians for its 2025 Most Satisfied Customer Award for Rewards Programs, which ranked rewards programs on overall satisfaction, value, rewards, ease of redemption, accessibility/partners, ﻿website/app experience and ease of sign up.﻿\n\nFlybuys took out the top spot for the third year running. (Getty)\n\nFlybuys placed first, earning five-star ratings across every single category.\n\nMembers can earn points at Coles, Kmart, Bunnings Warehouse, Liquorland, and Officeworks﻿, so it's a popular choice among many Australians.\n\nEveryday Rewards was a close second with four-star ratings in every category except for 'ease of redemption', where it scored five stars.\n\nPriceline's ﻿Sister Club came in at third place, with solid four-star rankings for 'accessibility/partners' and 'ease of sign up﻿'.\n\nDan Murphy's, Myer One and David Jones Rewards all scored a total of 21 stars across the seven categories.\n\n2025 Canstar Blue Most Satisfied Customer Awards - Rewards Programs. Overall satisfaction is an individual rating and not a combined total of all ratings. (CanstarBlue.com.au)\n\nIf you're wondering how Qantas' Frequent Flyer or Virgin's Velocity programs ranked, you won't find it here.﻿\n\nThe ﻿2025 Most Satisfied Customer Award for Rewards Programs specifically focused on programs in a retail setting and accessible through everyday shopping.\n\nWhile some programs that were ranked, including Flybuys and Everyday Rewards, are associated with airline partners, those airline programs themselves weren't ranked.﻿\n\n\"The Canstar Blue Most Satisfied Customer Award for Rewards Programs is specifically focused on programs that offer the opportunity to earn points and rewards through regular grocery, food, and retail shopping,\" CanstarBlue.com.au spokesperson Eden Radford told 9news.\n\n\"Separate from frequent flyer programs, this Award is about identifying the memberships that can help Australians get ahead on their everyday shopping, maximise their budget, and earn the rewards they deserve.\"\n\nAirline rewards programs weren't included in the research. (Getty)\n\nCanstar's Blue's research did reveal that Australians are relying on rewards programs to help ease financial strain﻿ in the cost of living crisis.\n\nNearly half ﻿of reward program participants reported that using points to buy products helped reduce financial stress.\n\nA further 39 per cent said they specifically shop sales or buy certain products that offer additional rewards points (which can be spent later).\n\nBut some shoppers don't actually know what they're signing up for.\n\nAccording to the survey, more more than eight in 10 ﻿reward program participants don't actually read the terms and conditions of the programs they join.\n\nTo get the most out of rewards programs, Aussies are encouraged to read the full terms and conditions and add rewards cards to a digital wallet to avoid missing out on points.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/snoop-dogg-sydney-shows-tickets-what-to-know-afl-grand-final-music-news/6b70d054-2e2e-4184-86b7-2ba2b54117b0",
    "title": "Snoop Dogg to play show in Sydney hours after AFL Grand Final performance",
    "publish_date": "Fri, 29 Aug 2025 02:44:03 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": "Snoop Dogg will be performing at a series of Sydney venues in the aftermath of his AFL Grand Final appearance.\n\nImmediately after his gig at the MCG he is set to board a plane to Sydney for a gig in the Hills District.\n\nThe night of September 27, which is the day of the AFL Grand Final, he will do a one-hour DJ set at Bella Live in Bella Vista.\n\nSnoop Dogg is set to perform at the AFL Grand Final. (Evan Agostini/Invision/AP)\n\n\"This is your chance to see the global icon up close — in The Hills,\" an Instagram post from the website read.\n\nTickets go on sale on Tuesday at 10am.\n\nThe rapper will then perform a DJ set at the Greenwood Hotel in North Sydney on Sunday night.\n\nPre-sales for the event don't begin until 6pm the day before, with the price not yet revealed.\n\nIt comes as he comes under fire for his homophobic remarks in both his music and a recent podcast.\n\nGreens Senator Sarah Hanson-Young called for Snoop's AFL performance to be cancelled.\n\n\"Why is it that the AFL is bringing in an international artist — a slur merchant — paying them $2 million, rather than backing Aussie talent?\" she said.\n\n\"The AFL has decided for the grand final, rather than putting on an Australian artist, they're going to pay Snoop Dogg $2 million to play at the Grand Final.\"\n\nThe AFL has been criticised for the hypocrisy of booking the rapper at the same time it suspended a star player over an on-field homophobic slur.\n\nCrows forward Izak Rankine was suspended for four games, costing the star a role in a likely finals run for Adelaide.\n\nSnoop Dogg is performing a series of Sydney DJ sets. (Getty Images for NBC Universal)",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/mosaic-brands-former-retailer-told-to-pay-25m-in-fines-for-breaching-consumer-laws/2d2d947a-9ef8-4631-90aa-4c7ca913ec7e",
    "title": "Recently-liquidated major retailer fined $25m for breaching consumer laws",
    "publish_date": "Fri, 29 Aug 2025 00:44:40 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Recently-liquidated fashion retailer Mosaic Brands has been ordered to pay $25 million in fines by the Federal Court for breaching multiple consumer laws.\n\nMosaic Brands owned ﻿several well-known Australian brands, including Noni B, Rivers , Katies, Rockmans, Millers, Autograph, Beme, Crossroads and W Lane.\n\nThe Federal Court found all nine brands failed to deliver over 739,114 items to customers within the delivery times listed on its website, or within a reasonable amount of time afterwards.\n\nREAD MORE: Police descend on home in Porepunkah amid search for alleged cop killer\n\nMosaic Brands, owned ﻿several well-known Australian brands, including Noni B, Rivers, Katies, Rockmans, Millers, Autograph, Beme, Crossroads and W Lane. (Supplied)\n\nMore than 4300 items were never delivered at all.\n\n﻿The Australian Competition and Consumer Commission said the retailer was \"found to have wrongfully accepted payment from consumers and engaged in misleading or deceptive conduct.\"\n\nACCC Deputy Chair Catriona Lowe said the delays were \"unacceptable\" with a quarter of total goods ordered from the brand affected.\n\n\"Our investigation revealed that more than half of the items in question were dispatched from Mosaic Brands' warehouses 30 or more days after the order date, and about one-third were dispatched 40 or more days after the order date,\" she said.\n\n\"One person who reported to us experienced the dual disappointment of never receiving the goods they'd paid for and then having to wait six months for a refund.\"\n\nMore than 4300 items were never delivered at all. (Nine)\n\nThe court found the delays took place over a six-month period.\n\nMosaic Brands was also found to have breached another consumer law with its returns policy.\n\nIn a 13-month period between 2021 and 2022, eight of the brand's websites said that consumers were only eligible ﻿for a refund of a faulty item if it had been returned within six months of the purchase date.\n\nThe ACCC says that under consumer laws, refunds for faulty items do not have a set limit, it applies for a \"reasonable time\", which is dependent on the price and quality of the item.\n\nREAD MORE: The twisted messages posted by church mass shooter\n\nMosaic Brands was also found to have breached another consumer law with its returns policy. (Nine)\n\nThe brand was fined $25.05 million.\n\nMosaic Brands went into ﻿voluntary administration in October 2024 before entering complete liquidation in July 2025.\n\nIn May 2021 and September 2022, Mosaic Brands had already acquired $896,000 in infringement notices, including for misrepresentations on its websites about refunds for faulty goods .\n\nAt the brand's peak, they had ﻿800 retail stores across Australia and 7.8 million online customers.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-30/aussie-qualifier-priscilla-hon-bows-out-of-us-open/105715848",
    "title": "Aussie qualifier Priscilla Hon bows out of US Open",
    "publish_date": "Sat, 30 Aug 2025 00:44:02 +0000",
    "category": "sports",
    "authors": [],
    "text": "Priscilla Hon's US Open odyssey is over following a fighting straight-sets third-round loss to American Ann Li.\n\nThe Australian qualifier battled hard before succumbing 7-5, 6-3 at Flushing Meadows on Friday, local time.\n\nHon had reached the last 32 of a grand slam for the first time after winning three qualifying matches just to make the main draw in New York.\n\nHer rewards for adding the prized scalps of Russian world number 20 Liudmila Samsonova and higher-ranked Frenchwoman Leolia Jeanjean are a rise to a career-best number 106 and a life-changing $US237,000 ($363,000) payday.\n\nThe 26-year-old would have been dreaming for more after rallying back from 3-0 and 5-2 down to level the opening set at 5-5 against Li.\n\nBut, spurred on by the home support, Li raised her game to take the set, then reel off three straight games to clinch the match in one hour and 45 minutes.\n\nThe key moment came in the fifth game of the second set, where both players played through errors and frustration and a string of deuces, with Hon failing to take advantage of a number of break points before Li held serve after 12 minutes to lead 3-2.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nThe American then broke and held again to get to 5-2. Hon staved off defeat with one more hold, before Li served out the match.\n\nHon's departure leaves 15th seed Daria Kasatkina as the last Australian standing in the women's singles draw.\n\nKasatkina plays two-time Open champion and former world number one Naomi Osaka on Sunday AEST for a place in the last 16.\n\nWorld number eight Alex de Minaur is the lone Australian left in the men's singles.\n\nHe faces German Daniel Altmaier in the fourth round on Sunday AEST.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-30/jakara-anthony-has-mt-buller-ski-run-renamed-in-her-honour/105715766",
    "title": "From Chamois to Jakara: Aussie Winter Olympic champion has Mt Buller ski run renamed in her honour",
    "publish_date": "Sat, 30 Aug 2025 00:24:07 +0000",
    "category": "sports",
    "authors": [],
    "text": "Reigning Winter Olympic moguls champion Jakara Anthony has had a ski run at Mt Buller named after her in tribute to her success on the world stage.\n\nThe 27-year-old learned to ski in Mt Buller's Bunyips program as a preschooler, before joining the Team Buller Riders' moguls program at 11 years old. Her parents also first met on the mountain while they were both working there one winter season.\n\nAt the 2022 Beijing Games, Anthony became Australia's sixth Winter Olympic champion, taking gold in the women's moguls.\n\nShe's been training back home in Australia this winter in preparation for her third Olympic campaign, with the Milano Cortina Winter Games in Italy's Dolomites region now under six months away.\n\nLoading Instagram content\n\nAnthony is aiming to become the first Australian to defend an Olympic title, with none of Australia's previous gold medallists able to achieve the feat a second time around.\n\nShe's also doubled her chances of a win by entering the new dual moguls competition, which is being contested at a Winter Olympic Games for the first time.\n\nThe ski run at Mt Buller, previously known as \"Chamois\", features the resort's dedicated Olympic-level freestyle skiing area, and is once again hosting the annual Mogul Challenge this Saturday night.\n\nAnthony is the headline act at the event, which returns after a two-year hiatus due to poor snowfall in the 2023/2024 seasons.\n\nThe renaming of the Chamois run sees Anthony join Winter Olympic aerial skiing champions Alisa Camplin and Lydia Lassila, as well as 1999 women's aerial skiing world champion Jacqui Cooper, in having locations on the mountain bearing their names.\n\nThe Alisa Camplin Freestyle Centre, Lydia Lassila chairlift, and Jacqui Cooper jump site are all located at the resort.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-30/raspberry-goldfields-cookie-pie-takes-ballarat-by-storm/105690514",
    "title": "Cookie pie takes Ballarat by storm with queues to prove it",
    "publish_date": "Fri, 29 Aug 2025 23:48:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's 6 degrees Celsius on a Sunday morning, and there's a queue in front of Ballarat cafe Naomi and I.\n\nThis Melbourne-like behaviour is uncommon in regional Victoria, but a viral pie has taken sweet tooths by storm.\n\nErika Browne is the baker behind the raspberry goldfields cookie pie, which won the 2025 Ballarat Best Pie competition.\n\n\"I decided to enter the pie competition ... not thinking that there was even the slightest chance of winning it,\" Ms Browne says.\n\n\"After I won, it's been crazy, it's been madness. I can't even believe it.\"\n\nShe makes her baked goods under the name Mrs Browne Bakes in her council-approved home kitchen and sells them through local cafe Naomi and I and at farmers' markets.\n\nErika Browne's raspberry goldfields cookie pie won Ballarat's 2025 best pie. (ABC News: Charlotte Wilkes)\n\nThe pies get restocked twice a day at the cafe and always sell out.\n\n\"Yesterday, I delivered about 250 and they sold the lot in less than an hour,\" Ms Browne says.\n\nSocial media has enticed people from Melbourne, Geelong and Bendigo to try the award-winning pie, and Ms Browne has even had to post online to tell customers she cannot sell them from her home or her car.\n\n\"When my workers deliver to Naomi and I, sometimes people will park beside them and try and buy cookies directly from the car boot,\" she says.\n\nIt's quite the success story for Ms Browne, who moved with her family to Ballarat from the Philippines in 2006.\n\n\"I was 17 at the time and I didn't know how to cook or bake,\" she says.\n\nThat changed when she tried one of her aunt's sticky date puddings that Christmas.\n\nShe opened Mrs Browne Bakes in 2016, using her degree in food science and nutrition, and did not let getting rejected by another cafe stop her from following her food dream.\n\nMrs Browne's raspberry goldfields cookie pies are restocked twice a day. (ABC News: Charlotte Wilkes )\n\n\"I'm a food scientist and I love experimenting with different flavours,\" she says.\n\n\"I like getting ideas from different cuisines and also, coming from the Philippines, I also like introducing Filipino flavours to Ballarat.\"\n\nThere are no Filipino flavours in the cookie pie though.\n\nIt is predominantly local ingredients, including Sovereign Hill raspberry drops and a sprinkle of gold to \"tell a story about Ballarat as a gold town\".\n\nOh, and lots of chocolate.\n\nThe sweet treats sell out every day, despite a limit of two cookie pies per person. (ABC News: Charlotte Wilkes)\n\nFOMO food culture\n\nWhile the culture of queuing for food is new to regional Victoria, it is a trend well known to Melbourne-based \"foodie content creator\" Ailene Wu.\n\n\"When I see something going viral, I'm like: 'Oh my God, I want to try it because everyone's talking about it',\" Ms Wu says.\n\n\"[Queuing] has almost become part of the experience because there's a social media trend, and then people get FOMO [fear of missing out] when they see that long line, and they instinctively want to know more about it.\n\n\" Social media has changed the food scene completely forever and it's going to continue to. \"\n\nAilene Wu has more than 370,000 followers on TikTok. (Supplied: Jordan Drysdale)\n\nAccording to Ms Wu, who has hundreds of thousands of foodie followers on TikTok, consumers want to feel a personal connection with businesses.\n\n\"There's more of a drive for … content [that focuses] on the employees or the story behind the businesses, which I think really links well with the whole cookie pie that came out from Ballarat,\" she says.\n\n\"I have seen [Mrs Browne Bakes] all over my social media, and it was such a great story.\n\n\"The fact that she got rejected by the first business that she wanted to sell her cookies from [is great].\n\n\" [There's] also that perfect mix of a little bit of controversy as well because some people are like, 'That's not a pie!' \"\n\nViral pie\n\nMs Browne has sold more than 4,000 of her cookie pies in three weeks, and Fraser Wyley, owner of Naomi and I, has never seen anything like it.\n\n\"We have had the biggest queues waiting for this beautiful pie every single day, and it is selling out in sometimes 20 minutes,\" Mr Wyley says.\n\n\"There can be anywhere from 50 to 60 people [in line] at any given time.\n\n\" I don't think anyone was expecting it — it's beautiful and amazing. \"\n\nStream now on ABC iview Photo shows 5 women looking concerned in front of a beach with Family Next Door and iview logo. The enigmatic Isabelle arrives in the quiet seaside cul-de-sac of Pleasant Court — and suspicions quickly rise. Stream all episodes now on ABC iview.\n\nBallarat local Kylie Moxon was lucky enough to get her hands on some pies before they sold out.\n\n\"I'm delivering the pies today to my friend in Torquay,\" Ms Moxon says.\n\n\"I missed out a couple of days this week, but I finally got them today, so it's going to be a big surprise.\"\n\nSome were not so lucky.\n\nPie-less Jake Weightman has tried to get hold of a pie on four separate occasions.\n\n\"I've seen some very long lines, but I can't wait that long. I have to get to work,\" Mr Weightman says.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-30/delays-to-content-quotas-for-streaming-services-hurting-industry/105680966",
    "title": "'Destroying aspirations': Filmmakers still waiting on content quotas",
    "publish_date": "Fri, 29 Aug 2025 22:25:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "From Kath and Kim and Dance Academy, to the latest sensation Bluey, Australia's film and television industry has delivered hit shows and movies.\n\nBut the filmmakers behind them say more needs to be done to increase production of Australian content.\n\nContent quotas, which require media platforms to create and include a certain amount of locally-made material, have long applied to free-to-air broadcasters, but changes made during the COVID pandemic allowed networks to prioritise genres that are cheaper to produce, like sport and reality TV.\n\nThat has come at the expense of creative genres, like children's programs, drama and documentaries.\n\nFilmmakers had hoped the federal government's plans to introduce content quotas for streaming services would help revitalise the industry, but they say delays and concerns the reforms will not go ahead are hurting the sector.\n\nHaving content quotas would force streaming services to invest in the creation of a certain amount of Australian content. (ABC News: Ebony ten Broeke)\n\nProducer says quotas could lead to 'bigger industry than we had before'\n\nThe executive producer and director of Tasmanian animation business Blue Rocket, David Gurney, said the changes made to local content quotas for free-to-air broadcasters had been \"tragic\".\n\n\"The permanent staff got laid off, all the actors [and] the other contractors who worked for the company — we weren't able to employ them anymore.\n\n\"And the studio had to physically close down as well.\n\n\" [There were] people saving up to buy a house who then couldn't. \"\n\nDavid Gurney says the changes made to content quotas for free-to-air broadcasters had been \"tragic\". (ABC News: Ebony ten Broeke)\n\nBut Mr Gurney said Australian content regulation for streaming services would \"transform the industry significantly\" and could make up for the changes in requirements for free-to-air broadcasters.\n\n\"If it was implemented properly … [it] could actually give us an even bigger industry than we had before,\" he said.\n\nA report from the Australian Communications and Media Authority (ACMA) found a 98 per cent decrease in commercial network spend on children's drama between 2018-19 and 2023-24.\n\nKath & Kim became an Australian hit TV show. (Supplied)\n\nOther genres have also declined, with the spend on adult drama almost 50 per cent less than it was in 2018-19.\n\n\"This was sustainable business that employed a lot of people, and now it's very difficult to find a way forward without having consistent productions.\" Mr Gurney said.\n\n\"All the educational institutions that are training people up to do these jobs, they're now training them up for phantom jobs that don't exist.\n\n\"It is destroying people's aspirations and their careers\".\n\nDavid Gurney says content quotas for streaming services would \"transform\" the Australian screen industry. (ABC News: Ebony ten Broeke)\n\nWaiting on the government to call, 'action!'\n\nIn 2023, Arts Minister Tony Burke said he intended to bring in local content quotas for streaming platforms from July 2024.\n\nAustralian content rules for streaming giants put on ice Photo shows A smart tv with various streaming app logos on display. The federal government has quietly delayed plans to introduce local content requirements for major streaming platforms, with no indication of when it might return to work on the policy.\n\nThe quotas would require platforms like Netflix and Disney+ to invest in the creation of Australian films and television programs.\n\nBut the legislation has been shelved.\n\nMr Burke told the ABC the regulation was still needed, but did not provide any update on timelines or reasons for the delay.\n\nIt is understood Australia's free trade agreement with the United States has been a stumbling block.\n\nBluey is one of Australia's screen success stories. (Supplied: ABC)\n\n\"I've been arguing for this reform since 2013,\" Mr Burke said.\n\n\"It's taking longer than I wanted but I know we need this to ensure our stories are always on our screens.\"\n\nThe ABC contacted Disney+, Binge, Netflix and Stan to ask whether they supported the introduction of Australian local content quotas on their streaming service. Only Netflix responded.\n\n\"Netflix doesn't oppose regulation. We are on the ground and investing heavily because our members value great local storytelling, and we are committed to making quality Australian content that our members will love,\" a spokesperson said.\n\nNetflix says it doesn't oppose regulation. ( Unsplash: Jonas Leupe)\n\nSurvey shows filmmakers significantly affected by delays\n\nA recent member survey from Screen Producers Australia found that 79 per cent of its members believed their business had been directly affected by the lack of regulation.\n\nWhen asked if they felt more or less optimistic about the future of the screen industry compared with a year ago, 81.2 per cent said they felt less optimistic.\n\nMatthew Deaner says not having a regulatory framework sets \"our people on edge\". (Supplied: Screen Producers Australia)\n\nScreen Producers Australia chief executive Matthew Deaner said the impacts felt by the industry were \"a significant concern\".\n\nMr Deaner said the film industry was already an industry that could be uncertain.\n\n\"But that overall hanging problem of no regulatory framework sets … our people on edge because it says that we don't know whether [we] will have a full industry for Australian content in the future.\"\n\nSara Ellis Holland says the introduction of content quotas for streaming services would provide opportunities for creative people. (ABC News: Ebony ten Broeke)\n\nActor and acting teacher Sara Ellis Holland said content quotas for streaming platforms would enable a \"revitalisation\" for the film and television industry.\n\n\"There are so many people working in other jobs where they're not utilising [their creative] skills … and wouldn't it be great to see what will blossom when we're all put to work,\" she said.\n\nMr Gurney said the delays meant some companies had already \"packed up and given up\".\n\nMatthew Deaner said the \"longer we delay, the harder it will be to get our industry back on track\".",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-30/abc-quote-quiz-aug-30/105711052",
    "title": "ABC Quote Quiz: A show-off dinosaur, a chocolate ghosting and a record store singalong",
    "publish_date": "Fri, 29 Aug 2025 22:06:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "A lot of people gave us a lot of quotes this week. See if you can figure out who said what, and what they were talking about.\n\nLoading",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-30/tourette-syndrome-advocates-plead-for-change/105652210",
    "title": "'Loudest in the room ... yet still invisible': Tourette syndrome advocates plead for change",
    "publish_date": "Fri, 29 Aug 2025 22:03:26 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Jazmin Edson was sitting in her year 12 English class in February 2021 when she started to experience her first tic attack.\n\nWARNING: This article contains sensitive content and may be distressing for some readers.\n\nUnsure of what was happening, the 17-year-old fled to a nearby bathroom and began recording her experience.\n\nLoading...\n\nThe attack lasted four hours.\n\n\"In that moment I had no idea what I was doing, what I was saying, how I was moving or what was going on,\" Ms Edson said.\n\n\"You think you have so much control over your body, but you don't.\n\n\"It was a really scary experience for me.\"\n\nJazmin Edson's family still struggle to watch the video captured in 2021 of her first tic attack. (ABC Riverland: Amelia Walters)\n\nMs Edson was living in rural Queensland at the time, and finding answers proved difficult.\n\n\"There were lots of telehealth appointments and travel to figure out what was wrong … regional doctors didn't quite know how to help me,\" she said.\n\nMore than a year later, Ms Edson was diagnosed with Tourette syndrome — a neurological condition where people experience repetitive and involuntary movements and vocalisations, commonly known as \"tics\".\n\nWhile the diagnosis provided some relief to the teenager, it was also met with a significant amount of grief.\n\nThe psychiatrist Jazmin Edson was seeing at the time specialised in tic disorders, fast-tracking her diagnosis (ABC Riverland: Amelia Walters)\n\n\"At 17 you're thinking about finishing school, going to uni and maybe travelling, so to have those experiences taken away from me by this condition was really upsetting,\" she said.\n\nMs Edson's school experience spiralled, with many of her friends thinking she was faking her tics for attention.\n\n\"I think it was hard [for them] to come to terms with the fact that someone they had known for five years could have such a significant change in their behaviour and it be legit.\"\n\nMs Edson's family ended up moving to South Australia's Riverland region later that year, and she completed year 12.\n\nBut the experience left the now 21-year-old with deep scars.\n\n'Significantly high' suicide rate\n\nThe first Australian survey, which captured the perspectives of those living with Tourette syndrome, was released in June this year.\n\nThe Impact for Tourette's report found one in four adults and one in 10 children with the condition had attempted suicide.\n\nThe report found more than 80 per cent of people with Tourette syndrome experience daily tics causing physical and emotional pain. (ABC Riverland: Amelia Walters)\n\nIf you or anyone you know needs help: Suicide Call Back Service on 1300 659 467\n\nLifeline on 13 11 14\n\nKids Helpline on 1800 551 800\n\nBeyond Blue on 1300 224 636\n\nAboriginal & Torres Strait Islander crisis support line 13YARN on 13 92 76\n\nThese findings, however, did not come as a surprise to many in the Tourette community.\n\n\"That being the statistic of one in four adults doesn't surprise me and I think more people need to know it doesn't surprise the rest of us,\" Ms Edson said.\n\nRiverland Youth Theatre artistic director Sam Wannan was diagnosed with Tourette syndrome at 25.\n\nSam Wannan experiences coprolalia, an involuntary utterance of swearing or obscene words. (ABC Riverland: Amelia Walters)\n\nHe was not able to deliver some of his arts programs in South Australian public schools due to his tics.\n\n\"I made a couple of calls to the education department and told them I had swearing tics … the response I got was 'well swearing at children goes against our policies, so we will have to say no',\" he said.\n\nSam Wannan says he feels lucky he didn't have to deal with having Tourette syndrome in school due to the social stigma. (ABC Riverland: Amelia Walters)\n\nMr Wannan said systemic social stigma was a contributing factor to the report's findings.\n\n\"Those [statistics] aren't symptoms of Tourette's, they are symptoms of society treating Tourette's wrongly,\" he said.\n\n\"Even the prime minister made a comment last year about Tourette's in parliament … it shouldn't be seen of as this cartoonish thing that it's often portrayed as,\" Mr Wannan said.\n\nLoading...\n\nWhile Prime Minister Anthony Albanese immediately withdrew the comment and formally apologised, Mr Wannan said it highlighted the broader need for education in Australia.\n\n\"People deal with these conditions from young and they shouldn't have to wait until they're older for their peers to understand what's going on,\" he said.\n\nNDIS shortfalls\n\nTourette syndrome is not listed as a disability \"likely\" to meet requirements under the National Disability Insurance Scheme (NDIS).\n\nA National Disability Insurance Agency (NDIA) spokesperson said eligibility for the NDIS is based on \"the extent to which a condition impacts daily functioning\".\n\n\"Individuals with severe Tourette syndrome who experience significant difficulties with everyday tasks such as communication, learning, self-care, or mobility may meet the eligibility requirements,\" the spokesperson said in a statement.\n\nTourette Syndrome Association Australia (TSAA) national education advisor, Conor Maysey said the NDIA's comments were \"disingenuous\".\n\nConor Maysey says the fact people with tourette's don't qualify for NDIS support is \"ridiculous\". (ABC Riverland: Amelia Walters)\n\n\"You could replace the word Tourette's [in that statement] with anything,\" he said.\n\n\"People with that [criteria] are actively getting turned away, so it's one thing for them to say, but it's a very different thing for them to act upon that.\n\n\" We are the loudest people in the room yet somehow we are still invisible. \"\n\nTourette syndrome is considered a genetic condition according to government-funded national health advice service Health Direct.\n\nOne of the eligibility considerations under the NDIS is a \"genetic condition that consistently results in permanent and severe intellectual and physical impairments\".\n\nMr Maysey said the number of \"horror stories\" he'd heard from those with lived experience trying to get NDIS funding highlighted how much reform is needed.\n\n\"We had a family that literally sold their house in order to go to court to get their child NDIS funding for Tourette's,\" he said.\n\n\"There are so many things that are covered by the NDIS and we are not getting any of it.\"\n\nConor Maysey says SA is the first state to respond to the impact report. (ABC Riverland: Amelia Walters)\n\nSA government 'coming to the table'\n\nMore than 20 TSAA members travelled to South Australia's Parliament House last Thursday to discuss what actionable change could look like.\n\nMr Maysey said SA was the first government to meet with the association since the Impact for Tourette's report was handed down in June.\n\n\"[They are the first to] meet us where we stand and listen to what we're saying rather than just brushing us off,\" Mr Maysey said.\n\nNat Cook and the TSAA delivered a presentation to multiple disability stakeholders and government ministers. (ABC Riverland: Amelia Walters)\n\nMinister for Human Services, Nat Cook, said raising awareness about the condition would go \"a long way\" to increasing better life outcomes.\n\n\"I have asked our department to help host a conversation that might include public awareness and how we do that together, so I think that is the next step,\" she said.\n\n\" Whatever I can do to help the community understand [Tourette's] more … then I'm sure we can make inroads into that terrible statistic around suicide. \"\n\nA happier and more inclusive future\n\nJazmin Edson hopes she and others living with Tourette syndrome can one day live in a society that accepts and understands the condition and its complexities.\n\n\"Tourette's is not a mental illness; it's a neurological condition. It's a disability, it's disabling and debilitating,\" she said.\n\nJazmin Edson wants to see a more compassionate Australia. (ABC Riverland: Amelia Walters)\n\n\"Absolutely there are times where we can laugh together but [right now] there is too much laughing at us.\n\n\"I would love for people to give those with Tourette's the same compassion and consideration they give people with other disabilities\".",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-30/melbourne-lawyer-dean-hadjina-guilty-of-stealing-from-widow/105712266",
    "title": "'Pitiful' Melbourne lawyer caught stealing from grieving widow",
    "publish_date": "Fri, 29 Aug 2025 21:44:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Last Tuesday, Melbourne lawyer Dean Hadjina had an uncomfortable phone call with his wife.\n\nHe told her he was heading to court — and might not be coming home for a very long time.\n\nFaced with the prospect of being sent to jail that afternoon, Hadjina finally came clean and revealed a secret he had been hiding for years.\n\nThe suburban lawyer had been caught ripping off a grieving widow to the tune of $482,154. His scheme included an elaborate cover story filled with grandiose promises, fake court cases and fabricated legal documents.\n\nAfter pleading guilty to theft and gaining financial advantage by deception, Supreme Court Justice Rita Incerti said it was \"inevitable\" Hadjina would be jailed.\n\nHadjina cried at the back of the courtroom, clutching a black bag of his belongings, as his lawyer asked for the prison term to be delayed.\n\nThis was so he could be assessed by a psychologist and properly farewell his loved ones, barrister James Anderson said.\n\n\"Mr Hadjina disclosed to his wife for the first time this morning the circumstances in which he is in,\" Mr Anderson said on Tuesday.\n\n\"There is certainly a pitiful element to that, and both my instructor and I were present for the phone call.\n\n\" He hasn't said any of the goodbyes he ought to have said to his family; to his children, his wife, his parents. \"\n\nDespite prosecutors' requests for Hadjina to be taken into custody immediately, Justice Incerti agreed to continue his bail for another three weeks.\n\nShe urged him to \"assist your lawyers in presenting your case\".\n\n\"This has gone on long enough. I will not be extending the time any further,\" she said.\n\nLawyer tricked victim, promising multi-million-dollar payout\n\nThe Supreme Court was told Hadjina took advantage of the vulnerable widow as she sought compensation payouts after her husband's death.\n\nThe woman's husband was standing on the side of a Melbourne freeway in 2018 when he was hit by a crane, in an incident that eventually resulted in the crane driver being acquitted in court.\n\nHadjina, the director of his law firm Dean's of Law, began representing the dead man's wife.\n\nThe Supreme Court was told Hadjina took advantage of the vulnerable widow as she sought compensation payouts after her husband's death. (ABC News: Karen Percy)\n\nCrown prosecutor Kathryn Hammill said the woman spoke little English and only had a year 7 level of education.\n\n\"She had no prior involvement with lawyers and did not know what a lawyer was before she met the offender,\" Ms Hammill said.\n\nHadjina pocketed $144,060 from the widow's initial insurance payout of $644,095.\n\nOver the next two years, he persuaded her to pay $338,093 in supposed \"legal fees\", claiming he was working towards securing more compensation.\n\n\"He simply took and kept the entirety of those funds for his own purposes,\" Ms Hammill said.\n\nIn 2021, Hadjina created false Supreme Court documents that said the woman would be awarded $17.25 million, the court heard.\n\nWhen the money did not come, the victim and her interpreter confronted Hadjina after contacting the courts and an insurance company that was making weekly pension payments.\n\nMs Hammill said that instead of owning up, Hadjina doubled down on his lies to the woman and demanded an apology.\n\n\"I can't do more than promise and as a good Christian and lawyer, I do not lie ever,\" he wrote in a message.\n\nLawyer's fraud uncovered\n\nA formal complaint was made about Hadjina to the Victorian Legal Services Board (VLSB), which investigated and uncovered the deception.\n\nThe board found Hadjina only completed $583 worth of genuine legal work for the victim.\n\nThe VLSB paid $481,605 and interest back to the woman, drawing from its fidelity fund — a pool of money set aside for victims of fraud committed by legal professionals.\n\nIn October 2021, the legal regulator banned Hadjina, declaring he was not \"a fit and proper person\" to hold a practising certificate.\n\nHe was referred to police in late 2023, and charged the following year.\n\nDetails about why Hadjina stole from his client — or what he spent the money on — were not outlined during Tuesday's hearing.\n\nHis barrister said a psychiatrist compiled a report that said the 47-year-old had \"ceased gambling\".\n\n\"He has had his head in the sand,\" defence barrister James Anderson said.\n\nThe case was adjourned until September 17.\n\nHadjina made no comment outside court.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-30/historic-nelson-regatta-returns-australia-day-2026-vic-tourism/105689180",
    "title": "Can this historic regatta coax tourists back to struggling river town?",
    "publish_date": "Fri, 29 Aug 2025 21:22:37 +0000",
    "category": "sports",
    "authors": [],
    "text": "From the 1880s to the 1970s, people flocked to the Nelson Regatta from across south-east South Australia and south-west Victoria.\n\nNow, a group of friends in Nelson plans to revive the event along the Glenelg River in 2026 as a way to attract more visitors to the small border town, which has struggled over the past five years.\n\n\"The regatta is an opportunity for me to, like my grandparents did, give back to Nelson,\" Eathan Whitehead, one of the organisers, said.\n\n\"I long for the place that I visited as a child that was full of ice creams and fishing off every deck in the summer.\n\n\"I don't see that as much anymore, especially with our kiosk closing.\"\n\nJim Millard and Eathan Whitehead on the banks of the Glenelg River, where the event will be held. (ABC South East SA: Eugene Boisvert)\n\nThe historic Nelson Kiosk — the town's general store and cafe — closed last August amid ongoing maintenance issues and was demolished in May.\n\nSitting on the coast, just east of the SA–Victoria border, Nelson was also badly affected by COVID-19 restrictions on tourism venues and border crossings during the pandemic.\n\nThe nearby Princess Margaret Rose Cave has been closed to tourists since 2021, while the Piccaninnie Ponds shut to divers in 2023.\n\nSpeedboats on the Glenelg River at Nelson as part of an event possibly in the 1960s. (Supplied: Nigel Telford)\n\nLong history of river event\n\nThe first Nelson Regatta appears to have been held on New Year's Day in 1886, with rowing races the main focus.\n\nIt was later moved to the end of January and became known as the Nelson Australia Day Aquatic Carnival.\n\nAs well as rowing, swimming, speedboat and beauty contests, there was a parade, music and demonstrations, such as high-diving from the Glenelg River bridge.\n\nCompetitors in a \"Bathing Beauties\" competition held as part of the Nelson Regatta in 1950. (Supplied: Vern McCallum Collection)\n\nJim Millard's family moved to Nelson in 1962 and he remembered the \"massive big party\" the event was, when water-skiers stood on each other's shoulders in a pyramid formation\n\n\"I couldn't believe the amount of people — from the kiosk to the bridge on this side of the river was just people and cars,\" he said.\n\nChristina McFarlane is organising a photo display at the new event, to be held from January 24–26.\n\nChristina McFarlane looks at an old photo collection that will be on display at the information centre. (ABC South East SA: Eugene Boisvert)\n\nShe said the event appeared to have declined in the 1960s when Nelson became more of a holiday town than a permanent settlement, and other entertainment options became available.\n\nStream now on ABC iview Photo shows 5 women looking concerned in front of a beach with Family Next Door and iview logo. The enigmatic Isabelle arrives in the quiet seaside cul-de-sac of Pleasant Court — and suspicions quickly rise. Stream all episodes now on ABC iview.\n\n\"Probably by the end of the 1950s, with changes in population, people were starting to do more things, I suppose,\" Ms McFarlane said.\n\n\"Whereas before they just had their cars, they didn't have much to do, they would go to these major events.\"\n\nThe event is last mentioned in 1974 in the Border Watch newspaper, when it was reported that around 3,000 people attended, while another event, the Bavarian International Festival at Mount Gambier's Valley Lake, was also held on the Australia Day weekend.\n\nThe Nelson Kiosk being demolished in May 2025. (ABC South East SA: Eugene Boisvert)\n\nInspiration through pub\n\nLawyer Kerry Schroeder and her husband, Rob Grant, bought the Nelson Hotel in October 2023.\n\nSoon after, they met Mr Whitehead, and began talking about how to boost tourism in Nelson.\n\nWith pictures from former Nelson regattas on display at the pub, inspiration soon sparked.\n\nEathan Whitehead, Kerry Schroeder and Jim Millard look at a picture of the Nelson Regatta on a wall at the Nelson Hotel. (ABC South East SA: Eugene Boisvert)\n\nMs Schroeder said they were not planning on exactly \"resurrecting\" the old Nelson Regatta but using the history to bring back its \"soul\".\n\n\"We are taking the soul that was that regatta and what it meant to Nelson and then using that to rebuild an event that will hopefully have people go, 'You know what? This weekend every year, go to Nelson because there's this amazing event happening',\" Ms Schroeder said.\n\n\"We want to rebuild Nelson as a place where people go, 'This is a great place to come to' — not only for the regatta weekend but 'Oh my God, we didn't realise how beautiful this was. How good would it be to come back in winter?'\"\n\nA crowd watches from the banks of the Glenelg River during a previous Nelson Regatta. (Supplied: Vern McCallum Collection)\n\nPlans well underway\n\nThe event will begin on Saturday afternoon with a slide show and music at the Nelson Hotel, followed by an outdoor cinema that night.\n\nThe actual regatta — a parade of boats up and down the Glenelg River — will take place on Sunday, along with a market and a dinner-dance at the pub.\n\nIt will end on Monday with the existing Australia Day breakfast and flag-raising ceremony at the tennis club, followed by a car show on the banks of the Glenelg River.\n\nMany of the events will be held within the grounds of the Nelson Hotel (bottom right). (Supplied: Wilsons Warrnambool & District Real Estate)\n\nMr Whitehead said it was important the event was \"do-able\" with just a few volunteers so it could become a local fixture.\n\n\"I just hope to see a lot of people having fun on the day in Nelson and particularly, that [if] it happens every single year … one day, hopefully, I have children that have memories of going to the regatta,\" he said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-30/west-end-development-protest-toowong-zoning/105713960",
    "title": "'Difficult choices' ahead as locals protest West End tower development",
    "publish_date": "Fri, 29 Aug 2025 21:10:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "Outside the West End State School, a group of parents and concerned residents gathered on Friday to express their anger at a proposal to build a 16-storey, 132-unit apartment building on the opposite side of Vulture Street.\n\n\"We have a lot of development in our area, but this one is literally on our doorstep,\" Vanessa Bertagnole, the head of the school's Parents and Citizens group told the media.\n\nVanessa Bertagnole and her daughter Zana are concerned social infrastructure isn't keeping pace with development. (ABC News: Will Murray)\n\n\"The developments are outstripping the social infrastructure to support them, and that's what we're really concerned about.\"\n\nA recent report released by the Brisbane Economic Development Agency forecast Brisbane's population will grow 2.1 per cent year-on-year until 2046.\n\nPlanning experts say housing millions of extra people is going to require significant development, and hard decisions about protecting character versus meeting demand will need to be made.\n\nThe community has concerns new developments will overshadow nearby 'character' homes. (ABC News: Will Murray)\n\n'Guidelines' create confusion\n\nAt the protest in West End, many of the signs held by those gathered complain the development is \"double\" the local height limit and would loom over the surrounding area.\n\n\"It's planned to be 16 storeys high, this area is zoned for eight storeys,\" Ms Bertagnole said.\n\nA look at the planning scheme would appear to confirm that a limit of eight storeys does apply to that part of West End.\n\nWest End is zoned for a maximum eight storeys, but Dr Mark Limb says the rules are more like 'guidelines'. (ABC News: Will Murray)\n\nHowever, as Mark Limb, lecturer in urban planning at QUT explained, the state uses what's called a \"performance-based\" planning system, which makes things a lot less clear-cut.\n\n\"It means those 'rules' are more like guidelines,\" Dr Limb said.\n\n\"A developer could potentially make an argument that the building is five or 10 storeys higher than what it says in the guideline, however it's still achieving the intended outcome of the planning scheme.\"\n\nDr Mark Limb says any buildings above the height limit need to undergo an impact assessment. (Supplied)\n\nIn practice, that means there is no hard and fast height limit, but anything above the guidelines must undergo an \"impact assessment\", which triggers much closer examination and public scrutiny.\n\nWhile Dr Limb said this can be frustrating for residents — who believe \"something dodgy is happening\" when buildings outside the rules are approved — it's designed to give developers confidence.\n\n\"If you meet with the standards that are specified within the various codes of the planning scheme, [the development] must be approved.\n\n\"If you want to go further … that's when the [impact assessment process] kicks in, which opens up the right for the community to lodge submissions.\"\n\nDevelopments undergoing an impact assessment require community engagement. (ABC News: Will Murray)\n\nUp versus out\n\nAcross the river in Toowong, developers Verso Projects recently submitted a development application (DA) to build three towers on a partially empty block.\n\nThe Toowong Central towers are between 49 and 58 storeys and will include about 1,000 units in total.\n\nThree towers are planned for the Toowong Central development and will require an impact assessment. (Supplied)\n\nThey are a lot taller than the planning scheme \"guidelines\" allow and so will require an impact assessment.\n\nSteve Laffey, CEO of Verso Projects, said they could have opted for a design very similar to a rival DA previously approved for the site.\n\nHowever, he argued the community would be worse off.\n\nSteve Laffey says the change from six towers to three will allow for more public space. (Supplied)\n\n\"We've gone from six towers on the site to three towers,\" he said.\n\n\"We end up with about five-and-a-half thousand square metres of open space available to the public, which is about 40 per cent of the site area.\n\n\"If we went back to the code compliant DA that we might have lodged, you would only end up with sort of 1,500 square metres of public space.\"\n\nVery similar complaints have been made about the Toowong and Vulture Street proposals.\n\nThey include that the developments will create more traffic in already busy areas, that there's no provision for social or affordable housing, and they will create overcrowding at local schools.\n\nAn artist's impression of the proposed development at Vulture Street in West End. (Supplied)\n\nMr Laffey said the company acknowledged these concerns, but said developers can't be expected to fund the solutions entirely.\n\n\"At some point there's a breaking point in terms of what's financial and what's not.\n\n\"If we're asked to do too much, then it's not financial, then it's never going to happen, and the community is not going to get an outcome it so desperately needs.\"\n\nHard decisions ahead\n\nFor city planners like Dr Limb, there's a lot to be said for higher density in inner-city areas.\n\n\"We have some of the most sprawling cities on the planet in Australia, which is truly inefficient and pushes people further and further away from essential services.\n\nCould the rising YIMBY movement increase housing supply? Photo shows an outside view of a row of houses Property prices surged once again in April due the ongoing shortage of housing and rising demand. Could the rise of the YIMBY — or the \"yes in my back yard\" — movement be the solution to boosting the supply of affordable housing?\n\n\"(Denser urban areas) can create more vibrant spaces, more walkable spaces… (and) it can increase the demand for better forms of public transport.\"\n\nBut he said Brisbane doesn't have a lot of space for higher-density development close to the city, and therefore some re-zoning is inevitable.\n\nNicole Bennetts, the Queensland manager of the Planning Institute of Australia, said adding millions of residents doesn't have to destroy Brisbane's character, it can be achieved through \"gentle density.\"\n\n\"Our planning instruments don't currently enable a lot of housing diversity in low density residential suburbs.\n\n\"What we, as planners, would like to have conversations with the community about is maybe introducing some duplexes or some triplexes.\"\n\nNicole Bennetts says \"gentle density\" can help increase housing without affecting the character of the city. (Supplied)\n\nMs Bennetts said these kinds of homes can be built to retain their backyards, the \"timber and tin\" look, and their tree-lined streets.\n\nShe urged people to not just look at development as a cost to the community.\n\n\"When growth occurs in an area, infrastructure investment can then come in to support upgrades to schools, hospitals, footpaths and other essential services that are needed.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-30/alcaraz-dismisses-knee-concerns-as-he-marches-on-at-us-open/105715604",
    "title": "'I did something to my shoulder': American star Ben Shelton forced out of US Open",
    "publish_date": "Fri, 29 Aug 2025 21:10:17 +0000",
    "category": "sports",
    "authors": [],
    "text": "America's best men's singles hope, Ben Shelton, has made a tearful exit from the US Open during his third-round match because of a left shoulder injury.\n\nThe sixth-seeded Shelton, a two-time major semifinalist, stopped after dropping the fourth set against Adrian Mannarino, which forced a fifth and decisive set. The injury was perhaps caused when he landed on his left arm after tracking down a ball in the corner on the final point to win the third set.\n\nEarly in the fourth, the 2023 US Open semifinalist began wincing and said to his coach's box: \"I did something to my shoulder. I don't know what it is.\"\n\nHe received treatment in the middle of the set, where the trainer rubbed some cream on his left shoulder, and he tried to shorten the points afterward by consistently attacking the net.\n\nBut after Mannarino won the set, Shelton was visited again by the trainer and called off the match, leaving the court with a towel over his head and tears in his eyes.\n\nThe game ended with Mannarino advancing 3-6, 6-3, 4-6, 6-4.\n\nMannarino, a 37-year-old from France, ended up with his first victory in 23 career matches against matches against top-10 players in Grand Slam tournaments.\n\n\"When he started to have pain, he was leading in the match,\" Mannarino said. \"Honestly, he would have probably won that match.\"\n\nShelton was certainly a heavy favourite in it after coming in with a 14-2 record this summer on hard courts and winning the title in Toronto, where he routed Mannarino early in the tournament.\n\nShelton was one of the best hopes to give the US its first men's major champion since Andy Roddick won the 2003 US Open.\n\nAnother of them, number 17 seed Frances Tiafoe — who had reached the semifinals in Flushing Meadows in two of the previous three years — was eliminated with a 6-4, 6-3, 7-6 (9/7) loss to German qualifier Jan-Lennard Struff.\n\nCarlos Alcaraz had to take a medical timeout to have attention for his right knee, but the Spanish star still advanced to the fourth round. (AP: Yuki Iwamura)\n\nMeanwhile Carlos Alcaraz marched on at Flushing Meadows, insisting there was no need for concern after he needed treatment on his right knee during an otherwise trouble-free demolition of Italian Luciano Darderi at the US Open.\n\nAfter having his serve broken for the first time and also requiring the physio to treat him near the end of the second set, it felt like perhaps this could be the first wobble for the stellar Spaniard at this year's New York major.\n\nYet it really didn't look that way as the 22-year-old pummelled Darderi 6-2, 6-4, 6-0 to waltz into the fourth round while still not having dropped a set so far.\n\nAnd he was quick to assure everyone after his one-hour 44-minute victory that there was nothing to worry about after he had taken a medical timeout at 5-4 in the second set following a nervous moment when he jolted his knee while landing awkwardly off a serve.\n\n\"I'm feeling good,\" he told the Arthur Ashe Stadium fans after treating them to 31 spectacular winners. \"It was just a precaution that I asked for the physio.\n\n\"When he broke my serve [with Alcaraz leading 4-1 in the second set] in the last point, I felt something in the knee, but after five or six points it was gone. I just asked the physio to take care of the knee, so I had to be feeling good.\n\n\"I am going to talk to my team about it, but I'm feeling good.\"\n\nSo good indeed that he reeled off the last seven games after the time-out to set up a fourth-round clash with Frenchman Arthur Rinderknech, who beat his compatriot, Daniil Medvedev's conqueror, Benjamin Bonzi, 4-6, 6-3, 6-3, 6-2.\n\n\"I just played such great tennis, great performance in general, so I'm just really proud about it,\" said Alcaraz, who continued his extraordinary run of form which has seen him rack up 42 wins against just two defeats since April.\n\nHe hasn't really made a mistake all week, apart from letting his brother cut his hair. Even his celebratory golf swing after his victory didn't look too shabby.\n\nNot even an early start could faze him. \"I just tried to start awake, that was important,\" he laughed.\n\n\"Starting at 11:30am is not a schedule that I'm used to playing, so my first goal is to start well, to start focused. I think I started really well, pushing him to the limit, playing long rallies, and after that kept it going.\n\n\"I'm not a morning person. For me, it's difficult to wake up in the mornings, so that's a good thing today, that I woke up early, I did the warm-up well, played good … It seems like I'm a Spanish guy!\"\n\nAmerican fourth seed Jessica Pegula defeated twice Australian Open winner Victoria Azarenka 6-1, 7-5.\n\n2021 champion Emma Raducanu had no answer to the play of ninth seed Elena Rybakina on Louis Armstrong Stadium. (AP: Kirsty Wigglesworth)\n\nEmma Raducanu has shown signs of improvement this year, reaching the US Open third round for the first time since her 2021 triumph, but it was not enough to get past ninth seed Elena Rybakina, who cruised to a 6-1, 6-2 win on Louis Armstrong Stadium.\n\n\"It's going to be important to just look at the last few months as a whole, last few weeks as a whole, and the improvements that I'm making, because a match like that can easily kind of get you down if you let it,\" said Raducanu, who had failed to win a match in her last two visits to the hardcourt major.\n\n\"So I'm going to try and not do that and regroup.\"\n\nRybakina, who triumphed at Wimbledon three years ago, reached the US Open fourth round for the first time and will next play Czech Marketa Vondrousova.\n\nVondrousova, the 2023 Wimbledon winner, eliminated Italian seventh seed Jasmine Paolini 7-6 (7/4), 6-1.\n\nNovak Djokovic will be hoping to get another step closer to an elusive 25th Grand Slam title when he looks to extend his 6-0 win-loss record over 35th-ranked Cameron Norrie in the night session on Arthur Ashe Stadium.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe former world number one readily admits that he has lost some of his fire after claiming his last major at the 2023 US Open, with the 38-year-old failing to reach the final at any of the slams for over a year.\n\nTeenaged fifth seed Mirra Andreeva, who claimed a pair of 1000-level titles earlier this year, plays American Taylor Townsend in the final match of the night on Ashe.\n\nOthers in action include world number one and defending champion Aryna Sabalenka, who plays Canadian 31st seed Leylah Fernandez.\n\nFernandez defeated Sabalenka during her remarkable run to the 2021 final and will hope that lightning strikes again on Friday.\n\nAP/AAP/Reuters",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/world/ukraine-blows-up-two-key-russian-bridges-20250830-p5mr33.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ukraine blows up two key Russian bridges",
    "publish_date": "Sat, 30 Aug 2025 11:20:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "Ukraine blows up two key Russian bridges\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/storm-s-shock-loss-leaves-nrl-scrambling-to-get-prestigious-trophy-to-canberra-20250830-p5mr2n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Storm’s shock loss leaves NRL scrambling to get prestigious trophy to Canberra",
    "publish_date": "Sat, 30 Aug 2025 10:39:05 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "An NRL staffer is driving the prestigious JJ Giltinan Shield to Canberra where it will be presented to the Raiders after full-time if they defeat Wests Tigers on Saturday.\n\nMelbourne’s shock loss to the Sydney Roosters on Friday means the Raiders can move four points clear on top of the ladder with one round remaining if they beat the Tigers. That left the NRL scrambling on Saturday morning to get the minor premiership trophy to Canberra in time.\n\nSources with knowledge of the situation not authorised to speak publicly confirmed the NRL had initially hoped to present the silverware to the Raiders in week one of the finals.\n\nThe Raiders play the Dolphins in Brisbane next weekend in the final round of the regular season, and it made sense for the trophy presentation to take place in Canberra during the qualifying final.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/hundreds-of-released-criminal-detainees-to-be-deported-to-nauru-20250830-p5mr32.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hundreds of released criminal detainees to be deported to Nauru",
    "publish_date": "Sat, 30 Aug 2025 10:34:53 +1000",
    "category": "finance",
    "authors": [],
    "text": "Hundreds of released criminal detainees to be deported to Nauru\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/national/olivia-s-extreme-pain-was-fobbed-off-by-10-doctors-they-all-missed-the-golf-ball-sized-lump-20250827-p5mqbg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Olivia’s extreme pain was fobbed off by 10 doctors. They all missed the golf ball-sized lump",
    "publish_date": "Sat, 30 Aug 2025 10:26:44 +1000",
    "category": "lifestyle",
    "authors": [
      "Kate Aubusson",
      "Emily Kaine",
      "Aisha Dow"
    ],
    "text": "Not one healthcare professional raised the possibility that Phillips may have had endometriosis. Had they guessed, Phillips wondered, would they have taken her pain more seriously?\n\nNo one had investigated the source of the pain or her intense nausea and, eventually, anaemia, Phillips said.\n\n“I was really confused,” Phillips said. “But I had seen so many doctors that I just started to believe them.”\n\nIt did not need to come to this. Over two years, Phillips had described pain that would “literally stop me in my tracks” to more than 10 GPs, a gastroenterologist and staff at a hospital emergency department.\n\nThe aggressive growth was one thin layer of soft tissue away from causing a complete rupture and potentially life-threatening sepsis.\n\nIt was the size of a golf ball and threatening to rip through Olivia Phillips’ bowel.\n\nAdd articles to your saved list and come back to them any time.\n\n“We have women calling our helpline haemorrhaging in the bathroom, and they say, ‘The GP has told me that this is normal’,” Taylor said. “Normal? How is haemorrhaging in the bathroom normal?”\n\n“We are still, in 2025, hearing that women are not being believed about their symptoms,” said Jess Taylor, chair of the Australian Coalition of Endometriosis and CEO of advocacy body QENDO.\n\n“For so long we’ve seen this gaslighting that’s described by patients, where they’ve presented to a health care provider with a set of symptoms, and they’ve been told it’s in their head, or it’s normal, when it’s not,” said Jason Abbott, professor of obstetrics and gynaecology at the University of NSW and chair of the National Endometriosis Clinical and Scientific Trials (NECST) network.\n\nOne woman’s endometrial lesions had all but killed her kidney before her pain was properly investigated. Another said her symptoms were dismissed as normal, despite period pain so severe that she had fainted and knocked her front teeth out. Others were prescribed anxiety medication and diagnosed with depression with no investigation into the physical cause of their distress.\n\nAmong them were dozens who described being turned away from emergency departments, delays in diagnosis spanning years – or decades – that robbed them of the chance to have children, and having their pain dismissed as a normal part of womanhood.\n\nEndometriosis was the single most common disease among more than 2000 accounts of medical misogyny shared by Australian women with this masthead: more than 200 women with the progressive, chronic disease in which tissue similar to the lining of the uterus grows in other parts of the body.\n\n“It was the only way for my body to remove waste,” she said. “Nothing I was eating was staying down.”\n\nBy 2020, two years after Phillips first sought help, she couldn’t sleep for the pain. The 27-year-old could no longer pass bowel movements. She was vomiting so frequently that she was rapidly losing weight.\n\nLost in translation are the research breakthroughs that take years to be adopted in practice, and doctors’ well-meaning but poorly delivered advice that leaves patients feeling dismissed.\n\nHealthcare professionals are reliant on endometriosis research that is 30 years behind conditions such as breast cancer, despite the condition affecting an estimated one in seven Australian women before the age of 50. It takes an average 6.5 years for women to be diagnosed after first experiencing symptoms.\n\nThe women, clinicians, researchers and advocates who spoke out for this investigation largely blame the systemic gender bias of a healthcare system rooted in medical research that has for centuries skewed male.\n\n“I cried,” said Phillips, now a mother of two – Noah, 3, and Goldie, 10 months. “It was a relief that finally I knew what it was and I could fix it.”\n\n“It’s clear how profoundly your symptoms impacted your quality of life,” Nikam later wrote to Phillips, “from years of debilitating pain and multiple dismissive consultations to the extreme measures you had to resort to just to manage [your] symptoms.”\n\nNikam, with a specialised team, performed emergency surgery to remove the large lesion and seven centimetres of Phillips’ bowel.\n\nPhillips had extensive, deep-infiltrating endometriosis: the most advanced presentation of the condition.\n\nA colleague, seeing her in this state, convinced her to push for a referral for a colonoscopy. It revealed a large pelvic mass compressing her bowel.\n\n“But we have to be very careful that this doesn’t turn women away from all doctors. We should be encouraging women to seek out health care, and if they do, unfortunately, encounter misogyny, then try somewhere else.”\n\n“Yes, there is medical misogyny,” said Professor Danielle Mazza, chair of general practice at Monash University and a member of the Royal Australian College of General Practitioners.\n\nBut the challenge, researchers and advocates say, will be how effectively these advancements can gain traction at the coalface, where healthcare workers and patients are up against decades of entrenched dogma.\n\nIn the past year alone, Sydney hosted the World Congress of Endometriosis, UNSW announced a world-first endometriosis research institute , the federal government funded an expansion of specialised clinics and subsidised treatments , and endometriosis ultrasounds, and new clinical guidelines are expected to speed up delays in diagnosis.\n\nSignificant strides have been made in the past decade towards filling the knowledge gaps for this chronically under-researched and underfunded disease, due to the dogged advocacy of patients, researchers and clinicians.\n\nDiagnosis: Normal\n\nThat endometriosis is a “women’s issue” – a euphemism for women’s reproductive organs – is one of the most harmful, pervasive myths of the condition, Taylor said.\n\n“Endometriosis is a multi-system, complex, chronic condition,” she said. “We need to crack open that conversation … so women are taken seriously when they say, ‘What about my bowel, my bladder, I’m disabled because of this condition’.”\n\nDr Jane Chalmers, senior lecturer in pain sciences at the University of South Australia, said the default has been to assume endometriosis pain is “just part of women’s experience”.\n\n“It is such a common story … People are still dismissed. They have their pain normalised,” said Chalmers, who also leads the pelvic pain component of the Innovation, Implementation and Clinical Translation in Health (IIMPACT) initiative at UniSA.\n\nFor women with endometriosis, fame and near-endless monetary resources have proven to be no defence against being dismissed by healthcare professionals.\n\nAustralian conservationist and television personality Bindi Irwin had a decade-long battle to get a diagnosis. She said one doctor told her the pain “was simply something you deal with as a woman”.\n\n“I felt lesser. I felt hurt. I felt weak. That is not OK,” Irwin, 27, wrote on social media this month. “Young girls and women shouldn’t feel alone with pain in the driver’s seat of their lives.”\n\nAbbott said this confluence of “normal” menstrual pain with abnormal, severe and life-impairing pain is at the heart of the issue.\n\n“As a man, if I had cyclic chest pain and I went to the emergency department, you can bet your bottom dollar that I would be investigated in a heartbeat,” he said. “Not only am I a man [who is] presenting with the pain, but I actually don’t have a system in my body that, as part of its normal process, produces pain.\n\n“If patients are coming, and they’re relaying to us symptoms that are not being improved with current management, then you need to acknowledge and respond to that, rather than relegating it to ‘that’s a normal process’, ‘you just need to get over it’.”\n\nJess Taylor said one of the most harmful myths about endometriosis was that it was just a “women’s issue”.\n\nTaylor described the case of a woman with endometriosis who presented to an emergency department in February with a ruptured ovary.\n\n“They told her to just go home, take ibuprofen and paracetamol. ‘You have got pelvic pain, it should go away’,” Taylor said.\n\nIt’s a common story among endo patients when over-the-counter painkillers don’t touch the sides of their symptoms, Monica Forlano, board chair of Endometriosis Australia, said.\n\n“Women will pass out from the pain – they’ll go to emergency and request stronger meds and be treated like drug seekers,” Forlano said.\n\n“It all comes down to the myth that pain is women’s lot in life, and that’s what makes them the weaker, fairer sex.”\n\nLoading\n\nChalmers said the consistent theme of the report from a landmark South Australian parliamentary inquiry into endometriosis was the emphasis on improving practitioner training.\n\n“People recognise that health practitioners are the gatekeepers. They’re the ones that someone presents to, and they are then either dismissed and normalised or they are sent on the path to recovery,” she said.\n\n‘If I can be gaslit, anyone can’\n\nLindsay Tuggle’s endometriosis went undetected for more than a decade of unexplained pain, five failed IVF cycles and a succession of healthcare professionals who didn’t take her seriously, before she finally found a specialist who correctly diagnosed her endometriosis.\n\n“People weren’t believing me,” the literary scholar and author said. “It was a dark period where I just thought, you know, I was going a bit crazy.”\n\nLindsay Tuggle’s pain from an endometriosis lesion was written off as the effects of her desk job. Credit: Wolter Peeters\n\nBy the time she was diagnosed, Tuggle said the lesions had colonised her bladder, bowel and cervix. She was 43 years old.\n\nThe excruciating pain when she sat down was caused by lesions that had wrapped around the sacral nerves at the base of her spine. Her doctors assumed this was due to her long hours working at her desk, Tuggle recalled.\n\n“[They would say]: ‘This is about the fact that you sit for work, you’re a writer’. When, in fact, I’m very fit. I’m very active. I have a sit-to-stand desk,” she said.\n\nTuggle was diagnosed with polycystic ovary syndrome (PCOS) at 29 years old after initially being told by a doctor that “you couldn’t possibly have PCOS because you’re not fat”.\n\nShe was also diagnosed at 36 with adenomyosis (in which endometrial tissue grows in the muscular wall of the uterus). Both conditions are known to present with endometriosis.\n\n“No one ever talked to me about endometriosis,” Tuggle said.\n\nShe abandoned her hopes of having children, something she believes was stolen from her by a healthcare system that failed to consider endometriosis as the cause of her unexplained pain and IVF failures.\n\n“I’m medically literate,” Tuggle said. “If I can be medically gaslit, it can happen to anyone.”\n\n‘Absolute absence of information’\n\nWhen Professor Caroline Ford, lead researcher of Gynaecological Cancer Research Group at UNSW, began searching endometriosis literature four years ago, she found “an absolute absence of information”.\n\n“[If] we don’t understand the basic biology of half the population and what the hell is going on, then how on earth can we possibly provide good care for people and good advice?” Ford said.\n\nAn infamous 2013 study published in one of the world’s most influential fertility medical journals judged the attractiveness of women with endometriosis without the consent of participants.\n\nThis peer-reviewed and Milan University-funded paper concluded women with rectovaginal endometriosis “were judged to be more attractive”, leaner, larger-breasted and were younger when they first had sex compared to women in control groups.\n\nThe journal retracted the paper seven years later, after sustained criticism, at the request of the authors.\n\n“When we say ‘medical misogyny’, it’s a misogyny in funding and research,” said Dr Nisha Khot, president-elect of the Royal Australian and New Zealand College of Obstetricians and Gynaecologists (RANZCOG).\n\n“Doctors can only do what they can do within the system they work in. We are relying on things that lack evidence behind them.”\n\nThe $50 million Ainsworth Endometriosis Research Institute (AERI), announced by UNSW in May and led by Ford and Abbott, is a key pillar in Australia’s world-leading efforts to fund and pioneer endometriosis research.\n\nChalmers said there was a “huge delay” – at least 15 years – for research findings to translate to changes in clinical practice.\n\n“If [a practitioner] is not someone who is upskilling in that area, they will continue doing that same sort of normalisation and dismissal until they know better,” she said.\n\nMeanwhile, unproven, unfounded medical myths have filled the void.\n\n“[Women are] being thrown all of these ideas completely not grounded in evidence because these individual health professionals don’t have the education, and women are making significant life choices based on that,” Taylor said. “Women are not being afforded informed consent about their health, about their life choices.”\n\nEndometriosis researchers and clinicians said among the most damaging and prevalent misconceptions are the reliance on a narrow list of symptoms that conceal the true extent and variation in presentations of the condition. Equally, the belief that symptoms are a cyclical and inevitable part of being a woman, which will spontaneously resolve in time.\n\nOther diehard myths are that teenagers don’t get endometriosis, laparoscopy is the one-size-fits-all treatment, and that pregnancy is curative.\n\n“Prescribing pregnancy as a treatment for endometriosis is completely untenable,” said Abbott, who is also the clinical director of AERI.\n\nRebecca Ballesteros, 35, was advised by a doctor that having a baby would relieve her symptoms. Credit: Wolter Peeters\n\nBut that’s just what Rebecca Ballesteros said her gynaecologist did.\n\nThe 35-year-old has never wanted children. But when she sought help for her heavy bleeding and period pain, the specialist said she probably had endometriosis, but it wasn’t worth undergoing surgery and she should “have a baby instead. Most of the time it helps,” Ballesteros recalled.\n\n“I was shocked and upset at the suggestion that I should have and raise a child to maybe help with chronic pain,” she said.\n\nA 2023 Australian study based on a survey of 3347 people diagnosed with endometriosis found almost two-thirds had been advised to get pregnant or have a baby to treat their condition, the vast majority (89.4 per cent) by a healthcare professional.\n\nLesley (left) and Sylvia Freedman are founders of EndoActive. Credit: Sam Mooy\n\nSylvia Freedman, co-founder of EndoActive with her mother, Lesley, and a study co-author, said this advice was often given to patients when they saw their doctors for pain management.\n\n“It should have absolutely nothing to do with having a child,” Freedman said. “It’s completely unethical and inappropriate.”\n\nMeanwhile, endometriosis can cause infertility. It’s estimated 30 to 50 per cent of women with the condition struggle to get pregnant.\n\nAbbott said pregnancy may temporarily reduce endometriosis symptoms because it paused a woman’s menstrual cycles, “which the pill can also do”, combined with high progesterone levels and other “happy chemicals” produced by the body as it prepares for childbirth.\n\n“But as soon as that all stops, symptoms return,” Abbott said. “Then you’ve got the endometriosis pain, and the baby, which is a lifelong commitment, certainly not just a prescription.”\n\nMazza said it’s probably the case that some doctors are not fully explaining why pregnancy may alter the course of the disease.\n\n“I think the problem is in the delivery,” Mazza said. “It’s not that you’re necessarily advising women to rush out and get pregnant, but it’s helping the woman to understand that things that suppress or stop you from menstruating will likely improve endometriosis symptoms, and one of those things is pregnancy.”\n\nFor Abbott: “the best period is no period”.\n\n‘We will cut you open, we will cut it out’\n\nFor some women such as Ballesteros, who spent a year on a public hospital laparoscopy waitlist, surgery can be life-changing.\n\nBut Dr Pav Nanayakkara, a gynaecological surgeon at Melbourne’s Jean Hailes for Women’s Health, said endometriosis could often be linked to numerous conditions such as irritable bowel syndrome, meaning treatment may need to be multipronged. She had encountered patients who had laparoscopies, but had been “just left” when the procedure didn’t fix their pain.\n\n“One of the things that makes me sad is when patients say they underwent a procedure that they didn’t feel comfortable with, or they didn’t understand what happened to them,” she said.\n\n“Losing trust in the health profession is a really sad thing because then diagnosis can be delayed [and] problems can become more severe.”\n\nChalmers said the overreliance on surgery – with its associated risks and long, often arduous recovery times – was a clear example of medical misogyny.\n\n“It’s just ‘we will cut you open, we will cut it out, and you will get better.’ ”\n\nAbbott said too many women are given no other option.\n\nJason Abbott is a professor of obstetrics and gynaecology at the University of NSW. Credit: Sam Mooy\n\n“I certainly see patients who respond to surgery, and then the disease comes back, and it doesn’t respond to medication, and all we can do is more surgery,” he said.\n\nSurgery is “the law of diminishing returns”, Abbott said. “One surgery, we know, can be efficacious. Two surgeries, certainly. But I hear stories and I see patients where they say, ‘I’ve had 30 surgeries and I’m 30 [years old]’. That is way too many. They are quite clearly not responding to surgery.”\n\nIn a major step towards more timely diagnosis and treatment, a new guideline published by RANZCOG in May overturned reliance on surgery to diagnose endometriosis (formerly the gold standard), recommending transvaginal ultrasound as first-line investigation for patients with symptoms.\n\nThe guideline also advised clinicians to offer women first-line treatment (in the form of hormones such as the contraceptive pill and intrauterine devices) while they waited for a diagnosis, as well as painkillers, physiotherapy and psychological support.\n\n“It makes the whole pathway simpler and more accessible,” said Mazza, who was the RACGP representative on the guideline’s development group, and is working on a management plan to help GPs structure consultations with patients that reflect the guidelines.\n\nBut a complicating factor, Mazza said, was that many women can feel dismissed by doctors who offer hormonal treatments amid a global movement of women moving away from using hormones.\n\n“Maybe that’s because the GP isn’t explaining why hormonal treatments are being recommended … but I think there needs to be increased awareness in the community that hormone therapies can be very beneficial for a range of conditions,” Mazza said.\n\nDanielle Mazza supports encouraging women to seek out health care.\n\nOne reason for this shift is the growing evidence of an association with the side effects of hormonal contraception, most commonly low mood.\n\nIf women aren’t responding to hormone treatments or are experiencing side effects, Abbott said simply giving them more is not the answer.\n\nDr Bridget Dickenson, a general practitioner at Jean Hailes for Women’s Health, said she would commonly see women who had been on the contraceptive pill for up to a decade, who, when they come off the pill (perhaps to have a baby) have a resurgence of terrible pain and bleeding.\n\nLoading\n\n“They may get diagnosed with endometriosis, and they have the perception that the pill masked their symptoms and delayed their diagnosis, when the pill was just doing a great job of treating the symptoms,” Dickenson said. “This is always a bit of a conundrum.\n\n“I always have a conversation when starting these treatments, that in five to 10 years, it may be that you are diagnosed with something like endometriosis. But that just means this treatment has been working for you.”\n\nIf pain and bleeding can be well controlled by hormonal treatments such as the pill, with no side effects and no symptoms of deep-infiltrating endometriosis, it can reduce the number of surgeries (and complications such as adhesions) a woman has over her lifetime, Dickenson explained.\n\nThe key is regular follow-ups to ensure the woman is happy with the treatment, she said.\n\nFundamentally, Mazza said, doctors are products of their society.\n\n“Where society doesn’t value women, where women are seen as just reproductive bodies and not given respect, that doubtless filters through into consultations with patients,” Mazza said. “There’s a lot of levels where misogyny comes into play.\n\n“Does the system work against women? We don’t have the full range of contraceptive options available on the PBS, ultrasound scans are rebated less than scrotal ultrasounds, hospitals may not have enough gynaecological services when half the population may need them.”\n\nHowever, Mazza said: “There are fantastic doctors who do great work, and thank goodness for that.”\n\nMEDICAL MISOGYNY: A CALL FOR ACTION The Age and The Sydney Morning Herald last year launched an investigation into medical misogyny: ingrained, systemic sexism across Australia’s healthcare system, medical research and practice. More than 2000 women shared their experiences as part of our crowd-sourced investigative series, which prompted a national outpouring of grief and frustration as women described feeling gaslit, dismissed or being told their pain was “all in their heads”. We call on the federal government to boost Medicare funding for GP appointments that last more than 20 minutes to improve care for women and others with complex health conditions. The Albanese government and the Coalition have promised to pour $8.5 billion into Medicare to make GP visits more affordable and improve bulk billing rates, but longer 20-minute appointments will receive a smaller proportional funding increase. Doctors have warned that these policies could further disadvantage women by continuing to incentivise shorter consultations, which don’t give GPs enough time to address menopause, pelvic pain and other women’s health issues.\n\nStart the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/afl/aflw-weekly-round-3-all-the-teams-and-expert-tips-as-dreamtime-returns-to-darwin-20250828-p5mqnv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘The Dustin Martin of AFLW’: Inside the amazing comeback of superstar Chloe Molloy",
    "publish_date": "Sat, 30 Aug 2025 10:07:55 +1000",
    "category": "sports",
    "authors": [
      "Russell Bennett",
      "Roy Ward",
      "Hannah Kennelly"
    ],
    "text": "As soon as Chloe Molloy ruptured her ACL in September last year, she turned to Swans coach Scott Gowans and said: “I’ll be back stronger and better than ever.”\n\nAnd the player Gowans describes as the Dustin Martin of the women’s competition proved it.\n\nOn Saturday she equalled the record for most goals in an AFLW game with seven, and that was off the back of a starring role in round one.\n\n“She’s the best female footballer I’ve ever seen, but until you see what she does to prepare for, and recover from, the game, and how she reviews vision… studies upcoming [opponents] and tactics, you probably don’t understand [that] you’re never going to fail, as such.”\n\nGowans spoke of the look in Molloy’s eyes during their first conversation after her injury last year.\n\n“I don’t know whether she saw doubt in me, or whether she thought I might not believe her… [but] she had a look in her eye,” he explained.\n\n“The first run [she had since the injury], she said, ‘I can’t wait to have a kick’.\n\n“Her first kick was horrible – it was all over the shop.”\n\nThat was at “about the five or six-month mark”, Gowans estimates.\n\n“She followed exactly what the rehab plan was to the letter, which is hard to do as an athlete,” Gowans explained further.\n\n“It was the extra stuff. She just wouldn’t accept that she can’t do more kilometres… or get back quicker.\n\n“It was all about what she could do that didn’t break the rules of rehab – the touches, the vision and the things like that, the extra ice baths, the extra massages.\n\n“She just ticked so many boxes and she didn’t miss a beat and came back in pre-season and broke her PB in the time trial, she’s benching and deadlifting record weights for her, she completely changed the way she eats… you just never doubted her [through her comeback process].”\n\nMolloy even picked the brain of Australian Football Hall of Fame member Erin Phillips about her own injury comebacks.\n\n“I think she’ll break the [goals in a single game] record,” Gowans said of his star.\n\n“And if you’re playing a clutch game or a grand final, she’s the type of person who would thrive on it.\n\n“She won’t have any doubt at all – she’s made for the big moments.\n\n“[Her teammates] can see that she leads the way by example, and they just follow her.\n\n“She brings them into the game as well.\n\n“[And] we put her on the ball in the centre bounce last weekend and she got a couple of clearances, but it was more the velocity and the power… she breaks lines.”\n\nNow Molloy is dominating to the point that her coach urges anyone with even a fleeting interest in footy to come along and see her in action.\n\n“You actually go to the game of football just to watch her, regardless of whether you’re a male or female football lover,” Gowans said. “She drags people through the gates, and people are better for going to see Chloe Molloy play.”",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/teary-shelton-retires-hurt-20250830-p5mr2v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Teary Shelton retires hurt",
    "publish_date": "Sat, 30 Aug 2025 09:59:38 +1000",
    "category": "finance",
    "authors": [],
    "text": "Teary Shelton retires hurt\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/brisbane-backed-solomon-kings-accepted-into-new-competition-20250830-p5mr2e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane-backed Solomon Kings accepted into new competition",
    "publish_date": "Sat, 30 Aug 2025 09:39:36 +1000",
    "category": "sports",
    "authors": [
      "Cameron Atfield"
    ],
    "text": "Brisbane-backed Solomon Kings has been accepted into the Oceania Football Confederation’s new FIFA-backed Pro League, deepening links between the Solomon Islands and Queensland.\n\nThe joint venture between the Solomon Islands Football Federation and Brisbane bayside club Wynnum Wolves will play their first match in January, subject to the final licensing and compliance process.\n\nThe fledgling club has been touted as an opportunity for Australia to counter China’s growing influence in the Pacific nation, similar to the federal government’s $600 million commitment to a Papua New Guinea NRL team.\n\nWhen built, the Clare Polkinghorne Centre at Wynnum Wolves’ Carmichael Park will serve as the Solomon Kings’ Australian training base. Credit: JSTN Architects\n\n“This is a historic moment for Oceania football. For the first time, our region will have a professional league that provides a pathway for players, coaches, and clubs to compete at the highest level within the Pacific,” OFC secretary Franck Castillo said.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/business/companies/runners-of-the-week-invictus-basin-energy-ark-mines-and-techgen-20250830-p5mr2r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Runners of the Week: Invictus, Basin Energy, Ark Mines & TechGen",
    "publish_date": "Sat, 30 Aug 2025 09:32:50 +1000",
    "category": "finance",
    "authors": [
      "Andrew Todd"
    ],
    "text": "Bulls N’ Bears’ Runner of the Week is African oil and gas hopeful Invictus Energy, which has stirred from its slumber this week with hopes of unlocking its flagship Cabora Bassa project in Zimbabwe.\n\nThe company could be something of a leviathan, having inked a blockbuster deal with Qatar’s Sheikh Mansour for a maxed out 19.9 per cent equity stake for a measly $37.8 million at 9.5c per share. The investment is accompanied by a pivotal US$500 million in conditional future funding to push Invictus’ mammoth Mukuyu gas discovery toward commercial production.\n\nInvictus says it and Al Mansour Holdings will also form Al Mansour Oil & Gas (AMOG), a joint venture to acquire producing and near-term oil and gas assets across Africa, with Invictus handling technical and operational management and Al Mansour providing funding, what a combo.\n\nA representative from Al Mansour will join the Invictus board to cement the partnership, as the long-dormant Cabora Bassa project in Zimbabwe’s Muzarabani Basin looks destined to finally flow gas to the African market.\n\nCabora holds an insane, estimated 20 trillion cubic feet (Tcf) of gas and condensate potential – that’s trillion with a ‘T’ - making it one of Africa’s largest undeveloped gas fields.\n\nShares, accordingly surged 145 per cent on Wednesday’s announcement, followed by another rocketing leap of 42.31 per cent on Thursday, to a 12-month high of 18.5c, with $30 million in stock traded.\n\nThat combined uptick added nearly $36 million in paper value to Al Mansour’s holdings - not bad for a couple of days work.\n\nIf AMOG’s M&A spree delivers and Mukuyu flows, Invictus could transform from a rusted-on Zimbabwean junior to a pan-African titan.\n\nBASIN ENERGY LIMITED (ASX: BSN)\n\nUp 220% (2.5c - 8c)\n\nSnagging silver is Canadian-based uranium explorer Basin Energy, after the explorer scooped up private critical minerals company in NeoDys, securing a prime position in northwest Queensland’s Mount Isa region.\n\nNeoDys’ extensive ground lies southwest of the world-renowned Mt Isa, next to Paladin Energy’s Valhalla hard rock uranium deposit – a hefty 116-million-pound uranium deposit - and Red Metals’ giant Sybella clay rare earths deposit.\n\nThe deal offers three exploration models for Basin in the humming uranium and rare earth critical minerals. From paleochannel uranium to hard-rock rare earths and clay hosted rare earths, the deal comes with a helpful $150,000 Queensland government grant to fund exploration.\n\nThe deal was accompanied by a $1.25 million placement to fund drilling later this year.\n\nAs rare earths and uranium roar back to life, so did Basin’s share price, which rocketed 220 per cent to a high of 8c on $2.5 million in stock traded on Wednesday.\n\nThe company, which listed in late 2022, has its sights set on developing it uranium portfolio housed within the world-class Athabasca Basin in Saskatchewan, Canada.\n\nHome to giants like Cameco’s McArthur River, Basin’s North Millennium, Geikie and Marshall projects were promised to chase shallow, high-grade uranium, with sniffs of radioactivity uncovered in 2023 before the uranium price cratered last year.\n\nWith Athabasca’s uranium pedigree and Queensland’s dual-play potential, Basin’s low-cost aircore drilling could prove potent. While uranium mining is still currently banned in Queensland, the project’s rare earths prospects could quickly turn out massive resources like Red Metal’s multi-billion tonne clay rare earths deposit next door. The upside on this new style of mineralisation remains unknown but should the economics prove positive at Red Metal, the district will be set alight in an area dominated by both Red Metal and now Basin.\n\nARK MINES LIMITED (ASX: AHK)\n\nUp 192% (18.5c – 54c)\n\nTaking bronze is Ark Mines Limited, another junior explorer targeting – you guessed it - rare earths and even heavy mineral sands to supply the West’s clean energy transition technologies.\n\nThe company received a massive boost to its potential this week in the form of a $4.5 million handout from the Queensland Investment Corp (QIC) Critical Minerals and Battery Technology Fund for its Sandy Mitchell project 230 kilometres northwest of Cairns.\n\nThe funding consists of a $4 million royalty-tied capital injection and a $500,000 equity investment at 16.7c - following extensive due diligence by the QIC, which manages a whopping $131.2 billion portfolio.\n\nArk says the cash will fast-track a stage-3 infill drilling program and a prefeasibility study at Sandy, targeting production by late 2027.\n\nSandy Mitchell hosts a measured resource of 71.8 million tonnes at 1732 parts per million (ppm) monazite equivalent, with an exploration target of 1.3–1.5 billion tonnes at 1286–1903 ppm.\n\nThe project’s monazite-rich sands contain key magnet REEs including neodymium and praseodymium, both vital for EV motors and wind turbines. Its shallow, open-pit-friendly deposit and Queensland’s infrastructure also support low-cost mining.\n\nA scoping study estimates a $120–150 million development cost, with annual EBITDA of $45–53 million and approximately 80 local jobs. Shares soared 192 per cent to a three-year high of 54c on $870k in stock traded.\n\nAnd while monazite-rich sands contain key magnet REEs like neodymium and praseodymium, vital for EV motors and wind turbines, and Ark’s shallow, open-pit-friendly deposit and Queensland’s infrastructure support low-cost mining, scaling a billion-tonne dream in remote terrain is no walk in the park.\n\nAligned with Australia’s push for supply chain security amid global REE shortages, Sandy Mitchell’s massive exploration target could make it a globally significant hub, but environmental and logistical hurdles in Cape York’s rugged landscape remain.\n\nTechGen Metals Limited has identified two parallel high-grade copper gossans and iron quartz gold zones at its Blue Devil project, 40km northeast of Halls Creek in Western Australia.\n\nTECHGEN METALS LIMITED (ASX: TG1)\n\nUp 165% (2c – 5.3c)\n\nRounding out this week’s Runners is copper-gold hopeful TechGen Metals, which was shot out of a cannon this week after it identified two parallel high-grade copper gossans and iron quartz gold zones, just 80m apart, at its Blue Devil project, 40km northeast of Halls Creek in the Halls Creek Orogen.\n\nRock chip samples along a 2km east-west corridor returned grades up to 52.3 per cent copper, 22.6 per cent copper and 5.35 grams per tonne (g/t) gold.\n\nThe Blue Devil project has never been drill-tested, giving TechGen a rare greenfield opportunity to deliver a potentially significant copper-gold discovery, with key targets stretching nearly 3km.\n\nThe company says a critically important heritage survey with the Jaru People is now complete, with tenure granting imminent and an IP survey planned to refine its 2.75km intrusion-related target in the winds.\n\nAs gold prices soared so did TechGens market cap, flying up a staggering 165 per cent to a high of 5.3c on $4.5 million in stock traded.\n\nThe mineralised hotspot is known for structural complexity and rich deposits. Notable projects include IGO’s Halls Creek copper-zinc revival.\n\nShould Blue Devil’s high-grade surface results and undrilled status position it as a major greenfields discovery in the surging red and yellow metal sectors, the rare greenfields discovery would be accompanied with a rare share price jump for the ages??\n\nIs your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/how-beating-australia-helped-launch-the-career-of-a-world-rugby-star-20250827-p5mqb7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How beating Australia helped launch the career of a world rugby star",
    "publish_date": "Sat, 30 Aug 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Frances Howe"
    ],
    "text": "When Ilona Maher posed for the September 2024 cover of Sports Illustrated magazine, she held an Olympic medal taken from the hands of the Australian team.\n\nOn Sunday, Australia will attempt to stop Maher and the US from depriving them of another medal at a major tournament. But if they lose again, Australia are set to leave the Women’s Rugby World Cup with nothing.\n\nAustralia will play Ilona Maher’s US side after losing to them at the 2024 Olympics. Credit: Getty/Ben Watts\n\nLast year, Australia was 15 seconds from a podium finish at the 2024 Olympics in Paris. The bronze medal they were on track to win would have been a mere consolation prize for a team that could have won gold, forced upon them by a Canadian upset in the semi-final.\n\nInside those 15 seconds, USA’s Alex Sedrick scored and converted her own try to steal the bronze and hand the medal to Maher, whose online profile has surged from the social media content she made during the Olympics.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/lifestyle/will-king-charles-and-prince-harry-reunite-20250830-p5mr2k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Will King Charles and Prince Harry reunite?",
    "publish_date": "Sat, 30 Aug 2025 08:50:16 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Will King Charles and Prince Harry reunite?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/lifestyle/king-charles-and-prince-harry-royal-reunion-reports-20250830-p5mr2h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King Charles and Prince Harry royal reunion reports",
    "publish_date": "Sat, 30 Aug 2025 08:36:32 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles and Prince Harry royal reunion reports\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/3rd-round-highlights-jessica-pegula-v-victoria-azarenka-20250830-p5mr2g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "3rd Round Highlights | Jessica Pegula v Victoria Azarenka",
    "publish_date": "Sat, 30 Aug 2025 08:29:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "3rd Round Highlights | Jessica Pegula v Victoria Azarenka\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/3rd-round-highlights-elena-rybakina-v-emma-raducanu-20250830-p5mr2f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "3rd Round Highlights | Elena Rybakina v Emma Raducanu",
    "publish_date": "Sat, 30 Aug 2025 08:28:53 +1000",
    "category": "finance",
    "authors": [],
    "text": "3rd Round Highlights | Elena Rybakina v Emma Raducanu\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/3rd-round-highlights-frances-tiafoe-v-jan-lennard-struff-20250830-p5mr2d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "3rd Round Highlights | Frances Tiafoe v Jan-Lennard Struff",
    "publish_date": "Sat, 30 Aug 2025 08:16:24 +1000",
    "category": "finance",
    "authors": [],
    "text": "3rd Round Highlights | Frances Tiafoe v Jan-Lennard Struff\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/aussie-womens-marathon-selection-debacle-20240529-p5jhsc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie women's marathon selection debacle",
    "publish_date": "Sat, 30 Aug 2025 08:15:05 +1000",
    "category": "sports",
    "authors": [],
    "text": "Aussie women's marathon selection debacle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/price-of-gold-surges-how-much-to-sell-it-for/koafq7847",
    "title": "Australian families could be sitting on a goldmine, but many are torn about selling",
    "publish_date": "Sat, 30 Aug 2025 01:23:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "When it comes to gifts for special events such as weddings or birthdays, gold jewellery remains the top choice in many cultures.\n\n\n\n\n\nBut with the price of gold up around 70 per cent in the last five years, more people are torn between selling such items to make ends meet or keeping them for sentimental reasons.\n\n\n\n\n\nJeweller Danny Georgakopoulos says people once only wanted 18 carat gold — and the more carats the better.\n\n\n\n\n\n\"If you told an older Italian or Greek lady to give them something that's not 18 carat, it's like you're swearing at them or you're cursing them. So they get their back up a bit. But that's what's changed now,\" he tells SBS News.\n\n\n\n\n\nCustomers are now going for lower carat gold because price of the precious metal has gone up — a lot.\n\n\n\nDanny Georgakopoulos says customers are now opting for lower carats of gold because of high prices. Source: SBS News \"Gold price has gone up. It's gone up about 40 per cent in the last 12 months. In 2025, from January to June it's gone up about 20 per cent. So it's quite a big jump,\" he says.\n\n\n\n\n\nHis shop, Aurea Designs, caters to many people of Greek and Italian background and sits on Homer Street in the Sydney suburb of Earlwood — a bit of a hub for wedding dresses, baptism outfits or jewellery for these occasions.\n\n\n\n\n\nAround 22.3 per cent of Earlwood reported Greek ancestry in the 2021 census — way above the national average.\n\n\n\n\n\n\"It is a bit of a wedding and Christening hub here. So I do sell a lot of crosses, We do a lot of wedding bands, a lot of engagement rings,\" Georgakopoulos says.\n\n\n\nREAD MORE Why some Arab Australian women see gold jewellery as a safe way to invest their money\n\nThen there's the classics — thick gold chains.\n\n\n\n\n\nBeyond hip hop culture where they remain an enduring favourite, they have a long history, with ancient Greeks, Egyptians, Romans and many other cultures once valuing this look.\n\n\n\n\n\nWhile the style went out of fashion in recent years — in western countries at least — it's now back in vogue, but only for those who can afford their hefty price tag.\n\n\n\nA rich history\n\nPeople's love of gold dates back a long way.\n\n\n\n\n\nFrom 5000 BC the Egyptians used gold found in the bed of the Nile River for adornment, while it also featured heavily in ancient European, Middle Eastern and subcontinental cultures — among others.\n\n\n\n\n\nThe question, though, is why do humans in almost every part of the world love this shiny metal so much?\n\n\n\nSome cultures value gold jewellery above all when it comes to gifts for special events. Source: SBS News Professor Nitika Garg, a researcher in consumer behaviour at UNSW in Sydney, has some answers.\n\n\n\n\n\n\"It's cultural and traditional, how we have attached value to gold, not in just in terms of the actual value of the asset, but in terms of emotional value where it's considered from everything from good luck to a symbolism of wishing the best to your close family and friends on occasion,\" she says.\n\n\n\n\n\n\"There's also research that humans have over time evolved to sort of get attracted towards jewels and gold, which just because it gives them that assurance, it's an asset, it's a resource.\n\n\n\n\n\n\"And just with water, food, these assets have over time evolved to hold meaning for us.\"\n\n\n\nWhat's behind gold's price rise?\n\nExperts say geopolitical factors, global unrest including fears of inflation fanned by the threat posed by US President Donald Trump's tariffs — just some of the reasons.\n\n\n\n\n\nThe World Gold Council says central banks are also buying up gold at eye-watering rates, and investors tend to see it as a safe bet in difficult times.\n\n\n\n\n\nThe Council says in 2024, jewellery accounted for about 50 per cent of total demand, central bank reserves around 20 per cent, electronics and Industrial around 7 per cent, medical and dental about 1 per cent.\n\n\n\n\n\nWhile demand for jewellery has dropped due to the price, it still retains strong cultural value in many parts of the world.\n\n\n\nTrading.Com's Australian CEO Peter McGuire says substantial populations of people buying gold in countries like Japan, Malaysia, and China has affected the price.\n\n\n\n\n\nHe says when you consider the cultural value of gold in \"Bangladesh, India, Pakistan, and the Middle East, and you've really captured again the best part of probably 2 billion people\".\n\n\n\n\n\n\"It's a big store of value, certainly in the likes of India. It's very much a part of their culture, their heritage, and certainly their belief as far as a store of value.\"\n\n\n\nJewellery for Diwali, special events\n\nHolding a baby about eight or nine months old with a mop of thick dark hair, Ajay and his partner are shopping for jewellery in Harris Park in Sydney, at one of several shops in the area.\n\n\n\n\n\n\"It's a ritual for us to be honest on festivals and occasions. And a kid is born, we buy gold Diwali at the Festival of Lights. We buy gold and we put that in for temple as well. For worshipping as well. Yeah, it's quite a product.\"\n\n\n\n\n\nThe store owner Akshaj Sharma estimates that about 90 per cent of its customers are from the Indian subcontinent.\n\n\n\n\n\nProfessor Nitika Garg says the skyrocketing price of gold is putting a lot of pressure on India's middle class.\n\n\n\n\n\n\"I have family and friends in India, there is still the expectation if it's a marriage of your daughter or your son, you are expected to make jewellery for them or give jewellery to the other party,\" she says.\n\n\n\nAbout 90 per cent of Akshaj Sharma's customers are from the Indian subcontinent. Source: SBS News \"So there is pressure, and it is obviously hurting the middle class more because they don't have quite the give — the very poor have no options and the very rich have too many options.\"\n\n\n\n\n\nSharma says there has been an increase in the number of people coming into the shop to sell rather than buy.\n\n\n\n\n\n\"People have jewellery from 10, 20 years ago, they still sell to us or from their grandparents and stuff that have passed away. And generally also their cost of living has gotten people to sell more as well.\n\n\n\n\n\n\"People can't afford to live, so they just start selling off all jewellery that they have from generations ago. We get a lot of that.\"\n\n\n\n\n\nVince is an Australian of Turkish ancestry — another culture that values gold as a gift.\n\n\n\n\n\n\"I had a thick chain that I bought when I was a bit younger, but I was hanging onto, it was about a hundred grams so it was a bit of a medium-sized chain. So yeah, I sold that about six months ago,\" he says.\n\n\n\n\n\nHe got just under $10,000 for it.\n\n\n\nEmotionally I did have to think about it a couple of days on and off over a short period of time, but I wasn't wearing, it was sitting in the drawer and yeah, I needed the money, so I ended up getting rid of it\n\nVince says that, in Turkish culture, gold remains an important gift, particularly at weddings and births.\n\n\n\n\n\nIt is also considered a valuable asset — a kind of backup plan in hard times.\n\n\n\n\n\nAt weddings guests are also expected give gold coins or jewellery as wedding gifts.\n\n\n\n\n\nVince says that can be too much for some people — who may choose to avoid these celebrations all together.\n\n\n\n\n\n\"They're going through hardship and they make up some kind of excuse to not turn up.\"\n\n\n\nGold recycling the way of the future\n\nGeorgakopoulos is seeing an increase in people recycling old jewellery rather than purchasing something new.\n\n\n\n\n\n\"Instead of buying a new piece outright, they're bringing in their heirloom jewellery. So stuff they've had passed down some, they've had it for years and they're either using their gold, so they're incorporating the gold into something new.\"\n\n\n\n\n\nThe World Gold Council says mine production accounts for the largest part of global gold supply — typically, 75 per cent each year with the shortfall made up from recycling.\n\n\n\nAmid the cost of living crisis, many are opting to sell heirloom gold jewellery. Source: SBS News Earthworks — a United States environmental group — says there are more than 2,000 major mining companies in the world in addition to countless small artisinal mining sites.\n\n\n\n\n\nThe group says these mines are a major source of pollution with few taking steps to avoid further environmental damage from gold mining.\n\n\n\n\n\nVarious studies say that gold recycling could meet the world's current gold needs with less need to resort to mining.\n\n\n\n\n\nResearchers at Oxford University say about one-quarter of annual gold demand is already supplied through recycling and could be increased with strategies such as blending with other metals.\n\n\n\n\n\nThey also say moves for more responsible and sustainable gold extraction methods should be a priority for mining companies.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/is-your-family-sitting-on-a-goldmine-and-are-you-willing-to-sell-it/yhcz8uooi",
    "title": "Is your family sitting on a goldmine - and are you willing to sell it?",
    "publish_date": "Fri, 29 Aug 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"It used to be 18 carat, only 18 carat.\"\n\n\n\n\n\nJeweller Danny Georgakopoulos talking about gold.\n\n\n\n\n\nWhen it comes to carats, it's 'the more, the better'.\n\n\n\n\n\n\"If you told an older Italian or Greek lady to give them something that's not 18 carat it's like you're swearing at them or you're cursing them. So they get their back up a bit. But that's what's changed now.\"\n\n\n\n\n\nAnd what's changed exactly is that customers are going for lower carat gold.\n\n\n\n\n\nThat's because the price of the precious metal has gone up - a lot.\n\n\n\n\n\n\"Gold price has gone up. It's gone up about 40 per cent in the last 12 months. In 2025, from January to June it's gone up about 20 per cent. So it's quite a big jump.\"\n\n\n\n\n\nHis shop, Aurea Designs, caters to a lot of people of Greek and Italian background.\n\n\n\n\n\nIt sits on Homer Street in the Sydney suburb of Earlwood - a bit of a hub for wedding dresses ...\n\n\n\n\n\n\"A lot of crosses. We do a lot. It is a bit of a wedding and Christening hub here. So people do come for christenings in the area. There's a couple of other shops here with bonbonnieres and children's clothes and that. So I do sell a lot of crosses. I do carry a lot. We do a lot of wedding bands, a lot of engagement rings.\"\n\n\n\n\n\nThen there's the classics - thick gold chains.\n\n\n\n\n\nBeyond hip-hop culture, where they remain an enduring favourite, they have a long history.\n\n\n\n\n\nThe ancient Greeks, Egyptians, Romans and many other cultures valued this look, that has gone out of fashion in recent years - in Western countries at least.\n\n\n\n\n\nBut that's changed - they're back, but only for those who can afford their hefty price tag.\n\n\n\n\n\n\"At one stage you weren't buying that. But now it's getting popular again. And a lot of people want the thicker jewellery. Younger people. It's getting popular with a couple of the rappers. And they wear the thick jewellery with the thick pendants and that.\"\n\n\n\n\n\nThe love of gold dates back a long way.\n\n\n\n\n\nFrom 5,000 BC the Egyptians used gold found in the bed of the Nile River for adornment, while it also featured heavily in ancient European, Middle Eastern and South Asian cultures, among others.\n\n\n\n\n\nThe question, though, is why do humans in almost every part of the world love this shiny metal so much?\n\n\n\n\n\nProfessor Nitika Garg is a researcher in consumer behaviour at UNSW in Sydney.\n\n\n\n\n\n\"It's funny, right? So it's obviously cultural and traditional, how we have attached value to gold, not in just in terms of the actual value of the asset, but in terms of emotional value where it's considered from everything from good luck to a symbolism of wishing the best to your close family and friends on occasion. And there's also research that humans have over time evolved to sort of get attracted towards jewels and gold, which just because it gives them that assurance, it's an asset, it's a resource. And just with water, food, these assets have over time evolved to hold meaning for us.\"\n\n\n\n\n\nSo what's behind the price rise?\n\n\n\n\n\nExperts say geopolitical factors, global unrest and fears of inflation fanned by the threat posed by US President Donald Trump's tariffs are just some of the reasons.\n\n\n\n\n\nThe World Gold Council says central banks are also buying up gold at eye-watering rates, and investors tend to see it as a safe bet in difficult times.\n\n\n\n\n\nThe Council says in 2024, jewellery accounted for about 50 per cent of total demand, central bank reserves around 20 per cent, electronics and Industrial around 7 per cent, medical and dental about 1 per cent.\n\n\n\n\n\nWhile demand for jewellery has dropped due to the price, it still retains strong cultural value in many parts of the world.\n\n\n\n\n\nPeter McGuire is the CEO Australia for Trading.Com.\n\n\n\n\n\n\"First off, let's look at Asia and that corridor from really Australia all the way up to Japan and you've got China in there and the likes of Malaysia. We all understand that the depth of those countries from a population standpoint and gold has been a source of value or a source of family value for literally millennium. And that holding of gold has been one of dowries or placing under beds or weddings or festivals that you have throughout your year. Christening anything like that is very much a gift that someone would gift some form of gold to someone. Then you roll it across to the likes of Bangladesh, India, Pakistan, and the Middle East, and you've really captured again the best part of probably 2 billion people. It's a big store of value, certainly in the likes of India. It's very much a part of their culture, their heritage, and certainly their belief as far as a store of value.\"\n\n\n\n\n\n\"It's a ritual for us to be honest on festivals and occasions. And a kid is born, we buy gold Diwali at the Festival of Lights. We buy gold and we put that in for temple as well. For worshipping as well. Yeah, it's quite a product.\"\n\n\n\n\n\nHolding a baby about eight or nine months old with a mop of thick dark hair, Ajay and his partner are shopping for jewellery in Sydney's Harris Park.\n\n\n\n\n\nIt's one of a couple of jewellery shops in the area.\n\n\n\n\n\nThe owner of the shop estimates that about 90 per cent of its customers are from countries in South Asia.\n\n\n\n\n\nAkshaj Sharma runs Akshara Jewellery with his dad.\n\n\n\n\n\n\"Generally it's necklace sets and bangles, pretty heavy, heavy stuff. So the bride side will gift the groom. The groom side will gift the bride. They'll obviously gift the rings as well. They'll give some rings. Or for the bride it'll be necklace sets and bangles. And they're generally pretty heavy so that they last a very long time.\"\n\n\n\n\n\nHarris Park in Western Sydney is affectionately known as Little India; that's because around 45 per cent of its population was born in India, according to the 2021 Census.\n\n\n\n\n\nThe suburb is lined with grocery shops, restaurants, clothing shops and jewellery shops.\n\n\n\n\n\n22 carat gold reigns supreme here - the preferred choice for many people from South Asia.\n\n\n\n\n\nThis makes it a pricey gift in today's gold market - although that hasn't stopped Ashima, who has just bought her fiance a gift.\n\n\n\n\n\n\"In our culture If I give him something made of gold, I don't have to decide anything else. It's like a prestigious issue also. And it's like a property value also, like an investment. So he would not say, why did you spend that? Because he would love it. I got him a locket. It has the name of my state. Originally I come from Punjab, so it was a locket with the name of Punjab initialled it, and it's our mother tongue. It's written in Punjabi, not in the English language. So that's what I thought, that he would love it and he would also have an emotional connect with that.\"\n\n\n\n\n\nProfessor Nitika Garg says consumer behaviour and culture are often linked.\n\n\n\n\n\n\"Most of southeastern cultures in particular have high value on this, and if you look at their tradition, especially around marriage or birth of a child, there will be significant investment or exchange of gold, whether it's in terms of jewelry or bullion. And I obviously know about India from personal experience, but also I know friends from Vietnam, Thailand, everywhere, even China, it is a big deal in terms of personal and social exchanges.\"\n\n\n\n\n\nBut she adds the skyrocketing price of gold is putting a lot of pressure on India's middle class.\n\n\n\n\n\n\"I have obviously family and friends in India, there is still the expectation if it's a marriage of your daughter or your son, you are expected to make jewellery for them or give jewellery to the other party. So there is pressure, and it is obviously hurting the middle class more because they don't have quite the give, the very poor and the very rich options are either too many or rarely no options. But the middle class, at least in India, I can see they're hurting a little bit because it changes your dynamics, how much you could give with the same amount of money. And now gold is so expensive, it's like literally you can't touch it.\"\n\n\n\n\n\nAkshaj Sharma says there has been an increase in the number of people coming into the shop to sell rather than buy.\n\n\n\n\n\n\"People have jewellery from 10, 20 years ago, they still sell to us or from their grandparents and stuff that have passed away. And generally also their cost of living has gotten people to sell more as well. People can't afford to live, so they just start selling off all jewelry that they have from generations ago. We get a lot of that.\"\n\n\n\n\n\nVince is an Australian of Turkish ancestry - another culture that values gold as a gift.\n\n\n\n\n\n\"I had a thick chain that I bought when I was a bit younger but I was hanging on to, it was about a hundred grams so it was a bit of a medium-sized chain. So yeah, I sold that about six months ago.\"\n\n\n\n\n\nHe got just under $10,000 for it.\n\n\n\n\n\n\"Emotionally I did have to think about it a couple of days on and off over a short period of time, but I wasn't wearing, it was sitting in the drawer and yeah, I needed the money so I ended up getting rid of it. Gave some to my kids, got some stuff fixed around the house, spent some, ate some and it's gone. Yeah, it's pretty much gone.\"\n\n\n\n\n\nVince says in Turkish culture gold remains a important gift, particularly at weddings and births.\n\n\n\n\n\nIt is also considered a valuable asset - a backup plan in hard times.\n\n\n\n\n\nAt weddings guests are also expected give gold coins or jewellery as wedding gifts.\n\n\n\n\n\nVince says that can be too much for some people who may choose to avoid these celebrations all together.\n\n\n\n\n\n\"And people don't turn up to weddings because of that kind of pressure. So they get invited and they make an excuse because they're going through hardship and they make up some kind of excuse to not turn up.\"\n\n\n\n\n\nDanny Georgakopoulos is seeing an increase in people recycling old jewellery rather than purchasing something new.\n\n\n\n\n\n\"Instead of buying a new piece outright, they're bringing in their heirloom jewellery. So stuff they've had passed down some, they've had it for years and they're either using their gold, so they're incorporating the gold into something new, which is nice because if you're sentimental jewellery, you're still using the same jewellery that has been passed down from a loved one.\"\n\n\n\n\n\nThe World Gold Council says mine production accounts for the largest part of global gold supply – typically, 75 per cent each year with the shortfall made up from recycling.\n\n\n\n\n\nEarthworks, a United States environment group, says there are more than 2,000 major mining companies in the world in addition to countless small artisanal mining sites.\n\n\n\n\n\nThe group says these mines are a major source of pollution with few taking steps to avoid further environmental damage from gold mining.\n\n\n\n\n\nVarious studies say gold recycling could meet the world's current gold needs with less need to resort to mining.\n\n\n\n\n\nResearchers at Oxford University say about one-quarter of annual gold demand is already supplied through recycling and could be increased with strategies such as blending with other metals.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/plan-to-boost-vocational-teacher-numbers-in-australia-to-address-skills-shortages/kcmkhq0c1",
    "title": "Plan to boost vocational teacher numbers in Australia to address skills shortages",
    "publish_date": "Fri, 29 Aug 2025 21:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAfter moving from Afghanistan to Australia, Fatima Sultanzi was looking for a way to keep fuelling her passion and love for fashion.\n\n\n\n\n\nShe had studied fashion design in Afghanistan - and was open to upskilling.\n\n\n\n\n\nSo when her friends told her about the fashion design course at TAFE New South Wales in collaboration with local fashion brand, The Social Outfit, she signed up immediately.\n\n\n\n\n\n\"I learned many things here in The Social Outfit. Different kinds of things, like (learning how to make) suits, coats, T-shirts, pants, and (using) machine. Every (sewing) machine, I can use it.\"\n\n\n\n\n\nThis year, Ms Sultanzi made a suit for the Governor-General of Australia Sam Mostyn, who has also worn clothing from the brand during her swearing-in ceremony last year.\n\n\n\n\n\nAmy Low is the chief executive of the brand.\n\n\n\n\n\nThrough the partnership with TAFE New South Wales in the past decade, her brand has supported and upskilled over 450 migrant women interested in Australia's fashion industry.\n\n\n\n\n\n\"What we are able to deliver in that partnership with TAFE here is the women who may be comfortable sewing on a domestic machine, will have their first experience under supervision with the industrial sewing machine. And in gaining both technical skills, they are also really experiencing what it might be like to work as a machinist, and to begin a career in that industry.\"\n\n\n\n\n\nThe story of Ms Sultanzi and The Social Outfit is one that the federal government wants to see more, as they announce more investments in the country's vocational education training sector - or VET sector - during its launch of the 2025 National Skills Week (25-31 August).\n\n\n\n\n\nLast year's theme was 'VET as a game changer'. This year, it is 'Exploring All the Options'.\n\n\n\n\n\nThe emphasis on the different and varied opportunities for all Australians to access training and upskilling, regardless of their location.\n\n\n\n\n\nSpeaking at the National Press Club, the Minister for Skills and Training Andrew Giles says since fee-free TAFE places became available in 2023, there has been over 650,000 enrollments across the country.\n\n\n\n\n\n\"Free TAFE is breaking down cost barriers and de-stigmatising the idea that learning is only for the young. More than 125,000 Australians aged 45 and over have enrolled.\"\n\n\n\n\n\nMr Giles used his National Press Club speech to announce a $30 million investment in the VET trainer workforce, aiming at increasing the number of electrical and construction VET teachers, and First Nations VET teachers.\n\n\n\n\n\nHe also wants to see a sustainable skill training system, backed by both educational institutions and industries, to support the idea of lifelong learning.\n\n\n\n\n\n\"It's a concept that knits together how we should be thinking about supporting people to navigate the changing world - on their terms. Moving beyond the narrow sense of equipping a person to perform a role. Because jobs are changing and we now know people can now expect to move between industries, not simply between employers.\"\n\n\n\n\n\nBrian Wexham is th e chief executive and chair of National Skills Week.\n\n\n\n\n\nHe says lifelong learning is key - and will be needed more than ever, as developments like AI's impact on work and workers drive demand for upskilling and reskilling.\n\n\n\n\n\nMr Wexham says he also hopes there will be major improvements in the perception of the value of the VET sector.\n\n\n\n\n\n\"What we need to do, and what the government need to do, we need to get those messages across, and the story across, of the success of people coming out of vocational education and what they've been able to do. I mean to go to TAFE isn't a failure. It's a success story.\"\n\n\n\n\n\nMr Wexham also says VET can be helpful for the settlement of refugees and migrants - and that's the exact story of Samia Salhaz.\n\n\n\n\n\nAfter being a chef in Syria for 20 years, Ms Salhaz moved to Australia in 2022, and began a traineeship with the Bread and Butter Project, a social enterprise that offers baking training to refugee women, in partnership with TAFE New South Wales.\n\n\n\n\n\nAfter graduation, she secured a job with the enterprise to train other women.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/how-australia-post-offices-are-changing-virgins-first-profit-result-since-re-listing/qmxd0c2uk",
    "title": "How Australia Post Offices are changing & Virgin's first profit result since re-listing",
    "publish_date": "Fri, 29 Aug 2025 08:19:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-anthony-albanese-was-chased-by-angry-farmers-on-tractors-today/wqm0o39zi",
    "title": "Why Anthony Albanese was chased by angry farmers on tractors",
    "publish_date": "Fri, 29 Aug 2025 06:15:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prime Minister Anthony Albanese may not have expected a wholly positive reception at the Bush Summit in Ballarat, country Victoria, today, but it's unlikely he expected having his motorcade chased by tractors.\n\n\n\n\n\nLikewise, Victorian Premier Jacinta Allan may not have expected to find herself blocked from leaving the summit venue by both tractors and Country Fire Authority (CFA) fire trucks.\n\n\n\n\n\nFootage posted by the Herald Sun newspaper shows the prime minister's white motorcade being followed closely by fast-moving tractors.\n\n\n\n\n\nSBS News has contacted the prime minister and premier's office for comment but has not yet received a reply.\n\n\n\n\n\nBoth Labor leaders would be aware of the opposition to renewable energy infrastructure that's been simmering in rural areas around Ballarat for several years.\n\n\n\n\n\nThey would also be aware of the hostility directed towards Victoria's emergency services levy, which some in regional communities believe unfairly burdens them with the cost of funding services such as the CFA.\n\n\n\n\n\nProtests against these issues have seen large convoys of fire engines and tractors take to the streets of Melbourne and smaller cities of Victoria in recent years.\n\n\n\nSeveral Country Fire Authority fire trucks were driven in to Melbourne to protest the state Labor government's emergency services levy on 20 May. Source: AAP / James Ross\n\n'This is these people's castles'\n\nIn the fertile potato-growing areas around Ballarat, the opposition to renewable energy infrastructure is primarily directed against the Western Renewables Link, an electricity transmission line that will run from wind farms in Victoria's west to Melbourne's outer suburbs.\n\n\n\n\n\nAt just 190 kilometres, the high-voltage power line makes up only a fraction of the approximately 10,000 kilometres of new transmission lines that Australia may need to build to decarbonise our electricity grid by 2050.\n\n\n\n\n\nConstruction on the project was originally slated to start in mid-2025 but has now been delayed until after the 2026 state election, something the state opposition has said is a deliberate ploy by Labor to hang on to its seats along the project's path.\n\n\n\n\n\nTransmission company Ausnet has attributed the delay to changes made to the project's route and design, which involved \"extensive updates including engineering design, planning and community consultation,\" a spokesperson said, as reported by The Weekly Times in April.\n\n\n\nLocal farmer Will Elsworth says the 'Piss Off Ausnet' hill — first created by another local farmer several years ago — is now \"the most recognised landmark in the Hepburn Shire\". Source: Supplied / Will Elsworth At the Bush Summit, a member of the public asked Albanese: \"Why are regional communities paying the cost for renewable energy? Where is the social licence? Where is the regulation to protect our communities, value our farmland and preserve our environment?\"\n\n\n\n\n\nAlbanese, who was repeatedly booed by some regional landowners in the summit’s audience, said: \"Quite clearly, governments haven't done well enough in the engagement and community consultation and those processes.\"\n\n\n\n\n\nAlbanese said he'd had conversations with locals about \"their experience of just getting hit with information from an energy company without any notice\", which he described as \"completely unacceptable\".\n\n\n\n\n\nAllan also said that engagement with landowners over such projects had \"not been acceptable\".\n\n\n\n\n\n\"Whether it's the support that landowners receive in hosting transmission lines on their property, whether it's the compensation arrangements that are being made available … we can work through these issues together,\" the Herald Sun reported the premier as saying.\n\n\n\n\n\nThe Victorian government has committed to pay landowners $8,000 a year for every kilometre of transmission infrastructure for 25 years.\n\n\n\nHowever, Will Elsworth, a farmer who attended Friday's protests, said increasing the rate of compensation wasn't a solution.\n\n\n\n\n\n\"They've offered people millions of dollars and they will not let them in because these people have, I don't know if the word's right, an intrinsic value to their land,\" he told SBS News.\n\n\n\n\n\n\"It's like [1997 Australian movie] The Castle. There was no money with the bloke in The Castle. He didn't want to be bought out because his family's home is his castle, and this is these people's castles. Money's not the issue.\n\n\n\n\n\n\"She's trying to roll these renewables and transmission lines across the most productive farmland in Australia,\" Elsworth said, referring to Allan.\n\n\n\n\n\nSpeaking of the premier's delayed exit from the summit, Elsworth said: \"So she's decided to leave, and then they've actually blocked the road's exit with people, and then they've blocked it with tractors. Then they've blocked it with fire trucks.\n\n\n\n\n\n\"So you couldn't get out. It didn't matter if you moved the tractor, you couldn't move the firetruck.\"\n\n\n\n\n\nElsworth said he wasn't familiar with the moment in which the prime minister's motorcade was reportedly chased by tractors.\n\n\n\nDiscontent 'urgently needs to be addressed'\n\nThe Victorian government has recently passed legislation granting state government agency VicGrid powers to access private farmland to build transmission towers.\n\n\n\n\n\nThe laws, which passed Victoria's upper house earlier this week, give authorised officers the power to use \"reasonable force\" to enter properties. Those who obstruct, hinder or delay access to such officers face fines of several thousand dollars.\n\n\n\n\n\nThe news was met with fury by some farmers, who told the ABC they would continue to refuse access to those involved in transmission line projects.\n\n\n\n\n\nVictorian Farmers Federation president Brett Hosking said the laws would only \"create more discontent, distrust and disharmony in the community, and the opposition will last longer, be stronger, and the transition's going to take a whole lot longer\".\n\n\n\nHowever, there's evidence suggesting opposition to renewable energy infrastructure isn't necessarily a dominant sentiment outside of Australia's cities.\n\n\n\n\n\nA 2024 poll commissioned by Farmers for Climate Action found that 70 per cent of respondents supported clean energy projects on farmland in their community, while only 17 were opposed.\n\n\n\n\n\nPolling in the same year commissioned by the Renewable Energy Alliance (RE-Alliance) found over 60 per cent of those in regional areas support government investment in large scale renewable infrastructure in regional Australia.\n\n\n\n\n\nHowever, in a recent submission to government, Re-Alliance policy and engagement manager Tony Goodfellow argued that this support was fragile and \"growing discontent that urgently needs to be addressed\".\n\n\n\nEmergency services levy\n\nFriday's protests in Ballarat were also motivated by Victoria's Emergency Services and Volunteers Levy, a local tax hike to support the provision of various emergency services.\n\n\n\n\n\nThe levy, which passed state parliament earlier this year and will come into effect next year, is projected to increase the amounts paid by property owners relative to the tax scheme it replaces.\n\n\n\n\n\nCouncils are tasked with collecting the new levy — a responsibility that some have not warmly embraced.\n\n\n\nHepburn Shire Council, which takes in areas around Ballarat, passed a motion earlier this year \"confirming Council's strong opposition to the Emergency Services and Volunteers Levy\".\n\n\n\n\n\n\"Council has previously written to the Treasurer and Minister for Local Government expressing that the levy has a disproportionate financial burden on rural and regional communities, like ours, especially primary producers,\" the council wrote.\n\n\n\n\n\nIn response to criticism, the state government has offered a one-year temporary exemption to primary producers.\n\n\n\n\n\n— With additional reporting from Australian Associated Press\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/iran-ambassador-expelled-trumps-military-crackdown-kpop-demon-hunters/p5uwy192i",
    "title": "Iran ambassador expelled, Trump’s military crackdown & KPop Demon Hunters",
    "publish_date": "Fri, 29 Aug 2025 06:05:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/knights-of-the-productivity-roundtable-ft-senator-jacqui-lambie/tdqs2qw1z",
    "title": "Knights of the (productivity) roundtable ft. Senator Jacqui Lambie",
    "publish_date": "Thu, 28 Aug 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/world/ukraine-blows-up-two-key-russian-bridges-20250830-p5mr33.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ukraine blows up two key Russian bridges",
    "publish_date": "Sat, 30 Aug 2025 11:20:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "Ukraine blows up two key Russian bridges\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/storm-s-shock-loss-leaves-nrl-scrambling-to-get-prestigious-trophy-to-canberra-20250830-p5mr2n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Storm’s shock loss leaves NRL scrambling to get prestigious trophy to Canberra",
    "publish_date": "Sat, 30 Aug 2025 10:39:05 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "An NRL staffer is driving the prestigious JJ Giltinan Shield to Canberra where it will be presented to the Raiders after full-time if they defeat Wests Tigers on Saturday.\n\nMelbourne’s shock loss to the Sydney Roosters on Friday means the Raiders can move four points clear on top of the ladder with one round remaining if they beat the Tigers. That left the NRL scrambling on Saturday morning to get the minor premiership trophy to Canberra in time.\n\nSources with knowledge of the situation not authorised to speak publicly confirmed the NRL had initially hoped to present the silverware to the Raiders in week one of the finals.\n\nThe Raiders play the Dolphins in Brisbane next weekend in the final round of the regular season, and it made sense for the trophy presentation to take place in Canberra during the qualifying final.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/hundreds-of-released-criminal-detainees-to-be-deported-to-nauru-20250830-p5mr32.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hundreds of released criminal detainees to be deported to Nauru",
    "publish_date": "Sat, 30 Aug 2025 10:34:53 +1000",
    "category": "finance",
    "authors": [],
    "text": "Hundreds of released criminal detainees to be deported to Nauru\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/national/olivia-s-extreme-pain-was-fobbed-off-by-10-doctors-they-all-missed-the-golf-ball-sized-lump-20250827-p5mqbg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Olivia’s extreme pain was fobbed off by 10 doctors. They all missed the golf ball-sized lump",
    "publish_date": "Sat, 30 Aug 2025 10:26:44 +1000",
    "category": "lifestyle",
    "authors": [
      "Kate Aubusson",
      "Emily Kaine",
      "Aisha Dow"
    ],
    "text": "Not one healthcare professional raised the possibility that Phillips may have had endometriosis. Had they guessed, Phillips wondered, would they have taken her pain more seriously?\n\nNo one had investigated the source of the pain or her intense nausea and, eventually, anaemia, Phillips said.\n\n“I was really confused,” Phillips said. “But I had seen so many doctors that I just started to believe them.”\n\nIt did not need to come to this. Over two years, Phillips had described pain that would “literally stop me in my tracks” to more than 10 GPs, a gastroenterologist and staff at a hospital emergency department.\n\nThe aggressive growth was one thin layer of soft tissue away from causing a complete rupture and potentially life-threatening sepsis.\n\nIt was the size of a golf ball and threatening to rip through Olivia Phillips’ bowel.\n\nAdd articles to your saved list and come back to them any time.\n\n“We have women calling our helpline haemorrhaging in the bathroom, and they say, ‘The GP has told me that this is normal’,” Taylor said. “Normal? How is haemorrhaging in the bathroom normal?”\n\n“We are still, in 2025, hearing that women are not being believed about their symptoms,” said Jess Taylor, chair of the Australian Coalition of Endometriosis and CEO of advocacy body QENDO.\n\n“For so long we’ve seen this gaslighting that’s described by patients, where they’ve presented to a health care provider with a set of symptoms, and they’ve been told it’s in their head, or it’s normal, when it’s not,” said Jason Abbott, professor of obstetrics and gynaecology at the University of NSW and chair of the National Endometriosis Clinical and Scientific Trials (NECST) network.\n\nOne woman’s endometrial lesions had all but killed her kidney before her pain was properly investigated. Another said her symptoms were dismissed as normal, despite period pain so severe that she had fainted and knocked her front teeth out. Others were prescribed anxiety medication and diagnosed with depression with no investigation into the physical cause of their distress.\n\nAmong them were dozens who described being turned away from emergency departments, delays in diagnosis spanning years – or decades – that robbed them of the chance to have children, and having their pain dismissed as a normal part of womanhood.\n\nEndometriosis was the single most common disease among more than 2000 accounts of medical misogyny shared by Australian women with this masthead: more than 200 women with the progressive, chronic disease in which tissue similar to the lining of the uterus grows in other parts of the body.\n\n“It was the only way for my body to remove waste,” she said. “Nothing I was eating was staying down.”\n\nBy 2020, two years after Phillips first sought help, she couldn’t sleep for the pain. The 27-year-old could no longer pass bowel movements. She was vomiting so frequently that she was rapidly losing weight.\n\nLost in translation are the research breakthroughs that take years to be adopted in practice, and doctors’ well-meaning but poorly delivered advice that leaves patients feeling dismissed.\n\nHealthcare professionals are reliant on endometriosis research that is 30 years behind conditions such as breast cancer, despite the condition affecting an estimated one in seven Australian women before the age of 50. It takes an average 6.5 years for women to be diagnosed after first experiencing symptoms.\n\nThe women, clinicians, researchers and advocates who spoke out for this investigation largely blame the systemic gender bias of a healthcare system rooted in medical research that has for centuries skewed male.\n\n“I cried,” said Phillips, now a mother of two – Noah, 3, and Goldie, 10 months. “It was a relief that finally I knew what it was and I could fix it.”\n\n“It’s clear how profoundly your symptoms impacted your quality of life,” Nikam later wrote to Phillips, “from years of debilitating pain and multiple dismissive consultations to the extreme measures you had to resort to just to manage [your] symptoms.”\n\nNikam, with a specialised team, performed emergency surgery to remove the large lesion and seven centimetres of Phillips’ bowel.\n\nPhillips had extensive, deep-infiltrating endometriosis: the most advanced presentation of the condition.\n\nA colleague, seeing her in this state, convinced her to push for a referral for a colonoscopy. It revealed a large pelvic mass compressing her bowel.\n\n“But we have to be very careful that this doesn’t turn women away from all doctors. We should be encouraging women to seek out health care, and if they do, unfortunately, encounter misogyny, then try somewhere else.”\n\n“Yes, there is medical misogyny,” said Professor Danielle Mazza, chair of general practice at Monash University and a member of the Royal Australian College of General Practitioners.\n\nBut the challenge, researchers and advocates say, will be how effectively these advancements can gain traction at the coalface, where healthcare workers and patients are up against decades of entrenched dogma.\n\nIn the past year alone, Sydney hosted the World Congress of Endometriosis, UNSW announced a world-first endometriosis research institute , the federal government funded an expansion of specialised clinics and subsidised treatments , and endometriosis ultrasounds, and new clinical guidelines are expected to speed up delays in diagnosis.\n\nSignificant strides have been made in the past decade towards filling the knowledge gaps for this chronically under-researched and underfunded disease, due to the dogged advocacy of patients, researchers and clinicians.\n\nDiagnosis: Normal\n\nThat endometriosis is a “women’s issue” – a euphemism for women’s reproductive organs – is one of the most harmful, pervasive myths of the condition, Taylor said.\n\n“Endometriosis is a multi-system, complex, chronic condition,” she said. “We need to crack open that conversation … so women are taken seriously when they say, ‘What about my bowel, my bladder, I’m disabled because of this condition’.”\n\nDr Jane Chalmers, senior lecturer in pain sciences at the University of South Australia, said the default has been to assume endometriosis pain is “just part of women’s experience”.\n\n“It is such a common story … People are still dismissed. They have their pain normalised,” said Chalmers, who also leads the pelvic pain component of the Innovation, Implementation and Clinical Translation in Health (IIMPACT) initiative at UniSA.\n\nFor women with endometriosis, fame and near-endless monetary resources have proven to be no defence against being dismissed by healthcare professionals.\n\nAustralian conservationist and television personality Bindi Irwin had a decade-long battle to get a diagnosis. She said one doctor told her the pain “was simply something you deal with as a woman”.\n\n“I felt lesser. I felt hurt. I felt weak. That is not OK,” Irwin, 27, wrote on social media this month. “Young girls and women shouldn’t feel alone with pain in the driver’s seat of their lives.”\n\nAbbott said this confluence of “normal” menstrual pain with abnormal, severe and life-impairing pain is at the heart of the issue.\n\n“As a man, if I had cyclic chest pain and I went to the emergency department, you can bet your bottom dollar that I would be investigated in a heartbeat,” he said. “Not only am I a man [who is] presenting with the pain, but I actually don’t have a system in my body that, as part of its normal process, produces pain.\n\n“If patients are coming, and they’re relaying to us symptoms that are not being improved with current management, then you need to acknowledge and respond to that, rather than relegating it to ‘that’s a normal process’, ‘you just need to get over it’.”\n\nJess Taylor said one of the most harmful myths about endometriosis was that it was just a “women’s issue”.\n\nTaylor described the case of a woman with endometriosis who presented to an emergency department in February with a ruptured ovary.\n\n“They told her to just go home, take ibuprofen and paracetamol. ‘You have got pelvic pain, it should go away’,” Taylor said.\n\nIt’s a common story among endo patients when over-the-counter painkillers don’t touch the sides of their symptoms, Monica Forlano, board chair of Endometriosis Australia, said.\n\n“Women will pass out from the pain – they’ll go to emergency and request stronger meds and be treated like drug seekers,” Forlano said.\n\n“It all comes down to the myth that pain is women’s lot in life, and that’s what makes them the weaker, fairer sex.”\n\nLoading\n\nChalmers said the consistent theme of the report from a landmark South Australian parliamentary inquiry into endometriosis was the emphasis on improving practitioner training.\n\n“People recognise that health practitioners are the gatekeepers. They’re the ones that someone presents to, and they are then either dismissed and normalised or they are sent on the path to recovery,” she said.\n\n‘If I can be gaslit, anyone can’\n\nLindsay Tuggle’s endometriosis went undetected for more than a decade of unexplained pain, five failed IVF cycles and a succession of healthcare professionals who didn’t take her seriously, before she finally found a specialist who correctly diagnosed her endometriosis.\n\n“People weren’t believing me,” the literary scholar and author said. “It was a dark period where I just thought, you know, I was going a bit crazy.”\n\nLindsay Tuggle’s pain from an endometriosis lesion was written off as the effects of her desk job. Credit: Wolter Peeters\n\nBy the time she was diagnosed, Tuggle said the lesions had colonised her bladder, bowel and cervix. She was 43 years old.\n\nThe excruciating pain when she sat down was caused by lesions that had wrapped around the sacral nerves at the base of her spine. Her doctors assumed this was due to her long hours working at her desk, Tuggle recalled.\n\n“[They would say]: ‘This is about the fact that you sit for work, you’re a writer’. When, in fact, I’m very fit. I’m very active. I have a sit-to-stand desk,” she said.\n\nTuggle was diagnosed with polycystic ovary syndrome (PCOS) at 29 years old after initially being told by a doctor that “you couldn’t possibly have PCOS because you’re not fat”.\n\nShe was also diagnosed at 36 with adenomyosis (in which endometrial tissue grows in the muscular wall of the uterus). Both conditions are known to present with endometriosis.\n\n“No one ever talked to me about endometriosis,” Tuggle said.\n\nShe abandoned her hopes of having children, something she believes was stolen from her by a healthcare system that failed to consider endometriosis as the cause of her unexplained pain and IVF failures.\n\n“I’m medically literate,” Tuggle said. “If I can be medically gaslit, it can happen to anyone.”\n\n‘Absolute absence of information’\n\nWhen Professor Caroline Ford, lead researcher of Gynaecological Cancer Research Group at UNSW, began searching endometriosis literature four years ago, she found “an absolute absence of information”.\n\n“[If] we don’t understand the basic biology of half the population and what the hell is going on, then how on earth can we possibly provide good care for people and good advice?” Ford said.\n\nAn infamous 2013 study published in one of the world’s most influential fertility medical journals judged the attractiveness of women with endometriosis without the consent of participants.\n\nThis peer-reviewed and Milan University-funded paper concluded women with rectovaginal endometriosis “were judged to be more attractive”, leaner, larger-breasted and were younger when they first had sex compared to women in control groups.\n\nThe journal retracted the paper seven years later, after sustained criticism, at the request of the authors.\n\n“When we say ‘medical misogyny’, it’s a misogyny in funding and research,” said Dr Nisha Khot, president-elect of the Royal Australian and New Zealand College of Obstetricians and Gynaecologists (RANZCOG).\n\n“Doctors can only do what they can do within the system they work in. We are relying on things that lack evidence behind them.”\n\nThe $50 million Ainsworth Endometriosis Research Institute (AERI), announced by UNSW in May and led by Ford and Abbott, is a key pillar in Australia’s world-leading efforts to fund and pioneer endometriosis research.\n\nChalmers said there was a “huge delay” – at least 15 years – for research findings to translate to changes in clinical practice.\n\n“If [a practitioner] is not someone who is upskilling in that area, they will continue doing that same sort of normalisation and dismissal until they know better,” she said.\n\nMeanwhile, unproven, unfounded medical myths have filled the void.\n\n“[Women are] being thrown all of these ideas completely not grounded in evidence because these individual health professionals don’t have the education, and women are making significant life choices based on that,” Taylor said. “Women are not being afforded informed consent about their health, about their life choices.”\n\nEndometriosis researchers and clinicians said among the most damaging and prevalent misconceptions are the reliance on a narrow list of symptoms that conceal the true extent and variation in presentations of the condition. Equally, the belief that symptoms are a cyclical and inevitable part of being a woman, which will spontaneously resolve in time.\n\nOther diehard myths are that teenagers don’t get endometriosis, laparoscopy is the one-size-fits-all treatment, and that pregnancy is curative.\n\n“Prescribing pregnancy as a treatment for endometriosis is completely untenable,” said Abbott, who is also the clinical director of AERI.\n\nRebecca Ballesteros, 35, was advised by a doctor that having a baby would relieve her symptoms. Credit: Wolter Peeters\n\nBut that’s just what Rebecca Ballesteros said her gynaecologist did.\n\nThe 35-year-old has never wanted children. But when she sought help for her heavy bleeding and period pain, the specialist said she probably had endometriosis, but it wasn’t worth undergoing surgery and she should “have a baby instead. Most of the time it helps,” Ballesteros recalled.\n\n“I was shocked and upset at the suggestion that I should have and raise a child to maybe help with chronic pain,” she said.\n\nA 2023 Australian study based on a survey of 3347 people diagnosed with endometriosis found almost two-thirds had been advised to get pregnant or have a baby to treat their condition, the vast majority (89.4 per cent) by a healthcare professional.\n\nLesley (left) and Sylvia Freedman are founders of EndoActive. Credit: Sam Mooy\n\nSylvia Freedman, co-founder of EndoActive with her mother, Lesley, and a study co-author, said this advice was often given to patients when they saw their doctors for pain management.\n\n“It should have absolutely nothing to do with having a child,” Freedman said. “It’s completely unethical and inappropriate.”\n\nMeanwhile, endometriosis can cause infertility. It’s estimated 30 to 50 per cent of women with the condition struggle to get pregnant.\n\nAbbott said pregnancy may temporarily reduce endometriosis symptoms because it paused a woman’s menstrual cycles, “which the pill can also do”, combined with high progesterone levels and other “happy chemicals” produced by the body as it prepares for childbirth.\n\n“But as soon as that all stops, symptoms return,” Abbott said. “Then you’ve got the endometriosis pain, and the baby, which is a lifelong commitment, certainly not just a prescription.”\n\nMazza said it’s probably the case that some doctors are not fully explaining why pregnancy may alter the course of the disease.\n\n“I think the problem is in the delivery,” Mazza said. “It’s not that you’re necessarily advising women to rush out and get pregnant, but it’s helping the woman to understand that things that suppress or stop you from menstruating will likely improve endometriosis symptoms, and one of those things is pregnancy.”\n\nFor Abbott: “the best period is no period”.\n\n‘We will cut you open, we will cut it out’\n\nFor some women such as Ballesteros, who spent a year on a public hospital laparoscopy waitlist, surgery can be life-changing.\n\nBut Dr Pav Nanayakkara, a gynaecological surgeon at Melbourne’s Jean Hailes for Women’s Health, said endometriosis could often be linked to numerous conditions such as irritable bowel syndrome, meaning treatment may need to be multipronged. She had encountered patients who had laparoscopies, but had been “just left” when the procedure didn’t fix their pain.\n\n“One of the things that makes me sad is when patients say they underwent a procedure that they didn’t feel comfortable with, or they didn’t understand what happened to them,” she said.\n\n“Losing trust in the health profession is a really sad thing because then diagnosis can be delayed [and] problems can become more severe.”\n\nChalmers said the overreliance on surgery – with its associated risks and long, often arduous recovery times – was a clear example of medical misogyny.\n\n“It’s just ‘we will cut you open, we will cut it out, and you will get better.’ ”\n\nAbbott said too many women are given no other option.\n\nJason Abbott is a professor of obstetrics and gynaecology at the University of NSW. Credit: Sam Mooy\n\n“I certainly see patients who respond to surgery, and then the disease comes back, and it doesn’t respond to medication, and all we can do is more surgery,” he said.\n\nSurgery is “the law of diminishing returns”, Abbott said. “One surgery, we know, can be efficacious. Two surgeries, certainly. But I hear stories and I see patients where they say, ‘I’ve had 30 surgeries and I’m 30 [years old]’. That is way too many. They are quite clearly not responding to surgery.”\n\nIn a major step towards more timely diagnosis and treatment, a new guideline published by RANZCOG in May overturned reliance on surgery to diagnose endometriosis (formerly the gold standard), recommending transvaginal ultrasound as first-line investigation for patients with symptoms.\n\nThe guideline also advised clinicians to offer women first-line treatment (in the form of hormones such as the contraceptive pill and intrauterine devices) while they waited for a diagnosis, as well as painkillers, physiotherapy and psychological support.\n\n“It makes the whole pathway simpler and more accessible,” said Mazza, who was the RACGP representative on the guideline’s development group, and is working on a management plan to help GPs structure consultations with patients that reflect the guidelines.\n\nBut a complicating factor, Mazza said, was that many women can feel dismissed by doctors who offer hormonal treatments amid a global movement of women moving away from using hormones.\n\n“Maybe that’s because the GP isn’t explaining why hormonal treatments are being recommended … but I think there needs to be increased awareness in the community that hormone therapies can be very beneficial for a range of conditions,” Mazza said.\n\nDanielle Mazza supports encouraging women to seek out health care.\n\nOne reason for this shift is the growing evidence of an association with the side effects of hormonal contraception, most commonly low mood.\n\nIf women aren’t responding to hormone treatments or are experiencing side effects, Abbott said simply giving them more is not the answer.\n\nDr Bridget Dickenson, a general practitioner at Jean Hailes for Women’s Health, said she would commonly see women who had been on the contraceptive pill for up to a decade, who, when they come off the pill (perhaps to have a baby) have a resurgence of terrible pain and bleeding.\n\nLoading\n\n“They may get diagnosed with endometriosis, and they have the perception that the pill masked their symptoms and delayed their diagnosis, when the pill was just doing a great job of treating the symptoms,” Dickenson said. “This is always a bit of a conundrum.\n\n“I always have a conversation when starting these treatments, that in five to 10 years, it may be that you are diagnosed with something like endometriosis. But that just means this treatment has been working for you.”\n\nIf pain and bleeding can be well controlled by hormonal treatments such as the pill, with no side effects and no symptoms of deep-infiltrating endometriosis, it can reduce the number of surgeries (and complications such as adhesions) a woman has over her lifetime, Dickenson explained.\n\nThe key is regular follow-ups to ensure the woman is happy with the treatment, she said.\n\nFundamentally, Mazza said, doctors are products of their society.\n\n“Where society doesn’t value women, where women are seen as just reproductive bodies and not given respect, that doubtless filters through into consultations with patients,” Mazza said. “There’s a lot of levels where misogyny comes into play.\n\n“Does the system work against women? We don’t have the full range of contraceptive options available on the PBS, ultrasound scans are rebated less than scrotal ultrasounds, hospitals may not have enough gynaecological services when half the population may need them.”\n\nHowever, Mazza said: “There are fantastic doctors who do great work, and thank goodness for that.”\n\nMEDICAL MISOGYNY: A CALL FOR ACTION The Age and The Sydney Morning Herald last year launched an investigation into medical misogyny: ingrained, systemic sexism across Australia’s healthcare system, medical research and practice. More than 2000 women shared their experiences as part of our crowd-sourced investigative series, which prompted a national outpouring of grief and frustration as women described feeling gaslit, dismissed or being told their pain was “all in their heads”. We call on the federal government to boost Medicare funding for GP appointments that last more than 20 minutes to improve care for women and others with complex health conditions. The Albanese government and the Coalition have promised to pour $8.5 billion into Medicare to make GP visits more affordable and improve bulk billing rates, but longer 20-minute appointments will receive a smaller proportional funding increase. Doctors have warned that these policies could further disadvantage women by continuing to incentivise shorter consultations, which don’t give GPs enough time to address menopause, pelvic pain and other women’s health issues.\n\nStart the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/afl/aflw-weekly-round-3-all-the-teams-and-expert-tips-as-dreamtime-returns-to-darwin-20250828-p5mqnv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘The Dustin Martin of AFLW’: Inside the amazing comeback of superstar Chloe Molloy",
    "publish_date": "Sat, 30 Aug 2025 10:07:55 +1000",
    "category": "sports",
    "authors": [
      "Russell Bennett",
      "Roy Ward",
      "Hannah Kennelly"
    ],
    "text": "As soon as Chloe Molloy ruptured her ACL in September last year, she turned to Swans coach Scott Gowans and said: “I’ll be back stronger and better than ever.”\n\nAnd the player Gowans describes as the Dustin Martin of the women’s competition proved it.\n\nOn Saturday she equalled the record for most goals in an AFLW game with seven, and that was off the back of a starring role in round one.\n\n“She’s the best female footballer I’ve ever seen, but until you see what she does to prepare for, and recover from, the game, and how she reviews vision… studies upcoming [opponents] and tactics, you probably don’t understand [that] you’re never going to fail, as such.”\n\nGowans spoke of the look in Molloy’s eyes during their first conversation after her injury last year.\n\n“I don’t know whether she saw doubt in me, or whether she thought I might not believe her… [but] she had a look in her eye,” he explained.\n\n“The first run [she had since the injury], she said, ‘I can’t wait to have a kick’.\n\n“Her first kick was horrible – it was all over the shop.”\n\nThat was at “about the five or six-month mark”, Gowans estimates.\n\n“She followed exactly what the rehab plan was to the letter, which is hard to do as an athlete,” Gowans explained further.\n\n“It was the extra stuff. She just wouldn’t accept that she can’t do more kilometres… or get back quicker.\n\n“It was all about what she could do that didn’t break the rules of rehab – the touches, the vision and the things like that, the extra ice baths, the extra massages.\n\n“She just ticked so many boxes and she didn’t miss a beat and came back in pre-season and broke her PB in the time trial, she’s benching and deadlifting record weights for her, she completely changed the way she eats… you just never doubted her [through her comeback process].”\n\nMolloy even picked the brain of Australian Football Hall of Fame member Erin Phillips about her own injury comebacks.\n\n“I think she’ll break the [goals in a single game] record,” Gowans said of his star.\n\n“And if you’re playing a clutch game or a grand final, she’s the type of person who would thrive on it.\n\n“She won’t have any doubt at all – she’s made for the big moments.\n\n“[Her teammates] can see that she leads the way by example, and they just follow her.\n\n“She brings them into the game as well.\n\n“[And] we put her on the ball in the centre bounce last weekend and she got a couple of clearances, but it was more the velocity and the power… she breaks lines.”\n\nNow Molloy is dominating to the point that her coach urges anyone with even a fleeting interest in footy to come along and see her in action.\n\n“You actually go to the game of football just to watch her, regardless of whether you’re a male or female football lover,” Gowans said. “She drags people through the gates, and people are better for going to see Chloe Molloy play.”",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/teary-shelton-retires-hurt-20250830-p5mr2v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Teary Shelton retires hurt",
    "publish_date": "Sat, 30 Aug 2025 09:59:38 +1000",
    "category": "finance",
    "authors": [],
    "text": "Teary Shelton retires hurt\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/brisbane-backed-solomon-kings-accepted-into-new-competition-20250830-p5mr2e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane-backed Solomon Kings accepted into new competition",
    "publish_date": "Sat, 30 Aug 2025 09:39:36 +1000",
    "category": "sports",
    "authors": [
      "Cameron Atfield"
    ],
    "text": "Brisbane-backed Solomon Kings has been accepted into the Oceania Football Confederation’s new FIFA-backed Pro League, deepening links between the Solomon Islands and Queensland.\n\nThe joint venture between the Solomon Islands Football Federation and Brisbane bayside club Wynnum Wolves will play their first match in January, subject to the final licensing and compliance process.\n\nThe fledgling club has been touted as an opportunity for Australia to counter China’s growing influence in the Pacific nation, similar to the federal government’s $600 million commitment to a Papua New Guinea NRL team.\n\nWhen built, the Clare Polkinghorne Centre at Wynnum Wolves’ Carmichael Park will serve as the Solomon Kings’ Australian training base. Credit: JSTN Architects\n\n“This is a historic moment for Oceania football. For the first time, our region will have a professional league that provides a pathway for players, coaches, and clubs to compete at the highest level within the Pacific,” OFC secretary Franck Castillo said.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/business/companies/runners-of-the-week-invictus-basin-energy-ark-mines-and-techgen-20250830-p5mr2r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Runners of the Week: Invictus, Basin Energy, Ark Mines & TechGen",
    "publish_date": "Sat, 30 Aug 2025 09:32:50 +1000",
    "category": "finance",
    "authors": [
      "Andrew Todd"
    ],
    "text": "Bulls N’ Bears’ Runner of the Week is African oil and gas hopeful Invictus Energy, which has stirred from its slumber this week with hopes of unlocking its flagship Cabora Bassa project in Zimbabwe.\n\nThe company could be something of a leviathan, having inked a blockbuster deal with Qatar’s Sheikh Mansour for a maxed out 19.9 per cent equity stake for a measly $37.8 million at 9.5c per share. The investment is accompanied by a pivotal US$500 million in conditional future funding to push Invictus’ mammoth Mukuyu gas discovery toward commercial production.\n\nInvictus says it and Al Mansour Holdings will also form Al Mansour Oil & Gas (AMOG), a joint venture to acquire producing and near-term oil and gas assets across Africa, with Invictus handling technical and operational management and Al Mansour providing funding, what a combo.\n\nA representative from Al Mansour will join the Invictus board to cement the partnership, as the long-dormant Cabora Bassa project in Zimbabwe’s Muzarabani Basin looks destined to finally flow gas to the African market.\n\nCabora holds an insane, estimated 20 trillion cubic feet (Tcf) of gas and condensate potential – that’s trillion with a ‘T’ - making it one of Africa’s largest undeveloped gas fields.\n\nShares, accordingly surged 145 per cent on Wednesday’s announcement, followed by another rocketing leap of 42.31 per cent on Thursday, to a 12-month high of 18.5c, with $30 million in stock traded.\n\nThat combined uptick added nearly $36 million in paper value to Al Mansour’s holdings - not bad for a couple of days work.\n\nIf AMOG’s M&A spree delivers and Mukuyu flows, Invictus could transform from a rusted-on Zimbabwean junior to a pan-African titan.\n\nBASIN ENERGY LIMITED (ASX: BSN)\n\nUp 220% (2.5c - 8c)\n\nSnagging silver is Canadian-based uranium explorer Basin Energy, after the explorer scooped up private critical minerals company in NeoDys, securing a prime position in northwest Queensland’s Mount Isa region.\n\nNeoDys’ extensive ground lies southwest of the world-renowned Mt Isa, next to Paladin Energy’s Valhalla hard rock uranium deposit – a hefty 116-million-pound uranium deposit - and Red Metals’ giant Sybella clay rare earths deposit.\n\nThe deal offers three exploration models for Basin in the humming uranium and rare earth critical minerals. From paleochannel uranium to hard-rock rare earths and clay hosted rare earths, the deal comes with a helpful $150,000 Queensland government grant to fund exploration.\n\nThe deal was accompanied by a $1.25 million placement to fund drilling later this year.\n\nAs rare earths and uranium roar back to life, so did Basin’s share price, which rocketed 220 per cent to a high of 8c on $2.5 million in stock traded on Wednesday.\n\nThe company, which listed in late 2022, has its sights set on developing it uranium portfolio housed within the world-class Athabasca Basin in Saskatchewan, Canada.\n\nHome to giants like Cameco’s McArthur River, Basin’s North Millennium, Geikie and Marshall projects were promised to chase shallow, high-grade uranium, with sniffs of radioactivity uncovered in 2023 before the uranium price cratered last year.\n\nWith Athabasca’s uranium pedigree and Queensland’s dual-play potential, Basin’s low-cost aircore drilling could prove potent. While uranium mining is still currently banned in Queensland, the project’s rare earths prospects could quickly turn out massive resources like Red Metal’s multi-billion tonne clay rare earths deposit next door. The upside on this new style of mineralisation remains unknown but should the economics prove positive at Red Metal, the district will be set alight in an area dominated by both Red Metal and now Basin.\n\nARK MINES LIMITED (ASX: AHK)\n\nUp 192% (18.5c – 54c)\n\nTaking bronze is Ark Mines Limited, another junior explorer targeting – you guessed it - rare earths and even heavy mineral sands to supply the West’s clean energy transition technologies.\n\nThe company received a massive boost to its potential this week in the form of a $4.5 million handout from the Queensland Investment Corp (QIC) Critical Minerals and Battery Technology Fund for its Sandy Mitchell project 230 kilometres northwest of Cairns.\n\nThe funding consists of a $4 million royalty-tied capital injection and a $500,000 equity investment at 16.7c - following extensive due diligence by the QIC, which manages a whopping $131.2 billion portfolio.\n\nArk says the cash will fast-track a stage-3 infill drilling program and a prefeasibility study at Sandy, targeting production by late 2027.\n\nSandy Mitchell hosts a measured resource of 71.8 million tonnes at 1732 parts per million (ppm) monazite equivalent, with an exploration target of 1.3–1.5 billion tonnes at 1286–1903 ppm.\n\nThe project’s monazite-rich sands contain key magnet REEs including neodymium and praseodymium, both vital for EV motors and wind turbines. Its shallow, open-pit-friendly deposit and Queensland’s infrastructure also support low-cost mining.\n\nA scoping study estimates a $120–150 million development cost, with annual EBITDA of $45–53 million and approximately 80 local jobs. Shares soared 192 per cent to a three-year high of 54c on $870k in stock traded.\n\nAnd while monazite-rich sands contain key magnet REEs like neodymium and praseodymium, vital for EV motors and wind turbines, and Ark’s shallow, open-pit-friendly deposit and Queensland’s infrastructure support low-cost mining, scaling a billion-tonne dream in remote terrain is no walk in the park.\n\nAligned with Australia’s push for supply chain security amid global REE shortages, Sandy Mitchell’s massive exploration target could make it a globally significant hub, but environmental and logistical hurdles in Cape York’s rugged landscape remain.\n\nTechGen Metals Limited has identified two parallel high-grade copper gossans and iron quartz gold zones at its Blue Devil project, 40km northeast of Halls Creek in Western Australia.\n\nTECHGEN METALS LIMITED (ASX: TG1)\n\nUp 165% (2c – 5.3c)\n\nRounding out this week’s Runners is copper-gold hopeful TechGen Metals, which was shot out of a cannon this week after it identified two parallel high-grade copper gossans and iron quartz gold zones, just 80m apart, at its Blue Devil project, 40km northeast of Halls Creek in the Halls Creek Orogen.\n\nRock chip samples along a 2km east-west corridor returned grades up to 52.3 per cent copper, 22.6 per cent copper and 5.35 grams per tonne (g/t) gold.\n\nThe Blue Devil project has never been drill-tested, giving TechGen a rare greenfield opportunity to deliver a potentially significant copper-gold discovery, with key targets stretching nearly 3km.\n\nThe company says a critically important heritage survey with the Jaru People is now complete, with tenure granting imminent and an IP survey planned to refine its 2.75km intrusion-related target in the winds.\n\nAs gold prices soared so did TechGens market cap, flying up a staggering 165 per cent to a high of 5.3c on $4.5 million in stock traded.\n\nThe mineralised hotspot is known for structural complexity and rich deposits. Notable projects include IGO’s Halls Creek copper-zinc revival.\n\nShould Blue Devil’s high-grade surface results and undrilled status position it as a major greenfields discovery in the surging red and yellow metal sectors, the rare greenfields discovery would be accompanied with a rare share price jump for the ages??\n\nIs your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/how-beating-australia-helped-launch-the-career-of-a-world-rugby-star-20250827-p5mqb7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How beating Australia helped launch the career of a world rugby star",
    "publish_date": "Sat, 30 Aug 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Frances Howe"
    ],
    "text": "When Ilona Maher posed for the September 2024 cover of Sports Illustrated magazine, she held an Olympic medal taken from the hands of the Australian team.\n\nOn Sunday, Australia will attempt to stop Maher and the US from depriving them of another medal at a major tournament. But if they lose again, Australia are set to leave the Women’s Rugby World Cup with nothing.\n\nAustralia will play Ilona Maher’s US side after losing to them at the 2024 Olympics. Credit: Getty/Ben Watts\n\nLast year, Australia was 15 seconds from a podium finish at the 2024 Olympics in Paris. The bronze medal they were on track to win would have been a mere consolation prize for a team that could have won gold, forced upon them by a Canadian upset in the semi-final.\n\nInside those 15 seconds, USA’s Alex Sedrick scored and converted her own try to steal the bronze and hand the medal to Maher, whose online profile has surged from the social media content she made during the Olympics.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/lifestyle/will-king-charles-and-prince-harry-reunite-20250830-p5mr2k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Will King Charles and Prince Harry reunite?",
    "publish_date": "Sat, 30 Aug 2025 08:50:16 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Will King Charles and Prince Harry reunite?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/lifestyle/king-charles-and-prince-harry-royal-reunion-reports-20250830-p5mr2h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King Charles and Prince Harry royal reunion reports",
    "publish_date": "Sat, 30 Aug 2025 08:36:32 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles and Prince Harry royal reunion reports\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/3rd-round-highlights-jessica-pegula-v-victoria-azarenka-20250830-p5mr2g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "3rd Round Highlights | Jessica Pegula v Victoria Azarenka",
    "publish_date": "Sat, 30 Aug 2025 08:29:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "3rd Round Highlights | Jessica Pegula v Victoria Azarenka\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/3rd-round-highlights-elena-rybakina-v-emma-raducanu-20250830-p5mr2f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "3rd Round Highlights | Elena Rybakina v Emma Raducanu",
    "publish_date": "Sat, 30 Aug 2025 08:28:53 +1000",
    "category": "finance",
    "authors": [],
    "text": "3rd Round Highlights | Elena Rybakina v Emma Raducanu\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/3rd-round-highlights-frances-tiafoe-v-jan-lennard-struff-20250830-p5mr2d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "3rd Round Highlights | Frances Tiafoe v Jan-Lennard Struff",
    "publish_date": "Sat, 30 Aug 2025 08:16:24 +1000",
    "category": "finance",
    "authors": [],
    "text": "3rd Round Highlights | Frances Tiafoe v Jan-Lennard Struff\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/aussie-womens-marathon-selection-debacle-20240529-p5jhsc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie women's marathon selection debacle",
    "publish_date": "Sat, 30 Aug 2025 08:15:05 +1000",
    "category": "sports",
    "authors": [],
    "text": "Aussie women's marathon selection debacle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/3rd-round-highlights-luciano-darderi-v-carlos-alcaraz-20250830-p5mr2b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "3rd Round Highlights | Luciano Darderi v Carlos Alcaraz",
    "publish_date": "Sat, 30 Aug 2025 08:13:23 +1000",
    "category": "sports",
    "authors": [],
    "text": "3rd Round Highlights | Luciano Darderi v Carlos Alcaraz\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 34
  }
]