[
  {
    "url": "https://www.9news.com.au/national/plane-crashes-in-front-of-crowds-during-performance-at-avalon-airshow/678d697e-7d39-49e4-92f3-1ca02dd28cbe",
    "title": "Stunt flyer Glenn Collins remains in hospital after Avalon Airshow crash",
    "publish_date": "Sat, 29 Mar 2025 00:45:37 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "A pilot who crashed during a demonstration flight at Avalon International Airshow in Victoria is in a serious but stable condition in hospital, his team have said in a statement.\n\nThe aircraft, piloted by Glenn Collins from Paul Bennet's Airshows team, lost control while performing a manoeuvre and crashed into the tarmac just after 5pm.﻿\n\nVision from the scene shows the aircraft slamming into the ground.\n\nREAD MORE: Prime Minister Anthony Albanese calls federal election for May 3\n\nVision from the scene appears to show one of four aircrafts plummeting to the ground during an aerobatics performance. (Facebook)\n\nCollins suffered serious upper and lower body injuries and has been taken to hospital in a serious but stable condition.\n\nThe aerobatics team Paul Bennet Airshows confirmed last night that one of their long-time pilots was involved in the crash.\n\n\"The pilot is in a serious but stable condition and has been transferred to hospital for treatment,\" the team said in a statement.\n\n\"Our thoughts are with his family and we are grateful for the emergency services who responded quickly.\"\n\nThe aircraft, piloted by Glenn Collins from Paul Bennet's Airshows team, lost control while performing a manoeuvre and crashed into the tarmac just after 5pm.﻿ (Paul Bennets Airshows)\n\n\"Our team and families appreciate the well-wishes and support.\"\n\nLater they said, \"The Bennet family and the Paul Bennet Airshows team are thinking of Glenn Collins, who remains in hospital, and his family at this time.\"\n\n\"We would like to acknowledge the extraordinary level of support from medical staff as well as messages of support received from here and around the world.\"\n\nEmergency services are on scene at the International Air Show, where a small plane has crashed on the tarmac.. (Facebook)\n\nGasps could be heard from the crowd of thousands as the plane hit the ground.\n\n\"He had broken off from the other three, and on the second loop, he just nose-dived,\" witness Jess Wright told Weekend Today.\n\n\"We all just stood up, and it was just silent.\"\n\n\"There was a little bit of a gasp, then silence.\"\n\nAfter the crash, the rest of the evening's program was cancelled as emergency services rushed to the pilot's aid.\n\nOvernight, a message on the airshow's website confirmed that the \"event will recommence, gates open 8am Saturday\".\n\nCollins has more than 2700 hours of flying experience and has previously won aerobatics competitions throughout his career, according to a biography on the Paul Bennet Airshows ﻿website.\n\nThe Australian Transport Safety Bureau (ATSB) has commenced an investigation﻿ and is appealing for any witnesses with video footage to make contact via its witness form\n\n\"The ATSB is deploying a team of transport safety investigators from its Canberra office, specialising in aircraft operations and maintenance,\" a spokesperson said.\n\n\"Investigators will conduct a range of evidence-gathering activities, including site and wreckage examination, and recovery of any aircraft components for further examination at the ATSB's technical facilities in Canberra.\n\n\"Investigators will also seek to interview any involved parties, and collect relevant recorded information including available flight tracking data, as well as pilot and aircraft maintenance records, and weather information.\"\n\nThe six-day event is the largest international airshow and aerospace and defence exposition in the Southern Hemisphere﻿.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/federal-budget-2025-tax-cuts-next-year-what-you-can-buy-with-the-extra-money-explained/7f67dca7-279c-428d-9c56-219f32523ad2",
    "title": "Exactly what you can buy with next year's 'modest' tax cut",
    "publish_date": "Fri, 28 Mar 2025 20:09:31 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "Gas is a fair bit cheaper than electricity in Australia and after energy rebates, the tax cuts should cover one quarterly\n\nenergy bill\n\nin most states including NSW, Victoria, Queensland, South Australia and Western Australia.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/youth-mental-health-service-wait-time-teenagers-in-crisis/4840a741-de63-4a8a-a6bf-918ec41620e1",
    "title": "'You don't matter': Teens forced to wait up to 127 days for mental health support",
    "publish_date": "Fri, 28 Mar 2025 03:41:11 +0000",
    "category": "lifestyle",
    "authors": [
      "Mar"
    ],
    "text": "Australian teenagers ﻿are waiting months on average for critical mental health support and experts agree it's too long.\n\nNew research has shown that lengthy wait times are associated with ﻿increased psychological distress and poor coping behaviours, putting young Aussies at greater risk while they wait for help.\n\nResearch from The University of New South Wales, Black Dog Institute, and Flinders University﻿ found that teens wait an average of 99 days for mental health support across all treatment providers.\n\nLIVE UPDATES: Prime Minister reveals election date\n\nMilly Rose Bannister, founder of youth mental health charity ALLKND, is unsurprised by new research around treatment wait times. (Graphic: Polly Hanning)\n\nMilly Rose Bannister, founder of youth mental health charity ALLKND , is devastated but unsurprised by the data.\n\n\"For a young person to reach the point of asking for help takes a lot of courage and then being told to wait three or four months can feel like being told you don't matter,\" she told 9news.com.au.\n\n\"In a world where so many teens already feel unseen, unheard, or overwhelmed, that wait time can be the tipping point.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nThe study ﻿was based on based on a survey of 375 Australians aged between 13 and 17.\n\nIt found that teen participants who initiated care with psychiatrists waited an average of 127.5 days, the longest wait time of any provider.\n\nThose seeking support from psychologists waited an average of 100.1 days, while the average wait time for paediatricians was 121.9 days, and the wait for national youth mental health foundation Headspace was 107.6 days.\n\nLong wait times can be attributed, in part, to a shortage of key providers like psychiatrists and higher demand for mental health support among young people. ﻿\n\n\"We hear stories from young people who've waited months for a first appointment, been turned away, or given referrals to services they can't afford or even get to,\" Bannister said.\n\n\"Some say they've just stopped trying [...] because the system feels impossible to navigate, especially when you're already struggling.\"\n\nMost teen participants did not receive support from healthcare providers during that wait time and reported that their mental health worsened while waiting.\n\nLonger wait times were associated with ﻿increased psychological distress, with more than two-thirds of participants reporting that feelings of sadness worsened while waiting.\n\nMany also ﻿reported engaging in unhealthy coping behaviours while waiting for care.\n\nMore than 92 per cent of participants reported engaging in maladaptive coping behaviours like spending more time alone, sleeping, or scrolling social media.\n\nA further 75 per cent reported engaging in risky behaviours such as ﻿self-harming, skipping school, drinking alcohol, vaping and smoking.\n\nLong wait times can also lead to teens not attending treatment when the time finally comes.\n\nMore than half of the 14.7 per cent of participants ﻿who reported that they were likely to attend their first treatment session said it was because \"the wait time was too long\".\n\nThere were some positives, like the fact that almost nine in 10 participants employed help-seeking﻿ behaviours while waiting for care, such as looking up mental health information online.\n\nBut overall ﻿the research highlighted the urgent need for systemic reform in the delivery of youth mental health services according to Professor Bridianne O'Dea, one of the lead researchers.\n\n\"We are now in the midst of a crisis where the demand for youth mental health care has increased rapidly in the past two decades,\" she said, via Scimex .\n\n\"The first line of treatment is psychological therapy. There is a huge demand for it and we do not have the number of clinicians required to meet that demand.\"\n\nYoung people who took part in the study called for better communication and ﻿regular check-ins from service providers to help address the burden of waiting for care.\n\nO'Dea called for the introduction of evidence-based, government-backed national wait time benchmarks to help reduce how long Australian teens wait for critical support.\n\n\"Everyone needs someone safe to talk to,\" Bannister said. (Instagram/@millyrosebannister)\n\n\"We don't accept delayed response times for physical injuries, so why do we still tolerate it for mental health?\" Bannister said.\n\nThrough ALLKND, she advocates for early intervention and funding towards ﻿youth-specific mental health services and community-based, integrated care including peer workers, school programs, and youth-led initiatives.\n\n\"Everyone needs someone safe to talk to. If we can lighten the load at the crisis end, the whole system becomes more sustainable,\" she said.\n\nWhile the 2025-26 federal budget released this week promised to inject billions into Australia's healthcare system, Black Dog Institute reported that the mental health sector remains critically underfunded.\n\nThe budget included an ﻿$8.4 billion investment over four years to boost bulk billing for GP appointments, which are usually the first port of call for young people seeking mental health treatment.\n\nMore than $784 million will go towards capping PBS medication costs over the next four years, including mental health medications.\n\nA further $46 million will go towards delivering free digital mental health tools over four years, which young Australians are already looking to for support during wait times.\n\nWATCH: Chris Kohler's two-minute guide to the 2025 federal budget﻿\n\nBannister says that while the figures sound promising, the current budget measures will have a limited impact on the youth mental health crisis.\n\n\"This is a national emergency and we cannot solve it with small-scale, long-term gestures,\" she said.\n\nWithout long-term investment into accessible services, youth mental health literacy programs, and culturally safe care for marginalised youth, Bannister fears young Australians struggling with mental health will continue to fall through the cracks.\n\n﻿\"Mental health support needs to meet young people where they are, not ask them to climb mountains to access it.\"\n\nReaders seeking support can contact Lifeline on 13 11 14 or beyond blue on 1300 22 4636. Under-25s can contact Kids Helpline on 1800 55 1800.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/kyle-jackie-o-found-to-have-breached-decency-standards-acma-radio-media-news/7917c56c-55ac-4ee1-91fb-d43168000922",
    "title": "Kyle and Jackie O breached decency standards: watchdog",
    "publish_date": "Fri, 28 Mar 2025 02:24:37 +0000",
    "category": "sports",
    "authors": [
      "Mar"
    ],
    "text": "The station has employed censors for the show since it was\n\nfound to have breached decency standards in 2023\n\nin a segment that referred to the Paralympics as the \"Special Olympics\".",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/finder-survey-most-experts-predict-rba-to-keep-interest-rates-on-hold/9c99bb5d-95c0-48a2-bafa-0d6f048ce1dd",
    "title": "Two out of three experts think RBA will keep interest rates on hold",
    "publish_date": "Thu, 27 Mar 2025 23:39:50 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "M﻿ortgage holders hoping for further relief on interest rates when the Reserve Bank of Australia meets next week will be disappointed, according to new research.\n\nThe board meeting starting next Monday will be the first since the RBA made its long-anticipated cut last month, bringing the cash rate down to 4.10 per cent.\n\n﻿Now a Finder survey of 34 economists has found two out of three think the central bank will keep the cash rate on hold when the RBA announces its decision on Tuesday afternoon (AEDT).\n\nLIVE UPDATES: PM calls election for May 3\n\nThe RBA are unlikely to deliver further relief on interest rates next week, a survey of experts has found. (9News)\n\nIt's a big shift in sentiment from hopes last month's cut would kick off consecutive cash rate reductions through this year.﻿\n\nFinder head of consumer research Graham Cooks said it looked like mortgage holders will have to hold out until May for the next cut.\n\n\"The February cut signalled a turning point for many cash-strapped borrowers – they hoped a couple more would be coming thick and fast,\" he said.\n\n\"New inflation figures show headline inflation is within target range, so while we're unlikely to see a second rate cut in April, we're anticipating further relief from May onwards.\" ﻿\n\nDespite a thumping belief the RBA will keep interest rates on hold, six of the 34 experts believe there is a case for slashing them.\n\nOne of them was Leanne Pilkington from Laing+Simmons who thinks a cut next month would be shrewd in light of recent jobs numbers.﻿\n\nLast week's data from the Australian Bureau of Statistics showed the seasonally adjusted unemployment rate remained flat at 4.1 per cent.\n\n\"As well as sustained cost of living pressure and moderating inflation, the unexpected hit to employment figures has widened the window of opportunity for the RBA to cut rates, which it is expected to do in coming months anyway. It might be prudent to act now,\" Pilkington said.\n\nThe survey was carried out before today's announcement by Prime Minister Anthony Albanese an election would be held on May 3, a factor alluded to by one expert.\n\nAustralia's fastest-selling homes: top suburbs revealed View Gallery\n\n\"Another rate cut coming soon but not just yet—it's not urgent, and the bank will want to keep a low profile during the election campaign,\" said Geoffrey Kingston, of the Macquarie University Business School in Sydney.\n\nLooking ahead, two in three experts surveyed forecast two or three more cuts this year.\n\nA thumping 93 per cent also thought lenders would continue to pass on the next cut to the cash rate in full.﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/king-charles-admitted-to-hospital-after-side-effects-from-cancer-treatment/931a1cb5-3d7e-4df2-906f-11a21049111e",
    "title": "King Charles hospitalised following 'side effects' from cancer",
    "publish_date": "Fri, 28 Mar 2025 09:00:00 +0000",
    "category": "lifestyle",
    "authors": [
      "Mar"
    ],
    "text": "It is also the same hospital where\n\nCatherine, the Princess of Wales\n\n, had abdominal surgery in January of the same year. Kate was later diagnosed with cancer and underwent a course of preventative chemotherapy which ended in September. The 43-year-old is now in remission and has\n\nresumed a near-full program of royal events\n\nthis year.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/heart-transplant-recipient-taree-urges-organ-donation/104966790",
    "title": "Woman undergoes heart transplant within two weeks of brain surgery",
    "publish_date": "Sat, 29 Mar 2025 01:14:31 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "As Richelle Murray swims laps in her local pool, she can breathe more easily than she has for a long time.\n\n\"I feel free. I love it, life is good,\" she said.\n\nThe 63-year-old spent decades living with a rare congenital heart disease before she received a heart transplant in October 2023.\n\nIt came just two weeks after she had brain surgery after suffering a stroke.\n\n\"At the time, you aren't looking at the trauma. You are just trying to move on to the next bit,\" Richelle said.\n\n\" It isn't until later that you go, 'Oh, wow! That was a lot to cope with.' \"\n\nAfter a challenging recovery, Richelle has now made it past the critical first 12 months post-transplant and is embracing life in her community at Taree on the New South Wales Mid North Coast.\n\n\"I can take my grandkids for a swim … spending time with my family, and interacting and enjoying life. What a blessing,\" she said.\n\n\"It also makes you stop for that moment and think about where your heart came from … I'm grateful.\"\n\nRichelle says she loves feeling well enough to spend active time with her grandchildren. (Supplied: Richelle Murray )\n\nTwo of Richelle's three sons have the same genetic heart disease, which she was not diagnosed with until after starting her family.\n\nThe experience has inspired her to become an advocate for organ donation.\n\n\"I wouldn't be here if there wasn't an organ donor,\" Richelle said.\n\n\" I am living proof of the impact organ donors can have. \"\n\nLong road to heart transplant\n\nRichelle has a genetic defect on the lamin a/c gene, which causes cardiomyopathy and problems with the heart's electrical conduction system.\n\nRichelle Murray at a formal event, before having her heart transplant. (Supplied: Richelle Murray)\n\nShe noticed early symptoms, including shortness of breath in her 20s and her condition gradually worsened.\n\n'While resting, my heartbeat would race, stall, and skip in unsettling waves, causing persistent jitters,\" Richelle said.\n\n\" You don't understand what it's like for other people … until you go and do something, say a walk up a hill, and everyone is at the top of the hill, and you are only 10 per cent of the way up. \"\n\nRichelle in hospital after her transplant in October 2023, with her sons Bill Murray (left) and Nic Murray. (Supplied: Richelle Murray)\n\nBy the age of 60, Richelle had undergone multiple advanced treatments, including the installation of four pacemakers and cardiac resynchronisation therapy (CRT) — a device used to counter heart failure.\n\nBut a critical moment came when her CRT device delivered a lifesaving defibrillation, saving her life but causing her to collapse.\n\nA fresh series of health evaluations followed, and at 61, Richelle qualified for the heart transplant waiting list.\n\nJust weeks later, she had a major stroke and underwent emergency brain surgery.\n\n\"By sheer chance, I was in Sydney to do a test at the hospital … and I had the stroke in the hotel,\" she said.\n\n'If it had happened when I was home at Taree, I might not be here chatting today.\"\n\nRemarkably, less than two weeks after her brain surgery, Richelle received the life-altering phone call that a heart was available, and she needed to urgently travel back to Sydney for her transplant.\n\nFrom esky to 'heart in a box'\n\nRichelle's surgeon at Sydney's St Vincent's Hospital, Arjun Iyer, said heart transplant success rates were high.\n\nHeart transplant surgeon Arjun Iyer says technology has helped extend donor heart viability. (Supplied: Arjun Iyer)\n\n\"These days, we [St Vincent's] end up doing between 60 to 70 heart transplants a year,\" he said.\n\n\"The risk of death is generally quoted at 10 per cent within the first 12 months after a transplant … so 90 per cent of people are alive after 12 months.\"\n\nDr Iyer said technological advancements, including 'heart-in-a-box' perfusion systems, had extended donor heart viability and allowed those needing a transplant more time to get to the hospital, particularly from regional and rural areas.\n\n\"The most common way of preserving the hearts used to be in an esky with some ice,\" he said.\n\n\"We still use the cold storage old school way of preserving hearts … but as we are starting to use donors who are further away … we needed to develop further technology to try and preserve these hearts for a longer period of time.\n\n\"Sometimes the heart is in a beating state, you have it oxygenated in the machine.\"\n\nSt Vincent's Hospital Sydney is a busy Australian heart transplant centre. (ABC News: Patrick Thomas)\n\nThe machines have also paved the way for \"donation after circulatory death\" (DCD) donors, as opposed to only brain dead donors.\n\n\"It's increased our heart transplant numbers by about 30 per cent,\" Dr Iyer said.\n\nCalls for more organ donors\n\nThere is a strong need for more organ donors in Australia, with a 5 per cent decrease in the total number of transplant recipients last year.\n\nRichelle now takes immunosuppressant medications and is closely monitored, but feels strong. (ABC News: Emma Siossian)\n\nJuliana Celcer, Director of Nursing at DonateLife NSW, said one organ donor could save the lives of up to seven people, and help many more through organ and tissue donation.\n\nShe said it was essential people discussed their wishes with their families.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/food-history-curry-india-britain-colonialism-cooking/105070578",
    "title": "Curry has become symbolic of Indian cuisine, but it's more complicated",
    "publish_date": "Sat, 29 Mar 2025 01:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "When many of us think of Indian food, we think of curry.\n\nABC Every Bite Every Bite tells a story – the stories behind the food we love to eat.\n\nThat saucy and aromatic blend of spices, meat, and vegetables, often slow-cooked and served with rice and traditional naan bread or roti.\n\nBut, surprisingly, the word curry doesn't originate from India.\n\nOut of all the major pre-colonial languages spoken in India, none of them contain the word curry.\n\nSo, how did the dish become the poster child of authentic Indian cuisine?\n\nCurry's origin story\n\nPortuguese explorer Vasco da Gama reached Calicut on the Malabar Coast in 1498.\n\nIt was the beginning of the European and British presence in India that would eventually change the subcontinent in multiple ways, including shaping how we view Indian cuisine today.\n\n\"When you really dig deep, nobody really knows where [the word] curry comes from,\" Lizzie Collingham, a researcher and author, tells ABC Radio National's Every Bite.\n\nMelbourne chef Helly Raichura cooks traditional regional Indian food. (ABC Radio National: Damien Peck )\n\nDr Collingham says the arrival of the Portuguese is the earliest record of the word curry being applied to Indian dishes.\n\nWith the arrival of European and British settlers in India, mainly around Goa and Cochin (now Kochi), the word curry became a way to refer to what Indian people were eating.\n\n\"Curry was a word the Portuguese used and then when the British picked it up … That's what they called any dish that an Indian [person] ate,\" Dr Collingham says.\n\nBut it wasn't what Indian people called their food.\n\nThe colonisation of India's cuisine\n\nOver time Indian dishes, like many other traditional cuisines around the world, have evolved through colonisation and migration.\n\nMany of the ingredients thought of as staples of Indian food, including curry, were historically introduced to the subcontinent, often by a colonial presence or changes within society.\n\nLizzie Collingham says the history of the word \"curry\" is complicated. (Penguin Books: Terry Roopnaraine)\n\nFor example, when the Portuguese arrived in Goa, India, they found that the Brahmins (priests who belonged to the highest Hindu hereditary class) didn't eat onion and garlic for spiritual reasons.\n\n\"Brahmins wouldn't have used onion and garlic because they were considered rather heating and dangerous foods for spiritual people,\" Dr Collingham says.\n\n\"But the ruling classes would eat quite a lot of it, and meat, and put a lot of spices in.\"\n\nAnd chillies? They didn't exist in India until the Portuguese settlers brought them to Goa and Cochin from the Americas.\n\nIn fact, it was black and long pepper that were used by Indian people during that period to add heat to their food.\n\nThe exchange of spices and regional ingredients was part of the reason why the Portuguese had a presence in India, Dr Collingham explains.\n\nAn ingredient synonymous with Indian food, chillies were actually introduced by European settlers from the Americas. (Supplied: Hardie Grant Publishing)\n\n\"Cardamoms grow in the hills in what's now Kerala above Cochin. And you've got spices being brought in like nutmeg and cloves … So, all those spices would have been plentifully used in Indian food in that period,\" she says.\n\nAnd so in Goa, during this time, dishes that we now associate with the term \"curry\" began to emerge.\n\nThe British touch\n\nOver a long period, the British presence in India increased. Eventually, it transitioned into political and military dominance over a large part of the country.\n\nStream your favourite shows on the free ABC listen app Photo shows Image of Dr Karl on a pink background and Listen app logo Dr Karl knows the best app for free podcasts, radio, music, news and audiobooks … and you don't need to be a scientist to find it!\n\nThe British had Indian cooks working for them, and these workers would adapt their food to suit their customers.\n\n\"It was too spicy and too difficult for the English to digest … So they adapted their dishes to meet British tastes,\" Dr Collingham says.\n\nThe British enjoyed these dishes and tried to replicate them back in Britain, but they found being authentic to the process was too labour-intensive.\n\nCurry is symbolic of Indian food, but its affiliation is complicated for many. (ABC News: David Sier)\n\n\"They [the British] have this awful way of whatever they touch, they tend to homogenise,\" she says.\n\nAnd soon curry powder came to be. It was an entirely British invention.\n\n\" So they fry some onions, they dump in some curry powder, they dump in some meat and water, and they stew it … And that's what the British call curry. \"\n\nTrue to home\n\nAuthentic Indian cuisine is based on seasonal produce specific to the regions. And it's traditionally reflective of the classes Indian people belong to.\n\nChef Helly Raichura, who owns the Melbourne Indian restaurant, Enter via Laundry, says adapting to changing seasonal and historical environments is a feature of Indian cuisine.\n\nSpices were a hot trade item for many years. (ABC: Damien Peck)\n\n\"Evolution is the only constant in Indian food because it has changed so much,\" she says.\n\nMs Raichura avoids cooking stereotypical Indian cuisine in her restaurant.\n\nInstead, she relies on the foundations of what was passed down through her family to cook what she believes is an authentic Indian regional menu.\n\n\"They [her ancestors] were very much connected to the land. They were very much connected to where they were and taking and using things that were seasonal for them,\" she says.\n\nChef Helly Raichura says using in-season ingredients is key. (ABC: Damien Peck )\n\nWhen Ms Raichura arrived in Australia, she was surprised to see seasonal produce wasn't prioritised in the same way it is in India.\n\n\"It was very shocking to me to see very bad quality tomatoes that you can still buy in winter … I was like, just don't sell it,\" she says.\n\nMs Raichura believes India's strong relationship with seasonal food enhances the eating experience.\n\n\"There are rituals and recipes at specific times of the year that are cherished,\" she says.\n\n\"You're not getting strawberries in winter, you're waiting for it. There's an anticipation.\"\n\nThe intersection of curry and identity\n\nWe've often heard Italians baulk at the Westernised state of Italian cuisine — particularly pizza.\n\nAnd the same thing can be said for many traditional cuisines around the world including Japanese, Thai and Mexican.\n\nSo it's little wonder that many Indians have struggled with associating curry as a symbol of authentic Indian cuisine.\n\nHelly Richura says Indian food is constantly evolving. (ABC Radio National: Damien Peck )\n\n\"I think there are a lot of layers to what Indian food is and layers of history and then when you put it down to just the C word [curry] … you know?\" Ms Raichura says.\n\n\"For the longest time ever, no self-respecting Indian said, ‘I'm going to have a curry tonight' … That wasn't in the vocabulary,\" Dr Collingham says.\n\nUnderstanding the history of their cuisine, and how it shapes their identity today is sometimes a complex task for Indians, Canadian author Naben Ruthnum adds.\n\n\"I'm a postcolonial mess of a person over here who's scraped together an identity that has very little to do with my country of origin.\"\n\nAnd today, for many Indians all over the world, curry has taken on a different meaning, despite its ambiguous and colonial origins.\n\n\"To me, it's come to sort of represent a blend of identities,\" Ruthnum says.\n\nDespite being a colonial invention, some Indians have learned to embrace the word curry and reclaim the dish as symbolic of their complex history, he explains.\n\n\"It's come to represent a food that I really like, and it's come to represent all the things that I didn't really understand about history and myself.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/sewage-running-through-north-queensland-properties/105101932",
    "title": "Sewage running through North Queensland properties as rain continues",
    "publish_date": "Fri, 28 Mar 2025 23:51:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Raw sewage is running through properties in Australia's largest northern city after months of record-breaking rain.\n\nMore than two metres of rain has fallen in Townsville since January, with the city on track to beat its 25-year annual rainfall record of 2,400 millimetres within days.\n\nThe near-unprecedented rain has put extreme pressure on sewerage infrastructure.\n\nResidents say they are living in intolerable conditions, with reports of sewage flowing back through pipes and onto properties.\n\nHealth concerns\n\nAndrew and Sue Koning this week again woke up to human waste and sodden toilet paper bubbling from a drain on their driveway.\n\nAndrew Konings says his driveway flooded with sewage during heavy rain this week. (Supplied: Andrew Konings)\n\n\"We've been having a shit time, literally,\" he said.\n\n\" Every time we get a pretty decent mob of rain, we get sewerage flooding out through our property. \"\n\nThe Konings have had to hose sewage away to get to their cars numerous times since heavy rain started in the city on January 31.\n\n\"If you don't get onto it straight away, it just stinks,\" he said.\n\nMr Koning said the local council has told him that incessant rain has overwhelmed the city's sewerage system, and little could be done until rain eases.\n\nCamp amenities\n\nThe Townsville suburb of Wulguru has had long-running issues with the sewerage system, but it's been especially bad this wet season.\n\nWulguru resident and mother-of-four Brittany Giudes said the situation was intolerable.\n\nBrittany Giudes says drastic remedial work had to be undertaken on her bathroom. (ABC North Qld: Cameron Simmons)\n\n\"We've just had sewage coming up every drain possible in our house,\" she said.\n\n\" Raw, human sewage waste from the laundry to the bathroom. \"\n\nA back-flow valve installed by the council has now prevented sewage erupting through pipes on the property, but the family can only use a camp shower and toilet until the situation is resolved.\n\n\"We need a permanent solution,\" Ms Giudes said.\n\nA few blocks away, 85-year-old Betty Cutts has to use a modified bucket for a toilet and can no longer wash her clothes or use a shower.\n\n\"I can smell it from the shower, from the toilet, from the sink in the laundry,\" she said.\n\n\"It makes me sick.\"\n\nBetty Cutts can no longer wash her clothes or use her toilet or shower. (ABC North Qld: Cameron Simmons)\n\nSystem overwhelmed\n\nTownsville City Council general manager for water services, Travis Richards, said the sewerage system had been overwhelmed with rainfall and stormwater during a record wet season.\n\nHe estimated there had been upwards of 600 complaints about the system this year but stressed the vast majority of homes in Townsville were fine.\n\nMr Richards said low-lying and older areas were under pressure.\n\n\"There's a significant amount of more water to move around, and that uses up capacity in the system, and in certain areas, people can't use their toilet or their shower because there's literally no room left,\" he said.\n\nMr Richards said the council was working with residents to clean up and disinfect areas, and improvements had been made in Wulguru.\n\n\"We do have small pockets still affected and we are working on effective infrastructure solutions for them,\" he said.\n\n\" There's no silver bullet. \"\n\nLonging for clear skies\n\nAndrew and Sue Konings said the impacts of this year's rain had been the worst they had seen.\n\n\"It's not just another wet season — my wife and I have never seen it this bad,\" Mr Konings said.\n\n\"I just hope it can be sorted out so we can wake up in the morning and I'm not spending half an hour to get rid of the sewage and the smell.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/daria-kasatkina-switches-allegiances-to-represent-australia/105112096",
    "title": "Kasatkina, world number 12, switches allegiances to represent Australia",
    "publish_date": "Fri, 28 Mar 2025 23:50:18 +0000",
    "category": "sports",
    "authors": [],
    "text": "Russian-born tennis star Daria Kasatkina is switching allegiances to Australia after her application for permanent residency was accepted by the government.\n\nThe world number 12 has been playing on the tour as a neutral athlete after Russian and Belarusian players were banned from competing under their own flags following Moscow's invasion of Ukraine in 2022.\n\nIn an Instagram post, Kasatkina expressed her joy in gaining permanent residency in Australia.\n\n\"I am delighted to let you all know that my application for permanent residency has been accepted by the Australian government.\n\n\"Australia is a place I love, is incredibly welcoming and a place where I feel totally at home.\n\n\"I love being in Melbourne and look forward to making my home there.\n\n\"As part of this, I am proud to announce that I will be representing my new homeland Australia, in my professional tennis career from this point onwards.\"\n\nThe 27-year-old rose as high as number eight in the world and has won eight WTA titles — her best grand slam result coming at the French Open where she reached the semi-finals in 2022.\n\nAAP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/cricket-south-australia-queensland-sheffield-shield-live-updates/105087914",
    "title": "Sheffield Shield final live: South Australia rocked early by Queensland facing record chase",
    "publish_date": "Fri, 28 Mar 2025 23:49:23 +0000",
    "category": "sports",
    "authors": [],
    "text": "South Australia will require the highest ever successful run chase in Sheffield Shield final history if it is to defeat Queensland in an engrossing match at Karen Rolton Oval.\n\nCheck out the live scores and stats in our ScoreCentre.\n\nScorecard\n\nManhattan\n\nBall-by-ball\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/voluntary-assisted-dying-vad-advanced-care-directive-dementia/105083302",
    "title": "Assisted dying rules exclude people with dementia. Will it change?",
    "publish_date": "Fri, 28 Mar 2025 23:22:10 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Sue Starr would rather end her life than spend years battling dementia.\n\nThe former home care worker has even put that on record, asking for access to Voluntary Assisted Dying (VAD) should she be diagnosed.\n\nBut it would currently be illegal for anyone to make good on that request.\n\nAdults with a terminal illness can apply for medicine to end their lives in all Australian states, with the Australian Capital Territory to start in November.\n\nBut applicants must meet strict criteria, including having \"decision-making capacity\" and their illness is likely to cause death within six to 12 months.\n\nThis effectively bars access to anyone with dementia.\n\nMs Starr, who spent 12 years working at Home Care in the West Australian seaside town of Esperance and currently runs the local chapter of Death Cafe, wants that to change.\n\nAlthough she is currently healthy, she is adamant that if diagnosed with dementia, she \"would rather go quickly\".\n\n\" If I can't make my decisions anymore for myself, and if I can't wash and clean myself and feed myself under my own direction, then I want to access Voluntary Assisted Dying. \"\n\nMs Starr has requested access to VAD if she has dementia and is deteriorating. (ABC Esperance: Emily Smith)\n\nMs Starr has used an Advanced Health Directive, a legal document setting out a person's healthcare wishes for when they can no longer make them, to request access to VAD after two years of living with dementia.\n\nShe knows it would currently be illegal for any healthcare professional to follow through on this request, but wanted it recorded anyway.\n\n\"My first port of call was to say to my doctor … 'Can you just put it in your record that if I'm diagnosed with dementia, I want to access Voluntary Assisted Dying?',\" she said.\n\n\"And he said, 'I can't do that because it's not legal'.\n\n\" And I said, 'I realise that but in the future it may be'. \"\n\nDementia Australia said the illness was on track to become the country's leading cause of death and currently affects an estimated 433,300 Australians.\n\nMs Starr is among those urging state governments to at least discuss the possibility of broadening VAD laws to include dementia in the future.\n\nBut recent reviews of WA and Victoria's laws barely touched on the subject.\n\nMs Starr hopes eligibility laws for VAD will expand in the future. (ABC Esperance: Emily Smith)\n\nDementia debate\n\nDying with Dignity WA president Steve Walker has long urged the state government to consider expanding VAD laws to people with dementia through an Advanced Health Directive.\n\nHe was disappointed the idea was not considered during a statutory review of WA's laws last year, particularly as other countries now allow it.\n\n\"The government in effect, they shutdown any discussion on this,\" he said.\n\nWA Health Minister Meredith Hammat said the review was never about changing the scope of current laws, only assessing whether they were working as intended.\n\nShe said it was vital people accessing VAD could provide informed consent throughout the entire process.\n\nAustralian Medical Association's ethics and medico legal committee chair Kerrie Aust is a big believer in broader public debate about VAD.\n\nCanberra GP Dr Kerrie Aust does not support expanding VAD laws for people with dementia. (Supplied: Ainsley Fisher)\n\nBut she did not currently support opening access to those with dementia.\n\n\"My personal view is that we don't have sufficient processes in place to have dementia included as part of an Advanced Care Directive,\" she said.\n\n\"Where my hesitation comes in is because you often don't know what your future self would want.\n\n\"Dementia is a very broad spectrum, and I think an assumption that all people with dementia are suffering and unhappy is not the experience of the majority of our geriatricians.\"\n\nShe said it was certainly worth monitoring the success of models used overseas and evaluating their data to see the potential risks and benefits in the future.\n\nMore than law change required\n\nSouth Australia-based wills and estates lawyer Nikki Owen said a person who requests VAD through an Advanced Health Directive today would be very unlikely to ever access it, even if laws around dementia were to change.\n\nNikki Owen says strict rules limit access to VAD for people with dementia in countries where it is legal. (Supplied: Mellor Olsson Lawyers)\n\nAcross the handful of countries where people with dementia can access VAD, strict parameters are in place.\n\nIn Canada's Quebec, for example, the request to access VAD must be formalised after being diagnosed with Alzheimer's but before losing the ability to make informed decisions.\n\nMs Owen believed if any Australian states were to permit VAD for people with dementia in the future, it would be with similarly strict conditions and the Advanced Health Directive would need to be formulated after the law came in.\n\nBut she said she had come across those determined to include it.\n\n\"I've come across one or two and I've explained to them that it's not legally binding,\" she said.\n\n\"[But] there's no harm in it.\n\n\"As long as you just expressed the wish and you say in there that you understand it at the moment, it's not something that you can bind anybody to do.\"\n\nMs Starr believes there was value in having her views formalised.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/gold-coast-light-rail-consultation-to-favour-locals-opinion/105103448",
    "title": "Light rail survey to favour neighbouring residents above others",
    "publish_date": "Fri, 28 Mar 2025 23:06:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Residents in one of Australia's fastest growing cities will be able to have their say on a controversial light rail project for the second time in three years.\n\nBut this time not everyone's opinions will be viewed equally.\n\nThe light rail Stage 3 is currently under construction to Burleigh Heads. (ABC News)\n\nLocals who live near Stage 4 of the Gold Coast's light rail project will have their views prioritised, according to Deputy Premier Jarrod Bleijie.\n\nHe said it was because the project was \"forced upon the people of the southern end of the Gold Coast without proper community consultation\".\n\nJarrod Bleijie said he was listening to what southern Gold Coasters want. (ABC News: Lucas Hill)\n\nA consultation by the previous state government found more than 60 per cent of residents and businesses supported the final stage of the project, which is set to run 13 kilometres from Burleigh Heads to Coolangatta.\n\nThat independent research surveyed over 1,000 businesses and residents over 220 hours.\n\nPalm Beach brewer John Graham supports the project, but resides in an area home to vocal opposition to the project.\n\nHe said Palm Beach had gentrified in the 24 years he had lived there, with cranes and high-rises popping up along the once sleepy beachside strip.\n\nJohn Graham hoped the light rail would free up Palm Beach car spots. (ABC Gold Coast: Julia Andre)\n\nHe said the light rail line would benefit the suburb by taking cars off the road and allowing people to more easily access public transport.\n\nHowever, Palm Beach cafe owner Todd Hiscock does not want rail to run along the beachfront like the existing line from Surfers Paradise to Broadbeach.\n\nTodd Hiscock does not want to see the fourth stage of the light rail go ahead. (ABC Gold Coast: Julia Andre)\n\n\"[I'm] all for public infrastructure, but infrastructure that actually improves the situation, not makes it worse,\" Mr Hiscock said.\n\nHe said he preferred more bus lanes, which had previously been investigated in government reports and were found to be slower, have a shorter life span, and have a \"similar range of cost\".\n\n'Describe a great public transport system'\n\nWhat the light rail might look like over Currumbin Creek on the Gold Coast. (Supplied: Queensland government)\n\nIn the latest surveys for the project, residents were asked to enter their address, but they do not have to provide their name or identifiable information.\n\nIt appears that multiple submissions can be made from a single address.\n\nThe four questions asked in the latest light rail survey: How would you describe a great public transport system for your local area?\n\nWhat are your concerns on the current proposal for light rail expansion in the southern Gold Coast?\n\nDo you feel that you were properly consulted in the prior process?\n\nIn your opinion, what key features or services are important to consider for developing a great public transport system in your local area? Residents are also asked to rank whether affordability, accessibility, frequency, or proximity is most important when considering public transport options.\n\nMr Bleijie said southern Gold Coast residents' submissions would be prioritised over others and that he was open to all modes of transport.\n\n\"Those residents in the southern Gold Coast will be obviously taken into more consideration because that's who we have committed this promise to,\" he said.\n\nThe LNP government promised to review the project ahead of last year's state election.\n\n\"We promised we'd listen to them and take their feedback on board. We all know the Labor party already had made up their mind [on the project],\" Mr Bleijie said.\n\nSupport for reviews\n\nReal estate developer Steven Harrison, who leads the business advisory that advocates for the project, said he welcomed the new consultation process.\n\nBut he said he was concerned about discussion again about different transport modes, adding that buses were not as efficient as the light rail which has been used by about 92 million passengers since the Gold Coast line opened.\n\nThe light rail in Nerang on the Gold Coast. (ABC News: Richard Johnson)\n\n\"We've got a small footprint along that coastal route, we need to be more efficient with how we move people,\" Mr Harrison said.\n\n\"I hope the current government hasn't decided against light rail to the airport.\"\n\nOpposition leader Steven Miles said the LNP had never supported Stage 4. (ABC News: Kenji Sato)\n\nQueensland state opposition leader Steven Miles said local LNP state MPs in the area had \"consistently undermined\" the project.\n\n\"They've been looking for ways to stop it,\" he said.\n\n'Got to explain truthfully'\n\nGold Coast Mayor Tom Tate said the current survey method prioritising the views of residents on the southern end of the Gold Coast was \"not normal\".\n\n\"Perhaps it's contentious politically for them [the government],\" he said.\n\nGold Coast Mayor Tom Tate has long advocated to transform the city's public transport system. (ABC Gold Coast: Dominic Cansdale)\n\n\" There's got to be balance. You've got to explain truthfully 'yeah, there's a lot of pain but there's a lot of gain'. \"\n\nHe said southern Gold Coast suburbs face increasing congestion and the light rail was his solution to the issue as residents face the threat of gridlock within the next few years.\n\nHe said if campaigns by neighbouring residents resulted in the rail line being scrapped \"that's the consequence that you're going to have to live with\".",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/energy-analysts-warn-nt-gas-wont-guarantee-cheap-power/105107864",
    "title": "Analysts warn reliance on Beetaloo gas over renewables a risky strategy",
    "publish_date": "Fri, 28 Mar 2025 22:46:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Northern Territory government is relying on gas as the key to bringing down local power prices, but energy analysts say it's risky to put all the eggs in the gas basket.\n\nOn Thursday, the NT Country Liberal Party (CLP) government officially scrapped its target of 50 per cent renewables by 2030.\n\nRenewables Minister Gerard Maley said he wanted a mix of energy sources.\n\n\"We've either got gas or renewables, and renewables has failed dismally,\" he said.\n\n\" We've got gas — that's what we've got to use and that's what we'll be relying on. \"\n\nGerard Maley says renewable energy is expensive. (ABC News: Pete Garnish)\n\nThe Northern Territory has lagged behind every Australian jurisdiction in the switch to renewables, behind Western Australia and Queensland, according to Climate Council data.\n\nGas policy has devil in the detail Photo shows Liquified natural gas plant and LNG ship on Curtis Island, Queensland Experts say the time to establish a gas reservation policy has passed, and plans to bring more gas online are years away and will fail to provide immediate relief to power prices.\n\nTasmania achieved 100 per cent renewable energy generation in 2020, while South Australia is on track to join it by 2027.\n\nAlan Langworthy, author of the NT government's 2017 Roadmap to Renewables report, said solar power was the cheapest wholesale source of electricity in the territory.\n\nBut he said the previous NT Labor government hadn't prepared the network for it.\n\n\"It's too late,\" he said.\n\n\"We don't have enough time to get from where we are, to where we need to be for 2030.\"\n\nAlan Langworthy is the architect of the NT government's Roadmap to Renewables report. (ABC News: Pete Garnish)\n\nMr Langworthy said he'd tried to develop a 50-megawatt solar farm at Livingstone, south of Darwin, with funding from local investors.\n\nHowever, the solar farm failed to ever be connected to the grid.\n\n\"Nothing was being done on the network side to make way for new technology,\" he said.\n\nIs gas from the Beetaloo Basin guaranteed?\n\nSaul Kavonic, the head of energy research at MST Marquee, said he understood the CLP's decision to scrap the target, but it wasn't a reason to give up on renewables.\n\nHe also warned against an over-reliance on shale gas from the Beetaloo Basin as the answer to lower power prices.\n\nThe gas-rich Beetaloo sits about 500 kilometres south-east of Darwin, and has been pegged as the future of the NT's gas supply.\n\nGas companies have been exploring the Beetaloo Basin. (Supplied: Tamboran Resources Limited)\n\n\"If the Beetaloo is developed at commercial scale, it can provide a future source of relatively lower cost, reliable and abundant gas supply,\" Mr Kavonic said.\n\n\" But I think, particularly from a government perspective, you can't be putting all your eggs in one basket. \"\n\nFracking fluid spills revealed in the NT's Beetaloo Basin Photo shows An area of dead trees and vegetation Traditional owners and a scientist fear there have been more fracking fluid spills by gas companies exploring the Northern Territory's Beetaloo Basin.\n\nGas companies Tamboran Resources and Empire Energy have been exploring the Beetaloo since the NT government approved a full-scale fracking industry in 2023.\n\nTamboran Resources expects first gas to flow in 2026, while Empire Energy expects to start delivering gas later this year.\n\nBoth have signed secretive deals to supply gas to the NT government.\n\nHowever, neither company has reached a final investment decision on their fracking projects.\n\nCentral Petroleum has also agreed to supply gas from the Amadeus Basin in Central Australia.\n\nSo, where does the NT's gas come from?\n\nThe NT government-owned Power and Water Corporation (PWC) has been buying emergency gas at high prices from Santos and Inpex since 2021 due to shortfalls at Eni's Blacktip field.\n\nPWC spent $43 million on the emergency deals in 2023-24.\n\nMr Kavonic said prioritising Beetaloo gas at the expense of other energy sources could risk more emergency gas deals in the future — at a massive cost to taxpayers.\n\n\"If the Beetaloo's development ends up being slower than hoped for — just like the renewables rollout — what are the contingency plans?\" he asked.\n\nShould solar still be on the table?\n\nGreg Bourne, a former oil industry executive with BP, said the NT had a big opportunity to grow its critical minerals industry and build large solar farms.\n\nThat work is already underway by the private sector.\n\nTech billionaire Mike Cannon-Brookes is pushing ahead with plans to build a 10-gigawatt solar farm spanning more than 12,000 hectares near the remote town of Elliott.\n\nA render of the planned SunCable solar project in the Northern Territory outback. (Supplied: Sun Cable)\n\nThe SunCable project aims to transport electricity to Darwin via an 800km overhead transmission line, then on to Singapore through an underwater cable.\n\nThe project received federal environmental approval last year, and is aiming to achieve a final investment decision by 2027-28.\n\nThe NT government estimated it would cost up to $5 billion to see out the 50 per cent renewables target.\n\nBut Mr Bourne, who now works for the Climate Council, said the cost paled in comparison to the price of \"increasingly intense cyclones\" and bushfires caused by global warming.\n\n\"The last thing we want to do is let the gas run and let the climate rip,\" he said.\n\nA spokesperson for Essential Services Minister Steve Edgington said several solar projects were making progress across the NT.\n\nThe spokesperson said Jacana Energy was working to provide rooftop solar to social housing tenants in Tennant Creek, and renewable energy to residents in Marlinja and Borroloola.\n\nThey also said PWC was progressing several solar energy projects, and Territory Generation was planning to deliver its first battery energy storage system project for Darwin and Katherine.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/shoplifting-spike-regional-victoria-hurting-retailers/105088418",
    "title": "Shoplifters make life even harder for regional traders",
    "publish_date": "Fri, 28 Mar 2025 22:32:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Al Taylor has managed to keep his small business afloat through the ups and downs of the COVID pandemic and cost-of-living crisis but now there is a new threat to his shop — theft.\n\n\n\nMr Taylor has operated a combined indoor skate centre and retail store at Wodonga, in Victoria's north-east, for almost five years, but constant shoplifting is taking a toll.\n\nA $300 scooter was stolen from the shop floor two weeks ago.\n\nCCTV footage captured a young male making off with it while staff were helping another customer.\n\n\"[He's taken] a look around and just rode it out the door,\" he said.\n\n\" Taking something of value from a business really is taking money out of someone's pocket. \"\n\nMr Taylor, who also runs a skateboarding program for young people dealing with mental health issues, said people were resorting to theft as cost-of-living pressures worsen.\n\n\"I understand the stigma about opening up about struggling financially ... but if someone ... needed food or any items, plenty of people can help them out.\"\n\nEmotional toll\n\nThe latest data from Victoria's Crime Statistics Agency shows store thefts across Victoria have almost doubled since 2022.\n\nAbout 37,800 stealing offences were recorded in Victoria in 2024, up from 27,600 in 2023 and 19,700 in 2022.\n\nIn 2024, Greater Shepparton recorded 426 thefts from retail stores, compared to 170 offences the previous year.\n\nFleur Brown. (Supplied: Australian Retail Association)\n\nVictoria Police says a third of all thefts from stores are related to alcohol.\n\nAustralia Retail Association chief industry affairs officer Fleur Brown said violent crime also had a profound impact on retail staff and customers and the emotional toll on shop owners and their employees was immense.\n\n\"No-one should have to go to work fearing for their safety, but sadly that is the reality for many in the retail sector,\" Ms Brown said.\n\n\"A 2-to-3 per cent loss of merchandise can amount to 25 per cent loss in profit,\" she said.\n\nCost-of-living having an impact\n\nGlen Robinson, general manager of Albury Business Connect, the chamber of commerce, said retail crime was up with graffiti and vehicle crime as significant and emerging issues in the border region.\n\n\"There is no question that cost of living is having an impact on theft,\" Mr Robinson says.\n\n\"Around school and Christmas holidays is when you'll see a spike in theft [and]... usually it's younger members of our communities taking the opportunities.\"\n\nGlen Robinson. (Supplied: Glen Robinson)\n\nMr Robinson said \"bigger ticket\" thefts of meat and fruit in supermarkets were also increasing.\n\n\"We are seeing spikes everywhere with regards to people taking things to just keep food on the table, whether it be small stuff in jacket pockets at the checkout or the more blatant snatch-and-grab where stores aren't equipped enough to chase [the thief],\" he said.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/brisbane-council-rates-may-rise-land-valuations-soar/105110466",
    "title": "Brisbane land valuations up 17pc, with regional increases as high as 247pc",
    "publish_date": "Fri, 28 Mar 2025 22:20:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Land valuations in Brisbane have climbed almost 20 per cent, while some regional locations have seen increases of more than 230 per cent, likely leading to costlier council rates and land tax bills.\n\nQueensland's independent valuer-general, Laura Dietrich, issued more than 790,000 valuations this week, spanning 14 council areas.\n\nQueensland's independent valuer-general, Laura Dietrich, is responsible for calculating land valuations. (Supplied: Western Queensland Alliance of Councils)\n\nBrisbane City Council's re-evaluation included almost 351,000 properties with a total value of $346.2 billion, an increase of 17 per cent.\n\nThe overall median value of residential land in the capital city was $720,000.\n\n\"Brisbane continues to be one of the strongest capital city housing markets, and that's mainly due to population growth and infrastructure projects that have been done since we last did the valuation in 2022,\" Ms Dietrich said.\n\n\"Some of those big investments are the Kangaroo Point Bridge, the Eagle Street Pier project, Queens Wharf, and the Metro Tunnel Project.\"\n\nBrisbane's Kangaroo Point Bridge officially opened late last year. (Supplied: Brett Sarapung/Brisbane City Council)\n\nBrisbane's land values were last reviewed in 2023, rising 12 per cent then, and 17 per cent the previous year.\n\nIn Logan — one of the state's biggest council areas — total land values increased 19 per cent, with residential land now at a median value of $375,000, driven by strong population growth and improved transport infrastructure.\n\nOther notable land value increases included:\n\nToowoomba, up 31 per cent to a median residential land value of $265,000\n\nCairns, up 31 per cent to a median residential land value of $280,000\n\nRockhampton, up 36 per cent to a median residential land value of $134,000\n\nTownsville, up 27 per cent to a median residential land value of $192,500\n\nValues completed prior to extreme weather\n\nMs Dietrich said it was important to note the valuations reflected the market prior to October of last year, before serious flooding events and ex-Tropical Cyclone Alfred.\n\nThe aftermath of ex-Tropical Cyclone Alfred Photo shows A ute surrounded by floodwater with Clayton's towing in the background. Approaching slowly and hitting hard, the weather system wreaked havoc across south-east Queensland and northern NSW — with homes, businesses and beaches damaged.\n\n\"Our valuers consider a range of factors, including the damage caused to land property sales with flood-affected areas and historical flooding in the region,\" she said.\n\n\"Future land valuations will continue to take into consideration adverse weather and flooding.\"\n\nLand valuations are used by local governments to make decisions on council rates, and the state government relies on them to calculate land tax charges.\n\n\"As the valuer-general, I have no role in council rates. Councils have many options to be able to manage their rates,\" Ms Dietrich said.\n\nThe state government relies on these valuations to calculate land tax charges. (AAP: Dave Hunt)\n\nThe Gold Coast, Sunshine Coast and Moreton Bay were notable exclusions to the latest valuations.\n\n\"As valuers, we don't set the market, we interpret the market,\" Ms Dietrich said.\n\n\"So, when I make the decision to value different LGAs each year, we go through the process of looking at market movements, talking to stakeholders and councils, and considering all the things that have taken place since the last time we did an evaluation.\"\n\nRural locations skyrocket\n\nSeveral south-west Queensland councils saw massive rises in land valuations, including Paroo (247 per cent), Murweh (238 per cent), and Quilpie (236 per cent).\n\nSome rural Queensland regions have experienced good seasons recently, which Queensland's valuer-general says has impacted land valuations. (ABC News: Elsie Adamo)\n\n\"A combination of generally good seasons, low interest rates and high commodity prices since 2020 to 2022, has seen an increase in rural land values,\" Ms Dietrich said.\n\n\"While we've seen interest rate rises and lower commodity prices over the last 12 months, we haven't seen the rural prices drop.\n\n\"Producers continue to take a long-term view, competing for properties that are strategically important to them.\n\n\"We haven't seen any correction to the rural market to date, and that's really because there's a low supply.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/angelman-syndrome-huxleys-heroes-broken-hill-to-newcastle-run/105094838",
    "title": "Tiny Huxley needs a hero. He's found one in marathon man Mitch",
    "publish_date": "Fri, 28 Mar 2025 21:52:36 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "A week before Christmas in Broken Hill, Jess and Bree Maguire's lives changed forever.\n\nAfter welcoming baby Huxley on August 22, they had been through months of \"traumatic\" tests and round trips to Adelaide, with no answers to what was amiss with their boy.\n\nHe had struggled to latch, had issues with reflux and suffered repeated infections.\n\nA week before December 25, Bree and Jess were called to their paediatrician in Broken Hill and told Huxley had Angelman syndrome, a rare genetic condition that affects the functioning of nerves in the brain and can cause physical and intellectual problems.\n\nJess says Huxley's smile lights up every room he is in. (ABC Broken Hill: Coquohalla Connor)\n\nThey had no idea what that meant and were emotionally exhausted.\n\nNow, three months on, their close friend Mitch McKenny is gearing up to run across New South Wales, from Broken Hill to Newcastle — the equivalent of 27 marathons in 27 days — raising money for research into the condition.\n\n'He was perfect'\n\nBree and Jess Maguire were elated when they found out they were expecting a baby boy.\n\n\"We were just so excited and happy,\" Jess said.\n\n\"In a household filled with girls [we were excited] to have a boy,\" Bree agreed.\n\nThe days leading up to Huxley's birth were filled with nervous anticipation, but when he arrived all nerves were pushed aside.\n\n\"He was born and he was perfect,\" Jess said.\n\nBree (left) and Huxley had to fly to Adelaide with the Royal Flying Doctor Service twice during emergencies. (Supplied)\n\n\"He struggled with some breathing but nothing too dramatic. We thought he was OK,\" she said.\n\nThe pair took Huxley home and it soon became clear something was wrong.\n\nHe was not feeding and he was often screaming.\n\nThe couple brought him back to Broken Hill Base Hospital, distressed that their child might be in pain.\n\n“Over the course of their investigations, they found he had reflux of the bladder and kidney, which was causing UTIs, so he was consistently getting infections,” Jess said.\n\nIt was the first step in a four-month journey to a diagnosis that ended in their paediatrician's office in Broken Hill.\n\nHuxley is the pair's second IVF baby after Sage, 3. Bree also has an older child, Asha, 14. (ABC Broken Hill: Coquohalla Connor)\n\nThe paediatrician explained the complex syndrome would likely mean Huxley would never walk or talk and would need constant care for the rest of his life.\n\nJess remembers feeling \"numb\".\n\n\"Our perfect little boy, here he was sitting there and it was like they took his life away from us. But he was physically right there,\" she said.\n\nHope on the horizon\n\nWhen the couple got home they searched the web to understand Angelman syndrome.\n\nOne of the groups they learnt about was FAST, the Foundation for Angelman Syndrome Therapeutics Australia.\n\nMeagan Cross is the chief executive of FAST, whose daughter, Molly, has Angelman syndrome. (Supplied: Meagan Cross)\n\nFAST chief executive Meagan Cross's daughter Molly is 18 and has the syndrome.\n\n\"It affects a single gene and it only affects the mother's copy of it,\" she said.\n\n\"It causes a complex disability that affects nearly all the aspects of life — gross motor, fine motor, delays in walking and sitting.\"\n\nMs Cross said the foundation was focused on research while offering support to parents and carers of children with Angelman syndrome.\n\n\"The hole in your heart will always be there,\" she said.\n\n\"Something has happened to your child; sometimes it's not as raw, but sometimes it can be really raw, [but] there's a lot of hope for the future.\"\n\nProfessor David Armor is a clinical geneticist at Melbourne University and part of the team involved in an international trial of treatment for Angelman syndrome at Melbourne's Royal Children's Hospital.\n\nHe says the trial investigates turning on the silenced paternal copy of a gene.\n\n\"Kids with Angelman syndrome have one copy from the father, which is silenced in the body, and there are trials underway to switch on that paternal copy which, at least in theory, should be able to fulfil the same role as the maternal copy,\" he said.\n\nProfessor Amor says a diagnosis of Angelman syndrome is usually made between the ages of two and three years old. (ABC Broken Hill: Coquohalla Connor)\n\nProfessor Armor explained that the trial involved injections every three months.\n\n\"Using a specific treatment to activate the parental copy, it's pretty complicated and involves the child having injections into fluid around the spinal cord and the brain every three months or so,\" he said.\n\n\"At the moment we don't have results to this trial, so we don't know if it's going to be proved to be effective or not,\".\n\nEven so, Professor Armor said the future was looking bright.\n\n\"There's a lot more optimism now than there has been that we might be able to decrease the severity of symptoms,\" he said.\n\n'I won't let that answer be nothing'\n\nA friend of the Maguires, Mitch McKenny, remembers hearing about Huxley's diagnosis and instantly Googling.\n\nHis young son attends Jess's family daycare and he felt indebted to her.\n\n\"My young fella, my toddler, goes to daycare with Jessie and as a result of that has grown tremendously and has benefited from some outstanding care from them,\" he said.\n\n\"When it became clear that young Huxley was unwell, I felt [the need] to pay it forward in a sense.\"\n\nMitch will start his run on August 22, Huxley's first birthday. (ABC Broken Hill: Coquohalla Connor)\n\nAfter talking to Meagan, he decided to undertake the run not just to raise money but also spread awareness of Angelman syndrome.\n\nHe hopes the campaign, named \"Huxley's Heroes\" will help treatments become available in Australian homes.\n\nSo far, the campaign has raised around $40,000 with local clubs and pubs, sporting groups and individuals donating.\n\nMr McKenny feels the more-than-1,000km run is an apt dedication to those with the disorder.\n\n\"After I got permission from my wife, I decided that it had to be a physical challenge because these kids and their mums and dads are physically challenged every day,\" he said.\n\nMr McKenny starts the run on August 22, Huxley's first birthday.\n\n\"One day, when [my son] is older he'll ask me what I did for his mate Huxley and I won't let that answer be 'nothing',\" he said.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/tasmanian-brass-band-training-next-generation-of-musicians/105097454",
    "title": "This brass band is offering free tuition to bring in a new generation",
    "publish_date": "Fri, 28 Mar 2025 21:35:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "At 85 and 11 years old respectively, John Quinn and Oliver Buckland are breathing new life into the West Tamar Municipal Band.\n\nNote by note, scale by scale, John is teaching Oliver the fundamentals of the cornet in an attempt to revitalise the northern Tasmanian brass band's membership.\n\nMr Quinn, who has played the compact brass instrument since 1955, is hoping Oliver will develop the skills to join the senior band.\n\n\"He listens and he practices … he's a good boy,\" Mr Quinn said.\n\nWith the typical band member aged in their 70s, Oliver, who is in grade six at Exeter Primary School, belongs to a cohort of students who have put up their hands to receive tutoring from the existing players in a bid to revitalise the group.\n\nAfter being wowed by classic tunes such as When the Saints and Ode to Joy over the past year, Oliver hopes \"more and more people come and join, so it keeps on sounding better and we get more people to play.\"\n\nPaul Laverty is the band's conductor and secretary. (ABC News: Morgan Timms)\n\nNew life for old instruments\n\nThis year, the brass band celebrates its 146th birthday. It's a tradition that band president Mary Parsell wants to keep going.\n\n\"The average age of our band is creeping up, and we wanted some younger people to come and join us,\" she said.\n\n\" We had a lot of old instruments in the cupboard doing nothing. \"\n\nThe band has recruited 14 school students who come along on a Tuesday afternoon to learn a brass instrument of their choice with a mentor.\n\n\"It costs nothing because we don't charge,\" Ms Parsell said.\n\n\"We give them an instrument and they have to guarantee it comes back in the same condition. We give them a folder with music, and we give them lessons for free.\n\n\"But we do feed them biscuits and a drink, so that might be half the fun.\"\n\nThere are 14 Exeter Primary School students learning brass instruments alongside band members. (ABC News: Morgan Timms)\n\nAfter a little over a year, there are now two students who are playing alongside their more experienced counterparts in the senior band.\n\n\"I hope it continues for many more years, but it relies on the goodwill of the other band members who come Tuesday afternoon and play for an hour and then stay and play with the kids,\" Mrs Parsell said.\n\n\"So while they're keen to teach, I think it will go on stronger and stronger.\"\n\nFriendships formed through music\n\nZoe Williams, 12, is one of the original recruits who has gone on to play the baritone horn with the senior band.\n\nThis year, she's been paired with 73-year-old Exeter resident Richard Tite as she continues to master what he describes as a \"harmonious instrument\" that generates a \"beautiful, mellow sound in the middle of a band\".\n\nFor Zoe, her mentor's enthusiasm for the lesser-known horn has been infectious.\n\n\"I absolutely love him,\" she said.\n\nZoe Williams (centre) now plays the baritone horn with the senior band, and is mentored by Richard Tite (right). (ABC News: Morgan Timms)\n\n\"He's also quite a character as well, very funny … I think he's kind of rubbed off on me a bit … it's great to have him around.\n\n\"I love that I get to bond with all these people … my parents call me an older lady.\"\n\nFor Mr Tite, it's been a two-way learning experience.\n\nProgram bringing together young and old Photo shows An old woman in pink shirt and cream cardigan sits in between two high school students in school uniform An Adelaide program bringing together the old and young has helped participants form unlikely connections.\n\n\"She's a very enjoyable character,\" he said.\n\n\"If she's not happy with what she's doing, she'll tell me … and she'll also tell the bandmaster if I'm doing something wrong, which is lovely.\"\n\nHe's hoping that players such as Zoe will extend the brass band's future.\n\n\"We need the next generation coming through.\"\n\nZoe Williams says she enjoys bonding with other band members. (ABC News: Morgan Timms)\n\nTeaching new tricks at 90\n\nLike his younger band members, 90-year-old cornet player Doug Sawyer is also relatively new to his chosen instrument.\n\n\"I was almost 80 when I first started,\" he said.\n\n\"I heard a talk on the wireless one time and the fella was saying if you want to keep young and keep your brain active … grab an instrument and learn to read music.\n\n\"So that's what I did and it's been really good.\"\n\nDescribing the process as similar to learning another language, Mr Sawyer went through music book after music book to slowly grasp the basics.\n\nDoug Sawyer, 90, took up the cornet about 10 years ago. (ABC News: Morgan Timms)\n\nAfter moving to Tasmania only a few years ago from Western Australia, Mr Sawyer is delighted he is now able to share this passion with his peers and a new cohort of musicians.\n\n\"They have a real job to get any sort of noise,\" he said.\n\n\" But … when they get going and play the notes, it's really fantastic to listen to it and see the achievement and the look on their face when they can play a tune. \"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/australian-basketball-us-college-scholarships/104967700",
    "title": "Expat lands record number of US scholarships for Aussie basketballers",
    "publish_date": "Fri, 28 Mar 2025 21:34:26 +0000",
    "category": "sports",
    "authors": [],
    "text": "There's a thick mid-west American twang to the commentators' voice as he calls out over the loudspeaker: \"Aussie! Aussie! Aussie!\"\n\nThe basketball stadium full of Montana college students dutifully responds: \"Oi! Oi! Oi!\"\n\nThe chant repeats every time Justin Asi shoots a basket for the Dawson Community College Buccaneers, which happens regularly.\n\nHe's half a world away from his old home court in Dandenong, an outer suburb in Melbourne's south-east.\n\nAustralian Justin Asi shoots for the Dawson Community College Buccaneers. (Supplied: Dawson Community College)\n\nWhile the Australian indoor sports centre doesn't have the stands of cheering fans, it is still full — of other young hopefuls, wanting to follow in Justin Asi's footsteps and secure a scholarship to play in the US.\n\n\"Low! Get lower!\" the coach yells to the Melbourne teens lined up in drill formation bouncing balls between their legs.\n\nHe walks among the boys, offering specific advice and corrections, but he's clearly concerned some aren't giving it their all and brings them in for a chat.\n\nMembers of the Red Roo program aspire to be among the growing number of Aussie basketballers breaking into the US. (ABC News: Natalie Whiting)\n\n\"Just because something is easy, does that mean you don't try when you do it?\" he asks.\n\n\"If you're going to be cruising through practise the whole time, it's only going to affect you, it's not going to affect me.\"\n\nExpectations are high in the Red Roo program which helps aspiring basketballers secure sporting scholarships to the US. (ABC News: Natalie Whiting)\n\nThe pace is quick — and the expectations are high — at Red Roo Sports.\n\nWatching on and helping with the coaching as needed is 19-year-old Kuriowl Chol, known as KC.\n\nHe's among the latest players to secure a scholarship and will be flying to the US in a couple of months.\n\nKuriowl Chol is preparing to head to the US on a basketball scholarship. (ABC News: Natalie Whiting)\n\nGrowing number of Aussies securing US scholarships\n\nThe number of young Australians going to study in America on sporting scholarships is increasing \"year on year\", according to the Australian Institute of Sport.\n\nThere are different organisations that govern college sports, the biggest is the National Collegiate Athletic Association (NCAA).\n\nAfter a dip during COVID-19, figures up to 2023 show the Australian interest is rebounding.\n\nElizabeth Thompson from the NCAA says student numbers from Australia are now at an \"all-time high\".\n\n\"Australia in particular is one that continues to grow and move its way to the top of the charts,\" she says.\n\nAustralia provides the fifth highest number of international student athletes competing in the NCAA.\n\nThere are a variety of pathways young Australians are taking to get a sports scholarship, but Ms Thompson says social media has been a game changer.\n\n\"The coaches use social media just as much as the student athletes do, and I think that lends to the increasing number of student athletes that you see on rosters.\"\n\nThere has been a notable jump in Australians joining the gridiron ranks, in particular as punters, and women's basketball has also been surging.\n\nWhile the US pathway is clearly a popular choice, it's not the only one.\n\nAustralian basketballer Jade Melbourne shunned the US collegiate system, before going on to play in the WNBA and the Olympics.\n\nTwenty-five scholarships in one year\n\nOn the court in Dandenong, one of the young players, Jamaal Duhovic, has a simple answer when asked what he wants to get out of Red Roo.\n\n\"In the future, I'd really like to go to America, get a scholarship, and play,\" he says.\n\nHe says seeing older teammates, like KC, succeed is \"inspiring\".\n\n\"I really look up to KC, and in the future, I hope I can be as good — or maybe even better than KC,\" he says while glancing in the direction of the more than 2-metres-tall KC and grinning.\n\nJamaal Duhovic hopes to secure a US scholarship in the future. (ABC News: Natalie Whiting)\n\nKC will be moving to Montana in June, to pull on a singlet for Dawson Community College, replacing former Red Roo players Justin Asi and Kur Maler.\n\nAfter completing their two years of junior college, both Asi and Maler are going through a recruiting process to hopefully get a spot in an NCAA school.\n\n\"It was just a thought, a dream, but I never thought I'd actually do it,\" KC explains.\n\n\"It was really challenging, but I took on the challenge and I got it done.\"\n\nHe is one of 25 Red Roo players to receive US scholarships last year, in a record year for the club.\n\nMoving to the US to play basketball is a dream come true for Kuriowl Chol. (ABC News: Natalie Whiting)\n\nIt was established by an American expat, he says as a way giving back to the community.\n\n\"Our formula is quite simple, it's excellence over time, with discipline, equals success,\" James Kerr explains.\n\n\"If you can maintain that excellence over time, there's a good chance you can advance in life.\"\n\nJames Kerr (left) set up the Red Roo program to give talented basketballers opportunities to progress in the sport. (ABC News: Natalie Whiting)\n\nThe program is designed to offer a different way to higher levels of the sport, particularly for young people who may not fit the usual representative pathways.\n\nThe Red Roo players compete in competitions and showcases that are watched online by scouts in America.\n\nThe first players who went to the United States have since returned and some are working with the next generation, coaching at Red Roo.\n\nMr Kerr is now also running AAU, the Amateur Athletic Union — Australia, one of several agencies promoting US sporting scholarships.\n\n\"With AAU and a national presence, we think that we can do 100 (scholarships) this year,\" he says.\n\nJames Kerr's Red Roo program secured a record number of basketball scholarships last year. (ABC News: Natalie Whiting)\n\n'Brings the community together'\n\nWhile some may aspire to a future as a professional athlete, for many of the young Red Roo players the opportunity to study and have new experiences is just as motivating.\n\nKC says while he is looking forward to playing, he is also excited to earn his degree and \"further (his) education\".\n\nYear 11 student Chibuikem Anyadoro is also eyeing a scholarship, perhaps to an ivy league school.\n\n\"I think it's really important to emphasise the student in student athlete,\" he explains.\n\n\"I believe it's really important not just to have the basketball side of things, but also the academic side of things — it's a link, you can't have one without the other.\"\n\nChibuikem Anyadoro (white singlet under the hoop) blocks a shot by his Red Roo teammate. (ABC News: Natalie Whiting)\n\nAside from its US exports, the Red Roo program is having broader benefits in the community, according to one former player.\n\n\"It brings community together, a lot of us young people like to be together and so when we're around one another and we get to do it in a positive environment, we excel,\" Mamuch Chol says.\n\nMamuch Chol hopes the Red Roo program can provide mentors for the South Sudanese community. (ABC News: Natalie Whiting)\n\nHe now runs an NGO called NextGen Unite, which works with the local South Sudanese community and says it is looking to partner with Red Roo.\n\n\"Red Roo is already doing pathways at the moment, but we'd like to expand some of its programs around mentoring.\n\n\"We'd also like to be able to find ways for young people to be able to find employment.\"\n\nAs the program keeps expanding, so too are the goals.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-29/avalon-crash-pilot-saturday/105111876",
    "title": "Pilot critical but stable after crash at Avalon International Airshow",
    "publish_date": "Fri, 28 Mar 2025 21:25:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "A pilot involved in a crash at the Avalon International Airshow in Victoria on Friday remains in a critical but stable condition in hospital.\n\nThe pilot, Glenn Collins from Paul Bennet Airshows, based in Hunter in NSW, crashed the aircraft while conducting a demonstration about 5:15pm on Friday.\n\nMr Collins was the sole occupant of the plane, known as a Pitts Special aerobatic aircraft.\n\nAccording to a biography on the Paul Bennet Airshows website, Mr Collins is an seasoned pilot with more than 2,700 hours flying experience.\n\nPilot Glenn Collins suffered critical injuries in the crash at the Avalon International Airshow on Friday. (Supplied: Paul Bennet Airshows)\n\nPaul Bennet Airshows said Mr Collins was \"one of our long-time Sky Aces pilots.\"\n\n\"The pilot is in a serious but stable condition and has been transferred to hospital for treatment,\" Paul Bennet Airshows said in a statement.\n\n\"Our thoughts are with his family and we are grateful for the emergency services who responded quickly.\n\n\"Our team and families appreciate the well-wishes and support.\"\n\nThe plane that crashed was one of four aircraft involved in an aerobatic display at the airshow when the accident occurred.\n\nThe crash happened at about 5:15pm on Friday at the Avalon airshow. (AFP: Paul Crock)\n\nCrash witnessed by hundreds of spectators\n\nShaun Lenehan was in the crowd at the airshow when the crash happened a few hundred metres in front of spectators.\n\n\"Everyone stopped straight away and they rolled the fire trucks out and they kind of put a pause on everything straight away,\" he said.\n\n\"It looked like it could have been a fatal crash by the way it had hit the ground and disintegrated. He was pulling out of a dive so he was going quite fast.\"\n\nThe aircraft was one of four planes involved in an aerobatic display from Paul Bennet Airshows. (AAP Image: Michael Currie)\n\nAnother spectator, Andrew Pearce, said the plane hit the ground as it was coming out of a loop.\n\n\"He didn't just nosedive, like he kind of hit his belly,\" he said.\n\n\"The cockpit was intact where he was but the wings were, like I don't know if they were detached from the plane, but they were like crumpled in front of the plane.\"\n\nSafety bureau says investigation will take months\n\nThe chief commissioner of the Australian Transport Safety Bureau (ATSB), Angus Mitchell, said investigators had almost finished examining the crash site and would now continue their investigation of the plane wreckage in a hangar.\n\nHe said investigators would look into what pilots were tasked to do for the flight display, the approvals processes leading up to it, the plane's maintenance history and the pilot's history.\n\nA number of recording devices have been recovered from the plane as well as mobile phone footage from the public.\n\nATSB chief commissioner Angus Mitchell says it's too early to say what caused the plane crash. (ABC News)\n\n\"That is all very important for us in recreating what's occurred here,\" Mr Mitchell told reporters on Saturday.\n\n\"I suspect it will be a number of months before we have anything to say regarding what occurred yesterday and, most importantly, is there anything else that we can work with in the industry to make sure that occurrences like this are lessened.\"\n\nHe encouraged anyone else with footage of the crash to submit it to the ATSB.\n\nAirshow to continue on Saturday\n\nAvalon Australian International Airshow CEO Justin Giddings confirmed the pilot was the only person hurt in the incident.\n\n\"The incident occurred well away from the crowds in attendance and no member of the public was injured,\" he said.\n\n\"The Avalon Australian International Airshow concluded the day's activities to allow the Australian Transport Safety Bureau investigation team to have full and free access to the site.\n\n\" Our thoughts are with the pilot and his family, friends and team members. \"\n\nThe airshow is resuming on Saturday after being suspended following Friday's crash. (ABC News)\n\nThe airshow is proceeding on Saturday, with gates opening at 8am, although the start of the flying display will be delayed.\n\nMr Giddings said airshow attendees who were forced to leave early on Friday because of the crash would be offered general admission tickets for Sunday.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/world/europe/naysayers-queen-claims-victory-over-online-reading-club-with-12-million-members-20250328-p5lnc5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Naysayers’: Queen claims victory over online reading club with 12 million members",
    "publish_date": "Sat, 29 Mar 2025 11:55:25 +1100",
    "category": "entertainment",
    "authors": [
      "Victoria Ward"
    ],
    "text": "London: Queen Camilla has claimed victory over the many “naysayers” who did not believe her online book club would be a success.\n\nAs she marked the fourth anniversary of The Queen’s Reading Room at a star-studded reception at Clarence House this week, Camilla revealed that she had built a “family” of 12 million readers spanning 173 countries.\n\nShe said her aim was simply to “make life better”.\n\nQueen Camilla speaks as King Charles looks on during a reception to mark the launch of the Queen’s reading room medal at Clarence House on Tuesday. Credit: Getty Images\n\nThe Queen was supported by her family, with King Charles, her sister Annabel Elliot, and children Tom Parker Bowles and Laura Lopes mingling with a host of authors and literary figures.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/russian-born-daria-kasatkina-switches-allegiance-to-australia-20250329-p5lnht.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘My new homeland’: Russian-born tennis star Daria Kasatkina switches allegiance to Australia",
    "publish_date": "Sat, 29 Mar 2025 11:25:14 +1100",
    "category": "sports",
    "authors": [
      "Scott Spits"
    ],
    "text": "Russian-born tennis star Daria Kasatkina is switching allegiances to Australia after her application for permanent residency was accepted by the federal government.\n\nThe world No.12 has been playing on the tour as a neutral athlete after Russian and Belarusian players were banned from competing under their own flags following Moscow’s invasion of Ukraine in 2022.\n\nDaria Kasatkina, pictured playing at the Australian Open in January, will compete for Australia now that she has been granted permanent residency. Credit: Getty Images\n\nIn an Instagram post, Kasatkina expressed her joy in gaining permanent residency in Australia.\n\n“I am delighted to let you all know that my application for permanent residency has been accepted by the Australian Government,” she wrote.",
    "source": "SMH",
    "cluster_id": 9
  },
  {
    "url": "https://www.smh.com.au/politics/federal/albanese-chalmers-press-conference-interrupted-by-heckler-20250329-p5lnhl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Albanese, Chalmers press conference interrupted by heckler",
    "publish_date": "Sat, 29 Mar 2025 11:06:23 +1100",
    "category": "finance",
    "authors": [],
    "text": "Albanese, Chalmers press conference interrupted by heckler\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/i-genuinely-believe-he-hasn-t-made-a-decision-seibold-says-he-doesn-t-know-if-dce-will-play-on-20250328-p5lnfi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I genuinely believe he hasn’t made a decision’: Seibold says he doesn’t know if DCE will play on",
    "publish_date": "Sat, 29 Mar 2025 10:43:25 +1100",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Manly coach Anthony Seibold genuinely believes Daly Cherry-Evans is unsure if he wants to play on next year, let alone whether he has a deal already in place at a rival club.\n\nSeibold also confirmed on Saturday that the man he described as the club’s “best player”, Tom Trbojevic, is an option at five-eighth for the Sea Eagles when DCE departs at the end of the season.\n\nSeibold also said he did not expect fans to boo Cherry-Evans at 4 Pines Park on Sunday afternoon, saying “Manly supporters should congratulate ‘Chez’ on the career he’s had at this club, which isn’t done yet”.\n\nIt has been a whirlwind week for the Sea Eagles since Cherry-Evans revealed on Monday he would walk away from the club at the end of the year after 15 seasons and was open to playing on with another NRL team.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/not-letting-them-make-a-fool-of-me-bronco-destined-for-origin-recall-20250328-p5lngr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Not letting them make a fool of me’: Bronco destined for Origin recall",
    "publish_date": "Sat, 29 Mar 2025 10:26:50 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "When faced with a particularly enthralling match-up, something ignites within Kotoni Staggs.\n\n“I’ve had some class centres in front me, and I just want to be better than that opposition number,” he tells this masthead.\n\nAccording to Broncos coach Michael Maguire, that trait has him on a collision course with a State of Origin recall.\n\nKotoni Staggs and Selwyn Cobbo celebrate the former’s try for the Broncos against the Dolphins on Friday night. Credit: NRL Photos\n\nThe Broncos’ strike centre has saved his finest performances for vendetta missions – his clashes with Maroons ace Valentine Holmes and Cronulla powerhouse Siosifa Talakai are prime examples.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/lifestyle/meghan-markle-reveals-how-her-jams-are-made-20250329-p5lnhj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Meghan Markle reveals how her jams are made",
    "publish_date": "Sat, 29 Mar 2025 10:07:13 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Meghan Markle reveals how her jams are made\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/queensland-hit-by-horrific-flood-damage-20250329-p5lnhg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Queensland hit by 'horrific' flood damage",
    "publish_date": "Sat, 29 Mar 2025 09:54:34 +1100",
    "category": "finance",
    "authors": [],
    "text": "Queensland hit by 'horrific' flood damage\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/racing/heavy-rain-forces-move-of-tancred-stakes-day-at-rosehill-to-tuesday-20250329-p5lnh6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Heavy rain forces Tancred Stakes day at Rosehill to be moved to Tuesday",
    "publish_date": "Sat, 29 Mar 2025 09:36:03 +1100",
    "category": "sports",
    "authors": [
      "Craig Kerry"
    ],
    "text": "Tancred Stakes day at Rosehill, featuring two group 1 races, has been moved to Tuesday after it was washed out on Saturday morning.\n\nRacing NSW stewards announced just before 8.30am that following overnight rain, and with up to 50mm forecast for the remainder of the day, the meeting had been postponed due to the condition of the track.\n\nRacing has been called off at Rosehill, where Marhoona took out the Golden Slipper last Saturday. Credit: Getty Images\n\nOfficials said at 6.55am that the surface was rated a soft 7 and a further inspection would be held at 9am. However, further heavy rain prompted an earlier decision. The Rosehill area had more than 25mm overnight and into the early morning.\n\nOfficials announced the meeting, featuring the $1.5 million weight-for-age Tancred Stakes (2400m) and $750,000 Vinery Stud Stakes for three-year-old fillies, would be held on Tuesday.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/from-palaszczuk-to-crisafulli-clock-is-ticking-for-brisbane-2032-20250328-p5ln8i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "From Palaszczuk to Crisafulli: Clock is ticking for Brisbane 2032",
    "publish_date": "Sat, 29 Mar 2025 09:33:00 +1100",
    "category": "sports",
    "authors": [
      "Darren Kane"
    ],
    "text": "If you go back about four years, you’ll see that the political shenanigans in Queensland served as a portent to the future all along.\n\nBy July 2021, then-Premier Annastacia Palaszczuk, having shut down Queensland due to COVID-19, left the country to attend the 138th session of the International Olympic Committee, convened in Tokyo to coincide with the Games of the XXXII Olympiad.\n\nThat Palaszczuk should have been in Tokyo amid the political grandstanding about whether Queensland or Western Australia could lay claim to being the most sterile and mean jurisdiction during the pandemic certainly raised eyebrows.\n\nHer practised astonishment and faux celebrating, unleashed once the masked-up IOC President Thomas Bach announced Brisbane as the winner in the one-horse race to host the 2032 Olympic Games, was cringeworthy.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/nsw/the-forgotten-and-overlooked-sydney-art-you-may-be-standing-on-right-now-20250324-p5lm47.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The forgotten and overlooked Sydney art you may be standing on right now",
    "publish_date": "Sat, 29 Mar 2025 09:30:00 +1100",
    "category": "entertainment",
    "authors": [
      "Julie Power"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nMost young people are told to look up. Not Victoria Hynes, whose late grandfather Peter Melocco’s mosaic flooring once decorated hundreds of public buildings in Sydney.\n\nAs a child, Hynes was taken on walks through Sydney’s CBD to see the work of Peter and his brothers, Antonio and Galliano, known as the Melocco Brothers. It was everywhere, she said, from “the Hogwarts-like splendour” of the State Theatre to banks, Dymocks and big department stores.\n\n“Look down,” her mother said when they visited the crypt of St Mary’s Cathedral and the State Library’s Mitchell vestibule to see one of the library’s treasures, the Tasman map created in mosaic.\n\nZeny Edwards, author of a new book about the Meloccos, said the contribution of the Italian-born brothers to the country’s cultural and architectural heritage had, like that of many migrants, been grossly overlooked.\n\nThey had elevated architecture into art. Edwards described it as “painting in stone”, which is the book’s title.\n\nSitting on a bench with Hynes, overlooking the library’s mosaic representing the travels by Abel Tasman in 1642 and 1644, Edwards said it was “an amazing and complete work of art”.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/kiwis-bledisloe-snub-is-a-reminder-of-some-hard-truths-for-the-wallabies-20250328-p5ln7c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kiwis’ Bledisloe snub is a reminder of some hard truths for the Wallabies",
    "publish_date": "Sat, 29 Mar 2025 09:00:00 +1100",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "The idea of a Bledisloe Test on Anzac Day is a reasonable one, but the jury is still out on the merits of a three-Test Bledisloe series.\n\nThat’s the paradox that underpins New Zealand Rugby’s decision to pour cold water on Rugby Australia’s plan to stage an annual Anzac Day fixture between the two nations.\n\nThere are also rumblings that the relationship between RA and NZR isn’t that smooth. It would probably be best described as being in rehab after it hit rock bottom during the period when both organisations had different chairs.\n\nThat might be a story for a different day.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-29-march-2025/lrggspcn5",
    "title": "Midday News Bulletin 29 March 2025",
    "publish_date": "Sat, 29 Mar 2025 01:17:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nIn this bulletin;\n\n\n\nLeaders make their election pledge in Brisbane;\n\nTropical Cyclone Dianne makes landfall of northern West Australia;\n\nAnd in Tennis, Russian-born tennis star, Daria Kasatkina, granted Australian residency.\n\nThe Prime Minister has made his first stop of the campaign at an urgent care clinic in the Opposition leader's seat of Dickson in Queensland.\n\n\n\n\n\nBoth leaders have begun their first full day of campaigning, following the prime minister’s announcement that Australians will head to the polls on the 3rd of May.\n\n\n\n\n\nMr Albanese is spending the day in Brisbane where Labor hopes to gain ground in Queensland, currently holding just five of the state’s 30 seats.\n\n\n\n\n\nHe’s promising cost-of-living relief through tax cuts and more bulk-billed G-P visits by strengthening Medicare.\n\n\n\n\n\n\"Health care is so important, and what this election is about is strengthening the economy, strengthening Medicare versus Peter Dutton's plan for cuts to everything except your taxes. That is what is at stake in this election.\"\n\n\n\n\n\n—\n\n\n\n\n\nLeader of the Opposition, Peter Dutton, says Australians cannot afford to continue under a Labor government.\n\n\n\n\n\nHe has criticised the Albanese government’s approach to cost-of-living relief, telling Channel Seven that he will provide immediate cost-of-living measures if elected.\n\n\n\n\n\n\"We've got to help people in the short term, because over the last 12 months, we've just had the biggest number of small businesses that have failed in our country's history, and a lot of families are really doing it tough. So we need to provide support in the short term. And the Prime Minister's saying, well, in 15 months time, he'll give you 70 cents a day in a tax cut. Our plan is to provide a 25 cent a litre reduction in petrol and diesel and unleaded prices. Now that's going to be about $14 a week straight away.\"\n\n\n\n\n\nMr Dutton says that will be followed by structural reforms that include the Coalition's gas reservation plan on the East Coast which he says will bring electricity prices down.\n\n\n\n\n\n—\n\n\n\n\n\nThe Opposition Leader has told reporters that before the election he will reveal which visa categories the Coalition would target to cut permanent migration by 25 per cent.\n\n\n\n\n\nIn response to a question from SBS about whether he is alienating migrant voters he said, 'there are many migrant families I've spoken to around the country who are desperately worried for their kids' as they can't afford to buy a house'.\n\n\n\n\n\nHe added that 'so many from all parts of our society are experiencing exactly the same as everyone else, and that is that it's tougher to find a house under this government'.\n\n\n\n\n\n—\n\n\n\n\n\nRural communities in northern Western Australia are being warned to prepare for days of isolation after Tropical Cyclone Dianne made landfall early this morning.\n\n\n\n\n\nChristie Johnson with the Bureau of Meteorology says the category one system crossed the coast east of Cockatoo Island and is expected to weaken within hours.\n\n\n\n\n\nIt’s moving south and is forecast to pass east of Derby around midday.\n\n\n\n\n\n\"We're talking winds up to a hundred kilometres an hour now that's enough to bring down trees and lines and cause damage to properties. We're also talking about heavy rainfall that could cause flash flooding. R rainfall totals of 70 to a 100 millimetres over a six hour period, maybe even up to a hundred and fifty millimetres in that period. Now we are expecting the system to move inland and rapidly weaken back into a low pressure system, it's likely to continue to move southwards through Saturday, and then on Sunday tend more south to south. Easterly as it moves into the interior of Western Australia.\"\n\n\n\n\n\nFlash flooding is likely across northern and western Kimberley, and heavy rainfall could extend into the northern interior over the weekend.\n\n\n\n\n\n—\n\n\n\n\n\nAnd in tennis,\n\n\n\n\n\nRussian-born tennis star Daria Kasatkina is switching allegiances to Australia after her application for permanent residency was accepted by the government.\n\n\n\n\n\nThe world number 12 has been playing on the tour as a neutral athlete after Russian and Belarusian players were banned from competing under their own flags following Moscow's invasion of Ukraine in 2022.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/narges-is-baking-for-eid-festivities-but-for-millions-of-women-theres-little-to-celebrate/xlgca8f0h",
    "title": "Narges is baking for Eid festivities but for millions of women there’s little to celebrate",
    "publish_date": "Fri, 28 Mar 2025 21:01:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt’s a busy time of year for Narges Andar, a refugee from Afghanistan whose cakes are in demand for Eid celebrations.\n\n\n\n\n\n\"Sharing is done through food, showing love and appreciation and affection. So having that cake and everyone enjoying it at the same time is a wonderful blessing.\"\n\n\n\n\n\nMs Andar is self-taught and spends many hours decorating each cake.\n\n\n\n\n\nWith food prices rising she says quality ingredients aren’t cheap.\n\n\n\n\n\n\"I try and keep the prices low because I am a home baker. I do it out of love. It's not so much for economic gains, but it's my passion, it's my hobby.\"\n\n\n\n\n\nMs Andar is married and raising two children in Sydney.\n\n\n\n\n\nWhile her cakes may be sweet, she remains bitter about the plight of girls in Afghanistan.\n\n\n\n\n\nIn the three years since the Taliban cut secondary education for women, UNICEF estimates 2.2 million girls have been impacted and by 2030, more than four million girls will have their education stopped at primary school.\n\n\n\n\n\n\"It is very um, sad. It's really disheartening to see the women or the girls that had to leave their education half finished. Maybe they will not be able to live the dream that they had of becoming a doctor, for example, or a lawyer. I'm constantly seeing footages of girls crying and they can't finish their studies or they're struggling financially. The women where they have no male guardian, so how are they supposed to support their family?\"\n\n\n\n\n\nIt’s one reason Ms Andar secretly supports online education for girls in her homeland.\n\n\n\n\n\n\"There are very kind people out there that are trying to help them. And of course my husband and I try to do our bit to support wherever possible. Some kind of education. It could be something as simple as learning English.\"\n\n\n\n\n\nIt is decades since Ms Andar and her family fled conflict in Afghanistan, escaping overland on donkeys into neighbouring Pakistan.\n\n\n\n\n\nBut the memories of growing up in Kabul remain vivid.\n\n\n\n\n\n\"The skies being light up and me thinking that it's fireworks where it was actually conflict going on. And the loud bangs, it wasn't fireworks … so that's something scary.\"\n\n\n\n\n\nSydney academic Parisa Glass also fled conflict in her homeland.\n\n\n\n\n\n\"I remember being very young in Iran and having men surrounding our home, chanting that they want to kill my father and other Baháʼís in the community. It feels like the gates of hell opened.\"\n\n\n\n\n\nAt New South Wales University, Dr Glass runs a justice inclusion initiative called JEINA [[Jina]] which creates pathways for displaced women.\n\n\n\n\n\nJEINA is a Kurdish word meaning life-giver.\n\n\n\n\n\n\"It started in 2022 as a result of the uprising of women in Iran for their rights because Jina Mahsa Amini was incarcerated and she died in custody because of the choices of her clothing. And we don't want that to happen any more. So, it's really about justice for women wherever they may be.\"\n\n\n\n\n\nWorldwide, this year almost 140 million people are displaced or stateless, according to the UNHCR.\n\n\n\n\n\nDr Glass is working to improve outcomes for those seeking safety here.\n\n\n\n\n\n\"Forced migration happens for many reasons. And it could be war, it could be human rights violation, it could be climate change. It's a big barrier for them to actually be able to find employment and obviously other issues associated with that. Domestic violence is a big issue as well as mental health.\"\n\n\n\n\n\nJEINA has so far broadened opportunities for hundreds of women and Dr Glass hopes to scale further.\n\n\n\n\n\n\"We've got a massive mentoring network at UNSW. We want these women to take advantage of that and we want industry to partner with us so we can build a much bigger network.\"\n\n\n\n\n\nAs Ramadan fasting comes to an end, Narges Andar hopes all women can find reasons celebrate and count their blessings.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/do-australians-pay-too-much-for-petrol/27slvtyxu",
    "title": "Do Australians pay too much for petrol? Here's how we compare with the rest of the world",
    "publish_date": "Fri, 28 Mar 2025 19:49:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "With the cost of living still biting, the Coalition says it will lower petrol prices if elected.\n\n\n\n\n\nOpposition leader Peter Dutton has proposed halving the fuel excise for 12 months — dropping it from 50.8 cents a litre to 25.4 cents.\n\n\n\n\n\nThe measure is expected to cost $6 billion if it goes ahead, and is touted to deliver taxpayers a saving of $14 per week.\n\n\n\n\n\nBut in a global context, are Australians really paying too much at the bowser — and would cutting taxes on petrol actually help ease the pressure?\n\n\n\nREAD MORE Coalition pours petrol on the cost of living debate ahead of the election\n\nWhere Australian petrol prices sit on the global stage\n\nWhile it might feel like your bank account is being drained every time you fill up, Australians actually pay less per litre than many other countries.\n\n\n\n\n\nAccording to GlobalPetrolPrices.com, the average cost of petrol in Australia is $1.65 per litre — well below the global average of nearly $2 per litre.\n\n\n\n\n\nIn the United Kingdom, the average is $2.79, while European countries such as Iceland ($3.70), the Netherlands ($3.25) and Italy ($3.04) fork out almost double Australia's rate.\n\n\n\n\n\nIn contrast, the United States averages just under Australia at $1.45, with Vietnam ($1.27), Indonesia ($1.32) and Malaysia ($0.73) coming in even lower.\n\n\n\nWhile Australians may feel the pinch every time they fill up, petrol prices in Australia are lower than those in many other countries. Source: SBS News So, are we getting taxed more than other countries?\n\n\n\n\n\nYogi Vidyattama, an associate professor at the University of Canberra's School of Politics, Economics and Society, says Australians are \"in the middle\" when it comes to fuel taxes globally.\n\n\n\n\n\n\"In general and in the world context, the base price is quite similar,\" he says of petrol prices around the globe.\n\n\n\n\n\n\"It is more expensive than the US, but it's lower than European countries because of that high excise.\"\n\n\n\n\n\nIn the European Union, for example, each member state is required to levy a minimum of €0.36 (61c) per litre on petrol and €0.33 (56c) on diesel.\n\n\n\nAustralia fares comparatively well when it comes to fuel excises. Source: SBS News John Hawkins, senior lecturer at the University of Canberra, says relatively lower taxes are one reason we pay less at the bowser.\n\n\n\n\n\n\"Australia has lower fuel taxes than most OECD countries,\" he told SBS News. \"As a result, Australia's petrol prices are less than in most OECD countries.\" The OECD is a grouping of 38 countries with large market economies.\n\n\n\n\n\nWhen it comes to placing these prices against our average wages, Australia starts to fare even better.\n\n\n\n\n\nVidyattama estimates that each household in Australia consumes around 30 litres of petrol a week, which equates to about $60, or 3 per cent of the average income in Australia.\n\n\n\nBut global prices don't tell the full story\n\nWhile Australia may have a lower fuel excise than many countries, that doesn't mean the tax's overall impact on household budgets is small.\n\n\n\n\n\nFor one, Australia is a car-dependent country — far more reliant on vehicles than many other OECD nations, especially those in Europe.\n\n\n\n\n\n\"Even in the US, the level of public transport is much better than Australia, especially outside the capital cities,\" Vidyattama said.\n\n\n\nHawkins agrees: \"Australians drive more than Europeans because our cities sprawl and we don't have as good public transport, making us more car-dependent.\"\n\n\n\n\n\nAccording to the 2022 Census, the average Australian household owns 1.8 vehicles. More than 90 per cent of households reported owning at least one car, and over half (55 per cent) had two or more.\n\n\n\n\n\n\"It just shows how dependent Australia is on the car — and therefore, on fuel,\" Vidyattama said.\n\n\n\nLooking to save on your petrol prices? Data says you should fill up more often. Source: SBS News \"In some cities like Melbourne and Sydney, there's probably less dependence on cars for daily commutes,\" he added. \"But in other cities and regional areas, car dependence is much higher.\"\n\n\n\n\n\nHe also notes that geography plays a major role. \"Where you live and the quality of public transport in those areas affects how much the fuel excise actually impacts your daily budget.\"\n\n\n\n\n\nHawkins adds that Australians also tend to drive larger, less fuel-efficient vehicles — another factor in our overall petrol spending.\n\n\n\nSo, would cutting the excise help?\n\nIn its budget reply, the Opposition proposed to cut the fuel excise from 50.8 cents a litre to 25.4 cents. It said the cut would save a driver who fills up the average 55-litre tank each week about $14 a week.\n\n\n\n\n\nBut Vidyattama is sceptical. \"I was thinking that the number is inflated,\" he said.\n\n\n\n\n\nHawkins says the figures seem to be based on the assumption that households are spending $10,000 a year on petrol — something that may only be true for a small number of people living outside major cities.\n\n\n\nREAD MORE Coalition would dump tax cuts for cheaper fuel as Dutton accused of copying Morrison\n\nAnd, as Vidyattama points out, not everyone will benefit: \"Those who don't drive will see no benefit from the excise drop.\"\n\n\n\n\n\nWhile the proposed changes might nudge prices down slightly, the savings may not be significant for every household — particularly those with better access to public transport or lower fuel needs.\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/video/coalitions-sporting-ambitions-if-they-win-2025-federal-election/4q367anri",
    "title": "Coalition’s sporting ambitions if they win 2025 federal election",
    "publish_date": "Fri, 28 Mar 2025 09:41:51 +0000",
    "category": "sports",
    "authors": [],
    "text": "Coalition’s sporting ambitions if they win 2025 federal election\n\nPublished 28 March 2025, 9:09 am\n\nShadow Minister for Sport Anne Ruston says she will prioritise the health of the nation should her party win the upcoming election. She sat down with SBS reporter Adrian Arciuli to discuss all things sport.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/ex-police-officer-avoids-jail-for-fatally-tasering-95yo-woman/je5tf3bwr",
    "title": "Ex-police officer avoids jail for fatally tasering 95yo woman",
    "publish_date": "Fri, 28 Mar 2025 09:40:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/video/peter-dutton-pledges-more-gas-lower-power-bills-in-coalition-budget-reply/voswihu71",
    "title": "Peter Dutton pledges more gas, lower power bills in Coalition budget reply",
    "publish_date": "Fri, 28 Mar 2025 09:35:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/true-or-false-five-fact-checked-claims-as-dutton-albanese-and-bandt-hit-campaign-trail/qw6abeuz3",
    "title": "True or false? Five fact-checked claims as Dutton, Albanese and Bandt hit campaign trail",
    "publish_date": "Fri, 28 Mar 2025 06:44:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "It may feel like the election campaign started some time ago but Prime Minister Anthony Albanese officially called it this morning and the major parties gave their first speeches today.\n\n\n\n\n\nEach party will be working as hard as it can to win votes and false and exaggerated claims may appear.\n\n\n\n\n\nLet's go through the accuracy of five big claims made on Friday by Albanese as well as Opposition leader Peter Dutton and Greens leader Adam Bandt.\n\n\n\nAlbanese: 'Only Labor is acting on the cost-of-living ... Only a vote for Labor is a vote for stronger Medicare'\n\nLabor has made a number of cost-of-living promises including income tax cuts, expanding the Help to Buy scheme for first homebuyers, and capping the cost of medications on the PBS.\n\n\n\nREAD MORE Australian federal election 2025 explained: Everything you need to know\n\nBut the Liberal Party would strongly disagree that Labor is the only one acting on this issue. It has promised to lower energy bills and cut Australia's fuel excise to lower petrol prices .\n\n\n\n\n\nIt has also agreed to match the $8.5 billion Labor is planning to inject into Medicare to expand the bulk billing incentive , and to provide further incentive payments for clinics to bulk bill.\n\n\n\nAlbanese: 'The Liberals are promising to increase income tax for all 14 million Australian taxpayers and because Peter Dutton needs to find $600 billion to pay for nuclear reactors that will provide 4 per cent of Australia's energy needs some time in the 2040s, that money has to come from somewhere'\n\nSo Dutton hasn't explicitly announced an income tax increase, but the Coalition has said it won't support Albanese's tax cuts, due to kick in next year.\n\n\n\n\n\nOn nuclear, the figure Albanese appears to be quoting comes from the Smart Energy Council. It estimates the cost of building seven nuclear reactors proposed by the Coalition would be between $116-$600 billion, and they would provide 3.7 per cent of Australia’s energy mix in 2050.\n\n\n\nThe Liberal Party released its own costings from Frontier Economics suggesting its nuclear policy would cost $331 million, which it says is $263 billion less than Labor's renewable transition costs.\n\n\n\n\n\nThe costings of Dutton's nuclear plan are somewhat in dispute. The CSIRO and the Australian Energy Market Operator (AEMO) have both said nuclear is twice as expensive as renewables.\n\n\n\nDutton: Australians are now paying on average 18 per cent more for rent ... and over 30 per cent more for power and gas\n\nThe Opposition leader is sort of on the money here but not quite.\n\n\n\n\n\nCoreLogic data confirms that since the Albanese government came into power in May 2022, rents nationally have risen about 18 per cent.\n\n\n\n\n\nElectricity prices actually fell 9.9 per cent in the December 2024 quarter, and 25.2 per cent in the 12 months to January 2025, but some households faced bill spikes of up to 40 per cent before this, according to the Australian Bureau of Statistics (ABS).\n\n\n\nDutton: [Australians] are losing hope for their future — 29,000 small businesses have gone broke over the course of the Albanese government's first term\n\nData from Australia's Security and Investments Commission (ASIC) shows around 28,900 \"companies entered external administration or had a controller appointed\" since the Albanese government took power.\n\n\n\nBut ASIC's figures don't make the distinction that these are all \"small businesses\".\n\n\n\n\n\nA small business is defined by the ABS as having either fewer than 20 employees or an aggregated annual turnover of less than $10 million.\n\n\n\nBandt: 'Minority government is coming. And with the major parties offering about as attractive as a dead fish, you can see why'\n\nIt's a possibility no-one will win the federal election outright and Australia will have a minority government .\n\n\n\n\n\nSome experts told SBS News that polling indicates a minority government is looking pretty likely this time around.\n\n\n\n\n\nBut Bandt is calling this result before anyone's voted.\n\n\n\n\n\nAs for the dead fish reference, he's likely referring to his colleague Sarah Hanson-Young's Senate stunt , where she held up a dead salmon in protest against Labor's salmon-farming legislation.\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/economists-warn-car-tariffs-will-hurt-as-donald-trump-revs-up-trade-war/tyvhhmco7",
    "title": "Economists warn car tariffs will hurt as Donald Trump revs up trade war",
    "publish_date": "Fri, 28 Mar 2025 05:55:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"This is very modest, what we're going to be doing is a 25 per cent tariff on all cars not made in the United States.\"\n\n\n\n\n\nThat's U-S President, Donald Trump, announcing a new round of tariffs, this time for the car industry.\n\n\n\n\n\nFrom April 2, that fee will be payable on top of any foreign vehicle that enters the U-S.\n\n\n\n\n\nAllrich Auto owner Josh Allrich in Atlanta says he's concerned because the tariffs will raise the cost of new cars by 15 thousand dollars.\n\n\n\n\n\n\"It's already expensive out here, and now that he's adding this tariff it's going to make things a lot more expensive. My wheelhouse is economy cars, affordable cars, and now, this tariff is going to directly hit us because it's gonna just make things go up. So I haven't heard anything just yet, but I am looking forward to people now rushing in to buy some cars.\"\n\n\n\n\n\nThat is what Loretta Acosta is doing.\n\n\n\n\n\nShe is looking for a new car at a dealership in Michigan, before the tariffs are brought in.\n\n\n\n\n\nMs Acosta says she trusts the President has made a decision that benefits Americans.\n\n\n\n\n\n\"It feels like the end game is bringing industry back to America. So I mean, that is great for jobs. And it certainly would be good for investment, especially capital investment if you are a venture capitalist, so I think it would be good, but there are pros and cons to everything, of course.\"\n\n\n\n\n\nMr Allrich agrees with that perspective, despite the impact on his own business.\n\n\n\n\n\n\"My grandfather worked for Ford for about 25 years, and he was originally from Haiti. He was really able to build a career just based off being at Ford all those years. He was able to retire and leave his family with a whole lot, so I understand. Trump really wanted to kind of bring a lot of jobs back to the states, especially kind of labour jobs you know with these different car companies.\"\n\n\n\n\n\nMarco Simoni is an economist with Luiss University in Rome.\n\n\n\n\n\nHe has a different perspective, that the U-S economy - and its people - will suffer.\n\n\n\n\n\n“The new tariffs introduced by President Trump will have an impact on the European car industry and will have a strong impact on American consumers because the prices of their cars is going to go up. And of course European carmakers are going to look into other geographies and perhaps also selling more cars within Europe.”\n\n\n\n\n\nAmerican economists also say the tariffs will hurt U-S car manufacturers.\n\n\n\n\n\nEconomist Professor Tibor Besedes at the Georgia Institute of Technology has concerns over the investment that can be made in the industry if tariffs are removed by another U-S administration in four years.\n\n\n\n\n\nAnd he says some American businesses may have major production issues when the tariffs on automobile parts come into play in May.\n\n\n\n\n\n\"There are very few supply chains in cars that are completely within the United States. Many supply chains in the car industry are within the NAFTA, USMCA countries like Canada, Mexico, United States for parts and unfinished cars travel across borders multiple times before they finally produced and assembled either in any of those three countries.\"\n\n\n\n\n\nRoberto Valvassori is the President of the Italian Association of Automotive Industry.\n\n\n\n\n\nHe is confident the luxury European car market would be less sensitive to price rises.\n\n\n\n\n\n\"So if you have the desire to drive Italian prestigious cars it prevails on costs. In fact it can make even more of a difference than a regular car. The consumer will be willing to pay this extra levy.\"\n\n\n\n\n\nBut worries remain over the diplomatic implications of the fees.\n\n\n\n\n\nHildegard Mueller is head of Verbrand der Automobilindustrie, the industry body in Germany, which is Europe's biggest car exporter.\n\n\n\n\n\n\"This will have significant consequences for growth, employment, prosperity and jobs on both sides of the Atlantic. The U.S. economy and U.S. consumers will also suffer from the fact that the U.S. wants to withdraw from the international trade partnership.\"\n\n\n\n\n\nThere are similar sentiments across Asia.\n\n\n\n\n\nAfter embracing the return of a once staunch ally with major investments in the U-S, Japan’s car makers now find themselves on the front line of a burgeoning global trade war.\n\n\n\n\n\nJapanese Prime Minister Shigeru Ishiba has described his country as the number one investor to the U-S and says it is not right that all countries should be treated the same.\n\n\n\n\n\n\"We must consider what will serve Japan's national interest. We are strongly requesting the U-S not to apply these 25% tariffs on Japan. There are different options. We have to consider which is the most effective and have all options in mind.\"\n\n\n\n\n\nIt is a huge blow to South Korea, too.\n\n\n\n\n\nIndustry Minister Ahn Duk-Geun says half of the country's car exports are sent to the U-S.\n\n\n\n\n\n\"About 50% of our automobile exports go to the United States, so there are concerns about significant damage to the auto industry. The difficulties will be especially severe for not only the finished car manufacturers but also the parts suppliers.\"\n\n\n\n\n\nThe Chinese government has condemned the new tariffs, with Foreign Ministry Spokesperson Guo Jiakun saying there are no winners in a trade war.\n\n\n\n\n\n\"The U.S.'s actions violate WTO rules, undermine the rules-based multilateral trading system and the common interests of people of all countries, and are not conducive to solving its own problems.\"\n\n\n\n\n\nThe so-called Trump tariffs have been a body blow to America's key trade partners and their major industries.\n\n\n\n\n\nIndustry analysts have said they could be rolled back or modified before they come into effect next week, but there is no such indication yet from the White House.\n\n\n\n\n\nMeanwhile, Canada is doubling down.\n\n\n\n\n\nNew Prime Minister Mark Carney will convene a Cabinet meeting in the coming hours over what he has described as an attack.\n\n\n\n\n\nHe says the old relationship between Canada and the United States is \"over,\" following the car tariff announcement.\n\n\n\n\n\nAnd Ontario Premier Doug Ford has called out President Trump directly.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/when-a-group-chat-goes-rogue-ukraine-ceasefire-stalls/sw5iyf6fg",
    "title": "When a group chat goes rogue, Ukraine peace talks and Indonesia's new military law",
    "publish_date": "Fri, 28 Mar 2025 05:28:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/tax-cuts-or-cheaper-fuel-the-cost-of-living-trade-off-facing-australians-this-election/3gmzb25po",
    "title": "Tax cuts or cheaper fuel? The cost of living trade-off facing Australians this election",
    "publish_date": "Fri, 28 Mar 2025 05:11:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Labor’s tax cuts promise relief to all taxpayers, while Opposition leader Peter Dutton’s proposed fuel excise cut aims to bring down petrol prices. But as experts weigh in, doubts are emerging about whether either policy will deliver meaningful relief to those who need it most.\n\n\n\nThe case for tax cuts\n\nThe Labor government has legislated to cut the lowest tax rate — which applies to incomes between $18,001 from $45,000 — by 1 per cent in July next year.\n\n\n\n\n\nThat will bring the tax rate in that income bracket down to 15 per cent, with a further percentage point cut to come the following year.\n\n\n\n\n\nIt's estimated that the revised tax cuts would give all taxpayers up to $268 in 2026-27 and $536 every year after that.\n\n\n\n\n\nOn average, most Australians affected by the cut will be saving roughly an extra $5 a week in the first year of the change followed by $10 per week each subsequent year.\n\n\n\n\n\nPrime Minister Anthony Albanese has pitched the plan as a fairer approach to economic relief, highlighting that the changes will put more money into the pockets of everyday Australians rather than disproportionately benefitting high earners.\n\n\n\nREAD MORE Coalition would dump tax cuts for cheaper fuel as Dutton accused of copying Morrison\n\nHowever, policital scientist Dr Paul Williams from Griffith University argues that the proposed tax cut is unlikely to sway voters.\n\n\n\n\n\n\"This is a cost of living election. In this climate, voters are sensitive to the hip pocket nerve. It's going to take more than a $5-a-week tax cut that will take a year to kick in to motivate those that are doing it tough. A vote choice is an incredibly complicated, nuanced process of factors,\" Williams said.\n\n\n\n\n\n\"If you look at Labor's budget, it was quite modest in its promises, and it was more or less compounding or extending programs that have been done before because it was a budget Labor didn't want, for an election they didn't want — Labor wanted the election last year so the timing is all out for them.\"\n\n\n\nDutton's fuel excise pitch\n\nA Dutton-led Coalition government has promised to dump tax cuts in favour of a temporary cut to the fuel excise in a move it says would save families hundreds of dollars.\n\n\n\n\n\nThe proposal would halve the fuel excise for 12 months, lowering the rate on petrol and diesel from about 50 cents to 25 cents per litre. The plan would save a one-car family about $750 a year — or $14 a week — and a two-car family about $1,500 a year — or $28 a week.\n\n\n\n\n\nIt's expected to cost $6 billion a year.\n\n\n\n\n\nEconomist Thomas Walker argues that both tax cuts and fuel excise would do little to alleviate immediate financial pressures.\n\n\n\n\n\n\"These promises are so modest on both sides, they're going to have such a little impact on people's take-home pay in the next two to three years,\" Walker said.\n\n\n\n\"Cost-of-living increases — particularly in housing, groceries, and energy — continue to outpace wage growth, meaning extra dollars from tax relief may quickly be swallowed up by rising expenses.\n\n\n\n\n\n\"There are also concerns about the inflationary impact of injecting more disposable income into the economy — these policies also don't help those that need it most like students and those on JobSeeker benefits.\"\n\n\n\n\n\nBoth policies highlight how cost-of-living pressures are dominating the election agenda. But beyond tax cuts and fuel relief, Australians are grappling with housing affordability, wage stagnation, and rising essential costs.\n\n\n\n\n\nWhile Walker adds that neither policy adequately addresses the root causes of financial strain, he says Australia is long overdue for \"big picture\" structural reforms.\n\n\n\n\n\n\"Tax cuts aren't tax reform,\" Walker said.\n\n\n\n\n\n\"Both sides refuse to address the structural inequalities, which are really evident to people. We have vast sums of money that are given out in tax breaks and concessions, flowing to the wrong people. Most economists say that our government is overly generous and we need tax reform, but both political parties just don't seemingly want to go there.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-updates-leaders-hit-the-campaign-trail-after-pm-announces-may-3-election-date-20250328-p5lncq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Federal election 2025 LIVE updates: Leaders hit the campaign trail after PM announces May 3 election date",
    "publish_date": "Sat, 29 Mar 2025 12:48:52 +1100",
    "category": "finance",
    "authors": [
      "Craig Butt"
    ],
    "text": "For more context on Matthew Knott’s post below about Peter Dutton being asked questions about the gas reservation plan announced on Friday, business reporter Nick Toscano and climate/energy correspondent Mike Foley reported that the gas industry was blindsided by the policy.\n\nThe Coalition’s so-called “Australian gas for Australians” scheme – a pitch to voters struggling with energy bills and other living costs – would curb exports of uncontracted gas from Queensland’s giant liquefied gas ventures and force additional supplies to be sold to local buyers at cheaper prices.\n\nThe proposed reservation scheme sparked an immediate backlash from the gas industry, which warned it could deter the very investments in new gas supplies that the Coalition says it is trying to encourage.\n\nAustralian Energy Producers, an industry group, called the proposal a “damaging market intervention” that would force a glut of domestic gas, undermine their ability to sanction new gas-drilling projects in Victoria and NSW, and threaten trading relationships with long-term LNG buyers.\n\nRead the full story here.",
    "source": "TheAge",
    "cluster_id": 37
  },
  {
    "url": "https://www.theage.com.au/world/europe/naysayers-queen-claims-victory-over-online-reading-club-with-12-million-members-20250328-p5lnc5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Naysayers’: Queen claims victory over online reading club with 12 million members",
    "publish_date": "Sat, 29 Mar 2025 11:55:25 +1100",
    "category": "entertainment",
    "authors": [
      "Victoria Ward"
    ],
    "text": "London: Queen Camilla has claimed victory over the many “naysayers” who did not believe her online book club would be a success.\n\nAs she marked the fourth anniversary of The Queen’s Reading Room at a star-studded reception at Clarence House this week, Camilla revealed that she had built a “family” of 12 million readers spanning 173 countries.\n\nShe said her aim was simply to “make life better”.\n\nQueen Camilla speaks as King Charles looks on during a reception to mark the launch of the Queen’s reading room medal at Clarence House on Tuesday. Credit: Getty Images\n\nThe Queen was supported by her family, with King Charles, her sister Annabel Elliot, and children Tom Parker Bowles and Laura Lopes mingling with a host of authors and literary figures.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/russian-born-daria-kasatkina-switches-allegiance-to-australia-20250329-p5lnht.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘My new homeland’: Russian-born tennis star Daria Kasatkina switches allegiance to Australia",
    "publish_date": "Sat, 29 Mar 2025 11:25:14 +1100",
    "category": "sports",
    "authors": [
      "Scott Spits"
    ],
    "text": "Russian-born tennis star Daria Kasatkina is switching allegiances to Australia after her application for permanent residency was accepted by the federal government.\n\nThe world No.12 has been playing on the tour as a neutral athlete after Russian and Belarusian players were banned from competing under their own flags following Moscow’s invasion of Ukraine in 2022.\n\nDaria Kasatkina, pictured playing at the Australian Open in January, will compete for Australia now that she has been granted permanent residency. Credit: Getty Images\n\nIn an Instagram post, Kasatkina expressed her joy in gaining permanent residency in Australia.\n\n“I am delighted to let you all know that my application for permanent residency has been accepted by the Australian Government,” she wrote.",
    "source": "TheAge",
    "cluster_id": 9
  },
  {
    "url": "https://www.theage.com.au/politics/federal/albanese-chalmers-press-conference-interrupted-by-heckler-20250329-p5lnhl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Albanese, Chalmers press conference interrupted by heckler",
    "publish_date": "Sat, 29 Mar 2025 11:06:23 +1100",
    "category": "finance",
    "authors": [],
    "text": "Albanese, Chalmers press conference interrupted by heckler\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/i-genuinely-believe-he-hasn-t-made-a-decision-seibold-says-he-doesn-t-know-if-dce-will-play-on-20250328-p5lnfi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I genuinely believe he hasn’t made a decision’: Seibold says he doesn’t know if DCE will play on",
    "publish_date": "Sat, 29 Mar 2025 10:43:25 +1100",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Manly coach Anthony Seibold genuinely believes Daly Cherry-Evans is unsure if he wants to play on next year, let alone whether he has a deal already in place at a rival club.\n\nSeibold also confirmed on Saturday that the man he described as the club’s “best player”, Tom Trbojevic, is an option at five-eighth for the Sea Eagles when DCE departs at the end of the season.\n\nSeibold also said he did not expect fans to boo Cherry-Evans at 4 Pines Park on Sunday afternoon, saying “Manly supporters should congratulate ‘Chez’ on the career he’s had at this club, which isn’t done yet”.\n\nIt has been a whirlwind week for the Sea Eagles since Cherry-Evans revealed on Monday he would walk away from the club at the end of the year after 15 seasons and was open to playing on with another NRL team.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/not-letting-them-make-a-fool-of-me-bronco-destined-for-origin-recall-20250328-p5lngr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Not letting them make a fool of me’: Bronco destined for Origin recall",
    "publish_date": "Sat, 29 Mar 2025 10:26:50 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "When faced with a particularly enthralling match-up, something ignites within Kotoni Staggs.\n\n“I’ve had some class centres in front me, and I just want to be better than that opposition number,” he tells this masthead.\n\nAccording to Broncos coach Michael Maguire, that trait has him on a collision course with a State of Origin recall.\n\nKotoni Staggs and Selwyn Cobbo celebrate the former’s try for the Broncos against the Dolphins on Friday night. Credit: NRL Photos\n\nThe Broncos’ strike centre has saved his finest performances for vendetta missions – his clashes with Maroons ace Valentine Holmes and Cronulla powerhouse Siosifa Talakai are prime examples.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/lifestyle/meghan-markle-reveals-how-her-jams-are-made-20250329-p5lnhj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Meghan Markle reveals how her jams are made",
    "publish_date": "Sat, 29 Mar 2025 10:07:13 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Meghan Markle reveals how her jams are made\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/queensland-hit-by-horrific-flood-damage-20250329-p5lnhg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Queensland hit by 'horrific' flood damage",
    "publish_date": "Sat, 29 Mar 2025 09:54:34 +1100",
    "category": "finance",
    "authors": [],
    "text": "Queensland hit by 'horrific' flood damage\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/racing/heavy-rain-forces-move-of-tancred-stakes-day-at-rosehill-to-tuesday-20250329-p5lnh6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Heavy rain forces Tancred Stakes day at Rosehill to be moved to Tuesday",
    "publish_date": "Sat, 29 Mar 2025 09:36:03 +1100",
    "category": "sports",
    "authors": [
      "Craig Kerry"
    ],
    "text": "Tancred Stakes day at Rosehill, featuring two group 1 races, has been moved to Tuesday after it was washed out on Saturday morning.\n\nRacing NSW stewards announced just before 8.30am that following overnight rain, and with up to 50mm forecast for the remainder of the day, the meeting had been postponed due to the condition of the track.\n\nRacing has been called off at Rosehill, where Marhoona took out the Golden Slipper last Saturday. Credit: Getty Images\n\nOfficials said at 6.55am that the surface was rated a soft 7 and a further inspection would be held at 9am. However, further heavy rain prompted an earlier decision. The Rosehill area had more than 25mm overnight and into the early morning.\n\nOfficials announced the meeting, featuring the $1.5 million weight-for-age Tancred Stakes (2400m) and $750,000 Vinery Stud Stakes for three-year-old fillies, would be held on Tuesday.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/from-palaszczuk-to-crisafulli-clock-is-ticking-for-brisbane-2032-20250328-p5ln8i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "From Palaszczuk to Crisafulli: Clock is ticking for Brisbane 2032",
    "publish_date": "Sat, 29 Mar 2025 09:33:00 +1100",
    "category": "sports",
    "authors": [
      "Darren Kane"
    ],
    "text": "If you go back about four years, you’ll see that the political shenanigans in Queensland served as a portent to the future all along.\n\nBy July 2021, then-Premier Annastacia Palaszczuk, having shut down Queensland due to COVID-19, left the country to attend the 138th session of the International Olympic Committee, convened in Tokyo to coincide with the Games of the XXXII Olympiad.\n\nThat Palaszczuk should have been in Tokyo amid the political grandstanding about whether Queensland or Western Australia could lay claim to being the most sterile and mean jurisdiction during the pandemic certainly raised eyebrows.\n\nHer practised astonishment and faux celebrating, unleashed once the masked-up IOC President Thomas Bach announced Brisbane as the winner in the one-horse race to host the 2032 Olympic Games, was cringeworthy.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/nsw/the-forgotten-and-overlooked-sydney-art-you-may-be-standing-on-right-now-20250324-p5lm47.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The forgotten and overlooked Sydney art you may be standing on right now",
    "publish_date": "Sat, 29 Mar 2025 09:30:00 +1100",
    "category": "entertainment",
    "authors": [
      "Julie Power"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nMost young people are told to look up. Not Victoria Hynes, whose late grandfather Peter Melocco’s mosaic flooring once decorated hundreds of public buildings in Sydney.\n\nAs a child, Hynes was taken on walks through Sydney’s CBD to see the work of Peter and his brothers, Antonio and Galliano, known as the Melocco Brothers. It was everywhere, she said, from “the Hogwarts-like splendour” of the State Theatre to banks, Dymocks and big department stores.\n\n“Look down,” her mother said when they visited the crypt of St Mary’s Cathedral and the State Library’s Mitchell vestibule to see one of the library’s treasures, the Tasman map created in mosaic.\n\nZeny Edwards, author of a new book about the Meloccos, said the contribution of the Italian-born brothers to the country’s cultural and architectural heritage had, like that of many migrants, been grossly overlooked.\n\nThey had elevated architecture into art. Edwards described it as “painting in stone”, which is the book’s title.\n\nSitting on a bench with Hynes, overlooking the library’s mosaic representing the travels by Abel Tasman in 1642 and 1644, Edwards said it was “an amazing and complete work of art”.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/kiwis-bledisloe-snub-is-a-reminder-of-some-hard-truths-for-the-wallabies-20250328-p5ln7c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kiwis’ Bledisloe snub is a reminder of some hard truths for the Wallabies",
    "publish_date": "Sat, 29 Mar 2025 09:00:00 +1100",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "The idea of a Bledisloe Test on Anzac Day is a reasonable one, but the jury is still out on the merits of a three-Test Bledisloe series.\n\nThat’s the paradox that underpins New Zealand Rugby’s decision to pour cold water on Rugby Australia’s plan to stage an annual Anzac Day fixture between the two nations.\n\nThere are also rumblings that the relationship between RA and NZR isn’t that smooth. It would probably be best described as being in rehab after it hit rock bottom during the period when both organisations had different chairs.\n\nThat might be a story for a different day.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://au.news.yahoo.com/warning-over-150-mystery-box-trend-showing-unclaimed-australia-post-parcels-being-opened-concerning-001532860.html",
    "title": "Warning over $150 'mystery box' trend showing unclaimed Australia Post parcels being opened: 'Concerning'",
    "publish_date": "2025-03-29T00:15:32Z",
    "category": "finance",
    "authors": [],
    "text": "Inside the boxes are books, shoes, car parts and more. But the trend that has intrigued thousands online comes with a serious message from Australia Post.\n\nAustralian TikTok creators are buying and opening unclaimed mail in a popular new series of a videos. Source: TikTok/@the_kali_adventure, TikTok/@the_buxtons_wotsup\n\nA new 'mystery box' TikTok trend stemming from the US and making waves in Australia has sparked concern for the safety and privacy of Aussie residents.\n\nWhile ‘unboxing’ videos have been hugely popular on the internet for years, the latest items being opened by Aussie content creators could have a connection to you or someone you know.\n\nFeatured in a growing number of Australian-based videos are ‘mystery boxes’ containing packages and parcels that are reportedly ‘unclaimed’ mail that never made it to its intended owner. The packages are still sealed, with labels attached that show the names and addresses of the intended owner.\n\nAmong them is a charging station meant for Craig in Queensland. A motorbike part for Mark in Tasmania. A garden hose for Steven in South Australia. New shoes for Belinda in Western Sydney.\n\nADVERTISEMENT\n\nA box of five packages is being sold for $50, while larger boxes cost up to $150.\n\nSome packages have Australia Post labelling on them, leading the postal giant to express serious concerns about the mystery boxes and the details left on the labels.\n\n“Australia Post has significant concerns about the inclusion of addressed packaging within these boxes and confirms we have no connection or affiliation with the mystery box scheme,” a spokesperson told Yahoo News.\n\n“We encourage anyone receiving envelopes or mailer boxes with address or personal details included to dispose of them immediately and securely.\n\n“Australia Post urges social media creators to take care when making videos of this nature to avoid revealing customer address details.”\n\nWhat happens to unclaimed mail?\n\nLost or undeliverable mail is an unfortunate occurrence for AusPost, who handle around 2.5 billion items every year.\n\nADVERTISEMENT\n\nIn some cases, if items are addressed incorrectly or if a label falls off, the parcels are returned to AusPost's Mail Redistribution Centre, where they are opened and catalogued.\n\nAfter two months, if the owners can't be found or no-one has submitted a 'lost mail' enquiry, the items may be auctioned for charity.\n\nOne of the approved auction houses is Theodore Bruce, who say they have recently sold a variety of designer and luxury goods that came from unclaimed packages.\n\nThese include:\n\nLouis Vuitton Handbags\n\nSmartphones, laptops and tablets\n\nSneakers and trainers such as Nike and Yeezy\n\nKitchen appliances including Thermomix\n\nDesigner sunglasses, watches and clothes\n\nAusPost said unlike the now-viral mail boxes, they would never sell 'mystery' items, only products from opened packages that can be checked over before being sold. They also never approve any item to be sold if they contain identifying markings or labels.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 38
  }
]