[
    {
        "url": "https://www.9news.com.au/national/livesavers-hold-silent-vigil-bondi-terror-attack-victims/481a1f46-2a6f-4c34-952b-f580a7781fcf",
        "title": "Lifesavers hold silent vigil at Bondi Beach to honour victims of terror attack",
        "publish_date": "Sat, 20 Dec 2025 00:51:31 +0000",
        "category": "sports",
        "authors": [
            "Dec"
        ],
        "text": "\"We stand shoulder to shoulder to show we are a united group of surf lifesavers and lifeguards across the country,\" Surf Life Saving\n\n\"We encourage you to do this as a show of support for fellow lifesavers and recognition of the tragedy that has unfolded at Bondi while also reflecting on our respect and compassion for the Jewish community targeted by this attack.\"﻿\n\n\"We encourage you to do this as a show of support for fellow lifesavers and recognition of the tragedy that has unfolded at Bondi while also reflecting on our respect and compassion for the Jewish community targeted by this attack.\"﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/analysis-urgent-warning-to-all-australians-about-triple-zero-calls-but-wait-dont-hang-up/f1f85160-c95c-4a5f-adcf-a3d3a36d2aa1",
        "title": "Urgent warning to all Australians about Triple Zero calls",
        "publish_date": "Fri, 19 Dec 2025 19:58:30 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Analysis: The Optus network outage that occurred on September 18 this year led to a failure of hundreds of Triple Zero calls, and tragically two deaths where people had attempted to make Triple Zero calls.\n\nYesterday's independent report, released by Optus, is a complex analysis of the incident which will lead to changes in the handling of network upgrades, communications within Optus, but most alarmingly, shines a light on a serious issue with our modern mobile-reliant communications systems and the Triple Zero emergency line.\n\nLeaving aside the analysis of the technical \"why\" surrounding the network outage, and understanding that there will be plenty of people at Optus looking at potentially packing their bags after failures to escalate the problem and properly communicate the issues, the real focus, I think, should be on educating Australians about the learnings we can all take from this issue.\n\nREAD MORE: Official Christmas Day forecast revealed\n\nAn independent report released by Optus shines a light on a serious issue with our modern mobile-reliant communications systems. (Getty)\n\nOn the very first page of the over 40-page report produced by Dr Kerry Schott AO, there is a reference to mobile devices possibly taking \"40 to 60 seconds to camp-on,\" which is the technical term for your mobile finding an alternate network to make a Triple Zero call in the event of an outage.\n\nCalls to Optus' customer support on the day of the outage reported this exact problem; customers had tried to call Triple Zero but heard nothing but complete silence.\n\nA key recommendation of the Schott report is to \"Inform all customers that their devices may take 40-60 seconds to connect to Triple Zero\" - that is a staggering thing to hear, as Dr Schott points out, \"In an emergency, people are unlikely to hang on for this length of time, especially when the only response they are getting is silence on the line.\"\n\nCritically, there is no single way in which mobile phones operate in the event of an outage to process a request to call Triple Zero.\n\nOptus testing showed that Apple and Samsung phones used different pathways to establish a route through to another network and ultimately to Triple Zero.\n\nMost concerning might also be the analysis which showed both Apple and Samsung devices attempted to connect to 3G to make that call, despite the fact that 3G has been switched off in Australia for over a year now.\n\nGiven this 40 to 60 second delay, it can be assumed that part of that timeframe is used to attempt 3G connections, and that should be written completely out of the code for devices used in Australia.\n\nREAD MORE: How everyday Aussies can help in the wake of the Bondi shooting\n\nMost alarmingly, the report shines a light on a serious issue with our modern mobile-reliant communications systems and the Triple Zero emergency line. (Getty)\n\nPerhaps problematically, removing that code might then render the phones unable to contact emergency numbers in other countries when travelling, which is also an issue for travellers coming to Australia with phones still hard-coded to use 3G for emergency services.\n\nThe Schott report recommends that the industry and Government investigate ways to make the Triple Zero system be data-enabled, which would remove this reliance on now-old, outdated, and discontinued mobile network concepts.\n\nConcerningly, the report also recommends that the public be encouraged to test their devices to ensure they work for a Triple Zero call.\n\nIt is vital that the public never call Triple Zero unless it is an emergency; in fact, it's an offence to do so.\n\nWhat is needed though is a system by which people can have faith that their phone will work in the unique circumstances of a network failure, something you can't test by simply making a call.\n\nIndustry testing of devices must continue; a phone or SMS number should be set up for people to contact to validate their device, and the regulators and Government must act fast to bring our Triple Zero emergency call network up to a modern global standard.\n\nWhile not noted in the Schott report, this could and should include factors such as calls via satellite, SMS, and messaging connectivity to Triple Zero and a modern data-enabled call system; it's the least we should expect from the most important phone number in Australia.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/general-pants-missing-orders-customer-service-christmas-cut-off/ff4de524-596b-4075-b2f3-7147dfefcd19",
        "title": "Sophie ordered a Christmas gift weeks ago and it still hasn't been shipped. She's not alone",
        "publish_date": "Fri, 19 Dec 2025 00:21:48 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Exclusive: ﻿Sophie ordered her boyfriend's Christmas present from General Pants Co. on December 1, but almost three weeks later, it still hadn't arrived.﻿\n\nIt hadn't even been sent off for shipping yet.\n\nSophie told 9news.com.au every attempt to contact the major Australian fashion retailer has gone unanswered, which is almost as frustrating as her missing order.\n\nLIVE UPDATES: Incredible scenes as hundreds paddle out at Bondi Beach\n\nShoppers like Sophie are fuming after major Aussie retailer 'ignored' emails about missing orders. (Supplied)\n\nAnd she's not the only one.\n\nMultiple customers told 9news.com.au that orders they placed ﻿with General Pants Co. online in the first week of December have not been shipped by December 18.\n\nThey claimed emails to the brand's customer service ﻿address receive nothing more than auto-generated replies promising to get back to them soon.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nBendigo local Sophie, who asked not to have her surname published, said she could not get a response from General Pants Co. about her missing order on social media.\n\nShe left a frustrated comment under one of the retailer's Instagram ﻿posts on Wednesday asking for answers.\n\nOne post was still up on the General Pants Co. Instagram account with frustrated comments under it on Thursday morning. (Instagram/@general_pants)\n\nHours later, the post and comments had vanished from the General Pants Co. ﻿profile.\n\nShe placed her order at the start of the month and got a confirmation email, but no message saying it had been shipped.\n\nAfter waiting several days for ﻿an update, she tried contacting General Pants Co. ﻿customer service.\n\nEmails and social media messages went unanswered, she claimed.﻿\n\n\"I feel super frustrated,\" she said.\n\n\"They are obviously aware of an issue and they are avoiding taking any accountability.\"\n\nSophie placed her order on December 1 and received a confirmation email. She reached out on December 12 when it hadn't been shipped but only got a generic reply. (Supplied)\n\nAdelaide local Christina, who also asked not to have her surname published, placed an order on December 7 that also hasn't shown up.\n\nLike Sophie, she received no updates after the initial order confirmation email.\n\nShe tried to reach General Pants Co. ﻿customer service five times via email, live chat and social media but was unsuccessful.\n\nShe said it wasn't until she left an angry comment on the brand's Instagram page that she finally got a response.\n\nAn Instagram direct message from the ﻿retailer's account, ﻿which has been sighted by 9news.com.au, said her order hadn't been shipped.\n\n\"The item is being fulfilled from one of our stores, which has caused the delay,\" it read.﻿\n\n\"We apologise that this hasn't met expectations.\"\n\nREAD MORE: Heavily armed police make several arrests on Sydney street\n\n﻿Christina was told she could have the order cancelled and refunded, or escalated again.\n\nShe was disappointed but unsurprised.\n\n\"Considered they've been dodging providing an update for so long, I knew something must be going on﻿,\" she told 9news.com.au.\n\n\"I'm just struggling to understand how a company this big can promote and list shipping times on their site and not adhere to them, especially during Black Friday and Christmas period when they know it's going to be busy.\"\n\nSophie believes the brand should have proactively notified impacted customers of any delays.\n\nA ﻿General Pants Co. ﻿spokesperson told 9news.com.au that a small number of deliveries may take longer at this busy time of year, after Black Friday and Cyber Monday.\n\n\"While we are proud that delays are extremely minimal, we fully understand how important timely deliveries are to our customers,\" they said.\n\n\"Whilst our expected delivery times are clearly outlined in the shipping terms on our website, our dedicated customer care team is always on hand to provide support.\n\n\"We continually review and improve our operations to ensure the best possible service.\"\n\nREAD MORE: Teen girl takes bullet while shielding two toddlers in Bondi attack\n\nAccording to the General Pants Co. website, Christmas cut-off dates range from as early as December 12 to as late as December 22 depending on the location.\n\nThe 'delivery' page on the retailer's site also bears a warning that delivery times may be slightly delayed due to a high volume of orders.\n\nIt asks customers to allow five to seven business days for orders to be ﻿dispatched, after which standard delivery timeframes apply.\n\nSophie and Christina both placed their orders well before even the earliest holiday cut-off date and even with a seven day dispatch delay ﻿and the longest standard delivery time, Sophie should have received her order on Wednesday.\n\nInstead, she received an alert from Afterpay today saying the order had been cancelled.\n\nShe said she didn't receive any communication from General Pants Co. about it.\n\n﻿Now she's scrambling to find a replacement Christmas gift.﻿\n\n\"It's really poor that they aren't being transparent and haven't contacted customers directly or at least posted on their socials that they are experiencing delays,\" Sophie said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/ashes-2025-jason-gillespie-slams-england-over-nonsense-presser/106166094",
        "title": "'All is not well': Aussie great slams England after 'nonsense' interview",
        "publish_date": "Sat, 20 Dec 2025 01:59:47 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian Test great Jason Gillespie has slammed England after the team once again sent an assistant coach out to speak to the media after a poor day three of the third Ashes Test at Adelaide Oval.\n\nSpin coach Jateen Patel spoke after a day's play that saw Australia dominate with bat and ball, suggesting that people outside the English camp had built up this Ashes series to be more than it is.\n\nFollow live: All the action from day four of the third Ashes Test at Adelaide Oval\n\n\"I think the narrative of [the Ashes] being the series is everyone else's story,\" Patel said.\n\n\"But we're out here to try and win a series against Australia and take away the Ashes.\n\n\"We've got a lot of work [to do] to get there to do that. We had a lot of work to do from the start. It hasn't gone our way so far. We've got a huge mission in the next couple of days, but, I mean, this team has done some amazing things before.\"\n\nThe comment directly contradicted the thoughts of head coach Brendon McCullum.\n\n\"He's a proper ­cricketer,\" McCullum said in September while talking about Jofra Archer.\n\n\"Hence why we've taken our time with him to make sure that we give him every chance to be in the biggest series of all of our lives.\"\n\nSpeaking on ABC Sport, Gillespie said it was a \"nonsense\" approach.\n\n\"Nonsense. Plain and simple. That was just nonsense,\" Gillespie said.\n\n\"It completely contradicts what the head coach has said, [the] biggest series of our lives, and then [Patel's] playing it down.\n\n\"It didn't make any sense to me.\"\n\nThe former Australian quick said it was a sign that tension was building in an English camp on the brink of losing the Ashes and going down 3-0 after three Tests.\n\n\"I'm just hearing excuse after excuse after excuse from this England side,\" Gillespie said.\n\nMichael Vaughan and Jason Gillespie walk out with the Ashes Crystal replica before the start of the Adelaide Test. (Getty Images: Sarah Reed)\n\n\"They're feeling the heat, there's no doubt about it. Sending out assistant coaches to speak to the media, no players, no head coach, no captain. All is not well in that camp.\"\n\nEnglish cricket pundit Jonathan Agnew said there had been a string of different staff members fronting the media and that England was running out of options.\n\n\"I'm looking forward to seeing who England put out tonight for the interview because so far we've had the bowling coach, David Saker, then we had the assistant coach, Marcus Trescothick, then we had the spin bowling coach last night, Jeetan Patel, the New Zealander,\" Agnew said.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\n\"I'm not sure what remains in there. They're obviously reluctant to put a player out. I'm going for the bus driver, I think he's due. Let's get his thoughts on the Ashes.\"\n\nAgnew said he felt sorry for the coaches who had to speak to the media in place of the coach and the players.\n\n\"I feel sorry [for them]. You've [Gillespie] been there as a coach trying to defend the indefensible and you hear them stand up and say quite silly things like, 'Will Jacks bowled quite tidily there'. Well, he went for six an over. It's impossible for the coach to get wheeled out there and defend stuff.\n\n\"The head coach is responsible, he's the man who calls the shots, he makes the decisions. But the assistants, they can't come out and say Bazball is a load of nonsense.\n\n\"But the bus driver doesn't necessarily [have to toe the party line] so let's hear what he has to say.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/live-updates-jake-paul-vs-anthony-joshua/106165976",
        "title": "Live: Jake Paul takes on Anthony Joshua in Miami",
        "publish_date": "Sat, 20 Dec 2025 00:55:21 +0000",
        "category": "sports",
        "authors": [
            "Simon Smale"
        ],
        "text": "Boxing is far from immune from wildly unusual fights taking place between the most unlikely of opponents.\n\nFor example, Muhammed Ali's bout with Japanese wrestler Antonio Inoki in 1976.\n\nThe best thing about that \"fight\" was this surreal photo (Getty Images)\n\nInoki laid on the floor and essentially spent the entire fight kicking Ali's legs in that one - a real classic that was somehow scored a draw, presumably as a result of body having a single clue about what was going on.\n\nBut there have been more.\n\nThere was the farcical match-up between Trevor Berbick and Nobuhiko Takada in 1991.\n\nBerbick had been told Takada could not kick him below the belt so, when the Japanese fighter did so, the heavyweight just walked out.\n\nMore farce? OK then.\n\nGeorge Foreman once fought against five different men on the same night in 1975.\n\n(Getty Images)\n\nOscar De La Hoya and NBA legend Shaquille O'Neill fight with headguards on in 2009.\n\nAnd Floyd Mayweather made an absurd money-grabbing assault on sporting decency when he battered peroxide super lightweight kick boxer Tenshin Nasukawa — who was not allowed to kick — in 2018.\n\n\n\n(Getty Images)\n\nAll hideous examples of boxing's descent into farce.\n\nAt least, some would say, this is taking place under \"proper\" rules.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/adam-griffiths-new-perth-glory-footballs-most-interesting-man/106163416",
        "title": "'Lion', Kubrick fan, artist: Meet the A-League's most interesting coach",
        "publish_date": "Sat, 20 Dec 2025 00:08:51 +0000",
        "category": "sports",
        "authors": [],
        "text": "New Perth Glory coach Adam Griffiths doesn't want to talk about mountain goats any more.\n\nTwo weeks ago his post-match press conference went viral, when he delivered a one-minute monologue on those most sure-footed of mammals, before telling the media: \"I am a lion.\"\n\nThe meaning, he says, is in the ear of the beholder.\n\n\"It's something for the person to absorb and take for whatever they want,\" he tells the ABC of the aside ahead of this weekend's clash with Adelaide United.\n\nProposed interpretations and a suggestion he took inspiration from football legend Zlatan Ibrahimović, who has similarly referred to himself as a lion, are met with a swift \"no\".\n\nWhatever the meaning, Griffiths' bemusing analogy has stirred up interest in a team and league that have long struggled for viewers.\n\nAdam Griffiths led Perth Glory to three consecutive victories for the first time since 2021. (Supplied: Perth Glory)\n\nAfter David Zdrilic's dismissal in October — Glory's sixth coach in eight years — many fans were ready to throw in the towel.\n\nBut in less than two months under Griffiths, the team is finally showing a bit of spark, managing to string together three consecutive wins for the first time since 2021.\n\nGlory's Tarantino\n\nGiven his flair for the dramatic, it's perhaps unsurprising to learn Griffiths has dabbled in filmmaking throughout his life, directing several short films and commercials.\n\nSpeaking to the ABC, he suggests off-the-cuff that he's Perth Glory's Quentin Tarantino, though his favourite director is Stanley Kubrick.\n\nIt's the kind of cryptic deadpan comment he's become known for in recent months, building his reputation as one of the more interesting figures in the A-League landscape.\n\nAdam Griffiths has brought a new resolve to Perth Glory, who have spent years in the doldrums. (ABC News: Bridget McArthur)\n\nHe no longer uses social media — which he sees as a distraction — and is a relative enigma online, leaving fans (and reporters) to dig through interview archives for hints.\n\nIn an interview on Malaysian television from 2013, a less confident but similarly maverick Griffiths says if he could wish for anything it would be to be a vampire and live forever.\n\nFootball as art\n\nOther bits and pieces are briefly illuminated in conversation, including that Griffiths paints and, once upon a time, founded a machine learning company.\n\nBut he isn't interested in elaborating.\n\nSocceroos fans hunt for tickets despite 'extortionate' prices Australia are among the countries with the most ticket requests for next year's World Cup, which is bound to please Socceroos coach Tony Popovic and his team.\n\nPrevious exploits — about which he says, tantalisingly, he could write \"multiple books [and] probably a few films\" — are firmly in the rear view, with all hobbies and interests external to football apparently on pause.\n\n\"Football is all consuming,\" he says.\n\n\"I love it and I'm 100 per cent focused on that.\"\n\nAccording to Griffiths, sport can also be a form of artistic expression.\n\n\"Football has that element of creativity and you can take different pieces and turn it into something beautiful or ugly or fascinating,\" he says.\n\nA shift in strategy\n\nGrowing up in Sydney's outer suburbs, Griffiths first fell in love with football aged five when his dad — a first grade cricketer and footballer — took him and his twin Joel and younger brother Ryan to a game.\n\nAll three ended up playing soccer professionally though he says personality-wise they couldn't be more different, describing himself — not for the first time — as \"the ledge\" (aka legend) of the trio.\n\nNewly appointed Perth Glory head coach Adam Griffiths (right), posing with Glory CEO Anthony Radich. (AAP Image/Supplied: Perth Glory)\n\nWhen he finished up as a player, Griffiths turned to coaching.\n\n\"[I] fell in love again, but just in a different aspect, probably more so the tactical, the decision-making,\" he says.\n\nMatildas coach calls out Australian football's 'inferiority complex' Joe Montemurro echoes the words of former Matildas boss Alen Stajcic in offering a frank review of the culture surrounding the world game in Australia.\n\nZdrilic's dismissal in October afforded him his first chance to take the reins, promoted from assistant to interim coach after just two games with the club, and he was this week offered a contract until at least the end of the season.\n\nThe 46-year-old says he had a clear idea of how he wanted to lead from the get-go.\n\n\"My approach as soon as I came in was to give clear messaging, identify the leaders within the group, have the players buy into a playing style that they want to play for and want to love, which is what I love,\" he says.\n\nGriffiths defines this style as \"possession-based attacking football with a solid defensive structure\" — a shift in approach quickly apparent on field, with more possession, more opportunities going forward, and fewer goals conceded.\n\nGriffiths says understanding the strengths and motivations of every player is also key.\n\nAdam Griffiths with Perth Glory defender Charbel Shamoon. (Getty Images)\n\n\"Every human is different so [I] make sure I connect with the individual on their specific level and then try to find the best thing to get the best out of those players,\" he says.\n\nAccording to Glory defender Charbel Shamoon, who recently scored his first A-League goal under Griffiths, it's working.\n\n\"Ever since 'Griff' took over he gave us this real belief, changed the way we played and changed the ways we just thought mentally every single day and it helped us,\" he says.\n\nFowler claims French teammate gave her bananas instead of flowers Socceroos star Mary Fowler has shared her experiences of depression and self-harm, as well as racism from her teammates, that she endured during her time with Montpellier.\n\n\"Those three wins in a row wasn't just luck. He's really built a good belief in the team and we're all really excited to play under him.\"\n\nAnd while Griffiths may be sick of talking about it, Shamoon says the players couldn't get enough of his mountain goat interview.\n\n\"I've got no clue [what it means] but I like it,\" he says.\n\n\"I like something different, character.\"\n\nIt's hard to miss the movie-made narrative bubbling beneath the surface — Griffiths taking the Glory from consecutive wooden spooners to finals would be the ultimate underdog story.\n\n\"That is the only thing on my mind — to achieve success with this team at whatever cost. We will be pushing every single day to make sure that happens,\" he says.\n\n\" Whichever narrative you want to spin, it's going to be good viewing. \"\n\nThe Glory play Adelaide in Perth on Saturday.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/frenchman-bruno-vincent-and-his-golden-kalgoorlie-dream/106153794",
        "title": "How WA's city of gold became an irresistible lure for this French prospector",
        "publish_date": "Sat, 20 Dec 2025 00:02:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "For most travellers visiting Western Australia, the pristine white sand beaches of the south or the breathtaking gorges of the north top the bucket list.\n\nBut for Frenchman Bruno Vincent, the inland city of Kalgoorlie-Boulder, 600 kilometres east of Perth, was top priority.\n\nMr Vincent is a gold prospector from the French medieval city of Dole, 370 kilometres south-east of Paris.\n\nHe is travelling in Australia with his daughter Valentine Vincent on a once-in-a-lifetime trip.\n\nValentine Vincent says the city is important to her father. (ABC Goldfields: Macey Turner)\n\nMs Vincent said the visit to WA's gold city was extremely important to her father.\n\n\"For him [Kalgoorlie] is a really important town, he really wanted to come here,\" she said.\n\nA different kind of prospecting\n\nUsing his daughter as a translator, Mr Vincent explained he started prospecting when he was 20 after meeting a man in a river panning for gold.\n\n\"I asked him, 'What are you doing?', and he explained. Then we became friends,\" he said.\n\nThe hobby took over Mr Vincent's life for the next 40 years.\n\nA younger Mr Vincent (far left) prospects in a river in France. (Supplied: Bruno Vincent)\n\nHe went on to start a prospecting association and a school holiday camp for children to try their hand at it.\n\n\"[We] really wanted to share this passion,\" he said.\n\nUnlike Australia, French gold prospecting rarely uses a metal detector.\n\nInstead, Mr Vincent said prospectors study the lay of rivers and used pans to locate gold.\n\nMr Vincent prospects in the rivers surrounding his home city of Dole in eastern France. (Supplied: Bruno Vincent)\n\n\"Mostly we use the eyes and the knowledge, and mostly we are prospecting with the pan,\" he said.\n\nAlso unlike Australia, Mr Vincent said most of the gold found in the French rivers was like \"dust\",' and flowed down the mountains from Switzerland's Alps.\n\n\"In France, you cannot find a lot of nuggets; it's just more like powder,\" he said.\n\n\"The quantity of gold is massive here, compared to France. The gold in France is too small to be detected by the detector.\"\n\nIt is this scarcity that makes it so special to Mr Vincent.\n\n\" Because the gold in France is really rare, and also really hard to find, it's really precious for us. \"\n\nHopes for local connection\n\nMs Vincent said she had reached out to the Kalgoorlie community on Facebook, hoping a local could show her father the ins and outs of Australian prospecting.\n\nShe said her father had no interest in finding and keeping Aussie gold and just wanted to learn the techniques used here.\n\nBruno and Valentine Vincent visited the Museum of the Goldfields to learn more about the area's gold prospecting history. (ABC Goldfields: Macey Turner)\n\n\"We really wanted to share this moment with a local, but we didn't have the chance to do that.\"\n\nOperations coordinator at Kalgoorlie Tourism Sarah Shepherd said there had been a definite uptick in gold tourists like Mr Vincent in 2025.\n\n\"Since the gold price has gone up, there's definitely a lot more people,\" she said.\n\n\"We get a lot of Europeans wanting to do gold prospecting, and people from Asian countries as well.\"\n\nSarah Shepherd says many visitors at this time of year are Europeans escaping the cold weather. (ABC Goldfields: Macey Turner)\n\nMs Shepherd said it was important that people who wanted to try their hand at prospecting did not go alone.\n\n\"Go out with an experienced prospector and take more water than you think you will need, and also have an EPIRB [emergency beacon] with you.\"\n\nDespite the lack of prospecting, Mr Vincent said he had enjoyed his time in the Goldfields.\n\n\"The gold is a dream for every man, and particularly for me,\" he said.\n\nWhile Ms Vincent had not quite caught the prospecting bug from her father, she said it meant a lot that she got to spend time with him.\n\n\"He shared his hobby and his passion when we were kids. I have really great memories prospecting in the river with him,\" she said.\n\n\"So I'm really happy to share this moment here in this city with him, because I know it's his dream.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/nt-housing-market-growth-darwin-palmerston-house-prices-property/106163296",
        "title": "Investors target high rental yields in booming Darwin housing market",
        "publish_date": "Fri, 19 Dec 2025 23:51:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "When real estate agent Ursula Watson joined the profession four years ago, she never imagined the Darwin property market would be as fiercely competitive as it has been in 2025.\n\nWith a large contact book of property-hungry interstate buyers' agents, Ms Watson said many homes can now be sold before they ever get listed on the market.\n\n\"It's pretty competitive when it comes to owner-occupiers and first home buyers,\" Ms Watson said.\n\n\" It's a bit of a struggle for them at the moment because obviously they're being outbought by the investors. \"\n\nUrsula Watson says its a tough market for first home buyers, when they are competing with big investors. (ABC News: Michael Franchi)\n\nIn the first half of this year, interstate investors were increasingly turning to the NT to snap up some of the country's most affordable homes.\n\nDecember data from property research firm Cotality shows Darwin house prices grew by 17 per cent this year, a larger increase than any other capital city by far.\n\nHome values rose by 1.9 per cent in November, accelerating from October's 1.6 per cent increase.\n\nDespite the rapid growth, Darwin's median dwelling value remains the lowest of Australian capital cities at $578,871.\n\nMarket analysts attribute the growth to consistent rental yields, which are holding steady at 6.3 per cent in Darwin.\n\nIt's a figure analysts say will continue to drive strong demand from interstate investors, drawn in by attractive financials.\n\n\"We're seeing a lot of increase in investment activity as well as some good fundamentals like a decent increase in jobs growth over the past year,\" Cotality head of research Eliza Owen said.\n\n\"I think for an investor Darwin looks very good on paper,\" Ms Owen said.\n\nPalmerston house prices have surged by 24 per cent this year, the biggest annual increase in the country for areas of comparable size. (ABC News: Hamish Harty)\n\nMs Owen said the number of loans approved for the purchase of investment properties shows the true scale of the competition faced by Darwin locals hoping to buy a home.\n\n\"Over the past five years, we've seen an average of about 190 loans per quarter secured for investment property purchases in the NT. In the year to June that ballooned to 430 loans this quarter,\" she said.\n\nWhile Ms Owen expected the growth to continue in the short-term, she said there were some \"headwinds gathering\" that could temper further growth next year.\n\n\"What happens is that you might get more and more investors crowding into this market until it stops delivering the same capital growth or until it stops delivering the same rent yield, which compresses as values rise.\"\n\nEliza Owen says gathering headwinds could temper growth in the Darwin property market next year. (ABC News: John Gunn)\n\nShe said you only needed to look at historical data to see Darwin's property market was characterised by \"very strong, cyclical movements\".\n\nPredictions of an impending price correction are shared by Domain's senior economist, Joel Bowman, who said competition would remain tight until some buyers started to get priced out of the market in the latter half of next year.\n\n\"We're expecting strong price momentum to continue during the first half of next year before conditions will start to cool during the second half, as affordability constraints really start to bite,\" he said.\n\nJoel Bowman says first home buyers should broaden their horizons to include suburbs further afield. (Supplied)\n\nWhile Dr Bowman agreed strong interstate investor activity in Darwin had driven prices up, he said the phenomenon was not unique and had \"largely played out in a lot of other capital cities as well\".\n\nMs Watson, however, did offer some advice for first home buyers in Darwin \"feeling out-priced by what's been going on in the market\".\n\n\"My suggestion to them is to broaden their search to other suburbs as well.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/ambitious-plan-to-share-carnarvon-food-bowl-for-those-in-need/106122230",
        "title": "Foodbank looks to Carnarvon to help increase food security across state",
        "publish_date": "Fri, 19 Dec 2025 23:23:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Gascoyne town of Carnarvon is known as the food bowl of Western Australia for its fresh produce, and now non-profit organisation Foodbank is hoping it may be part of a solution to address food security.\n\nThe organisation is working directly with local growers to identify if excess produce which may go to waste could be transported 800 kilometres south to Perth for distribution across its 70 sites.\n\nFoodbank sourcing coordinator Angela Tarbottom recently visited the region and said there had been positive conversations with key local people.\n\n\"It seems like a partnership between Perth and Carnarvon, and that bit in between, is going to be really important for everyone, especially people in Carnarvon,\" Ms Tarbottom said.\n\nShe said she was keen to see what that could look like in the future.\n\nLocal growers Cindy Glynn and Garry Brown support the idea. (ABC Pilbara: Rachel Hagan)\n\nLocal mango growers Garry Brown and Cindy Glynn said up to 30 per cent of their mangoes do not reach market because of minor skin imperfections.\n\n\"Nothing wrong with the fruit, so a big portion of that would be able to be repurposed,\" Mr Brown said.\n\n\" It's good that can go to a good cause and to people who really need it. \"\n\nGrowers ready to give, but need more help\n\nLocal grower Phill Frzop was a part of the first trial of produce from Carnarvon to Perth. (ABC Pilbara: Rachel Hagan)\n\nThe first trial has taken place with a bin of eggplant from local Carnarvon grower Phill Frzop sent to Perth.\n\nHowever, he had concerns around future logistics.\n\n\"If it's coordinated then I can't see why we can't do it more regularly,\" Mr Frzop said.\n\n\"I think Foodbank themselves have got to get out there and get a coordinator, and we need transport who's going to ship it.\n\n\"Then the product that's harvested has got to be refrigerated because it's all a perishable product.\"\n\nEddie Smith says he is concerned about the logistics involved in transporting the produce to Perth. (ABC Pilbara: Rachel Hagan)\n\nLocal grower Eddie Smith used to donate his excess mangoes to Foodbank in Geraldton but said the partnership was cancelled when transport failed.\n\n\"I think the logistics of Foodbank setting up here could be problematic because of the tyranny of distance and labour costs,\" Mr Smith said.\n\n\"Everything has got to be voluntary so I'm not sure how that would work.\"\n\nMr Smith said he had already donated about 200 kilograms of mangoes to a local business which provided the containers and collected the donation.\n\nWhat about Carnarvon?\n\nFoodbank has no distribution sites in the north-west of the state but Kylie Coniglio volunteers at a number of local organisations for those in need in Carnarvon.\n\nShe said she witnessed families living below the poverty line who needed food every day.\n\nKylie Coniglio wants to see help for people in Carnarvon who are also struggling. (ABC Pilbara: Rachel Hagan)\n\nShe estimated many of those families would eat only one meal a day.\n\n\"We have little kids who go to school hungry. Sometimes [they] may not be fortunate enough to have a meal the night before,\" Ms Coniglio said.\n\n\"That's just sad.\"\n\nMs Coniglio she would like to see Foodbank, or another organisation, operating locally.\n\n\"If there is an option to keep it [excess produce donations] here in Carnarvon to give to our community, then why is no-one doing it?\" she said.\n\nStephanie Godrich says Carnarvon would benefit from a food action group to help coordinate food relief. (Supplied)\n\nEdith Cowan University nutrition lecturer Stephanie Godrich said food insecurity had far-reaching effects with children exhibiting poorer physical and mental health into adulthood.\n\n\"They might develop depression, anxiety or behavioural issues, especially children when they are at school. They have less opportunity to learn,\" Ms Godrich said.\n\nIn addition to poor mental health, she said food insecurity can be intergenerational and lead to higher chronic disease rates.\n\nDr Godrich said a local food action group bringing together government, community organisations and local businesses could be the answer, but required funding.\n\nFoodbank's 2025 Hunger Report states one in three Australian households has experienced food insecurity in the last year, with 20 per cent of people having skipped a meal or gone days without eating.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/tasmanian-government-pulse-advertising-spend-questioned/106165120",
        "title": "'Pretty smelly': Government faces questions over advertising spend",
        "publish_date": "Fri, 19 Dec 2025 23:12:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Tasmanian government spent more than $13,000 on media advertising spruiking its budget after a motion of-no confidence in Premier Jeremy Rockliff passed state parliament, new documents show.\n\nThe documents, released under right to information laws and obtained by the Tasmanian Times, show the Department of Premier and Cabinet purchased two separate \"full digital takeovers\" with media organisation Pulse Tasmania to advertise the budget after the no-confidence motion passed.\n\nThe first spend, of $8,954, is dated June 6, a day after a majority of parliamentarians supported the no-confidence motion, and after Mr Rockliff had asked Governor Barbara Baker to call an early election.\n\nIt was approved for payment by Department of Premier and Cabinet office manager Carol Jones, on June 10.\n\nA further spend of $4,477 with Pulse was made on June 11, the same day Governor Baker agreed to dissolve parliament and call the election.\n\nThe no-confidence motion meant the May budget never passed parliament, and it has since been scrubbed from the Department of Treasury website.\n\nThe deal consisted of an advertorial on Pulse's social media pages to promote the budget, plus a \"full digital takeover\" giving the government a \"100 per cent share of voice\" on Pulse's website. (ABC News: Ebony ten Broeke)\n\nLiberals retain power as no-confidence motion defeated — as it happened Tasmanian Labor fails to unseat Liberal premier Jeremy Rockliff with not a single crossbencher voting for their no-confidence motion.\n\nBoth Labor and the Greens have raised concerns about the taxpayer-funded advertising, which were both extensions of an almost $39,000 advertising spend with Pulse.\n\nThat spend, dated May 27, consisted of an advertorial on Pulse's Facebook and Instagram to promote the budget, plus a full digital takeover, giving the government a \"100 per cent share of voice\" on Pulse's website.\n\nAsked how he justified the spend given he had already asked for an election to be called, Mr Rockliff said it was the \"government's responsibility to inform the community after a budget\" about what was contained in it, including its measures to ease the cost of living.\n\n\"The governor made the decision to allow an election on June 11th, and that's when the advertising stopped,\" he said.\n\n\"The government went into caretaker on June 12th.\"\n\nBut Shadow Attorney-General Ella Haddad said Mr Rockliff had serious questions to answer about the two later advertising spends, particularly the June 11 payment, claiming the premier and his office knew Tasmanians were heading to an election when it was authorised.\n\n\"It is extraordinarily questionable for a government to be pouring tens of thousands of dollars of public money into political-style advertising when it knows an election is imminent,\" Ms Haddad said.\n\n\" Tasmanians rightly expect government advertising to be used to convey essential information, not crowd out debate from a digital space at the very moment an election campaign begins. \"\n\nElla Haddad describes the payments to Pulse as \"extraordinarily questionable\". (ABC News: Ebony ten Broeke)\n\nGreens MP Vica Bayley said the payments looked \"pretty smelly\".\n\n\"At face value, this is a misuse of taxpayer funds; it is utterly inappropriate to be taking out advertorials when it comes to promoting the government at a time where it was collapsing or where we were in an election campaign,\" he said.\n\n\"This was funding, it seemed, was pitched to promote the budget, irrespective of the fact the budget was clearly destined to fail, and then clearly parliament was prorogued and an election was held.\n\n\" This is taxpayer money. We all know the budget is tight — every single dollar counts. That [total Pulse spend of] $50,000 could have been used in myriad other ways. \"\n\nMr Bayley said it was \"clear the premier has questions to answer here\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/tyler-pask-firefighter-mens-mental-health-suicide-prevention-qld/106154520",
        "title": "A family lost their son to suicide. Now they're working to prevent the death of another young man",
        "publish_date": "Fri, 19 Dec 2025 23:11:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tyler Pask was a dedicated family man.\n\nThe father of three often spent his free time playing Minecraft or Pokémon with his children, and to his 10 nieces and nephews, he was the fun uncle.\n\nWARNING: This article contains references to mental health and suicide.\n\nHis four younger siblings — Brittany, Ash, Tyarna and Shaylah Pask — remember their older brother as \"the most selfless man\" who gave his time to help others.\n\n\"[He was] the most devoted dad … nothing was ever too much when it came to those kids,\" Shaylah, 22, said.\n\n\"He was everyone's best friend and he made everyone feel so special,\" added Tyarna, 26.\n\nTyler Pask (second from left) shared a close relationship with each of his younger siblings. (Supplied: Brittany Pask)\n\nThe Pask family has been cherishing memories with Tyler since he ended his life in October, aged 32.\n\nIn the two months since his death, his family — including parents Andrea and Stuart — have channelled their grief into raising awareness about men's mental health.\n\n\"If we can have these tough conversations about how we lost our brother to suicide — if it helps one man — then it's worth having,\" Tyarna said.\n\nBalancing family duties and work on the front lines\n\nTyler, originally from Melbourne, served as an auxiliary firefighter and communications officer for the Queensland Fire Department in Maryborough, Rockhampton and Gracemere.\n\nThe job first piqued his interest when, at 27 while working at a Wide Bay cafe, he met emergency service workers.\n\nWith an insatiable curiosity, he listened to their daily chatter.\n\nTyler Pask was inspired to become a firefighter while he was working as a barista at a cafe in the Wide Bay region. (Supplied: Brittany Pask)\n\n\"He was a barista and he would serve firefighters and he'd hear conversations about a job they had done,\" Tyarna said.\n\n\"And he goes, 'I'm doing that, that [being a firefighter] is for me.'\"\n\n\"[He] instantly was hooked. I think he really liked the feeling of being a first responder and helping people out,\" Brittany added.\n\nSharing his struggles\n\nAway from work, Tyler was a passionate advocate for men's mental health since losing his best friend to suicide nearly a decade ago.\n\nHe would grow a moustache through November to show support for the global men's mental health movement \"Movember\" and last year ran 60 kilometres in firefighting gear to raise awareness.\n\nTyler Pask and his parents at his graduation as a communications officer with the Queensland Fire Service in April. (Supplied: Brittany Pask)\n\nHe was also open with his family about his own mental health and his plans to seek out professional help.\n\n\"He [was] very open about the fact that he was struggling but he made it seem like he will be OK,\" Shaylah said.\n\n\"We just didn't know the extent of it.\"\n\nConcerning statistics\n\nAustralian Bureau of Statistics (ABS) data showed the regions from Central Queensland to the Sunshine Coast — including Wide Bay — had the state's second-highest rate of suicide in 2024, behind Northern Queensland.\n\nAnd according to the Queensland Mental Health Commission, the rate of suicides last year among men aged between 25 and 34 was the second-highest in the state.\n\nBrave Brothers is a Bundaberg-based grassroots charity working to reduce stigma around men's mental and other health issues.\n\nDavid Facer said isolation was a major risk for men living in rural areas. (Supplied: David Facer)\n\nDavid Facer, the organisation's managing director, says the Wide Bay is a complex region exacerbated by a range of socioeconomic issues.\n\n\"The area is a mixture of rural, industrial, agricultural, fisheries and industry so where we have that, it's a huge mixing pot of the opportunity for situational distress,\" he said.\n\nMr Facer said isolation was a risk factor for men, especially in rural areas, as they often struggled to \"release some emotional baggage or discuss those situational concerns.\"\n\n\"Historically when men have [shown genuine connections] in our community or reach out for support, they're seen as weak or lesser,\" he said.\n\n\"I think we need to flip the narrative and get better at listening to people, what they're saying to us, and how they're saying it.\"\n\n'Change the world'\n\nThat is also what the Pask family is pushing to change.\n\nHeartened by an overwhelming outpouring of support at Tyler's funeral — which included more than 1,000 people paying their respects and a full guard of honour send-off — his siblings and parents are a united force pushing for change.\n\nIn 2026, they'll be sharing Tyler's story at events including Movember and Out of the Shadows walks, fundraising for mental health causes and working alongside organisations that support first responders in regional areas.\n\nThe Pask siblings are working together to make sure Tyler continues to inspire and save people's lives. (Supplied: Brittany Pask)\n\nBrittany said change was desperately needed to ensure men like Tyler felt comfortable reaching out for support.\n\n\"We really want to push for some more help for men who are in this situation because they don't feel they can talk as openly or be taken as seriously as women,\" she said.\n\n\"He will change the world and we can be part of the reason that he continues to save people's lives.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/passenger-numbers-fall-short-on-parramatta-light-rail/106157050",
        "title": "Passenger numbers fall short on $2.9 billion Western Sydney light rail line",
        "publish_date": "Fri, 19 Dec 2025 23:03:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Commuters have been slow to make use of the $2.9 billion Parramatta Light Rail service, with daily patron numbers about half the state government's projections.\n\nOne year on from the first passengers using the service, data from Transport for NSW (TfNSW) revealed an average of 12,000 daily trips from January to November this year.\n\nThe state government initially predicted the service would have an average of 22,000 people using it a day by 2026.\n\nAbout 22,000 are expected to use the light rail service each day next year. (ABC News: Greg Bigelow)\n\nAfter numerous delays due to electrical faults identified during testing, the line from Carlingford to Westmead opened on December 20, 2024.\n\nConstruction of the light rail's stage two has begun and will connect Parramatta to Olympic Park, which is anticipated to grow patronage numbers long-term.\n\nBuilding for projected development\n\nMathew Hounsell, transport researcher at the University of Technology Sydney, said housing was needed \"to drive patronage\" on the Parramatta Light Rail.\n\nMathew Hounsell says housing will \"drive patronage\" on the light rail. (ABC News: Patrick Thomas)\n\n\"It takes time for any light rail to build patronage but [the Parramatta Light Rail] is lacking a cohesive plan around land use and events and places to go to drive patronage,\" he said.\n\nThe Rosehill Gardens stop is located about 2.5 kilometres from the Parramatta CBD and is on the outskirts of the Rosehill Racecourse.\n\nAccording to TfNSW data, it was the least-used light rail stop in 2025 out of the 16 stations, with an average of 130 trips a day from January to November.\n\nMr Hounsell said Rosehill was currently \"very easy to drive to\" but the area was expected to change over time.\n\n\"The existence of that tramway stop has made that property extremely valuable,\" he said.\n\n\"You have to build both [housing and transport] at the same time.\"\n\nCommuters celebrate opening day of Parramatta light rail Commuters were determined to ride Parramatta's new light rail as soon as it opened.\n\nRough patches\n\nIn addition to low patronage, the service has experienced a number of safety incidents, with TfNSW confirming there had been \"numerous\" collisions with road vehicles at different areas of the Parramatta light rail.\n\nTfNSW coordinator Howard Collins said the agency had a responsibility to keep the public safe.\n\n\"Our focus for year two is not only to keep the network reliable and well-used, but to ensure every journey is as safe as possible,\" he said.\n\n\"That means educating the community, enhancing visibility and reminding pedestrians, drivers and cyclists to stay alert around the tracks.\"\n\nAdjusting to new transport routes\n\nMr Hounsell said it took time for the public to adjust to new transport options.\n\n\"When people are comfortable driving to and from a place, they'll stick to driving until it gets painful enough that they start looking at alternatives.\"\n\nMr Hounsell says it takes time for the public to adjust to new transport options. (ABC News: Patrick Thomas)\n\nHe also said there was a lack of shops and businesses along the line to drive higher patronage on weekends, particularly at stops in highly residential areas.\n\n\"There's no destination at Carlingford, there's no pubs, there's no theatres,\" Mr Hounsell said.\n\nOn weekends, TfNSW data showed an average of 40 per cent fewer trips on the service.\n\nMr Hounsell said the higher weekday usage indicated the light rail was \"too dependent\" on regular commuters.\n\nFrequent travellers\n\nMoey says he prefers the light rail compared to the train because he lives close to a stop. (ABC News: Monish Nand)\n\nFrequent user Moey said he used the service in to Parramatta because he lived near one of the stops.\n\n\"At the start, it looked awkward because it was all over the place, and stopped cars from going [on some lanes], but it makes sense now … in hindsight, it's better,\" he said.\n\n\"It's more open compared to the trains and not many people use it, so it's alright.\"\n\nDona Lynvandyn says the light rail is useful for when she does not want to drive. (ABC News: Monish Nand)\n\nDona Lynvandyn said the light rail has been good for areas that previously had \"hardly any transport\".\n\n\"I've used it to go to places [when] I just want to feel relaxed, have convenience, and not drive,\" she said.\n\nPhillip Sharpe travels regularly from his home in Merrylands to Westmead, and changes from train to light rail at Parramatta. (ABC News: Monish Nand)\n\nPhillip Sharpe travelled often from Merrylands to Westmead, and got onto the light rail at Parramatta.\n\n\"It's the best thing that ever happened to Parramatta,\" he said.\n\n\"Fantastic, no waiting around, it's a good service.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/ashes-third-test-day-four-live-blog/106165808",
        "title": "Live: Cummins strikes in second over after England set record score to win",
        "publish_date": "Fri, 19 Dec 2025 22:49:35 +0000",
        "category": "sports",
        "authors": [
            "Jon Healy",
            "Henry Hanson"
        ],
        "text": "This is a fairly impressive mini resurgence from England here.\n\nThe lead sits at 420 right now.\n\nIf England can strike quickly with the new ball....who knows?\n\nJofra Archer returns and will have first use of the new ball.\n\nIt's down the leg side and Pat Cummins is working of his pads for a single.\n\nNoise! Flying down the leg-side, the ball definitely clips something on the way through the Jamie Smith. The on-field decision is not out.\n\nBen Stokes sends it upstairs...\n\nNot out. Snicko shows the ball clipped Starc's shirt and nothing else.\n\nStarc wears one on the body and Cummins calls him through for a smart leg-bye.\n\nFull and at the body once again, that's another leg-bye.\n\nStarc goes high! It's a bit of a golf swing from outside the off-stump. The ball flies a mile into the air but clears the infield and plugs in space in deep mid-wicket. The batters run a couple.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/winter-olympics-2026-the-scottish-isle-used-for-curling/106165748",
        "title": "How a desolate Scottish isle is providing a crucial Olympics resource",
        "publish_date": "Fri, 19 Dec 2025 22:41:51 +0000",
        "category": "sports",
        "authors": [],
        "text": "If you're looking to strike gold — silver or bronze, too — look to Ailsa Craig.\n\nThis uninhabited isle 16km off the coast of south-west Scotland is the source of the super-dense granite used to make curling stones for the Winter Olympics.\n\nJim English, co-owner of Kays Curling, took a few seconds to evaluate a boulder during a recent visit. He assessed it for big cracks and large specks on the surface.\n\n\"It's not just a case of landing a boat and then looking for granite. There's a particular type of granite we're looking for,\" he said in the shadow of a 19th century lighthouse that is no longer manned.\n\n\"We look for ones that have got really tight surface pattern.\"\n\nThe common green granite comprising the body of the stone is found on one end, and the blue hone granite that forms the running surface is on the other side of the \" craggy ocean pyramid \" as poet John Keats described the island more than a century before the first Winter Games.\n\nThe island of Ailsa Craig, where the two types of granite, Common Green and Blue Hone, that are used to make curling stones is quarried from. (AP Photo: Alastair Grant)\n\nKays, which has made all the curling stones for the Milan Cortina Winter Games, has a history with the Olympics dating back to the first winter edition — 1924 in Chamonix, France.\n\nThe curling competition at those games was long thought to have been an exhibition event but eventually was confirmed as official. The company has continued to make stones for the games since curling returned as a medal sport in Nagano 1998.\n\nFounded in 1851, Kays produces the stones from its shop in the town of Mauchline near Ayr.\n\nAn aerial view of the 11th hole The Ailsa Course at The Trump Turnberry Resort. Ailsa Craig can be seen on the horizon. (Getty Images: David Cannon)\n\n\"We can argue that it's probably won every gold, silver and bronze medal since the sport became a medal sport back in 1998,\" English said.\n\nAlso called Kays Scotland, the company holds the only license to harvest granite from Ailsa Craig, which is owned by Lord David Thomas Kennedy, 9th Marquess of Ailsa.\n\nGranite with elasticity\n\nAilsa Craig, at around 340m high and 3.2km in circumference, is believed to have been formed from volcanic activity millions of years ago.\n\nThe Scottish Geology Trust wrote that the island is composed \" almost entirely of microgranite,\" whose \"essentially unflawed nature\" make it ideal for curling stones.\n\nJim English, Kays Curling managing director, looks at a boulder of granite on the island of Ailsa Craig. (AP Photo: Alastair Grant)\n\nKey elements of the sport are cold and collisions — teams push stones on ice toward a scoring zone and use brooms to influence the path. So, granite that cracks easily is of no use.\n\n\"The granite itself has got elasticity properties in it,\" said Ricky English, operations manager at Kays and Jim's son.\n\nIn a collision, energy is both absorbed and released, \"so the stone doesn't split,\" he said.\n\nA large piece of unworked granite sits in the workshop at Kays Curling. (Getty Images: Jeff J Mitchell)\n\nThe blue hone granite is essentially waterproof, making it perfect for the running surface.\n\n\"You can't get this granite anywhere else in the world but Ailsa Craig,\" Ricky English said of the blue hone.\n\nThe curling stones for the 2006 Turin Olympics were the first complete Ailsa Craig stones. Previously, Kays had also used some common green from a quarry in Wales.\n\nHow does the process work?\n\nKays can go years between harvests. The common green \"falls off naturally, so we just pick from the site,\" Ricky English said. Those selections weigh between 5000 and 10,000kg.\n\nThe blue hone requires dislodging from the cliff face. Engineers drill and insert a gas charge to break the rock along its natural cracks. Those boulders are less than 2000kg, so higher quantities can mean fewer harvests.\n\nJohn Scott works on a piece of granite rock being made into a curling stone. (Getty Images: Jeff J. Mitchell)\n\nBoulders are lifted into containers and ferried back to Girvan Harbour. Galloway Granite slices the boulders and cuts round \"cheeses\" from them, and sends them back to Kays.\n\nThe common green granite forms most of the stone, including the \"striking band\" around the middle. A hole is drilled through the centre of the stone, which weighs on average 19 kg. The blue hone insert is glued in place, and the handle is attached.\n\nOn a \"double insert\" — blue hone is attached to both sides, and the handle can screw in to either side.\n\nThe granite is spun and shaped into what will become the final curling stone. (Getty Images: Jeff J Mitchell)\n\nA double insert costs $1500AUD — or $24,000 for a set of 16.\n\nSteps are taken on the island to protect a large colony of Gannets as well as some grey seals. Rat traps are set to be sure that boats from the mainland — the trip takes just over an hour — don't reintroduce the rodents to the island.\n\nCurling's popularity\n\nScottish Curling traces the sport's local roots back to 1540 in Paisley Abbey.\n\nCenturies later, curling is about to launch its first professional league, after the Milan Cortina Winter Olympics.\n\nCurling stones lined up and ready to be used during the 2022 Beijing Winter Paralympics. (Getty Images: Steph Chambers)\n\nThe Rock League will feature events in the United States, Canada and Europe.\n\nKays produces 1,800 to 2,000 stones per year. Canada is its biggest market, while China, Japan and South Korea are increasing their orders.\n\n\"The market in Asia seems to be growing quite a bit,\" Ricky English said.\n\nEnglish said the Beijing Winter Olympics had created greater demand for stones in Asian countries. (Getty Images: Li Ga)\n\n\"The 2022 Olympics (in Beijing) has maybe just gave it that wee push over there.\"\n\nKays has also sent stones to less-obvious curling spots like Qatar and Antarctica, where a travel company was using curling as part of a \"luxury experience.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/grace-lillian-lee-weaves-a-path-from-the-torres-strait-to-paris/106158378",
        "title": "Grace Lillian Lee weaves a path from the Torres Strait to Paris",
        "publish_date": "Fri, 19 Dec 2025 22:35:28 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Long rolls of dyed cotton seamlessly move from one hand to the other as Grace Lillian Lee delicately weaves fashionable, one-off pieces using a traditional Torres Strait Island grasshopper technique.\n\nThe weave, traditionally using coconut palm fronds, was taught to Lee by Torres Strait artist and mentor Uncle Ken Thaiday Senior almost 15 years ago.\n\nGrace Lillian Lee wearing one of her sought-after woven necklaces. (Supplied: Wendell Teodoro)\n\nHer woven, wearable art creations have catapulted Lee from the relaxed lifestyle of Cairns and the Torres Strait in Queensland's far north to Paris, France, a bustling textile mecca more than 15,000 kilometres away.\n\n\"I had been studying fashion design at RMIT but Uncle Ken was the cultural beacon of light that helped shape and influence my practice,\" she said.\n\n\" It took a while for me to develop my own technique using the weave because I wanted to celebrate who I am and where I come from. \"\n\nGrace Lillian Lee uses a traditional Torres Strait Island grasshopper weave. (Supplied: Grace Lillian Lee)\n\nThe Meriam Mir Samsep artist initially created sought-after woven necklaces after a trip to the Torres Strait Islands back in 2010 before progressing to large-scale wearable art and sculptural couture on a global scale.\n\n\"I think people are eager to explore who they are through what they wear and have fun with that,\" she said.\n\n\"It feels like we're in an era of change with people wanting a bit of an escape from reality.\"\n\nIntricately woven sculptural costumes by Grace Lillian Lee. (Supplied: Wendell Teodoro)\n\nFrom Queensland to France\n\nThe 37-year-old credits a chance encounter with French fashion designer Jean Paul Gaultier with launching her international career.\n\nIn 2024 Lee caught Gaultier's attention after a recommendation from Brisbane Festival artistic director Louise Bezzina.\n\nSo impressed with Lee's work, Gaultier hand-picked her to contribute to his Fashion Freak Show at the Brisbane Festival in 2024.\n\nFrench fashion designer Jean Paul Gaultier is a fan of Grace Lillian Lee's work. (Supplied: Wendell Teodoro)\n\nLee believes this helped secure a three-month residency at Cité Internationale des Arts in Paris this year, a prestigious artistic exchange and development program.\n\nShe also showcased some of her designs at Paris Couture Week in July this year, which Gaultier attended.\n\n\"It was definitely a pinch-me moment,\" she said.\n\n\"And a chance for me to tell my stories and celebrate my Torres Strait culture with the world through couture.\"\n\nGrace Lillian Lee surrounded by models wearing her couture in Paris. (Supplied: Wendell Teodoro)\n\n\"We created eight looks, four sculptures and a mask.\"\n\nLee was chosen this year as the inaugural artist to exhibit her work at the Cassandra Bird Gallery, a new gallery space on the ground floor of Zimmerman's Paris headquarters in the heart of the Le Marais.\n\nGrace Lillian Lee standing behind a model wearing one of her designs. (Supplied: Wendell Teodoro)\n\nA huge fan of Grace Lillian Lee's work is Kellie Hush, chief executive officer of Australian Fashion Week.\n\n\"It's people like Grace who are going to pave the way for other Indigenous designers,\" she said.\n\n\"She is a representation of what First Nations designers do better than anyone else — creating pieces that are so individual and unique that they become statement pieces.\"\n\nKellie Hush is excited to see First Nations fashion designers reach bigger audiences. (Supplied: Kellie Hush)\n\nHush said First Nations designers harnessed a unique and innovative creativity not seen around the world and was excited at the inclusion of more Indigenous designers at Australian Fashion Week.\n\nLeading the way for others\n\nThrilled to be one of those, Lee is back in the tropical far north preparing for another showcase at the annual fashion event in May 2026.\n\nShe is also finalising costume designs for the Australian Ballet and Bangarra Dance Company's upcoming production, Flora 2026.\n\nGrace Lillian Lee and Elverina Johnson are paving the way for other First Nations fashion designers. (Supplied: Elverina Johnson)\n\nIn spite of her busy schedule, Lee is eager to continue inspiring and creating opportunities for Indigenous creatives through First Nations Fashion and Design (FNFD) which she founded in 2017.\n\nElverina Johnson praised FNFD as \"one of the first incubator programs for Indigenous fashion in Cairns\" and for the doors it had opened.\n\nJohnson, a painter, fashion designer and musician, has collaborated with multiple fashion brands, producing three collections with national Australian fashion brand Taking Shape and designing original silk scarves for Aboriginal-owned ethical fashion brand Mainie Australia.\n\nShe has also showcased her work at Australian Fashion Week, the Brisbane Festival, Cairns Indigenous Art Fair (CIAF) and the University of Technology in Sydney.\n\nElverina Johnson with some of her designs. (Supplied: Taking Shape)\n\nIt is a long way from her small Indigenous community of Yarrabah, about 52 kilometres south-east of Cairns with a population of about 4,500 people.\n\nA respected Gungganji-Yidinji woman, Johnson sees fashion as another avenue for sharing her culture.\n\n\"My learnings have become part of my story and are translated onto canvas, and then into my fashion,\" she said.\n\n\"All my designs tell a story and help educate people about Indigenous people and their traditions.\"\n\nElverina Johnson's artwork is full of colour. (Supplied: Taking Shape)\n\nJohnson said her artwork was inspired by a childhood surrounded by rainforest, ocean, rich Australian landscapes of paperbark trees, bush foods, native plants, mangroves and fishing.\n\nAs an independent fashion designer, Johnson said keeping up with demand was her biggest challenge.\n\n\"There's either fast fashion or slow fashion, which are one-off pieces that tell a story,\" Johnson said.\n\n\"To produce fashion nationally or internationally you need people around you to help make it happen.\"\n\nElverina Johnson's designs are inspired by her stories and surroundings. (Supplied: Taking Shape)\n\nAustralian Fashion Week CEO Kellie Hush said there needed to be more support for First Nations designers and a cultural shift to view them as mainstream rather than niche designers.\n\n\"We should be referring to First Nations designers as Australian fashion designers, as they are Australian fashion brands,\" she said.\n\nAustralian Fashion Week is starting to attract more First Nations designers. (Supplied: Kellie Hush)\n\nJohnson agreed, adding while she is a proud First Nations fashion designer the label can be limiting.\n\n\"I wouldn't mind being recognised as an Australian fashion designer,\" Johnson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/west-australian-study-strep-a-findings-kimberley-broome-derby/106149204",
        "title": "One in six Kimberley children infected with strep A, study finds",
        "publish_date": "Fri, 19 Dec 2025 22:06:07 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A team of West Australian researchers has found one in six children living in the Kimberley region are carrying the potentially life-threatening infection strep A, with many cases left undiagnosed.\n\nThe Kids Research Institute Australia has released its findings from the Missing Piece Surveillance Study, which involved weekly Streptococcus pyogenes (strep A) testing of 250 school students from Broome and Derby, about 2,000 kilometres north of Perth.\n\nOver four years, participants had their throats and any skin infections swabbed and tested for the bacterium, with blood samples sometimes taken.\n\nProfessor Asha Bowen from the Kids Research Institute Australia said it was important to focus on links between sore throats and skin sores caused by strep A in remote communities with consistently high levels of the chronic disease.\n\nThe Kids Research Institute Australia has released three educational books for children about strep A. (ABC Kimberley: Esse Deves)\n\nLeft untreated, the often asymptomatic disease can lead to acute rheumatic fever (ARF) and rheumatic heart disease (RHD).\n\nWhile ARF can be treated, RHD can be fatal, with Aboriginal and Torres Strait Island children 55 times more likely to die from the disease than non-Indigenous children.\n\n'Certainly concerning'\n\nThe project saw the collection of 1,000 throat swabs, 200 skin swabs and 400 blood samples, which were analysed in a Perth laboratory.\n\nParticipating children — symptomatic or not — were tested for strep A every three months, with weekly swabs taken from students presenting to school with sore throats or skin sores.\n\nProfessor Bowen said the findings showed \"significantly more cases of strep A circulating than first thought\".\n\n\"The high rate of infection is certainly concerning,\" she said.\n\n\"[The results] tell us there's a lot more children at risk of rheumatic fever than are currently being counted through the standard clinic procedures because the symptoms aren't bad enough for them to think 'I need to go to clinic'.\"\n\nResults help find a path forward\n\nLead author Dr Janessa Pickering said the findings confirmed some children had recurring strep A infections, but no noticeable symptoms.\n\n\"This is important, as asymptomatic strep A infections have been shown to be a key contributor to strep A transmission and could be a vital missing link in the global conversation around RHD prevention,\" she said.\n\n\"We identified some kids carried the same type of strep A infection for years, while others never got it at all.\n\n\"[The results] provide us with a path forward for looking at the protective microbiome, or healthy bugs in the throat, that could be potentially guarding some kids against infection.\"\n\nJanessa Pickering (left) and Asha Bowen hope the study helps improve early detection measures in a bid to reduce ARF and RHD. (Supplied: The Kids Research Institute Australia)\n\nDerby Aboriginal Health Service chief executive Shelley Kneebone said while the results were concerning, having greater knowledge of how to tackle RHD was important.\n\n\"I hope the true burden of infection discovered will emphasise the need for greater focus on the social and environmental issues that affect our young children,\" she said.\n\nEarlier, faster testing trialled\n\nProfessor Bowen said despite the \"alarming numbers\" of strep A in Kimberley communities, a new study had already begun looking at ways to detect and treat it earlier and more quickly.\n\n\"We are looking at Point-of-Care tests so a result could be given for a sore throat swab within about 20 minutes of being collected, rather than waiting five to seven days,\" she said.\n\n\" If they have strep A present, they can receive treatment on the same day. \"\n\nProfessor Bowen said she hoped the findings would help \"inform guidelines and clinical care\" and lead to more investment in RHD prevention.\n\n\"It really does refine our ability to be able to provide care to the kids who need it the most, as quickly as possible,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/adams-distillery-fire-health-and-safety-case-dismissed/105728508",
        "title": "Man burned in gin fire loses worker's comp case",
        "publish_date": "Fri, 19 Dec 2025 21:47:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "The case against a northern Tasmanian distillery accused of failing a worker who was \"enveloped in flames\" has been dismissed.\n\nAdams Distillery pleaded not guilty to one count of failing to comply with a health and safety duty after Greg Longmore was seriously injured at the Perth distillery in February 2021.\n\nBut Magistrate Evan Hughes dismissed the case in the Launceston Magistrates Court on Friday afternoon, saying it had not been proven beyond reasonable doubt.\n\nEthanol added after burner was lit, court hears\n\nIn the reasons for his decision, Mr Hughes said Mr Longmore was a builder by trade, but after speaking with distillery co-director Adam Saunders, who he had known for a decade, started working in spirit production on January 18, 2021.\n\nThe accident occurred a short time later — on February 9.\n\nGreg Longmore received burns across his body when a gin still ignited. (ABC News: Jessica Moran)\n\nMr Hughes said instead of following the normal process of adding water to the still, then ethanol, and covering the still before igniting the burner, Mr Longmore was seen in CCTV footage attempting to add ethanol to the still when the burner was already lit.\n\n\"In the process of pouring the second quantity of ethanol into the gin still, it ignites and Mr Longmore is enveloped in flames,\" he said.\n\nThe Director of Public Prosecutions argued the distillery, directed by Mr Saunders and Adam Pinkard, failed to ensure Mr Longmore properly understood the instructions for gin-making, that he was adequately supervised until proficient and that he could manage the risks involved.\n\nMan injured while making gin woke up in 'the ICU', court told A Tasmanian gin and whisky distillery is in court over a fire that resulted in a worker receiving burns to 40 per cent of his body.\n\nMr Hughes said Mr Longmore gave evidence that he had no gin-making qualification and was trained over six weeks.\n\nHe said the court heard he was given an employee handbook and a health and safety handbook, but neither of those documents contained the correct procedure for making gin.\n\nHe also said Mr Longmore told the court he had no memory of receiving any training in gin production or using the gin still but accepted his memory of the event had been heavily impacted by his injuries.\n\nThe fire happened in February 2021. (ABC News: Damian McIntyre)\n\nA doctor found Mr Longmore suffered amnesia as well as \"anger, guilt and blame-focused cognitions\" about the incident, Magistrate Hughes noted.\n\n\"Mr Longmore has stated in his evidence that he has little recollection of gin production at the distillery at any time, including between 18 January and 9 February 2021,\" Mr Hughes said.\n\n\"This includes 8 February 2021, where he is clearly depicted on CCTV operating the gin still.\n\n\" He denied knowing that ethanol is a highly flammable substance despite the clear signage to that effect. \"\n\nMr Hughes said while he did not find Mr Longmore untruthful, he noted his reliability as a witness had been impacted by his injuries.\n\nCourt hears of 'staged' training process\n\nMr Hughes noted that distillery co-director Mr Saunders, who carried out Mr Longmore's training, described a \"staged process of training and supervision of Mr Longmore\" to the court.\n\nHe said Mr Saunders described making gin on February 1 and 2, 2021, while Mr Longmore observed.\n\nOn February 3, Mr Saunders said they made gin together.\n\nOn February 4 and 5, he said Mr Longmore made four productions of gin while he observed.\n\nMr Hughes said Mr Saunders undertook an interview with WorkSafe in 2022, where he \"repeatedly states the requirement that the gas burner to the still must be ignited last and that this was demonstrated and explained to Mr Longmore on more than one occasion\".\n\nA shed was damaged by the fire in 2021. (ABC News: Damian McIntyre)\n\nMr Hughes said while some of Mr Saunders's responses suggested doubt about the competence of Mr Longmore and his capacity to manage risk, he believed they should be considered \"in the context of hindsight\".\n\n\"The fact that an incident as significant as this occurred is likely to cause doubt in the mind of even the most confident and competent supervisor,\" he said.\n\nThe magistrate said he accepted Mr Saunders was a \"witness of truth\" and dismissed the case.\n\n\"I am satisfied on the evidence that Mr Saunders provided the instruction, training and assessment he described in his evidence,\" he wrote.\n\n\"The process of gin production is inherently dangerous in that it involves a highly flammable substance, but the relatively simple and logical steps required to undertake it safely were properly explained, demonstrated and then observed by Mr Saunders when supervising Mr Longmore.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/dreams-shattered-as-zone-rv-caravan-customers-fears-realised/106165022",
        "title": "Dreams shattered as 140 Zone RV caravan customers' worst fears realised",
        "publish_date": "Fri, 19 Dec 2025 21:31:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "About 140 families who purchased luxury caravans are in shock after administrators for the collapsed company Zone RV confirmed their worst fears.\n\nThe Sunshine Coast-based firm plunged into administration on December 1 owing $42 million to hundreds of creditors.\n\nAdministrator Cor Cordis has now told about 140 customers who partially paid for their luxury vans that they will not receive them, leaving future holiday plans in tatters.\n\nSome customers are more than $160,000 out of pocket, having paid about 80 per cent of the total cost in progress payments.\n\n\"We regret to advise the company is unable to fulfil its contractual obligations to you for the manufacture and delivery of the caravan,\" the letter from Cor Cordis said.\n\n\"As at the date of administration, the manufacture of your caravan had not yet commenced, and the company is without sufficient resources to continue manufacturing and deliver your caravan.\n\n\"We acknowledge this is distressing and disappointing news to be receiving and we thank you for your patience as we work through the position with respect to each customer's caravan order.\"\n\nThe letters included phone numbers for Lifeline and Beyond Blue.\n\nAgony and ecstasy for Zone RV customers People who fully paid before the company collapsed can receive their vans if they pay an extra fee.\n\nCor Cordis this week released about 20 vans to customers who had fully paid, provided they paid an additional 12 per cent fee.\n\nThe fee covered the cost of running the business on a skeleton staff and completing some remaining vans.\n\nAnother tranche of about 20 caravans, which had been fully paid for, will be completed and passed to their new owners by the end of January.\n\n'Sickening feeling'\n\nNew Zealand couple Cade and Alexis Thornton had paid $168,000 towards their dream caravan, with a final instalment due before collection in February.\n\nThe family sold their business, rented out their home, taken the kids out of school and bought flights and a four-wheel drive to complete a lap around Australia.\n\nThe Thornton family from New Zealand face an uncertain future. (Supplied)\n\n\"We were braced for bad news, but it was still a sickening feeling receiving the official email to say our van hadn't even been started and our contract wouldn't be honoured,\" Ms Thornton said.\n\n\"We are trying to keep our plans alive — we have to because we have tenants moving in to our house next month, so abandoning the trip isn't really an option.\n\n\"We've started looking for a second-hand caravan.\n\n\" Zone may have taken our $168,000, but we're determined not to let them take our dream holiday from us too. \"\n\nOnly hope for unlucky customers\n\nThe ABC understands there are several parties interested in rescuing Zone RV.\n\nCor Cordis revealed last week Zone RV owed $42 million to hundreds of creditors including customers, suppliers, employees, banks and the tax office.\n\nDelivering the 40 caravans to customers will shave off about $8 million from the creditors bill.\n\nThe only hope of a financial return for the 140 unlucky customers, whose prospects of getting their caravan have now evaporated, is if a buyer emerges to restructure the company.\n\nThey may recoup a fraction of their money if the company is liquidated.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/qld-mayors-councillors-pay-rise-local-government/106165038",
        "title": "Thousands of dollars in pay rises awarded to Queensland mayors and councillors",
        "publish_date": "Fri, 19 Dec 2025 21:09:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Queensland mayors and councillors outside of Brisbane have been awarded pay rises worth thousands of dollars that will kick off from next financial year.\n\nThe Local Government Remuneration Commission handed down its annual report last week, granting salary increases of between 3.25 per cent and 4.5 per cent.\n\nThe smaller 3.25 per cent pay rise will apply to mayors and councillors in 32 local government areas that include the state's biggest councils.\n\nThis includes the Gold Coast, Moreton Bay, Sunshine Coast, Logan, Ipswich, Townsville, Toowoomba, Redland, Mackay, Cairns, Fraser Coast and Bundaberg councils.\n\nUnder the changes, Gold Coast Mayor Tom Tate, who leads Queensland's second-biggest council, will be eligible for a salary of $295,542 — up from $286,239.\n\nThe salary for Gold Coast councillors will increase from $170,819 to $176,371.\n\nSunshine Coast mayor Rosanna Natoli will get a raise to $266,942 next financial year. (ABC News: Amy Sheehan)\n\nIn Moreton Bay, Mayor Peter Flannery has been awarded a salary of $266,942, which is an increase from $258,539.\n\nLogan Mayor Jon Raven and Sunshine Coast Mayor Rosanna Natoli have also been granted the same pay rise as Mr Flannery.\n\nCouncillors in Moreton Bay, Logan and the Sunshine Coast will be eligible for salaries of $162,072 — up from $156,970.\n\nIpswich Mayor Teresa Harding and Townsville Mayor Nick Dametto will also see their recommended salaries climb from $230,836 to $238,338.\n\nNewly elected Townsville mayor Nick Dametto's salary will climb from $230,836 to $238,338. (ABC News: Chloe Chomicki)\n\nCairns Mayor Amy Eden and Redlands Mayor Jos Mitchell will be entitled to salaries of $209,739, which is an increase from $203,137.\n\nThe bigger 4.5 per cent pay rises awarded by the commission apply to 44 councils that include the state's smallest local governments.\n\nThe mayors of 33 councils, including Winton, Quilpie, Bulloo, Wujal Wujal, Aurukun and Cloncurry, will see their recommended salaries increase from $122,975 to $128,509.\n\nMayors in another 11 council areas, including Goondiwindi, Balonne, Douglas, Longreach and Cook, will see their pay rise from $124,157 to $129,744.\n\nResponse to 'challenging' environment\n\nIn making its decision, the remuneration commission said it considered the \"importance\" of maintaining financially sustainable and fiscally responsible wage growth.\n\nIt also said it took into account the \"recently challenging and unstable inflationary environment\".\n\nAnother factor it considered was the disparity in pay for mayors and councillors in smaller rural, regional and remote areas compared to larger metropolitan locations.\n\nIt also noted anecdotal evidence of a desire to attract and retain high-quality candidates to local government roles, particularly in regional and remote areas.\n\nQueensland mayors get pay rise Queensland mayors and councillors have been awarded a 2.5 to 3 per cent pay bump in a move that will see their salaries increase by thousands of dollars.\n\nAnother point it indicated it considered was whether councils could afford the pay rises.\n\nThe commission is not responsible for assessing the pay of the Brisbane lord mayor or the city's councillors.\n\nLast year, the commission awarded pay increases of between 2.5 per cent and 3 per cent.\n\nBrisbane's most recent inflation rate was 5.2 per cent in the 12 months to October.\n\nThe base salary of a state MP in Queensland is $189,505, while ministers and the opposition leader are paid $390,278 and the premier is paid $476,323.\n\nIn a statement, a spokesperson for the Local Government Department said the pay increases proposed by the commission would be automatically applied.\n\n\"However, if a council chooses to set a lesser amount, it must pass a resolution to that effect before 1 July 2026,\" the spokesperson said.\n\n\"If this resolution is not passed, the maximum increase determined by the commission will automatically apply.\n\n\"While superannuation does not form part of the commission's recommendation, normal rules for the payment of super to employees will apply.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-20/queensland-family-prepares-for-second-hand-christmas/106155536",
        "title": "Cost-conscious Queensland family embraces the spirit of 'Thriftmas'",
        "publish_date": "Fri, 19 Dec 2025 21:08:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Christmas is a holiday marked by family traditions, but between the presents, parties, and grocery lists, it is also one marked by expense.\n\nTo help curb the cost of the holiday season, Queenslanders like the Gonzalez family have taken a new approach to Christmas shopping.\n\n\"This year, we've started a new tradition in my family which is 'Thriftmas',\" Brisbane mother Andrea Gonzalez said.\n\n\"About six months ago, it was really hitting us that it is a big year… it's been expensive.\"\n\nThat was when the family of five decided everything bought for Christmas this year would be second-hand.\n\nMs Gonzalez says all kinds of unexpected treasures can be found in second-hand stores. (ABC News: Mark Leonardi)\n\n\"It's not just about the gifts ... on Christmas Day everybody has to be dressed in thrifted clothes, too,\" Ms Gonzalez said.\n\n\"You'd be surprised by how many things are actually new or hardly have been used.\"\n\nMs Gonzalez said that while the quality of the gifts bought had not diminished, their total spending had.\n\n\" If I were to look at what I have spent, versus the retail value of the things I have purchased, it's thousands of dollars saved. \"\n\nAustralians are tipped to spend $12 billion dollars on gifts alone this Christmas, according to research from the Australian Retailers Association in partnership with Roy Morgan.\n\nGood for the hip-pocket and planet\n\nShannen Pipe says wanting to avoid waste is another factor driving an increase in second-hand sales. (ABC News: Mark Leonardi)\n\nShannen Pipe, who manages Vinnies in the Brisbane suburb of Paddington, said more shoppers were embracing the 'Thriftmas' trend each year.\n\n\"Cost-of-living pressure is at the forefront of why they're coming here,\" she said.\n\n\"But a lot of people are coming to us saying they want to be a little more mindful with their shopping, because particularly at Christmas time, waste is such a prevalent thing.\"\n\nA national impact report released by Charitable Reuse Australia found that almost 200,000 tonnes of waste was diverted from landfill in 2024 thanks to second-hand shopping.\n\nSecond-hand stores saved Australians an estimated $2 million last year. (ABC News: Mark Leonardi)\n\n\"There are big challenges around landfill space in our cities,\" said chair of the Australian Repair Network, Leanne Wiseman.\n\n\"We know Sydney is running out of landfill, we will run out of landfill here in Brisbane. Gold Coast is really at a crisis point as well.\"\n\nMs Wiseman, who is also a law professor at Griffith University, said Australians were becoming more aware of their waste and turning to second-hand stores – a move which is estimated to have saved shoppers around $2 million last year.\n\n\"I think it's not only the economics or the cost of buying new, but people are very environmentally aware, and I think our new generation is particularly conscious of the amount of consumption that we currently have,\" she said.\n\nThe joy of fossicking\n\nMs Gonzalez says her whole family has embraced the spirit of 'Thriftmas'. (ABC News: Mark Leonardi)\n\nWith two sons and one daughter-in-law living under her roof, Ms Gonzalez said thrifting was something he family bonded over.\n\nThrifted clothing booming at this year's Australian Fashion Week The popularity of thrifted and second-hand items has been on display at this year's Fashion Week. Experts say it's vital for the future of the industry.\n\n\"I have high school leavers, and a young adult family, and thrifting is really big for them, it's something they love to do,\" Ms Gonzalez said.\n\n\" [Thriftmas] is a new tradition that allows Christmas to evolve into something we can be proud of. \"\n\nMs Wiseman said the thrill of hunting down the perfect item in a second-hand store can make also buyers value the thrift find more than they would a new purchase.\n\n\"When you're shopping online, it's an easy purchase that just comes to your door and then you don't really feel as though you've got any belonging with those items,\" Ms Wiseman said.\n\n\"A lot of people are realising you don't have to go out and buy new, expensive presents, and that there's actually some joy fossicking through a second-hand shop.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/most-would-avoid-brisbane-s-lowest-rated-hotels-and-eateries-not-jon-20251209-p5nm73.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Most would avoid Brisbane’s lowest-rated hotels and eateries. Not Jon",
        "publish_date": "Sat, 20 Dec 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Neesha Sinnya"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size If a takeaway joint, hotel or gym is badly rated on Google, there’s a good chance Jon Wyeth has visited. The Brisbane-based content creator has made a living out of visiting the city’s worst-rated spots – think a KFC with 1.8 stars, or a hotel with 2.6 stars. It’s a unique approach, considering most content on social media fixates on the best of the best. Instagram and TikTok users love Wyeth’s candid reviews of Brisbane’s not-so-celebrated locations. Jon Wyeth has been posting on social media since 2021. This masthead caught up with him at one of Brisbane’s more pristine spaces – Anzac Square in the CBD. Wyeth finds that most of Brisbane’s worst-reviewed spots don’t quite live up to the hate, but there was one he felt warranted the backlash. “It was an eventful night, I couldn’t even put some of the stuff in the video. It was too hectic. You really couldn’t give it more than one star,” he said of a hotel in Kangaroo Point.\n\nAdvertisement\n\n“We stayed the night and committed to the bit – we didn’t get bed bugs, although a lot of people said we would.” Content on all sides of the River City Wyeth didn’t think reviewing poorly regarded places would become his job. “I started posting in 2021 – just stupid videos with my mates. I then started doing the voiceover and vlog-style stuff, and I started getting consistent with it,” he said. Along with the worst-reviewed, he’s also been ticking off the city’s “most dangerous” spots. Luckily for Wyeth – or unluckily for his metrics – he has yet to experience anything too out of the ordinary.\n\nAdvertisement\n\n“There are always a few interesting characters, but they’re sort of just doing their own thing.” Wyeth rejected criticism that he’s taking advantage of lower socio-economic areas with the series, saying he wasn’t going around “shoving my camera in homeless people’s faces”. “There’s a lot worse content out there,” he said. Social media content creator Jon Wyeth creates content showcasing all sides of Brisbane. The gym session that nearly revived Steven Miles’ political fortunes Wyeth has been building a catalogue of visits to 24-hour spots and the city’s best pubs. But he’s also forayed into the world of politics, making a video where he spotted then-premier Steven Miles in the gym. “It was in the lead-up to the election, so he was trying to get his face everywhere,” he said.\n\nAdvertisement\n\n“Someone from his media team just reached out and said, do you want to spot Steven Miles as he tries to bench 100kg?” Wyeth said Miles didn’t really need any help to reach his personal best, but he was still stoked to be part of the stunt – describing it as “the Steven Miles bench press that nearly got him through”. Miles lost the election, but the video had more than 680,000 views across various social media platforms and accounts. So far, Wyeth is yet to hear from David Crisafulli’s team. Mostly ‘good things to say’ Not all of Wyeth’s content paints Brisbane in the best light, but he says his goal is to use his platform to champion small businesses.\n\nAdvertisement\n\n“Ninety-five per cent of the time I only have good things to say,” Wyeth said. Following Cyclone Alfred, he decided to help badly damaged Wilston cafe and ceramic studio Our Space by sharing a video. Its co-owner, Jacquie Tapsall, said his post led to an influx of new customers. “[The video] really did help get our small business a lot of awareness in Brisbane,” they said. “Social media, along with word of mouth, is truly the thing that keeps our business busy and being recognised and supported.” What is Brisbane’s Social Scene?\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/the-ashes-2025-third-test-live-head-carey-build-lead-as-england-tries-to-save-series-20251220-p5np6o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Ashes 2025 third Test LIVE: Cummins snares Duckett as England need 435 to keep series alive",
        "publish_date": "Sat, 20 Dec 2025 12:51:35 +1100",
        "category": "sports",
        "authors": [
            "Roy Ward",
            "Tom Decent",
            "Dan Walsh",
            "Daniel Brettig"
        ],
        "text": "Our cricket scribes have had their say on whether this match will end today.\n\nI’ll put their views below, please add your vote to our poll.\n\nDaniel Brettig: Yes. There is enough in the pitch in the right areas for Australia’s attack and it is also a much nicer day for bowling. With the extra half an hour for a result, there will be about 75 overs on offer.\n\nDan Walsh: Yes. For the third Test in a row we’ll have a late session three finish, by unanimous agreement, the absolute worst result for a press box intent on sampling Adelaide’s evening hospitality. England will try and run down this target in 90 overs at most and fall 200-odd short. 435 is, of course, the famous target Ricky Ponting set South Africa in 2006. Australia’s 434 in the first innings was the largest ODI score at the time. It lasted 49.5 overs.\n\nTom Decent: No. I’ve got a sneaking suspicion this game will go into day five. Today is going to be England’s day. A few things will go their way on a decent pitch and the dream will be on. I still think Australia will hang on to win tomorrow, but the tourists are ready to give them a mighty scare. I’m all for a day four result though!",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/first-of-the-epstein-files-released-20251220-p5np7f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First of the Epstein files released",
        "publish_date": "Sat, 20 Dec 2025 12:30:31 +1100",
        "category": "finance",
        "authors": [],
        "text": "First of the Epstein files released\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/aussie-star-defends-world-titles-20251220-p5np7c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie star defends world titles",
        "publish_date": "Sat, 20 Dec 2025 12:17:54 +1100",
        "category": "sports",
        "authors": [],
        "text": "Aussie star defends world titles\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/head-departs-after-incredible-knock-20251220-p5np75.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Head departs after incredible knock",
        "publish_date": "Sat, 20 Dec 2025 11:32:40 +1100",
        "category": "finance",
        "authors": [],
        "text": "Head departs after incredible knock\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/kennedy-centre-adds-trump-s-name-to-building-one-day-after-board-vote-20251220-p5np6v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kennedy Centre adds Trump’s name to building one day after board vote",
        "publish_date": "Sat, 20 Dec 2025 10:35:58 +1100",
        "category": "entertainment",
        "authors": [
            "Se Young Lee"
        ],
        "text": "Washington: Workers have added Donald Trump’s name to the John F. Kennedy Memorial Centre for the Performing Arts on Friday, a day after members of the venue’s board voted for the change despite questions about their legal authority to do so.\n\nThe centre was established in law as a “living memorial” to Kennedy just two months after his assassination in 1963, with Congress passing legislation to rename the building, which was being planned as a national cultural centre when Kennedy was killed.\n\nSignage for the Donald J. Trump and the John F. Kennedy Memorial Centre for the Performing Arts is unveiled on the Kennedy Centre on Friday in Washington. Credit: AP\n\nOn Friday morning, Trump’s name was added to the exterior of the centre, above the existing lettering that honours Kennedy. Washington’s premier arts venue also now refers to itself as “The Trump Kennedy Centre” at the top of its homepage.\n\nThe change, which may face legal hurdles, marks the latest effort by the administration and its allies to remake the capital in Trump’s image, including the renaming of the US Institute of Peace after the president and the construction of a new White House ballroom that may cost hundreds of millions of dollars.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/more-than-30-rising-stars-have-been-poached-by-french-academies-this-is-how-australian-rugby-is-fighting-back-20251214-p5nnj4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "More than 30 rising stars have been poached by French academies. This is how Australian rugby is fighting back",
        "publish_date": "Sat, 20 Dec 2025 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "And though still housed in academies, several of the youngsters have already debuted in the prestigious Top 14 competition. Asi, Ma’alo and Leota – all tighthead props – have played several games in European rugby, and 23-year-old former Trinity College front-rower Malachi Hawkes is at star-studded Toulouse. Why are they there? The biggest factor, both push and pull, is a rule in French rugby where players earn “JIFF” status (Joueurs Issus des Filières de Formation) by spending three years in the academy system of a club. An overseas player with JIFF status is highly valued by the clubs, therefore, because they are not counted as a “foreign player” in multi-layered French pro rugby, where there are restrictions of how many overseas players can be at a club. JIFF status is for life, too, and not extinguished by departing or playing Test rugby elsewhere.\n\nSo with an increasing number of youngsters heading to France, RA are responding – some would argue belatedly – by formalising a system of ongoing connection to all the departed talent with the ultimate goal of bringing them home. It had been done before but in a more ad-hoc manner. Hence the sideline snaps in frigid Paris. French forward Emmanuel Meafou, who hails from Sydney. Credit: Getty “The key thing for us is that whilst we do quite a lot of the heavy lifting and the development of players through Super Rugby clubs and our pathway programs, they can exit early, and so we don’t see that fundamental development phase from 18 – even down to 16 – through to 23,” Rugby Australia high-performance boss Peter Horne explains. “So there’s a real need for us to reconnect. A lot of these kids are only eligible for Australia. It’s just that they happen to have exited out of Australia at a stage where we might have had them in the formative years, but so we need to stay connected.\n\n“I think a lot of the players do want to come home at some stage, or play for Australia, it’s just that they took a different journey. Loading “So it’s just really staying involved, not only just showing that they’re important, and that as Australians there’s an opportunity, but when they’re ready, to genuinely have discussions around them returning, and working with our Super clubs to look at availability and to connect with them.” While former “Espoirs” players like NSW lock Miles Amatosero returned from Clermont to pursue a Wallabies dream, others famously have not, due to the lure of superior salaries and/or the chance to play for France. Giant Sydney-raised lock Manny Meafou “felt let down” by a lack of opportunity in Australian rugby and elected to stay and declare eligibility for Les Bleus via five-years of residency. The 142kg lock is now a starter in the France national side.\n\nHawkes is in the danger zone for Australian rugby. The versatile hooker and prop, who played for the Sylvania Bulldogs, Trinity and Australian schools before moving to France in 2020, was pursued by RA earlier this year to come home but re-signed with Toulouse until 2027, and became eligible for Les Bleus this year. The 23-year-old was unable to attend Wallabies training in Paris due to club training, so Horne flew to Toulouse for a day instead. Horne also watched Leota, who is a giant tighthead prop at Racing 92 and has drawn comparisons with his now club teammate in Paris, Taniela Tupou. Former Sylvania Bulldog Malachi Hawkes playing for Toulouse in the Top 14. Credit: Alamy Stock Photo Four locks are 196cm or taller, including two – Ted Condon and Aiden Stait – who are both 203cm and 130kg-plus. “The reality is many of them have a certain somatotype [body shape] that the French love, in which big is great, and even bigger is better,” Horne said.\n\n“We have a number of our players that we try to retain, but it’s hard to retain everyone in a certain group. And they do go early. So the idea is to keep them tagged. They’re really getting put into pro rugby pretty early, so they’re actually becoming quite exposed to the high end of the game. “We obviously do need the Will Skeltons of the world, and everyone’s journey is slightly different, and we want to make sure that if you’re Australian, you’re interested and you want to play in Super Rugby, you want to go home or you’ve got an aspiration to play in a gold jersey, then we stay in contact.” While the departure of young, talented ‘bigs’ sparks an instinctive concern, some argue the situation is not to be feared and can provide a massive benefit for Australian rugby if handled well. At no cost to RA and Super clubs, young tight forwards (who would otherwise be part-timers in Super academies and playing club colts or grade in Australia) can spend three years being developed in French rugby, where scrummaging and forward play are key tenets of faith. Tighthead props are so valued in France, they’re often among the highest-paid players at a club.\n\nBut 130kg front rowers don’t grow on trees in Australia, and prop depth at elite level is already shallow. So the obvious key is RA not losing them for good, and thus the increased time and investment being put into the connection strategy. Game vision of all players is also collated and analysed. The other upside of a rising superstar like Lemoto being in France is it meant he stayed in rugby, and did not take up one of several contract offers in the NRL. ‘We obviously do need the Will Skeltons of the world.’ RA high performance boss Peter Horne The 18-year-old had not yet travelled to France by the time the Wallabies were in town but RA are keen to keep the Australian under-18 star under the wing. Some bullishly argue Lemoto is good enough for incoming Test coach Les Kiss to pick the explosive 109kg back-rower next year, which would capture him as a Wallaby and fend off rivals. Horne said they are considering picking the outstanding No.8 from Toulouse for the Junior Wallabies (which is not a capture team) in the World Rugby Under-20 Championships in Georgia next year. But that’s a thorny issue, given it could further encourage others to take the French option too.\n\n“You’d take that into consideration and whether we want to do that or not, but there are some players that are generational talent,” Horne said. Along with Schmidt and former Fiji coach Simon Raiwalui, Junior Wallabies coach Chris Whitaker is part of a group of French-speaking Australian rugby figures who have played and coached in French rugby, and will look to serve as mentors to the rookies – and pros as well. “It’s super important,” Whitaker says. “Heinz is obviously an extremely high-quality player, and there are lots of other talented young boys over there. “It’s tough for an 18/19-year-old guy to move to another country, and they probably don’t speak the language and it may be all a bit overwhelming. We are there to help them with whatever they may need around their clubs or whatever, just be someone they can turn to.”\n\nWhitaker would naturally love to have a player like Lemoto, and probably a few big other big boppers, too. But he is also wary. “You have to be careful about that, I guess,” he said. “There are some talented players but at the same time you don’t want to disadvantage or dissuade in any way the kids who are staying and doing their development at home in the Australian system.” RA produce weekly reports and analysis of the 30 Espoirs players, and indeed, all Australian players overseas. Schmidt, Horne and even a holidaying Kiss also met with Australian players currently playing in the UK, like Josh Kemeny and James Ramm, to keep connected and discuss the prospect of returning home. There are also plans for further meetings with senior and academy players in France, Wales and England next year. And so too the meetings that probably matter most – the ones with star Wallabies.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/in-2025-maya-was-an-australian-open-wildcard-in-2026-she-s-the-nation-s-best-hope-20251216-p5no0p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "In 2025, Maya was an Australian Open wildcard. In 2026, she’s the nation’s best women’s hope",
        "publish_date": "Sat, 20 Dec 2025 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "Teenager Maya Joint made her Australian Open debut last summer in what proved to be an impossible task.\n\nThe Australian appeared calm on Melbourne Park’s John Cain Arena against then world No. 6 Jessica Pegula – a player who reached the final of the US Open four months earlier.\n\nMaya Joint in her round one match at the 2025 Australian Open. Credit: Getty Images\n\nJoint was tenacious, aggressive and appeared to be enjoying herself on debut at her home slam in front of a few hundred fans. She lost in straight sets, 6-3, 6-0, to an experienced player who had been on tour for almost a decade.\n\nBut in the 12 months since Joint was granted a 2025 Australian Open wildcard, the 19-year-old has surged to No.32 in the world. She’s now Australia’s top-ranked female player and in line to appear at the 2026 Australian Open as a seeded player.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/final-victim-of-bondi-beach-terror-attack-identified-20251220-p5np67.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Final victim of Bondi Beach terror attack identified",
        "publish_date": "Sat, 20 Dec 2025 07:38:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "Final victim of Bondi Beach terror attack identified\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/over-100-homes-without-power-in-sydney-following-wild-weather-20251220-p5np6c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Over 100 homes without power in Sydney following wild weather",
        "publish_date": "Sat, 20 Dec 2025 07:38:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "Over 100 homes without power in Sydney following wild weather\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/heat-pull-off-historic-run-chase-20251220-p5np6a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Heat pull off historic run chase",
        "publish_date": "Sat, 20 Dec 2025 07:38:12 +1100",
        "category": "sports",
        "authors": [],
        "text": "Heat pull off historic run chase\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-acccs-new-warning-about-the-dangers-of-ai-for-consumers/nq4e3cfew",
        "title": "INTERVIEW: ACCC’s new warning about the dangers of AI for consumers",
        "publish_date": "Fri, 19 Dec 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/ben-hasnt-seen-his-loved-ones-for-13-years-this-australian-bakery-offered-him-a-job-and-a-new-family/xfom43s0z",
        "title": "Ben hasn't seen his loved ones for 13 years. This Australian bakery offered him a job and a new ‘family’",
        "publish_date": "Fri, 19 Dec 2025 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Christmas cheer is rolling out at a wholesale bakery in Sydney. And trainee Ben – a recent arrival in Australia - is busy learning on-the-job.\n\n\n\n\n\n“Thank you God for my life because today I'm still alive and I am here and I'm working and is happy thing.”\n\n\n\n\n\nIt’s a fresh start for Ben, who fled Afghanistan 13 years ago and later struggled to survive as a refugee in Asia.\n\n\n\n\n\n“I lived in Indonesia, Jakarta. And that time I don't have any work because refugee there can’t work.”\n\n\n\n\n\nBen is now learning to make fruit mince pies for Christmas, with Samia Salhab a refugee from Syria.\n\n\n\n\n\n“She's my leader so she teach me everything. Yeah. Because I am just working more than two months so I need to more practice.”\n\n\n\n\n\nDespite coming from different cultural backgrounds, Ms Salhab says they communicate well.\n\n\n\n\n\n“We don't speak same language, he's from different nationality, but we speak English. Ben, he's very good person. He try to learn, he want to work.”\n\n\n\n\n\nBoth are grateful for steady jobs at the Bread and Butter Project, a social enterprise bakery in the inner-west suburb of Marrickville. Ms Salhab says the bakery is more than just a workplace.\n\n\n\n\n\n“Yeah, the bread and butter project, they are my second family. We receive good money, we can pay our rent, we can - I bought a car already and I can save some money sent to my family in Syria and it's very good. It's perfect for me!”\n\n\n\n\n\nThe bakery has grown steadily since co-founder Paul Allam started up in 2013. He says it now employs 40 staff producing 1.5 million products each year.\n\n\n\n\n\n“The turnover is around $5 million. I think it's actually a little bit above that at the moment. So we put through thousands and thousands of loaves every week”\n\n\n\n\n\nWith a background in baking, Mr Allam was inspired to start the business after helping to set up a similar project with Karen refugee women in an orphanage on the Thai-Myanmar border.\n\n\n\n\n\n“And I worked with probably 20 to 25 Karen women and we built this little bakery within the orphanage. And the last day we had all this product ready to go out and then the cafe owners came and the restaurant owners came and we signed up, I think it was eight accounts that day. It's very rare that bakers do, sort of, work abroad. We're not doctors, we're not engineers. So this was an opportunity for me to give a little bit back.”\n\n\n\n\n\nHis Sydney bakery is now among 12,000 social enterprises in Australia – and focussed on training new arrivals. Tara Anderson is CEO of leading non-profit industry body, Social Traders.\n\n\n\n\n\n“Every year in Australia, social enterprises like the Bread and Butter project create 16 million hours of employment for people like Ben in their workforce. And across a year that's a total of 85,000 jobs that are created for people that would otherwise struggle to find them.”\n\n\n\n\n\nSo far, the bakery has put 120 new arrivals through its rigorous training scheme. CEO Eva Rabanel explains:\n\n\n\n\n\n“There are many barriers for newly arrived refugees and we are bringing in people from all walks of life. Our program runs for three to six months. Our participants will receive training, hands-on training on how to make bread and pastry products and they'll also receive all sorts of wraparound support while they're here, such as one-on-one English tutoring. Our objective is at the end of the program to ensure they've got an ongoing permanent job offer.”\n\n\n\n\n\nBen dreams of one day opening his own business and says – for now - baking bread is his way to give back.\n\n\n\n\n\n“I make bread with love and people I hope they enjoy when they eat the bread.”\n\n\n\n\n\nBut this holiday season, he feels far from loved ones in Afghanistan’s capital Kabul.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/allegra-spender-confronted-by-angry-locals-at-bondi-beach/v28d0evc2",
        "title": "Allegra Spender confronted by angry locals at Bondi beach",
        "publish_date": "Fri, 19 Dec 2025 09:09:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "Allegra Spender confronted by angry locals at Bondi beach\n\nPublished 19 December 2025, 8:52 am\n\nAllegra Spender is the federal member for Wentworth that includes Bondi. Ahead of her interview with SBS, she was confronted by some angry local residents accusing her of inaction on antisemitism.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/largest-gun-buyback-since-port-arthur-begins/7cgetmklb",
        "title": "Largest gun buyback since Port Arthur begins",
        "publish_date": "Fri, 19 Dec 2025 08:58:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Largest gun buyback since Port Arthur begins\n\nPublished 19 December 2025, 6:27 am\n\nThe Federal Government has launched the largest buyback of guns in almost three decades, following the Bondi Beach terror attack. The sweeping action comes as New South Wales moves first to impose strict limits on gun owners.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-wentworth-mp-allegra-mp-says-the-jewish-community-has-been-failed-by-government/wnrc74uqt",
        "title": "INTERVIEW: Wentworth MP Allegra MP says the Jewish community has been failed by Government",
        "publish_date": "Fri, 19 Dec 2025 07:40:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/global-interest-rate-moves-influences-markets/hke5lf92x",
        "title": "Global interest rate moves influences markets",
        "publish_date": "Fri, 19 Dec 2025 06:10:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/most-would-avoid-brisbane-s-lowest-rated-hotels-and-eateries-not-jon-20251209-p5nm73.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Most would avoid Brisbane’s lowest-rated hotels and eateries. Not Jon",
        "publish_date": "Sat, 20 Dec 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Neesha Sinnya"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size If a takeaway joint, hotel or gym is badly rated on Google, there’s a good chance Jon Wyeth has visited. The Brisbane-based content creator has made a living out of visiting the city’s worst-rated spots – think a KFC with 1.8 stars, or a hotel with 2.6 stars. It’s a unique approach, considering most content on social media fixates on the best of the best. Instagram and TikTok users love Wyeth’s candid reviews of Brisbane’s not-so-celebrated locations. Jon Wyeth has been posting on social media since 2021. This masthead caught up with him at one of Brisbane’s more pristine spaces – Anzac Square in the CBD. Wyeth finds that most of Brisbane’s worst-reviewed spots don’t quite live up to the hate, but there was one he felt warranted the backlash. “It was an eventful night, I couldn’t even put some of the stuff in the video. It was too hectic. You really couldn’t give it more than one star,” he said of a hotel in Kangaroo Point.\n\nAdvertisement\n\n“We stayed the night and committed to the bit – we didn’t get bed bugs, although a lot of people said we would.” Content on all sides of the River City Wyeth didn’t think reviewing poorly regarded places would become his job. “I started posting in 2021 – just stupid videos with my mates. I then started doing the voiceover and vlog-style stuff, and I started getting consistent with it,” he said. Along with the worst-reviewed, he’s also been ticking off the city’s “most dangerous” spots. Luckily for Wyeth – or unluckily for his metrics – he has yet to experience anything too out of the ordinary.\n\nAdvertisement\n\n“There are always a few interesting characters, but they’re sort of just doing their own thing.” Wyeth rejected criticism that he’s taking advantage of lower socio-economic areas with the series, saying he wasn’t going around “shoving my camera in homeless people’s faces”. “There’s a lot worse content out there,” he said. Social media content creator Jon Wyeth creates content showcasing all sides of Brisbane. The gym session that nearly revived Steven Miles’ political fortunes Wyeth has been building a catalogue of visits to 24-hour spots and the city’s best pubs. But he’s also forayed into the world of politics, making a video where he spotted then-premier Steven Miles in the gym. “It was in the lead-up to the election, so he was trying to get his face everywhere,” he said.\n\nAdvertisement\n\n“Someone from his media team just reached out and said, do you want to spot Steven Miles as he tries to bench 100kg?” Wyeth said Miles didn’t really need any help to reach his personal best, but he was still stoked to be part of the stunt – describing it as “the Steven Miles bench press that nearly got him through”. Miles lost the election, but the video had more than 680,000 views across various social media platforms and accounts. So far, Wyeth is yet to hear from David Crisafulli’s team. Mostly ‘good things to say’ Not all of Wyeth’s content paints Brisbane in the best light, but he says his goal is to use his platform to champion small businesses.\n\nAdvertisement\n\n“Ninety-five per cent of the time I only have good things to say,” Wyeth said. Following Cyclone Alfred, he decided to help badly damaged Wilston cafe and ceramic studio Our Space by sharing a video. Its co-owner, Jacquie Tapsall, said his post led to an influx of new customers. “[The video] really did help get our small business a lot of awareness in Brisbane,” they said. “Social media, along with word of mouth, is truly the thing that keeps our business busy and being recognised and supported.” What is Brisbane’s Social Scene?\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/the-ashes-2025-third-test-live-head-carey-build-lead-as-england-tries-to-save-series-20251220-p5np6o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Ashes 2025 third Test LIVE: Cummins snares Duckett as England need 435 to keep series alive",
        "publish_date": "Sat, 20 Dec 2025 12:51:35 +1100",
        "category": "sports",
        "authors": [
            "Roy Ward",
            "Tom Decent",
            "Dan Walsh",
            "Daniel Brettig"
        ],
        "text": "Our cricket scribes have had their say on whether this match will end today.\n\nI’ll put their views below, please add your vote to our poll.\n\nDaniel Brettig: Yes. There is enough in the pitch in the right areas for Australia’s attack and it is also a much nicer day for bowling. With the extra half an hour for a result, there will be about 75 overs on offer.\n\nDan Walsh: Yes. For the third Test in a row we’ll have a late session three finish, by unanimous agreement, the absolute worst result for a press box intent on sampling Adelaide’s evening hospitality. England will try and run down this target in 90 overs at most and fall 200-odd short. 435 is, of course, the famous target Ricky Ponting set South Africa in 2006. Australia’s 434 in the first innings was the largest ODI score at the time. It lasted 49.5 overs.\n\nTom Decent: No. I’ve got a sneaking suspicion this game will go into day five. Today is going to be England’s day. A few things will go their way on a decent pitch and the dream will be on. I still think Australia will hang on to win tomorrow, but the tourists are ready to give them a mighty scare. I’m all for a day four result though!",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/first-of-the-epstein-files-released-20251220-p5np7f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First of the Epstein files released",
        "publish_date": "Sat, 20 Dec 2025 12:30:31 +1100",
        "category": "finance",
        "authors": [],
        "text": "First of the Epstein files released\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/aussie-star-defends-world-titles-20251220-p5np7c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie star defends world titles",
        "publish_date": "Sat, 20 Dec 2025 12:17:54 +1100",
        "category": "sports",
        "authors": [],
        "text": "Aussie star defends world titles\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/head-departs-after-incredible-knock-20251220-p5np75.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Head departs after incredible knock",
        "publish_date": "Sat, 20 Dec 2025 11:32:40 +1100",
        "category": "finance",
        "authors": [],
        "text": "Head departs after incredible knock\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/kennedy-centre-adds-trump-s-name-to-building-one-day-after-board-vote-20251220-p5np6v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kennedy Centre adds Trump’s name to building one day after board vote",
        "publish_date": "Sat, 20 Dec 2025 10:35:58 +1100",
        "category": "entertainment",
        "authors": [
            "Se Young Lee"
        ],
        "text": "Washington: Workers have added Donald Trump’s name to the John F. Kennedy Memorial Centre for the Performing Arts on Friday, a day after members of the venue’s board voted for the change despite questions about their legal authority to do so.\n\nThe centre was established in law as a “living memorial” to Kennedy just two months after his assassination in 1963, with Congress passing legislation to rename the building, which was being planned as a national cultural centre when Kennedy was killed.\n\nSignage for the Donald J. Trump and the John F. Kennedy Memorial Centre for the Performing Arts is unveiled on the Kennedy Centre on Friday in Washington. Credit: AP\n\nOn Friday morning, Trump’s name was added to the exterior of the centre, above the existing lettering that honours Kennedy. Washington’s premier arts venue also now refers to itself as “The Trump Kennedy Centre” at the top of its homepage.\n\nThe change, which may face legal hurdles, marks the latest effort by the administration and its allies to remake the capital in Trump’s image, including the renaming of the US Institute of Peace after the president and the construction of a new White House ballroom that may cost hundreds of millions of dollars.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/more-than-30-rising-stars-have-been-poached-by-french-academies-this-is-how-australian-rugby-is-fighting-back-20251214-p5nnj4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "More than 30 rising stars have been poached by French academies. This is how Australian rugby is fighting back",
        "publish_date": "Sat, 20 Dec 2025 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "And though still housed in academies, several of the youngsters have already debuted in the prestigious Top 14 competition. Asi, Ma’alo and Leota – all tighthead props – have played several games in European rugby, and 23-year-old former Trinity College front-rower Malachi Hawkes is at star-studded Toulouse. Why are they there? The biggest factor, both push and pull, is a rule in French rugby where players earn “JIFF” status (Joueurs Issus des Filières de Formation) by spending three years in the academy system of a club. An overseas player with JIFF status is highly valued by the clubs, therefore, because they are not counted as a “foreign player” in multi-layered French pro rugby, where there are restrictions of how many overseas players can be at a club. JIFF status is for life, too, and not extinguished by departing or playing Test rugby elsewhere.\n\nSo with an increasing number of youngsters heading to France, RA are responding – some would argue belatedly – by formalising a system of ongoing connection to all the departed talent with the ultimate goal of bringing them home. It had been done before but in a more ad-hoc manner. Hence the sideline snaps in frigid Paris. French forward Emmanuel Meafou, who hails from Sydney. Credit: Getty “The key thing for us is that whilst we do quite a lot of the heavy lifting and the development of players through Super Rugby clubs and our pathway programs, they can exit early, and so we don’t see that fundamental development phase from 18 – even down to 16 – through to 23,” Rugby Australia high-performance boss Peter Horne explains. “So there’s a real need for us to reconnect. A lot of these kids are only eligible for Australia. It’s just that they happen to have exited out of Australia at a stage where we might have had them in the formative years, but so we need to stay connected.\n\n“I think a lot of the players do want to come home at some stage, or play for Australia, it’s just that they took a different journey. Loading “So it’s just really staying involved, not only just showing that they’re important, and that as Australians there’s an opportunity, but when they’re ready, to genuinely have discussions around them returning, and working with our Super clubs to look at availability and to connect with them.” While former “Espoirs” players like NSW lock Miles Amatosero returned from Clermont to pursue a Wallabies dream, others famously have not, due to the lure of superior salaries and/or the chance to play for France. Giant Sydney-raised lock Manny Meafou “felt let down” by a lack of opportunity in Australian rugby and elected to stay and declare eligibility for Les Bleus via five-years of residency. The 142kg lock is now a starter in the France national side.\n\nHawkes is in the danger zone for Australian rugby. The versatile hooker and prop, who played for the Sylvania Bulldogs, Trinity and Australian schools before moving to France in 2020, was pursued by RA earlier this year to come home but re-signed with Toulouse until 2027, and became eligible for Les Bleus this year. The 23-year-old was unable to attend Wallabies training in Paris due to club training, so Horne flew to Toulouse for a day instead. Horne also watched Leota, who is a giant tighthead prop at Racing 92 and has drawn comparisons with his now club teammate in Paris, Taniela Tupou. Former Sylvania Bulldog Malachi Hawkes playing for Toulouse in the Top 14. Credit: Alamy Stock Photo Four locks are 196cm or taller, including two – Ted Condon and Aiden Stait – who are both 203cm and 130kg-plus. “The reality is many of them have a certain somatotype [body shape] that the French love, in which big is great, and even bigger is better,” Horne said.\n\n“We have a number of our players that we try to retain, but it’s hard to retain everyone in a certain group. And they do go early. So the idea is to keep them tagged. They’re really getting put into pro rugby pretty early, so they’re actually becoming quite exposed to the high end of the game. “We obviously do need the Will Skeltons of the world, and everyone’s journey is slightly different, and we want to make sure that if you’re Australian, you’re interested and you want to play in Super Rugby, you want to go home or you’ve got an aspiration to play in a gold jersey, then we stay in contact.” While the departure of young, talented ‘bigs’ sparks an instinctive concern, some argue the situation is not to be feared and can provide a massive benefit for Australian rugby if handled well. At no cost to RA and Super clubs, young tight forwards (who would otherwise be part-timers in Super academies and playing club colts or grade in Australia) can spend three years being developed in French rugby, where scrummaging and forward play are key tenets of faith. Tighthead props are so valued in France, they’re often among the highest-paid players at a club.\n\nBut 130kg front rowers don’t grow on trees in Australia, and prop depth at elite level is already shallow. So the obvious key is RA not losing them for good, and thus the increased time and investment being put into the connection strategy. Game vision of all players is also collated and analysed. The other upside of a rising superstar like Lemoto being in France is it meant he stayed in rugby, and did not take up one of several contract offers in the NRL. ‘We obviously do need the Will Skeltons of the world.’ RA high performance boss Peter Horne The 18-year-old had not yet travelled to France by the time the Wallabies were in town but RA are keen to keep the Australian under-18 star under the wing. Some bullishly argue Lemoto is good enough for incoming Test coach Les Kiss to pick the explosive 109kg back-rower next year, which would capture him as a Wallaby and fend off rivals. Horne said they are considering picking the outstanding No.8 from Toulouse for the Junior Wallabies (which is not a capture team) in the World Rugby Under-20 Championships in Georgia next year. But that’s a thorny issue, given it could further encourage others to take the French option too.\n\n“You’d take that into consideration and whether we want to do that or not, but there are some players that are generational talent,” Horne said. Along with Schmidt and former Fiji coach Simon Raiwalui, Junior Wallabies coach Chris Whitaker is part of a group of French-speaking Australian rugby figures who have played and coached in French rugby, and will look to serve as mentors to the rookies – and pros as well. “It’s super important,” Whitaker says. “Heinz is obviously an extremely high-quality player, and there are lots of other talented young boys over there. “It’s tough for an 18/19-year-old guy to move to another country, and they probably don’t speak the language and it may be all a bit overwhelming. We are there to help them with whatever they may need around their clubs or whatever, just be someone they can turn to.”\n\nWhitaker would naturally love to have a player like Lemoto, and probably a few big other big boppers, too. But he is also wary. “You have to be careful about that, I guess,” he said. “There are some talented players but at the same time you don’t want to disadvantage or dissuade in any way the kids who are staying and doing their development at home in the Australian system.” RA produce weekly reports and analysis of the 30 Espoirs players, and indeed, all Australian players overseas. Schmidt, Horne and even a holidaying Kiss also met with Australian players currently playing in the UK, like Josh Kemeny and James Ramm, to keep connected and discuss the prospect of returning home. There are also plans for further meetings with senior and academy players in France, Wales and England next year. And so too the meetings that probably matter most – the ones with star Wallabies.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/in-2025-maya-was-an-australian-open-wildcard-in-2026-she-s-the-nation-s-best-hope-20251216-p5no0p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "In 2025, Maya was an Australian Open wildcard. In 2026, she’s the nation’s best women’s hope",
        "publish_date": "Sat, 20 Dec 2025 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "Teenager Maya Joint made her Australian Open debut last summer in what proved to be an impossible task.\n\nThe Australian appeared calm on Melbourne Park’s John Cain Arena against then world No. 6 Jessica Pegula – a player who reached the final of the US Open four months earlier.\n\nMaya Joint in her round one match at the 2025 Australian Open. Credit: Getty Images\n\nJoint was tenacious, aggressive and appeared to be enjoying herself on debut at her home slam in front of a few hundred fans. She lost in straight sets, 6-3, 6-0, to an experienced player who had been on tour for almost a decade.\n\nBut in the 12 months since Joint was granted a 2025 Australian Open wildcard, the 19-year-old has surged to No.32 in the world. She’s now Australia’s top-ranked female player and in line to appear at the 2026 Australian Open as a seeded player.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/final-victim-of-bondi-beach-terror-attack-identified-20251220-p5np67.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Final victim of Bondi Beach terror attack identified",
        "publish_date": "Sat, 20 Dec 2025 07:38:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "Final victim of Bondi Beach terror attack identified\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/over-100-homes-without-power-in-sydney-following-wild-weather-20251220-p5np6c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Over 100 homes without power in Sydney following wild weather",
        "publish_date": "Sat, 20 Dec 2025 07:38:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "Over 100 homes without power in Sydney following wild weather\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/heat-pull-off-historic-run-chase-20251220-p5np6a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Heat pull off historic run chase",
        "publish_date": "Sat, 20 Dec 2025 07:38:12 +1100",
        "category": "sports",
        "authors": [],
        "text": "Heat pull off historic run chase\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/20-million-powerball-prize-up-for-grabs-this-christmas-day-020012351.html",
        "title": "$20 million Powerball prize up for grabs this Christmas Day",
        "publish_date": "2025-12-20T02:00:12Z",
        "category": "finance",
        "authors": [],
        "text": "One lucky Aussie might discover an incredible $20 million gift sitting under their tree this Christmas tree Day. The Powerball prize is up for grabs on Thursday night, with festive punters no doubt eager to throw their hat in the ring.\n\nPowerball has recorded the highest number of division-one winning entries in the past five years, officials from The Lott revealed to Yahoo News Australia.\n\nSo far this year, 23 division-one ticket holders have collectively taken home more than $555 million in prize money.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAnd Thursday’s Powerball draw will likely have even more players on the edge of their sears, hoping to be crowned a newly minted Christmas multi-millionaire, The Lott spokesperson Anna Hobdell said.\n\n“There’s 20 million reasons to grab an entry into this week's Powerball draw,” she told Yahoo News.\n\n“Just picture finding out you’ve suddenly become a multi-millionaire on Christmas Day. In one moment, everything changes – it’d be the ultimate Christmas surprise, nothing could ever top it!\n\n“$20 million would absolutely change your life, leading to endless possibilities — your new car, a dream home, and the holiday of a lifetime.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThursday’s Powerball draw will have punters on the edge of their sears, The Lott spokesperson Anna Hobdell (right) said. Source: The Lott\n\nPowerball winner's kind offer after scoring $20 million prize\n\nThe last person to score an entire $20 million Powerball division-one prize was a woman from Ipswich, Queensland.\n\nAfter learning of her newfound wealth in March, the lucky Aussie could barely contain her excitement as she shared her plans for the money.\n\n“Oh my God! Oh my God! You’re joking!” she gasped when speaking to an official from The Lott.\n\n“I don’t play every week, but when I do, I usually check in the morning. I sometimes win small amounts like $11 here and there, but I can’t believe I’ve just won $20 million!”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe woman revealed she would be “seeking financial advice right away” and planned on helping her children pay off their mortgages.\n\n“…and I might finally take a holiday! I haven’t had one in years. My passport must be expired. I’ll have to get it renewed!” she added.\n\nSome helpful winning tips from The Lott:\n\nThe most frequently drawn winning numbers from the main barrel are 7, 9, 11, 17 and 19 while the least frequently drawn are 13, 15, 26, 29 and 31 .\n\nThe most frequently drawn Powerball numbers are 2, 4 and 10 , while the least frequently drawn Powerball numbers are 5, 8 and 12 .\n\nMore than half (11 of 23) of the Powerball division-one winning entries in 2025 were QuickPicks – where the lottery terminal randomly generates your numbers.\n\nAlmost a third (7 of 23) of the 2025 Powerball division-one winning entries were PowerHit entries — an entry that guarantees the all-important Powerball number, costing $31.50 per game.\n\nIf gambling is a problem for you, go to Gambling Help Online or call 1800 858 858.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]