[
    {
        "url": "https://www.9news.com.au/world/donald-trump-jerome-powell-feud-rba-chair-michele-bullock-expresses-full-solidarity-with-fed-chair-after-trump-escalates-feud/5390890e-e66e-4ca4-bd60-c5b19ea4fab2",
        "title": "RBA governor takes stand against Donald Trump",
        "publish_date": "Wed, 14 Jan 2026 00:45:47 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Reserve Bank of Australia Governor Michele Bullock has come out in support of US Federal Reserve Chair Jerome Powell after US President Donald Trump ramped up his feud against the head of the fed.\n\nRBA head Bullock today joined with more than a dozen other central bankers in expressing their \"full solidarity\" with Powell after the US Department of Justice threatened him with a criminal indictment over his comments at a Senate Banking Committee meeting in June﻿ last year.\n\n\"The independence of central banks is a cornerstone of price, financial and economic stability in the interest of the citizens that we serve,\" the bankers said.\n\nReserve Bank Governor Michele Bullock during a press conference at the Reserve Bank, after interest rates were left on hold. Tuesdsay, December 9. (Louie Douvis/AFR)\n\n\"It is therefore critical to preserve that independence, with full respect for the rule of law and democratic accountability.\n\n\"Chair Powell has served with integrity, focused on his mandate and an unwavering commitment to the public interest.\n\n\"To us, he is a respected colleague who is held in the highest regard by all who have worked with him.\"\n\nTrump, who appointed Powell during his first term, has repeatedly battered the Fed chair since returning to the Oval Office, directly and publicly calling on him to cut interest rates, in a break with modern presidential practice.\n\nHe's called for Powell to be fired and replaced with someone more willing to drastically cut the US cash rate.﻿\n\nTrump dramatically escalated his pressure campaign this week, with his Justice Department investigating and threatening a criminal indictment of the independent central bank and serving it with subpoenas.\n\nTrump has repeatedly battered Powell in public since returning to the Oval Office. (AP)\n\nThe dispute is ostensibly about Powell's testimony to Congress in June over the cost of a massive renovation of Fed buildings.\n\nOn Sunday, Powell called the administration's threat of criminal charges \"pretexts'' in the president's campaign to seize control of US interest rate policy.\n\nEconomists warned if a politicised Fed caved in to Trump, it would damage its credibility.\n\nPolitically independent central banks can more easily take unpopular steps to fight inflation, such as rate hikes, which preserve price stability over the longer term.\n\nUS Federal Reserve Chairman Jerome Powell announced the interest rate rise. (AP)\n\nOther signatories of the statement carried on the European Central Bank's website were European Central Bank President Christine Lagarde; Bank of England Governor Andrew Bailey; Erik Thedeen, the governor of Sweden's central bank; Christian Kettel Thomsen, the chair of Denmark's central bank; and Swiss National Bank chair Martin Schlegel.\n\nThe Bank of Japan, a prominent central bank, was not included but the statement said more signatories could be added later.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sydney-al-madina-dawah-centre-linked-to-radical-preacher-wissam-haddad-permanently-shuts-down/9c9a270a-cd40-4485-bb71-962d55ee7fbc",
        "title": "Sydney prayer hall linked to radical preacher permanently shuts down",
        "publish_date": "Wed, 14 Jan 2026 01:01:03 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "NSW\n\nPremier Chris Minns said today's permanent closure was \"evidence of the changes that we're proposing will work\", referring to\n\na raft of new measures announced this week\n\nto crack down on people operating public places of worship without proper planning approval as a way to clamp down on hate preachers from running \"factories of hate\".",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/western-sydney-man-death-threats-federal-politician/ee1d063c-eece-4a6d-bb8e-4cce14723b45",
        "title": "Man charged with making several death threats to federal politician",
        "publish_date": "Wed, 14 Jan 2026 00:52:32 +0000",
        "category": "sports",
        "authors": [
            "Jan"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/queensland-couple-parking-hack-could-lead-to-jail/998691be-289a-4f25-80be-d0218223f1c5",
        "title": "A video of a parking hack went viral. Copying it could land you in jail",
        "publish_date": "Wed, 14 Jan 2026 01:54:10 +0000",
        "category": "sports",
        "authors": [
            "Jan"
        ],
        "text": "Bonnie-Rae and Kodi ﻿shared on TikTok a video of them covering a yellow line with sand near the\n\nbeach\n\nand claimed the trick helped them avoid a fine.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/work-habits-linked-to-dangerous-drinking-levels/94fdff7e-e1de-487b-ad67-bd1bb002249b",
        "title": "How your job influences how much alcohol you drink",
        "publish_date": "Wed, 14 Jan 2026 01:06:09 +0000",
        "category": "lifestyle",
        "authors": [
            "Jan"
        ],
        "text": "Working conditions are linked to dangerous drinking habits and employers should do more to mitigate it, a new study has found.\n\nFlinders University researchers found that while personal and social factors play central roles in heavy drinking, work-related influences such as stress and shift work also drive bad habits.﻿\n\nLead author Dr Gianluca Di Censo from Flinders' College of Medicine and Public Health and the National Centre for Education and Training on Addiction (NCETA) said the findings challenged some common assumptions.\n\nREAD MORE: Sydney driver allegedly makes Nazi salute before road rage assault ﻿\n\nWorkplace factors are linked to high-risk drinking. (Getty)\n\n\"We often think of workplace stress as one of the main drivers of excessive drinking, but our research shows that sociodemographic and health factors are even more important,\" Di Censo said.\n\n\"That said, certain work conditions do increase risk, and understanding these patterns is vital for designing effective ways in which to help those who are indulging in high-risk drinking.\"\n\nThe study analysed responses from over 26,000 employed Australians and found that working more than 40 hours a week was linked to higher odds of drinking at harmful levels across the week.\n\nLong hours and shift work were linked to heavy drinking. (Eamon Gallagher)\n\nShift workers were more likely to engage in one-off high-risk drinking occasions, while those who wanted to work more hours also showed elevated risk.\n\n\"We believe that wanting more work hours may reflect underlying factors such as financial stress, workaholism, or other traits that predispose individuals to high-risk drinking patterns, which is consistent with previous research,\" Di Censo said.\n\nJob satisfaction was not a major factor, which researchers suggested the interesting probability ﻿that structural factors mattered more than enjoying your work.\n\nREAD MORE: Tom Silvagni files appeal against rape convictions ﻿\n\nBeyond workplace factors, the research revealed differences based on age, gender and lifestyle.\n\nYoung workers aged 18 to 29 were almost eight times more likely to binge drink compared to older colleagues, and men were far more likely than women to drink to excess.\n\nSmoking emerged as the strongest modifiable risk factor, with smokers nearly three times more likely to drink at high-risk levels.\n\n\"This tells us that prevention and intervention programs shouldn't just focus on alcohol in isolation,\" Di Censo said.\n\n\"Programs that address multiple health behaviours, like smoking and drinking together, are likely to be more effective.\"\n\nCo-author Dr Kirrilly Thompson from the College of Medicine and Public Health and NCETA says the findings have clear implications for employers.\n\n\"Workplaces can't ignore this issue. Long hours and shift work are linked to harmful drinking patterns, and myths like 'alcohol helps you sleep' persist among shift workers,\" she said.\n\n\"Employers need to provide education about the real effects of alcohol, promote work-life balance and offer support for stress management. These steps can make a real difference.\"\n\nDi Censo said tailored approaches were key.\n\n\"Younger male workers and those in physically demanding jobs like labouring are among the highest-risk groups. Targeting these populations with relevant messaging and support could make a real difference,\" he said.\n\n\"By recognising how work conditions intersect with drinking habits, employers and policymakers can help create healthier environments for everyone.\"\n\nThe study, published in Drug and Alcohol Review , can be found online here .﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/mandy-dashwood-lost-home-in-harcourt-bushfire-after-losing-mum-and-battling-breast-cancer/3c4e98ca-cb08-44ac-aa1d-01cc78759f51",
        "title": "'Incomprehensible': Tragic triple blow after Mandy's home destroyed in bushfire",
        "publish_date": "Tue, 13 Jan 2026 22:59:31 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Exclusive: A﻿s the old saying goes, bad things often happen in threes.\n\nMandy Dashwood﻿ has suffered a devastating trifecta of recent misfortunes: her home and almost everything she owns were reduced to rubble in the ﻿Harcourt bushfires , just one day after her beloved mum died.\n\nAnd this all unfolded as she battles a breast cancer diagnosis.\n\nREAD MORE: Disaster relief payments for Aussies affected by Victoria bushfires\n\nMandy Dashwood lost her home in the devastating Harcourt fire. (Supplied)\n\nThe 62-year-old, however, remains fiercely positive and unwavering in her resilience.\n\n\"I don't have anything to wear to mum's funeral because I don't have a wardrobe anymore,\" Dashwood told nine.com.au.\n\n\"I don't even have a pair of socks.﻿\"\n\nDashwood evacuated her home just minutes before the blaze ripped through her community.\n\nShe said her \"sanctuary\"﻿ was among the first to burn to the ground.\n\n\"My gut instinct said get out, and I didn't question it,\" Dashwood recalled.\n\n\"I just got a small bag ready, and put the dogs in the car. I only just bought one night's worth of clothes.\n\n\"My house was gone in less than 10 seconds.\"\n\nHers was among ﻿ 47 homes destroyed in Harcourt.\n\nShe evacuated her home just minutes before the blaze ripped through her community. (Supplied)\n\nThe mum and former policewoman said she \"wouldn't have survived\" if she stayed to protect her home.\n\nDashwood luckily spent nearly $10,000 on ﻿home and contents insurance , but a large chunk of her payout will be lost to the bank as she still has a mortgage.\n\nShe also acknowledges that this cost is prohibitive to many homeowners in bushfire and flood zones.﻿\n\n\"One insurance agency was going to charge me $21,000 for insurance, and I got another company down to $9500 a year,\" she added.\n\n\"I've never been through this, and I didn't know what hoops I'd have to jump through.\"\n\nIt will likely be a long time before Dashwood﻿ sees the money.\n\nNow, with only the clothes on her back, Dashwood faces the daunting task of starting from scratch.\n\n\"﻿I want to go back there and I want to rebuild because my ultimate plan, because I'm 62 and I was happy to retire there,\" she said.\n\nDashwood's niece Remi is in awe of her aunt's strength.\n\nShe has started a GoFundMe crowdfunding page to help Dashwood pick up the pieces and reassemble her life.﻿\n\nThe mum and former policewoman said she \"wouldn't have survived\" if she stayed to protect her home. (Supplied)\n\nREAD MORE: Clintons refuse to testify in congressional Epstein probe despite contempt threat\n\nIt has already ﻿amassed close to $30,000.\n\n\"How do you replace a whole life?\" Remi said.\n\n\"That's just incomprehensible. The insurance covers a part of that, but it doesn't really cover everything.\"\n\nDashwood is now staying with a friend in Berwick in Melbourne's south-east, but when she returns home, she plans to pay the generosity forward.﻿\n\n\"I am absolutely speechless. I am humbled to the core,\" she said.\n\n\"And I will, once this blows over, spend my time paying that forward in incredible ways.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-minor-car-crashes-not-leaving-details-study/a393218a-f7ce-4146-aba8-4c1e185d7390",
        "title": "The shameful act most Aussie drivers admit to",
        "publish_date": "Tue, 13 Jan 2026 03:32:15 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Around 57 per cent of the drivers said they had\n\nhit\n\nanother car and not reported the incident to the owner through a note or other means, according to a survey from\n\nMoney.com.au\n\nof over 1000 Australians.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-14/thanasi-kokkinakis-withdraws-from-adelaide-international/106228146",
        "title": "Kokkinakis withdraws from local Aus Open warm-up after another injury",
        "publish_date": "Wed, 14 Jan 2026 01:02:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "Adelaide native Thanasi Kokkinakis has withdrawn from his home tournament on the eve of the Australian Open after suffering another injury setback in his opening-round win.\n\nOn social media, Kokkinakis said he was \"very sad to have to pull out of my favourite event\" and that his arm was not \"quite ready yet after missing a year off\".\n\nKokkinakis, who has battled through a slew of shoulder and pectoral injuries throughout his career, was treated by the trainer during his 3-6, 6-3, 7-6(7/3) win over American Sebastian Korda.\n\nHe said after the match that if it had not been his hometown tournament, not only would he have retired from the match, but he \"probably wouldn't have played to start with\".\n\n\"I had conversations with my team: I was like, 'At what cost am I playing? Even if I get through this match, so what?'\" he said.\n\nAustralian Open 2026: Everything you need to know With the 2026 Australian Open just around the corner here's everything you need to know about the tournament.\n\n\"I had the surgery so I could back-up matches and go through a tournament. But I'll never really find out until I go through a long match and see where I'm at after.\"\n\nThe match was Kokkinakis's first singles match on tour in 12 months, and he was scheduled to face Monaco's Valentin Vacherot in the second round.\n\nKokkinakis's withdrawal was confirmed just a few hours before their match was scheduled to start on Wednesday evening, with Vacherot's ticket to the quarterfinals locked in via walkover.\n\nThe shock 2025 Shanghai Masters winner will face the winner of the top-seeded Alejandro Davidovich Fokina versus Australian wildcard Rinky Hijikata.\n\nKokkinakis said on Monday that his injury was more in his shoulder as opposed to the pec he had surgery on last year.\n\n\"There was a lot of times [in the match] I thought about stopping, and am I going to do more damage if I keep playing?\" he said after beating Korda.\n\n\"But it's really hard to stop. Maybe for the sake of my body, it was smarter if I stop.\n\n\"But playing your home tournament, the only title I have won in singles, it makes it really hard to just be like, 'Yeah, I think I'll stop here.'\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nABC/AAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-14/bts-k-pop-band-announce-australian-tour-dates/106227562",
        "title": "K-pop supergroup BTS reveal Australian tour dates",
        "publish_date": "Wed, 14 Jan 2026 00:09:10 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "K-pop supergroup BTS will perform in Australia for the first time in eight years as part of a mammoth 79-show world tour.\n\nThe band had been on a nearly four-year hiatus while all seven of its members undertook conscripted military service in the South Korean army.\n\nThey will now return to the global stage in April and are set to perform shows across the North America, South America, Asia, Australia and Europe up until 2027.\n\nAustralian shows have been scheduled for 2027, in Melbourne on February 12 and 13, and Sydney on February 20 and 21.\n\n\"Set to be the biggest global K-pop tour of all time, and the largest of their career to date, the run will span 34 regions and 79 shows, featuring first-ever performances in several cities and marking a historic new chapter for the group and their global fanbase, army,\" tour promoter Live Nation said in an announcement.\n\nSpecific venue and ticketing information will be available at a later date, but fans can join a waiting list for updates.\n\nBTS, which is short for Bangtan Sonyeondan and translates to Bulletproof Boy Scouts in English, last visited Australia as part of their Wings Tour in 2017.\n\nTheir last headline performances were during the Permission to Dance on Stage Tour between 2021 and 2022 before they disbanded for mandatory military service.\n\nThe group debuted in June 2013 with the album 2 Cool 4 Skool later releasing three full-length projects before gaining traction with their 2016 album Wings.\n\nTheir ​last ‍album, Proof in ⁠2022, reached number one in 18 countries and has amassed about 16.7 billion streams worldwide.\n\nBTS' agent has flagged the group will release their latest album on March 20, though the title has not been revealed.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2026-01-14/lychee-fruit-farm-harvest-value-adding-horticulture/106225068",
        "title": "Lychee growers' creative desserts and drinks offset a dismal harvest",
        "publish_date": "Wed, 14 Jan 2026 00:00:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Committed customers sweat on Gynara Gattera's annual announcement that the gates are open to her Sunshine Coast farm shop.\n\nLychee lovers like Leonie and Cliff Bartlett drive 40 minutes from Brisbane to buy sweet Kwai Mai Pink variety lychees for $15 a kilogram, or seconds for $10 a kg.\n\nLeonie and Cliff Bartlett make an annual trip up from Brisbane to buy fresh lychees. (ABC Rural: Jennifer Nichols)\n\nBut this year the Gattera family's fresh fruit harvest ended just three days after it began.\n\n\"Stocks are way down compared to normal … about 98 per cent for us personally, we just haven't had a great year,\" Ms Gattera said.\n\n\" I've not sent one single piece of fruit away to the markets, which is a big hit to us because that's where the bulk of our money comes from. \"\n\nGynara Gattera is proud of everything they grow and make at Landsborough Lychees. (ABC Rural: Jennifer Nichols)\n\nCreative farmers diversify\n\nThe family has diversified to ensure Landsborough Lychees' survival in a booming region where farms are being swallowed up by subdivisions.\n\nDespite selling out of fresh lychees, they are using frozen fruit to help keep their farm shop open for longer.\n\nIce cream and free-dried ice cream are just some of the ways the Gattera family value-adds to fruit. (ABC Rural: Jennifer Nichols)\n\nMs Gattera is now freeze-drying her existing range of creamy dairy and vegan fruit ice creams to sell alongside home-grown fruit and vegetables and coffee.\n\n\"It's a new product that I've decided to try and do, and people are loving it,\" she said.\n\nLandsborough Lychees is a family-owned and run farm. (ABC Rural: Jennifer Nichols)\n\nThe poor harvest has meant Ms Gattera's husband, Paul, returned to his off-farm job earlier than planned.\n\nTheir bills include $650,000 for new netting to protect nearly 3,000 lychee trees from birds and flying foxes.\n\nLandsborough Lychee's orchard has netting worth $650,000 to guard over fruit. (ABC Rural: Jennifer Nichols)\n\nMs Gattera attributed their poor yield, partially, to the trees adapting to the change in light under the netting and their fruiting cycle.\n\nShe said heavy rain in 2025 impacted pollination and increased soil acidity.\n\nSmall farms adapt\n\nRob Yarrow has returned from the mines to help run Ferntree Valley Farm. (ABC Rural: Jennifer Nichols)\n\nA half an hour's drive north at Ferntree Valley farm in Kulangoor, the Yarrow family is weighing up the costs of a 50 per cent loss in lychee yield, with the benefits of higher prices at wholesale markets.\n\nAfter the death of his father, Kelvin, in November 2024, Rob Yarrow returned from working in the mines to manage the farm full-time.\n\nRob Yarrow says the 2026 lychee harvest at Ferntree Valley Farm is down by 50 per cent. (ABC Rural: Jennifer Nichols)\n\nHe said large amounts of fruit dropped from the trees as they were developing this season.\n\n\"It's a bit disappointing because the price is up,\" Mr Yarrow said.\n\n\" Someone's got to have a bad year for someone to have a good year in farming. \"\n\nAnnette Yarrow quality checks lychees grown on Ferntree Valley Farm. (ABC Rural: Jennifer Nichols)\n\nMr Yarrow's wife, Annette, and their team have been juicing lychees, lemons, limes, mandarins, and oranges for direct sales to customers at their farm shop and at markets.\n\n\"We get so many seconds, it's phenomenal,\" Ms Yarrow said.\n\nAt Ferntree Valley Farm crates filled with seconds are transformed into juices. (ABC Rural: Jennifer Nichols)\n\nShe said other varieties were still ripening, describing the supersized Erdon Lee fruit as a tastebud sensation.\n\n\"One [customer] said it tasted like garlic, one said it was onion, one said it was sour, the other guy said sweet and sour,\" Ms Yarrow said.\n\nThe Erdon Lee variety grows very large and has a unique flavour. (ABC Rural: Jennifer Nichols)\n\nMr Yarrow's mum, June, continues to help process fresh-picked lychees and gets up at 4am on Saturdays to open their stall at the Yandina markets.\n\n\"She's a worker, she's over 80, and she still comes up to the farm and does what she can,\" Mr Yarrow said.\n\nJune Yarrow enjoying morning tea after helping with the lychee harvest. (ABC Rural: Jennifer Nichols)\n\nLychees in Australia\n\nA tropical fruit native to China, lychees were introduced to Far North Queensland in the 1870s by Chinese immigrants.\n\nThey are grown between the Atherton Tablelands and northern New South Wales, with harvest starting in the north in October and November, then moving south to finish in February and March.\n\nSome varieties are still ripening at Ferntree Valley Farm. (ABC Rural: Jennifer Nichols)\n\nAustralian Lychee Growers Association president Derek Foley said rain and poor pollination had led to underproduction on farms in south-east Queensland this year.\n\nBut he said it was too early to predict the impact on the national crop, which historically yields between 2,500 and 3,000 tonnes of fruit.\n\n\"The industry's got a great future, I believe, and hopefully there's enough reasonably priced lychees around for every consumer to enjoy,\" Mr Foley said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-14/carranballac-cricket-club-destroyed-streatham-fire/106223094",
        "title": "Cricket clubrooms reduced to ashes after fire in western Victoria",
        "publish_date": "Tue, 13 Jan 2026 23:59:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "When fires were bearing down on their home at Streatham, in Victoria's west, on Friday, Leigh and Pauline Graham got ready to leave.\n\nMs Graham took their dog to nearby Skipton, and Mr Graham threw some essentials in the car before he went off to fulfil his duties as a Country Fire Authority (CFA) volunteer and fight the fires on his neighbour's property.\n\n\"When we were packing on Friday [to evacuate], I actually threw the cricket whites and the cricket gear into the car,\" Mr Graham said.\n\nAs he left, he knew it was too late to save his home of 14 years.\n\nLeigh and Pauline Graham visited the remains of their property to sift through the rubble. (ABC News: Coco Veldkamp)\n\nIt is one of at least a dozen homes destroyed by the fires that tore through Streatham, Carranballac and Skipton in western Victoria.\n\nBut Mr Graham is also devastated by the loss of his \"second home\" — the clubrooms of the Carranballac Cricket Club, which were also destroyed in the fires.\n\nCarranballac Cricket Club was established in 1946. (ABC News: Eden Hynninen )\n\nThe club's Facebook page sums up the heartbreak.\n\n\"To some, this was just an old tin shed, but to us it was much more,\" it reads.\n\n\"In good times or bad, this is where we shared memories and made new ones.\n\n\"A place our children grew up in, maybe took their first steps\".\n\nLeigh and Pauline Graham lost their home in the fires. (ABC News: Coco Veldkamp)\n\nMr Graham played his first game in 1971 and returned to the club in the early 2000s.\n\n\"I've been playing there ever since, and now I get the pleasure of playing with my three sons,\" he said.\n\nAshes to ashes\n\nMr Graham has spent countless hours maintaining and watering the field, and said the club was crucial to the small, tight-knit community.\n\n\"It has always been a place that anyone can rock up to on a Thursday night when we are training and have a quiet beer,\" he said.\n\nOn the Glenelg highway between Skipton and Streatham, trees lining the roads have been reduced to stumps. (ABC News: Coco Veldkamp)\n\nDespite losing his home on Friday, Mr Graham was out playing cricket on Sunday in an over-60s team that he captains.\n\nClub members watching the ashes together after a training session. (Supplied: Carranballac Cricket Club)\n\n\"My wife actually told me to go and play,\" Mr Graham said.\n\n\"Just to get away and clear my head with a few mates … that was very important to me\".\n\nClub president Luke Jackson said hearing the clubrooms had been destroyed was heart-wrenching.\n\n\"I had been talking to a mate, and he thought [the fire] would have gone past, and then the wind changed and destroyed everything,\" Mr Jackson said.\n\n\" A few weeks ago, we were sitting here watching The Ashes … and now it's in ashes. \"\n\nMr Jackson has played at the club for 28 years, since he was a kid.\n\nHe said the community support had been overwhelming.\n\nLuke Jackson has been president of the Carranballac Cricket Club for almost 10 years. (ABC News: Eden Hynninen)\n\n\"The community has been wonderful … everyone's getting behind us … it's a bit overwhelming, really,\" Mr Jackson said.\n\n\" I even had a phone call from a local farmer this morning, his farm is completely burnt and he still wanted to donate to the cricket club. It really pulls your heart strings. \"\n\nA fundraiser has started to raise money for the rebuild.\n\nIn the meantime, the club will be able to finish its season using the Tatyoon Recreation Reserve as its home ground.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-14/scott-adams-dilbert-obituary/106227212",
        "title": "From celebrated cartoonist to pariah — Dilbert creator Scott Adams dead at 68",
        "publish_date": "Tue, 13 Jan 2026 22:32:55 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Scott Adams, whose popular comic strip Dilbert captured the frustration of beleaguered, white-collar cubicle workers and satirised the ridiculousness of modern office culture until he was dropped from syndication in 2023 for racist remarks, has died. He was 68.\n\nHis first ex-wife, Shelly Miles, announced his death in a livestream posted on Adams's social media accounts.\n\nMs Miles had said he was in hospice care in his Northern California home on Monday.\n\nAdams revealed in 2025 that he had prostate cancer that had spread to his bones.\n\n\"I had an amazing life,\" the statement said. \"I gave it everything I had.\"\n\nEponymous employee\n\nAt its height, Dilbert, with its mouthless, bespectacled hero in a white short-sleeved shirt and a perpetually curled red tie, appeared in 2,000 newspapers in at least 70 countries and 25 languages.\n\nAdams was the 1997 recipient of the National Cartoonist Society's Reuben Award, considered one of the most prestigious awards in the US for cartoonists.\n\n'Own goal': One Nation mocks Robert Irwin's legal threat to sue over cartoon One Nation published a two-minute video on Friday which used Robert Irwin and popular children's character Bluey to mock the state government over perceived failings ahead of the election in October.\n\nThat same year, Dilbert became the first fictional character to make Time magazine's list of the most influential Americans.\n\n\"We are rooting for him because he is our mouthpiece for the lessons we have accumulated — but are too afraid to express — in our effort to avoid cubicular homicide,\" the magazine said.\n\nDilbert strips were routinely photocopied, pinned up, emailed and posted online, a popularity that would spawn bestselling books, merchandise, commercials for Office Depot and an animated TV series with Daniel Stern voicing Dilbert.\n\nRacist comments\n\nIt all collapsed quickly in 2023 when Adams, who was white, repeatedly referred to black people as members of a \"hate group\" and said he would no longer \"help black Americans\".\n\nHe later said he was being hyperbolic, yet continued to defend his stance.\n\nAlmost immediately, newspapers dropped Dilbert and the distributor, Andrews McMeel Universal, severed ties with the cartoonist.\n\nThe Sun Chronicle in Attleboro, Massachusetts, decided to keep the Dilbert space blank for a while \"as a reminder of the racism that pervades our society\".\n\nDilbert dumped after creator's racist remarks The creator of the Dilbert comic strip faced a backlash of cancellations Saturday while defending remarks describing people who are Black as members of \"a hate group\" from which white people should \"get away.\"\n\nA planned book was scrapped.\n\nAdams relaunched the same daily comic strip under the name Dilbert Reborn via the video platform Rumble, popular with conservatives and far-right groups.\n\nHe also hosted a podcast, Real Coffee, in which he talked about political and social issues.\n\nAfter Jimmy Kimmel's late-night show on US TV was suspended in September in the wake of the host's comments on reactions to the murder of right-wing activist Charlie Kirk, Adams said he stood for free speech.\n\n\"Would I like some revenge?\" he said.\n\n\"Yes. Yes, I would enjoy that. But that doesn't mean I get it. That doesn't mean I should pursue it. Doesn't mean the world's a better place if it happens.\"\n\nFrom office worker to cartoonist\n\nAdams was working in a corporate job at the Pacific Bell telephone company in the 1980s, sharing his cartoons to amuse co-workers.\n\nHe drew Dilbert as a computer programmer and engineer for a high-tech company and mailed a batch to cartoon syndicators.\n\n\"The take on office life was new and on target and insightful,\" Sarah Gillespie, who helped discover Dilbert in the 1980s at United Media, told The Washington Post.\n\n\"I looked first for humour and only secondarily for art, which with Dilbert was a good thing, as the art is universally acknowledged to be … not great.\"\n\nWashington Post cartoonist resigns over rejected cartoon featuring owner Jeff Bezos Ann Telnaes says her editor prevented her from holding power to account by refusing to publish a cartoon showing tech giants bowing to the US president-elect.\n\nThe first Dilbert comic strip officially appeared on April 16, 1989, long before workplace sitcoms like The Office.\n\nIt portrayed corporate culture as a Severance-like, Kafkaesque world of heavy bureaucracy and pointless benchmarks, where employee effort and skill were under-appreciated.\n\nThe strip introduced the Dilbert Principle: The most ineffective workers will be systematically moved to the place where they can do the least damage — management.\n\n\"Throughout history, there have always been times when it's very clear that the managers have all the power and the workers have none,\" Adams told Time magazine.\n\n\"Through Dilbert, I would think the balance of power has slightly changed.\"\n\nOther strip characters included Dilbert's pointy-haired boss; Asok, a young, naive intern; Wally, a middle-aged slacker; and Alice, a worker so frustrated that she was prone to frequent outbursts of rage, and Dilbert's pet, Dogbert, a megalomaniac.\n\nAnger and aphorisms\n\n\"There's a certain amount of anger you need to draw Dilbert comics,\" Adams told the Contra Costa Times in 2009.\n\nIn 1993, Adams became the first syndicated cartoonist to include his email address in his strip. That triggered a dialogue between the artist and his fans, giving Adams a fountain of ideas for the strip.\n\nDilbert was also known for generating aphorisms, like \"All rumours are true — especially if your boss denies them\" and \"OK, let's get this preliminary pre-meeting going\".\n\n\"If you can come to peace with the fact that you're surrounded by idiots, you'll realise that resistance is futile, your tension will dissipate, and you can sit back and have a good laugh at the expense of others,\" Adams wrote in his 1996 book The Dilbert Principle.\n\nIn one real-life case, an Iowa worker was fired from the Catfish Bend Casino in 2007 for posting a Dilbert comic strip on the office bulletin board.\n\nIn the strip, Adams wrote: \"Why does it seem as if most of the decisions in my workplace are made by drunken lemurs?\"\n\nA judge later sided with the worker; Adams helped find him a new job.\n\nDonald Trump has paid tribute to Scott Adams. (Truth Social: Donald Trump)\n\nDescent into misogyny and racism\n\nWhile Adams' career fall seemed swift, careful readers of Dilbert saw a gradual darkening of the strip's tone and its creator's descent into misogyny, anti-immigration and racism.\n\nHe attracted attention for controversial comments, including saying in 2011 that women were treated differently by society for the same reason as children and the mentally disabled — \"it's just easier this way for everyone\".\n\nIn a blog post from 2006, he questioned the death toll of the Holocaust.\n\nIn June 2020, Adams tweeted that when the Dilbert TV show ended in 2000 after just two seasons, it was \"the third job I lost for being white\". But, at the time, he blamed it on lower viewership and time slot changes.\n\nAdams' beliefs began bleeding into his strips.\n\nRemembering the celebrities and public figures who died in 2025 From actors and designers to a Holocaust survivor and a broadcaster, these men and women made their mark.\n\nIn one in 2022, a boss says that traditional performance reviews would be replaced by a \"wokeness\" score. When an employee complained that could be subjective, the boss said, \"That'll cost you two points off your wokeness score, bigot.\"\n\nAdams put a brave face on his fall from grace, tweeting in 2023: \"Only the dying leftist Fake News industry cancelled me (for out-of-context news of course). Social media and banking unaffected. Personal life improved. Never been more popular in my life. Zero pushback in person. Black and White conservatives solidly supporting me.\"\n\nOn Tuesday, President Donald Trump remembered Adams as a \"Great Influencer\".\n\n\"He was a fantastic guy, who liked and respected me when it wasn't fashionable to do so. He bravely fought a long battle against a terrible disease,\" the president posted on his social media platform Truth Social.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-14/kimberley-artist-jeanne-barne-struck-by-lightning-twice-in-1980s/106224368",
        "title": "Lightning-strike survivor hit twice in six years during dial-up phone calls",
        "publish_date": "Tue, 13 Jan 2026 22:06:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "When a big storm rolls into the town of Kununurra in Western Australia's north, Jeanne Barnes shivers.\n\n\"If there's lightning, I run into the house,\" she said.\n\n\"I don't think it's gonna be third time lucky somehow.\"\n\nThe Kimberley artist is one of the very few people — one in 9 million is the figure often cited — who have been struck by lightning not once, but twice.\n\nJeane Barnes was talking on the landline in here family home in South Africa both times when she was struck. (ABC Kimberley: Giulia Bertoglio)\n\nThe first time she was struck, Ms Barnes was 12, living in South Africa in an old tin-roofed house on top of a hill.\n\nShe was on a dial phone, with fox terrier Lulu on her lap.\n\n\"I was just having a chat with my friend and the next thing it felt like someone hit me on the side of my head with a plank,\" Ms Barnes said.\n\nJeanne Barnes says her terrier Lulu was on her lap when she was hit the first time. (ABC Kimberley: Giulia Bertoglio)\n\n\" It was pretty intense and the poor dog went flying … I'm not sure whether I jumped against the wall or whether I got thrown. \"\n\nThe shocking experience left her with temporary ringing in her ear and a painful memory, shared with her terrier, who \"lost it\" every time she heard thunder.\n\n\"My dog was never the same after that, poor Lulu,\" she said.\n\nLightning never strikes the same place twice?\n\nThe once-in-a-lifetime event was still fresh in the 18-year-old's mind when the landline in the same family home rang during an electrical storm.\n\nBut the teenager knew it was her boyfriend calling.\n\n\"I decided it's probably a bad idea to pick up the phone because of lightning, but I thought maybe if I just quickly pick up the phone and I say, 'I'll call you back, there's lightning,' and put it down again, then it will be fine,\" Ms Barnes said.\n\n\"What are the chances of being struck twice?\"\n\nMs Barnes said the second strike was more painful, throwing her against a wall and causing a temporary hearing loss.\n\nJeanne Barnes is scared of thunderstorms these days. (ABC Kimberley: Giulia Bertoglio)\n\n\"I just remember screaming to my parents, 'My ear, my ear, my ear!'\" she said.\n\n\"I thought my ear had been burnt off.\"\n\nWhile Ms Barnes did not take the second strike as a sign she should leave her boyfriend, it did teach her to be wary of thunderstorms.\n\nLoading...\n\n44 lightning strikes per second\n\nThe Bureau of Meteorology's Jessica Lingard said around the world, there were as many as 8 million lightning strikes every single day, about 44 strikes a second.\n\n\"Every year we have about 100 serious injuries and between five to 10 deaths from lightning strikes,\" she said.\n\nMs Lingard said while the odds of being struck by lightning were low, it remained a real risk.\n\nAccording to the BOM, lightning heats the air up to 30,000 degrees — five or six times hotter than the surface of the sun. (Supplied: Chris Munro)\n\n\"If you can hear thunder, you are close enough to be struck by lightning,\" she said.\n\nThe risk is higher in lightning-prone areas like the Kimberley, where the wet season brings spectacular electrical storms.\n\n\"Darwin is the lightning capital, they tend to have more thunderstorms every year, but really, across the tropical north of Australia [it is common],\" Ms Lingard explained.\n\nLowering the odds\n\nMs Lingard said it was possible to lower the risk of being struck by lightning, as it was \"very lazy\".\n\n\"It's going to take the path of least resistance, so if there are tall features in your area — buildings, trees, flagpoles — the lightning is going to be attracted to those,\" she said.\n\nLightning strikes behind Kelly's Knob during wild weather in Kununurra. (Supplied: Danny Carter A Higher Perspective/file)\n\nMs Lingard said talking on a landline phone during a storm was a bad idea.\n\n\"The phone line cabling throughout your house can actually conduct the electricity,\" she said.\n\n\"If you are holding onto your landline phone then that electricity is going to go up the phone line and through you.\"\n\nAnd that's what happened to Ms Barnes in the 80s, leaving her with a fear of storms — but a story to tell.\n\n\"That's my good story,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-14/sailgp-fremantle-high-speed-catamaran-western-australia/106222188",
        "title": "SailGP season kicks off in WA city with serious 'sailing DNA'",
        "publish_date": "Tue, 13 Jan 2026 21:11:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "The eyes of the sailing world will be on Perth's port city of Fremantle this weekend as it welcomes the international Sail Grand Prix for the first time.\n\nThe Formula 1-style sailing event will see 13 international teams skimming the water's surface at high speeds in front of a crowd of thousands.\n\nTo describe the 50-foot foiling catamarans as precious cargo would be an understatement.\n\nThese boats are carefully assembled and lifted by crane in and out of the Fremantle Port.\n\nThe Swedish SailGP boat being lifted into Fremantle Harbour. (ABC News: Grace Burmas)\n\nWith the famous Fremantle Doctor on their side, the boats can reach speeds up to 100 kilometres an hour.\n\nAustralians dominate the sport across the teams, but this event will be especially poignant for the athletes who grew up sailing in the West Australian winds.\n\n'Full circle' moment\n\nKinley Fowler is the grinder for the Australian SailGP Team, and earned his racing stripes in Perth.\n\nKinley Fowler serves as grinder and flight controller for the Australia SailGP Team. (ABC News: Grace Burmas)\n\n\"I'm still sort of pinching myself a little bit about racing here this weekend,\" he said.\n\n\"I'll probably have a bit of goosebumps going into the first pre-start but am super excited. [It's a] full circle moment for sure.\"\n\nThe Australian team is backed by some star power, with Hugh Jackman and Ryan Reynolds announced as co-owners last year.\n\nRyan Reynolds and Hugh Jackman buy Australian sailing team Hollywood co-stars and close friends Ryan Reynolds and Hugh Jackman are new co-owners of Australia's SailGP team.\n\n\"What a dream for us to have people like that involved in this sport, and in our team, its amazing,\" Fowler said.\n\nBut celebrities aside, Fowler feels it's the fair city of Fremantle itself that is the real star of the show.\n\n\"I hope people realise what they've got here in Fremantle,\" he said.\n\n\"We sail all around the world and I can tell you Perth is one of the most amazing places to come and sail.\"\n\nSailing 'DNA'\n\nThe race will take place off Bathers Beach, with spectators either scoring a ticket to watch from the sand or the purpose-built grandstands on the mole.\n\nAbout 14,000 people are expected to flock to the shores, some spending hundreds of dollars for the best seats in the house.\n\nThe New Zealand SailGP team was among those already on the water off Bathers Beach on Tuesday. (ABC News: Andrew O'Connor)\n\nThe strong winds, big waves and grandstands on either side of the course make Fremantle's set-up unique, bringing back memories of the iconic 1987 America's Cup defence, which put the city on the international map.\n\n\"It gets shown around the world so this weekend all eyes will be on Fremantle,\" Fremantle mayor Ben Lawver said.\n\nCity of Fremantle mayor Ben Lawver. (ABC News: Grace Burmas)\n\n\"Sailing is a part of Fremantle's DNA so hosting this event this year and then also for the next two years, we've got a three-year sponsorship deal, will be very exciting for Fremantle to bring sailing back in its new form.\"\n\nSeason opener\n\nThe Fremantle event is the first event in the 2026 SailGP season, one of 13 events scheduled for the year.\n\nAmong the other locations to host races will be Auckland, Sydney, New York, Portsmouth, Bermuda and Rio de Janeiro.\n\nFremantle is hosting the first event of the SailGP season. (ABC News: Andrew O'Connor)\n\nA race weekend sees teams compete in six or seven \"fleet races\", with the first three or four on Saturday and the remaining races on Sunday.\n\nAfter the fleet races, the top three ranked teams on points will proceed into a winner-takes-all final to decide the winner.\n\nThe New Zealand and UK boats practising off Fremantle on Tuesday. (ABC News: Andrew O'Connor)\n\nThe event grand final will take place in Abu Dhabi on the weekend of November 28-29, pitting the top three ranked teams of the year against each other to crown the overall champion.\n\nThe prize pool on offer this season is more than $19 million, with the winner of each of the 13 events collecting almost $600,000.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-14/asx-markets-business-live-news/106227246",
        "title": "Live: Trump unleashes again on 'that jerk' Powell, ASX falls back",
        "publish_date": "Tue, 13 Jan 2026 20:48:22 +0000",
        "category": "finance",
        "authors": [
            "Yiying Li",
            "David Chau"
        ],
        "text": "You can read the full statement from Reserve Bank governor Michele Bullock and her central bank counterparts here.\n\nIt's quite a short and powerful one.\n\nIt's also a rare example of apolitical organisations weighing into politics!\n\nEssentially, they're asking the US government to respect the Federal Reserve's independence, \"the rule of law\" and \"democratic accountability\".\n\nIt's clear they don't support the politicised prosecution of US Fed chair Jerome Powell.\n\nAt the bottom of the statement it says: \"Other central banks may be added to the list of signatories later on\".\n\nIndeed, the Reserve Bank of New Zealand's governor Anna Breman was a later addition.\n\nHer name was not on the initial list of signatories when the statement was published late yesterday.\n\nIt will be interesting to see how many more (and which) central bank governors add their names to the list — and risk incurring the wrath of the Trump administration.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-14/aleksandar-vukic-takes-down-stefanos-tsitsipas-in-adelaide/106227180",
        "title": "Aussies roar in Adelaide as former Aus Open finalist continues slide",
        "publish_date": "Tue, 13 Jan 2026 20:46:07 +0000",
        "category": "sports",
        "authors": [],
        "text": "Inspired qualifier Aleksandar Vukic is savouring one of the biggest wins of his late-blooming career after dumping former Australian Open finalist Stefanos Tsitsipas from the Adelaide International.\n\nVukic held his nerve and serve when it mattered most to carve out a rousing 7-6(7/3), 7-6(7/5) victory over the Greek superstar to complete a banner day for the home hopes at Memorial Drive.\n\nIn a rare match of no service breaks, Vukic was clutch in both tiebreakers to join Rinky Hijikata and hometown hero Thanasi Kokkinakis in the last 16 of the Australian Open tune-up.\n\nJoint beats former Australian Open champion Maya Joint breaks through for her first win of the season to set up an all-Australian second-round showdown against Ajla Tomljanović at the Adelaide International.\n\nThe 29-year-old said he fed off the energy of the crowd to pull through.\n\n\"I was talking to my team today and I'm just in awe of this stadium and the [Adelaide Oval] cricket ground that's just there,\" Vukic said.\n\n\"It's my first time experiencing that as well, going inside there, and the centre court's very special.\n\n\"To see everyone here — it's pretty packed — so I appreciate the support, appreciate them helping me out tonight and it was an awesome win for me.\"\n\nVukic attributed his great start to the new season to his breakout year in 2025, when he debuted for Australia's Davis Cup team at age 29.\n\n\"It's been awesome,\" he said.\n\n\"I'm about to hit 30, but I feel like I'm at my peak. It's only going to get better.\"\n\nOn the flip side, 27-year-old Tsitsipasis is enduring his worst run in years.\n\nIn November, Stefanos Tsitsipas fell out of the top 30 for the first time since 2018. (Getty Images: Mark Brake)\n\nThe former world number three has been a regular in the top rankings since 2018 but fell out of the top 20 in June and out of the top 30 in November to sit 33rd coming into the Australian Open.\n\nIt seems a lifetime ago that he reached the 2023 final in Melbourne, much less his run to the 2021 French Open final, where he took the first two sets only to lose in five to Novak Djokovic.\n\nVukic's reward for taking out the seventh seed is a clash with fellow qualifier Andrea Vavassori for a place in the quarterfinals.\n\nEarlier, Rinky Hijikata won an all-Australian shootout to earn a date with top seed Alejandro Davidovich Fokina.\n\nHijikata struck eight aces and 25 winners to see off wildcard compatriot Tristan Schoolkate 6-4, 6-4 in just 79 minutes.\n\nDespite the straight-sets result, Hijikata said he never really enjoyed facing a countryman, especially a higher-ranked one.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nSchoolkate is ranked 97th in the world, 18 spots above Hijikata.\n\n\"Tristan's had one hell of a year and I'm super-pumped to see him starting the year in the top 100 — I've got a bit of catching up [to do] this year,\" Hijikata said.\n\nKokkinakis remains in doubt for his second-round clash on Wednesday with Monaco''s fifth seed Valentin Vacherot after suffering yet another injury in his tenacious three-set victory over Sebastian Korda on Monday night.\n\nThe luckless 29-year-old carried a painful shoulder problem throughout the match.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-14/op-shops-call-for-unsellable-donations-to-stop/106219984",
        "title": "Op shops are calling for people to think before they donate",
        "publish_date": "Tue, 13 Jan 2026 20:06:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "One person's trash is often another's treasure, and with the holiday period wrapping up, op shops are being inundated with donations from annual wardrobe purges and unwanted Christmas gifts.\n\nBut not all donations end up on the racks.\n\nCharities have issued a plea for people to be mindful of what they are donating, with staff saying many donated items are unusable.\n\n\"[We don't take] baby trolleys, helmets, baby seats for the car, microwaves and electronics,\" South West area manager for St Vincent de Paul Society Ari Jadi said.\n\n\"Most of them we don't accept because we have to re-tag it before we are able to resell it — it's a health and safety issue.\"\n\nAri Jadi loads an unwanted oil heater into a skip bin. Vinnies does not take electrical items. (ABC Riverina: Andrew Mangelsdorf)\n\nMr Jadi said people often just dumped rubbish, or they left good donations outside full bins in the elements.\n\n\"During this period of time, it's a lot, especially in Wagga. There's general waste that gets picked up every day, and we have a really massive red bin in there, and it's so full, sometimes they pick it up twice a day,\" he said.\n\n\"We cannot salvage those donations.\"\n\nEvery year, 310,000 tonnes of clothing items are donated to op shops.\n\nMore than 43,000 tonnes of those donations are unusable and cannot be commercially recycled in Australia.\n\nThey end up in landfill, according to the 2024-25 Charitable Reuse Australia Clothing Reuse Export Accreditation Scheme.\n\nVinnies' rubbish bins are often overflowing with unusable items. (ABC Riverina: Andrew Mangelsdorf)\n\nWhile Vinnies makes use of some textiles unfit for resale to create rugs, throws, mats, towels, and door runners in its re/CYCLE program, it is only a small portion of the number of unsellable items it receives.\n\nHowever, while certain objects may not be allowed in op shops, there are community groups that are filling those gaps.\n\nCommunity-led charities\n\nMichelle Bordignon says donations to those in need should be in good condition. (ABC Riverina: Nicola Ceccato)\n\nMichelle Bordignon, a resident in the western Riverina city of Griffith, has been running the Helping Hands charity for nine years.\n\nShe collects second-hand goods from the community and works with local organisations to distribute items to those in need.\n\nMattresses, prams or microwaves — which are often not accepted by op shops — are accepted by Helping Hands.\n\nGriffith Helping Hands receives so many donations, its shed is always packed. (Supplied: Michelle Bordignon)\n\nHowever, the charity was still prone to large amounts of unwanted items, sometimes left outside her home or the shed where she kept donations.\n\n\"Second-hand underwear, please, we don't want that,\" Ms Bordignon said.\n\n\"I get a lot of men's work clothes that are ripped and covered in paint, and honestly, I can't really move them on to anyone either, so anything broken, ripped, covered in animal fur all has to go in the bin.\n\n\"I don't have a very big [bin], and when that's full, I have to go out to the tip myself.\"\n\nMs Bordignon said she had seen firsthand the impact that good-quality donations could have on people.\n\n\"Beautiful donations that are in great condition, it boosts people's lives by getting that — you don't give rubbish to people, especially someone who's doing it tough,\" Ms Bordignon said.\n\nOverflowing donation bins\n\nAri Jadi advises against leaving donations outside the store when it is closed. (ABC Riverina: Andrew Mangelsdorf)\n\nMr Jadi said Vinnies had to increase its bins in some areas due to the continuous donations it received, especially during the Christmas break.\n\nHowever, it had led people to place bags of donations outside the bins when they were overflowing, leaving them out in the weather to get ruined and rummaged through.\n\nA donation bin sits overflowing outside Micah House in Wagga Wagga. (Supplied: St Vincent's Wagga)\n\nSome op shops, like Wagga Wagga's Anglicare, have found that security cameras have deterred illegal dumping or rummaging.\n\n\"We started off getting security cameras a couple of years ago because we were robbed and we had some people come in and steal the volunteers' bags,\" a spokesperson for the Anglicare Op Shop in Wagga Wagga said.\n\n\"From there, we got security cameras in the shop. Then we noticed that there was a switch, and people would come in and see the security cameras, and they wouldn't dump things as well.\"\n\nThe spokesperson said this Christmas marked the first time they had come back from holidays to find no dumped donations at the back door.\n\nIn the meantime, Mr Jadi said if people were going to donate, they should follow one simple rule.\n\n\"If you would give it to a mate, then it's OK to donate to us.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-14/ways-to-reduce-exposure-to-microplastics-at-home-/106128692",
        "title": "Air-drying laundry, wooden chopping boards: Reducing exposure to microplastics at home",
        "publish_date": "Tue, 13 Jan 2026 20:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "If you're feeling concerned about microplastics, it can be hard to know what to do about them. After all, aren't they everywhere?\n\n\"We are constantly exposed to microplastics and nanoplastics, even smaller particles,\" Cassandra Rauert says.\n\n\"We really don't have a good understanding of any links to potential health outcomes,\" the senior research fellow at The University of Queensland says.\n\nEnvironmental researcher and research fellow at The University of Queensland, Elvis Okoffo, says microplastics and nanoplastics are a \"very new area\" and a lot of research is being undertaken to understand how they behave in our bodies.\n\nBut, if you want to reduce your exposure as a precautionary measure, researchers say there are simple ways to do this at home.\n\nChopping boards, cooking utensils and water bottles\n\nEnvironmental chemist and Macquarie University Research fellow Yunlong Luo says if you're applying heat, heavy friction or strong chemicals to plastic, \"there's a good chance it's breaking down and releasing particles\".\n\nWith this in mind, Dr Luo says it might make sense to swap items that get this kind of use for alternative materials, for example, plastic cutting boards for wooden ones.\n\nNew research points to need for microplastic filters in dishwashers New research has found cleaning plastic containers in the dishwasher is actually a source of microplastic pollution.\n\nDr Rauert says she uses wooden chopping boards and cooking utensils instead of plastic as it's an \"easy swap\" to make.\n\nDr Okoffo also suggests trading plastic chopping boards for alternatives, such as silicone or wood.\n\nWhere possible, he recommends choosing different materials such as metal water bottles, wooden utensils and glass containers.\n\nIf you do have plastic water bottles, avoid leaving them in a hot car or direct sunlight, Dr Okoffo says.\n\nPlastic containers\n\nDr Okoffo avoids microwaving plastics whenever possible, \"especially if they're reused, old, or scratched\".\n\nThis is because \"temperature actually plays a major role\" in the release of microplastics and chemicals.\n\nInstead, he says to move leftovers into ceramic or glass before microwaving or consider trading your plastic containers for glass or ceramic options.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nDr Rauert says she minimises the amount of plastic food containers she uses, and doesn't put plastic in the microwave.\n\n\"Cheaper plastic containers do shed a lot of plastic, and it's worse when you put hot food in them.\"\n\nBecause of this, Dr Okoffo recommends waiting for food to cool down before putting it in a plastic container.\n\nHe also suggests handwashing plastics, because conditions in the dishwasher — the high temperature and detergent — aid the release of plastic particles from containers.\n\nHandwashing plastic containers still releases particles, he notes, so it's a case of reduction rather than removal.\n\nChemicals in plastic containers can also potentially leak or migrate into food, \"especially when containers are used in ways they're not supposed to be\", Dr Okoffo says.\n\nRecent research shows washing plastic containers in dishwashers at high temperatures causes those items to shed micro and nano-sized plastic particles. (Supplied: Adobe Stock)\n\nThe kettle\n\nOne of the authors of a recent study into the release of microplastics and nanoplastics from plastic kettles, Dr Okoffo, says these appliances are another source of exposure for many of us.\n\nThe highest levels of plastics were detected in water after the first few boils of a new plastic kettle, but research found that \"the plastic concentration reduced drastically\" from 50 to 150 boils, he says.\n\nOne of the study's recommendations is for manufacturers to let consumers know to boil the kettle and discard the contents before using it, rather than simply rinsing it.\n\nDr Okoffo says cost is undeniably a factor and \"people will still definitely go for the plastic kettle\", but the research did lead him to upgrade from a plastic kettle to a more expensive stainless steel option at home.\n\nThe clothes dryer\n\n\"One of the major sources of plastics into the environment is from synthetic clothing,\" Dr Okoffo says.\n\nLaundry is a top source of microplastic pollution Clothes shed microfibres while they are manufactured, worn and disposed of, but especially when they are washed. A single wash load can release several million microfibres — but you can decrease this by changing your technique.\n\nDr Luo says clothes dryers can be a \"significant source\" of microfibres at home and \"air drying clothes is a great way to cut down on this\".\n\nDr Rauert agrees and says there are also vented clothes dryers (that expel humid air outside the house using a vent), which will mean more particles will go outside.\n\nShe also looks for natural fibres over synthetics, where possible, when shopping for new clothes.\n\nDusting and mopping\n\nCleaning can also help reduce microplastics, according to Dr Rauert and Dr Luo, as well as some of the chemicals used to make plastics, which can also \"settle into the dust\".\n\nDr Luo says using a damp cloth to wipe surfaces and vacuuming and mopping floors is likely to help minimise the tiny particles in the dust at home.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-14/jack-doohan-released-by-alpine-f1-team/106227130",
        "title": "Australian driver released by battling F1 team in 'mutual decision'",
        "publish_date": "Tue, 13 Jan 2026 19:48:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "It took Jack Doohan 13 years to earn a seat in Formula 1 and 150 days to have it taken away.\n\nThe latter process has reached an inevitable conclusion with the Australian departing the Alpine Formula 1 ‍team to \"pursue other career opportunities\".\n\nDoohan, whose father is five-time motorcycle GP champion Mick Doohan, began racing karts at 12 and was chosen to be a driver for Alpine at the start of the 2025 season.\n\nHe had made his debut the previous year after being with the team in the academy, as a test driver, then reserve.\n\nHowever, after six races, two of which he failed to finish, Alpine dropped Doohan, replacing him with Franco Colapinto.\n\nDoohan's best finish was 13th at the Chinese Grand Prix ‍in March. He crashed on the first lap in the rain-hit season-opening Australian GP at Melbourne and in Miami, his last GP for Alpine.\n\nThe Queenslander was still under contract but the team said it reached a \"mutual agreement\" that releases him for the 2026 season onwards.\n\nAlpine finished last among the 10 teams in the F1 constructors' standings, with the switch to Colapinto not a clear success.\n\nThe Argentine did not crash in the 17 grands prix he started but nor did he gain a point, with his best finish being 11th.\n\nHowever, he did outperform teammate Pierre Gasly, who scored all Alpine's 22 points, six times.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nDoohan failed to beat the Frenchman and lapped slower by approximately 0.17 to 0.50 seconds in the three races where neither driver retired.\n\nOn his demotion, Alpine said Doohan was \"still an integral part of the team\" and he continued to work with them ​as ​a test ​driver and a reserve.\n\nDoohan said at the time: \"I am very proud to have achieved my lifelong ambition to be a professional Formula One driver and I will forever be grateful to the team for helping me achieve this dream.\n\n\"Obviously, this latest chapter is a tough one to take because, as a professional driver, I want to be racing.\"\n\nThe desire to be racing, rather than testing, may well be behind his departure.\n\nAt 22, Doohan is young enough to have plenty of other opportunities in motor racing, though maybe not immediately in F1.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-14/puppy-donated-kingaroy-op-shop-vinnies/106224226",
        "title": "Puppy left in cooler bag at a regional op shop adopted by volunteer",
        "publish_date": "Tue, 13 Jan 2026 19:44:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Vinnies volunteer Corrie Johnston sorts through donations of mouldy clothing, books, even second-hand sex toys, but finding a live puppy at the shop's door was a first.\n\n\"He just looked terrified, the poor little thing was so scared,\" she said.\n\nThree months ago, she discovered the chihuahua-cross while on shift at the Kingaroy op shop, about 200 kilometres north-west of Brisbane.\n\nVinnies volunteer Corrie Johnston discovered a chihuahua in a donated cooler bag. (Supplied: St Vincent de Paul Society Queensland)\n\nShe recalled the front counter buzzer ringing furiously while she was out the back.\n\n\"I was yelling out, 'I'm coming' and a lady was standing there really upset, who had walked in with a bag she had spotted in the crate [donation bin] outside the shop,\" Ms Johnston said.\n\n\"The lady said she could hear a puppy cry [in the bag] but couldn't see anything.\"\n\nMs Johnston flipped open the cooler bag to find a tiny puppy, shivering on a blue blanket.\n\nShe gave the puppy some water while other volunteers in the shop tried to find the anonymous donor, to no luck.\n\n\"Eventually we thought we're going to have to give him a name,\" Ms Johnston said.\n\nThere was only one name that came to mind.\n\n\"I thought Vinnie, for Vinnies.\"\n\nAnimal donations rare\n\nVinnies Queensland general manager Drew Eide urged people not to donate pets or live animals to op shops, which were not equipped to be rescue shelters.\n\nHe said live animals were the \"strangest and most concerning\" donations the shops received.\n\n\"It's not common,\" he said.\n\n\"In Cairns we had two live kittens donated a few years back — thankfully they were rescued and adopted.\"\n\nVinnies Queensland general manager Drew Eide, left, with employees at the Acacia Ridge op shop. (Supplied: Vinnies Queensland)\n\nMr Eide said a Vinnies shop in north Queensland had received a Christmas ham, which fortunately was given away quickly.\n\n\"Not the kind of present you want to come back to after it's been sitting in a bag in 30-plus degree weather.\"\n\nVinnie's new home\n\nMs Johnston said Vinnie's situation was a lucky one that could have gone terribly wrong.\n\nMinutes after the puppy was discovered, another customer slung four heavy garbage bags into the donation crate, she said.\n\n\"If he'd been in that crate, they would have killed him,\" the volunteer of nearly four years said.\n\n\"But I am really grateful … that instead of dumping him on the side of the road, they left him where someone could find him.\"\n\nVinnie with other chihuahua puppies at his new home. (Supplied: Corrie Johnston)\n\nMs Johnston, who already owns three chihuahuas, said there was no question about where Vinnie's new home would be.\n\n\"I couldn't turn him away, as soon as I saw his little face,\" Ms Johnston said.\n\nSeveral months later, Vinnie is a \"happy chappy\" settling in with his siblings.\n\n\"It gets a little rambunctious. He plays because he's still a puppy and they're now adults,\" Ms Johnston laughed.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/three-men-one-jersey-the-high-stakes-fight-for-the-reds-no-10-20260113-p5ntkl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inside the high-stakes battle which can make or break Wallabies’ World Cup hopes",
        "publish_date": "Wed, 14 Jan 2026 13:12:56 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Wallabies five-eighth Tom Lynagh says the logjam of Australia’s No.10s will not be to the derailment of their Test ambitions, as he prepares for a three-way battle for the job at clubland.\n\nHaving missed the end-of-year spring tour in a bid to overcome a host of injury concerns, Lynagh returns to the Queensland Reds fresh and eager to stave off challenges from fellow international playmaker Carter Gordon and rising sensation Harry McLaughlin-Phillips.\n\nGordon’s arrival at Ballymore after an ill-fated NRL stint with the Gold Coast Titans – one marred by a serious neck issue which kept him to just one game – drew criticism from some rugby circles given the Reds now face the prospect of not being able to field a Wallabies’ contender each week.\n\nTom Lynagh has supported the move for Carter Gordon to join the Queensland Reds. Credit: Getty Images\n\nAustralia has also failed to find a consistent chief to spearhead the side – Lynagh, Gordon, Tane Edmed and James O’Connor have all been used since Noah Lolesio’s Japan defection, while Donaldson has remained around the squad.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/kyrgios-entertains-melbourne-crowd-in-spectacular-win-20260114-p5ntvy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kyrgios entertains Melbourne crowd in spectacular win",
        "publish_date": "Wed, 14 Jan 2026 13:03:35 +1100",
        "category": "sports",
        "authors": [],
        "text": "Kyrgios entertains Melbourne crowd in spectacular win\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/aussie-teen-scores-on-debut-20260114-p5ntzf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie teen scores on debut",
        "publish_date": "Wed, 14 Jan 2026 12:43:00 +1100",
        "category": "sports",
        "authors": [],
        "text": "Aussie teen scores on debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/viral-video-shows-sneaky-parking-hack-20260114-p5ntzm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Viral video shows sneaky parking hack",
        "publish_date": "Wed, 14 Jan 2026 12:42:57 +1100",
        "category": "finance",
        "authors": [],
        "text": "Viral video shows sneaky parking hack\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/major-mistake-causes-boat-to-drift-away-20260112-p5ntio.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Major mistake causes boat to drift away",
        "publish_date": "Wed, 14 Jan 2026 12:20:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Major mistake causes boat to drift away\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/smith-snubs-pga-tour-offer-to-stick-with-liv-20260114-p5ntza.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Smith snubs PGA Tour offer to stick with LIV",
        "publish_date": "Wed, 14 Jan 2026 12:13:23 +1100",
        "category": "sports",
        "authors": [],
        "text": "Smith snubs PGA Tour offer to stick with LIV\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/ousted-writer-launches-defamation-action-against-south-australian-premier-20260114-p5ntxg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ousted writer launches defamation action against South Australian premier",
        "publish_date": "Wed, 14 Jan 2026 12:05:59 +1100",
        "category": "entertainment",
        "authors": [
            "Kerrie O'Brien"
        ],
        "text": "The Palestinian-Australian writer removed from Adelaide Writers’ Week by the Adelaide Festival board says she is taking legal action against the South Australian premier, accusing him of defamation.\n\nDr Randa Abdel-Fattah said on Wednesday that her lawyers had sent a concerns notice to Peter Malinauskas over comments he made at a news conference on Tuesday.\n\nAcademic and writer Dr Randa Abdel-Fattah.\n\nHer legal action comes after a dramatic few days in South Australia, with the cancellation on Tuesday of Adelaide Writers’ Week, and the resignation of its director Louise Adler, after 180 authors quit the line-up following a decision by members of the Adelaide Festival board to remove the academic from the literary festival’s program.\n\nThe Adelaide Festival board announced last week that while it was not suggesting “in any way” that Abdel-Fattah or her writing had any connection with the Bondi attack, given her past statements, “it would not be culturally sensitive to continue to program her at this unprecedented time so soon after Bondi”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/gadecki-takes-first-set-over-former-open-champ-20260114-p5ntz4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gadecki takes first set over former Open champ",
        "publish_date": "Wed, 14 Jan 2026 12:03:22 +1100",
        "category": "sports",
        "authors": [],
        "text": "Gadecki takes first set over former Open champ\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/victoria/that-s-hazardous-without-a-shadow-of-a-doubt-long-grass-beside-the-hume-freeway-before-longwood-fire-20260113-p5ntln.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘That’s hazardous, without a shadow of a doubt’: Long grass beside the Hume Freeway before Longwood fire",
        "publish_date": "Wed, 14 Jan 2026 12:01:52 +1100",
        "category": "finance",
        "authors": [
            "Rachel Eddie",
            "Kieran Rooney"
        ],
        "text": "“You could have mown your front yard, and it still would have burnt [Friday] under [Friday’s] conditions. So yes, we did see fires spread very rapidly along road sides, but I would expect that under those conditions, just like it did in bushland and across paddocks and the likes.” Victoria endured temperatures above 40 degrees last week. CFA Volunteer Group vice president Brad Marson, captain of the Grassdale brigade who fought the Natimuk fire, said the longer grass was hazardous. The volunteer group was established last year to raise the plight of CFA volunteers. The CFA is investigating how last week’s Longwood bushfire started. Credit: Jason South He said fires could spark from roads, such as through popped tyres, even when the verge was freshly mowed.\n\n“It just takes away a bit of risk,” Marson said. He said it was more difficult to get on top of such a fire if the grass was longer, and described the Hume verge as being poorly maintained with too much fuel. Loading “That’s hazardous, without a shadow of a doubt.” Roadside fire management guidelines from the CFA said strategies to limit this risk could include pull-over lanes or shoulders to separate sparks on the road from grass.\n\nWhere there is a slashed verge next to the road shoulder, the guidelines said grass should be maintained at 10 centimetres during the fire danger period. This is limited by weather conditions, the document noted, given grass slashing creates possible sparks, and regrowth reduces its effectiveness over time. While fire spreads about as quickly in slashed grass as standing grass, the flame height is approximately halved. This makes suppression more achievable if responded to quickly, the document states. “When fire danger is high, regardless of fuel management, a fire is likely to leave the reserve in a matter of minutes,” it acknowledged.\n\nPremier Jacinta Allan’s media event in Alexandra on Tuesday was disrupted by angry members of the public. Allan was heckled by a woman who claimed the CFA was underfunded. “Shame on you, shame on your government for what you’ve done,” the woman said, according to Nine News. Nine News reported a group of locals tried to corner the premier’s car at the press conference, but they appeared to have the wrong vehicle. Arson investigators outside Longwood, near where the fire started. Credit: Grant McArthur Allan said claims of underfunding were false and that peddling incorrect information could add stress to fire-traumatised communities.\n\nThe Longwood fire, which threatened Alexandra, has torn through 137,000 hectares, destroyed 90 homes and left one dead. The body of Maxwell Hobson was found 100 metres from a burnt-out vehicle that had run off the road in Gobur, between Yarck and Merton, on Sunday. The coroner is investigating his death. In 2013, the government created a map and risk assessment document that examined the bushfire danger across Victoria’s arterial road network to reduce vegetation in areas of the greatest need. Thick smoke blanketed Yea on Friday as the fire raged out of control. Credit: Eddie Jim That document is now receiving its first significant update, with tenders released in July 2025, to develop a new assessment that is likely to take three years.\n\nThe tender documents note that existing analysis of the roadside fire risk is now 12 years old and does not contemplate newer parts of the road network, changes to the environment and the effect of disasters like the 2019-20 bushfires and 2022 floods. Back in 2018, the CFA aired concerns about 2000 kilometres worth of flexible wire rope barriers installed along country roads to prevent head-on and run-off-road crashes. The agency made clear it supported the barriers to save lives, but insisted vegetation would need to be maintained. Loading The CFA was raising its “interest in ensuring the management of fuel loads on road reserves”, it said in a statement in 2018. Road barrier systems have breaks to allow for roadside maintenance.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/art-and-design/from-counter-culture-to-suburban-nudes-melbourne-lives-captured-through-a-lens-20251117-p5nfye.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From counter-culture to suburban nudes: Melbourne lives captured through a lens",
        "publish_date": "Wed, 14 Jan 2026 11:31:00 +1100",
        "category": "entertainment",
        "authors": [
            "Kerrie O'Brien"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size A naked couple sits on a mattress in the backyard of a terrace house, reading the newspaper, their backs to the camera. A motorbike and an assortment of pushbikes lean on the wall, a garden hose curls near an old drain, and dog’s water bowl suggests there’s an absent pet somewhere nearby. It’s a gloriously evocative black-and-white photograph by Ponch Hawkes, typical of her work in the 1970s. Australia was undergoing a metamorphosis, emerging from decades of conservative government. Radical change was underway, with women’s rights, second-wave feminism and sexual liberation in full swing. Hawkes documented those heady times and continues to do so, five decades on. Turning 80 next year, the acclaimed photographer is busier than ever, preparing for an exhibition of her paintings – a recent reacquaintance with the medium has turned into an obsession – and a survey show planned at the Museum of Australian Photography for winter 2028. Ponch Hawkes’ No title (Summer night in the backyard at Falconer Street), circa 1975. Credit: Courtesy of the NGV Her images appear in the newly published Circus Oz: From the Pram to the World Stage, and she features in the documentary The Language of Light about seven Australian photographers on SBS on Demand. Some of her 1970s work is showcased at the NGV, in Women Photographers 1900-1975: A Legacy of Light. Her shots document that heady time and illustrate the changing social dynamics, capturing everyday moments like the above in communal houses, graffiti demanding childcare and social housing, protests about gay rights and women’s liberation and a whole lot more. The images seem very uncurated, I say. “We were uncurated,” she says. “We were all so incredibly happy with ourselves. We all thought we were so fabulous.”\n\nAdvertisement\n\n“It was punk, not in the sense of the Sex Pistols, but everybody was having a go at everything, trying out being a filmmaker or a writer or an artist or a photographer, in my case. With an overlay of social action and community giving and receiving.” Places like the Pram Factory, La Mama and Circus Oz were in their infancy – the latter and its community remains a big part of her life; she was at a barbecue fundraiser for the rock’n’roll circus recently. “I didn’t ever do the trapeze but we all tried to learn to do things. The thing is, I had strength but no grace whatsoever,” she says of its early days. Ponch Hawkes has been documenting our lives for five decades. Credit: Chris Hopkins One of the teachers was in traditional circus, which came with a particular type of training. “You’re up hanging off a rope and she’d happily let you wear the skin away, to see if you’re tough enough, which I wasn’t, really.” Hawkes says it felt like the golden age: “Whitlam was in, the economy was in good shape, there was full employment, rent was really cheap, interest rates were low-ish and so there was money for the arts.” ”We were turning people away – everything we did was completely sold out. I went on tour in a band with five other women, to schools and all sorts of incredible venues, doing a show about women’s work, for which we had posters ... in different languages, so if we performed at a factory, people would know what we were doing... bold things like that.”\n\nAdvertisement\n\nShe contributed to Digger magazine, the short-lived but impactful counter-culture mag that focused on politics, sex, drugs and rock’n’roll. Several of the images in the NGV show were first published in it, as was the essay that led to Helen Garner’s sacking as a teacher, for speaking with her high school students about sex. We’re dining at Hawkes’ favourite local, Matsuya, a Japanese restaurant in Fairfield. It’s quiet and comfortable and the staff welcome her warmly. She orders the vegetable tempura with a side of horenso (cold spinach with sesame dressing, much more delicious than it sounds), while I opt for the deluxe bento box; we share the gyoza to start, plus Japanese tea. Our photographer Chris Hopkins arrives and soon takes Hawkes outside to get a portrait shot, despite it being a wild and woolly day. “I’m ready for lunch, but am I ready for you?” she quips as they head outside. Ponch Hawkes. Credit: Chris Hopkins When she gets back, I wonder if she took a peek at the pics? No. (Later, when she sees his fabulous shot with her hair seeming to stand on end, she’s impressed and hopes we publish it.) Often, Hawkes interviews people before shooting them. Everybody’s got a story, she says. “You get a sense of what that story might be. Also, if it’s a portrait and they need to present really well, sometimes people are really direct and go, ‘Oh no, I look terrible from that side’ – especially actors. But most people are completely unaware of how they present, so they’re really trusting you for a portrait.” That degree of trust is a big part of what she does, perhaps best illustrated by her recent 500 Strong series, which features 500 women over the age of 50 photographed naked.\n\nAdvertisement\n\nSome use props to cover their faces, many grin, smile or gaze happily into the camera; all show bodies of all shapes and sizes. It’s an extraordinary body of work and continues to tour around the country. “I’ve done a lot of projects about good and worthy subjects, but this is the only one I’ve ever done that’s actually made real change,” she says. “Hardly a day goes by that I don’t run into someone, or someone writes me an email or a letter saying how differently they feel about things since they did the project or saw the project. It’s really moving.” Born and raised in Abbotsford, Hawkes had three siblings; her dad was a laundryman at Abbotsford Convent and her mum sometimes worked as a cook in pubs. Part of a panel of 500 Strong. Credit: Ponch Hawkes Her dad played in the reserves for Collingwood and later trained local footy clubs; his family all played local footy, “they were big, strapping men”. Now a self-confessed diehard Collingwood fan, she didn’t re-engage with footy until later in life. “I can’t remember what it was but I became fully engaged,” she laughs, even writing a spirited defence of Mason Cox when he was attacked in an online supporters group. Her miniature poodle wears a Pies jumper in a pic on her phone and her membership for the next season has just arrived in the mail. Being a Collingwood supporter means you commune with fellow supporters, “no matter where they come from – that’s what tribes are about”.\n\nAdvertisement\n\nWe’re both thrilled to see women playing Australian Rules, finally, even though the physicality of the game can mean it’s sometimes hard to watch. “Because we’re so unused to seeing girls tackle other girls or go in head-first or slam into people or do all the things we’re used to in AFL. That’s one of the reasons we love it so much, it’s such a brutal bloody sport.“ Footy chat brings us to Helen Garner’s wonderful book The Season, about her grandson and his local team. “That book made me feel glad to be alive and Helen’s books aren’t always like that... [it] was so full of joy. I just completely love her, she’s such a brilliant writer.” Helen and Gwen 1976, from the series Our mums and us by Ponch Hawkes. Credit: Ponch Hawkes/Museum of Australian Photography I find out over lunch that it’s actually a young Garner in that photo described at the beginning of this piece. She also features in Hawke’s series Our Mums and Us, which features mothers and their daughters photographed at their homes. It’s a wonderful snapshot of time, borne out of the realisation “that your mother was not just your mother, she was a person in her own right”. In 1976, it became her first exhibition. There are many similarities between their work: social realism and making art by documenting our lives, an incredible eye for detail, and a commitment to truth-telling.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/like-dr-frankenstein-we-built-a-monster-this-is-the-ultimate-tennis-player-20260110-p5nt1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Like Dr Frankenstein, we built a monster. This is the ultimate tennis player",
        "publish_date": "Wed, 14 Jan 2026 11:30:00 +1100",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "“When he hits stronger than you, puts everything in the court, runs definitely not slower than you, [and] serves not worse than you, it’s tough to beat him,” Medvedev said.\n\nAlcaraz’s peers are a little more circumspect in their praise, but former world No.1 Daniil Medvedev admitted last week, when asked about the current dominance of the pair, that the gap the top two ranked male players had opened up would be difficult to close.\n\n“I have never seen tennis played like that – he is a virtuoso,” McNamee said.\n\nAustralian tennis great Paul McNamee even goes as far as saying Alcaraz is the best all-round player the world has ever seen.\n\nOf course, in men’s tennis, Jannik Sinner and Carlos Alcaraz are getting close.\n\nAdd articles to your saved list and come back to them any time.\n\nWho has the best forehand, backhand or serve on tour? Who excels at the net? Who handles the pressure best? Who returns serve the best? Does someone have a scary drop shot? Who is the fittest player on tour? And who can do the impossible if required?\n\nBy bringing together the biggest weapons of players competing in this year’s Australian Open to create the complete tennis player, we reveal where the real on-court battles will be happening when the best meet the best in the next fortnight.\n\nAryna Sabalenka, the world No.1, has always had power. Now her touch game is improving and, although she may not be considered the best in the world at any specific shot, her all-round game makes her tough to beat.\n\nIn women’s tennis, the gap between the top 10 players is tight, but there are still those with certain skills far beyond their peers’.\n\nIt’s no surprise they are dominant in almost every category.\n\nWhy can some players serve better than others? Tennis Australia analyst Simon Rea says there are many variables, but one is essential: “Being biomechanically efficient on serve is a massive part of the equation.”\n\nThe fact he is ranked outside the top 50 (he reached No.29 in February 2025) shows other parts of his game need improvement, but that serve… if you blink, you miss it. The USA’s Ben Shelton and Italy’s Matteo Berrettini also possess brutal serves, but Mpetshi Perricard has one of the fastest serves ever recorded.\n\nThe 22-year-old Frenchman’s first serve would get a speeding fine on the Autobahn. He averages 215km/h as he rifles the ball at his opponent from a great height, given he stands 201 centimetres tall. He wins half his first-serve points without having to play another shot, given reading whether the ball is heading to the T, the body or out wide is so tough for his opponents.\n\nIf Nick Kyrgios was handed, and accepted, a wildcard to the Australian Open, he would have got the nod here as his peers rate him leagues ahead of the rest when it comes to serving. But he won’t be playing singles at Melbourne Park, so Mpetshi Perricard gets the nod.\n\nWe crunched the numbers and canvassed expert views to build the best men’s and women’s player on tour and playing at this year’s Australian Open.\n\nLook out if Alcaraz charges the net. Bulgaria’s Grigor Dimitrov, France’s Adrian Mannarino and America’s Tommy Paul are also particularly dangerous at the net.\n\nHis athleticism and skill combines well with his aggressive attitude when it comes to volleying. He can defend, smother or attack, depending on his opponent’s ability.\n\n“You have got to understand the magic of what he brings to the sport,” McNamee said.\n\nBut McNamee said the category Alcaraz dominates is the all-round player category, with Novak Djokovic saying midway through 2023 that the young Spaniard had taken the best elements of him, Nadal and Roger Federer to develop the complete game.\n\n“Carlos can hit a blinding forehand, then with the same grip in the next instant you will get an exquisite drop shot. No one has got the adaptability and versatility and control in all aspects of the game,” McNamee said.\n\nHe said Rafael Nadal’s forehand was better but Alcaraz’s ability to switch gears is exhilarating.\n\n“The package is so extraordinary. [He has a] great forehand, excellent backhand, [and a] top serve,” McNamee said.\n\nAlcaraz and Sinner have taken the forehand to a new level, but Alcaraz deserves the accolade. He has a classical forehand shape, which allows him creativity, flexibility and multiple options when choosing place, speed and spin.\n\nBest backhand: Jannik Sinner (Italy)\n\nThere was no argument here, as Sinner’s backhand is unparalleled. Even Alcaraz has no doubt his rival has the edge; however, he did defend his own backhand in Seoul last Friday before an exhibition match against Sinner. “I think my backhand is not that bad. I can use it even more than a forehand in a match.” Alcaraz said.\n\nRea agrees that the difference between the two on the backhand is not as big as it may have once seemed. “The backhand-to-backhand battle from the back of the court might give the edge to Sinner, [however] Alcaraz has got the ability to have more variety from his backhand side and change gears a little bit,” Rea said.\n\nWhat has impressed experts most about Sinner’s ground strokes is his clean ball striking and consistency, which has been on display from the moment he began contending for grand slam titles in 2020. “On Sinner’s forehand and backhand side, his speed has incrementally increased year-on-year. It’s normally hard to increase speed and spin at the same time because there is a trade-off there… but he is doing both at the same time, which makes him impossibly heavy to handle at the other end,” Rea said.\n\nMcNamee rated Djokovic as the man with the second-best backhand in world tennis, but Sinner’s is numero uno. “It’s pure,” McNamee said. “The backhand is [Sinner’s] best shot.”\n\nBest drop shot: Carlos Alcaraz (Spain)\n\nFinesse is not normally the first word that comes to mind when Alcaraz is mentioned, but his drop shot is top-notch. He can deploy a slice backhand and has added the drop shot to his game to keep his opponents guessing and running.\n\nAlcaraz’s ability to move around the court is unparallelled.\n\nBest return of serve: Jannik Sinner (Italy)\n\nSinner just gets the nod over Djokovic. Both return serve better than a comedian facing a heckler.\n\nAs for alternatives, Draper adds variety to the conversation. The tall left-handed Brit has a huge wingspan, which helps him reach good serves and punish any serves that sit up.\n\nMedvedev, who won the Brisbane International, is renowned for standing back and ensuring the return lands in play so his endurance and physicality can come to the fore.\n\nHandling pressure: Novak Djokovic (Serbia)\n\nThis is no knock on the top two, but Djokovic has handled the big moments for two decades now so he earns the right to be rated the best player in the tournament at handling pressure.\n\nNovak Djokovic, the master of handling pressure. Credit: AP\n\nFitness: Alex de Minaur (Australia)\n\nAgain, Alcaraz and Sinner have no overall peer, with Alcaraz being the best mover in the game, but for some local flavour and with some variation, we gave the gong to de Minaur. His pure speed from point A to point B is frightening, and Alcaraz tends to warm into his year, which is why we are yet to see him at his best in Melbourne in January.\n\nHaving said that, there has never been a better-prepared and fitter player than Djokovic, while Medvedev has made a living out of adopting a counter punching, marathon-running mentality.\n\nAlex De Minaur runs fast. Credit: Chris Hopkins\n\nAttempts the impossible: Lorenzo Sonego (Italy)\n\nHe might be ranked No.40 in the world, but this shot demonstrates better than any what the modern professional is capable of on-court.\n\nWomen’s tennis\n\nBest serve: Elena Rybakina (Kazakhstan)\n\nAlthough it was off at times in Brisbane last week, Rybakina’s serve is the best in women’s tennis. She has great variety and generates speed, kicking and spitting the ball at the receiver.\n\nThe 26-year-old has also earned a reputation for delivering a brilliant serve right when she needs a free point most, with her numbers when down break point the best in the game.\n\nShe led the top 50 players in 2025 in first points winning percentage and percentage of service points won.\n\nBest volley: Belinda Bencic (Switzerland)\n\nBencic’s net play is different to most of her peers, but it is brutally efficient.\n\n“She is trying to punish her ground strokes to the back of the court and then looking to pounce with the drive volley or a swinging volley. She comes forward a lot, and she operates well when she does.” Rea said.\n\nBencic is skilful at taking the ball early, moving into play a half-volley on her way to the net, which puts her in a strong position compared to her opponent.\n\nMcNamee agrees Bencic has the best volley among those in the top 50, but said the player with the best volley in tennis is doubles star Hsieh Su-wei, who he coached with great success until the end of last year.\n\n“The problem with women’s tennis is, because of their reach and their lack of agility compared to men, it is harder for them to get to the net so they don’t get to use the volley often. It’s not a shot you need that much in women’s tennis,” McNamee explained.\n\nBest forehand: Madison Keys (USA)\n\nThe reigning Australian Open champion has power to burn and has promised to come in behind her ground strokes to volley aggressively.\n\nShe has the forehand to make that happen if she can believe in her ability.\n\nHer average forehand speed in last year’s Open was 130km/h, with her deep swing and fast feet combining with a big serve to win the championship.\n\nShe hit a remarkable 103 forehand winners in her first six matches in the Australian Open. Iga Swatiek has a reputation for a strong forehand, but opponents are no longer intimidated and some on the tour have even suggested players will attack that part of her game.\n\nBest backhand: Amanda Anisimova (USA)\n\nJelena Dokic was in awe watching Anismova peel off a backhand winner against Kimberly Birrell at the Brisbane International, saying she had the best backhand in the world: “Have a look how low she gets down, [look at her] shoulder rotation, [and] hip rotation, [she] hits through the ball [and her] head is still.”\n\nAnisimova’s strength and power meant Rea had no hesitation in declaring her a standout when it came to the backhand.\n\n“At the US Open [last September when runner-up to Sabalenka] she actually hit the ball faster than Alcaraz and Sinner from A to B. She might have less spin on the ball, but from A to B she was faster than Swatiek, faster than Alcaraz, faster than Sinner, [and] faster than Djokovic for pure ball speed,” Rea said.\n\n“If you gave me one backhand for my life it, would be Amanda Anisimova.”\n\nBest drop shot: Mirra Andreeva (Russia)\n\nAndreeva is a rising star and her drop shot is top-notch. McNamee says the claycourt specialists generally have the best drop shots.\n\n“Andreeva is your Martina Hingis of this era,” he said, adding that while Sabalenka doesn’t have the best drop shot it’s an element of her game worth watching as she tries to add some nuance to her game.\n\n“[Sabalenka] uses the drop shot to complement her power, and if she gets caught out of position on the return of serve she is actually prepared to take her medicine and get back in the point, trusting her movement to get back into the point after perhaps starting behind the eight-ball after having to chip ball back into play. That is an evolution in her game,” Rea said.\n\nBest return of serve: Coco Gauff (USA)\n\nIn a recent interview with Kim Clijsters on Andy Roddick’s Served podcast, the superbly skilled Ons Jabeur said she called Coco Gauff an Octopus because of her ability to return balls others would fail to reach.\n\nDespite Gauff’s serve being below that of the best players, Roddick thinks people should focus on the qualities that keep her inside the top five.\n\n“Coco Gauff sets up her defence with patterns… [she is the] best in the world at being uncomfortable and getting a W. She is a winner,” Roddick said.\n\n\n\nThe yin and yang in women’s tennis makes the tournament enthralling because Sabalenka and Rybakina’s weapons are on the serving side, while Gauff and Swatiek are on the returning side. Gauff won an incredible 46.3 per cent of her return games in 2025.\n\nHandling pressure: Aryna Sabalenka (Belarus)\n\nKeys saved a match point against Swatiek in the semi-final en route to her breakthrough Australian Open decider, but Sabalenka, the world No.1, consistently rose to the fore when the pressure was at its fiercest throughout the year.\n\nHer US Open performance, when she came from one set down and faced a break point in the third set but did not buckle, was a real standout. In a 48-minute final set, where she blew two match points, Sabalenka eventually wore down Jessica Pegula to show her mental strength and win.\n\nAryna Sabalenka overcame difficulties in the US Open final to claim the title. Credit: Getty Images\n\nFitness: Mirra Andreeva (Russia)\n\nIga Swatiek admitted to being “super sore” after the United Cup, so it was impossible to rate her as the fittest player heading into this year’s Australian Open, despite her intense training regime.\n\nThe one to follow here is Andreeva, who runs herself ragged on court.\n\n“For a youngster, her ability to defend is phenomenal,” Rea said.\n\nTeen sensation Mirra Andreeva. Credit: Eddie Jim\n\nAttempts the impossible: Karolina Muchova (Czechia)\n\nMuchova is in good form, making the semi-final of the Brisbane International after beating Rybakina, so she is far from a one-shot wonder. But being remembered for a shot such as her “tweener” at last year’s Dubai Open is not a bad thing.\n\nFollow our live Australian Open blog each day from January 18 for results, news, analysis and interviews.\n\nNews, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/large-manly-ferry-and-last-of-rivercats-to-be-turned-into-scrap-metal-20260112-p5ntc1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Large Manly ferry and last of RiverCats to be turned into scrap metal",
        "publish_date": "Wed, 14 Jan 2026 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "Matt O'Sullivan"
        ],
        "text": "One of Sydney’s large Manly ferries will be turned into scrap metal despite maritime enthusiasts insisting it is in “good nick”, meeting the same fate as the RiverCat named after Australian swimming legend Dawn Fraser.\n\nNSW’s transport agency has quietly put out a tender to scrap the Collaroy – the youngest of the four large Manly ferries – arguing it is the “only viable method of disposal” after it reached the end of its “economic life” as a passenger vessel.\n\nScuttling the Collaroy at sea for use as a dive wreck was considered, but Transport for NSW ruled it out due to significant environmental and technical risks, and the cost involved which would have run into the millions of dollars.\n\nThe Collaroy, right, tied up beside the Freshwater at Cockatoo Island on Tuesday. Credit: Sam Mooy\n\nThe double-ended Collaroy has been tied up at Cockatoo Island in Sydney Harbour since it was retired from service on the Manly-Circular Quay route in September 2023. The government had deemed it “prohibitively expensive” due to its “one-of-a-kind build”.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-passport-power-new-rankings/qykbgan0u",
        "title": "How does Australia compare? New passport power rankings revealed",
        "publish_date": "Wed, 14 Jan 2026 00:26:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "The world's most powerful passports have been revealed in new rankings, showing Australia has maintained its position within the top 10.\n\n\n\n\n\nSingapore again took the top spot as the world's most powerful passport, according to the Henley Passport Index's latest quarterly measure, which ranks travel documents based on the number of destinations holders can access without a visa.\n\n\n\n\n\nAustralia retained its seventh-place position, alongside Latvia, Liechtenstein and the United Kingdom, with visa-free access to 182 countries.\n\n\n\n\n\nAt the other end of the spectrum, Afghanistan again ranked last, with access to just 24 countries without a visa.\n\n\n\nThe world's most powerful passports have been revealed, with Australia still holding firm while the US and UK slip. Source: SBS News The gap between the strongest and weakest passports has continued to widen over the past two decades, now sitting at 168 destinations — up from 118 in 2006.\n\n\n\nUK continues to plummet, US back in top ten\n\nJapan and South Korea share second place on the index, followed by Denmark, Luxembourg, Spain, Sweden and Switzerland in third.\n\n\n\n\n\nTen European countries tied for fourth, while Australia's neighbour New Zealand ranked just ahead in sixth.\n\n\n\nThe UK, which tied with Australia in seventh place, recorded the steepest year-on-year decline, losing visa-free access to eight destinations over the past 12 months.\n\n\n\n\n\nThe US, meanwhile, managed to claw its way back into the top ten after briefly dropping out in late 2025 — the first time that had happened since the index began.\n\n\n\n\n\nBut the rebound comes with a caveat — the US recorded the second-largest annual decline after the UK, losing visa-free access to seven destinations in the past year.\n\n\n\n\"Passport power ultimately reflects political stability, diplomatic credibility, and the ability to shape international rules,\" Misha Glenny, director of the Institute for Human Sciences in Vienna, says in Henley & Partners' report.\n\n\n\n\n\n\"As transatlantic relations strain and domestic politics grow more volatile, the erosion of mobility rights for countries like the US and UK is less a technical anomaly than a signal of deeper geopolitical recalibration.\"\n\n\n\nHow passports have changed over 20 years\n\nOver the past two decades, the US has recorded the third-largest drop in rankings — behind Venezuela and Vanuatu — falling from fourth place in 2006 to tenth in 2026.\n\n\n\n\n\nThe UK has seen the fourth-largest decline, dropping from third to seventh over the same period.\n\n\n\nREAD MORE Revealed: The travel hotspots Australians are heading to this summer\n\nBy contrast, the United Arab Emirates has been the strongest performer globally, adding 149 visa-free destinations since 2006 and climbing 57 places to rank fifth.\n\n\n\n\n\nSeveral countries across the Western Balkans and Eastern Europe have also made significant gains, including Albania (+36 places), Ukraine (+34), Serbia (+30) and North Macedonia (+27).\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/michele-bullock-joins-world-central-bank-chiefs-declaring-full-solidarity-with-jerome-powell/leftgh65t",
        "title": "Michele Bullock joins world central bank chiefs declaring 'full solidarity' with Jerome Powell",
        "publish_date": "Tue, 13 Jan 2026 21:41:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Global central bank chiefs, including Australia's Michele Bullock, have issued a rare joint statement, backing US Federal Reserve chair Jerome Powell.\n\n\n\n\n\nBullock is among 11 global central bank chiefs to have signed a statement highlighting the importance of independence in central banks, something placed under question after Powell called out the investigation as intimidation meant to pressure the central bank to slash interest rates.\n\n\n\n\n\n\"We stand in full solidarity with the Federal ‌Reserve System and its Chair Jerome H. Powell,\" the heads of 11 of the world's largest central banks said in a joint statement.\n\n\n\nThe heads of the Reserve Bank of Australia, the European Central Bank, the Bank of England, the Bank of Canada and seven other institutions said Powell had acted with integrity and that central bank independence was crucial for keeping prices and financial markets stable.\n\n\n\n\n\n\"The independence of central ‍banks is a cornerstone of price, financial and economic stability in the interest of the citizens that we serve,\" the statement said.\n\n\n\nTrump reprises demand for rate cuts, slams Powell\n\nUS President Donald Trump on Tuesday demanded again that Powell lower borrowing costs after a government report showed consumer prices rose 2.7 per cent in December from a year earlier, and reprised his accusations of wrongdoing over the renovations.\n\n\n\n\n\n\"Well, he's billions of dollars over budget. So he either is incompetent or he's crooked. I don't know what he is, but he doesn't, certainly doesn't do a very good job,\" Trump told reporters in Washington.\n\n\n\n\n\n\"We have very low inflation. That would give 'too-late Powell' the chance to give us a nice beautiful big rate cut,\" Trump said.\n\n\n\nThe head of America's central bank, Jerome Powell, will be criminally investigated for alleged \"abuse of taxpayer dollars\" after a renovation budget ballooned. It's part of a long-standing beef involving Donald Trump. Source: AP / Julia Demaree Nikhinson/AP When asked whether the probe of Powell affects the timing of appointing a new Fed chief, Trump said: \"No.\"\n\n\n\n\n\nWhen asked when he expects to announce that decision, Trump said: \"Sometime in the next few weeks.\"\n\n\n\nFed bank members reassert independence\n\nDespite hopes that a leader hand-picked by Trump might lead to more interest rate cuts, members of the central bank said neither Powell nor his successor would change policy suddenly to suit the president.\n\n\n\n\n\n\"All of my colleagues and I are committed to setting monetary policy, the best monetary policy for the economy at a particular time and for all Americans,\" St Louis Fed president Alberto Musalem said on Tuesday.\n\n\n\n\n\n\"I don't expect that commitment to change, regardless of who is the chair.\"\n\n\n\nLISTEN TO Jerome Powell facing criminal probe and implications for markets SBS News 11:16 English\n\nIndependence from government influence has been the key foundation of modern central banking.\n\n\n\n\n\nIt remained the unquestioned standard until Trump started demanding lower rates and putting pressure on individual policymakers when they failed to oblige.\n\n\n\n\n\nThe outpouring of solidarity followed pushback from several lawmakers in Trump's Republican Party on Monday, including members of the Senate banking committee who have the power to block the president's nomination of a more biddable successor to Powell.\n\n\n\n\n\nThe current Fed chief's term ends in May. Powell revealed late on Sunday that the US central bank had received subpoenas from the US justice department about what he told Congress regarding the US$2.5 billion ($3.7 billion) renovation of the Fed's headquarters in Washington.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-cost-of-educating-children-in-australia-revealed/6vxrnq7re",
        "title": "Parents 'under pressure': The cost of educating children in Australia revealed",
        "publish_date": "Tue, 13 Jan 2026 21:17:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "The significant cost of educating children in Australia is forcing parents to work more hours and families to cut back on holidays.\n\n\n\n\n\nAustralian families are reconsidering whether to have more children and are relying on others for help to pay for education fees as the cost of schooling accumulates.\n\n\n\n\n\nFor a child starting school in 2026, it will cost families in major cities $113,594 for a government education, $247,174 for private schooling, and $369,594 to send them to an independent school over 13 years.\n\n\n\n\n\nIn regional and remote areas, families will pay $100,395 for a government education, $223,874 for Catholic, and $230,144 for independent schools.\n\n\n\nThe research conducted by school finance group Futurity takes in school fee data from Australia's curriculum authority and interviews 2500 parents about their spending habits.\n\n\n\n\n\nMelbourne topped the capital cities in government school costs at $121,202, while regional and remote Queensland parents face the steepest education bill of $108,647.\n\n\n\n\n\nGovernment school fees made up 13 per cent for metro and five per cent for regional costs, with the remaining amount going to add-ons including outside tutoring, transport, school camps and uniforms.\n\n\n\n\n\nCanberrans will spend the most for a Catholic education, while regional and remote Queenslanders pay the highest fees at $273,494.\n\n\n\nIndependent schools are most expensive in Melbourne, costing $435,902, while Western Australia is the priciest for regional and remote schools at $275,639.\n\n\n\n\n\nFamilies value education, with nine in 10 saying education is important for their child to thrive in life, Futurity's Sarah McAdie said.\n\n\n\n\n\n\"[They] are prepared to make sacrifices in order for their child to access the education that the parents choose and value for their child,\" she told the Australian Associated Press.\n\n\n\n\n\nBut parents are increasingly looking to save by searching for second-hand school uniforms, making laptops last longer and spending less on musical instruments and camps.\n\n\n\nLISTEN TO Families feeling the pressure as school costs rise SBS News 02:59 English\n\nA third of respondents said they turned to credit debt, while others are having fewer family holidays and working more to afford the quality education for their kids.\n\n\n\n\n\nOver half said they rely on others, including grandparents, to pay for their children's education.\n\n\n\n\n\n\"Alarmingly, 45 per cent of parents said that they are now considering having less children as a result of the cost of raising and educating a child today,\" McAdie said.\n\n\n\n\n\nFamilies have been tightening their spending as concern increases about Australian schools being fully funded, according to the Australian Council of State School Organisations.\n\n\n\n\"When the household budget is under pressure, things like sport and camps and upgrades are the first things that are scaled back,\" interim chair Peter Garrigan said.\n\n\n\n\n\nHe said the real test is whether every child can participate fully without money being a barrier, as parents turn to the \"bank of grandparents\" for help.\n\n\n\n\n\n\"Australia's society should be able to support everyone to do that,\" Garrigan said.\n\n\n\n\n\nIn Australia, 63 per cent of students are enrolled in government schools, followed by 20 per cent in Catholic schools and 17 per cent in independent schools, according to the bureau of statistics.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/adelaide-writers-festival-cancelled-amid-escalating-reaction-to-disinviting-palestinian-australian-writer/4w6bu9egl",
        "title": "Adelaide Writers Festival cancelled amid escalating reaction to disinviting Palestinian-Australian writer",
        "publish_date": "Tue, 13 Jan 2026 08:42:15 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Adelaide Writers Festival cancelled amid escalating reaction to disinviting Palestinian-Australian writer\n\nPublished 13 January 2026, 5:42 am\n\nAustralia's oldest literary festival has been cancelled, days after the dropping of writer Randa Abdel-Fattah, an Australian of Palestinian background. The announcement comes after more than 100 guest speakers and authors pulled out of the festival.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/neo-nazi-groups-say-they-will-disband-ahead-of-introduction-of-proposed-hate-speech-laws/gogey8rsa",
        "title": "Neo-Nazi groups say they will disband ahead of introduction of proposed hate speech laws",
        "publish_date": "Tue, 13 Jan 2026 08:24:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's most prominent neo-Nazi groups will disband within a week as the federal government announces new hate speech laws after the Bondi terror attack.\n\n\n\n\n\nThe National Socialist Network announced on Tuesday in a Telegram post that it will shut down as an organisation to avoid past and present members being prosecuted for recruiting people to spread racial hatred.\n\n\n\n\n\nThe disbandment will also apply to aligned groups White Australia, the European Australian Movement and the White Australia Party.\n\n\n\n\n\nFears members could be targeted for performing Nazi or 'Roman' salutes were other reasons given for the hasty wind-down.\n\n\n\n\n\nThe legislation to be debated in parliament next week would give the federal government powers to prescribe hate groups that currently fall below terrorist listing thresholds.\n\n\n\nREAD MORE Eight key changes in Labor's sweeping hate speech and gun laws\n\n\"The National Socialist Network will be fully disbanded before 11:59pm Sunday the 18th of January 2026,\" the group said in the Telegram post.\n\n\n\n\n\n\"If the laws pass, there will no way (sic) to avoid the organisation being banned.\"\n\n\n\n\n\nOrganisers, supporters and recruiters of listed groups face 15 years in prison under the proposed laws while members face seven.\n\n\n\n\n\nDisseminating ideas of superiority over or hatred of another person or group because of their race, colour or national and ethnic origin is also an offence.\n\n\n\n\n\nThe disbandment is likely a fatal blow to any chance of the group achieving mainstream political recognition after the White Australia Party previously announced it had reached enough members to form a registered party.\n\n\n\n\n\n\"We are pleased to announce that we have obtained greater than 1,500 signups for members of our White Australia Party (Federal) project,\" NSW leader Jack Eltis said on 21 November.\n\n\n\nHome Affairs Minister Tony Burke has said that, while the news of the National Socialist Network's disbandment was welcome, the fight against bigotry \"never ends\".\n\n\n\n\n\n\"The individuals will still try to find ways to spew hatred and we will keep deporting people and disbanding organisations that hate Australia,\" he said, as reported by ABC News.\n\n\n\nASIO chief says 'problematic' individuals will continue to be monitored\n\nThe federal laws are being pushed through quickly as a response to the Bondi attack, but other jurisdictions were already cracking down on the National Socialist Network's activities.\n\n\n\n\n\nNeo-Nazis organised by the group protested outside the NSW parliament earlier in November, prompting the state government to draft its own laws designed to crack down on the spread of the hateful ideology.\n\n\n\n\n\nGroup leader Thomas Sewell is facing charges relating to two incidents in August, including allegedly leading a group attack on a sacred First Nations site in Melbourne, where several people were assaulted.\n\n\n\n\n\nAustralian Security Intelligence Organisation chief Mike Burgess told a parliamentary committee hearing on Tuesday that his agency has considered how to respond to neo-Nazi groups disbanding.\n\n\n\n\n\n\"Of course, the individuals don't cease to exist, they're still there in society, and obviously the problematic ones we will continue to watch if they continue to be problematic,\" he said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/global-markets-and-precious-metals-hit-record-high-despite-powell-investigation/99u8qf5jl",
        "title": "Global markets and precious metals hit record high despite Powell investigation",
        "publish_date": "Tue, 13 Jan 2026 08:17:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/kevin-rudd-do-leave-us-ambassador-post/cevoo0xhz",
        "title": "Kevin Rudd announces resignation as Australia's ambassador to the United States",
        "publish_date": "Tue, 13 Jan 2026 07:02:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nKevin Rudd was appointed Australian ambassador the U-S in March 2023 and was due to end his tenure next year.\n\n\n\n\n\nInstead, he will bow out a year early on the 31st of March, in a move announced by Prime Minister Anthony Albanese, alongside Foreign Minister Penny Wong.\n\n\n\n\n\n\"He's always brought an extraordinary level of energy and discipline to public service. He's applied his relentless effort, his experience and his intellect and his determination to advance Australian interests in Washington, and Kevin Rudd has served the nation well.\"\n\n\n\n\n\nPrime Minister Albanese praised Dr Rudd's ability to develop deep relationships across the political spectrum.\n\n\n\n\n\nUnder his tenure, Australia secured a $13 billion critical minerals deal with the US, and advanced the AUKUS security pact which will include the acquisition of nuclear-powered submarines.\n\n\n\n\n\n\"As Prime Minister, I have visited the United States on no less than seven occasions. That is because of the productive work that Kevin Rudd has done across the board, including particularly advancing the economic relationship between our two nations, but also, of course, ensuring that AUKUS is able to proceed.\"\n\n\n\n\n\nDr Rudd is credited with helping achieve the return of Wikileaks founder Julian Assange to Australia, ending a years-long legal battle on espionage charges.\n\n\n\n\n\nPenny Wong also applauded him for boosting U-S investment in Australian firms.\n\n\n\n\n\n\"Kevin's helped unlock billions of dollars in new investment and collaboration, including AI data centres and quantum in sectors that will strengthen the Australian economy and our security for decades to come. And he's put Australia's superannuation industry on the map with the United States, turbocharging U-S engagement and investment.\"\n\n\n\n\n\nBut his past comments about the US President remained a sore point.\n\n\n\n\n\nBefore becoming ambassador, Dr Rudd had labelled Mr Trump a \"traitor to the West\" on social media and criticised him in an online interview with an Indian politician.\n\n\n\n\n\n\"The United States for the last four years has been run by a village idiot.\"\n\n\n\n\n\nLeading to a tense exchange in the Oval Office when the Prime Minister visited President Trump in October.\n\n\n\n\n\n\"Trump: Where is he, is still working for you\n\n\n\n(Laughter, He's right here)\n\n\n\nTrump: \"Did you say bad?\"\n\n\n\nRudd: \"Before I took this position Mr President,\"\n\n\n\nTrump: \"I don't like you either. I probably never will.\"\n\n\n\n\n\nDr Rudd is stepping down to become the global president of the Asia Society and lead its Centre for China Analysis.\n\n\n\n\n\nPrime Minister Albanese insists Dr Rudd's departure is his own choice, and not based on his relationship with Donald Trump.\n\n\n\n\n\n\"I think that one of the things about President Trump is that he looks forward on these issues and the relationship that Kevin has had with members of the Trump administration, whoever follows Kevin. If it's as good as that, I'll be pretty happy.\"\n\n\n\n\n\nKevin Rudd's resignation marks the effective end of his public life, to which he aspired from the age of 15, when he wrote to then Prime Minister Gough Whitlam asking for advice on how to become a diplomat and received a suggestion from the nation's leader that he study Asian languages.\n\n\n\n\n\nHe was elected to federal parliament as the Labor member for Griffith in Brisbane in 1998, becoming leader of the Opposition just two years later.\n\n\n\n\n\nIn 2007, he led Labor to a rousing victory, ending 11 years of Coalition rule.\n\n\n\n\n\nHe quickly ratified the Kyoto protocol to cut greenhouse gas emissions, and in February 2008 delivered a historic apology to the Stolen Generations at Parliament House.\n\n\n\n\n\n\"As Prime Minister of Australia, I am sorry. \"\n\n\n\n\n\nHe impressed international leaders with his fluent Mandarin, welcoming the Chinese president to Sydney for the APEC conference in 2007.\n\n\n\n\n\n\"President Hu, may I wish you and your party every success in Australia, and I join the Prime Minister in welcoming your gift of pandas to Australia.\"\n\n\n\n\n\nHe steered Australia through the Global Financial Crisis and overturned his successor John Howard's unpopular industrial relations laws.\n\n\n\n\n\nBut his popularity plummeted when it came to addressing an issue he had campaigned passionately on.\n\n\n\n\n\n\"Climate Change is the great moral challenge of our generation.\"\n\n\n\n\n\nAbandoning legislation for a carbon emissions trading scheme when he failed to gain bipartisan support.\n\n\n\n\n\nAmid rumours of a chaotic and controlling management style, he faced a shock leadership coup in June 2010 and stood down to make way for his deputy Julia Gillard.\n\n\n\n\n\nHe was given the role of Foreign Minister, and in 2023 he was re-elected as party leader, becoming Prime Minister once again.\n\n\n\n\n\n\"Rightly or wrongly, Julia has lost the trust of the Australian people, and starting on Monday, I want to start restoring that trust.\"\n\n\n\n\n\nThree months later, he was defeated by Coalition leader Tony Abbott at the election and retired from parliament soon after.\n\n\n\n\n\nIn the years that followed, he published two autobiographies and two books examining the leadership of Chinese President Xi Jinping, as well as receiving a PhD from Oxford University - making him, as the Prime Minister notes, well suited to a future in policy analysis and research.\n\n\n\n\n\n\"Kevin is regarded as perhaps the world's most eminent and sought after expert on China and China US relations.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/adelaide-writers-week-cancelled-after-palestinian-australian-author-dropped/z6g9faxqs",
        "title": "Abdel-Fattah rejects Adelaide Festival board apology following writers' week cancellation",
        "publish_date": "Tue, 13 Jan 2026 03:48:33 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Palestinian Australian author Randa Abdel-Fattah has publicly rejected an apology from Adelaide Festival's board, after it removed her from Adelaide Writers' Week 2026, which will now not go ahead.\n\n\n\n\n\nThe board announced on Tuesday that it would cancel this year's festival, following the resignation of director Louise Adler and a mass boycott from invited authors protesting Abdel-Fattah's removal.\n\n\n\n\n\n\"Because I have too much respect for myself and for my people, for those who have suffered irreparable harm by the board's conduct, for the brilliant Louise Adler who was forced on principle to resign, I refuse and reject the board's apology, Abdel-Fattah wrote on Instagram on Tuesday.\n\n\n\n\n\n\"It is disingenuous, it adds insult to injury,\" she said, adding that the apology only addressed \"how the message of my cancellation was conveyed, not the decision itself\".\n\n\n\n\n\nThe board said its decision on 8 January to rescind her invitation had been made \"out of respect for a community experiencing the pain from a devastating event,\" but acknowledged it had instead created division.\n\n\n\n\n\n\"We recognise and deeply regret the distress this decision has caused to our audience, artists and writers, donors, corporate partners, the government and our own staff and people,\" it said in a statement released on Tuesday.\n\n\n\n\n\n\"We also apologise to Dr Randa Abdel-Fattah for how the decision was represented and reiterate this is not about identity or dissent but rather a continuing rapid shift in the national discourse around the breadth of freedom of expression in our nation following Australia's worst terror attack in history.\"\n\n\n\nREAD MORE Louise Adler resigns as Adelaide Writers' Week director amid escalating festival crisis\n\nThe board initially claimed past statements from Abdel-Fattah meant it would not be \"culturally sensitive\" for her to appear at the festival so soon after the antisemitic terror attack at Sydney's Bondi Beach on 14 December.\n\n\n\n\n\nAbdel-Fattah described the board's justification for her removal as explicitly targeting her identity.\n\n\n\n\n\n\"I think in this moment we must also pay close attention to some of the fault lines that are being drawn,\" she said.\n\n\n\n\n\n\"We have to be very careful about the way the narrative is being framed to equate all speech as equal, undermining the right of marginalised people to call for the cancellation of those who incite harm in the name of liberal principles of the so-called marketplace of ideas — as we all know, Indigenous artists and writers of colour pay the price for.\"\n\n\n\n'Decision wasn't about identity or dissent'\n\nIn its statement on Tuesday, the Adelaide Festival board said Adelaide Writers' Week 2026 could no longer proceed after widespread withdrawals by writers, commentators and academics following Abdel-Fattah's removal. Around 180 participants had reportedly withdrawn in protest.\n\n\n\n\n\nThe South Australian government announced Judy Potter would become the new board leader. She previously led the board from 2016-2023.\n\n\n\n\n\nThe cancellation follows last week's announcement that Abdel-Fattah's appearance at the literary festival had been cancelled. She is the daughter of Palestinian and Egyptian parents, and has been a vocal critic of Israel's treatment of Palestinians.\n\n\n\n\n\nShe has previously faced criticism from the Coalition, as well as some Jewish organisations and media outlets, over comments about Israel and Zionism, including a widely reported post in which she claimed Zionists had \"no claim or right to cultural safety\".\n\n\n\nREAD MORE Board members, chair quit from Adelaide Festival as fallout from dropped author grows\n\nAbdel-Fattah has said her objections and critiques of Zionism, a political ideology , have been conflated with antisemitism.\n\n\n\n\n\nShe has also said her posting of an image of a Palestinian paratrooper soon after the October 7 attacks, a move that has also been criticised, was intended as a symbolic expression of besieged Palestinians \"breaking out of their prison\", and that she did not support the killing of civilians. She said she was unaware at the time of the scale or severity of the attacks.\n\n\n\n\n\nAt the time, the board said it was \"not culturally sensitive\" to proceed, a decision Abdel-Fattah described as \"outrageous\", saying she \"cannot believe\" she had to state she had \"nothing to do with the Bondi atrocities\".\n\n\n\nLegal challenge under consideration\n\nMichael Bradley of Marque Lawyers, who is representing Abdel-Fattah, said the collapse of the event was foreseeable once the board rescinded his client's invitation, but stressed that its inevitability did not diminish the seriousness of the outcome.\n\n\n\n\n\n\"The cancellation of the whole event was inevitable,\" he told SBS News, adding it was \"an incredibly sad thing to have happened and it was also completely unnecessary\".\n\n\n\n\n\nHe said responsibility lay with both the board and the South Australian government, arguing that the consequences flowed from their decisions rather than from any conduct by Abdel-Fattah.\n\n\n\n\n\n\"None of this has anything to do with Randa,\" he said.\n\n\n\n\n\n\"She was looking forward to sitting in the sunshine talking about her new book,\" he said, referring to her 2025 novel Discipline, which explores the experience of the Palestinian diaspora in Australia.\n\n\n\nBradley said Abdel-Fattah was now weighing her legal position.\n\n\n\n\n\n\"Randa will consider her options as she is with everything else that's going on,\" he said.\n\n\n\n\n\nHe said \"her rights have been very, very severely compromised\" and she had been \"done a lot of harm, none of which she provoked or deserved\".\n\n\n\nPremier defends stance as criticism mounts\n\nMeanwhile, South Australian Premier Peter Malinauskas has faced questions over whether he sought to influence the board’s decisions regarding Adelaide Writers' Week.\n\n\n\n\n\nHe has rejected those assertions, telling reporters on Tuesday that the festival was \"strictly an independent exercise\" and \"not a government-run event\".\n\n\n\n\n\n\"What writers' week does with this community is up to them,\" he said earlier on Tuesday.\n\n\n\n\n\n\"That's their event, their decisions.\"\n\n\n\nSouth Australian Premier Peter Malinauskas said he had a responsibility \"to advocate against any rhetoric that I think inflames hate speech or Islamophobia or antisemitism or any other form of racism\". Source: Supplied / ABC Responding to questions about whether he'd exerted political influence, he drew a hypothetical comparison.\n\n\n\n\n\n\"Can you imagine if a far-right Zionist walked into a Sydney mosque and murdered 15 people? Can you imagine that as the premier of this state, I would actively support a far-right Zionist going to writers' week and speaking hateful rhetoric?\" he said in an emotional exchange with one reporter.\n\n\n\n\n\n\"Of course, I wouldn't, but the reverse has happened in this instance, and I'm not going to support that either.\"\n\n\n\nREAD MORE First Nations authors join boycott of Adelaide Writers' Week over the removal of Palestinian guest\n\nBradley described the comments as \"one of the most extraordinary statements I've ever heard from a public official, about a private citizen\".\n\n\n\n\n\n\"To come out with something so incendiary and unprovoked — I don't know why he's done that, it's a mystery,\" he said.\n\n\n\n\n\nThe remarks came hours after Louise Adler resigned as director of Adelaide Writers' Week, warning of a broader erosion of artistic freedom.\n\n\n\n\n\nActing Greens leader and arts spokesperson Sarah Hanson-Young described the cancellation as \"a dark day for the arts in South Australia\", saying: \"Premier Peter Malinauskas must apologise for his intervention which has helped lead to this fiasco.\"\n\n\n\n\n\n\"As Louise Adler has warned, writers' week is the canary in the coalmine.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/keep-knocking-on-the-door-cash-tells-de-minaur-to-keep-believing-in-his-open-dream-20260114-p5ntxb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Keep knocking on the door’: Cash tells de Minaur to keep believing in his Open dream",
        "publish_date": "Wed, 14 Jan 2026 13:25:24 +1100",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Australian tennis great Pat Cash rates Alex de Minaur as good a chance of making this year’s Australian Open final as anyone not named Jannik Sinner or Carlos Alcaraz.\n\nThe 1987 Wimbledon champion and two-time Australian Open finalist used triple grand slam runner-up Casper Ruud as an example of what was possible for world No.6 de Minaur, who reached the quarter-finals at Melbourne Park for the first time last year.\n\nAlex de Minaur is among the top contenders for the Australian Open title. Credit: Getty Images\n\nCash’s comments come as de Minaur said on Wednesday that he dreamt of winning his home grand slam and ending Australia’s 50-year title drought since Mark Edmondson’s shock win in 1976.\n\nNo Australian man has made the Australian Open final since Lleyton Hewitt – who is part of “Team Demon” – lost in four sets to Russia’s Marat Safin.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/three-men-one-jersey-the-high-stakes-fight-for-the-reds-no-10-20260113-p5ntkl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inside the high-stakes battle which can make or break Wallabies’ World Cup hopes",
        "publish_date": "Wed, 14 Jan 2026 13:12:56 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Wallabies five-eighth Tom Lynagh says the logjam of Australia’s No.10s will not be to the derailment of their Test ambitions, as he prepares for a three-way battle for the job at clubland.\n\nHaving missed the end-of-year spring tour in a bid to overcome a host of injury concerns, Lynagh returns to the Queensland Reds fresh and eager to stave off challenges from fellow international playmaker Carter Gordon and rising sensation Harry McLaughlin-Phillips.\n\nGordon’s arrival at Ballymore after an ill-fated NRL stint with the Gold Coast Titans – one marred by a serious neck issue which kept him to just one game – drew criticism from some rugby circles given the Reds now face the prospect of not being able to field a Wallabies’ contender each week.\n\nTom Lynagh has supported the move for Carter Gordon to join the Queensland Reds. Credit: Getty Images\n\nAustralia has also failed to find a consistent chief to spearhead the side – Lynagh, Gordon, Tane Edmed and James O’Connor have all been used since Noah Lolesio’s Japan defection, while Donaldson has remained around the squad.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/kyrgios-entertains-melbourne-crowd-in-spectacular-win-20260114-p5ntvy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kyrgios entertains Melbourne crowd in spectacular win",
        "publish_date": "Wed, 14 Jan 2026 13:03:35 +1100",
        "category": "sports",
        "authors": [],
        "text": "Kyrgios entertains Melbourne crowd in spectacular win\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/iran-protests-trump-says-help-on-way-20260114-p5ntwo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Iran protests: Trump says 'help' on way",
        "publish_date": "Wed, 14 Jan 2026 12:57:27 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/aussie-teen-scores-on-debut-20260114-p5ntzf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie teen scores on debut",
        "publish_date": "Wed, 14 Jan 2026 12:43:00 +1100",
        "category": "sports",
        "authors": [],
        "text": "Aussie teen scores on debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/viral-video-shows-sneaky-parking-hack-20260114-p5ntzm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Viral video shows sneaky parking hack",
        "publish_date": "Wed, 14 Jan 2026 12:42:57 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/smith-snubs-pga-tour-offer-to-stick-with-liv-20260114-p5ntza.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Smith snubs PGA Tour offer to stick with LIV",
        "publish_date": "Wed, 14 Jan 2026 12:13:23 +1100",
        "category": "sports",
        "authors": [],
        "text": "Smith snubs PGA Tour offer to stick with LIV\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/gadecki-takes-first-set-over-former-open-champ-20260114-p5ntz4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gadecki takes first set over former Open champ",
        "publish_date": "Wed, 14 Jan 2026 12:03:22 +1100",
        "category": "sports",
        "authors": [],
        "text": "Gadecki takes first set over former Open champ\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/tom-silvagni-files-appeal-against-rape-convictions-20260114-p5ntyr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tom Silvagni files appeal against rape convictions",
        "publish_date": "Wed, 14 Jan 2026 11:43:08 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/art-and-design/from-counter-culture-to-suburban-nudes-melbourne-lives-captured-through-a-lens-20251117-p5nfye.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From counter-culture to suburban nudes: Melbourne lives captured through a lens",
        "publish_date": "Wed, 14 Jan 2026 11:31:00 +1100",
        "category": "entertainment",
        "authors": [
            "Kerrie O'Brien"
        ],
        "text": "Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Share A A A\n\nA naked couple sits on a mattress in the backyard of a terrace house, reading the newspaper, their backs to the camera. A motorbike and an assortment of pushbikes lean on the wall, a garden hose curls near an old drain, and dog’s water bowl suggests there’s an absent pet somewhere nearby. It’s a gloriously evocative black-and-white photograph by Ponch Hawkes, typical of her work in the 1970s. Australia was undergoing a metamorphosis, emerging from decades of conservative government. Radical change was underway, with women’s rights, second-wave feminism and sexual liberation in full swing. Hawkes documented those heady times and continues to do so, five decades on. Turning 80 next year, the acclaimed photographer is busier than ever, preparing for an exhibition of her paintings – a recent reacquaintance with the medium has turned into an obsession – and a survey show planned at the Museum of Australian Photography for winter 2028. Ponch Hawkes’ No title (Summer night in the backyard at Falconer Street), circa 1975. Courtesy of the NGV Her images appear in the newly published Circus Oz: From the Pram to the World Stage, and she features in the documentary The Language of Light about seven Australian photographers on SBS on Demand. Some of her 1970s work is showcased at the NGV, in Women Photographers 1900-1975: A Legacy of Light. Her shots document that heady time and illustrate the changing social dynamics, capturing everyday moments like the above in communal houses, graffiti demanding childcare and social housing, protests about gay rights and women’s liberation and a whole lot more. The images seem very uncurated, I say. “We were uncurated,” she says. “We were all so incredibly happy with ourselves. We all thought we were so fabulous.”\n\nAdvertisement\n\n“It was punk, not in the sense of the Sex Pistols, but everybody was having a go at everything, trying out being a filmmaker or a writer or an artist or a photographer, in my case. With an overlay of social action and community giving and receiving.” Places like the Pram Factory, La Mama and Circus Oz were in their infancy – the latter and its community remains a big part of her life; she was at a barbecue fundraiser for the rock’n’roll circus recently. “I didn’t ever do the trapeze but we all tried to learn to do things. The thing is, I had strength but no grace whatsoever,” she says of its early days. Ponch Hawkes has been documenting our lives for five decades. Chris Hopkins One of the teachers was in traditional circus, which came with a particular type of training. “You’re up hanging off a rope and she’d happily let you wear the skin away, to see if you’re tough enough, which I wasn’t, really.” Hawkes says it felt like the golden age: “Whitlam was in, the economy was in good shape, there was full employment, rent was really cheap, interest rates were low-ish and so there was money for the arts.” ”We were turning people away – everything we did was completely sold out. I went on tour in a band with five other women, to schools and all sorts of incredible venues, doing a show about women’s work, for which we had posters ... in different languages, so if we performed at a factory, people would know what we were doing... bold things like that.”\n\nAdvertisement\n\nShe contributed to Digger magazine, the short-lived but impactful counter-culture mag that focused on politics, sex, drugs and rock’n’roll. Several of the images in the NGV show were first published in it, as was the essay that led to Helen Garner’s sacking as a teacher, for speaking with her high school students about sex. We’re dining at Hawkes’ favourite local, Matsuya, a Japanese restaurant in Fairfield. It’s quiet and comfortable and the staff welcome her warmly. She orders the vegetable tempura with a side of horenso (cold spinach with sesame dressing, much more delicious than it sounds), while I opt for the deluxe bento box; we share the gyoza to start, plus Japanese tea. Our photographer Chris Hopkins arrives and soon takes Hawkes outside to get a portrait shot, despite it being a wild and woolly day. “I’m ready for lunch, but am I ready for you?” she quips as they head outside. Ponch Hawkes. Chris Hopkins When she gets back, I wonder if she took a peek at the pics? No. (Later, when she sees his fabulous shot with her hair seeming to stand on end, she’s impressed and hopes we publish it.) Often, Hawkes interviews people before shooting them. Everybody’s got a story, she says. “You get a sense of what that story might be. Also, if it’s a portrait and they need to present really well, sometimes people are really direct and go, ‘Oh no, I look terrible from that side’ – especially actors. But most people are completely unaware of how they present, so they’re really trusting you for a portrait.” That degree of trust is a big part of what she does, perhaps best illustrated by her recent 500 Strong series, which features 500 women over the age of 50 photographed naked.\n\nAdvertisement\n\nSome use props to cover their faces, many grin, smile or gaze happily into the camera; all show bodies of all shapes and sizes. It’s an extraordinary body of work and continues to tour around the country. “I’ve done a lot of projects about good and worthy subjects, but this is the only one I’ve ever done that’s actually made real change,” she says. “Hardly a day goes by that I don’t run into someone, or someone writes me an email or a letter saying how differently they feel about things since they did the project or saw the project. It’s really moving.” Born and raised in Abbotsford, Hawkes had three siblings; her dad was a laundryman at Abbotsford Convent and her mum sometimes worked as a cook in pubs. Part of a panel of 500 Strong. Ponch Hawkes Her dad played in the reserves for Collingwood and later trained local footy clubs; his family all played local footy, “they were big, strapping men”. Now a self-confessed diehard Collingwood fan, she didn’t re-engage with footy until later in life. “I can’t remember what it was but I became fully engaged,” she laughs, even writing a spirited defence of Mason Cox when he was attacked in an online supporters group. Her miniature poodle wears a Pies jumper in a pic on her phone and her membership for the next season has just arrived in the mail. Being a Collingwood supporter means you commune with fellow supporters, “no matter where they come from – that’s what tribes are about”.\n\nAdvertisement\n\nWe’re both thrilled to see women playing Australian Rules, finally, even though the physicality of the game can mean it’s sometimes hard to watch. “Because we’re so unused to seeing girls tackle other girls or go in head-first or slam into people or do all the things we’re used to in AFL. That’s one of the reasons we love it so much, it’s such a brutal bloody sport.“ Footy chat brings us to Helen Garner’s wonderful book The Season, about her grandson and his local team. “That book made me feel glad to be alive and Helen’s books aren’t always like that... [it] was so full of joy. I just completely love her, she’s such a brilliant writer.” Helen and Gwen 1976, from the series Our mums and us by Ponch Hawkes. Ponch Hawkes/Museum of Australian Photography I find out over lunch that it’s actually a young Garner in that photo described at the beginning of this piece. She also features in Hawke’s series Our Mums and Us, which features mothers and their daughters photographed at their homes. It’s a wonderful snapshot of time, borne out of the realisation “that your mother was not just your mother, she was a person in her own right”. In 1976, it became her first exhibition. There are many similarities between their work: social realism and making art by documenting our lives, an incredible eye for detail, and a commitment to truth-telling.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/final-page-major-festival-pulls-003700269.html",
        "title": "‘Final page’: Major festival pulls out of Aus",
        "publish_date": "2026-01-14T01:32:11Z",
        "category": "finance",
        "authors": [],
        "text": "SXSW Sydney will not take place this year, with organisers announcing the festival had concluded its run in Australia.\n\nThe major annual event, which is a conglomeration of parallel film, music, technology, and video game festivals as well as other conferences, expanded to Sydney in 2023 after it was created in Austin, Texas in 1987.\n\n“Every great story has a final page, and it is with a heavy heart that we share that SXSW Sydney has reached its closing chapter and will not be returning in 2026,” SXSW said in a statement.\n\nSXSW has been cancelled for 2026. Photo: SXSW\n\nThe event brought celebrities from film and music to give talks to the public. Picture: NCA NewsWIRE / Monique Harmer\n\nThe organisation said that it had worked with its owners, Penske Media Corporation, and the NSW government to work through issues with the event, but “prevailing market conditions” prevented it going ahead.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“The decision reflects a changing global environment that is impacting major events, festivals and cultural programs worldwide,” the organisation said.\n\nThe event regularly attracts celebrities and powerful figures to give talks or premier films, with Nicole Kidman attending the first event in Sydney and the Kid Laroi giving a keynote session in 2024.\n\nDiverse speakers at the US festival include former President Barack Obama, Elon Musk, Arnold Schwarzenegger, Steven Spielberg, Keanu Reeves, Lizzo, Jenna Ortega and Robert Downey Jr.\n\nMore than 345,000 people attended the 2025 event, a 15 per cent year-on year increase on the previous festival.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSXSW Sydney says it generated an estimated $276 million in total economic impact over its three year run.\n\nThe XPENG X2 Flying car at SXSW Sydney in 2024. Picture: NewsWire / John Appleyard\n\nMore than 63,000 people outside of Sydney would travel to attend the event, with international visitors increasing by 35 per cent in 2025 compared to the year before.\n\n“SXSW Sydney represented an ambitious and meaningful extension of the SXSW brand, and we are incredibly proud of what was built in partnership with the Sydney team, Destination NSW, and the broader creative community,” said Jenny Connelly, Director in Charge of SXSW.\n\nThe event organisers say they are “committed” to their staff and will work “closely with team members to provide appropriate support”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nFans of the event have been quick to share their sadness online.\n\n“As someone who went every year, it became a special place for me, full of curiosity, generosity and the kind of conversations that stay with you long after the event ends,” robotic engineer Michelle Dickinson wrote on social media.\n\n“What a sad day for the Australian events calendar,” another wrote.",
        "source": "Yahoo"
    }
]