[
    {
        "url": "https://www.9news.com.au/national/barnaby-joyce-says-peter-dutton-asked-him-to-quit-politics-before-last-election-over-nuclear-policy/dd3e15f5-2b94-43ba-81ac-52f10d55aea8",
        "title": "Joyce says Dutton 'lost his mind' over refusal to support nuclear",
        "publish_date": "Wed, 23 Jul 2025 01:20:38 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "One-time Nationals leader Barnaby Joyce has claimed Peter Dutton 'lost his mind' over his views on nuclear.\n\nJoyce refused to say in an ABC interview that nuclear power would help bring down energy bills in the run-up to the last election.\n\n\"To be quite frank, the previous leader of the Coalition Peter Dutton said, 'I want to sack you, if you don't believe in net zero you've got to go',\" the Nationals MP told media in Canberra.\n\nMember for New England Barnaby Joyce speaks to the media about net zero at Parliament House. (Dominic Lorrimer)\n\n\"I said, 'Well sack me' and he said, 'I can't sack you, you are too much of a problem'.\"\n\nJoyce was asked by ABC radio's Patricia Karvelas in December if he could promise power prices would be more affordable if the Coalition won the election.\n\n\"That is asking for a hypothetical question, which I could answer for you, but I would not be telling the truth, because I don't have the facts before me,\" he responded at the time.\n\nJoyce today reaffirmed his view that power prices, particularly in regional areas, had become untenable.\n\n\"No one can dispute power prices are going through the roof, no one can dispute that the power grid is become unreliable,\" he said.\n\n\"We are pushing Australians into destitution we have no right to do that.\"\n\nJoyce said former Opposition leader Peter Dutton 'lost his mind' over his refusal to say energy prices would be lower. (James Brickwood)\n\nJoyce and fellow Nationals MP Michael McCormack today claimed they discovered they'd been axed from the shadow ministry and relegated to the backbench in a post-election reshuffle after being asked about it by reporters.\n\nThe former party rivals are now united in support over Joyce's private member pill to repeal net zero.\n\nMcCormack has joined Joyce's campaign against the Coalition-backed policy of net zero by 2050, which Joyce has described as a \"lunatic crusade\".\n\nThe Morrison government said in 2021 it had agreed to aim for net zero emissions by 2050 ﻿, which would mean removing as much greenhouse gas from the atmosphere as what's emitted, so the net amount added is zero.\n\n\"We are trying to achieve net zero something that neither Russia, China, United States, Brazil etc are part of. You are in the minority group here,\" Joyce added.\n\nMichael McCormack and David Littleproud during Question Time at Parliament House in Canberra in 2021. (Alex Ellinghausen)\n\nNationals leader David Littleproud today said net zero was an impossible task and the 2050 goal was \"tearing apart\" regional communities.\n\nREAD MORE: Child victims of human trafficking sex ring found in bunker\n\n\"I think net zero unfortunately has become something about trying to achieve the impossible rather than actually doing what's sensible, and we're bearing the burden of that,\" Littleproud told reporters today.\n\nThe Coalition and Nationals are reviewing their climate and energy policies following May's stunning election defeat.\n\n\"The last two elections we went forward with a policy supporting net zero and we have been handed our political derriere on a plate, haven't we,\" Joyce added.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/almost-3000-range-rovers-recalled-over-fears-passenger-airbag-will-not-work/acacb3bc-79a6-44d9-b5dc-3b60cf5f7ca4",
        "title": "Almost 3000 Range Rovers recalled in Australia over airbag fears",
        "publish_date": "Wed, 23 Jul 2025 00:34:26 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Almost 3000 Range Rovers are being recalled over fears the passenger airbag could tear in an accident.\n\nThe Land Rover recall is for the Evoque model from 2020 to 2024.\n\n\"Due to a manufacturing defect, the passenger airbag may tear during deployment,\" the recall notice said.\n\nAlmost 3000 Range Rovers are being recalled over fears the passenger airbag could tear in an accident. (Drive)\n\n\"This could cause hot gases to escape from the airbag and result in insufficient protection to the passenger.﻿\n\n\"In the event of an accident, the airbag not deploying as intended and hot gas escaping towards the vehicle\" occupants could increase the risk of injury or death to vehicle occupants.﻿\n\nOwners of affected vehicles should contact their Jaguar Land Rover to schedule an appointment to have the passenger airbag replaced free of charge.\n\nMore than 2800 vehicles have been ﻿affected by the recall.\n\nA list of vehicle identification numbers of the affected cars is available on the Department of Transport website .\n\nFor more information, call Jaguar Land Rover Australia's recall hotline﻿ on 1800 625 642.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/aussie-shoppers-splurge-online-ahead-of-expected-rate-cuts/65c93d0d-cb36-46ed-a7d2-d08f67d363a3",
        "title": "Aussie shoppers splurge online ahead of expected rate cuts",
        "publish_date": "Tue, 22 Jul 2025 23:46:17 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Australians have been buying up big online, with anticipated rate cuts and easing inflation tempting shoppers to take advantage of end-of-financial-year sales, according to Australia Post's latest Quarterly eCommerce Report.\n\nAustralians spent $19.2 billion online in the last quarter, figures from the Commonwealth Bank show.\n\nEnd-of-financial-year sales helped drive a 15 per cent increase in online spending in the last quarter of the financial year, with 7.9 million Australian households choosing to shop online, according to Australia Post.\n\nOnline purchases surged in the last quarter on the back of end-of-financial-year sales. (Australia Post)\n\nAustralia Post General Manager Enterprise and Government, Chelsea O'Reilly, said consumer sentiment appeared to be growing more positive.\n\nResponding to easing inflation, the Reserve Bank cut interest rates by a quarter of a per cent in February and again in May, taking the official cash rate down to 3.85 per cent.\n\n\"With inflation cooling and consumer confidence returning, we're seeing more Australians shop online,\" O'Reilly said.\n\nShopper behaviour was also changing, with consumers having higher expectations, she added.\n\n\"Shoppers are spending more, but they're also expecting more in the way of speed, convenience and value. Retailers that put the customer experience first, through faster delivery and more flexible options will stand out in an increasingly competitive landscape.\"\n\nAustralians spent $19.2 billion online in the last quarter, figures from the Commonwealth Bank show. (Glenn Campbell)\n\nDepartment store spending spiked by 28 per cent during the quarter, as shoppers nabbed bargains in the sales.\n\nAustralians were making smaller and more frequent purchases, compared to the previous year, the Australia Post report found, with the average basket size down to $96 – a 1.6 per cent decline compared to 12 months prior.\n\nMillennials spent the most online, racking up a total of $6.9 billion in purchases for the quarter, followed by Gen X ($5.3 billion) and Gen Z ($3.4 billion).\n\nGen Z recorded the biggest increase of any generation, seeing a 16 per cent growth on the previous year.\n\nThe most prolific online shoppers across the country were in Queensland, with residents in Toowoomba, Mackay, and Bundaberg buying the most, followed by residents in Point Cook, Victoria and Mandurah, Western Australia.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/hecs-debt-reduction-how-it-will-change-your-pay-from-july-this-year/763cad42-a590-424e-b7f0-a4920cecb367",
        "title": "PM to act on promise to slash debt for millions today",
        "publish_date": "Tue, 22 Jul 2025 22:20:25 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Prime Minister Anthony Albanese has taken to social media this morning to confirm the government will introduce its much-touted legislation to slash Australians' HECS debt .\n\nThe Labor government made a promise to slash student debt by 20 per cent if re-elected in May and the \"game-changing\" cut was expected to be legislated this week after parliament officially resumed yesterday.\n\nIn a short video posted on X, Albanese said the legislation would be introduced today .\n\n\"We said it would be the first thing that we do and today we're making it happen,\" he said.\n\n\"We're introducing our legislation to cut your student debt by 20 per cent. No application, no forms, just real help with your student debt.﻿\"\n\nThis will impact your student debt balance if you have one and, eventually, your pay.\n\nREAD MORE: US Justice Department to reach out to jailed Epstein associate ﻿\n\nMore than three million Australians are expected to have their student debt cut by 20 per cent next month. (9News)\n\nAfter the passage of the le﻿gislation, the Australian Tax Office (ATO) will apply the 20 per cent reduction and it will be calculated on what that person's debt was as of June 1, 2025.\n\nThe Coalition could decide to support legislation to wipe HECS debt for millions of Australians this week, however Labor will only require Greens support to get a law through the Senate.\n\nShadow Assistant Minister to the Leader of the Opposition Maria Kovacic said on Monday the proposed HECS legislation would be a point of discussion in a party room meeting.\n\nEducation Minister Jason Clare said this week the average Australian with student debt will see $5500 slashed from their $27,640 loan.\n\n\"It'll take a lot of weight off the shoulders of a lot of young Australians who are just out of uni … looking to move out of home or save up to get a mortgage,\" Clare said.\n\n\"You don't start paying off your university degree until your degree starts to pay off for you.\"\n\nHow will it all work?﻿\n\n\"The ATO will automatically apply the 20 per cent reduction to your outstanding debt and retrospectively adjust any indexation applied to your debt,\" CPA Australia's business lead Gavan Ord told 9news.com.au.\n\n\"No action is required from individuals. The government will notify you when the changes are implemented, and balances can be checked via myGov.\"\n\nThis reduction will be applied on top of any repayments made throughout the year after your tax return is completed.\n\nOrd said Australians﻿ should avoid listening to financial advice from online influencers about how to optimise their tax returns.\n\nAustralians﻿ should avoid listening to financial advice from online influencers about how to optimise their tax returns, an expert says. (Dominic Lorrimer)\n\n\"We urge Aussies not to follow misleading advice from social media 'finfluencers' suggesting you delay lodging your tax return,\" he said.\n\n\"Lodging your return is a legal responsibility and essential for accurate assessment.\"\n\nWhat happens if my HECS debt is finally paid off?\n\nCompulsory ﻿HECS repayments aren't allocated to your debt until after you have lodged your tax return.\n\nAfter this, it might mean your debt has reached the all-important zero balance.﻿\n\nIt means yo﻿u will no longer see the compulsory repayments taken out of your weekly, fortnightly or monthly pay.﻿\n\nYou'll need to let your employer know about this though, as it won't automatically stop.\n\nIt involves filling out a tax form ﻿called a \"withholding declaration\", which indicates to your employer that you no longer have a HECS debt.\n\nIt's as simple as ticking the box ﻿\"no\" on the form when it asks if you have a higher Education Loan Program (HELP), VET Student Loan (VSL), Financial Supplement (FS), Student Start-up Loan (SSL) or an Australian Apprenticeship Support Loan (AASL) debt.\n\nOnce your employer stops withholding extra tax, your next paycheck may slightly increase.\n\nCompulsory ﻿HECS repayments aren't allocated to your debt until after you have lodged your tax return. (Getty Images/iStockphoto)\n\nThis amount will vary depending on your salary and what your regular contributions were.﻿\n\nYou have to be earning above the threshold for it to impact﻿ your pay.\n\n﻿Australian taxpayers earning between $54,435 and $62,850 pay one per cent on their income and the figure rises the more you earn.\n\n\"Another proposed change to HECS is raising the income threshold at which people are required to start repaying their debt from $54,435 to $67,000, starting 1 July 2025, subject to the law being changed,\" Ord added.\n\n\"This means that if you earn less than $67,000, you won't need to make repayments, although voluntary repayments remain an option.\n\n\"This change also means your repayments will be lower.\"\n\nIf you've overpaid your HECS debt throughout the previous financial year, the ATO will take this into account and it will be refunded to you when you lodge your tax return.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/coca-cola-donald-trump-approved-version-soft-drink-usa/36549d6f-b914-4940-8ce2-1a8ccd1b7350",
        "title": "Coca-Cola releasing Trump-approved new version of its soft drink",
        "publish_date": "Wed, 23 Jul 2025 00:30:07 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Coca-Cola confirmed that it will release a new Coke made with cane sugar.\n\nThe announcement follows a social media post from President Donald Trump last week in which he claimed he persuaded the company to replace high-fructose corn syrup.\n\nThe company revealed in its earnings report that as \"part of its ongoing innovation agenda,\" it will launch in the autumn an \"offering made with US cane sugar\" as part of its product range.\n\nSome versions of Coke already use cane sugar, including Coca-Cola sold in Mexico.\n\n\"This addition is designed to complement the company's strong core portfolio and offer more choices across occasions and preferences,\" Coca-Cola said in a statement.\n\nCEO James Quincey said on a call with analysts that he thinks the drink \"will be an enduring option for consumers\" and noted that Coca-Cola uses cane sugar in several of its other beverages sold in the US, including lemonade and coffee.\n\nDonald Trump says he has persuade the company to change recipes. (Anadolu via Getty Images)\n\nCane sugar is \"blended into some of our other products, and so we are definitely looking to use the whole toolkit of available sweetening options where there are consumer preferences,\" he said.\n\nLast week, Trump said that Coca-Cola had \"agreed\" to use cane sugar in its colas, but today's announcement reveals that Coke's flagship recipe isn't changing and will continue to use high-fructose corn syrup.\n\nInstead, the company will create a separate Coke product that includes cane sugar.\n\nAmerican-made Coca-Cola is made with high-fructose corn syrup, an ingredient that Trump's Health and Human Services secretary, Robert F. Kennedy, Jr., has aggressively advocated against.\n\nKennedy, who has led the charge to remove many artificial and highly processed ingredients from American foods, has called high-fructose corn syrup a \"formula for making you obese and diabetic\" in a September episode of Dr. Jordan Peterson's podcast.\n\nREAD MORE: Child victims of human trafficking sex ring found in bunker\n\nDonald Trump is claiming to be a key influence behind Coca-Cola's new addition to its range. (CNN)\n\nCorn syrup is a common and cheap sweetener, which is why Coca-Cola made the switch many years ago.\n\nBut sugar-filled soda isn't healthy, health experts say - whether it's made with cane sugar or corn syrup.\n\n\"Excess consumption of sugar from any source harms health,\" Eva Greenthal, senior policy scientist at the Centre for Science in the Public Interest, a nonprofit consumer advocacy group, previously told CNN.\n\n\"To make the US food supply healthier, the Trump administration should focus on less sugar, not different sugar.\"\n\nMeanwhile, rival PepsiCo isn't making any major changes; however, its newly announced prebiotic soda contains cane sugar, as does its recently acquired Poppi brand.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/ozzy-osbourne-dead-at-76-life-in-pictures-black-sabbath-the-osbournes/d1b3656d-7674-4987-88d3-d99289fe35b8",
        "title": "Ozzy Osbourne's wild life in pictures",
        "publish_date": "Tue, 22 Jul 2025 19:58:00 +0000",
        "category": "entertainment",
        "authors": [
            "July"
        ],
        "text": "1 of 26 Attribution: Jordan Strauss/Invision/AP\n\nHeavy metal pioneer, Black Sabbath frontman, and later-life reality TV star Ozzy Osbourne has died aged 76.\n\n\"It is with more sadness than mere words can convey that we have to report that our beloved Ozzy Osbourne has passed away this morning,\" his family said in a statement.\n\n\"He was with his family and surrounded by love. We ask everyone to respect our family privacy at this time.\"\n\nFamed for his outrageous antics on stage, including biting the head off a bat and throwing raw meat onto concertgoers – along with alcohol and substance abuse – Osbourne was respected by the rock establishment and reviled by the religious right, who believed him to be a devil-worshipper.\n\nIn later life he had a second career playing himself in the popular TV show The Osbournes, a fly-on-the-wall family formula later maximised by the Kardashians.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/henley-passport-index-these-are-the-most-powerful-in-the-world-this-year/8d27b4e8-47c5-4813-a2fc-8df884c4b9c4",
        "title": "These are the most powerful passports in the world this year",
        "publish_date": "Tue, 22 Jul 2025 20:27:25 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Every Australian traveller knows how important their passport is, but some might be surprised to learn it just got a little less powerful.\n\nThe little blue book joined its counterparts in the US and UK in a slight drop down the rankings in the latest Henley Passport Index, updated on Tuesday.\n\nThe index counts the number of countries a passport provides visa-free travel, based on International Air Transport Association (IATA) data, to rank their power.\n\nREAD MORE: ﻿ Staggering number of workers about to quit their jobs\n\nSingapore maintained its lead on top of the ranks. (Getty)\n\nIt doesn't take into account how easy it is to move permanently to another country or other factors.\n\nAustralia was fifth alongside Portugal this time last year but dropped to seventh on the latest figures, sitting alongside Czechia, Hungary, Malta and Poland.\n\nAussie travellers now have visa-free access to four fewer countries but it's unclear which ones.\n\nThe UK in sixth with 186 countries and close neighbour New Zealand in fifth with 187 both did a little bit better but also suffered slight falls, down from a tie for fourth.\n\nAsian countries further established their lead over a pack of European nations.\n\nSingapore maintained its lead on top of the ranks with visa-free access to 193 countries while South Korea joined Japan in second with 190 nations.\n\nIt continues a trend established over the past 10 years as the US and UK passports dropped from the most powerful in the world in 2015 and 2014.\n\nSouth Korea joined Japan (pictured) in second with 190 nations. (Getty Images/iStockphoto)\n\nThe US was ranked eighth last year but dropped to 10th, losing easy travel access to four countries to end up with 182.\n\nThe index concept's inventor said global mobility was increasingly competitive.\n\n\"The consolidation we're seeing at the top underscores that access is earned — and must be maintained — through active and strategic diplomacy,\" he said, in a statement.\n\n\"Nations that proactively negotiate visa waivers and nurture reciprocal agreements continue to rise, while the opposite applies to those that are less engaged in such efforts.\"\n\nChina and the United Arab Emirates are key examples, rising dozens of places in the past decade.\n\nKoreans can visit 190 nations. (Getty)\n\nChina has risen from 94th to 60th despite their travellers still needing to apply for visas to the 29 countries in Europe's Schengen area and the UAE surged from 42nd to eight.\n\nHenley said as emerging economies libearlised their visa regimes and invested in diplomacy, legacy powers such as the US and UK appeared to be retreating behind more entry restrictions.\n\n\"Americans are now leading the demand worldwide for alternative residence and citizenship options, with British nationals also among the top five globally,\" Henley and Partners chief executive Dr Juerg Steffen said.\n\nAs the US and UK adopt increasingly inward-looking policies, we're witnessing a marked rise in interest from their citizens seeking greater global access and security.\n\n\"Your passport is no longer just a travel document — it's a reflection of your country's diplomatic influence and international relationships.\n\n\"In an era of growing inequality and mounting geopolitical uncertainty, strategic mobility and citizenship planning are more critical than ever.\"\n\nREAD MORE: ﻿ Man jailed over Bunnings chilli spray that left 11 people in hospital\n\nThe most powerful passports in the world for 2024 revealed View Gallery\n\nHere's the full top 10:\n\n﻿Singapore (193) Japan, South Korea (190) Denmark, Finland, France, Germany, Ireland, Italy, Spain (189) Austria, Belgium, Luxembourg, Netherlands, Norway, Portugal, Sweden (188) Greece, New Zealand, Switzerland (187) ﻿United Kingdom (186) Australia, Czechia, Hungary, Malta, Poland (185) ﻿Canada, Estonia, United Arab Emirates (184) Croatia, Latvia, Slovakia, Slovenia (183) Iceland, Lithuania, USA (182)﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/popstar-ed-sheeran-to-bring-brand-new-music-tour-to-australia-this-summer/34eb01f8-151a-4429-8265-23c921754cae",
        "title": "Popstar Ed Sheeran to bring new music tour to Australia this summer",
        "publish_date": "Tue, 22 Jul 2025 10:08:17 +0000",
        "category": "entertainment",
        "authors": [
            "Jul"
        ],
        "text": "Global pop superstar Ed Sheeran will return to Australia and New Zealand this summer to kick off a new tour.\n\nFrontier Touring and MG Live today announced Sheeran will visit in January for his Loop Tour.\n\nThe announcement comes ahead of the release of the British singer-songwriter's album Play on September 12.\n\nEd Sheeran is coming back Down Under. (Bradley Collyer/Press Association/AP)\n\nEight shows are on the cards for Aussie fans, including one Perth show, two each in Brisbane, Sydney and Melbourne, and one in Adelaide.\n\nSheeran will also play to Kiwi crowds in Auckland, Wellington and Christchurch from January 16 before heading across the Tasman.\n\nPre-sale tickets will become available on Friday for Telstra Plus members and Monday July 28 for Frontier members.\n\nTickets go on sale to the general ﻿public on Tuesday, July 29.\n\nSheeran has not played to Aussie fans since 2023, when he journeyed Down Under for his record-breaking Mathematics tour.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/donald-trump-united-states-trade-deal-japan-shigeru-ishiba/105562448",
        "title": "Trump says 'massive' trade deal with Japan has been struck",
        "publish_date": "Wed, 23 Jul 2025 02:11:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "US President Donald Trump has announced a trade deal with Japan he says will result in Japan investing $US550 billion ($842 billion) into the United States and paying a 15 per cent reciprocal tariff.\n\nIn a post on Truth Social, Mr Trump added that Japan would open to trade for cars, trucks, rice and certain agricultural products, among other items.\n\n\"This Deal will create Hundreds of Thousands of Jobs — There has never been anything like it,\" Mr Trump posted on Truth Social.\n\nHe added that the US would \"continue to always have a great relationship with the Country of Japan\".\n\nMr Trump says Japan will invest into the US and will \"open\" its economy to American autos and rice. (Reuters: Kim Kyung-Hoon)\n\nMr Trump said Japan would invest \"at my direction\" $US550 billion into the US and would \"open\" its economy to American automobiles and rice.\n\nThe 15 per cent tax on imported Japanese goods was a meaningful drop from the 25 per cent rate that Mr Trump, in a recent letter to Japanese Prime Minister Shigeru Ishiba, said would be levied from August 1.\n\nHis announcement follows a meeting with Japan's top tariff negotiator, Ryosei Akazawa, at the White House on Tuesday, according to the Asahi newspaper.\n\nThe newspaper also reported that Mr Akazawa held meetings with US Commerce Secretary Howard Lutnick and Treasury Secretary Scott Bessent.\n\nJapanese prime minister facing growing opposition\n\nJapanese Prime Minister Shigeru Ishiba is planning to soon decide whether to step down after assessing progress in tariff negotiations with the US, Yomiuri newspaper reported on Wednesday.\n\nMr Ishiba is facing growing opposition from within his Liberal Democratic Party for his vow to stay in power despite the ruling coalition's bruising defeat in Sunday's upper house election.\n\nAccording to Yomiuri, Mr Ishiba told his close associates on Tuesday evening that he would explain how he would take responsibility for the election loss once a solution was reached on trade negotiations.\n\nJapanese Prime Minister Shigeru Ishiba with US Treasury Secretary Scott Bessent. (AP: Shuji Kajiyama)\n\nSpeaking after Mr Trump's post, Ishiba said he was ready to meet or speak over the phone with Trump after being briefed on the details by Japan's top trade negotiator Ryosei Akazawa, who has been in Washington for trade talks.\n\n\"I can't say until I scrutinise the outcome of the agreement,\" Mr Ishiba told reporters when asked how the deal with Washington could affect his decision on whether to step down.\n\nIn explaining his decision to stay on, Mr Ishiba has stressed the need to avoid creating a political vacuum as Japan faces challenges including difficult trade negotiations with the US that would have a huge impact on the export-reliant economy.\n\n\"I will stay in office and do everything in my power to chart a path toward resolving these challenges,\" Mr Ishiba said in a news conference on Monday.\n\nHe added that he intended to speak directly with Mr Trump as soon as possible and deliver tangible results.\n\nMr Ishiba is expected to meet ruling party heavyweights later on Wednesday for discussions on the election outcome.\n\nTariffs still a source of uncertainty\n\nThe wave of tariffs continues to be a source of uncertainty in the US about whether it could lead to higher prices for consumers and businesses if companies simply pass along the costs.\n\nAs the August 1 deadline for the tariff rates in his letters to world leaders approached, Mr Trump also announced a trade framework with the Philippines that would impose a tariff of 19 per cent on its goods, while American-made products would face no import taxes.\n\nThe president also reaffirmed his 19 per cent tariffs on Indonesia.\n\nDonald Trump announces trade deal with Indonesia with a 19 per cent levy to be imposed Photo shows US President Donald Trump points while speaking to reporters The US president announces the agreement on his social media platform but provides no further details on the deal.\n\nAt a dinner on Tuesday, local time, Mr Trump said the EU would be in Washington today for trade talks.\n\nEarlier this month, the president sent a letter threatening the 27 member states in the EU with 30 per cent taxes on their goods, to be imposed starting on August 1.\n\nThe Trump administration has a separate negotiating period with China that is currently set to run through August 12 as goods from that nation are taxed at an additional 30 per cent baseline.\n\nTreasury Secretary Scott Bessent said he would be in the Swedish capital of Stockholm next Monday and Tuesday to meet with his Chinese counterparts.\n\nMr Bessent said his goal was to shift the American economy away from consumption and to enable more consumer spending in the manufacturing-heavy Chinese economy.\n\n\"President Trump is remaking the US into a manufacturing economy,\" Mr Bessent said on the Fox Business Network show Mornings with Maria.\n\n\"If we could do that together, we do more manufacturing, they do more consumption. That would be a home run for the global economy.\"\n\nWires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/cal-bruton-broome-basketball-tribute-mark-manado-tournament/105541830",
        "title": "Basketball legend pays tribute to mentor with new tournament for kids",
        "publish_date": "Wed, 23 Jul 2025 01:59:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "A desire to carry on the legacy of a lifelong friend has drawn an Australian Basketball Hall of Famer to Western Australia's far north to support local children and players.\n\nA championship-winning player and coach across multiple decades in the NBL, Cal Bruton travelled to Broome, 2,000 kilometres north of Perth, to honour the work of his friend, longtime local and coach Mark Manado.\n\nMr Manado, who died late last year, was a pillar of the Broome community, a former councillor and active figure in local basketball.\n\nChildren participate in the inaugural Mark Manado Basketball Tournament. (ABC Kimberley: Ruby Littler)\n\nIn collaboration with the Broome Youth and Community Hub, Bruton helped launch the inaugural Mark Manado Tournament, an event they hoped would become an annual tradition.\n\nThe tournament brought together teams of local children and teenagers who regularly trained and played at the community centre.\n\nCoaches led a series of training sessions and skill-building drills over three days.\n\n\"Mark left a huge legacy because [there was] everyone in his classes, people, his relatives, all the young Indigenous kids that are keen to play sport,\" Bruton said.\n\n\" But he was more than that. He wanted inclusiveness … Mark would leave out no-one. \"\n\nThe tournament coincided with the opening of upgrades to the Broome Youth and Community Centres basketball courts, spearheaded by Bruton.\n\nVehicle to better futures\n\nMr Manado taught at the local TAFE and was a part of the first Broome Indigenous-majority shire council in 2011.\n\nAlongside football, basketball has provided a key outlet for children in a region where youth issues remained a significant policy challenge.\n\nMark Manado was a beloved Broome community member who died from health complications last year. (Supplied)\n\nMr Manado was a mentor in Bruton's life, showing him around the Kimberley's vast outback, leading to Bruton's active involvement in basketball clinics across the region.\n\nBruton, who is an American-born Australian former professional basketball player and coach, said his own upbringing in Brooklyn highlighted the importance the sport could play.\n\nCal Bruton commemorates his late friend through sport. (ABC Kimberley: Ruby Littler)\n\n\"Basketball is a sport that unites everyone and it's a tremendous vehicle towards health, employment, and further education,\" he said.\n\n\" We feel that if a kid is on the right track and playing sport in a safe environment and culture, then they can succeed at any space. \"\n\nMr Manado's granddaughter, Teahni, said she had fond memories of the pair playing basketball together, describing the sport as a big part of their life.\n\nTeahni Manado says her pop was a kind-hearted man who loved playing basketball. (ABC Kimberley: Ruby Littler)\n\n\"My pop was a beautiful man. He always made me smile and made me laugh,\" she said.\n\n\"We are celebrating the Mark tournament and we're celebrating my pops' legacy with all my family and friends.\"\n\nUpgrades for court\n\nThe drop-in centre has been a part of the Broome community for nearly 40 years, according to the Broome Youth and Community Hub chief executive, Melinda Phillips.\n\nThe Broome Youth and Families hub's basketball court has been upgraded. (ABC Kimberley: Ruby Littler)\n\nShe said kids had come to the centre to connect, learn and have fun after school and on weekends for decades.\n\n\"We got an email from Cal back in March and he expressed he wanted to do a tribute to his friend Mark Manado and look at opportunities at how we could uplift the centre and support the young people that come here,\" Ms Phillips said.\n\n\" That sort of steamrolled into a clinic, a tournament … which is a tribute to Mark Manado. \"\n\nShe said sporting activities had always been an important part of the service the centre tried to offer.\n\nAs part of the project, the hub's long-worn court was revitalised with fresh paint, adjustable hoops, and a new grandstand named in Mr Manado's honour.\n\nMelinda Phillips says she is thrilled with the upgrades to the drop-in centre's basketball court. (ABC Kimberley: Ruby Littler)\n\n\"If you feel a part of something, that belonging, it gives people, especially young people, an opportunity to not just be a part of a team, but to challenge themselves individually as well,\" Ms Phillips said.\n\n\" Sport gives anyone the chance to reach their own capacity of where they want to be. You can have fun, it can be social, it can be competitive. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/shubman-gill-india-england-spirit-of-cricket/105562100",
        "title": "India captain ignites new 'spirit of cricket' debate after England clash",
        "publish_date": "Wed, 23 Jul 2025 01:18:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "England Test captain Ben Stokes says his players will not take any steps back after tensions flared between his side and India in last week's third Test at Lord's.\n\nThings came to a head after India captain Shubman Gill was angered by England openers Ben Duckett and Zak Crawley slowing down play late on day three.\n\nThe pair were late to the crease and then Crawley called for trainers after being hit on the finger, ensuring India only got in one over before stumps.\n\nGill sarcastically clapped England batters' over delays during play and the team surrounded the openers as frustration grew, as England set India 193 runs to win, setting up a 22-run win to take a 2-1 lead in the series.\n\nGill defended his heated exchange with Duckett and Crawley, saying England's 90-second delay in taking to the crease was not \"in the spirit of the game\".\n\n\"A lot of people have been talking about it, so let me just clear the air for once and for all,\" Gill said on the eve of the fourth match.\n\n\"The English batsmen on [day three] had 7 minutes of play left. They were 90 seconds late to come to the crease — not 10, not 20, 90 seconds late.\n\n\"Yes, most of the teams do this … but there's a manner to do it.\n\n\"If you get hit on your body, the physios are allowed to come on, and that is fair. But to be able to come 90 seconds late [to] the crease is not something that I would think comes in the spirit of the game.\"\n\nFast bowler Mohammed Siraj roared in the face of England opener Ben Duckett after taking his wicket, the pair bumping shoulders as Duckett trudged off.\n\nGill said those moments were on the back of a build-up of \"a lot of things that we thought should not have happened\", but admitted he was not proud of his actions in getting in the face of England batters.\n\n\"We had no intention of doing that whatsoever. But it just … you're playing a game, you're playing to win, and there are a lot of emotions involved,\" he said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"And when you see there are things happening that should not happen, sometimes the emotions come out of nowhere.\"\n\nThat sentiment was echoed by Stokes.\n\n\"I don't think either team is really looking to do that,\" he said.\n\n\"I think there's just always going to be a moment in a Test series where something does heat up.\n\n\"It's a massive series, there's a lot of pressure on both teams to go out and perform, so there's going to be some moments and some heat showing.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nABC/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/taxpayers-to-foot-bill-for-chevron-wa-gas-project-clean-up/105530034",
        "title": "Taxpayers face $500m clean-up bill for Chevron oil and gas project",
        "publish_date": "Wed, 23 Jul 2025 01:03:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Taxpayers face a potential $500 million bill to clean up aging oil and gas infrastructure left by Chevron off Western Australia's Pilbara, newly released state government documents reveal.\n\nThe oil and gas giant is preparing to decommission its WA Oil project on Barrow Island, 50 kilometres north-west of Karratha, which ceased production in May after 60 years of operation.\n\nThe process requires Chevron to cap 900 oil wells and rehabilitate areas of the island impacted by the project.\n\nThe exact cost of safely closing down the facility was previously unclear.\n\nBut documents released after a Freedom of Information request by independent energy and climate journalist Peter Milne, and seen by the ABC, indicated state and federal governments would contribute at least half a billion dollars of the estimated $2.3 billion bill.\n\nDecommissioning Chevron's WA Oil operations is expected to cost at least $2.3 billion. (Supplied: Chevron)\n\nThe growing taxpayer liability stems from a 1985 agreement allowing Chevron to be refunded royalties to cover 40 per cent of the cost of the first four years of decommissioning.\n\nSince operations began at Barrow Island in 1967, Chevron has paid more than $1 billion in royalties to the federal and WA governments, in a 75/25 per cent split.\n\nReporting prompts bureaucrats' calculations\n\nMilne's request led to the release of several 2022 emails from within WA's Department of Mines, Petroleum and Exploration (DMPE), as well as briefing notes to then-mines and petroleum minister Bill Johnston.\n\nAll of the documents have been heavily redacted.\n\nOne email revealed that total clean-up and rehabilitation costs at Barrow Island were expected to surpass $2.3 billion.\n\nBut a separate email showed the department had not calculated how much of that WA would have to pay, and only made efforts to do so after being alerted to the situation by media reports.\n\nA 1985 agreement allows Chevron to access refunded state and federal royalties. (ABC News: Ashleigh Davis)\n\nIn 2022, Milne reported that an internal Chevron document put the cost of the first four years of the Barrow Island clean-up — which the company is eligible to be compensated for — at $1.3 billion.\n\nIt is this figure that the department referenced in the email.\n\n\"[The department] intends to approach Chevron directly to request cost estimates,\" the email read.\n\n\"Until we are able to glean such details, we only have what has been reported in the media.\n\n\"Based on that, the 'refund' from the State govt is: $1.29 billion x 0.4 x 0.25 = $129 million.\"\n\nUnder the 75/25 split between the federal and state governments spelled out in the 1985 agreement, the Commonwealth would be required to refund $387 million to Chevron.\n\nChevron says the company and its partners will pay the majority of decommissioning costs. (Supplied: Chevron)\n\nShadow Mines and Petroleum Minister Shane Love has questioned the fairness of the deal.\n\n\"You'd have to question the intergenerational fairness of a government of the day taking the royalties and then asking the generation of the future to pay for the share of the cost of the rehabilitation,\" Mr Love said.\n\nThe criticism was echoed by progressive think tank The Australia Institute.\n\nPrincipal advisor Mark Ogge said it was an outrage Chevron could access state and federal funding to meet its environmental liabilities.\n\n\"It's a massive giveaway of Australian taxpayers' money to a company that's already on an unbelievably good deal,\" Mr Ogge said.\n\n\" We just can't understand how our governments just aren't acting in our interests. \"\n\nCost to taxpayers still not known\n\nA Department of Mines, Petroleum and Exploration spokesperson said the department still did not know the total cost the state government may need to pay in the decommissioning process.\n\n\n\n\"The total amount of any potential refund will not be known until West Australian Petroleum Pty Ltd submits its final royalty returns and the department has reviewed and audited the company’s rehabilitation and decommissioning costs,\" the statement read.\n\nChevron declined to be interviewed but provided a statement.\n\nChevron's Gorgon Project continues to operate on Barrow Island. (Supplied: Chevron)\n\n\"Under relevant state legislation, which has been in place for the past four decades, costs for eligible WA Oil decommissioning activities can be partially refunded from previously paid royalties,\" the statement read.\n\n\"While costs may be partially refunded, Chevron Australian and its WA Oil joint venture partners will continue to pay the vast majority of the decommissioning costs, given the strict rules outlined in the legislation.\n\n\"We will continue to engage with state and federal governments in relation to the WA Oil decommissioning project and the administration of the royalty regime.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/busselton-residents-struggle-to-get-mobile-signal/105554198",
        "title": "Signal shortfall frustrates Busselton locals desperate for service",
        "publish_date": "Wed, 23 Jul 2025 00:01:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Residents in the West Australian tourism hub of Busselton say frequent dropouts in phone and internet service are an unacceptable impost on public safety and trade.\n\nThe situation left a family in a life-threatening situation and unable to call triple-0 as a fire swept through their property earlier this year.\n\nJane Bennett lives on a rural property within the City of Busselton, about 230 kilometres south of Perth and a 20-minute drive to Busselton's CBD.\n\nIn January, her husband Owen Bennett was faced with the daunting task of battling a fire on his own, unable to call for help because of an unplanned outage of a nearby phone tower.\n\nA fire crossed Vasse Highway in Yoganup on January 16 this year. (Supplied)\n\n\"He's in direct line of sight to the tower, which is about a kilometre away, and he's calling triple-0 and it doesn't connect,\" Ms Bennett said.\n\n\"He was in panic.\"\n\nMs Bennett said her husband managed to find a signal on a neighbour's property and it was a \"miracle\" their house was saved when firefighters arrived an hour later.\n\nShe said when they asked Telstra about the unplanned outage they were told it was caused by a severed fibre-optic cable at Bridgetown, 80 kilometres away.\n\nTelstra told the Bennetts the cable was \"cut due to nearby third-party excavation works\".\n\nOwen Bennett battled the fire on his own in a desperate scramble to save his family home. (Supplied)\n\nAs Australia's national operator of the triple-0 service, Telstra is required to have fail-safe systems and processes for emergencies.\n\n\"In our case, this all failed,\" Ms Bennett said.\n\nA Telstra spokesperson said residents were informed of outages on its website.\n\n\"We are very saddened to hear of any damage or loss due to natural disasters,\" the spokesperson said.\n\n\"In times of mobile outages, it's important that households have access to a second form of connectivity as a back-up — this could be fixed NBN, satellite or landline services.\"\n\nEffect on local business\n\nBusinesses in the heart of Busselton said they wanted better telecommunications, saying it was important to cope with demand during peak holiday periods and the dropouts were a public safety issue.\n\nVictoria Yuen says the situation is embarassing. (Supplied)\n\nBusselton Chamber of Commerce chief executive Victoria Yuen said connectivity was a big issue hitting business bottom lines, particularly in the busy summer months when pressure on telecommunications was at its peak.\n\n\"The main issues are dropouts of phones,\" she said.\n\n\"Dropouts when people are trying to work from home. Payment systems not working.\n\n\" If people can't tap and buy a coffee from a coffee shop, they can't run their business. \"\n\nMs Yuen said she had been pushing for improved telecommunications infrastructure in Busselton for years but the issue was largely overlooked.\n\nShe said it was embarrassing that business owners had to walk to the end of their driveway to get a decent phone signal.\n\n\"We can't just keep saying, 'Oh it's OK. This is what happens,'\" Ms Yuen said.\n\n\"No, that's not a decent enough excuse anymore.\"\n\nNeed for infrastructure\n\nThe City of Busselton is home to more than 40,000 people, according to the 2021 census, and is considered one of the fastest growing regional cities in WA.\n\nBusselton Mayor Phill Cronin said phone and internet coverage had diminished in the area over the past five years, which he believed was due to inadequate telecommunications infrastructure.\n\nPhill Cronin says connectivity issues in the area are concerning. (Supplied: Phill Cronin)\n\n\"I've heard sometimes they [telecommunications companies] are unable to put towers up because they can't get the power to the towers,\" he said.\n\n\"It's a whole-of-infrastructure issue that really does need to be addressed.\"\n\nCr Cronin said the council had received a number of reports from concerned residents about the issue.\n\n\"We've seen unfortunately during some recent fires where one of the towers was down, the DFES emergency warnings weren't being sent out and people weren't even able to make triple-0 calls,\" he said.\n\n\"That is a major concern for our community.\"\n\nCouncils push for federal assistance for mobile black spots Photo shows A grey-haired, bearded man sits at an office desk. A West Australian local government has drawn a \"line in the sand\" against using ratepayer funds to fix mobile coverage black spots, which it says is the federal responsibility.\n\nThe mayor said he had reached out to federal Communications Minister Michelle Rowland about the issue.\n\n\"Communications is predominantly the responsibility of the federal [government], but the infrastructure is a state responsibility,\" he said.\n\n\"If the area is expected to grow, and it will continue to grow, we need the infrastructure here in place before that can occur.\"\n\nLast month, South West councils voted to ask the WA Local Government Association (WALGA) to lobby the state and federal governments for improved telecommunication infrastructure.\n\nA state government spokesperson told the ABC they had continued to co-invest in projects which increased capacity and strengthened the resilience of telecommunications in regional businesses and communities.\n\nMs Rowland was contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/usopc-bans-transgender-athletes-from-olympics-and-paralympics/105561928",
        "title": "Transgender athletes effectively banned from US Olympics team",
        "publish_date": "Tue, 22 Jul 2025 23:15:42 +0000",
        "category": "sports",
        "authors": [],
        "text": "The US Olympic and Paralympic Committee (USOPC) has effectively barred transgender women from competing in women's sports, telling the federations overseeing swimming, athletics and other sports it has an \"obligation to comply\" with an executive order issued by President Donald Trump.\n\nThe change, announced on Monday with a quiet edit on the USOPC's website and confirmed in a letter sent to national sport governing bodies, follows a similar step taken by the National Collegiate Athletic Association (NCAA) earlier this year.\n\nThe USOPC change is noted obliquely as a detail under \"USOPC Athlete Safety Policy\" and references Trump's executive order, Keeping Men Out of Women's Sports, signed in February. That order, among other things, threatens to \"rescind all funds\" from organisations that allow transgender athlete participation in women's sports.\n\nLoading...\n\nUS Olympic officials told the national governing bodies they would need to follow suit, adding that \"the USOPC has engaged in a series of respectful and constructive conversations with federal officials\" since Trump signed the order.\n\n\"As a federally chartered organisation, we have an obligation to comply with federal expectations,\" USOPC chief executive Sarah Hirshland and president Gene Sykes wrote in a letter.\n\n\"Our revised policy emphasises the importance of ensuring fair and safe competition environments for women. All National Governing Bodies are required to update their applicable policies in alignment.\"\n\nThe nationwide battle over transgender girls on girls' and women's sports teams has played out at both the state and federal levels as Republicans portray the issue as a fight for athletic fairness.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nMore than two dozen states have enacted laws barring transgender women and girls from participating in certain sports competitions.\n\nSome policies have been blocked in court by those who say the policies are discriminatory, cruel and unnecessarily target a tiny niche of athletes.\n\nThe NCAA changed its participation policy for transgender athletes to limit competition in women's sports to athletes assigned female at birth.\n\nThat change came a day after Trump signed the executive order intended to ban transgender athletes from girls' and women's sports.\n\nFemale eligibility is a key issue for the International Olympic Committee (IOC) under its new president, Kirsty Coventry.\n\nThe IOC has allowed individual sports federations to set their own rules at the Olympics — and some have already taken steps on the topic.\n\nStricter rules on transgender athletes — barring from women's events anyone who went through male puberty — have been passed by swimming, cycling and track and field.\n\nSoccer is reviewing its eligibility rules for women and could set limits on testosterone.\n\nTrump has said he wants the IOC to change everything \"having to do with this absolutely ridiculous subject\".\n\nLos Angeles will host the Summer Games in 2028.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/england-italy-euro-semifinal-extra-time-chloe-kelly/105561930",
        "title": "'This is a movie': England leaves it late to beat Italy and return to Euros final",
        "publish_date": "Tue, 22 Jul 2025 23:08:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "Chloe Kelly has fired home the rebound from her own penalty to net a 119th-minute winner as reigning champions England pulled off a stunning comeback to beat Italy 2-1 after extra time and reach the Women's European Championship final.\n\nEngland fell behind in the first half and did not hit back until Michelle Agyemang's equaliser 6 minutes into second-half stoppage time to send the game to extra time.\n\nAnd when Emma Severini pulled down Beth Mead in the box in extra time, Kelly grabbed the chance to decide the game.\n\nHer first effort was saved but she was quick off the mark to rifle in the rebound and send England through to the final against Spain or Germany.\n\n\"We're going to make a movie some day. Well, this is a movie,\" England manager Sarina Wigeman said.\n\n\"My goodness, it's unbelievable. Here we are again, it's really, really special.\"\n\nWith the Italians riding a wave of confidence after a last-minute winner against Norway in their quarterfinal, they defended brilliantly and attacked incisively on the break.\n\nTheir persistence paid off in the 33rd minute of a gritty semifinal when a ball from the right found its way to Barbara Bonansea, who took a touch before lashing it into the roof of the net.\n\nEngland then dominated possession and created a slew of chances as the Italians rode their luck, but too often the English attackers unleashed shots from distance that were easily dealt with or flew harmlessly over the bar.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nWith their hopes of defending their title slowly slipping away, 19-year-old substitute Agyemang snapped up a loose ball in the box and fired home to send the game to extra time.\n\nAgyemang almost scored again with an effort deep into the second half of extra time, out-sprinting and out-muscling the Italian defence only to see her deft lob towards goal bounce back off the crossbar.\n\nSensing they could avoid a repeat of their quarterfinal penalty shootout against Sweden, England poured forward and reaped the reward when Mead was fouled in the box, but there was one more twist in the tale.\n\nKelly took her usual prancing run-up, but Italian goalkeeper Laura Giuliani kept her nerve and saved, only for the England winger to score from the follow-up and seal her side's spot in Sunday's final in Basel.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/auski-roadhouse-foreign-workers-keep-trucking-industry-going/105465914",
        "title": "It's 'hot like hell' and the work isn't easy at this remote roadhouse",
        "publish_date": "Tue, 22 Jul 2025 23:00:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "Auski Roadhouse is not the kind of place featured in Australia's multi-million-dollar tourism campaigns.\n\nTemperatures at the remote fuel stop, 1,368 kilometres north of Perth along the Great Northern Highway, routinely hit the mid-40s in summer.\n\nFlies swarm anything moving and the nearest town is more than 150km away.\n\nFor its mostly foreign workforce, it can be a daunting gig.\n\nThe Auski roadhouse offers respite to weary travellers driving through the Pilbara's rocky ranges. (ABC Pilbara: Charlie McLean)\n\nSomething acknowledged by its manager, Lee Beaton, who shared the story of one Italian worker's first day.\n\n\"When we got to the roadhouse, she was crying,\" he said.\n\n\"She said, 'It's isolated. There's no shops. Where can I buy things? Where can I get coffee?'\n\n\"And she ended up staying for 14 months and just loved it.\"\n\nThe roadhouse's 22 foreign staff enable it to stay open 16 hours a day, keeping valuable trucks and road trains on the move.\n\nAuski has the only fuel between Newman and Port Hedland, a stretch of road linking some of the country's most valuable iron ore mines with its largest export terminal.\n\n'Hell' on arrival\n\nVietnamese-born cashier and barista Han Nguyen described her first summer at the roadhouse as like entering an inferno.\n\n\"It's hot like hell,\" she said.\n\nLike many of her peers, working here wasn't a dream, but a necessity.\n\nTwenty-two foreign workers keep the Auski Roadhouse open for 16 hours a day. (ABC Pilbara: Charlie McLean)\n\nMs Nguyen was living in Sydney on a one-year working holiday visa, and was keen to stay in the country longer.\n\nThat meant working somewhere remote to help the federal government's efforts to address labour shortages.\n\n\"So I just posted on a Facebook group chat that I was looking for a job,\" she said.\n\n\"And the HR manager [for the roadhouse] saw my post and contacted me.\"\n\nThe roadhouse's Australian staff affectionately call Han Nguyen \"Han Superdry\" after the popular beer brand. (ABC Pilbara: Charlie Mclean)\n\nFive months on, the 32-year-old, dubbed \"Han Superdry\" by the Australian staff, said she had no regrets.\n\n\"I take it as a moment for me to reflect and go back to myself,\" she said.\n\n\"I need some time to think further for my plan.\"\n\nEscape and confinement\n\nFor others, the predictable patterns of roadhouse life were a blessing and a curse.\n\n\"Every day is kind of the same and not much changes,\" Slovakian receptionist Katarina Virgovicova said.\n\n\"It forces you to confront things because you have that time to yourself, I guess. Maybe too much time.\"\n\nKatarina Virgovicova says the slow-paced lifestyle forces her to reflect on her life so far. (ABC Pilbara: Charlie McLean)\n\nSome of that time is spent reflecting on the lives of the truck drivers who pass through every day.\n\n\"Sometimes I would compare the truck drivers to pirates,\" she said.\n\n\"Like Pirates of the Caribbean. They're kind of travelling everywhere and they have no home.\n\n\" They're like adventurers, you know? \"\n\nFrench cashier Celia Guzman was well aware there were more glamorous work options for travellers in Australia, having lived in Queensland and the Northern Territory.\n\nBut the gig at Auski was a chance to earn more and burn less.\n\n\"In Australia, you can earn a lot of money, but you can spend also a lot of money,\" Ms Guzman said.\n\nCelia Guzman serves food to truck drivers and weary travellers. (ABC Pilbara: Charlie Mclean)\n\nStaff at Auski pay only a modest weekly rent for their rooms and are provided with all their meals.\n\n\"I think it's a good time for us to make money,\" Ms Guzman said.\n\nAnd at times, the 28-year-old saw being confined to the roadhouse as an escape from her responsibilities back home.\n\n\"Now I have this time only for me and I don't have a choice to stay here. So [my attitude is] let's do it,\" she said.\n\n\"I have no excuse to do everything I have to do, like thinking of my future or even something on my computer [that is stressful].\"\n\nAn experience like no other\n\nWhen asked whether she would recommend the roadhouse experience to others, Ms Virgovicova said it depended on one's appetite for adventure.\n\nThe roadhouse's foreign staff say it is a job suited to people with a strong curiosity about the world. (ABC Pilbara: Charlie Mclean)\n\n\"The environment is so special and so strange that you can't really compare this to anywhere else in the world. Maybe only somewhere like Antarctica,\" she said\n\n\"If you want to experience something cool and something that not everyone does, then you should try it.\n\n\" But be prepared that it's not going to be easy. \"\n\nMr Beaton is just glad there are enough people game enough to try.\n\n\"They do a wonderful job for us, a wonderful job,\" he said.\n\n\"I'm very pleased to have them.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/tobias-johannessen-collapses-on-mont-ventoux-tour-de-france/105561744",
        "title": "Norwegian rider hopeful of continuing Le Tour after mountaintop collapse",
        "publish_date": "Tue, 22 Jul 2025 22:31:13 +0000",
        "category": "sports",
        "authors": [],
        "text": "Norwegian cyclist Tobias Johannessen has collapsed at the finish line atop Mont Ventoux after stage 16 of the Tour de France.\n\nJohannessen was taken to hospital after being given oxygen by a race doctor immediately after finishing the stage, where he at times looked in physical pain, clutching at his stomach and chest.\n\nJohannessen retained eighth place in the general classifications despite his struggles on the stage, won by Frenchman Valentin Paret-Peintre.\n\nTobias Johannessen said he struggled with his breathing but was hopeful of returning for stage 17. (Getty Images: Tim de Waele)\n\nJohannessen's Uno-X team said he \"suffered some right-sided upper abdominal pain during the final climb today\" before being taken to \"local hospital for further checks\".\n\nHe later returned to the team hotel, telling Norwegian media he struggled with his stomach and hyperventilation during the stage but had been given the all clear after tests at the hospital.\n\n\"When I crossed the finish line, I just had to lie on my back to catch my breath,\" he told TV2, adding a decision was still to be made about whether he would continue in the race.\n\n\" We will do another round of tests tomorrow, but I am positive. Everything we have done looks very good … so we will most likely be ready again tomorrow. \"\n\nMeanwhile, Soudal-Quick Step rider Paret-Peintre gave France its first win of this year's Tour by edging out Ireland's Ben Healy in a heart-pounding sprint finale on the Giant of Provence.\n\n\"I honestly didn't believe it,\" he said.\n\n\"I thought [leader Tadej] Pogačar would go for victory today. But when we built a real gap, I told myself, 'You can't let a win on Mont Ventoux slip through your fingers.'\"\n\nSeven riders surged ahead from an early breakaway, carving out a healthy 6 minute and 30 second buffer as they reached the base of the climb.\n\nSpanish climber Enric Mas led the charge, attacking solo 14.2 kilometres from the summit as Paret-Peintre, Healy and Colombia's Santiago Buitrago gave chase.\n\nBelgian Ilan Van Wilder fought his way back to the group and dug deep for teammate Paret-Peintre to keep the Pogačar-Jonas Vingegaard threat at bay.\n\nThe Tour de France climb with a deadly history Photo shows Tadej Pogačar rides up a mountain in the yellow jersey The ascent to hell on the punishing slopes of Mont Ventoux is one of the Tour de France's most formidable and iconic theatres and has a history dotted with drama and tragedy.\n\nVingegaard had attacked a handful of times, the first attempt coming 9 kilometres from the top, but could not shake off Pogačar.\n\nWith 400 metres to go and the gradient spiking to a lung-scorching 10 per cent, Healy launched his sprint but Paret-Peintre clung to his wheel.\n\nIn the final metres, he surged past, claiming not just a stage win, but also a place in French cycling folklore.\n\nHe was only the fifth Frenchman to conquer the Ventoux, the mountain that claimed the life of Tom Simpson, who died in hospital after collapsing in the finale of the ascent in 1967.\n\nPogačar remained unshakable in yellow, fending off Vingegaard on the brutal 21.5km ascent averaging 7.5 per cent.\n\nDefending champion Pogačar clawed two more seconds from his Danish rival in a final surge to extend his overall lead to 4:15 after setting the record for the climb, riding up in 54:41— 1:10 faster than the previous best mark set by Spain's Iban Mayo in 2004.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe Slovenian also beat the fastest time from the Saint-Esteve bend, where the toughest section starts by clocking 44:48. The previous record was held by the late Marco Pantani (46:00).\n\n\"I had a bad day in 2021 on the Ventoux. Today was the opposite. I had good legs. I enjoyed myself,\" Pogačar, chasing a fourth Tour title, said.\n\n\"We will try to go for another stage win. He [Vingegaard] attacked a lot of times but I knew that I could follow the wheel.\"\n\nVingegaard suffered a brief crash after the line but said his performance gave him confidence that he was still in contention for a third title.\n\n\"How I felt good today gives me motivation,\" he said.\n\n\"I will keep trying.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nABC/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/educators-share-child-care-red-flags-for-anxious-parents/105559534",
        "title": "Educators reveal childcare red flags for anxious parents to watch for",
        "publish_date": "Tue, 22 Jul 2025 22:07:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "For some parents, child care drop-off may create unsettling or anxious feelings.\n\nWill there be enough educators? Who is that new casual carer?\n\nChildcare leaders say they understand the distress parents are experiencing after allegations of physical abuse and sexual abuse in childcare centres in Victoria, New South Wales and Queensland.\n\nChildren are being exposed to childcare staff who lack basic training, an ABC investigation has revealed, and multiple states have committed to sector-wide reforms.\n\nChildcare workers say some centres are doing their best to ensure child safety. (ABC News: Dane Hirst)\n\nSydney educator and childcare centre assistant director Arianne, who asked for her surname not to be used, said it was difficult for parents to trust the childcare environment.\n\n\"If I was a parent, I'd be making sure that all rooms were completely open,\" she said.\n\n\"How is the turnover of staff? Do the fees that you pay go back into your centre? Just asking loads and loads of questions.\"\n\nDiscrepancies across centres\n\nArianne said her centre went beyond standardised ratios and had two educators for every four to five children, all staff completed a child protection course, and a thorough staff vetting process was in place, but she saw concerning practices at other centres.\n\nInadequate staffing ratios are highlighted as a major child care concern. (ABC News: Ian Cutmore)\n\nShe remembered having to care for 16 children under the age of two alone and being told not to allow any children to play outside all day while working at large services that wanted to get \"as many children in as possible\".\n\n\"They'll hire anyone,\" Arianne said.\n\n\"They don't do their due diligence because they just don't care, as long as there's 'under the roof' ratio.\"\n\nA United Workers Union survey of 2,100 childcare workers revealed 83 per cent of workers reported centres used a common staffing loophole called the \"under the roof\" ratio, which counted all workers in a centre, rather than numbers in individual rooms.\n\nIt is legal under the National Quality Framework.\n\nMinimum standards insufficient, educators say\n\nOwner and director of Jane's Place Early Learning Centre in central Sydney, Jane Zarfati, said ensuring child safety required more than complying with minimum childcare regulations.\n\nMinister slams Working with Children Check reforms Photo shows A close up of a man wearing a suit speaking. Reforms that would standardise Working with Children Checks across the country \"can't happen soon enough\", the federal education minister says, in the wake of allegations of child sexual abuse at a Victorian childcare centre.\n\nShe said vetting staff and daily onsite management were key.\n\n\"We have different processes in regards to supervision, so we don't have just one staff member with a child at any time,\" she said.\n\n\"If there are children using the bathrooms, for example, there's always someone supervising, but there will also be someone in eyeshot as well.\"\n\nMs Zarfati said she conducted police checks and reference checks, as well as working with children checks when hiring staff, and ensured applicants had proper and up-to-date qualifications.\n\nThe centre also uses CCTV throughout, which is one of the key considerations in proposed reforms to the childcare sector.\n\nChildcare workers say there are discrepancies in standards across centres. (ABC News: Keana Naughton)\n\nBut Ms Zarfati said not every centre followed these procedures.\n\n\"Sometimes these checks and balances aren't done, and then the regulatory bodies aren't manned enough … to pull up things that aren't being done correctly or have been overlooked,\" she said.\n\nA NSW Early Childhood Education and Care Regulatory Authority spokesperson said it thoroughly investigated all allegations or complaints and conducted \"more visits to services than any other regulatory authority across the country\", but it knew \"more needs to be done\".\n\nUnderstaffing concerns\n\nEducator Samantha, whose surname has been withheld for legal reasons, said she was concerned about the use of the \"under the roof\" ratio loophole in centres she had worked at in NSW, which meant some rooms were understaffed.\n\nBoth were part of Affinity Education Group, which has more than 250 centres in Australia and has been in the news after staff at different centres in Queensland, NSW and Victoria were charged with offences against children in unrelated incidents.\n\nNSW's childcare regulator says it knows \"more needs to be done\". (ABC News: Stephanie Zillman)\n\n\"We were also under pressure to not turn children away when they were dropped off in the morning,\" Samantha said.\n\nShe said even if the baby room had the minimum national requirement of two educators to eight babies, she felt \"it wasn't best practice\".\n\n\"That national regulation needs to change,\" Samantha said, referring to the National Quality Framework.\n\nEducators say parents are concerned about leaving their children with unfamiliar staff. (ABC News: Dane Hirst)\n\nSamantha said she saw firsthand how the centre handled the regulator's assessment and ratings, by \"back loading\" with \"a lot of resources and educators that no-one knows\".\n\nAffinity Education Group said in a statement that while it used the industry practice of \"under the roof\" ratios, it complied with and often exceeded the government's mandated educator-to-child ratio requirements.\n\nIt said it took compliance issues seriously, was committed to meeting or exceeding the standards set by regulatory bodies, and was working to strengthen safety.\n\nTips for parents\n\nSo, how can parents be reassured that their childcare centre is not just compliant, but taking child safety seriously?\n\nCasual educator agency Talent Now founder and chief executive Liddy Korner said staff consistency was important, and managers should check that educators had the correct qualifications.\n\nMs Korner said good operators did not rely on the \"under the roof\" ratio requirement and always worked above minimum ratios, even the national requirement of one educator to four babies.\n\n\"There should always be a minimum of two, and that shouldn't be hard to change,\" she said.\n\nEarly Childhood Education Minister Jess Walsh said in a statement it was concerning that some educators suggested their providers were not meeting National Quality Framework staff ratios.\n\nShe said those ratios were \"vital for keeping children safe and providing quality early education\".\n\nMs Walsh said the government was introducing legislation to cut Commonwealth funding to providers who put profit over child safety, and it was holding an urgent education ministers' meeting next month to create a nationwide educator register.\n\nReporter Katherine Gregory sends her children to Jane's Place Early Learning Centre.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/ozzy-osbourne-rebranded-rocker-reality-tv-star/10828356",
        "title": "How reality TV show The Osbournes reformatted Ozzy's identity",
        "publish_date": "Tue, 22 Jul 2025 22:00:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "There were a few times, back in the 2000s, where I would watch Ozzy Osbourne's reality TV series The Osbournes and think, wait a second.\n\nIs he definitely alive?\n\nHe'd mumble, stare blankly, bump into things. He was the show's punchline.\n\nCan I get a quick welfare check? Sharon?\n\nThe Osbournes set Ozzy's public image for a younger generation: the aging rocker whose penchant for drugs and booze had left its mark.\n\nBecause Ozzy's whole persona was cheating death, it's weird to know that he is, in the end, just like the rest of us: mortal.\n\nBefore the Kardashians, there were the Osbournes\n\nThe Osbournes was based in reality but it exaggerated what took place to make it more funny, according to Jeff Stilson, a former late-night comedy writer who worked as a co-executive producer on the show.\n\nOzzy Osbourne dies aged 76 Photo shows close up of man with long black hair and a pair or purple-shaded glasses on Described as one of the founders of heavy metal music, John Michael Osbourne was known for his incredible voice and charisma.\n\n\"We are often compared to Survivor and Big Brother, but we are not like those shows,\" he told RN Breakfast in 2002.\n\n\"That's the family, but for every 500 minutes of footage that we shoot, we use one minute.\n\n\"We are a comedy … We are structuring our show so it feels more like a sitcom.\"\n\nOzzy Osbourne with his kids, Jack and Kellie, who starred alongside him in The Osbournes. (Reuters: Alessia Pierdomenico/file)\n\nThe show — a hit for Network Ten at the time — was an early version of a format that would become hugely popular in the following years.\n\nThis kind of not-quite-reality TV, filmed inside a family unit and heavily edited, became the format for the various Housewives seasons and Keeping Up With The Kardashians, among others.\n\nAnd just like the Kardashians used their TV show to grow their brand and sell their own merchandise, The Osbournes helped Ozzy and his family re-energise the singer's celebrity for a younger generation unfamiliar with Black Sabbath.\n\n\"We broadened our audience by millions,\" he said in 2002.\n\nThe series went on to win an Emmy for outstanding reality program that year.\n\nIn the show, Ozzy would swear and argue and complain, but his manner was always tinged with innocence.\n\nThe Prince of Darkness ultimately seemed like a good husband and father.\n\nA classic rock 'n' roll frontman\n\nWhat's interesting about that later-in-life view of Ozzy was that it supplanted the idea of Ozzy the musician.\n\nThe Birmingham-born untrained singer had a voice that fit the glam rock genre he grew up in. It was theatrical, like he was the evil character in a Broadway production.\n\nOzzy Osbourne during a press conference in Australia in 1973. (ABC)\n\nFirst with Black Sabbath and later as a solo artist, Ozzy was a rock 'n' roll frontman at a time when the rock 'n' roll frontman was a must.\n\nEvery long-haired, tight-panted rock act worth their elaborate rider — Led Zeppelin, Iron Maiden, Alice Cooper — had a point man (and it was always a man) whose job was as much to throw around his sex appeal as hold a note.\n\nBut where Zeppelin's Robert Plant stood out for his tenor, Ozzy had not just a great voice but character and a backstory.\n\nThis was the working-class troublemaker who got kicked out of Black Sabbath for being a drug addict — quite a feat — and who famously bit the head off a dead bat.\n\nHis pop cultural cache was off the charts.\n\nHe found his way onto The Simpsons, Wayne's World and elsewhere. Late in life, as it was revealed he was battling Parkinson's, he collaborated with Post Malone, a legend among people under 25.\n\nThe two Ozzys\n\nWhich version of Ozzy will prevail?\n\nBlack Sabbath were pioneers of hard rock. (Wikipedia Commons)\n\nThe menacing singer of a pioneering hard rock band who commanded huge crowds across a decades-long career?\n\nOr the big, befuddled family man, roaming around his mansion swearing at his dogs for shitting on the carpet?\n\nThe answer is both.\n\nWe all contain multitudes, and this dichotomy was Ozzy's.\n\nHe'll be remembered differently by several different generations, and that's almost the definition of a pop cultural icon.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/asx-markets-business-news-live-updates/105561748",
        "title": "Live: Japanese and Australian shares jump as Trump announces trade deal with Japan",
        "publish_date": "Tue, 22 Jul 2025 21:25:02 +0000",
        "category": "finance",
        "authors": [
            "Michael Janda",
            "Emily Stewart",
            "Stephanie Chalmers",
            "Daniel Ziffer"
        ],
        "text": "Here's the latest from financial news service Reuters, which explains why the share prices of Japanese car makers are going ballistic this morning.\n\nTrump's post made no mention of easing tariffs on Japanese motor vehicles, which account for more than a quarter of all the country's exports to the United States and are subject to a 25% tariff. But NHK reported that the deal lowers the auto tariff to 15%, citing a Japanese government official.\n\n\"This is a very exciting time for the United States of America, and especially for the fact that we will continue to always have a great relationship with the Country of Japan,\" Trump said on the social media platform.\n\nJapan is the most significant of the clutch of deals Trump has struck so far, with two-way trade in goods between the two superpowers totaling nearly $US230 billion in 2024, and Japan running a trade surplus of nearly $US70 billion. Japan is the fifth-largest US trading partner in goods, US Census Bureau data show.\n\nAutos are a huge part of U.S.-Japan trade, but is almost all one way to the U.S. from Japan, a fact that has long irked Trump. In 2024, the U.S. imported more than $US55 billion of vehicles and automotive parts while just over $US2 billion were sold into the Japanese market from the US.\n\nReuters could not immediately confirm the elements of the deal announced by Trump, and details were scant. The White House did not immediately respond to a request for additional details.\n\nSpeaking early on Wednesday in Tokyo, Japanese Prime Minister Shigeru Ishiba said he had received an initial report from his trade negotiator in Washington but declined to comment on the specifics of the negotiation.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/labor-hecs-relief-bill-questions-answered/105560328",
        "title": "How Labor's bill to reduce student debt for 3m people will affect you",
        "publish_date": "Tue, 22 Jul 2025 21:19:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "As parliament returns this week for the first time since the election, the top item of business for Labor is its election promise to reduce student loans by 20 per cent.\n\nLegislation will be introduced on Wednesday and is likely to become law soon after, with both the Coalition and the Greens appearing likely to support it.\n\nIt means about 3 million Australians will see an automatic adjustment applied to their loans later this year, and also see changes to the repayment rules. Here's how it works.\n\nThe current HELP system\n\nThe reduction applies to the various student loans offered by the federal government under the Higher Education Loan Program (HELP).\n\nThat includes HECS-HELP for university degrees (commonly shortened to HECS), but also FEE-HELP, VET and apprenticeship loans, and a variety of others.\n\nThese are called \"income-contingent\" loans because you are only required to repay them if you earn more than a certain threshold.\n\nThere is no interest on the loans, but the outstanding amount is indexed every year. Previously, it was indexed to inflation, but under a law passed in the last term it is now whichever is lower of inflation or wages.\n\nHow will the 20 per cent HECS reduction be applied?\n\nLabor's proposal is to apply a one-off, 20 per cent reduction to all outstanding loans.\n\nIf the legislation is passed, the ATO will apply this reduction automatically, based on the value of your loan on June 1, 2025.\n\nIndexation, which this year is 3.2 per cent, will be recalculated to apply to the reduced loan.\n\nLoans for any course with a census date before June 1 will count, even if they haven't shown up on your ATO account.\n\nAnd if you happen to have repaid the last of your loan since 1 June, you may get a refund.\n\nOn the other hand, if you had already paid off your loan by June 1, there will be no refund and these changes do not benefit you.\n\nHow will HECS repayments change?\n\nThe other major change in Labor's proposal is to the rules for repaying your debt.\n\nFirst, the income threshold above which you are required to make a repayment will increase from $54,435 to $67,000.\n\nSecond, the way the threshold works will change.\n\nCurrently, if you earn more than the threshold, you must provide a certain percentage of your entire income to pay down the debt.\n\nSo if you earn $70,000 next year, the current system would require you to pay back 2.5 per cent of $70,000 — or $1,750.\n\nUnder Labor's proposal, you would instead pay only a higher percentage (15 per cent) but only on $3,000, the portion of your income above the threshold — a total of $450.\n\nThe exact rates will be included in the legislation, but an online calculator from the department appears to suggest a flat 15 per cent rate will apply up to $125,000 and then a slightly higher rate beyond that, while anyone earning more than $180,000 will have the same repayments as under the old system.\n\nThese changes would take effect for the current financial year (2025-26).\n\nWill the bill pass?\n\nLabor has a comfortable majority in the House of Representatives, so will have no trouble passing the bill through that house.\n\nIn the Senate, it requires the support of either the Coalition or the Greens. The Coalition was opposed to the proposal prior to the election. However, it has sent strong signals that it will now support it.\n\nEven if the Coalition does not support it, the Greens are supportive of the general principle so are unlikely to vote against it, although they will propose amendments, seeking to go further by stopping indexation entirely.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/federal-politics-live-blog-parliament-july-23/105561680",
        "title": "Live: Labor introduces bill to cut student debt",
        "publish_date": "Tue, 22 Jul 2025 21:09:17 +0000",
        "category": "finance",
        "authors": [
            "Tom Lowrey",
            "Shalailah Medhora",
            "Monte Bovill",
            "Joshua Boscaini",
            "Bethanie Alderson",
            "Courtney Gould",
            "Jake Evans"
        ],
        "text": "(ABC News: Ian Cutmore)\n\nIt's a new parliament, but some things never change.\n\nOne is the Coalition very publicly fighting over climate change. Another (related) is Barnaby Joyce drawing a crowd in the corridors of the press gallery.\n\nThe former Nationals leader has drafted a private members bill to \"Repeal Net Zero\", which effectively means dumping about 25 years worth of climate-related legislation.\n\nJoyce's views on climate change are pretty well known by this point. He thinks Australia pursuing emissions reduction is futile, given any domestic gains are dwarfed by increases in emissions in much larger countries (like China).\n\nAnd he argues efforts to transition to renewable power are pushing up power prices.\n\nWhat's interesting is the Coalition is already going through a formal process of reviewing its position on net zero and energy policy more broadly, led by shadow energy minister Dan Tehan.\n\nBut Joyce says there's no time to waste talking behind closed doors.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-23/retirement-superannuation-pension-age-emotions/105543136",
        "title": "A good retirement isn't guaranteed but these steps might help you get there",
        "publish_date": "Tue, 22 Jul 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Not everyone gets the luxury of choosing when they retire.\n\nSevere hearing loss forced Anthea White into early retirement, effectively ending her 30-year career as an accountant.\n\n\"It brought forward my departure from the workforce probably by about five years,\" she tells ABC Radio National's Life Matters.\n\n\"I hadn't started planning my retirement, so it caught me unaware … I was quite angry and devastated that I didn't leave on my own terms.\"\n\nListen to the podcast Life Matters is here to help you get a handle on all the important stuff: love, sex, fitness, health, parenting, career, finances and family.\n\nAccording to the Australian Bureau of Statistics, about 13 per cent of the 4.2 million who retired in 2022–23 cited illness, injury or disability.\n\nBut good health is just one piece of the retirement puzzle.\n\nRetired psychologist and the author of Enjoying Retirement, Michael Longhurst, says a long-established work routine coming to an end often stirs emotions that can range from elation to terror.\n\n\"Was your retirement planned? Did you have time to get your finances in order or was it unplanned? Were you retrenched for some reason? If you were self-employed, was there a business failure or was it a health issue?\" he says.\n\n\"The way the last day [of work] pans out is going to be affected by all these things.\"\n\nMr Longhurst says that sometimes people \"embark on what they feel is going to be a long holiday\" when they retire and \"that's fine for a while\".\n\n\"[But] if they really loved their job and they loved what they were doing … instead of going through a honeymoon period, they may go through a feeling of divorce.\"\n\nSo what are the practical steps you can take to get the retirement you want? And what can hold you back?\n\nThis article contains general information only. You should consider obtaining independent professional advice in relation to your particular circumstances.\n\nRetirement looks different for everyone\n\nThe solution to a good retirement is building a sense of purpose in your life, Mr Longhurst says.\n\nFor retiree Marilyn Manning, that meant pursuing her love for adventure.\n\nAt 78, Marilyn Manning has only just started slowing down. (Supplied)\n\nA midlife crisis in her 50s prompted her to pivot from her 30-year career in advertising to working as a tour leader in India, which she did for six months of the year. She supplemented her income with agency cleaning and telemarketing when she was back home.\n\nNow 78, she's finally stepping back after 20 years leading small group tours of India with mainly middle-aged women and retirees.\n\n\"I'm a bit of a goer, and I just saw people getting old long before they should have,\" she says.\n\n\"I've had some amazing adventures and got up to a few larks over the years, and I'm not ready to stop doing that.\n\n\"I just want to keep the Alzheimer's away and I want to live to 100 minimum.\"\n\nWhen Norm Walker stopped work at 64, he promptly set sail, travelling Australia's coastline on his catamaran.\n\nThe idea came to him in his late 30s while building a boat for family holidays.\n\n\"I loved it and thought, 'This is the way I'm going to retire … this is the way I'm going to finish my life.' And here I am.\"\n\nNorm worked for himself and had no superannuation, but he did own his own house.\n\nNorm Walker posts his adventures sailing around Australia on his YouTube page called Motor Sailing for Old Dudes. (Supplied)\n\n\"When we sold the property … I put it straight into super, so I've ended up with really good super, which was a bit lucky,\" he says.\n\nBut if you're not like Norm and don't own your home, the path to retirement might feel uncertain.\n\nThe importance of financial planning\n\nWhether you are in your 20s or your 60s, retirement should be something to keep an eye on, says James Wrigley, a financial planner.\n\nTopping up your super gradually is preferable to a sudden burst of top-ups in the immediate lead-up to retirement.\n\n\"Even if it's $20 or $50 or $100 a pay [packet] … a little bit over a long time adds up significantly,\" Mr Wrigley says.\n\n\"If you leave it too late, chances are you're probably not going to have the spare cash to actually get those big numbers to help you have a comfortable retirement.\"\n\nStream your favourite shows on the free ABC listen app Photo shows Image of Dr Karl on a pink background and Listen app logo Dr Karl knows the best app for free podcasts, radio, music, news and audiobooks … and you don't need to be a scientist to find it!\n\nAbout 17 million Australians currently have a super account, according to Australian Superannuation Funds of Australia (ASFA).\n\nBut when it comes to super balances, women retire with far less. In 2023, ASFA reported that the median super balance for women was about 25 per cent lower than for men.\n\nJust over 30 per cent of retired women rely on their partner's income to meet their living costs, compared to just 8 per cent of retired men.\n\nASFA also recommends that a single person who owns their own home needs $33,386 a year to maintain a modest lifestyle during retirement, while a couple requires $48,184 a year.\n\nA renter who is single needs $46,663 a year, while a couple needs $64,259.\n\nA good retirement can depend on a variety of things, including access to housing. (ABC News: John Gunn)\n\nWhat does modest mean? According to ASFA, it includes basic private insurance, an older car, infrequent leisure activities, budget haircuts, limited outings at inexpensive restaurants and keeping a close eye on utility costs.\n\n\"It's possible to fund retirement through part age pension and part your own money,\" Mr Wrigley says.\n\nBut it is \"far more challenging\" if you don't own your own home and must pay rent.\n\n\"That throws a different set of complications that need to be dealt with,\" he says.\n\n'Keeping well and keeping social'\n\nExercise and a sensible diet are essential for good health but, according to Nancy Pachana, the co-director at the Ageing Mind Initiative at the University of Queensland, paying attention to our mental health and social network is just as vital to achieving a good retirement.\n\nJoanne Earl says you should allow yourself the luxury of easing into retirement. (Supplied)\n\n\"Not having a good social network will have a greater impact on your health, in many cases, than not exercising. And people don't realise this,\" Professor Pachana says.\n\n\"Some people who do experience social isolation are at greater risk of physical decline and a greater risk for dementia.\"\n\nJoanne Earl is an organisational psychologist from Macquarie University who specialises in retirement planning. She says being in control is key.\n\n\"A lot of people will just be focused on how much money they've got, but they need a wider lens to think about not just the money, but what they're going to be doing after they retire,\" she says.\n\n\"The two key things are keeping well and keeping social, [and also] recognising it doesn't have to be all or nothing.\"\n\nShe says people can choose to retire in their own time.\n\n\"Allow yourself the luxury of just easing into it, rather than it being a real sort of shock to the system.\"\n\nGreg Noonan retired earlier this year at the age of 56.\n\nGreg Noonan stopped working in January of this year and recently enjoyed his 100th day of retirement. (Supplied)\n\nHis advice for anyone who has just finished work is simply to be patient.\n\n\"Pay heed to the emotion that's involved in the whole process. [And] be kind to yourself,\" he says.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Simon Letch",
        "publish_date": "Wed, 23 Jul 2025 12:24:26 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Simon Letch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/classy-gesture-as-dre-russ-bows-out-20250723-p5mh7r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Classy gesture as Dre Russ bows out",
        "publish_date": "Wed, 23 Jul 2025 12:21:35 +1000",
        "category": "finance",
        "authors": [],
        "text": "Classy gesture as Dre Russ bows out\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/haslers-500th-game-to-hasten-axe-20250723-p5mh7j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hasler's 500th game to hasten axe",
        "publish_date": "Wed, 23 Jul 2025 12:16:37 +1000",
        "category": "sports",
        "authors": [],
        "text": "Hasler's 500th game to hasten axe\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/sydney-eating-out/rockpool-team-to-open-restaurant-serving-only-steak-frites-20250619-p5m8sc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney’s first steak frites-only restaurant is now open, by the Rockpool team",
        "publish_date": "Wed, 23 Jul 2025 12:16:07 +1000",
        "category": "finance",
        "authors": [
            "Scott Bolles",
            "Erina Starkey"
        ],
        "text": "Advertisement\n\nThe menus are printed and ready for 24 York’s first day of service – but whether diners will need them is another story. The latest opening from Hunter St. Hospitality, the group behind Rockpool Bar & Grill, Spice Temple and The Collective, sticks to a tight format: with just one main course, one side and one dessert. The star of the show is the classic French bistro dish of steak frites, with chef Santi Aristizabal using the same scotch fillet cut from Gippsland that he has on the menu at sister restaurant Rockpool Bar & Grill in Melbourne. The steak frites at 24 York is made with O’Connor scotch fillet and comes with a choice of four sauces. When you offer just one steak, serious consideration is invested in its selection. The trio of culinary directors at Hunter St. Hospitality, chefs Aristizabal, Andy Evans and Shimpei Hatanaka, first had to eliminate other cuts such as hanger, skirt and sirloin before deciding on scotch fillet for a range of reasons, including fat content, chewiness, mouth feel and taste.\n\nAdvertisement\n\nThe steaks were lined up in a blind tasting of scotch fillet from 12 suppliers. Aristizabal, who oversees all three Rockpools in Sydney, Melbourne and Perth, said at $48 (with chips), the 220-gram scotch fillet from Gippsland producer O’Connor is good value. “At Rockpool in Melbourne you pay $95 for 400g on the bone, which is around 350g bone off. The steak at 24 York is only one marble score lower [than Rockpool].” Diners will still have some decisions to make. The steak can be cooked two ways – medium or well done – and comes with a choice of four sauces: peppercorn, mushroom, chimichurri or umami butter infused with kombu, eschalot, garlic and lemon. Hunter St. Hospitality’s culinary directors Andy Evans, Santi Aristizabal and Shimpei Hatanaka will oversee 24 York when it opens in July. Steven Woodburn To achieve a rosy pink centre, the fillets are seared on a very hot grill for two to three minutes, rested, then returned to the grill for a final char, before being seasoned with Murray River salt and served pre-cut in thick slices.\n\nAdvertisement\n\nTucker doesn’t hide from the fact 24 York’s steak frites approach takes inspiration from Le Relais de l’Entrecote in France, which has successfully leant on steak and chips for more than half a century. He says customers increasingly appreciate venues that do a single thing well, but said critical mass is needed for the concept. “I wouldn’t have done this in Surry Hills,” Tucker said. With Rockpool and The Cut in its portfolio, Tucker is confident his group has the chops in the steak department. He said the decision to include chips was easy: “The one thing that always ends up on every table [that orders steak] is chips.” The fries fall somewhere between a standard cut chip and a French fry, and like those at Olympic Meats in Marrickville and Rosie’s in Coledale, they’re cooked in beef tallow for a richer, meatier flavour.\n\nAdvertisement\n\nThe single side dish is a simple green salad made with seasonal leaves and a mustard dressing. Drinks are equally tight and affordable. There are four house wines – two reds and two whites, priced from $12-$13 by the glass or $39-$45 by the bottle. Asahi, Resch’s and Guinness are on tap, while the cocktail selection consists of six classics, including a martini, negroni and old fashioned – all priced at $18. The opening of 24 York also signals a shift in strategy for Hunter St. Hospitality. The venue has opened in the former home of The Bavarian, which the group decided to close after operating at the York Street site for the past 14 years to focus on “unique venues” rather than chains. “The area’s changed,” Hunter St. Hospitality chief executive Frank Tucker said. That change is reflected in the restaurant’s more refined fit-out, which is elegant without being overdone. The 200-seat restaurant nods to the New York bistro style with dark timber finishes, globe pendant lights and intimate booths framed by short sheer shop-curtains. And the dessert? It’s a mini New York cheesecake with fresh raspberries and a quenelle of vanilla ice cream. What more do you need?\n\nAdvertisement\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-how-e-bike-battery-fires-are-starting-20250722-p5mgt1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Olympic swimming centre to blow out by $500 million | Third person charged with murder of Zdravko Bilic | How e-bike battery fires are starting",
        "publish_date": "Wed, 23 Jul 2025 12:05:30 +1000",
        "category": "finance",
        "authors": [],
        "text": "A scientist has rejected calls for private e-scooter riders to wear full-face helmets, despite the RACQ’s call to mandate them to reduce injuries to riders.\n\nThe motoring body argues that 65 per cent of riders turning up at Queensland’s emergency departments said they were wearing a helmet.\n\nBut scientist Arkadiy Matsekh, who appeared at Queensland’s e-mobility inquiry as an industry witness, said introducing them would put a lot of people off riding e-scooters.\n\nLoading\n\n“The biggest danger to people on bicycles are not themselves – this is the heavy vehicles,” he said.\n\n“Those who want to use them (full-face helmets), they are welcome.\n\n“Nobody would want to use a full-face helmet to just try to get some groceries.”\n\nMatsekh, who has cycled about 140,000 on Australian roads, said Europe did not have mandatory helmet laws.\n\n“A piece of styrofoam on your head will not protect you from being hit (by a car),” he said.\n\n“A major source of threat to vulnerable road users are, of course, vehicles, and we need to basically seek this cultural shift.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/this-old-bugger-s-guide-to-happiness-has-one-golden-rule-20250716-p5mfdp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This old bugger’s guide to happiness has one golden rule",
        "publish_date": "Wed, 23 Jul 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Michael Dwyer"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Geoff Hutchison has officially entered the harrumph zone. Change is everywhere. His waning status. His ageing body. This whole shot-to-hell world. Whether on ubiquitous screens or the drive to the supermarket, stupidity and inconvenience conspire to exasperate him. His mission now: How Not to Become a Grumpy Old Bugger. “I genuinely think I’m a better person for having written it,” the former ABC radio presenter says of his first book, subtitled A bloke’s guide to living a better life. “I’ve had cause at times to remind myself, if I’m going to tell other people how they should live their lives, I’ve got to respond to that. I’ve got to take this stuff seriously.” After 40 years as a journalist, not least with Foreign Correspondent and 7.30, he knows serious. But it was his last 16 in talkback on ABC Perth that gave him the necessary tone for a book addressing the minefield of male discontent: rigorous enquiry, sure, but with a lightness of touch that invites leaning in. “I wanted to hit blokes between the eyes on a couple of things, but I also know they will put the book down and never read another paragraph if I can’t win them over to the conversation,” he says. “Although I still think their partners might read bits of it out loud to them in bed. That would make me happy too.” In terms of inspiration, he recalls one beacon of grump from early in his talkback career: February 13, 2008, the day new PM Kevin Rudd apologised to the Stolen Generations. “I reckon the first six callers were blokes, and they were all saying, ‘I don’t see that I should have to apologise for anything’. I didn’t say it on air but I thought, ‘Oh my god, how can these blokes be such bastards?’ “Back then I took it personally. I don’t now. I would now want to say to those blokes: ‘This isn’t about you. Not everything that happens in the world is about you.’ That whole ‘Harrumph, well I don’t like it’ – I want to convince them to just let some things go.” Hutchison’s book is not interested in culture wars. He isn’t out to debate pronouns or cancel culture. What he’s describing is something quieter and more insidious: a kind of emotional shrinkage, a stubborn stand-off with acceptance.\n\nAdvertisement\n\n“You raise the kids, the job ends, and you become a little less interesting to everyone. That’s the bit no one tells you,” he says, with the fresh insight of the recent retiree. “And if you were defined by that role” – the job, the dad, the problem-solver – “I think you’re very vulnerable to sadness. And loneliness.” Hutchison spent the last 16 years working at ABC radio, where many of his callers helped inspire his book. The grim end of male sadness is devastating. In Australia, Hutchison discovered, 86 men call an ambulance every day with thoughts of suicide. In 2023 alone, 64 women were killed in acts of male violence. But he doesn’t have to consult experts and statistics to see the darkness festering in blokes’ heads. He recalls stumbling on a social media chat sharing the praises of Italian restaurants. “Every positive comment came from a woman. Every negative and unnecessary one came from a bloke. And I’m just thinking, who are you? What are you doing, sitting at a keyboard, hating everything? Is there any pleasure in that?” Then there was a bloke named Ian, compelled to comment under an exultant photo of three young footy players with hands casually resting on each other’s knees. “Back when I played footy,” Ian said, “we would get the shit kicked out of us for posing like that.” TAKE 7: THE ANSWERS ACCORDING TO GEOFF HUTCHISON Worst habit? It used to be celebrating cynicism. But after hearing Billy Bragg declare that “cynicism is the enemy of hope”, I am now determinedly of the same opinion. Greatest fear? I don’t like them Fascists very much. Indeed, anyone who seeks political advantage by using fear to target and blame “others”. And I’m wary of anyone who thinks the concept of Prosperity Theology is endorsed by a greater power. The line that stayed with you? ”Love this life, don’t wait ’til the next one comes” – Neil Finn. Biggest regret? A kitchen accident that left my young son only partially sighted. I had my back turned as he tried to open a bag of apples with scissors. And yes, it was as awful as it sounds. I’ve written about it for the first time in my book in the chapter titled Regret. Favourite book? Richard Ford’s The Sportswriter (1986). I was a young version of one at the time. The artwork/song you wish was yours? The Portrait of the Journalist Sylvia von Harden by the German painter Otto Dix. If you could time travel, where would you choose to go? London in the mid ’60s please, with plenty of money in my pocket. And if you could get me into the Marquee Club to see … oh I dunno, David Bowie, The Rolling Stones or Jimi Hendrix that would be splendid. “That bloke is just curating a museum of dickheadedness,” Hutchison says. “It’s awful, and I bet it’s making him sick. I bet his wife doesn’t like him much. And I bet his son doesn’t come home to watch footy on Friday nights because he can’t bear to hear Dad talk about their haircuts.”\n\nAdvertisement\n\nThat author doesn’t exempt himself. He recounts one episode of fuming at an umpire’s call that his daughter, gently, had to tell him was pathetic. He talks about making his mates laugh by impersonating “some dickhead” at the pub. “I find that kind of cynicism less funny now. When blokes shrink into that tight, narrow worldview, they must be awful to live with.” He owns that too. Post-ABC, he assumed more time with his wife, Philippa. But her career as a documentary maker is firing. “She’s about to fly to the UK for three weeks of interviews. So I had to remind myself: you don’t need to be at the centre of everything. You can swan around on the edges. Pick and choose how you want to engage. Just make sure you do.” The active pursuit of engagement is a theme of Hutchison’s book. “If you’ve got male friends, place some value on that friendship. Whatever the next five, 10, 20 years look like – and they might be terrific, or they might be absolutely shithouse – you want to have people to talk to about it.” That refusal to disappear, to keep showing up, runs through the people he interviews. There’s social researcher and psychologist Hugh Mackay, still sharp and empathetic at 86. Alex Pearce, the Fremantle Dockers’ captain is emotionally open in a way Hutchison finds quietly radical. Through his son he meets a trans woman named Gemma, whose calm presence contrasts powerfully with the rage of anonymous detractors. Two GPs talk bluntly about ageing bodies behind pseudonyms designed to tickle sci-fi-nerds: Peter Venkman and Leonard McCoy. At both ends, it’s Hutchison’s late father who anchors the book. The man who blithely proclaimed his unhappiness as a fact of life when Geoff was a boy “used to come home from the Italian Club in Pickering Brook and say, ‘God, people are stupid’. I used to think, ‘Is it just the gang you’re hangin’ out with Dad?’ I’ve got to believe not everyone is quite so venal or miserable.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/trump-sparks-a-6-4-billion-wipeout-for-a-us-icon-20250723-p5mh37.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump sparks a $6.4 billion wipeout for a US icon",
        "publish_date": "Wed, 23 Jul 2025 11:58:14 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "GM says it believes it can eventually offset about a third of the $US4 billion to $US5 billion cost of the tariffs this year by cutting costs and shifting some production to the US. That suggests the ongoing cost of the tariffs in the near term will be more than $US3.3 billion a year, though GM executives hope that trade deals with South Korea, Mexico and Canada – where most of its imported cars are sourced – may reduce that cost. As this quarterly earnings season in the US continues, commentaries from trade-exposed US companies will be pored over for references to the tariffs and how the companies are responding to them. GM chief Mary Barra. There is more pain coming for the car giant. Credit: Bloomberg Last week’s June inflation data showed that in sectors directly exposed to tariffs – sectors such as fresh fruit and vegetables, household appliances, furniture, toys, clothing and sporting goods – prices are rising. The cost of the tariffs in those sectors is being passed onto customers and is affecting the inflation rate.\n\nThere’s been a lot of inventory loading occurring in the US to get ahead of the tariffs, so their impact on the inflation rate and/or companies’ profits should progressively increase as those pre-tariff stocks run down. Loading Some companies, of course, benefit from the protection provided by tariffs, which shield them to some degree from competition from imports, and where the increased cost of imports provides cover for domestic firms to raise their own prices. The US steel industry, with aluminium, was one of the earliest beneficiaries of Trump’s tariffs. Trump announced a 25 per cent tariff on steel and aluminium imports in February and then doubled the rate, to 50 per cent, last month. About 23 per cent of the steel supply in the US is imported, with the rest produced domestically by steelmakers that are regarded as the world’s most expensive producers.\n\nTheir response to Trump’s tariffs has, predictably, been opportunistic. They’ve raised their prices, which are up about 16 per cent this year. That’s history repeating. In 2018, during Trump’s initial trade war with China, he imposed a 25 per cent tariff on steel imports, and the US steelmakers responded by lifting their prices by about 10 per cent, which added about $US2.5 billion to their profits. The 2018 experience shows that companies also improved their capacity utilisation and added investment and jobs – but the impact was relatively short-lived, and the costs in jobs and lost earnings to steel-consuming industries were multiples of the benefits created for the steel producers. Not only is the duty on steel today double what it was in 2018, but it applies more broadly, not just to imported steel but also to imports of steel “derivatives”, or products where steel is a major component.\n\nThe impact on the tariff on steel – and similar tariffs on aluminium and copper – will percolate through the US manufacturing sector, with a particular impact on an auto industry that is also subject to its own tariffs. If Trump follows through with his threatened 50 per cent tariff on all imports from Brazil (unless Brazilian authorities drop their prosecution of former president Jair Bolsonaro for an alleged attempted coup), the tariffs’ impact on the cost of steel would be exacerbated. Brazil is a major supplier of raw materials to the sector. At some point, probably not too far into the distant future, GM and other US manufacturers will be overwhelmed by the cost increases flowing from the barrage of tariffs on auto and auto part imports and on their raw materials and be unable to absorb them without passing on a substantial proportion to customers. That is when their full effects on the inflation rate will start to show up. The “Trump effect” on the auto industry isn’t confined to tariffs.\n\nHis aversion to electric vehicles and climate-related initiatives and his assault on the Biden administration’s subsidies and incentives for carbon emission reductions and green energy, includes the withdrawal of subsidies for EV purchases and tax credits for emissions reductions. That will hit Tesla, which has relied on the sale of the regulatory credits for its profitability – it would be loss-making without them – hardest. While Trump keeps claiming that the US is collecting massive amounts of tariff revenue from other countries’ exporters, the GM experience underscores what almost everyone else has always understood. It might, in the near term, help other US EV manufacturers, even GM – the second-largest US domestic manufacturer of EVs – which have had to buy the credits to offset the emissions from their larger internal combustion vehicle production. What it and, thanks to tariff and non-tariff barriers, the near-total absence of competition from imported EVs will do, however, is drive up the cost of domestically produced EVs, reduce their sales volumes and undermine the scale efficiencies that might lead to EV profitability.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/high-end-heist-australians-caught-up-in-louis-vuitton-data-breach-20250723-p5mh2u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "High-end heist: Australians caught up in Louis Vuitton data breach",
        "publish_date": "Wed, 23 Jul 2025 11:57:28 +1000",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "High-end luxury brand Louis Vuitton has confirmed that Australian customers were caught up in a data breach, with personal information including birthdates, contact details, purchase history and preference data stolen by hackers.\n\nAffected customers were informed via email on Monday, with the company revealing it became aware of a breach some three weeks earlier, on July 2.\n\n“We regret to inform you that an unauthorised third party temporarily accessed our system and obtained some of your information,” the email reads.\n\nHigh-end luxury brand Louis Vuitton has confirmed that Australian customers have been caught up in a data breach. Credit: Bloomberg\n\n“We would like to reassure you that no password nor financial information – such as credit card information, bank details or other financial accounts – was contained in the database accessed.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/review-set-to-start-on-rockhampton-olympic-rowing-venue-20250723-p5mh4p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Review set to start on Rockhampton Olympic rowing venue",
        "publish_date": "Wed, 23 Jul 2025 11:55:23 +1000",
        "category": "sports",
        "authors": [
            "Cameron Atfield"
        ],
        "text": "A technical review of the Fitzroy River Olympic rowing venue is about to begin, Premier David Crisafulli announced as he visited the planned Rockhampton venue to mark seven years to the day until the start of the Brisbane 2032 Games.\n\nCrisafulli said the Games Independent Infrastructure and Coordination Authority would conduct the review, which would start immediately.\n\nBut, ultimately, World Rowing would decide whether the Fitzroy was an appropriate venue for Olympic competition.\n\nRowing on the Fitzroy River in Rockhampton. Credit: Rockhampton Regional Council\n\nProfessor David Hamilton, the director of Griffith University’s Australian Rivers Institute, said the Fitzroy posed legitimate concerns for competition integrity.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/e-bike-scooter-ban-flagged-for-trains-over-fire-risk-20250722-p5mgyx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "E-bike, e-scooter ban flagged for trains over fire risk",
        "publish_date": "Wed, 23 Jul 2025 11:52:32 +1000",
        "category": "finance",
        "authors": [
            "Patrick Hatch"
        ],
        "text": "Electric scooters and e-bikes would be banned from train carriages across Victoria under rules the transport department has proposed to address the risk of lithium-ion battery fires.\n\nA Metro train was evacuated when an e-bike burst into flames at Union Station, in Melbourne’s east, in March, and e-bike and e-scooter batteries have also been blamed for hundreds of house fires over the past few years.\n\nAn e-bike caught on fire on a Metro train in March. Credit: Reddit\n\nOn Tuesday, the Department of Transport and Planning released proposed new rules that would ban e-scooters, e-bikes and other battery-powered transport devices such as e-skateboards from Metro and V/Line trains, as well as V/Line coaches.\n\n“A fire on a train is a serious safety issue because it may be difficult to evacuate passengers on a crowded service or where trains are in between stations,” a summary paper of the rule changes says.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/traveller/reviews-and-advice/travelling-on-a-sleeper-train-is-an-exercise-in-space-management-20250714-p5meqt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Travelling on a sleeper train is an exercise in space management",
        "publish_date": "Wed, 23 Jul 2025 11:47:23 +1000",
        "category": "finance",
        "authors": [
            "Riley Wilson"
        ],
        "text": "Australia by train: it’s a romantic step back in time on board a rattling silver snake that winds its way across the continent. It’s also an exercise in space management, with cabins on the Indian Pacific, The Ghan and the Great Southern demanding clever use of room storage in a cabin footprint that’s remained the same since 2008. Here’s the inside scoop on making the most of your space from the crew who do it every day.\n\nThere’s even a place for your hat. Credit: Illustration: Greg Straight\n\nPack light\n\nStart small and stay small. Indian Pacific journey manager Brittney Howe says this is the secret to a manageable and enjoyable cabin experience. There’s only really floor space for a soft duffel bag or a very small wheelie bag, so be conscious with your clothing and pack things that you can wear multiple ways.\n\n“You’ll be far more comfortable with a duffel bag – something soft that can pack away,” says Howe. “Then you’re not navigating and moving [bags] around the ladder and moving them every time you need to open the bathroom or cabin door.”",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-the-australian-passport-ranks-among-the-worlds-most-powerful/qlzkmvnhw",
        "title": "How the Australian passport ranks among the world's most powerful",
        "publish_date": "Wed, 23 Jul 2025 01:44:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia has fallen to seventh place in the latest Henley Passport Index, after being ranked sixth earlier this year .\n\n\n\n\n\nThe shift reflects changes in how different countries are positioned based on global visa access.\n\n\n\n\n\nThe Henley Passport Index ranks passports according to the number of destinations their holders can enter without a visa or with visa-on-arrival access.\n\n\n\n\n\nAlthough only a dip, it shows how passport rankings can change as countries adjust their travel agreements and visa rules.\n\n\n\nThe biggest rises and falls\n\nAustralia now shares seventh place with five European nations: Czechia, Hungary, Malta and Poland.\n\n\n\n\n\nSingapore tops the list, ahead of Japan and South Korea in equal second place. A host of countries occupy the third and fourth placings, while New Zealand is in fifth spot, along with Switzerland.\n\n\n\n\n\nThe most notable changes have been the United Kingdom and United States.\n\n\n\nBoth were once at the top of the index, with the UK ranking first in 2015 and the US in 2014.\n\n\n\n\n\nNow, the UK sits in sixth place and the US has slipped to 10th, marking a continued downward trend for both countries.\n\n\n\n\n\nThe US is now close to falling out of the top 10 for the first time since the index began nearly 20 years ago.\n\n\n\nAustralia has dipped in the rankings and now sits with Malta, Czechia, Hungary and Poland. Source: SBS News\n\nWhat this means for Australian travellers\n\nFor most people, the fall in ranking will not affect their everyday travel plans.\n\n\n\n\n\nAustralians are still able to enter a large number of countries without needing to arrange a visa ahead of time, however, the rankings are a reminder that visa policies can shift over time.\n\n\n\nA widening global divide\n\nWhile countries at the top of the index continue to enjoy broad travel freedom, those at the bottom face significant restrictions. The gap between the most and least mobile passports remains wide and reflects broader global inequalities in access and opportunity.\n\n\n\n\n\nAccording to Henley & Partners chair Dr Christian H. Kaelin, global travel access has improved over the past two decades, but not everyone has benefited equally.\n\n\n\n\n\n\"The average number of destinations travellers are able to access visa-free has nearly doubled from 58 in 2006 to 111 in 2024, but this improvement has not been experienced equally.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-16-a-french-stage-winner-in-the-tour-de-france/rxmeb3vc5",
        "title": "Tour de France stage 16: Paret-Peintre becomes this year's first French winner",
        "publish_date": "Tue, 22 Jul 2025 21:07:01 +0000",
        "category": "sports",
        "authors": [],
        "text": "Valentin Paret-Peintre became the first French winner on this year's Tour de France as he edged an enthralling stage 16 on Tuesday, pipping Ireland's Ben Healy atop the mythical 1910m altitude Mont Ventoux summit finish.\n\n\n\n\n\nBehind them, Jonas Vingegaard attacked overall leader Tadej Pogačar relentlessly, but the defending champion tracked the Dane all the way up the 15km ascent to extend his lead by two seconds.\n\n\n\n\n\nTrailing by four minutes and 13 seconds at the start of this stage, Vingegaard attacked with 9km to climb on Mont Ventoux, whose upper reaches resemble a lunar landscape.\n\n\n\n\n\n\"I didn’t want to push too hard and then let him have me on a counter-attack. I kept my rhythm as much as I could,\" said Pogačar, who has been fighting off a cold this week.\n\n\n\n\n\n\"He attacked many times, but I just tried to hold his wheel.\"\n\n\n\n\n\nVingegaard was knocked off his bike by a motorbike after the finish line but remained unhurt, remounting to congratulate Pogačar on another fine battle.\n\n\n\n\n\n\"He seemed okay,\" Pogačar later said.\n\n\n\n\n\nPogačar's Team UAE boss Mauro Gianetti described Vingegaard as a \"warrior\".\n\n\n\n\n\n\"He's got the guts and the legs, and we expect him to keep on attacking every day now. He's a warrior,\" he said.\n\n\n\n\n\nThe battle for the overall lead, however, was eclipsed by a frantic fight for the stage win between EF's Healy and Soudal Quick-Step's Paret-Peintre, who became the first French winner on Mont Ventoux since Richard Virenque in 2002.\n\n\n\n\n\n\"He looked so happy at the finish line,\" Pogačar said.\n\n\n\nMont Ventoux has long been held in awe by riders and spectators alike, and it has witnessed some of the greatest dramas and tragedies in the Tour.\n\n\n\n\n\nIn 1967, the British cyclist Tom Simpson died here after collapsing on a baking climb.\n\n\n\n\n\nThe great Eddy Merckx once needed oxygen at the summit while Chris Froome ran part of the way up during a frantic wait for mechanical assistance on his way to a third Tour de France title in 2016.\n\n\n\nPerfect tactic\n\nHealy, who wore the yellow jersey for two days after winning the Bastille Day stage six, appeared to be heading for his second stage win as the two riders approached the finish of an epic tussle.\n\n\n\n\n\nParet-Peintre looked completely drained but, cheered on by the home crowd, he found a final surge of strength to overtake the Irishman with 20m remaining and held on to the line.\n\n\n\n\n\n\"I was near giving up. Healy was so strong, but I said to myself, 'Come on, it's the Tour de France, Mont Ventoux.'\" Paret-Peintre said.\n\n\n\n\n\n\"I knew that if I held on, the last section suited me better than him, as it's really steep. It turned out to be the perfect tactic.\"\n\n\n\n\n\nHealy's consolation was to be awarded the day's combativity prize while moving up one place to ninth in the overall standings.\n\n\n\n\n\nAlmost unnoticed further down the mountain, German breakout star Florian Lipowitz consolidated his third place, extending his lead on fourth-placed Scottish rider Oscar Onley by around 30 seconds.\n\n\n\n\n\nWith two more Alpine stages to come and five stages left, Vingegaard and his Visma team did everything they could to hurt the Team UAE leader, Pogačar, and can only hope they have tired the pugnacious champion.\n\n\n\nBut the 26-year-old resisted all they threw at him, despite being isolated from his teammates early in the climb.\n\n\n\n\n\nStage 17 should be one for the sprinters as Tim Merlier hopes to add to his two stage wins and current green jersey. Jonathan Milan also targets a second win at the 700m straight run to the finish line at Valence.\n\n\n\n\n\nThe weather, however, could rewrite the script with 50km/h winds forecast along the 170km run.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-climate-change-scenario-that-could-leave-australia-unrecognisable/l6ofkeygt",
        "title": "The climate change scenario that could leave Australia 'unrecognisable'",
        "publish_date": "Tue, 22 Jul 2025 20:14:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians are already living with the consequences of climate change, and every fraction of a degree of global heating matters, according to a new report.\n\n\n\n\n\nThe report examined climate change globally, with a focus on Australia's 2035 climate targets, which are yet to be announced.\n\n\n\n\n\nThe Climate Council said climate pollution has led to average global temperatures increasing by 1.3C, driving more ferocious and frequent extreme weather.\n\n\n\n\n\nIn 2025, communities in parts of Australia have experienced cyclones, flooding, marine heatwaves, fires and droughts, with climate-fuelled disasters costing Australia more than a billion dollars this year.\n\n\n\n\n\nThe future scale and severity of these issues will depend on how quickly governments reduce global climate pollution, according to the Climate Council report.\n\n\n\nREAD MORE The problem that could cost Australia more than $8 billion every year\n\n\"Every fraction of a degree of global heating matters: the difference between 1.5 degrees and 2 degrees is existential for vulnerable communities, coral reefs, agriculture, and ecosystems,\" the report said.\n\n\n\n\n\n\"While many countries are now taking measures to cut climate pollution, the combined effort is not yet at the speed or scale required to protect humanity from the worst impacts of climate change.\"\n\n\n\nWhat could happen to Australia?\n\nThe report examined potential real-world impacts at different degrees of global warming, and found impacts \"amplify rapidly\" between 1.5 and 2C.\n\n\n\n\n\nIf global temperatures increase by 2C, extreme heat will become 2.6 times worse, the number of ice-free summers would become 10 times worse compared with 1.5C, the report said. It also found the number of invertebrates and plants lost would double, and the number of insect species lost would triple.\n\n\n\n\n\nIt also said the decline of coral reefs would increase by up to 29 per cent, and the decline in marine fisheries would double.\n\n\n\nIf temperatures increased by 3C, Australia would become \"unrecognisable\", the report said.\n\n\n\n\n\nIt said the impacts would extend from \"very severe\" to \"catastrophic\", with extreme heat, droughts, cyclones, storms and flooding set to become more intense and frequent.\n\n\n\n\n\nHotter temperatures would exacerbate long-term factors that could damage physical and mental health, put infrastructure and population in cities under strain, and render many properties and businesses unavailable.\n\n\n\n\n\nIf global warming increased by 3C, Australia's coral reefs would cease to exist, along with many fishery and tourism industries, and marine ecosystems globally. Many land ecosystems and primary industries would be destroyed or changed \"beyond recognition\", according to the Climate Council.\n\n\n\nWhat are the recommendations?\n\nThe Climate Council said Australia's 2035 climate target must be \"very strong\", with analysis showing that net zero is the \"only target available\" with a strong chance of contributing to holding global warming below 2C.\n\n\n\n\n\nTheir analysis found Australia needs to reduce climate pollution by 75 per cent or more from 2005 levels by 2030, and reach net zero by 2035 to adequately contribute to global targets.\n\n\n\nThe Climate Council also recommended amending the Climate Change Act to legislate 2035 targets into law, which it says will provide an important signal, leverage and policy certainty for coordination across all levels of government and the broader community.\n\n\n\n\n\nIt also said Australia's climate targets should include a commitment to phase out fossil fuel use, production, exports and subsidies, including a clear plan with timelines.\n\n\n\n\n\nThe report said the targets must be based on \"genuine and real reductions\" to emissions, including minimising reliance on offsets.\n\n\n\nWhat is the government doing on climate change?\n\nThe Albanese government has made a series of steps and commitments on climate change.\n\n\n\n\n\nIn its first term, the government approved enough renewable energy to power more than 10 million homes, invested $1.2 billion to save the Great Barrier Reef, and enshrined a target of net zero emissions by 2050 into law.\n\n\n\n\n\nBut it has also been criticised for its approval of coal mine extensions and oil and gas projects, which environmental groups say undermine credibility in tackling rising emissions.\n\n\n\nThe Greens are set to introduce a \"climate trigger\" bill to the new parliament on Wednesday.\n\n\n\n\n\nThe bill would require the government to consider climate impacts when considering whether to approve projects like coal mines.\n\n\n\n\n\n\"Our bill would force the climate impacts of projects to be considered by the minister, and it would also ensure mega-polluting projects can’t get environmental approval at all,\" Greens leader Larissa Waters said.\n\n\n\n\n\n\"Dirty fossil fuel projects need to be properly assessed for their impacts and rejected, so our kids, and all the precious species we share this beautiful planet with, have a safe climate future.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/cadbury-supporting-melbournes-chin-community/fm9mb1xf8",
        "title": "Cadbury supporting Melbourne’s Chin community",
        "publish_date": "Tue, 22 Jul 2025 10:11:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/banks-slump-as-investors-turn-to-miners-rba-minutes/k2638cqhl",
        "title": "Banks slump as investors turn to miners; RBA minutes",
        "publish_date": "Tue, 22 Jul 2025 08:00:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/why-is-it-so-hard-to-challenge-ageism-in-the-workforce/rq3sfa5bl",
        "title": "Why is it so hard to challenge ageism in the workforce?",
        "publish_date": "Tue, 22 Jul 2025 07:42:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIt's a challenging time to be aged in your 50s in Australia.\n\n\n\n\n\nThe group is often known as the sandwich generation, balancing caring responsibilities for their aging parents and their children.\n\n\n\n\n\nAnd now, a new report sheds light on a concerning perception of the group in the workforce.\n\n\n\n\n\nWhile they're still far away from Australia's official retirement age of 67, more employers are viewing their workers as older once they hit the age of 51, according to research by the Australian H-R Institute and Australian Human Rights Commission.\n\n\n\n\n\nThe study also found while half of employers responding to the survey find it difficult to fill vacancies, just 56 per cent of them say they are to a large extent open to hire workers aged 50 to 64.\n\n\n\n\n\nSarah McCann-Bartlett is the CEO of the Australian HR Institute.\n\n\n\n\n\nShe says there's been a drop of the minimum age perceived to be old.\n\n\n\n\n\n\"That's perhaps because we're in an era of really fast-paced technological change, and we know that there is an assumption, not necessarily correct, that older workers are not as good with technology as younger workers. And I think the other reason could be we've got a younger generation who are wanting to work (faster) through their careers and having career opportunities faster. So those two could be coming to bear a little bit around that view of what age a worker becomes older.\"\n\n\n\n\n\nDespite that perception, Ms McCann-Bartlett says many employers actually find no differences in performances between older and younger workers.\n\n\n\n\n\nStill, it's not a new reality that workers in their 50s are being sidelined, as they are perceived as older in the workforce.\n\n\n\n\n\nProfessor Carol Kulik from the University of South Australia has researched into the phenomenon of so-called 'queue jumpers', which refers to healthy workers choosing an early retirement in their 50s.\n\n\n\n\n\n\"I'd say that probably the biggest thing that we see, and there has been no change in this over time, is that hiring managers often make the assumption that they want to hire somebody who's going to give them a good return on investment, and so they believe that hiring a younger person means that the younger person is going to stay in the job longer, and an older person, well, the closer they get to retirement, the more likely they are to leave.\"\n\n\n\n\n\nProfessor Kulik says that's a mistaken assumption, as several studies have found young people tend to change jobs more frequently.\n\n\n\n\n\nShe says the reason it's so hard to change this is because some hiring professionals still hold outdated beliefs about the relationships between organisations and employees.\n\n\n\n\n\n\"We just have decades of an understanding of employment relationships where organisations would hire new employees based on potential, and they saw it as a long-term commitment, but we're seeing such dramatic changes in what people want from employment relationships. So for example, right now, we're seeing that 60 to 70% of new entrants to the labour force say that they don't want to become managers. Well, the way we've traditionally retained people is to promote them into managerial roles. So I think some of the thinking of hiring managers hasn't really caught up to what we're seeing in the data.\"\n\n\n\n\n\nAge Discrimination Commissioner Robert Fitzgerald also says ageism in employment has been present for a long time, but it's time that Australia takes efforts to challenge it.\n\n\n\n\n\n\"Businesses today need to recognise that Australian society is changing, their customers are changing, and there is a need in many businesses to represent older faces and older voices in their businesses. There's also chronic labour shortages, and therefore businesses need to be able to meet those shortages, and the only way they're going to be able to do that is by engaging with older people.\"\n\n\n\n\n\nDr Marlene Krasovotsky is part of Everyage Counts, a community organisation against ageism.\n\n\n\n\n\nShe says as Australia has an ageing population, the phenomenon of 'the sandwich generation' will only get more and more common.\n\n\n\n\n\nAnd one way to counter ageism is to allow people of various ages to work together.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Simon Letch",
        "publish_date": "Wed, 23 Jul 2025 12:24:26 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Simon Letch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/classy-gesture-as-dre-russ-bows-out-20250723-p5mh7r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Classy gesture as Dre Russ bows out",
        "publish_date": "Wed, 23 Jul 2025 12:21:35 +1000",
        "category": "finance",
        "authors": [],
        "text": "Classy gesture as Dre Russ bows out\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/haslers-500th-game-to-hasten-axe-20250723-p5mh7j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hasler's 500th game to hasten axe",
        "publish_date": "Wed, 23 Jul 2025 12:16:37 +1000",
        "category": "sports",
        "authors": [],
        "text": "Hasler's 500th game to hasten axe\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/sydney-eating-out/rockpool-team-to-open-restaurant-serving-only-steak-frites-20250619-p5m8sc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney’s first steak frites-only restaurant is now open, by the Rockpool team",
        "publish_date": "Wed, 23 Jul 2025 12:16:07 +1000",
        "category": "finance",
        "authors": [
            "Scott Bolles",
            "Erina Starkey"
        ],
        "text": "Advertisement\n\nThe menus are printed and ready for 24 York’s first day of service – but whether diners will need them is another story. The latest opening from Hunter St. Hospitality, the group behind Rockpool Bar & Grill, Spice Temple and The Collective, sticks to a tight format: with just one main course, one side and one dessert. The star of the show is the classic French bistro dish of steak frites, with chef Santi Aristizabal using the same scotch fillet cut from Gippsland that he has on the menu at sister restaurant Rockpool Bar & Grill in Melbourne. The steak frites at 24 York is made with O’Connor scotch fillet and comes with a choice of four sauces. When you offer just one steak, serious consideration is invested in its selection. The trio of culinary directors at Hunter St. Hospitality, chefs Aristizabal, Andy Evans and Shimpei Hatanaka, first had to eliminate other cuts such as hanger, skirt and sirloin before deciding on scotch fillet for a range of reasons, including fat content, chewiness, mouth feel and taste.\n\nAdvertisement\n\nThe steaks were lined up in a blind tasting of scotch fillet from 12 suppliers. Aristizabal, who oversees all three Rockpools in Sydney, Melbourne and Perth, said at $48 (with chips), the 220-gram scotch fillet from Gippsland producer O’Connor is good value. “At Rockpool in Melbourne you pay $95 for 400g on the bone, which is around 350g bone off. The steak at 24 York is only one marble score lower [than Rockpool].” Diners will still have some decisions to make. The steak can be cooked two ways – medium or well done – and comes with a choice of four sauces: peppercorn, mushroom, chimichurri or umami butter infused with kombu, eschalot, garlic and lemon. Hunter St. Hospitality’s culinary directors Andy Evans, Santi Aristizabal and Shimpei Hatanaka will oversee 24 York when it opens in July. Steven Woodburn To achieve a rosy pink centre, the fillets are seared on a very hot grill for two to three minutes, rested, then returned to the grill for a final char, before being seasoned with Murray River salt and served pre-cut in thick slices.\n\nAdvertisement\n\nTucker doesn’t hide from the fact 24 York’s steak frites approach takes inspiration from Le Relais de l’Entrecote in France, which has successfully leant on steak and chips for more than half a century. He says customers increasingly appreciate venues that do a single thing well, but said critical mass is needed for the concept. “I wouldn’t have done this in Surry Hills,” Tucker said. With Rockpool and The Cut in its portfolio, Tucker is confident his group has the chops in the steak department. He said the decision to include chips was easy: “The one thing that always ends up on every table [that orders steak] is chips.” The fries fall somewhere between a standard cut chip and a French fry, and like those at Olympic Meats in Marrickville and Rosie’s in Coledale, they’re cooked in beef tallow for a richer, meatier flavour.\n\nAdvertisement\n\nThe single side dish is a simple green salad made with seasonal leaves and a mustard dressing. Drinks are equally tight and affordable. There are four house wines – two reds and two whites, priced from $12-$13 by the glass or $39-$45 by the bottle. Asahi, Resch’s and Guinness are on tap, while the cocktail selection consists of six classics, including a martini, negroni and old fashioned – all priced at $18. The opening of 24 York also signals a shift in strategy for Hunter St. Hospitality. The venue has opened in the former home of The Bavarian, which the group decided to close after operating at the York Street site for the past 14 years to focus on “unique venues” rather than chains. “The area’s changed,” Hunter St. Hospitality chief executive Frank Tucker said. That change is reflected in the restaurant’s more refined fit-out, which is elegant without being overdone. The 200-seat restaurant nods to the New York bistro style with dark timber finishes, globe pendant lights and intimate booths framed by short sheer shop-curtains. And the dessert? It’s a mini New York cheesecake with fresh raspberries and a quenelle of vanilla ice cream. What more do you need?\n\nAdvertisement\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-how-e-bike-battery-fires-are-starting-20250722-p5mgt1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Olympic swimming centre to blow out by $500 million | Third person charged with murder of Zdravko Bilic | How e-bike battery fires are starting",
        "publish_date": "Wed, 23 Jul 2025 12:05:30 +1000",
        "category": "finance",
        "authors": [],
        "text": "A scientist has rejected calls for private e-scooter riders to wear full-face helmets, despite the RACQ’s call to mandate them to reduce injuries to riders.\n\nThe motoring body argues that 65 per cent of riders turning up at Queensland’s emergency departments said they were wearing a helmet.\n\nBut scientist Arkadiy Matsekh, who appeared at Queensland’s e-mobility inquiry as an industry witness, said introducing them would put a lot of people off riding e-scooters.\n\nLoading\n\n“The biggest danger to people on bicycles are not themselves – this is the heavy vehicles,” he said.\n\n“Those who want to use them (full-face helmets), they are welcome.\n\n“Nobody would want to use a full-face helmet to just try to get some groceries.”\n\nMatsekh, who has cycled about 140,000 on Australian roads, said Europe did not have mandatory helmet laws.\n\n“A piece of styrofoam on your head will not protect you from being hit (by a car),” he said.\n\n“A major source of threat to vulnerable road users are, of course, vehicles, and we need to basically seek this cultural shift.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/this-old-bugger-s-guide-to-happiness-has-one-golden-rule-20250716-p5mfdp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This old bugger’s guide to happiness has one golden rule",
        "publish_date": "Wed, 23 Jul 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Michael Dwyer"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Geoff Hutchison has officially entered the harrumph zone. Change is everywhere. His waning status. His ageing body. This whole shot-to-hell world. Whether on ubiquitous screens or the drive to the supermarket, stupidity and inconvenience conspire to exasperate him. His mission now: How Not to Become a Grumpy Old Bugger. “I genuinely think I’m a better person for having written it,” the former ABC radio presenter says of his first book, subtitled A bloke’s guide to living a better life. “I’ve had cause at times to remind myself, if I’m going to tell other people how they should live their lives, I’ve got to respond to that. I’ve got to take this stuff seriously.” After 40 years as a journalist, not least with Foreign Correspondent and 7.30, he knows serious. But it was his last 16 in talkback on ABC Perth that gave him the necessary tone for a book addressing the minefield of male discontent: rigorous enquiry, sure, but with a lightness of touch that invites leaning in. “I wanted to hit blokes between the eyes on a couple of things, but I also know they will put the book down and never read another paragraph if I can’t win them over to the conversation,” he says. “Although I still think their partners might read bits of it out loud to them in bed. That would make me happy too.” In terms of inspiration, he recalls one beacon of grump from early in his talkback career: February 13, 2008, the day new PM Kevin Rudd apologised to the Stolen Generations. “I reckon the first six callers were blokes, and they were all saying, ‘I don’t see that I should have to apologise for anything’. I didn’t say it on air but I thought, ‘Oh my god, how can these blokes be such bastards?’ “Back then I took it personally. I don’t now. I would now want to say to those blokes: ‘This isn’t about you. Not everything that happens in the world is about you.’ That whole ‘Harrumph, well I don’t like it’ – I want to convince them to just let some things go.” Hutchison’s book is not interested in culture wars. He isn’t out to debate pronouns or cancel culture. What he’s describing is something quieter and more insidious: a kind of emotional shrinkage, a stubborn stand-off with acceptance.\n\nAdvertisement\n\n“You raise the kids, the job ends, and you become a little less interesting to everyone. That’s the bit no one tells you,” he says, with the fresh insight of the recent retiree. “And if you were defined by that role” – the job, the dad, the problem-solver – “I think you’re very vulnerable to sadness. And loneliness.” Hutchison spent the last 16 years working at ABC radio, where many of his callers helped inspire his book. The grim end of male sadness is devastating. In Australia, Hutchison discovered, 86 men call an ambulance every day with thoughts of suicide. In 2023 alone, 64 women were killed in acts of male violence. But he doesn’t have to consult experts and statistics to see the darkness festering in blokes’ heads. He recalls stumbling on a social media chat sharing the praises of Italian restaurants. “Every positive comment came from a woman. Every negative and unnecessary one came from a bloke. And I’m just thinking, who are you? What are you doing, sitting at a keyboard, hating everything? Is there any pleasure in that?” Then there was a bloke named Ian, compelled to comment under an exultant photo of three young footy players with hands casually resting on each other’s knees. “Back when I played footy,” Ian said, “we would get the shit kicked out of us for posing like that.” TAKE 7: THE ANSWERS ACCORDING TO GEOFF HUTCHISON Worst habit? It used to be celebrating cynicism. But after hearing Billy Bragg declare that “cynicism is the enemy of hope”, I am now determinedly of the same opinion. Greatest fear? I don’t like them Fascists very much. Indeed, anyone who seeks political advantage by using fear to target and blame “others”. And I’m wary of anyone who thinks the concept of Prosperity Theology is endorsed by a greater power. The line that stayed with you? ”Love this life, don’t wait ’til the next one comes” – Neil Finn. Biggest regret? A kitchen accident that left my young son only partially sighted. I had my back turned as he tried to open a bag of apples with scissors. And yes, it was as awful as it sounds. I’ve written about it for the first time in my book in the chapter titled Regret. Favourite book? Richard Ford’s The Sportswriter (1986). I was a young version of one at the time. The artwork/song you wish was yours? The Portrait of the Journalist Sylvia von Harden by the German painter Otto Dix. If you could time travel, where would you choose to go? London in the mid ’60s please, with plenty of money in my pocket. And if you could get me into the Marquee Club to see … oh I dunno, David Bowie, The Rolling Stones or Jimi Hendrix that would be splendid. “That bloke is just curating a museum of dickheadedness,” Hutchison says. “It’s awful, and I bet it’s making him sick. I bet his wife doesn’t like him much. And I bet his son doesn’t come home to watch footy on Friday nights because he can’t bear to hear Dad talk about their haircuts.”\n\nAdvertisement\n\nThat author doesn’t exempt himself. He recounts one episode of fuming at an umpire’s call that his daughter, gently, had to tell him was pathetic. He talks about making his mates laugh by impersonating “some dickhead” at the pub. “I find that kind of cynicism less funny now. When blokes shrink into that tight, narrow worldview, they must be awful to live with.” He owns that too. Post-ABC, he assumed more time with his wife, Philippa. But her career as a documentary maker is firing. “She’s about to fly to the UK for three weeks of interviews. So I had to remind myself: you don’t need to be at the centre of everything. You can swan around on the edges. Pick and choose how you want to engage. Just make sure you do.” The active pursuit of engagement is a theme of Hutchison’s book. “If you’ve got male friends, place some value on that friendship. Whatever the next five, 10, 20 years look like – and they might be terrific, or they might be absolutely shithouse – you want to have people to talk to about it.” That refusal to disappear, to keep showing up, runs through the people he interviews. There’s social researcher and psychologist Hugh Mackay, still sharp and empathetic at 86. Alex Pearce, the Fremantle Dockers’ captain is emotionally open in a way Hutchison finds quietly radical. Through his son he meets a trans woman named Gemma, whose calm presence contrasts powerfully with the rage of anonymous detractors. Two GPs talk bluntly about ageing bodies behind pseudonyms designed to tickle sci-fi-nerds: Peter Venkman and Leonard McCoy. At both ends, it’s Hutchison’s late father who anchors the book. The man who blithely proclaimed his unhappiness as a fact of life when Geoff was a boy “used to come home from the Italian Club in Pickering Brook and say, ‘God, people are stupid’. I used to think, ‘Is it just the gang you’re hangin’ out with Dad?’ I’ve got to believe not everyone is quite so venal or miserable.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/trump-sparks-a-6-4-billion-wipeout-for-a-us-icon-20250723-p5mh37.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump sparks a $6.4 billion wipeout for a US icon",
        "publish_date": "Wed, 23 Jul 2025 11:58:14 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "GM says it believes it can eventually offset about a third of the $US4 billion to $US5 billion cost of the tariffs this year by cutting costs and shifting some production to the US. That suggests the ongoing cost of the tariffs in the near term will be more than $US3.3 billion a year, though GM executives hope that trade deals with South Korea, Mexico and Canada – where most of its imported cars are sourced – may reduce that cost. As this quarterly earnings season in the US continues, commentaries from trade-exposed US companies will be pored over for references to the tariffs and how the companies are responding to them. GM chief Mary Barra. There is more pain coming for the car giant. Credit: Bloomberg Last week’s June inflation data showed that in sectors directly exposed to tariffs – sectors such as fresh fruit and vegetables, household appliances, furniture, toys, clothing and sporting goods – prices are rising. The cost of the tariffs in those sectors is being passed onto customers and is affecting the inflation rate.\n\nThere’s been a lot of inventory loading occurring in the US to get ahead of the tariffs, so their impact on the inflation rate and/or companies’ profits should progressively increase as those pre-tariff stocks run down. Loading Some companies, of course, benefit from the protection provided by tariffs, which shield them to some degree from competition from imports, and where the increased cost of imports provides cover for domestic firms to raise their own prices. The US steel industry, with aluminium, was one of the earliest beneficiaries of Trump’s tariffs. Trump announced a 25 per cent tariff on steel and aluminium imports in February and then doubled the rate, to 50 per cent, last month. About 23 per cent of the steel supply in the US is imported, with the rest produced domestically by steelmakers that are regarded as the world’s most expensive producers.\n\nTheir response to Trump’s tariffs has, predictably, been opportunistic. They’ve raised their prices, which are up about 16 per cent this year. That’s history repeating. In 2018, during Trump’s initial trade war with China, he imposed a 25 per cent tariff on steel imports, and the US steelmakers responded by lifting their prices by about 10 per cent, which added about $US2.5 billion to their profits. The 2018 experience shows that companies also improved their capacity utilisation and added investment and jobs – but the impact was relatively short-lived, and the costs in jobs and lost earnings to steel-consuming industries were multiples of the benefits created for the steel producers. Not only is the duty on steel today double what it was in 2018, but it applies more broadly, not just to imported steel but also to imports of steel “derivatives”, or products where steel is a major component.\n\nThe impact on the tariff on steel – and similar tariffs on aluminium and copper – will percolate through the US manufacturing sector, with a particular impact on an auto industry that is also subject to its own tariffs. If Trump follows through with his threatened 50 per cent tariff on all imports from Brazil (unless Brazilian authorities drop their prosecution of former president Jair Bolsonaro for an alleged attempted coup), the tariffs’ impact on the cost of steel would be exacerbated. Brazil is a major supplier of raw materials to the sector. At some point, probably not too far into the distant future, GM and other US manufacturers will be overwhelmed by the cost increases flowing from the barrage of tariffs on auto and auto part imports and on their raw materials and be unable to absorb them without passing on a substantial proportion to customers. That is when their full effects on the inflation rate will start to show up. The “Trump effect” on the auto industry isn’t confined to tariffs.\n\nHis aversion to electric vehicles and climate-related initiatives and his assault on the Biden administration’s subsidies and incentives for carbon emission reductions and green energy, includes the withdrawal of subsidies for EV purchases and tax credits for emissions reductions. That will hit Tesla, which has relied on the sale of the regulatory credits for its profitability – it would be loss-making without them – hardest. While Trump keeps claiming that the US is collecting massive amounts of tariff revenue from other countries’ exporters, the GM experience underscores what almost everyone else has always understood. It might, in the near term, help other US EV manufacturers, even GM – the second-largest US domestic manufacturer of EVs – which have had to buy the credits to offset the emissions from their larger internal combustion vehicle production. What it and, thanks to tariff and non-tariff barriers, the near-total absence of competition from imported EVs will do, however, is drive up the cost of domestically produced EVs, reduce their sales volumes and undermine the scale efficiencies that might lead to EV profitability.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/technology/high-end-heist-australians-caught-up-in-louis-vuitton-data-breach-20250723-p5mh2u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "High-end heist: Australians caught up in Louis Vuitton data breach",
        "publish_date": "Wed, 23 Jul 2025 11:57:28 +1000",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "High-end luxury brand Louis Vuitton has confirmed that Australian customers were caught up in a data breach, with personal information including birthdates, contact details, purchase history and preference data stolen by hackers.\n\nAffected customers were informed via email on Monday, with the company revealing it became aware of a breach some three weeks earlier, on July 2.\n\n“We regret to inform you that an unauthorised third party temporarily accessed our system and obtained some of your information,” the email reads.\n\nHigh-end luxury brand Louis Vuitton has confirmed that Australian customers have been caught up in a data breach. Credit: Bloomberg\n\n“We would like to reassure you that no password nor financial information – such as credit card information, bank details or other financial accounts – was contained in the database accessed.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/review-set-to-start-on-rockhampton-olympic-rowing-venue-20250723-p5mh4p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Review set to start on Rockhampton Olympic rowing venue",
        "publish_date": "Wed, 23 Jul 2025 11:55:23 +1000",
        "category": "sports",
        "authors": [
            "Cameron Atfield"
        ],
        "text": "A technical review of the Fitzroy River Olympic rowing venue is about to begin, Premier David Crisafulli announced as he visited the planned Rockhampton venue to mark seven years to the day until the start of the Brisbane 2032 Games.\n\nCrisafulli said the Games Independent Infrastructure and Coordination Authority would conduct the review, which would start immediately.\n\nBut, ultimately, World Rowing would decide whether the Fitzroy was an appropriate venue for Olympic competition.\n\nRowing on the Fitzroy River in Rockhampton. Credit: Rockhampton Regional Council\n\nProfessor David Hamilton, the director of Griffith University’s Australian Rivers Institute, said the Fitzroy posed legitimate concerns for competition integrity.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/e-bike-scooter-ban-flagged-for-trains-over-fire-risk-20250722-p5mgyx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "E-bike, e-scooter ban flagged for trains over fire risk",
        "publish_date": "Wed, 23 Jul 2025 11:52:32 +1000",
        "category": "finance",
        "authors": [
            "Patrick Hatch"
        ],
        "text": "Electric scooters and e-bikes would be banned from train carriages across Victoria under rules the transport department has proposed to address the risk of lithium-ion battery fires.\n\nA Metro train was evacuated when an e-bike burst into flames at Union Station, in Melbourne’s east, in March, and e-bike and e-scooter batteries have also been blamed for hundreds of house fires over the past few years.\n\nAn e-bike caught on fire on a Metro train in March. Credit: Reddit\n\nOn Tuesday, the Department of Transport and Planning released proposed new rules that would ban e-scooters, e-bikes and other battery-powered transport devices such as e-skateboards from Metro and V/Line trains, as well as V/Line coaches.\n\n“A fire on a train is a serious safety issue because it may be difficult to evacuate passengers on a crowded service or where trains are in between stations,” a summary paper of the rule changes says.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/reviews-and-advice/travelling-on-a-sleeper-train-is-an-exercise-in-space-management-20250714-p5meqt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Travelling on a sleeper train is an exercise in space management",
        "publish_date": "Wed, 23 Jul 2025 11:47:23 +1000",
        "category": "finance",
        "authors": [
            "Riley Wilson"
        ],
        "text": "Australia by train: it’s a romantic step back in time on board a rattling silver snake that winds its way across the continent. It’s also an exercise in space management, with cabins on the Indian Pacific, The Ghan and the Great Southern demanding clever use of room storage in a cabin footprint that’s remained the same since 2008. Here’s the inside scoop on making the most of your space from the crew who do it every day.\n\nThere’s even a place for your hat. Credit: Illustration: Greg Straight\n\nPack light\n\nStart small and stay small. Indian Pacific journey manager Brittney Howe says this is the secret to a manageable and enjoyable cabin experience. There’s only really floor space for a soft duffel bag or a very small wheelie bag, so be conscious with your clothing and pack things that you can wear multiple ways.\n\n“You’ll be far more comfortable with a duffel bag – something soft that can pack away,” says Howe. “Then you’re not navigating and moving [bags] around the ladder and moving them every time you need to open the bathroom or cabin door.”",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/australia-huge-move-royals-015253293.html",
        "title": "Australia’s huge move on royals",
        "publish_date": "2025-07-23T01:52:53Z",
        "category": "finance",
        "authors": [
            "Brendan Kearns"
        ],
        "text": "The Australian government has removed all references to the Queen in standing orders. Picture: AFP Photo / Corporal Nathan GM Tanuku\n\nParliament has returned with big changes to the way the government conducts its business, including a new change to how it references the royals.\n\nThe way that the parliament goes about its work in the House of Representatives is governed by “standing orders”. Now, those orders have been amended to remove all references to Queen Elizabeth II – even though it’s been almost three years since the Queen’s death.\n\nAs the British monarch is Australia’s head of state, they are mentioned alongside their representative, the Governor-General, in the standing orders.\n\nAll references to Queen Elizabeth II will be removed from standing orders. Picture: Chris Jackson / Buckingham Palace / AFP\n\nLabor minister and leader of the House Tony Burke moved an amendment to the standing orders on Wednesday morning that would replace mentions of Queen Elizabeth II with King Charles III.\n\nADVERTISEMENT\n\nThe Queen was referenced at least 15 times in the standing orders, but all of those mentions will now be taken over by her successor.\n\nTony Burke introduced the changes to parliament. Picture: NewsWire / Martin Ollman\n\nQueen Elizabeth II died on September 8, 2022, aged 96.\n\nLiberal Party manager of opposition business Alex Hawke accepted the change but said he was “reluctant” to do so.\n\n“I will say upfront as a lifelong constitutional monarchist and a great supporter of our constitutional monarchy and Her Majesty Queen Elizabeth II, we are still in my view in the official mourning period,” Mr Hawke said.\n\n“We do accept, reluctantly, the changes to remove all references to the Queen from the standing orders and replace them with the sovereign.”\n\nAlex Hawke said it was a ‘reluctant but necessary change’. Picture: NewsWire / Martin Ollman\n\nHe called it a “reluctant but necessary change”.\n\nOther changes to standing orders include how long parliamentarians can be ejected from the house and how votes are recorded.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/ghosted-friend-4-expert-tips-012919831.html",
        "title": "Ghosted by a friend? 4 expert tips on how to handle the hurt",
        "publish_date": "2025-07-23T01:29:19Z",
        "category": "finance",
        "authors": [
            "Megan Willis",
            "Australian Catholic University"
        ],
        "text": "Ghosted by a friend? 4 expert tips on how to handle the hurt\n\nWhen we talk about “ghosting”, we usually think it relates to dating. But what happens when you’ve been ghosted by someone you’ve known for years – your childhood best friend, a parent, a child?\n\nThese disappearances can be harder to explain, and even harder to heal from.\n\nIt’s also surprisingly common. For instance, one study showed 38.6% of people have been ghosted by a friend.\n\nSo why do people ghost those closest to them? What impact does it have on those left behind? How do you begin to move on?\n\nWhat is ghosting?\n\nGhosting is when someone abruptly, or gradually, cuts off all communication without explanation. Whether it’s a friend, family member or love interest, the signs are much the same – messages left on read or calls ignored. Sometimes you’re blocked.\n\nADVERTISEMENT\n\nGhosting doesn’t just happen online. It can also play out in person, when someone deliberately ignores you – avoiding eye contact, refusing attempts to engage in conversation, pretending you’re not there.\n\nUnlike relationships that gradually wither over time, or end abruptly after an argument, ghosting is a one-sided withdrawal from a relationship that happens without closure.\n\nFor the person left behind, it can feel like grief.\n\nWhy do people ghost family and friends?\n\nPeople often ghost friends for the same reasons they ghost romantic partners.\n\nGhosting is more common – and considered more acceptable – in brief or casual romantic relationships or friendships. That’s when people may ghost because they lose interest, wish to avoid confrontation, or find it easier than facing the discomfort of ending things directly.\n\nADVERTISEMENT\n\nIn longer-term relationships, ghosting may stem from incompatibility, be prompted by different priorities, physical distance, or growing apart over time.\n\nMajor life transitions – such as becoming a parent, entering the workforce, moving, or going through a divorce – can often provide the catalyst for someone to shrink their social network.\n\nIn some cases, ghosting is driven by self-preservation or concerns for personal safety, particularly when ghosting involves family members.\n\nPeople report ghosting in response to toxic, emotionally draining, or abusive relationships, often when previous attempts to resolve issues were met with abuse or aggression. In such instances, ghosting isn’t so much an avoidance strategy, but a last resort to preserve someone’s safety and psychological wellbeing.\n\nGhosting has also been linked to certain personality traits. One study found people who reported ghosting others tended to score higher in narcissism (tend towards entitlement and lack of empathy) and borderline traits (so have trouble regulating emotions and are impulsive).\n\nWhy does it hurt so much?\n\nPeople often ghost as they hope to spare the other person the pain of rejection. But that is rarely the case.\n\nADVERTISEMENT\n\nBeing ghosted by someone you’ve been close to for a long time is often associated with grief, much like the death of the loved one. After the initial shock, there is often anger and sadness.\n\nGhosting also involves “ambiguous loss”. This ambiguity – the uncertainty and lack of closure – can almost freeze the grief process, making it particularly hard to move on.\n\nIn addition to grief-like emotions, ghosting is also often associated with self-blame, rumination, feelings of worthlessness, and trust issues that can affect how someone relates to others in the future.\n\nHow to cope if you’ve been ghosted\n\nThere’s no easy fix and you can’t force someone to communicate with you if they don’t want to. But research points to some strategies that may help you move on and ease the pain:\n\nAcknowledge your feelings. Grief-like emotions are a normal reaction to being ghosted. Accept your emotions and express them in healthy ways. This is better than suppressing them, which is linked to depression, low self-esteem and reduced wellbeing. Seek social support. Social support is linked to a range of mental health benefits. Talk about your experience with friends, family or a mental health professional. This can help reduce feeling of isolation, and low self-worth. Greater social support is also associated with post-traumatic growth – positive psychological change that can emerge after a challenging life event. Choose self-compassion over rumination. It’s easy to get caught in the trap of replaying what happened and wondering what went wrong. But this can prolong distress and make it harder to move on. Instead treat yourself as you would a close friend – with kindness, compassion and care. Self-compassion has been linked to reduced rumination, anxiety and depression. Exercise, mindfulness and spending time in nature are examples of self-care with similar psychological benefits. Create your own closure. Being ghosted can often leave you stuck in a cycle of uncertainty and unanswered questions. You may never get an explanation and waiting for answers will only make it harder to move on. Writing a letter you don’t send can help create closure. This form of expressive writing can help you articulate your thoughts and emotions and make sense of your experience – and is linked to a range of psychological benefits.\n\nADVERTISEMENT\n\nThis article is republished from The Conversation. It was written by: Megan Willis, Australian Catholic University\n\nRead more:\n\n\n\nMegan Willis does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
        "source": "Yahoo"
    }
]