[
  {
    "url": "https://www.9news.com.au/national/brisbane-cbd-crime-man-stabbed-hospitalised-queensland-news/9831b989-ca5c-4575-a1ff-2d8c8ab88d06",
    "title": "Man found with stab wounds in Brisbane CBD",
    "publish_date": "Fri, 28 Mar 2025 00:32:55 +0000",
    "category": "sports",
    "authors": [
      "Mar"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/finder-survey-most-experts-predict-rba-to-keep-interest-rates-on-hold/9c99bb5d-95c0-48a2-bafa-0d6f048ce1dd",
    "title": "Two out of three experts think RBA will keep interest rates on hold",
    "publish_date": "Thu, 27 Mar 2025 23:39:50 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "M﻿ortgage holders hoping for further relief on interest rates when the Reserve Bank of Australia meets next week will be disappointed, according to new research.\n\nThe board meeting starting next Monday will be the first since the RBA made its long-anticipated cut last month, bringing the cash rate down to 4.10 per cent.\n\n﻿Now a Finder survey of 34 economists has found two out of three think the central bank will keep the cash rate on hold when the RBA announces its decision on Tuesday afternoon (AEDT).\n\nLIVE UPDATES: PM calls election for May 3\n\nThe RBA are unlikely to deliver further relief on interest rates next week, a survey of experts has found. (9News)\n\nIt's a big shift in sentiment from hopes last month's cut would kick off consecutive cash rate reductions through this year.﻿\n\nFinder head of consumer research Graham Cooks said it looked like mortgage holders will have to hold out until May for the next cut.\n\n\"The February cut signalled a turning point for many cash-strapped borrowers – they hoped a couple more would be coming thick and fast,\" he said.\n\n\"New inflation figures show headline inflation is within target range, so while we're unlikely to see a second rate cut in April, we're anticipating further relief from May onwards.\" ﻿\n\nDespite a thumping belief the RBA will keep interest rates on hold, six of the 34 experts believe there is a case for slashing them.\n\nOne of them was Leanne Pilkington from Laing+Simmons who thinks a cut next month would be shrewd in light of recent jobs numbers.﻿\n\nLast week's data from the Australian Bureau of Statistics showed the seasonally adjusted unemployment rate remained flat at 4.1 per cent.\n\n\"As well as sustained cost of living pressure and moderating inflation, the unexpected hit to employment figures has widened the window of opportunity for the RBA to cut rates, which it is expected to do in coming months anyway. It might be prudent to act now,\" Pilkington said.\n\nThe survey was carried out before today's announcement by Prime Minister Anthony Albanese an election would be held on May 3, a factor alluded to by one expert.\n\nAustralia's fastest-selling homes: top suburbs revealed View Gallery\n\n\"Another rate cut coming soon but not just yet—it's not urgent, and the bank will want to keep a low profile during the election campaign,\" said Geoffrey Kingston, of the Macquarie University Business School in Sydney.\n\nLooking ahead, two in three experts surveyed forecast two or three more cuts this year.\n\nA thumping 93 per cent also thought lenders would continue to pass on the next cut to the cash rate in full.﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/powerball-20-million-dollars-won-by-queensland-woman/eb6afbb0-0c70-4b71-8038-2bb3b84fe78b",
    "title": "From $11 to $20 million: Queensland woman's life-changing lotto win",
    "publish_date": "Fri, 28 Mar 2025 00:02:21 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "A Queensland woman already has her goals lined up after scoring a $20 million Powerball win overnight.\n\nThe woman, who is from Leichhardt in Ipswich, was the only division one winner in the draw.﻿\n\nShe was left speechless when a lotto official contacted her this morning.\n\nLIVE UPDATES: ﻿ PM switches immediately into campaign mode\n\nA Queensland woman has won a $20 million Powerball jackpot. (Supplied)\n\n\"Oh my god! Oh my god! You're joking?\" she said.\n\n\"How does this happen? Oh, my goodness. I don't know what to say.\n\n\"I'm shaking. Thank you so much.\"\n\nThe woman said she would have to renew her passport. (Getty)\n\nThe woman, who doesn't buy a ticket every week, said she had only won \"small amounts like $11\" previously.\n\nBut she said she knew what she was going to do next.\n\n\"I'll be seeking financial advice right away,\" she said.\n\nHow Australia's lotto winners spent their cash View Gallery\n\n\"I can pay off my children's mortgages, and I might finally take a holiday. I haven't had one in years.\n\n\"My passport must be expired. I'll have to get it renewed.\"\n\nThe woman bought her ticket on The Lott website. The winning numbers were 11,7, 21, 17, 9, 13, and 24, with the Powerball number 11.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/king-charles-admitted-to-hospital-after-side-effects-from-cancer-treatment/931a1cb5-3d7e-4df2-906f-11a21049111e",
    "title": "King Charles hospitalised following 'side effects' from cancer",
    "publish_date": "Thu, 27 Mar 2025 21:20:29 +0000",
    "category": "lifestyle",
    "authors": [
      "Mar"
    ],
    "text": "It is also the same hospital where\n\nCatherine, the Princess of Wales\n\n, had abdominal surgery in January of the same year. Kate was later diagnosed with cancer and underwent a course of preventative chemotherapy which ended in September. The 43-year-old is now in remission and has\n\nresumed a near-full program of royal events\n\nthis year.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/doctors-told-chelsea-she-had-an-eating-disorder-and-forcefed-her-for-a-year-now-she-finally-has-a-diagnosis/add90b50-aa3a-4899-89cb-6c440cd60c57",
    "title": "Doctors told Chelsea she had an eating disorder - they were wrong",
    "publish_date": "Thu, 27 Mar 2025 06:54:52 +0000",
    "category": "lifestyle",
    "authors": [
      "Mar"
    ],
    "text": "Chelsea Bagnall has lived with excruciating pain for almost as long as she can remember.\n\nAs a child, she was sick on and off with urinary infections, bouts of vomiting and bowel issues.\n\nFour years ago, when she was 15 years old, Chelsea's health took a sudden and scary nose dive.\n\nThe bouts of vomiting became a daily occurrence and she began experiencing fainting spells. Chelsea's weight plummeted to 40 kilograms, while her body mass index (BMI) was sitting at just 13.\n\nChelsea spent weeks at a time in an eating disorder clinic, where she was force-fed. (Supplied: Emma Bagnall)\n\nInstead of receiving answers, Chelsea was misdiagnosed with an eating disorder and placed in an inpatient program where she was force-fed for a year.\n\nNow, after years of suffering, Chelsea, 19, finally has the correct diagnosis: Median Arcuate Ligament Syndrome (MALS) and Superior Mesenteric Artery Syndrome (SMAS), two rare conditions that compress major arteries and make eating unbearably painful.\n\nIn 2021, doctors were so concerned about her weight that Chelsea was admitted to a NSW hospital.\n\nThere, she was immediately fitted with a nasal feeding tube in an attempt to stabilise her weight.\n\n\"I was in there for a couple of days before a psychiatrist came to talk to me, but I realised quite quickly that I wasn't in a normal hospital room,\" Chelsea said.\n\n\"I was put in a room with three other girls who all had tubes in their faces as well. I didn't quite understand at the time that I was already being stereotyped into something that I wasn't even aware of.\"\n\nWhen she was seen by a psychologist, Chelsea said she was asked leading questions about her eating habits.\n\n\"She was asking me questions, like, 'What do you think of your body image? Have you ever made yourself vomit? Do you starve yourself?'\" Chelsea said.\n\n\"Obviously, I answered with, 'No, I've never starved myself, I've never made myself vomit. I've never wanted to be thin'.\n\n\"I quite clearly said to her, 'I want to put on weight. I want to be healthy'.\"\n\nDespite Chelsea's insistence that she did not have an eating disorder, doctors diagnosed her with avoidant, restrictive food intake disorder (ARFID) and placed her in an eating disorder program, where she would spend months at a time.\n\nHer mother, Emma Bagnall, told 9news.com.au she felt also pressured to believe in the diagnosis.\n\n\"They pulled me aside and had separate conversations with me. They told me, 'She's going to do anything she can to get out of this. She's going make excuses. She's gonna fight to not be here',\" Emma said.\n\n\"There were tears, and she was begging me to take her home, and I'd have to calm her down.\"\n\nREAD MORE: Peter Dutton quizzed on Coalition tax policy after budget handed down\n\nChelsea Bagnall, pictured with her mother Emma. (Supplied: Emma Bagnall)\n\nAs part of the program, Chelsea was weighed every morning and put in a room to eat her food in front of hospital staff with a timer.\n\n\"If we didn't finish in time the food was thrown out,\" Chelsea said.\n\n\"I was in there, and I realised these girls didn't have the same issues with eating as me, they weren't in excruciating pain.\n\n\"They were reluctant, and refusing at first, but eventually they gave in, because they realised they don't have a choice. I was trying to eat, but I couldn't keep up. Before I knew it, the alarm would go off and my food was snatched away from me.\"\n\nWhen she did not finish her food in time, Chelsea said she was given a liquid supplement to drink, which she would often immediately vomit up.\n\nWhile other patients in the eating disorder program would recover and go home, Chelsea would be in the hospital for long periods of time, attending school there.\n\nEmma said the treatment her daughter received was \"inhumane\" but just as worrying was the lack of other tests done to get to the bottom of her illness.\n\n\"They should have had her seen by a rheumatologist, endocrinologist, and gastroenterologist. They didn't,\" Emma said.\n\n\"No doctors did any tests, no one consulted her about anything else. There was no further investigation.\"\n\nChelsea was in and out of hospital for four years before she finally received a diagnosis. (Supplied: Emma Bagnall)\n\nThings did not change for Chelsea until the family moved to Canberra, where confused doctors confirmed she showed no sign of having an eating disorder and began running gastrointestinal tests.\n\nHowever, the breakthrough really came last Christmas during a visit to a GP, who had stepped in when Chelsea's regular doctor was away.\n\nThe GP, Emma said, pulled a stethoscope out and listened to Chelsea's stomach, before commenting that he could not hear any movement.\n\nHe ordered a CT angiogram, and while the mother and daughter were initially sceptical, it proved to be the missing link to the puzzle.\n\nThe scan showed a compression on Chelsea's left renal vein, leading to the diagnosis of Superior Mesenteric Artery Syndrome (SMAS).\n\nAn ultrasound later showed compressions on Chelsea's celiac artery as well, a sign pointing to Median Arcuate Ligament Syndrome (MALS).\n\nFurther testing has shown three areas needing surgery and Chelsea is set to finally get the help she needs with an operation in May.\n\nCanberra vascular surgeon Gert Frahm-Jensen said vascular compression syndromes, such as MALS and SMAS, were a controversial subject.\n\n\"They are considered very rare, although the reality is that they're probably more common than we think,\" Frahm-Jensen, an Associate Professor at the Australian National University's School of Medicine and Psychology, said.\n\n\"What makes it extra tricky is that sometimes patients have scans that show vascular compression but no symptoms, other times they have relatively mild compression but significant symptoms.\"\n\nWhile roughly one fifth of the population had some sort of compression of their celiac artery consistent with MALS, most of these people were not affected by chronic abdominal pain or trouble eating, Frahm-Jensen said.\n\nAdding to the difficulty with diagnosing MALS was the fact that there were many causes of stomach pain which were far more common, including gallbladder or pancreas problems or inflammatory bowel disorders.\n\n\"It becomes in many cases a diagnosis of exclusion, meaning you've ruled out everything else,\" Frahm-Jensen said.\n\nDespite scepticism from some doctors about whether MALS and SMAS were real conditions, about 70 per cent of people who underwent surgery for MALS and SMAS showed an improvement in symptoms afterwards, he said.\n\nChelsea said she hoped surgery would give her a chance to live a normal life, but the experience of being left to suffer in pain for years by the medical profession had left her scarred.\n\nTo those struggling with undiagnosed health problems, Chelsea has a message: \"You know your body. You know if something's wrong. Don't stop advocating for yourself, no matter how hard it gets, no matter how much you're dismissed, no matter how much you're gaslit into believing that you're fine.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/working-from-home-could-risk-your-career-impact-prospect-of-promotion-new-research/f8ab910f-372b-4991-8930-acad7a1ebf7f",
    "title": "Want a promotion? You might not get one if you WFH regularly",
    "publish_date": "Thu, 27 Mar 2025 02:00:36 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "Workers who are \"reluctant\" to return to the office might be putting their career at risk, new research has found.\n\nThe politicisation of working from home has reignited a fresh debate over whether you will be overlooked for a promotion if you aren't physically in the office.\n\nRecruitment agency Robert Half surveyed employers and discovered three out of four agreed in-office attendance impacts a person's chance of getting a raise or promotion.\n\nREAD MORE: Opposition leader Peter Dutton to pledge fuel cost slash if elected\n\nThree out of four employers say in-office attendance increases the chance of a promotion. (Getty)\n\nOnly 13 per cent of employers surveyed said they wouldn't use physical attendance as a benchmark for rewarding hard workers.\n\nA further 45 per cent of workers said they would spend more time in the office if attendance was a prerequisite for career progression.\n\n\"As employers increasingly value staff being physically present in the office, employees seeking continued remote work may face career progression challenges,\" said Robert Half director Andrew Brushfield.\n\n\"The 'out-of-sight, out-of-mind' effect is real. In-office presence increases visibility, fosters collaboration, and signals dedication and commitment, all factors employers consider for promotions.\"\n\nREAD MORE: Up to 9000 sensitive court files leaked in major NSW data breach\n\nOnly 13 per cent of employers surveyed said they don't look at WFH as a reason not to promote someone. (Getty)\n\nDespite this unwelcome news for remote workers, 17 per cent of employees said they would still choose working from home over the chance of a promotion.\n\nAmong the generations, Gen Z and Millennials were found to be the most receptive to returning to the office for promotional advantages.\n\nGen X and Baby Boomers were slightly less willing to increase their office days.\n\n\"Recognising the connection between visibility and promotions, businesses face a complex balancing act between enforcing in-office attendance and maintaining employee satisfaction and retention,\" Brushfield added.\n\n\"Transparent communication explaining the value of in-office presence is key to ensuring equitable opportunities for all employees.\"\n\nThe highest paid jobs that let you work from home View Gallery\n\nMillions of Australians work remotely at least part of the week, according to RedSearch.\n\nMore than half of all workers (53 per cent) work from home part of the time and 69 per cent of employers offer a hybrid model.\n\nPrime Minister Anthony Albanese last week championed the right to work from home and offer worker flexibility after Opposition Leader Peter Dutton suggested all public servants should be in the office full time.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/calls-grow-for-extra-paid-parental-leave-for-parents-of-premature-babies/99e77878-a2c5-420b-8c59-47ca2ab2084b",
    "title": "Calls grow for extra paid parental leave for parents of premature babies",
    "publish_date": "Thu, 27 Mar 2025 12:06:33 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "When single mum Nicole Mahoney's twin baby boys arrived 12 weeks early, all her carefully laid maternity leave plans were thrown into disarray.\n\nThe twins, Angus and Hugh, were both born weighing just 1.1 kilograms and were not much bigger than a 500ml bottle of chocolate milk.\n\nThey needed to spend months in a neonatal intensive care unit after their birth in March 2020, with one staying three months in hospital and the other five months.\n\nIt was an incredibly stressful time, Mahoney told 9news.com.au, with large amounts of her days taken up with just waiting at the hospital to hold her babies.\n\nTwins Angus and Hugh were born 12 weeks early and weighed just 1.1kg. (Supplied: Nicole Mahoney)\n\n\"You were only allowed to hold them once a day, and at times they were too sick, so you couldn't even hold them at all,\" she said.\n\nMahoney, who now lives in Adelaide, was working as a government employee in NSW at the time and had planned to take 12 months maternity leave.\n\nHowever, half of that time was taken up in hospital, Mahoney said, adding that she quickly realised how rigid the federal government's paid parental leave scheme was.\n\n\"From the day that the boys were born, I had to use maternity leave. It had to start then,\" she said.\n\n\"I had 12 weeks of sick leave I accrued, but I couldn't touch that.\n\n\"The frustrating thing is that if they had been born then gone to hospital at day 1 for this amount of time I would have been able to use my sick leave to care for them and be with them, so why not in this circumstance?\"\n\nMahoney said she spent much of the second half of her maternity leave taking the twins to medical appointments and protecting them from getting sick with their fragile immune systems.\n\n\"Even once you were out, you were just forever still at the hospital,\" Mahoney said.\n\n\"They were also really susceptible to catching things.\n\n\"For childcare, they told me don't put them in until they're at least one. Just don't do it, because you're just risking re-hospitalisation.\"\n\nMahoney is one parent joining a campaign from premature babies advocacy group Miracle Babies Foundation, calling on the Albanese government and Opposition to commit to changing the Paid Parental Leave legislation to include extra allowances for parents of premature babies.\n\nTimed to coincide with the lead-up to the federal election, the foundation's campaign is asking for primary carers of premature babies needing specialist care to be given an extra week of extra Parental Leave Pay for every week a baby is in the hospital beyond two weeks, with a maximum of 14 weeks extra pay. For fathers and partners, the foundation is asking for additional two weeks of extra Dad and Partner Pay.\n\nUnder the current legislation, eligible parents receive up to 20 weeks' paid parental leave at the national minimum wage. Working dads and partners receive two weeks' leave paid at the national minimum wage. The scheme will be expanded to 26 weeks by 2026, with four weeks reserved for each parent.\n\nNicole Mahoney's twin boys are now five years old. (Supplied: Nicole Mahoney)\n\nThe campaign follows a parliamentary petition on the same topic lodged by the Miracle Babies Foundation in 2023, which received more than 10,000 signatures.\n\nFollowing the petition, the Australian Public Service Commission enterprise agreement was updated to include additional leave for parents of premature babies, but this only applies to government employees.\n\nMiracle Babies Foundation co-founder and CEO Kylie Pussell said the current conditions of the parental leave scheme meant some parents of premature babies were coming home from hospital with no leave left.\n\n\"We believe that all babies should be going home from hospital with that same amount of parental leave,\" she said.\n\nPussell said parents and carers of premature babies were already under huge financial strain, with many having paid for months of travel costs to and from the hospital, as well as eating out and accommodation expenses.\n\n\"It's such a difficult time, and then when you get to baby's discharge and you've got no pay parental leave left, we're putting women in such a difficult position of perhaps having to leave the workforce because they have nothing left,\" she said.\n\nPussell said the lack of extra support for parents of premature babies also meant some could be forced to put vulnerable babies into childcare before they were ready.\n\n\"It's putting parents in a really difficult spot,\" she said.\n\nSocial Services minister Amanda Rishworth said she understood the unique challenges faced by families who had experienced the birth of a premature or sick newborn.\n\n\"Over the past three years, the Albanese Labor Government has delivered the biggest expansion to Paid Parental Leave since Labor first introduced the scheme in 2011,\" Rishworth said.\n\n\"Our changes are providing families, including those with a premature or sick baby, with the support they need to manage care of their child in the way that best suits their circumstances.\n\n\"This includes arrangements to enable parents to take time off work together for longer and to provide the additional flexibility that helps families who have a child in hospital.\"\n\nMahoney, whose twin sons are now aged five, said she hoped the government would reconsider their stance and increase the support for parents of premature babies.\n\n\"You'd be providing parents with the opportunity to actually spend that time with their kids that everyone else gets. It's being taken away from them,\" she said.\n\n\"These kids are very vulnerable, so being forced to send them back into childcare early, when they're still very susceptible to getting sick and having serious sicknesses as a result of it, it just puts them at risk.\n\n\"It's stressful to the families, and it also means that women will probably stay out of the workforce longer because you don't feel safe to put your kid into childcare when they've been that sick.\"",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/sydney-highest-parking-fees-in-new-report-nrma/3fb9ae88-9dc6-48ca-8ddf-9076a381bf00",
    "title": "Aussie city pays twice as much for parking as US, study shows",
    "publish_date": "Thu, 27 Mar 2025 00:19:07 +0000",
    "category": "finance",
    "authors": [
      "March"
    ],
    "text": "1 of 8 Attribution: Getty Images/iStockphoto\n\nNew research commissioned by the NRMA has found parking fees in Australia's biggest capital cities to be far in excess of what is paid in the US.\n\nThe NRMA published the findings in its Parkin' Mad report, calling on action to be taken to stop Australians getting gouged for having to commute by road.\n\nThey compared average all-day parking fees in Sydney, Melbourne, and Brisbane, to cities in the US of roughly equivalent size - San Diego, Boston, San Francisco, and Seattle.\n\nContinue through the gallery to see how they matched up.\n\nAll values have ﻿been converted from US dollars to Australian.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/election-2025-key-promises-labor-coalition/104717394",
    "title": "The key election promises from Labor and the Coalition",
    "publish_date": "Fri, 28 Mar 2025 01:48:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Labor and the Coalition have promised billions of dollars across the board to convince Australians to vote for them on May 3 — and it can be hard to keep track.\n\nThere's a laundry list of commitments Labor and the Coalition have already made, though you can expect more to come through the campaign, which will be added to this piece as they are announced.\n\nElection commitments aren't a complete picture of how the major parties intend to govern — their governing style, relations with foreign powers and reactions to domestic and global events are all essential parts of running the country that can't easily be captured by a list of promises.\n\nIt also doesn't account for compromises that may have to be made if neither party can form a majority, and must negotiate with other parties or independent MPs to win government.\n\nHere is a round-up of some of the more significant promises made by the major parties to be carried out next term.\n\nHealth\n\nLabor\n\nOne of Labor's major policy commitments is to tip $8.5 billion more into Medicare in an effort to have nine out of 10 GP visits bulk-billed by the end of the decade. The money would be spent to triple incentives to doctors not to charge any out-of-pocket costs to patients.\n\nIt would also go towards training 2,000 new GP trainees a year, and additional nurses.\n\nIn a $644 million promise, Labor will also expand the urgent care clinic network by opening 50 new centres by mid-2026, the bulk of which will be in NSW, Victoria and Queensland.\n\nLabor will also commit $573 million to women's health, including a boost to Medicare rebates for long-acting contraceptives such as IUDs.\n\nA new Medicare rebate would also be created for menopause health assessments as well as funding to train health professionals on the topic.\n\nThe government will also expand the network of endometriosis and pelvic pain clinics operating around the country from 22 to 33.\n\nAnd it will slash the price of PBS-listed medicines from $31.60 to $25, at a cost to the budget of $690 million.\n\nIn total the party has committed more than $9 billion in health spending.\n\nCoalition\n\nSeeking to head off a scare campaign over Medicare, the Coalition has promised to match Labor's $8.5 billion bulk billing promise \"dollar-for-dollar\".\n\nThe Coalition will also match Labor's promised $573 million boost to women's healthcare, and the $690 million promise to slash the price of PBS-listed medicines to $25.\n\nSeparately, the Coalition will commit $400 million towards financial incentives and leave entitlements for junior doctors who enter general practice, to bridge the gap that the Coalition says dis-incentivises junior doctors to enter GP clinics in favour of the hospital system.\n\nAnd a $5 million review of women's healthcare items will also be commissioned to identify gaps in services and subsidised medications for women.\n\nIn total, the party has committed more than $10.1 billion in health spending.\n\nCost of Living\n\nLabor\n\nWith impacts of more than two years of high inflation still being felt, both major parties are offering a suite of measures to directly relieve cost-of-living pressures, which have been collated here.\n\nLabor has promised to once again offer a rebate on household and small business power bills of $150, which will be automatically applied from July this year and paid over two instalments.\n\nIt will also deliver a small tax cut over two stages — the first on July 1 next year and the second on July 1, 2027. That will save every taxpayer about $5 a week in year one and $10 a week from year two onwards.\n\nThe cost of PBS-listed medicines will be reduced from $31.60 to $25, and remain at $7.70 for concession card holders.\n\nLabor has also promised to slash students' debts by 20 per cent in a one-off move , which it expects to wipe about $5,520 from the average HELP debt.\n\nIn total, those measures will cost the government more than $20 billion over the forward estimates, with the majority of that being the cost of tax cuts.\n\nCoalition\n\nThe Coalition's major cost-of-living offering is a 25 cent reduction on the cost of a litre of fuel, by temporarily halving the fuel excise for 12 months.\n\nIf that discount is fully passed on by wholesalers, the Coalition estimates it will save the average person about $14 on their weekly refuel.\n\nThe Coalition has said it won't stand in the way of Labor's $150 rebate on power bills to be applied from July over two instalments.\n\nSimilarly, it will match the promise to reduce the price of PBS medicines from $31.60 to $25.\n\nAnd it will offer small businesses tax deductions up to $20,000 for business-related meal expenses.\n\nAll told, those measures will cost about $8.75 billion over the forward estimates, with the bulk of that expense being the temporary halving of the fuel tax.\n\nHousing\n\nLabor\n\nLabor will match the Coalition's promise to ban foreign investors and temporary residents from purchasing existing homes for two years.\n\nThe party will also expand its Help-to-Buy scheme, which was legislated late last year. Under the scheme, the federal government covers part of the cost of a home for eligible first home buyers, and takes an equity stake that can be bought out at a later date.\n\nLabor will expand eligibility to single people earning less than $100,000 and couples earning less than $160,000, as well as raise the maximum price of properties eligible under the scheme.\n\nThe party will continue the rollout of money from its Housing Australia Future Fund, which is designed to support the construction of 55,000 social and affordable homes over the next five years.\n\nCoalition\n\nThe Coalition would establish a $5 billion fund to speed up essential infrastructure like water, power and sewage at housing development sites, which the party says will \"unlock\" up to 500,000 new homes.\n\nIt would also place a 10-year freeze on changes to the National Construction Code, which sets minimum safety and accessibility standards for buildings, to ease supply constraints and give investors more certainty.\n\nThe Coalition has also promised to ban foreign investors and temporary residents from purchasing existing homes for two years.\n\nAnd it would allow first homebuyers to access up to $50,000 from their superannuation to purchase a home — which would have to be returned if the home is later sold.\n\nIt has also promised to scrap Labor's $10 billion Housing Australia Future Fund, saying not a single home has yet been completed under the scheme.\n\nClimate and energy\n\nLabor\n\nLabor will extend rebates on electricity bills by another six months, meaning households will receive a $150 rebate on their power bills from July, paid over two instalments.\n\nThe party is yet to announce new climate change commitments, but will continue to pursue its stated ambition of having 82 per cent of the electricity market powered by renewables by the end of the decade, and have emissions 43 per cent lower than 2005 levels by the decade's end.\n\nCoalition\n\nOne of the Coalition's boldest commitments is to establish a nuclear power industry by building seven nuclear power plants in regional Australia.\n\nThe Coalition says under its plan the first reactor would be operational from 2035 or 2037 — depending on what technology is used.\n\nModelling commissioned by the Coalition suggested that plan would cost $331 billion to 2050, though the figure is disputed since that modelling assumed a smaller economy and smaller energy demands.\n\nThe life of ageing coal plants would be extended to cover the gap in the meantime.\n\nAssisting to cover the gap would be a significant expansion to gas infrastructure through a $1 billion fund, and a requirement for the gas giants to reserve up to 20 per cent of uncontracted gas for the domestic market.\n\nThe Coalition expects that would lower the price of wholesale gas from $14 to less than $10 by the end of this year.\n\nAs part of its energy policy, the Coalition would also fast-track the approval of Woodside's North West Shelf gas expansion, signing off within 30 days of taking office.\n\nAnd it would end Labor's $20 billion Rewiring the Nation Fund, which has been investing in transmission technology to get the grid ready for more renewables.\n\nThe Coalition has also promised to defund the Environmental Defenders Office, which has become a political football, having its funding cut under former PM Tony Abbott and then restored under the Albanese government.\n\nThe Coalition has said it won't stand in the way of Labor's $150 power bill rebate promise.\n\nChildcare\n\nLabor\n\nLabor has promised to establish a $1 billion fund to build and expand around 160 childcare centres over four years. It says where possible those centres would be located on or near school sites, and the government would retain ownership of those services.\n\nThe government brought forward its promise to scrap the childcare activity test in favour of a guarantee that every family would receive at least three days of subsidised care each week, meaning this promise has already become law.\n\nIt means from 2026 parents will not need to satisfy requirements to work, study or volunteer to receive the Child Care Subsidy.\n\nCoalition\n\nThe Coalition says it will ensure families have access to affordable and flexible quality early childhood education. The Coalition says it will announce its childcare policies closer to the election.\n\nMigration\n\nLabor\n\nLabor says it will announce its migration policies closer to the election, which will be in line with its stated goal of bringing migration \"under control\" and maintaining Australia's borders.\n\nCoalition\n\nThe Coalition says it wants to \"rebalance\" Australia's migration program.\n\nIf elected, the Coalition would reduce the annual intake of permanent migrants from 185,000 to 140,000 for two years (as well as a reduced intake of 150,000 in year three and 160,000 in year four).\n\nPeter Dutton has also said the Coalition will set a target for total migration (known as net overseas migration) during the campaign.\n\nIt would also reduce the number of refugee and humanitarian places offered each year from 20,000 to 13,750.\n\nThe Coalition would also raise fees for student visas above their current price of $1,600, and has promised to impose \"tougher caps\" on foreign students after rejecting Labor's legislation to limit international student numbers, though has not detailed what those would be.\n\nAnd it would ensure the deportation of \"non-citizen criminals\".\n\nLaw and order\n\nLabor\n\nLabor has promised $157 million over two years to crack down on the trade of illicit tobacco, with the tobacco black market draining government coffers and causing violence in Victoria and NSW.\n\nCoalition\n\nThe Coalition would give police new powers to stop and search people using detector wands, and restrict the sale and possession of knives to minors and \"dangerous individuals\".\n\nTargeting family violence offenders, the Coalition would also create an offence for using a carriage service to cause an intimate partner or family member to fear for their safety, or track them using spyware, or engage in coercive behaviours — with toughened bail laws for these offences.\n\nThe Coalition would also criminalise posting material on social media that depicts violence, drug offences or property offences in order to increase a person's notoriety, punishable by up to two years' prison and bans from those platforms.\n\nLaws that create mandatory minimum jail terms for all acts of terror, and for the display of Nazi symbols and terror symbols were passed in February with bipartisan support, after the Coalition promised to do so at the beginning of this year.\n\nTax\n\nLabor\n\nLabor will deliver two \"modest\" tax cuts, the first on July 1 next year, and the second on July 1, 2027. Those will reduce the lowest tax bracket from 16 per cent to 15 per cent in year one, and then to 14 per cent in year two.\n\nThe already legislated cuts would hand about $5 a week back to taxpayers from July 2026 and a total $10 a week back from July 2027, at a cost to the budget of 17.1 billion over four years.\n\nLabor will also commit $2 billion to production credits for aluminium smelters which only use renewable energy in their production process. Facilities will be eligible for support for every tonne of clean aluminium produced.\n\nCoalition\n\nThe Coalition will temporarily halve the tax on fuel, which will reduce the wholesale price of petrol and diesel by about 25 cents. If those savings are passed on to consumers in full it will save them about $14 on the average weekly refuel.\n\nIn exchange for that 12 month discount on fuel, the Coalition has vowed to reverse legislated tax cuts passed by Labor on the eve of the election, saying the halved fuel excise will be worth more to voters.\n\nThe Coalition will offer tax deductions up to $20,000 for business-related meal expenses for small businesses. The Coalition says it expects that policy to cost less than $250 million and to run for an initial two years.\n\nThe Coalition will also lift the limit for how much small businesses can immediately deduct from their taxes for purchased assets from $20,000 to $30,000 — known as the instant asset write-off.\n\nIt will also dismantle more than $16 billion in tax credits due to be made available to critical minerals and green hydrogen producers under Labor's \"Future Made in Australia\" agenda.\n\nAnd the Coalition will restore a self-imposed cap on how much tax can be raised by the Commonwealth. The previous Coalition government had a target of taxes being no larger than 23.9 per cent of Australia's GDP, but it was dropped by Treasurer Jim Chalmers.\n\nIndustrial Relations\n\nLabor\n\nLabor will ban non-compete clauses which restrict workers from moving to a competing employer, or from starting a competing business.\n\nThe party says the clauses have become commonplace in worker contracts and are suppressing wages, particularly for the low paid.\n\nThe ban will apply to workers earning less than $175,000, and similar 'no poach' agreements that block staff from being hired by competitors will also be banned.\n\nCoalition\n\nThe Coalition will mandate a return to the office for federal public servants, ending work from home arrangements that became normal during the pandemic.\n\nThe party has also promised to unwind much of Labor's industrial relations agenda if it wins government.\n\nIt would re-establish the construction industry watchdog, the Australian Building and Construction Commission, which was attempted by former PMs Tony Abbott and Malcolm Turnbull (who ultimately succeeded), and then abolished by Anthony Albanese in 2023.\n\nThe Coalition would also repeal \"right to disconnect\" laws, which prevent employers from punishing their staff if they do not respond to \"unreasonable\" calls or emails outside of work hours.\n\nAnd they would simplify the definition of a casual employee to make it clearer who is a casual.\n\nThey have not yet detailed whether they would change or dump Labor's \"same job same pay\" laws, which require employers to pay workers from labour hire firms the same as ordinary employees, but have promised to review those laws.\n\nSeparately, the Coalition has promised US-style anti-racketeering laws, that would allow bosses of organisations engaged in a pattern of illegal activity to be charged.ins\n\nMental Health\n\nLabor\n\nLabor will provide an additional $46 million over four years to establish an ongoing digital mental health service it committed to earlier in its term.\n\nCoalition\n\nThe Coalition will permanently restore the number of subsidised mental health sessions from 10 to 20 for people with a mental health care plan. The subsidy was extended during the pandemic but lapsed under the previous government.\n\nIt has also promised to invest $400 million more into youth mental health services, and expand the National Centre for Excellence in Youth Mental Health.\n\nThat money will also be spent on boosting regional services and \"place Australia at the forefront of youth mental health treatment in the world\".\n\nEducation\n\nLabor\n\nThe Albanese government has promised to raise the minimum income threshold before graduates must begin repaying student loan debts, as well as cutting how much has to be repaid.\n\nFrom July next year, repayments would not begin until people are earning at least $67,000, and the rate at which they must repay would be more closely tied to how much above that amount they are earning — which the government says will mean a person earning $70,000 would pay around $1,300 less per year in repayments.\n\nThe government has promised to cut a further 20 per cent off all student loans as a one-off measure to reduce debts that grew massively over two years of high inflation. It says that will wipe about $5,520 off the average HELP debt of $27,600.\n\nIt would also double incentive payments to people who complete an apprenticeship related to housing construction to $10,000. Those payments would be made in instalments with first paid out at the six-month mark of an apprenticeship.\n\nCoalition\n\nA target of 400,000 apprentices and trainees in training would be set under the Coalition, with targeted incentive payments for employers to hire and train apprentices.\n\nSmall and medium businesses would recieve $12,000 to put on a new apprentice or trainee in critical skills areas for the first two years of their training.\n\nThe Coalition has promised to restore a curriculum that puts literacy and numeracy fundamentals at its core, and cultivates critical thinking and responsible citizenship.\n\nIt will announce its education policies closer to voting day.\n\nGovernment services\n\nLabor\n\nLabor has not announced any election commitments specific to government services.\n\nCoalition\n\nThe Coalition says it will find areas of \"waste\" in the public service and cut those jobs to save taxpayer money. While the Coalition won't commit to a number of jobs or savings target before the election, Opposition Leader Peter Dutton has pointed to the 41,000 new jobs added since 2022, and has suggested cutting that number would save $24 billion over four years.\n\nGambling\n\nLabor\n\nLabor has not announced any election commitments specific to gambling.\n\nCoalition\n\nThe Coalition will ban gambling advertising one hour before, during and after live sports on television and streaming services.\n\nSupermarkets\n\nLabor\n\nLabor will develop a $3 million education program to help suppliers negotiate better deals with the supermarket giants as part of its initial response to findings that Australian supermarkets are among some of the most profitable in the world, with little incentive to compete because of the market domination by Coles and Woolworths.\n\nCoalition\n\nThe Coalition will legislate break up powers that could be used as a last resort tool to force Coles and Woolworths to sell off parts of their business, such as their alcohol arms, if they were found to be abusing their market power.\n\nThe Coalition has said it does not intend to use the powers, but they would act as a disincentive for the supermarket giants to engage in uncompetitive behaviour.\n\nDefence\n\nLabor\n\nLabor has not announced any election commitments specific to defence.\n\nCoalition\n\nThe Coalition has promised $3 billion to acquire extra joint strike fighter jets, after plans to buy an additional 28 fighter jets were scrapped last year in a re-prioritisation of defence spending. The Coalition will reverse that decision and lift Australia's F-35 fleet to 100.\n\nPeter Dutton has also signposted a \"significant funding commitment\" to be announced during the campaign.\n\nInternet\n\nLabor\n\nLabor would deliver a $3 billion equity injection into the NBN to deliver access to higher internet speeds for around 622,000 additional premises by the end of the decade. It would mean 94 per cent of homes would have access to speeds up to 1 Gbps.\n\nCoalition\n\nThe Coalition will match Labor's $3 billion commitment for faster broadband.\n\nSocial media\n\nLabor\n\nLabor would compel social media companies to strike commercial deals with news organisations to support journalism. A charge would be imposed on Facebook, Instagram, Google and TikTok which they would be able to entirely offset by renewing or entering into deals to pay Australian news organisations.\n\nCoalition\n\nThe Coalition would outlaw what it calls criminal \"posting and boasting\", making it an offence to post material that glamorises violence, drug and property crimes in order to increase a person's notoriety.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/north-queensland-cowboys-30th-season-starts-amid-flooding/104993050",
    "title": "Sodden Queenslanders want rain to stop and a Cowboys to win",
    "publish_date": "Fri, 28 Mar 2025 01:43:29 +0000",
    "category": "sports",
    "authors": [],
    "text": "In Cowboys country times are tough as flood-ravaged north Queenslanders can't catch a break — and neither can the region's NRL team.\n\n\"We haven't won this year. It's been a tough, tough start,\" admits North Queensland winger Murray Taulagi.\n\n\"We're just trying to be positive.\"\n\nMurray Taulagi scores a try during round three of the 2025 NRL season in Brisbane. (AAP: Scott Davis, NRL Photos)\n\nAs is the rest of the region.\n\nFlash flooding in Townsville last week followed widespread riverine flooding and property inundation in nearby Ingham last month.\n\nIn the sugar shire Laurie Spina, the Cowboys inaugural captain, lost massive amounts of cane when a wall of water hit his farm.\n\n\"Cane is affected the crop will be down that's for sure,\" he said.\n\n\" We're pretty tough. We'll have to build ourselves up, but we've been affected pretty badly. \"\n\nLaurie Spina, the inaugural Cowboys captain, is now an Ingham cane farmer recovering from the floods. (ABC News: Chloe Chomicki)\n\nA Cowboys win against the Raiders on Saturday would lift sodden spirits and the north Queensland team is acutely aware.\n\n\"Hopefully we can get the win and put a smile back on North Queenslanders faces again,\" Taulagi said.\n\n\"It's been a tough few months, I'm keen to get the job done.\"\n\nHomes, businesses, and farms were inundated by flood waters in Ingham in February. (ABC News: Sophie Johnson)\n\nWhen disaster strikes, the Cowboys can be a source of inspiration.\n\nJust ask premiership winning club legend Johnathan Thurston.\n\n\"It was never lost on me that you put in a good performance because whatever is going on in the lives of the people of north Queensland, that 80 minutes that the Cowboys are playing for — it's like an escape,\" he said.\n\n\"Whether it is floods, cyclones, or drought.\n\n\" It is like their worries go away because they are supporting you and they are focused on you. \"\n\nJohnathan Thurston pictured at his final match in Robina on September 1, 2018. (AAP: Dave Hunt)\n\nIn 2025 the North Queensland Cowboys are marking 30 years since they joined the league.\n\nThe milestone has CEO Jeff Reibel feeling nostalgic.\n\nSome of his fondest memories are of the tour of the club's maiden premiership trophy.\n\nCowboys CEO Jeff Reibel at the High-Performance Centre in Townsville. (ABC News: Lily Nothling)\n\nThe Cowboys brought fanfare to regional north Queensland towns where graziers were battling a year of drought.\n\n\"I remember we were out west and someone came and said 'that's the first time I've seen my dad smile in the last four or five years, so thank you',\" Mr Reibel said.\n\n\" I think that just shows what we mean to the community, but just as importantly what the community of north Queensland means to our club. \"\n\nThe Cowboys took the 2015 premiership trophy to Mackay (pictured), Cairns, Townsville, and beyond. (ABC Tropical North: Sophie Kesteven)\n\nA win against the Raiders in Townsville would no doubt lift spirits, but it would also take pressure off the Cowboys.\n\nOn several occasions in recent weeks head coach Todd Payten has acknowledged criticism of his winless team — even calling it \"justified\".\n\n\"We feel under pressure as a club,\" he told reporters post-match last week.\n\n\"It'll turn, we've just got to make it turn through hard work.\"\n\nWin, lose, or draw, the Cowboys will retain some of the league's most dedicated fans, earned over their 30 years representing the region.\n\nRonnie \"Crocky\" Murphy travels to almost every Cowboys home game from Mount Isa. (ABC News: Emily Dobson)\n\nRonnie \"Crocky\" Murphy has attended almost every home game since the new Townsville Stadium opened in 2020, despite living 900 kilometres away from it.\n\n\"It is a lot of money and a lot of time but they're worth it. I love my boys,\" the Mount Isa-based fan insists.\n\nThis year will be different for the new grandmother, but like many she'll watch from afar.\n\n\"I have to give some time to my family, but I'll definitely be going to a few games,\" she said.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/dua-lipa-law-suit-levitating-/105107390",
    "title": "Dua Lipa wins copyright case over song Levitating as judge dismisses lawsuit",
    "publish_date": "Fri, 28 Mar 2025 01:39:28 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "British pop singer Dua Lipa has won the dismissal of a lawsuit in New York accusing the British pop star of copying her 2021 megahit Levitating from a 1979 disco song.\n\nUS District Judge Katherine Polk Failla said L Russell Brown and Sandy Linzer failed to show \"substantial similarity\" between Levitating and their song Wiggle and Giggle All Night, though some listeners could hear similarities.\n\nThe plaintiffs alleged that Levitating copied its signature melody from Wiggle and Giggle All Night and another song, called Don Diablo, to which they held a copyright.\n\nBut the judge found that melody unprotectable in light of November's federal appeals court decision that Ed Sheeran's 2014 song Thinking Out Loud did not illegally copy Marvin Gaye's classic Let's Get It On.\n\nFailla also found several other alleged similarities between Levitating and Wiggle and Giggle all Night were commonplace, having appeared in Mozart and Rossini operas, Gilbert and Sullivan operettas, and Stayin' Alive by the Bee Gees.\n\n\"A musical style, defined by plaintiffs as 'pop with a disco feel,' and a musical function, defined by plaintiffs to include 'entertainment and dancing',\" cannot possibly be protectable,\" Failla wrote.\n\nTo hold otherwise, she said, would \"completely foreclose the further development of music in that genre or for that purpose.\"\n\nA lawyer for the plaintiffs, Jason Brown, said they plan to appeal.\n\n\"This case has always been about standing up for the enduring value of original songwriting,\" Brown, who is L. Russell Brown's nephew, said in an email.\n\nLawyers for Ms Lipa, her label Warner Records and other defendants did not immediately respond to requests for comment.\n\nThe singer is currently touring her album Radical Optimism in Australia.\n\nThey called it implausible to believe Lipa, 29, heard Wiggle and Giggle All Night before writing Levitating, and said the plaintiffs could not \"monopolise one of the most commonplace and rudimentary elements of music: the use of a minor scale\".\n\nBrown's other songs include Tony Orlando and Dawn's Tie a Yellow Ribbon Round the Ole Oak Tree and Knock Three Times, while Linzer's songs include the Four Seasons' Let's Hang On! and Working My Way Back To You.\n\nLevitating, from Ms Lipa's album Future Nostalgia, was the Nu,mber 1 song on Billboard's 2021 year-end chart.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/augusta-campaign-to-save-timber-jetty/105093214",
    "title": "Small town's touching battle to save a beloved timber jetty",
    "publish_date": "Fri, 28 Mar 2025 01:19:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "The sudden closure of a little jetty has sparked a furore in the South West WA town of Augusta as locals reflect on deep, meaningful memories made on its timber planks.\n\nThe Turner Street Jetty, 319km south of Perth, was recently deemed unsafe and closed indefinitely with little notice for locals.\n\nRegional WA has a long history of fervent protection of old timber jetties, reflecting a love affair between locals and their built environment.\n\nAugusta's beloved jetty is on the border of the Blackwood River and Flinders Bay, and for locals like Cindy Watterson it holds deep sentimental value.\n\n\"We've grown up eating fish and chips off that jetty and playing and swimming and tying our boats up for a very long time,\" she said.\n\n\" We love to play with nature and we love our kids being outdoors. \"\n\nKayaks lining the banks of Augusta's Hardy Inlet. (Supplied: Sheryl Lockett)\n\n100-strong 'save our jetty' protest\n\nThe Turner Street Jetty was suddenly closed last week by the Shire of Augusta and Margaret River for the \"foreseeable future\" and deemed \"beyond its useful life\".\n\nThe decision was met with a barrage of local criticism and questions.\n\n\"Where is the maintenance?\" Ms Watterson asked.\n\n\"Why has it deteriorated faster, why hasn't there been pre-maintenance?\"\n\nFour days after the announcement, more than 100 locals carrying \"save our jetty\" placards protested at the site,\n\nEmma Gillam was among them and helped put together a petition calling to save the jetty.\n\n\"It's been in the community for 100 years. We want it to be looked after, not demolished or redeveloped into something,\" Ms Gillam said.\n\n\"We want to know that the jetty is going to remain.\"\n\nAugusta-Margaret River Shire president Julia Meldrum. (Supplied: Augusta-Margaret River Shire)\n\nAugusta-Margaret River Shire president Julia Meldrum said the decision was about public safety.\n\n\"Deterioration has occurred faster than anticipated, which has led to this sudden closure,\" said Ms Meldrum.\n\nMs Meldrum rejected local accusations of neglect, pointing to annual maintenance from the shire and an independent engineering report released every two years.\n\nOn Thursday night, the shire voted to spend $100,000 to either replace or refurbish the jetty, though Ms Meldrum said the former would be an expensive proposition.\n\n\"I can't say what is going to happen, but we will look at all the options and we will find whatever the most suitable and practical solution is,\" Ms Meldrum said.\n\nMs Meldrum sympathised with the public's disappointment.\n\n\"I love our jetties,\" she said.\n\n\"They are a place where we connect, where we connect with nature.\n\n\"They're a really important part of the fabric of our communities throughout Western Australia.\"\n\nWA's love affair with old jetties\n\nThe Esperance Tanker Jetty opened in 1935. (Supplied: Esperance Museum )\n\nTurner Street Jetty echoes similar fights by coastal communities fighting to save jetties.\n\nIn south-coast town Esperance, locals waged a passionate and protracted fight to save an 85-year-old heritage-listed timber jetty before it was replaced in 2021.\n\nAfter a sustained \"Save the Jetty\" campaign, WA's then-heritage minister David Templeman stepped in, halting the demolition until plans for a replacement were finalised.\n\nIn the state's north, community sentiment ran high around the 135-year-old Carnarvon One Mile Jetty.\n\nThe heritage-listed jetty was closed in late 2017 due to significant safety issues and was irreparably damaged by Cyclone Seroja in in 2021.\n\nA couple on their wedding day. (Supplied: Sheryl Lockett)\n\nUWA Urban Design Research Centre Director Julian Bolleter likens waterfronts as \"masks\" worn to communicate a town's identity to the world.\n\n\"I think the jetties are particularly significant because they have a historical layering,\" he said.\n\n\"They also speak to a landscape system [and] has ecological significance, but I think too, it is also a place where people congregate and come together, where people meet.\n\n\"So you layer all of those things together and you'll find jetties are very potent and no wonder that communities take them very seriously.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/brisbane-2032-olympic-stadium-stacks-up-against-previous-venues/105099078",
    "title": "How Brisbane's planned stadiums stack up against previous Games",
    "publish_date": "Fri, 28 Mar 2025 01:18:17 +0000",
    "category": "sports",
    "authors": [],
    "text": "The showpiece attractions of any Olympic Games are the venues where feats of sporting brilliance take place.\n\nIt is these arenas that provide the stages, the names of which echo throughout history as readily as the athletes who graced them.\n\nOften, but not exclusively, the preserve of the Games' flagship athletics competition, the \"main\" stadium at a Games can be legacy-defining in terms of architecture as well as scope.\n\nThe Gabba will no longer join the exulted list of venues to have been considered an Olympic Games' main stadium.\n\nInstead, a brand new, 63,000-capacity venue will be built in Victoria Park — the first new-build main Olympic stadium since London 2012 (although that is slightly disingenuous as Tokyo's 2020 stadium involved the rebuild of the entire existing stadium).\n\nSo much about the new stadium remains unknown — including its cost (the 100-day review estimated $3.785 billion) and design.\n\nBut from what we do know, how will it stack up against some of its predecessors?\n\nThe bigger the better? Perhaps not\n\nThe Sydney Olympics featured the largest Olympic stadium ever. (Getty Images: Allsport/Adam Pretty)\n\nWith a proposed capacity of 63,000, the Victoria Park stadium would become the third-largest stadium in the country behind Australia's two existing Olympic stadiums, the MCG (100,024) and the Sydney Olympic stadium (82,000).\n\nDuring the 2000 Games, Sydney's Olympic stadium could contain 110,000 (although 114,714 watched the closing ceremony), making it the largest Olympic stadium ever.\n\nAt the opening ceremony, some 103,000 people packed the stands of the MCG. (Getty Images)\n\nThe capacity of the MCG during the 1956 Olympics was 103,000, making it the third-largest Olympic stadium ever behind Sydney and Berlin's magnificent neoclassical Olympiastadion (110,000).\n\nThe Berlin Olympiastadion is virtually unchanged from how it was in 1936, apart from the addition of a roof. (ABC Sport: Simon Smale)\n\nWhen compared just to those behemoths, the proposed Victoria Park stadium seems relatively small.\n\nAnd there is a case for that — its relatively modest size would make Victoria Park the smallest main stadium for an Olympic Games since Amsterdam's 1926 Olympisch Stadion, which held just 31,600.\n\nThe 1928 Amsterdam Olympics were played out in front of a realtively modest crowd. (Getty Images: ullstein bild)\n\nBut in actual fact, the capacity is actually in line with what a lot of Olympic stadiums tend to pitch themselves at.\n\nIndeed, Brisbane does not need a stadium any larger than this and to blow out the capacity would risk turning the arena into the palest of white elephants.\n\nBrisbane is, after all, the smallest city by population to host a Summer Olympic Games since Helsinki in 1952.\n\nThe proposed capacity of 63,000 was not a wild stab in the dark, either.\n\nThe 100-day report by the Games Independent Infrastructure and Coordination Authority (GIICA) noted that Queensland had the lowest provision of major sporting stadium seating capacity of the five most populous states compared to population, at 60 people per seat.\n\nMajor sporting stadium seat per person in Australia's five largest states. (Supplied: Brisbane 2032 Olympic and Paralympic Games Infrastructure Report)\n\nVictoria, New South Wales, South Australia and Western Australia have an average of 36 people per seat.\n\nBeing a bit smaller than the nations' other Olympic stadiums may make the Victoria Park stadium an anomaly domestically, but in fact it's very much in keeping with what we'd expect.\n\nWhat about the pool?\n\nThe new National Aquatic Centre in Brisbane will be a second showpiece stadium for the Games. (Supplied: Archipelago)\n\nThe proposed new Aquatic Centre at the site of the current Centenary Pool however, is going to be mighty big.\n\nWith a proposed Games capacity of 25,000 — which will be reduced to a permanent seated capacity of 8,800 — the venue would be the third-largest to ever host swimming at a Games.\n\nAnd that would be fitting, in a country where swimmers are lauded like no other, with the possible exception of the United States.\n\nThe Paris La Défense Arena created a phenomenal atmosphere. (Getty Images: Quinn Rooney)\n\nIn Paris, the pool was the second-largest venue by capacity with 15,220 seats which, in keeping with its commitment to reusing existing stadiums, were housed inside the refitted Paris La Défense Arena.\n\nAfter the Games it returned to its normal use as a home ground for Top 14 rugby union club, Racing 92.\n\nThe swimming in LA will be an astonishing spectacle. (Supplied: LA28)\n\nLos Angeles will also go big with its swimming venue, but with even greater scope, using SoFi Stadium — the home ground of LA's two NFL teams, the Chargers and the Rams — to create the largest swimming pool-only venue in Olympic history at 38,000.\n\nIncidentally, it's not the largest ever — the 100m long pool for the 1908 Games was situated in the infield of the 93,000-capacity White City Stadium in London.\n\nThe new National Aquatic Centre will be a statement venue for Australia's swimming future — Swimming Australia's chief executive Rob Woodhouse called it \"the most significant investment ever in aquatic sports in Australia\" that has the potential to set up the sport \"for ongoing success for the next 50 years\".\n\nBut the statement could also be in its design.\n\nThe Water Cube is one of the most distinctive venues in Olympic history. (Getty Images: Peter Bischoff)\n\nBeijing's Water Cube is one of the most staggering and distinctive pieces of sporting architecture in the world.\n\nLondon's Aquatic Centre and its undulating roof is the design vision of Zaha Hadid and remains a focal point for the whole Queen Elizabeth II Olympic Park.\n\nWhoever ends up designing the finished product, they have a huge task on their hands.\n\nA blank, golden canvas\n\nThe Beijing Olympic stadium was as distinctive as it was spectacular. (Getty Images: Clive Rose)\n\nYou might expect that Olympics tend to build brand new stadiums at huge expense as a par for the course, but the trend overall is to make use of existing venues.\n\nLast year's Games in Paris, for example, had as its feature arena a ground that's actually older than the redevelopment of Brisbane's Lang Park, the 1998-built Stade de France.\n\nThe otherworldly exterior of the Stade de France rises like a UFO among the low-rise buildings of Saint-Denis. (Getty Images: Corbis/Tim Clayton)\n\nThe 2021 Games took place in the same location as the 1964 Olympics — but the Japan National Stadium in Tokyo was completely rebuilt on the site of the old national stadium at a cost of 157 billion yen ($1.6 billion).\n\nThe Rio Games too made use of a redeveloped existing stadium, the historic Maracanã for its opening and closing ceremonies, while the athletics was held at the smaller Estádio Nilton Santos, which was also an existing stadium.\n\nThe LA Games will make history by using the same stadium, the Los Angeles Memorial Coliseum, for the third time. It was also the main stadium in both 1932 and 1984.\n\nThe LA Coliseum has been in use since 1923. (Getty Images: Corbis/Dick Whittington Studio)\n\nHowever, London (2012) and Beijing (2008) both built brand-new stadiums as their flagship feature pieces, as did Sydney (2000) and Atlanta (1996).\n\nOlympic stadium New/Existing Centennial Olympic Stadium, Atlanta New Stadium Australia, Sydney New Olympic Stadium, Athens Existing National Stadium, Beijing New Olympic Stadium, London New Estádio do Maracanã, Rio Existing Olympic Stadium, Tokyo Rebuilt Stade de France, Paris Existing Los Angeles Memorial Colosium, LA Existing Victoria Park, Brisbane New\n\nBefore that, 10 of the previous 12 Games, stretching from Barcelona 1992 to London 1948, all used pre-existing venues.\n\nThe only exceptions were the Games in Munich and Montreal in the 1970s — both of which were architectural marvels, albeit with contrasting legacies.\n\nThe Munich Olympiastadion had an innovative tent-like roof. (Getty Images)\n\nIt took Montreal 30 years to pay off its revolutionary stadium, earning it the nickname The Big Owe and cementing Montreal as the poster child for the excesses and frivolity of the Olympic movement — its total overrun was estimated at over 700 per cent of its budget.\n\nThe Montreal Olympic stadium is an enormously expensive architectural marvel. (Getty Images: Tom Szczerbowski)\n\nThose Games were fraught with issues for the organisers.\n\nMany African nations boycotted the Games after the IOC refused to ban New Zealand after that year's All Black tour of South Africa went ahead in defiance of the Apartheid ban, while Canada became the first and only nation in history not to win a single gold medal at their own Olympics, winning just 11 overall.\n\nGiven Australia's stunning record in the pool and elsewhere in Olympic Games, one thinks we'd be safe in assuming that a lack of gold medal success won't be an issue for Australia in Brisbane, certainly in the pool.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/franken-biting-villain-edit-mafs/105096902",
    "title": "Can reality TV shows fake people's words? We ask the experts",
    "publish_date": "Fri, 28 Mar 2025 00:57:09 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "On some level, most of us know that reality TV is pretty far from reality.\n\nBut can these shows really make contestants say something they never said?\n\nIt's a question that went viral on TikTok during the latest iteration of famously controversial reality show Married at First Sight, now in its 12th season.\n\nSeeking reassurance from her new husband Ryan, bride Jacqui asks: \"How hard is it to [say] … hey you're f***ing gorgeous?\"\n\nHe responds: \"That would be a lie.\"\n\nJacqui and Ryan have had a dramatic story arc in this season of MAFS, but just how much of it has been influenced by 'the edit'? (Supplied: Nine)\n\nIt was a spicy moment of TV, and it caught the attention of reality star and media personality Abbie Chatfield, who doubted the scene really played out that way.\n\nIn a video she made in response to this moment — and the furore it was causing among viewers — she unpacked a practice known as \"frankenbiting\", which she says makes it \"too easy\" to put words in someone's mouth.\n\n\"The first sign you should always watch out for is if it's a voiceover, not vision of them in the scene saying the words,\" she said.\n\nShe speculated that Ryan's hurtful response was said in a totally different context, then just played over the clip for dramatic effect.\n\nLoading TikTok content\n\n\"I could be wrong but I really don't think, with all the context clues, that he actually said that to her.\"\n\nWhat actually is frankenbiting?\n\nLike Frankenstein's monster, frankenbiting involves creating something new from lots of smaller parts.\n\nBut instead of creating a new man, the editing technique uses individual words or phrases from other sentences, and turns them into new, reconstructed ones.\n\nRebecca Trelease is a senior lecturer specialising in reality TV at the Auckland University of Technology, and a former contestant on The Bachelor New Zealand.\n\nShe says hearing her own franken-sentences was \"the weirdest experience\".\n\n\"We were miked up from first thing in the morning until finishing filming at the end of the evening, like 13- or 14-hour days,\" Trelease says.\n\n\"You only have to say a specific word once, and then they have it … Every night, it's ingested into the system and [they can] search out that word.\"\n\nWhile she says this can be used to condense a long spiel into a five-second clip, it's also possible to edit in this way for \"nefarious reasons\".\n\n\" You can have someone say [something in a] completely different context to what they had originally said. \"\n\nJohn, whose name has been changed for privacy, has been an editor for decades, including on Married at First Sight (MAFS).\n\nHe says the practice is better known as franken-grabbing in Australian TV, and while he understands it has \"the potential to be manipulative\", he says he's never seen a production team misrepresent someone's intent.\n\n\"It might be where you want to show contestants have bad feelings about each other, and they haven't said that exactly, but [from all the different information you have], you know they have bad feelings.\"\n\nHe says in these cases, when an \"emotion might not be as well expressed in the way they [originally] said it\", franken-grabbing helps portray that storyline more clearly.\n\nHow reality shows create plot and story\n\nThe thing about reality dating shows like MAFS, says Trelease, is that if a couple is working well together, they won't get as much screen time.\n\n\"We're not watching it for love. We're watching it for disagreements and tantrums and fighting.\"\n\nCouple-based reality programs like The Ultimatum: Queer Love are all about conflict. (Netflix)\n\nBut she says even producers can't foresee a sudden fight, and this unpredictability means they sometimes have to work backwards to make that new plot line add up.\n\nIn producer interviews on The Bachelor, she remembers being asked to react to things that happened days earlier.\n\nChit Chat: Abbie Chatfield Photo shows Abbie Chatfield stands in front of a tropical villa locale, similing in a dress with swirling bright colours. As host of Australia's silliest dating show, Abbie Chatfield spends her days poking fun at soft boys. But the show is inspiring real conversations.\n\n\"Content in the story is being created on the fly all the time, it's very skilful.\n\n\"Creating a sentence [with frankenbiting] is so that it can either justify the narrative or scene that is happening\" in any particular episode.\n\nJohn says programs are shot with 6 or even 12 cameras, with every participant wearing a mic, creating \"miles\" of footage that no-one will ever see.\n\n\"People think you have 60 minutes and you cut it down to 10, and that's what editing is. But I don't think of it like that at all.\n\n\"You have hours and hours of footage, and you pull bits out, and you construct something with it … you show the highlights, you show the interesting bits.\"\n\nIs the 'villain edit' a real thing?\n\nAs Trelease explains, a program like The Bachelor focuses on multiple women vying for one man's love, each fitting their own stereotype and character, while couple shows like MAFS rely on the push and pull between two people.\n\nThis means one tends to be presented as the good guy, and the other as the bad guy.\n\nWhen watching shows like Love Is Blind, we tend to take sides as an audience. (Supplied: Netflix)\n\n\"Even if [there's] not necessarily a villain edit, it's the sense of, 'We're not meant to be siding with you,'\" she says.\n\n\" Quite often, their arguments aren't being presented equally … we're being guided towards liking one person in this relationship over the other. \"\n\nIn her TikTok, Abbie Chatfield points to the way music is used to make the audience feel a certain way about a character or scene; silly, moody or tense backing tracks all play into our emotions.\n\nLife as MAFS' 'most hated' villain Photo shows Online trolls told Olivia Frazer she was 'the most hated person in Australia' How far do reality programs go to create \"villains\" and \"psychos\"?\n\nJohn says while contestants complain about being misrepresented by the show or the editing process, he has his doubts.\n\n\"I think contestants use the understanding that people think [these shows are] artificial and constructed for their own benefit.\"\n\nTrelease says, given the editing involved in any reality show, it's impossible to definitively say if someone really is being misrepresented.\n\n\"I find it really interesting, where that line would be: how much of it is actually the participant, versus how much of the 'villain' comes from the edit?\"\n\nHow to spot frankenbiting for yourself\n\nIf you're keen to try to pick up on frankenbiting at home, John says to keep an ear out for tone changes.\n\n\" People are in different rooms when they're interviewed … they're different distances from the microphone, so the tone of the voice changes from word to word. \"\n\nTrelease finds it easier to tell when she's half-watching a show with headphones on while cooking dinner.\n\n\"Sometimes, the visuals are used to confuse you [so] you won't pick up the audio changes,\" she explains.\n\n\"But if you listen to it independently, you can actually hear it's different audio because it's from a different sentence, not a different angle.\"\n\nSeeing a full sentence come out of someone's mouth, on camera, is sometimes the only sure way to know it's unedited. (Supplied: Nine)\n\nJohn says in his early days of franken-grabbing, \"a lot of effort\" was made to make audio sound \"seamless and believable\".\n\n\"I think the expectation from the audience has changed now.\n\n\"The audience knows it happens and, for that reason, I don't think people camouflage it very well.\"\n\nAs someone who's spent decades editing on a variety of television formats, John admits he's \"not a big fan\" of the practice.\n\n\"It really annoys me that producers expect me to put together these words that don't sound right together, and that everyone will tell is fake. That frustrates me.\n\n\"I think that what people say is what they should be saying.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/manchester-city-knocked-out-women-s-champions-league-chelsea/105106808",
    "title": "Fowler, Man City, knocked out of Women's Champions League by Chelsea",
    "publish_date": "Fri, 28 Mar 2025 00:55:22 +0000",
    "category": "sports",
    "authors": [],
    "text": "Chelsea has pulled off a stunning comeback to beat Manchester City 3-0 in the women's Champions League quarterfinals, overturning a two-goal first-leg deficit to secure a place in the last four with a 3-2 aggregate victory.\n\nChelsea, who have played City four times this month, beating them in the League Cup final and 2-1 in the Women's Super League, set up a repeat of last year's semifinal against holders Barcelona, who thrashed VfL Wolfsburg 6-1 on Thursday to complete a 10-2 aggregate win.\n\nLed from the front by Matildas star Mary Fowler, City were unable to overcome a first half blitz from Chelsea, but they had chances.\n\nChelsea took the lead in the 14th minute when Lucy Bronze's shot hit the post before Sandy Baltimore pounced on the rebound to beat City goalkeeper Khiara Keating.\n\nSonia Bompastor's side doubled their lead in the 38th minute when Nathalie Bjorn headed home from Baltimore's corner and Mayra Ramirez added a third five minutes later, finishing off Lauren James's cross.\n\nCity refused to give up after the break and looked to capitalise on Chelsea's mistakes, with Vivianne Miedema, Mary Fowler and Kerolin all missing clear-cut chances.\n\nIt was keeper Keating, however, who denied Chelsea a fourth at Stamford Bridge, with substitute Aggie Beever-Jones' left-foot shot saved and Johanna Rytting Kaneryd's late effort blocked.\n\n\"We were never in doubt. We had full confidence in ourselves. We could have had way more than three goals,\" Chelsea captain Millie Bright said.\n\n\"We are a new team, we are on a new journey, we are in a new era. Bring it on.\"\n\nEight-time winners Olympique Lyonnais face Arsenal in the other semifinal, with the final on May 24 in Lisbon.\n\nReuters\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/red-bull-suffering-greater-issues-than-liam-lawson-poor-results/105107404",
    "title": "Lawson's F1 axing makes him a scapegoat for wider problems at Red Bull",
    "publish_date": "Fri, 28 Mar 2025 00:46:30 +0000",
    "category": "sports",
    "authors": [],
    "text": "Liam Lawson has suffered one of the more ruthless axings in Formula 1, and his replacement will need to overcome a temperamental car and a dysfunctional team or be at risk of a similar fate.\n\nRed Bull officially announced on Thursday that Kiwi Lawson, a young driver of just 11 grands prix and promoted to the team in the off-season, is being replaced after just two rounds.\n\nThe dream job of driving for a team who wants to contend for world titles was an unmitigated nightmare for Lawson, who did not score points in either grand prix, or the sprint race in China.\n\nIn justifying axing Lawson for Japanese driver Yuki Tsunoda, Red Bull boss Christian Horner said:\n\n\" We have a duty of care to protect and develop Liam and together, we see that after such a difficult start, it makes sense to act quickly so Liam can gain experience, as he continues his F1 career with … Racing Bulls, an environment and a team he knows very well. \"\n\nHorner can call the switch a \"duty of care\", but this Red Bull sacking is not an indictment of Lawson, but a glaring failure of the team.\n\nIt is this failure that Tsunoda is stepping into and must overcome to survive the curse of being Max Verstappen's teammate.\n\nWhen Tsunoda takes to the grid next week in front of his home fans in Suzuka, he will be Verstappen's fifth different teammate since 2019.\n\nKiwi racer axed by Red Bull after two F1 races Photo shows Liam Lawson of New Zealand and Red Bull looking down, running hand through his hair Kiwi Formula 1 racer Liam Lawson's stint as a Red Bull driver has come to a screeching halt, axed from the team after just two grands prix.\n\nMore alarmingly, he will be the fourth to come from Red Bull's junior team.\n\nRed Bull is unique in the world of F1 — it controls two teams.\n\nIn theory, Racing Bulls (formerly known as RB, AlphaTauri and Torro Rosso) should serve as a stepping stone for drivers in the Red Bull program to enter F1, and work their way to the main Red Bull Racing team.\n\nIt is an advantage that no other F1 team has, yet it seems to fail time and time again.\n\nAt least that is the plan.\n\nWhile Verstappen, Sebastian Vettel and Daniel Ricciardo all had success going from the junior team to the big boys, for most, it has been their downfall.\n\nJapanese driver Yuki Tsunoda will debut for Red Bull at his home Formula 1 grand prix. (Getty Images: Rudy Carezzevoli)\n\nPierre Gasly was dumped after just 12 races in 2019, after making the step up from the junior team. The Frenchman was replaced by Alex Albon, who lasted 26 races before Red Bull cut him loose.\n\nAnd the problems date back further, with Daniil Kvyat being dumped early in his second season, replaced by Verstappen, who rubbed salt into the wounds by winning his debut race for the top team.\n\nLawson is just the latest driver to be chewed up and spat out, and evidence would suggest Tsunoda could be in for a similar world of hurt.\n\nIt is a sign that something is not working at Red Bull, a surprising thought considering Verstappen has won the previous four drivers' championships.\n\nBut with a rotating cast of teammates who are being well beaten by the Dutch ace, it begins to feel as if Verstappen's legendary brilliance has been masking fundamental flaws in the team.\n\nPiastri wins Chinese grand prix Photo shows F1 driver Oscar Piastri smiles as he hugs McLaren boss Zak Brown on the track at the Chinese Grand Prix. Australian Formula 1 driver Oscar Piastri has won the Chinese Grand Prix in Shanghai after starting on pole for the first time.\n\nIt was only two years ago to the day when the F1 world descended on Melbourne for the 2023 Australian Grand Prix.\n\nRed Bull had a history-making season in 2022, and their drivers, Verstappen and Perez had each won in the opening two rounds.\n\nThe rest of the field was not within coo-ee of Red Bull.\n\nIn that 2023 season, people did not tune into F1 to see who was going to win. They wanted to see by how much Red Bull, mainly Verstappen, would win.\n\nThe Red Bull of 2023 was so much better than the rest of the F1 field it was almost laughable. The nine other teams were competing in a different category to the world champions.\n\nSince then, Red Bull's car has acted like it has a mind of its own.\n\nRed Bull suffered a spectacular fall in 2024. After appearing to be cruising to another constructors' championship after 10 rounds, the wheels seemed to fall off and the team placed third, behind McLaren and Ferrari.\n\nRed Bull driver Max Verstappen has won the previous four F1 drivers' championships. (AP: Andre Penner)\n\nAt one point it looked as if Verstappen's drivers' championship was under threat, despite winning seven of the first 10 grands prix — two sensational drives in Brazil and Qatar ensured at least the drivers' championship would stay with Red Bull.\n\nBehind the scenes Red Bull has gone through backroom turmoil in the past 18 months, with a texting scandal, rumours of a power struggle, and the departure of F1 car design maestro Adrian Newey.\n\nThis year's Red Bull car, the RB21, has difficulties that need addressing.\n\nThe chaotic nature of the Red Bull car was abundantly clear in last weekend's Chinese Grand Prix when Verstappen was well off the pace to start the race, then his car came to life and he was, at times, the quickest on track.\n\nBut with a regulation overhaul next season, the team will increasingly prioritise the 2026 challenger as this year goes on.\n\nThe car's inconsistency will be a hurdle for Verstappen to overcome in his bid to win races but for Tsunoda, like Lawson, it could be a hurdle for him even staying with the team.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nTsundoa is clearly Red Bull's second choice, after the team paid Mexican Sergio Perez a heap of money to break his contract at the end of 2024.\n\nThe Japanese driver had four years' experience with the junior team, but Red Bull chose the Kiwi with just 11 races over two seasons.\n\nDespite Tsunoda driving brilliantly to start this season — cruelled in both grands prix by bad strategy calls from his team — the step up to the main Red Bull team must feel like trying to summit Everest without food or water.\n\nUnlike Lawson, again the driver Red Bull chose first, Tsundoa doesn't have the benefit of a full pre-season with the team. He has been preparing to drive the secondary car, which, despite being slower, looks much easier to drive.\n\nThe RB21 has the raw performance to contend for titles, but it is not smooth to drive. It may be that Verstappen is the only driver on the grid who could succeed in the monster that is the RB21.\n\nBut what happens if Tsunoda doesn't hit the ground running?\n\nIt is a scenario Red Bull will need to think about because history suggests it is a real possibility.\n\nOther teams at the top of the sport have allowed young drivers to thrive.\n\nMcLaren has both Oscar Piastri and Lando Norris firing on all cylinders, while teenager Andrea Kimi Antonelli has shone in his first two races with Mercedes.\n\nOliver Bearman, now with Haas, scored points in his debut last season when he filled in for Ferrari on short notice, and Alpine reserve driver Franco Colapinto achieved two top-10 finishes when he was plucked from F2 into the Williams team in mid-2024.\n\nBut Red Bull has not been a happy hunting ground for most young drivers, and this is an issue Red Bull needs to address desperately, or risk falling behind its rivals as they enter a new regulation era in F1.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/native-title-holders-win-right-to-access-mining-royalty-records/105107188",
    "title": "Native title holders win right to see records of mining millions",
    "publish_date": "Fri, 28 Mar 2025 00:21:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Native title holders in South Australia's Flinders Ranges have been allowed access to financial records showing how tens of millions of dollars in mining royalties have been spent, after the state's Supreme Court upheld an earlier ruling.\n\nMembers of the Adnyamathanha Traditional Lands Association (ATLA) have been locked in a years-long legal battle for access to the books of a \"master trust\" that had been used to distribute uranium mining royalties.\n\nThe master trust had been controlled by a company called Rangelea Holdings, which is run by former ATLA chief executive Vince Coulthard.\n\nThe Supreme Court ruled in 2023 that three members of ATLA should be allowed access to financial documents of the master trust, and that an inspector should be appointed to report on the activities of Rangelea.\n\nRangelea did not allow access and instead lodged an appeal with the Full Court of the Supreme Court.\n\nBut the appeal was on Friday dismissed after the court found the native title holders were beneficiaries of the trust and had statutory rights to access documents and records.\n\nIt also found there was proper basis for the appointment of an inspector.\n\nMining royalties worth hundreds of thousands per month were suspended in 2021 amid concerns around financial governance, and about $20 million is now being held in a court-controlled account.\n\nRangelea could still appeal this latest decision in the High Court.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/cricket-south-australia-queensland-sheffield-shield-live-updates/105087912",
    "title": "Sheffield Shield final live: All eyes on Queensland batters on pivotal third day",
    "publish_date": "Thu, 27 Mar 2025 23:40:32 +0000",
    "category": "sports",
    "authors": [],
    "text": "Queensland will need a big day three with the bat as it looks to set up a chance of winning a dramatic Sheffield Shield final against South Australia.\n\nCheck out the live scores and stats in our ScoreCentre.\n\nScorecard\n\nManhattan\n\nBall-by-ball\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/record-outback-flood-western-queensland-evacuate-residents/105102092",
    "title": "Outback flood tops 1974 levels, towns evacuate amid major stock loss fears",
    "publish_date": "Thu, 27 Mar 2025 22:27:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "The biggest flood in living memory for many people across outback Queensland continues to unfold.\n\nIt is record-breaking flooding that has inundated vast areas of land, homes and stations.\n\nRainfall of up to 600 millimetres, nearly double the yearly average annual rainfall has caused flooding never experienced before.\n\nMajor flooding, higher than the 1974 flood, is occurring at Stonehenge, Jundah and Windorah.\n\nThe township of Jundah in western Queensland. (Supplied: Charmaine Batt)\n\nThe power has been switched off in Jundah and Stonehenge.\n\nAn entire township and properties scattered across outback Queensland have been deserted as residents evacuate amid the destructive flooding.\n\nThe rodeo grounds at Stonehenge, 155km from Longreach. (Supplied: Ray Steedman)\n\nFloodwaters inundated Adavale as helicopters relocated the population of 27 to a town 100 kilometres away.\n\nResidents have been taken to Quilpie, a community also cut off by road and experiencing power outages and connectivity issues.\n\nHeidi Cowley and her family left everything behind.\n\n\"I had to make a choice between the cat and the girls' bag of clothes,\" she said.\n\nThe Cowley girls and their cat, Tiggy, safe in Quilpie. (Supplied: Heidi Cowley)\n\n\"The chopper landed on the roof of our house to airlift the three girls out first … I'm going, my babies, you just have to do this, please.\"\n\nHer kids lost their other pets.\n\nFloodwaters are flowing through Adavale in south-west Queensland. (Supplied: Heidi Cowley)\n\nPeople in Quilpie have provided clothes, colouring in books and a doll house for Ms Cowley's children.\n\nSupplies needed\n\nQuilpie shire Deputy Mayor Roger Volz said the township would be cut off by road for at least a week.\n\n\"We'll be isolated for some while and that'll be the next thing is supplying our township residents with the food and medical supplies … things which normally come via road,\" he said.\n\nRoads in and out of Quilpie will be closed for at least a week, council estimates. (Supplied: Roger Volz)\n\nQuilpie and its adjoining town Eromanga have missed their last two food trucks supplies.\n\nCr Volz said the water was currently 1.85 metres above the road bridge and expected to rise further.\n\nHe said council was working with the state government and local businesses to arrange for aerial drops.\n\n\"To make sure the people on properties who are going to be isolated for a long time [get] the stuff they need,\" Cr Volz said.\n\nProperties evacuated\n\nPeople on properties from an area spanning hundreds of kilometres have left their homes.\n\nThis is what the Lloyd's property looked like on Wednesday. (Supplied: Ann-Maree Lloyd )\n\nAnn-Maree Lloyd and her husband Jeff live in a property south west of Yaraka, and made the call to leave home yesterday as water entered their home.\n\n\"It hit us pretty hard … it's just unprecedented,\" she said.\n\n\"We flew over a lot of water. We were just amazed how much water is around our place where we have never seen water before.\n\n\"We saw quite a few sheep alive, which really astounded us.\"\n\nStations upstream from Retreat have received 24 inches of rain in five days. (Supplied: Bob Speed)\n\nRetreat Station between Jundah and Windorah is seeing flooding at higher levels than 1990 after 342mm of rain over the week.\n\n\"We haven't even started to receive the water from upstream … there's still so much coming,\" property owner Andrea Speed said.\n\nThe Speed family evacuated their eight staff on Thursday, but the family remained at the house overnight to monitor the situation as water continued to rise.\n\nWith the Barcoo River a few kilometres from the house at Retreat and a lagoon close to the house, Ms Speed said both bodies of water had broken their banks and merged, surrounding their home.\n\nEvacuations from Thylungra, near Eromanga due to the flood. (Supplied: Matthew Kaarsberg)\n\nPremier landed\n\nPresident of AgForce's Sheep, Wool and Goat board Boyd Webb said it would be a while before the graziers had a full understanding of their livestock losses.\n\n\"Just from the sheer volume of water that's running around out there now, you'd have to say that there's been significant losses,\" Mr Webb said.\n\n\"That high spot that you thought was pretty right might not have been high enough.\n\n\"I think there is going to be a fairly significant amount of stock lost, if not from the initial flood, just from bogging and from being in water for days.\"\n\nFloodwaters at Winton. (Supplied: Lydia Evert)\n\nQueensland's Premier David Crisafulli is in the western Queensland town of Winton.\n\n\"This isn't going to ease quickly and the problems won't just disappear, you're dealing with a large part of the state and agriculture underpins it and so do the people that live in these communities,\" Mr Crisafulli said.\n\n\" We will be there to respond in whatever way, shape or form that takes. \"\n\nThe Albanese and Crisafulli governments are activating disaster assistance to seven western Queensland councils.\n\nCouncils have reported significant damage to road networks that will require urgent repairs to keep communities connected.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/abc-weekly-news-quiz-friday-march-28/105103542",
    "title": "Weekly news quiz: A group chat, a Senate prop and Jacob Elordi plays a heart-throb",
    "publish_date": "Thu, 27 Mar 2025 22:19:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Photo shows Trump and Musk look out the open driver's side door of a red Tesla",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/nt-parliament-march-sitting-fortnight-territory-coordinator-dv/105103008",
    "title": "Five bills passed NT parliament in six days. Here's what you need to know",
    "publish_date": "Thu, 27 Mar 2025 21:47:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "The past fortnight has been a busy time for the 25 elected members of the Northern Territory parliament.\n\nOver six sitting days, six pieces of legislation have been introduced and five bills passed through the NT's only parliamentary chamber.\n\nOn one extremely long day during the two-week sitting, MLAs remained in the chamber until 1:30am to pass a particularly controversial bill.\n\nHere's what happened.\n\nTerritory Coordinator Bill passes\n\nThe Territory Coordinator Bill has been described by the Country Liberal Party (CLP) government as the \"most important economic reform\" in a decade.\n\nIt faced strong opposition from groups including environmental organisations and land councils.\n\nIn passing the bill in the early hours of Wednesday morning, the government created the role of the territory coordinator — a statutory officer with a broad range of powers to \"consolidate regulatory processes\" for projects of \"economic significance\".\n\nThe new laws also allow the territory coordinator minister, who is Chief Minister Lia Finocchiaro, to modify or exclude other NT laws applicable to the same projects.\n\nLia Finocchiaro is the chief minister and territory coordinator minister. (ABC News: Pete Garnish)\n\nThere are 32 acts of parliament that the territory coordinator and minister can now override to \"achieve efficient and effective regulation\", including the building, water, environment protection and radiation protection acts.\n\nThe bill passed after the government accepted eight of 25 recommendations from a parliamentary scrutiny committee controlled by the CLP. Two were accepted in part.\n\nChansey Paech, Labor's representative on the scrutiny committee, said the CLP had ignored its own backbench by rejecting the other 15 recommendations.\n\nChansey Paech represents Labor on the scrutiny committee. (ABC News: Pete Garnish )\n\nIn the second sitting week, the government also passed legislation to repeal third-party merits reviews from the NT's petroleum, planning and water acts.\n\nThe change removes the right of third parties like environmental organisations to review the merits of government decisions at the NT's Civil and Adminstrative Tribunal (NTCAT).\n\nIt hinders future NTCAT challenges against developments including Beetaloo Basin fracking projects, which have faced criticism over fluid spills and water contamination risks.\n\nRobyn Lambley is the independent speaker of the NT parliament. (ABC News: Pete Garnish)\n\nWhat other legislation passed?\n\nThe government's Education Legislation Amendment Bill passed last Thursday, enshrining the role of school truancy officers into law.\n\nThe truancy officers have been on the beat for months already, handing parents $370 fines and compliance notices if they fail to send their children to school.\n\nThe NT's $15 billion debt ceiling was also officially scrapped, while police were given \"express powers\" to enter private property and search for parole or domestic violence offenders.\n\nThe government has scrapped the NT's $15 billion debt ceiling. (ABC News: Randi Dahnial)\n\nWhat bills were introduced?\n\nThe government this week proposed laws to reinstate mandatory sentences for repeat breaches of domestic violence orders.\n\nThe former seven-day minimum mandatory sentence had been scrapped by the former Labor government in 2022, following a recommendation from the NT Law Reform Committee.\n\nA group of three NT women's legal services released a joint statement saying they hadn't been consulted on its reintroduction and the policy was not evidence-based.\n\nThe parliamentary sitting went over six days. (ABC News: Pete Garnish )\n\nThe Aboriginal Sacred Sites Legislation Amendment Bill was also introduced by the government.\n\nOne of the bill's proposed changes would allow authority certificates from the NT's sacred sites regulator to be transferred to new owners, rather than requiring them to apply for a new certificate.\n\nIt would also allow additional people to be added to a certificate, which permits work to be undertaken in or near a sacred site.\n\nBoth bills were referred to the scrutiny committee.\n\nOther government bills introduced include proposed reforms to:\n\nIncrease access to Aboriginal water reserves — portions of water set aside from larger pools for Indigenous people to use or trade.\n\n— portions of water set aside from larger pools for Indigenous people to use or trade. Remove portable long service leave for community service workers.\n\nAlter various pieces of legislation within the attorney-general's portfolio, including tightening restrictions on drugs such as fentanyl.\n\nChange the Local Government Act to \"modernise and amend terminology\".\n\nLabor's Chansey Paech (left) and Selena Uibo (right) were heavily involved in debate during the sitting fortnight. (ABC News: Pete Garnish )\n\nWhat else happened?\n\nThe government scrapped the NT's renewable energy target of 50 per cent by 2030, saying gas will instead supply the territory with most of its future energy needs.\n\nJo Hersey, the education minister, suggested remote students could access the government's free school swimming lesson policy by learning in \"massive big blow-up pools from Clark Rubber\".\n\nHousing Minister Steve Edgington also announced a plan to recoup $39 million in rent arrears from public housing tenants.\n\nA motion by independent MLA Justine Davis to establish a parliamentary inquiry on the defrauding of an Indigenous employment scheme was not debated, and will instead be voted on when parliament next sits in May.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/fatherhood-is-changing-peter-bol-perspective-on-life-athletics/105104522",
    "title": "How fatherhood is changing Peter Bol's perspective on life and athletics",
    "publish_date": "Thu, 27 Mar 2025 21:42:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "Life is all about small steps for Nagmeldin Peter Bol.\n\nSix months ago, the Australian middle-distance running great and his partner Mahtut Yaynu welcomed their daughter, Reyna, into the world.\n\nFor Bol — a three-time Olympian — it's given him a perspective on life he couldn't have anticipated.\n\n\"It's been really special … it's been so beautiful in a way that you're just so focused and so structured, you also lose so much sleep at the same time, but you're able to perform so much better,\" Bol said.\n\nLoading Instagram content\n\n\"I thought I was (already) pretty focused, but there's always a little bit more that you can be focused on. Recovery is a little bit better right now, even though you sleep less.\n\n\"But the most precious thing is getting back home to your baby girl and to your family.\n\n\"So I'm spending a lot of time at home, and I'm refreshed and [have a] new perspective of life and everything. So, it's been great.\"\n\nPeter's pursuit of happiness\n\nLess than four years ago, Bol was on the tip of every tongue in Australian households, glued to their screens while watching the Tokyo Olympics.\n\nNow the 800m specialist says he's in the best space mentally to prepare for this season's goals, including a podium placing at the World Athletics Championships in Japan.\n\nBut the first step Bol sets his focus on is to maintain his wellbeing off the track.\n\nAfter a tough two years plagued by injuries and being exonerated from a case submitted by the World Anti-Doping Agency, he explained his mindset heading into the 2025 season.\n\nAfter a silver medal at the 2022 Commonwealth Games, Bol is aiming for a podium finish at this year's World Athletics Championships at Tokyo in September. (AP: Manish Swarup)\n\n\"I'm blessed to be in the state that I am now and quite happy mentally … I'm proud to say that I'm doing pretty well at the moment,\" Bol said.\n\n\"I believe a happy athlete is a performing athlete, and if I'm away from my family, I'm not happy.\n\n\"Family has always been one of my biggest values and now I've added my own family, so that's pretty powerful.\"\n\nBol is learning lessons as a young father have come quickly.\n\nExtending a branch on the family tree is a completely different experience and something he has been able to relate to his upbringing as his parents made many sacrifices on their move between continents.\n\n\"Your gratitude for your partner is off the roof. You realise what they go through and how much they mean to you,\" Bol said.\n\n\"And to also your parents. You're like, 'Wow, like they've done this for so many years and then they've done it moving places to places'.\n\n\"It's been a really positive experience, and I wish I had it earlier.\"\n\nWhile the life of an athlete can be uniquely demanding with international travel and living away from home, Bol plans to return to Australia between events, rather than base himself overseas for months on end.\n\n\"If I'm not performing, there's no point. So, it's just (about) being at home and finding my place,\" he said.\n\n\"She (Reyna) gets to watch some of my races. My partner sends me videos of her watching and she's kind of recognising you in that. So, it's really cool.\n\n\"And then it's also scary, right? Because at the Olympic Games, I was pretty calm and I could sense my parents were so stressed and nervous.\n\n\"And I think as she grows older, she's going to start feeling that and as she starts competing and doing different sports I'm going to start feeling that.\"\n\nBeyond Bol pays it forward\n\nBol's well-earned reputation as someone passionate about helping others in the athletics community has allowed him to recently set up the Beyond Bol Foundation.\n\nThe organisation aims to give the next generation of young Africans and under-represented communities an opportunity in Australian athletics.\n\nLoading...\n\n\"It's quite beautiful, it's quite emotional,\" he said.\n\n\" Twenty-one years ago I wasn't an Australian citizen … 14 years ago I was given this great opportunity by a high school teacher to do athletics. \"\n\nHe hopes to inspire the next generation of talent from the grassroots level, to a pathway at the top of the sport.\n\nAge may be a factor for the 31-year-old by the time a home Olympics in Brisbane comes around in 2032, but it's something he's eyeing as a mentor to younger athletes.\n\n\"So for me, it's beyond myself, it's beyond the sport. It's the reasons we've travelled so far and moved to be here.\n\n\"To be able to put on that green and gold and represent your country and your culture, so many people, it's quite beautiful.\"\n\nPeter Bol has had a hot start to the season, winning the Men's 800m final at the 2025 Sydney Track Classic in March. (Getty Images: Jason McCawley)\n\nPeak performance one race at a time\n\nAfter a difficult campaign at the Paris Olympics last year, finishing seventh in his 800m heat, Bol's long-term ambition is to join a rare club of quadruple Olympians at the LA Games in 2028.\n\n\"Paris was quite disappointing. I had to come home and reflect on that and then re-evaluate and move on to this year,\" he said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I just ran my fastest time I've ever ran in around March, which is pretty cool.\n\n\"My goal is to be a fourth-time Olympian and to win a global medal.\"\n\nWith one eye on the present and another on the future, a slate of meets across the country includes next month's national championships in Perth.\n\nThe next small step for Bol is taking on the track this weekend at the Maurie Plant Meet in Melbourne.\n\n\"I always said you need to be the best in your country before trying to tackle the world and I'm looking forward to doing that,\" the former national record holder and national champion said.\n\nA key part of his preparation for the event is about \"staying in the moment\", with the experienced runner taking on a high-class field of athletes at this year's stacked John Landy 1500m.\n\n\"Australian athletics is in such a special place in so many different ways,\" he said.\n\n\"As long as I've been competing, it's probably the best I've seen it.\"\n\nPerhaps the stars are finally aligning this year for Bol, much like the meaning of his first name Nagmeldin in the Arabic language.",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/south-australia-enter-day-three-of-sheffield-shield-final-on-top/105106636",
    "title": "Lehmann happy to acknowledge SA's strong position in Shield final",
    "publish_date": "Thu, 27 Mar 2025 21:18:40 +0000",
    "category": "sports",
    "authors": [],
    "text": "South Australian centurion Jake Lehmann says it is futile to ignore or dwell on his side being in a position of dominance in the Sheffield Shield final.\n\nAttempting to end a 29-year title drought, South Australia will arrive on Friday at Karen Rolton Oval in control of the final, but not in a winning position yet.\n\nQueensland resumes at 3-177 in its second innings, only one run ahead of SA.\n\nSouth Australia vs Queensland Sheffield Shield final Photo shows A South Australian bowler pumps his fist in celebration as a Queensland batsman looks on in the background. Queensland holds a lead of just one run, on 3-177 in the Bulls' second innings, after the home side dismisses key batsman Marnus Labuschagne late on day two of the Sheffield Shield final.\n\nQueensland was bowled out for 95 in its first dig before Lehmann's stellar 102 steered SA to 271 all out in reply.\n\n\"To rock up and perform in a final when there was a little bit of pressure on … it's just awesome,\" Lehmann said after his third Shield ton in as many games.\n\nLehmann's father, SA legend Darren Lehmann, featured in the state's last Shield victory in 1995/96.\n\nLehmann said there was no harm in recognising SA's strong position, but knows there is still work to be done to achieve the state's much-desired victory.\n\n\"The one thing we have done is acknowledge the position we have been in and the ability to win games,\" he said.\n\n\"You know, acknowledging we're in a good position is OK — and then just focusing on each and every ball after that.\n\n\"So we haven't not talked about the prize at the end of the game … we also have, from then, acknowledged that and moved on and focused on each and every delivery.\"\n\nLehmann forecast the second new ball, due about 10 overs into Friday's play, could prove decisive.\n\n\"On day one there was probably a little bit more moisture through the middle of the wicket … it was quite hard to find rhythm [as a batsman],\" he said.\n\n\"And then obviously it slightly flattened down, the ball is probably more consistently coming through.\n\n\"So it will be … find a way with the new ball tomorrow to hopefully get a couple of more wickets and then go from there.\"\n\nAAP\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 22
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-28/king-charles-admitted-to-hospital-during-cancer-treatment/105106678",
    "title": "Palace says king was hospitalised with cancer treatment side-effects",
    "publish_date": "Thu, 27 Mar 2025 21:15:35 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles has been forced to cancel public engagements after being taken to hospital due to side effects from his ongoing cancer treatment, Buckingham Palace says.\n\nA statement from Buckingham Palace said the 76-year-old \"required a short period of observation in hospital\" on Thursday morning UK time.\n\nThe palace said the king returned to Clarence House, but plans for him to travel to Birmingham for a series of public appearances on Friday had been scrapped.\n\nCharles had been expected to visit the city's Royal Ballet, open a new hospital and visit a church and a Sikh temple, the BBC reported.\n\n\"Tomorrow, he was due to undertake four public engagements in Birmingham and is greatly disappointed to be missing them on this occasion,\" read a palace statement reported by the BBC.\n\n\"He very much hopes that they can be rescheduled in due course and offers his deepest apologies to all those who had worked so hard to make the planned visit possible.\"\n\nThe king's state visit to Italy is still set to go ahead from April 7 with some changes to the planned schedule, the palace said this week.\n\nThe palace did not detail what the king's side-effects were, and has never disclosed what type of cancer the king has.\n\nThe king's cancer was detected when he had treatment for an enlarged prostate in January 2024.\n\nHe stepped away from public duties until last April for a period of treatment and rest, but continued fulfilling state duties, such as reviewing government papers and meeting with the prime minister.\n\nCharles's illness came as the Princess of Wales, Catherine, was also diagnosed with cancer.",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.smh.com.au/national/nsw/kristian-white-leaves-court-a-free-man-as-nowland-family-speak-20250328-p5lnb6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kristian White leaves court a free man as Nowland family speak",
    "publish_date": "Fri, 28 Mar 2025 12:51:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "Kristian White leaves court a free man as Nowland family speak\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/lifestyle/health-and-wellness/we-know-we-should-eat-better-to-live-longer-why-are-so-few-of-us-doing-it-20250321-p5lli5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "We know we should eat better to live longer. Why are so few of us doing it?",
    "publish_date": "Fri, 28 Mar 2025 12:27:38 +1100",
    "category": "lifestyle",
    "authors": [
      "Lauren Ironmonger"
    ],
    "text": "She says the findings have important implications for shaping public health policies. “Traditionally, dietary guidelines have focused on preventing chronic diseases like heart disease. Our study highlights the potential for dietary recommendations to consider not only disease prevention but also promoting healthy ageing as a long-term goal.” Aussie diets on the decline Despite a growing wellness industry worth $US1.3 trillion ($2.07 trillion) and long-term growth in Australian spending on health, dietary habits aren’t necessarily changing for the better. New research from the CSIRO, published earlier this month, predicted Australian diets would worsen by 2030, with the intake of discretionary foods (ultra-processed foods and sugary drinks) to rise 18 per cent and the intake of fruit to decline 10 per cent. Vegetable intake remained steady, but was far below recommended levels.\n\nUsing predictive modelling techniques, researchers analysed nine years of self-reported data from more than 275,000 Australians to forecast dietary trends and compare them with national guidelines. Their findings suggest drastic change is needed if we are to meet these targets in five years. Australia’s National Preventive Health Strategy outlines ambitious nutrition targets to reach by 2030: Two servings of fruit a day, five servings of vegetables a day, and reducing discretionary foods to less than 20 per cent of total energy intake. “It was concerning to see that Australian diet quality is declining, but we’re hoping that this could be an early warning system to help get us back on track,” says Dr Gilly Hendrie, a research scientist who co-authored the CSIRO study. Interestingly, young adults (18 to 30) were the only age group to show an increase in vegetable consumption, though their intake of discretionary foods remained high.\n\nStart young, and focus on prevention So, what needs to change? Professor Luigi Fontana, scientific director of the University of Sydney’s Charles Perkins Centre, whose team has been working with schools in NSW, says education is key. More than this, he says young people need to be taught the mechanisms behind healthy lifestyle choices.\n\n“It’s not enough to tell them, ‘Eat more fruits and vegetables and don’t drink soda or [eat] processed food’.” Loading “This topic is as important as math, as English, as chemistry,” he says. “Unless students understand how different types of physical activity modulate some of these ageing and metabolic pathways, how different nutritional interventions change the risk of developing different diseases [for example], nothing will change.” He thinks education programs should also give people the skills to put this new knowledge into action.\n\n“Most people, even if they know that legumes are important, have no idea how to cook them; how to put together something that is healthy and tasty,” he says. Fontana says more education also needs to go hand-in-hand with changes to our primary healthcare system to focus on prevention rather than managing chronic disease. Accessibility is another important factor, Hendrie says. “The availability and price of fresh produce around the country will make it easier for people to eat well at a community level, making it easier and the norm to have healthy lunchboxes for kids at school or healthy snacks at sport on the weekend,” she says. It’s never too late",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/queensland/how-skibidi-toilet-made-it-into-this-prestigious-brisbane-gallery-20250226-p5lfdz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How Skibidi Toilet made it into this prestigious Brisbane gallery",
    "publish_date": "Fri, 28 Mar 2025 12:22:48 +1100",
    "category": "entertainment",
    "authors": [
      "Neesha Sinnya"
    ],
    "text": "QueeFlush from its viral success on YouTube, divisive series Skibidi Toilet is taking on the contemporary art world at Brisbane’s Institute of Modern Art.\n\nDon’t know what Skibidi Toilet is? We didn’t either.\n\nHow did Skibidi Toilet end up in a contemporary art gallery?\n\nSkibidi Toilet been described as a cultural touchstone for Gen Alpha, which is people born between 2010 and 2024.\n\nIt’s a 3D computer-graphics series created by 26-year-old Russian-Georgian content creator Alexey Gerasimov, featuring animated toilets with talking heads who are trying to take over the world. Yes, you read that correctly.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/nsw/things-to-do-this-school-holidays-in-sydney-20250324-p5lm2r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Things to do this school holidays in Sydney",
    "publish_date": "Fri, 28 Mar 2025 12:10:04 +1100",
    "category": "entertainment",
    "authors": [
      "Nicole Elphick"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The marathon that was the summer break has barely ended, but more time away from school looms large ahead of us. Fear not, we have just the plan to keep boredom at bay for all ages, and, crucially, these activities won’t break the bank, and parents may well enjoy themselves too. From the visual arts to video games, live music and musicals, you’ll find something to put a smile on the whole family’s face in the guide below. 2025 ArtExpress winners (from left) Finn Bernstone Harris, Maxina Spence, Anthony Douaihy and Oscar Hartley. Check out their work at the Art Gallery of NSW before the exhibition closes. Credit: Flavio Brancaleone Artexpress 2025\n\nArt Gallery of NSW, until April 27 It’s the final month to catch the free annual exhibition Artexpress as it showcases the most exceptional student works created last year for the art-making component of the HSC exam in visual arts. The 50 selected pieces were chosen from more than 8000 submissions and are a captivating insight into what currently concerns teens, with works in painting, sculpture, photomedia and more exploring big issues such as identity, politics and society at large. While “I could do that” is usually an insult when uttered in an art gallery, for any creatively inclined youngsters who might say it while attending Artexpress, it’s proof of how inspiring it can be to see the unfiltered work of their peers. artgallery.nsw.gov.au\n\nAdvertisement\n\nAmanda Lea Lavergne playing Grace Farrell (left), Beatrix Alder, who is one of the young performers playing Annie, and Anthony Warlow playing Oliver “Daddy” Warbucks during a rehearsal for Annie. Credit: Kate Geraghty Annie\n\nCapitol Theatre, until June 8 The toe-tapping tunes from the 1977 Broadway musical include bouncy anthem It’s the Hard Knock Life and the simultaneously optimistic and tear-jerking Tomorrow, with even American rapper Jay-Z counting himself among Annie’s legion of fans. The 1982 movie version and 2014 cinematic reimagining won over new generations, and now Sydney audiences can experience the cheerful pluck of the red-headed orphan in a production with new choreography and updated sets. Stage legend Anthony Warlow stars as billionaire businessman Oliver “Daddy” Warbucks, original yellow Wiggle Greg Page has made his musical theatre debut as president Franklin D. Roosevelt and four young performers are rotating to play the title role. Recommended for ages six and up. anniemusical.com.au Paul Dempsey (left) and Bernard Fanning have joined forces and will be playing at SummerSalt. Credit: Cybele Malinowski SummerSalt\n\nDon Lucas Reserve, Cronulla, April 6 If blasting Double J and Triple J non-stop isn’t doing the trick, indoctrinate the kiddos and teens into loving Aussie rock at this all-ages outdoor music festival that is as welcoming to young newbies as to those who have been going since moshing was cool.\n\nAdvertisement\n\nThe all killer, no filler line-up features the cream of Oz songwriting royalty, with sets from roots muso John Butler, Scar songstress Missy Higgins, Fanning Dempsey National Park (a supergroup courtesy of the frontmen of Powderfinger and Something for Kate), folk outfit the Waifs, sing-along favourites the Whitlams and talented songwriter Josh Pyke. Children under three can even attend free of charge. summersaltmusic.com.au Justine Clarke in the children’s show Mimi’s Symphony, which is playing at the Sydney Opera House from April 11-13. Credit: Katelyn-Jane Dunn Mimi’s Symphony with Justine Clarke\n\nSydney Opera House, April 11-13 Actor and ARIA-winning children’s entertainer Justine Clarke, a famous face to preschoolers from her long-running stint on Play School, performs in her latest venture. She has joined forces with composer and conductor George Ellis for a musical story following Mimi the magpie, who has fallen from her nest. The show introduces audience members to the different elements of an 18-piece orchestra before wrapping up with renditions of Clarke’s older songs including the absolute bop Watermelon. Suitable for ages three plus. sydneyoperahouse.com The stage version of the beloved TV series Gabby’s Dollhouse Live! comes to life with a local cast at the ICC. Gabby’s Dollhouse Live!\n\nICC Sydney, April 11-13 The kind-hearted hit television series gets its first-ever stage show treatment with a local cast on board and impressive puppetry used to bring to life Gabby’s feline friends. The stage show’s fresh storyline follows Gabby and her “meow-mazing” cat pals as they hunt down the colours of the rainbow to help an acorn grow. Familiar tunes like Hey Gabby! and Sprinkle Party will also feature for little voices to join in with. The show is suitable for all ages, but is particularly tailored for those aged two to six. gabbysdollhouselive.com\n\nAdvertisement\n\nEnjoy the thrills at the Sydney Royal Easter Show. Sydney Royal Easter Show\n\nSydney Showground, April 11-22 Tell the kids to gather together that pocket money for the school holiday mainstay that brings a little bit of the country to city kids. A new attraction for this year is farm experience Jamison Station, where children can interact with animals, watch blacksmithing demonstrations and take on a hay bale maze. There will, of course, still be the showbag pavilion, oodles of award-winning produce, livestock and craft to check out and amusement rides suitable for both little ones and older teens. And no trip to the Easter Show would be complete without a funfair feast of dagwood dogs, fairy floss, lemonade or the delectable Devonshire tea on offer at the Country Women’s Association tearoom. eastershow.com.au The stage version of Dav Pilkey’s beloved books, Dog Man The Musical, plays at the Sydney Opera House these school holidays. Credit: Daniel Boud Dog Man: The Musical\n\nSydney Opera House, April 11-27 Parents will know him from countless costumes at Book Week, but for the uninitiated, American comic book writer Dav Pilkey has got plenty of primary schoolers reading with the silly humour across his wildly popular series Captain Underpants, Cat Kid Comic Club and, yes, Dog Man. Catch a musical version of crime-fighting hero Dog Man, born after an explosion injured a police officer and his dog, with the only possible medical solution being to put the dog’s head on the human body. Suitable for ages eight plus. sydneyoperahouse.com A work called Queer Man Peering Into A Rock Pool, which will be on display as part of Alt: Ex, a more experimental strand of Alt: Play, a festival celebrating the Australian gaming industry. Credit: Fuzzy Ghost\n\nAdvertisement\n\nAlt: Games\n\nPhive, Parramatta, April 12-13 Tech-obsessed tweens and teens can geek out at this brand new games festival designed to spotlight the Australian gaming industry. Sessions are all free or low cost to attend and visitors of all ages are welcome to get along to Alt: Play, which features playable Australian digital games both newly released and still works in progress, or Alt: Ex, a more experimental strand curated by local artist and developer collective Serenade. Special guests for the event include Magic: The Gathering creator Richard Garfield from the US and Inscryption creator Daniel Mullins from Canada. powerhouse.com.au A scene from Alice in Wonderland, which is playing at Sydney’s Royal Botanic Garden this April. Alice in Wonderland\n\nRoyal Botanic Garden Sydney, April 12-27 Step into the sublime ridiculousness of Lewis Carroll’s beloved tale in the Australian Shakespeare Company’s outdoor production. Little ones can meet the White Rabbit, Cheshire Cat, Mad Hatter and Alice as gorgeous costumes and animated acting plunge the audience right into the charming absurdity. The show also has interactive elements. Children and caregivers will be invited to take part in the caucus race, and there will be songs, dances and games to participate in. shakespeareaustralia.com.au Move, Groove, Darling is a three-day festival at Darling Harbour packed full of activities to get your youngsters off the couch. Credit: Cassandra Hannagan Move, Groove, Darling\n\nTumbalong Park, April 18-20\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/afl/he-s-got-moves-like-mitchell-why-hawks-fans-toast-frenchie-mackenzie-20250326-p5lmm0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "He’s got moves like Mitchell: Why Hawks fans toast ‘Frenchie’ Mackenzie",
    "publish_date": "Fri, 28 Mar 2025 12:01:41 +1100",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "Mackenzie laughs at memories of his dad carefully navigating their car up the hill to their house in Spéracèdes so the family of six could go sightseeing or skiing. “We had a Renault Trafic that Dad had to try and get up the hill. [It] was always quite amusing watching him trying to squeeze it up there,” Mackenzie said. Cam Mackenzie bears a striking resemblance to his coach Sam Mitchell, and they both started their careers in the same number guernsey. Credit: Getty / John Donegan “[It was] very different to life here so it was cool to experience that.” After the family returned to Melbourne’s bayside, Mackenzie’s life centred on education and football – at school, his local club Beaumaris, then the Sandringham Dragons. His background meant he was eligible to become part of St Kilda’s Next Generation Academy at the age of 15 under the tutelage of former midfield star Nick Dal Santo.\n\nAs the rules dictating access to NGA graduates fluctuated and Mackenzie continued to develop, it became obvious to the Saints they would have to compete with every other club at the draft to snare the talented youngster. In his draft year, he played in Vic Metro’s title-winning team, as well as premierships with Sandringham and Brighton Grammar, and became a certain top-10 pick. The No.28 reminds Hawks fans of their coach Sam Mitchell, who became a star. Credit: Getty Images At the same time, Hawthorn were in the midst of generational change. They traded experienced midfielders Jaeger O’Meara (Fremantle) and Tom Mitchell (Collingwood). Liam Shiels and Ben McEvoy retired (although Shiels later joined North Melbourne) and Jack Gunston joined Brisbane. At the 2022 draft, the Hawks welcomed Mackenzie, Josh Weddle (pick 18), Henry Hustwaite (37), Jack O’Sullivan (46) and Bailey McDonald (51). The club started afresh with young midfielders fighting for spots as they learned how to play together under Mitchell. They knew their athletic profile meant their game plan leaned a certain way, but improvement did not happen overnight. Mistakes were made. Some losses were by bigger margins than anyone enjoyed. Mackenzie chipped away on the wing, his classy ball use and composure evident without being breathtaking, initially.\n\n“We definitely took some time to figure out how [our game] was going to look and figure out where I fitted. And everyone else was trying to figure out where they fitted,” Mackenzie said. Loading “Towards the back end of the year, we did work that out, and the confidence and the belief just continued to grow.” An ill-timed hamstring injury meant Mackenzie wasn’t in the team last year when the Hawks beat the Western Bulldogs in the elimination final; their first final win at the MCG since the 2015 premiership. “The last training [session] before the game, I was doing a centre-bounce drill and just felt something grab. I knew it wasn’t a serious thing and the scan showed that it wasn’t serious, but it meant I had to miss,” Mackenzie said.\n\nIt was his first notable injury. “For the first few days, I didn’t really know what to think, and then … it was awesome we won, but it was hard to watch from the sideline knowing that I would have been out there,” Mackenzie said. If the ball is on the ground, the Hawks’ Cam Mackenzie won’t be far away Credit: AFL Photos via Getty Images “It has certainly motivated me heaps this pre-season [and] added fuel to the fire that next time I want to be out there. I definitely want to be there and be a part of the team.” A solid fitness base built over the pre-season has given Mackenzie the confidence to run out games as he helped the Hawks to victories in their first three games. He has made an impression on the fans too, his straight-backed running style, mousey hair and ability to step players without much movement drawing comparisons to his coach.\n\nBut Mackenzie is taking nothing for granted, his gradual development replicating his dad’s cautious drive up the hill in Spéracèdes as he tries to squeeze into the Hawks midfield. Loading “It’s been challenging to break in there. Last year, to play a bit more on the wing was good to find that second position where I can hopefully get some time [as an] inside mid, but then also have that secondary position,” Mackenzie said. He’s more Cannes than Hollywood Hawks, a player appreciated by Hawk fans, opponents and football lovers who watch the game closely. His emergence as a key midfielder at the Hawks has been gradual, his level-headed approach consistent with Hawthorn’s personalities in that part of the ground. A smart operator, he is also fitting in a subject a semester as he studies for a Bachelor of Commerce at Monash University; keeping up the French is, however, proving more difficult.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/bennett-responds-to-stars-transformation-20250328-p5lnaj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bennett responds to star's transformation",
    "publish_date": "Fri, 28 Mar 2025 11:52:59 +1100",
    "category": "finance",
    "authors": [],
    "text": "Bennett responds to star's transformation\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/world/asia/made-in-china-burger-and-fries-has-a-side-of-nationalism-20250324-p5lm5z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Made in China burger and fries has a side of nationalism",
    "publish_date": "Fri, 28 Mar 2025 11:46:53 +1100",
    "category": "finance",
    "authors": [
      "Lisa Visentin"
    ],
    "text": "What in the World, a free weekly newsletter from our foreign correspondents, is sent every Thursday. Below is an excerpt. Sign up to get the whole newsletter delivered to your inbox.\n\nSingapore: We will never know if Xi Jinping has, on quiet occasion, shared in Donald Trump’s delight for the humble hamburger.\n\nNo world leader is as smitten with the Big Mac as Trump, and it would be wildly off-brand for the Chinese president to publicly indulge in something so quintessentially all-American.\n\nFast food workers at Chinese burger chain Tastien prepare orders at a store in Beijing. Credit: Sanghee Liu\n\nBut if Xi was looking for an acceptable compromise he’d probably make a beeline for China’s Tastien fast food chain, which proclaims itself the “creator of the Chinese burger”.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/king-charles-hospitalised-after-cancer-treatment-side-effects/js6ijq5rx",
    "title": "King Charles undergoes hospital observation after cancer treatment side effects",
    "publish_date": "Thu, 27 Mar 2025 22:43:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "King Charles experienced temporary side effects that required a short period of observation in hospital, following scheduled and ongoing medical treatment for cancer.\n\n\n\n\n\n\"Following scheduled and ongoing medical treatment for cancer this morning, the King experienced temporary side effects that required a short period of observation in hospital,\" Buckingham Palace said in a statement on Friday morning AEDT.\n\n\n\n\n\nCharles is now back at the royal residence Clarence House, and has since cancelled a planned trip to Birmingham to prioritise his recovery.\n\n\n\n\n\nHe had been due to meet ambassadors in audiences at Buckingham Palace on Thursday (local time), but these were postponed after acting on medical advice.\n\n\n\nCharles' treatment continuing throughout 2025\n\nThe palace did not elaborate on the King's side effects. The type of cancer he has been diagnosed with has also never been disclosed.\n\n\n\n\n\nCharles was diagnosed with cancer in February 2024 and returned to public-facing duties in April despite still undergoing weekly treatment.\n\n\n\n\n\nCharles has had a busy run of engagements this week, including a reception for media and a visit to a soil exhibition. He is due to visit Italy in early April, and it's understood this will still go ahead.\n\n\n\n\n\nHe experienced temporary and relatively common side effects, the BBC reported, quoting sources, adding that it had been a minor bump in his recovery.\n\n\n\n\n\nCharles returned to work within two and a half months of his cancer diagnosis and gradually ramped up his duties during the rest of 2024, including making several foreign trips, including to Australia and Samoa.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 3
  },
  {
    "url": "https://www.sbs.com.au/news/article/rfk-jr-announces-major-slashing-of-us-public-health-agencies/tmp5jzv3a",
    "title": "Robert F Kennedy Jr announces major slashing of US public health agencies",
    "publish_date": "Thu, 27 Mar 2025 19:51:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Robert F Kennedy Jr has announced plans to reshape the US public health agencies.\n\nThe jobs cuts combined with recent voluntary resignations reduce staff numbers by around 20,000.\n\nThe announcement is the latest in a series of restructuring plans in the federal workforce.\n\nUnited States secretary of health and human services (HHS) Robert F Kennedy Jr has announced plans to reshape federal public health agencies, including cutting 10,000 employees and centralising some functions of the Food and Drug Administration (FDA), Centers for Disease Control and Prevention (CDC) and others under his control.\n\n\n\n\n\nThe job cuts include 3,500 at the FDA, 2,400 at the CDC, and 1,200 at the National Institutes of Health (NIH).\n\n\n\n\n\nThe latest job cuts, and about 10,000 recent voluntary departures, will reduce the number of full-time HHS employees to 62,000 from 82,000, the department said.\n\n\n\n\n\n\"Over time, bureaucracies like HHS become wasteful and inefficient even when most of their staff are dedicated and competent civil servants,\" Kennedy said in a statement.\n\n\n\n\n\nUS President Donald Trump and billionaire ally Elon Musk, who oversees the Department of Government Efficiency cost-cutting initiative, have been gutting agencies as part of an effort to shrink the federal bureaucracy.\n\n\n\nLISTEN TO 'Intention to cause chaos': How Elon Musk is reshaping the US government SBS News 08/03/2025 13:22 Play\n\nLarge government agencies like HHS sprawl over time, and there is merit in reorganising them, which has happened under both Democratic and Republican administrations, but this plan goes beyond that, said Larry Levitt, executive vice president for health policy at non-profit Kaiser Family Foundation.\n\n\n\n\n\n\"This is not just a reorganisation of HHS. It is also a slashing of the federal workforce, which will ultimately affect government services,\" said Levitt, a former senior adviser to the White House and HHS under former president Bill Clinton.\n\n\n\n\n\nThe planned FDA job cuts would not affect inspectors or reviewers of drugs, medical devices, or food, HHS said.\n\n\n\n\n\nThe terminations are likely to delay drug and medical device application reviews or cause missed deadlines, said Eva Temkin, a lawyer at Arnold & Porter who advises clients on drug and medical device applications.\n\n\n\n\n\n\"There's a real risk that this results in delayed patient access to treatments,\" she said.\n\n\n\nThe Administration for Strategic Preparedness and Response, currently an independent HHS agency with 1,000 employees, will be folded into the CDC.\n\n\n\n\n\nThe NIH will see staff reductions across its 27 institutes and centres.\n\n\n\n\n\nThe Centers for Medicare and Medicaid Services was comparatively spared with a reduction of about 300 employees. It was not immediately clear from which HHS divisions or offices the remaining 2,600 cuts would come.\n\n\n\n\n\nAs part of the restructuring, the department's 10 regional offices will be cut to five and its 28 divisions consolidated into 15, including a new Administration for a Healthy America, or AHA.\n\n\n\n\n\nThe changes centralise functions such as communications, human resources, IT, and policy planning that currently spread out across several health agencies, including the FDA, CDC, and NIH. Agencies report to the health secretary but have traditionally operated somewhat independently of HHS and the White House.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/live-blog/follow-live-federal-election-latest/tdi12rp4c",
    "title": "Federal election 2025 live updates: Albanese, Dutton's opening pitches; Bandt's 'dead fish' critique",
    "publish_date": "Thu, 27 Mar 2025 19:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "David Littleproud\n\nsaid the Coalition's power policy was \"about leaving a legacy\".\n\n\"Not just [for] regional Australia but also a legacy for our nation to have reliable power, and so that is the courage and conviction that Peter Dutton and I bring into it,\" he said.\n\n\"If you solve the energy prices and magically bring gas into the grid quickly, they will also put downward pressure on your grocery bill, and if you look at what we doing with excise on fuel, that will flow through to the supply chain, putting downward pressure onto your grocery bill at checkout.\"\n\nLittleproud said the Albanese government \"hasn't even got the courage\" to stand up to supermarkets.\n\nHe also urged against voting for independent candidates, which he described as a \"threat\".\n\n\"A vote at the next federal election for an independent is a vote for Anthony Albanese and three more years of an Albanese, Greens, teal independent chaotic government.\n\n\"We need strong leadership from any certainty, and that is what Peter Dutton and myself deliver as a Coalition government.\"\n\n—\n\nJessica Bahr",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/dutton-uses-budget-reply-speech-to-outline-coalition-election-manifesto/x0rb6eg6p",
    "title": "Dutton uses budget reply speech to outline Coalition election manifesto",
    "publish_date": "Thu, 27 Mar 2025 10:50:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIn Parliament House, Opposition leader Peter Dutton began his budget reply speech by telling MPs Australia is at its \"sliding doors moment\".\n\n\n\n\n\n\"Every election is important. But this election matters more than others in recent history. It's a 'sliding doors' moment for our nation. A returned Albanese Government in any form won’t just be another three bleak years - more economic mistakes will take a lot longer to recover from, setbacks will be set in stone and our prosperity will be damaged for decades to come.\"]]\n\n\n\n\n\nMr Dutton has made his pitch to Australians, promising he'll focus on immigration, housing, health and community safety if he's elected as the next Prime Minister.\n\n\n\n\n\n\"Tonight, I commit a Dutton Coalition Government to the following. We will introduce four critical pieces of legislation on the first sitting day of the next Parliament. 1. The Energy Price Reduction Bill; 2. The Lower Immigration and More Homes for Australians Bill; 3. The Keeping Australians Safe Bill; and 4. The Guaranteed Funding for Health, Education and Essential Services Bill. This is my signal to Australian people of what my priorities will be in government.\"\n\n\n\n\n\nStressing his commitment to tackle the rising cost of living, Mr Dutton also announced several relief policies if the Coalition wins government.\n\n\n\n\n\n\"A Coalition government will halve the fuel excise for 12 months. And then will review it. And we will make sure that comes in on our first day our parliament sits.\"\n\n\n\n\n\nThe Coalition also plans to abandon Labor's $20 billion Rewiring the Nation Fund, the $10 billion Housing Australia Future Fund, and $16 billion of production tax credits for critical minerals and green hydrogen.\n\n\n\n\n\nMr Dutton also promised the Coalition would scale down the size of the public service, and instead invest in critical services.\n\n\n\n\n\n\"In line with our national interest, we will continue to invest in essential services and critical areas of the economy – like health, aged-care, veterans’ support, the NDIS, Indigenous affairs, childcare and defence. We won't cut frontline service delivery roles. We will ensure the services Australians rely on are sustainable.\"\n\n\n\n\n\nIn terms of reducing the cost of energy, Mr Dutton says his government will invest $1 billion in a Critical Gas Infrastructure Fund to increase gas pipeline and storage capacity.\n\n\n\n\n\nHe also says the Coalition will cut the permanent migration program by 25 per cent, and implement stricter caps on international students.\n\n\n\n\n\nThe Coalition will also offer a $400 million funding to support youth mental health.\n\n\n\n\n\nLabor has responded to Mr Dutton's budget pitch, with Education Minister Jason Clare saying the Coalition will make Australians pay more tax.\n\n\n\n\n\n\"I know it sounds unbelievable, but it's true: if Peter Dutton wins the election, you will pay more tax. So the stage is now set. If Labor wins the election, your taxes will be lower; if Peter Dutton wins the election, your taxes will be higher.\"\n\n\n\n\n\nThe federal election is set to be held on May 3.\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/minister-for-sport-shares-governments-sporting-goals-in-lead-up-to-2032-brisbane-olympics/5frbwn6pe",
    "title": "Minister for Sport shares government’s sporting goals in lead up to 2032 Brisbane Olympics",
    "publish_date": "Thu, 27 Mar 2025 08:53:07 +0000",
    "category": "sports",
    "authors": [],
    "text": "Minister for Sport shares government’s sporting goals in lead up to 2032 Brisbane Olympics\n\nPublished 27 March 2025, 7:56 am\n\nConfirmation of the plans for the Brisbane Olympics along with the Federal Budget has put sport funding back in the news. SBS reporter Adrian Arciuli sat down with Minister for Sport, Anika Wells, to discuss the government's goals and priorities in lead-up to the games.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/video/national-party-leader-talks-strategies-gearing-up-for-coalition-budget-reply/n4ie0nmug",
    "title": "National Party leader talks strategies, gearing up for Coalition budget reply",
    "publish_date": "Thu, 27 Mar 2025 08:47:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/slashing-migration-lowering-energy-bills-coalition-reveals-its-vision-ahead-of-election/kipgzt6gr",
    "title": "The Coalition revealed its vision ahead of the election. Here's what was in the budget reply",
    "publish_date": "Thu, 27 Mar 2025 08:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Peter Dutton has promised to lower energy bills through a National Gas Plan, slash migration and cut thousands of federal public servants as part of his election pitch to voters.\n\n\n\n\n\nIn his fourth budget reply speech, the Opposition leader has pledged to fast-track new gas projects, increase the small business instant asset write-off to $30,000 and cut migration by 25 per cent if elected.\n\n\n\n\n\n\"It's a sliding doors moment for our nation,\" Dutton said during his speech, adding: \"This election is as much about leadership as it's about policy.\"\n\n\n\nIt followed Labor revealing its budget plans on Tuesday .\n\n\n\n\n\nHere are some of the key elements of Dutton's pitch to Australian voters.\n\n\n\nIntroducing a national gas plan to lower bills\n\nA Dutton government would immediately introduce a National Gas Plan to prioritise domestic supply of gas and drive down energy bills.\n\n\n\n\n\nThe plan includes fast-tracking new gas projects, halving approval times and launching a gas reservation plan, under which a certain amount of gas produced would be reserved for the domestic market.\n\n\n\n\n\nDutton said it would \"secure an additional 10 per cent to 20 per cent of the east coast’s demand\" and would \"drive down new wholesale domestic gas prices from over $14 per gigajoule to under 10 per gigajoule\".\n\n\n\nThe policy could come at a loss to the industry, shifting gas destined for export at a higher price.\n\n\n\n\n\nWestern Australia has had a similar policy since 2006.\n\n\n\nCheaper fuel\n\nWith a clear focus on the hip pocket, the Coalition also revealed it will cut the fuel excise from about 50 cents to 25 cents per litre on its first sitting day.\n\n\n\n\n\nDutton said the Australian Competition and Consumer Commission would \"ensure that the fuel excise cut will be passed on in full to consumers\".\n\n\n\nSlashing migration\n\nDutton has confirmed the Coalition will cut the permanent migration program by 25 per cent if elected on 3 May.\n\n\n\n\n\nUnder the plan, levels currently set at 185,000 will be cut by an estimated 46,000 places.\n\n\n\n\n\n\"Labor is neither in control of migration, nor has it kept migration at sustainable levels,\" Dutton said.\n\n\n\nREAD MORE The federal election will be held on 3 May\n\nHe added the plan will free up housing and \"restore the great Australian dream of home ownership\".\n\n\n\n\n\nWhile the commitment was made in last year's budget reply, it required clarity after the Opposition's treasury spokesperson Angus Taylor appeared to walk back the policy on Sunday's Insiders program.\n\n\n\nBoost to instant asset write-off for small businesses\n\nThe Albanese government extended a $20,000 instant asset write-off for small businesses, passing the legislation late on Wednesday night.\n\n\n\n\n\nIn his budget reply, Dutton has appealed to business owners by pledging to boost the write-off to $30,000.\n\n\n\n\n\nIt adds on a previous promise to provide deductions of up to $20,000 per year for business-related meal expenses.\n\n\n\nREAD MORE Revealed: The winners and losers of the 2025 federal budget\n\nCuts to public servants\n\nDutton has accused the Albanese government of \"ineffectual and wasteful\" spending.\n\n\n\n\n\nHe says cutting 41,000 public servants hired under Labor will save the budget over $10 billion over the forward estimates.\n\n\n\n\n\nFollowing concerns that the policy could affect essential services, including veterans' affairs, he said: \"We won’t cut frontline service delivery roles\".\n\n\n\nInvesting in mental health and cheaper medicines\n\nAn $8.5 billion boost to Medicare is the centrepiece of Labor's election campaign.\n\n\n\n\n\nThe Coalition will match the commitment, announcing a $9 billion investment in health.\n\n\n\n\n\nThis includes delivering Labor's promise to lower prices of medicines on the Pharmaceutical Benefits Scheme , capping most prescriptions to $25.\n\n\n\nDutton has committed to an additional $400 million towards youth mental health.\n\n\n\n\n\n\"We will boost regional services and expand treatment to place Australia at the forefront of youth mental health treatment in the world,\" he said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/automotive-tariffs-smash-global-markets/hbv54d91u",
    "title": "Automotive tariffs smash global markets",
    "publish_date": "Thu, 27 Mar 2025 07:23:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/national/nsw/kristian-white-leaves-court-a-free-man-as-nowland-family-speak-20250328-p5lnb6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kristian White leaves court a free man as Nowland family speak",
    "publish_date": "Fri, 28 Mar 2025 12:51:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "Kristian White leaves court a free man as Nowland family speak\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/lifestyle/health-and-wellness/we-know-we-should-eat-better-to-live-longer-why-are-so-few-of-us-doing-it-20250321-p5lli5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "We know we should eat better to live longer. Why are so few of us doing it?",
    "publish_date": "Fri, 28 Mar 2025 12:27:38 +1100",
    "category": "lifestyle",
    "authors": [
      "Lauren Ironmonger"
    ],
    "text": "She says the findings have important implications for shaping public health policies. “Traditionally, dietary guidelines have focused on preventing chronic diseases like heart disease. Our study highlights the potential for dietary recommendations to consider not only disease prevention but also promoting healthy ageing as a long-term goal.” Aussie diets on the decline Despite a growing wellness industry worth $US1.3 trillion ($2.07 trillion) and long-term growth in Australian spending on health, dietary habits aren’t necessarily changing for the better. New research from the CSIRO, published earlier this month, predicted Australian diets would worsen by 2030, with the intake of discretionary foods (ultra-processed foods and sugary drinks) to rise 18 per cent and the intake of fruit to decline 10 per cent. Vegetable intake remained steady, but was far below recommended levels.\n\nUsing predictive modelling techniques, researchers analysed nine years of self-reported data from more than 275,000 Australians to forecast dietary trends and compare them with national guidelines. Their findings suggest drastic change is needed if we are to meet these targets in five years. Australia’s National Preventive Health Strategy outlines ambitious nutrition targets to reach by 2030: Two servings of fruit a day, five servings of vegetables a day, and reducing discretionary foods to less than 20 per cent of total energy intake. “It was concerning to see that Australian diet quality is declining, but we’re hoping that this could be an early warning system to help get us back on track,” says Dr Gilly Hendrie, a research scientist who co-authored the CSIRO study. Interestingly, young adults (18 to 30) were the only age group to show an increase in vegetable consumption, though their intake of discretionary foods remained high.\n\nStart young, and focus on prevention So, what needs to change? Professor Luigi Fontana, scientific director of the University of Sydney’s Charles Perkins Centre, whose team has been working with schools in NSW, says education is key. More than this, he says young people need to be taught the mechanisms behind healthy lifestyle choices.\n\n“It’s not enough to tell them, ‘Eat more fruits and vegetables and don’t drink soda or [eat] processed food’.” Loading “This topic is as important as math, as English, as chemistry,” he says. “Unless students understand how different types of physical activity modulate some of these ageing and metabolic pathways, how different nutritional interventions change the risk of developing different diseases [for example], nothing will change.” He thinks education programs should also give people the skills to put this new knowledge into action.\n\n“Most people, even if they know that legumes are important, have no idea how to cook them; how to put together something that is healthy and tasty,” he says. Fontana says more education also needs to go hand-in-hand with changes to our primary healthcare system to focus on prevention rather than managing chronic disease. Accessibility is another important factor, Hendrie says. “The availability and price of fresh produce around the country will make it easier for people to eat well at a community level, making it easier and the norm to have healthy lunchboxes for kids at school or healthy snacks at sport on the weekend,” she says. It’s never too late",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/queensland/how-skibidi-toilet-made-it-into-this-prestigious-brisbane-gallery-20250226-p5lfdz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How Skibidi Toilet made it into this prestigious Brisbane gallery",
    "publish_date": "Fri, 28 Mar 2025 12:22:48 +1100",
    "category": "entertainment",
    "authors": [
      "Neesha Sinnya"
    ],
    "text": "QueeFlush from its viral success on YouTube, divisive series Skibidi Toilet is taking on the contemporary art world at Brisbane’s Institute of Modern Art.\n\nDon’t know what Skibidi Toilet is? We didn’t either.\n\nHow did Skibidi Toilet end up in a contemporary art gallery?\n\nSkibidi Toilet been described as a cultural touchstone for Gen Alpha, which is people born between 2010 and 2024.\n\nIt’s a 3D computer-graphics series created by 26-year-old Russian-Georgian content creator Alexey Gerasimov, featuring animated toilets with talking heads who are trying to take over the world. Yes, you read that correctly.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/afl/he-s-got-moves-like-mitchell-why-hawks-fans-toast-frenchie-mackenzie-20250326-p5lmm0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "He’s got moves like Mitchell: Why Hawks fans toast ‘Frenchie’ Mackenzie",
    "publish_date": "Fri, 28 Mar 2025 12:01:41 +1100",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "Mackenzie laughs at memories of his dad carefully navigating their car up the hill to their house in Spéracèdes so the family of six could go sightseeing or skiing. “We had a Renault Trafic that Dad had to try and get up the hill. [It] was always quite amusing watching him trying to squeeze it up there,” Mackenzie said. Cam Mackenzie bears a striking resemblance to his coach Sam Mitchell, and they both started their careers in the same number guernsey. Credit: Getty / John Donegan “[It was] very different to life here so it was cool to experience that.” After the family returned to Melbourne’s bayside, Mackenzie’s life centred on education and football – at school, his local club Beaumaris, then the Sandringham Dragons. His background meant he was eligible to become part of St Kilda’s Next Generation Academy at the age of 15 under the tutelage of former midfield star Nick Dal Santo.\n\nAs the rules dictating access to NGA graduates fluctuated and Mackenzie continued to develop, it became obvious to the Saints they would have to compete with every other club at the draft to snare the talented youngster. In his draft year, he played in Vic Metro’s title-winning team, as well as premierships with Sandringham and Brighton Grammar, and became a certain top-10 pick. The No.28 reminds Hawks fans of their coach Sam Mitchell, who became a star. Credit: Getty Images At the same time, Hawthorn were in the midst of generational change. They traded experienced midfielders Jaeger O’Meara (Fremantle) and Tom Mitchell (Collingwood). Liam Shiels and Ben McEvoy retired (although Shiels later joined North Melbourne) and Jack Gunston joined Brisbane. At the 2022 draft, the Hawks welcomed Mackenzie, Josh Weddle (pick 18), Henry Hustwaite (37), Jack O’Sullivan (46) and Bailey McDonald (51). The club started afresh with young midfielders fighting for spots as they learned how to play together under Mitchell. They knew their athletic profile meant their game plan leaned a certain way, but improvement did not happen overnight. Mistakes were made. Some losses were by bigger margins than anyone enjoyed. Mackenzie chipped away on the wing, his classy ball use and composure evident without being breathtaking, initially.\n\n“We definitely took some time to figure out how [our game] was going to look and figure out where I fitted. And everyone else was trying to figure out where they fitted,” Mackenzie said. Loading “Towards the back end of the year, we did work that out, and the confidence and the belief just continued to grow.” An ill-timed hamstring injury meant Mackenzie wasn’t in the team last year when the Hawks beat the Western Bulldogs in the elimination final; their first final win at the MCG since the 2015 premiership. “The last training [session] before the game, I was doing a centre-bounce drill and just felt something grab. I knew it wasn’t a serious thing and the scan showed that it wasn’t serious, but it meant I had to miss,” Mackenzie said.\n\nIt was his first notable injury. “For the first few days, I didn’t really know what to think, and then … it was awesome we won, but it was hard to watch from the sideline knowing that I would have been out there,” Mackenzie said. If the ball is on the ground, the Hawks’ Cam Mackenzie won’t be far away Credit: AFL Photos via Getty Images “It has certainly motivated me heaps this pre-season [and] added fuel to the fire that next time I want to be out there. I definitely want to be there and be a part of the team.” A solid fitness base built over the pre-season has given Mackenzie the confidence to run out games as he helped the Hawks to victories in their first three games. He has made an impression on the fans too, his straight-backed running style, mousey hair and ability to step players without much movement drawing comparisons to his coach.\n\nBut Mackenzie is taking nothing for granted, his gradual development replicating his dad’s cautious drive up the hill in Spéracèdes as he tries to squeeze into the Hawks midfield. Loading “It’s been challenging to break in there. Last year, to play a bit more on the wing was good to find that second position where I can hopefully get some time [as an] inside mid, but then also have that secondary position,” Mackenzie said. He’s more Cannes than Hollywood Hawks, a player appreciated by Hawk fans, opponents and football lovers who watch the game closely. His emergence as a key midfielder at the Hawks has been gradual, his level-headed approach consistent with Hawthorn’s personalities in that part of the ground. A smart operator, he is also fitting in a subject a semester as he studies for a Bachelor of Commerce at Monash University; keeping up the French is, however, proving more difficult.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/victoria/what-s-on-in-melbourne-in-april-to-keep-school-holiday-boredom-at-bay-20250324-p5lm5j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What’s on in Melbourne in April to keep school holiday boredom at bay",
    "publish_date": "Fri, 28 Mar 2025 11:59:28 +1100",
    "category": "entertainment",
    "authors": [
      "Sonia Nair"
    ],
    "text": "Bug out with your child – ideally if they’re aged between five and 12 – at this immersive event that celebrates Victorian bugs. Through fun and engaging supervised activities, children will be encouraged to create a one-of-a-kind bug diorama replete with tiny tunnels, leafy hideouts and concealed habitats. To add to the fun, real bugs will be on display. Jon and Jero will get the giggles going at Comedy Club For Kids. Credit: NickMickPics Comedy Club for Kids\n\n$16–$25\n\nMelbourne Museum, April 5-20 Melbourne comes abuzz with the comedy festival, but it’s not just the adults who can enjoy a laugh. Entertaining parents and children alike is the Comedy Club for Kids, which has been inducing giggles, snorts and guffaws for over two decades. Featuring in this year’s lineup are Melbourne-based comedic duo Jon & Jero, who put paid to scary notions of crowd work by creating an open space of play, curiosity and imagination, and Mr Snotbottom, who will take children through the sticky, icky, wonderful world of mucus. Suitable for children aged six to 12. Hooves, Horns and Wings: Unicorns and Other Horsey Things\n\n$16\n\nHellenic Museum, April 5-12\n\nArgonaut adventurers between four and 10 will have a blast discovering the many horse-like creatures of Greek mythology. Kicking off with a 30-minute tour around the Hellenic Museum where children are regaled with beguiling stories of mythical horses and introduced to objects more than 2000 years old, the activity ends with an interactive activity where young adventurers get the opportunity to create their own flipbook drawing on the very same creatures they’ve just learned about. As a bonus, tickets include entry to Michael Zavros’ interactive family exhibition Gods and Monsters, where children can learn about Greek mythology through animation and create their own digital ‘hero’ identity. Let your artistic talents shine at Fed Square and create an artwork based on your furry friend, inspired by the NGV exhibition Cats & Dogs. Credit: Eugene Hyland/ Museums Victoria Draw a Furry Friend\n\nAdults $16, children $8\n\nThe Ian Potter Centre, April 7-8 Inspired by the NGV exhibition Cats & Dogs, which has been on since November, step into Fed Square for this school holiday drawing activity inspired by the furry creatures on display. From cattle dogs to lap dogs, divine felines to the black cats of superstition, find out whether you’re a cat or dog person by donning a set of ears and drawing a portrait of your favourite animal between the two. Activities are designed for children aged three years and above, but younger children can attend with the assistance of an adult. Nature Play Melbourne\n\nFree\n\nRoyal Botanic Gardens Melbourne, April 8-9\n\nIf screentime is an issue, there’s no better time to acquaint your little ones with nature than during the autumnal months of deciduous trees shedding their leaves. Celebrate Nature Play Week by participating in free nature-inspired experiences on Oak Lawn and in The Ian Potter Foundation Children’s Garden – learning facilitators and volunteers will guide children through the falling leaves and seeds, the shifting colours and the magic of the gardens as the seasons morph from one to another. Adults have the Melbourne Food and Wine Festival, children have the Little Food Festival. Credit: Tobias Titz Little Food Festival\n\nFree\n\nFederation Square, April 9-10 Adults have the Melbourne Food and Wine Festival, children have the Little Food Festival. But rather than showcasing the pageantry of fine dining or spotlighting fresh seasonal produce on a plate, this free festival travels further in each direction – taking children through each stage of the food system from growing, moving and buying food to cooking, eating and recycling. The two days of hands-on activities include the planting of seedlings, immersion in the world of bush foods, hopping on a smoothie bike, and the construction of mini mushroom farms. Partnering with organisations like Monash University, CSIRO and CERES, Little Food Festival is empowering the next generation to care for, protect and champion sustainable food. Titanic: A Voyage Through Time is an exhibition to immerse you in the tragedy and glamour of the Titanic.\n\nTitanic: A Voyage Through Time\n\nFrom $23.50\n\n206 Bourke Street, April 10-30 Far safer and less ill-fated than the 2023 implosion of the submersible that was dispatched to the depths of the ocean for a viewing of Titanic wreckage, this VR experience promises an immersive experience aboard the doomed 1912 vessel without any of the accompanying danger. Walk the decks; hear the personal stories of the passengers, crew and visionaries behind the groundbreaking voyage in its day; and explore the wreckage from the safety of 206 Bourke Street. Attendees must be at least eight years old with a minimum height of 1.3m. The Turkish Pazar Festival which is taking place at Queen Victoria Market. Turkish Pazar Festival\n\nFree\n\nQueen Victoria Market, April 12–13 Queen Victoria Market is set to be transformed into a traditional Turkish street market, celebrating the rich traditions and culinary heritage of the Turkish-Australian community. The free, family-friendly festival will feature numerous food and drink stalls – including Turkish coffee prepared over hot sand – children’s activities, music and dance, and cultural displays such as traditional Turkish calligraphy and ebru (paper marbling).\n\nOut of the Woods Escape Room\n\nFree, bookings essential\n\nSouthbank Library, various times April 14 If you’ve enjoyed an escape room experience and ever wondered if there’s an equivalent for children, the City of Melbourne’s Out of the Woods Escape Room is for you. Suitable for participants aged between seven and 12, children are encouraged to solve puzzles and crack codes to forge their way out. Kusama for Kids invites children into the Obliteration Room, a large-scale interactive installation for children and families. Kusama for Kids: The Obliteration Room\n\nFree\n\nNational Gallery of Victoria, until April 21 The weird, wonderful and wacky world of Japanese artist Yayoi Kusama’s polka-dotted pumpkins, ornate flower structures and immersive infinity rooms have mesmerised audiences the world over. Kusama for Kids invites children into the Obliteration Room, a large-scale interactive installation for children and families, where they’re encouraged to ‘obliterate’ the rooms by adding bright, colourful dots to the white furniture, objects and surfaces. Get down low or perch aloft someone’s shoulders to reach the soaring heights of blank space yet to be obliterated.\n\nThe Future & Other Fictions exhibition at ACMI features costumes from the Marvel film Black Panther. Credit: Credit: Eugene Hyland The Future & Other Fictions\n\nAdults $22.50, children $10, free for children under four\n\nACMI, until April 27 ACMI’s ethereal Future & Other Fictions exhibition premiered in November 2024, but don’t miss it in its last few weeks. Step into the minds of 19 creative visionaries from around the globe, through more than 180 works, and experience how future worlds are dreamed up and created on screen – whether it’s the detailed costumes from Black Panther: Wakanda Forever; the intricate sets, props and concept art from video game Cyberpunk 2077 and films Blade Runner 2049 and The Creator; or Icelandic icon Björk’s otherworldly dress in her 2017 music video for The Gate. The exhibition is suitable for all ages, with conversation prompts available for the more complex themes. Run the Tan\n\nFrom $45 to $75\n\nApril 27 Run the Tan in service of mental health in this flagship event for celebrities, elite athletes and families alike. The iconic 3.8-kilometre running track surrounding the Royal Botanic Gardens comes alive during this charity running festival, with proceeds going to places like Run for Mental Health, Lifeline and Black Dog Institute.",
    "source": "TheAge",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/bennett-responds-to-stars-transformation-20250328-p5lnaj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bennett responds to star's transformation",
    "publish_date": "Fri, 28 Mar 2025 11:52:59 +1100",
    "category": "finance",
    "authors": [],
    "text": "Bennett responds to star's transformation\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/guiding-your-child-s-mental-health-with-confidence-20250319-p5lkqf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Guiding your child’s mental health with confidence",
    "publish_date": "Fri, 28 Mar 2025 11:51:22 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "“We know that modern families are busy, so Daily Growth has been designed to be a new, quick and convenient way for parents to get help for common challenging situations,” A/Prof Westrupp explains.\n\n“Twice a day, parents get prompted to answer a few short questions, which they can answer when it suits them. We ask things like whether the parent themself is feeling upset and how difficult it is managing their child’s emotions and behaviour right in that moment. It only takes about five seconds but their responses help us to tailor the parenting tips so that they’re relevant to each family.”\n\nEvidence-based wellbeing\n\nThe app is built on three trusted wellbeing practices — emotional support, play, and connection to nature and culture — in order to nourish a child’s overall wellbeing.\n\nThrough a collaboration with Wayapa Wuurrk, Daily Growth families have access to resources to help support their children’s mental health through an Indigenous Earth mindfulness practice.\n\n“Children are so connected to and learn constantly from their environments. They are also curious about the world around them and their place within it,” says Wayapa Wuurrk training manager and cultural lead Jem Stone.\n\n“Given the opportunity to connect with the Earth through the Wayapa lens, children and parents can foster a lifestyle of Earth-centred wellbeing. We all want to experience a sense of belonging and inclusion, and Wayapa helps us all acknowledge the various ways that we can attune ourselves to each other and the natural environment.”\n\nWayapa teaches children about the natural cycles of the Earth. Credit: iStock\n\nWayapa teaches children about the natural cycles of the Earth. For example, in the context of bedtime routines, when the sun is setting, you would say that the world is getting ready for rest. You might invite your child to say goodnight to the sun and welcome the moon that looks over them as they sleep.\n\nSimilarly, when a child is getting dressed, you can encourage them to look outside and see what kind of weather is outside.\n\n“It’s all too easy to look at our smartphone and see the weather predictions,” Stone explains. “But teaching our child to observe the natural world around them encourages them to feel connected to and supported by the Earth.”\n\nWhen it comes to play, A/Prof Westrupp says that not only does it help children connect to their bodies and have fun, but explains that there is scientific evidence showing that physical activity and play also help manage stress and promote brain development.\n\nFrom big, slow movements and games involving rhythm, music and dance, to the energy of rough-and-tumble games, they each play a positive role in a child’s mental wellness.\n\nMeanwhile, to support parents in teaching their child about emotions, A/Prof Westrupp shares these six steps that adults can always refer to as a simple and quick go-to to help their child with their emotions.\n\nPause, notice your own emotions and take five deep breaths. It’s hard to support your child if you’re emotional yourself. Notice what your child might be feeling and why, and think about how you can meet their needs. Accept. You teach your child that emotions are normal and safe when you calmly accept all their emotions, even the uncomfortable ones. Listen and label. If your child is emotional or really upset, it’s best not to say much in the moment. Instead, listen and label your child’s emotions with simple language to help them feel understood. Empathise. Empathising with your child helps to build trust, and strengthens the connection between you. Reflect. Kids learn to understand themselves when they talk about things later when everyone’s calm. You can problem-solve together, and role model how to share your feelings, take responsibility and make amends for behaviour you regret.\n\n\n\nGrowing our children’s mental wellbeing… together\n\nEach family is unique, and Daily Growth has been designed for all Australian families. Credit: iStock\n\nWhile the team of researchers working on Daily Growth come with a wealth of experience in the field, they have made sure that they are also working closely with parents to co-design the app.\n\nThis will ensure that the app is relevant to their daily lives and appropriate for their personal context — and make sure that every Australian parent has access to relevant tools to help them raise their children into resilient adults.\n\nFor more information about the Daily Growth app and to read more about the world-leading research carried out through Deakin University’s SEED Lifespan centre, click here.",
    "source": "TheAge",
    "cluster_id": 37
  },
  {
    "url": "https://au.news.yahoo.com/couple-left-with-nothing-after-devastating-caravan-inferno-at-aussie-tourist-spot-211211148.html",
    "title": "Couple left with nothing after devastating caravan inferno at Aussie tourist spot",
    "publish_date": "2025-03-27T21:12:11Z",
    "category": "finance",
    "authors": [],
    "text": "It was meant to be a 'fresh start' for this young couple, but just four days into their trip, the journey turned into a nightmare.\n\nA South Australian couple have been left with just the clothes on their backs after losing everything in a caravan fire on the Eyre Peninsula. Source: GFM\n\nA young Australian couple’s dream road trip, which was meant to be a \"fresh start\" for the pair, has ended in disaster after their caravan was completely destroyed in a fire just days into their journey.\n\nIsabelle and her partner Dave had been on the road for only four days when their holiday took a heartbreaking turn at a popular camping spot on South Australia’s Eyre Peninsula. \"We had spent months planning our dream trip, and only a few days in, disaster struck,\" Isabelle said.\n\nThe 28-year-old content creator was helping her partner reverse the caravan into place when she suddenly noticed plumes of smoke billowing out.\n\n\"While reversing the van, I got out to help direct and ... heard the fire alarm. I saw thick smoke pouring out of the vent above the caravan front door,\" she recalled. Acting fast, Isabelle rushed to unhook their car and evacuate their three dogs — Lucy, Buddy and Axel — while Dave attempted to fight the flames.\n\nADVERTISEMENT\n\n\"My partner [used an] extinguisher, but it was too late. The smoke was overwhelming, and it was too dangerous to be inside the van with no visibility,\" she said, describing the moment in a GoFundMe campaign in the wake of the freak accident.\n\n\"We managed to remove the gas bottles before calling 000, but all we could do was watch as everything we owned burned to the ground.\"\n\nAll that was left of the caravan were charred remains. Source: GFM\n\nImmeasurable loss as couple left with just charred remains\n\nThe pair were able to save the dogs, which Isabelle said is \"what truly matters\".\n\n\"But the loss is absolutely devastating. We’re still in shock, struggling to process that everything we owned is just gone in an instant,\" she said. Although they escaped unharmed, the ordeal has been crushing.\n\n\"The dogs were really scared,\" she told The Adelaide Advertiser. \"It was pretty hard to watch, they were shaking heaps.\"\n\nIsabelle and parter Dave were just four days into their trip of a lifetime when disaster struck. Source: GFM\n\nWhile the caravan was insured, their policy only covers $1,000 worth of contents, far less than the $25,000 worth of belongings they said they lost. Among the items included cameras, a drone, a Starlink satellite, jewellery, passports, fishing and surf gear, kitchen appliances, clothing and sentimental belongings. The couple spent hours searching through the debris, but the only distinguishable items were a burnt passport and a Valentine’s Day photo album.\n\nADVERTISEMENT\n\nThe tragedy has been especially difficult given the couple’s recent struggles. Before embarking on their trip, they said they had lost their business \"due to non-payment from an interstate company\". Despite winning a lengthy legal battle, they received nothing when the company was found to have no assets to liquidate.\n\nThe couple and their three dogs escaped unscathed, but lost everything they owned. Source: GFM\n\nThe young Australians estimate the contents inside were worth a total of $25,000. Source: GFM\n\n\"This trip was meant to be a fresh start for us,\" the couple said. \"We chose to turn that hardship into something positive by embarking on a trip in our caravan, only for this to happen.\"\n\nNow, they are seeking help to rebuild their lives through the online fundraiser.\n\nADVERTISEMENT\n\n\"We are hoping to raise funds to help replace some of what was lost. We went to Kmart to purchase some clothes and toiletries as we were literally left with what was on our backs. We have booked an Airbnb for a few days to figure out our next steps, and while we await advice from the insurance company. Any support — whether donating or sharing — means the world to us,\" Isabelle said.\n\nDespite everything, they are holding onto what truly matters. \"We’re staying strong and grateful that we and our pups are safe,\" she said.\n\nCaravanners warned after multiple dangerous blazes\n\nEarlier this month in South Australia, another family lost their $175,000 caravan in a blaze at the Auburn Community Caravan Park, after lithium-ion batteries inside caught fire.\n\nSA's Country Fire Service said the occupants spotted smoke \"coming out of the batteries\" before the fire had started. They were able to exit the vehicle safely but it was too late for the caravan.\n\nADVERTISEMENT\n\nTypically, caravans use lithium iron phosphate (LiFePo) batteries rather than lithium-ion (Li-ion) batteries because LiFePo is better suited for the demands of caravan power systems.\n\nStandard lithium-ion batteries are slightly lighter and more energy-dense, which is why they’re used in smartphones and laptops. But as many people pointed out, there are a range of reasons why caravanners might use lithium-ion batteries — including to charge e-mobility devices — but doing so unattended is generally discouraged.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 38
  }
]