[
  {
    "url": "https://www.9news.com.au/national/qantas-federal-court-penalty-illegally-sacking-workers-covid/c8661e2a-43b9-41c2-9958-079ebf9efe50",
    "title": "Qantas fined $90 million for illegally sacking staff",
    "publish_date": "Mon, 18 Aug 2025 00:51:41 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Australia's largest airline has been ordered to pay a landmark penalty of $90 million for what has been dubbed the largest case of illegal sackings in the country's history.\n\nQantas outsourced more than 1800 baggage handlers, cleaners and ground staff in 2020, in a move the Federal Court ruled was designed to curb union bargaining power in wage negotiations.\n\nThe embattled airline's appeal to the High Court was unsuccessful, paving the way for the penalty to be awarded on Monday.\n\nQantas will cop a heavy fine today for illegally sacking more than 1800 workers. (Wolter Peeters/SMH)\n\nThe Transport Workers Union sought the maximum penalty of $121 million, while Qantas urged Justice Michael Lee to impose a \"mid-range\" penalty between $40 million and $80 million.\n\nThe Federal Court judge cited the \"sheer scale of the contraventions, being the largest of their type\" as a reason to impose a penalty that would deter other businesses from similar conduct.\n\nHe ordered Qantas to pay $90 million in penalties, $50 million of which is to be paid directly to the union that brought the proceedings and highlighted the illegal conduct.\n\n\"To deprive someone of work illegally is to deprive someone of an aspect of their human dignity, and this is not assuaged simply by expressions of regret,\" Justice Lee said.\n\nFormer Qantas chief executive Alan Joyce. (Janie Barrett)\n\nHe was scathing about the embattled airline's conduct after the outsourcing, pointing to efforts to place a \"less than candid\" picture of the outsourcing decision before the court.\n\nHe noted Qantas had apologised publicly but then had attempted to deny any compensation payments to the affected workers.\n\nQantas will have to pay the hefty bill on top of a $120 million compensation payment it has made to the affected ground staff for their economic loss, pain and suffering following the outsourcing.\n\nHowever, Justice Lee said he didn't have enough evidence to be convinced those payments would be made.\n\nThe court was told the scandal-plagued airline began to finally accept responsibility for its actions in 2023, Justice Lee noted, which coincided with the departure of former CEO Alan Joyce.\n\nThe courtroom was packed with union members and representatives, who hugged and exchanged smiles after Justice Lee handed down his decision.\n\nIt comes after Qantas also sold tickets to cancelled flights for several years, triggering more legal turmoil and a $100 million fine after it was sued by the Australian Competition and Consumer Commission.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/woman-arrested-after-chemical-device-used-in-nightclub-canberra/a5166d39-c352-4bb4-9f70-ea7f678d654f",
    "title": "Woman charged after allegedly using pepper spray in Canberra nightclub",
    "publish_date": "Mon, 18 Aug 2025 00:18:45 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/bedfordale-murder-charges-laid-over-perth-grandfathers-mystery-carpark-death/66f7efbb-fb9c-4687-9a6f-13b6c72c35db",
    "title": "Murder charges laid over grandfather's mystery carpark death",
    "publish_date": "Sat, 16 Aug 2025 12:12:35 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/ronald-rondell-pink-floyd-stuntman-dies/105666100",
    "title": "Stuntman set on fire for Pink Floyd album cover dies aged 88",
    "publish_date": "Mon, 18 Aug 2025 02:18:54 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Hollywood stuntman Ronnie Rondell Jr, best known for being photographed engulfed in flames for Pink Floyd's Wish You Were Here album, has died at the age of 88.\n\nA care home in the US state of Missouri announced his death on August 12.\n\nRondell performed in numerous films and TV shows, including Star Trek, The Matrix Reloaded and Charlie's Angels.\n\nIn 1970 he co-founded the Stunts Unlimited talent agency to supply stunt performers for Hollywood films.\n\nIn a post on the Stunts Unlimited Facebook page, the company said: \"Our hearts are heavy with the loss of the last of Stunts Unlimited's 3 esteemed founding fathers, Ronnie Rondell.\n\n\"In a class all his own, Ronnie was a generous mentor whose talents set the bar for every aspiring stunt person. He was deeply respected, admired and loved. Ronnie was not just a legend, he was legendary and will be deeply missed.\"\n\nIconic Pink Floyd shot took multiple takes\n\nRonnie Rondell (right) on the Wish You Were Here album cover. (Getty Images: Rahman Hassani/SOPA Images/LightRocket)\n\nRondell was best known for posing as the businessman on fire for Pink Floyd's 1975 album cover Wish You Were Here.\n\nHis suit and hair were covered in flame-retardant gel to save him from injury.\n\nThe photographer who took the iconic shot, Aubrey Powell, later told The Guardian that on the 15th take a gust of wind blew the flames into Rondell's face, burning off part of his moustache.\n\nWish You Were Here topped the album charts in Australia, the US and the UK, and in 2023 ranked 264th on Rolling Stone magazine's list of 500 greatest albums.",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/couple-engaged-after-surprise-proposal-at-roebourne-rodeo/105662238",
    "title": "Sweet moment in WA's Pilbara as couple engaged at inaugural rodeo",
    "publish_date": "Mon, 18 Aug 2025 01:17:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Emma Holten was wondering where her partner Paul Irwin was when she was announced the winner of a prize at the Roebourne Rodeo in Western Australia's Pilbara region.\n\nEmma was worried Paul would miss her big moment.\n\nLittle did she know, it was all part of a bigger plan.\n\n\"Just before my name was announced, Paul had to leave,\" Emma said.\n\n\"My name got called out as the winner and my first thought was, 'Oh, Paul's not going to see me win my prize.'\"\n\nHeart on his sleeve, dust on his knees\n\nWhen Emma went up to the announcers to claim her prize, she turned around and — to her surprise — found Paul bended on one knee, ring in hand.\n\n\"That moment when I turned around and saw Paul on one knee with the ring, it was amazing,\" she said.\n\n\" It was a bit of a blur after that. I sort of lost sight of everyone else and it was just … me and Paul. \"\n\nPaul Irwin says he was confident Emma Holten would accept his proposal. (ABC Pilbara: Kimberley Putland)\n\nWhen asked if he was nervous that Emma would say no in front of thousands, Paul said he had full faith.\n\n\"I didn't have [any] doubts that she was going to say no,\" he said.\n\n\"I was pretty confident it was going to be, 'Yes.'\n\n\"I thought I would do it on our fourth-year anniversary [because] it'd save remembering so many different dates.\"\n\nThe first Roebourne Rodeo drew a crowd of thousands. (ABC Pilbara: Kimberley Putland)\n\nA rodeo of firsts\n\nPaul said it was the first rodeo he had been to.\n\n\"I didn't even know if you were allowed to do it or not, or if it was going to work,\" he said.\n\nRoebourne Rodeo's arena, where Paul Irwin asked Emma Holten to marry him. (ABC Pilbara: Kimberley Putland)\n\nRodeo co-founder Tui Magner said she was happy the couple could have their special moment at the first edition of the Roebourne Rodeo.\n\nMs Magner connected Paul with the event's announcers and DJ to organise the finer details, like playing Emma's favourite song, Luke Combs's Beautiful Crazy, when he proposed.\n\n\"They got on board straight away,\" she said.\n\n\"There was plenty of firsts at that rodeo, being our first, so it was a really nice touch to add to the mix.\n\n\"It was really cool to be asked to do that at our rodeo.\"\n\nSo, will it be a rodeo-themed wedding for the couple?\n\n\"[There's] going to be white cowboy boots as part of my wedding outfit,\" Emma said.\n\n\"So on some level there'll be a country theme.\"",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/wimmera-man-fixes-and-gifts-cars-to-disadvantaged-drivers/105646116",
    "title": "Man fixes cars to gift disadvantaged drivers in memory of his son",
    "publish_date": "Mon, 18 Aug 2025 00:50:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "Wimmera man Gavin \"Bear\" Hynam lost his eldest son, Preston, in an accident just before his 21st birthday in 2008.\n\nAfter years of grief, Mr Hynam began channelling his passion for mentoring young people in the local community by fixing pre-loved cars and gifting them to disadvantaged youths in and around the regional Victorian town of Horsham.\n\n\"I got a little bit of spring back in my step,\" Mr Hynam said.\n\nAs of August this year, the 64-year-old has handed over 19 sets of keys to young locals in need.\n\nChance at better life\n\nThe scheme began in 2017 when Mr Hynam met two refugees who had recently moved to the Wimmera.\n\nHe admired how hard the newcomers worked to build a new life in country Victoria and realised they needed a mode of transport.\n\nA mechanic by trade, Mr Hynam decided he would fix two second-hand cars and gift them to his new friends.\n\nKylie Zanker (left), car recipient Kaitlyn Sommerfield and Gavin Hynam with the fixed-up car. (ABC News: Tamara Clark)\n\n\"They're young men and we're helping them out and making them want to, you know, become part of our community,\" he said.\n\n\"I just said [to his family], 'Well, I'm going to give him a car when they get their licence.'\"\n\nAfter gifting a car each to the two young asylum seeker men, Mr Hynam decided to give away a third car to a South American migrant.\n\nMr Hynam said he became addicted to the joy of seeing good, hard-working people get a chance at a better life.\n\nGifting cars to students in need\n\nFifteen years ago, Mr Hynam began working in the Transport Accident Commission's (TAC) L2P program.\n\nL2P is a Victorian program to help learner drivers get their 120 hours of driving practice, and ultimately, their licence.\n\nSoon after his induction, Mr Hynam realised he could offer Wimmera youth more than just driving advice.\n\n\"I said to my family, I'm going to give away two cars this year to the young people that I'm teaching,\" Mr Hynam said.\n\nGavin Hynam says it's hard to say goodbye to his students, including Chelsea Robinson, once they graduate. (ABC News: Tamara Clark)\n\n'I used to walk everywhere'\n\nChelsea Robinson is an 18-year-old high school student working towards a career in alcohol and drug counselling.\n\nShe lost her relationship with her parents when she was aged six, and lives with her older brother.\n\nAt the start of 2024, social support service Uniting Wimmera engaged Ms Robinson in the L2P program where she met Mr Hynam.\n\n\"To be in that program and have an instructor like Bear, it was a great experience and it was definitely something that I looked forward to every Sunday morning,\" Ms Robinson said.\n\n\"It was more so the things that we spoke about. We connected through a lot of different ways.\"\n\nGavin Hynam gives Chelsea Robinson keys to the car they've been driving. (ABC News: Tamara Clark)\n\nAt the end of their lessons, Ms Robinson successfully completed her licence test, and Mr Hynam gifted her the keys to the car they'd been driving.\n\n\"It felt amazing,\" she said.\n\n\"Without Bear's help, I wouldn't have been able to get my licence or be able to have the car that I do now, so I'm very grateful.\n\n\"I used to walk everywhere and now I don't have to, so it's definitely a very big privilege.\"\n\nYoung mum gains freedom\n\nHorsham woman Kaitlyn Sommerfield is a 23-year-old mother to four-year-old Harper.\n\nBefore Mr Hynam gave Ms Sommerfield her first car, she had to walk her special-needs daughter to appointments.\n\nKaitlyn Sommerfield holds the keys to her first car, donated by Gavin Hynam. (ABC News: Tamara Clark)\n\n\"I needed some help getting [a] car because my daughter might be going to kinder on another side of Horsham,\" Ms Sommerfield said.\n\n\" We just [didn't] go out as much because you know, it's hard to get around. \"\n\nHarper's NDIS support coordinator at Grampians Community Health and Yarriambiack Shire Council Mayor Kylie Zanker called Mr Hynam for help.\n\n\"I could hear the distress [in] Kaitlyn, like, 'How do I get my daughter to those OT appointments, to speech, to physio?' to all of the things that she needs,\" Ms Zanker said.\n\nKylie Zanker says she is overwhelmed by Gavin Hynam's generosity. (ABC News: Tamara Clark)\n\n'Amazing community spirit'\n\nCoincidentally, less than an hour before Ms Zanker's call, Mr Hynam had purchased an elderly community member's car for about $2,500.\n\nHe immediately began preparing the vehicle for Ms Sommerfield.\n\n\"He's just the most amazing human. He truly is. He's so humble,\" Ms Zanker said.\n\n\"Bear just has the biggest heart and the most amazing community spirit … it obviously helps Kaitlyn, but it also affects her daughter, Harper.\n\n\" So, it's not one life that Bear's touched, it's two. \"\n\nGavin Hynam tells Kylie Zanker and Kaitlyn Sommerfield: \"Part of this must have come from Preston, my son.\" (ABC News: Tamara Clark)\n\nMr Hynam has spent about $20,000 of his own money on the scheme.\n\nThe community also raised about $8,000 for him, which lasted a couple of years.\n\nChelsea Robinson leaving Gavin Hynam's garage in the car he gifted her. (ABC News: Tamara Clark)\n\nMr Hynam said he had been forced to keep using his own money to fund the scheme — even though it's running low.\n\n\"I've never known a person to give so selflessly, whether it's L2P driving, or with youth and teaching them, you know, mechanical skills, gifting cars,\" Ms Zanker said.\n\n\"I know of four people who've gotten to university and two people who've gotten jobs, and are able to hold down employment because of Bear's generosity.\"\n\nMr Hynam says he is driven by the memory of his son.\n\n\"Part of this must have come from Preston, my son, who's no longer with us,\" he said.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/qantas-fined-in-federal-court-job-outsourcing-penalty/105659978",
    "title": "'Wrong kind of sorry': Qantas fined $90 million penalty for illegally outsourcing jobs",
    "publish_date": "Mon, 18 Aug 2025 00:40:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Airline giant Qantas will face a $90 million penalty over its decision to illegally outsource more than 1,800 ground handling jobs during the COVID pandemic.\n\nFederal Court Justice Michael Lee said on Monday the penalty must \"bear some resemblance\" to the maximum $121 million — and should be no less than $90 million, which is 75 per cent of the maximum.\n\nHe said $50 million of the penalty should be paid to the Transport Workers Union (TWU).\n\nHow the remaining $40 million balance will be paid - and whether it will go to workers - will be decided at a later hearing.\n\nIt follows a 2020 decision by Qantas to outsource its ground handling workforce, which the Federal Court later found to be illegal.\n\nThe TWU had called for the airline to be fined a maximum of $121 million, in addition to the $120 million in compensation it's required to pay the affected employees.\n\nQantas had argued the court instead impose a \"mid-range\" penalty between $40 million and $80 million.\n\nJustice Lee said Qantas had shown the \"wrong kind of sorry\", whereby it worried more about the impact on the company rather than the impact the case had on the illegally sacked workers.\n\nHe noted that that the airline's chief people officer, Catherine Walsh, apologised for the company's behaviour during hearings, but \"it seemed to be obvious that the person who could give the most direct and compelling evidence of corporate change and contrition\" was CEO Vanessa Hudson.\n\nQantas CEO Vanessa Hudson has apologised to sacked workers but only after Qantas mounted legal action and lost. (AAP: Bianca De Marchi)\n\n\"I accept that Miss Walsh is a sincere and competent professional who will do her personal best to prevent a re-occurrence of contravening conduct. As the person responsible for industrial relations, she now reports directly to the CEO,\" Justice Lee said.\n\n\"But given the extent of the cultural problem revealed by this case, I would have been much more persuaded (about) the genuineness of contrition if her evidence had been supplemented by a member of senior management who was present when the proposal was socialised and evaluated, and explained why things went so wrong, how they had been converted in new ways of doing things, and how lessons have been learnt.\n\n\"Time will only tell whether the undoubted good intentions of Miss Walsh will prevail. The scope of the task … not to be underestimated.\n\n\"The strategy adopted by Qantas at the compensation hearing rather suggested an industrial relations culture that has very deep, very deep roots. Despite high level representations of change following the departure of some key personnel in 2023.\"\n\nJustice Lee said while Qantas ended up later expressing \"genuine regrets\", that \"this more likely reflects the damage this case has done at the company rather than unique remorse for the damage done to the affected workers\".\n\nHe said the airline \"resisted until it could resist no more\".\n\n\"And, as on multiple occasions prior to this hearing, sought to explain the way as representing no moral or ethical failure.\"\n\nRecord penalty shows 'courts won't tolerate blatant attacks on workers' rights'\n\nMaurice Blackburn Lawyers principal Josh Bornstein said the penalty is the biggest ever ordered by a court for violations of industrial relations laws in Australian history, and meant corporate Australia was on notice that courts \"would not tolerate blatant attacks on workers' rights\".\n\n\"This record-breaking penalty reflects the monumental scale of Qantas's wrongdoing and the court's concern that Qantas and the business community need to understand that calculated, mass violations of workplace laws may result in severe financial punishment,\" Mr Bornstein said.\n\nMichael Kaine and Josh Bornstein outside the court. (ABC News: John Gunn)\n\nHe said Qantas, under former CEO Alan Joyce's leadership, \"seized the opportunity presented by the COVID pandemic to realise its long-held aim — to rid its operations of the TWU and its members working as baggage handlers and ground staff\".\n\n\"This was a carefully planned and executed union-busting operation,\" Mr Bornstein said.\n\n\"Qantas worked for months on its plan to try and avoid an adverse outcome in a legal challenge. Qantas tried to hide the involvement of Alan Joyce in the plan. The plan fell apart once Qantas had to hand over documents and its executives were cross examined in the Federal Court.\"\n\nHe said the payment of the penalty to the TWU reflects the risks it took to pursue the case on behalf of its members and other employees of Qantas, and \"should encourage others to pursue compliance with industrial relations laws\".\n\nTWU national secretary Michael Kaine said in 2020 more than 1,800 Qantas workers took on a \"huge and audacious battle\" against the airline.\n\n\"Today's decision is a final win for both those workers and the tens of thousands of other TWU members who backed them every step of the way,\" he said.\n\n\"These were committed Qantas workers who had done nothing wrong and had loyally served this company, in many cases for decades.\n\n\" They [Qantas workers] weren't just sacked, they were told by Qantas that they were delusional for questioning it. This ruthless, self-interested and illegal calculation to kick them to the curb has rightfully merited the largest ever penalty of its kind. \"\n\nHe said the $90 million penalty was a \"message to corporate Australia that workers will stand up for what's right\".\n\nLabor senator Tony Sheldon said the case \"now marks three major legal defeats for Qantas in recent years — a deeply damning pattern\".\n\n\"The courts have found it unlawfully stood down a union health and safety rep for raising COVID concerns, illegally sacked its ground crew, and now must be penalised for breaching the Fair Work Act,\" Senator Sheldon noted.\n\nIn May 2024, Qantas faced a $100 million penalty for misleading customers by selling tickets to flights that had already been cancelled. The airline was sued by the Australian Competition and Consumer Commission (ACCC).\n\nIn November 2023, Qantas was found guilty of illegally standing down worker Theo Seremetidis who had raised concerns about COVID-19 risk to staff who were cleaning aircraft arriving from China in the early phases of the pandemic.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/wallabies-braced-for-springboks-after-ellis-park-comeback/105666136",
    "title": "Wallabies braced for 'punch in the face' from Springboks",
    "publish_date": "Mon, 18 Aug 2025 00:03:20 +0000",
    "category": "sports",
    "authors": [],
    "text": "Under no illusions, Australia are bracing for some fierce backlash from South Africa in the two sides' return Rugby Championship stoush in Cape Town.\n\nWhile delighted with his side's resilience and growing belief shown in Saturday's colossal comeback win over the back-to-back world champions in Johannesburg, Wallabies coach Joe Schmidt is not getting carried away.\n\nHe believes the Springboks took their foot off the pedal after motoring to a 22-0 lead inside 18 minutes before succumbing to the Wallabies at Ellis Park for the first time since 1963.\n\n\"I've coached enough teams because I'm really old,\" the 60-year-old Kiwi said.\n\n\"I've had teams who got a very, very rapid start. It can sometimes just cause a bit of a lapse in effort and concentration. I think they just gave us a little bit of belief.\n\n\"As well as [man of the match] Fraser [McReight] did and the other players did, we were probably a little bit lucky because Pieter-Steph [du Toit] at one stage just went to pick and go and he just knocked it on.\"\n\nDylan Pietsch scores at Ellis Park. (AP: Frans Lombard)\n\nSchmidt said it was unlikely the Springboks would repeat such mistakes next weekend.\n\n\"There were a couple of uncharacteristic errors from the Springboks where, I think next week, if they pick and go there, he [du Toit] is such a powerful, athletic man, he will be a handful,\" he said.\n\n\"It was probably a mix of us and a little bit of inaccuracy from the Springboks because when they were accurate, you saw that first 20 minutes.\n\n\"I saw wave after wave and even that very first drive was impressive.\n\n\"We probably got a little bit lucky, even when Andre [Esterhuizen] went down the left-hand touch a couple of times.\n\n\"One of the times, [Wallaby] Tom Wright went 70 metres and scored at the other end.\"\n\nSchmidt says the Wallabies cannot expect a repeat of the Springboks' second-half lapse when the two teams meet again next Sunday morning (AEST).\n\n\"We know that pressure is coming,\" he said.\n\n\"I've coached against the Boks with a few other international teams and come out second.\n\n\"I know whether they're favourites or not, they're a heck of a team.\"\n\nThe Wallabies bench celebrates during the Ellis Park comeback. (Getty Images: Gallo Images/Sydney Seshibedi)\n\nLock Will Skelton and veteran flyhalf James O'Connor revealed the Wallabies quietly celebrated while also reviewing the epic 38-22 triumph on laptops, knowing full well the Boks would likely respond in ruthless fashion.\n\n\"A lot of the boys are already onto next week. The boys are reviewing, everyone's clipping stuff,\" Skelton said.\n\n\"We know what's going to come. They're going to try and punch you in the face this week.\n\n\"So we're going to have to have a good week of preparation again and really fight until the end.\"\n\nAfter playing a lead role in his first Test since 2022, 35-year-old O'Connor said the Wallabies \"enjoyed each other's company\" but were not getting carried away.\n\n\"That's the thing about rugby — you're already on to next week. I know my mind went there,\" he said.\n\n\"I thought straight away, 'What are they going to be coming with — 6-2 bench, back to basics, bomb squad, aerial contest?\n\n\"They're going to meet us in the trenches there, so I'm already thinking about what's coming and then just focusing on recovery.\"\n\nWith winger Dylan Pietsch (broken jaw), utility back Ben Donaldson (abductor muscle) and prop James Slipper (concussion) all returning home, Filipo Daugunu, Hamish Stewart and Rhys van Nek will fly to South Africa to join the Wallabies.\n\nAAP",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/outback-queensland-flood-recovery-continues/105636198",
    "title": "From washed out to weathering on, stock losses cut deep in outback Qld",
    "publish_date": "Sun, 17 Aug 2025 23:50:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "It took just days for a lifetime of work to wash away as swollen rivers and creeks became an inland ocean across outback Queensland.\n\nReaders are advised this story contains distressing content.\n\nIn March and April, widespread flooding tore through an area twice the size of Victoria, leaving devastation in its wake.\n\nGraziers like Brendan Murray, from Eromanga, were left questioning their future in the industry they dedicated their lives to.\n\nBrendan Murray's Eromanga property was hit with large rainfall totals and widespread flooding in March 2025. (ABC Landline: Cameron Lang)\n\n\"We're the custodians of our stock,\" Mr Murray said.\n\n\" That's our job to keep them safe and well. \"\n\nFor days, helicopters dropped Mr Murray and his son Henry into paddocks across his property Tallyabra, and they walked stock from flooded areas to higher ground.\n\nBrendan Murray lost two thirds of his merino sheep flock. (Supplied: Henry Murray)\n\nHe estimates they lost 6,000 merino sheep in full wool.\n\n\"A lot of the sheep … just couldn't live it out neck deep in water for five days,\" he said.\n\nFifty-six kilometres of the Murrays' exclusion fencing was severely damaged or washed away as well as internal fencing.\n\nIt took just over a month to repair or replace damaged fencing at Tallyabra after the floods. (ABC Landline: Cameron Lang)\n\n\"They were all on the ground,\" he said.\n\n\"From one end of the paddock to the other.\"\n\nIn 16 weeks, the Murrays worked as quickly as they could to rebuild fences for agistment stock.\n\n\"We needed cash flow,\" he said.\n\n\"We have to have stock on.\"\n\nWhile the landscape is recovering, some areas have major erosion and scarring. (ABC Landline: Cameron Lang)\n\nStock are now back grazing in the scarred paddocks and Mr Murray is focusing on the positives.\n\n\"We have heaps of feed,\" he said.\n\n\" I would prefer it to be our missing 6,000 sheep munching on grass … but there's positives in it. \"\n\nTallyabra Station received 520 millimetres of rain in just eight days, more than double the average yearly total. (ABC Landline: Cameron Lang)\n\nLosses 'cut deep'\n\nSouth-west of Eromanga, at Nockatunga Station, grazier Linda Evans said her family still didn't know how many head of cattle they had lost.\n\nAs water rushed across the large and isolated property, it swept away livestock, horses and native animals.\n\nIt was nothing like she'd seen before.\n\nDuring the peak of the flood, water reached the gate of the Evans's backyard. (Supplied: Michelle Rizzotto)\n\n\"The noise of the water roaring was astronomical,\" Mrs Evans said.\n\n\" It was beautiful in a way, but it was terrifying as well. \"\n\nThe latest figures from the Department of Primary Industries indicate 110,000 head of livestock are confirmed dead and almost as many are still missing or unaccounted for.\n\nThe family lost most of their stud horses, as well as a beloved pony that belonged to Mrs Evans's granddaughter.\n\nThe Evans family lost 20 of their stud horses, as well as their granddaughter Bella's pony. (ABC Landline: Cameron Lang)\n\nIn the days that followed, Mrs Evans busied herself planning the Eromanga Rodeo, an event scheduled for two weeks after the floods hit.\n\nShe said it was vital for the community that it went ahead.\n\n\"Mental health is probably one of the biggest issues in the bush,\" she said.\n\n\"So being able to provide an event that brought people together and gave them a chance to talk … and realise I'm not the only person in this boat [was so important].\n\nThe Eromanga Rodeo was an important community event in the weeks following the floods. (ABC Western Qld: Julia Andre)\n\n\" We're here, we're all doing it tough but we've got one another's back. \"\n\nFor Mrs Evans, witnessing the landscape recover and transform has been healing.\n\n\"It's mind blowing,\" she said.\n\n\"It's the reason we do what we do and it's a very special thing to see.\n\n\"It's God's country and it's turned it on right now.\"\n\nTourism helps community rebuild\n\nIt's not just Eromanga that's benefited from community events bringing everyone together.\n\nThe tight-knit community of Thargomindah is still in the thick of recovery, but has welcomed much needed tourism back into the area.\n\nSince the town reopened, there have been three major events bringing thousands of tourists into the region.\n\nHundreds of tourists flocked to Thargomindah in July for the annual Music Muster. (ABC Landline: Cameron Lang)\n\nBulloo Shire disaster coordinator Tamie Warner said the visitors had helped boost morale in town.\n\n\"It gives people something else to focus on,\" Ms Warner said.\n\n'The flood itself brought people here to see us and see how we're recovering.\n\n\"People have been so patient and understanding.\"\n\nThe Bulloo River starts hundreds of kilometres from Thargomindah and runs past towns like Quilpie and Adavale. (ABC Landline: Cameron Lang)\n\nFramed by the Bulloo River, the town has dealt with big floods in the past.\n\nIn 1974, the river reached 6.78 metres and became the benchmark for all future floods.\n\nThe town's unofficial flood marker, a street sign, shows water reached 8m this year.\n\nA street sign pole at the edge of town became the official flood marker during the floods. (ABC Landline: Cameron Lang)\n\nMonths on and Ms Warner said it would take a while for the town to rebuild.\n\n\"We know logistically it's a hard place,\" she said.\n\n\" There are only three or four builders and they've got a whole town to rebuild. \"\n\nTamie Warner says locals are resilient. (ABC Landline: Cameron Lang)\n\nBut Ms Warner said locals wanted to look to the future, rather than dwell on the past.\n\n\"We are an extremely resilient community,\" she said.\n\n\"We've bounced back pretty well … we got our businesses open straight away.\"\n\nFriends lend a helping hand\n\nJust outside of Thargomindah at Picarilli Station, Gerda and Anthony Glasson were feeling helpless.\n\nBeing on a sheep station isolated by floodwaters, there wasn't anything they could do in town, so the pair started the Fridge for a Friend initiative.\n\nIt enabled people from anywhere in the country to purchase a fridge or washing machine for a resident.\n\n\"All you want to do is help your mates,\" Mrs Glasson said.\n\nGerda Glasson wanted to find a way to help her local community during the floods. (ABC Landline: Cameron Lang)\n\nShe'd hoped they'd get enough to cover Thargomindah, but there were so many donations they were able to expand to Adavale, Eulo, Hungerford, Jundah, Quilpie and surrounding areas.\n\nFridges and washing machines were hand delivered for flood-affected communities. (ABC Landline: Cameron Lang/Supplied: Gerda Glasson)\n\nIn the end, 96 fridges and 98 washing machines were purchased and delivered across western Queensland.\n\n\"It has reminded people of how much others care about you,\" Mrs Glasson said.\n\n\" People look out for each other and there's a lot of good, a lot of good people. \"\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/izak-rankine-adelaide-crows-investigation-for-alleged-incident/105665840",
    "title": "Crows star Rankine facing AFL investigation for alleged on-field incident",
    "publish_date": "Sun, 17 Aug 2025 23:06:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "The AFL's integrity unit is looking into an alleged incident involving Adelaide Crows star Izak Rankine.\n\nReports on Sunday night suggested Rankine was set to face investigation for allegedly using a homophobic slur during the Crows' game against Collingwood on Saturday.\n\nOn Monday, the AFL confirmed it was aware of an alleged matter and that the integrity unit was making enquiries.\n\nAn Adelaide spokesperson said the club is \"aware of an alleged matter involving one of our players\" and confirmed ongoing discussions with the AFL.\n\nCrows captain Jordan Dawson was stopped before training on Monday morning, and said the club would wait for the AFL's verdict.\n\n\"It's not ideal but it's obviously in the AFL's hands and we'll let them investigate it and see what happens,\" Dawson said.\n\n\"We'll wait and see but we'll leave it up to the AFL to go through what they have to go through.\"\n\nIf found guilty, Rankine — one of the league-leading Crows' key players — could be at risk of missing the rest of the AFL season.\n\nWest Coast's Jack Graham was suspended for four games for use of a homophobic slur in an AFL game earlier this year, while Sydney's Riak Andrew received a five-game ban for the same offence in a VFL match.\n\nAdelaide faces North Melbourne in its final home and away game on Saturday, looking to secure the minor premiership.\n\nAfter that, the Crows will play at least two finals, and possibly as many as four should they take the long route to the grand final.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/kalgoorlie-remembers-former-federal-mp-graeme-campbell/105662674",
    "title": "Kalgoorlie's 'maverick' politician Graeme Campbell dies aged 86",
    "publish_date": "Sun, 17 Aug 2025 22:58:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "Former member for the West Australian federal seat of Kalgoorlie Graeme Campbell has died, aged 86.\n\nHis family posted on social media that he died early Saturday morning at Kalgoorlie Regional Hospital.\n\nMr Campbell entered politics as a member of the Labor Party after a career as a pastoralist on the remote Nullarbor Plain.\n\nHe went on to serve as the member for Kalgoorlie for 18 years, and is remembered by contemporaries as a \"colourful\" political maverick.\n\nGraeme Campbell worked on stations along the Nullarbor before founding his own. (Supplied: Ainsley Campbell)\n\nFrom pastoralist to politician\n\nOriginally from Oxfordshire in England, Mr Campbell's family emigrated to Australia when he was a child.\n\nHe grew up in South Australia and went on to establish Kybo Station, a remote pastoral property on the sparse Nullarbor, with his brother Rod Campbell.\n\nGraeme Campbell (left) and Rod Campbell (third from left) established Kybo Station. (Supplied: Ainsley Campbell)\n\nIt was at Kybo he met his wife Michele Lelievre, now Campbell, a French woman who had stopped at the station while on a trip around Australia.\n\nMs Campbell told the ABC in 2018 she had heard about the Campbell brothers long before heading towards the Nullarbor Plain.\n\n\"We made a point of trying to find these chaps, who were apparently a bit different and interesting,\" she said.\n\nMichele and Graeme Campbell met on a remote sheep station on the Nullarbor in 1972. (Supplied: Michele Campbell)\n\n\"I looked at him and thought, 'Definitely, I will stay,' so that was how I met him.\"\n\nThe couple later married and moved to Kalgoorlie, where Mr Campbell worked in mining before turning his attention to politics.\n\nA 'maverick' in politics\n\nMr Campbell joined the Labor Party in 1980, and was elected as the federal member for Kalgoorlie, a position he held for 17 years and 11 months.\n\nHe was known for his pro-mining and anti-immigration views.\n\nIn 1988, he challenged then prime minister Paul Keating and crossed the floor in opposition to the government's plan to remove company tax exemptions from gold miners.\n\nFormer member for O'Connor, Tony Crook, said the move cemented Mr Campbell as a man of the people.\n\n\"What I love most is he was prepared to represent his constituents first and foremost,\" he said.\n\nTony Crook says despite holding differing views, Graham Campbell's career in politics inspired him. (ABC Goldfields-Esperance: Nathan Morris)\n\nMr Campbell was disendorsed by the Labor Party for his outspoken views, and resigned from the party just prior to the 1996 election.\n\nHe went on to run as an independent and won, retaining his seat for another two years.\n\nGraeme Campbell was disendorsed by the Labor Party but ran as an independent. (Supplied: Ainsley Campbell)\n\nIn a statement to the ABC, Mr Campbell's family said winning the 1996 election as an independent was one of his proudest moments.\n\n\"Graeme found special connection to the people of regional Western Australia. \"He was deeply honoured to be able to represent his people as the federal member for the seat of Kalgoorlie.\"\n\nMr Crook said Mr Campbell's \"maverick\" style left an incredible legacy in Kalgoorlie politics.\n\n\"For Graeme to leave [the Labor Party] and win the federal seat as an independent was huge,\" he said.\n\n\"That was why I crossed the floor as many times as I did [in my own career].\"\n\nA change maker until the end\n\nMember for Kalgoorlie Ali Kent agreed Mr Campbell's \"maverick\" label was warranted.\n\n\"He was a very bright and colourful character,\" she said.\n\nAli Kent says she first met Graeme Campbell when she moved to Kalgoorlie in 1993. (Supplied: Ali Kent)\n\n\"He liked not ever conforming, he always liked to have his own way of doing things.\"\n\nMs Kent said Mr Campbell's passion for local issues continued after he left politics.\n\n\"Right to the end, he would be at the voting booths … he would always want to have a conversation with you,\" she said.\n\nGraeme Campbell's family says he continued to make changes where he could. (Supplied: Ainsley Campbell)\n\nA 'straight up and down' bloke\n\nBoulder resident and former chair of the Goldfields Transport Board, Doug Daws, first met Mr Campbell when he was in the Transport Workers Union and the pair came to loggerheads.\n\n\"It was probably a very colourful discussion if you could listen to it now,\" he said.\n\nMr Daws said despite their disagreements, they went on to become good friends.\n\n\"Graham was a great arguer for better things for the Goldfields … and sometimes it wasn't easy for him to do that,\" he said.\n\nDoug Daws says he first met Graeme Campbell in the early 1980s and they became friends. (ABC Goldfields: Tara De Langrafft)\n\nHe remembered fondly when Mr Campbell was meant to be promoting a prospective emu leather and meat farm near Wiluna.\n\n\"He came to a meeting with a pair of these [emu leather] shoes on and he told everybody … they were the most uncomfortable shoes he's ever worn in his life,\" Mr Daws said.\n\nGraeme Campbell was straight up and down and told you how it was, Doug Daws says. (Supplied: Ainsley Campbell)\n\n\" That was Graeme, he was very forthright, straight up and down. \"\n\nMr Daws said Mr Campbell would be remembered for his tenacity and passion for the Goldfields.\n\n\"He picked up causes and fought for them valiantly, sometimes against overwhelming odds … and his efforts are well recorded in the Hansard of federal parliament,\" he said.\n\nGraeme Campbell is survived by his wife Michele and two sons, Ainsley and Leyland. (Supplied: Ainsley Campbell)\n\n\"He was a very able representative of this district [and] he was a hell of a good bloke.\n\n\"He'll be sadly missed.\"\n\nMr Campbell leaves behind his wife Michele and two sons, Ainsley and Leyland, who said they were overwhelmed with the outpouring of community sentiment.\n\n\"We are honoured and thankful to have had him as our husband and father,\" the family statement read.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/salmon-farm-workers-disappointed-by-pause-on-industry/105664052",
    "title": "'No industry is safe': Salmon workers respond to halt on fish farm growth",
    "publish_date": "Sun, 17 Aug 2025 22:46:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "The suspension on the expansion of salmon farms in Tasmania has brought uncertainty to workers, who say the premier has walked back support he guaranteed just weeks earlier.\n\nThe Tasmanian government has announced it will launch an independent review of the industry's sustainability and environmental impact, during which there will be a \"pause on marine expansion of the industry\".\n\nTasmanian salmon farms expansion plans on pause Photo shows Salmon pens and a boat in waters near a coastline. The Tasmanian government will halt marine expansion of the salmon industry in local waterways while an independent review is ordered.\n\nSalmon farms continue to grapple with the bacterial disease piscirickettsia salmonis, which led to an unprecedented mass mortality event in 2024, with the government currently seeking emergency approval for a new antibiotic to tackle the disease.\n\nTassal diver Oliver Brewer said he and other workers will not shy away from a review, but \"being used as a political tool to appease Greens and Independents\" had brought uncertainty for them.\n\n\"I have full faith in my industry that it will do the right thing and any review will have a positive outcome,\" Mr Brewer said.\n\nMarine expansion of the salmon industry in Tasmania will be halted while the independent review takes place. (Supplied: Bob Brown Foundation)\n\nThe decision to review the industry and halt its growth comes after a letter Premier Jeremy Rockliff sent to the industry on July 2, which said a re-elected Liberal government would \"not introduce moratoriums, bans or arbitrary caps on industry growth and will consider the science and sustainability of any proposal\".\n\nThe letter also said the Liberals would \"not trade the salmon industry in any way, shape or form in order to retain government\".\n\nIt also follows last week's government announcement to phase out the greyhound industry — which came after the party said it was committed to \"support the longevity and sustainability of the racing industry\".\n\nMr Brewer said it was difficult to see broader support for his industry wane over recent years.\n\n\"It's always a shame to see that we're ridiculed for the work that we do, and our industry is ridiculed for the work that we do, and it's normally coming from a rather-baseless place where the science is not backing that up,\" he said.\n\n\"And it's always a shame to see that community support, you know, does dwindle sometimes.\"\n\nSalmon Tasmania chief executive John Whittington said he became aware that Mr Rockliff's position on salmon farming had changed the night before it was announced — calling it \"a shameless sellout\".\n\n\"The premier's words are worthless and clearly no industry is safe,\" Dr Whittington said.\n\nJohn Whittington says the \"shameless\" announcement shows the premier's words are \"worthless\". (ABC News: Madeleine Rojahn)\n\nReview should be 'embraced', premier says\n\nMr Rockliff said his government's plan aimed to \"ensure community sentiment and confidence increased in the industry\".\n\n\"This is not something the industry should fear. It's actually something the industry should embrace,\" Mr Rockliff said.\n\n\" Embrace the fact that we are wanting to support the industry become better. \"\n\nJeremy Rockliff says salmon farming has a \"positive future\" in Tasmania, despite the review. (ABC News: Mackenzie Heard)\n\nHe said his government believed the industry had a \"positive future\" in Tasmania.\n\nTasmanian salmon industry wants fast-track approval for antibiotic Photo shows Atlantic salmon swimming in an underwater pen. The Tasmanian salmon industry is hoping to get approval within weeks to use another antibiotic to treat farmed salmon, as it continues to grapple with an endemic bacterial disease.\n\n\"But we need to continually learn, and we have based our salmon policy over the course of the last decade on continuous improvement.\"\n\nLabor has not backed the moratorium or review, with Primary Industries spokesperson Janie Finlay criticising Mr Rockliff for another policy backflip.\n\n\"[The] salmon announcement isn't about good governance or environmental protection — it's about one man saying anything to cling to power,\" she said.\n\n\"Great Tasmanians, good Tasmanians that are working hard for our economy, working hard for our state, working hard for their families and their communities have been completely tossed aside.\"\n\nJanie Finlay says the salmon farming review shows the premier is \"saying anything to cling to power\". (ABC News: Bec Pridham)\n\nThis reaction by Labor was deemed reasonable by Greens leader Rosalie Woodruff, whose party, with five elected crossbench members, holds the balance of power.\n\n\"That's fair, but what is Labor going to do? What is a genuine trustworthy announcement from Labor to clean up fish farming?\"\n\n'Pause' doesn't go far enough\n\nThe Bob Brown Foundation's Alistair Allan urged that an \"unequivocal commitment\" was needed to remove fish farms from Tasmanian waterways.\n\nMr Allan said the review was a \"cynical ploy that does nothing to protect Tasmania's environment from the environmental nightmare that is fish farms\" — and Tasmanians had seen an industry \"pause\" before.\n\n\"In 2021 [Liberal MP] Guy Barnett announced a pause, [and then] 12 months later the expansion continues,\" he said.\n\nAlistair Allan says similar pauses have taken place in the past, with little benefit for Tasmania's marine environment. (Supplied: Bob Brown Foundation)\n\nMr Allan also cited a 2022 parliamentary inquiry report that recommended a pause on expansion and a reduction of inshore finfish farms, with priority given to \"ceasing operations in sensitive, sheltered and biodiverse areas\".\n\n\"This announcement does nothing to address that,\" Mr Allan said.\n\nLoading...\n\nIndependent MP Peter George, along with Independent MP Craig Garland, proposed the moratorium, and said he was still seeking more details on Mr Rockliff's plan.\n\n\"What we can't afford to do is have a pause, have an inquiry, and then have the government totally ignore it. We need to get some undertakings that this inquiry will be treated seriously and its recommendations acted on.\"\n\nMr George was asked to respond to workers upset at being used as \"a political tool\" in Tasmania's minority government, made up of largely progressive crossbenchers.\n\nPeter George wants to ensure the government doesn't \"totally ignore\" the findings and recommendations from the inquiry. (ABC News: Sophie Jaggers)\n\nHe said he did not want to see jobs threatened.\n\n\"Workers are being made a political football not by people who want to rein in the damage that the fish farm industry does to our waterways,\" he said.\n\n\"Their fears have been increased by the salmon companies in their political effort to continue to increase their profit. It is the multinationals, that have driven the fear.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/paramedics-adapt-to-work-life-on-the-ice-in-perisher-valley/105636820",
    "title": "Snow fleet helps paramedics treat injured patients on the slopes",
    "publish_date": "Sun, 17 Aug 2025 22:25:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "As skiers and snowboarders make their way up the snow-covered mountains at Perisher Valley, a nearby team of paramedics keeps a watchful eye.\n\nNot far from the Front Valley sits a NSW Ambulance station surrounded by snow.\n\nIn the distance, a skier is spotted taking a tumble.\n\nThey get back up and dust off the snow before continuing down the slope.\n\nIt's a reminder of how dangerous ski fields can be.\n\nSeveral injuries and, tragically, one death, have been reported on the slopes this winter.\n\n\"We're up over 90 incidents, both within the resort and back country jobs,\" said Mark Gibbs, NSW Ambulance's associate director of southern sector.\n\nHe said the start to the season was probably one of the busiest.\n\nNSW Ambulance at Perisher Valley responds to about 200 incidents over a winter season. (ABC South East NSW: Floss Adams)\n\nThere has been a dedicated, seasonal team of paramedics based at Perisher Valley since 1986, and for good reason too.\n\nThey respond to an average of 200 jobs each winter.\n\nThis year, about 20 paramedics have worked in rotation at Perisher, with eight days on, six days off.\n\nMost typically work from 8am to 6pm, but they remain on call in case there are jobs overnight.\n\nThe ambulance station at Perisher opened in 1986. (Supplied: NSW Ambulance)\n\nThose stationed on the mountain live in a share-house together but can go home on their days off.\n\nSome paramedics are working here the full three months, others a few weeks.\n\nIt's a sought-after assignment.\n\n\"It's a very, very selective process, and very competitive. There's lots of staff that are looking to come here,\" Mr Gibbs said.\n\n\"That's why we have quite a stringent assessment to identify the right people with the right skill set.\"\n\nMark Gibbs says there is a tough selection process for paramedics who are stationed in the alps. (ABC South East NSW: Floss Adams)\n\nLife on the ice\n\nSome paramedics here have 25 years of experience working in the alps, but there are some fresh faces too.\n\nTrainee Charles Milne, 31, has been a paramedic for 10 years.\n\nCharles Milne says the snow is a challenging environment for treating patients in. (ABC South East NSW: Floss Adams)\n\nHe's normally based in Wagga Wagga, but is working in the snow for the first time.\n\n\"The medicine remains the same, but we have to adapt it to a challenging environment,\" he said.\n\n\" We're dealing with patients that are cold, patients that are fatigued, and obviously the weather. \"\n\nParamedics respond to a range of incidents including broken legs, heart attacks and collisions between skiers. (ABC South East NSW: Floss Adams)\n\nMr Milne is not fully out of his comfort zone in the alps, given he's an experienced snowboarder.\n\nBut he underwent an extensive induction process to prepare himself for the job, including back country training, avalanche training as well as specialist over-snow vehicle training.\n\nThe team at Perisher have just received four new snowmobiles to replace older models and they have been integral to accessing injured patients quickly.\n\n\"The snowmobiles allow our teams to get to the patients in, like a rapid responder, like a motorbike,\" Mr Gibbs said.\n\n\"It's to get to the patients in a timely manner.\"\n\nThe Perisher Ambulance Station has received four new snow mobiles. (ABC South East NSW: Adriane Reardon)\n\nVital fleet\n\nAlong with the four snowmobiles, paramedics also have access to two 4WD vehicles, and two larger over-snow vehicles.\n\nOne is a snowcat, also known as The Kassbohrer, while the other, The Hagglund, is an all-terrain carrier on lease from Antarctica.\n\nThe fleet is vital to accessing not only the main slopes, but the back country too.\n\nThe Hagglund (pictured) and The Kassbohrer are used by paramedics to transport patients in the snow. (ABC South East NSW: Floss Adams)\n\n\"One of my first cases was a gentleman that had injured himself cross-country skiing up near Porcupine Rocks,\" Mr Milne said.\n\n\"The first responders went out on the snowmobiles, reached the patient and then determined that we were going to bring them back in the over-snow vehicle.\n\n\"We see a lot of fractured legs, a lot of fractured arms … as well as heart attacks and strokes.\n\n\"Broken legs is probably the thing we've seen the most this week.\n\n\" The snow can be dangerous at times. \"\n\nCharles Milne has adapted to work life in the snow. (ABC South East NSW: Floss Adams)\n\nAmid the challenges of the job, the paramedics are finding the reward in helping others.\n\n\"When family members meet us at the bottom of the hill or as we're loading into the ambulance, there's lots of thanks,\" Mr Milne said.\n\n\"Up here, people are on holidays, so it's that added stress for them.\n\n\"When we're able to take that stress away and tell them that their relative is going to be OK and that we're going to get them off to the care they need, that's hugely beneficial.\"\n\nParamedics say the job is challenging and rewarding. (ABC South East NSW: Floss Adams)",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/federal-politics-live-blog-august-18/105665570",
    "title": "Live: Summit to inform 'next three budgets', Chalmers says",
    "publish_date": "Sun, 17 Aug 2025 22:17:52 +0000",
    "category": "finance",
    "authors": [
      "Joshua Boscaini",
      "Maani Truu",
      "Courtney Gould"
    ],
    "text": "Australian Council of Social Service Cassandra Golding says fixing Australia's \"broken\" employment services system will be a top priority for her organisation at the economic round table.\n\nGolding says the sector has become \"punitive, compliance-driven and damaging to people\".\n\nShe points out that 1 in 8 Australians are living in poverty, and about half the adult population is living on less than $70,000 per year.\n\n\"We want to see the fixing of the employment services system as its [the government's] term two ambition,\" Golding says. \"I think employers know it's not helping them to be able to find the workers that they desperately need, and it's certainly not helping people who are trying to get jobs,\" she says.\n\nGolding has also called for reforms to social security to reduce the complexity of the system and reduce the number of reports the not-for-profit sector has to complete.\n\nAsked about leaked Treasury documents recommending the government freeze the National Construction Code to boost housing construction, Golding says it's not something she supports.\n\n\"The last thing that we should be doing now is freezing the national code. We need to make sure that we've got the right regulations so that every housing footprint that we create now is to standard,\" she says.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/aflw-rookies-putting-competition-on-notice/105664026",
    "title": "Why AFLW stars and experts think this superdraft is going to 'change the game'",
    "publish_date": "Sun, 17 Aug 2025 21:34:29 +0000",
    "category": "sports",
    "authors": [],
    "text": "Sydney co-captain Chloe Molloy says \"the talent is insane\" in the new crop of AFLW players who have debuted over the weekend.\n\nThe young guns are already being predicted to be a superdraft.\n\n\"I think they're going to come in and change the game for how we once knew it to be,\" Molloy told ABC Sport.\n\n\"They take it to another level, which is so exciting for the growth of W.\"\n\nMolloy back with a bang for Swans in AFLW Photo shows Sydney Swans AFLW star Chloe Molloy bends over, yells and pumps her fists in celebration after a goal. Sydney Swans begin their AFLW campaign with a spirited win over Richmond thanks to starring performances from Chloe Molloy and debutant Zippy Fish.\n\nThe 26-year-old Swans star had four goals in her return game from an ACL against Richmond at North Sydney Oval on Friday night.\n\nJoining her in the spotlight was 18-year-old teammate Zippy Fish, who finished with 26 disposals, equalling the most disposals on debut with former league best and fairest Bri Davey.\n\nFish, taken with pick five in last year's draft, was among a slew of first-year players who exploded onto the scene in round one of the 10th season.\n\nLucia Painter had three goals for West Coast, while fellow first gamers Ash Centra (Collingwood), Grace Belloni (Essendon), Zoe Besanko (St Kilda), Holly Ridewood (Essendon), India Rasheed (Adelaide), Havana Harris (Gold Coast) and Poppy Scholz (Carlton) all kicked majors in their respective games.\n\nLucia Painter of the Eagles had three goals on debut. (Getty: Daniel Carson/AFL Photos)\n\nWomen's football pioneer Chyloe Kurdas said the AFLW community all agreed last year's was a jumbo draft crop.\n\n\"It's no different to the Chris Judd draft crew [known as the superdraft] that we saw all those years ago. Everyone was like, 'Oh my God, that was a bumper draft.' I think we have the same here,\" Kurdas told ABC Sport.\n\n\"It's a very good group of players but I think it's an indication that the deeper investment that has been put into the pathways is working.\n\nNumber two draft pick Havana Harris was one of the best on ground for Gold Coast in her debut game. (Getty: Daniel Carson/AFL Photos)\n\n\"The players are really well prepared. They've just slotted in really comfortably [and] haven't missed a beat.\n\n\"If you look at any of the kids that played on the weekend, especially the top-five picks, in any other draft [they] could've gone number one. So it's a wonderful group of players. We're very lucky.\"\n\nIn one of the biggest developments for AFLW talent, players now entering the system have not had interrupted pathways like the inaugural players, who had to stop playing between the ages of 12 and 18.\n\nSimilar to how Harley Reid, Nick Daicos and Will and Levi Ashcroft slotted straight into their respective teams, Kurdas said the high draft picks in the women's game were easing into senior football a lot easier than previous drafts.\n\n\"The under-18 system understands what's required at senior level and I think there's greater synergy, or more specific preparation now, for those players, too,\" Kurdas said.\n\n\"The other thing is these players have had a lifetime growing up watching AFLW. So, they've got a really good understanding of the standard that's required of them as they've grown up with the competition being present.\n\n\"Whereas your Darcy Vescios [Carlton inaugural player] never had a benchmark to aspire to because there wasn't a competition before them.\"\n\nVeteran commentator Kelli Underwood said on the broadcast for the Sydney Richmond clash that she felt for the Rising Star selection committee, which had its work cut out for it.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nKate McCarthy, who has been added to the All Australian selection panel this year, said selecting a Rising Star this season might be just as difficult, if not more, than the All Australian team.\n\n\"That's if the first round is anything to go by,\" McCarthy told ABC Sport.\n\n\"The most impressive element of these debutants is that they are competing against a number of girls who have played for nine years and they are holding their own. This is against bodies who have been in an AFLW system for nine preseasons.\n\n\"These debutants are girls who have had a footy in their hands their entire life. They have the ball on a string and have played their whole lives. It's so incredibly exciting.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/nsw-drivers-facing-lengthy-wait-times-to-sit-driving-tests/105642300",
    "title": "NSW learner drivers waiting months to sit their tests",
    "publish_date": "Sun, 17 Aug 2025 21:26:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Learner drivers in New South Wales are having to wait up to two months to take their driving test and in some cases are struggling to find a booking at all.\n\nSome people travel long distances to regional towns to take their test, forcing local L-platers to go further afield to secure a spot.\n\nOran Park student Sian Lynch has been ready to take her test for weeks.\n\n\"When I logged in and saw all the time slots were taken, I had to wait a good six to eight weeks before I could book in,\" the 17-year-old said.\n\nSian Lynch says the lengthy wait had added to her stress. (ABC News: Marcus Stimson)\n\nShe said the delay had added to the stress.\n\n\" It was a little bit frustrating. It was also very nerve-wracking knowing that if I did fail my test, I would have to wait two months before I could book in again. \"\n\nGerry Rivet has been a driving instructor in south-west Sydney for almost a decade.\n\n\"In an area like this in the Macarthur, there is not much public transport, so we are dependent on people being self-sufficient to get to and from work and school,\" he said.\n\n\"In some cases, the apprentices have been threatened with their job because they need to get a licence for work.\"\n\nGerry Rivet says booking a driving test has become a lottery. (ABC News: Marcus Stimson)\n\nHe said in recent months, finding an available booking for a driving test had been a lottery.\n\n\"You could normally book in within a week. When COVID happened, wait times blew out a fair bit, probably a month or month and a half. Now it's roughly a six to eight-week wait which a lot of people aren't expecting,\" Mr Rivet said.\n\n\"People can't get in here so they're going to Mittagong or Goulburn. The Goulburn people can't get in there, so they're travelling out to Wagga and it's a domino effect.\"\n\nRecord number of driving tests amid high demand\n\nService NSW, which manages the driving test system, said the spike in demand was driven by a policy change requiring Australian citizens and permanent residents holding an overseas licence to pass the Australian driving test within three months.\n\nService NSW says policy change is behind a spike in demand. (ABC News: Keana Naughton)\n\nAbout half the overseas drivers fail the test and then try to rebook, adding to demand.\n\n\"This change is about ensuring driver are safer on our roads,\" a Service NSW spokesperson said.\n\nA record 396,000 driving tests were held in NSW last year — a 12 per cent increase on the year before, but it has not been enough to keep pace with demand.\n\nAbdul Al-Sharhani runs a driving school at Woodbine near Campbelltown.\n\nRecently, he has taken to scouring the booking system himself, looking for cancellations for his drivers.\n\n\"I've got many drivers who've told me they need a licence to get a job. It changed their life so those things are really needed,\" he said.\n\n\"I am looking forward for the government to resolve this problem as soon as possible.\"\n\nDriving instructor Abdul Al-Sharhani runs a driving school at Woodbine, near Campbelltown in south-west Sydney. (ABC News: Marcus Stimson)\n\n'Like putting a little Band-Aid on a big axe wound'\n\nService NSW said an extra 20 testing officers were being recruited on a temporary basis to help clear the backlog.\n\nSome test centres in Sydney, the Central Coast and the Illawarra are offering tests on Saturdays.\n\nMr Al-Sharhani is not confident the measures will fix the problem.\n\n\"With the load we have now, with the people who came, the people who need their licence, I don't think it's enough,\" he said.\n\nMr Rivet described the response as \"putting a little Band-Aid on a big axe wound\".\n\nYear 11 student Celio Romero plans to take his driving test as soon as he turns 17.\n\nHe lives in St Andrews and is often reliant on his parents to ferry him to school, TAFE and his apprenticeship as a boilermaker.\n\n\"It's really good to get your Ps so you can get to places on your own,\" he said.\n\nYear 11 student Celio Romero is planning to take his driving test as soon as he turns 17. (ABC News: Marcus Stimson)\n\n\"Say you have family members that have their own work. They don't always have time to take you to work and stuff.\"\n\nHe's hoping to take his test at his local Service NSW centre in Gregory Hills, an hour away from his suburb.\n\n\"Travelling to a new area, I don't know if there's a roundabout coming up or if it's as busy,\" he said.\n\n\"It would be more difficult.\"\n\nService NSW said the current backlog is reaching its peak but it would continue to monitor the situation and plan for future demand.\n\nIt is advising learner drivers to shop around.\n\n\"While there may be demands on an individual driver test location, there may be availability elsewhere,\" a spokesperson said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-18/church-restored-with-money-from-jam-scenic-rim-gold-coast/105569588",
    "title": "Family renovates century-old chapel, one jar of jam at a time",
    "publish_date": "Sun, 17 Aug 2025 21:17:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's not every day your daughter casually drops, \"I bought a church\", into a conversation.\n\nEspecially when the church has no roof, no windows, and hasn't heard a sermon since 1968.\n\nBut that revelation was the moment life took an almighty turn for Helen and Terry Roebig of South East Queensland's Scenic Rim.\n\nFour years, one very muddy midnight move, and hundreds of jars of homemade rosella jam later, the century-old timber chapel rescued by the Roebigs' daughter, Jess, now sits proudly beside its renovated old schoolhouse.\n\nThe renovated church and schoolhouse now sit side by side on the hill. (Supplied: Helen Roebig)\n\nIt's a sweet reunion more than 100 years in the making.\n\n\" It's like the two buildings found each other again,\" Helen said. \"Now they can grow old together on the hill. \"\n\nAn old school and a forgotten church\n\nThe Roebigs, along with their daughter Jess Bickerstaff, run the Vanbery Cottage Host Farm near Mount Alford, just outside Boonah.\n\nThe old Tarome schoolhouse has been converted into a guest cottage on the property. (Supplied: Jess Bickerstaff)\n\nThe guest cottage — the former Tarome schoolhouse — had already been moved to its current site and renovated.\n\nSo when Jess spotted the old Tarome church for sale on Facebook Marketplace for $4,000, and announced that she'd bought it, the Roebigs jumped at the chance to bring it home and install it beside the old school building, despite not having seen it in person.\n\n\"They belonged together, Helen said.\n\n\" The school and the church were from the same little rural community, so it just felt right. \"\n\nAfter buying the old church, Jess Bickerstaff then had the task of relocating it to its present location at Mt Alford. (Supplied: Helen Roebig/ABC News: Chris Kimball)\n\nThe chapel that jam built\n\nRestoring a derelict church isn't cheap, especially one that has spent the past 50 years as a hay shed.\n\nSo, Helen and Jess decided to raise funds with what they had — a patch of rosella bushes and a family tradition of jam-making.\n\n\"We planted six bushes and made a few jars,\" Helen said.\n\nThey took them to markets and local shops, and sold them through a bush foods website as demand grew.\n\nHelen Roebig says making jam from rosella flowers is a family tradition. (ABC News: Chris Kimball)\n\n\"Now we've got 160 bushes, and everything we earned went into the chapel,\" Helen said.\n\n\" We treated ourselves to a coffee at the market once. That was it. \"\n\nThe Roebigs built their small business from the ground up: hand-picking the rosella buds, de-seeding them, and cooking every batch.\n\nJess and Daniel Bickerstaff have worked on the church renovation for years. (ABC News: Chris Kimball)\n\nThe profits covered timber, trades, windows, fittings and more.\n\n\"Between us, we've preserved jams, fruit, and now churches,\" Helen said.\n\nSo, what exactly is a rosella?\n\nRosellas are a bright red hibiscus flower with a tart, fruity pod used to make everything from jam to cordial and tea.\n\nPopular in Queensland backyards for generations, they're rich in vitamin C and antioxidants.\n\nRosella jam used to be a staple in many homes back in the day. (ABC News: Chris Kimball)\n\nHelen remembers rosellas being used for bartering on the family farm in Mulgowie, in the Lockyer Valley, where she grew up.\n\n\"Everyone had them,\" she said. \"My sisters would peel them and make jam. I was the youngest, so I got out of most of the work.\"\n\nJess picked up the tradition years later while living in England, where she loved to forage for berries and experiment with making preserves.\n\nHelen said that so far this season, they had picked more than 400 kilograms of rosellas, which they have turned into jam, syrup, paste, topping, dried flowers and tea.\n\nEven the copper de-seeder tool Terry designed as the rosella business took off is now sold at local markets.\n\n'That history would have been lost'\n\nThe church hadn't had a roof since a storm tore it off in the late 60s. Rebuilding it on a windswept hill was no small job, but the Roebigs found help in local builder Shane Goulding.\n\n\"When he walked inside and said it was always his dream to restore a chapel, I knew we'd found the right person,\" Helen said.\n\nThe church before and after the renovations. (Supplied: Helen Roebig)\n\nNothing in the old building was square, so Terry got to work restoring doors and windows, many of which were salvaged from knockdowns and timber recycling outlets.\n\n\"When the girls bought the church, I thought, not again,\" he said. \"We'd already restored a house in Brisbane.\n\n\" I figured my renovation days were behind me. \"\n\nSlowly, piece by piece, the chapel came back to life.\n\nIt's taken four years and hundreds of jars of jam to complete the chapel renovations. (Supplied: Jess Bickerstaff)\n\n\"Had it not come here, that history would've been lost,\" Terry said.\n\n\"It might've ended up in Brisbane, but it belonged here.\"\n\nLove story blossoms\n\nJess had only been dating her then-boyfriend Dan for two weeks when she told him she'd bought a church.\n\n\"It didn't scare him off,\" Helen said.\n\n\"A year later, they were engaged, and the next April they got married in it.\"\n\nEven though the church was still a work in progress, Jess and Dan were married in it. (Supplied: Jess Bickerstaff)\n\nAt the time, the building still had no roof. The floor was stained. Guests sat on hay bales.\n\n\"But we had 90 people standing inside,\" Helen said.\n\n\" And why not, when you've got your own church? \"\n\nA sweet success\n\nThe restored chapel now welcomes visitors from across the country and overseas.\n\nSome come for the views, others for a quiet getaway. A few help pick rosellas or just chat over a cuppa.\n\nNew season of Shaun Micallef's Eve of Destruction Photo shows Shaun Micallef is holding 2 chairs from an explosion he survived from with a purple background, the title and ABC iview logo. Micallef is back with a new season from Wednesday, August 13 at 8.30pm on ABC TV and ABC iview.\n\nHelen said the decision to share the property was never difficult.\n\n\"We had neighbours on both sides for 38 years in Brisbane,\" she said. \"Now, if someone's staying 100 metres away, that's not hard.\"\n\nAs for Terry, he still gets a kick out of watching people discover what they've built.\n\nTerry Roebig says his renovation days are over. (ABC News: Chris Kimball)\n\n\"It's pleasing on the eye, and it's something that'll last,\" he said.\n\nAnd the jam? There's always more on the way.\n\n\"Whatever grows on the trees,\" Terry said, \"they turn into jam.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/inside-commentary-box-for-incredible-wallabies-comeback-20250818-p5mnsm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside commentary box for incredible Wallabies comeback",
    "publish_date": "Mon, 18 Aug 2025 12:13:45 +1000",
    "category": "sports",
    "authors": [],
    "text": "Inside commentary box for incredible Wallabies comeback\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/property/news/first-home-buyer-makes-aggressive-bid-to-buy-thornbury-property-in-less-than-a-minute-20250817-p5mnm1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "First home buyer makes aggressive bid to buy Thornbury property in less than a minute",
    "publish_date": "Mon, 18 Aug 2025 11:58:01 +1000",
    "category": "finance",
    "authors": [
      "Shona Hendley"
    ],
    "text": "A first-home buyer attempted a knockout bid for a Thornbury unit in an auction that lasted less than a minute on Saturday, paying $1,040,000 for the renovated property.\n\nThe aggressive bidding for 1/79 Fyffe Street, which is on a larger allotment, pushed the price $110,000 over its reserve of $930,000.\n\nGuided at $840,000 - $880,000, the auction was hot from the get-go, selling agent Luke Brizzi from McGrath Northcote said.\n\n“The bidding was strong, and it was quick,” he said of the two-bedroom home.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/business/companies/qantas-hit-with-90-million-penalty-for-illegal-sacking-of-1800-workers-20250815-p5mn9t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Wrong kind of sorry’: Qantas hit with $90m penalty for illegally sacking 1800 workers",
    "publish_date": "Mon, 18 Aug 2025 11:50:11 +1000",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "Lee accepted that Qantas was sorry for the illegal outsourcing, but he wasn’t convinced the measure of regret was “significant” and described it as “the wrong kind of sorry”. He pointed to efforts within Qantas to obscure the decision-making process for the firings, the willingness of Qantas to actively appeal the court’s decisions before being able to fully review them, and the decision not to have Vanessa Hudson, the former CFO, testify in court. Hudson has been CEO since Joyce stepped down in 2023. On the $90 million penalty he ordered Qantas to pay the TWU, Lee said: “It does not strike me as intuitively wrong that greater rewards might be appropriate for circumstances of greater risk.” The payment of at least a large part of the penalty to the union was “warranted”, he said, adding that he was “satisfied that such a course will facilitate and promote the specific and general deterrence”.\n\n“It will send a message to Qantas and well-resourced employers that, not only will they face potentially significant penalties for the breach of the [Fair Work] Act, but those penalties will be provided to trade unions to resource those units to fulfil their statutory roles as enforcers of the Act,” he said. The decision was announced at a Federal Court hearing on Monday, following a verdict in the Federal Court in December. Qantas is yet to comment on the penalty. The TWU had sought the maximum penalty of $121 million, while Qantas was seeking a fine between $40 million and $80 million. The union had asked to be the recipient of the full sum. The case marks a significant win for the TWU at a time when the conditions of wages and work are being debated in the post-COVID economy. Qantas aircraft stand on the tarmac at Sydney Airport during the COVID lockdown in 2020. Credit: Bloomberg\n\nThe penalty is in addition to the $120 million Qantas has already agreed to pay in compensation to the illegally fired workers. TWU national secretary Michael Kaine said: “Today’s decision is a final win for both those workers and the tens of thousands of other TWU members who backed them every step of the way. “They weren’t just sacked, they were told by Qantas that they were delusional for questioning it,” Kaine continued. “This ruthless, self-interested and illegal calculation to kick them to the curb has rightfully merited the largest ever penalty of its kind.\n\nLoading “Qantas is only sorry now that it has to pay the largest penalty fine of any employer in Australian corporate history.” Stephen Smith, principal of Actus Workplace Lawyers, which specialises in employment law said: “The sheer size of the penalty awarded to the TWU in this case will no doubt encourage the TWU and other unions to pursue speculative claims against employers.” In the future, Smith said unions will be able to pursue much larger maximum penalties because civil penalties under the Fair Work Act have recently increased.\n\nAfter the 2020 sackings, the TWU immediately challenged the decision in court, and it was found the following year that Qantas had acted illegally “in part motivated by a desire to prevent the employees taking protected industrial action in the future”. Former Qantas CEO Alan Joyce. Credit: Eamon Gallagher Qantas appealed the case to the Supreme Court, which unanimously dismissed it, in a win for the TWU. In December 2024, Qantas agreed with the TWU to pay $120 million in compensation to the 1820 ground staff whose contracts were terminated, including 1700 workers who lost their jobs outright, as well as 120 who were redeployed within Qantas but suffered non-economic losses.",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/sport/afl/aflw-weekly-live-round-one-blues-pies-name-teams-for-season-opener-20250813-p5mmlw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I don’t recommend it’: Harris back and joking after hospital visit; Big names attempt the ‘Centra’",
    "publish_date": "Mon, 18 Aug 2025 11:48:59 +1000",
    "category": "sports",
    "authors": [
      "Hannah Kennelly",
      "Roy Ward",
      "Melissa Coulter Ryan"
    ],
    "text": "It was a jam-packed weekend for the opening round of AFLW’s milestone 10th season. We’ve rounded up some of the best moments you might have missed.\n\n1. Seems everyone’s trying to ‘do a Centra’\n\nCollingwood rookie and last year’s No.1 draft pick Ash Centra might have only had three touches during her debut, but the young gun still managed to kick a goal. However, it was her pre-game actions on Thursday night that had everyone talking.\n\nCentra skilfully bounced the footy between her legs like a basketball, inspiring many others (including Hawthorn coach Sam Mitchell and Pies men’s players Nick Daicos, Jack Crisp and Darcy Cameron) to try and mimic the tricky move.\n\n“She’s [Centra] got a cult-following,” Collingwood coach Sam Wright said after their loss to Carlton.\n\n“Every time, she got the ball … you could hear the crowd. I just think it’s so great for our game. I mean, the long sleeves, you see her coming from a mile away.\n\n“I was really happy for her that she kicked that goal, she’s going to be a serious player.”\n\n2. ‘I’ll wear a helmet and a ski mask’: Harris jokes after eye injury\n\nTayla Harris wasn’t in the game long before suffering an eye injury but did have time to take a trademark speccy. Credit: Getty Images\n\nStar Melbourne ruck-forward Tayla Harris says she is “100 per cent good to go” for the rest of the season after suffering an eye injury during Saturday night’s clash against the Bulldogs.\n\nAfter pulling off a trademark speccy just moments earlier, Harris copped an arm to her face in a marking contest with Bulldogs counterpart Alice Edmond.\n\n“I obviously had to go to hospital to get some expert opinion, and yeah, all good from that point of view, I’ll get an appointment with the specialist ASAP and just clear up anything else and make a plan moving forward,” Harris said on Monday morning.\n\n“But I’m feeling good, obviously thankfully avoided anything major, but not ideal to poke yourself in the eye, I don’t recommend it.”\n\nHarris confirmed there was damage to her eyeball and said she was taking eye drops to accelerate the healing process.\n\n“I’ll do whatever I’m told,” she continued. “As long as I can play, I’ll be wearing whatever’s needed, I’ll wear a helmet and a ski mask if I need to.”\n\n3. Snoop Dogg might commentate AFLW, but some aren’t pleased\n\nAFL chief executive Andrew Dillon told Fox Footy on Thursday night that there were plans to have grand final pre-game performer Snoop Dogg involved in AFLW.\n\n“Snoop has to bring it on grand final day but what he does in the lead-up is super important as well,” Dillon said.\n\n“Whether that is commentating on an AFLW game or not, I’m not sure. But we want to get the game in front of him and get his thoughts.”\n\nSnoop Dogg has been hired by the AFL to perform at the grand final on September 27. Credit: Getty Images\n\nHowever, Respect Victoria chair Kate Fitz-Gibbon, who was instrumental in the creation of Australia’s National Plan to End Violence Against Women and Children, described the AFL’s choice of Snoop Dogg as a “grave mistake” given his “public history of boasting about violence against women”.\n\n“It is unfathomable that the AFL would deem this artist [as] an appropriate choice for its flagship event,” Fitz-Gibbon said.\n\n“Sport has enormous power to influence culture. By elevating an artist with a track record of degrading women, the AFL risks sending the message that misogyny is entertainment.”\n\nRead more here.\n\n4. Molloy makes a stunning return\n\nChloe Molloy played a starring role in her long-awaited return to the AFLW, firing Sydney to a 20-point win over Richmond.\n\nThe Swans co-captain slotted four goals on return from a knee reconstruction. She tore her anterior cruciate ligament at training in September 2024 – just one game into last season.\n\nThe 26-year-old picked up where she left off, combining well with maturing midfielder Montana Ham (18 disposals, six score involvements) in front of 4126 fans.\n\n5. Zippy by name and nature: Young Swan stuns on debut\n\nAll eyes were on Swan debutant Zippy fish during Sydney’s clash against Richmond on Friday night. As the Larrakia, Wongi, Noongar and Nunga woman told The Age last year, “it would be a bit awkward if I was slow”.\n\nWestern Australian AFLW player, Zipporah “Zippy” Fish. Credit: Tony McDonough\n\nFish, drafted with pick No.5 last year, lived up to her name, flaunting her blistering pace from half-back. She finished with 25 disposals and nine intercept possessions\n\nShe missed the record for possessions on debut by just one.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/pick-up-the-phone-popa-socceroos-could-lose-another-rising-star-to-croatia-20250817-p5mnl9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pick up the phone, Popa: Socceroos could lose another rising star to Croatia",
    "publish_date": "Mon, 18 Aug 2025 11:46:43 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "It’s not an empty threat. Croatia is closely monitoring Segecic, and has already poached another of Australia’s rising stars, with goalkeeper Anthony Pavlesic - who, like Segecic, was born and raised in Sydney and played youth international football for Australia - electing earlier this year to represent the nation of his family’s heritage. Pavlesic, 19, this week sealed a transfer from Bayern Munich to Croatian club NK Rudes, whose chairman is Josip Simunic, another born-and-bred Aussie who famously turned his back on the Socceroos. Meanwhile, Popovic’s policy of refusing to “sell” the Australian jersey to players eligible to represent other countries may have cost him another top talent in Sunderland’s Nectar Triantis, the former Central Coast Mariners star who has had his switch from Australia to Greece approved by FIFA. Triantis, 22, was called up by the Socceroos in March but was not used, and his negative experience in camp contributed to his decision, according to sources close to him. The last time Popovic spoke to Australian media, he warned that the country’s budding young stars had to “earn” their call-ups, saying: “It’s not about, ‘OK, I heard some guy scored two goals and yeah, great, we’ll just give them a call to the national team.’ It doesn’t go like that.”\n\nLosing Segecic, if it were to happen, would sting even more because he is a rare talent in a part of the field where the Socceroos desperately need new impetus. In fact, it could be argued that Segecic - who finished tied with former Adelaide United striker Archie Goodwin for the A-League’s golden boot last season - is the most in-form Australian attacker anywhere in the world. He has had a direct hand in all three of the goals scored by Portsmouth so far this term, his latest involvement being a spectacular strike from outside the box to claw one back in a 2-1 defeat to Norwich City. For those who watched him in the A-League, it was a familiar highlight, with Segecic possessing the sort of swagger that makes him unafraid to swing his dangerous left foot at distance if the opportunity presents itself. “I feel like these days, a lot of young kids don’t believe in themselves,” he said. “It’s a bit more robotic ... you don’t see the old-fashioned No.10 types. As a young player coming through, the hardest thing is to have confidence and believe in yourself. I feel like if you tell yourself you’re going to go out there, and you’re going to do it, and you’ve put the hard work in, there’s a good chance that it can happen. If you don’t back yourself, and you don’t take that shot, you’re never going to score … if you do, it could be the difference in the game.”\n\nThere will be an immense sense of pride in Segecic’s journey from a Sydney FC perspective, given he joined the club’s academy at the age of 12, but also pain. Firstly, because the Sky Blues won’t be able to cash in on Segecic’s rise because they lost him to Portsmouth on a free transfer, pocketing under $1 million in training compensation for him, with no sell-on clauses retained - and secondly, because his trajectory suggests that had coach Ufuk Talay started him more often last season, they might have made the A-League finals. Loading He has signed a three-year deal with Portsmouth, and their decision to hand him the coveted No.10 jersey is a sign of the high esteem held in him by manager John Mousinho, who has scoured the A-League for diamond-in-the-rough recruits. Three other Australians are also at the club: Segecic’s former Sydney FC teammate Hayden Matthews, ex-Brisbane Roar striker Thomas Waddingham and Central Coast Mariners product Jacob Farrell. “He must love the A-League,” Segecic said. “From the minute I spoke to him, I just felt like that’s a manager I’d love to play under. He gave me goosebumps. It’s someone that you’d love to fight for and do well for. He said he saw me playing in that No.10 role, and like you saw in the A-League, that’s where I can cause the most damage. As soon as he said that, that was me sold.”",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/david-campese-said-wallabies-coach-joe-schmidt-had-no-idea-what-does-he-think-now-20250818-p5mnoy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "David Campese said Wallabies coach Joe Schmidt had ‘no idea’. What does he think now?",
    "publish_date": "Mon, 18 Aug 2025 11:44:00 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Wallabies great David Campese says he is “eating humble pie” after declaring coach Joe Schmidt had “no idea” on the eve of Australia’s historic victory over South Africa.\n\nCampese also revealed he planned to quit social media after he and his family were subjected to a torrent of abuse following the Wallabies’ 38-22 triumph at Ellis Park, which snapped a 62-year losing streak at the venue.\n\nIn the lead-up to Australia’s Rugby Championship opener in Johannesburg, the outspoken former winger took a shot at Schmidt over his Wallabies selections, which included installing James O’Connor at No.10 after Tom Lynagh, who started in all three Lions Tests, was ruled out with concussion.\n\n“I can see why Joe Schmidt has never won a RWC [Rugby World Cup]. He has no idea about rugby. Clueless. This shows us why,” Campese wrote on X to his 23,000 followers.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/victoria/the-rise-and-rise-of-the-melbourne-bathhouse-20250815-p5mn73.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The rise and rise of the Melbourne bathhouse",
    "publish_date": "Mon, 18 Aug 2025 11:39:17 +1000",
    "category": "finance",
    "authors": [
      "Cara Waters"
    ],
    "text": "The ancient Greeks were all over it, the Japanese have long been advocates, and now Melburnians are realising the joys of soaking in a bathhouse.\n\nIn 2021, Freya Berwick opened Sense of Self in a former industrial warehouse in Collingwood with a heated mineral pool, sauna, cold plunge pool and hammam; since then, a swath of other bathhouses have opened across the city.\n\nFreya Berwick founded the Sense of Self bathhouse in Collingwood and says people are looking for alternatives to the pub. Credit: Simon Schluter\n\nBerwick says people are seeking out healthier lifestyles and ways to connect with people, which communal bathhouses can provide.\n\n“I think people are looking for alternatives to the pub or, going back further, the church,” she says. “Historically, we had places where we would convene and connect, and the increase in social media sort of disrupted that because we have different ways of connectedness through our phones.”",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/lifestyle/relationship-expert-reveals-the-secret-to-keeping-the-spark-alive-20250818-p5mns7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Relationship expert reveals the secret to keeping the spark alive",
    "publish_date": "Mon, 18 Aug 2025 11:34:22 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Relationship expert reveals the secret to keeping the spark alive\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/nsw/absolutely-world-beating-how-a-year-of-metro-has-shaken-up-the-way-sydney-moves-20250728-p5miee.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Absolutely world beating’: How a year of metro has shaken up the way Sydney moves",
    "publish_date": "Mon, 18 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Matt O'Sullivan",
      "Cindy Yin"
    ],
    "text": "Daily weekday trips at North Sydney station have more than halved to 12,200, while patronage at St Leonards has fallen by a third, and by more than a tenth at Wynyard and Town Hall. Sydney transport expert Mathew Hounsell said the metro line had proven to be “absolutely world beating” in how it had encouraged people to use it consistently. “It helped bring the city back from the edge after COVID because you now have the whole northwest and north shore able to get into the city quickly,” he said. “It should serve as an example for the whole country that if you build frequent, reliable transport, people will use it.”\n\nCrows Nest resident Charlie Smith said the metro was “life-changing” for his commute between work, home and university. “It’s just so convenient to get everywhere, and the stations are so pretty. It’s so fast and comes every four minutes – it’s 10 minutes into the city, 10 minutes to Macquarie Uni where I study, and it’s just perfect,” he said. Martin Place metro station is consistently surpassing patronage forecasts. Credit: Sam Mooy Commuters will have to wait until at least April next year for the M1’s final stage between Sydenham and Bankstown to open, which has been blamed on the complexity of converting the old T3 heavy rail line to metro train standards and disruptions from industrial action. Regan said a higher frequency of services than on the former T3 rail line, together with much faster journeys between Sydenham and the CBD and north shore, was forecast to boost patronage on the M1 line.\n\n“At the moment, it’s quite asymmetrical. The patronage in the morning peaks is very heavily from the north, and less coming up from Sydenham,” he said. Loading “But once the Bankstown line is opened, it will be much more balanced because you’ll have an extra 10 stations picking up people from the south.” Regan said it was expected to lead to similar passenger loads on the M1 line to and from the south-west to what was already experienced on services between the northwest and the CBD. “You’ll have a very balanced load in both directions,” he said. While Martin Place and Gadigal have surpassed expectations, Waterloo and Crows Nest stations continue to lag patronage forecasts.\n\nAt Waterloo, planned development around the station has been slower than originally forecast. “In COVID, everyone got a bit nervous about commercial so they switched it to [residential],” Regan said. “Now they’re looking at the timing of it. Some of the development directly on our site has taken longer.” Loading Similarly, at Crows Nest, it has taken time for some developments along the Pacific Highway to be completed. “You can really see it starting to accelerate now, and the housing developments directly above the station are now being marketed,” Regan said. Trains run every four minutes in both directions on the M1 line during weekday peaks between about 7am and 10am, and from 3pm to 7pm. They operate every five minutes from 10am to 3pm, and every 10 minutes at other times. Regan said a boost to train frequencies before 7am on weekdays was “definitely an option” if patronage kept growing, and was possible with the existing 45-strong fleet.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/politics/nsw/sydney-s-great-baby-divide-how-fertile-is-your-suburb-20250815-p5mnc5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney’s great baby divide: How fertile is your suburb?",
    "publish_date": "Mon, 18 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Matt Wade"
    ],
    "text": "A stark baby divide has become entrenched in Sydney as the number of births climbs in the western suburbs but nose-dives in many of the city’s most affluent areas.\n\nDuring the past decade, births have fallen by 20 per cent or more in the eastern suburbs, north shore, northern beaches and inner west districts while rising solidly in the Blacktown, outer west and south-west regions.\n\nThe number of babies born in Greater Sydney peaked in 2018 at 70,400, but has been below that figure every year since, analysis of preliminary births data by KPMG shows.\n\nIn 2024, there was a modest 1.1 per cent lift in births to 60,310 thanks to western Sydney; the top 30 suburbs for new babies were all in that region.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/shark-attack-at-nsw-beach-20250818-p5mns0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Shark attack at NSW beach",
    "publish_date": "Mon, 18 Aug 2025 11:29:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "Shark attack at NSW beach\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/afl/your-guide-to-round-24-the-games-that-will-shape-the-top-eight-20250815-p5mn6o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Your guide to round 24: The games that will shape the top eight",
    "publish_date": "Mon, 18 Aug 2025 11:23:47 +1000",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "Well, it’s come down to this. The final home-and-away round – plus a rescheduled fixture – with so much still to play for as nine teams jostle for eight positions.\n\nSo tight is the race that only six premiership points separate the third-placed Brisbane Lions from the ninth-placed Suns, with four teams equal on 15 wins, separated by 14.5 percentage points.\n\nFinals contenders: Sam Darcy, Nick Daicos and Nick Watson. Credit: Aresna Villanueva/Getty Images\n\nThe surging Crows, meanwhile, have one hand on top spot, and the McClelland Trophy – the AFL’s least appreciated team award. Geelong have one hand on second.\n\nCollingwood, who were 10 points clear on top a month ago, have crashed to the point they could even slip from the top four should they lose to Melbourne, while Brisbane’s home clash against Hawthorn on Sunday night shapes as an early final.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/property/news/waterfront-northern-beaches-home-sells-for-700k-above-9-million-reserve-20250817-p5mnma.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Waterfront northern beaches home sells for $700k above $9 million reserve",
    "publish_date": "Mon, 18 Aug 2025 11:20:47 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "Six families registered for a northern beaches deep waterfront property in Mona Vale, with the winning bidder paying $700,000 above its reserve at auction on Saturday.\n\nThe six-bedroom sandstone residence located at 68 Rednal Street comes with panoramic Pittwater views and level access to a private jetty and pontoon. It was guided at $8 million.\n\nBidding opened at $8 million, and four buyers were active. Bids of $50,000, $25,000 and $10,000 were placed until the property was called on the market at $9 million.\n\nBids of varying increments continued until it sold under the hammer for $9.7 million, which was $700,000 above its $9 million reserve. There is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/property/news/hundreds-watch-hammer-come-down-as-sunnybank-hills-home-smashes-record-20250818-p5mnou.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hundreds watch hammer come down as Sunnybank Hills home smashes record",
    "publish_date": "Mon, 18 Aug 2025 11:10:38 +1000",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "An Afghan family with deep pockets has rewritten Sunnybank Hills’ record books after splashing $3.0735 million on a rare estate in a breakneck auction that smashed the house price record for a sub-1000-square-metre block.\n\nThe hammer fell in 10 minutes as three of the 20 registered bidders battled in front a crowd of 250, driving the six-bedroom, five-bathroom home at 116 Belvedere Crescent almost $100,000 above the reserve.\n\nThe winning buyers set the pace early, lobbing an opening bid of $2.75 million before an Adelaide underbidder fired back with $100,000. From there, the contest rattled through $50,000, $25,000 and even $500 increments until the hammer came down.\n\nSelling agent Andy Guo, of Place Sunnybank, said the auction was one of the most intense he had overseen, fuelled by the rarity of the listing, a buoyant market and last week’s interest rate cut.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/qantas-fined-90-million-for-illegally-sacking-ground-staff/lphs1alga",
    "title": "Qantas fined $90 million for illegally sacking ground staff",
    "publish_date": "Mon, 18 Aug 2025 01:15:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's largest airline has been ordered to pay a landmark penalty of $90 million for what has been dubbed the largest case of illegal sackings in the country's history.\n\n\n\n\n\nQantas outsourced more than 1,800 baggage handlers, cleaners and ground staff in 2020, in a move the Federal Court ruled was designed to curb union bargaining power in wage negotiations.\n\n\n\n\n\nThe embattled airline's appeal to the High Court was unsuccessful, paving the way for the penalty to be awarded on Monday.\n\n\n\n\n\nThe Transport Workers Union sought the maximum penalty of $121 million , while Qantas urged Justice Michael Lee to impose a \"mid-range\" penalty between $40 million and $80 million.\n\n\n\n\n\nThe Federal Court judge cited the \"sheer scale of the contraventions, being the largest of their type\" as a reason to impose a penalty that would deter other businesses from similar conduct.\n\n\n\nREAD MORE Nearly six million Qantas records held in hacked system, airline says\n\nHe ordered Qantas to pay $90 million in penalties, $50 million of which is to be paid directly to the union that brought the proceedings and highlighted the illegal conduct.\n\n\n\n\n\n\"To deprive someone of work illegally is to deprive someone of an aspect of their human dignity, and this is not assuaged simply by expressions of regret,\" Lee said.\n\n\n\n\n\nHe was scathing about the embattled airline's conduct after the outsourcing, pointing to efforts to place a \"less than candid\" picture of the outsourcing decision before the court.\n\n\n\n\n\nHe noted Qantas had apologised publicly but then had attempted to deny any compensation payments to the affected workers.\n\n\n\nQantas will have to pay the hefty bill on top of a $120 million compensation payment it has made to the affected ground staff for their economic loss, pain and suffering following the outsourcing.\n\n\n\n\n\nHowever, Lee said he didn't have enough evidence to be convinced those payments would be made.\n\n\n\n\n\nThe court was told the scandal-plagued airline began to finally accept responsibility for its actions in 2023, Lee noted, which coincided with the departure of former CEO Alan Joyce.\n\n\n\n\n\nThe courtroom was packed with union members and representatives, who hugged and exchanged smiles after Justice Lee handed down his decision.\n\n\n\n\n\nIt comes after Qantas also sold tickets to cancelled flights for several years, triggering more legal turmoil and a $100 million fine after it was sued by the Australian Competition and Consumer Commission.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 0
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-solving-ai-amnesia-with-bee-brains/g3xgo4nx1",
    "title": "INTERVIEW: Solving AI amnesia with bee brains",
    "publish_date": "Mon, 18 Aug 2025 00:51:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/this-sleep-disorder-is-worse-after-the-weekend/efb7ui4bn",
    "title": "Feeling depressed or out of sorts after the weekend? You could have 'social apnoea'",
    "publish_date": "Sun, 17 Aug 2025 19:33:09 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "It's common to feel tired and apprehensive on a Monday morning, and that can be especially true after a big weekend.\n\n\n\n\n\nNew research has mapped how people's quality of sleep changes throughout the week, and has found patterns between fatigue and behaviour.\n\n\n\n\n\nIt's estimated around one billion people worldwide have obstructive sleep apnoea (OSA), a condition that impacts their quality of sleep.\n\n\n\n\n\nAustralian researchers have found this underlying condition is more prevalent on weekends than on weekdays, and they have labelled this phenomenon — 'social apnoea'.\n\n\n\nREAD MORE How seasons and even days of the week impact sleep\n\nIt can affect anyone, even if you don't typically show symptoms of OSA during the week.\n\n\n\n\n\nSo why is that the case?\n\n\n\n'Social jet lag'\n\nProfessor Danny Eckert, a sleep health expert from Flinders University, was one of the lead researchers in the study that was published in the American Journal of Respiratory and Critical Care Medicine.\n\n\n\n\n\nHe described social apnoea as a kind of \"social jet lag\", a feeling that can arise after the weekend, when our behaviours often differ from those on weekdays.\n\n\n\n\n\n\"We know that people who smoke tend to smoke more on the weekend. We know that people who drink tend to drink more on the weekend,\" he told SBS News.\n\n\n\n\n\n\"They are two sort of lifestyles or social factors if you like, that are very influential in the way we sleep and breathe.\"\n\n\n\nEckert said another key change in weekend behaviour is that our sleep patterns often change, which can cause problems with our sleep quality and overall mood.\n\n\n\n\n\nPeople who sleep in on weekends were found to have a 50 per cent higher risk of developing a sleep disorder, according to the study.\n\n\n\n\n\n\"Our circadian rhythm, or our body clock, is slow to move; it takes several days to adjust,\" he said.\n\n\n\n\n\n\"So if we suddenly change our sleep timing, and we've all experienced this at different times with jet lag and these kinds of things, we're sleeping out of whack from what our body wants us to.\"\n\n\n\nWhat are the long-term effects?\n\nWeekend surge in sleep-disordered breathing may heighten the risk of serious health conditions, according to the research.\n\n\n\n\n\nThis includes heart disease, depression, dementia, and extreme fatigue.\n\n\n\n\n\nThe research found people under 60 and males were two groups more likely to suffer from social apnoea. While the exact reason is unclear, Eckert said it's likely due to behavioural factors.\n\n\n\n\n\n\"We know that men tend to be drinking more alcohol than women and perhaps they're having later nights and going to sleep after women,\" he said.\n\n\n\n\n\n\"We also know that men get sleep apnoea more, so they are more prone to 'social apnoea' in the first place.\"\n\n\n\nEckert said beyond seeking clinical treatment for sleep apnoea, there are some lifestyle changes you can make to combat social apnoea. In particular, going to bed and waking up at consistent times can help establish a healthier sleep pattern.\n\n\n\n\n\n\"If people are feeling tired during the day, having some trouble staying asleep, or maybe they are waking up with morning headaches, maybe they're being told that they snore loudly; these are all warning signs that you may have sleep apnoea, and it's worth having a conversation with your GP.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/culturally-appropriate-aged-care-food/wmxk38cw2",
    "title": "'Feels like being back home': Is goulash the secret to this aged care facility's success?",
    "publish_date": "Sun, 17 Aug 2025 01:19:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Magdalena Klopfer was preparing to move into a residential aged care facility 11 years ago, she was nervous about the change. But there was one thing she wasn’t worried about: the food.\n\n\n\n\n\n\"They were cooking the same as I was cooking at home,\" she says.\n\n\n\n\n\nMagdalena, who turns 100 next week, is a resident at Árpád — a 62-bed Hungarian aged care facility in Melbourne’s east. On the menu is a range of Hungarian specialties including székelykáposzta (sauerkraut goulash), húsleves (a clear broth soup with beef or chicken and vegetables), and túrós csusza (pasta with cottage cheese and fried bacon on top). On special occasions, they will indulge in pálinka, a Hungarian-style schnapps.\n\n\n\n\n\n\"I eat it all,\" she says.\n\n\n\n\n\nSitting by her side, Eva Paldy, 88, explains that Christmas feasts at the facility are an especially exciting time.\n\n\n\n\n\n\"It's absolutely beautiful,\" she says, listing the strudels and pastries that are prepared for the holidays.\n\n\n\n\n\n\"Are you getting hungry?\"\n\n\n\nAt Christmas, the Hungarian chef at Árpád Aged Care prepares beigli, a sweet bread with poppy seed or walnut filling. Source: Supplied / Árpád Aged Care In Australia, around 185,00 people aged 65 and over are currently living in residential aged care facilities across the country. Despite improvements to aged care facilities following the Royal Commission into Aged Care Quality and Safety, rates of malnutrition are still high, with one 2024 study from Griffith and Monash Universities suggesting four in 10 residents are still not getting enough nutrition.\n\n\n\n\n\nBut as our diverse population ages, there is growing awareness that culturally appropriate food can make a significant contribution to improving rates of malnutrition, while also increasing overall wellbeing and quality of life.\n\n\n\nMeals that spark joy\n\nIn 2021, the royal commission stated that access to adequate food is a fundamental human right. Its final report identified food quality as a key problem requiring immediate attention, citing one Victorian study that found 68 per cent of homes surveyed had residents who were malnourished or at risk of malnourishment.\n\n\n\n\n\nCherie Hugo is the founder of Lantern Alliance, which is dedicated to improving the quality of life for older Australians through food. She says that four years on from the report, and despite many positive government initiatives driving improvement in the sector, the problem of malnutrition is still \"way bigger than it should be\".\n\n\n\n\n\n\"There's so many reasons why malnutrition is important. It increases health complications. It increases the risk of fall by eight times. It increases pressure injuries, hospitalisations, infections and cognitive decline,\" she says.\n\n\n\nHugo says budget constraints play a role, as does a lack of training for kitchen staff. But one overlooked factor is how dietary requirements change as we get older.\n\n\n\n\n\n\"An older person's protein needs are on par with what you would see for an athlete. But the problem that also happens as we get older is our appetites decrease. So the problem is they're needing more protein, but not feeling as hungry.\"\n\n\n\n\n\nThe issue was highlighted this week by Maggie Beer at a speech given at the National Press Club. The famous former chef was inspired to start the Maggie Beer Foundation to advocate for improved nutrition after visiting a number of facilities where she was \"often appalled\" by the food that was served there.\n\n\n\nFormer chef Maggie Beer spoke at the National Press Club on Wednesday where she described seeing \"appalling\" food being served in some aged care facilities. Source: AAP / Mick Tsikas \"What was missing was not only the joy in food, but the real belief in most places that beautiful food will make such a difference to the wellbeing of residents and pride of the teams,\" she said.\n\n\n\n\n\nBeer said that some of the best food she's eaten in aged care facilities were ones with strong links to countries with vibrant food cultures, such as the Italian, Greek and Vietnamese communities.\n\n\n\n\n\nHugo agrees that enjoyable food that connects with a person's cultural identity is a \"huge uplift to resident satisfaction\".\n\n\n\n\n\n\"Food is a reflection of identity, it triggers memories, particularly when you have residents living with dementia. It's something that can bring that spark back.\"\n\n\n\n\n\nResidents are also more likely to finish a meal and subsequently not lose weight, which Hugo says is crucial to older people's overall health as they age.\n\n\n\nMore than meatballs\n\nTasty and culturally appropriate food can bring other benefits too.\n\n\n\n\n\nWhile living in an Italian-focused aged care facility during her PhD research, Hugo saw that a successful meal was about more than its nutritional content.\n\n\n\n\n\n\"I remember having a meatball dish that was just delicious. But the thing that hit me was that often in an aged care space, it’s not a noisy space. But what really struck me at this one home were the animated conversations in Italian.\"\n\n\n\n\n\nIt appeared people were shouting at each other but Hugo discovered it was a heated debate about what constitutes the perfect meatball recipe.\n\n\n\n\n\n\"The food is there to nourish, but there's that social connection too. It's a social lubricant if you have a great meal or you see the menu displayed and people get excited, that in itself elicits conversation,\" she says.\n\n\n\nA traditional Hungarian székelykáposzta or sauerkraut goulash, where the fermented cabbage is cooked with the meat and served with a dollop of sour cream on top. Source: Supplied / Árpád Aged Care Similarly, at the Árpád facility in Melbourne, meal times are social events. Magdalena says that her daughter will often join her for dinner so they can enjoy the food together. They are planning to do so again next week for her 100th birthday.\n\n\n\n\n\n\"She has said to me she likes to come here and eat because it feels like being back home, like the restaurants in Budapest.\"\n\n\n\nRisottos against social isolation\n\nThere are also a growing number of culturally appropriate options catering to the older Australians who want to continue living independently at home.\n\n\n\n\n\nIn Adelaide, not-for-profit initiative Nonna's Cucina delivers home-cooked Italian food to 500 clients.\n\n\n\n\n\nCEO Marco Staltari says the service started 26 years ago out of concern for older members of the Italian community who were struggling to cook for themselves, and the meal services on offer \"didn’t really suit Italian tastebuds\".\n\n\n\n\n\nThey emphasise flavours that Italian migrants grew up with. Traditional creamy risottos cater to those with northern Italian heritage. For Italian Australians with heritage from the south, they prepare pipi e patate, a dish of capsicum and potatoes. They also provide texture-modified foods to support people who are at higher risk of choking.\n\n\n\nAdelaide-based charity Nonna's Cucina delivers 500 home-style Italian meals daily and helps to reduce social isolation for older members of the community staying at home. Source: Supplied / Nonna's Cucina \"When people are older and lose a bit of their memory, these flavours always bring you back to your home.\"\n\n\n\n\n\nTheir menu rotates every five weeks, which general manager Dario Fabretto says provides their clients more choice.\n\n\n\n\n\n\"When you get older and you can’t cook for yourself as much anymore, you might feel a bit hard done by or that it’s unfair that you can’t cook. And then you get told what you have to eat. So we try to provide as much variety as we can,\" Dario says.\n\n\n\nA feeling of home\n\nHugo says that being able to choose your meals, and feeling as if your preferences are being listened to, makes a significant impact in the quality of life for older Australians.\n\n\n\n\n\n\"It's about residents feeling like their preferences are heard and understanding that they feel safe and can share their feedback. [This] links to a sense of maintaining your agency and having a voice and input into your community ... It's what it is to be human.\"\n\n\n\n\n\nBack at Árpád Aged Care in Melbourne, Eva says she values the familiarity of home-cooked Hungarian meals.\n\n\n\n\n\n\"When you're young, you don't think about these things, but when you're getting older and your time is over, you are just looking for a place where you belong.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-fossil-finds-add-ancestors-and-a-puzzle-to-our-human-family-tree/w7rl9sxo1",
    "title": "INTERVIEW: Fossil finds add ancestors - and a puzzle - to our human family tree",
    "publish_date": "Sat, 16 Aug 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/personal-e-scooter-accidents-are-increasing-what-are-the-laws/ayhfyruih",
    "title": "Ava got an e-scooter for Xmas. A few months later, she was in a fatal accident",
    "publish_date": "Sat, 16 Aug 2025 20:32:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "The topic of e-scooters is a difficult one for Michael Seculovic.\n\n\n\n\n\nEarlier this month, he marked what would have been his daughter Ava's 15th birthday.\n\n\n\n\n\nShe died last year after being hit by a car while riding her e-scooter across a busy road in Perth.\n\n\n\n\n\nIn her dad's mind, Ava will always remain that 13-year-old girl on the precipice of taking on the world.\n\n\n\n\n\nShe had recently started at a new high school, which Seculovic was chuffed about, as it was the same school he had attended.\n\n\n\n\n\n\"She was a bright, beautiful girl,\" he tells SBS News.\n\n\n\nMichael Seculovic's daughter Ava was 13 years old when she died from severe head injuries sustained in an accident on her e-scooter. Source: Supplied / Michael Seculovic \"She was very friendly; it didn't matter who it was, when anyone came up to her and said 'hello, how are you?' she always replied with 'good, thank you. How are you?'\n\n\n\n\n\n\"She was just beautiful.\"\n\n\n\n\n\nAva had received her scooter as a Christmas present just a few months before the accident.\n\n\n\n\n\nSeculovic says he had nagged her and her friends to wear helmets many times, as required by state law in Western Australia, but it was often a struggle.\n\n\n\n\n\n\"It wasn't from a lack of trying, I had went and purchased another helmet, as she had said that she didn't like the one she had,\" he says.\n\n\n\n\n\n\"But also, no one else was wearing a helmet, and like many girls, they are worried about their hair.\"\n\n\n\nREAD MORE Call for scooter ban after Brisbane death\n\nTragically, Ava wasn't wearing one at the time of the accident.\n\n\n\n\n\nSeculovic has spent the past year reflecting on the regulations around e-scooters. He admits he wasn't fully aware of the legalities before his daughter's death.\n\n\n\nI was just going about everyday life, that was not really ever in front of me to know about.\n\nFor young people, e-rideables, such as e-scooters and e-bikes, represent an affordable and accessible means of transport — they are significantly cheaper than a car and can be used without a licence. Seculovic says he felt it offered his daughter some much-needed independence.\n\n\n\n\n\n\"It was her second year of high school, and she just wanted to have that sort of independence teenagers want,\" he says.\n\n\n\n\n\nBut as the devices have become more and more popular in Australia, so has debate over how to regulate them.\n\n\n\nAre e-bikes and e-scooters safe?\n\nParliamentary inquiries into e-rideables are taking place in WA and Queensland, following a rise in related accidents. Both will consider the benefits of the devices against issues regarding safety, regulation, enforcement and penalties.\n\n\n\n\n\nThe NSW government announced this week it is considering a temporary ban on the devices on public transport, pending community feedback, following two incidents in NSW and Victoria earlier this year, which involved e-rideable batteries catching fire.\n\n\n\n\n\nDeputy director of Monash University's Accident Research Centre (ARC), Professor Jennie Oxley, says incident rates have risen as the number of e-rideable users has grown.\n\n\n\n\n\n\"The rates of injuries and deaths are increasing, and a big part of that is exposure [in traffic and public spaces], because these e-rideables are becoming popular, of course we're going to see increased numbers of injuries,\" she says.\n\n\n\nREAD MORE Making a short trip? Why mopeds could be better for the environment than electric cars\n\nComparable state-based statistics on e-scooter-related injuries are not readily available.\n\n\n\n\n\nHowever, the ARC collects data on emergency department presentations and hospital admissions related to e-mobility devices, which Oxley says mirrors the situation across Australia.\n\n\n\n\n\nIn Victoria, between July 2017 and June 2023, there were 1,680 emergency department presentations related to e-scooter injuries.\n\n\n\n\n\nDuring the same period, e-scooter injury rates increased from 0.3 to 14.9 per 100,000 people, says Oxley, adding that the rate would likely have increased with the growth of e-scooter use over the past two years.\n\n\n\nThe Victorian data did not specifically break down deaths related solely to e-scooters; instead, it listed 14 deaths as a result of all e-mobility devices between 2016 and 2020, with half of these related to e-bikes, while the rest related to other self-balancing devices, including e-scooters.\n\n\n\n\n\nWA Police confirmed it had recorded one death related to e-scooters in 2023 and three in 2024.\n\n\n\n\n\nIn a submission to the inquiry into e-mobility safety in Queensland, the Australian Centre for Health Law Research said e-scooter incidents had resulted in at least eight deaths in Queensland in 2024.\n\n\n\n\n\n\"Between January 2021 and December 2024, 4,902 people presented to 31 Queensland participating emergency departments with injuries from e-scooter incidents, resulting in eight deaths in 2024 alone,\" it reads.\n\n\n\n\n\n\"These figures likely underestimate the true toll, as not all Queensland hospitals contribute data, and not all injured individuals seek treatment.\"\n\n\n\nAs more people use e-scooters, the incidents related to riding them have increased. Source: AAP / Luka Coch The submission noted that common injuries include fractures, dislocations and head trauma.\n\n\n\n\n\nSeculovic's daughter Ava suffered serious head injuries as a result of her accident in March 2024, which she later succumbed to.\n\n\n\n\n\nWhile laws in WA ban those under 16 from riding e-scooters on roads in Australia, it is not uncommon to see children in their early teens out and about in the suburbs of Perth on e-scooters.\n\n\n\nGrowing popularity of e-rideables\n\nDespite the risks, experts say e-rideables are here to stay.\n\n\n\n\n\nA 2023 report by cycling advocacy group WeRide Australia found that 3.6 million Australians had used an e-scooter in 2022 and that per capita usage was highest in WA and the ACT.\n\n\n\n\n\nThe increasing affordability of e-scooters in recent years has also fuelled growth in the number of Australians using them.\n\n\n\nWhile it is illegal to travel on an e-scooter with more than one person, it has become common practice to do so in some parts of Australia. Source: Getty / Steve Waters While some high-end models may set you back around $5,000, a new e-scooter can cost as little as $500.\n\n\n\n\n\nOxley says while e-rideables are largely used by people commuting to and from work or study, gig-economy workers, such as food and mail delivery drivers, also rely heavily on them.\n\n\n\nAround one in five Australians used an e-scooter in 2022. Source: SBS News Estimates compiled by University of Sydney professor of transport management Stephen Greaves indicate that Australians own about 400,000 personal e-scooters and mobility devices.\n\n\n\n\n\nThis is in addition to the thousands of e-mobility devices operating via share-ride schemes, which have been implemented in every capital city and across more than 25 local government areas.\n\n\n\n\n\nGreaves says they are a \"genuine alternative to motorised transport\".\n\n\n\n\n\n\"E-mobility devices, including scooters, open up the possibility for many of those trips that are maybe 2-5 kilometres, where you think, 'why are people driving cars for such distances?'\" he says.\n\n\n\n\n\nAustralian Electric Vehicle Association president Chris Jones says the boom in electric personal mobility is transformative and should be supported.\n\n\n\n\n\n\"These are some of the most accessible and affordable electric vehicles in the world, and they take up a fraction of the space of a car,\" he says.\n\n\n\nWe should be encouraging their uptake with sensible regulation.\n\nA submission to the Queensland inquiry from Brisbane West Bicycle User Group said that Queensland and the Brisbane City Council local government area are \"failing to capitalise on the congestion-busting benefits of micromobility, and particularly the increased accessibility\" afforded by e-mobility options.\n\n\n\n\n\nIt pointed out that in Brisbane, 56 per cent of all trips across all modes of transport between 2021 and 2024 were less than 5km in distance and that 75 per cent of trips under 5km were taken by car.\n\n\n\n\n\nThe group asked the inquiry to consider the benefits of e-mobility devices and their potential to replace the \"second or third family car\", which would \"have significant environmental benefits, both in terms of day-to-day emissions and pollution, but also reduced demand for road space and parking...\"\n\n\n\nInconsistent regulation\n\nFor the benefits of e-rideables to be fully realised, experts say better regulation needs to be enforced.\n\n\n\n\n\nLaws vary state by state and are overdue for an update, says Greaves.\n\n\n\n\n\nWhen e-scooters first entered the Australian market around 20 years ago, they fell into grey regulatory territory, he explains, as their integration into transport systems and roads had not been planned for.\n\n\n\n\"The origins of these rules came originally from AustRoads [a national agency representing state transport departments] ... They were talking about kids' scooters and skateboards and all those sorts of things,\" Greaves says.\n\n\n\n\n\n\"They classified them as recreational devices: the terminology was a 'wheeled recreational device' and it was then up to each state to figure out how they were going to manage that.\"\n\n\n\n\n\nGreaves says the variation between states has implications for whether devices can be used on roads or footpaths, age limits and registration requirements.\n\n\n\n\n\n\"For example, in NSW, we're not sure where scooters belong — some people consider them a kid's toy, others think of them as more of a moped. But, of course, they are not roadworthy as a motorcycle, so are illegal.\"\n\n\n\nIt's all a mess.\n\nWhile the NSW and Northern Territory governments have implemented laws that prohibit using personal e-scooters on public roads and footpaths, most other states permit their use under certain circumstances.\n\n\n\n\n\nA driver's licence is not needed to ride an e-scooter in jurisdictions where they are permitted in public areas, but riders often need to be above a certain age.\n\n\n\n\n\nIn WA and Victoria, riders must be at least 16 years of age to use an e-scooter in public spaces.\n\n\n\nQueensland allows those aged 12-15 to ride them as long as they are accompanied by an adult, while the ACT does not stipulate a minimum age; however, those under 12 must be accompanied by an adult.\n\n\n\n\n\nHelmets are generally required by law for public use, and certain activities, such as riding with more than one person or with a mobile phone in one hand, are not allowed.\n\n\n\n\n\nThere are also variations in enforceable speed limits. Riders in WA can travel on footpaths as long as they do not exceed 10km/h, while in Tasmania, it is 15km/h. It is illegal to ride an e-scooter on a footpath in Victoria.\n\n\n\n\n\nIn some states, the maximum speed for e-scooters in public areas is 20km/h; elsewhere, it is capped at 25km/h.\n\n\n\nRiding context and speed\n\nGreaves argues that regulation needs to be \"context dependent\" and take into account riding locations.\n\n\n\n\n\n\"In the inner city of Sydney, we have a decent bike network, and we have relatively low usage of those bike lanes. They should be allowed and that's what people expressed when we surveyed on this,\" he says.\n\n\n\n\n\n\"I think they're alright on local roads, where we are moving to the 40km/h default speed limits. I don't think they should be on main roads.\n\n\n\n\n\n\"Outside of the CBD, I think they should be allowed on footpaths. You go out into the suburbs and you might see two people walking on a footpath, [so] you've got this perfect infrastructure for e-scooters; let's use it for e-scooters and make it a shared path.\"\n\n\n\nTransport management professor Stephen Greaves says the local context needs to be considered when it comes to e-scooter regulations. Source: Supplied He says local governments should be engaged to help determine safe and appropriate contexts for e-rideables — but also speeds.\n\n\n\n\n\n\"Obviously, the state tries to set blanket rules around everything, but at the end of the day, the local jurisdiction needs to tweak those rules depending on the situation.\"\n\n\n\n\n\nIn March, Queensland Police warned consumers to be aware that some e-scooters being sold in Queensland exceeded the legal speed limits, which put them in a different category to personal mobility devices.\n\n\n\n\n\nGreaves says while imposing limitations on the speed of e-scooters might help to ensure those sold on the market comply with legal limits, he is aware that some e-scooter owners in Australia are making alterations to increase the speed of their devices.\n\n\n\n\n\n\"It's very easy to override that,\" he says.\n\n\n\nLISTEN TO New rules could soon ban charging of e-bikes in NSW apartments SBS News 00:50 English\n\nHe adds that implementing very low speed limits for e-scooters could take away their \"intrinsic appeal\" in helping people get from A to B faster than it would take to walk. It may also affect device operation.\n\n\n\n\n\n\"If you get below about 10 km/h it's actually quite hard to control it, it gets wobbly. There is a sort of sweet spot which is about 15km /h.\"\n\n\n\n\n\nBut Jennie Oxley from Monash points out that is the increased speed of e-scooters over walking as well as the slower interactions with traffic that add to the risk of injury.\n\n\n\nCompliance of e-mobility devices\n\nOne of the recommendations to come from a 2024 report from Monash University's ARC on injuries associated with e-scooters, e-bikes and other e-mobility devices was to \"increase police enforcement\" in an effort to deter \"noncompliant riding behaviours\".\n\n\n\n\n\nSBS News contacted police departments in each Australian state and territory to obtain recent data on e-ridable-related infringements; however, only WA and the ACT provided them.\n\n\n\n\n\nRaw numbers in the nation's capital reflect similar patterns to those in WA.\n\n\n\n\n\nWA officers recorded 303 infringements in regard to e-mobility devices between January 2024 and 7 October 2024 (when responsibility of collection of data moved to the Department of Transport) and a total of 510 infringements in 2023.\n\n\n\n\n\nAbout 85 per cent of those were related to helmets, and about 5 per cent were in relation to speeding.\n\n\n\nLaws around the use of e-scooters and other e-rideables differ from state to state. Source: Getty / BJP7images A WA Police spokesperson told SBS News: \"As with any vehicle, speed, drug and alcohol use and a lack of helmet use are contributing factors to the causes of serious injury or death involving ERDs [e-rideable devices].\n\n\n\n\n\n\"While infringements are an appropriate deterrent, they are only issued when the irresponsible or reckless rider is caught at that moment in time. The most effective way to deter irresponsible, dangerous and reckless operation of ERDs is to seize and destroy the vehicles.\"\n\n\n\n\n\nIn March, Queensland Police made a public appeal for people to take personal mobility device laws seriously, noting that between November 2022 and December 2024, more than 2,700 infringements were issued to riders for illegal road use.\n\n\n\n\n\nWhile e-bikes and e-motorbikes are categorised differently from e-scooters, there have been calls to mandate their registration and to legalise their use on roads.\n\n\n\nREAD MORE Faulty e-bike battery sparks Sydney apartment evacuation\n\nGreaves says research has shown community support for some sort of registration, insurance and licensing of e-mobility devices.\n\n\n\n\n\n\"There are a number of considerations to take into account, but such measures could potentially encourage more responsible ownership and riding,\" he says.\n\n\n\n'It really sucks'\n\nSeculovic remembers refusing to wear a helmet when riding his bike as a child, but strongly encourages anyone using an e-scooter to wear one.\n\n\n\n\n\nHe says parents with teens in particular face a challenge around e-scooter use.\n\n\n\n\n\n\"If you don't let them have one, do you then run the risk that they will then jump on the back of someone else's anyway?\" he says.\n\n\n\n\n\nDespite his personal grief over his daughter's death, Seculovic says banning scooters outright is not realistic.\n\n\n\nLook at all the road accidents, you can't just ban cars, can you?\n\nWhen a workmate recently expressed feeling conflicted about whether to allow their son to get an e-scooter, his only advice was: \"Go take him down to Wanneroo Road [northern Perth], and see Ava's cross.\"\n\n\n\n\n\n\"That's the end result, which could happen.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/trump-to-meet-with-zelenskyy-after-no-deal-reached-at-alaska-summit/099m7m1w9",
    "title": "Trump to meet with Zelenskyy after no deal reached at Alaska summit",
    "publish_date": "Sat, 16 Aug 2025 11:36:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAhead of the high stakes meeting with Vladimir Putin, US President Donald Trump said he would know within two minutes of meeting the Russian leader whether it would be a success.\n\n\n\n\n\nIt took almost three hours before the leaders emerged from the meeting behind closed doors.\n\n\n\n\n\nIt was the first face-to-face meeting between Mr Trump and Mr Putin since 2019, with the Russian leader ostracised by Western leaders since Russia's full-scale invasion of Ukraine in 2022.\n\n\n\n\n\nAfter their meeting, Mr Trump and Mr Putin emerged to speak before reporters in Anchorage, but they took no questions.\n\n\n\n\n\n\"I believe that we had a very productive meeting. There were many, many points that we agreed on - most of them. I would say. A couple of big ones that we haven't quite got there. But we have made some head way. There is no deal until there is a deal. I will call up NATO in a little while. I will of course call up President Zelenskyy.\"\n\n\n\n\n\nMr Trump later told Fox News that he rated the meeting a 10 out of 10 - even though he revealed no details of the points of agreement and disagreement.\n\n\n\n\n\n\"There is not that much. There is one or two significant items (of disagreement). But I think they can be reached. Not it is really up to President Zelenskyy to get it done. And I would also say the European nations. They have to get involved a little bit. But it is up to President Zelenskyy. And if they like, I will be at the next meeting. They are going to set up a meeting between President Zelenskyy, President Putin and myself, I guess. Not that I want to be there, but I want to make sure that it gets done. We have a pretty good chance of getting it done.\"\n\n\n\n\n\nIt is a change in the tone Mr Trump had a few weeks ago when he issued a August 8 deadline for Mr Putin to show a genuine commitment to a ceasefire - or face stronger sanctions.\n\n\n\n\n\nAt the post-meeting press conference, Mr Putin was keen to cast the meeting as a success for him - in receiving the invitation, but also on the prospect of a Russian-US economic reset.\n\n\n\n\n\n\"I expect that today's agreement will be the starting point - not only for the solution of the Ukrainian issue. But will also help us bring back business and pragmatic relations between Russia and the US.\"\n\n\n\n\n\nHe says he has not shifted in his position on the full-scale invasion in Ukraine.\n\n\n\n\n\n\"We're convinced that in order to make the settlement lasting long-term, we need to eliminate the primary roots, the primary causes of the conflict. And we have said it multiple times, to consider all legitimate concerns of Russia and to reinstate a just balance of security in Europe - and in the world on a whole.\"\n\n\n\n\n\nAnd at the end of the press conference, Mr Putin was eager to secure another meeting with the US President.\n\n\n\n\n\nDonald Trump: \"Thank you very much Vladimir.\"\n\n\n\n\n\nVladimir Putin: \"Next time in Moscow.\"\n\n\n\n\n\nDonald Trump: \"Oh, that's an interesting one! I will get a little heat on that one but I could see it possibly happening. Thank you very much Vladimir. Thank you all! Thank you!\"\n\n\n\n\n\nVladimir Putin: Thank you so much.\"\n\n\n\n\n\nMatthew Sussex is a fellow at the Australian National University's Strategic and Defence Studies Centre.\n\n\n\n\n\nHe says there was a lot of theatre and optics involved in the high stakes visit - and Mr Putin got what he wanted.\n\n\n\n\n\n\"Yes, it's certainly a win for Vladimir Putin. The optics of it were that, you know, he came to American territory, but American territory in Alaska, which of course previously was part of the Russian Federation and there was a lot of media talk in Russia and billboards going up saying, you know, Alaska is Russian and we will take that back. So he got a photo opportunity with Donald Trump. So it makes him look, look respected and valued and making the American president travel all the way to Anchorage to meet him. And at the same time, he basically dodges those sanctions that Trump had threatened.\"\n\n\n\n\n\nMark Cancian is a senior adviser at the Center for Strategic and International Studies in Washington DC.\n\n\n\n\n\nHe says despite the convivial language between Mr Trump and Mr Putin, the Alaska summit was planned haphazardly from start to finish.\n\n\n\n\n\n\"The press conference was startling - even bizarre - in the sense that the meeting was expected to last maybe six hours and broke up after about three. Then the press conference was called very abruptly. The journalists race into the room. The parties come on stage and speak their piece. Putin starts off and Trump responds, and then they trip off after a couple of minutes, they take no questions and Putin gets on his airplane, flies away. And I don't think anyone quite expected a result like that. On the other hand, the words spoken were very friendly. Both Putin and Trump were encouraging about the future, but vague. And this is clearly the first step on, you know, what could be a long journey.\"\n\n\n\n\n\nHe says negotiations to end wars can take a long time to finalise, but there is a positive for Ukraine in that the worst outcome was avoided.\n\n\n\n\n\n\"Another encouraging thing was Trump saying that the Europeans and Ukraine, President Zelenskyy, had to be part of this agreement, and that had not come through quite clearly again about a week ago. The concern is that the pressure will go on to Zelenskyy to give up territory, to make an end to the conflict and get it over with as Trump would say. The Ukrainians are very reluctant to give up territory.\"\n\n\n\n\n\nUkrainian leader Volodymyr Zelenskyy says he has been briefed on the Alaska meeting in a phone call with Mr Trump.\n\n\n\n\n\nThe call also ended with an invitation for him to come to Washington DC on Monday (18 August local time).\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-to-know-about-the-rare-brain-eating-amoeba-found-in-australian-tap-water/awfblr3lr",
    "title": "What to know about the rare 'brain-eating' amoeba found in Australian tap water",
    "publish_date": "Sat, 16 Aug 2025 06:30:43 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "One of the world’s most dangerous water-borne microorganisms, commonly called a \"brain-eating amoeba\", has recently been detected in two drinking water supplies in south-west Queensland.\n\n\n\n\n\nBoth affected towns are about 750 kilometres west of Brisbane: Augathella (population roughly 300) and Charleville (population 3,000).\n\n\n\n\n\nDuring an analysis of water samples commissioned by Queensland Health, Naegleria fowleri was detected in the water systems of two health facilities, one in Charleville and one in Augathella, as well as in the incoming town water supply at both facilities.\n\n\n\n\n\nThe Shire Council of Murweh, which takes in the two affected locations, issued a health notice for residents and visitors on August 7 warning of the detection of N. fowleri in the water supplies.\n\n\n\n\n\nSo what is this organism? And how significant is the risk likely to be in these Queensland towns, and elsewhere?\n\n\n\nWhat is the brain-eating amoeba?\n\nThe N. fowleri amoeba is a microscopic organism found around the world. It only lives in warm freshwater, generally between 25 and 40°C. This can include ponds, lakes, rivers, streams and hot springs.\n\n\n\n\n\nIf someone is infected with N. fowleri , it causes what’s called primary amoebic meningoencephalitis, a serious infection of the brain.\n\n\n\nREAD MORE Alana felt good about donating her eggs until she realised her sexuality was an issue\n\nSymptoms include a sore throat, headache, hallucinations, confusion, vomiting, fever, neck stiffness, changes to taste and smell, and seizures.\n\n\n\n\n\nThe incubation period of primary amoebic meningoencephalitis — the time between infection and symptoms appearing — typically ranges from three to seven days.\n\n\n\n\n\nTragically, this illness is nearly always fatal, even if someone receives medical attention quickly. Death typically occurs about five days after symptoms begin.\n\n\n\n\n\nFortunately though, cases are very rare. In the United States, there were 167 reported cases of primary amoebic meningoencephalitis between 1962 and 2024, according to the Centers for Disease Control and Prevention. Only four survived.\n\n\n\n\n\nA global review of the disease up to 2018 reported that, of 381 known cases, Australia accounted for 22, the fifth highest number, after the US, Pakistan, Mexico and India. Some 92 per cent of people died.\n\n\n\nHow do people get infected?\n\nThe route of infection is very unusual and quite specific. N. fowleri infects the brain through a person’s nose. The amoeba then passes through a protective membrane called the nasal epithelium.\n\n\n\nThis is an important physical barrier and allows the amoeba to travel to the brain through the olfactory nerve, which is responsible for our sense of smell. The infection then kills brain tissue and causes swelling of the brain, termed cerebral oedema.\n\n\n\n\n\nInfections occur in people when infected water travels up their nose. Most cases involve children and young people who have swum in infected waters. The majority of cases occur in males, with an average age of 14.\n\n\n\n\n\nEven water sports in affected waterways can be dangerous. A person is currently in intensive care in Missouri after it’s believed they became infected while water skiing.\n\n\n\n\n\nRegarding the recent detection in Queensland water supply systems, the source of the infection has not been reported. It’s possible a fresh waterway, or groundwater, which feeds into the affected drinking water systems, was contaminated with N. fowleri , and the amoeba travelled from there. But this will likely be determined with further investigation.\n\n\n\nIs it dangerous in drinking water?\n\nFirst, it’s important to note you can’t get primary amoebic meningoencephalitis from drinking contaminated water.\n\n\n\n\n\nBut any activity that allows infected water to enter a person’s nose is potentially dangerous. This can happen during a bath or a shower.\n\n\n\nSome people flush their nasal passages to clear congestion related to allergies or a viral infection. This has been linked to infections with N. fowleri . If you’re going to flush your nasal passages, you should use a sterile saline solution.\n\n\n\n\n\nEven young children playing with hoses, sprinklers or water activities could be at risk. A 16-month-old child was fatally infected following an incident involving a contaminated water \"splash pad\" in the US in 2023. Splash pads are water-based recreation activities, primarily for young children, that involve splashing or spraying water.\n\n\n\nWhat is the risk in Queensland?\n\nRegarding N. fowleri , Australian drinking water guidelines advise:\n\n\n\n\n\n\"If the organism is detected, advice should be sought from the relevant health authority or drinking water regulator.\"\n\n\n\n\n\nThe guidelines also provide recommendations on how to disinfect water supplies and control N. fowleri , using chlorine and other chemical compounds.\n\n\n\n\n\nAll public town water supplies across Australia are regularly tested to ensure that water is safe to drink.\n\n\n\nREAD MORE Albanese government moves ahead with election pledge to cap prescription medicines to $25\n\nWe don’t yet know the exact cause of the detection of the amoeba N. fowleri in these Queensland towns’ water supplies. But drinking or cooking with water contaminated with this amoeba will not cause an infection.\n\n\n\n\n\nAny activity that allows potentially contaminated water to go up the nose should be navigated carefully for now in the affected areas.\n\n\n\n\n\nContamination of a town drinking water supply from this amoeba is very rare and is unlikely in other Australian town water supplies.\n\n\n\n\n\nTo reduce your risk in potentially infected warm, fresh waters you should keep your head above water while swimming. And don’t jump or dive in. You can use a nose-clip if you want to swim with your head under water.\n\n\n\n\n\nThe amoeba cannot survive in salt water, so there’s no risk swimming in the ocean. Also, properly maintained swimming pools should be safe from the organism.\n\n\n\n\n\nNew South Wales Health advises that the amoeba cannot survive in water that is clean, cool and adequately chlorinated.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/global-plastics-treaty-negotiations-fall-apart/s4bavwv7g",
    "title": "'Disappointed and angry': How negotiations for a global plastic treaty fell apart this week",
    "publish_date": "Sat, 16 Aug 2025 05:17:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Talks to strike a landmark global treaty on plastic pollution fell apart on Friday, leaving many frustrated and some calling it a \"missed opportunity\".\n\n\n\n\n\nNegotiators from 185 nations met in Geneva last week to try and draft the world's first legally-binding treaty to deal with the growing global issue of plastic pollution.\n\n\n\n\n\nDespite working beyond Thursday's deadline and through the night, the talks were ultimately futile and nations could not reach a consensus.\n\n\n\n\n\nA large bloc of nations including the European Union, Britain and many African and Latin American countries called for curbing plastic production and phasing out toxic chemicals used in plastics.\n\n\n\nHowever, a smaller group of oil-producing states including Saudi Arabia, Kuwait and Russia argued instead for waste management.\n\n\n\n\n\nThese countries railed against the negotiations being based on the entire life-cycle of plastic: from the petroleum-derived substance through to waste.\n\n\n\n\n\nWhile around 100 nations sought caps on plastic production, a number of countries including the United States stood against them and argued caps were unnecessary and a threat to their economies and industries.\n\n\n\nWhile a large number of nations argued for caps on plastic production others, including the US, stood against them. Source: AAP / Martial Trezzini/EPA\n\n'Missed a historic opportunity'\n\nRepresentatives of countries voiced anger and despair as the talks unravelled, but said they wanted future negotiations — despite six rounds of talks over three years now having failed to find agreement.\n\n\n\n\n\n\"We have missed a historic opportunity but we have to keep going and act urgently,\" said Cuba.\n\n\n\n\n\nColombia added: \"The negotiations were consistently blocked by a small number of states who simply don't want an agreement.\"\n\n\n\n\n\nTuvalu, speaking for 14 Pacific small island developing states, said: \"For our islands this means that without global cooperation and state action, millions of tonnes of plastic waste will continue to be dumped in our oceans, affecting our ecosystem, food security, livelihood and culture.\"\n\n\n\n\n\nFrance's ecological transition minister Agnes Pannier-Runacher said she was \"disappointed\" and \"angry\" and blamed a handful of countries \"guided by short-term financial interests\" for blocking an ambitious treaty.\n\n\n\n\"Oil-producing countries and their allies have chosen to look the other way,\" she said.\n\n\n\n\n\nGraham Forbes, the head of Greenpeace's delegation to the talks called the collapse of negotiations a \"wake up call for the world\".\n\n\n\n\n\n\"The vast majority of governments want a strong agreement, yet a handful of bad actors were allowed to use process to drive such ambition into the ground. We cannot continue to do the same thing and expect a different result. The time for hesitation is over,\" he said.\n\n\n\n\n\nEnvironmental NGOs also warned that without radically changing the process to better reflect the majority view, future talks will hit the same dead end.\n\n\n\n\n\nDavid Azoulay from the Center for International Environmental Law's David Azoulay said the talks had been an \"abject failure\" because some countries were out to \"block any attempt at advancing a viable treaty\".\n\n\n\n\n\nThe World Wide Fund for Nature said the talks exposed how consensus decision-making \"had now \"outplayed its role in international environmental negotiations\".\n\n\n\nWhat happens now?\n\nOil-producing nations argued that recycling, reuse and product design were sufficient to address the problem of global plastic pollution without resorting to production cuts.\n\n\n\n\n\nHowever, experts say these are not substantial answers to the issue.\n\n\n\n\n\nIngar Andersen, executive director of the United Nations Environmental Programme (UNEP), which hosted the talks, has said the world \"will not recycle our way out of the plastic pollution crisis\".\n\n\n\n\n\nMore than 400 million tonnes of plastic are produced globally each year, half of which is for single-use items.\n\n\n\n\n\nWhile 15 per cent of plastic waste is collected for recycling, only nine per cent is actually recycled.\n\n\n\nREAD MORE The tiny particles infiltrating our bodies and causing big problems for Australia\n\nThe future of the UNEP negotiations is now uncertain and while some countries have committed to resuming negotiations, others expressed that they have lost faith after repeated attempts.\n\n\n\n\n\nAndersen also pledged to continue work. \"We did not get where we want but people want a deal,\" she said.\n\n\n\n\n\nOn current trends, annual production of fossil-fuel-based plastics will nearly triple by 2060 to 1.2 billion tonnes, while waste will exceed one billion tonnes, according to the Organisation for Economic Cooperation and Development.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/national/three-charged-after-melbourne-dad-allegedly-attacked-with-machete-20250818-p5mnsv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Three charged after Melbourne dad allegedly attacked with machete",
    "publish_date": "Mon, 18 Aug 2025 12:23:53 +1000",
    "category": "finance",
    "authors": [],
    "text": "Three charged after Melbourne dad allegedly attacked with machete\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/inside-commentary-box-for-incredible-wallabies-comeback-20250818-p5mnsm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside commentary box for incredible Wallabies comeback",
    "publish_date": "Mon, 18 Aug 2025 12:13:45 +1000",
    "category": "sports",
    "authors": [],
    "text": "Inside commentary box for incredible Wallabies comeback\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/property/news/first-home-buyer-makes-aggressive-bid-to-buy-thornbury-property-in-less-than-a-minute-20250817-p5mnm1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "First home buyer makes aggressive bid to buy Thornbury property in less than a minute",
    "publish_date": "Mon, 18 Aug 2025 11:58:01 +1000",
    "category": "finance",
    "authors": [
      "Shona Hendley"
    ],
    "text": "A first-home buyer attempted a knockout bid for a Thornbury unit in an auction that lasted less than a minute on Saturday, paying $1,040,000 for the renovated property.\n\nThe aggressive bidding for 1/79 Fyffe Street, which is on a larger allotment, pushed the price $110,000 over its reserve of $930,000.\n\nGuided at $840,000 - $880,000, the auction was hot from the get-go, selling agent Luke Brizzi from McGrath Northcote said.\n\n“The bidding was strong, and it was quick,” he said of the two-bedroom home.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/business/companies/qantas-hit-with-90-million-penalty-for-illegal-sacking-of-1800-workers-20250815-p5mn9t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Wrong kind of sorry’: Qantas hit with $90m penalty for illegally sacking 1800 workers",
    "publish_date": "Mon, 18 Aug 2025 11:50:11 +1000",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "Lee accepted that Qantas was sorry for the illegal outsourcing, but he wasn’t convinced the measure of regret was “significant” and described it as “the wrong kind of sorry”. He pointed to efforts within Qantas to obscure the decision-making process for the firings, the willingness of Qantas to actively appeal the court’s decisions before being able to fully review them, and the decision not to have Vanessa Hudson, the former CFO, testify in court. Hudson has been CEO since Joyce stepped down in 2023. On the $90 million penalty he ordered Qantas to pay the TWU, Lee said: “It does not strike me as intuitively wrong that greater rewards might be appropriate for circumstances of greater risk.” The payment of at least a large part of the penalty to the union was “warranted”, he said, adding that he was “satisfied that such a course will facilitate and promote the specific and general deterrence”.\n\n“It will send a message to Qantas and well-resourced employers that, not only will they face potentially significant penalties for the breach of the [Fair Work] Act, but those penalties will be provided to trade unions to resource those units to fulfil their statutory roles as enforcers of the Act,” he said. The decision was announced at a Federal Court hearing on Monday, following a verdict in the Federal Court in December. Qantas is yet to comment on the penalty. The TWU had sought the maximum penalty of $121 million, while Qantas was seeking a fine between $40 million and $80 million. The union had asked to be the recipient of the full sum. The case marks a significant win for the TWU at a time when the conditions of wages and work are being debated in the post-COVID economy. Qantas aircraft stand on the tarmac at Sydney Airport during the COVID lockdown in 2020. Credit: Bloomberg\n\nThe penalty is in addition to the $120 million Qantas has already agreed to pay in compensation to the illegally fired workers. TWU national secretary Michael Kaine said: “Today’s decision is a final win for both those workers and the tens of thousands of other TWU members who backed them every step of the way. “They weren’t just sacked, they were told by Qantas that they were delusional for questioning it,” Kaine continued. “This ruthless, self-interested and illegal calculation to kick them to the curb has rightfully merited the largest ever penalty of its kind.\n\nLoading “Qantas is only sorry now that it has to pay the largest penalty fine of any employer in Australian corporate history.” Stephen Smith, principal of Actus Workplace Lawyers, which specialises in employment law said: “The sheer size of the penalty awarded to the TWU in this case will no doubt encourage the TWU and other unions to pursue speculative claims against employers.” In the future, Smith said unions will be able to pursue much larger maximum penalties because civil penalties under the Fair Work Act have recently increased.\n\nAfter the 2020 sackings, the TWU immediately challenged the decision in court, and it was found the following year that Qantas had acted illegally “in part motivated by a desire to prevent the employees taking protected industrial action in the future”. Former Qantas CEO Alan Joyce. Credit: Eamon Gallagher Qantas appealed the case to the Supreme Court, which unanimously dismissed it, in a win for the TWU. In December 2024, Qantas agreed with the TWU to pay $120 million in compensation to the 1820 ground staff whose contracts were terminated, including 1700 workers who lost their jobs outright, as well as 120 who were redeployed within Qantas but suffered non-economic losses.",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/sport/afl/aflw-weekly-live-round-one-blues-pies-name-teams-for-season-opener-20250813-p5mmlw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I don’t recommend it’: Harris back and joking after hospital visit; Big names attempt the ‘Centra’",
    "publish_date": "Mon, 18 Aug 2025 11:48:59 +1000",
    "category": "sports",
    "authors": [
      "Hannah Kennelly",
      "Roy Ward",
      "Melissa Coulter Ryan"
    ],
    "text": "It was a jam-packed weekend for the opening round of AFLW’s milestone 10th season. We’ve rounded up some of the best moments you might have missed.\n\n1. Seems everyone’s trying to ‘do a Centra’\n\nCollingwood rookie and last year’s No.1 draft pick Ash Centra might have only had three touches during her debut, but the young gun still managed to kick a goal. However, it was her pre-game actions on Thursday night that had everyone talking.\n\nCentra skilfully bounced the footy between her legs like a basketball, inspiring many others (including Hawthorn coach Sam Mitchell and Pies men’s players Nick Daicos, Jack Crisp and Darcy Cameron) to try and mimic the tricky move.\n\n“She’s [Centra] got a cult-following,” Collingwood coach Sam Wright said after their loss to Carlton.\n\n“Every time, she got the ball … you could hear the crowd. I just think it’s so great for our game. I mean, the long sleeves, you see her coming from a mile away.\n\n“I was really happy for her that she kicked that goal, she’s going to be a serious player.”\n\n2. ‘I’ll wear a helmet and a ski mask’: Harris jokes after eye injury\n\nTayla Harris wasn’t in the game long before suffering an eye injury but did have time to take a trademark speccy. Credit: Getty Images\n\nStar Melbourne ruck-forward Tayla Harris says she is “100 per cent good to go” for the rest of the season after suffering an eye injury during Saturday night’s clash against the Bulldogs.\n\nAfter pulling off a trademark speccy just moments earlier, Harris copped an arm to her face in a marking contest with Bulldogs counterpart Alice Edmond.\n\n“I obviously had to go to hospital to get some expert opinion, and yeah, all good from that point of view, I’ll get an appointment with the specialist ASAP and just clear up anything else and make a plan moving forward,” Harris said on Monday morning.\n\n“But I’m feeling good, obviously thankfully avoided anything major, but not ideal to poke yourself in the eye, I don’t recommend it.”\n\nHarris confirmed there was damage to her eyeball and said she was taking eye drops to accelerate the healing process.\n\n“I’ll do whatever I’m told,” she continued. “As long as I can play, I’ll be wearing whatever’s needed, I’ll wear a helmet and a ski mask if I need to.”\n\n3. Snoop Dogg might commentate AFLW, but some aren’t pleased\n\nAFL chief executive Andrew Dillon told Fox Footy on Thursday night that there were plans to have grand final pre-game performer Snoop Dogg involved in AFLW.\n\n“Snoop has to bring it on grand final day but what he does in the lead-up is super important as well,” Dillon said.\n\n“Whether that is commentating on an AFLW game or not, I’m not sure. But we want to get the game in front of him and get his thoughts.”\n\nSnoop Dogg has been hired by the AFL to perform at the grand final on September 27. Credit: Getty Images\n\nHowever, Respect Victoria chair Kate Fitz-Gibbon, who was instrumental in the creation of Australia’s National Plan to End Violence Against Women and Children, described the AFL’s choice of Snoop Dogg as a “grave mistake” given his “public history of boasting about violence against women”.\n\n“It is unfathomable that the AFL would deem this artist [as] an appropriate choice for its flagship event,” Fitz-Gibbon said.\n\n“Sport has enormous power to influence culture. By elevating an artist with a track record of degrading women, the AFL risks sending the message that misogyny is entertainment.”\n\nRead more here.\n\n4. Molloy makes a stunning return\n\nChloe Molloy played a starring role in her long-awaited return to the AFLW, firing Sydney to a 20-point win over Richmond.\n\nThe Swans co-captain slotted four goals on return from a knee reconstruction. She tore her anterior cruciate ligament at training in September 2024 – just one game into last season.\n\nThe 26-year-old picked up where she left off, combining well with maturing midfielder Montana Ham (18 disposals, six score involvements) in front of 4126 fans.\n\n5. Zippy by name and nature: Young Swan stuns on debut\n\nAll eyes were on Swan debutant Zippy fish during Sydney’s clash against Richmond on Friday night. As the Larrakia, Wongi, Noongar and Nunga woman told The Age last year, “it would be a bit awkward if I was slow”.\n\nWestern Australian AFLW player, Zipporah “Zippy” Fish. Credit: Tony McDonough\n\nFish, drafted with pick No.5 last year, lived up to her name, flaunting her blistering pace from half-back. She finished with 25 disposals and nine intercept possessions\n\nShe missed the record for possessions on debut by just one.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/pick-up-the-phone-popa-socceroos-could-lose-another-rising-star-to-croatia-20250817-p5mnl9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pick up the phone, Popa: Socceroos could lose another rising star to Croatia",
    "publish_date": "Mon, 18 Aug 2025 11:46:43 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "It’s not an empty threat. Croatia is closely monitoring Segecic, and has already poached another of Australia’s rising stars, with goalkeeper Anthony Pavlesic - who, like Segecic, was born and raised in Sydney and played youth international football for Australia - electing earlier this year to represent the nation of his family’s heritage. Pavlesic, 19, this week sealed a transfer from Bayern Munich to Croatian club NK Rudes, whose chairman is Josip Simunic, another born-and-bred Aussie who famously turned his back on the Socceroos. Meanwhile, Popovic’s policy of refusing to “sell” the Australian jersey to players eligible to represent other countries may have cost him another top talent in Sunderland’s Nectar Triantis, the former Central Coast Mariners star who has had his switch from Australia to Greece approved by FIFA. Triantis, 22, was called up by the Socceroos in March but was not used, and his negative experience in camp contributed to his decision, according to sources close to him. The last time Popovic spoke to Australian media, he warned that the country’s budding young stars had to “earn” their call-ups, saying: “It’s not about, ‘OK, I heard some guy scored two goals and yeah, great, we’ll just give them a call to the national team.’ It doesn’t go like that.”\n\nLosing Segecic, if it were to happen, would sting even more because he is a rare talent in a part of the field where the Socceroos desperately need new impetus. In fact, it could be argued that Segecic - who finished tied with former Adelaide United striker Archie Goodwin for the A-League’s golden boot last season - is the most in-form Australian attacker anywhere in the world. He has had a direct hand in all three of the goals scored by Portsmouth so far this term, his latest involvement being a spectacular strike from outside the box to claw one back in a 2-1 defeat to Norwich City. For those who watched him in the A-League, it was a familiar highlight, with Segecic possessing the sort of swagger that makes him unafraid to swing his dangerous left foot at distance if the opportunity presents itself. “I feel like these days, a lot of young kids don’t believe in themselves,” he said. “It’s a bit more robotic ... you don’t see the old-fashioned No.10 types. As a young player coming through, the hardest thing is to have confidence and believe in yourself. I feel like if you tell yourself you’re going to go out there, and you’re going to do it, and you’ve put the hard work in, there’s a good chance that it can happen. If you don’t back yourself, and you don’t take that shot, you’re never going to score … if you do, it could be the difference in the game.”\n\nThere will be an immense sense of pride in Segecic’s journey from a Sydney FC perspective, given he joined the club’s academy at the age of 12, but also pain. Firstly, because the Sky Blues won’t be able to cash in on Segecic’s rise because they lost him to Portsmouth on a free transfer, pocketing under $1 million in training compensation for him, with no sell-on clauses retained - and secondly, because his trajectory suggests that had coach Ufuk Talay started him more often last season, they might have made the A-League finals. Loading He has signed a three-year deal with Portsmouth, and their decision to hand him the coveted No.10 jersey is a sign of the high esteem held in him by manager John Mousinho, who has scoured the A-League for diamond-in-the-rough recruits. Three other Australians are also at the club: Segecic’s former Sydney FC teammate Hayden Matthews, ex-Brisbane Roar striker Thomas Waddingham and Central Coast Mariners product Jacob Farrell. “He must love the A-League,” Segecic said. “From the minute I spoke to him, I just felt like that’s a manager I’d love to play under. He gave me goosebumps. It’s someone that you’d love to fight for and do well for. He said he saw me playing in that No.10 role, and like you saw in the A-League, that’s where I can cause the most damage. As soon as he said that, that was me sold.”",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/david-campese-said-wallabies-coach-joe-schmidt-had-no-idea-what-does-he-think-now-20250818-p5mnoy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "David Campese said Wallabies coach Joe Schmidt had ‘no idea’. What does he think now?",
    "publish_date": "Mon, 18 Aug 2025 11:44:00 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Wallabies great David Campese says he is “eating humble pie” after declaring coach Joe Schmidt had “no idea” on the eve of Australia’s historic victory over South Africa.\n\nCampese also revealed he planned to quit social media after he and his family were subjected to a torrent of abuse following the Wallabies’ 38-22 triumph at Ellis Park, which snapped a 62-year losing streak at the venue.\n\nIn the lead-up to Australia’s Rugby Championship opener in Johannesburg, the outspoken former winger took a shot at Schmidt over his Wallabies selections, which included installing James O’Connor at No.10 after Tom Lynagh, who started in all three Lions Tests, was ruled out with concussion.\n\n“I can see why Joe Schmidt has never won a RWC [Rugby World Cup]. He has no idea about rugby. Clueless. This shows us why,” Campese wrote on X to his 23,000 followers.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/victoria/the-rise-and-rise-of-the-melbourne-bathhouse-20250815-p5mn73.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The rise and rise of the Melbourne bathhouse",
    "publish_date": "Mon, 18 Aug 2025 11:39:17 +1000",
    "category": "finance",
    "authors": [
      "Cara Waters"
    ],
    "text": "The ancient Greeks were all over it, the Japanese have long been advocates, and now Melburnians are realising the joys of soaking in a bathhouse.\n\nIn 2021, Freya Berwick opened Sense of Self in a former industrial warehouse in Collingwood with a heated mineral pool, sauna, cold plunge pool and hammam; since then, a swath of other bathhouses have opened across the city.\n\nFreya Berwick founded the Sense of Self bathhouse in Collingwood and says people are looking for alternatives to the pub. Credit: Simon Schluter\n\nBerwick says people are seeking out healthier lifestyles and ways to connect with people, which communal bathhouses can provide.\n\n“I think people are looking for alternatives to the pub or, going back further, the church,” she says. “Historically, we had places where we would convene and connect, and the increase in social media sort of disrupted that because we have different ways of connectedness through our phones.”",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/lifestyle/relationship-expert-reveals-the-secret-to-keeping-the-spark-alive-20250818-p5mns7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Relationship expert reveals the secret to keeping the spark alive",
    "publish_date": "Mon, 18 Aug 2025 11:34:22 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Relationship expert reveals the secret to keeping the spark alive\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/nsw/absolutely-world-beating-how-a-year-of-metro-has-shaken-up-the-way-sydney-moves-20250728-p5miee.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Absolutely world beating’: How a year of metro has shaken up the way Sydney moves",
    "publish_date": "Mon, 18 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Matt O'Sullivan",
      "Cindy Yin"
    ],
    "text": "Daily weekday trips at North Sydney station have more than halved to 12,200, while patronage at St Leonards has fallen by a third, and by more than a tenth at Wynyard and Town Hall. Sydney transport expert Mathew Hounsell said the metro line had proven to be “absolutely world beating” in how it had encouraged people to use it consistently. “It helped bring the city back from the edge after COVID because you now have the whole northwest and north shore able to get into the city quickly,” he said. “It should serve as an example for the whole country that if you build frequent, reliable transport, people will use it.”\n\nCrows Nest resident Charlie Smith said the metro was “life-changing” for his commute between work, home and university. “It’s just so convenient to get everywhere, and the stations are so pretty. It’s so fast and comes every four minutes – it’s 10 minutes into the city, 10 minutes to Macquarie Uni where I study, and it’s just perfect,” he said. Martin Place metro station is consistently surpassing patronage forecasts. Credit: Sam Mooy Commuters will have to wait until at least April next year for the M1’s final stage between Sydenham and Bankstown to open, which has been blamed on the complexity of converting the old T3 heavy rail line to metro train standards and disruptions from industrial action. Regan said a higher frequency of services than on the former T3 rail line, together with much faster journeys between Sydenham and the CBD and north shore, was forecast to boost patronage on the M1 line.\n\n“At the moment, it’s quite asymmetrical. The patronage in the morning peaks is very heavily from the north, and less coming up from Sydenham,” he said. Loading “But once the Bankstown line is opened, it will be much more balanced because you’ll have an extra 10 stations picking up people from the south.” Regan said it was expected to lead to similar passenger loads on the M1 line to and from the south-west to what was already experienced on services between the northwest and the CBD. “You’ll have a very balanced load in both directions,” he said. While Martin Place and Gadigal have surpassed expectations, Waterloo and Crows Nest stations continue to lag patronage forecasts.\n\nAt Waterloo, planned development around the station has been slower than originally forecast. “In COVID, everyone got a bit nervous about commercial so they switched it to [residential],” Regan said. “Now they’re looking at the timing of it. Some of the development directly on our site has taken longer.” Loading Similarly, at Crows Nest, it has taken time for some developments along the Pacific Highway to be completed. “You can really see it starting to accelerate now, and the housing developments directly above the station are now being marketed,” Regan said. Trains run every four minutes in both directions on the M1 line during weekday peaks between about 7am and 10am, and from 3pm to 7pm. They operate every five minutes from 10am to 3pm, and every 10 minutes at other times. Regan said a boost to train frequencies before 7am on weekdays was “definitely an option” if patronage kept growing, and was possible with the existing 45-strong fleet.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/politics/nsw/sydney-s-great-baby-divide-how-fertile-is-your-suburb-20250815-p5mnc5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney’s great baby divide: How fertile is your suburb?",
    "publish_date": "Mon, 18 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Matt Wade"
    ],
    "text": "A stark baby divide has become entrenched in Sydney as the number of births climbs in the western suburbs but nose-dives in many of the city’s most affluent areas.\n\nDuring the past decade, births have fallen by 20 per cent or more in the eastern suburbs, north shore, northern beaches and inner west districts while rising solidly in the Blacktown, outer west and south-west regions.\n\nThe number of babies born in Greater Sydney peaked in 2018 at 70,400, but has been below that figure every year since, analysis of preliminary births data by KPMG shows.\n\nIn 2024, there was a modest 1.1 per cent lift in births to 60,310 thanks to western Sydney; the top 30 suburbs for new babies were all in that region.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/shark-attack-at-nsw-beach-20250818-p5mns0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Shark attack at NSW beach",
    "publish_date": "Mon, 18 Aug 2025 11:29:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "Shark attack at NSW beach\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/afl/your-guide-to-round-24-the-games-that-will-shape-the-top-eight-20250815-p5mn6o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Your guide to round 24: The games that will shape the top eight",
    "publish_date": "Mon, 18 Aug 2025 11:23:47 +1000",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "Well, it’s come down to this. The final home-and-away round – plus a rescheduled fixture – with so much still to play for as nine teams jostle for eight positions.\n\nSo tight is the race that only six premiership points separate the third-placed Brisbane Lions from the ninth-placed Suns, with four teams equal on 15 wins, separated by 14.5 percentage points.\n\nFinals contenders: Sam Darcy, Nick Daicos and Nick Watson. Credit: Aresna Villanueva/Getty Images\n\nThe surging Crows, meanwhile, have one hand on top spot, and the McClelland Trophy – the AFL’s least appreciated team award. Geelong have one hand on second.\n\nCollingwood, who were 10 points clear on top a month ago, have crashed to the point they could even slip from the top four should they lose to Melbourne, while Brisbane’s home clash against Hawthorn on Sunday night shapes as an early final.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/property/news/waterfront-northern-beaches-home-sells-for-700k-above-9-million-reserve-20250817-p5mnma.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Waterfront northern beaches home sells for $700k above $9 million reserve",
    "publish_date": "Mon, 18 Aug 2025 11:20:47 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "Six families registered for a northern beaches deep waterfront property in Mona Vale, with the winning bidder paying $700,000 above its reserve at auction on Saturday.\n\nThe six-bedroom sandstone residence located at 68 Rednal Street comes with panoramic Pittwater views and level access to a private jetty and pontoon. It was guided at $8 million.\n\nBidding opened at $8 million, and four buyers were active. Bids of $50,000, $25,000 and $10,000 were placed until the property was called on the market at $9 million.\n\nBids of varying increments continued until it sold under the hammer for $9.7 million, which was $700,000 above its $9 million reserve. There is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://au.news.yahoo.com/aussie-drivers-hit-with-41000-in-fines-as-new-speed-cameras-begin-enforcement-020933632.html",
    "title": "Aussie drivers hit with $41,000 in fines as new speed cameras begin enforcement",
    "publish_date": "2025-08-18T02:09:33Z",
    "category": "finance",
    "authors": [],
    "text": "Despite raising plenty of revenue in the first seven days, Tasmanian authorities say there was a roughly 70 per cent reduction in speeding incidents.\n\nSpeeding driver in Hobart have been told to cough up $41,000 in the first week since the cameras went live. Source: Pulse Tasmania\n\nMore than $40,000 in fines have been handed down in just the space of a week in one Aussie state as new hi-tech road cameras were switched to enforcement mode at the start of this month.\n\nAfter more than two years of construction, the most expensive transport infrastructure project in Tasmania's history opened to commuters in June. At 1.2-kilometres, the Bridgewater Bridge is built across the River Derwent in Hobart and was fitted with speeding cameras which are now handing out serious fines.\n\nSince the grace period ended at the start of August, 246 motorists have been issued a speeding fine relating to the very first week of enforcement, the Department of State Growth confirmed to Yahoo News on Monday.\n\nProvided that all fines are eventually paid, that's $41,410 of revenue just from the period of August 1 to August 7.\n\nADVERTISEMENT\n\nDespite the tidy sum, authorities said the first week of enforcement still saw a significant decline in speeding compared to the trial period conducted in the previous weeks.\n\n\"We are pleased to report an approximate 70 per cent reduction in speeding incidents detected on the new Bridgewater Bridge since the speed cameras went live compared to the testing period,\" a department spokesperson told Yahoo.\n\nPlenty of Hobart locals. turned out to walk to bridge on the day it opened to the public in June. Source: Facebook/Jeremy Rockliff\n\nSpeeding drivers in Tasmania face fines of up to $1,178 and six demerit points at the top end of the range.\n\nAbout half of the Bridgewater Bridge drivers – 119 – were caught doing less than 10km/h over the speed limit, resulting in a $102.50 fine and two demerit points.\n\nWhile at the other end of the spectrum just one driver was caught between 30-37 km/h over the legal limit and another between 38-44 km/h. Two drivers who copped the top financial penalty after they were recorded travelling 45km/h over the speed limit with the worst offender flagged at 55km/h over, putting them at a speed of 135km/h.\n\nADVERTISEMENT\n\n\"Any level of speeding is illegal and unsafe. When lots of drivers speed by even a small amount, it makes the road-network less forgiving to mistakes and more dangerous for everyone,\" the spokesperson said.\n\n\"To anyone thinking of speeding on the bridge, you will be caught.\"\n\nThe bridge, which cost a whopping $786 million, was targeted by hoons just hours after it was opened to the public with great fanfare on June 1. Video footage posted online at the time showed a car performing burnouts, prompting authorities to slam the driver’s \"selfish and reckless actions\".\n\nThe speeding cameras are identical to the new automatic speed cameras installed on the Tasman Bridge earlier this year. The Sensys Gatso monitoring systems, introduced in February, replaced outdated 1990s-era cameras that were decommissioned in 2022–23, and immediately resulted in a jump in offenders being caught.\n\nPrime Minister Anthony Albanese and Tasmanian Premier Jeremy Rockliff were at the opening of the Bridgewater Bridge in Hobart. Source: AAP\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 36
  },
  {
    "url": "https://au.news.yahoo.com/heartfelt-farewell-beloved-priest-013136380.html",
    "title": "Touching detail at beloved priest’s memorial",
    "publish_date": "2025-08-18T01:54:06Z",
    "category": "lifestyle",
    "authors": [
      "Nathan Schmidt"
    ],
    "text": "Father Chris Reilly is being remembered at a public memorial at The William Inglis Hotel in Warwick Farm on Monday.\n\nDozens of people whose lives were changed for the better by beloved priest and youth charity founder father Chris Riley have delivered a touching moment during a packed-out service.\n\nThe Youth Off The Streets founder is being remembered at a public memorial at The William Inglis Hotel in Warwick Farm on Monday.\n\nFr Riley died on Thursday aged 70 after a period of ill-health.\n\nHe is best known for establishing the homeless youth charity in NSW and Queensland in 1991 and served as its CEO for nearly three decades.\n\nDuring the service, anyone whose life was affected by Fr Riley, whether directly or indirectly, were asked to stand up – with dozens solemnly heading the call.\n\nADVERTISEMENT\n\n“That says it all, doesn’t it,” long-time friend and colleague Mike Munro said.\n\nIn a video address, Prime Minister Anthony Albanese described Fr Riley as an “inspiration, someone for whom no one would be left behind.\n\n“He changed lives of so many young Australians, young Australians who’ve done it tough, young Australians, no matter how difficult their circumstances were.\n\n“Father Riley, put a hand out of friendship, support and compassion. May you rest in peace.”\n\nFather Chris Reilly is being remembered at a public memorial at The William Inglis Hotel in Warwick Farm on Monday.\n\nMolly Vaughan, one of Fr Riley’s “success stories”, performed the Acknowledgement of Country.\n\n“I saw him just as a person of truth, unwavering selflessness and unique wit,” she said.\n\n“In remembering his human simplicity, the width of his essence reaches a depth in all our lives.\n\n“His hope was that we all move with a gentle toughness, the same vivacious spirit as he – the embodiment of what it’s all about.”\n\nADVERTISEMENT\n\nMike Munro, in delivering his eulogy, remembered Fr Riley for his three Great Danes, love for his children, and his willingness to “bite the hands that feed”.\n\n“When Pope Benedict was here a decade or so ago, he was already outspoken about the clergy abuse in the Catholic Church,” he said.\n\n“He had been invited to St Mary’s Cathedral for a dinner with the Pope. That invitation was withdrawn.\n\nAnyone whose life was affected by Fr Riley, whether directly or indirectly, were asked to stand up.\n\n“He was years ahead of his time, particularly being so outspoken about the emerging dark history of child abuse by clergy in the Catholic Church.”\n\nMr Munro recounted Fr Riley’s work overseas, including in the Philippines, East Timor, and Aceh, the predominantly Muslim province in Indonesia after the devastating tsunami there.\n\nHe was also remembered for his intervention in the 2005 riots in Macquarie Fields, where he asked his mother and sister were asked to spread his ashes.\n\nADVERTISEMENT\n\nIn recent years, Mr Munro said Fr Riley had suffered from diabetes and “had not been looking after himself” and had made a “superhuman effort” this visit his 94-year-old mother.\n\nMr Munro said Fr Riley had turned down a state funeral, telling former Labor MP Tony Stewart: “I haven’t been around for a long time.\n\n“No one will remember me.”\n\nFr Riley was outspoken on abuse within the public church.\n\nMr Albanese was joined by Energy Minister Chris Bowen, Education Minister Jason Clare, and singer Jimmy Barnes at Monday’s service for Fr Riley.\n\nMr Clare told the crowd he “was not religious, but thank God for Fr Chris Riley.\n\n“Most little boys grow up dreaming of being a superhero. Father Chris was one. He saved more lives than Skippy.”\n\nThe Salesian priest from regional Victoria opened the Key College in 1996 Redfern, a Youth Off The Street school for disadvantaged youth.\n\nADVERTISEMENT\n\nHe went on to open six more colleges across Greater Sydney and The Central Coast, and was made a Member of the Order of Australia in 2006.\n\nIn 2012, he was also named NSW Australian of the Year.\n\nHe became a priest after watching Boys’ Town, a 1938 movie about a priest’s work with underprivileged boys.",
    "source": "Yahoo",
    "cluster_id": 37
  }
]