[
  {
    "url": "https://www.9news.com.au/entertainment/met-gala-2025-live-updates-red-carpet-highlights-latest-news-headlines/9aac04bc-d625-4ad0-8f24-fc1d0d1485b9",
    "title": "Aussie superstar stuns with short cut",
    "publish_date": "Tue, 06 May 2025 01:41:29 +0000",
    "category": "entertainment",
    "authors": [
      "May"
    ],
    "text": "Good morning and welcome to the 9news.com.au rolling coverage of the Met Gala 2025, fashion's biggest night out and the must-see, most-talked-about red carpet of the year.\n\nMikala Theocharous will be guiding you through the next few hours and she will be joined by expert commentator Jye Marshall, a Swinburne University of Technology Fashion Design Lecturer, who will be casting his eye over the outfits, with this year's theme being Tailored For You.\n\nRED CARPET LOOKS: See all the celebrity outfits and looks here",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/hungry-jacks-slapped-with-fines-over-childrens-toy-safety-concerns/b89d11ff-7eb6-4afd-8c19-5c9492315408",
    "title": "Hungry Jacks fined more than $150k over Garfield toy in children's meals",
    "publish_date": "Tue, 06 May 2025 00:09:44 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Hungry Jacks has been fined $150,240 for allegedly selling a children's toy powered by button batteries without warnings required by the mandatory information standard.\n\nThe Australian Competition and Consumer Commission (ACCC) issued the fast food chain with eight infringement notices after a Garfield toy powered by button batteries was sold nationwide in its children's meals.\n\nThe business sold 27,850 toys at stores between May 20 and 30 May 30 in 2024.\n\nHungry Jacks has been fined $150,240 by the ACCC. (Getty)\n\nWhile the Garfield toy complied with the button battery safety standard, it did not advise consumers that it contained button batteries or provide relevant warnings about the potentially fatal hazards these pose or advice about what to do if a child ingested one.\n\n\"Button batteries are extremely dangerous for young children and tragically, children have been seriously injured or died from swallowing or ingesting them,\" ACCC deputy chair Catriona Lowe said.\n\n\"The ACCC continues to see non-compliant products on the market which pose unacceptable safety risks to vulnerable young children.\n\nAustralian fast-food franchise Hungry Jack's Pty Ltd has paid penalties totalling $150,240 after the ACCC issued it with eight infringement notices for alleged breaches of the Australian Consumer Law by failing to comply with the mandatory button battery information standard. (ACCC)\n\n\"We take non-compliance with these important standards seriously and will not hesitate to take enforcement action where appropriate.\"\n\nA spokesperson said the ACCC has also accepted a court-enforceable undertaking from Hungry Jacks in which the company admitted the Garfield toy is likely to have failed to comply with the button battery information standard.\n\nThe ACCC said Hungry Jacks will establish and implement a compliance program designed to minimise the risk of potential future breaches of the Australian consumer law.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/met-gala-2025-red-carpet-celebrities-in-pictures/f455cfc6-c69b-4f86-abce-f6042dd47453",
    "title": "Met Gala 2025: See all the celebrity looks",
    "publish_date": "Tue, 06 May 2025 01:45:09 +0000",
    "category": "entertainment",
    "authors": [
      "May"
    ],
    "text": "1 of 110 Attribution: Evan Agostini/Invision/AP\n\nThe 2025 Met Gala is underway, with celebrities showing off stunning looks on the (metaphorically) red carpet.\n\nThe Metropolitan Museum of Art's Costume Institute benefit gala this year celebrates the opening of the \"Superfine: Tailoring Black Style\" exhibition.\n\nThis year, it's about tailoring and suiting as interpreted through the history and meaning of Black dandyism across the Atlantic diaspora.\n\nContinue through the gallery to see some of the standout looks as we keep updating throughout the morning.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/aussies-who-ask-for-a-pay-rise-get-a-pay-rise-study-finds/6df9af76-21b4-4c43-8546-6d0a460b27e0",
    "title": "The best way to get a pay rise? Ask for it",
    "publish_date": "Mon, 05 May 2025 06:46:02 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Those who ask for a pay rise are highly likely to get one - it's as simple as that, a study has found.\n\nA Finder report revealed ﻿that one in five Australians - equivalent to 2.8 million people - asked for a salary increase in the last year.\n\nOf those who requested, four in five respondents were successful in receiving a pay rise of some sort.﻿\n\nREAD MORE: Billions in student debt relief just months away under newly reelected Labor government\n\nFinder's report revealed ﻿that one in five Australians requested a salary increase in the last year. (Getty Images/iStockphoto)\n\nThe report found the average annual pay rise after asking was worth $3380.﻿\n\nMen secured an average increase of $3990﻿, compared to $2424 for women.\n\nMen were also more likely to have asked for a raise in the first place.\n\nREAD MORE:﻿ Nab predicts significant interest rate cuts in coming months\n\nReport author and personal finance expert Sarah Megginson said while the numbers should give employees the confidence to ask, it was concerning to see such a stark gender pay gap in the increases granted.\n\n﻿\"The fact that just over 80 per cent of those who asked for a raise were successful should encourage more Australians to have that conversation with their employer,\" she said.\n\n\"But it's really worrying that women not only received smaller raises on average, but were also less likely to ask in the first place.\"\n\nMegginson also encouraged all workers to negotiate for more than just their salary.\n\n\"Remember – 'don't ask, don't get' extends beyond your salary – it's also the approach you should take when it comes to your insurance, savings account or energy bill,\" she said.\n\nHow do I ask for a pay rise?\n\nFinder recommends a variety of steps to take before approaching your employer.\n\nFirst, it's important to do your research - know your worth and salary benchmarks based on your industry and experience level.\n\nPrepare a list of your achievements and extra responsibilities you've taken on to show how your work has positively impacted the company.\n\nTiming is key, so it might be﻿ a good idea to ask after a successful project or during performance reviews.\n\nFinally, make sure to have a backup plan.\n\nIf a salary increase isn't possible right now, try negotiating for other benefits like additional leave or performance-based bonuses.\n\n﻿Ensure to keep the conversation polite, open and flexible.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-06/aflw-season-opener-2025-collingwood-carlton-annoucement/105257676",
    "title": "Former AFLW All Australian says 2025 season opener honours tradition",
    "publish_date": "Tue, 06 May 2025 01:58:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "The AFLW has chosen to go back to tradition with a Carlton and Collingwood season opener for 2025, prompting mixed reactions from fans and experts in the women's game.\n\nThey have included one pundit saying they would like to see the game moved to a bigger stadium.\n\nThe AFL is set to announce on Tuesday afternoon that the Blues and Magpies will open the season on August 14 at Princes Park, coinciding with round 23 of the men's competition and reflecting the inaugural women's game in 2017 between the two sides.\n\nFormer AFLW All Australian and now expert commentator Kate McCarthy said she loved that the AFL was leaning into tradition.\n\nHowever, she also understood why not all fans were stoked with the decision, noting some would prefer the game to be between more competitive sides or unique rivalries in the AFLW.\n\nCollingwood finished last on the ladder last year with just one win and Carlton came 14th after four wins.\n\n\"I love the nostalgia of having the original match-up that we had to kick off the first-ever AFLW season, so I love that the AFL have decided to go back to that,\" McCarthy told ABC Sport.\n\n\"I think we all very vividly remember the iconic footage of the packed stands and then seeing Gil McLachlan having to tell the crowds outside that there had been a lockout.\n\n\"I also understand other more successful clubs and supporters of those clubs feeling like they had earned the right to kick the season off … .\n\n\"I do feel like this is a moment in our short history that is important to honour and having this match-up is reflective of that.\"\n\nCarlton and Collingwood opened the AFLW inaugural season in 2017. (Getty: Kelly Defina/AFL Photos)\n\nLast year, Sydney and Collingwood kicked off the season at North Sydney Oval, rewarding the Swans for having the highest average attendances the following year at home games.\n\nMcCarthy said she would also like to see people encourage the AFL to consider a larger and more easily accessible venue for fans, such as Docklands.\n\nPrinces Park has a capacity of about 12,500. Last year's grand final there sold out within hours for the second year in a row.\n\nIn 2022 Essendon and Hawthorn's inaugural clash was moved to Docklands from North Port Oval after a strong public push. Tickets for the original venue sold out within 24 hours, in what the AFL called \"unprecedented ticketing demands\" in the women's game, following a campaign by Hawks then-coach Bec Goddard and CEO Justin Reeves.\n\nEssendon and Hawthorn's inaugural AFLW clash was moved to Docklands after public demand. (Getty: Michael Willson/AFL Photos)\n\nMcCarthy said she would like to see a similar push for the opener.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It would be great if the entire AFLW community made a strong statement and got behind making this season opener one of the biggest ever to force the hand of the AFL to potentially move this to a larger stadium,\" McCarthy said.\n\n\"I encourage fans that as soon as tickets go on sale, we purchase them, sell the venue out and see what people power can achieve. This would show truly how far the AFLW has come in 10 years.\"\n\nWhile the remainder of the fixture is yet to be released, the league has confirmed there will be no condensed fixture, after significant negative feedback last season when a majority of teams played four games within a 16-day window.\n\nThe season will expand to 12 games as part of an agreement struck in last year's collective bargaining agreement causing the opener to be pushed ahead of the AFL men's pre-finals bye weekend.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-06/nba-star-josh-giddey-plays-social-basketball-game-in-frankston/105258320",
    "title": "'This game's not going to go our way': NBA star crashes social game in Melbourne",
    "publish_date": "Tue, 06 May 2025 01:42:50 +0000",
    "category": "sports",
    "authors": [],
    "text": "It's a regular weeknight in Frankston.\n\nYou rock up to the local basketball courts for a division-three social game a bit after 9pm, hoping to have a bit of fun.\n\nDuring the warm-up before tip-off, you look over at the opposition and what do you see?\n\nRising Australian NBA star Josh Giddey wearing the singlet of your opposition.\n\nLoading Instagram content\n\nThat was the scenario Jesse Lans and his Benny's Boys teammates found themselves in at Frankston Basketball Stadium on Monday evening.\n\nMelbourne-born Giddey — who plays for the Chicago Bulls — suited up for the Vales, much to the astonishment of Lans and others who were present.\n\nThe footage of the game has gone viral, and Lans is still in shock.\n\n\"We just started warming up and one of our guys was like, 'Look who's in the stands',\" Lans told ABC Melbourne on Tuesday.\n\n\"We were like, 'Oh no, this game's not going to go our way'.\"\n\nGiddey joined the Chicago Bulls last year. (Getty Images: Justin Casterline)\n\nGiddey is accustomed to playing at venues such as Chicago's United Center, which seats more than 20,000 spectators.\n\nIt's a far cry from Frankston, a suburb more than 40 kilometres south-east of the Melbourne CBD.\n\n\"There was definitely a crowd there growing,\" said Lans, who described the evening as an \"unreal experience\".\n\n\"I even heard that one of the games kind of got cancelled and they all made their way over.\"\n\nLans admitted he was nervous about potentially injuring Giddey, who is in his off-season with the Bulls.\n\n\"I was a little bit wary about that … you kind of forgot about it once we all got going,\" he said.\n\nGiddey (right) made his NBA debut with the Oklahoma City Thunder in 2021. (Getty Images: Michael Reaves)\n\nLans did not back his chances against Giddey, who averaged 14.6 points, 8.1 rebounds and 7.2 assists per game in the 2024/25 NBA season.\n\nBut the social basketballer finished the game with a 41-point haul.\n\n\"To be honest, [I] stood absolutely no chance,\" Lans said.\n\n\"He was much taller than you expect of someone at the point guard position. It was just another level to it.\"\n\nAfter the game, Giddey — who joined the Bulls after being traded by the Oklahoma City Thunder last year — posed for photographs with rival Benny's Boys players, as well referees and fans.\n\nAnd for the record, Benny's Boys came away with a 110-84 victory over Giddey and the Vales.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-05-06/australian-miners-critical-minerals-tightrope-china-us/105237492",
    "title": "Australian miners see opportunities during US and China trade war chaos",
    "publish_date": "Tue, 06 May 2025 01:09:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian mining companies are walking a tightrope between China, the nation's biggest market for our resources, and the United States, our greatest ally.\n\nThe trade war between them could open up some big opportunities but there is also a risk that Australian companies could get caught in the crossfire.\n\nChina has banned exports of some rare earths and critical minerals to the US, a move that threatens high-tech industries there.\n\nIn August, the Chinese government embargoed the supply of gallium to the US.\n\nGallium is a key component in thermometers, semiconductors, LED screens, smartphones, and Blu-ray technology.\n\nThey also banned germanium, which is used in space tech, renewables and telecommunications; antimony used in bullets and other weapons; and graphite used in electric vehicle batteries.\n\nUS Critical Minerals executive director Harvey Kaye said the embargo has become a geopolitical issue.\n\n\"They are now overtly utilising the withdrawal of those critical elements that affect our defence, our chip manufacturing, satellites, and artificial intelligence,\" Mr Kaye said.\n\nHarvey Kaye says the company is one of many on Donald Trump's list for fast-tracked development. (Supplied: US Critical Minerals)\n\nUS on fast track\n\nIn response, US President Donald Trump has issued a raft of executive orders to cut red tape, speed up mining approvals, and wants to fund projects by creating a new sovereign wealth fund.\n\nUS Critical Minerals is one of those companies listed for fast-tracking, according to Mr Kaye.\n\n\"We have ability through small mining exemptions, categoric exemptions, and the Defence Production Act to fast-track something that would have taken a few years [to get approval] down to 12-14 months,\" Mr Kaye said.\n\nHe thinks US government money could flow into processing projects in Australia.\n\n\"We're in direct conversation as we speak with the [Export-Import] bank … to encourage trade both ways,\" he said.\n\n\" We have identified Australia as our prime candidate to foster business relationships with. \"\n\nGlencore's Murrin Murrin mine in WA accounts for about 5 per cent of global cobalt production. (Supplied: Glencore)\n\nAustralian miners vulnerable\n\nMining generates more than $450 billion in export revenue for Australia, with most of that from iron ore and coal, according to the Minerals Council of Australia.\n\nCritical mineral exports are estimated to be worth just $7.6 billion this financial year according to the March Resources and Energy Quarterly Report from the Department of Industry Science and Resources but that could still increase significantly according to Professor Vlado Vivoda, the director of the Strategic Minerals Advisory and Research consultancy and a professor at the University of Queensland.\n\n\"Our reserves of lithium, nickel, cobalt are number two in the world, the same for copper, we're fourth for rare earths,\" he said.\n\nVlado Vivoda thinks Australia can ramp up production of critical minerals and rare earths. (Supplied: University of Queensland)\n\nAustralia is also the number one processor of lithium globally, although the price has fallen to its lowest level in four years.\n\nProfessor Vivoda said China has used its market dominance as a processor of critical minerals and rare earths to kill off competition from other countries, which is exactly what it did recently to Australia's nickel and lithium industries.\n\n\"They flooded the market with cheap Indonesian nickel, that's produced under not best practice … and a lot of our producers in Western Australia had to put mines into care and maintenance,\" he said.\n\nHe said the sector needs protection.\n\n\"This is not a free market globally so there is some necessity for strategic intervention to safeguard some of these mines that are deemed strategic or critical,\" Professor Vivoda said.\n\nAustralia has some of the richest critical mineral deposits in the world. (Supplied: Geoscience Australia)\n\nHe said the relationship with China has a chequered past.\n\n\"China has been the backbone of the Australian economy for a lot of lot of years, but … there have been certain frictions in that relationship,\" he said.\n\nChina banned key Australian commodities during the previous Liberal government including coal, barley, seafood, wine and beef.\n\nAll of those bans have since been lifted with China recently granting 10 new red meat companies access to the Chinese market and approving new protocols to allow Australian apples to go to China in increasing volumes.\n\nGovernment policies\n\nCritical minerals are a priority for the re-elected Labor party, which has provided tax breaks for miners and promised to set up a federal reserve of critical minerals.\n\nWhat purpose do critical minerals serve? Photo shows A person holds a handfull of ground nickel Australia is joining the European Union and the United States in establishing strategic reserves of critical minerals, but what do they actually do, and why are they so important?\n\nIt would offer voluntary agreements to miners to buy some of their output, and create a national stockpile of the minerals, effectively underwriting mines by guaranteeing some demand.\n\nProfessor Vivoda thinks that's a good idea.\n\n\"That would be a way to protect our producers,\" he said.\n\nThe Minerals Council of Australia is less sure.\n\nThe council's northern Australia executive director Cathryn Tilmouth said the policy could impact the commercial viability of Australian operations.\n\nShe said miners would need support to deliver those minerals to a reserve.\n\n\"To ensure they were able to afford energy, that they had appropriate IR (industrial relations), legislation, that they were able to get through the approvals processes, that they weren't facing the removal of fuel tax credits,\" she said.\n\nLynas Corporation runs the Mt Weld mine near Laverton in WA. (Supplied: Lynas Corporation)\n\nWalking the tightrope\n\nRST Solutions is one of those Australian companies walking the tightrope between China and the US.\n\nThey are working on mining projects all over the world, including China, and are expanding into the US through a partnership there.\n\nThey have provided environmental services to the big Stargate nickel processing plant set up by the Chinese in Indonesia to produce ferronickel and new energy nickel battery materials.\n\nOperations manager David Handel said they were helping to clean up the mine site.\n\n\"Sediment is getting washed off the mines into the waterways, so we're trying to stop it at the source,\" he said.\n\nRST Solutions is working with Chinese and Indonesian companies on environmental management at the Stargate Nickel mine in Indonesia. (Supplied: RST Solutions)\n\nHe said Australian companies have a lot to offer in terms of expertise in mining sustainably, but he doesn't think it will be easy for other countries to combat China's dominance of the sector.\n\n\"You'll never get the economic advantage that everyone's had out of China for years and years,\" Mr Handel said.\n\nAnd he's not concerned about the trade war and US tariffs because the Australian dollar is low, making his company's products and services relatively cheap in that country.\n\n\"Our Aussie dollar is so low, we're so attractive still, so these guys aren't even blinking when we're talking tariffs, it's not even coming up in conversation,\" Mr Handel said.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-06/farmers-react-to-labor-federal-election-win/105252646",
    "title": "Farmers urged to 'hold firm' on policies upon Labor's return",
    "publish_date": "Tue, 06 May 2025 00:16:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Labor's resounding federal election win will likely end the live export of sheep by sea, a move strongly resisted by the agriculture sector.\n\nAnd while agriculture was not front and centre of the election campaign, the Albanese government said a national food security plan, funding for farm safety and a strong record on trade would form a large part of its commitment to farmers.\n\nProtests, walkouts and fights\n\nNational Farmers' Federation president David Jochinke said the agriculture sector, which was worth about $88 billion, still had major concerns about the returned government's policies.\n\nDavid Jochinke says farmers need to hold firm on agriculture policy. (Supplied: VFF)\n\n\"There are going to be some absolute headwinds when we talk water, industrial relations, trade with regards to sheep live export and also productivity,\" he said.\n\n\"We have to make sure we hold firm on agriculture policy and we are not going to back away from hard lines that we put in the sand around what we can and can't accept.\n\n\" Ultimately there will be some policies we are not satisfied with and we will take appropriate action. \"\n\nKeep the Sheep held rallies and truck protests in key seats ahead of the election. (ABC News: Andrew O'Connor)\n\nLive export will end\n\nLabor's election victory confirmed the end of the live sheep by sea trade, which was legislated in the last parliament with the phase out to occur in 2028.\n\nA $140 million compensation package to industry from the federal government was included in the process.\n\nHolly Ludeman has been coordinating the Keep the Sheep campaign. (ABC News: Ruby Littler)\n\nThe win was a disappointment to the Keep the Sheep campaign — a Western Australia lobby group dedicated to overturning the decision which held rallies, truck protests, and tried to influence the election in key WA seats.\n\nCampaign coordinator Holly Ludeman said she spent the day inspecting animals and loading sheep on a live export vessel in Fremantle.\n\nShe said she hoped to continue the fight.\n\n\"We need to take some time to regroup,\" she said.\n\n\" There is another election in a few years. This is a viable industry and that's what I'm going to keep fighting for. \"\n\nStrong record on trade\n\nMs Collins said her government's record on reopening access to key exports markets in China was a major success for agriculture.\n\n\"We've got the most diversified agricultural trade now that we've ever had, 169 different markets now,\" she said.\n\nJulie Collins says the government has farmers' backs when it comes to trade. (ABC News: Jacqueline Lynch)\n\nA trade war with China which started in 2020 had locked out Australian wine, barley, hay, lobster and beef exports.\n\nBut since the Albanese government came to power, Chinese tariffs on all the goods have been dropped.\n\nTrade was restored and increased with an announcement last week of new apple and lamb markets to China.\n\n\"I think Australian farmers know that we've got their back when it comes to this,\" Ms Collins said.\n\n\"We've been slowly restoring relationships right across the globe and we've been working incredibly hard to make sure that we get access to those markets that are so critical to producers.\"\n\nWhat else?\n\nDuring the election, Labor committed to spending $3.5 million on new national food security strategy Feeding Australia.\n\nMr Jochinke supported the strategy.\n\n\"Hopefully it shows us strengths and weaknesses throughout the supply chain including inputs on farm, production on farm and supply chain for consumers, and that will form the basis of trying to form better policy,\" he said.\n\nLabor also promised increased funding to key agriculture events such as Beef Australia at Rockhampton and Lambex — a sheep event to be hosted in Adelaide in 2026.\n\nHow a mining region became Australia's beef capital Photo shows A young woman smiling and wearing a winning ribbon as she holds onto stud cattle. Gold, sheep, now beef cattle — Rockhampton has a varied history. But it's an event held every three years that has secured Rockhampton its spot as the beef capital of Australia.\n\nLabor said its planned investment in the sector would identify opportunities to improve supply chain resilience with a goal of minimising price volatility and costs at the check-out.\n\nLabor also pledged to spend $2.5 million to continue key farm safety programs after farm deaths doubled in the past two years.\n\nThe big remaining question for farmers was who would represent them and make major policy decisions inside the re-elected Albanese government.\n\nMs Collins came into the job in July 2024.\n\nWhile it was not known if she would retain the role, Ms Collins said she wanted to stay.\n\n\"It's a privilege, I've loved it, and I would love to continue doing it,\" she said.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-06/water-level-dropping-in-mount-gambier-dive-spots/105252738",
    "title": "Calls for 'tough decisions' as drought threatens famously clear SA dive spots",
    "publish_date": "Mon, 05 May 2025 23:48:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "The owner of one of the Limestone Coast's most popular diving spots has joined a world-famous cave diver in calling for more action to be taken to preserve water levels in the region's sinkholes and wetlands.\n\nThe concerns raised by Kilsby Sinkhole owner Graham Kilsby and cave diver Richard Harris come after one of the driest years on record in South Australia's south-east.\n\nTheir concerns are also amid a review of water allocations that has pitted environmentalists against farmers and foresters.\n\nMr Kilsby's family has had a sheep farm at Moorak, just south of Mount Gambier, for more than 130 years and they also offer diving and snorkelling tours at the Kilsby Sinkhole on their property.\n\nSinkhole owner Graham Kilsby with a water marker used to measure the water level before irrigation began. (ABC South East SA: Josh Brine)\n\nMr Kilsby said the water level at the sinkhole has fallen 4.5 metres since 2000 to a record low, including more than 1.5m since Christmas which he attributed to a lack of rain.\n\n\"We've decided that we're going to completely remove irrigation from the farming property over the next three years,\" Mr Kilsby said.\n\n\"It is an awfully big step and I wouldn't expect everyone to give that consideration.\n\n\" I just believe that what we're doing [as a region] isn't sustainable. \"\n\nLoading YouTube content\n\nDamage hurting tourism\n\nThe nearby Ewens Ponds has been closed to snorkellers on and off for almost a year because of low water levels, while Piccaninnie Ponds has been closed for two years because of an algal bloom exacerbate by a lack of water flow through the wetlands.\n\nBoth had been known for their clear water and vibrant aquatic plant life.\n\n\"Piccaninnie Ponds was one of the best dive sites in Australia. People across the world came there to dive and now it's just a muddy hole,\" Mr Kilsby said.\n\nThe Kilsby Sinkhole is one of the more accessible diving spots near Mount Gambier. (ABC South East SA: Bec Whetham)\n\n\"Ewens Ponds has got plant life growing at depths where it doesn't grow anywhere else in the world.\n\n\"Tourism is important, but I think that this is a bigger picture.\n\n\"It's about everyone in this region — we all rely in same way on the water that's beneath us — we really need to start looking at what we're doing.\"\n\n'System has essentially died'\n\nDr Harris became known around the world in 2018 due to his involvement in rescuing 12 young soccer players and their coach from a cave in Thailand.\n\nHe was later named Australian of the Year and is now South Australia's lieutenant governor.\n\nHe has been cave diving around Mount Gambier since 1986.\n\nRichard Harris is a regular visitor to the Limestone Coast. (ABC News: Tony Hill)\n\nWith cooperation from the South Australian National Parks and Wildlife Service he produced a video showing the situation at Piccaninnie Ponds.\n\n\"The whole system has essentially died,\" Dr Harris said.\n\n\" It really looks like a desert landscape whereas before it looked like a tropical jungle or an underwater paradise. \"\n\nWater allocations being decided\n\nThe Limestone Coast Landscape Board began work to update the Lower Limestone Coast Water Allocation Plan in 2022 and expects to decide how groundwater will be divided between drinking, agriculture, forestry and the environment in 2027.\n\nDr Harris said while it was not possible to \"tell everyone to stop work and down tools\", if the aquifer levels got too low \"everyone will suffer\".\n\n\"I feel that some very tough decisions are going to have to be made by the landscape board, which is primarily responsible for the water allocation plan,\" he said.\n\n\"I think it's time for all these industries that use the groundwater and farm that land to start to think about how we're going to have to adapt to this changing climate, and maybe farm and use the land differently in the future.\"\n\nThe Piccaninnie Ponds are in South Australia's far south-east. (Supplied: Alyssa G)\n\nSA Dairyfarmers Association chief executive Andrew Curtis said it was not clear what was causing the poor water quality in the Piccaninnie Ponds and it should not be \"simply attributed to agricultural practice\".\n\nHe said the environment, food production and supplying water for the community should be considered equally when allocating water.\n\n\"The challenge for the landscape board is to consider all of those issues in working with a limited resource,\" he said.\n\n\"As we can see during this drought we just don't have unlimited water. So the challenge is the allocation of it.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-06/2025-met-gala-red-carpet-superfine-tailoring-black-style/105257302",
    "title": "Met Gala red carpet: How the stars are interpreting the tailoring theme",
    "publish_date": "Mon, 05 May 2025 23:11:18 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "On paper, the Met Gala is a fundraiser for the Costume Institute of the Metropolitan Museum of Art, but in reality it's the world's biggest night in fashion.\n\nMore than just a red carpet event, the Met Gala is a spectacle.\n\nWe'll be updating this page as the stars arrive, but here are some of the looks we've seen so far:\n\nLISA wearing the perfect outfit for the formal signing of papers that legally entitle you to the property empire of your enemy. (AP: Invision/Evan Agostini)\n\nAlicia Keys and Swizz Beatz demonstrate exactly what coordinated outfits should look like. (AP: Invision/Evan Agostini)\n\nAndre 3000 wears exactly the outfit we'd picture to fit the theme if we had the wild, unhinged imagination and straight-up gall of his stylist. (AP: Invision/Evan Agostini)\n\nAdut Akech wears a regal power suit that makes me think of galahs in a totally different (and much more glamorous) light. (AP: Invision/Evan Agostini)\n\nWalton Goggins clearly having too much fun on the red (well, technically it's blue-and-daffodil-printed) carpet. (AP: Invision/Evan Agostini)\n\nYou might first remark on the wire around Jaden Smith's face, but it's that cloak that leaves the lasting impression. (AP: Invision/Evan Agostini)\n\nDemi Moore looks like a giant, glittery pinstriped tie that's just about to be tightened — which is exactly the kind of spectacle the Met Gala demands! (AP: Invision/Evan Agostini)\n\nColman Domingo wearing a cape that both stands up as an outfit on its own, but also screams out to be shrugged off dramatically to reveal something completely extra underneath. (AP: Invision/Evan Agostini)\n\n... and there it is. (AP: Invision/Evan Agostini)\n\nWith all due respect, you'd be an absolute dingbat to expect anything less than a sparkly, fluffy monster of a train from Diana Ross at the Met Gala. (Reuters: Mario Anzuoni)\n\nI'm picturing Zendaya turning up to a garden party thrown by the enemies of her teen years, openly defying the \"frills and florals\" theme on the invitation, drinking exactly one-and-a-half martinis, saying something crushing and then leaving. (AP: Invision/Evan Agostini)\n\nThere's so much to say about Andra Day's outfit, but it feels like it would be disrespectful to those magnificent bejewelled opera binoculars not to give them top billing. (AP: Invision/Evan Agostini)\n\nCynthia Erivo in an outfit that needs to come with its own gothic cathedral organ to soundtrack every single step in those boots. (AP: Invision/Evan Agostini)\n\nAnna Wintour is sticking with the theme by draping over her shoulders a jacket that's so long it transcends the practicalities of a mere coat — that thing is a clearly a cape. (AP: Invision/Evan Agostini)\n\nLewis Hamilton demonstrates the power of a brooch and beret. (AP: Invision/Evan Agostini)\n\nVenus Williams wearing the sports uniform every extremely extra little netballer dreamed they had in school — complete with an absolutely essential glittery collar. (AP: Invision/Evan Agostini)\n\nSydney Sweeney playing the villain who, despite how dark her schemes may get, you couldn't help but feel fabulous for being personally victimised by. (AP: Invision/Evan Agostini)\n\nCoco Jones wears the exact outfit you'd expect an ice princess who lives in a crystal palace would wear to a board meeting where she plans to turn the tables on stuffy chairperson. (AP: Invision/Evan Agostini)\n\nAnne Hathaway is what we all imagine we look like when we wear a white button-up shirt from an op-shop. (AP: Invision/Evan Agostini)\n\nGabrielle Union embodying a combination of both demure and deadly that needs to feature in a modern noir film immediately. (AP: Invision/Evan Agostini)\n\nSabrina Carpenter ready to star in a Broadway musical about a 1930s publishing heiress who gets fed up with the patriarchy and turns into a Robin-Hood-style crime boss. (AP: Invision/Evan Agostini)\n\n… but she'd have her minions hold her coat tails during her tap-dancing solo. (AP: Invision/Evan Agostini)\n\nPairing that very unsubtle shirt with that even more unsubtle suit of Joey King's was a stroke of genius. (AP: Invision/Evan Agostini)\n\nWhoopi Goldberg's outfit didn't need that many buttons — which is precisely why it needed that many buttons. (AP: Invision/Evan Agostini)\n\nYou can just imagine Doja Cat issuing stern orders down one of those old-timey telephones before screeching out of the joint in a classic convertible in this outfit. (AP: Invision/Evan Agostini)\n\nLorde is using a suit jacket as more of an accessory than a piece of warm clothing. (AP: Invision/Evan Agostini)\n\nIf I told you there was a new version of Dracula coming out except it was about a countess vampire and was set in the 1930s, would you be picturing Nicole Scherzinger in exactly this outfit? (AP: Invision/Evan Agostini)\n\nZoe Saldana's haircut is very much part of this outfit. (AP: Invision/Evan Agostini)\n\nWhat's the 2025 Met Gala theme?\n\nThe 2025 Met Gala theme is \"Superfine: Tailoring Black Style\".\n\nThe theme is inspired by Monica L Miller's 2009 book Slaves to Fashion: Black Dandyism and the Styling of Black Diasporic Identity.\n\nIt coincides with the opening of a new exhibition in the gallery, which will \"present a cultural and historical examination of the Black dandy\", the Met says.\n\nWhat's the dress code?\n\nThe dress code is Tailored for You.",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-06/tas-salmon-fish-deaths-halved-in-march-reporting/105257234",
    "title": "Tasmania's salmon mass mortality event is over, EPA says",
    "publish_date": "Mon, 05 May 2025 23:03:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Tasmanian salmon industry's mass mortality event is over, the Environment Protection Authority (EPA) says, months after dead fish and fatty globules began washing up on beaches in the state's south.\n\nThe state's environment watchdog says reporting data provided by salmon companies showed fish deaths halved in March compared to February, indicating the mass mortality event had peaked.\n\nThe companies reported 3,395 tonnes of fish waste in March, down from 6,300 in February.\n\nThe data showed no salmon went into landfill sites in March, with most of the waste going to land spreading and rendering.\n\nIn March, the peak body for salmon farming apologised for what it has called an \"unprecedented\" mass mortality event in Tasmania's south-east after fish were impacted by a rickettsia bacterial outbreak, due in part by rising water temperatures.\n\nDead salmon floating in the enclosed fish pens near Southport in February. (Supplied: Bob Brown Foundation)\n\nIn a statement on Tuesday, EPA chief executive Catherine Murdoch said conditions were improving.\n\n\"Water temperatures are falling and there has been a significant decline in the number of pens above the mortality reporting thresholds in April,\" Ms Murdoch said.\n\nWater quality improves, no antibiotics detected\n\nWater quality in the impacted area has also improved, with independent environmental monitoring of water quality conducted by the EPA no longer detecting the presence of antibiotics used to treat the fish infection.\n\nSalmon die-off in Tasmania 'largest we've ever seen' Photo shows a skip bin with salmon carcasses With Tasmania's salmon companies reeling from unprecedented losses due to disease and warm weather, the industry is told it will face investigation by the Environment Protection Authority.\n\n\"Water quality and beach sediments at four beaches in the southern D'Entrecasteaux Channel found all samples to be below the detection limit for the antibiotic oxytetracycline,\" the statement read.\n\n\"As part of this program, the EPA collected water samples in the last two weeks of March at 10 offshore locations and a significant number of wild fish at four locations within the southern D'Entrecasteaux Channel for analysis and none of these samples detected any antibiotic residues.\"\n\nThe EPA had previously reported February's dead fish waste at about 5,500 tonnes, or roughly 6 per cent of the industry's annual production.\n\nThe dead fish came from pens in the D'Entrecasteaux Channel, in south-eastern Tasmania, owned by Huon Aquaculture and Tassal.\n\nMandated industry reporting on salmon mortalities began earlier this year, with the EPA saying they intend to publish data quarterly going forward.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-06/met-gala-blog-2025/105257240",
    "title": "Live: Janelle Monáe, Diana Ross and dramatic suit reveals at this year's Met Gala",
    "publish_date": "Mon, 05 May 2025 21:43:40 +0000",
    "category": "entertainment",
    "authors": [
      "Maddy Morwood",
      "Jared Richards"
    ],
    "text": "We've looked camp in the eye, explored the heavenly bodies of the Catholic aesthetic, and visited the Garden of Time.\n\nNow it's time to explore the history and influence of the Black dandy at the 2025 Met Gala.\n\nFollow along in our live blog as some of the biggest stars grace New York's Metropolitan Museum of Art for fashion's night of nights.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-06/china-zhao-xintong-wins-world-snooker-championship/105257168",
    "title": "Zhao becomes China's first world snooker champion after comeback from ban",
    "publish_date": "Mon, 05 May 2025 21:42:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "Zhao Xintong has become the first Chinese player to win the World Snooker Championship with a victory over three-time winner Mark Williams at the Crucible Theatre in Sheffield, England.\n\nIt is the latest chapter in Zhao's remarkable rise and fall story.\n\nThe 28-year-old won by 18 frames to 12, becoming the first amateur to win the world title, despite a spirited comeback attempt from Welshman Williams.\n\n\"I can't believe what I've done. It's very exciting,\" said Zhao, draped in a Chinese flag.\n\n\"I was so nervous tonight. Mark is still a top player and put me under so much pressure. He's the best.\n\n\"It's a very special moment for me, for Chinese snooker, for everyone.\"\n\nZhao received a 20-month ban in January 2023 after a match-fixing scandal that rocked the sport.\n\nThe repercussions of his suspension meant he was classed as an amateur at the World Snooker Championship and needed to get through four rounds of qualifying to reach the Crucible, a gruelling run to the title that began on April 7.\n\nThe final was already historic no matter the result, as 50-year-old Williams became the oldest player to reach the final with his win over world number one Judd Trump in the semis.\n\nZhao won the final against Mark Williams by 18 frames to 12. (Getty Images: George Wood)\n\n\"It's been a brilliant tournament for me,\" said Williams, momentarily fighting back tears.\n\n\"The support I've had for the past two weeks has been unbelievable.\n\n\"But what a potter Zhao is. I'm glad I'll be too old when he's dominating the game.\n\n\"I've got nothing but admiration for what he's done, coming through the qualifiers. He hasn't played for two years, bashed everybody up. There's a new superstar of the game.\"\n\nZhao had swept aside seven-time winner Ronnie O'Sullivan in the semis to set up what was billed as the coronation of a new snooker king.\n\nNicknamed 'the Cyclone', Zhao raced out to an early 7-1 advantage in the best-of-35-frame contest, but Williams staged a mini revival in the second session to keep alive his hopes of a fourth title.\n\nNo player, however, had overcome such a large overnight deficit since the tournament moved to the Crucible in 1977.\n\nZhao joined Terry Griffiths and Shaun Murphy as the only qualifiers to capture snooker's most prestigious trophy.\n\nReuters",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-06/two-dead-in-major-crash-during-british-supersport-championship/105257194",
    "title": "New Zealander one of two dead after 'catastrophic' crash during motorbike race",
    "publish_date": "Mon, 05 May 2025 21:37:14 +0000",
    "category": "sports",
    "authors": [],
    "text": "Two motorcyclists have died after a major crash during a British Supersport Championship race at Oulton Park, south-east of Liverpool.\n\nEngland's Owen Jenner, 21, and New Zealand's Shane Richardson, 29, were fatally injured in a \"major chain reaction\" incident on the first lap of the race as the riders exited turn one, with 11 riders involved.\n\nThe race was halted on the first lap, with series director Stuart Higgs later calling the incident \"severe and catastrophic\" as he announced the event was cancelled.\n\nIn a statement on Monday night, Motorsport Vision Racing (MSVR), which is responsible for circuit operations at Oulton Park, said another rider, Tom Tunstall, sustained \"significant injuries\".\n\n\"Owen Jenner, 21, was initially treated trackside and then taken to the circuit medical centre, where despite further resuscitation treatment he died from a catastrophic head injury,\" MSVR said.\n\n\"Shane Richardson, 29, was initially treated trackside and then taken to the circuit medical centre before being transferred to Royal Stoke University Hospital with severe chest injuries. He died prior to arrival.\n\n\"Tom Tunstall, 47, was initially treated on the track and was taken to the circuit medical centre, he was later transferred to Royal Stoke University Hospital with significant back and abdominal injuries.\"\n\nRiders Carl Harris, Max Morgan, Cameron Hall, Freddie Barnes and Morgan McLaren-Wood were treated for minor injuries at the circuit medical centre.\n\nLewis Jones, Corey Tinker and George Edwards were also involved in the accident but did not suffer injuries.\n\nMSVR and the Motorcycle Racing Control Board said they were \"investigating the full circumstances of the incident in conjunction with the Coroner and Cheshire Constabulary\".",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-06/pigeon-infestation-port-pirie-community-health-building/105253394",
    "title": "'Very dirty' pigeons force nearly 100 staff out of health building",
    "publish_date": "Mon, 05 May 2025 21:30:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "About 100 SA Health employees have been moved from a building in Port Pirie due to a pigeon infestation.\n\nSA Health said the workers were moved from the Port Pirie Community Health administration building last Wednesday, and the building was temporarily closed.\n\nYorke and Northern Local Health Network CEO Roger Kirchner said staff notified them of the problem, which was affecting multiple areas on the building's top floor.\n\nSA Health staff in the Port Pirie Community Health administration building have been complaining about pigeons for the past six months. (ABC North and West SA: Viki Ntafillis)\n\n\"The tests have come back and certainly show … bacteria,\" he said.\n\n\"We've now engaged another group of independent testers. They were on site late last week to actually give us further tests on the first storey.\n\n\"We've actually asked them to do tests on the ground floor as well.\n\n\"We will have to look at how bad that is, whether or not we believe it is possible to stop them gaining access and if not we'll have to come up with a longer-term plan of what we're going to do with that building and the staff.\"\n\nAbout 100 staff have been moved out of the Port Pirie Community Health administration building. (ABC North and West SA: Viki Ntafillis)\n\nHe said the staff affected had been moved to other offices around the hospital campus, but no services had been disrupted.\n\nMr Kirchner said the health network was \"hoping\" the ground floor would be able to be used again \"in the short-term future\".\n\n\"We've constantly tried to eradicate the birds from the building but it doesn't seem to matter how many spikes, bits and pieces you do,\" he said.\n\n\" The birds continually find access ... and get into the ceiling space. \"\n\nProblem for local businesses\n\nLocal bakery owner Emily Nguyen said the pigeons were more than an eyesore for her business, having taken a financial toll.\n\n\"They [have broken] my solar panels and made them very dirty,\" she said.\n\n\"[It cost] $30,000 for new ones, $700 to cover [the roof] and clean-up was $300.\n\n\"People come in here, and you see a lot [of pigeons outside] ... and it doesn't look nice.\n\n\" When you see [the pigeons] you can't eat. \"\n\nEmily Nguyen says it cost her $30,000 to repair her bakery's solar panels, which were damaged by pigeons. (ABC North and West SA: Viki Ntafillis)\n\nMs Nguyen said there were often lots of pigeons in the early morning and again in the afternoon.\n\n\"They make things very dirty and they're not good for the businesses,\" she said.\n\n\"I just want the council to clean it up.\"\n\nPigeons perched all over the roof and solar panels of Emily Nguyen's business. (ABC North and West SA: Viki Ntafillis)\n\n'Nothing seems to stop them'\n\nPort Pirie Regional Council Mayor Leon Stephens said the problem had been brought to council about three years ago.\n\nHe said over the last two years about 22,000 pigeons had been culled in town.\n\n\"Every time you put a spike on a curb or a peak of a building I think the pigeons use them as back-scratchers,\" Mr Stephens said.\n\n\"Nothing seems to stop them, unfortunately.\"\n\nMr Stephens said the silos were a major attraction for the pest in any town due to being a source of food.\n\nLeon Stephens is calling on the state government to help fund the eradication of pigeons in councils that have silos. (ABC News: Che Chorley)\n\nHe said the state government should help by giving money to councils with silos in their towns to go towards pigeon culling efforts.\n\n\"Every time I go down to an LGA meeting with the rest of the mayors there's the same issue happening throughout South Australia and it's far too big for a little council to handle,\" he said.\n\n\" When something's in plague proportion like this it becomes a strain on our services. Something has to give. \"\n\nPigeons can be seen perched on rooftops and verandahs at businesses all around Port Pirie. (ABC North and West SA: Viki Ntafillis)\n\nIn a statement, a state government spokesperson said wild pigeons were the responsibility of landowners.\n\n\"As pigeons are not declared under legislation or regulation for control in South Australia the state government does not actively facilitate the management of this species,\" they said.\n\n\"The most effective management strategies for limiting the abundance of this species on buildings and structures include actions that obstruct or prevent access to roosting — perches protected from the elements — and breeding areas.\n\n\"The SA Health website contains some useful information about feral pigeons, including their impact on human health and techniques that can be used to reduce or remove the population.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/science/2025-05-06/electric-vehicles-secondhand-regulations-evs-battery-performance/105177202",
    "title": "How long can you expect a battery to last in a second-hand EV?",
    "publish_date": "Mon, 05 May 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Millions of cars are bought and sold in Australia each year. At the moment, most of them are second-hand, petrol-fuelled vehicles.\n\nBut that pattern is changing. Electric vehicles (EVs) and hybrid cars are growing in popularity, driven in part by government and organisation pledges to electrify their fleets.\n\nVehicle efficiency standards, which are set to come into effect in July, should also see more EVs on the roads.\n\nSo as EVs start to filter through to the used-car market in greater numbers, what should prospective buyers consider before they make a purchase?\n\nBattery quality important, but usually underestimated\n\nGail Broadbent, an electric vehicle researcher at the University of New South Wales, says battery quality is the biggest concern used-EV buyers have.\n\nBut she also says used EVs typically have much better battery capacity than consumers expect.\n\n\"There's a big discrepancy with what people think and what the actuality is,\" Dr Broadbent says.\n\nManufacturing warranties typically guarantee that an EV battery will retain at least 70 per cent of its original charge over eight to 10 years.\n\nMost cars outperform this warranty.\n\nThis is partially due to the way that battery performance is tested. Lab-based tests completely discharge and recharge batteries on a frequent cycle to see how they retain their charge.\n\n\"Whereas in real life ... car manufacturers recommend that people keep the battery somewhere between 20 per cent and 80 per cent,\" Dr Broadbent says. This keeps the battery in much better shape.\n\nA new charging technology could help EV-owners save on power bills in 2025 — but there's a catch Photo shows A close-up of an orange electricity cable plugged into a car. Vehicle-to-grid charging promises to save households money and get more value out of EV batteries. Here's how to take advantage of \"V2G\".\n\nOther aspects of real-world use, such as the tiny charges collected from regenerative braking, also appear to extend EV battery lifetime.\n\nGiven enough time, batteries will inevitably degrade.\n\nThis doesn't happen uniformly — battery performance can often drop quickly in a new car.\n\nThis sometimes gives new owners the impression their battery will lose capacity much faster, but the batteries tend to stabilise after a few years and lose capacity at a slower rate.\n\nNew batteries and fast chargers, such as BYD's five-minute charger, should also see a wider variety of EV technology in Australia. (Unsplash: Michael Marais)\n\nKai Li Lim, an EV researcher at the University of Queensland, says a range of factors can accelerate battery degradation, leading to some older EVs with notably reduced ranges.\n\nAnything that heats the battery can wear them down faster, including warmer climates, excessive fast charging, and frequently powering the battery up to full.\n\n\"But the reality about battery degradation is that with the average age of EVs in the market, it's not really something that we can clearly observe,\" Dr Lim says.\n\nMore years of EV use — and more research — will generate clearer answers.\n\nChecking an EV battery\n\nIf you're considering buying a used EV, Dr Broadbent says it's still important to check the battery health, because \"not everybody is kind to their car\".\n\nElectric vehicles usually show estimates for the distance you can expect from a full battery charge.\n\nBut this readout isn't necessarily accurate. Like manufacturers' warranties, it often underestimates and sometimes overestimates the battery capacity.\n\n\"That range that's written on the car is an average of the last five trips, and if [the driver] used the air conditioner or the heater, it's going to reduce the range,\" Dr Broadbent points out.\n\nBYD takes on Tesla with ultra-fast EV chargers Photo shows People stand around a car with all its doors open with a sign in beg letters on the wall behind reading BYD. Chinese electric vehicle manufacturer BYD has unveiled its ultra-fast charger that promises to take just five minutes to fully power EVs — putting heat on rival Tesla in the process.\n\nInstead, she says more accurate readouts of battery health can be obtained from an onboard diagnostics scanner.\n\nAt the moment, there is no standardised way to check EV battery health in Australia. Businesses such as insurers and used car dealers offer checks to people planning to buy or sell used EVs. The cost of these checks can vary widely.\n\nThe European Union introduced legislation last year that included an effort to standardise EV battery checks.\n\nRusty Langdon, a sustainability researcher at University of Technology Sydney (UTS), would like to see similar legislation in Australia.\n\n\"We're sort of at the whim of the market without Australian regulation that echoes that,\" they say.\n\nScott Dwyer, also a sustainability researcher at UTS, adds that there needs to be a suitable workforce to accommodate this.\n\n\"Training to traditional vehicle mechanics and funding for those small businesses to help them invest in their special diagnostic tools.\"\n\nBroadening used-EV uptake\n\nWhile standardisation could help with sales and consumer confidence, other policies will be needed to improve the supply of EVs in Australia.\n\nDr Dwyer says electrifying commercial fleets is a crucial way to increase EV uptake.\n\n\"About half of new car sales in Australia are sold into fleets,\" he says, adding that roughly a fifth of those sales are currently EVs.\n\n\" They are an important source of well-maintained and affordable EVs. \"\n\nDr Dwyer's research has also found people are more comfortable with the idea of buying or owning a personal EV after using one for work.\n\nAt the moment, the largest proportion of EV buyers are people living in outer suburbs of large cities. These people typically drive a lot and have easy access to cheap home charging, making EVs a sensible cost saver. Uptake is also high in inner metro areas.\n\nDr Lim wants to see more incentives for fleet EVs to increase uptake to other parts of Australia.\n\n\"You need a nice and robust second-hand car market of used EVs in order to make EVs more accessible to the general population,\" he says.\n\n\"The best way to make them cheaper is to put them through the second-hand car market, and the best way to put them through the second-hand car market is to have fleet uptakes.\"\n\nHe also wants to see better standards for checking battery quality for use after they're no longer suitable for an EV.\n\nLithium-ion waste soaring Photo shows A pile of burnt blue batteries on asphalt Australia's annual lithium-ion battery waste is tipped to hit 137,000 tonnes by 2035 amid urgent calls for dedicated recycling facilities.\n\nEV batteries can be used for other purposes, such as home batteries, when they're no longer powerful enough to take cars long distances.\n\n\"In due time, especially when lithium-ion batteries start to deplete, there will be a demand for this [EV battery repurposing],\" Dr Lim says.\n\nMx Langdon agrees.\n\n\"We don't have a really good understanding of battery lifetimes at the moment,\" they say.\n\n\"It would be good to have a better understanding of typical lifetime so that we can understand what the pathways are for second-hand vehicles and what consumers can expect.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-06/ipl-hyderabad-sunrisers-delhi-capitals-pat-cummins/105257088",
    "title": "Cummins treble in vain as rain ends Sunrisers' IPL hopes",
    "publish_date": "Mon, 05 May 2025 20:58:20 +0000",
    "category": "sports",
    "authors": [],
    "text": "Pat Cummins has delivered one of the finest bowling displays of this season's Indian Premier League (IPL) for Sunrisers Hyderabad, before watching rain end his team's campaign just as their survival hopes began to flicker.\n\nSunrisers Hyderabad needed a thumping win over Delhi Capitals to keep alive their slim chance of making the play-offs, with captain Cummins doing his part to help the cause.\n\nHe took 3-19 off four overs in Hyderabad, ripping out Delhi Capitals' top order in a devastating opening spell, which helped restricted the visitors to 7-133 from their 20 overs.\n\nBut it was all in vain as the Sunrisers never took strike.\n\nVaibhav Suryavanshi age controversy explained Photo shows Vaibhav Suryavanshi wears a helmet on his head Vaibhav Suryavanshi announces himself as a global megastar with an astounding century in the IPL at just 14. Here is why his astonishing achievement has been met with raised eyebrows by some.\n\nSpectators and viewers were robbed of the chance to see Travis Head taking on Mitch Starc. It means the Sunrisers — last year's IPL finalists — are now mathematically out of the competition with three matches still to play.\n\nThe Capitals, having escaped with an unlikely point, are still in the mix but need to reverse their stuttering form with two wins from their last seven matches.\n\nHaving won the toss and chosen to bowl, Cummins took a wicket off the opening ball of each of his first three overs, all caught by wicketkeeper Ishan Kishan.\n\nHe dismissed Karun Nair, who feathered the first ball of the innings. In his second over, Nair's fellow opener Faf du Plessis was snared for 3, swinging and edging.\n\nIn Cummins' third over, Abishek Porel went for 8, athletically caught by Kishan running to backward square leg as the batter looped up a legside shot.\n\nThat left the Capitals 3-15 but Cummins was not finished, running back at mid-off to superbly catch opposition captain Axar Patel (6) off Harshal Patel.\n\nWhen KL Rahul (10) also departed cheaply, the Capitals were 5-29, but Tristan Stubbs (41 no off 36) and Ashutosh Sharma (41 off 26) guided them to a modest but at least respectable total.\n\nThe Sunrisers will have fancied their chances of knocking off the chase in good time to improve their net-run-rate, but rain in Hyderabad meant they never had the chance.\n\nAAP",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/national/victoria/erin-patterson-trial-live-updates-beef-wellington-lunch-survivor-to-take-stand-in-trial-of-accused-triple-murderer-erin-patterson-20250506-p5lwvf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Erin Patterson trial live updates: Beef Wellington lunch survivor reveals details of invitation, conversation with alleged killer’s estranged husband over marriage difficulties",
    "publish_date": "Tue, 06 May 2025 12:01:01 +1000",
    "category": "finance",
    "authors": [
      "Marta Pascual Juanola"
    ],
    "text": "Wilkinson said the group then moved to the verandah and discussed the garden and some wind damage to some trees.\n\n“We looked at a particular bush, at the end of the verandah. It wasn’t doing so well. Heather and Gail are both keen gardeners. It was a discussion about why this plant was not doing so well, and whether it … might be better, moved to another location,” he says.\n\nEventually, they moved back into the house. Once inside, Wilkinson says Patterson started mashing potatoes for lunch.\n\n“Erin plated up the food,” he says.\n\n“She was on the kitchen side of the kitchen bench and she was putting the food on the plates.”\n\nThe jury heard Heather and Gail offered to help Erin plate the food, but she rejected the offer and did it all herself at the bench.\n\n“There was mash, potatoes, green beans and beef Wellington,” Wilkinson says.\n\n“Each person had an individual serve [of beef Wellington]. It was very much like a pasty, if you imagine a pasty being put on a plate. Pastry encased, and when we cut into it, there was steak and mushrooms.”\n\nWilkinson says there may have been gravy on the table.\n\nThere were four large, grey dinner plates – and one smaller plate in a different colour.\n\n“It was an orangey-tan colour,” he says.\n\nWilkinson says Gail Patterson picked up two of the grey plates and placed them on the table, and Heather the other two. Erin took the unique plate and placed it at her seat.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/the-fed-waits-for-the-fog-of-trump-s-trade-war-to-lift-20250506-p5lwvq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Fed waits for the fog of Trump’s trade war to lift",
    "publish_date": "Tue, 06 May 2025 11:59:32 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "There’s also, of course, the 145 per cent tariff on imports from China. Even if the US and China do talk and agree a deal, the levies on China are likely to be multiples of what they were before “Liberation Day.” Loading Those “other” tariffs will, even without the reciprocals, feed into higher US prices and inflation and cause severe disruption to US supply chains, leading to shortages of stock and further shocks for businesses and consumers. The US economy contracted in the March quarter, although that was largely the result of consumers and companies rushing to make purchases before the tariffs hit. The likelihood, with corporate and consumer confidence battered by the tariffs, is that it will remain weak through the rest of the year, with a Trump-induced recession a definite possibility. That would normally cause the Fed to act by cutting rates decisively.\n\nThe tariffs (once the Trump administration decides their final form) ought to produce a one-time inflationary shock that the Fed could look through if the underlying economy were slowing significantly. However, having been bitten once, badly, by the massive and enduring spike in inflation that was caused by the supply chain disruptions during the pandemic, the Fed won’t be quick to dismiss this new disruption to supply chains as “transitory.” Instead, it will be patient and wait for the actual effects of the tariffs on the inflation rate to show up before it moves. [Fed chair Jerome Powell doesn’t want to cut rates] ‘because he’s not a fan of mine. You know he just doesn’t like me because I think he’s a total stiff.’ Donald Trump Powell has hinted that, if the central bank has to choose between containing inflation or protecting employment, the Fed will prioritise the inflation rate. The tariffs have created the prospect of stagflation, or an outcome where US inflation remains high even as the economic growth rate falls. While Trump will, as he did again last week and at the weekend, call for immediate rate cuts and lambast Powell for not delivering them, he’s backed away from the threat he made last month to “terminate” Powell after a massive backlash in US markets.\n\n“Why would I do that? I get to replace the person (Powell) in another short period of time,” he said in a television interview that aired on Sunday. Powell’s term as chairman, but not as a Fed governor, ends in May next year. He said Powell doesn’t want to cut rates “because he’s not a fan of mine. You know he just doesn’t like me because I think he’s a total stiff.” Whether or not Powell dislikes Trump (he’s got reason to, given the continual threats and abuse he’s been subjected to), has no influence over the Fed’s decision-making. With the US inflation rate still above the Fed’s target and the jobs market still quite strong, there’s no credible argument for cutting rates at this moment, and there’s plenty of arguments for the Fed to be patient and wait for the tariff and budget-related events to unfold.\n\nIt’s not just the Fed that’s uncertain about what the outlook for the economy might be. US companies are just as uncertain, with many suspending their profit forecasts, or offering materially different earnings scenarios that are dependent on the severity of the tariffs’ impact on their businesses. Those effects will be largely negative, potentially materially so. Car giant Ford said on Monday that, even with some exemptions for auto companies, the tariffs would cost it $US1.5 billion this year. GM said last week they could carve up to $US5 billion from its earnings. The uncertainty is unlikely to be lifted soon, even if – as Trump and his Treasury Secretary Scott Bessent have indicated – the administration announces the first of its trade deals this week. India, Japan and South Korea are reportedly the first cabs off the rank in agreeing to deals rather than face the punitive reciprocal tariffs. Loading Trade deals are complex, with the detail usually painstakingly negotiated over years, not weeks, so it is likely that, if deals are announced, they will be more headlines than fully-fledged agreements.\n\nStill, they would enable Trump to declare some victories, even if it takes years for the actual impact of the deals and the compliance of those signing them to become apparent. (China signed a deal in 2020, during Trump’s first trade war, promising to massively boost purchases of US products but, with the pandemic intervening, bought less from America than it had before the deal). While the US sharemarket responded positively to the pause in the reciprocals and indications from China that it is willing to talk about a deal with the US (although that’s been China’s stance ever since Trump slapped his latest tariff on China’s exports), the bottom line is that trade between the US and the rest of the world may never again be what it was. The universal tariffs and others remain in place, and the “deals” Trump’s team are negotiating will alter trade flows between the US and its trade partners. There might be some re-shoring of activity to America, although Trump seems overly optimistic on that front, but costs of living in the US will rise and corporate profits will fall because of the trade war. For the Fed, trying to weigh up the net outcomes on inflation, growth and employment at this point would be impossible, even if Trump weren’t constantly changing, and complicating further, the dense web of tariffs he’s created.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-loved-chocolate-maker-flags-strong-interest-in-brisbane-20250505-p5lwp2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Woman charged over death of 11-month-old baby | Loved chocolate maker flags ‘strong interest’ in Brisbane",
    "publish_date": "Tue, 06 May 2025 11:54:25 +1000",
    "category": "finance",
    "authors": [],
    "text": "Residents of south-east Queensland would be set a daily benchmark for water usage under a State Government reform plan.\n\nThe plan, which will go out to consultation this week, seeks to make the water grid more responsive to changes in supply and demand.\n\nLoading\n\nWhile the benchmark would likely be set at 165 litres per person per day for residential use, in line with current averages, Seqwater would pay closer attention to times of peak demand and also pursue efficiency measures.\n\n“You could be asked to adopt water-saving practices in your daily life all year round, such as set times for watering your garden or routinely checking for leaks,” a consultation paper states.\n\nBefore the election, the LNP vowed to review water plans and also flagged the possibility of a new dam in south-east Queensland. It ruled out a new desalination plant on the Sunshine Coast.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/bride-to-be-jessica-returns-to-wedding-boutique-after-online-shopping-disaster-20250506-p5lwz0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bride-to-be Jessica returns to wedding boutique after online shopping disaster",
    "publish_date": "Tue, 06 May 2025 11:53:15 +1000",
    "category": "finance",
    "authors": [],
    "text": "Bride-to-be Jessica returns to wedding boutique after online shopping disaster\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/jessica-tries-on-her-ill-fitting-wedding-dress-dupe-20250506-p5lwz1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jessica tries on her ill-fitting wedding dress dupe",
    "publish_date": "Tue, 06 May 2025 11:53:07 +1000",
    "category": "finance",
    "authors": [],
    "text": "Jessica tries on her ill-fitting wedding dress dupe\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/money/borrowing/applying-for-a-loan-you-ll-need-to-know-this-magic-number-20250506-p5lwxl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Applying for a loan? You’ll need to know this magic number",
    "publish_date": "Tue, 06 May 2025 11:48:36 +1000",
    "category": "finance",
    "authors": [
      "Caterina Hrysomallis"
    ],
    "text": "Markula says it’s important to know that not all lenders rely on the insight provided by credit reporting bodies. “Lenders may have their own assessment tools and internal scores, which could combine the information they get from a credit report, along with other information.” Loading She adds that a lender won’t automatically provide you credit just because a credit reporting body provides an excellent credit score. “Same goes if you have a poor credit score; this does not certainly mean you won’t be able to get credit. However, in general, the higher the credit score, the better,” she says. How are credit scores calculated? Credit scores are calculated by the credit reporting bodies themselves or the credit provider (e.g. a bank) you have applied to. This is done using a formula that evaluates a range of factors, including how well you pay your bills, how much debt you carry and how that stacks up against other borrowers.\n\nNot paying bills on time – or at all – is most likely to impact your credit score; for example, if you default on your account or if you skip monthly account payments. When it comes to making credit enquiries, there are a few misconceptions. “It’s often thought that an enquiry will drop your score. That’s not right. The impact of an enquiry can depend on a whole range of factors; it could increase or decrease your score. Or have very little effect at all,” Markula says. Requesting financial assistance is viewed more favourably by lenders than missing payments. “But it is fair to say that many enquiries in a short period of time may drop the score.” This could include applying for multiple credit cards in a few months. Having several unsecured short-term loans and buy-now-pay-later services may also have a poor impact.\n\nCredit reports also list your employment and residential history. Changing jobs or homes frequently could negatively impact your credit score, as these things might indicate financial stress. “It may be that having a poor credit score affects your ability to access credit. However, it is important to remember the score impact may depend on information available to a lender,” she says. “You may have a poor Equifax score, but apply for credit with a lender that you already have a relationship with, and they will likely use the information they already have about you, to score you differently.” How can you improve your credit score? Markula says ARCA tries to remind people to focus on the things they can change and control, as that’s the information that goes into your credit report, rather than focusing on the actual score. The magic ingredient to a good credit score? Consistency. Making regular, on-time payments on credit and loan accounts is one of the most impactful factors. Getting on it is important, as improving credit scores can take time.\n\nLoading “The sooner you establish a reliable repayment history, the better. So, if you plan to apply for a mortgage in the next few years or take out a major loan, you should manage your credit health now by ensuring there is no negative information, such as a default listed against you for not making your debt obligations and by ensuring that you pay your bills on time.” From natural disasters to job loss, there are a number of reasons someone might have trouble paying bills. In these cases, Markula says it’s important to reach out to lenders early. Requesting financial assistance is viewed more favourably by lenders than missing payments. It does appear on your credit report but is deleted after 12 months. It does not impact your credit rating or score. How can people get their own credit score and report? One-third of Australians have never checked their credit report, according to YouGov research commissioned by ARCA in 2024.\n\nYou can check your credit score online and for free by heading to Equifax, Experian or Illion. You’ll need to set up an account, provide identification and fill out an application. Most credit reports are delivered within 10 days. If you do order a credit report, it’s best to read it through and ensure everything is correct. There might be inaccurate information that potentially impacts your credit score; if that’s the case, you should approach the credit reporting body to rectify. You can get a free credit report every three months. It’s good financial hygiene to order a credit report annually. One more tip to finish: if you have been rejected for a loan or credit, it’s worth asking the lender why, to further educate yourself and help safeguard your credit rating in future. Advice given in this article is general in nature and not intended to influence readers’ decisions about investing or financial products. They should always seek their own professional advice that takes into account their own personal circumstances before making any financial decisions.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/wa-news-live-direct-perth-to-london-flight-diverts-to-maldives-for-medical-emergency-20250505-p5lwt4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Direct Perth to London flight diverts to Maldives for medical emergency",
    "publish_date": "Tue, 06 May 2025 11:36:12 +1000",
    "category": "finance",
    "authors": [],
    "text": "To overnight news now and a direct Qantas flight from Perth to London has made an unexpected landing in the Maldives after a passenger on board suffered a medical incident.\n\nThe QF9 flight departed Perth Airport around 6.30pm last night, but landed was diverted around eight hours later, landing in Male this morning.\n\nThe plane’s flight path. Credit: FlightRadar24\n\nPassengers are stranded on the tropical island as Qantas rushes to replace its Boeing 787 flight crew, which has now reached their duty limit for the number of hours they can work.\n\nThe airline is working to arrange alternative flights, with customers expected to be reaccommodated within 24 hours.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/culture/art-and-design/david-gonski-on-the-art-of-parting-the-rich-from-their-money-for-a-good-cause-20250204-p5l9ho.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "David Gonski on the art of parting the rich from their money for a good cause",
    "publish_date": "Tue, 06 May 2025 11:30:00 +1000",
    "category": "entertainment",
    "authors": [
      "Linda Morris"
    ],
    "text": "And, yet, his name is not emblazoned on the walls of the building. It bears an Indigenous name – Naala Badu – and no gallery is named for him. On a plaque near the entrance, he and his wife, dermatologist Orli Wargon, are listed among many others as founding donors of the ground-level Indigenous Yiribana Gallery. The Lowy Gonski Gallery sits in the original Walter Liberty Vernon-designed building. When the ribbon was finally cut on his beloved Sydney Modern, Gonski was in house quarantine with COVID. “I still remember when I left Mike Baird’s office, absolutely, going down in the lift and walking out, and realising how much had to be privately raised to build the new gallery,” Gonski says. “And here we are, in this beautiful building, delivered on time and on budget.” David Gonski served as president of the AGNSW Trust for 19 years across two terms. Credit: Steven Siewert Gonski’s second term as president of the Art Gallery of NSW board of trustees came to an end in December. The board is responsible for the gallery’s strategic direction as well as overseeing the management of its collection and the foundation responsible for fundraising and investments. Archibald Prize season is under way, but he will sit on the sidelines. Gonski’s successor, Michael Rose, now has the job of tallying the votes of gallery trustees on Friday and announcing the winning portraitist.\n\nGonski enjoyed the circus but understood its limitations: “One minute you’re important, the next minute, having announced the winner, no one’s interested in you,” he says. “It took me at least three Archibalds to realise that’s what it was. No one even asked my opinion afterwards. They were gone.” As chair for two separate terms, totalling 19 years, Gonski co-captained the prestigious institution under the directorship of the irrepressible Edmund Capon and, from 2014, the scholarly Michael Brand. Edmund Capon in front of Cy Twombly’s Three Studies from the Temeraire. Credit: Jon Reid He was particularly taken by Capon’s audacity and cheek. He remembers Capon rolling out the red carpet for the late comedian Barry Humphries one day, and having to field a call from an eagle eye in the premier’s office who observed Capon had raised flags that by government decree should have been flying at half-mast. Gonski feigned ignorance. In 2004, Capon convinced Gonski and the gallery’s trustees to spend about $4.5 million to acquire a triptych by American artist Cy Twombly that Gonski did not personally admire, and which had invited comparisons with the National Gallery of Australia’s purchase of Jackson Pollock’s Blue poles.\n\n“Are you sure?” Gonski asked Capon. He was persuaded and now loves the painting. “I am not sure whether that is because I associate it so closely with Edmund or whether it is just so compelling.” While the old Renaissance painters had their aristocratic patrons, Gonski is the modern face of arts boards governance, a model of consensus building, family legacy and investment that has come under sustained pressure as the geopolitical shockwaves from the war in Gaza have ricocheted across the world. Dumplings at MOD. Dining. Credit: Steven Siewert Gonski sits down for lunch with the Herald the same day as western Sydney artist Khaled Sabsabi and Michael Dagostino are named Australia’s representatives for the Venice Biennale. Six days later, Creative Australia’s invitation is withdrawn, prompting protests, resignations and petitions. The aftershocks have yet to subside.\n\nMany of Sydney’s biggest arts benefactors are Jewish, like Gonski, and some have exited the arts world amid claims of antisemitism and counter claims from pro-Palestinian voices of censorship. It’s prompted profound reflection on the influence of philanthropy versus artistic expression. Gonski’s advice to his fellow philanthropists has been to “stay on the field while the ball is in play”. It’s his view that withdrawing from the field means those with “antagonising views” have won. MOD. Dining’s crispy eggplant. Credit: Steven Siewert While philanthropists prioritise the nurturing of artistic talent, Gonski believes boards of publicly funded institutions have a wider obligation to serve the public interest. The institution is responsible for what is shown and must accept that responsibility. That’s not censorship, he insists, but care, risk management and due diligence. Gonski remains engaged with public life and has been appointed co-patron alongside Rhoda Roberts of the NAISDA Dance College, Australia’s leading First Nation’s arts training organisation. His name has been raised as a future chair of Opera Australia.\n\nThe much troubled national opera performing arts company is now without a chief executive or artistic director. It’s had two chairs in three years, and discontent is brewing around Rod Sims, its current chair. “I love the concept of giving back, I genuinely do,” Gonski says. “I often suspect that I get more out of the giving than what I have given.” Satay skewers at MOD. Dining. Credit: Steven Siewert Gonski keeps to sparkling mineral water, he has afternoon meetings to keep. Asked for lunch recommendations, Gonski is unfamiliar with the Asian fusion menu of MOD. chef Sushil Aryal, though he has dined here several times. “I was here usually to duchess somebody who hopefully would give us some money.” He smiles. “I wasn’t concentrating on what I was eating. I was looking to the results.”\n\nGonski’s bowl of chicken and chives dumplings, dressed in chilli oil and black vinegar, arrives first. Then a small plate of three chicken satay sticks. My batons of crispy eggplant come with a delicious chilli caramel. But, as in previous outings at MOD., eating is not the main game. No one can read the room like Gonski can, a friend of his later assures me. “Politicians are motivated by venal desires; he is not beholden by anything to anyone. Whatever he leads, he works in their best interests. He’s like a great rabbi, he takes a sniff of the wind and works out what is going on.” Lunch at MOD. Dining Crispy eggplant $26 Jasmine rice $6 Satay chicken skewers $24 Chicken dumpling $22 Total: $78 In the weeks since we sat down for lunch, the gallery’s director is named as Maud Page, the institution’s first female director. I subsequently ask Gonski what he thinks of the appointment. He is delighted. “It is the right choice at the right time. Maud will be very successful taking the gallery to new heights.” Brand was “a joy to work with, and he led us as a group with enormous focus, intelligence and decency”.\n\nA former corporate lawyer and merchant banker, now company director, Gonski has sat on some 40 boards of business and not-for-profits, including Sydney Theatre Company, chair to theatre’s dream team of Cate Blanchett and Andrew Upton, and the National Institute of Dramatic Art. Paul Keating tapped him for his board “apprenticeship” at Bundanon, chairing the trust overseeing the south coast property that Arthur and Yvonne Boyd gave the nation. It’s Arthur Boyd that Gonski credits for expanding his way of seeing. Boyd would stand at his easel and challenge Gonski to see beyond the first blush of colour in the bushland. Where Gonski could pick up six types of greens, Boyd could see 10. They once inspected a venue at Callan Park as a possible art gallery dedicated to the work of Boyd, only for the project to fall over when the artist objected to the space’s disrupted view of an old chimney. Gonski shrugs. Where business can be a shrewd numbers game, art turns on the tiniest slash of colour. It’s an intellectual puzzle that fascinates but is not without sentiment.\n\nThe Gonskis have been art collectors for 35 to 40 years. “People ask, ‘do you change them?’ ‘No, I don’t.’ Each have special value, a 30th wedding anniversary and obviously anything by Arthur Boyd is very special.” Loading Gonski was seven when his family moved to Sydney from Cape Town in 1961, in the aftermath of the Sharpeville massacre, in which 250 people were killed or injured in violent anti-apartheid demonstrations. His father, Alexander, was a neurosurgeon, a scholarship boy who relied on benefactors to send him to university to study science then medicine. “My life was a lot easier than it might have been otherwise, if it hadn’t been for his hard work and the philanthropy of others,” he notes. “Philanthropy often can improve the lives of a number of generations.” From his mother, Helene, came his love for the arts. She would entice the young Gonski to visit the AGNSW with offers of ice-cream, the same trick he uses on his four grandchildren. “Art has always lifted me.”",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/business/companies/welcome-to-starbase-elon-musk-to-get-his-own-city-in-texas-20250505-p5lwsc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Welcome to Starbase: The world’s richest person is making his own city",
    "publish_date": "Tue, 06 May 2025 11:21:32 +1000",
    "category": "finance",
    "authors": [
      "James Warrington"
    ],
    "text": "Elon Musk may have his sights set on Mars, but for the time being the billionaire is building an empire closer to home.\n\nThe Tesla and SpaceX tycoon has been given the green light to set up his own new city in south Texas – dubbed Starbase – after securing the backing of an overwhelming majority of locals, many of whom he employs.\n\nTexas’s newest city, which covers just under 4 square kilometres, will be formed from a string of neighbourhoods in a remote area currently known as Boca Chica that is home to SpaceX’s rocket launch site. Credit: AP\n\nA ballot on Saturday secured 212 votes in favour and just six against. The vote also secured the election of the city’s first mayor and two other officials, all of whom are current or former employees of Musk’s company SpaceX.\n\nThe tycoon celebrated the result in a post on X that read: “Starbase, Texas is now a real city!” The billionaire first publicly suggested the idea in 2021.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/afl/rioli-sent-threatening-messages-to-opposition-player-20250506-p5lwyd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rioli sent threatening messages to opposition player",
    "publish_date": "Tue, 06 May 2025 11:13:16 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rioli sent threatening messages to opposition player\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-increasing-role-of-ai-in-health-care/wjmq68w9p",
    "title": "The increasing role of AI in health care",
    "publish_date": "Mon, 5 May 2025 21:00:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPhysician Michael Dinh knows all too well the challenges of an emergency department.\n\n\n\n\n\nHe's been fielding tending to emergency department patients at Sydney's Royal Prince Alfred Hospital for the past 25 years.\n\n\n\n\n\n\"Emergency departments, I mean they're extremely busy places as everyone knows, and we often find ourselves managing lots of patients and critically ill patients simultaneously.\"\n\n\n\n\n\nEnter Artificial Intelligence, or A-I.\n\n\n\n\n\n\"So here's our list of patients... and you can see here a couple of our patients are at very high risk of deteriorating based on our AI algorithm… so these are the ones we need to keep a very close eye on. \"\n\n\n\n\n\nThe emergency ward at the hospital has now uses artificial intelligence to help identify patients most at risk.\n\n\n\n\n\n\"It just draws in data from a patient's medical record and it puts it into an algorithm that we developed here at RPA. We've been able to pick up patients in the waiting room who are deteriorating, who we may have missed previously. Patient care is being decided a lot quicker than it used to be. So there are a lot of benefits for patient care.\"\n\n\n\n\n\nProfessor Dinh leads a team at the hospital seeking to improve emergency care through innovation.\n\n\n\n\n\nHe's currently exploring how A-I can help interpret brain scans.\n\n\n\n\n\n\"This is a CAT scan of a patient's brain...you can very quickly, based on the AI tool, spot the abnormality. It's an algorithm, it runs in the background and based off you know, million of other CT scans where these abnormalities present, it's a process of pattern recognition, it will pick out the abnormality for you almost instantaneously. \"\n\n\n\n\n\nThe technology is still a few years off, he says. and it's not designed to replace radiologists, but rather assist in emergencies when quick decisions must be made.\n\n\n\n\n\n\"If we need to have an interpretation of a CAT scan, for instance, within seconds of a patient coming in, that's where I see AI coming into play in the future.\"\n\n\n\n\n\nProfessor Farah Magrabi is a Professor of Biomedical and Health Informatics at the Australian Institute of Health Innovation at Macquarie University.\n\n\n\n\n\nShe's currently engaged in research that seeks to investigate the clinical safety and effectiveness of AI technologies in the Australian healthcare setting.\n\n\n\n\n\n\"AI is being increasingly developed and adopted across the healthcare system in Australia. There's lots of possibilities in terms of finding better ways to improve patient care.\"\n\n\n\n\n\nThere have been significant advancements in A-I in recent years from interpreting x-rays and brain scans to disease detection.\n\n\n\n\n\nThe UK is set to trial a blood test that uses artificial intelligence to identify signs of a dozen cancers long before symptoms develop.\n\n\n\n\n\nBut Professor Magrabi says for now, it's note-taking software that's seen the most rapid uptake in Australia.\n\n\n\n\n\n\"These tools are specifically designed to sit in the background. They listen into a consultation and then they can prepare a summary of the consultation for the health professional to review and then accept into their notes.\"\n\n\n\n\n\nScribes is software that uses a microphone - with patient consent - to capture speech during a consultation.\n\n\n\n\n\nThis assist doctors with clinical notes, treatment summaries and referrals - paperwork that can take hours each day.\n\n\n\n\n\nThe Productivity Commission estimates around 30 per cent of Australia's healthcare tasks could be automated saving around five billion dollars a year ... easing both time and cost pressures on the system.\n\n\n\n\n\nBut the technology is not perfect.\n\n\n\n\n\n\"For example, a doctor mentions an issue with the patient's hand, feet, and mouth and the scribe summarise that it's hand, foot and mouth disease. We've heard of another example where a doctor mentioned scheduling a prostate examination and the scribe summarises that the examination has already been performed. So it's widely important that health, the professionals check the output of the AI for each summary note or each specialist letter that they use the scribe for . The system so to speak, is very aware of what is happening and they're rapidly putting in measures to ensure that AI is used safely and effectively.\"\n\n\n\n\n\nTranslation programs are also touted as a way to bridge linguistic barriers.\n\n\n\n\n\nBut Lisa Woodland, the Director of New South Wales Multicultural Health says there is a lot of nuance when it comes communicating health information in an accurate and culturally sensitive way.\n\n\n\n\n\n\"For some language groups, for example the European languages, the level of accuracy is much higher but for many of the new and emerging and refugee languages, the accuracy is actually quite poor. When we used human translators that are based in Australia that understand the cultural nuances of the language and the communities that we translate for, we get a much better product.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/video/sydney-buddhists-celebrate-buddhas-2569th-birthday/qbwee92ai",
    "title": "Sydney Buddhists celebrate Buddha's 2569th birthday",
    "publish_date": "Mon, 5 May 2025 08:35:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "Sydney Buddhists celebrate Buddha's 2569th birthday\n\nPublished 5 May 2025, 7:17 am\n\nA record number of Australia’s Korean community gathered at a temple in Sydney, joining half a billion Buddhists worldwide in celebrating Buddha’s Birthday. The South Korean public holiday is also one of the most significant dates in the Lunar calendar for communities across east, south, and south-east Asia, with each country bringing its own unique traditions.",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/asx-snaps-seven-day-winning-streak-as-oil-and-banks-tank/ahja2r9rq",
    "title": "ASX snaps seven day winning streak, as oil and banks tank",
    "publish_date": "Mon, 5 May 2025 07:21:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/donald-trumps-100-per-cent-movie-tariffs-would-send-shockwaves-in-australias-industry/ganu5xhki",
    "title": "Donald Trump's 100 per cent tariffs on films would 'send shockwaves' in Australia's industry",
    "publish_date": "Mon, 5 May 2025 06:26:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "The federal government says it will stand up for the Australian film industry, in response to Donald Trump 's 100 per cent tariffs on film productions made outside the US.\n\n\n\n\n\n\"The Movie Industry in America is DYING a very fast death. Other Countries are offering all sorts of incentives to draw our filmmakers and studios away from the United States,\" the US president posted on Truth Social on Sunday.\n\n\n\n\n\n\"Hollywood, and many other areas within the USA, are being devastated.\"\n\n\n\n\n\nAustralia is such a popular location for foreign film productions, it is sometimes dubbed \"Hollywood Down Under\" with recent large-scale productions including The Fall Guy, Kingdom of the Planet of the Apes and Thor: Ragnarok.\n\n\n\nSource: SBS News The federal government's location offset scheme offers a 30 per cent rebate for big budget film projects shot in Australia, with additional post-production rebates and state governments offering further sweeteners.\n\n\n\n\n\nBut the imposition of tariffs could mean these incentives are no longer attractive enough for productions aimed at the massive US market.\n\n\n\n\n\nTrump's move will send shockwaves through the industry globally, according to industry peak body Screen Producers Australia (SPA).\n\n\n\n\"At this stage, it is unclear what this announcement means in practice or how it will be applied and implemented\", said SPA chief executive Matthew Deaner.\n\n\n\n\n\n\"There are many unknowns for our industry, but until we know more, there's no doubt it will send shockwaves worldwide.\"\n\n\n\n\n\nPrime Minister Anthony Albanese said on Monday he has had a \"warm and positive\" conversation with Donald Trump, in which tariffs were discussed .\n\n\n\n\n\nBut he did not specifically mention to reporters the film industry tariffs Mr Trump announced.\n\n\n\nArts Minister Tony Burke said the Australian government would fight to protect the film industry. Source: AAP / Lukas Coch Arts Minister Tony Burke said he was monitoring the situation closely.\n\n\n\n\n\n\"Nobody should be under any doubt that we will be standing up unequivocally for the rights of the Australian screen industry,\" Burke said in a statement.\n\n\n\n\n\nForeign productions are big business for the local screen industry, according to the latest Screen Australia figures.\n\n\n\n\n\nJust under half of the $1.7 billion spent on screen production in Australia during 2023/24 was on international productions, with $767 million spent making foreign film and television.\n\n\n\n\n\nIt's not yet clear how the tariffs might be imposed but they could also affect the export of Australian content to the US market, potentially making tickets more expensive for films such as George Miller's Mad Max series.\n\n\n\n\n\nIn Trump's announcement on social media, he described film incentives as a threat to the US by foreign nations.\n\n\n\n\n\n\"This is a concerted effort by other Nations and, therefore, a National Security threat,\" he said in a post on Truth Social on Sunday.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/donald-trump-says-hes-friendly-with-albanese-doesnt-know-who-peter-dutton-is/x9a5qj52y",
    "title": "Albanese had a 'warm and positive' phone call with Trump, discussed AUKUS and tariffs",
    "publish_date": "Mon, 5 May 2025 01:57:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prime Minister Anthony Albanese has said he had \"a warm and positive conversation\" during a congratulatory call with United States President Donald Trump.\n\n\n\n\n\n\"I had a warm and positive conversation with President Donald Trump, just a short while ago when I was at the Lodge. And I thank him for his very warm message of congratulations,\" Albanese said on Monday during his first address from Canberra after winning the federal election .\n\n\n\n\n\n\"We talked about how AUKUS and tariffs ... [we] will continue to engage, we'll engage with each other on a face-to-face basis at some time in the future,\" he added.\n\n\n\nAnthony Albanese gave his first address from Canberra on Monday after Labor's election win. Source: AAP / Lukas Coch\n\nTrump says he doesn't know who Peter Dutton is\n\nEarlier on Monday, Trump was asked about Albanese's election win and the US president said he's \"very friendly\" with Albanese and has a good relationship with the re-elected prime minister.\n\n\n\n\n\nTrump didn't answer a question from an Australian journalist as to whether the \"Trump factor\" played a part in Labor's election victory.\n\n\n\n\n\nTrump was initially asked by a journalist with Nine newspapers: \"The Australian elections, Mr President. The conservatives did very badly, just like in Canada . They're saying it's the Trump effect again.\"\n\n\n\n\n\n\"Albanese, I'm very friendly with,\" Trump responded.\n\n\n\n\n\n\"I don't know anything about the [Australian] election other than ... the man that won, he's very good. He's a friend of mine.\"\n\n\n\nREAD MORE World leaders congratulate Anthony Albanese on election victory\n\nWhen asked about the issue of tariffs, Trump said he and Albanese enjoyed a \"good relationship\".\n\n\n\n\n\n\"I can only say that he's been very, very nice to me, very respectful to me,\" he said.\n\n\n\n\n\n\"I have no idea who the other person is that ran against him.\"\n\n\n\n\n\nIn April, Australia's growth outlook was slashed by a major international body as Trump's so-called reciprocal tariffs sent markets into a tailspin.\n\n\n\n\n\nAlbanese downplayed concerns Australia could face an economic downturn as a result, and said he would seek a phone call with Trump on tariff negotiations after the election.\n\n\n\nREAD MORE Albanese downplays Australian recession risk after Trump blames US downturn on Biden\n\nTrump had indicated last week that he would speak with Albanese.\n\n\n\n\n\n\"They are calling and I will be talking to him, yes,\" he told reporters when asked about the election and bilateral trade.\n\n\n\n\n\nThe US sent its congratulations to Albanese following Labor's win via secretary of state Marco Rubio.\n\n\n\n\n\n\"The United States looks forward to deepening its relationship with Australia to advance our common interests and promote freedom and stability in the Indo-Pacific and globally.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/the-fed-waits-for-the-fog-of-trump-s-trade-war-to-lift-20250506-p5lwvq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Fed waits for the fog of Trump’s trade war to lift",
    "publish_date": "Tue, 06 May 2025 11:59:32 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "There’s also, of course, the 145 per cent tariff on imports from China. Even if the US and China do talk and agree a deal, the levies on China are likely to be multiples of what they were before “Liberation Day.” Loading Those “other” tariffs will, even without the reciprocals, feed into higher US prices and inflation and cause severe disruption to US supply chains, leading to shortages of stock and further shocks for businesses and consumers. The US economy contracted in the March quarter, although that was largely the result of consumers and companies rushing to make purchases before the tariffs hit. The likelihood, with corporate and consumer confidence battered by the tariffs, is that it will remain weak through the rest of the year, with a Trump-induced recession a definite possibility. That would normally cause the Fed to act by cutting rates decisively.\n\nThe tariffs (once the Trump administration decides their final form) ought to produce a one-time inflationary shock that the Fed could look through if the underlying economy were slowing significantly. However, having been bitten once, badly, by the massive and enduring spike in inflation that was caused by the supply chain disruptions during the pandemic, the Fed won’t be quick to dismiss this new disruption to supply chains as “transitory.” Instead, it will be patient and wait for the actual effects of the tariffs on the inflation rate to show up before it moves. [Fed chair Jerome Powell doesn’t want to cut rates] ‘because he’s not a fan of mine. You know he just doesn’t like me because I think he’s a total stiff.’ Donald Trump Powell has hinted that, if the central bank has to choose between containing inflation or protecting employment, the Fed will prioritise the inflation rate. The tariffs have created the prospect of stagflation, or an outcome where US inflation remains high even as the economic growth rate falls. While Trump will, as he did again last week and at the weekend, call for immediate rate cuts and lambast Powell for not delivering them, he’s backed away from the threat he made last month to “terminate” Powell after a massive backlash in US markets.\n\n“Why would I do that? I get to replace the person (Powell) in another short period of time,” he said in a television interview that aired on Sunday. Powell’s term as chairman, but not as a Fed governor, ends in May next year. He said Powell doesn’t want to cut rates “because he’s not a fan of mine. You know he just doesn’t like me because I think he’s a total stiff.” Whether or not Powell dislikes Trump (he’s got reason to, given the continual threats and abuse he’s been subjected to), has no influence over the Fed’s decision-making. With the US inflation rate still above the Fed’s target and the jobs market still quite strong, there’s no credible argument for cutting rates at this moment, and there’s plenty of arguments for the Fed to be patient and wait for the tariff and budget-related events to unfold.\n\nIt’s not just the Fed that’s uncertain about what the outlook for the economy might be. US companies are just as uncertain, with many suspending their profit forecasts, or offering materially different earnings scenarios that are dependent on the severity of the tariffs’ impact on their businesses. Those effects will be largely negative, potentially materially so. Car giant Ford said on Monday that, even with some exemptions for auto companies, the tariffs would cost it $US1.5 billion this year. GM said last week they could carve up to $US5 billion from its earnings. The uncertainty is unlikely to be lifted soon, even if – as Trump and his Treasury Secretary Scott Bessent have indicated – the administration announces the first of its trade deals this week. India, Japan and South Korea are reportedly the first cabs off the rank in agreeing to deals rather than face the punitive reciprocal tariffs. Loading Trade deals are complex, with the detail usually painstakingly negotiated over years, not weeks, so it is likely that, if deals are announced, they will be more headlines than fully-fledged agreements.\n\nStill, they would enable Trump to declare some victories, even if it takes years for the actual impact of the deals and the compliance of those signing them to become apparent. (China signed a deal in 2020, during Trump’s first trade war, promising to massively boost purchases of US products but, with the pandemic intervening, bought less from America than it had before the deal). While the US sharemarket responded positively to the pause in the reciprocals and indications from China that it is willing to talk about a deal with the US (although that’s been China’s stance ever since Trump slapped his latest tariff on China’s exports), the bottom line is that trade between the US and the rest of the world may never again be what it was. The universal tariffs and others remain in place, and the “deals” Trump’s team are negotiating will alter trade flows between the US and its trade partners. There might be some re-shoring of activity to America, although Trump seems overly optimistic on that front, but costs of living in the US will rise and corporate profits will fall because of the trade war. For the Fed, trying to weigh up the net outcomes on inflation, growth and employment at this point would be impossible, even if Trump weren’t constantly changing, and complicating further, the dense web of tariffs he’s created.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-loved-chocolate-maker-flags-strong-interest-in-brisbane-20250505-p5lwp2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Woman charged over death of 11-month-old baby | Loved chocolate maker flags ‘strong interest’ in Brisbane",
    "publish_date": "Tue, 06 May 2025 11:54:25 +1000",
    "category": "finance",
    "authors": [],
    "text": "Residents of south-east Queensland would be set a daily benchmark for water usage under a State Government reform plan.\n\nThe plan, which will go out to consultation this week, seeks to make the water grid more responsive to changes in supply and demand.\n\nLoading\n\nWhile the benchmark would likely be set at 165 litres per person per day for residential use, in line with current averages, Seqwater would pay closer attention to times of peak demand and also pursue efficiency measures.\n\n“You could be asked to adopt water-saving practices in your daily life all year round, such as set times for watering your garden or routinely checking for leaks,” a consultation paper states.\n\nBefore the election, the LNP vowed to review water plans and also flagged the possibility of a new dam in south-east Queensland. It ruled out a new desalination plant on the Sunshine Coast.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/bride-to-be-jessica-returns-to-wedding-boutique-after-online-shopping-disaster-20250506-p5lwz0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bride-to-be Jessica returns to wedding boutique after online shopping disaster",
    "publish_date": "Tue, 06 May 2025 11:53:15 +1000",
    "category": "finance",
    "authors": [],
    "text": "Bride-to-be Jessica returns to wedding boutique after online shopping disaster\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/jessica-tries-on-her-ill-fitting-wedding-dress-dupe-20250506-p5lwz1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jessica tries on her ill-fitting wedding dress dupe",
    "publish_date": "Tue, 06 May 2025 11:53:07 +1000",
    "category": "finance",
    "authors": [],
    "text": "Jessica tries on her ill-fitting wedding dress dupe\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/victoria/erin-patterson-trial-live-updates-beef-wellington-lunch-survivor-to-take-stand-in-trial-of-accused-triple-murderer-erin-patterson-20250506-p5lwvf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Erin Patterson trial live updates: Beef Wellington lunch survivor reveals details of invitation, conversation with alleged killer’s estranged husband over marriage difficulties",
    "publish_date": "Tue, 06 May 2025 11:49:59 +1000",
    "category": "finance",
    "authors": [
      "Marta Pascual Juanola"
    ],
    "text": "Wilkinson said the group then moved to the verandah and discussed the garden and some wind damage to some trees.\n\n“We looked at a particular bush, at the end of the verandah. It wasn’t doing so well. Heather and Gail are both keen gardeners. It was a discussion about why this plant was not doing so well, and whether it … might be better, moved to another location,” he says.\n\nEventually, they moved back into the house. Once inside, Wilkinson says Patterson started mashing potatoes for lunch.\n\n“Erin plated up the food,” he says.\n\n“She was on the kitchen side of the kitchen bench and she was putting the food on the plates.”\n\nThe jury heard Heather and Gail offered to help Erin plate the food, but she rejected the offer and did it all herself at the bench.\n\n“There was mash, potatoes, green beans and beef Wellington,” Wilkinson says.\n\n“Each person had an individual serve [of beef Wellington]. It was very much like a pasty, if you imagine a pasty being put on a plate. Pastry encased, and when we cut into it, there was steak and mushrooms.”\n\nWilkinson says there may have been gravy on the table.\n\nThere were four large, grey dinner plates – and one smaller plate in a different colour.\n\n“It was an orangey-tan colour,” he says.\n\nWilkinson says Gail Patterson picked up two of the grey plates and placed them on the table, and Heather the other two. Erin took the unique plate and placed it at her seat.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/money/borrowing/applying-for-a-loan-you-ll-need-to-know-this-magic-number-20250506-p5lwxl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Applying for a loan? You’ll need to know this magic number",
    "publish_date": "Tue, 06 May 2025 11:48:36 +1000",
    "category": "finance",
    "authors": [
      "Caterina Hrysomallis"
    ],
    "text": "Markula says it’s important to know that not all lenders rely on the insight provided by credit reporting bodies. “Lenders may have their own assessment tools and internal scores, which could combine the information they get from a credit report, along with other information.” Loading She adds that a lender won’t automatically provide you credit just because a credit reporting body provides an excellent credit score. “Same goes if you have a poor credit score; this does not certainly mean you won’t be able to get credit. However, in general, the higher the credit score, the better,” she says. How are credit scores calculated? Credit scores are calculated by the credit reporting bodies themselves or the credit provider (e.g. a bank) you have applied to. This is done using a formula that evaluates a range of factors, including how well you pay your bills, how much debt you carry and how that stacks up against other borrowers.\n\nNot paying bills on time – or at all – is most likely to impact your credit score; for example, if you default on your account or if you skip monthly account payments. When it comes to making credit enquiries, there are a few misconceptions. “It’s often thought that an enquiry will drop your score. That’s not right. The impact of an enquiry can depend on a whole range of factors; it could increase or decrease your score. Or have very little effect at all,” Markula says. Requesting financial assistance is viewed more favourably by lenders than missing payments. “But it is fair to say that many enquiries in a short period of time may drop the score.” This could include applying for multiple credit cards in a few months. Having several unsecured short-term loans and buy-now-pay-later services may also have a poor impact.\n\nCredit reports also list your employment and residential history. Changing jobs or homes frequently could negatively impact your credit score, as these things might indicate financial stress. “It may be that having a poor credit score affects your ability to access credit. However, it is important to remember the score impact may depend on information available to a lender,” she says. “You may have a poor Equifax score, but apply for credit with a lender that you already have a relationship with, and they will likely use the information they already have about you, to score you differently.” How can you improve your credit score? Markula says ARCA tries to remind people to focus on the things they can change and control, as that’s the information that goes into your credit report, rather than focusing on the actual score. The magic ingredient to a good credit score? Consistency. Making regular, on-time payments on credit and loan accounts is one of the most impactful factors. Getting on it is important, as improving credit scores can take time.\n\nLoading “The sooner you establish a reliable repayment history, the better. So, if you plan to apply for a mortgage in the next few years or take out a major loan, you should manage your credit health now by ensuring there is no negative information, such as a default listed against you for not making your debt obligations and by ensuring that you pay your bills on time.” From natural disasters to job loss, there are a number of reasons someone might have trouble paying bills. In these cases, Markula says it’s important to reach out to lenders early. Requesting financial assistance is viewed more favourably by lenders than missing payments. It does appear on your credit report but is deleted after 12 months. It does not impact your credit rating or score. How can people get their own credit score and report? One-third of Australians have never checked their credit report, according to YouGov research commissioned by ARCA in 2024.\n\nYou can check your credit score online and for free by heading to Equifax, Experian or Illion. You’ll need to set up an account, provide identification and fill out an application. Most credit reports are delivered within 10 days. If you do order a credit report, it’s best to read it through and ensure everything is correct. There might be inaccurate information that potentially impacts your credit score; if that’s the case, you should approach the credit reporting body to rectify. You can get a free credit report every three months. It’s good financial hygiene to order a credit report annually. One more tip to finish: if you have been rejected for a loan or credit, it’s worth asking the lender why, to further educate yourself and help safeguard your credit rating in future. Advice given in this article is general in nature and not intended to influence readers’ decisions about investing or financial products. They should always seek their own professional advice that takes into account their own personal circumstances before making any financial decisions.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/wa-news-live-direct-perth-to-london-flight-diverts-to-maldives-for-medical-emergency-20250505-p5lwt4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Direct Perth to London flight diverts to Maldives for medical emergency",
    "publish_date": "Tue, 06 May 2025 11:36:12 +1000",
    "category": "finance",
    "authors": [],
    "text": "To overnight news now and a direct Qantas flight from Perth to London has made an unexpected landing in the Maldives after a passenger on board suffered a medical incident.\n\nThe QF9 flight departed Perth Airport around 6.30pm last night, but landed was diverted around eight hours later, landing in Male this morning.\n\nThe plane’s flight path. Credit: FlightRadar24\n\nPassengers are stranded on the tropical island as Qantas rushes to replace its Boeing 787 flight crew, which has now reached their duty limit for the number of hours they can work.\n\nThe airline is working to arrange alternative flights, with customers expected to be reaccommodated within 24 hours.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/culture/art-and-design/david-gonski-on-the-art-of-parting-the-rich-from-their-money-for-a-good-cause-20250204-p5l9ho.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "David Gonski on the art of parting the rich from their money for a good cause",
    "publish_date": "Tue, 06 May 2025 11:30:00 +1000",
    "category": "entertainment",
    "authors": [
      "Linda Morris"
    ],
    "text": "And, yet, his name is not emblazoned on the walls of the building. It bears an Indigenous name – Naala Badu – and no gallery is named for him. On a plaque near the entrance, he and his wife, dermatologist Orli Wargon, are listed among many others as founding donors of the ground-level Indigenous Yiribana Gallery. The Lowy Gonski Gallery sits in the original Walter Liberty Vernon-designed building. When the ribbon was finally cut on his beloved Sydney Modern, Gonski was in house quarantine with COVID. “I still remember when I left Mike Baird’s office, absolutely, going down in the lift and walking out, and realising how much had to be privately raised to build the new gallery,” Gonski says. “And here we are, in this beautiful building, delivered on time and on budget.” David Gonski served as president of the AGNSW Trust for 19 years across two terms. Credit: Steven Siewert Gonski’s second term as president of the Art Gallery of NSW board of trustees came to an end in December. The board is responsible for the gallery’s strategic direction as well as overseeing the management of its collection and the foundation responsible for fundraising and investments. Archibald Prize season is under way, but he will sit on the sidelines. Gonski’s successor, Michael Rose, now has the job of tallying the votes of gallery trustees on Friday and announcing the winning portraitist.\n\nGonski enjoyed the circus but understood its limitations: “One minute you’re important, the next minute, having announced the winner, no one’s interested in you,” he says. “It took me at least three Archibalds to realise that’s what it was. No one even asked my opinion afterwards. They were gone.” As chair for two separate terms, totalling 19 years, Gonski co-captained the prestigious institution under the directorship of the irrepressible Edmund Capon and, from 2014, the scholarly Michael Brand. Edmund Capon in front of Cy Twombly’s Three Studies from the Temeraire. Credit: Jon Reid He was particularly taken by Capon’s audacity and cheek. He remembers Capon rolling out the red carpet for the late comedian Barry Humphries one day, and having to field a call from an eagle eye in the premier’s office who observed Capon had raised flags that by government decree should have been flying at half-mast. Gonski feigned ignorance. In 2004, Capon convinced Gonski and the gallery’s trustees to spend about $4.5 million to acquire a triptych by American artist Cy Twombly that Gonski did not personally admire, and which had invited comparisons with the National Gallery of Australia’s purchase of Jackson Pollock’s Blue poles.\n\n“Are you sure?” Gonski asked Capon. He was persuaded and now loves the painting. “I am not sure whether that is because I associate it so closely with Edmund or whether it is just so compelling.” While the old Renaissance painters had their aristocratic patrons, Gonski is the modern face of arts boards governance, a model of consensus building, family legacy and investment that has come under sustained pressure as the geopolitical shockwaves from the war in Gaza have ricocheted across the world. Dumplings at MOD. Dining. Credit: Steven Siewert Gonski sits down for lunch with the Herald the same day as western Sydney artist Khaled Sabsabi and Michael Dagostino are named Australia’s representatives for the Venice Biennale. Six days later, Creative Australia’s invitation is withdrawn, prompting protests, resignations and petitions. The aftershocks have yet to subside.\n\nMany of Sydney’s biggest arts benefactors are Jewish, like Gonski, and some have exited the arts world amid claims of antisemitism and counter claims from pro-Palestinian voices of censorship. It’s prompted profound reflection on the influence of philanthropy versus artistic expression. Gonski’s advice to his fellow philanthropists has been to “stay on the field while the ball is in play”. It’s his view that withdrawing from the field means those with “antagonising views” have won. MOD. Dining’s crispy eggplant. Credit: Steven Siewert While philanthropists prioritise the nurturing of artistic talent, Gonski believes boards of publicly funded institutions have a wider obligation to serve the public interest. The institution is responsible for what is shown and must accept that responsibility. That’s not censorship, he insists, but care, risk management and due diligence. Gonski remains engaged with public life and has been appointed co-patron alongside Rhoda Roberts of the NAISDA Dance College, Australia’s leading First Nation’s arts training organisation. His name has been raised as a future chair of Opera Australia.\n\nThe much troubled national opera performing arts company is now without a chief executive or artistic director. It’s had two chairs in three years, and discontent is brewing around Rod Sims, its current chair. “I love the concept of giving back, I genuinely do,” Gonski says. “I often suspect that I get more out of the giving than what I have given.” Satay skewers at MOD. Dining. Credit: Steven Siewert Gonski keeps to sparkling mineral water, he has afternoon meetings to keep. Asked for lunch recommendations, Gonski is unfamiliar with the Asian fusion menu of MOD. chef Sushil Aryal, though he has dined here several times. “I was here usually to duchess somebody who hopefully would give us some money.” He smiles. “I wasn’t concentrating on what I was eating. I was looking to the results.”\n\nGonski’s bowl of chicken and chives dumplings, dressed in chilli oil and black vinegar, arrives first. Then a small plate of three chicken satay sticks. My batons of crispy eggplant come with a delicious chilli caramel. But, as in previous outings at MOD., eating is not the main game. No one can read the room like Gonski can, a friend of his later assures me. “Politicians are motivated by venal desires; he is not beholden by anything to anyone. Whatever he leads, he works in their best interests. He’s like a great rabbi, he takes a sniff of the wind and works out what is going on.” Lunch at MOD. Dining Crispy eggplant $26 Jasmine rice $6 Satay chicken skewers $24 Chicken dumpling $22 Total: $78 In the weeks since we sat down for lunch, the gallery’s director is named as Maud Page, the institution’s first female director. I subsequently ask Gonski what he thinks of the appointment. He is delighted. “It is the right choice at the right time. Maud will be very successful taking the gallery to new heights.” Brand was “a joy to work with, and he led us as a group with enormous focus, intelligence and decency”.\n\nA former corporate lawyer and merchant banker, now company director, Gonski has sat on some 40 boards of business and not-for-profits, including Sydney Theatre Company, chair to theatre’s dream team of Cate Blanchett and Andrew Upton, and the National Institute of Dramatic Art. Paul Keating tapped him for his board “apprenticeship” at Bundanon, chairing the trust overseeing the south coast property that Arthur and Yvonne Boyd gave the nation. It’s Arthur Boyd that Gonski credits for expanding his way of seeing. Boyd would stand at his easel and challenge Gonski to see beyond the first blush of colour in the bushland. Where Gonski could pick up six types of greens, Boyd could see 10. They once inspected a venue at Callan Park as a possible art gallery dedicated to the work of Boyd, only for the project to fall over when the artist objected to the space’s disrupted view of an old chimney. Gonski shrugs. Where business can be a shrewd numbers game, art turns on the tiniest slash of colour. It’s an intellectual puzzle that fascinates but is not without sentiment.\n\nThe Gonskis have been art collectors for 35 to 40 years. “People ask, ‘do you change them?’ ‘No, I don’t.’ Each have special value, a 30th wedding anniversary and obviously anything by Arthur Boyd is very special.” Loading Gonski was seven when his family moved to Sydney from Cape Town in 1961, in the aftermath of the Sharpeville massacre, in which 250 people were killed or injured in violent anti-apartheid demonstrations. His father, Alexander, was a neurosurgeon, a scholarship boy who relied on benefactors to send him to university to study science then medicine. “My life was a lot easier than it might have been otherwise, if it hadn’t been for his hard work and the philanthropy of others,” he notes. “Philanthropy often can improve the lives of a number of generations.” From his mother, Helene, came his love for the arts. She would entice the young Gonski to visit the AGNSW with offers of ice-cream, the same trick he uses on his four grandchildren. “Art has always lifted me.”",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/business/companies/welcome-to-starbase-elon-musk-to-get-his-own-city-in-texas-20250505-p5lwsc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Welcome to Starbase: The world’s richest person is making his own city",
    "publish_date": "Tue, 06 May 2025 11:21:32 +1000",
    "category": "finance",
    "authors": [
      "James Warrington"
    ],
    "text": "Elon Musk may have his sights set on Mars, but for the time being the billionaire is building an empire closer to home.\n\nThe Tesla and SpaceX tycoon has been given the green light to set up his own new city in south Texas – dubbed Starbase – after securing the backing of an overwhelming majority of locals, many of whom he employs.\n\nTexas’s newest city, which covers just under 4 square kilometres, will be formed from a string of neighbourhoods in a remote area currently known as Boca Chica that is home to SpaceX’s rocket launch site. Credit: AP\n\nA ballot on Saturday secured 212 votes in favour and just six against. The vote also secured the election of the city’s first mayor and two other officials, all of whom are current or former employees of Musk’s company SpaceX.\n\nThe tycoon celebrated the result in a post on X that read: “Starbase, Texas is now a real city!” The billionaire first publicly suggested the idea in 2021.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/afl/rioli-sent-threatening-messages-to-opposition-player-20250506-p5lwyd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rioli sent threatening messages to opposition player",
    "publish_date": "Tue, 06 May 2025 11:13:16 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rioli sent threatening messages to opposition player\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://au.news.yahoo.com/lottery-worker-reveals-big-mistake-winners-make-ahead-of-30-million-powerball-draw-063410748.html",
    "title": "Lottery worker reveals big mistake winners make ahead of $30 million Powerball draw",
    "publish_date": "2025-05-05T06:34:10Z",
    "category": "finance",
    "authors": [],
    "text": "The Lott has revealed to Yahoo News the one big mistake jackpot winners are likely to make once they learn of their huge windfall.\n\nIt's a good problem to have, but there's a reason The Lott makes winners sit tight for a fortnight after their numbers are called. Source: Supplied\n\nAhead of this week’s enticing $30 million Powerball jackpot draw, lottery officials have revealed to Yahoo News the biggest mistake winners are likely to make after instantly becoming a multi-millionaire.\n\nWith prizes so huge, Powerball winners understandably can’t wait to start spending their money. But the Lott, which runs the life-changing game, has a provision in place forcing winners to stop and think about how they are going to spend their newfound fortune.\n\n“The biggest mistake a winner could make is rushing into their decisions,” the Lott’s Anna Hobdell said in an interview with Yahoo News.\n\nAnna makes the calls to the winners of massive prizes in Powerball, Lotto and Oz Lotto. After convincing them the call is not a hoax, she then explains they cannot spend their prize money straight away.\n\nADVERTISEMENT\n\n“With our Lotto prizes, thankfully you do have to wait two weeks until you receive the funds, so we do encourage our players to have a think over the next two weeks about what they want to do with their winnings, and to perhaps get some financial advice.”\n\nWinners who purchase a ticket in-store have to either visit the Lott’s head office or mail in the ticket to claim their prize. Online players get the funds automatically deposited into their account after a fortnight.\n\nWhat do big lotto winners spend their prize money on?\n\nThe Lott Winners Report for 2024 revealed what the 500 winners of division one prizes across all lottery games in 2023 did with their prize money.\n\nInvesting for the future (53 per cent) was the most popular explanation for how the money was spent, followed by helping family and friends (40 per cent). Just over a quarter of winners (27 per cent) paid off their mortgages, in part or in full, while 26 per cent bought a new house and over a third of lottery winners bought a new car.\n\nADVERTISEMENT\n\nHolidaying with family was a popular treat with winners including one who booked a cruise for 38 people, while 13 per cent of winners donated some of their prize money to charity.\n\nThe largest Australian lottery win was a year ago when an Adelaide man won the $150m Powerball jackpot.\n\n“I’ve never screamed so loud or jumped so high,” the winner told officials from the Lott.\n\nThis week’s $30 million Powerball jackpot will be drawn on Thursday with tickets on sale until 7.30pm (AEST) on the night.\n\nIf gambling is a problem for you go to Gambling Help Online or call 1800 858 858.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 30
  }
]