[
    {
        "url": "https://www.9news.com.au/national/doctors-call-for-spinal-cord-stimulators-to-be-banned-as-study-reveals-major-problems-with-the-expensive-devices/168b670e-bf83-4d58-9f5a-24340e7d9f5c",
        "title": "Shock findings as doctors speak out on costly pain devices",
        "publish_date": "Sun, 20 Jul 2025 22:54:44 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "Australian doctors and health fund providers are calling for the use of spinal cord stimulators to be reconsidered after research revealed one-in-four people are having revision surgery for complications.\n\nSpinal cord stimulators have been used to treat chronic pain, including back pain, neck pain, nerve pain, and complex regional pain syndrome.\n\nThe devices are made up of a small battery pack, which is implanted beneath the skin and attached to electrodes. Pulses of electricity are theoretically supposed to interfere with pain signals coming from the nerves.\n\nREAD MORE: ﻿ Urgent childcare reforms among priorities as parliament returns\n\nAn image showing what a spinal cord stimulator would look like when inserted into a patient. (iStock)\n\nHowever, a study by leading Australian doctors, published in this week's Medical Journal of Australia , found 23 per cent of patients fitted with the device will go on to need revision surgery for complications within three years.\n\nThe median cost for the permanent device is nearly $56,000, with some patients' treatment adding up to more than $500,000.\n\n\"Given the lack of supportive data for their efficacy, and a concerning harms profile, use of spinal cord stimulators for pain control should be reconsidered,\" the researchers wrote in the journal.\n\nLead author Dr Caitlin Jones, from the University of Sydney's Institute of Musculoskeletal Health, told The Sydney Morning Herald the risk posed by the devices was much greater than the likely benefits.\n\n\"Patients should know they are taking on a substantial risk, that is exorbitantly expensive, with very little likelihood of any benefit.\"\n\nPrivate Healthcare Australia, which represents health insurance funds and their 15 million members, has backed the researchers' calls for the use of the devices to be reconsidered.\n\nPHA CEO Dr Rachel David said while the Therapeutic Goods Administration (TGA) last year cancelled the registration of some spinal cord stimulators and imposed conditions on others, they were still available and being used on patients.\n\n\"The regulatory action taken so far has been insufficient. Put simply, if these spinal cord stimulators were new technologies trying to get listed for Medicare funding in Australia, they would be deemed too dangerous,\" she said.\n\n\"The Australian Government should ask the Medicare Services Advisory Committee to assess these devices and consider if they meet contemporary standards for listing. If not, the Medicare items and devices should be removed. This would protect patients from unnecessary harm and reduce wasteful expenditure for taxpayers and people with health insurance who are effectively being forced to fund this.\"\n\nAt least 90 per cent of spinal cord stimulators are inserted in the private health sector.\n\n\"Health funds are committed to continuing to fund evidence-based treatments which have demonstrated safety and efficacy in the treatment of chronic pain,\" David said.\n\nThe Medical Technology Association of Australia (MTAA), which represents device manufacturers has said the devices are safe and effective.\n\nStimulators were \"a demonstrably safe and effective alternative to long-term drug therapies, notably opioids\", a spokesman told The Sydney Morning Herald.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/peter-ryan-death-abc-journalist-dies-after-45-years-as-a-journalist/75d1e997-126d-457b-8c87-23af32dbd26e",
        "title": "ABC journalist Peter Ryan dies aged 64 a month after retirement",
        "publish_date": "Mon, 21 Jul 2025 00:43:46 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "ABC journalist Peter Ryan OAM has died aged 64, just a month after retiring due to ill health.\n\nThe former ABC chief business and finance correspondent left the ABC in June before moving into palliative care for metastatic thyroid cancer.\n\nRyan was first diagnosed in 2014 following a distinguished career with the government broadcaster, including a period as ABC Washington bureau chief and head of TV news and current affairs in Melbourne.\n\nPeter Ryan, ABC's former chief business and finance correspondent, has died aged 64. (ABC)\n\nIn 2022, he was awarded the Order of Australia medal for his service to journalism.\n\n\"Peter leaves a significant legacy. Through his mentorship, friendship and professionalism he directly touched the lives of many at the ABC,\" said ABC news director Justin Stevens.\n\n\"Through his journalism he had a profound impact on the lives of Australians and our society.\n\n\"It was a privilege to know him and work alongside him.\"\n\nUpon announcement of his retirement in late June, Treasurer Jim Chalmers described Ryan as an \"absolute legend\".\n\n\"Every day as you wake up and you think about what's happening in the economy, if you only needed to listen to one voice to be sure that you got it﻿s essential elements, it would be Peter's,\" Chalmers said.\n\nIn 2022, he was awarded the Order of Australia medal for his service to journalism. (ABC News: John Gunn)\n\nRyan began his career as a copy boy at the now-defunct Sydney Daily Mirror in 1980 at age 18.\n\nIt was a time, he once said, where people smoked in newsrooms and newspapers were still printed off hot metal.\n\nBefore his retirement, Ryan had some parting words of advice from his nearly half a century in journalism.\n\n\"One strong message I have is, never let anyone tell you the good old days were really that good – that's a bit of a myth,\" Ryan said.\n\n\"I'd like to thank the ABC for taking so many risks with me over the years, giving me my dream of a foreign posting in Washington and then into big editorial roles.\n\n\"But for me in the end it's all about being a reporter out in the real world telling it as it is. I'm always chuffed when I hear people tell me you're able to take complex issues and break them down into three good parts.\n\n\"When someone tells me that, that's more important than a whole lot of awards.\"\n\nRyan leaves behind his wife, Mary, and a daughter, Charlotte.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/trump-threatens-to-restrict-stadium-deal-with-washington-commanders-if-they-dont-change-name-back-to-redskins-usa-news/1d156b3b-8fd8-46f0-80f5-e5422b4333a5",
        "title": "Trump threatens deal with Commanders if they don't change back to 'Redskins'",
        "publish_date": "Mon, 21 Jul 2025 00:08:05 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": "President Donald Trump on Sunday escalated his call for the Washington Commanders to change their name back to the \"Redskins,\" threatening to restrict the NFL team's $5.7 billion stadium deal if they don't, though it's unclear how he would be able to.\n\n\"I may put a restriction on them that if they don't change the name back to the original 'Washington Redskins,' and get rid of the ridiculous moniker, 'Washington Commanders,' I won't make a deal for them to build a Stadium in Washington. The Team would be much more valuable, and the Deal would be more exciting for everyone,\" Trump wrote on Truth Social.\n\nThe organisation left Washington for Landover, Maryland, in 1997, but DC Mayor Muriel Bowser and the team announced a deal in April to bring the Commanders back to the district at the site of the old Robert F. Kennedy Memorial Stadium.\n\nREAD MORE: Time running out for mystery lotto winner to claim jackpot\n\nPresident Donald Trump speaks during a dinner for Republican senators in the State Dining Room of the White House, Friday, July 18, 2025, in Washington. (AP Photo/Alex Brandon) (AP)\n\nTrump touted the deal at the time, but the proposal is stalled before the DC Council.\n\nSpeaking to reporters last week, Bowser urged the DC Council to \"make moves\" on the deal, adding that \"the Commanders are anxious\" about it.\n\nTrump expressed openness earlier this month to helping out if the DC Council does not approve the deal.\n\n\"It's a great piece of property, so we'll see. But if I can help them out, I would. … The federal government ultimately controls it,\" Trump said.\n\nIn late 2024, lawmakers in Congress passed a bill to transfer ownership of the RFK site from the federal government to the district's government.\n\n\"The owner is very, very successful and a very good man,\" Trump continued.\n\n\"It would be a great place for the NFL to be there, I can tell you that.\"\n\nEarlier Sunday, the president initially referred to the football team as the \"Washington 'Whatever's'\" and urged the owners to \"IMMEDIATELY change their name back to the Washington Redskins Football Team.\"\n\nJayden Daniels #5 of the Washington Commanders is tackled by Jack Campbell #46 of the Detroit Lions during the third quarter in the NFC Divisional Playoff at Ford Field on January 18, 2025 in Detroit, Michigan. (Photo by Gregory Shamus/Getty Images) (Getty)\n\nCNN has reached out to the Commanders and the DC mayor's office for comment on Trump's posts.\n\nTrump's Sunday comments went further than ones he made earlier this month, when he told reporters the Commanders' name should be changed back to the Redskins, something he acknowledged was a \"controversial statement.\"\n\n\"It doesn't have the same ring to me,\" he said.\n\n\"But, you know, winning can make everything sound good. So, if they win, all of a sudden, the Commanders sounds good, but I wouldn't have changed it.\"\n\nThe Commanders aren't the only team moniker Trump wants reverted.\n\nTrump also put the pressure on the Cleveland Guardians to change their name back to the \"Indians,\" claiming that the \"Indian people\" want the Guardians to be the \"Indians\" yet again.\n\nThe names were changed as part of a larger cultural shift as corporate brands reexamined their use of racist caricatures and stereotypical names, but Trump argued Sunday that \"times are different now.\"\n\n\"Our great Indian people, in massive numbers, want this to happen. Their heritage and prestige is systematically being taken away from them,\" Trump said.\n\n\"Times are different now than they were three or four years ago. We are a Country of passion and common sense. OWNERS, GET IT DONE!!!\"\n\nAnd in a later post Sunday, Trump claimed Matt Dolan, a former Ohio state lawmaker whose family owns the Guardians, \"has lost three Elections in a row because of that ridiculous name change. What he doesn't understand is that if he changed the name back to the Cleveland Indians, he might actually win an Election.\"\n\n\"Indians are being treated very unfairly. MAKE INDIANS GREAT AGAIN (MIGA)!\" Trump added, a riff on his \"Make America Great Again,\" or MAGA, slogan.\n\nCNN has reached out to the Cleveland Guardians for comment.\n\nThe Washington football team dropped the \"Redskins\" name in 2020 after decades of criticism from Native American groups that said it was an ethnic slur and a derogatory reference to skin color.\n\nTwo years later it unveiled the \"Commanders\" name.\n\nThe Cleveland baseball team announced its name change in 2021, after similar criticism from Native Americans over the \"Indians\" moniker.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/andy-byron-tech-company-ceo-caught-coldplay-kiss-cam-resigns/86aae5bb-57fa-4d3b-8306-8949c9f6036a",
        "title": "CEO resigns after Coldplay kiss cam scandal",
        "publish_date": "Sun, 20 Jul 2025 23:39:52 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "The IT company CEO captured in a widely circulated video showing him embracing an employee at a Coldplay concert has resigned.\n\nAndy Byron resigned from his job as CEO of Cincinnati-based Astronomer Inc, according to a statement posted on LinkedIn by the company Saturday.\n\n\"Astronomer is committed to the values and culture that have guided us since our founding. Our leaders are expected to set the standard in both conduct and accountability, and recently, that standard was not met,\" the company said in its post on LinkedIn.\n\nAndy Byron has stepped down as CEO of Astronomer after being caught on Coldplay's kiss cam. (TikTok/instaagraace)\n\nThe move comes a day after the company said that Byron had been placed on leave and the board of directors had launched a formal investigation into the jumbotron incident, which went viral. A company spokesman later confirmed in a statement to AP that it was Byron and Astronomer chief people officer Kristin Cabot in the video.\n\nThe short video clip shows Byron and Cabot as captured on the jumbotron at Gillette Stadium in Foxborough, Massachusetts, during a Coldplay concert on Wednesday.\n\nLead singer Chris Martin asked the cameras to scan the crowd for his \"Jumbotron Song,\" when he sings a few lines about the people the camera lands on.\n\nThe company posted a statement on LinkedIn. (X/@astronomerio)\n\n\"Either they're having an affair or they're just very shy,\" he joked.\n\nInternet sleuths identified the man as the chief executive officer of a US-based company and the woman as its chief people officer.\n\nPete DeJoy, Astronomer's cofounder and chief product officer, has been tapped as interim CEO while the company conducts a search for Byron's successor.\n\nMost concert venues warn attendees that they can be filmed\n\nIt's easy to miss, but most concert venues have signs informing the audience that they could be filmed during the event.\n\nLook for them on the walls when you arrive and around the bar areas or toilets.\n\nIt's common practice especially when bands like to use performances for music videos or concert films.\n\nThe venue in this case, Gillette Stadium in Foxborough, also has a privacy policy online which states: \"When you visit our location or attend or participate in an event at our location, we may capture your image, voice and/or likeness, including through the use of CCTV cameras and/or when we film or photograph you in a public location.\"\n\nREAD MORE: Urgent childcare reforms among priorities as parliament returns\n\nChris Martin of Coldplay. (Getty)\n\nOnce captured, a moment can be shared widely\n\n\"They probably would have got away with it if they hadn't reacted,\" said Alison Taylor, a clinical associate professor at New York University's Stern School of Business. And by the time the alleged identities emerged on social media, it hit a classic nerve around \"leaders acting like the rules don't apply to them,\" she added.\n\nStill, Taylor and others stress how quickly such a video can lead to an internet search to find the people involved – and note that it's important to remember that such \"doxing\" isn't just reserved for famous people.\n\nBeyond someone simply spotting a familiar face and spreading the word, technological advances, such as the rising adoption of artificial intelligence, have made it easier and faster overall to find just about anyone in a viral video today.\n\n'Hello Neil and Buzz': Richard Nixon telephones the moon View Gallery\n\n\"It's a little bit unsettling how easily we can be identified with biometrics, how our faces are online, how social media can track us – and how the internet has gone from being a place of interaction, to a gigantic surveillance system,\" said Mary Angela Bock, an associate professor in the University of Texas at Austin's School of Journalism and Media.\n\n\"When you think about it, we are being surveilled by our social media. They're tracking us in exchange for entertaining us.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/topical-steroid-withdrawal-mum-claims-six-month-old-baby-developed-skin-condition-after-eczema-treatment-health-news/5c3a7e15-13c8-4b93-8b3b-4b75c200c978",
        "title": "Nikki's baby had a common rash. But treatment withdrawal was worse",
        "publish_date": "Sat, 19 Jul 2025 20:27:33 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "A Melbourne mother-of-two says her six-month-old daughter is suffering from cracked, crusting and bleeding skin due to withdrawal from topical steroids prescribed to treat eczema.﻿\n\nNikki Estrada took her baby daughter, Xenrea, then four months old, to hospital after she became dehydrated due to low milk supply.﻿\n\nWhile they were there, ﻿doctors noticed a red patch on Xenrea's cheek and prescribed five days of antibiotics and 14 days of topical steroid cream as well as bleach baths as a \"precaution\" in case the skin had become infected.\n\nBaby Xenrea pictured when doctors first diagnosed her eczema (left) and after ceasing topical steroid treatment after 14 days (right). (Supplied)\n\n\"﻿I thought it was a normal baby skin rash, I didn't suspect it was eczema,\" Estrada said. ﻿\n\n\"My gut instinct was like, this is wrong, she doesn't need it... but you just think, I'm gonna listen to the doctors.\n\n\"And it worked, the little patch on her cheek, it was gone.\"\n\nBut two days after finishing the prescribed topical steroid cream treatment, she said ﻿her daughter's symptoms worsened.\n\n\"As soon as I stopped, it just came back with a vengeance,\" Estrada said.\n\n\"It's broken, it's open, it's weeping, she doesn't sleep.\n\n\"I can't sleep because I need to hold her so she doesn't scratch.\n\n\"Her mouth cracks and bleeds from trying to eat.\"\n\nDesperate and distressed, Estrada took Xenrea to the GP and a paediatrician, who both recommended she resume the topical steroids until the symptoms cleared.\n\nBy that time, she had begun researching topical steroid withdrawal (TSW) online and had found similar cases in online support groups.\n\nXenrea's symptoms dramatically worsened after completing the prescribed 14 days of topical steroid creams. (Supplied)\n\nTSW is characterised by red, burning and itchy skin﻿, that sometimes presents after ceasing prolonged or high-potency steroid treatment.\n\n\"Speaking to other mothers, it sounded like she was going through a withdrawal, because, you know, I only applied (steroid cream) to her face, but it was everywhere on her body, which was identical to other parents and their kids,\" she said.\n\n\"First, it becomes really, really red and hot and burning, and then the body will ooze, the skin barrier breaks, and then it scabs, and because it's so dry it bleeds and it's prone to infection, and it's just a cycle until the new skin comes back up.\"\n\nEstrada is now seeing a naturopath and says her daughter's skin is slowly improving with the use of natural creams﻿, and prebiotic and probiotics for her gut health.﻿\n\n\"It's just been so heartbreaking seeing my daughter in so much pain and she's only six months old,\" she said.\n\n\"I feel like I've still got months until her skin's gonna go back to how it was.\"\n\nAccording to Professor Deshan Sebaratnam, a dermatologist at The Skin Hospital in Sydney﻿, side effects from the use of steroid creams are rare.\n\n\"When used for skin conditions which come and go like eczema, where you are only applying them for a few days then taking a break, side effects are vanishingly rare,\" Sebaratnam said.\n\n\"When patients stop using their steroids, their underlying skin disease can flare back up, and sometimes this can be confused by people as dependency or addiction – which it isn't.\n\n\"Patients need to also consider the effects of not controlling their eczema – itch, pain, increased risk of infection, sleep disturbance, cost, the impact on the whole family et cetera.\"\n\nREAD MORE: Backpacker killer Bradley John Murdoch takes deadly secret to his grave\n\nProfessor Deshan Sebaratnam said topical steroid creams are safe when used under the direction of a doctor, and side effects are rare. (Supplied)\n\nEczema is often worse in winter, due to low humidity, long hot showers, and irritation caused by people wearing extra layers, heating and electric blankets.\n\nMelody Livingstone, CEO of Australian skincare company MooGoo, said sales of ﻿their eczema and psoriasis creams had doubled this winter, compared to last year.\n\n\"Australia has one of the highest incidences of eczema in the world, and it is only getting worse – 50 years ago, only one in 10 Australian children suffered from it,\" she said.\n\nEczema, also known as atopic dermatitis, is a chronic, debilitating disease that affects 2.8 million Australians, including one in three Aussie kids under the age of six.\n\nManagement includes﻿ keeping the skin moisturised and avoiding triggers such as soap, fragranced washing detergents, prickly fabrics, and heat.\n\nTopical steroid creams, when used under the supervision of a doctor, are widely considered by doctors and specialists to be a safe treatment for flare-ups.\n\nPlease note the information in this story is general in nature. Please always consult your GP or health professional for advice that is tailored to your specific health concerns.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/increasingly-difficult-why-physical-retail-stores-are-closing-down-retail-expert-gary-mortimer/bde09dbe-295b-4e7a-a805-f229cc115aa5",
        "title": "Why retailers are reassessing the need for physical retail stores",
        "publish_date": "Sat, 19 Jul 2025 20:27:04 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "The cost of doing business is making it \"increasingly difficult\" for ﻿retailers to operate in Australia, an expert says, as more shops close down physical locations.\n\nAccording to ﻿leading retail expert ﻿Gary Mortimer, businesses are re-assessing the need for brick-and-mortar stores, with some offering a hybrid-style online-offline model.\n\n\"Margins are getting squeezed and I think that's why we're seeing more retailers closing some physical stores and pushing more of their business online,\" Mortimer said.\n\nCountry Road closed its Queen Victoria Building store in Sydney closed in June.﻿ (Louis Trerise)\n\n\"In the same way that households struggle with that cost-of-living crisis with increasing electricity, gas, rates, household costs - businesses are facing those same costs.\n\n\"Rents are going up, wages are going up, electricity is going up and security services are going up.\n\n\"Fashion, generally between 25 to 30 per cent of their revenue is now online, which tends to suggest you could potentially close 25 per cent of your stores, move that revenue from an online channel and not actually experience any net loss to your revenue.﻿\"\n\nIn March, Jeanswest announced it would close all brick-and-mortar stores and cut hundreds of jobs as its parent company entered administration.﻿\n\nMeanwhile, the remaining Millers and Noni B stores closed earlier this year after parent company Mosaic Brands collapsed.\n\nLeading retail expert ﻿Gary Mortimer said businesses must continue to evolve. (Supplied)\n\nCountry Road is the latest brand to reassess its retail portfolio after it closed its ﻿landmark store inside the Queen Victoria Building in Sydney in a move the company said would ﻿\"ensure we're continuing to meet the needs of our customers\".\n\n\"We are committed to delivering great experiences throughout our networks and we are investing in our stores, with 10 new or refurbished stores opening by the end of the year,\" the spokesperson said.\n\n\"This includes our beautifully renovated Mosman store reopening in September, a new Country Road flagship store in Queen Street, Brisbane opening in August and three new stores opening in Chatswood Chase in October.\"\n\nMortimer said the cost of rent at flagship locations could come at an \"astronomical\" cost for some businesses.\n\n\"Flagship stores really only work now today for global brands that can afford the commercial real estate and you can underpin those costs with global sales,\" he said.\n\n\"If you're an Australian fashion retailer, you don't have a global revenue stream, it's a very costly exercise to maintain those premises.\"\n\nIn order for brands to withstand challenges in Australia, Mortimer said ﻿must evolve and widen their range to cater to a range of consumers.\n\n\"RM Williams readjusted their range several years ago to target that younger market, the 25- to 35-year-old market to replace an aging consumer group,\" he said.\n\n\"I think good fashion businesses, particularly those that are 50 to 60 years old, need to constantly reinvent themselves so they are always attracting a new market.\"﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/fraser-suites-perth-residents-protest-over-social-housing-transformation/fc17fd99-0105-4add-b697-76854b95fbdd",
        "title": "Perth residents accused of NIMBYism over social housing transformation",
        "publish_date": "Sat, 19 Jul 2025 15:16:02 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "East Perth residents are ramping up their push against the transformation of a once luxury hotel, into a mixed housing complex.\n\nProtesters today claimed they're not against social housing, insisting they've been totally blindsided by the state government and haven't had community consultation.\n\nBut homelessness advocates say the crisis is becoming so desperate, we need to put an end to NIMBYism, a term referring to a \"Not In My Backyard\" mentality.\n\nREAD MORE:\n\nPerth residents are being accused of NIMBYism after a luxury hotel was transformed into a mixed social and affordable housing complex. (9News)\n\nThe majority of people protesting the plans to turn Fraser Suites into a social and affordable housing complex live a stones throw from the building.\n\nThey claim they were blindsided by the state government's $100 million purchase last month, saying their biggest concerns are density, shared spaced and parking.\n\n\"We want to make sure from here on in consultation, planning and doing the right thing by the complex, not just by this building,\" one protester said.\n\nThe group denies it's a case of \"not in my backyard\".\n\n\"We support social housing, we just want it to be done in the right way and we feel that in Australia we have the resources and the money to do this better,\" another local said.\n\nHomelessness advocates say we can't afford to wait, with 22,000 West Aussies currently on a two-year waitlist for social housing.\n\nThey say the hotel's 236 rooms barely scratches the surface.\n\n\"We know people sleeping in cars, sleeping under bridges, staying with family,\" Kath Snell from Shelter WA said.\n\nThe Housing Minister is pushing a similar sentiment.\n\n\"The growing cohort is women over 55 who are at risk of homelessness, they're the type of people that I'm trying to provide housing for,\" John Carey said.\n\nCarey met with opponents airing their concerns for the second time in two weeks but resident says it's not enough.\n\nWith an overflowing waitlist, the state government hasn't ruled out plans to repurpose more WA buildings and turn them into social and affordable housing.\n\nLike Fraser Suites, there's no guarantee community consultation will take place beforehand.\n\n\"To mess with people's house and them not know anything about it, leaves a really sour taste in my mouth,\" one local said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-21/venus-williams-back-on-tour-wishes-serena-come-out-retirement/105554142",
        "title": "Venus Williams is back on tour, and wishes Serena was too",
        "publish_date": "Mon, 21 Jul 2025 01:47:01 +0000",
        "category": "sports",
        "authors": [],
        "text": "Venus Williams is back on the tennis scene, ready to compete for the first time in more than a year at the DC Open.\n\nAnd she has teased the media that she would love it if her sister Serena Williams came back too.\n\n\"I keep saying to my team: The only thing that would make this better is if she was here,\" Venus said when asked about a recent video on social media that showed Serena swinging a racquet.\n\n\"Like, we always did everything together, so of course I miss her.\n\n\"But if she comes back, I'm sure she'll let y'all know.\"\n\nSerena, 43, hasn't played since the 2022 US Open, when she declared she was \"evolving\" away from the sport she dominated for stretches on the way to 23 grand slam singles titles and an additional 14 in doubles with Venus.\n\n\"I don't know what she's going to do. I don't ask those questions,\" Venus said a day before the start of the hard court tournament in Washington.\n\n\"I think we always hit the ball, because that's who we are. We're always hitting.\"\n\nShe said Serena showed up at a recent practice session and joined in for about 15 or 20 minutes.\n\n\"She can take six months off and she clocks it clean,\" Venus said.\n\n\"You can't teach that kind of talent. She's just so good.\"\n\nThey both were the best around at one point.\n\nVenus Williams (right) and Serena Williams (left) won 14 major women's doubles titles together, including six Wimbledon crowns. (Getty Images: Anadolu Agency/Lindsey Parnaby)\n\nBoth reached number one in the rankings.\n\nVenus, who turned 45 last month, won seven major singles championships, two at the US Open and five at Wimbledon.\n\nHer last tournament was in March 2024 at the Miami Open, where she exited in the first round. It's been so long that the official WTA Tour website lists her as \"inactive\".\n\nWilliams is drawn to meet fellow American Peyton Stearns in the round of 32 on Wednesday (Australian time).\n\n\"This is very special for me to come back and play tennis,\" Venus said.\n\n\"I think it's a surprise for the fans — and a surprise in general, as I hold my cards tight.\"\n\nIt came as a bit of a shock to the tennis world when her appearance in Washington via a wild card invitation was announced a week ago.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nHer team had reached out to DC Open chair Mark Ein via text in April to gauge whether he would be open to having Venus at an event she last entered in 2022.\n\nHe said he needed two seconds to reply: \"Of course.\"\n\n\"She's such an icon of the sport — and, importantly, both on and off the court,\" Ein said in an interview.\n\n\"So anytime you can have her engaged and have the spotlight on her and everything she's done and continues to do, it's hugely positive.\"\n\nWhat did she miss the most while away from the tour?\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"All the times that I had and, of course, the adrenaline, all those things,\" Venus said.\n\n\"Just the pure fun of playing the game, the fun of the challenge, overcoming. When you play, you overcome so many challenges: your opponents, the conditions. A lot of times, you have to overcome yourself. Those things are very exciting.\"\n\nWhen asked why she's getting back on court, Venus offered a simple response: \"Why not?\"\n\nAs for whether this is a one-stop tour or she plans to play elsewhere, she wasn't prepared to say much.\n\n\"I'm just here for now, and who knows?\" Venus said.\n\n\"Maybe there's more. … But at the moment, I'm focused just on this. I haven't played in a year. There is no doubt I can play tennis, but obviously, coming back to play matches, it takes time to get in the swing of things.\n\n\"I definitely feel I'll play well. I'm still the same player. I'm a big hitter. I hit big. This is my brand.\"\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-21/opals-triumph-australia-beats-japan-win-asia-cup-for-first-time/105553736",
        "title": "Opals triumph as Australia beats Japan to win Asia Cup for first time",
        "publish_date": "Sun, 20 Jul 2025 23:17:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's women's basketball team has won the Asia Cup for the first time, beating defending champions Japan 88 points to 79 in the final.\n\nThe Opals led at every break of the gold medal match in Shenzhen, China, going on to clinch the win, which also qualifies Australia for next year's World Cup in Germany.\n\nAustralia finished undefeated in five games — the Opals defeated Korea 86-73 in the semifinal on Saturday.\n\nChina beat Korea 101-66 in the bronze medal game.\n\nAustralia led by 9 points at quarter-time, and 11 at the half, before the Japanese team fought back to bring the lead back to 8 points at the final change.\n\nBut despite levelling the scores twice in the final quarter, Japan could not hit the front as Australia went one further than the team's previous best result of silver in 2017.\n\nCoach Paul Goriss praised his team for their performance against a formidable opponent in the six-time champions, Japan.\n\n\"Our pace, our execution I, think was one of our better games of the tournament defensively, and you could just see by everybody coming and contributing,\" he said.\n\n\"So [I'm] really happy and proud of the team for their efforts for this whole week.\"\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nThe Opals spread the scoring load, with Alexandra Fowler top-scoring with 15, followed by Alex Wilson with 14 and Stephanie Reid with 13.\n\nThe Japanese team was led by 21 points from Kokoro Tanaka, and 18 points from Yuki Miyazawa.\n\nCourtney Woods and Cayla George each had five steals, and Wilson also had six rebounds.\n\nFowler was named the tournament's Most Valuable Player honours as she finished the Asia Cup finals with averages of 11.8 points and 7.2 rebounds per game.\n\nFowler and Reid were included in the All-Star Five, along with Japan's Tanaka, Korea's Park Ji Hyun and China's Han Xu.\n\n\"It's so fun to be out on the stage and in front of a crowd wearing the Australian jersey,\" Fowler said after the final.\n\n\"I think we had an amazing group of girls come together, and I couldn't be more prouder of the group and the coaching staff, it's been so much fun this whole tournament.\"\n\nAustralia had another podium finish in the FIBA Women's Under-19 World Cup in Czechia, where the Gems took silver, losing 88-76 in the final to the United States team, which clinched a fourth straight title.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-21/temu-doubles-advertising-spend-in-australia/105547184",
        "title": "Temu's big Aussie ad spend infuriates mum of 9yo burnt in jumper fire",
        "publish_date": "Sun, 20 Jul 2025 23:10:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Online shopping platforms based overseas are spending millions of extra dollars on advertising in Australia as they seek to expand their presence outside the US, following the introduction of President Donald Trump's heavy new import tariffs.\n\nThe change in marketing strategy has caused fears that a new deluge of unsafe products will flood into Australia.\n\nHannah Jacobs-Herd's nine-year-old daughter Daniella sustained severe burns in July last year, after a hoodie purchased on Temu, a Chinese e-commerce company that ships goods directly to buyers from third-party sellers, caught alight.\n\nDaniella received severe burns to 13 per cent of her body, including her face, after sparks from a fire pit hit the hoodie and it immediately went up in flames.\n\nDaniella Jacobs-Herd underwent eight weeks of skin graft operations. (Supplied: Hannah Jacobs-Herd)\n\nMs Jacobs-Herd said after the trauma suffered by her daughter, it was distressing to see a deluge of Temu advertising pop up when she played free games on her tablet computer.\n\n\"She [Daniella] cannot escape Temu. We cannot escape Temu. It is just everywhere,\" she said.\n\nMs Jacobs-Herd said she braced for more advertising from the platform when she heard about Mr Trump's \"Liberation Day\" tariffs targeting China.\n\n\"I lost it because I knew that we were going to get bombarded,\" she said.\n\nTrump call drives Temu to Australia\n\nIn April this year, Mr Trump signed an executive order restoring an import charge for Chinese goods valued at or under $US800 ($1,224).\n\nThe move doubled the cost of goods bought through Temu by American consumers, driving the company away from the US to more favourable markets, including Europe and Australia.\n\nDonald Trump removed an import fee exemption for low-cost China goods in April. (Reuters: Kevin Lamarque)\n\nGoods worth less than $1,000 can generally be imported into Australia free of duties, taxes or charges, meaning retailers do not need to absorb import fees or pass them on to Australian consumers.\n\nSharing data exclusively with the ABC, US market intelligence firm Sensor Tower said Temu had more than doubled its monthly Australian advertising spend from April to June 2025, compared with March.\n\nSince Temu's 110 per cent increase in advertising spend, the platform's monthly users have increased by 50 per cent for the June quarter.\n\nShein, another Chinese marketplace app, increased its monthly Australian advertising spend by 160 per cent, for a 15 per cent increase in monthly users.\n\nMarket analysts say Temu has more than doubled its monthly Australian advertising spend. (Reuters: Florence Lo)\n\nSensor Tower estimated Temu spent more than $4 million on Australian advertising in January alone, primarily through Facebook and Instagram.\n\nTaylor Brydges, a research principal at the University of Technology Sydney's Institute for Sustainable Futures, said the Sensor Tower data was representative of Temu's shift away from the US.\n\n\"Temu is looking to … the kind of places where shipping is still low cost and … crucially, where consumers are still quite price sensitive due to cost-of-living pressures,\" Dr Brydges said.\n\nTemu did not directly respond to questions from the ABC about its increased advertising spend in Australia.\n\nA spokesperson said the company opened the platform to Australian suppliers in March this year to better support them to cater for the local market.\n\nHannah Jacobs-Herd wants stronger consumer protection laws in place. (ABC Wide Bay: James C Taylor)\n\nDaniella's mother said she was worried more Temu customers would be harmed because of Australia's weak consumer protection laws.\n\n\"There should be more enforcement around it,\" Ms Jacobs-Herd said.\n\nIt is a sentiment echoed by consumer protection advocates.\n\nGeneral safety provision\n\nThe Australian Competition and Consumer Commission (ACCC) recently released a report on its five-year inquiry into digital platforms.\n\nThe report found Temu had rapidly become Australia's most-used retail marketplace app since launching in the country in March 2023.\n\nTemu has become Australia's most-used retail marketplace app. (Supplied: Australian Competition and Consumer Commission)\n\nIt noted that, unlike Australia, regions including the European Union, Canada and the US had responded to the growing popularity of online retail platforms like Temu by prohibiting the sale of unsafe goods.\n\nConsumer advocacy group Choice has been calling for a similar general safety provision since 2020.\n\nChoice deputy director of campaigns Andy Kelly said recent research by the group showed 74 per cent of consumers mistakenly believed businesses were legally required to ensure products were safe before selling them in Australia.\n\n\"A general safety provision is long overdue. We know consumers have a false sense of security when it comes to product safety in Australia,\" he said.\n\nIn a statement, Assistant Minister for Competition, Charities and Treasury Andrew Leigh said the government was considering the findings of the ACCC's report, including the recommendation for a proactive general safety provision.\n\n\"No business should gain a competitive advantage by compromising on safety. Australian consumers deserve to know that online marketplaces value their safety and have taken steps to ensure their products are safe to use,\" he said.\n\nAndrew Leigh says the government is considering the findings of the ACCC report. (ABC News: Ian Cutmore)\n\nIn the meantime, Ms Jacobs-Herd said she worried other families would suffer harm after seeking a bargain.\n\n\"We're just pretty much like any person who want to buy their child an Oodie but they can't afford it, so they find a knock-off — lots of people do that,\" she said.\n\n\" If I go online and buy the same thing for a cheaper price, I've got to question if my kid's going to die from this product. \"\n\nWill Temu and Shein change the way we shop online forever? Photo shows Clothing website Shein is shown on a computer screen, and online retailer Temu is shown on mobile phone screen. The cost-of-living crisis has seen Shein and Temu become major players in online retail, but their meteoric rise comes at the expense of local businesses.\n\nFour months after Daniella was burned, Temu issued a voluntary recall notice for the hoodie in consultation with the ACCC.\n\nMs Jacobs-Herd, who lives three hours north of Brisbane in Hervey Bay, is currently engaged in a lawsuit with Temu over the incident.\n\nA Temu spokesperson told the ABC the company had banned the merchant involved from selling \"children-related products\" on its platform globally.\n\nThe spokesperson said as a third-party marketplace, Temu required all merchants to fully comply with local laws and standards.\n\n\"We have in place a quality assurance system that includes vetting sellers and product listings, physical spot checks … monitoring using technology and human reviewers, and swift enforcement action,\" they said.\n\n\"We are also in discussions with the ACCC about becoming a signatory to the Online Product Safety Pledge.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-21/scottie-scheffler-open-championship-tiger-woods-royal-portrush/105552106",
        "title": "Scottie Scheffler's search for meaning carries him to Tiger's stratosphere",
        "publish_date": "Sun, 20 Jul 2025 22:16:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "Spare a thought for the rest of them — the literally thousands of professional golfers whose lifelong dedication to the most torturous of sports has cost them unquantifiable time, money and extracts of their souls.\n\nThese men and women who would give it all up again three times over for that one perfect day, when the wind blows just right, all the putts catch lips and fall in, and their name is the one adorning the top of the leaderboard at sunset.\n\nWhat were they to think when they saw Scottie Scheffler, the best player on the planet, tell the world that the view from the top wasn't all that?\n\n\"It feels like you work your whole life to celebrate winning a tournament for like a few minutes,\" Scheffler said a few days out from the first round of the Open Championship at Royal Portrush.\n\n\"It only lasts a few minutes, that kind of euphoric feeling.\n\n\"You win it, you celebrate, hug my family, my sister's there, it's an amazing moment. Then it's like, OK, what we eating for dinner? Life goes on.\"\n\nScottie Scheffler opened up in a pre-Open press conference. ( AP: Francisco Seco)\n\nScheffler's five-minute stream-of-consciousness monologue in that press conference was remarkable. Even more so now that he has gone and wiped the floor with the field to win his first Open Championship title by four shots.\n\nThis victory was so total, and the gap between Scheffler and the rest of the world is now so great, that he can be held up alongside the great Tiger Woods without hyperbole.\n\nBy just about any measure or metric, Scheffler is the best since Tiger.\n\nIt's there in the numbers, and in the numbers behind the numbers. It's there in the relentless, suffocating winning, and in the ability to make a 54-hole lead feel like a foregone conclusion before Sunday even arrives.\n\nIt's there in the testimony of those who would know, including Jim \"Bones\" Mackay — Phil Mickelson's long-time caddy whose view of Tiger's mastery was better than most — who said of Scheffler on Saturday: \"I never thought in my lifetime I'd see a player as close to Tiger as this man currently is.\"\n\nScheffler plays and wins like Tiger did. Tiger reached global mega-stardom thanks to his charisma and ability to produce the spectacular when required, but for the most part, his major victories were built on a tasteful monotony.\n\nHit the fairway, hit the middle of the green, one-putt for birdie or two-putt for par. Nothing flashy, nothing silly. Let the others make their mistakes as they get lost and dizzy in the churn of your orbit.\n\nWithout the \"Tiger-mania\" factor, Scheffler has often come across as a dry and unengaging champion, unique only for the excessive footwork in his apparently foolproof swing.\n\nScottie Scheffler was unflappable and frequently brilliant at Royal Portrush. (Getty Images: David Cannon)\n\nBut in one press conference, Scheffler has changed perceptions. Here is a man who almost feels guilty for how much he likes golf, terrified it might one day interfere with the things that provide fulfilment in the \"deepest places of your heart\".\n\nHe is addicted to winning, but he's not sure why, and he kind of wishes he wasn't. By his own admission, he will give this career away should it ever begin to adversely impact his relationship with his wife, Meredith, or his 14-month-old son, Bennett.\n\nIn this sense, without putting too fine a point on it, Scheffler is the anti-Tiger.\n\nNothing in the universe has ever mattered as much to Tiger as winning golf tournaments. It consumed him, created him, propelled him and then eventually destroyed him.\n\nThese are likely not obstacles Scheffler will ever have to clear. His level head means that more than any other post-2010 challenger to Tiger's throne, he has the best chance to emulate his deeds.\n\nRory McIlroy was the first to be ordained, and in completing the career grand slam at the Masters this year, proved those comparisons were not entirely misplaced.\n\nRory McIlroy is a captivating and brilliant golfer, but is more emotionally volatile than Scottie Scheffler. (Getty Images: Michael Reaves)\n\nBut McIlroy is emotional and streaky, stuck between caring so incredibly much that he becomes an all-conquering cyborg like Tiger, and caring just enough to maintain calm and perspective like Scheffler.\n\nJordan Spieth had a run at it in his early 20s and was endlessly entertaining in doing so, but burned out when the exhilarating shots stopped coming off and self-doubt crept in. Spieth never knew how to play boring, let alone master it like Scheffler.\n\nBrooks Koepka is a more interesting comparison, as his is the strongest post-Tiger major resume. His schtick was nonchalance, but while replacing Scheffler's existentialism with frat house egotism — \"why would I even care about this, bro? This is just so easy for me\".\n\nBut golf never stays easy for long, and Koepka was rarely able to inspire himself outside of the brightest lights.\n\nFor now and for the foreseeable future, there is just Scottie Scheffler.\n\nGoing from the depths of his press conference rabbit hole on Tuesday to the runaway Champion Golfer of the Year on Sunday, again proved his mental fortitude is just as elite as his ball striking.\n\nOf course, what Scheffler said in that press conference was painfully true. Once he has set the Claret Jug down somewhere safe, he and his family will begin to plan for dinner, try like hell to get Bennett to sleep in a reasonable time frame, and then begin thinking about the next tournament.\n\nOn and on it goes. He still may not be any closer to discovering what the point of it all really is.\n\nBut one would hope that the glow from this victory lasts a little longer. It's not every day that you touch the clouds upon which greatness rests, let alone pull yourself up and take a seat.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-21/tour-de-france-stage-15-alaphilippe-celebrates-finds-he-is-third/105552862",
        "title": "Alaphilippe celebrates Tour stage win — only to find he's third",
        "publish_date": "Sun, 20 Jul 2025 21:46:51 +0000",
        "category": "sports",
        "authors": [],
        "text": "Belgium's Tim Wellens overpowered his breakaway companions to claim victory on stage 15 of the Tour de France — but French rival Julian Alaphilippe later wrongly celebrated thinking he had won, only to find out he was third.\n\nThe French showman, who is loved by fans for his aggressive, attacking riding, won a bunch sprint, beating another Belgian, Wout van Aert, and France's Axel Laurance.\n\nHe sat up and punched the air in triumph on the line, not realising he had finished one minute, 36 seconds behind Wellens and eight seconds behind second-placed Victor Campenaerts.\n\nAlaphilippe, who had been involved in a big crash early on the stage, smiled at his mistake after the race.\n\n\"Of course, you have to take it in a funny way,\" Alaphilippe told reporters after the end of the stage.\n\n\"Even after the line, Wouty [Wout van Aert] said to me 'no, no, there is people in the front [ahead of us].\n\n\"Yeah, after the crash, my radio didn't work, so I have to take it in a funny way.\n\n\"I did it on Liège–Bastogne–Liège, now I did it on the Tour, so it's part of the game.\"\n\nIn 2020, Alaphilippe looked to have won the Belgian one-day cycling classic Liège–Bastogne–Liège, and sat up on the line, raising his arms in triumph, only to be pipped by the fast-finishing Primož Roglič.\n\nWellens, one of defending champion and overall leader Tadej Pogačar domestiques, jumped away from a leading group of six some 43 kilometres from the finish and never looked back, beating compatriot Campenaerts by 1:28.\n\n\"It's a very special victory, everybody wants to ride the Tour but not everybody wins on the Tour de France,\" Wellens said.\n\n\"Suddenly there was a big crash … I followed one move and I was in the breakaway.\n\n\"I had an opportunity, I took it and I had legs to finish it.\"\n\nWellens's master, Pogacar, still leads Denmark's Jonas Vingegaard by 4:13 in the overall standings, edging 169.3 kilometres closer to a fourth Tour title after the hilly ride between Muret and Carcassonne.\n\nGerman Florian Lipowitz sits in third place, 7:53 off the pace.\n\n\"I'm actually happier than for any of my wins,\" said Pogačar, who added he was recovering from a sore throat.\n\nTour de France Selected overall standings after Stage 15 1: Tadej Pogačar (SLO)\n\n2: Jonas Vingegaard (DEN) +4 min 13 seconds\n\n3: Florian Lipowitz (GER) +7:53\n\n4: Oscar Onley (GB) +9:18\n\n5: Kévin Vauquelin (FRA) +10:21\n\n12: Ben O'Connor (AUS) +25:44\n\n\"With all the ice we're having [to cool down from the heat] and the air conditioning, half of the peloton has a sore throat. It's a pain.\"\n\nThe top riders stayed quiet all day, Pogačar slowing down after Lipowitz and Vingegaard were caught up behind an early crash.\n\nIt was a hectic stage with relentless attacks from riders looking to capitalise on the rare opportunity of a victory as flat and mountain stages are the exclusive domain of top sprinters and general classification contenders.\n\nThe group who would fight for the win took shape after more than 100 kilometres and Wellens was not only the stronger rider, he was also the smartest.\n\nHaving done very little in the breakaway — one of the perks of riding for the yellow jersey holder — Wellens attacked on a slightly uphill section, catching everyone off guard.\n\nThe 34-year-old attacked and the chasing group quickly disappeared into the background as he sped to his maiden Tour de France win to complete his grand tour stage victory collection after prevailing in the Giro d'Italia in 2016 and 2018 and in the Vuelta a Espana in 2020.\n\nMonday is a rest day on the Tour de France, in Montpellier.\n\nWires/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-21/stolen-generations-survivors-demand-redress-scheme-be-expanded/105517078",
        "title": "Stolen Generations members ineligible for redress deliver blunt message",
        "publish_date": "Sun, 20 Jul 2025 21:35:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Standing with Western Australia's beaming premier on the steps of parliament, Angela Ryder smiled briefly for a photo.\n\nReaders are advised that this article may contain an image of Indigenous people who have died.\n\nThe announcement of a redress scheme for survivors of WA's Stolen Generations was something the 62-year-old Goreng/Wiilmen Noongar woman had spent years fighting for as part of Yokai, a group of survivors who came together in 2013.\n\nBut for Ms Ryder and her sister Meredith Edmonds, the day was also bittersweet.\n\nMeredith Edmonds and Angela Ryder were forcibly removed from their parents for the first time in 1973. (ABC News: Keana Naughton)\n\nAuthorities took them and their siblings from their family's farm near Tambellup, 320 kilometres south of Perth, to Roelands Native Mission in 1973, after the scheme's cut-off date of July 1, 1972, meaning they are not eligible for the reparation payments the scheme provides for.\n\n\"There was physical, emotional and sexual abuse that occurred during my time at the missions and also during my time in other state facilities,\" Ms Ryder said.\n\n\" I know you've got to draw a line in the sand somewhere but to hear that date … how does that address our trauma? \"\n\nCourt records show Angela Ryder née Edmonds was declared a neglected child. She can't recall any formal proceeding. (Supplied: Angela Ryder)\n\nMs Ryder was 10 years old when she was first put in Roelands.\n\nShe was later returned home, only to be forcibly removed again and twice sent to Wandering Mission, about 120km south-east of Perth.\n\nAngela Ryder stands directly behind Roger Cook's right shoulder after the announcement of the redress scheme. (Supplied: Yokai)\n\nMs Edmonds was just six and was removed four times in total, spending time in Roelands, Wandering and Marribank.\n\nCourt records show the sisters were declared neglected and committed to state custody, though neither could recall ever attending court and both reported living a happy, stable life with their parents before they were taken.\n\nA government report from that year shows children in WA could be committed to state care if their parents were found to be neglectful or if they themselves were deemed \"neglected by virtue of his own behaviour\".\n\nCut-off date reflects policy change\n\nThe siblings will miss out on the $85,000 individual payments to be offered to individual survivors.\n\nBut Ms Edmonds said what was more upsetting was the disregard for her lived experience.\n\n\"We were still getting assimilated and put into missions after that date,\" she said.\n\n\" I don't understand how they can say it ceased. \"\n\nAngela Ryder says she and her sister were no less hurt by WA's forced removal policies. (ABC News: Keana Naughton)\n\nThe state government told the ABC the cut-off date aligned with when the Native Welfare Act 1963 was repealed, replaced with the Aboriginal Affairs Planning Authority Act 1972.\n\nThe new act abolished the Department of Native Welfare and created the Aboriginal Affairs Planning Authority, which was no longer directly involved in out-of-home care for Aboriginal children in WA, though records show it continued to fund missions into the 1980s.\n\nA national inquiry into the Stolen Generations found about one in 10 Aboriginal people in WA were in institutions in 1972, the majority children.\n\nThe report showed the number of children committed to state care started to decline around this time but removals did continue.\n\nThe Healing Foundation, an organisation supporting Stolen Generations survivors and their families, said it could take some time for shifts in practice to follow legislative change.\n\n\"Other [states' redress] schemes have been flexible in their time frames to acknowledge sentiment doesn't change the day a policy is abolished,\" a spokesperson said.\n\nAngela Ryder campaigning for redress with Yokai in 2023. (Supplied: Yokai)\n\n'At least pay for our funerals'\n\nBinjareb Noongar woman Alice Kearing said there were many more Stolen Generations survivors in WA removed after the cut-off date, including herself.\n\nShe was taken to Roelands in 1974, aged four.\n\nA photograph displayed at Roelands of when it was a mission. It is now a village where survivors come to heal. (ABC South West WA: Bridget McArthur)\n\nEarlier this year, the 55-year-old was invited to share her own experiences at a series of events about WA's Stolen Generations.\n\nShe was in the middle of one such presentation in late May when news of the redress scheme broke.\n\n\"They talked about a cut-off date … I didn't know how to react,\" Ms Kearing said.\n\n\"I felt like, 'What was I doing here? What was I doing, doing this presentation?'\n\n\" It was a win for us. Not a big win, but it's something. But it wasn't a big win for me. \"\n\nMs Kearing said she immediately thought of her brothers, who had spent much of their time at Roelands trying to protect her, and would also miss out.\n\n\"What happened to them was pretty severe. I witnessed them getting floggings,\" she said.\n\n\"They were my heroes … that's a scar that won't go away ever.\"\n\nMs Ryder and Ms Edmonds have called for the cut-off date to be based on when the state's last missions closed in the late 1980s.\n\nMs Kearing said the cut-off date should be removed altogether.\n\n\"If they can't give us the same compensation … at least pay for our funerals,\" she said.\n\n\"Take that burden off my family.\"\n\nSurvivors who died waiting\n\nFirst Nations people taken after the cut-off date are not the only survivors to miss out on reparations.\n\nMany members of the Stolen Generations taken within the eligible time frame died waiting for the WA government to commit to a redress scheme.\n\nNoongar woman Isobel Bevis's mother was one of eight siblings torn from their parents and country in 1960.\n\nIsobel Bevis's mum was a Stolen Generations member who died before the redress scheme was announced. (ABC News: Samantha Goerling)\n\nOnly two of them are still alive.\n\nMs Bevis said their deaths were not a \"get out of jail free\" card for the government.\n\n\"They have families that are still living, families that are still impacted by the trauma and the abuse that happened,\" she said.\n\nIsobel Bevis has written to the premier outlining her concerns about the redress scheme. (ABC News: Samantha Goerling)\n\n\"I think it's disrespectful … of Premier Roger Cook to exclude those that have passed.\"\n\nMs Bevis has written to Mr Cook asking him to reconsider the eligibility criteria.\n\nIn a petition to the state government, Kariyarra Noongar woman Sharon Todd additionally advocated for repatriation and counselling programs to be funded, as well as headstones for those who have died.\n\nSharon Todd is petitioning the state government to expand the redress scheme. (ABC News: Charlie McLean)\n\nMs Todd's late parents were both members of the Stolen Generations, and in 2021, she established WA's first Indigenous funeral service.\n\n\"[The criteria] is putting a bandaid over the wounds of some without looking at all of us,\" she said.\n\n\"Not knowing our language and not knowing the extended relationships … it makes it really difficult to move forward with confidence and clarity of where we belong.\"\n\nA 1997 inquiry by the Australian Human Rights Commission into the Stolen Generations said descendants should be included in reparations to acknowledge the long-lasting intergenerational trauma caused by forced removals.\n\nThis has not been written into WA's redress scheme, despite Mr Cook acknowledging in his speech in May that the forced removal of children had \"caused cycles of disadvantage and intergenerational trauma\".\n\nThe state government said the scheme was focused on living individuals who suffered as a result of their removal but that survivors of those who died after the scheme was announced could apply on their behalf.\n\n\"The WA government is working with Stolen Generations organisations on additional measures to address healing and truth-telling,\" a spokesperson said.\n\nThe scheme is expected to open to applications later this year.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-21/asx-markets-business-live-news-july-21-2025/105552978",
        "title": "Live: Australian stocks pull back from record highs",
        "publish_date": "Sun, 20 Jul 2025 21:31:14 +0000",
        "category": "finance",
        "authors": [
            "Stephanie Chalmers",
            "Daniel Ziffer"
        ],
        "text": "US Commerce Secretary Howard Lutnick said yesterday he was confident the United States could secure a trade deal with the European Union, but August 1 is a hard deadline for tariffs to kick in.\n\nLutnick said he had just gotten off the phone with European trade negotiators and there was \"plenty of room\" for agreement.\n\n\"These are the two biggest trading partners in the world, talking to each other. We'll get a deal done. I am confident we'll get a deal done,\" Lutnick said in an interview with CBS's Face the Nation.\n\nUS President Donald Trump threatened on July 12 to impose a 30% tariff on imports from Mexico and the European Union starting on August 1, after weeks of negotiations with the major US trading partners failed to reach a comprehensive trade deal.\n\nLutnick said that was a hard deadline.\n\n\"Nothing stops countries from talking to us after August 1, but they're going to start paying the tariffs on August 1.\"\n\nTrump announced the tariffs in a letter to European Commission President Ursula von der Leyen. He sent letters to other trading partners including Mexico, Canada, Japan and Brazil, setting blanket tariff rates ranging from 20% to 50%, as well as a 50% tariff on copper.\n\nLutnick also said he expected Trump to renegotiate the United States-Mexico-Canada Agreement (USMCA) signed during Trump's first White House term in 2017-21.\n\nBarring any major changes, USMCA-compliant goods from Mexico and Canada are exempt from tariffs.\n\n\"I think the president is absolutely going to renegotiate USMCA, but that's a year from today,\" Lutnick said.\n\n- Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-21/waitsia-gas-project-delays-spark-exports-from-wa-domestic-market/105542324",
        "title": "Kerry Stokes-backed firm sending gas reserved for West Australians offshore",
        "publish_date": "Sun, 20 Jul 2025 21:15:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "A gas development backed by media mogul Kerry Stokes has been tapping into Western Australia's domestic gas market to supply overseas customers amid long delays in the delivery of the plant.\n\nThe Waitsia gas project, 350km north of Perth, was billed as a \"shovel-ready\" lifeline for construction workers in 2020 when former premier Mark McGowan announced it would be exempted from the state's onshore gas export ban.\n\nAt the time, the project was supposed to cost $700 million and be operational by late 2023.\n\nMark McGowan granted the project an exemption from WA's onshore gas export ban until 2028. (ABC News: Keane Bourke)\n\nMr McGowan said unless Waitsia was exempted from the ban, \"the project might not happen\" and the gas may have stayed in the ground.\n\nBut almost two years after that deadline and with a construction bill running at almost double the original estimate, the project is still not ready.\n\nIn the meantime, the ABC can reveal the project's owners have been taking gas from the domestic market to supply their customers overseas.\n\nKerry Stokes's Seven Group is behind Beach Energy, one of Waitsia's two owners. (AAP Image: Richard Wainwright)\n\nWaitsia's owners are Beach Energy — the ASX-listed gas producer backed by Seven Group, the conglomerate controlled by Mr Stokes — and Mitsui, a Japanese trading firm.\n\nGas diverted for export\n\nFilings by Beach and public reporting of supplies to and from the Dampier to Bunbury gas pipeline — WA's main energy artery — suggest the partners have sent more than a dozen liquefied natural gas (LNG) cargoes since late 2023.\n\nAs much as 180 terajoules a day — or roughly 15 per cent of the gas used in the local WA market — has been diverted for export at times during that period, according to the Australian Energy Market Operator's gas bulletin board.\n\nIn its filings, Beach said the gas has been sourced via so-called swap arrangements, in which the company takes existing supplies from the domestic market on the promise it will return an equivalent amount later when Waitsia is up and running.\n\nThe gas is processed into LNG at the North West Shelf, a giant plant in the Pilbara where supplies have been dwindling for years.\n\nWoodside's Karratha Gas Plant forms part of the North West Shelf gas development. (Supplied: Woodside)\n\nWhile neither company would comment, Waitsia's backers have pointed out that prices for gas in WA's domestic market have been falling in recent times.\n\nFrom as much as $11.60 a gigajoule in late 2023, according to Perth-based firm Gas Trading Australia, prices on the spot market had fallen to just $6 a gigajoule.\n\nOn the east coast, by contrast, prices were trading between $10 and $15 a gigajoule.\n\n'Serendipity'\n\nPeter Strachan, a veteran resources analyst, said the fact prices had been falling while Waitsia's partners were exporting domestic gas was nothing more than luck.\n\nMr Strachan said while there was nothing unlawful about what the partners were doing, it raised questions about the integrity of WA's domestic gas market.\n\n\"It's serendipity,\" Mr Strachan said.\n\nPeter Strachan says the revelations raise questions about the integrity of WA's domestic gas market. (ABC News: Daniel Mercer)\n\n\"It might be good business operations, but I think it goes against the whole idea that the gas in Western Australia is for West Australians to consume.\n\n\"And that's whether it's today or tomorrow or in 10 or 20 years' time.\"\n\nUnder WA's laws, the market is supplied courtesy of a 15 per cent reservation policy on offshore fields.\n\nIt is also supplied by onshore fields.\n\nUp until the exemption awarded to Waitsia, onshore projects had exclusively supplied the local market.\n\nAfter years of chopping and changing policy, the WA government last year said it would allow onshore developers to export up to 20 per cent of their reserves but only until 2030.\n\nDespite being slated to begin operations in 2023, the Waitsia project is still not operational. (Supplied: Clough Group)\n\nBy that time, the Australian Energy Market Operator has forecast that WA will enter a structural deficit of gas, sparking warnings that some users could be pushed to the wall.\n\nClough collapse blighted Waitsia\n\nMr Strachan said some of the problems that had bedevilled Waitsia were beyond the control of its owners.\n\nChief among them was the collapse of construction company Clough in late 2022.\n\n'Disaster' fears for WA's gas supply as billionaires seek to cash in Photo shows A large gas plant with lots of metal infrastructure. WA's policy of preventing gas produced onshore from being exported was hailed as a masterstroke during the east coast's energy crisis. But with pressure to ease those restrictions coming from billionaires, some say that could lead to disaster.\n\nBut he queried why Beach and Mitsui were being allowed to take relatively cheap gas from the domestic market to cover their position with buyers overseas.\n\n\"They had to find some gas from somewhere to meet those obligations they couldn't meet because their project was basically two years delayed,\" he said.\n\n\"You would have thought if they were stuck and had to find gas, they could have … bought that gas on the open market from the North West Shelf or from Gorgon or from somewhere in Kuwait.\n\n\"But they might have made a loss doing that.\n\nAn aerial photo of the Waitsia Gas Project under construction in WA's Mid West. (Supplied: Nearmap)\n\n\" So they had to find a clever way of doing it so that they could just basically defer the cost and continue to make money. \"\n\nShortfall looming\n\nThe DomGas Alliance, which represents some of Australia's biggest gas users such as Wesfarmers, Alcoa and Yara, was equally sceptical.\n\nDomGas Alliance spokesman Richard Harris said taking gas from the local market to sell internationally flew in the face of WA's domestic policies.\n\n\"Domestic gas, when it's in the market in WA, is for WA use, not for export,\" Mr Harris said.\n\nRichard Harris says taking gas from the local market to export flies in the face of WA's domestic policies. (ABC News: Daniel Mercer)\n\nMr Harris said it was true domestic users were currently enjoying a period of relatively subdued pricing.\n\nBut he said that reprieve was likely to be temporary.\n\nWhat's more, he said it had been largely caused by the loss of some major gas customers, such as mining giant BHP's Nickel West division and an alumina refinery owned by Alcoa.\n\nIn the world's largest isolated grid, a big bet is being placed on giant batteries Photo shows Aerial shot of rows of white battery containers in the foreground and coal plant/cooling tower in background In Western Australia, the world's largest island grid is taking a huge bet, and carrying out a major experiment, on the role of batteries in the energy transition.\n\nThere had also been, he noted, a short-term bump in extra supplies from Woodside's Pluto project following scrutiny from a state parliamentary inquiry.\n\n\"All forecasts say that is just a short-term phenomenon,\" he said.\n\n\"Within a couple of years, we're going to be heading for a shortfall, and that's certainly what all the forecasts say by 2028, we're in for a significant shortfall of gas.\"\n\nOpposition critical\n\nThe WA government declined a request to be interviewed about the exports.\n\nInstead, it issued a statement in which a spokesperson said Waitsia's export approval also came with a commitment to supply domestic gas.\n\nA closer look at the Waitsia Gas Plant, inland of Dongara. (Supplied)\n\nThe spokesperson also insisted swap arrangements pursued by Waitsia's partners would have little effect on the domestic gas market.\n\n\"No further swap arrangements are anticipated once the Waitsia gas plant is operational,\" they said.\n\n\"The export of these LNG cargoes does not impact the delivery of Waitsia's domestic gas commitment.\"\n\nShadow Energy Minister Steve Thomas says the government has made a mess of its domestic gas policies. (ABC News: Daniel Mercer)\n\nShadow Energy Minister Steve Thomas was not as charitable.\n\nDr Thomas said the export of domestic supplies was clearly never intended by those who designed the state's domestic gas policy.\n\n\"I don't think the architects of the domestic gas policy ever expected that onshore domestic gas would have to be substituted into the offshore market to meet existing contracts,\" Dr Thomas said.\n\n\" I don't think that was in the design. \"\n\nHe argued the government had been so inconsistent in its management of domestic gas policies that they had been turned into a mess.\n\n\"So the domestic gas policy either stands up or it doesn't,\" he said.\n\nHow much gas is actually there?\n\nUnder the terms of the deal in 2020, the Waitsia partners were allowed until the end of 2028 to export 7.5 million tonnes of LNG.\n\nMr Harris from the DomGas Alliance noted that the project partners were fast running out of time in which to meet their export quotas.\n\nGiven the lucrative nature of the overseas LNG market, where gas can fetch far higher prices than from domestic buyers, he anticipated a push to extend the export approvals.\n\nFears WA's main grid 'slowly collapsing' as gas-fired power plant plant teeters on edge Photo shows Drone shot of the gas plant at sunset In the latest sign of stress for WA's biggest grid, its most important gas plant sought a bailout amid fears of insolvency.\n\nBut he stressed it was something the alliance would oppose.\n\nAnd he warned a failure to do so would risk higher gas prices and \"mean the projects that we want to happen like critical minerals won't be able to find gas\".\n\n\"They [Waitsia] were always given a timeline when they had to deliver their bargain to the state, which was to deliver gas into the domestic market in 2029,\" Mr Harris said.\n\n\"And that timeline should stick.\"\n\nPeter Strachan agreed but wondered whether Waitsia would still have the reserves to supply the WA market after 2028, noting the project's partners had been progressively writing down their estimates of the gas contained in the field.\n\n\"Where they thought there would be gas they've drilled and 'oh, there's no gas',\" Mr Strachan said.\n\n\"They're lucky now that they've actually got enough gas to meet their commitments. But where does that leave the local consumer?\"\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-21/interstate-investors-swarm-nt-homes-raising-rent-property-prices/105537484",
        "title": "Interstate investors swarm NT homes, shutting out locals and raising rents",
        "publish_date": "Sun, 20 Jul 2025 20:38:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Interstate investors are targeting properties across the Northern Territory and buying them up hours before they hit the market, as Darwin's rental market firms as the tightest in the country.\n\nLocal doctor Nicolas Darmanthe moved to Darwin at the beginning of the year with his partner, and thinking they would be able to afford to rent a \"fairly nice\" three-bedroom home.\n\nBut, after a few months of looking in a city where the vacancy rate is just 0.3 per cent, they realised that wouldn't be the case.\n\n\"Even though Darwin is very far away and [like] a small country town, it turns out the rentals are just as expensive — if not more expensive — than down south in Canberra and Sydney,\" he said.\n\nNick Darmanthe thought rental properties would be affordable in the Northern Territory when he moved up to Darwin from Canberra. (ABC News: James Elton)\n\nOver the past year, interstate investors have increasingly turned their focus to the NT, where houses and units remain among the most affordable to buy in the country and rental yields are among the highest.\n\nReal estate agents have told the ABC they can sell homes to interstate investors \"within hours\", often before they are publicly advertised, with some saying the fierce competition to sell properties fast has left them no choice but to play along.\n\nNick Mousellis, an independent real estate agent in Darwin, first started getting calls from interstate investors about a year ago and now fields numerous requests a week.\n\nNick Mousellis has been a real estate agent in Darwin for more than three decades. (ABC News: Marcus Kennedy)\n\n\"Almost every two to three days, we have an inquiry or an e-mail from a buyer agent,\" he said.\n\nOver the past year he's seen an increase between 3 and 10 per cent in Darwin property prices, and soaring competition for local homes.\n\n\"People are missing out … I haven't seen this sort of activity for quite a while,\" he said.\n\nMr Mousellis said interstate investors were targeting homes priced between $500,000 and $650,000, spending a small amount on renovations, and then leasing them at a higher price.\n\nA landlord's market\n\nNicola Powell, chief of research and economics at Domain, said the sudden flood of interstate buyers had positioned the NT as an investment hotspot — second only to New South Wales.\n\nInterstate investors are increasingly looking to Darwin properties, which is driving up the cost of renting in the NT. (ABC News: Ian Cutmore)\n\n\"[Rental] house yields are sitting at around 6 per cent, and [rental] unit yields are anywhere between 7 and 8 per cent,\" she said.\n\n\"Compare that to a market like Sydney — where rental yields are sitting at 3 per cent — you can understand why investors are looking towards those cash positive locations like Darwin.\"\n\nDarwin's 0.3 per cent vacancy rate compares with a national rate of between 2 and 3 per cent, according to Domain's June Quarter Rent Report.\n\nUnit rents are at record highs across all capital cities including Darwin and, while house rents remain at record highs in all capitals, prices in Darwin dropped $20 in June.\n\nDr Powell said interstate investors had the ability to revitalise stagnant markets but, in this case, they were likely \"nudging first home buyers\" out of the market and making it harder for people to secure an affordable rental.\n\nDr Nicola Powell says Darwin is experiencing a rental crisis. (Supplied)\n\n\"We do have a rental crisis,\" she said.\n\n\"When you've got a vacancy rate that is very tight at 0.3 per cent … it means it is very competitive for tenants — to have a balanced rental market, you need that vacancy rate to be between 2 and 3 per cent.\n\n\"You tend to find that investors and first-time buyers go for similar priced properties.\n\n\" That makes it more challenging for a first-time buyer to break into the market, because ultimately a first-time buyer doesn't have as deep pockets as an investor does. \"\n\nUnaffordability linked to supply\n\nRuth Palmer has been the executive director of the Property Council of Australia's NT division for over a decade and said she hadn't seen a \"shift\" quite like this before.\n\nShe said Alice Springs had seen a \"significant jump\" in median house prices and improvement in the volume of sales.\n\nMs Palmer said, with both sales and building approvals up, many NT real estate agents now had \"a bunch of investors on their books who are chasing properties\".\n\nProperty Council of Australia's Ruth Palmer says the NT needs to increase housing supply. (ABC News: Hamish Harty)\n\n\"Sometimes the properties don't even get to market before they're snapped up by an investor, and this can occur within about 24 to 48 hours,\" she said.\n\n\"What this can do is put a bit of an imbalance into the market, so while our volume sales are up and while we're seeing a lot of transaction, it doesn't exactly mean that it's growing the population.\n\n\" It obviously brings in that squeeze on the rental market, and drives up prices in that space as well. \"\n\nMs Palmer said, as the NT continued to face high construction costs and a shortage of tradies, more needed to be done to \"stimulate new builds\".\n\n\"Without more supply, affordability will remain a challenge,\" she said.\n\nIn the March 2025 quarter, building approvals rose over 50 per cent compared with the previous quarter, according to the Property Council's latest report.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-21/first-nations-and-pasifika-xv-face-british-irish-lions/105552914",
        "title": "Beale named captain of First Nations and Pasifika XV to face Lions",
        "publish_date": "Sun, 20 Jul 2025 20:33:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "Kurtley Beale will get his chance to face the British and Irish Lions on a second tour after being named captain of the First Nations and Pasifika XV team for Tuesday's clash in Melbourne.\n\nThe 95-cap flyhalf, who famously slipped while taking a potentially match-winning penalty in the first test against the Lions in 2013, was robbed of the chance of facing the tourists for Western Force last month by a hamstring injury.\n\nBeale is one of six indigenous players in the line-up, with the rest of the match-day squad made up of players with Pacific Islands heritage.\n\nTongan-born prop Taniela Tupou and Fijian-born winger Filipo Daugunu were released from the Wallabies squad for the match and will have a chance to show coach Joe Schmidt that they should be in the reckoning for the second and third tests.\n\nTuaina Taii Tualima, Charlie Gamble and Seru Uru make up a formidable back row, while former Wallabies Lukhan Salakaia-Loto and Darcy Swain will feel they have a point to prove to Schmidt when they link up in the second row.\n\nFormer Australia loose forward Pete Samu was prevented from playing by Lions management because he did not fulfil the stipulation in the tour agreement that all players should have featured in Super Rugby this season.\n\nHead coach Toutai Kefu, who helped the Wallabies beat the Lions 2-1 in the 2001 test series, nonetheless felt he had selected a side that could hand the tourists their first defeat in Australia on this tour.\n\n\"The team has a really nice feel to it, with a blend of not only youth and experience, but also cultures,\" the World Cup winner said.\n\n\"The Lions have shown how strong they are on this tour. No matter who plays, they will be very hard to beat, but we're not here to make up the numbers.\n\n\"We want to win this game and make history.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBeale, 36, one of only 15 indigenous Australians to have represented the Wallabies, has recovered sufficiently to lead a strong backline at Dockland's Stadium.\n\nKefu said the veteran was a natural pick for the captaincy on Tuesday night.\n\n\"Kurtley is the most experienced player in the squad and was the natural selection for captain,\" Kefu said.\n\n\"He is an extremely talented footballer and has been there and done it on the big stage.\"\n\nThe Lions are unbeaten on their Australia tour, coming off a 27-19 win in the first Test over the Wallabies on Saturday.\n\nTuesday's contest will be the last tour match the Lions will play, followed by the final two Test matches against the Wallabies.\n\nFirst Nations and Pasifika XV team\n\n15–Andy Muirhead, 14–Triston Reilly, 13–Lalakai Foketi, 12–David Feliuai, 11–Filipo Daugunu, 10–Kurtley Beale, 9–Kalani Thomas, 8–Tuaina Taii Tualima, 7–Charlie Gamble, 6–Seru Uru, 5–Lukhan Salakaia-Loto, 4–Darcy Swain, 3–Taniela Tupou, 2–Brandon Paenga-Amosa, 1–Lington Ieli\n\nReplacements: 16–Richie Asiata, 17–Marley Pearce, 18–Mesake Doge, 19–Mesake Vocevoce, 20–Rob Leota, 21–Harrison Goddard, 22–Jack Debreczeni, 23–Jarrah McLeod\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-21/ageism-work-employers-age-bias-hiring/105543944",
        "title": "'Old' at 51? Recruiters hiring based on age over experience, report finds",
        "publish_date": "Sun, 20 Jul 2025 20:18:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Bob Epps was at the peak of his career in senior management when he was unexpectedly made redundant in his mid-50s.\n\nThe now 63-year-old picked up some contract work, but repeated rejection left a bitter taste as he tried to land a permanent position.\n\n\"I would have applied for over 100 jobs in that C-suite, senior sort of GM and upwards level roles and I didn't even get one interview,\" he said.\n\n\"I felt gutted.\"\n\nHis experience is borne out in new data that paints a bleak picture for job-hunters aged over 50.\n\nOne quarter of employers classify over 50s as 'older'\n\nA new report, jointly produced by the Australian Human Rights Commission and the Australian Human Resources Institute, found almost one quarter of HR professionals now classify workers aged 51 to 55 as \"older\".\n\nJust two years ago, only 10 per cent of recruiters took that view, suggesting many employers are sidelining experienced professionals in an economy suffering skills shortages.\n\nThe report, Older and Young Workers: What do Employers Think? is the fifth national survey of employers and HR professionals.\n\nThe report surveyed 138 employers across Australia, providing a snapshot of how workers were perceived, supported and included in Australian workplaces.\n\nAge Discrimination Commissioner Robert Fitzgerald. (ABC News: Billy Cooper)\n\nRobert Fitzgerald, Australia's Age Discrimination Commissioner, who is a former Productivity Commissioner, said the country must acknowledge it is an aging society and embrace employing older workers.\n\nCall for manual labourers to access pension earlier Photo shows A builder shovels gravel next to a digger. There are calls for the age pension to kick in sooner for manual labourers who are physically struggling to work until retirement age.\n\n\"The tragedy is so many employers still have biases and stereotypes, make recruitment decisions based on age and there is an in-built prejudice,\" he said.\n\n\"We won't solve the productivity problem that Australia has [unless] we increase the labour force participation rate significantly.\n\n\"This is now an economic and social imperative for the nation.\"\n\nThe commissioner said the AHRC had received hundreds of complaints in relation to the Age Discrimination Act, mainly concerning age being used in employment and recruitment decisions, including workplace harassment aimed at encouraging retirement.\n\nThe report titled Older and Young Workers: What do Employers Think? surveyed 138 employers across the country. (ABC News: Billy Cooper)\n\nSarah McCann-Bartlett, chief executive of the Australian Human Resources Institute (AHRI) said the report found many employers were reluctant to hire workers under 24 or over 50, which restricted their access to valuable skills and experience.\n\n\"There is a very strong message that if we want to lift productivity in Australia, we do need to make better use of the talent that's out there and this means that we should be focusing on hiring on skills, not on assumptions around age and trying to keep experience in the workforce,\" she said.\n\nThe report made 18 recommendations in recruitment, training, workplace inclusivity, health and wellbeing initiatives.\n\nThese include calls for age-neutral job advertisements, audits of AI resume screeners for biases, and career-transition support for mid to late career employees.\n\nWorkers need to modernise resumes, says career coach\n\nLeah Lambart, a career and interview coach, has clients in their 40s, who are already anticipating job search difficulties due to their age.\n\n\"Years ago, I would get people calling who were worried about turning 60 and now they're calling saying, you know, 'I'm late 40s and I really need to get the next role because I don't want to be job searching in my 50s',\" she said.\n\nLeah Lambart notes that clients as young as their late 40s are already internalising the perception that they are old and anticipate job search difficulties due to age. (Supplied)\n\nWhile overt discrimination is rare, Ms Lambart has tips for those over 50, including modernising resumes, having a professional online presence and upskilling in technology.\n\n\"Sometimes candidates will say to me, 'I'm being discriminated against my age,' but when I look at their resume, it looks like something out of the '70s and is 10-pages long,\" she said.\n\n\" They don't need to include every job they've held since they were 20. \"\n\nUnemployment rate rises to 4.3pc in June Photo shows Queen Street Mall, Brisbane 2025-01-09 10:01:00 The national unemployment rate rose to 4.3 per cent in June, up from 4.1 per cent in May.\n\nNicole Gorton, director at recruitment agency Robert Half, believes the perception of \"older workers\" by those hiring is largely driven by assumptions about technology adoption.\n\n\"When I am speaking to organisations and hiring managers, they have a strong appetite for digital fluency,\" she said.\n\n\"The adoption of technology, the adoption of AI, and when you haven't grown up with it and you have to learn it… there is a perception that the older, more experienced worker has not got some of those skill sets.\"\n\nWomen experience unique biases\n\nLisa Annese, CEO of Chief Executive Women, said she was genuinely surprised by the shifting perception of hirers.\n\nMs Annese said it would have been helpful if the report included gender-specific data, noting women's experiences and unique biases relating to perimenopause, menopause and caring responsibilities.\n\nLisa Annese finds it unfortunate that age-based biases impact women during what should be their career \"sweet spot\". (Supplied)\n\nShe said women aged in their 50s, were often in a \"sweet spot\" for progression.\n\n\"It can be a liberating time in women's lives to really pursue their career,\" she said.\n\n\"You often talk about women saying this is 'my time' now and that could still be [aged in their 50s] what I would consider quite a young age.\"\n\nFor Bob Epps he has now settled into a chief executive role leading a taxi service in Cairns, proving he's still got some mileage left.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/exclusive-brittany-snow-confirms-truth-about-rebel-wilson-20250721-p5mgkt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Exclusive: Brittany Snow confirms truth about Rebel Wilson",
        "publish_date": "Mon, 21 Jul 2025 12:17:14 +1000",
        "category": "finance",
        "authors": [],
        "text": "Exclusive: Brittany Snow confirms truth about Rebel Wilson\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/the-home-grown-threat-to-china-that-has-rattled-xi-jinping-20250721-p5mghd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The home-grown threat to China that has rattled Xi Jinping",
        "publish_date": "Mon, 21 Jul 2025 11:58:29 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The problem in EVs, solar panels, batteries and other industries that supply them – and it’s not a problem confined to those sectors – is that China’s economic model has prioritised investment, production and jobs. Beijing has identified strategic areas of growth in its rolling five-year national economic plans and handed out massive financial subsidies to those sectors to stimulate investment. BYD, the world’s biggest EV maker, slashed domestic prices by up to 34 per cent earlier this year, triggering a price war. Credit: Bloomberg Local governments, anxious to get their share of investment and jobs, then offer their own incentives and help fuel a rush by companies to do what Beijing has encouraged them to do, leading to overinvestment and overcapacity. Exports are the safety valve for the excess capacity, particularly in the post-property crisis, post-pandemic environment, where domestic demand has been weak.\n\nFaced with pushback (even before Donald Trump started slapping tariffs on everyone) from export markets concerned that China was undermining their industries and persistent deflation within its own economy – from the US to countries in Europe and Latin America – it would appear that China has finally recognised the need to act. Loading A decade ago, China had similar overcapacity issues in its steel and coal sectors. Beijing responded by forcing plant closures and corporate consolidations, while avoiding economic shock by pumping fiscal stimulus into the economy. Unlike the current overinvestment, however, those sectors were largely state-owned. It will be trickier trying to corral the multitude of private companies engaged in the crowded advanced manufacturing sectors that Beijing has identified for China’s latest phase of growth. It will be even trickier in the face of Trump’s tariffs.\n\nWhile the US and China agreed to an uneasy truce after a tit-for-tat exchange of absurdly high tariffs – Trump announced a 145 per cent rate on imports from China and Beijing responded with a 125 per cent rate on imports from the US – the continuing 30 per cent US tariff on goods, once pre-existing tariffs (leftovers from the 2018-19 trade war) are taken into account, means China’s exports to the US still face a 55 per cent duty. China’s most recent trade numbers, for June, showed a record $US586 billion ($900 billion) surplus when they were published last week, or 5.8 per cent above the same month last year. Exports to the US, however, were 16.1 per cent lower than in June last year. It was exports to South-East Asia, Europe and Japan that accounted for the growth. Donald Trump’s trade war has complicated matters for Beijing. Credit: Bloomberg With Trump’s deal with Vietnam, including punitive tariffs on trans-shipped exports to the US – targeting Chinese goods re-routed through third countries to exploit lower duty rates – America’s “reciprocal” tariff regime poses a major threat to China’s ability to continue to rely on trade for growth. Last year, Beijing tried to stimulate domestic consumption with incentives for trade-ins of autos and household appliances and other goods.\n\nThat seems to have had some effects – China’s GDP grew 5.3 per cent in the June quarter, compared with the same period last year – but it’s a policy whose impact will inevitably wane, as the number of remaining households with the capacity to take advantage of it dwindles. In Trump’s new world trade order, there will be less global trade and less trade with China, which implies radical changes to China’s economic model. There are other, more sustainable, measures that Beijing could take to boost domestic consumption, particularly increased spending on China’s social welfare safety nets, but Xi has been reluctant to embark on large-scale stimulus spending or to re-balance the economy away from its over-reliance on exports. Having experiencing the implosion of China’s property sector, a sector that had been used and incentivised to stimulate the wider economy during periods of economic stress, the authorities would understand that the extent of overinvestment and overcapacity in other sectors today is a threat to China’s economic and social stability that could be exacerbated by a downturn in trade. The threat doesn’t come from Donald Trump alone. On Friday, the G7 economies agreed to increase their collective efforts to respond to the impact of China’s over-capacities and the flood of exports it is producing, along with its dominance of strategic sectors, including rare earths.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/investor-splashes-6-75m-for-sydney-harbour-pad-in-tightly-held-block-20250721-p5mgfl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Investor splashes $6.75m for Sydney harbour pad in tightly held block",
        "publish_date": "Mon, 21 Jul 2025 11:50:23 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A harbour front home at Circular Quay with direct views of the Sydney Harbour Bridge sold for $6.75 million at auction on Saturday.\n\nThe 141-square-metre, two-bedroom unit, located in the tightly held “Bennelong” building at 77/1 Macquarie Street, was guided at $6.5 million and came with its original bathroom and kitchen.\n\nSelling agent Ettiene West from Morton Circular Quay said the two active bidders were both investors based in the Sydney 2000 postcode.\n\nBidding opened at $6.3 million and rose in increments of $100,000 until $6.7 million, then a $50,000 bid secured it for $6.75 million.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/nick-cave-draws-a-crowd-but-the-queues-aren-t-to-listen-to-his-music-this-time-20250721-p5mge5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Nick Cave draws a crowd – but the queues aren’t to listen to his music this time",
        "publish_date": "Mon, 21 Jul 2025 11:49:58 +1000",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "London: Australian singer Nick Cave has surprised shoppers at a small store in England by giving them an insight into his creative life – not with his music, but with his books.\n\nThe singer has generated queues at an Oxfam bookshop at a seaside resort by donating 2000 books on topics including philosophy, religion and rock.\n\nNick Cave in a scene from the documentary 20,000 Days on Earth. Credit:\n\nThe first of his boxes was opened last week and drew a crowd of buyers when word reached the local media in Hove, near Brighton in south-east England.\n\n“I guess there were between 50 and 100 people queuing in the first couple of hours of the stock going out,” store manager Richard, who asked to be quoted without his surname, told this masthead.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/could-ai-change-league-forever-the-revolution-has-already-begun-20250719-p5mg4z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Could AI change rugby league? The revolution has already begun",
        "publish_date": "Mon, 21 Jul 2025 11:49:28 +1000",
        "category": "finance",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Pressed on specifics, Driussi was diplomatically vague: “We’re exploring multiple AI applications, but competitive advantage comes from execution, not just ideas. The technology helps us analyse information and identify patterns that might otherwise be missed.” What makes the Bulldogs’ AI adoption particularly intriguing is Driussi’s other role as CEO of Quantium, an Australian artificial intelligence and advanced analytics company. The firm works with major Australian companies, such as Woolworths, Commonwealth Bank, Telstra and Qantas. Bulldogs players are already benefiting from AI. Credit: Getty Images The connection provides the Bulldogs access to world-class AI expertise that would typically cost NRL clubs millions of dollars to develop themselves. While Driussi is careful not to discuss any formal arrangements, the potential for knowledge transfer is obvious. The “Family Club” previously revealed it used AI to identify Jacob Preston during his recruitment from the Roosters’ pathways system, suggesting the technology has been instrumental in some of their personnel decisions.\n\nAI’s influence on sport was one of the topics discussed at the NRL’s Business of Sport Conference in Las Vegas at the University of Nevada, just before this year’s season-opening matches at Allegiant Stadium. The headline speakers were Driussi and Paul Devlin, the latter the global strategy leader for betting, gaming and sports technology at Amazon Web Services. Devlin, who has held high-performance roles at the Brisbane Broncos, South Sydney, Parramatta and Melbourne Storm, said AI would transform the sporting landscape. AI is being used extensively in the NFL. Credit: AP “We see AI as absolutely revolutionary, and we think it will impact every area of business in the future,” Devlin says. “So everybody should be experimenting with it right now, so that was kind of the key message that came out of that NRL event ... AI is going to improve every area of business, but it is really clear on the insight generation from the data side of it in a sport like rugby league on talent identification, load monitoring, safety of the games through simulations, as well as the fan side of sport as well.”\n\nSeveral NRL clubs are already dabbling with AI. One leading head coach, speaking on the condition of anonymity to protect the club’s intellectual property, said that AI had the potential to help analysts wade through reams of data to come up with a couple of key takeaways when preparing for an opponent. “That’s where I see the next step in world sport, how AI can save you time in identifying those trends so you’re not wasting time doing it yourself,” the coach says. “The advantage you get is saving man-hours, so you actually spend less time on computers and more with the players. “You can see the information that’s relevant; missed tackles is the most outdated stat because there’s no context to it. And completion rates; seven of the top-10 completing teams didn’t make the finals last year.”\n\nHere’s a practical example of how AI is being used. One club found the best way to beat the Storm is to limit their time in possession. If you can restrict them to less than 23 minutes and 25 seconds with the football – they average 26 minutes and 36 seconds – you have an almost 100 per cent chance of winning. Not easy to do in reality, but it’s useful information. While most NRL teams focus heavily on pre-contact metres – the distance gained before first defensive contact – to build momentum, a different focus is required to beat Canberra. AI found the Raiders were uniquely driven by post-contact metres, those tough yards gained after contact. Limit those metres, and you can stop the Green Machine. AI has already identified at least one way to try to stop the Melbourne Storm. Credit: Getty Images Canterbury’s embracing of AI reflects a broader transformation sweeping through professional sport worldwide. American sports leagues are leading the charge, with the NFL processing more than 500 million data points per season through its Digital Athlete system, reducing player injuries by 700 missed games since 2023. Major League Baseball has implemented AI for pitching analysis and injury prevention, while the NBA uses machine learning for player load management and game strategy optimisation. English Premier League clubs are using AI for recruitment: Brighton’s system identified Moises Caicedo before his eventual £115 million ($240 million) transfer from them to Chelsea, while Liverpool’s partnership with Google DeepMind has produced tactical analysis tools that club experts prefer over traditional methods 90 per cent of the time.\n\nThe secrecy surrounding Canterbury’s AI implementation is understandable given the competitive implications; NRL clubs are notoriously protective of innovations that might provide advantages. The technological investment aligns with the Bulldogs’ recent restructure. The blue and whites are constructing a $50 million centre of excellence at Belmore and have significantly expanded their pathways programs, including taking over the Fiji Silktails program. Major League Baseball has implemented AI for pitching analysis. Credit: Getty Images “We’re building for long-term success,” Driussi says. “That means investing in the best people, the best facilities and the best technology available to us.” Bulldogs chief executive Aaron Warburton confirmed the club’s commitment to innovation.\n\n“We’re always looking at ways to improve our operations and give our players and staff the best possible tools to succeed,” Warburton says. “Technology is certainly part of that equation.” Loading The club’s return to finals football last year, after missing the post-season for eight seasons, has been attributed to improved recruitment, player development and coaching. However, the role of AI in this transformation remains largely hidden. Given the global AI sports market is tipped to grow from $1.2 billion to nearly $30 billion by 2032, getting in early could be the key to success. Already, rivals are playing catch-up to Canterbury. For a club that has endured wooden spoons and years of mediocrity, the Bulldogs are marrying old-school values with cutting-edge technology. Whether that translates to premiership glory remains to be seen, but the Bulldogs are betting heavily that the future of rugby league will be shaped by artificial intelligence.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/melbourne-couple-sell-home-at-auction-for-40-000-less-than-hoped-20250721-p5mgfn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne couple sell home at auction for $40,000 less than hoped",
        "publish_date": "Mon, 21 Jul 2025 11:47:38 +1000",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "An Ascot Vale couple cut their price hopes to sell a three-bedroom, corner-positioned apartment “with penthouse proportions” after auction this Saturday.\n\nJellis Craig Kensington selling agent Tom Donnelley said the home at 205/2 Mascona Street, guided at $900,000 to $990,000, had a reserve of $1 million. The auction had two registered bidders, but only one took part.\n\n“It was passed in on a genuine bid of $925,000,” said Donnelley, who added it sold for $960,000 after private negotiations. “The buyers are relocating from overseas to be closer to their kids,” he added.\n\nDonnelley said that the couple’s adult children were onsite for the auction, and had them on the phone throughout. “The vendors are looking for a lifestyle change and to be closer to their grandkids.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/dangerous-windies-batter-holes-out-in-the-deep-20250721-p5mgk9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dangerous Windies batter holes out in the deep",
        "publish_date": "Mon, 21 Jul 2025 11:42:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "Dangerous Windies batter holes out in the deep\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/motorsport/red-bull-sacks-christian-horner-20250710-p5mdv3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Red Bull sacks Christian Horner",
        "publish_date": "Mon, 21 Jul 2025 11:42:16 +1000",
        "category": "finance",
        "authors": [],
        "text": "Red Bull sacks Christian Horner\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/boxing/when-it-comes-to-selling-the-tszyu-dream-it-s-no-m-s-20250721-p5mgfq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "When it comes to selling the Tszyu dream, it’s ‘No más’",
        "publish_date": "Mon, 21 Jul 2025 11:40:56 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "“I’m just about getting in there and finishing to the very end. If it means you’re going to get knocked out, it means you’re going to get knocked out. You try to get back up, get back up, get back up.\n\n“Sometimes that’s a problem, sometimes for my corner to say ‘stop the fight’, that was never part of what I’m about.\n\n“When I come into the ring, I come in with the mentality I’m going to die in the ring,” Tszyu said.\n\nTwo days before his rematch with Sebastian Fundora, Tim Tszyu spoke about the lengths he would go to win.\n\n“For me, if my corner stopped [the first Fundora fight], I would have had the shits with them, I would have had the shits with life. The fact that I could have lived my life without knowing my full potential. So that answers the question of why the corner didn’t stop it.”\n\nIn the rematch with Fundora, according to one version of events pedalled in the aftermath, Tszyu’s corner stopped the fight.\n\nThe decision left Tszyu, moments after landing his most telling blows in the seventh round, done on his stool. In a world title fight. Just days after declaring he was willing to die in the ring. Didn’t those comments age badly?\n\nWe will never know if Tszyu, had he continued, was capable of finding something within himself to change the result of the fight. Was there something stirring in his soul, perhaps a right hand like the one father Kostya produced to famously floor Zab Judah in the very same arena, that would cement his own legend? That’s what Tszyu, like the rest of us, will die wondering.\n\nThe line between being brave and too brave for your own good is a fine one. You only have to think back to the “Battle of Brisbane” back in 2017, between Jeff Horn and Manny Pacquiao.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-perth-grandmother-donna-nelson-to-appeal-japanese-drug-smuggling-conviction-20250721-p5mgfd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Perth grandmother Donna Nelson to appeal Japanese drug smuggling conviction",
        "publish_date": "Mon, 21 Jul 2025 11:38:38 +1000",
        "category": "sports",
        "authors": [],
        "text": "The Dockers have boosted their finals prospects with a thrilling one-point victory over Collingwood yesterday, but it came at a cost, with Matthew Johnson limping from the ground in the fourth quarter after rolling his ankle awkwardly during a marking contest.\n\nThe midfielder arrived back in Perth last night on crutches with a moonboot on his lower left leg.\n\nFremantle Docker Matthew Johnson at Perth Airport on Sunday night. Credit: 9 News Perth\n\nFremantle coach Justin Longmuir said the 22-year-old was sore following the injury.\n\n“He felt a crack so he’s on crutches. [It’s] not a good sign, but we don’t want to go too early with it,” he said.\n\n“A crunching sound can mean a bit, it can mean a break, or it can mean just to give that ankle a real wrench, so it’s not looking great for him.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/inside-the-chinatown-museum-that-after-four-years-and-millions-of-dollars-never-opened-20250417-p5lsjs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inside the Chinatown museum that after four years and millions of dollars never opened",
        "publish_date": "Mon, 21 Jul 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jessica Yun"
        ],
        "text": "But as the institution enters its fourth year of a five-year lease with little progress made, impatience is brewing in some parts of the Chinatown community over the extensive delays. So why hasn’t the Museum of Chinese in Australia opened yet? History in the making Sydney’s Chinatown is one of Australia’s best-known and most frequented, with roots tracing back to the 1870s, when Chinese migrants shifted their fruit and vegetable trading from the Rocks to settle around Haymarket. Chinese people began arriving in Australia as part of the massive migration wave during the gold rush of the 1850s. During the 1900s, they spread into other trades and services, finding prosperity in fruit and vegetable trading, shopkeeping, tobacco farming and clothes laundering. The end of the White Australia policy in 1973 brought another wave of migrants.\n\nBut unlike Melbourne and regional cities such as Bendigo (which established its Golden Dragon Museum in 1991) and Ararat (which opened its Gum San Chinese Heritage Centre in 2001), Sydney has fallen behind in establishing its own museum to showcase the contributions of Chinese Australians. That looked to finally change in mid-2020. As the pandemic set in, Lord Mayor Clover Moore announced the council would lease the property to the Museum of Chinese in Australia. It would feature a gallery and exhibition space, programming activities, community spaces for events, an artist-in-residence program, and a cafe and shop. It is chaired by 82-year-old Daphne Lowe Kelly, who has spent most of her career serving Chinese-Australian organisations, and was presided over by Dr John Yu, a Chinese-born Australian paediatrician and 1996 Australian of the Year. But neither the council nor the museum’s leadership anticipated the challenges of establishing a new gallery in a heritage-listed 19th-century building. While the site has given the museum a spiritual and physical home, with rent subsidised by the council, the lease agreement contains pages of added requirements, heritage restrictions and red tape. “This is an amazing gift,” new MOCA chief executive Peter Cai said of the building. “And it came with a lot of conditions, and some conditions are not easy to address. There are a lot of costs to remedy.”\n\nThe initial renovation proposal, overseen by Tony Stephens, the previous chief executive who departed the organisation in January, came to roughly $4.7 million, said Kelly, who estimates the true cost would have been closer to $6 million or $7 million after factoring in contingencies and other unanticipated expenses. Figures from the Australian Charities and Not-for-profits Commission (ACNC) show revenue from donations and bequests came to $1,766,821 in the four years between fiscal 2021 and 2024. This figure doesn’t include rent subsidies from the City of Sydney’s accommodation grant program, $2.28 million from Create NSW given in 2022, or two grants from the National Foundation for Australia-China Relations that exceeded $400,000. In the absence of local donations, lobbying government has been crucial. “It was almost impossible trying to raise any funds during COVID,” Kelly said. ‘People are now questioning many things’\n\nA number of departures on the museum’s board has added to perceptions of volatility. Only three inaugural board members remain: Kelly, Joanna Capon and Yin Cao. Dr John Yu, Stephen FitzGerald and Su-Ming Wong have departed the board. Since then, a number of others have come and gone. Loading One former director, speaking anonymously to discuss confidential matters freely, said board members had at times disagreed on the best approach to raising money. “It’s become a fundraising issue. They need a certain amount of money to open. They haven’t been able to achieve that yet,” they said. Despite being volunteers for the charity, the former board member described the work as a “full-time job”.\n\n“It was very intense,” they said. “I found myself spending a lot of time on the wrong things. “While I’ve stepped off the board, I’m still a big supporter and would love to see it open.” An active representative of the Chinatown community, who declined to be named, said the museum had lost a lot of the goodwill it initially had. “Because it’s been years, people are losing interest or faith,” they said. “People are now questioning many things; where has [the money] gone, how has it been spent?” The same Chinatown community representative feels the museum has had little to show. “If you can’t fix the building with the money you have, what are you delivering in the meantime?” they asked. “They’re not engaging in the community at all.” Kelly is aware of the critiques. “They don’t really know what goes behind the scenes, what has to be actually done, and how difficult it is to achieve a lot of what it takes to actually get it open,” she said.\n\nPutting on a show Plans are now being redrawn for a “reduced scope” refurbishment. Even then, Kelly estimates opening will cost $3 million to $4 million. “That’s still a lot of money,” she said. “You’ve got to remember, we also need to have funds for the programs and operational costs.” The race is on to pull the various pieces together for a soft launch. On top of refurbishment plans to be redrawn, costed and commenced, an exhibition director (historian and Chinese art and photography curator Shuxia Chen) has been drafted to conceptualise the museum’s first exhibition, which will focus on local stories about Haymarket habitants that have been there for generations, such as the Lam family of Asian grocer Dong Nam A, or the Pang family, which ran a Chinese restaurant in Haymarket for nearly three decades and have donated large sums to the museum. “We must put on a good show for people,” Cai said. Decisions need to be made about the exhibition’s budget. “You’re talking about special lighting, casings, you have to hire expert consultants to put it all together. It’s not as easy as hanging something on a wall.” Meanwhile, Kelly is hustling for donations, having visited Canberra to lobby Wong and Plibersek, and sharing bank details in community newsletters. “I’ve been lobbied about this so much,” Wong said at the April event.\n\nThe museum has secured its tenancy for another decade, which Kelly hopes will help to encourage donations after hearing feedback that some felt reluctant to donate money for a building that belongs to the council. “A refit is not as sexy to the philanthropic community,” said another former board member, speaking on the condition of anonymity. “We spoke to a lot of other Chinese museums around the world ... The Chinese Canadian Museum took eight years to get running from conceptualisation to open doors. It just takes a little while.” Cai is excited to showcase the many contributions of Chinese Australians over the decades and is at pains to convey the “complicated nature” of the project to supporters, whom he said had been generous and full of goodwill. “I can empathise with some of our supporters who just want to see the building open soon,” he said. “I want as much as I can to speed things up.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/coldplay-frontman-s-warning-to-fans-after-kiss-cam-controversy-20250721-p5mggy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Coldplay frontman’s warning to fans after ‘kiss cam’ controversy",
        "publish_date": "Mon, 21 Jul 2025 11:29:00 +1000",
        "category": "entertainment",
        "authors": [
            "Chris Hook"
        ],
        "text": "Coldplay frontman Chris Martin has delivered a cheeky warning to fans they may appear on the big screen during the British band’s latest US concert at the weekend – just days after “kiss cam” video from an earlier show went viral because of the reaction of the pair caught on camera.\n\nThe Jumbotron Song footage was captured at Coldplay’s concert during their Music of the Spheres world tour in Foxborough, Massachusetts, on Wednesday evening (Thursday morning AEST), and appeared to show Astronomer CEO Andy Byron and his chief people officer Kristin Cabot cuddling.\n\nRealising they were on the big screen, Byron appeared to duck away while Cabot hid her face behind her hands and turned away from the camera.\n\n“Oh, look at these two ... Either they’re having an affair or they’re very shy,” Martin said, as laughter rang out across the stadium.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-ladder-lies-these-are-the-true-indicators-of-finals-form-20250720-p5mgbr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The ladder lies. These are the true indicators of finals form",
        "publish_date": "Mon, 21 Jul 2025 11:28:38 +1000",
        "category": "sports",
        "authors": [],
        "text": "Speaking of depth, keep an eye on Hawthorn. It was exciting to see the return of Mitch Lewis against Port Adelaide, with Changkuoth Jiath, Jack Scrimshaw, Max Ramsden and Luke Breust all lining up in the VFL. Josh Weddle and Will Day are also edging closer to return, while Mabior Chol was rested with soreness. That kind of internal pressure drives standards. It’s clear Sam Mitchell is still figuring out his best 22, and no one is safe. That uncertainty is keeping the Hawks hungry. Defensive identity Finals footy is brutal: contested, chaotic, and relentless. The best teams know now is the time to tighten up defensively – and test their systems under pressure. Collingwood and Adelaide are elite at restricting scores, both from stoppage and turnover. It starts up the ground – forwards and mids swarm, forcing rushed entries. Defenders win one-on-ones, set up behind the ball, and squeeze territory. It’s connected, high-IQ footy. Meanwhile, the Bulldogs should be on high alert. Now sitting one game behind eighth-placed Gold Coast, they’ve conceded more points than any other team in the top nine, despite boasting the league’s highest-scoring attack. Their offensive firepower is clear, but it’s defence that wins premierships.\n\nRight now, they’re losing over half of their one-on-one contests in defensive 50, a clear sign the ball is coming in too hot and too often. That’s not sustainable come finals, when games tighten up and scoring dries up. You can patch defensive issues in-season, but pressure always finds cracks. Over the next few weeks you’ll see teams are also rehearsing their game modes – the tactical switches that control momentum. Think tempo shifts, kick-mark, boundary plays, skinny-side set-ups, or throwing a forward behind the ball late. It all gets tested now so that, hopefully, it will be second nature when it counts. The Bulldogs score heavily but need to tighten their defence. Credit: AFL Photos Chris Scott keeps evolving Geelong’s gears. One week they have 165 marks in a slow build-up game. The next, they play direct and daring. Their ability to adjust to the opposition makes them dangerous, but the round 18 loss to GWS showed they’re not quite humming yet. Expect more tinkering in the weeks ahead. The best teams know these tactical shifts must come from their on-field leaders, not coaches. That’s what separates the serious contenders from the pack.\n\nDress rehearsals Much has been made of Geelong’s soft run home, but is it really the advantage it’s made out to be? A soft draw doesn’t always prepare a team well for finals. If anything, it can rob them of the chance to become battle-hardened. The expectation is to win, and win well – and that kind of pressure can be deceptive. It might improve your ladder position, but it doesn’t forge the grit needed in September. But for a team like GWS, simply trying to consolidate its position, a softer fixture is gold. Their win over Geelong in round 18 kept their season alive. Every winnable game builds momentum, and momentum builds belief. Is Geelong’s soft run home really an advantage? Credit: Getty Images Friday night’s clash between Brisbane and the Bulldogs was massive – and so was the finish to Collingwood’s loss to Fremantle. These were finals dress rehearsals: high-pressure, contested, and played with high stakes. Games like these expose flaws and test systems. A statement win sends shockwaves – and that’s exactly what Fremantle and Adelaide delivered, laying down the law against fellow top-eight contenders.\n\nLoading Gold Coast did it in round 18. They brought fierce, forward-half pressure that unsettled Collingwood – and it worked. That was no fluke. They played with the intensity needed in big moments. And it told the rest of the comp: “we’re not just here to compete”. Still, they stumbled against Adelaide on Sunday – a reminder of just how hard it is to back up finals-like footy week in, week out. Brisbane play four of the final top eight teams in the next five weeks. Their fixture is brutal – Suns, Pies, Freo and the Hawks. It will either forge them or fry them. The same goes for the Hawks, who have Adelaide, Collingwood and the Lions. You can’t simulate finals intensity on the training track. You can’t smash your teammates three weeks out from finals. You need real-game exposure. If you don’t get it? The first final hits like a truck.\n\nA constant fight Every game for the top nine has the power to reshape both the top four and the eight. Even Sydney, sitting 10th, are applying pressure. And don’t be fooled – the ladder can hide as much as it reveals. Take Gold Coast. They’ve played one fewer game, with a catch-up match still to come against the wounded Bombers. That gives them more flexibility than a glance at the ladder shows. For everyone else, it’s survival mode. No luxury of load management. No room for slip-ups. The Suns have a game in hand on the rest of the contenders. Credit: AFL Photos Teams either win the games they should, or stack pressure on themselves into the next week. The Bulldogs felt that after their loss to Adelaide, and now it’s compounded after falling to the Lions.\n\nHawthorn would’ve felt it, too, after slipping up against Freo. They responded with a strong win over Port. Who knows, that final spot could be decided in round 24, with a cluster of mini elimination finals. At this stage of the season, every miss carries consequences. There’s no room left to stumble. But there’s a cost to playing high-pressure footy for five straight weeks just to scrape in. What’s left in the tank when you finally get there? That’s the risk. These teams aren’t just fighting to simply make the finals – they’re fighting to arrive in one piece. Whether their energy holds or burns out could decide their whole finals series. Crunch time\n\nLoading This is the stretch that separates the good from the great. Having been part of three premiership campaigns, I know this is when leaders matter most. Margins shrink. Stakes rise. And while there’s still time to tweak and improve, the best teams are already asking: Where are the cracks, and how do we fix them? What are our strengths – and how do we harness them? Yes, luck always plays a part. But ladder position matters. Finishing high saves energy in September – home finals, the finals draw you land – these things shape your path. And they can be the difference on the final day.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/prime-minister-to-push-childcare-reform-as-parliament-returns-midday-news-bulletin-21-july-2025/0zgvzvllc",
        "title": "Prime Minister to push childcare reform as parliament returns | Midday News Bulletin 21 July 2025",
        "publish_date": "Mon, 21 Jul 2025 01:58:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Parliament to resume for first time since election\n\nTasmanian business leaders concerned over state politics\n\nVenus Williams returns to professional tennis\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPrime Minister Anthony Albanese says he supports a greater role for the federal government in childcare.\n\n\n\n\n\nUniversal affordable childcare was identified by the prime minister during the recent federal election as the one reform he'd most want to be remembered for.\n\n\n\n\n\nBut the accusations levelled against Joshua Brown, whose 70 counts of alleged abuse at Melbourne early learning centres have raised concerns that the rapid expansion of government subsidies into the sector has not been met with a commensurate increase in safety and scrutiny.\n\n\n\n\n\nMr Albanese says he sees the need for a stronger role for the federal government in childcare.\n\n\n\n\n\nAnd with Parliament resuming, he says he wants this to be a year of delivery for the government's policy agenda.\n\n\n\n\n\n\"To all the MPs and senators elected to the 48th Parliament, firstly congratulations across the board. It is such a privilege to sit either in the House of Representatives or the Senate. And it is something that none of us should ever take for granted. And it is an honour each and every day.\"\n\n\n\n\n\nThe first parliamentary sitting since the May election begins on tomorrow.\n\n\n\n\n\nThe second term of Albanese government will see Labor with an increased majority, holding 94 of the 150 seats in the House of Representatives after a landslide election win in May.\n\n\n\n\n\nAbout 40 politicians are entering parliament for the first time.\n\n\n\n---\n\n\n\n\n\nBusiness leaders in Tasmania have urged politicians to work together to overcome the hurdle of a hung parliament - and resume parliamentary activity soon.\n\n\n\n\n\nSaturday's election was the state's fourth in seven years – and the second in two years, brought on by a motion of no confidence in Premier Jeremy Rockliff in June.\n\n\n\n\n\nIt has returned the result of another hung parliament, with neither major party winning the 18 seats required to rule as a majority government.\n\n\n\n\n\nNegotiations are underway to finalise a power sharing arrangement.\n\n\n\n\n\nThe CEO of the Tasmanian Chamber of Commerce and Industry, Michael Bailey says political uncertainty is hurting businesses.\n\n\n\n\n\n\"It is time for Parliament to get back to work. This has been a huge distraction for Tasmanian business, for investment and it is time that we see the Parliament back working again. What we can't afford is to have weeks of horse-trading behind the scenes with governments trying to form. We simply need parliament to get back - and to get on with the job of leading Tasmania.\"\n\n\n\n---\n\n\n\n\n\nA new report has found Australians living with chronic pain continue to suffer from stigma, with 74 per cent feeling ignored or dismissed; and 48 per cent experiencing prejudice from health professionals.\n\n\n\n\n\nThe research released by Chronic Pain Australia surveyed 5,000 Australians.\n\n\n\n\n\nIt found nearly three-quarters of chronic pain sufferers experience mental health issues as a result of their pain, while nearly two-thirds are unable to work and experience financial strain.\n\n\n\n\n\nThe chairperson of Chronic Pain Australia, Nicolette Ellis, says with around 3.6 million Australians impacted by chronic pain, more effort needs to be made to ensure people can get help.\n\n\n\n\n\n\"Chronic pain is a complex condition to treat and it usually needs a team of health professionals, with different skillsets to help build that person's toolkit. Unfortunately, in the National Pain Report we saw that only 18 per cent of people are referred to what we call multidisciplinary care where they can get access to those different health professionals to help support their care.”\n\n\n\n\n\nThe report calls on the federal government to make chronic pain a national priority through changes like providing more localised funding to primary care and the coding system to recognise it as a health condition.\n\n\n\n---\n\n\n\n\n\nExit polls show Japan's ruling coalition is likely to lose its majority in the upper house, with 75 uncontested seats out of the 125 needed to maintain control.\n\n\n\n\n\nThe vote does not determine whether prime minister Shigeru Ishiba's minority Liberal Democratic Party remains in power, but increases the pressure on the leader, after the bloc lost its majority in the lower house following elections in October.\n\n\n\n\n\nA loss at this election would mark the first time in the history of the party that it leads a coalition that does not control either house, and would likely result in calls for Mr Ishiba to step down.\n\n\n\n\n\nRising prices, low incomes and burdensome social security payments are among key issues for voters.\n\n\n\n---\n\n\n\n\n\nIn sport, former world number one Venus Williams is preparing for her return to professional tennis.\n\n\n\n\n\nAfter 16 months away from the sport, the seven-time Grand Slam champion is competing in the Washington Open [[Mon 21 July local time]].\n\n\n\n\n\nThe 45-year-old has won the Wimbledon singles title five times and the US Open twice, as well as 14 Grand Slam women's doubles titles alongside her younger sister Serena.\n\n\n\n\n\nShe has not competed since the Miami Open in March 2024.\n\n\n\n\n\nShe faces fellow American Peyton Stearns in the first round of the Washington Open today.\n\n\n\n\n\n\n\nWilliams says after time away, her definition of success has shifted.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-15-results/w49xr9dw7",
        "title": "Tour de France: Australian Michael Storer helps save Tudor's celebration blushes",
        "publish_date": "Sun, 20 Jul 2025 20:08:05 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian star Michael Storer has bagged the much-coveted daily combativity prize for being the most aggressive rider after his constant attacks enlivened a thrilling afternoon on the 15th stage of the Tour de France.\n\n\n\n\n\nBut the Perth rider's illustrious Tudor Pro teammate Julian Alaphilippe will want to forget the embarrassment of celebrating a stage win in the ancient city of Carcassonne, which he later discovered was actually only a third-place finish.\n\n\n\n\n\nAt the end of the 169km route from Muret, the race had actually already been won by UAE Team Emirates' veteran Tim Wellens, wearing the Belgian champion's jersey, with compatriot Victor Campenaerts (Visma Lease-A-Bike) second in a fitting one-two on the eve of Monday's rest day, which is Belgium's National Day.\n\n\n\n\n\nThe pair had both been in the breakaway with the buzzing Storer but the Australian was eventually swallowed up amid the sprint for third, won by Alaphilippe, who celebrated as though he had won the stage.\n\n\n\n\n\nAlas, the former double world champion had been without a working radio due to an early crash, during which he had also dislocated his shoulder, so hadn't realised the two Belgians were ahead.\n\n\n\n\"I tried to put in the best sprint possible and thought about the stage win. Like an idiot, I raised my hands, but there were a few guys ahead of me,\" the 33-year-old later told French television while also revealing he had put his dislocated shoulder back himself.\n\n\n\n\n\n\"I remembered what they did to me in the hospital previously and managed to pop it back in,\" Alaphilippe said.\n\n\n\n\n\n\"The day could have gone better — but I could also have had to go home, so it's okay.\"\n\n\n\n\n\nWhile Raphael Meyer, CEO of the Swiss-based Tudor team, pointed out they would have been very happy with third if offered that before the stage, he also paid tribute to Storer's \"amazing\" ride after the 28-year-old had come home among the pack of sprinters behind Alaphilippe in 22nd place.\n\n\n\nFurther back, there was no change at the top of the general classification, with the main favourites finishing some six minutes after Wellens, following a few exhausting days in the high mountains.\n\n\n\n\n\nTadej Pogačar remains four minutes 13 seconds clear of Jonas Vingegaard (Visma Lease-A-Bike) with Florian Lipowitz (Red Bull–Bora–Hansgrohe) third, just shy of eight minutes off yellow.\n\n\n\nBen O'Connor remains the top Australian in the standings in 12th place, 25:44 behind Pogačar.\n\n\n\n\n\nThe day's breakaway had formed after the crash had split the peloton. With Vingegaard and Lipowitz delayed, UAE and Pogačar tried to slow the peloton to enable them to catch up — mirroring a similar sporting response by his rivals when he crashed a few days ago.\n\n\n\n\n\nThe breakaway was gradually whittled down to four with Storer attempting to go solo at that point, only to be reeled back in.\n\n\n\n\n\nWith a little over 40km to go, the leading group was eight-strong, at which point Wellens, who had been sitting on the others' wheels, launched his break which quickly became decisive as the rest dithered over how to respond.\n\n\n\n\n\n\"It was a very special victory,\" said Wellens, after his maiden Tour win. \"Everybody knows the Tour de France, everybody wants to ride the Tour de France but not many get to win at the Tour de France, so it's very beautiful.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australia-trails-china-in-29-billion-race-for-influence-southeast-asia/bvtjlluv7",
        "title": "In a $29 billion race for influence, Australia trails China as our allies turn away",
        "publish_date": "Sun, 20 Jul 2025 12:31:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "China is leading the development race in Southeast Asia as traditional donors like the United States and the United Kingdom step away from the region, according to a new Lowy Institute report.\n\n\n\n\n\nThe third edition of the Southeast Asia Aid Map shows China increased its regional development spend in 2023 for the first time in three years.\n\n\n\n\n\nGrace Stanhope, a research associate at the Lowy Institute, said: \"The lack of Western and European money going into Southeast Asia is a real problem.\"\n\n\n\n\n\n\"We're projecting a 20 per cent drop in bilateral foreign aid to the region by 2026,\" she said.\n\n\n\nChina favours infrastructure, loans\n\nAfter reducing its annual Southeast Asian development spend by 68 per cent over five years, China boosted its financing in 2023.\n\n\n\nWriting shortly after the 2025 federal election, the Lowy Institute's Grace Stanhope said the re-elected Albanese government would \"have to move fast\" if it wanted to increase Australia's influence in Southeast Asia. Source: Supplied The regional superpower is still favouring market-rate loans for infrastructure projects, with rail ventures in Indonesia and Malaysia accounting for most of the annual increase.\n\n\n\n\n\nChina is on track to overtake traditional partners in infrastructure spending, quadrupling its commitments from 2022 to 2023 through the revival of the Kyaukphyu Deep Sea Port Project in Myanmar.\n\n\n\nDevelopment spending committed by both China and Australia's traditional partner nations to Southeast Asia has decreased since 2015. Source: SBS News It's the loans to the region's poorest countries — like Myanmar, Laos, and Cambodia — that have some concerned.\n\n\n\n\n\n\"These countries have far less options in terms of other development providers, and also far higher development needs,\" Stanhope said.\n\n\n\n\n\n\"Increasingly, these countries have little room to manoeuvre in their negotiations.\"\n\n\n\n\n\nStanhope warns reduced competition could lead to less domestic scrutiny of China's funding.\n\n\n\n\n\n\"I think we can expect to see less pressure for reform in terms of China's development finance offering if there are no viable alternatives,\" she said.\n\n\n\nMost countries in the Indo-Pacific region have avoided high debt burdens taken on by other developing countries. Globally, a third of developing nations spend more on interest repayments than on health each year.\n\n\n\n\n\nMelissa Conley Tyler, executive director at the Asia Pacific Development Diplomacy and Defence Dialogue, said: \"We don't want countries in the Indo-Pacific to be heavily indebted.\"\n\n\n\n\n\n\"That's a huge problem if countries can't provide the services that they need to their citizens because they're paying back debt,\" she said.\n\n\n\nFurther cuts expected\n\nThe full impact of aid cuts is yet to be seen in the region.\n\n\n\n\n\nThe US slashed its aid spend by more than 80 per cent this year, while the UK plans to redirect billions in foreign assistance towards its defence budget.\n\n\n\n\n\nThe Lowy Institute says that will result in the \"centre of gravity\" shifting in Southeast Asian development financing.\n\n\n\nA bar chart shows the shifts in development funding from various nations since 2019. Source: SBS News\n\nAustralia's response\n\nAustralia increased its aid to Southeast Asia in 2023, with Labor committed to raising its international assistance budget annually in line with inflation.\n\n\n\n\n\nSpeaking after the ASEAN Leaders Summit earlier this month, Foreign Minister Penny Wong said Australia had \"sought to pivot our aid to the [Indo-Pacific] region\" in response to recent cuts.\n\n\n\n\n\n\"Some 75 cents in every dollar that Australia provides in development assistance is directed to our broader region,\" Wong said. \"We will continue to prioritise that.\"\n\n\n\nSource: SBS News Conley-Tyler said it's critical for Australia to maintain that focus.\n\n\n\n\n\n\"If you have a pandemic or animal diseases, if you have climate migration, all of those things are going to matter greatly to Australia.\n\n\n\n\n\n\"We would, of course, prefer to live in a region that is secure and stable and prosperous. And so the money we put into things like our development assistance is helping on our national interest in that.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/second-case-of-rare-mpox-strain-discovered-in-traveller/qv763cqb7",
        "title": "Second case of rare mpox strain discovered in traveller",
        "publish_date": "Sun, 20 Jul 2025 08:51:31 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"The patient has a close family, and that family are isolating at home. He was not contagious on the return journey to Australia from Africa, and those close contacts that he has been in contact including at the emergency ward and other locations are being contact traced right now and identified.\"\n\n\n\n\n\nThat's Queensland's Health Minister Tim Nicholls, confirming a new strain of mpox virus has been detected in a man who's just returned to the south-east of the state from a trip to Africa.\n\n\n\n\n\nHe says Mpox is a disease caused by the monkeypox virus.\n\n\n\n\n\n\"Mpox is not easily spread. It is only spread or it can only spread through close or intimate contact. It is particularly spread by close sexual contact and particularly for gay men and people engaging with sex is the primary cause of the contagious spread.\"\n\n\n\n\n\nDr Geoffrey Playford is the head of infectious diseases at the Princess Alexandra Hospital in Queensland.\n\n\n\n\n\nHe says the rare Clade 1 strain of mpox has only been seen once before in Australia, also in a returned traveller.\n\n\n\n\n\n\"Over the last year and a half in Queensland, we've had 135 cases in mpox clade 2 - this is the first case of clade 1 and the second time in Australia we've had clade 1. The other case was in New South Wales in May.\"\n\n\n\n\n\nMr Nicholls says the public should NOT be concerned.\n\n\n\n\n\n\"We think that there are 19 community contacts and 40 staff contacts that have been in contact with the patient. At the moment his symptoms are asymptomatic. They are not showing any signs of the clade 1 mpox, but they are isolating. The family involves children in high school, primary school and childcare centres and the high school, primary school and childcare centres either have been or are in the process of being identified.\"\n\n\n\n\n\nDr Playford says authorities are not worried either.\n\n\n\n\n\nHe says fortunately in this case the clinical presentation is relatively mild and there are no particular concerns for the patient's health.\n\n\n\n\n\n\"And all of our efforts at the moment is to identify contacts using national guidelines to undertake quarantine where the very close contacts have been identified, again in line with the national guidelines.\"\n\n\n\n\n\nThe close contacts will be offered a vaccine that is highly effective against mpox -either preventing or making the disease significantly milder and shorter.\n\n\n\n\n\nMr Nicholls says over a year ago there were some restrictions on the availability of the vaccine.\n\n\n\n\n\nBut now, Queensland has ample supplies - and the vaccine is provided free of charge through sexual health clinics and some GPs [[general practitioners]].\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australia-tuvalu-falepili-union-climate-security-visa-280-permanent-residency/gs30ircu0",
        "title": "Half of this country wants to move to Australia, but not all want to leave for good",
        "publish_date": "Sun, 20 Jul 2025 06:59:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "\"It's too beautiful,\" Lailega Neemia says of her homeland, Tuvalu.\n\n\n\n\n\n\"It's a good place to retire … stress-free ... very relaxed lifestyle over there.\"\n\n\n\n\n\nBut the ocean is rising and she, like many other Tuvaluans, worries their home may be completely underwater soon.\n\n\n\n\n\nThe South Pacific archipelago is likely to be the first country in the world to be uninhabitable due to climate change, according to the United Nations.\n\n\n\n\n\nClimate change is causing sea levels to rise, which is especially problematic for Tuvalu, where the average elevation above sea level is only two metres. Scientists predict that 95 per cent of the country will be underwater at high tide by the year 2100.\n\n\n\nIn response, Australia and Tuvalu signed the Falepili Union — a landmark climate and security pact, opening visa pathways for 280 Tuvalu citizens to be granted permanent residency in Australia.\n\n\n\n\n\nThe ballot , which closed on the 18th of July, drew 5,157 applicants — roughly half of Tuvalu's population.\n\n\n\n\n\nLaleiga hopes members of her family will win the lottery and join her in Australia.\n\n\n\n\n\n\"I am very excited. I have four sisters in Tuvalu. I'm trying to get all of them over,\" she said.\n\n\n\n\n\n\"I just feel I would love to have a sibling, a sister, closer with me here, staying next to me.\"\n\n\n\nREAD MORE Meet the young people who could outlive their own country\n\nThe Australian government said the agreement was \"the first agreement of its kind anywhere in the world that recognises that Tuvalu's statehood and sovereignty will continue, notwithstanding the impacts of climate change-related sea level rise\".\n\n\n\n\n\nBut the Neemia family hopes they can return home to Tuvalu one day — if there's anything left to return to.\n\n\n\nHopes to return home\n\nThe Falepili Mobility Pathway ballot allows 280 Tuvaluans each year to live, work and study in Australia. Those selected gain access to subsidised education and child care, Medicare, and other government support, such as the family tax benefit.\n\n\n\n\n\nGiven Tuvalu's national population is only around 11,000, some have speculated that the entire country could migrate to Australia within a generation if demand for the visa continues.\n\n\n\n\n\nPacific Minister Pat Conroy says the visa is different from most permanent resident pathways because it allows more freedom of movement.\n\n\n\nLISTEN TO Strong demand from Tuvalu for Australian residency as visa lottery closes SBS News 19/07/2025 04:56 English\n\nNormally, unlimited travel for permanent residents is capped at five years.\n\n\n\n\n\n\"It is a world's first approach to a relationship between two countries,\" Conroy said.\n\n\n\n\n\n\"We're responding to a request from the Tuvaluan government for migration with dignity. And so, we do envision that a fair number of Tuvalans will come to Australia out of a population of around 11,000.\"\n\n\n\n'Hopefully it's still there when we retire'\n\nThe Neemia family moved to Queensland 25 years ago, raising their family in Brisbane. But the plan was always to return home.\n\n\n\n\n\nLailega's husband Tupa hopes they'll be able to retire in Tuvalu — if it still exists.\n\n\n\n\n\n\"The plan was to come and work, when the kids grow up, we'd retire in Tuvalu,\" he told SBS News.\n\n\n\n\n\n\"Hopefully it's still there when we retire.\"\n\n\n\nREAD MORE Why Tuvalu is building a digital replica of itself in the metaverse\n\nAlopi Latukefu, director of the Global Centre for Social Justice and Advocacy Leadership, said climate change is already being felt across Tuvalu's nine atolls scattered across the Pacific between Australia and Hawaii.\n\n\n\n\n\n\"We are seeing these communities faced with real challenges in the community from the perspective of not just inundation from the sea level rise, but also in terms of food security, water security in these communities, the impact from regular events — whether they be king tides or more serious events — that are creating a very difficult situation,\" he said.\n\n\n\n\n\nHe said it's important to understand that not everyone wants to leave Tuvalu and that it's important Tuvaluans are supported to maintain their connection to their lands and culture.\n\n\n\n\n\n\"The decision to leave is a very big one and a very important one, and one which is tied to a range of other factors as well to support their families, to provide a pathway for a future, to have access to education, to have access to things that are part of the opportunity that Australia represents.\"\n\n\n\n\n\nBut some may feel they have little choice.\n\n\n\nSupporting fossil fuels 'immoral and unacceptable', says Tuvalu minister\n\nIn 2025-26, Australia committed $47 million in development assistance for Tuvalu, including for climate adaptation, telecommunications, infrastructure, health and education.\n\n\n\n\n\nThat includes support for Tuvalu's Coastal Adaptation Project, which implements measures such as beach nourishment, concrete and rock revetments, and sea walls to reduce the impact of rising seas.\n\n\n\n\n\nBut Australia has faced criticism from some Pacific leaders for its continued investment in fossil fuels — which contribute to the very climate change Tuvalu is fighting.\n\n\n\nREAD MORE Why over a third of this nation's citizens want to migrate to Australia\n\nThis year, Labor provisionally approved a 40-year extension of the North West Shelf , Australia's largest gas project.\n\n\n\n\n\nVanuatu's minister for climate change, Ralph Regenvanu, called the project extension a \"slap in the face\" for Pacific Island nations.\n\n\n\n\n\n\"We have continued to make it very clear to Australia that we expect them to stop approving any new oil and gas projects,\" Regenvanu said.\n\n\n\n\n\nTuvalu's Climate Minister Maina Vakafua Talia has also urged Australia to curb its emissions.\n\n\n\n\n\n\"Opening and subsidising and exporting fossil fuels is immoral and unacceptable,\" Talia said.\n\n\n\nA 2024 report by Climate Analytics, commissioned by the Australian Human Rights Institute, found no evidence Australia is \"transitioning away\" from fossil fuels.\n\n\n\n\n\nIn 2021, it was the third-largest exporter of primary fossil fuels globally — behind only Russia and the United States.\n\n\n\n\n\nAustralia ranked second for exported emissions due to the scale of its coal exports.\n\n\n\n\n\nConroy says Australia remains a conscientious neighbour, mindful of climate change.\n\n\n\nTuvalu just the beginning\n\nA 2024 United Nations High Commissioner for Refugees report found that 90 million displaced people are now living in countries with high to extreme exposure to climate hazards.\n\n\n\n\n\nBy 2040, the number of countries in that category is expected to rise from three to 65.\n\n\n\n\n\nAmid growing climate change risks, the Australian government introduced the Pacific Engagement Visa , which offers 3,000 visas to nationals from participating Pacific countries and Timor-Leste.\n\n\n\nREAD MORE Locals of these Australian islands say they fear the impact of rising seas\n\nUp to 100 Tuvaluans were eligible through the first ballot. Final discussions are underway on participation for the second round, expected to open later this year.\n\n\n\n\n\nThis visa also allows recipients to return to their home countries freely.\n\n\n\n\n\n\"I'm really focused on making sure those first 3,000 settle visa grantees have the best possible experience of coming to Australia, and then we'll just see where the numbers go. But at the moment, our policy is 3,000 places a year,\" Conroy said.\n\n\n\n\n\nWhile the transition can be difficult, as Laleiga well knows, she is reasonably optimistic for the prospects of incoming Tuvaluans.\n\n\n\n\n\n\"As long as they're aware of what it's going to be like with the help of the people already settled here. I think they're going to be okay.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/we-are-all-crazy-malaysian-violin-maker-reflects-on-a-life-in-tune-with-the-music/dy63giv4n",
        "title": "\"We are all crazy\": Malaysian violin maker reflects on a life in tune with the music",
        "publish_date": "Sun, 20 Jul 2025 03:13:06 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nStanding at a workbench in his studio in Kuala Lumpur, Tan Chin Seng tunes a violin he has just finished making.\n\n\n\n\n\nThe 45-year-old is Malaysia’s first professional violin maker.\n\n\n\n\n\nFor Tan, creating the instruments from raw wood is a labour of artistry and love.\n\n\n\n\n\n“Everything about the process, you know, there is woodworking, carpentry, artistic thing, there is chemistry, acoustics, physics, everything about violin-making I like it. Also turning wood into musical instruments is just amazing.”\n\n\n\n\n\nTraditionally, luthiers - makers of string instruments like violins and cellos - are associated with Europe, where masters like Antonio Stradivari and Giuseppe Guarneri shaped the modern violin.\n\n\n\n\n\nBut the craft has spread globally, with thriving communities of luthiers in China, Japan, South Korea and Taiwan.\n\n\n\n\n\nNow, in his warmly-lit studio cluttered with chunks of wood, chisels and jars of varnishes, Tan is nurturing the tradition in his own country - his workshop now making around 10 instruments a year.\n\n\n\n\n\n“Right now, in the workshop, there is seven workbench, so they are all occupied. This takes forever, because it is never complete, just like your car, you can polish every day.”\n\n\n\n\n\nAs a computer science graduate who doesn’t play the violin, Tan’s path to violin-making was unconventional.\n\n\n\n\n\nHe was helping in his family’s food business and co-owned a music school in 2010, when he made a trip to China to have an ageing violin restored.\n\n\n\n\n\nThe trip sparked Tan's fascination with the craft, and led him to undergo an apprenticeship with Chinese instrument maker Han Zhao Sheng.\n\n\n\n\n\n“At first, it was just that I find it really interesting, why not just make one violin? It's just that after completing the first violin, I knew this craft is for me, and I like it a lot and yeah.”\n\n\n\n\n\nTan flew back and forth to Beijing for more training, then travelled to Italy to study the craft further.\n\n\n\n\n\nOver the past decade, Tan has earned international accolades for his craftsmanship, and now, he mentors a new generation of makers.\n\n\n\n\n\nWhile most of his students are musicians and young people, Tan says few pursue it as a trade due to the demands of the craft, and the domestic market still being small.\n\n\n\n\n\nStill, some have followed in Tan's footsteps, including Chan Song Jie, Malaysia's first female luthier.\n\n\n\n\n\nTan says those who have decided to pursue the craft professionally make up a small but dedicated community, and one he hopes will continue to grow.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-19-july-2025/z8sqefmdo",
        "title": "Negotiations underway after Tasmania's election result | Midday News Bulletin 20 July 2025",
        "publish_date": "Sun, 20 Jul 2025 02:17:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nIn this bulletin;\n\n\n\nNegotiations underway after Tasmania's election results in a hung parliament\n\nA second case of the more severe variant of mpox recorded in Australia\n\nWallabies coach Joe Schmidt says he is proud of the fight the team showed in the first Test against the Lions.\n\nVote counting Tasmania's state election continues, with the final result still weeks away as postal votes are tallied.\n\n\n\n\n\nFour seats remain undecided from the state's second state election in 16 months.\n\n\n\n\n\nThe result is another hung parliament, with neither major party winning enough seats to rule in majority.\n\n\n\n\n\nThe Liberal Party has so far secured 14 seats to Labor's nine. The Greens have five seats and the independents three.\n\n\n\n\n\nNegotiations are now underway to decide the makeup of the government and its powersharing arrangement.\n\n\n\n\n\nTasmanian Premier Jeremy Rockliff says he is seeking to reform government, with a visit to the governor.\n\n\n\n\n\n\"Tasmanians have spoken. As I always have, and will continue to do so. Now is the time for those who have had - and will have - the great honour of being elected to Parliament to work together with good will across the chamber in the best interests of all Tasmanians.\" (applause)\n\n\n\n\n\n++\n\n\n\n\n\nVoting is underway in Japan's election for the upper house of parliament.\n\n\n\n\n\nThe outcome will determine whether Prime Minister Shigeru Ishiba's minority government will hold onto its majority in the upper house, after the bloc lost its majority in the lower house elections in October.\n\n\n\n\n\nMr Ishiba's Liberal Democratic Party (LDP) has governed Japan almost continuously since 1955.\n\n\n\n\n\nThese voters told N-H-K World Japan, says cost of living is a key issue.\n\n\n\n\n\nFemale voter 1: (translated into English) \"Everything is just so expensive - from rice to vegetables to meat and fish.\"\n\n\n\n\n\nFemale voter 2: (translated into English) \"Prices are rising but wages are not. We can't spend as much because taxes have gone up. We haven't changed our lifestyle, but we're paying more and more. It's really bad.\"\n\n\n\n\n\nPolls are set to close at 8pm local time.\n\n\n\n\n\n++\n\n\n\n\n\nA second case of the more severe variant of mpox virus has been detected in Australia.\n\n\n\n\n\nQueensland Health says the latest case of the clade 1 mpox variant was acquired overseas by a patient who is currently being treated in Brisbane's south.\n\n\n\n\n\nIn a statement, the health department says there is a low danger of the virus spreading.\n\n\n\n\n\nOfficials say contact tracing is underway and those who have been in close contact with the patient will be notified.\n\n\n\n\n\nMpox clade 1 is believed to be more infectious and more deadly than mpox clade 2, which caused the global outbreak in 2022 and 2023.\n\n\n\n\n\nAustralians are being reminded that pre-travel vaccination for mpox is free and recommended for people who may undertake sexual risk activities during travel to countries with transmission of clade 1 mpox.\n\n\n\n\n\n++\n\n\n\n\n\nTraditional owners have welcomed a native title ruling that they say will allow them to continue to care for the land where their ancestors walked, hunted and held ceremonies on.\n\n\n\n\n\nThe Federal Court delivered its ruling on the case that was lodged in 2015, granting three traditional owner groups native title in Victoria's north west.\n\n\n\n\n\nThe ruling grants the Traditional Owner groups non-exclusive rights, including the right to access the land, use its resources, and protect sites, objects and places of cultural and spiritual significance.\n\n\n\n\n\nNative title applicant member Timothy Johnson says it is a joyous outcome for traditional owners who have been fighting since the 1990s for native title.\n\n\n\n\n\n++\n\n\n\n\n\nIn rugby union, Wallabies coach Joe Schmidt says he is proud of the way the team fought back against the British and Irish Lions in the Test series opener.\n\n\n\n\n\nEarly in the second half, the Lions led 24-5, but the Wallabies fought back to score two tries inside the final 13 minutes of the match to reduce the margin to eight points. The final score was 27-19.\n\n\n\n\n\nSchmidt says that grit in the final quarter showed the team is developing.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/libraries-usually-like-bookworms-but-not-these-ones/2czbj60ei",
        "title": "Libraries usually like bookworms - but not these ones",
        "publish_date": "Sat, 19 Jul 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nThe Benedictine Archabbey has stood for the last 1,000 years, perched on top of a hill overlooking the town of Pannonhalma in Hungary.\n\n\n\n\n\nIts library houses the country's oldest collection of books as well as many of its earliest and most important written records, including a complete Bible from the 13th century.\n\n\n\n\n\nIt also houses several hundred manuscripts from before the invention of the printing press in the mid-15th century, and tens of thousands of books from the 16th century.\n\n\n\n\n\nThe current director is Ilona Ásványi.\n\n\n\n\n\n\"Every day, I experience being the guardian and caretaker, and custodian of this very valuable collection of books.\"\n\n\n\n\n\nThe Abbey library is said to have survived centuries of conflicts, including the Ottoman invasion of the 16th century.\n\n\n\n\n\nBut now it's facing a new problem: drugstore beetles have infested about a quarter of the Archabbey's 400,000 precious works.\n\n\n\n\n\nThe Benedictine abbey is governed by a set of rules that have been in use for nearly 15 centuries - a code that obliges the library to do everything it can to save its vast book collection.\n\n\n\n\n\nAccordingly, Zsófia Edit Hajdu has been brought in as the chief restorer.\n\n\n\n\n\n\"We have been working mostly on mould damage in both depositories and in open collections for 30 years, but we've never encountered such a degree of infestation before. Usually, we see problems of mould in warehouses and in other collections. But due to global warming, it is expected that more and more insect infestations will appear.\"\n\n\n\n\n\nThe drugstore beetle, also known as the bread beetle, is often found among foodstuffs like grains, flour, spices, and other dried products.\n\n\n\n\n\nBut they are also attracted to the gelatine and starch-based adhesives found in old books.\n\n\n\n\n\nMs Hajdu believes the effects of climate change have played a role in spurring the beetle infestation.\n\n\n\n\n\n\"Higher temperatures are favourable for the life of insects. They are quite inactive below 20 degrees Celsius. Below that, their activity slows down; above that, they’re more active. The persistently greater heat leads to more life cycles per year than in cooler periods. In warmer conditions, the reproduction cycle of the drugstore beetle can be up to four per year compared to only two in cooler weather.”\n\n\n\n\n\nThe beetle invasion was first detected during a routine cleaning of the library, when employees noticed unusual layers of dust on the shelves and then saw that holes had been burrowed into some of the book spines.\n\n\n\n\n\nUpon opening the volumes, burrow holes could be seen in the paper where the beetles had chewed through.\n\n\n\n\n\nIlona Ásványi says everyone is heartbroken at the prospect of losing books because of the infestation.\n\n\n\n\n\n\"When I see a book chewed up by a beetle or infested in any other way, I feel that no matter how many copies are published and how replaceable the book is, a piece of culture has been lost.”\n\n\n\n\n\nBut the Abbey's restoration workers are trying hard to avoid that possibility.\n\n\n\n\n\nThey're removing roughly 100,000 hand-bound books from the shelves and carefully placing them in crates.\n\n\n\n\n\nZsófia Hajdu says so many books are being taken down because the infestation has been detected in several parts of the library.\n\n\n\n\n\n\"This is an advanced insect infestation which has been detected in several parts of the library, so the entire collection is classified as infected and must be treated all at the same time. We have to remove all the books from the shelves, put them into boxes, then into hermetically sealed plastic sacks. Inside them, an anoxic disinfection process takes place. Basically, we create an oxygen-free environment in which insects perish.”\n\n\n\n\n\nOnce that process is done - and before being reshelved - each book will be individually inspected and vacuumed, and any book damaged by the pests will be set aside for later restoration work.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-14-results/nhkpm3v42",
        "title": "Tour de France: Arensman climbs to misty stage 14 win as Pogacar extends lead",
        "publish_date": "Sat, 19 Jul 2025 21:19:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "Dutch rider Thymen Arensman won the Tour de France's toughest stage after a long solo effort over mammoth climbs but Tadej Pogacar increased his overall lead on Sunday AEST.\n\n\n\n\n\nArensman, who rides for Ineos-Grenadiers, posted the biggest victory of his career. After crossing the finish line in the deep fog enveloping the ski resort of Superbagneres, Arensman lay exhausted on the road with his head in his hands.\n\n\n\n\n\nHe went solo with 37km left from a breakaway, and quickly opened a comfortable lead. He started the final ascent to Superbagneres, which is more than 12km long, on his own and resisted the return of the main contenders.\n\n\n\n\n\nIt was Arensman's second Grand Tour stage win, having previously won a stage at the 2022 Spanish Vuelta.\n\n\n\n\n\nAs Arensman posed no threat to the overall standings, Pogacar and his teammates controlled the race from the back. The yellow jersey holder and his main challenger, Jonas Vingegaard, trailed by around three minutes with 8km remaining.\n\n\n\nVingegaard tried a move with 4km left but Pogacar responded with ease. The two rivals then watched each other closely and Arensman crossed first at the summit, more than one minute ahead of the duo.\n\n\n\n\n\nHaving won the previous two stages in the Pyrenees, Pogacar settled for second place. He accelerated in the final section to gain more time on Vingegaard, who completed the podium.\n\n\n\n\n\nOverall, Pogacar increased his lead over Vingegaard to 4 minutes, 13 seconds, with Florian Lipowitz in third place, 7:53 off the pace after Remco Evenepoel abandoned his race.\n\n\n\n\n\nEvenepoel, who was third overall, struggled early on as the peloton faced another day of suffering on climbs that are part of the Tour's lore such as the Col du Tourmalet, the Col d'Aspin, Col de Peyresourde and Superbagneres.\n\n\n\nThe Olympic champion was dropped on the ascent of the Tourmalet. Evenepoel won the stage five time trial but suffered in the Pyrenees.\n\n\n\n\n\nAfter struggling during Friday's uphill race against the clock to Peyragudes, he managed to keep his third place in the general classification.\n\n\n\n\n\nBen O'Connor was the highest finishing Australian rider, in 16th place, with Callum Scotson 19th. O'Connor is in 12th position overall.\n\n\n\n\n\nMeanwhile, a spectator was hit by a car from the Ineos-Grenadiers team on Saturday.\n\n\n\n\n\nTV footage showed the team car knocking down the fan, who was holding what looked liked a mobile phone, close to the top of the Col de Peyresourde.\n\n\n\nThe vehicle was following riders on the steep ascent and driving at moderate speed. There was no immediate information available on the spectator's condition.\n\n\n\n\n\nThe race jury later said Ineos-Grenadiers sports director Oliver Cookson was fined the equivalent of just under A$10,000 for \"improper behaviour endangering spectators\" and handed a yellow card. Accumulating yellow cards over a defined period of time results in a suspension.\n\n\n\n\n\nIneos-Grenadiers apologised \"to the fan who was accidentally and regretfully struck by one of our race cars while supporting the riders.\n\n\n\n\n\n\"Like all teams we take great care to maintain a safe race environment for everyone, including the passionate fans who make our sport so special.\"\n\n\n\n\n\nRiders will leave the high mountains on Sunday's stage during a 169km ride from Muret to the medieval city of Carcassonne.\n\n\n\n\n\nThe race finishes next weekend in Paris.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australias-ancient-export-brings-new-jobs-to-wa/3p0mlcyg9",
        "title": "Australia's ancient export brings new jobs to WA",
        "publish_date": "Sat, 19 Jul 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nShark Bay or Gathaagudu is on Australia's most westerly point.\n\n\n\nA world heritage area where the bronzed earth meets turquoise waters abundant with marine life.\n\n\n\n\n\nHere you'll find turtles, dugongs, whale, dolphins and scattered across the sea floor a coveted delicacy containing centuries of seafaring history.\n\n\n\nThe sea cucumber is Australia's first ever export.\n\n\n\nFrom the early 1700s, Makassan fisherman, from the island of Sulawesi - now Indonesia - sailed the trade winds south to Arnhem Land to trade with Aboriginal people.\n\n\n\n\n\n\"From what the records show, they used to swap sea cucumbers for iron for their spears. So I thought it was incredible that there was a trade before colonisation and you can actually record it. So why not try and recreate it?\"\n\n\n\n\n\nThat's Malgana Traditional Owner Michael Wear.\n\n\n\n\n\nHe heads an Indigenous-owned business which is reviving the ancient industry. Tidal Moon draws on traditional knowledge to harvest sea cucumbers sustainably.\n\n\n\nHand-picked, one by one, the marine animal will soon be dried and processed at a brand-new export facility in the West Australian town of Denham. And then they're sent to a Singaporean partner for export across South East Asia.\n\n\n\n\n\nTidal Moon also has its sights set on Western markets, with emerging research highlighting the potential health benefits of the marine animals.\n\n\n\n\n\nThe hope is that as the business scales up, so too will employment opportunities in the region.\n\n\n\n\n\n\"The lack of indigenous people in the commercial fishing industry is so, so unfortunate. If you can create a business that's sustainable, that's culturally directed, you can create jobs and a middle class within small coastal towns.\"\n\n\n\n\n\nSince 2017, the company has trained around a dozen Indigenous divers, including 28 year old Malgana and Amangu man Alex Dodd - the company's lead diver\n\n\n\n\n\n\"Tidal Moon, what it's actually doing is making that middle class ground so people can move back home and have jobs and then buy a house, settle down with their family and kids up here and move back home. A lot of the time you get young fellas that grow up here and then they're moving away going to the mines or going to Perth or something like that because it's not sustainable for them to work here.\"\n\n\n\n\n\nConservation is also at the heart of the business\n\n\n\nGathaagudu is home to the planet's largest reserve of seagrass both a food source for marine life and a carbon storage powerhouse\n\n\n\nBut more than a quarter was razed in a marine heatwave in 2011, and it's still recovering while also grappling with a new heatwave. In February, the waters were four degrees warmer than usual.\n\n\n\nTidal Moon is leading one of the world's largest seagrass restoration projects. While scouring the seafloor for sea cucumbers, the divers also replant seagrass reserves.\n\n\n\n\n\n\"One of the key things that we're trying to do is keep the carbon captured in the sea floor. So without seagrass restoration, you have these carbon bombs that go off and there's about 40 million tons of CO2 that are at risk in Shark Bay.\"\n\n\n\n\n\nThe team have also catalogued over 4000 hours of footage – a 'living library' of marine observations noticing a symbiotic relationship between the seagrass and sea cucumbers.\n\n\n\n\n\nJennifer Verduin, a marine scientist at Perth’s Murdoch University, agrees that the relationship might be “mutually beneficial,” saying sea cucumbers are 'the worms of the ocean.'\n\n\n\n\n\n\"The function of sea cucumbers overturning the soil and redistributing nutrients. It's very good to get those nutrients in within the sediment. So it's good for the seagrasses and they grow better. But seagrasses, in turn, also then protect the sea cucumbers.\"\n\n\n\n\n\nShe says Tidal Moon’s divers, have a “careful” and “circular” way of approaching marine conservation.\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-working-from-home-is-necessary-for-modern-families/wigcq21dp",
        "title": "The male breadwinner is gone. Why working from home is necessary for modern families",
        "publish_date": "Sat, 19 Jul 2025 20:39:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Eb Yusuf had to return to work when her daughter was just eight months old — an experience she describes as traumatising.\n\n\n\n\n\n\"I was with my girl 24/7 up until that point and then I had to leave for eight, nine hours a day,\" the Sydney mother says.\n\n\n\n\n\n\"I'm still not over it.\"\n\n\n\n\n\nYusuf's employer at the time required her to return to the office full-time but she later found a part-time role that allowed her to work from home during the COVID-19 pandemic.\n\n\n\n\n\nThe 42-year-old is one of many Australian parents who say working from home and other flexible arrangements have become essential to the smooth functioning of their households and satisfaction with their family life.\n\n\n\nYusuf, who has since returned to full-time hours but continues to work from home three days a week, says she doesn't want to miss out on raising her child.\n\n\n\n\n\n\"I think in 2025 [work from home is] crucial,\" she says.\n\n\n\nI enjoy being able to be there for all those milestones [for my daughter], I don't want someone else to be having more time with my child than I am.\n\nYusuf's husband also works from home three days a week, and she says this helps them to pick up their daughter at a reasonable time from after-school care.\n\n\n\n\n\nOn days she works from home, she is also able to use some of her 30-40 minute commute time for exercise or other activities.\n\n\n\n\n\n\"[It gives me time to] do those things that make me a good mum, and a good employee, and a good wife, and happy within myself, so I think that's really important,\" she says.\n\n\n\nCost of living pressures force both parents to work\n\nDemographer Liz Allen, of the Australian National University, says workplaces have historically lagged in supporting parents in working effectively while maintaining their priorities as parents and their own personal well-being.\n\n\n\n\n\nBut working from home is enabling that and also breaks down barriers to gender equality in the workplace.\n\n\n\n\n\n\"It gives an expectation to workers that they have a right to work from home to make that work-life juggle [easier],\" Allen says.\n\n\n\n\n\nFor many women, staying home to look after their children is no longer an option.\n\n\n\nWe are no longer in a situation where we've got that male breadwinner — single income earner — in a family where a woman stays home and does everything by way of unpaid work.\n\n\"In order to pay for housing, we need dual-income earners,\" Allen says.\n\n\n\n\n\nAccording to the property listing company Domain, property prices have jumped by 777 per cent over the past three decades in some capital cities, such as Sydney, where the median price of a house is now $1.7 million — compared with a median of $192,819 in March 1993.\n\n\n\nHouse prices in Sydney increased by 777 per cent between 1993 and 2025, according to data from Domain. Source: SBS News But wage growth over a similar period has not kept pace, which has put extra strain on families. Wages in NSW grew by 131.1 per cent between September 1997 and March 2025.\n\n\n\nWages growth in Australia has failed to keep pace with the increased cost of housing. Source: SBS News\n\nWomen are more likely to work now\n\nSocial researcher Mark McCrindle points out that women in their early 30s — an age when many would be having children — are now twice as likely to be working compared to their own mothers at the same age.\n\n\n\n\n\nHe explains: \"77 per cent of women in their early 30s are in the labour force — it was less than a third a generation ago.\"\n\n\n\nEmployment for women aged in their 30s once dropped sharply but now it barely dips. Source: SBS News Based on the Australian Bureau of Statistics' Time Use Survey, conducted between November 2020 and July 2021, McCrindle notes that a third of Australians also report feeling rushed or pressed for time often or always.\n\n\n\n\n\nAround 38 per cent of women reported this, and 32 per cent of men.\n\n\n\n\n\nWomen aged 35 to 44 years were the group most likely to report feeling rushed for time (55 per cent).\n\n\n\nREAD MORE Cheryll tried to get pregnant for years. One thing sealed her decision to stop\n\nMcCrindle says working from home is seen as a way of reducing that stress or time pressure, as workplaces are traditionally located in CBDs well away from where people live, and where schools, childcare, shopping and other family and social connections are located.\n\n\n\n\n\nThe rising cost of housing has pushed people even further away from workplaces.\n\n\n\n\n\n\"The only way to really make all of that work is to have less time conducting that commute, and that's where I think work from home achieves that,\" McCrindle says.\n\n\n\nWork from home has become a lifeline for parents\n\nYusuf, whose daughter is now seven years old, has been promoted to the senior leadership team at her work, and says her experiences motivated her to support flexibility for employees returning from maternity leave, so they can return to work in a way that makes them comfortable.\n\n\n\n\n\n\"[There's] no clock watching, so you're not making sure people arrive at a certain time or leave at a certain time,\" she says.\n\n\n\nI've heard of businesses saying you need to prove that you've got child care — somebody in the house helping you with the child — in order to be paid for this day of work.\n\n\"We don't do anything like that because we just know that our people will make it work.,\" Yusuf says.\n\n\n\n\n\nShe hopes flexible work arrangements will ultimately enable women to take on leadership roles while still allowing them to be the parents they aspire to be.\n\n\n\n\n\n\"I know a lot of women in senior roles who have the house husband or the au pair, but I don't want to miss out on that time with my child,\" she says.\n\n\n\nEb Yusuf is ambitious about her career but doesn't want to miss out on spending time with her daughter. Source: Supplied Yusuf's heard messages directed towards women that if they want to be a boss or CEO, they need to be in the office.\n\n\n\n\n\nBut she points out she has a vested interest in the business performing well.\n\n\n\n\n\n\"I've worked in this business for nearly five years. They know that I want to do a good job and I'll get it done,\" she says.\n\n\n\n\n\n\"Whether it's [because I'm clocking on] outside of work hours or whether I just do it quicker ... because I'm a mum and I need to be efficient with my time.\"\n\n\n\n'I just love my life so much more'\n\nKerrie Cullimore, 41, has 12-year-old twins and says she left her previous job because the demands of full-time work and commuting for almost three hours a day were unsustainable with young children.\n\n\n\n\n\nCullimore says it felt like work took up a huge part of her life.\n\n\n\n\n\n\"I was gone from the house for like 13 hours a day or something ridiculous. [I was home at] 7 o'clock at night,\" she says.\n\n\n\nI remember standing in the bus line looking around at everyone [one] night ... thinking ... 'I don't want to do this for the rest of my life. This is horrible'.\n\nCullimore, who found a part-time role closer to home in the finance department of a media company, says being allowed to work remotely meant her family could make a life-changing move from Sydney to Port Stephens.\n\n\n\n\n\n\"I can take my dog for a walk in the morning, the kids get on the bus [just outside my house], I'm here in the afternoon when the kids get home [and] I can make dinner,\" she says.\n\n\n\n\n\n\"I can jump on and off online depending on my work schedule, and I just love my life so much more.\"\n\n\n\n\n\nThe arrangement is also beneficial for her employers as she logs in every day, even though she has a part-time role.\n\n\n\n\n\n\"If I had to go into the office, I would definitely go in for the three days only,\" she says.\n\n\n\nKerrie Cullimore loves her life after working from home enabled her family to move to Port Stephens. Source: Supplied Cullimore also appreciates that her workplace allows staff members who work from the office to leave around 2.30pm to pick up their children from school.\n\n\n\n\n\n\"Nobody cares ... they go home and finish the rest of their work at home,\" she says.\n\n\n\n\n\n\"It's just so lovely to work for a company that is really accommodating to parents, and understands that parents can be more part of their children's life.\"\n\n\n\nPush to get workers back in the office\n\nWhile working from home is valued by employees, some employers have pushed to get staff back in the office.\n\n\n\n\n\nDuring this year's federal election campaign, former Opposition leader Peter Dutton proposed forcing Canberra public servants back into the office , something that Redbridge Group director Simon Welsh says started to shift attitudes against Dutton.\n\n\n\n\n\nWelsh says the research agency, which conducts focus group polling, observed how voters began to view Dutton as a risk to their finances because working from home was valued for helping them save money on things like public transport, food and childcare.\n\n\n\n\n\n\"When you've got people that are in survival mode and they see [work from home] as a solution to it — and a solution that is fair — [it's] pretty hard to come out and argue against that,\" he says.\n\n\n\nRedbridge's research found working from home also made mothers feel better about themselves and relieved some of the stress of parenting.\n\n\n\n\n\n\"[Mothers] don't feel like they're neglecting their kids ... they can be there to pick the kids up from school rather than having the kids go to an after-school program,\" he says.\n\n\n\n\n\n\"That matters to fathers as well, but it's particularly acute for women.\"\n\n\n\n\n\nDutton is not the only leader trying to roll back work-from-home arrangements.\n\n\n\nLISTEN TO New research shows just how much money people working from home save SBS News 30/04/2025 03:56 English\n\nA survey of 500 employers conducted in November by recruitment agency Robert Half found 39 per cent wanted workers in the office five days a week in 2025, up from 36 per cent in 2024.\n\n\n\n\n\nOverall, the number of mandated in-office workdays was expected to rise from an average of 3.43 days a week in 2024 to 3.64 days a week in 2025.\n\n\n\n\n\nAmong employers planning to mandate in-office days this year, around 40 per cent believed this would help improve productivity.\n\n\n\nThe benefits of working from home\n\nThe Albanese government has identified productivity as a key economic focus of its second term, following data from the Australian Bureau of Statistics that shows the productivity growth rate has slowed to its lowest level in at least 20 years.\n\n\n\n\n\nBut a report from the Productivity Commission released in September 2021 recommended that governments not stand in the way of working from home.\n\n\n\n\n\nProductivity Commission chair Michael Brennan says: \"On balance, working from home can unlock significant gains in terms of flexibility and time for employees, and could even increase the nation's productivity.\"\n\n\n\n\n\n\"Risks can be managed but we should keep an eye on them and be ready to intervene if necessary.\"\n\n\n\nBrennan says the COVID-19 pandemic had greatly accelerated the take-up of technology that assisted work-from-home opportunities.\n\n\n\n\n\n\"In less than two years, we have gone from less than 8 per cent of Australians working from home to 40 per cent,\" he says.\n\n\n\n\n\n\"While this percentage may not always remain so high, it is inevitable that more Australians will work from home.\"\n\n\n\nWork from home is unlikely to disappear\n\nMcCrindle believes a hybrid model, where at least some work is done at home, is \"baked in\" and not just because it benefits families.\n\n\n\n\n\nWorking from home gives people more time for hobbies, social engagements, volunteering, and even a side hustle or entrepreneurial activity. It enables older workers to help out with grandkids and those who are neurodivergent to participate in the workplace more fully.\n\n\n\n\n\nIt may also help parents who don't want to put their children in childcare to manage care with help from grandparents or extended family while continuing to work. Mothers may also be able to breastfeed for a longer period.\n\n\n\n\n\n\"The bigger picture has to be beyond purely GDP [gross domestic product] measures to the other social measures of wellbeing, social fabric, engaged family, and investment in the next generation,\" McCrindle says.\n\n\n\n\n\n\"Any flexible practices that can help accommodate that, I think, is an investment in the future.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-massive-hurdles-of-adhd-diagnosis-and-treatment-in-australia/7yqi1hr0i",
        "title": "How some Aussies are tackling the 'massive hurdles' of ADHD diagnosis and treatment",
        "publish_date": "Sat, 19 Jul 2025 20:35:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Zac Altman returned to Australia, he didn't expect that a frustrating journey trying to get rediagnosed with ADHD would propel him to start a business seeking to address the flaws of the system.\n\n\n\n\n\nAltman is the founder of Kantoko, a telehealth platform that offers ADHD assessment and care under a subscription model. After being diagnosed with ADHD while living in the United States, he returned home — and found he needed to start his diagnosis journey from scratch.\n\n\n\n\n\n\"I was already diagnosed, already on the medication, had the documentation. I thought it was going to be pretty straightforward. And for me, it was a challenge,\" he told SBS News.\n\n\n\n\n\n\"I don't think I ever would've made it through the process if I were starting in Australia from the get-go because of the massive hurdles and burdens required with getting through the process.\"\n\n\n\n\n\nAltman's struggles reflect a broader issue when it comes to the diagnosis and treatment of ADHD in Australia: despite rising awareness and demand, the system is still playing catch-up — and some states are lagging behind.\n\n\n\nZac Altman says he would never have founded his ADHD telehealth business if he hadn't struggled with the diagnosis process himself. Source: Supplied\n\nA postcode lottery\n\nAll states and territories have different laws governing how stimulant medications — commonly prescribed to treat ADHD — can be prescribed and dispensed.\n\n\n\n\n\nIn some places, the process is more streamlined. In others, patients face stricter regulatory barriers — often accompanied by longer wait times and higher costs.\n\n\n\n\n\nDr Roger Paterson, a psychiatrist based in Western Australia, said there was \"always a postcode privilege for all levels of healthcare\".\n\n\n\n\n\n\"ADHD treatment is no different,\" he told SBS News.\n\n\n\n\n\nHe said ADHD diagnosis and treatment rates have surged in Australia — but not uniformly.\n\n\n\n\n\n\"We're still below the prevalence rates … but some states and territories have caught up quicker than others.\" Paterson told SBS News.\n\n\n\n\n\nPatterson said South Australia, Tasmania, Victoria and the Northern Territory remain the slowest to catch up, while Western Australia — which once lagged behind — has now reached similar levels to Queensland.\n\n\n\n\n\n\"No-one really knows why [some states lag], beyond the NT not having many specialists — paediatricians or psychiatrists. But they are all gradually catching up to the ADHD prevalence rates.\"\n\n\n\n\n\nPrevalence refers to the proportion of a population that is affected by ADHD.\n\n\n\n\n\nWhile there are no Australian adult prevalence studies of ADHD using the current DSM-5 diagnostic criteria, some studies have indicated the prevalence of ADHD in Australia is likely to be similar to that found internationally — between 2 and 6 per cent of the population, according to the Australasian ADHD Professionals Association.\n\n\n\nRates of prescribing vary across states and territories, reflecting the different jurisdictional laws about stimulant prescribing. Source: SBS News Additionally, the federal government's Drug Utilisation Sub Committee September 2023 report found differences in the rates of prescribing across states and territories, which the report says reflects different laws across jurisdictions.\n\n\n\n\n\nAdult rates of prescribing were significantly higher in Western Australia and the ACT compared to the other states and the Northern Territory.\n\n\n\n\n\nThe federal Senate inquiry into ADHD, handed down in November 2023, examined the barriers to consistent, timely and best-practice assessment of ADHD.\n\n\n\n\n\nIt heard those living in regional and rural areas were subject to even more barriers to care, with reduced access to specialists, longer wait times and higher costs.\n\n\n\n\n\nAltman said the differences were most pronounced in Kantoko clients moving interstate who had to navigate different jurisdictional regulations, sometimes requiring them to find an entirely new specialist.\n\n\n\n\n\n\"It seems somewhat unreasonable to expect every psychiatrist to know every quirk across the country ... which is why I would argue we should have some sort of national standard around this stuff,\" he said.\n\n\n\nA patchwork system with no national rules\n\nAltman said going through the assessment process in Australia can feel like \"a roll of the dice\" due to a lack of national rules.\n\n\n\n\n\nHe said he paid about $1,500 out of pocket to be rediagnosed in his first year back in Australia — including an upfront $1,000 fee to secure a psychiatrist appointment in NSW. He said he was fortunate to have leftover medication from the US to tide him over in the months he waited, but he knows others aren't so lucky.\n\n\n\n\n\n\"It's the luck of the draw,\" he said.\n\n\n\n\n\nThe inquiry heard that of those who did have positive experiences of ADHD assessment and diagnosis, \"many attributed their experience to luck\" or to doctors and psychiatrists who helped them access services.\n\n\n\nThere is no national framework for ADHD, despite it being a key recommendation in the inquiry.\n\n\n\n\n\nThe inquiry heard wait times were found to be \"significant\", typically between six and 18 months for an initial appointment, while the Australian Association of Psychologists Inc said the number of mental health professionals has not kept up with the demand for services.\n\n\n\n\n\nThe public system rarely treats the condition except in children, pushing adults seeking a diagnosis to the private sector. As specialists set their own fees with no cap, people can be subject to high fees.\n\n\n\n\n\nThe ADHD Foundation said it had observed some professionals charge up to $5,000 for assessments.\n\n\n\n'Kantoko wouldn't exist if Australia nailed it'\n\nIn response, ADHD telehealth services like Kantoko have cropped up. Operating completely online, these clinics promise shorter wait times — but sometimes at a greater cost.\n\n\n\n\n\nKantoko operates under a subscription model. Medicare does not cover any fees.\n\n\n\n\n\nIn exchange, patients are promised an ADHD assessment by a qualified psychiatrist, follow-up appointments with mental health doctors and prescription renewals.\n\n\n\n\n\n\"Kantoko wouldn't exist if Australia had nailed it,\" Altman said. \"I wouldn't have gotten so frustrated that I started this business and embarked on this journey if it were easy-to-access and affordable.\"\n\n\n\nREAD MORE Autism and ADHD frequently overlap. People living with both can feel misunderstood\n\nBut the Senate inquiry heard concerns about the growing telehealth service model, saying that while it was helpful for those in regional areas, it has also driven up risks associated with \"inadequate assessment and misdiagnosis\", according to the Australian College of Mental Health Nurses.\n\n\n\n\n\nThe Canberra and Queanbeyan ADHD Support Group, a volunteer-run local group, said the clinics offered \"exceedingly high fees delivering a quick turnaround\" with concerns of \"price gouging\".\n\n\n\nThe GP debate: solving shortages or lowering the bar?\n\nAs the system plays catch-up, a key recommendation from the inquiry was the development of uniform and nationally consistent ADHD prescribing rules — the only recommendation of the 15 that the government accepted in full.\n\n\n\n\n\nBut the government said the establishment of prescribing arrangements, including increased GP involvement, was a matter for state and territory governments.\n\n\n\n\n\nNSW, ACT, SA and WA have committed to reforms that will allow specially trained GPs to prescribe ADHD medication independently from 2025 and 2026.\n\n\n\n\n\nThey'll join jurisdictions like Queensland, where GPs have been able to prescribe certain ADHD medications for children without prior approval since 2017.\n\n\n\n\n\nWhile some say it could ease bottlenecks and encourage holistic care, others warn it risks lowering the standards of care.\n\n\n\nPaterson said the current model is for specialists to handle diagnosis and stabilisation, before shifting to a shared care arrangement with GPs — known as co-prescribing. He's sceptical of political moves to shift ADHD treatment onto GPs in an effort to play catch-up.\n\n\n\n\n\n\"Some GPs have pushed for taking on initial, independent assessment and prescribing, and politicians push this along as a popular way of reducing waiting lists,\" Paterson said.\n\n\n\n\n\n\"This creates a tension between reducing waitlists with more GP involvement on the one hand, but on the other hand, accepting that GP ADHD management may not have the nuance of specialist management.\"\n\n\n\nThere are concerns that relaxing GP restrictions could open the door to so-called 'dexy clinics' — where stimulant medications such as dexamphetamines might be handed out too freely, similar to concerns seen with medicinal cannabis.\n\n\n\n\n\n\"There would be less concern about lower GP numbers who are highly trained, and more concern about higher GP numbers who are less trained,\" Paterson said. \"The worst case scenario is that stimulant medication becomes as accessible as cannabis from the medicinal cannabis clinics.\"\n\n\n\n\n\nBut Dr Alison Poulton, a senior lecturer in paediatrics at The University of Sydney and member of ADHD Australia's advisory board, pushed back against 'dexy clinic' fears, saying that ongoing relationships between GPs and patients would reduce risk and encourage more holistic care.\n\n\n\n\n\nShe criticised current restrictions requiring specialist endorsement and fixed dosage limits, arguing they undermine both patient autonomy and the ability of GPs to tailor care.\n\n\n\n\"It makes complete nonsense of patient autonomy,\" she said. \"Decisions should be made between the GP and patient, not based on a letter written five years ago.\"\n\n\n\n\n\nPoulton emphasised that GPs, who often have a long-term understanding of their patients, are well placed to make prescribing decisions that reflect changing needs, leading to better functional outcomes.\n\n\n\n\n\n\"I think the GPs are going to do a much better job if they know it's up to them to make these prescribing decisions rather than to have to consult the specialist.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/labors-vote-tanks-in-the-tasmanian-state-election-that-nobody-really-wanted/4iwdcu5lx",
        "title": "Labor's vote tanks in the Tasmanian state election that 'nobody really wanted'",
        "publish_date": "Sat, 19 Jul 2025 12:02:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAt polling booths across Tasmania, the obligatory democracy sausage was selling like hotcakes as voters cast their ballots in the state election.\n\n\n\n\n\nBut you could be forgiven for thinking voters have been keener on the snags than the election itself.\n\n\n\n\n\nAnd that includes the Tasmanian Premier.\n\n\n\n\n\n\"I did not want an election. I know Tasmanians did not want an election - but Dean Winter caused this election with his desperation and his immaturity.\"\n\n\n\n\n\nSaturday's poll was the second in 16 months for the state, and the fourth in seven years, called after the minority Liberal Premier Jeremy Rockliff lost a parliamentary no-confidence motion in June.\n\n\n\n\n\nPerhaps keen to get it out of the way, more than 100,000 people voted early - about a quarter of Tasmania's 412,000 enrolled voters.\n\n\n\n\n\nLabor leader Dean Winter though has maintained the Premier brought the election on himself.\n\n\n\n\n\n\"The person who drove to Government House to call an election was Jeremy Rockliff. The person who caused this election was Jeremy Rockliff. He stubbornly refused to resign when the parliament didn't have confidence in him.\"\n\n\n\n\n\nThe potential AFL stadium appears to have loomed large as an issue with voters.\n\n\n\n\n\nThe proposal for the $945 million waterfront venue in Hobart has been opposed by parts of the community, the Greens, several crossbenchers - and Nationals senator Bridget McKenzie.\n\n\n\n\n\n\"I love AFL, Tasmania loves AFL, but it shouldn't come at the cost of future generations of Tasmanians. So there needs to be a pathway through that doesn't mean Macquarie Point stadium.\"\n\n\n\n\n\nStill, both major parties have supported the idea, and some Tasmanians have also been keen.\n\n\n\n\n\nMAN: \"Very important. No, it'll be great for everything, the economy, the kids, the footy. Yeah, it'll be good.\"\n\n\n\nWOMAN: \"It will completely help Tasmania. We need it, our economy needs it, and it's great for the kids.\"\n\n\n\nWOMAN: \"Because we need one in Tassie.\"\n\n\n\nMAN: \"And the economic benefits.\"\n\n\n\nDISTANT VOICE: \"We need jobs.\"\n\n\n\n\n\nThere have been other concerns too, besides the budget and cost of living pressures - from multicultural communities like the Nepalese diaspora worried about a spate of harassment and vandalism incidents.\n\n\n\n\n\nDr Santosh Adhikari is the Regional (North) Lead for the Children’s University Tasmania, and the founding president of the Nepali Society of Northern Tasmania (NSNT).\n\n\n\n\n\nHe has told SBS Nepali many have wondered about the response of authorities to these incidents in such a volatile political climate.\n\n\n\n\n\n\"It's definitely been affecting the community to grow in any place, like when the government is not stable. For example, it takes a long time to make relationships with the politicians and the policymakers. So if the government changes so frequently it is hard to build a relationship and advocate on behalf of the community to the politicians.\"\n\n\n\n\n\nThe appetite for political calm though is unlikely to be satisfied after this election.\n\n\n\n\n\nAll opinion polls before the polls opened pointed to neither the Liberals nor Labor boosting their support enough to reach the 18-seat mark required for majority government.\n\n\n\n\n\nThe Liberals held 14 seats, Labor 10, while the Greens held five and the remaining six were either independents or other parties.\n\n\n\n\n\nSo far the Liberals have defied expectations.\n\n\n\n\n\nEssentially, that means the government is on track to keep all of their existing seats and perhaps pick up more while Labor could struggle to retain all of theirs.\n\n\n\n\n\nBut the Labor leader has suggested they would try to govern in minority even if they finish with fewer seats than the Liberals.\n\n\n\n\n\nOne of those Liberal seats has been claimed by former Coalition MP Bridget Archer, who lost her federal electorate seat in the last federal election.\n\n\n\n\n\nIn Canberra, Ms Archer garnered attention for crossing the floor to vote against her own party several times - something she has already flagged she was keen on continuing in state politics.\n\n\n\n\n\n\"I'm not going to be anybody's stooge or anybody's puppet.\"\n\n\n\n\n\nJeremy Rockliff has also drawn a line in the sand.\n\n\n\n\n\nHe has indicated he will not do any deals with the Greens to govern.\n\n\n\n\n\n\"We cannot risk going back to the dark old days of a Labor Green government.\"\n\n\n\n\n\nAn official result may be weeks away because of postal votes still to arrive, but counting suggests the incumbent government's vote has risen and Labor's has collapsed.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/strong-demand-from-tuvalu-for-australian-residency-as-visa-lottery-closes/b9jbdn5wc",
        "title": "Strong demand from Tuvalu for Australian residency as visa lottery closes",
        "publish_date": "Sat, 19 Jul 2025 02:24:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nThe Neemia family moved to Queensland 25 years ago.\n\n\n\n\n\nTupa and Lailega have raised their family in Brisbane, but Lailega says Tuvalu will always feel like home.\n\n\n\n\n\n\"It's too beautiful. It's a good place to retire and what you heard from my husband, it's stress free, no time for anything, very relaxed lifestyle over there.\"\n\n\n\n\n\nLaleiga's husband Tupa shares the same dream.\n\n\n\n\n\n\"The plan was to come and work, when the kids grow up, we'd retire in Tuvalu. But yeah, hopefully it's still there when we retire.\"\n\n\n\n\n\nThe family is concerned about the future prospect of returning to Tuvalu because the tiny Pacific nation is being swallowed by rising oceans due to climate change.\n\n\n\n\n\nLast year, Australia and Tuvalu signed the Falepili Union - a landmark climate and security pact.\n\n\n\n\n\n\"This is a groundbreaking agreement.\"\n\n\n\n\n\nIt's opened a visa pathway to Australia for people like Laliega's family.\n\n\n\n\n\n\"I am very excited. I have four sisters in Tuvalu. I'm trying got get all of them over, I just feel I would love to have a sibling, a sister, closer with me here, next to me.\"\n\n\n\n\n\n280 Tuvalu citizens will be granted permanent residency each year as part of the landmark pact.\n\n\n\n\n\nJust over 5,100 [[5,157]] applications have now been made - more than half of the nation's estimated population - with the lottery having closed on the 18th of July.\n\n\n\n\n\nThat's half of Tuvalu's population.\n\n\n\n\n\nSome have speculated the entire population of the Pacific Island of Tuvalu could live in Australia within forty years if demand for a new visa lottery holds - but Pacific Minister Pat Conroy says unlike a lot of permanent resident visas, Tuvalans have a lot of freedom of movement back to Tuvalu.\n\n\n\n\n\n\"It is a world's first approach to a relationship between two countries. We're responding to a request from the Tuvaluan goverment for migration with dignity. And so we do envision that a fair number of Tuvalans will come to Australia out of a population of around 11,000.\"\n\n\n\n\n\nTuvalu says it's keen for its citizens to have a home to come back to.\n\n\n\n\n\nThis year, Labor approved a 50 year extension of the North West Shelf gas project which will emit 90 million tonnes of carbon dioxide per year.\n\n\n\n\n\nBut Tuvalu's Climate Minister Maina Vakafua Talia has been among those asking the federal government to do more to curb emissions .\n\n\n\n\n\n\"Opening and subsidising and exporting fossil fuels is immoral and unacceptable.\"\n\n\n\n\n\nPat Conroy says Australia remains a conscientious neighbour, mindful of climate change.\n\n\n\n\n\nThe government says there are also other considerations.\n\n\n\n\n\nSara: \"How do you explain that to Pacific leaders?\"\n\n\n\nConroy: \"Well I think that instance is an example of how we do diplomacy. We seek to partner not gag, which is not a claim every other country can make.\"\n\n\n\n\n\nThat's a not so subtle reference to China, which also offers aid, infrastructure and security partnerships.\n\n\n\n\n\nMigration pathways are seen as one area where Beijing can't compete - as Ryan Edwards from the ANU Development Policy Centre says.\n\n\n\n\n\n\"Australia is just a remarkably more attractive place to live. We already do have the historical ties, we've got a vibrant diaspora, a small one - but we do have that community here. It's just very different. And so it makes a lot of sense for them to use that as the avenue for strengthening realtionships and engagement.\"\n\n\n\n\n\nGreater labour mobility is something Pacific leaders have long called for.\n\n\n\n\n\nThe government has responded with a Pacific Engagement Visa, which also offers permanent residency.\n\n\n\n\n\n\"I'm really focused on making sure those first three thousand settle visa grantees have the best possible experience of coming to Australia, and then we'll just see where the numbers go but at the moment our policy is 3,000 places a year.\"\n\n\n\n\n\nBut the transition can be difficult - as Laleiga well knows.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/exclusive-brittany-snow-confirms-truth-about-rebel-wilson-20250721-p5mgkt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Exclusive: Brittany Snow confirms truth about Rebel Wilson",
        "publish_date": "Mon, 21 Jul 2025 12:17:14 +1000",
        "category": "finance",
        "authors": [],
        "text": "Exclusive: Brittany Snow confirms truth about Rebel Wilson\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/the-home-grown-threat-to-china-that-has-rattled-xi-jinping-20250721-p5mghd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The home-grown threat to China that has rattled Xi Jinping",
        "publish_date": "Mon, 21 Jul 2025 11:58:29 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The problem in EVs, solar panels, batteries and other industries that supply them – and it’s not a problem confined to those sectors – is that China’s economic model has prioritised investment, production and jobs. Beijing has identified strategic areas of growth in its rolling five-year national economic plans and handed out massive financial subsidies to those sectors to stimulate investment. BYD, the world’s biggest EV maker, slashed domestic prices by up to 34 per cent earlier this year, triggering a price war. Credit: Bloomberg Local governments, anxious to get their share of investment and jobs, then offer their own incentives and help fuel a rush by companies to do what Beijing has encouraged them to do, leading to overinvestment and overcapacity. Exports are the safety valve for the excess capacity, particularly in the post-property crisis, post-pandemic environment, where domestic demand has been weak.\n\nFaced with pushback (even before Donald Trump started slapping tariffs on everyone) from export markets concerned that China was undermining their industries and persistent deflation within its own economy – from the US to countries in Europe and Latin America – it would appear that China has finally recognised the need to act. Loading A decade ago, China had similar overcapacity issues in its steel and coal sectors. Beijing responded by forcing plant closures and corporate consolidations, while avoiding economic shock by pumping fiscal stimulus into the economy. Unlike the current overinvestment, however, those sectors were largely state-owned. It will be trickier trying to corral the multitude of private companies engaged in the crowded advanced manufacturing sectors that Beijing has identified for China’s latest phase of growth. It will be even trickier in the face of Trump’s tariffs.\n\nWhile the US and China agreed to an uneasy truce after a tit-for-tat exchange of absurdly high tariffs – Trump announced a 145 per cent rate on imports from China and Beijing responded with a 125 per cent rate on imports from the US – the continuing 30 per cent US tariff on goods, once pre-existing tariffs (leftovers from the 2018-19 trade war) are taken into account, means China’s exports to the US still face a 55 per cent duty. China’s most recent trade numbers, for June, showed a record $US586 billion ($900 billion) surplus when they were published last week, or 5.8 per cent above the same month last year. Exports to the US, however, were 16.1 per cent lower than in June last year. It was exports to South-East Asia, Europe and Japan that accounted for the growth. Donald Trump’s trade war has complicated matters for Beijing. Credit: Bloomberg With Trump’s deal with Vietnam, including punitive tariffs on trans-shipped exports to the US – targeting Chinese goods re-routed through third countries to exploit lower duty rates – America’s “reciprocal” tariff regime poses a major threat to China’s ability to continue to rely on trade for growth. Last year, Beijing tried to stimulate domestic consumption with incentives for trade-ins of autos and household appliances and other goods.\n\nThat seems to have had some effects – China’s GDP grew 5.3 per cent in the June quarter, compared with the same period last year – but it’s a policy whose impact will inevitably wane, as the number of remaining households with the capacity to take advantage of it dwindles. In Trump’s new world trade order, there will be less global trade and less trade with China, which implies radical changes to China’s economic model. There are other, more sustainable, measures that Beijing could take to boost domestic consumption, particularly increased spending on China’s social welfare safety nets, but Xi has been reluctant to embark on large-scale stimulus spending or to re-balance the economy away from its over-reliance on exports. Having experiencing the implosion of China’s property sector, a sector that had been used and incentivised to stimulate the wider economy during periods of economic stress, the authorities would understand that the extent of overinvestment and overcapacity in other sectors today is a threat to China’s economic and social stability that could be exacerbated by a downturn in trade. The threat doesn’t come from Donald Trump alone. On Friday, the G7 economies agreed to increase their collective efforts to respond to the impact of China’s over-capacities and the flood of exports it is producing, along with its dominance of strategic sectors, including rare earths.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/investor-splashes-6-75m-for-sydney-harbour-pad-in-tightly-held-block-20250721-p5mgfl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Investor splashes $6.75m for Sydney harbour pad in tightly held block",
        "publish_date": "Mon, 21 Jul 2025 11:50:23 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A harbour front home at Circular Quay with direct views of the Sydney Harbour Bridge sold for $6.75 million at auction on Saturday.\n\nThe 141-square-metre, two-bedroom unit, located in the tightly held “Bennelong” building at 77/1 Macquarie Street, was guided at $6.5 million and came with its original bathroom and kitchen.\n\nSelling agent Ettiene West from Morton Circular Quay said the two active bidders were both investors based in the Sydney 2000 postcode.\n\nBidding opened at $6.3 million and rose in increments of $100,000 until $6.7 million, then a $50,000 bid secured it for $6.75 million.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/nick-cave-draws-a-crowd-but-the-queues-aren-t-to-listen-to-his-music-this-time-20250721-p5mge5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Nick Cave draws a crowd – but the queues aren’t to listen to his music this time",
        "publish_date": "Mon, 21 Jul 2025 11:49:58 +1000",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "London: Australian singer Nick Cave has surprised shoppers at a small store in England by giving them an insight into his creative life – not with his music, but with his books.\n\nThe singer has generated queues at an Oxfam bookshop at a seaside resort by donating 2000 books on topics including philosophy, religion and rock.\n\nNick Cave in a scene from the documentary 20,000 Days on Earth. Credit:\n\nThe first of his boxes was opened last week and drew a crowd of buyers when word reached the local media in Hove, near Brighton in south-east England.\n\n“I guess there were between 50 and 100 people queuing in the first couple of hours of the stock going out,” store manager Richard, who asked to be quoted without his surname, told this masthead.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/could-ai-change-league-forever-the-revolution-has-already-begun-20250719-p5mg4z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Could AI change rugby league? The revolution has already begun",
        "publish_date": "Mon, 21 Jul 2025 11:49:28 +1000",
        "category": "finance",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Pressed on specifics, Driussi was diplomatically vague: “We’re exploring multiple AI applications, but competitive advantage comes from execution, not just ideas. The technology helps us analyse information and identify patterns that might otherwise be missed.” What makes the Bulldogs’ AI adoption particularly intriguing is Driussi’s other role as CEO of Quantium, an Australian artificial intelligence and advanced analytics company. The firm works with major Australian companies, such as Woolworths, Commonwealth Bank, Telstra and Qantas. Bulldogs players are already benefiting from AI. Credit: Getty Images The connection provides the Bulldogs access to world-class AI expertise that would typically cost NRL clubs millions of dollars to develop themselves. While Driussi is careful not to discuss any formal arrangements, the potential for knowledge transfer is obvious. The “Family Club” previously revealed it used AI to identify Jacob Preston during his recruitment from the Roosters’ pathways system, suggesting the technology has been instrumental in some of their personnel decisions.\n\nAI’s influence on sport was one of the topics discussed at the NRL’s Business of Sport Conference in Las Vegas at the University of Nevada, just before this year’s season-opening matches at Allegiant Stadium. The headline speakers were Driussi and Paul Devlin, the latter the global strategy leader for betting, gaming and sports technology at Amazon Web Services. Devlin, who has held high-performance roles at the Brisbane Broncos, South Sydney, Parramatta and Melbourne Storm, said AI would transform the sporting landscape. AI is being used extensively in the NFL. Credit: AP “We see AI as absolutely revolutionary, and we think it will impact every area of business in the future,” Devlin says. “So everybody should be experimenting with it right now, so that was kind of the key message that came out of that NRL event ... AI is going to improve every area of business, but it is really clear on the insight generation from the data side of it in a sport like rugby league on talent identification, load monitoring, safety of the games through simulations, as well as the fan side of sport as well.”\n\nSeveral NRL clubs are already dabbling with AI. One leading head coach, speaking on the condition of anonymity to protect the club’s intellectual property, said that AI had the potential to help analysts wade through reams of data to come up with a couple of key takeaways when preparing for an opponent. “That’s where I see the next step in world sport, how AI can save you time in identifying those trends so you’re not wasting time doing it yourself,” the coach says. “The advantage you get is saving man-hours, so you actually spend less time on computers and more with the players. “You can see the information that’s relevant; missed tackles is the most outdated stat because there’s no context to it. And completion rates; seven of the top-10 completing teams didn’t make the finals last year.”\n\nHere’s a practical example of how AI is being used. One club found the best way to beat the Storm is to limit their time in possession. If you can restrict them to less than 23 minutes and 25 seconds with the football – they average 26 minutes and 36 seconds – you have an almost 100 per cent chance of winning. Not easy to do in reality, but it’s useful information. While most NRL teams focus heavily on pre-contact metres – the distance gained before first defensive contact – to build momentum, a different focus is required to beat Canberra. AI found the Raiders were uniquely driven by post-contact metres, those tough yards gained after contact. Limit those metres, and you can stop the Green Machine. AI has already identified at least one way to try to stop the Melbourne Storm. Credit: Getty Images Canterbury’s embracing of AI reflects a broader transformation sweeping through professional sport worldwide. American sports leagues are leading the charge, with the NFL processing more than 500 million data points per season through its Digital Athlete system, reducing player injuries by 700 missed games since 2023. Major League Baseball has implemented AI for pitching analysis and injury prevention, while the NBA uses machine learning for player load management and game strategy optimisation. English Premier League clubs are using AI for recruitment: Brighton’s system identified Moises Caicedo before his eventual £115 million ($240 million) transfer from them to Chelsea, while Liverpool’s partnership with Google DeepMind has produced tactical analysis tools that club experts prefer over traditional methods 90 per cent of the time.\n\nThe secrecy surrounding Canterbury’s AI implementation is understandable given the competitive implications; NRL clubs are notoriously protective of innovations that might provide advantages. The technological investment aligns with the Bulldogs’ recent restructure. The blue and whites are constructing a $50 million centre of excellence at Belmore and have significantly expanded their pathways programs, including taking over the Fiji Silktails program. Major League Baseball has implemented AI for pitching analysis. Credit: Getty Images “We’re building for long-term success,” Driussi says. “That means investing in the best people, the best facilities and the best technology available to us.” Bulldogs chief executive Aaron Warburton confirmed the club’s commitment to innovation.\n\n“We’re always looking at ways to improve our operations and give our players and staff the best possible tools to succeed,” Warburton says. “Technology is certainly part of that equation.” Loading The club’s return to finals football last year, after missing the post-season for eight seasons, has been attributed to improved recruitment, player development and coaching. However, the role of AI in this transformation remains largely hidden. Given the global AI sports market is tipped to grow from $1.2 billion to nearly $30 billion by 2032, getting in early could be the key to success. Already, rivals are playing catch-up to Canterbury. For a club that has endured wooden spoons and years of mediocrity, the Bulldogs are marrying old-school values with cutting-edge technology. Whether that translates to premiership glory remains to be seen, but the Bulldogs are betting heavily that the future of rugby league will be shaped by artificial intelligence.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/melbourne-couple-sell-home-at-auction-for-40-000-less-than-hoped-20250721-p5mgfn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne couple sell home at auction for $40,000 less than hoped",
        "publish_date": "Mon, 21 Jul 2025 11:47:38 +1000",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "An Ascot Vale couple cut their price hopes to sell a three-bedroom, corner-positioned apartment “with penthouse proportions” after auction this Saturday.\n\nJellis Craig Kensington selling agent Tom Donnelley said the home at 205/2 Mascona Street, guided at $900,000 to $990,000, had a reserve of $1 million. The auction had two registered bidders, but only one took part.\n\n“It was passed in on a genuine bid of $925,000,” said Donnelley, who added it sold for $960,000 after private negotiations. “The buyers are relocating from overseas to be closer to their kids,” he added.\n\nDonnelley said that the couple’s adult children were onsite for the auction, and had them on the phone throughout. “The vendors are looking for a lifestyle change and to be closer to their grandkids.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/dangerous-windies-batter-holes-out-in-the-deep-20250721-p5mgk9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dangerous Windies batter holes out in the deep",
        "publish_date": "Mon, 21 Jul 2025 11:42:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "Dangerous Windies batter holes out in the deep\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/motorsport/red-bull-sacks-christian-horner-20250710-p5mdv3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Red Bull sacks Christian Horner",
        "publish_date": "Mon, 21 Jul 2025 11:42:16 +1000",
        "category": "finance",
        "authors": [],
        "text": "Red Bull sacks Christian Horner\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/boxing/when-it-comes-to-selling-the-tszyu-dream-it-s-no-m-s-20250721-p5mgfq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "When it comes to selling the Tszyu dream, it’s ‘No más’",
        "publish_date": "Mon, 21 Jul 2025 11:40:56 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "“I’m just about getting in there and finishing to the very end. If it means you’re going to get knocked out, it means you’re going to get knocked out. You try to get back up, get back up, get back up.\n\n“Sometimes that’s a problem, sometimes for my corner to say ‘stop the fight’, that was never part of what I’m about.\n\n“When I come into the ring, I come in with the mentality I’m going to die in the ring,” Tszyu said.\n\nTwo days before his rematch with Sebastian Fundora, Tim Tszyu spoke about the lengths he would go to win.\n\n“For me, if my corner stopped [the first Fundora fight], I would have had the shits with them, I would have had the shits with life. The fact that I could have lived my life without knowing my full potential. So that answers the question of why the corner didn’t stop it.”\n\nIn the rematch with Fundora, according to one version of events pedalled in the aftermath, Tszyu’s corner stopped the fight.\n\nThe decision left Tszyu, moments after landing his most telling blows in the seventh round, done on his stool. In a world title fight. Just days after declaring he was willing to die in the ring. Didn’t those comments age badly?\n\nWe will never know if Tszyu, had he continued, was capable of finding something within himself to change the result of the fight. Was there something stirring in his soul, perhaps a right hand like the one father Kostya produced to famously floor Zab Judah in the very same arena, that would cement his own legend? That’s what Tszyu, like the rest of us, will die wondering.\n\nThe line between being brave and too brave for your own good is a fine one. You only have to think back to the “Battle of Brisbane” back in 2017, between Jeff Horn and Manny Pacquiao.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-perth-grandmother-donna-nelson-to-appeal-japanese-drug-smuggling-conviction-20250721-p5mgfd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Perth grandmother Donna Nelson to appeal Japanese drug smuggling conviction",
        "publish_date": "Mon, 21 Jul 2025 11:38:38 +1000",
        "category": "sports",
        "authors": [],
        "text": "The Dockers have boosted their finals prospects with a thrilling one-point victory over Collingwood yesterday, but it came at a cost, with Matthew Johnson limping from the ground in the fourth quarter after rolling his ankle awkwardly during a marking contest.\n\nThe midfielder arrived back in Perth last night on crutches with a moonboot on his lower left leg.\n\nFremantle Docker Matthew Johnson at Perth Airport on Sunday night. Credit: 9 News Perth\n\nFremantle coach Justin Longmuir said the 22-year-old was sore following the injury.\n\n“He felt a crack so he’s on crutches. [It’s] not a good sign, but we don’t want to go too early with it,” he said.\n\n“A crunching sound can mean a bit, it can mean a break, or it can mean just to give that ankle a real wrench, so it’s not looking great for him.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/inside-the-chinatown-museum-that-after-four-years-and-millions-of-dollars-never-opened-20250417-p5lsjs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inside the Chinatown museum that after four years and millions of dollars never opened",
        "publish_date": "Mon, 21 Jul 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jessica Yun"
        ],
        "text": "But as the institution enters its fourth year of a five-year lease with little progress made, impatience is brewing in some parts of the Chinatown community over the extensive delays. So why hasn’t the Museum of Chinese in Australia opened yet? History in the making Sydney’s Chinatown is one of Australia’s best-known and most frequented, with roots tracing back to the 1870s, when Chinese migrants shifted their fruit and vegetable trading from the Rocks to settle around Haymarket. Chinese people began arriving in Australia as part of the massive migration wave during the gold rush of the 1850s. During the 1900s, they spread into other trades and services, finding prosperity in fruit and vegetable trading, shopkeeping, tobacco farming and clothes laundering. The end of the White Australia policy in 1973 brought another wave of migrants.\n\nBut unlike Melbourne and regional cities such as Bendigo (which established its Golden Dragon Museum in 1991) and Ararat (which opened its Gum San Chinese Heritage Centre in 2001), Sydney has fallen behind in establishing its own museum to showcase the contributions of Chinese Australians. That looked to finally change in mid-2020. As the pandemic set in, Lord Mayor Clover Moore announced the council would lease the property to the Museum of Chinese in Australia. It would feature a gallery and exhibition space, programming activities, community spaces for events, an artist-in-residence program, and a cafe and shop. It is chaired by 82-year-old Daphne Lowe Kelly, who has spent most of her career serving Chinese-Australian organisations, and was presided over by Dr John Yu, a Chinese-born Australian paediatrician and 1996 Australian of the Year. But neither the council nor the museum’s leadership anticipated the challenges of establishing a new gallery in a heritage-listed 19th-century building. While the site has given the museum a spiritual and physical home, with rent subsidised by the council, the lease agreement contains pages of added requirements, heritage restrictions and red tape. “This is an amazing gift,” new MOCA chief executive Peter Cai said of the building. “And it came with a lot of conditions, and some conditions are not easy to address. There are a lot of costs to remedy.”\n\nThe initial renovation proposal, overseen by Tony Stephens, the previous chief executive who departed the organisation in January, came to roughly $4.7 million, said Kelly, who estimates the true cost would have been closer to $6 million or $7 million after factoring in contingencies and other unanticipated expenses. Figures from the Australian Charities and Not-for-profits Commission (ACNC) show revenue from donations and bequests came to $1,766,821 in the four years between fiscal 2021 and 2024. This figure doesn’t include rent subsidies from the City of Sydney’s accommodation grant program, $2.28 million from Create NSW given in 2022, or two grants from the National Foundation for Australia-China Relations that exceeded $400,000. In the absence of local donations, lobbying government has been crucial. “It was almost impossible trying to raise any funds during COVID,” Kelly said. ‘People are now questioning many things’\n\nA number of departures on the museum’s board has added to perceptions of volatility. Only three inaugural board members remain: Kelly, Joanna Capon and Yin Cao. Dr John Yu, Stephen FitzGerald and Su-Ming Wong have departed the board. Since then, a number of others have come and gone. Loading One former director, speaking anonymously to discuss confidential matters freely, said board members had at times disagreed on the best approach to raising money. “It’s become a fundraising issue. They need a certain amount of money to open. They haven’t been able to achieve that yet,” they said. Despite being volunteers for the charity, the former board member described the work as a “full-time job”.\n\n“It was very intense,” they said. “I found myself spending a lot of time on the wrong things. “While I’ve stepped off the board, I’m still a big supporter and would love to see it open.” An active representative of the Chinatown community, who declined to be named, said the museum had lost a lot of the goodwill it initially had. “Because it’s been years, people are losing interest or faith,” they said. “People are now questioning many things; where has [the money] gone, how has it been spent?” The same Chinatown community representative feels the museum has had little to show. “If you can’t fix the building with the money you have, what are you delivering in the meantime?” they asked. “They’re not engaging in the community at all.” Kelly is aware of the critiques. “They don’t really know what goes behind the scenes, what has to be actually done, and how difficult it is to achieve a lot of what it takes to actually get it open,” she said.\n\nPutting on a show Plans are now being redrawn for a “reduced scope” refurbishment. Even then, Kelly estimates opening will cost $3 million to $4 million. “That’s still a lot of money,” she said. “You’ve got to remember, we also need to have funds for the programs and operational costs.” The race is on to pull the various pieces together for a soft launch. On top of refurbishment plans to be redrawn, costed and commenced, an exhibition director (historian and Chinese art and photography curator Shuxia Chen) has been drafted to conceptualise the museum’s first exhibition, which will focus on local stories about Haymarket habitants that have been there for generations, such as the Lam family of Asian grocer Dong Nam A, or the Pang family, which ran a Chinese restaurant in Haymarket for nearly three decades and have donated large sums to the museum. “We must put on a good show for people,” Cai said. Decisions need to be made about the exhibition’s budget. “You’re talking about special lighting, casings, you have to hire expert consultants to put it all together. It’s not as easy as hanging something on a wall.” Meanwhile, Kelly is hustling for donations, having visited Canberra to lobby Wong and Plibersek, and sharing bank details in community newsletters. “I’ve been lobbied about this so much,” Wong said at the April event.\n\nThe museum has secured its tenancy for another decade, which Kelly hopes will help to encourage donations after hearing feedback that some felt reluctant to donate money for a building that belongs to the council. “A refit is not as sexy to the philanthropic community,” said another former board member, speaking on the condition of anonymity. “We spoke to a lot of other Chinese museums around the world ... The Chinese Canadian Museum took eight years to get running from conceptualisation to open doors. It just takes a little while.” Cai is excited to showcase the many contributions of Chinese Australians over the decades and is at pains to convey the “complicated nature” of the project to supporters, whom he said had been generous and full of goodwill. “I can empathise with some of our supporters who just want to see the building open soon,” he said. “I want as much as I can to speed things up.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/coldplay-frontman-s-warning-to-fans-after-kiss-cam-controversy-20250721-p5mggy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Coldplay frontman’s warning to fans after ‘kiss cam’ controversy",
        "publish_date": "Mon, 21 Jul 2025 11:29:00 +1000",
        "category": "entertainment",
        "authors": [
            "Chris Hook"
        ],
        "text": "Coldplay frontman Chris Martin has delivered a cheeky warning to fans they may appear on the big screen during the British band’s latest US concert at the weekend – just days after “kiss cam” video from an earlier show went viral because of the reaction of the pair caught on camera.\n\nThe Jumbotron Song footage was captured at Coldplay’s concert during their Music of the Spheres world tour in Foxborough, Massachusetts, on Wednesday evening (Thursday morning AEST), and appeared to show Astronomer CEO Andy Byron and his chief people officer Kristin Cabot cuddling.\n\nRealising they were on the big screen, Byron appeared to duck away while Cabot hid her face behind her hands and turned away from the camera.\n\n“Oh, look at these two ... Either they’re having an affair or they’re very shy,” Martin said, as laughter rang out across the stadium.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-ladder-lies-these-are-the-true-indicators-of-finals-form-20250720-p5mgbr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The ladder lies. These are the true indicators of finals form",
        "publish_date": "Mon, 21 Jul 2025 11:28:38 +1000",
        "category": "sports",
        "authors": [],
        "text": "Speaking of depth, keep an eye on Hawthorn. It was exciting to see the return of Mitch Lewis against Port Adelaide, with Changkuoth Jiath, Jack Scrimshaw, Max Ramsden and Luke Breust all lining up in the VFL. Josh Weddle and Will Day are also edging closer to return, while Mabior Chol was rested with soreness. That kind of internal pressure drives standards. It’s clear Sam Mitchell is still figuring out his best 22, and no one is safe. That uncertainty is keeping the Hawks hungry. Defensive identity Finals footy is brutal: contested, chaotic, and relentless. The best teams know now is the time to tighten up defensively – and test their systems under pressure. Collingwood and Adelaide are elite at restricting scores, both from stoppage and turnover. It starts up the ground – forwards and mids swarm, forcing rushed entries. Defenders win one-on-ones, set up behind the ball, and squeeze territory. It’s connected, high-IQ footy. Meanwhile, the Bulldogs should be on high alert. Now sitting one game behind eighth-placed Gold Coast, they’ve conceded more points than any other team in the top nine, despite boasting the league’s highest-scoring attack. Their offensive firepower is clear, but it’s defence that wins premierships.\n\nRight now, they’re losing over half of their one-on-one contests in defensive 50, a clear sign the ball is coming in too hot and too often. That’s not sustainable come finals, when games tighten up and scoring dries up. You can patch defensive issues in-season, but pressure always finds cracks. Over the next few weeks you’ll see teams are also rehearsing their game modes – the tactical switches that control momentum. Think tempo shifts, kick-mark, boundary plays, skinny-side set-ups, or throwing a forward behind the ball late. It all gets tested now so that, hopefully, it will be second nature when it counts. The Bulldogs score heavily but need to tighten their defence. Credit: AFL Photos Chris Scott keeps evolving Geelong’s gears. One week they have 165 marks in a slow build-up game. The next, they play direct and daring. Their ability to adjust to the opposition makes them dangerous, but the round 18 loss to GWS showed they’re not quite humming yet. Expect more tinkering in the weeks ahead. The best teams know these tactical shifts must come from their on-field leaders, not coaches. That’s what separates the serious contenders from the pack.\n\nDress rehearsals Much has been made of Geelong’s soft run home, but is it really the advantage it’s made out to be? A soft draw doesn’t always prepare a team well for finals. If anything, it can rob them of the chance to become battle-hardened. The expectation is to win, and win well – and that kind of pressure can be deceptive. It might improve your ladder position, but it doesn’t forge the grit needed in September. But for a team like GWS, simply trying to consolidate its position, a softer fixture is gold. Their win over Geelong in round 18 kept their season alive. Every winnable game builds momentum, and momentum builds belief. Is Geelong’s soft run home really an advantage? Credit: Getty Images Friday night’s clash between Brisbane and the Bulldogs was massive – and so was the finish to Collingwood’s loss to Fremantle. These were finals dress rehearsals: high-pressure, contested, and played with high stakes. Games like these expose flaws and test systems. A statement win sends shockwaves – and that’s exactly what Fremantle and Adelaide delivered, laying down the law against fellow top-eight contenders.\n\nLoading Gold Coast did it in round 18. They brought fierce, forward-half pressure that unsettled Collingwood – and it worked. That was no fluke. They played with the intensity needed in big moments. And it told the rest of the comp: “we’re not just here to compete”. Still, they stumbled against Adelaide on Sunday – a reminder of just how hard it is to back up finals-like footy week in, week out. Brisbane play four of the final top eight teams in the next five weeks. Their fixture is brutal – Suns, Pies, Freo and the Hawks. It will either forge them or fry them. The same goes for the Hawks, who have Adelaide, Collingwood and the Lions. You can’t simulate finals intensity on the training track. You can’t smash your teammates three weeks out from finals. You need real-game exposure. If you don’t get it? The first final hits like a truck.\n\nA constant fight Every game for the top nine has the power to reshape both the top four and the eight. Even Sydney, sitting 10th, are applying pressure. And don’t be fooled – the ladder can hide as much as it reveals. Take Gold Coast. They’ve played one fewer game, with a catch-up match still to come against the wounded Bombers. That gives them more flexibility than a glance at the ladder shows. For everyone else, it’s survival mode. No luxury of load management. No room for slip-ups. The Suns have a game in hand on the rest of the contenders. Credit: AFL Photos Teams either win the games they should, or stack pressure on themselves into the next week. The Bulldogs felt that after their loss to Adelaide, and now it’s compounded after falling to the Lions.\n\nHawthorn would’ve felt it, too, after slipping up against Freo. They responded with a strong win over Port. Who knows, that final spot could be decided in round 24, with a cluster of mini elimination finals. At this stage of the season, every miss carries consequences. There’s no room left to stumble. But there’s a cost to playing high-pressure footy for five straight weeks just to scrape in. What’s left in the tank when you finally get there? That’s the risk. These teams aren’t just fighting to simply make the finals – they’re fighting to arrive in one piece. Whether their energy holds or burns out could decide their whole finals series. Crunch time\n\nLoading This is the stretch that separates the good from the great. Having been part of three premiership campaigns, I know this is when leaders matter most. Margins shrink. Stakes rise. And while there’s still time to tweak and improve, the best teams are already asking: Where are the cracks, and how do we fix them? What are our strengths – and how do we harness them? Yes, luck always plays a part. But ladder position matters. Finishing high saves energy in September – home finals, the finals draw you land – these things shape your path. And they can be the difference on the final day.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/jetstar-drops-130-asia-flights-001633912.html",
        "title": "Jetstar drops $130 Japan flights in new sale",
        "publish_date": "2025-07-21T01:55:29Z",
        "category": "finance",
        "authors": [
            "Alexandra Feiam"
        ],
        "text": "Travellers can pick up a flight to Tokyo from as little as $130. Picture: NewsWire / Luis Enrique Ascui\n\nJetstar has announced a massive sale to South Korea and Japan, with prices for one-way flights to the travel hotspots starting at just $130.\n\nStarting from noon for Club Jetstar members and midnight for the public, travellers can catch a one-way flight to Tokyo, Osaka and Seoul for a much-needed getaway.\n\nResidents in Cairns can catch a one-way flight to Tokyo (Narita) or Osaka (Kansai) from $130, with flights from Brisbane to Osaka or Seoul (Incheon) starting at $155.\n\nTravellers can pick up a flight to Tokyo from as little as $130. Picture: NewsWire / Luis Enrique Ascui\n\nFurther south on the east coast, travellers can catch a direct one-way flight from Sydney to Osaka from $165 and Seoul from $170 or from Sydney to Tokyo via Cairns for $253.\n\nADVERTISEMENT\n\nTravel dates vary per route but include flights from October 2025 to May 2026.\n\nThe flights will depart from October to May. Picture: NewsWire / Andrew Henshaw\n\nPeople can sign up to be a Jetstar Club member for $65.\n\nJetstar’s sale ends at 11.59pm AEST on Thursday, July 24 unless sold out prior. Sale prices do not include checked baggage.",
        "source": "Yahoo"
    }
]