[
  {
    "url": "https://www.9news.com.au/national/most-affordable-innercity-suburbs-for-first-time-buyers/0a9444b9-5f74-4a2e-8ecb-c5edf86d5918",
    "title": "The cheapest inner-city suburbs to get onto the property ladder",
    "publish_date": "Sun, 18 May 2025 00:54:16 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "A new snapshot of Australia's property market reveals what it now costs to get in at entry level near our biggest cities.\n\nExclusive data from analysts at Cotality has revealed the suburbs within 10 kilometres of the major cities with the lowest entry-level prices - that is, the 25th percentile of values in the suburb.\n\nIn Sydney, the most affordable inner-city suburb to buy a house was Zetland, south of the CBD.\n\nREAD MORE: The new Australia Post scam you have to be aware of\n\nThere, the 25th percentile value was $1.4 million - almost $350,000 cheaper than the median house in the same suburb.\n\nThe cheapest entry-level suburb for units was Ultimo, with Canterbury and Chippendale rounding out the top three.\n\nIn Melbourne, the entry-level price of a house in Maidstone was the lowest, sitting at around $768,000.\n\nThe lowest entry-level price for a Melbourne apartment was found in Carlton, with the 25th percentile of values at $290,000.\n\nMillner in Darwin was among the lowest price for an entry-level unit. (City of Darwin)\n\nRocklea ($673,000), Chermside (828,000) and Keperra ($914,000) had the most affordable entry-level houses in Brisbane.\n\nFor units, Spring Hill and Fortitude Valley had the lowest entry-level prices at $462,000 and $485,000 respectively.\n\nMeanwhile, down in Adelaide, the most affordable suburb for entry-level houses was Lightsview ($700,000).\n\nAdelaide's most affordable inner-city suburb for apartments was Kurralta Park, with entry-level prices sitting around $431,000.\n\nAn entry-level home in Nollamara, Perth, could run you as little as $627,000, while the 25th percentile cost of a unit in Wembley was just $405,000.\n\nFor a major city, those unit prices were only rivalled by Lyons in Canberra ($347,000), and Darwin's Millner (where an entry-level apartment could be found for about $294,967).\n\nAn entry-level Hobart unit in Glenorchy was about $414,000, while a house in Hobart's Risdon Vale was found for as little as $439,000.\n\nDarwin's most affordable suburb for homes was Coconut Grove ($481,000), while Belconnen in Canberra was the most affordable suburb for homes in the \"inner city\".",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/opposition-leader-sussan-leys-mother-dies/f41294bb-b537-4527-a0d8-9175769d30b5",
    "title": "'Her eyes lit up': Sussan Ley describes last moments with her mum",
    "publish_date": "Sat, 17 May 2025 22:55:59 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Opposition Leader Sussan Ley has spoken about her final moments with her mother, who died yesterday after seeing Ley become the first woman to ever lead the federal Liberal Party.\n\nLey's mother, Angela Braybrooks, died in an aged care facility in Albury, in southern NSW.\n\nThe newly-anointed opposition leader went straight to the facility after she was elected by the party room last Tuesday.\n\nSussan Ley and her mother Angela Braybrooks, who has died. (Instagram)\n\n﻿\"When I got home, her eyes sort of lit up when she saw me,\" Ley told News Corp today .\n\n\"I held her hand, I talked to her about life and things we've been through together, and I hope she hears.\n\n\"It's a good opportunity to reflect on all things that she did in her life, because my mum was a bit of a trailblazer.\"\n\nThe interview followed a statement Ley released yesterday.﻿\n\n\"My family and I feel this loss deeply,\" Ley said in the statement.\n\n\"Mum was a mental health nurse who helped so many people through her life.\n\n\"She taught me the values of resilience, self-reliance and persistence.\n\n\"Growing up in wartime Britain, Angela could never have dreamed that her daughter would become Australia's first female Leader of the Opposition, but because of her, that happened this week.\"\n\nLey said she had taken inspiration from her every single day of her life.\n\nLiberal leader Sussan Ley's mother has died. (Alex Ellinghausen)\n\nIn the wide-ranging interview with News Corp , Ley also addressed the Liberal Party's \"woman problem\".\n\n\"We have gradually seen a loss in support from women, and have to accept that, and I accept that with humility,\" she said.\n\n\"But it also drives me to turn the corner and rebuild.\"﻿\n\nShe said it was evident at the polling booth that many women lining up to vote weren't supporting the Liberals.﻿\n\nSussan Ley and her mother Angela. (Instagram)\n\n\"I realised in those moments we have to do much better.\"\n\nBut she wouldn't be drawn on policy specifics, saying there'd be no \"captain's calls\" under her leadership, but a thorough process involving all voices in the party room.﻿\n\nShe said her mother remained an inspiration in her career.﻿\n\n\"I always had this model growing up of a mum that was busy and that worked,\" she said.\n\n\"For me, that was important when I found myself so busy with my girls and my boy, and always felt guilty, you know as mums tend to, because I'm not there enough and I can't get it right, can't balance it all.\"\n\nOn the day she was elected opposition leader, Ley announced that her mother was sick and in end-of-life care.\n\n\"It was a gift of fate that I was able to share Mother's Day with my mum one last time on Sunday,\" Ley said yesterday.\n\nSussan Ley posted a photo with some of her family on Mother's Day. (Instagram)\n\n\"On Monday night in Canberra, our parish priest organised a FaceTime call, telling Angela she had to 'hang on' to see one more special moment in her daughter's life. If she could do that, he promised her, 'we'll have champagne tomorrow'.\n\n\"On Tuesday, hours after I was afforded the enormous privilege by my Liberal colleagues of leading our party, I drove back down the Hume Highway to be at her bedside.\n\n\"Whilst mum was no longer verbal, she watched every moment of my press conference. As I walked back into her room that afternoon, her eyes lit up with excitement. It was a moment I will treasure forever.\"\n\nLey thanked everyone who had given their condolences for the loss, and also thanked the staff at the Riverwood Aged Care Facility, where her mother died.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/trump-warns-walmart-dont-raise-prices-due-to-my-tariffs-but-do-eat-the-costs-from-those-taxes/9b4c2e10-6e9b-4c0a-ab78-b59bc82794bc",
    "title": "'Eat the tariffs': Trump's warning to retail giant",
    "publish_date": "Sat, 17 May 2025 21:02:08 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "US President Donald Trump on Saturday ripped into Walmart, saying on social media that the retail giant should eat the additional costs created by his tariffs .\n\nAs Trump has jacked up import taxes, he has tried to assure a skeptical public that foreign producers would pay for those taxes and that retailers and automakers would absorb the additional expenses.\n\nMost economic analyses are deeply skeptical of those claims and have warned that the trade penalties would worsen inflation. Walmart warned on Thursday that everything from bananas to children's car seats could increase in price.\n\nTrump has told Walmart to \"eat the tariffs\" after the retail giant warned it may have to increase prices. (AP)\n\nTrump, in his Truth Social post, lashed out at the retailer, which employs 1.6 million people in the US.\n\nHe said the company, based in Bentonville, Arkansas, should sacrifice its profits for the sake of his economic agenda that he says will eventually lead to more domestic jobs in manufacturing.\n\n“Walmart should STOP trying to blame Tariffs as the reason for raising prices throughout the chain,” Trump posted.\n\n“Walmart made BILLIONS OF DOLLARS last year, far more than expected. Between Walmart and China they should, as is said, “EAT THE TARIFFS,” and not charge valued customers ANYTHING. I’ll be watching, and so will your customers!!!”\n\nPanic on Wall Street as Trump announces new tariffs View Gallery\n\nThe posting by the Republican president reflected the increasingly awkward series of choices that many major American companies face as a result of his tariffs, from deteriorating sales to the possibility of incurring Trump's wrath.\n\nTrump has similarly warned domestic automakers to not raise their prices, even though outside analyses say his tariffs would raise production costs.\n\nSo far, those tariffs have darkened the mood of an otherwise resilient US economy.\n\nThe preliminary reading of the University of Michigan survey of consumer sentiment on Friday slipped to its second lowest measure on record, with roughly 75 per cent of respondents “spontaneously” mentioning tariffs as they largely expected inflation to accelerate.\n\nTrump's tariffs have darkened the mood of an otherwise resilient US economy. (AP)\n\nIn April, Walmart CEO Doug McMillon was among the retail executives who met with Trump at the White House to discuss tariffs.\n\nBut the Trump administration went forward despite warnings and has attacked other companies such as Amazon and Apple that are struggling with the disruptions to their supply chains.\n\nWalmart chief financial officer John David Rainey said he thinks US$350 ($545) car seats made in China will soon cost an additional $155, a 29 per cent price increase.\n\n“We’re wired to keep prices low, but there’s a limit to what we can bear, or any retailer for that matter,” he told The Associated Press on Thursday after the company reported strong first-quarter sales.\n\nThe administration recently ratcheted down its 145 per cent tariffs on China to 30 per cent for a 90-day period. Trump has placed tariffs as high as 25 per cent on Mexico and Canada due to illegal immigration and drug trafficking, harming the relationship with America's two largest trading partners.\n\nThere is a universal baseline tariff of 10 per cent on most countries as Trump promises to reach trade deals in the coming weeks after having shocked the financial markets in early April by charging higher import taxes based on trade deficits with other countries.\n\nTrump insists he intends to preserve the tariffs as a revenue source and that a framework agreement with the United Kingdom would largely keep the 10 per cent tariff rate in place.\n\nTrump has also placed import taxes on autos, steel and aluminum and plans to do so on pharmaceutical drugs, among other products.\n\nCharts on the screen of a Wall Street trader are seen through his glasses as he works on the floor of the New York Stock Exchange, on Monday, April 21, 2025. (AP Photo/Richard Drew) (AP)\n\nThe tariffs and Trump's own reversals on how much he should charge have generated uncertainty across the US economy, such that Federal Reserve Chair Jerome Powell has held the central bank's benchmark rates steady until there is more clarity.\n\nPowell has warned that tariffs can both hurt growth and raise prices.\n\nOn Saturday, Trump repeated his calls for Powell to cut the benchmark rates.\n\nThat could cause inflation to accelerate, but the president has maintained that inflationary pressures have largely disappeared from the economy.\n\n“Too Late Powell, a man legendary for being Too Late, will probably blow it again - But who knows???” Trump posted on Truth Social.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/us-news-dhs-says-its-in-beginning-stages-of-vetting-process-for-immigrant-reality-tv-show/d87d8891-fcb3-45bf-b47b-14489b26e14c",
    "title": "US Department vets TV show where immigrants would compete for citizenship",
    "publish_date": "Sat, 17 May 2025 03:47:58 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "The Department of Homeland Security is reviewing a reality TV pitch where immigrants would compete for American citizenship, according to a spokesperson who said in a statement to CNN that \"the show in question is in the very beginning stages of that vetting process and has not received approval or denial by staff\".\n\nA producer who has pitched the idea to DHS said he envisions the show as being a \"positive love letter to America\" while dismissing criticism that it would be \"punching down\" on contestants.\n\nRob Worsoff, himself a Canadian immigrant whose credits include The Millionaire Matchmaker, Duck Dynasty and The Biggest Loser , said he's pitched the idea for his show as far back as the Obama Administration.\n\nREAD MORE: ﻿ Overpass could be shut for a year after wind turbine jam\n\nHomeland Security Secretary Kristi Noem. (AP)\n\nHe said he's had three conversations with the current DHS about his pitch — \"and they've gone far\" — but said Secretary Kristi Noem has not been involved in any of the discussions.\n\nWorsoff told CNN's Kaitlan Collins, \"I don't know where they stand exactly now, but I feel like we're trending in a good way.\"\n\nDHS Assistant Secretary Tricia McLaughlin told CNN in a statement that DHS \"receives hundreds of television show pitches a year, ranging from documentaries surrounding ICE and CBP border operation to white collar investigations by HSI. Each proposal undergoes a thorough vetting process prior to denial or approval\".\n\nThe Daily Mail and the Wall Street Journal previously reported on the show.\n\nMcLaughlin denied aspects of the earlier report in the Daily Mail , however, saying Noem has not \"'backed' or even reviewed the pitch of any scripted or reality show.\"\n\nWorsoff said he envisions his show being like \" The Biggest Loser for immigration\" – referencing the former reality show where overweight contestants competed to see who would lose the most weight, and which had also been the subject of criticism about its content.\n\nBut he insisted: \"There's nobody who loses on this show — it's ridiculous to even suggest otherwise.\"\n\n\"These are all people who are likely to become future Americans,\" Worsoff said.\n\n\"They are all people with a place in line. They are all people that are good candidates. I'm not punching down on anyone — I am offering somebody the opportunity to jump to the front of the line and nobody else loses.\n\n\"In fact, everybody else in line will be humanised and we'll get to know their face and their story and we'll love them and maybe they'll get a job out of it, or maybe they'll get other opportunities out of it.\"\n\nThe Department of Homeland Security is reviewing a reality TV pitch where immigrants would compete for American citizenship, according to a spokesperson who said in a statement to CNN that \"the show in question is in the very beginning stages of that vetting process and has not received approval or denial by staff.\" (CNN)\n\nHe provided CNN with portions of a pitch deck for the show with a working title The American .\n\nA description of the pitch for a show reads: \"Contestants will represent a wide demographic of ages, ethnicities, and talents. We'll join in the laughter, tears, frustration and joy — hearing their backstories — as we are reminded of how amazing it is to be American, through the eyes of 12 wonderful people who want nothing more than to have what we have — and what we often take for granted: the freedom, opportunity and honor of what it means to be American.\"\n\nEach episode would include a heritage challenge, an elimination challenge, a town-hall meeting and a final vote, according to the deck. Worsoff said the heritage challenge will be tailored to specific locations — a \"gold rush\" challenge in San Francisco, for example, or a \"pizza\" challenge in New York or a \"NASA\" challenge in Florida — to showcase \"how cool America is\".\n\nRock band's cover causes so much outrage FBI investigates lyrics View Gallery\n\nWorsoff told Collins on The Source that he envisions each episode ending with a town-hall meeting, \"just like in a presidential election\".\n\n\"The people of Tennessee, let's say, will get to vote on which one of our future Americans they would most like to represent the state of Tennessee,\" Worsoff said.\n\nHe previously acknowledged the stakes would be high for the contestants but said that's not a bad thing.\n\n\"I would hope that any competition reality show has stakes,\" Worsoff told CNN.\n\n\"Yeah, I'm not going to apologise for that fact that there are real stakes on the show. I don't think that's a bad thing, I think that's a good thing.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/breathtaking-images-show-what-working-as-a-scientist-can-look-like/5b5c591f-3a1e-494b-a425-041714d1ca69",
    "title": "Stunning photography shows what working as a scientist can look like",
    "publish_date": "Fri, 16 May 2025 21:36:59 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "1 of 7 Attribution: Aman Chokshi/Dagmara Wojtanowicz\n\nThe Scientist At Work competition is now in its sixth year and invites Nature﻿ readers to capture the colourful work that scientists do around the world.\n\nSix winners were revealed and one was deemed the overall winner.﻿\n\nThe winners were selected by a jury of Nature staff.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/government-pushes-for-wage-increase-for-millions-of-workers/3eb5a514-55ca-4820-9781-4515a14ad500",
    "title": "Push for three million workers to get a pay rise above inflation",
    "publish_date": "Fri, 16 May 2025 09:27:10 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "The federal government is pushing the Fair Work Commission to deliver pay rises for almost three million workers to catch up with inflation price rises.\n\nThe Australian Government made a submission today to the annual wage review, recommending that \"the Commission award an economically sustainable real wage increase to Australia's award workers\".\n\n\"This is all about ensuring that three million Australians can get the decent pay that they need and deserve to provide for their loved ones,\" Treasurer Jim Chalmers said.\n\nREAD MORE: US basketballer could face death penalty after arrest in Indonesia\n\n\"This is all about ensuring that three million Australians can get the decent pay that they need and deserve to provide for their loved ones,\" Treasurer Jim Chalmers said. (Nine)\n\nThe government also argued that economic conditions had \"turned a corner,\" making it safe to increase wages, with inflation moving into the target range set by the Reserve Bank of Australia.\n\nThey said that along with low unemployment figures released yesterday, interest rates were falling.\n\n\"Low-paid workers and their families are particularly affected by cost-of-living pressures, because they typically have limited liquid asset buffers to draw on to cover rising costs and they are less able to deal with unexpected expenses,\" the government said.\n\nThe government also said this increase would help narrow the gender pay gap, which currently sits at 11.9 per cent on weekly wages.\n\nBut business groups say it's not just workers who are doing it tough.\n\n\"It's very easy for a politician in Canberra to decree that there should be higher salaries and higher wages,\" Council of Small Business Organisations spokesperson Luke Acherstraat said.\n\n\"But who foots the bill? It's small businesses, the mums and dads, many of whom are struggling.\n\n\"Small businesses will need to pass these costs on.\"\n\nREAD MORE: Police officer allegedly stabbed with screwdriver\n\n\"It's very easy for a politician in Canberra to decree that there should be higher salaries and higher wages,\" Council of Small Business Organisations spokesperson Luke Acherstraat said. (Nine)\n\n﻿Economists say any wage increases need to come with better productivity, or it could push prices up.\n\n\"Any wage growth that is significantly in excess of growth of labour productivity will lead to higher inflation and probably higher unemployment as a result, neither of which are things that we want to see,\" Economist Saul Eslake said.\n\nAustralia's productivity has been sluggish in recent years, worry economists about the nation's future prospects.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-18/western-australia-regional-school-invests-in-agriculture/105300010",
    "title": "Farming classes reinstated as schools take on specialist agriculture subjects",
    "publish_date": "Sun, 18 May 2025 01:13:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "A West Australian secondary school has restored its agricultural education program after two decades, giving students hands-on experience in the paddock and the chance to study in their South West town for longer.\n\nAgricultural education is also being offered to students more broadly, as two new farming-related ATAR subjects have been added in to some of WA's secondary schools.\n\nThe district high school in the farming town of Boyup Brook, 250 kilometres south of Perth, stopped farming classes 20 years ago due to staffing issues.\n\nThe K-10 school now gives students the option to complete their Certificate I in agriculture.\n\nAspiring farmer and Year 9 student, Clancy Westphal, is one of the many teenagers who have enrolled.\n\nClancy Westphal says he wants to pursue a career in agriculture. (ABC South West WA: Kate Forrester)\n\n\"Five years ago, the school wasn't really looking at much for me, I suppose, so now it's fantastic,\" he said.\n\n\" It's like coming from home, to home. I love it. \"\n\nThe students are also given the chance to travel to other farms to learn about different agricultural systems.\n\nThey recently learnt about grain growing in the South West, and watched on as a community barley crop was planted.\n\n\"I come from a smaller farm, so this has taught me a lot of other things I wouldn't normally learn, and I get to hear how other farmers think,\" Clancy said.\n\nStudents were able to chat to farmers about their different systems. (ABC South West WA: Kate Forrester)\n\nAgriculture in day-to-day learning\n\nFarm school teacher Brett Parks said even though many students hailed from farming backgrounds, it was important to start with the foundations.\n\n\"We are starting at ground level, looking into farm safety, tool maintenance, and fencing,\" the teacher said.\n\nBrett Parks says the Boyup Brook community has supported the program's reopening. (ABC South West WA: Kate Forrester)\n\nMr Parks also noted cross-curricular benefits the subject was yielding.\n\n\"We can talk about farming in maths, HASS [humanities and social science], in science — the farm permeates throughout the whole school,\" Mr Parks said.\n\nDistrict high principal Melissa Reimers said adding the option of completing certificates was impacting overall engagement and enrolment.\n\nThe Shire of Boyup Brook has about 1,700 residents.\n\nThe secondary school had 170 students last year which has since risen to 199.\n\n\"Last year we had zero Year 10s remaining in our high school and this year we have 13,\" Ms Reimers said.\n\n\"We lose a lot of our students to ag schools, so it's obviously something the community is interested in pursuing.\"\n\nMelissa Reimers has seen an uptick in enrolments the past year. (ABC South West WA: Kate Forrester)\n\nThe principal noted the farm school program was not limited to high school students.\n\n\"We start our farming program with the Year 3 cohort, they are learning about sustainability, composting, vegetable gardening,\" Ms Reimers said.\n\nYear 9 and 10 students travelled to the Boyup Brook community crop to watch barley being seeded. (ABC South West: Kate Forrester)\n\nStrengthening the ag career pathway\n\nApart from agricultural colleges and a handful of other public schools in WA, agricultural education has not been an option for metropolitan secondary students.\n\nBut two new ATAR courses have recently been made available for secondary schools to roll out in their classrooms.\n\nYear 11 and 12 students are now able to select from agribusiness and agricultural science and technology courses.\n\nUniversity of Western Australia agricultural education program lead Alysia Kepert has been working to educate schools around the new curriculum to improve the secondary-tertiary pathway into agriculture.\n\nAlysia Kepert has been recruited to generate interest in the new ATAR courses. (Supplied: Caroline Telfer)\n\n\"Any secondary school in Western Australia can consider implementing the new curriculums, but from a natural starting point, metropolitan boarding schools are a strong place to start,\" Ms Kepert said.\n\n\"We are having conversations with private schools, but we also encourage parents to enquire about the opportunity of offering those.\"\n\nMs Kepert said four non-agricultural schools had implemented the courses, but the UWA project she was working on was aiming for that to grow.\n\n\"We are the only state in Australia with a secondary agribusiness course, so we are leading the way,\" Ms Kepert said.\n\nThe educator said the project was also engaging with industry to discuss ongoing support and shared approaches to agriculture career progression.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-18/pga-championship-scottie-scheffler-third-round/105306428",
    "title": "Scheffler seizes PGA Championship lead as he eyes off third major win",
    "publish_date": "Sun, 18 May 2025 01:11:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "Scottie Scheffler has produced a brilliant finish to claim a three-stroke lead ahead of the PGA Championship's final round at Quail Hollow Club in Charotte, North Carolina.\n\nWorld number one Scheffler was forced to deal with testing weather conditions during the third round, firing a 6-under-par 65 that was little short of brilliant under the circumstances.\n\nThe start of the third round was delayed due to lightning in the Charlotte area.\n\nA two-time Masters champion, Scheffler is 11-under with one round remaining, while Sweden's Alex Noren vaulted into second place with a similarly barnstorming finish for a 66.\n\nNoren, who birdied four of the final five holes, was alone on 8-under.\n\nAmericans Davis Riley (67) and JT Poston (68) were four shots behind in a tie for third.\n\nAdam Scott is the best-placed Australian, sharing 13th position on 4-under for the tournament.\n\nScott managed a 2-under 69 in the third round, while compatriot Cam Davis (70) is a stroke back on 3-under through 54 holes.\n\nScheffler was far from perfect with three bogeys, but he more than made up for those blemishes with seven birdies and a brilliant eagle at the driveable par-four 14th hole, where he hit his tee shot to inside three feet.\n\nHe added birdies at the 15th, 17th and 18th holes to stamp himself as the favourite.\n\n\"I hung in really well today,\" Scheffler said.\n\n\"I just battled really hard. Did a good job of staying patient and hit some nice shots. I definitely struck the ball a lot better today than the last couple of days.\"\n\nOvernight leader Jhonattan Vegas of Venezuela fell into a tie for fifth with a bogey on the 18th hole.\n\nHe finished 2-over (73) for the day and is 6-under for the tournament alongside South Korea's Kim Si-woo (71) and Spain's Jon Rahm (67).\n\nMasters champion Rory McIlroy continued his struggles with a 72 to trail Scheffler by 13 shots.\n\nThe third of the Australians left in the tournament, Elvis Smylie, had a day to forget with a 6-over 77.\n\nSmylie is 7-over to be tied for 69th place on the leaderboard.\n\nAP/ABC",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-18/australian-national-budgerigar-council-championship-preparations/105284422",
    "title": "Superfood diet and the right shampoo essentials for budgies going on show",
    "publish_date": "Sun, 18 May 2025 00:56:47 +0000",
    "category": "sports",
    "authors": [],
    "text": "Bruce Schuster pampers his budgerigars with shampoo spritzes and a daily superfood medley.\n\n\"My wife thinks they're better fed than she is,\" the 77-year-old says.\n\n\"It's got all the nice vitamins in there. I've got my greens in there. I grate my carrot, I grate the beetroot and a bit of sweet potato.\"\n\nThe retired real estate agent is a three-time national champion budgie breeder and competition judge.\n\nHe is organising the 49th annual Australian National Budgerigar Council (ANBC) championship show in Cairns next weekend.\n\nMr Schuster has to fend off hawks, snakes and cats that try to get at his budgies. (ABC Far North: Sharnie Kim)\n\nMr Schuster will also be among the 220 exhibitors bringing the nation's top 640 budgies to compete at the event.\n\nSince joining his local budgerigar club in 1992, his humble backyard operation in suburban Cairns has clinched the three national titles and many more podium finishes.\n\n\"This little aviary here which only breeds around 100 birds a year if I'm lucky, what it produces is unbelievable,\" he says.\n\nToothbrush, cotton buds and the right shampoo\n\nDuring the two-day event, judges working in pairs will assess the birds against a \"Standard of Perfection\" which sets out strict criteria for form, colour and condition across 28 varieties.\n\nTo get his birds show-ready, Mr Schuster sprays them every few days with shampoo and water to fluff up their feathers and uses a cotton bud dipped in milk to carefully remove any stains.\n\n\"And different birds use different shampoos,\" he says.\n\n\" Don't do what I did one year. I put the shampoo into the feather on my albinos and I turned them all pink. \"\n\nBudgie exhibitors like Bruce Schuster go to great lengths to get their birds looking their best. (ABC Far North: Sharnie Kim)\n\nHe also uses a toothbrush to loosen up head feathers to create the desired bouffant hairdo.\n\n\"We used to have a hair dryer and we'd go out there and blow them around. I don't see it happening so much lately but it used to just buff the bird up,\" he says.\n\n\"You also put a little bit of oil on their feet and their beaks to shine it up.\"\n\nFrom desert nomad to global sensation\n\nThe native Australian parrot's journey from desert nomad to the world's third-most popular pet behind dogs and cats began in 1840 when budgies were first exported to England.\n\nThey have been bred for competitions since the 1920s, leading to the marked difference in appearance between exhibition budgerigars and their ancestral cousins that swarm in their thousands in the Aussie outback.\n\nBudgies travel in large flocks called murmurations through the Australian outback. (Supplied: Steve Pearce)\n\nWild budgies are smaller and sleeker, averaging 18 centimetres in length, while show budgies are ideally 24cm long with head feathers so fluffy they appear to obscure their eyes.\n\nColour mutations and selective breeding have given rise to 28 varieties in Australia and a cornucopia of shades including cobalt, violet, buttercup yellow and snow white.\n\nWith names like opaline, cinnamon wing, recessive pied and saddleback, each variety has colour and plumage differences, from the shade of the bird's iris to the intensity of its markings.\n\nSome past ANBC championship winners. (Supplied: Australian National Budgerigar Council)\n\nGriffith in the NSW Riverina hosted the first official gathering of Australian budgie fanciers in 1967.\n\nFrom a peak of more than 5,000 registered breeders during the pastime's heyday in the 1980s and 90s, the community has declined to about 1,600 breeders, most older men.\n\nANBC president Russell Ogden says there is a concerted drive to recruit younger members through events like South Australia's Budgie Fest and Warrnambool's Budgies in the Bool.\n\n\"We jokingly refer to it as a dying hobby,\" he says.\n\n\"The juniors are going to be the future of our hobby in years to come, but we're also trying to encourage it as an inclusive family hobby.\"\n\nWhat fanciers consider to be the \"ideal budgie\" has evolved over time. (Supplied: Australian National Budgerigar Council)\n\nThe pastime has also expanded around the world, with the Australian titles to be live-streamed to 48 member countries of the World Budgerigar Organisation including Sudan, Bangladesh and Slovenia.\n\n\"It's actually probably more popular in some countries than it is in Australia, which is surprising,\" Mr Ogden says.\n\n\" We say the budgerigar is Australia's gift to the world. \"\n\nThe original light green has spawned a cornucopia of hues in budgies. (Supplied: Angus Newey, Alice Springs Desert Park)\n\n'Wow, he's powerful'\n\nBudgie shows are a fierce contest over differences in features that are barely discernible to the untrained eye.\n\nThe tiny details — an out-of-place spot, aberration in tail feather numbers, or disallowed flecking in the plumage — are what set champions apart from the rest of the field.\n\nBreeders like Mr Schuster set out to create perfectly proportionate wing and tail lengths, a 30-degree angle of deportment on the perch, and just the right Pantone shade and markings.\n\nWhen it all comes together, he says the diminutive birds can elicit gasps of, \"Wow, he's powerful.\"\n\nSome different budgie varieties in show cages that are used at competitions. (ABC Far North: Sharnie Kim)\n\n\"The exhibition budgie is such a magnificent bird to look at,\" he says.\n\n\"The directional feather and the colours and everything of those 28 varieties are unbelievable.\"\n\nCompetitive spirit\n\nMr Schuster has enjoyed the camaraderie of the budgie community over three decades but admits it can be \"over-competitive\" at times.\n\n\"You can see some people look at you and think, 'Oh, I'd love to beat him',\" he says.\n\nBut he too enjoys a bit of healthy competition.\n\nHe gets a twinkle in his eye when he recounts some wins, such as successfully cajoling another breeder to lend him their prized cock or hen and bagging quality birds for a bargain.\n\n\"I've won the nationals with a $50 bird,\" he says.\n\nMr Schuster has won three national titles known as the \"Logies\" by budgie fanciers. (ABC Far North: Sharnie Kim)\n\nMr Schuster says some birds fetch \"crazy prices\" at auction — up to $10,000 — but he believes discernment is more important than deep pockets.\n\n\"I play with bloodlines. I don't buy a lot of birds, and I think I've got a good eye,\" he says.\n\n\"What you've got to remember is [a seller] is getting rid of their bird. If it was good they'd be keeping it.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-18/will-the-super-shot-be-introduced-to-international-netball/105306270",
    "title": "Will the controversial super shot be introduced to international netball?",
    "publish_date": "Sun, 18 May 2025 00:24:33 +0000",
    "category": "sports",
    "authors": [],
    "text": "From controversial beginnings to global domination, the two-point shot has now infiltrated all four top netball leagues around the world.\n\nIn 2020, there was uproar when Australia became the first country to boldly introduce the innovation inspired by netball's shorter and flashier format — Fast 5.\n\nLeague organisers dropped the bombshell six weeks before the season started.\n\nClubs had already recruited players, teams were in the depths of pre-season, and they were blindsided by the scoring adaptation that would shake up the game.\n\nJo Harten did not like the way the super shot was introduced. \"No choice, no voice. Can only take the decision on the chin,\" she wrote on Twitter. Now the Giants captain sits second in the league for super shots with 278. (AAP: Joel Carrett)\n\nThe timing was interesting considering the competition that year had already been delayed because of the COVID pandemic, everyone had to move to Queensland in a hub, and there were other new rules already being added like timeouts, rolling subs and extra time.\n\nIt felt like too much all at once. Australian Netball Players' Association president Jo Weston worried a two-point shot would alienate existing fans, delivering the iconic line: \"There are only so many bells and whistles you can add to a bike before it becomes a clown car.\"\n\nShe wasn't alone. There was angst across all eight clubs. Some thought the adaptions made netball too much like basketball. The players — who consider themselves to be key stakeholders of the game — felt they should have at least had a say.\n\nThose in charge argued it was just a trial to see if it would entice new fans.\n\nWhether it was successful is hard to say, because the league has never divulged any key metrics that would demonstrate its success or revealed whether the \"trial\" met its targets. The new rule simply rolled on with the rest of the innovations and here we are five years on.\n\nNow it seems there's no going back. Especially since other countries have also jumped on board.\n\nChanging attitudes overseas\n\nOriginally, they mocked us overseas and yet, in 2025, the UK Super League, the New Zealand Premiership and the South African Netball League have all introduced a two-point shot for fear of falling behind.\n\nSara Francis-Bayman was one of the people that thought the super shot was absurd. Now she works in Australia at the West Coast Fever as an assistant coach and has to come up with defensive strategies to shut it down every week. (AAP: Steven Markham)\n\n\"I think they've ruined Super Netball by introducing it,\" former Silver Fern Storm Purvis told SEN New Zealand in April 2020.\n\n\"I'm trying so hard not to laugh because I genuinely find this quite hysterical, you're sabotaging your national team,\" former England Rose Sara Francis-Bayman told the Netball Nation podcast two months later.\n\nThis is not a knock on either expert, because hindsight is 20/20. More so just an interesting reflection of the changing attitudes towards the scoring adaption.\n\nCommercially, it helps that money talks and each league has managed to secure extra sponsorship for the naming rights of its two-point goal.\n\nThe world number one ranked Aussie Diamonds team has also been able to claim back their Commonwealth Games gold medal and Netball World Cup crown since 2020, indicating it's possible to make rule changes at a domestic level and not let it impact you internationally.\n\nThe Diamonds won back their Commonwealth Games gold medal status in 2022, despite the players dealing with a host of rule changes in the domestic competition. (Getty: Sue McKay)\n\nThe UK Super League has replicated the exact same timing and distance as Super Netball. In the last five minutes of each quarter, two points are on offer in the designated arc painted 3 metres away from the goal post.\n\nThe New Zealand Premiership runs on the same timing. However, in order to make it a tougher challenge, they've pushed their arc back to the Fast 5 distance — 3.5 metres away.\n\nSouth Africa has been the first to really stretch the concept. The winner of the coin toss that determines which team takes the first centre pass also now gets to decide whether double points will be on offer for the last two minutes of the first or third quarter. ABC Sport was unable to confirm the distance of their arc; visually it appears to be 3.5 metres away.\n\nA bird's-eye view of the two-point shot arc marked out on court for a 2020 Super Netball game played with no fans allowed in the Queensland hub. (AAP: Dan Peled)\n\nSo, given it is so widespread, will World Netball add a super shot to its international game?\n\nDiamonds midcourter and Melbourne Vixens captain Kate Moloney's stance may have softened over the past five Super Netball seasons, but she is still reluctant to see it in Test matches.\n\n\"It's interesting how it's been adopted in other leagues, and it does show we're doing something right here in Australia if they want to copy that,\" Moloney told ABC Sport.\n\n\"I love international netball the way it is and hopefully it stays that way, but the super shot has added something exciting domestically and my opinion has changed on it because I can see the excitement from a fan point of view.\"\n\nWhat would be the challenges?\n\nRetired umpire Michelle Phippard's experience at the highest level spanned two decades.\n\nAsked whether the super shot could feasibly be introduced to international netball, Phippard reflected on the privilege associated with such a question.\n\nThere are 75 members governed by World Netball with varying degrees of facilities and funding.\n\nMichelle Phippard was widely regarded as Australia's best umpire during her career. (Getty: Will Russell)\n\n\"There's one rule book and that applies to the game at all levels, so there would be huge logistical issues … you would have to go through and remark every netball court,\" Phippard said.\n\n\"The costs involved in getting all the courts repainted would be enormous. Who pays for that?\n\n\"When I lived in Switzerland or in the US for instance, at training each week we'd have to mark out all the lines on basketball courts with pieces of string.\n\n\"We take for granted our venues here with gazillions of courts and would probably have less issues getting them remarked, but in other countries, there's no way.\n\n\"That would be one big barrier to it internationally and if the game did want to introduce it, it would probably need to consider separating the rules at the top from community.\"\n\nWould it be reasonable to expect young girls to learn how to umpire a super shot at the community level? (Getty Images)\n\nThis is a great point, because if the game decided to go ahead without separating its rule books, further repercussions would be felt at your local courts.\n\nThere would be an added layer of complexity around central timing for associations and when it comes to umpires indicating correctly a 'one' or a 'two', a recent UK Super League example showed even the professionals have struggled to get the hand signals right.\n\nWe also need to consider whether it would be fair for other nations that don't get the opportunity to practice this kind of innovation back home.\n\nLeading super shot players Super Netball team Tally Helen Housby NSW Swifts 306 Jo Harten Giants 278 Steph Fretwell Sunshine Coast Lightning 266 Sophie Dwyer Giants 231 Kiera Austin Melbourne Vixens 204\n\n\"We underestimate how hard it is for some countries to adapt,\" Phippard said.\n\n\"Even with Fast 5 Netball, at the beginning of the week there are so many practice matches that take place, so the players, umpires and coaches have time to learn the rules.\n\n\"In Australia and New Zealand, they would just run a camp leading in, but in Uganda, Malawi or Jamaica, they would have to learn as they go along.\n\n\"It's more than just the long shot itself, it's learning the defensive strategies to counter it and across those top four professional leagues you're lucky if there's maybe six countries represented.\n\n\"At a World Cup there's 16 countries, and some will have no exposure at all, so they will be really disadvantaged and that could widen the gap.\"\n\nIs World Netball open to the idea?\n\nWhen ABC Sport reached out to World Netball to get some clarity about their plans moving forward, we received this tight-lipped response.\n\nKiera Austin recently entered Super Netball's top five ranks for two-point shots. (Getty: Mark Brake)\n\n\"The World Netball Rules Advisory Panel is responsible for recommending rules changes to the World Netball Board,\" its statement read.\n\n\"During an official rules review, World Netball welcomes member associations and World Netball Technical Panels to submit proposals for changes to the rules of netball, which allows the Rules Advisory Panel to then begin a consultation and trialling process, before presenting suggested rules changes for World Netball members to vote on.\n\n\"For the 2025 domestic season World Netball has been consulted and notes that England Netball, Netball Australia, Netball New Zealand and Netball South Africa have introduced various rules variations to their elite domestic leagues, including the super shot.\n\n\"World Netball is in communication with all four members and is working to gather data in relation to the implementation of various rules variations within their leagues.\n\n\"This type of information is invaluable to inform future strategic directions, and to assist with rule reviews, policy, and procedure development.\"\n\nThe governing body is certainly open to changes. The last ones it made were voted on at the 2023 Netball World Cup and implemented at the start of 2024.\n\nLiz Nicholl has been the president of World Netball since 2019. (Getty: Nathan Stirk)\n\nSome of these included modifications to the short pass rule and substitutions to resemble something closer to rolling subs. There was also a crackdown on dangerous play, that has increased two-minute suspensions and send-offs.\n\nBut would the typically conservative World Netball be bold enough to incorporate a super shot? That's another question. Watch this space.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-18/the-future-of-angus-beef-in-australia-and-globally/105280738",
    "title": "How close can science bring us to the perfect beef breed?",
    "publish_date": "Sat, 17 May 2025 23:36:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Angus beef may dominate dinner plates today, but almost 50 years ago one of the world's most recognised cattle brands was a breed on the brink.\n\nFearing inconsistent quality was behind declining consumer demand, a group of ranchers roped in a meat scientist from Ohio State University to develop quality standards to make steak great again.\n\nToday, it's estimated 52 per cent of Australia's cattle herd has some Angus genetic influence, made possible by generations of precision breeding focused on consumer satisfaction.\n\nAnd while the breeders don't claim it is perfect, the rise to dominance alongside premium brands like Wagyu raises the question — could it be?\n\nLove beef tender\n\nThe foresight to create Certified Angus Beef (CAB) in 1978 has been credited with the breed enjoying name recognition many would envy.\n\nPresident John Stika said it pushed the industry to focus on producing consistency consumers could rely on.\n\nCertified Angus Beef President John Stika. (Supplied: Certified Angus Beef)\n\nMr Stika said they focused on one of the strengths of the Angus breed — producing a well-marbled high-quality product.\n\n\" They did it very intentionally through a set of rigid specifications that could ensure a consumer would have a great eating experience each time they bought the product. \"\n\nCarcasses must meet 10 standards to qualify as Certified Angus Beef, which is then labelled and tracked through merchandising chains to retail stores and restaurants in 50 countries.\n\nThere is a focus on genetic selection for increased tenderness and marbling of Angus beef. (Supplied: Stanbroke)\n\n\"A high level of marbling to ensure the flavour, tenderness and juiciness has been one of the key points of differentiation for our brand since day one,\" Mr Stika said.\n\n\"We've seen a quality beef revolution take place in the United States producing more prime, more certified Angus beef than we ever have before,\" he said.\n\nIt was not just in America.\n\nIn 2023, research commissioned by industry group Angus Australia estimated that over the course of a decade, beef operations that added Angus genetics boosted their profits by a minimum of $116,000.\n\nMore than 50 per cent of the Australian herd is influenced by Angus genetics. (ABC Rural: Lara Webster)\n\nChief operating officer Carel Teseling said contemporary research on genetic selection to strengthen eating quality looked at four traits, including one called \"shear force\".\n\n\"They are pulling a blade through that piece of meat and it measures how hard it is in kilograms to cut that piece of meat,\" he said.\n\n\"That gives you an idea of how much force you need to put on it to chew it and it gives you an indication of the tenderness of the beef.\"\n\nBut before Angus can claim total market dominance, it has to outperform the world's most popular breed, brahman.\n\nPreferred in climates like India and Northern Australia, the breed is heat tolerant and tick resistant.\n\nBut Mr Teseling said scientists were investigating a gene mutation that caused animals to have shorter, \"slicker\" hair that helped them cope with the heat.\n\n\"That slick gene is very, very beneficial,\" he said.\n\nBeef of the future\n\nAlong with consistent eating quality and good marketing, Professor Alison Van Eenennaam from the University of California said future beef breeds needed to be adaptable and sustainable, right down to their DNA.\n\n\"We lose about 20 per cent of animal protein globally to disease,\" she said.\n\n\"If we could go in and tweak the genome to make animals that are no longer susceptible — that to me is a good way to address a disease problem.\"\n\nShe said gene-editing tools like CRISPR could guarantee a specific genetic mutation, like the \"slick\" gene, and countries like Argentina and Brazil were already adopting it.\n\n\"They have said that they are no different to conventional breeding and that those products can go to market,\" she said.\n\n\"Our major beef competitors are likely to be able to use this technology ... to produce, for example, disease-resistant cattle.\"\n\nAngus beef is considered a premium product across the globe. (Supplied: Angus Australia)\n\nSinclair Munro's family has bred Angus cattle since 1926 and he's the third generation to chair Angus Australia.\n\nWhether it's new methods or old, he has his eye firmly on sustaining future demand.\n\n\"We have got to keep moving and making continuing improvements,\" he said.\n\n\"There's nothing sustainable about beef production when no one likes your beef.\n\nAmerican Angus Association chief executive Mark McCully and Angus Australia president Sinclair Munro. (ABC Rural: Lara Webster )\n\nHis US counterpart, American Angus Association chief executive Mark McCully, agrees.\n\nWith his country's cattle herd decimated by drought, he said it was more important than ever to focus on quality over quantity.\n\n\"We've not begun to rebuild our cow herd ... I don't suspect we'll rebuild back to where we were five and 10 years ago,\" he said.\n\n\" We've got cattle that grow fast and efficiently and produce a high-quality product — we're going to do more with less. \"\n\nIt may not be perfect, but he said it would \"keep cattlemen in business and keep consumers coming back\".",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-18/eurovision-grand-final-2025-winner-austria/105300990",
    "title": "'Dreams come true': Austria takes Eurovision crown with Israel in second",
    "publish_date": "Sat, 17 May 2025 23:16:58 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Austria has won Eurovision 2025 in a nailbiting finish, with artist JJ singing Wasted Love.\n\nIn the end it came down to two likely winners, with Austria leapfrogging Israel, which won the public vote despite protests over the nation's inclusion.\n\nJJ was emotional when holding up the trophy after taking out the competition.\n\n\"Thank you so much for making my dreams come true,\" JJ said.\n\nJJ won with 436 points.\n\nJJ's victory means Austria has now won Eurovision three times.\n\nThe first win came in 1966 with Udo Jürgens performing the song Merci, Chérie.\n\nAustria's second win came in 2014 with Conchita Wurst's rousing performance of Rise Like A Phoenix.\n\nLoading YouTube content\n\nJJ, 23, is an Austrian-Filipino artist whose full name is Johannes Pietsch.\n\nHe is a professional performer at the Vienna State Opera and is fluent in English, German and Tagalog.\n\nIt means Austria will host in 2026.\n\nAustria was a hot favourite.\n\nThe leaderboard put Austria in front, followed by Israel, Estonia and Sweden, with Italy rounding out the top five.\n\nAustria Israel Estonia Sweden Italy Greece France Albania Ukraine Switzerland\n\nProtests against Israel's participation\n\nThe host venue seats 12,400 people, with an additional 36,000 people at a viewing party in the stadium next door where researcher Jess Carniel is on the ground in the thick of the action.\n\nCarniel snapped this photo of pro-Palestinian protesters on her way to the stadium. (Supplied: Jess Carniel)\n\nThe University of Southern Queensland researcher has been studying Eurovision for the past decade, since Australia began participating in the song contest.\n\nDr Carniel said a crowd protesting Israel's involvement in Eurovision was out in force ahead of the show but dwindled once she arrived closer to the stadium.\n\nJess Carniel is at the 69th Eurovision Song Contest in Basel, Switzerland. (Supplied: University of Southern Queensland)\n\n\"There was a large pro-Palestinian protest along Freie Strasse, one of [the] main streets in Basel's centre that resulted in significant disruptions to public transport,\" Dr Carniel told ABC News.\n\n\" It was, however, peaceful, with protesters chanting, waving flags and signs, and urging bystanders to join in the protest. \"\n\nYuval Raphael, 24, performed New Day Will Rise for Israel during the competition.\n\n\"I am viewing the arena plus [the] show next to the stadium where the live show is being held,\" Dr Carniel said.\n\n\"There were no protests upon my arrival, nor any visible Palestinian flags. My assumption is that most fans who protest Israel's inclusion have opted out of the show altogether.\"\n\nYuval Raphael from Israel performed New Day Will Rise. (Supplied: Sarah Louise Bennett/EBU)\n\nDr Carniel said the overall vibe of the night lacked the tension that charged Malmo last year.\n\n\"During Israel's performance, the crowd was supportive,\" she said.\n\n\"There were cheers, albeit not loud, and only minimal booing audible from where I sat.\n\n\"By comparison, the cheer for Ukraine when their performance was announced was slightly louder, but they received less of a cheer upon the end of the song.\"\n\nDr Carniel said she later heard from spectators inside that two people tried to climb the stage during Raphael's performance, with one of them throwing paint, before ending up in police custody.\n\n\"I also received an email warning that rubber bullets were fired on the protesters later in the evening,\" Dr Carniel said.\n\nEurovision is famously \"apolitical\" but the European Broadcasting Union's (EBU's) decision to allow Israel to compete was a point of contention last year as people wondered whether there was a double standard given Russia's ban after its invasion of Ukraine.\n\nWho has won Eurovision the most?\n\nThat’s a tie, with Sweden and Ireland both winning the competition seven times.\n\nSweden’s wins started with ABBA in 1974, and Lorena won the competition twice in 2023 and 2012.\n\nDr Carniel says the crowd was on their feet during Sweden’s performance \"with people flooding out of their seats to dance by the front barricade\".\n\nIreland’s Johnny Logan is the only other music artist to win more than once after his first triumph in 1980 in The Hague, winning again in 1987.\n\nNemo returns to represent Switzerland\n\nThe opening act was last year’s winner Nemo, who sang The Code in a haunting wedding dress and furry hat.\n\nNemo performs The Code as the opening act at the grand final of Eurovision 2025 in Basel, Switzerland. (Supplied: Corinne Cumming/EBU)\n\nNemo later performed the new song Unexplainable in a glittery black outfit that would have been banned if attempted to be worn at the Cannes Film Festival.\n\nThere will be an encore of the Eurovision grand final on SBS and SBS On Demand from 7:30pm AEST Sunday.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-18/italian-open-jasmine-paolini-coco-gauff/105306272",
    "title": "Home favourite Paolini snaps 40-year drought with Italian Open triumph",
    "publish_date": "Sat, 17 May 2025 23:06:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "Jasmine Paolini has defeated world number three Coco Gauff 6-4, 6-2 in the Italian Open final.\n\nRoared on by an adoring home crowd, sixth-seeded Paolini became the first Italian to win the women's title in Rome since Raffaella Reggi in 1985.\n\n\"Congrats for the amazing week Coco. You reached finals so you're playing great. You are such a great player and a great person,\" Paolini said.\n\nGauff had won two of her previous three meetings with Paolini but the 2023 US Open champion had no answers to the Italian's solid play.\n\nWorld number five Paolini came out all guns blazing to clinch a tight opening set in 54 minutes and then stepped up a gear to power ahead 3-0 in the next before sealing the win.\n\nGauff, who lost to world number one Aryna Sabalenka in the Madrid Open final earlier this month, racked up 55 unforced errors, while a dominant Paolini won 76 per cent of her first serves.\n\nBut Gauff still has positives to take away from Rome.\n\nShe knocked out China's Paris Olympic gold medallist Zheng Qinwen, Russian teenage sensation Mirra Andreeva and former US Open champion Emma Raducanu on course to the final.\n\nItaly could be celebrating a second victory in the singles, with world number one Jannik Sinner — contesting his first tournament since returning from a doping ban — to face Carlos Alcaraz in the men's final.\n\nReuters/ABC",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-18/trade-wars-prompt-australian-fashion-manufacturing-push/105299640",
    "title": "Can Australia make clothes again? The fashion council wants to find out",
    "publish_date": "Sat, 17 May 2025 22:57:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "During Australian Fashion Week last week, models walked the runway clothed by home-grown designers, but while the designs were local, the outfits themselves were made overseas.\n\nAs the industry's luminaries gathered to celebrate, the escalating trade war between the United States and China cast a long shadow.\n\nDetermined to future-proof the industry from rising costs and tariff uncertainty, the Australian Fashion Council is embarking on a bold plan to bring the textile industry home.\n\nThe US-China trade war cast a long shadow at Australian Fashion Week this year. (ABC News: Brendan Esposito)\n\nWhile welcomed by wool and cotton farmers, there are concerns the economic reality of the supply chain may scupper any home-made dreams.\n\nHome-made fashion\n\nIn the 1950s, Australia's 'rag trade' was booming.\n\nSurry Hills in Sydney and Flinders Lane in Melbourne were bursting with garment manufacturing factories and workshops.\n\nBut as worker shortages and rising electricity costs combined with cheaper labour overseas, much of it moved offshore.\n\nThe fashion council says bringing manufacturing back to Australia would mean more secure supply chains. (ABC News: Brendan Esposito)\n\nThe fashion council, which represents the industry, now estimates 97 per cent of Australia's $28 billion of fashion is produced overseas.\n\n\"Our sector is at a critical tipping point,\" chief executive Jaana Quaintance-James said.\n\n\"We've identified an urgent need for a national manufacturing strategy — one that safeguards jobs, restores technical capability, and strengthens our global competitiveness.\"\n\nPartnering with RM Williams, which has been manufacturing clothing and shoes in Adelaide since 1932, the council will hold six industry consultation sessions, with the full detail of the strategy to be delivered in late 2025.\n\nMs Quaintance-James said the plan would also help job creation.\n\n\"You're supporting the payment of local taxes, and a broader kind of economic and social development in Australia,\" she said.\n\nJaana Quaintance-James is the Australian Fashion Council chief executive. (Supplied)\n\nTariff concerns\n\nRising trade tension over tariffs between the United States and China has contributed to the sense of urgency.\n\nMs Quaintance-James said while China was the engine room of global textile production, the US was a growing market for Australian fashion houses.\n\nWith most of the cotton and wool produced in Australia being processed in China, Australia's fashion industry has become collateral as a key customer goes to war with the industry's main supplier.\n\nMs Quaintance-James said news of a 90-day pause of the escalation between the two nations had come as a relief, but it highlighted the vulnerability at the core of the supply chain.\n\n\"Hopefully the tariffs stay at 30 per cent or will go even lower,\" she said.\n\nAlong with less exposure to global volatility, she said a return to domestic manufacturing offered other practical advantages, such as supply chain transparency and shorter lead times in textile production.\n\nSetting the trend\n\nTo make clothes you need fabric, which can either be synthetic or natural.\n\nThe Australian wool clip is at its lowest level in 100 years. (ABC News: Brendan Esposito)\n\nMost synthetic fibres such as polyester or nylon are made from petrochemicals, and it is estimated 70 per cent of the global supply is manufactured in China.\n\nNatural fibres can be sourced from plants, such as cotton, or animals, such as sheep.\n\nThe raw product needs to be processed, which includes cleaning, spinning and weaving, and like garment manufacturing, it is almost all done offshore.\n\nCotton spins its way through a northern China factory in Ningxia. (ABC Rural: Brett Worthington)\n\nAustralia is a leading producer of cotton and wool, though both industries have struggled in recent years; the cotton industry faced a trade ban from China in 2020 while Australian wool production this year fell to a 100-year low.\n\nAdam Kay, chief executive of grower group Cotton Australia, said the last local cotton spinning mills moved offshore 20 years ago, under pressure from rising labour costs.\n\nHe said that issue had largely been overcome through automation, but now the high cost of electricity would be a barrier to re-establishing the industry.\n\n\"Onshore energy in Australia is quite expensive compared to other countries,\" he said.\n\nAdam Kay says the biggest deterrent to cotton processing in Australia is the cost of energy. (Supplied)\n\nMr Kay said the cotton industry already worked with more than 50 fashion brands across the country to supply Australian-grown cotton.\n\n\"Having a spinning mill locally and doing that next stage of processing, and maybe going all the way through to garment manufacturer, it really is a more circular economy,\" he said.\n\n\"It could really reduce the carbon miles that the products have.\"\n\nSpotlight on wool\n\nAs Australian wool producers stare down historically low production, seeing wool take centre stage at the Met gala in New York earlier this month was heartening.\n\nUS actor Zendaya wears Louis Vuitton at this year's Met Gala. (AP: Invision/Evan Agostini)\n\nConsidered fashion's biggest night of the year, the annual fundraising gala for the Metropolitan Museum of Art's Costume Institute in New York City invites A-List celebrities to dress in a theme — this year it was \"tailored to you\".\n\nAustralian Wool Innovation's global marketing projects manager Catherine Veltman said several major brands chose to showcase wool outfits this year, which would lift the fibre's profile.\n\n\"Brands such as Thom Browne, Louis Vuitton, Prada, Moncler all chose to use wool this year,\" she said.\n\nAttracting 15 million views to its live-stream and countless commentaries, Ms Veltman hoped the exposure would encourage mainstream brands and ultimately consumers to consider wool.\n\nUS actor, comedian and all-around icon Whoopi Goldberg wears Thom Browne at the Met Gala. (AP: Invision/Evan Agostini)\n\nIf Australia is to turn back the clock textile manufacturing, Ms Quaintance-James said the national strategy would require a co-ordinated effort from government and the private sector.\n\n\"Tariffs are just the latest example. In COVID, we were unable to produce our own healthcare uniforms,\" she said.\n\n\"And we're in exactly the same situation. We have not evolved from that.\n\n\"So when are we going to learn this lesson?\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-18/sa-liberal-party-prospect-at-state-election/105306218",
    "title": "Former SA Liberal staffer says she couldn't vote for Dutton-led party",
    "publish_date": "Sat, 17 May 2025 22:02:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Chelsey Potter was once a would-be South Australian Liberal candidate and long-term party member, but she's now disillusioned, frustrated and \"politically homeless\".\n\nThe former staffer said she couldn't bring herself to vote for a Peter Dutton-led Liberal government and believes she's part of a growing number of moderate, naturally Liberal-leaning women who are abandoning the party.\n\n\"I think at every level of the party we are struggling and it's because the tone is just so wrong because we aren't having women speak to women or we're not allowing our women candidates to speak as themselves,\" Ms Potter said.\n\n\" I very much struggled and didn't vote Liberal this last election and that was really hard. \"\n\nMs Potter said the Liberals face \"a huge disconnect from women\".\n\n\"My family, my neighbours, my friends are all looking at me and saying, 'Where can I put my vote?'\n\n\"These are strong Liberal voters from small business backgrounds, lawyers, businesspeople who are thinking, 'I'm politically homeless right now'.\"\n\nJack Batty won the preselection of the seat of Bragg after Chelsey Potter's bid was rebuffed. (Facebook/Supplied)\n\nIn 2022, Ms Potter put her hand up to be the Liberal Party's candidate for the eastern Adelaide state seat of Bragg, but was rebuffed with Jack Batty winning the nomination and seat, formerly held by Vicki Chapman.\n\nAfter voicing her frustrations, Ms Potter then became part of a Liberal Party task force aimed at bringing more women into the party and the parliamentary wing.\n\nWas the federal election 'rock bottom' for the SA Liberals? Photo shows James Stevens consoled after conceding defeat After hitting 'rock bottom' at the federal election, the SA Liberals will be hoping the only way from here is up, writes state political reporter Leah MacLennan.\n\nBut the party rejected her suggestion of following Labor's policy of enforcing quotas to boost MP numbers.\n\n\"To be frank, I haven't seen any evidence that task force is being listened to,\" she said.\n\nMs Potter, like many former and current Liberals, is now fearing what the federal election might mean for SA's struggling opposition.\n\nMost tellingly was the loss of the federal seat of Sturt, the party's last remaining South Australian metropolitan seat.\n\nIt was held by former Liberal staffer, James Stevens, but Labor's Claire Clutterham took the seat with a swing of 6.9 per cent.\n\nThe Liberal Party barely won a voting booth in metropolitan Adelaide on May 3.\n\nIf that result was replicated at the state election in March 2026, the Liberals would be decimated with at least six seats changing from Liberal to Labor.\n\nSee how we made this projection.\n\n\"I think the brand is so deeply damaged,\" Ms Potter said.\n\n\"[SA Opposition Leader] Vincent Tarzia can be the nicest guy in the world, but if people look at the Liberal brand and go, 'ugh, I'm not putting my vote there' … it's impossible for any good leader to cut through that.\"\n\nSA could be facing WA-style wipe-out\n\nFormer foreign minister Alexander Downer was part of the powerful Howard Liberal era, when federally the party held nearly all of SA's city seats.\n\nMr Downer concedes there is now a chance the party could be decimated at the 2026 state election, like the state Liberals were in Western Australia in 2021.\n\nAfter that election there were just two Liberal MPs left plus a handful of regional National members.\n\nAlexander Downer says the SA Liberal Party's chances are in doubt at the next election. (ABC News: Che Chorley)\n\n\"It's a risk, there's no doubt about that,\" Mr Downer said.\n\n\"And so the Liberal Party needs to address that and address that right now.\n\n\"It's fundamentally important to SA that the Liberal Party becomes competitive, and I say becomes competitive because it's not very competitive at the moment.\"\n\nFormer Liberal MPs have faced charges\n\nThe Liberal Party has also faced several major controversies, the most significant being criminal charges against former leader David Speirs over the supply of cocaine.\n\nThree former Liberal members — Fraser Ellis, Troy Bell and Nick McBride — have also faced court over unrelated criminal matters.\n\nDespite those many challenges, Mr Tarzia maintains he can win the 2026 election.\n\nVincent Tarzia says the Liberal Party needs to find broader appeal. (ABC News: Marco Catalano)\n\nHe also dismissed voting comparisons between this year's federal and next year's state elections.\n\nMr Tarzia said he was \"certainly not thinking about losing\" his own seat, like his former federal counterpart, Mr Dutton.\n\n\"I think it was a terrible federal campaign,\" he said.\n\n\"I've always been [in] a marginal seat and the benefit of being in a marginal seat is that you can't take anything for granted.\n\n\"I'm staying positive and optimistic, but at the same time we've got to learn the lessons.\"\n\nPort Augusta's nuclear future is off the agenda Photo shows A mechanic with a car. The Coalition's election pledge for nuclear reactors caused deep divisions within the community of Port Augusta — now that it's been taken off the agenda, locals are looking towards different futures.\n\nMr Tarzia has already scrapped nuclear energy as a policy and has slammed the federal party's policy to sack public servants and ruled out making any similar cuts.\n\nHe said the Liberal Party must find a way to better connect with women and millennial and Gen Z voters.\n\n\"Six to seven years ago that might have been around 35 per cent of the votes, probably more than 50 per cent of the vote now, so the electorate has definitely shifted,\" he said.\n\n\"I think it's a lesson for us too that we have to be more inclusive and broader in our appeal.\"\n\nWhile the crushing defeat in the federal election was seen by many Liberals as a rejection of the party's move to the right, it remains to be seen if right-wing power brokers like SA senator Alex Antic will be willing to surrender ground.\n\nMr Antic declined the ABC's offer of an interview.\n\nVoters globally becoming moderate\n\nSouth Australia is now considered by many, even within the Liberal Party, as a Labor leaning state.\n\nThe results clearly back that up with Labor holding power in SA for all but 16 of the past 55 years.\n\nFlinders University associate professor Rob Manwaring says he can't see the Liberal Opposition making its way back into to power for at least another nine years.\n\n\"My reading would be that the Malinauskas government is a very effective and popular government, and I think this is at least a three-term government,\" Mr Manwaring said.\n\nMr Manwaring said that can, in part, be attributed to the fact that globally voters are becoming more moderate, stretching the divide in the Liberal Party between the centre and the right to breaking point.\n\nRob Manwaring says the divide between the centre and the right is growing. (ABC News: Ashlin Blieschke )\n\n\"That wedge is proving even harder or starker than it was 10 to 15 years ago,\" he said.\n\n\"Unless there is some really hard-headed discussion about the future, about what the identity of centre right politics looks like, then there's no reason why political parties don't die.\"\n\nQuotas could help deliver more female Liberal MPs\n\nWhile, even the most optimistic Liberals know the road back to government in SA and federally will be difficult, there is still a sense of opportunity to renew and to rebuild.\n\nMs Potter believes it can be done but that women will need to be front and centre.\n\nLiberal Party's women problem continues Photo shows Michaelia Cash speaks at a press conference with Sussan Ley behind her The Liberal Party has been told it has a women problem for years now, but you only have to look at its results in Western Australia to see how it's still struggling to make progress.\n\n\"Two people in the Liberal Party [in SA's lower house] have a period, so how is my life experience reflected really by that party?\" Ms Potter said.\n\n\"But also, I'm not going to sit aside and let Labor have this clean sweep of my state for the rest of time.\n\n\"I think any opportunity to put a woman in a safe seat is a good one.\n\n\"I think we should be looking at that as the priority and that's where obviously quotas would help maintain the discipline.\"\n\nChelsey Potter says the Liberal Party needs to put female candidates forward. (ABC News: Marco Catalano)\n\nMr Tarzia said quotas, while not the current policy, may need to be considered.\n\n\"I think there comes a point where if after these reports have been put out and we can't bring enough women into the party, then I think quotas are something that we could look at,\" he said.\n\nBut it remains to be seen if Mr Tarzia can learn the harsh lessons of May 3 and turn his struggling party's fortunes around.\n\n\"It's about making sure that we connect with the hearts and the minds of South Australians and make sure that we become relatable and more relevant to South Australians as well,\" he said.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/fisher-harris-sent-for-early-shower-20250518-p5m057.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fisher-Harris sent for early shower",
    "publish_date": "Sun, 18 May 2025 10:58:38 +1000",
    "category": "finance",
    "authors": [],
    "text": "Fisher-Harris sent for early shower\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/culture/theatre/convicts-gold-and-scandal-the-musical-digging-up-our-secret-past-20250515-p5lzl6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Convicts, gold and scandal: the musical digging up our secret past",
    "publish_date": "Sun, 18 May 2025 10:37:22 +1000",
    "category": "lifestyle",
    "authors": [
      "Michael Dwyer"
    ],
    "text": "In a century-old industrial warehouse in Richmond, Shelley Short sings a story twice as old. Through the old tin and timber rings Martha Hayes, a song about the innocent daughter of a transported convict woman, and the mother of Tasmania’s first European child.\n\nAround her, a big band swirls. Mick Thomas, with smashing bushranger beard, leads members of Weddings Parties Anything and guitarist Jeff Lang and other local legends through rehearsals for Vandemonian Lags, a piece of musical-theatre that reckons with colonial Australia’s lesser-known past.\n\nRehearsing for Vandemonian Lags, from left: Mark Wallace, Jen Anderson, Darren Hanlon, Craig Pilkington, Mick Thomas, Shelley Short, Jeff Lang and Ben Salter. Credit: Wayne Taylor\n\n“She got pregnant to a lieutenant,” Short says of the subject of the song. “She was 16; too young. And she settled up next to the river and had the baby there. She didn’t end up staying with the lieutenant because he had a family of his own back home.\n\n“I love a story of a strong woman back in the 1800s. I love it when those stories are lifted up, because history is often told by big white men.”",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/afl/freo-calm-on-jackson-trade-talk-after-win-over-gws-20250518-p5m04q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Freo calm on Jackson trade talk after win over GWS",
    "publish_date": "Sun, 18 May 2025 09:48:10 +1000",
    "category": "sports",
    "authors": [
      "Joanna Guelas"
    ],
    "text": "Fremantle coach Justin Longmuir is refusing to sweat over trade speculation swirling around Luke Jackson, even if Melbourne coach Simon Goodwin has signalled his interest.\n\nIf the 22-year-old premiership ruck had designs for a Melbourne homecoming, he didn’t show it in Fremantle’s 34-point win over GWS at Engie Stadium on Saturday.\n\nStar ruck Jackson is reportedly set to ask for a trade back to the Demons due to escalating personal matters, despite being contracted at the Dockers until 2029.\n\nLuke Jackson (left) contests for the ball with Kieren Briggs at ENGIE Stadium. Credit: AAP\n\nThe speculation grows even after Jackson in March categorically ruled out a return to Victoria, insisting he would remain with Freo long-term.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/business/banking-and-finance/the-23-billion-question-can-our-banks-sustain-their-rivers-of-gold-20250514-p5lz6s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The $23 billion question: Can our banks sustain their rivers of gold?",
    "publish_date": "Sun, 18 May 2025 09:30:00 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "One of the biggest reasons “mum and dad” investors flock to Australian bank shares is the bumper dividends: the billions of dollars paid out to hundreds of thousands of shareholders every six months.\n\nThe big four banks between them paid $23 billion to investors big and small last year, and they account for almost 30 per cent of all dividends on the ASX 200. In our market, only mining titans – BHP and Rio Tinto – rival the big four for how much money they shower on their shareholders.\n\nBank shares are known for their dividends, but some analysts say these payments are unsustainable. Credit: Dominic Lorrimer\n\nThese torrents of cash have made bank shares the bedrock of many small investors’ portfolios, especially those investors who want income from their shares, such as retirees.\n\nHowever, the latest round of bank profit results sparked a genuine discussion about whether banks can keep the dividend cash flowing at this rate (with the exception of CBA, whose dividend is seen as safer). Some veteran bank-watchers are asking: do some of our biggest banks need to cut their highly prized dividends?",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/culture/music/austria-sweeps-to-eurovision-victory-after-nail-biting-finish-20250516-p5lzvv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Austria sweeps to Eurovision victory after nail-biting finish",
    "publish_date": "Sun, 18 May 2025 09:26:16 +1000",
    "category": "sports",
    "authors": [
      "Michael Idato"
    ],
    "text": "Austria has won the 69th annual Eurovision Song Contest, after an almost four-hour long telecast featuring fireworks and songs in 20 different languages, and a brutal semi-final in which Australia was eliminated.\n\nIn an extraordinary photo-finish, Israel dominated the leaderboard by a margin of 99 points. In a final twist, the last block of global TV audience votes handed JJ (aka Jacob Pietsch)’s song Wasted Love an additional 178 points, and confirmation of the win.\n\n2025 Eurovision winner Johannes Pietsch, who performs using the stage name JJ, on stage in Basel, Switzerland. Credit: Cain Cooper\n\nThe final score placed Austria at the top of the leaderboard with 436 points, followed by Israel (357), Estonia (356), Sweden (321), Italy (256), Greece (231), France (230), Albania (218), Ukraine (218) and Switzerland (214). The biggest shock was Sweden’s fall to fourth place, after weeks of predictions that it would win.\n\nAustralia’s tenth journey to Eurovision ended earlier this week, when singer Marty Zambotto, known by the stage name Go-Jo, was ousted from the competition in a shock finish to a hotly contested and densely packed second semi-final.",
    "source": "SMH",
    "cluster_id": 11
  },
  {
    "url": "https://www.smh.com.au/sport/soccer-player-bloodied-after-being-struck-in-head-by-seat-thrown-by-own-fans-20250518-p5m043.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Soccer player bloodied after being struck in head by seat thrown by own fans",
    "publish_date": "Sun, 18 May 2025 09:12:10 +1000",
    "category": "sports",
    "authors": [],
    "text": "Aberdeen defender Jack MacKenzie was injured when he was struck in the head by part of a seat apparently thrown by a supporter of his own team on Saturday.\n\nMacKenzie was an unused substitute during the 2-1 loss at Dundee United in the Scottish Premiership, a result that saw Aberdeen drop to fifth place and outside the potential European qualification places on the final day of the season.\n\nAberdeen player Jack Mackenzie is hit by a seat thrown by one of his own supporters Credit: YouTube\n\nMacKenzie was among people on the field after the match when he was hit by the plastic seat-part thrown from the away fans’ section in the upper deck of the stand. He was knocked over by the impact. He received medical treatment and taken away with a bandage around his head.\n\n“All we know is Jack got a really bad injury as a player doing his job. This cannot happen in this way,” Aberdeen coach Jimmy Thelin told BBC Scotland.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/world/tornadoes-tear-through-us-20250518-p5m04a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tornadoes tear through US",
    "publish_date": "Sun, 18 May 2025 09:05:17 +1000",
    "category": "finance",
    "authors": [],
    "text": "Tornadoes tear through US\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/doohans-cheeky-response-to-colapinto-crash-20250518-p5m03t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Doohan's cheeky response to Colapinto crash",
    "publish_date": "Sun, 18 May 2025 08:09:07 +1000",
    "category": "finance",
    "authors": [],
    "text": "Doohan's cheeky response to Colapinto crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/environment/weather/national-weather-forecast-for-sunday-may-18-20250518-p5m03m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "National weather forecast for Sunday May 18",
    "publish_date": "Sun, 18 May 2025 07:34:17 +1000",
    "category": "finance",
    "authors": [],
    "text": "National weather forecast for Sunday May 18\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/tsunoda-walks-away-from-monster-crash-20250518-p5m03n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tsunoda walks away from monster crash",
    "publish_date": "Sun, 18 May 2025 07:34:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "Tsunoda walks away from monster crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/world/explosion-rocks-city-in-california-20250518-p5m03l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Explosion rocks city in California",
    "publish_date": "Sun, 18 May 2025 07:33:56 +1000",
    "category": "finance",
    "authors": [],
    "text": "Explosion rocks city in California\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/pm-to-invite-pope-to-australia-20250518-p5m03g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "PM to invite Pope to Australia",
    "publish_date": "Sun, 18 May 2025 07:15:19 +1000",
    "category": "finance",
    "authors": [],
    "text": "PM to invite Pope to Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/two-males-fighting-for-life-after-melbourne-crash-20250518-p5m03h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Two males fighting for life after Melbourne crash",
    "publish_date": "Sun, 18 May 2025 07:15:07 +1000",
    "category": "finance",
    "authors": [],
    "text": "Two males fighting for life after Melbourne crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/eurovision-final-2025-winner/hgwuishje",
    "title": "Who is JJ, the winner of Eurovision 2025?",
    "publish_date": "Sat, 17 May 2025 23:17:27 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "After battling it out against 36 other countries, Austria has officially won Eurovision 2025.\n\n\n\n\n\nAustria's entrant, JJ, wowed crowds and more than 160 million watchers worldwide with their song Wasted Love, a ballad turned club anthem with operatic vocals.\n\n\n\n\n\n\"Thank you to you, Europe, for making my dreams come true,\" the 24-year-old said.\n\n\n\n\n\n\"Love is the strongest force in the world. Let's spread more love.\n\n\n\n\n\n\"This is beyond my wildest dreams. It's crazy.\"\n\n\n\nWinner of the Eurovision Song Contest JJ from Austria holds up the trophy onstage he won with the song Wasted Love. Source: AP / Martin Meissner His performance was filmed in black and white, in the 4:3 ratio of the monochrome television era.\n\n\n\n\n\nIt is the third time Austria has won Eurovision, with Udo Jürgens taking home the top spot in 1965 and Conchita Wurst in 2014.\n\n\n\n\n\n\"When JJ sings, it's as if time stops,\" Wurst said.\n\n\n\n\n\nEarlier this year, the two performers released a duet, while JJ said Wurst provided \"many tips\" ahead of Saturday's contest.\n\n\n\n\n\nDescribed by Eurovision as \"A countertenor with a distinctive voice that can reach soprano heights\", the Austrian-Filipino artist's music is classical meets club.\n\n\n\n\n\n\"My song is about my personal experience with wasted and unreciprocated love. I had too much love to put out there; not much came back,\" he told Agence France-Presse during Eurovision week.\n\n\n\n\n\nThe singer has set his sights on a blend known as operatic pop, a \"cross-genre and cross-disciplinary approach (which) demonstrates exceptional versatility and innovative strength\", said Andreas Mailath-Pokorny, rector at Vienna arts and music university MUK, where JJ studies.\n\n\n\nWho is JJ?\n\nJJ, whose real name is Johannes Pietsch, was born in Vienna in 2001 — his father is an IT specialist, and his mother is a Filipino chef.\n\n\n\n\n\nHe got a taste for classical music from his father, especially for Bach and Mozart, while his mother listened to Celine Dion and Whitney Houston.\n\n\n\n\n\nHe was raised in Dubai, where karaoke parties and his father first introduced him to pop and opera.\n\n\n\n\n\nIn Vienna, he later uncovered classical music, refining his skills through talent shows and minor opera roles before Eurovision.\n\n\n\n\n\nHe speaks German, English and Tagalog and has learned Arabic and French.\n\n\n\nIn a recent interview with The Independent, he said that he was \"surrounded by music\" growing up and started singing at a young age.\n\n\n\n\n\nFor those following The Voice UK music contest, he should seem familiar as he participated in the ninth series in 2020 and reached the finals alongside his coach, William James Adams, also known as will.i.am.\n\n\n\nHow was the winner chosen?\n\nAn estimated 160 million people across Europe and beyond were expected to tune in for the annual TV spectacle, where kitsch, glam and spectacular staging go hand in hand.\n\n\n\n\n\nIn the grand final, JJ triumphed over 25 competitors, with performers from 37 nations participating in Eurovision 2025.\n\n\n\n\n\nSeparate jury and viewer votes from each of this year's participating countries -- with equal weight -- plus an extra vote from the rest of the world combined, decided who won the coveted microphone-shaped trophy.\n\n\n\n\n\nAustria earned 178 points from the audience and 257 from the jury, taking them to 435 points in total.\n\n\n\n\n\nIsrael came in second place with 357 points. They also topped the Australian public vote.\n\n\n\nAfter a surge in audience votes, Estonia came in third with 356 points for their coffee bop, Espresso Macchiato.\n\n\n\n\n\nThe favourites coming into the competition were Sweden's KAJ, with their catchy tune about heading to the sauna, Bara Bada Bastu.\n\n\n\n\n\nBut they faded away as the votes came in, finishing fourth ahead of Italy, Greece and France.\n\n\n\n\n\nSwitzerland, France and Italy dominated jury votes but fell short in praise from the audience.\n\n\n\n\n\nEleven were knocked out by public voting in the semi-finals, including Australia's Go-Jo Marty Zambotto, with his tongue-in-cheek Milkshake Man.\n\n\n\n\n\n- Additional reporting by Agence France-Presse.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 11
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/should-artificial-intelligence-be-used-in-job-recruitment/uh8f238gk",
    "title": "Should artificial intelligence be used in job recruitment?",
    "publish_date": "Sat, 17 May 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFor more than a decade, Melbourne-based social enterprise, Sisterworks, has been helping migrant and refugee women enter the workforce.\n\n\n\n\n\n\"If you're in a real interview, you're looking at the person, you're looking at their eyes.\"\n\n\n\n\n\nTraining courses focus on customer service, hospitality and people skills, as well as networking, resume writing and interviewing to ensure the women are 'job ready'.\n\n\n\n\n\nBut Ifrin Fittock, Sisterworks CEO, says late last year, a group of nine graduates found themselves in a situation neither they or their teachers had prepared for.\n\n\n\n\n\n\"We actually got caught on surprise when towards the end of last year we sent about nine sisters to an interview and they didn't make it, they didn't pass the interview. Upon investigation, we found out that they're actually not being interviewed face to face, but actually being interviewed by videos slash AI interviews and because they've never been exposed to it before, I think they just failed because they don't know what to do.\"\n\n\n\n\n\nTheir experience is not unique, with job seekers increasingly sharing their own experiences with so-called \"robo\" interviews on social media.\n\n\n\n\n\nMAN: \"Hello.\"\n\n\n\n\n\nROBOT: \"Hi, thank you so much for joining the interview today. I'm so excited to talk to you and get to know more about you.\"\n\n\n\n\n\n\"Robo\" interviews are when a candidate is interviewed by an AI system rather than a human.\n\n\n\n\n\nFittock says this style of interview can add extra barriers for migrant and refugee applicants.\n\n\n\n\n\n\"The challenges with these AI recruitment or AI interview for some of our sisters is really, first of all, English is not their first language, but also the level of digital literacy that they may or may not have because they need to actually navigate through, apart from answering questions, they also need to navigate that click of a button and pay attention to the timer and all that pressure really mounting up, especially when you see the ticking clock running in front of you. So it's all really quite confronting.\"\n\n\n\n\n\nIn 2024, 43 percent of organisations use AI \"moderately\" in their recruitment, while 19 per cent use the technology \"extensively\" when hiring new staff.\n\n\n\n\n\nThat's according to The Australian Responsible AI report, which details how Australian businesses are tracking when it comes to AI practices.\n\n\n\n\n\nAs employers increasingly embrace AI, video interview training is now part of the Sisterworks job course.\n\n\n\n\n\nFatemeh Hazrati - originally from Iran - is among those currently taking part in the program.\n\n\n\n\n\n\"AI has real big effect on our life nowadays. All of us have to learn it, [and] [We] just need to adapt ourself for new things and accept challenges to learn new things.\"\n\n\n\n\n\nAI in recruitment is often touted for its ability to save both time and money.\n\n\n\n\n\nBut there are mounting concerns around its potential to discriminate.\n\n\n\n\n\nDoctor Natalie Sheard is from the Melbourne Law School at the University of Melbourne.\n\n\n\n\n\nShe led a study published earlier this month that suggests AI hiring systems are creating new barriers to employment.\n\n\n\n\n\n\"So it could be older applicants, women, people who speak English as a second language, job seekers with disabilities. In my research I heard of systems not being accessible to job seekers with disabilities. I heard of CV screening systems using things like gaps in employment history to screen candidates out and having a gap in your employment history is a well-known proxy for gender as women tend to have time out of the workforce to care for family.\"\n\n\n\n\n\nShe also explains how those with English as a second language can be disadvantaged in video interviews.\n\n\n\n\n\n\"Another concern is that the way these systems tend to operate is the AI doesn't assess the video. What happens is the audio from your video is transcribed and then AI is used to evaluate your answer and it's well established that those transcription services perform poorly for people who speak English as a second language or have accents.\"\n\n\n\n\n\nMonash University's Professor Andreas Leibbrandt has also researched the role of AI in recruitment.\n\n\n\n\n\nHe says there are benefits to the technology, and if deployed correctly, a system can be less bias than a human.\n\n\n\n\n\nIn one study, conducted in the US, he found women and non-anglo candidates are more likely to apply for a job if they know AI tools are being used.\n\n\n\n\n\n\"It's not that both women or ethnic minorities feel there's no bias in the AI algorithm, but they feel that this bias is less so than when they're faced with a human recruiter.\"\n\n\n\n\n\nBut he's concerned by a lack of transparency, regulation and potential bias built into algorithms.\n\n\n\n\n\n\"These AI algorithm are fed with training data sets or data sets from corporations. But their training data in itself may be biased. It may come from an organisation where there was, for instance, bias against women.\"\n\n\n\n\n\nThe issue around data sets and algorithms also emerged in Doctor Sheard's research.\n\n\n\n\n\n\"So one example there is a lot of these systems are built overseas, so they might've been trained on data on populations that aren't comparable to the Australian population. And therefore again, the system won't perform as well for particular demographic groups that we have in Australia. For example, refugees, migrant women, first Nations, Australians.\"\n\n\n\n\n\nThere are growing calls for the Australian government to better regulate the use of AI in recruitment.\n\n\n\n\n\nCatherine Hunter, is the CEO of Diversity Council Australia - the independent not-for-profit peak body leading diversity and inclusion in the workplace.\n\n\n\n\n\n\"With such high adoption rates and the rapid acceleration of the technology, we're just concerned that people aren't putting in place the proper considerations around ethical use.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/heavy-menstrual-bleeding-hysterectomy-uterectomy-terminology-womens-health/d6fp5ayow",
    "title": "Michelle's condition 'ruined' her. Treatment was life-changing, but it has a concerning label",
    "publish_date": "Sat, 17 May 2025 20:37:34 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "A $793 million investment into women's health has been celebrated, but there are concerns over a lack of specific reference to a condition affecting many women.\n\n\n\n\n\nHeavy menstrual bleeding is often excluded from discussions around women's health despite it being a disruptive, and sometimes crippling, condition.\n\n\n\n\n\n\"I'd get out the door and I would flood to the point where I'd have to come back and change again,\" said Michelle Watts, as she recounted a ski trip — one of many occasions where she bled through layers of clothing.\n\n\n\n\n\n\"And I'd literally just sit down and cry and think, 'I can't do this anymore', because it was ruining every aspect of my life,\" the 60-year-old said.\n\n\n\n\n\nFor 18 months from 2021, Watts suffered from heavy menstrual bleeding, which the Australian Commission on Safety and Quality in Health Care (ACSQHC ) defines as excessive menstrual blood loss that interferes with a woman's quality of life.\n\n\n\n\n\n\"I was about as sad as I could ever be because everything was impossible to do in my eyes by the end. I couldn't go swimming with my friends anymore, swimming became challenging, going to the gym became challenging,\" Watts said.\n\n\n\n\n\n\"All those things that I loved to do, I just couldn't do.\"\n\n\n\n'Time to change' the language\n\nAfter many failed treatments, Michelle finally underwent a uterectomy, traditionally known as a hysterectomy.\n\n\n\n\n\nThe original terminology for this procedure has some specialists concerned due to its links to the Greek word 'hysteria'.\n\n\n\n\n\nDr Talat Uppal is a gynaecologist and director at Women's Health Road and is in the process of changing the language, which she says was inaccurately used to explain women's emotional and physical concerns.\n\n\n\n\n\n\"Often when I'm using the word hysteroscopy or hysterectomy it brings back that association of centuries-old myth which is something that is important to defuse and re-word to a more anatomical one\", Dr Talat said.\n\n\n\n\n\nAlso in the push to change the medical language is the CSIRO, Australia's national science agency, which is responsible for updating global standards for clinical terminology.\n\n\n\nDr Talat Uppal is a gynaecologist and director at Women's Health Road. Source: Supplied Katrina Ebril is the Interoperability Lead with the Australian e-Health research centre at the CSIRO and says this change is a first when it comes to women's bodies.\n\n\n\n\n\n\"It's definitely time to change ... and we do this for other procedures,\" Ebril said.\n\n\n\n\n\n\"It is a uterectomy, let's call it what it is, and start to use that much more positive language and much more language that aligns to what the actual procedure is.\"\n\n\n\n\n\nFor women like Watts, removing taboos around menstruation is key to making treatment more accessible, and encouraging others to seek help.\n\n\n\nWho suffers from heavy menstrual bleeding?\n\nOne in four people who menstruate suffer from heavy menstrual bleeding, according to the ACSQHC, and two thirds of those experience iron deficiency.\n\n\n\n\n\nYet the commission notes less than half of women suffering from the condition visit a doctor.\n\n\n\n\n\n\"Traditionally or historically, women have been left out of research, and sometimes even the animals in the labs were male animals,\" Uppal said.\n\n\n\n\n\n\"And so this is a long historical background of disadvantage of not including women, and we really want to change that narrative when it comes to heavy bleeding.\"\n\n\n\n\n\nUppal welcomes a number of measures in the federal government's multi-million dollar investment in women's health , but would like to see more attention given to this issue.\n\n\n\n\n\n\"I think it's just part of that silence around heavy menstrual bleeding ... and I don't think it's deliberate, I feel it's just a culture where it's not front of mind,\" she said.\n\n\n\nWatt believes a lack of awareness is why she struggled to receive adequate care for months.\n\n\n\n\n\n\"It's just been so normalised ... and I don't think it should be, I don't think it's normal,\" Watt said. \"And it's really hard to get any information because it's just taken as: 'Well, you're a woman, this is what happens.'\"\n\n\n\n\n\nShe can't imagine what her life would have looked like without undergoing the procedure, now relishing the active lifestyle she was once forced to sacrifice.\n\n\n\n\n\n\"My ability to participate in skiing, running, swimming ... all of the things that I wanted to enjoy, that's all possible again, I never have to worry about that ever again, it's like an absolute new lease of life,\" she said.\n\n\n\n\n\nLearn more about medical misogyny and discrimination in our health system by listening to the podcast series 'Hysterical' by SBS News .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/live-blog/eurovision-2025-final-live-updates-and-coverage/1wq3ldaeu",
    "title": "Austria's JJ wins 2025 Eurovision Song Contest - as it happened",
    "publish_date": "Sat, 17 May 2025 19:05:09 +0000",
    "category": "sports",
    "authors": [],
    "text": "How do they change the sets so quickly?\n\nFun fact: The backstage team at Eurovision only has about 35 seconds to change the set.\n\n\n\nThat's all the time they get to make sure the props are swapped out for the next performance and to get all the performers ready, mic'd up, and in the right spot.\n\n\n\n\"We call it the Formula 1 tyre change,\" Richard van Rouwendaal, the Dutch Eurovision stage manager told BBC.\n\n\n\n\"Each person in the crew can only do one thing. You run on stage with one light bulb or one prop. You always walk on the same line. If you go off course, you will hit somebody.\"\n\n\n\n\"It's a bit like ice skating.\"\n\n\n\nThe stage crew has about two weeks to practice before the big day.\n\n\n\n— Alexandra Koster",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/an-outbreak-of-this-once-eradicated-disease-has-been-declared-on-australias-doorstep/amserdjy4",
    "title": "An outbreak of this once-eradicated disease has been declared on Australia's doorstep",
    "publish_date": "Sat, 17 May 2025 08:55:23 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "A polio outbreak has been declared in Papua New Guinea, sparking concern about the disease's spread in a country with low vaccination rates, health officials said.\n\n\n\n\n\nPoliovirus, most often spread through sewage and contaminated water, is highly infectious and potentially fatal.\n\n\n\n\n\nIt can cause deformities and paralysis, and mainly affects children under five years old.\n\n\n\nIn some remote villages in PNG polio vaccination rates are thought to be as low as 7 per cent. Source: AAP / Brendan Esposito The virus was detected in wastewater and environmental samples in the Pacific nation's capital Port Moresby and second-largest city Lae, the World Health Organization (WHO) said.\n\n\n\n\n\nIn subsequent testing, two children in Lae were found to have the poliovirus type 2 strain, according to the WHO representative in Papua New Guinea, Sevil Huseynova.\n\n\n\n\n\nThe confirmation of community transmission in the children \"constitutes a polio outbreak\", Huseynova said in briefing notes provided to AFP.\n\n\n\n\n\n\"Polio is a highly infectious disease, and in communities with low polio immunisation rates, the virus quickly spreads from one person to another,\" Huseynova said.\n\n\n\n\n\nThe health agency \"expresses deep concern over the confirmed outbreak\", she said.\n\n\n\nDr Matt Mason is a lecturer in nursing in the School of Health, Centre for Pacific Islands Research at the University of the Sunshine Coast.\n\n\n\n\n\nHe said with only 47 per cent of PNG children fully immunised, and some districts reporting coverage as low as 8 per cent, \"pockets of extreme vulnerability exist\".\n\n\n\n\n\n\"Infection prevention and control must begin at the community level. Strengthening water, sanitation, and hygiene infrastructure in both urban settlements and remote villages is essential to curb faecal–oral spread.\"\n\n\n\n\n\nHe recommended health authorities collaborate with trusted partners, such as churches and women’s groups, to disseminate hygiene kits and promote hand‑hygiene stations at schools, markets, and health services.\n\n\n\nTracing PNG's polio outbreak\n\nGenetic testing showed the polio strain detected in Papua New Guinea was linked to one circulating in Indonesia.\n\n\n\n\n\nPapua New Guinea was certified as polio-free in 2000, but immunisation rates among children are low.\n\n\n\n\n\nPapua New Guinea health minister Elias Kapavore said the situation was \"serious but manageable\".\n\n\n\n\"We've dealt with this before and know what works,\" he told reporters on Thursday.\n\n\n\n\n\n\"Vaccination is safe and effective, and we're acting quickly to keep children protected.\"\n\n\n\nIs there a risk of polio spreading to Australia?\n\nAustralia has been polio-free since 2000 and hasn't had a major outbreak of the disease since 1961. Children are routinely vaccinated against the illness.\n\n\n\n\n\nDr Yong Gao (Nias) Peng is a CSIRO early research career fellow at CSIRO Health and Biosecurity.\n\n\n\n\n\n\"While the risk of polio spreading to Australia is considered low due to high vaccination rates and robust public health infrastructure, it is recommended that travellers to PNG ensure their polio vaccinations are up to date,\" Peng says.\n\n\n\n\n\n\"Continued surveillance for poliovirus and support for PNG's immunisation efforts are crucial to contain the outbreak and prevent international spread.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/afl-world-in-shock-as-former-player-adam-selwood-dies-months-after-brothers-death/ykd779laa",
    "title": "AFL world in shock as former player Adam Selwood dies months after brother's death",
    "publish_date": "Sat, 17 May 2025 06:16:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "Key Points Former West Coast Eagles player Adam Selwood has died at the age of 41, his family has said in a statement.\n\nThe head of the AFL and Selwood's former coach have led tributes to him.\n\nSelwood's identical twin brother, former Brisbane Lions player Troy Selwood, died in February.\n\nWest Coast Eagles premiership star Adam Selwood has been remembered as the ultimate team man with an infectious personality, after his sudden death aged 41.\n\n\n\n\n\nSelwood's tragic passing in Perth on Saturday came just three months after his identical twin and fellow former AFL player Troy Selwood died.\n\n\n\n\n\nMembers of the AFL's famous Selwood family, Adam and Troy were brothers of Geelong champion Joel and former Eagles and Cats midfielder Scott.\n\n\n\n\n\nAdam Selwood played 187 games for West Coast, including the 2006 premiership, before retiring from football in 2013.\n\n\n\n'We are heartbroken'\n\n\"We are heartbroken by the passing of Adam earlier today. Words cannot express the grief and sadness we feel,\" the Selwood family said in a statement via the AFL on Saturday.\n\n\n\n\n\n\"Adam was a loving husband, and an incredible father to Lenny and Billie. We are devastated to lose such a wonderful husband, father, son and brother.\n\n\n\n\n\n\"We will miss Adam deeply — his spirit, his kindness, and the joy he brought to every room. His determination, the lessons he shared, and his infectious personality will stay with us always.\n\n\n\n\n\n\"Adam had a unique ability to make people feel special, and our family was lucky to experience that every day.\n\n\n\n\n\n\"We kindly ask for privacy as we navigate this difficult time.\"\n\n\n\nFormer West Coast coach leads tributes\n\nWest Coast's 2006 premiership coach and current head of football John Worsfold led tributes to Selwood on Saturday.\n\n\n\n\n\n\"Adam was a great teammate who loved the club and loved his footy,\" Worsfold said in a statement.\n\n\n\nAdam Selwood played for West Coast when it won a premiership in 2006. Source: Getty / Mark Dadswell \"He always put his mates and team first, and he would be saying that now. He would be wanting to see our club grow and return to having on-field success once again.\n\n\n\n\n\n\"We drafted him at 18 and watched him grow as a player and person.\n\n\n\n\n\n\"We got to know the Selwood family so well over the years, and they are such wonderful people who our hearts go out to more than anything today.\"\n\n\n\n\n\nAFL chief executive Andrew Dillon said he could not imagine the pain of the Selwood family.\n\n\n\n\n\n\"On behalf of the AFL and all of our clubs, I want to send our love to his wife Fiona and their two children, to Maree and Bryce Selwood, Joel and Scott, and their families, and all of Adam's many friends and colleagues and past team mates at West Coast and across football,\" Dillon said in a statement.\n\n\n\n\n\nAdam's brother Troy Selwood, who played 75 games for the Brisbane Lions, died in February and was remembered by Adam as a \"built-in best mate\" at his funeral.\n\n\n\n\n\nAdam declared writing the eulogy was the \"hardest thing\" he had ever had to do.\n\n\n\nAdam Selwood (on stage) said writing the eulogy for his brother Troy Selwood was the hardest thing he had ever had to do. Source: Getty / Michael Willson/AFL Photos \"Having an identical twin is both a rare privilege and wonderfully complex,\" Adam said at Troy's memorial service at GMHBA Stadium in February.\n\n\n\n\n\n\"A twin is more than a sibling, they are a constant presence, a built-in best mate and someone who understands you in a way that no-one ever could.\n\n\n\n\n\n\"Troy wasn't just my brother; he was my mirror, my fiercest competitor, my greatest ally and the one person that knew what I was always thinking.\n\n\n\n\n\n\"Losing him has left a massive hole in my life.\"\n\n\n\n\n\nOriginally from Bendigo, Adam Selwood moved to Perth when he was drafted by West Coast in 2002.\n\n\n\n\n\nHe joined the Eagles' coaching ranks after his retirement as a player, working with the club's AFL and AFLW teams.\n\n\n\n\n\nSelwood was also West Coast's inaugural head of female football, charged with setting up the club's AFLW team.\n\n\n\n\n\nReaders seeking support with mental health can contact Beyond Blue on 1300 22 4636. More information is available at beyondblue.org.au . Embrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-will-be-on-the-rbas-mind-as-it-weighs-a-rate-cut-next-week/ae2e7rncu",
    "title": "What will be on the RBA’s mind as it weighs a rate cut next week",
    "publish_date": "Sat, 17 May 2025 04:58:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Reserve Bank of Australia (RBA) will be meeting on Tuesday, where it will determine if it drops the cash rate target from 4.1 per cent.\n\n\n\n\n\nInflation has been on the decline, but the RBA could be wary of acting too soon, which an economist says might \"unleash animal spirits\".\n\n\n\n\n\nAt its first meeting of the year in February, it reduced the target from 4.35 per cent, but kept it steady at its latest meeting in April .\n\n\n\n\n\nThe RBA will have a lot to consider ahead of its decision.\n\n\n\nWhich data is worth paying attention to?\n\nThe Australian Bureau of Statistics released data on the wage price index and labour force growth this past week, but experts have told SBS the data will not significantly impact RBA decision-making.\n\n\n\n\n\nSally Tindall, data insights director at financial comparison site Canstar, said the RBA would be looking at several factors to make its decision on Tuesday, chiefly inflation and global uncertainty.\n\n\n\n\n\n\"There will be lots of data, it [the RBA] looks at like recent wage data and labour force growth. It's all a real melting pot of information,\" she told SBS News.\n\n\n\n\n\n\"But inflation is always at the forefront for the Reserve Bank and weighing that up with risk factors like the global economy.\"\n\n\n\n\n\nThe RBA aims to keep inflation between 2 to 3 per cent.\n\n\n\n\n\nThe most recent data for the March quarter had trimmed mean inflation at 2.9 per cent, which is a positive sign that the Reserve Bank could reduce the cash rate target on Tuesday.\n\n\n\nInflation within RBA target\n\nRSM Australia economist Devika Shivadeka said trimmed mean inflation, which doesn't take into account temporary price changes, is \"particularly important\".\n\n\n\n\n\n\"Trimmed mean strips out the noise that comes with temporary subsidies and shows that inflation is organically coming down,\" she told SBS News.\n\n\n\n\n\n\"They would be aware of other data and other risk, for instance at the last meeting the RBA spoke about subdued growth as a reason to not make a cut.\"\n\n\n\n\n\nShivadeka also noted that the Consumer Price Index was also in a good place at 2.4 per cent, again within the RBA target range.\n\n\n\n\n\nBetashares chief economist David Bassanese said a steady unemployment rate was also a sign of a healthy economy.\n\n\n\n\n\n\"We are seeing a solid unemployment number of 4.1 per cent, we are getting strong employment growth but we're also getting strong labour supply.\"\n\n\n\n\n\nBut Bassanese said the RBA could remain cautious, and keep rates on hold as it did at its last meeting in March.\n\n\n\nSource: SBS News\n\n'Unleash animal spirits'\n\nHe said that since trimmed mean inflation is only within target by 0.1 per cent, the RBA could be reluctant to \"unleash animal spirits\", or potentially invoke too much optimism about the health of the economy.\n\n\n\n\n\n\"Inflation is just within the band. So they may feel the economy doesn't need a rate cut, and that cutting rates now might slow the hope for a continued rate of declining inflation,\" he said.\n\n\n\n\n\n\"We may see a strong rebound in house prices, a strong rebound in consumer spending, and maybe frustrate what has been an encouraging downtrend in inflation.\"\n\n\n\n\n\nKeeping inflation on the decline is not the only thing weighing on the RBA's mind, he said, as global risks can also play a part in setting the cash rate.\n\n\n\nGlobal risks\n\nBassanese said market concerns around US President Donald Trump's tariffs have died down, but still present a \"major risk\" in the next six to 12 months.\n\n\n\n\n\nGlobal stock markets surged on Monday after the United States and China agreed to slash steep tariffs for at least 90 days.\n\n\n\n\n\n\"I think tariff uncertainty would still be weighing on the RBAs' thinking at the moment,\" he said.\n\n\n\n\n\n\"I think the increase in global risks as a result of Trump has certainly not been removed and is certainly higher than it was a few months ago.\"\n\n\n\n\n\nShivadeka said the knock-on effect of Trump's policies is important to pay attention to.\n\n\n\n\n\n\"It's not just what Trump does, but it's also how other countries react to what he does,\" she said.\n\n\n\n\n\n\"With all these on-again, off-again tariffs, the RBA could want to wait and see.\"\n\n\n\nBanks and economists predict a rate cut\n\nHowever, she said domestically, Australia was in a strong position to see a rate cut.\n\n\n\n\n\n\"As long as Australia is not directly in the global firing line, I think we would be comfortable moving based on what is happening domestically, while keeping a very keen eye on what's happening globally,\" she said.\n\n\n\nSource: SBS News Shivadeka and Bassanese both predicted the RBA would reduce the cash rate target by 0.25 percentage points to 3.85 per cent.\n\n\n\n\n\n\"Trump has sort of backtracked a little on the tariffs. They still pose risks, but maybe not as great a risk that we previously had thought,\" Bassanese added.\n\n\n\n\n\nCommonwealth Bank, Westpac and ANZ are all predicting the RBA will reduce the cash rate target by 0.25 percentage points. NAB is forecasting a double cut, which would result in a drop of 0.5 percentage points.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/how-a-custom-made-gene-therapy-could-save-one-babys-life/njptayube",
    "title": "How a custom-made gene therapy could save one baby's life",
    "publish_date": "Sat, 17 May 2025 02:34:17 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt’s a medical breakthrough that could change how we treat some of the rarest and most devastating diseases on the planet.\n\n\n\n\n\nIn the United States, a desperately ill baby has defied the odds, thanks to a personalised gene editing therapy crafted, just for him.\n\n\n\n\n\nDoctors say this is just the beginning, and that one day, millions could benefit from the same technology.\n\n\n\n\n\nBaby KJ Muldoon was born with CPS1 deficiency, a condition that affects around one in a million babies.\n\n\n\n\n\nIt prevents his body from clearing toxic ammonia from the blood, often leading to brain damage or death within the first year of life.\n\n\n\n\n\nBut now, at just over nine months old, KJ is alive and showing early signs of improvement, thanks to a custom gene therapy developed just for him.\n\n\n\n\n\nDr Rebecca Ahrens-Nicklas is a gene therapy expert at the Children’s Hospital of Philadelphia, who helped lead the development of KJ’s treatment.\n\n\n\n\n\nShe explains the rare condition he was born with, and how her team approached it.\n\n\n\n\n\n\"KJ was born with an incredibly severe ultra-rare disease called CPS1 deficiency. And over the past nine months since he was born, we've crafted a personalised therapy designed to correct one of his specific genetic changes that make him sick.\"\n\n\n\n\n\nThe therapy, based on Clustered Regularly Interspaced Short Palindromic Repeats also known as CRISPR [[Crisper]] technology, chemically edits one letter of DNA rather than cutting the genetic code, reducing the chance of unintended damage.\n\n\n\n\n\nKJ has now had three rounds of treatment without complications.\n\n\n\n\n\nDr Ahrens-Nicklas shares the progress he’s made.\n\n\n\n\n\n\"And we were able to make the therapy and give KJ the first dose when he was between six and seven months of age. We're happy to share that he's received three doses of the therapy without any complications and he's showing some early signs of benefit.\"\n\n\n\n\n\nFor KJ’s father, Kyle Muldoon, the science was overwhelming at first.\n\n\n\n\n\nBut he says Dr Ahrens-Nicklas helped them understand just how extraordinary the treatment could be.\n\n\n\n\n\nMr Muldoon recalls that first conversation.\n\n\n\n\n\n\"And when we had met with Dr. Ahrens-Nicklas, I had a very profound feeling about this gene editing, which was such a foreign concept. I mean, still, is a very foreign concept, but at the time, and to Dr. Ahrens' credit, she was so humble in the way she was telling us about this extraordinary thing that was essentially going to possibly save and enhance our child's life.\"\n\n\n\n\n\nAnd for Nicole Muldoon, KJ’s mother, even the smallest milestones feel monumental.\n\n\n\n\n\nJust months ago, doctors were discussing palliative care and liver transplants.\n\n\n\n\n\nNow, she says, every sign of progress is proof the therapy may be working.\n\n\n\n\n\n\"In all honesty, all milestones that he's reaching or like developmental moments that he is reaching show us that things are working ... the prognosis for him was very different before we started talking about gene editing and the infusions. We were talking more about like comfort care, liver transplant, and high, you know, very severe delays due to the ammonia build-up and the damage that that could bring. So anytime we see even the smallest milestone that he's meeting, like a little wave or rolling over, that's a big moment for us, because six, seven months ago, we were having very different conversations of what that may look like.\"\n\n\n\n\n\nKJ is one of an estimated 350 million people globally living with rare diseases, most of them genetic.\n\n\n\n\n\nThough personalised therapies like his are still experimental and expensive, scientists hope they can eventually scale the technology to help more patients.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/volunteers-play-a-significant-role-in-australia-but-numbers-are-dropping/5ya92l0kw",
    "title": "Volunteers play a significant role in Australia, but numbers are dropping",
    "publish_date": "Fri, 16 May 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAs washing machines whir in the mobile laundry van, 75 year old Dave Paulsen sits and chats.\n\n\n\n\n\nHe's been volunteering with not-for-profit organisation Orange Sky in the Northern Rivers since 2019, offering free laundry services and showers to people experiencing homelessness or hardship.\n\n\n\n\n\n\"It gives them that boost for the day, they can come and feel like they're like normal people who are able to wash their clothes every day, or have a shower every day. Whereas some of these people, at times we've had people come who haven't been able to wash their clothes for two or three weeks.\"\n\n\n\n\n\nMore than 122,000 Australians experience homelessness on any given night . .\n\n\n\n\n\nMr Paulsen says as well as providing a safe space where people can come and look after their cleanliness, the mobile laundry also offers a chance to connect with others.\n\n\n\n\n\n\"While their washing is being done- it usually takes around an hour, an hour and ten minutes. They'll wash and dry them- they can sit and chat and tell us their story, or just discuss general world events. And quite a lot of people will just sit and talk. Quite a lot of them don't even get their washing done. They know we're going to be at a place on a day every week, and they'll come along just for a bit of conversation.\"\n\n\n\n\n\nCreating opportunities for connection is also at the heart of 19 year old Rheanca Lincoln's work as a volunteer in her community in Toowoomba.\n\n\n\n\n\nAlong with a group of other young people, she founded We Are Not Alone , which brings young people with disability from regional towns together for workshops and social events.\n\n\n\n\n\n\"I think loneliness right now is at the highest prevalence in young people, and I think that volunteering can be a really creative way to combat that. Because for me, it really allowed me to break out of my 14 year old shell and see the world from a different perspective, and it really shaped the journey I'm on now.\"\n\n\n\n\n\nFor Stephanie Harvey, a Bidjara woman from central Queensland and the CEO of First-Nations-led organisation Community First Development, volunteering is all about these reciprocal relationships.\n\n\n\n\n\nThe organisation brings skilled volunteers - from lawyers and builders to engineers and teachers - together with First Nations communities to work on various projects.\n\n\n\n\n\nMs Harvey says the bonds that form between volunteers and communities are key to what makes their projects work.\n\n\n\n\n\n\"Volunteering in First Nations communities, when it's done the right way, it's not about giving, it's not about welfare, and it's certainly not extractive. It really is about connection and genuine relationships. Our volunteers don't help, they work alongside community members, learning from each other and building relationships. It really is that two-way exchange, where volunteers share their skills and experience, but also gain a deeper understanding of culture, respect and connection.\"\n\n\n\n\n\nWhile around a fifth of Australia’s formal volunteers are involved in community services, welfare, and homelessness, another sector where volunteers make major contributions is emergency and natural disaster response.\n\n\n\n\n\nHarmandeep Singh Sidhu from Coffs Harbour is a volunteer with the Rural Fire Service.\n\n\n\n\n\nHe was recently awarded for saving the life of another crew member during a bushfire in the Clarence Valley in 2023.\n\n\n\n\n\nMr Sidhu told SBS Punjabi about his own decision to support his community to cope with and recover from natural disaster- something he plans to do for as long as he is able to do so.\n\n\n\n\n\n\"I joined the RFS in 2020 when I only thought of dealing with the fires around my farm/residence. But later I liked the services that they provide in dangerous and vulnerable situations. I have also served during the Lismore floods in 2022. After that, I decided to join this service forever. \"\n\n\n\n\n\nThese are just some stories from the nearly 6 million Australians who volunteer every year.\n\n\n\n\n\nWhile Volunteer Week celebrates the significant contribution volunteers make to Australian society, CEO of Volunteering Australia Mark Pearce says numbers of volunteers have been dropping.\n\n\n\n\n\n\"There's been a long term decline in the rate of what we would term formal volunteering. That is people who volunteer their time through organisations and into community. Percentage wise, there are less volunteers than there were three years ago, five years ago and ten years ago.\"\n\n\n\n\n\nBarriers to participation such as out of pocket costs, and reliance on volunteers to deliver essential services without adequate training are some of the reasons Volunteering Australia identifies for this decline.\n\n\n\n\n\nMr Pearce says more funding is needed to ensure those who dedicate their time to helping others can do so in a sustainable and supported way.\n\n\n\n\n\n\"Volunteering is fundamental to the health and wellbeing every community. As a consequence, the Federal, as well as State and Territory governments have a responsibility to remove the burdens from people who put up their hands and say \"I have a commitment to my community.\"\n\n\n\n\n\nHe says this Volunteer Week is a chance to stop and think about the stories of dedication and commitment to change behind every volunteer.\n\n\n\n\n\n\"They give you a sense of what can be done. They give you a sense of what can be done. From time to time we can all feel a bit helpless, volunteering is somewhat unique in giving us the agency to do things that matter to us, to stop that feeling of helplessness and give us an opportunity to be involved. And the stories reflect that.\"\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-record-numbers-of-malicious-data-breaches-recorded-how-do-you-protect-yourself/x6fiwc7ql",
    "title": "INTERVIEW: Record numbers of malicious data breaches recorded - how do you protect yourself?",
    "publish_date": "Fri, 16 May 2025 21:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/home-grown-coffee-is-tibors-passion-precision-roasted-by-flamethrower/kuo53sy81",
    "title": "Home-grown coffee is Tibor's passion, precision-roasted by flamethrower",
    "publish_date": "Fri, 16 May 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt’s one reason local growers are busy planting, as ................ explains.\n\n\n\n\n\n[[PACKAGE]]\n\n\n\n\n\nThat’s the sound of a gas-powered flame thrower firing into a rotating concrete mixer.\n\n\n\n\n\nBut it’s not concrete that’s going round and round - it’s coffee beans.\n\n\n\n\n\nBorn in Yugoslavia, Hungarian migrant Tibor Pinci has developed his own unique way of roasting green coffee beans at his small plantation in the hills above Coffs Harbour in Northern New South Wales.\n\n\n\n\n\nHe knows from the sound of the beans popping exactly when to stop - a few seconds too long, and the batch is spoiled.\n\n\n\n\n\n“We call it an open roaster. So that one, tumbling it, and of course you go with the flame in there, and that involves a lot of precision, because it can be just overdone or underdone in a few seconds.”\n\n\n\n\n\nThere are around 500 coffee growers in Australia, many of them in northern New South Wales and Queensland.\n\n\n\n\n\nAs global coffee prices soar, small plantations like Tibor’s are multiplying.\n\n\n\n\n\nHe describes his as a ‘hobby farm’, but he’s still producing 500 kilograms of roasted coffee a year.\n\n\n\n\n\nA baker by profession, his first attempts at growing coffee plants weren’t encouraging when they lived in Sydney.\n\n\n\n\n\n“So coffee starts growing, comes winter, they die. So it happened about three times before I find out they don't like frost. So in the end, I got about a thousand little seedlings, and I brought it up here to Coffs, because my wife is from Coffs, so my mother-in-law is here. And I said, just look after them, water them once a week, and should be all right. So months later, we came back, and the trees were like a couple of foot tall.”\n\n\n\n\n\nThe process is quite laborious.\n\n\n\n\n\n“I handpick all my cherries when they're beautifully ripe. We dry the cherries as well, because we're making the coffee berry tea out of that one, then the beans get dried and then before I roast, they get hulled it means the white shell comes off to get the green bean and then the green bean can be roasted.”\n\n\n\n\n\nTibor’s customers say they love the full aroma of his coffee with no bitterness.\n\n\n\n\n\nSo what’s the secret?\n\n\n\n\n\nAt Southern Cross University in Lismore, researchers are trying to figure that out.\n\n\n\n\n\nProfessor Tobias Kretzschmar says coffee growing is not new to Australia\n\n\n\n\n\n“As far as I'm aware, coffee arrived pretty much with the first fleet and there's been attempts since to establish an industry and it's been thriving in the last 20 to 30 years.”\n\n\n\n\n\nWhile producers are happy with the quality of the coffee, he says to make the industry more sustainable, they’re researching other varieties of coffee bush more suited to Australia.\n\n\n\n\n\n“The problem they're having is they put their money on a variety that's much too vigorous for this environment. Keeps growing. It's one of the older varieties that's not dwarfing like the new ones, meaning every couple of years the growers will have to prune it. The tree is stressed, won't produce the next year. So a lot of work and yield losses affiliated with the old varieties.”\n\n\n\n\n\nHe says a key part of their research is finding out what makes Australian coffee different.\n\n\n\n\n\nThat’s where his colleague, Dr Ben Liu comes in:\n\n\n\n\n\n“So we're doing analysis on coffee, trying to understand the flavour and the taste of coffee. At the same time, trying to actually create a chemical fingerprint for our coffee. That means when you have a good cup of coffee or bad cup of coffee, you don't know what's going on there. If you can do a chemical analysis, you know what's in there. So next time you can keep producing a good cup of coffee.”\n\n\n\n\n\nHe says coffees grown in Queensland and New South Wales have their own individual flavour characteristics.\n\n\n\n\n\n“Can be a big difference from farm to farm. Just for example, some of the farms produce coffee. in the far north of Queensland. They produce more traditional coffee flavour, like a cocoa and nutty, those coffee flavour. Here, in the subtropical area in northern New South Wales or southeast Queensland, our coffee tend to actually smell and taste more like fruity and juicy.”\n\n\n\n\n\nAt Tibor’s farm, nothing is wasted.\n\n\n\n\n\nHe sells roasted beans online and at the Sunday morning market in Coffs Harbour.\n\n\n\n\n\nAnd he makes tea from the dried berries, and flour from the hull of the beans, all full of healthy antioxidants.\n\n\n\n\n\nAs for the flavour - Tibor simply knows what his customers like:\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-beetlejuice-20250518-p5m05a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "If you’re only going to see one musical this season, let it be Beetlejuice",
    "publish_date": "Sun, 18 May 2025 12:10:46 +1000",
    "category": "entertainment",
    "authors": [
      "Cameron Woodhead",
      "Tony Way"
    ],
    "text": "MUSICAL THEATRE\n\nBeetlejuice ★★★★★\n\nMusic and lyrics: Eddie Perfect, Book: Scott Brown and Anthony King\n\nRegent Theatre, until August 3\n\nIf you can only afford one ticket this musical theatre season, Beetlejuice is the show to see. The highly anticipated Australian premiere nailed it on opening night, with Eddie Perfect leading an offbeat triumph of camp gothic – one that dives into a bottomless abyss of musical comedy and compulsively erupts into infectious mayhem. It’s terrific fun.\n\nKaris Oka and Eddie Perfect in a scene from Beetlejuice. Credit: Joe Armao\n\nPerfect wrote the music and lyrics for this Broadway adaptation of the 1988 Tim Burton classic, keeping the dark cartoonish quality that makes Burton’s work so distinctive, and tweaking the story to allow all the humour and havoc to play a greater role in rectifying emotional disorder.\n\nIt is, as Beetlejuice sings with ghoulish glee from the outset, a show about death, and there’s liberating excess in the black comic relish the musical takes in skewering the fakery of false positivity, or the denial and repression of sadness and rage.",
    "source": "TheAge",
    "cluster_id": 37
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/fisher-harris-sent-for-early-shower-20250518-p5m057.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fisher-Harris sent for early shower",
    "publish_date": "Sun, 18 May 2025 10:58:38 +1000",
    "category": "finance",
    "authors": [],
    "text": "Fisher-Harris sent for early shower\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/culture/theatre/convicts-gold-and-scandal-the-musical-digging-up-our-secret-past-20250515-p5lzl6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Convicts, gold and scandal: the musical digging up our secret past",
    "publish_date": "Sun, 18 May 2025 10:37:22 +1000",
    "category": "lifestyle",
    "authors": [
      "Michael Dwyer"
    ],
    "text": "In a century-old industrial warehouse in Richmond, Shelley Short sings a story twice as old. Through the old tin and timber rings Martha Hayes, a song about the innocent daughter of a transported convict woman, and the mother of Tasmania’s first European child.\n\nAround her, a big band swirls. Mick Thomas, with smashing bushranger beard, leads members of Weddings Parties Anything and guitarist Jeff Lang and other local legends through rehearsals for Vandemonian Lags, a piece of musical-theatre that reckons with colonial Australia’s lesser-known past.\n\nRehearsing for Vandemonian Lags, from left: Mark Wallace, Jen Anderson, Darren Hanlon, Craig Pilkington, Mick Thomas, Shelley Short, Jeff Lang and Ben Salter. Credit: Wayne Taylor\n\n“She got pregnant to a lieutenant,” Short says of the subject of the song. “She was 16; too young. And she settled up next to the river and had the baby there. She didn’t end up staying with the lieutenant because he had a family of his own back home.\n\n“I love a story of a strong woman back in the 1800s. I love it when those stories are lifted up, because history is often told by big white men.”",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/sport/afl/freo-calm-on-jackson-trade-talk-after-win-over-gws-20250518-p5m04q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Freo calm on Jackson trade talk after win over GWS",
    "publish_date": "Sun, 18 May 2025 09:48:10 +1000",
    "category": "sports",
    "authors": [
      "Joanna Guelas"
    ],
    "text": "Fremantle coach Justin Longmuir is refusing to sweat over trade speculation swirling around Luke Jackson, even if Melbourne coach Simon Goodwin has signalled his interest.\n\nIf the 22-year-old premiership ruck had designs for a Melbourne homecoming, he didn’t show it in Fremantle’s 34-point win over GWS at Engie Stadium on Saturday.\n\nStar ruck Jackson is reportedly set to ask for a trade back to the Demons due to escalating personal matters, despite being contracted at the Dockers until 2029.\n\nLuke Jackson (left) contests for the ball with Kieren Briggs at ENGIE Stadium. Credit: AAP\n\nThe speculation grows even after Jackson in March categorically ruled out a return to Victoria, insisting he would remain with Freo long-term.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/business/banking-and-finance/the-23-billion-question-can-our-banks-sustain-their-rivers-of-gold-20250514-p5lz6s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The $23 billion question: Can our banks sustain their rivers of gold?",
    "publish_date": "Sun, 18 May 2025 09:30:00 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "One of the biggest reasons “mum and dad” investors flock to Australian bank shares is the bumper dividends: the billions of dollars paid out to hundreds of thousands of shareholders every six months.\n\nThe big four banks between them paid $23 billion to investors big and small last year, and they account for almost 30 per cent of all dividends on the ASX 200. In our market, only mining titans – BHP and Rio Tinto – rival the big four for how much money they shower on their shareholders.\n\nBank shares are known for their dividends, but some analysts say these payments are unsustainable. Credit: Dominic Lorrimer\n\nThese torrents of cash have made bank shares the bedrock of many small investors’ portfolios, especially those investors who want income from their shares, such as retirees.\n\nHowever, the latest round of bank profit results sparked a genuine discussion about whether banks can keep the dividend cash flowing at this rate (with the exception of CBA, whose dividend is seen as safer). Some veteran bank-watchers are asking: do some of our biggest banks need to cut their highly prized dividends?",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/culture/music/austria-sweeps-to-eurovision-victory-after-nail-biting-finish-20250516-p5lzvv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Austria sweeps to Eurovision victory after nail-biting finish",
    "publish_date": "Sun, 18 May 2025 09:26:16 +1000",
    "category": "sports",
    "authors": [
      "Michael Idato"
    ],
    "text": "Austria has won the 69th annual Eurovision Song Contest, after an almost four-hour long telecast featuring fireworks and songs in 20 different languages, and a brutal semi-final in which Australia was eliminated.\n\nIn an extraordinary photo-finish, Israel dominated the leaderboard by a margin of 99 points. In a final twist, the last block of global TV audience votes handed JJ (aka Jacob Pietsch)’s song Wasted Love an additional 178 points, and confirmation of the win.\n\n2025 Eurovision winner Johannes Pietsch, who performs using the stage name JJ, on stage in Basel, Switzerland. Credit: Cain Cooper\n\nThe final score placed Austria at the top of the leaderboard with 436 points, followed by Israel (357), Estonia (356), Sweden (321), Italy (256), Greece (231), France (230), Albania (218), Ukraine (218) and Switzerland (214). The biggest shock was Sweden’s fall to fourth place, after weeks of predictions that it would win.\n\nAustralia’s tenth journey to Eurovision ended earlier this week, when singer Marty Zambotto, known by the stage name Go-Jo, was ousted from the competition in a shock finish to a hotly contested and densely packed second semi-final.",
    "source": "TheAge",
    "cluster_id": 11
  },
  {
    "url": "https://www.theage.com.au/sport/soccer-player-bloodied-after-being-struck-in-head-by-seat-thrown-by-own-fans-20250518-p5m043.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Soccer player bloodied after being struck in head by seat thrown by own fans",
    "publish_date": "Sun, 18 May 2025 09:12:10 +1000",
    "category": "sports",
    "authors": [],
    "text": "Aberdeen defender Jack MacKenzie was injured when he was struck in the head by part of a seat apparently thrown by a supporter of his own team on Saturday.\n\nMacKenzie was an unused substitute during the 2-1 loss at Dundee United in the Scottish Premiership, a result that saw Aberdeen drop to fifth place and outside the potential European qualification places on the final day of the season.\n\nAberdeen player Jack Mackenzie is hit by a seat thrown by one of his own supporters Credit: YouTube\n\nMacKenzie was among people on the field after the match when he was hit by the plastic seat-part thrown from the away fans’ section in the upper deck of the stand. He was knocked over by the impact. He received medical treatment and taken away with a bandage around his head.\n\n“All we know is Jack got a really bad injury as a player doing his job. This cannot happen in this way,” Aberdeen coach Jimmy Thelin told BBC Scotland.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/world/tornadoes-tear-through-us-20250518-p5m04a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tornadoes tear through US",
    "publish_date": "Sun, 18 May 2025 09:05:17 +1000",
    "category": "finance",
    "authors": [],
    "text": "Tornadoes tear through US\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/victoria/take-the-age-quiz-20230608-p5df2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Take The Age quiz",
    "publish_date": "Sun, 18 May 2025 08:35:34 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "WHERE AM I?\n\nWhere is this famous geological feature located? Credit: Luis Ascui\n\nMade famous by an evocative Australian novel and subsequent film adaptation, this towering geological landmark was formed by a volcanic eruption millions of years ago. It has also hosted concerts by musicians including Ed Sheeran and Elton John. What is its name, and where is it located? Check next week’s quiz for the answer.\n\nLast week’s WHERE AM I? The North Melbourne Town Hall and its adjoining former municipal buildings are located on Errol Street.",
    "source": "TheAge",
    "cluster_id": 38
  },
  {
    "url": "https://www.theage.com.au/sport/motorsport/doohans-cheeky-response-to-colapinto-crash-20250518-p5m03t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Doohan's cheeky response to Colapinto crash",
    "publish_date": "Sun, 18 May 2025 08:09:07 +1000",
    "category": "finance",
    "authors": [],
    "text": "Doohan's cheeky response to Colapinto crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/environment/weather/national-weather-forecast-for-sunday-may-18-20250518-p5m03m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "National weather forecast for Sunday May 18",
    "publish_date": "Sun, 18 May 2025 07:34:17 +1000",
    "category": "finance",
    "authors": [],
    "text": "National weather forecast for Sunday May 18\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/motorsport/tsunoda-walks-away-from-monster-crash-20250518-p5m03n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tsunoda walks away from monster crash",
    "publish_date": "Sun, 18 May 2025 07:34:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "Tsunoda walks away from monster crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/world/explosion-rocks-city-in-california-20250518-p5m03l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Explosion rocks city in California",
    "publish_date": "Sun, 18 May 2025 07:33:56 +1000",
    "category": "finance",
    "authors": [],
    "text": "Explosion rocks city in California\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://au.news.yahoo.com/unexpected-intruder-bursts-through-shed-roof-as-homeowner-watches-tv-013436070.html",
    "title": "Unexpected intruder bursts through shed roof as homeowner watches TV",
    "publish_date": "2025-05-18T01:34:36Z",
    "category": "finance",
    "authors": [],
    "text": "The Queensland man's relaxing night at home was interrupted by an enormous snake's surprise entrance.\n\nA Queensland man got quite the surprise when a huge coastal carpet python suddenly appeared in his shed. Source: Sunshine Coast Snake Catchers 24/7\n\nLike many other nights, snake catcher Summer Woolston packed up her car on Thursday and headed to a Queensland home to retrieve an unexpected intruder. However, the standard call-out quickly took a turn when the owner of the property in Brisbane’s north regaled her with quite the story — and shocking footage to back it up.\n\nThe video presented to Summer shows an enormous coastal carpet python suddenly push through the insulation in the resident’s shed and dangle from the roof for several seconds before falling to the ground unharmed. The clip was captured about a year ago, but it appears the snake liked what he saw in the converted man cave.\n\n“I went to his property to catch the exact same snake! It had been living in his shed this whole time,” Summer told Yahoo News.\n\nThe three-metre python first greeted the homeowner one night as he was relaxing and watching some TV in his makeshift sanctuary.\n\nADVERTISEMENT\n\n“The homeowner was pretty relaxed about the whole situation and was comfortable keeping his distance and getting that cool video,” Summer, who works for Sunshine Coast Snake Catchers 24/7, said. “He mentioned that he did get a [different] snake catcher out but the snake didn’t end up being caught.”\n\nDespite its best efforts, the python was finally evicted this week, with Summer relocating the “gentle giant” to nearby wetlands.\n\nThe coastal carpet python was finally evicted this week and relocated to nearby wetlands. Source: Sunshine Coast Snake Catchers 24/7\n\nThe footage of the snake bursting through the man’s roof has left hundreds of thousands of Aussies in awe.\n\nSome declared they would’ve locked the shed door and never entered again, or even moved house. Others related to the clip. One man who claimed to have had the exact same encounter shared a video of a huge carpet python trying to balance on a ceiling ledge in his shed.\n\nADVERTISEMENT\n\nSnake sightings continue after season comes to an end\n\nSnake season — which typically runs from September to April — is officially over, but Aussies are continuing to spot the occasional reptile out and about. On Wednesday a venomous red-belly black snake was seen crossing a busy road to get to Bondi Beach.\n\nUrban Reptile Removal founder Chris Williams, who secured the wild animal, told Yahoo finding a red-belly in the area is “extremely rare”. “It would be a translocation. Red-bellies are known for being a species that’s quite good at hitching a ride on the bottom of cars, so I’d say that’s how he ended up there,” he said.\n\nIt’s been a hectic season for snake catchers. Rolly Burrell, who has been relocating reptiles in Adelaide for 50 years, recently told Yahoo it was his busiest year yet.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 39
  },
  {
    "url": "https://au.news.yahoo.com/aussies-urged-to-take-powerful-little-medicare-card-on-next-overseas-trip-223632001.html",
    "title": "Aussies urged to take 'powerful little' Medicare card on next overseas trip",
    "publish_date": "2025-05-17T22:36:32Z",
    "category": "finance",
    "authors": [],
    "text": "There are many perks of carrying a Medicare card in eligible countries, but there are some restrictions Aussies need to be mindful of.\n\nAussie travellers are being urged to take their Medicare card with them when heading overseas as the \"powerful little\" item extends medical benefits accessible at home to some international destinations.\n\nThere are 11 countries that have reciprocal healthcare agreements in place with the Australian government, meaning tourists can flash their medicare card in public hospitals and receive some treatment for free.\n\nDean Long, the CEO of the Australian Travel Industry Association, told Yahoo News it's often \"not a well-known fact\" among medical practitioners overseas, however it's something that Aussies themselves should explore when they're in eligible countries.\n\n\"Ultimately how it'll work is exactly the same way as when you go to a public hospital system or a public hospital here. If you've got a Medicare card and you're a citizen, you have rights to that emergency department and how that all works,\" Long said.\n\nADVERTISEMENT\n\nHowever, he explained that it can be a \"complicated process\" and there are different requirements and exemptions for using a Medicare card overseas, so doing your research is vital. Simply having a Medicare card doesn't mean it's always plain sailing for Aussies in need of help.\n\nEligible countries where Aussies can use their Medicare card:\n\nBelgium\n\nFinland\n\nItaly\n\nMalta\n\nNetherlands\n\nNew Zealand\n\nNorway\n\nRepublic of Ireland\n\nSlovenia\n\nSweden\n\nUnited Kingdom\n\nServices Australia General Manager Hank Jongen confirmed to Yahoo News it's a \"good idea\" for Aussie travellers to take their Medicare card with them when visiting these countries.\n\n\"There are agreements with some countries where Australians can get publicly funded medically necessary care,\" Jongen explained. \"Reciprocal agreements with 11 countries can cover emergency care and care for an illness or injury that can’t wait till you get home.\"\n\nADVERTISEMENT\n\nIt is recommended people pack their physical Medicare card rather than rely on the digital version in the Medicare app. Presenting your passport is also a vital step when seeking medical treatment in an eligible country.\n\nIt is recommended Aussies bring their physical Medicare card rather than rely on the digital version. Source: Lisa Maree Williams/Getty Images\n\nSolely relying on a Medicare card for medical treatment is unwise\n\nWhile Dean Long is full of praise for the \"power\" of the Medicare card, he urged Aussies not to solely rely on it for medical treatment while overseas in these eligible countries due to the many \"restrictions that sit underneath it\". There is no \"blanket process\" for Aussies, he said.\n\nADVERTISEMENT\n\n\"That's why travel insurance is still absolutely key when travelling and having both in some of those countries really will give you the best care possible,\" Long said.\n\nThis was echoed by Services Australia who told Yahoo travel insurance is always recommended. \"You should still get your own travel health insurance anytime you head overseas,\" Jongen warned.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 40
  },
  {
    "url": "https://au.news.yahoo.com/the-four-words-survivor-of-methanol-tragedy-that-killed-six-tourists-wants-every-backpacker-to-know-072535124.html",
    "title": "The four words survivor of methanol tragedy that killed six tourists wants every backpacker to know",
    "publish_date": "2025-05-17T07:25:35Z",
    "category": "finance",
    "authors": [],
    "text": "Bethany Clarke has recalled her horrific ordeal, and revealed to Yahoo her anguish after nearly avoiding the tragedy altogether.\n\nSimone White pictured at the backpacker hostel (left), and with Bethany Clarke tubing on their travels. Source: Supplied\n\n'Steer clear, drink beer'.\n\nThey're the four words Bethany Clarke wants every backpacker heading to Southeast Asia to remember.\n\nThat's because six months ago, the 28-year-old Brisbane resident watched her best friend's devastated mother struggle to turn off her daughter's life support in a Laos hospital — and she doesn't want anyone else to go through the same experience.\n\n\"I just sat there watching her stats on the monitor slowly get lower and lower,\" Bethany recalled to Yahoo News Australia. Because of the language barrier, the steps required weren't fully communicated, meaning the ordeal took over an hour. \"It was just horrendous,\" she said.\n\nADVERTISEMENT\n\nBethany is one of the survivors of the Laos methanol poisoning tragedy that made headlines around the world. Six people died, including Bethany's best friend Simone White, a British lawyer, and the two Melbourne teenagers Holly Bowles and Bianca Jones. It's believed all six victims, as well as other tourists hospitalised at the time, drank the same spirits suspected of being laced with lethal doses of methanol.\n\nBethany and Simone, both from the UK and friends since childhood, were travelling Southeast Asia with another friend David last November when they arrived in Vang Vieng, a Laos backpacker hotspot which had tried to repair what was once a notorious reputation for cheap alcohol and drugs several decades ago.\n\nThey settled into the Nana Backpackers Hostel before heading down to its bar and enjoying its famous free shots offered every night during happy hour. And while there was nothing that stood out as concerning to her, Bethany did have her reservations.\n\nDavid took a photo of the first round of free spirits they received at the hostel bar. Source: Supplied\n\n\"I remember looking at the sign and thinking 'Christ, the alcohol must be very cheap to be able to make it free for two hours',\" Bethany noted. The group went on to consume five to six shots each at the bar.\n\nADVERTISEMENT\n\nThe next day they started to feel off. Booked in for a day of kayaking, they felt lethargic and couldn't muster the energy to do much at all. \"Simone and I just had to lie there looking up at the sky,\" Bethany recalled after getting onto a kayak each.\n\nThey soldiered on and hours later they were on a bus to the next destination of their holiday but their conditions deteriorated. With Simone repeatedly throwing up and Bethany fainting, their friend David wasn't taking any chances and took them to the nearest hospital. It was there that Simone would then take a turn for the worse.\n\n\"She started going into respiratory distress and was gasping for breath and couldn't talk,\" Bethany said. \"She couldn't even look at me properly.\"\n\nNow seriously fearing for her welfare in an overcrowded facility, they managed to relocate to a private hospital where they were admitted to the ICU in private rooms. Little did Bethany know, she would never speak with her best friend again.\n\n\"The next day the doctors told me she was doing better but she'd had a seizure. I contacted her mum Sue by text saying we were in hospital but Simone is doing better now, but we need to wait for her to wake up from sedation.\n\nADVERTISEMENT\n\n\"And of course, she never woke up.\"\n\nBethany said she and Simone had never heard of methanol poisoning impacting tourists. Source: Supplied\n\nSimone's mother flew out as quickly as she could from the UK, and by the time her mum arrived she'd had surgery on her brain to try and alleviate built-up pressure. Despite having just a 20 per cent success rate, it worked. But tragically doctors discovered she would need surgery on the other side of her head after discovering further swelling. Such a procedure would leave her in a coma indefinitely. Without it, she would endure a prolonged death.\n\nAfter four days and assistance from the consulate to convince doctors to agree to her wishes, Sue was allowed to turn off her daughter's life support.\n\nDesperate warnings about hostel on Google Reviews deleted\n\nWhile the hospital eventually began to suspect methanol poisoning was the cause of their symptoms, Bethany had no idea she was part of a much-wider tragedy impacting tourists from all around the world.\n\nADVERTISEMENT\n\nWhen other backpackers presented to the same hospital with similar symptoms, it soon became apparent this was not an isolated incident. By this point, other tourists and friends of those impacted began leaving desperate warnings about the hostel on Google Reviews.\n\nSeveral posts tried to get the message out there that people who drank at the hostel were ending up in hospital in serious conditions impacting their breathing and vision. But they were met with accusations of slander by the hostel, and soon after, to the dismay of those impacted, the Google reviews vanished.\n\n\"I didn't even realise that could happen. I was just so surprised... those Google Reviews were supposed to be protecting the public. It's crazy,\" Bethany said.\n\nOne of the last photos of Bethany and Simone together on their holiday, sat with other tourists. Source: Supplied\n\nNot knowing what else to do, she turned to Facebook and left a series of posts in specific groups for travellers in Laos. It was soon after she learned about Melbourne teens Holly and Bianca being taken to Thai hospitals in serious conditions, as well as the two young Danish women Anne-Sofie Orkild Coyman and Freja Vennervald Sorensen who were also hospitalised. All four would later die in the tragedy.\n\n\"While we were there in the hospital there were more and more people coming in and we were thinking 'Jesus Christ, how big is this problem?'\" Bethany recalled.\n\nGoogle failed to respond to Yahoo's request for comment about the deleted reviews before publication.\n\nGroup nearly avoided hostel at centre of tragedy\n\nBethany, a self-proclaimed worrier who 'overthinks everything\", revealed to Yahoo one \"red flag\" encounter with the hostel before they'd even arrived could have meant they avoided the deadly bar altogether.\n\nWhen they were at the airport heading to Laos, they realised their room booking wasn't for three people so they called the hostel. But both Simone and Bethany failed to get a straight answer from the receptionist and grew increasingly frustrated with the situation. It was at that point they decided to find alternative accomodation.\n\n\"I said to Simone we need to book a hotel, so we found one and had it all booked but David in the meantime had managed to sort it out with the hostel and book a three-person room so we had to revert back to the hostel.\"\n\nWhen they arrived, they were met by someone else who Bethany said was much more accommodating, meaning her reservations about the place were quickly forgotten.\n\nThe Nana Backpackers Hostel in Vang Vieng where the allegedly deadly shots were given out for free. Source: AFP via Getty Images\n\nBut in hindsight, she wishes that red flag had been enough to convince them to move on.\n\n\"I would have liked to think we wouldn't have gone to the hostel bar if we'd ended up at the hotel, but you just don't know,\" Bethany told Yahoo. \"I kept second guessing everything when it all happened. It's all these should haves, would haves. You can't keep doing it to yourself.\"\n\nMethanol survivor's campaign mirrors Australian efforts\n\nBethany is now campaigning to have methanol education implemented into schools' curriculums in her native UK. The motto of her campaign is \"steer clear, drink beer\". It is similar to the messaging used by Colin Ahearn, a seasoned campaigner who has worked tirelessly in Australia to warn tourists of the dangers of methanol poisoning overseas, particularly in Bali via his Facebook awareness page \"Just Don't Drink Spirits in Bali\".\n\nThe idea of both campaigns is to prevent tourists drinking free-poured spirits. And while the risk is low, there is a chance liquors sold abroad contain methanol, a deadly byproduct of distillation which can be found in bootleg spirits. Just 25ml of methanol consumed can prove fatal.\n\nOver the years Colin has helped guide countless tourists from around the world who experience methanol poisoning, the majority of whom had no idea of what it was beforehand.\n\nColin praised Bethany's courage and determination to make a change, something he's been trying to do with little assistance. Both Colin and Bethany believe more needs to be done by governments, fearing a simple update of their travel advice sites is not enough to protect tourists.\n\nDetails of the ongoing investigations in Laos are scarce, with even the families of those impacted fed very little information through their respective embassies from Lao authorities. And while Yahoo understands charges against several people involved will be laid, whether that involves charges directly related to the six deaths is unclear, leaving families fearing true accountability for what has taken place won't be achieved.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 41
  }
]