[
    {
        "url": "https://www.9news.com.au/national/1080-bait-poison-pet-dog-owner-ban-campaign/39b442e2-e92c-40c9-add2-7911249d6a0c",
        "title": "Yvette's battle to ban substance that almost killed beloved dog",
        "publish_date": "Tue, 08 Jul 2025 01:52:19 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "It was love at first sight when Yvette Colomb spotted Elsa on a greyhound adoption site.\n\nOriginally a racing dog, Elsa was almost euthanised before Colomb rescued her and gave her a second shot at life, only to see her horrifically poisoned a few years later.\n\nIt was 2020 and they were on a property about an hour north of Sydney when Elsa suddenly started to vomit.\n\nElsa the greyhound was a happy, active dog before she was poisoned in 2020. (Supplied)\n\n﻿Colomb immediately put Elsa in the back of the car and raced to Sydney, where her daughter took Elsa straight to the emergency vet.\n\n\"I remember I looked at her and it was the last time I looked at her before she was quite disabled,\" Colomb told 9news.com.au.\n\nBy the time Elsa arrived at the vet, she'd vomited again, suffered a seizure and had to be put on life support.\n\nThat's when the vet called Colomb and revealed her dog had been poisoned.\n\nElsa had accidentally ingested ﻿sodium fluoroacetate poison baits, better known as 1080.\n\nThe poison is used across Australia to cull foxes, rabbits, wild dogs and feral cats by applying it to food items which are left out for animals to find.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nVets doubted Elsa would survive after ingesting a 1080 poison bait. (Supplied)\n\nDerived from a ﻿naturally occurring compound found in multiple Australian plants, some Australian animals have developed a tolerance to 1080.\n\nBut pets have not.\n\n﻿Dogs may also ingest these baits and be poisoned, causing ﻿frenzied running, uncontrollable vomiting, howling, confusion, coma and even death.\n\nJust a few milligrams of 1080 can be lethal to most dogs and ﻿there's no antidote, though vet treatment can aid a dog's survival.\n\n\"The vet said, 'very few animals survive it and it's very unlikely that Elsa will survive,'\" Colomb said.\n\nAlthough she didn't have pet insurance, Colomb begged the vet to do anything to save her dog – and he did.\n\nREAD MORE: Bullets sprayed at Sydney home as toddler slept inside\n\nElsa's vet bill was almost $20,000 after the poisoning. (Supplied)\n\nMiraculously, Elsa pulled through.﻿\n\nShe spent almost two weeks at the emergency vet﻿ and needed additional rehabilitation, resulting in a $20,000 bill.\n\nColomb paid about $8000 out of her own pocket and fundraised the rest, then set up a Facebook page dedicated to Elsa's recovery﻿ and to warn other dog owners.\n\nDespite surviving the 1080 poisoning, Elsa was left permanently disabled. ﻿\n\n\"When we brought her home, it was almost like having an enormous newborn baby,\" Colomb said.\n\n\"She was totally bedridden and it was around-the-clock care for her ... it took her months to learn to walk again.\"\n\nCaring for Elsa was expensive – she did hydrotherapy and had to be on a special diet for months after the poisoning – but like many Aussies, Colomb said she would do anything for her dog.\n\nElsa walked with a wobble and had mobility issues for the rest of her life, but her health really started to decline in 2025.\n\nElsa needed hydrotherapy and a special diet to help her recover from the poisoning. (Supplied)\n\nShe died at home in ﻿Colomb's arms in June.\n\n\"She was like lying flat against me, and she had her head against my chest, and I just patted every very gently,\" Colomb said.\n\nDevastated by the loss, ﻿she took comfort from the 10,000 animal lovers who had followed Elsa's story in her Facebook group.\n\nNow she's campaigning to outlaw the baits that almost killed Elsa five years ago, left her disabled and cost the family thousands in vet care.\n\nAccess to 1080 is highly restricted in Australia and its use is regulated by the Australian Pesticides and Veterinary Medicines Authority (APVMA), state and territory government agencies and local land management authorities.\n\nUse of the poison varies across the country and baits are tailored to the target species and the local ﻿ecosystem.\n\nBut scientists and animal rights groups disagree on how 'humane' 1080 is and after seeing how Elsa suffered, Colomb doesn't want any animal – pet or pest – to go through the same thing.\n\nYvette Colomb has started a petition to ban 1080 baits in Elsa's memory. (Supplied)\n\n\"It's a horrible way to die and I understand that foxes need to be taken care of, but I think we need to do it in a responsible and humane way,\" Colomb said.\n\n\"I don't think we can just drop poison into our environment and hope for the best.\"\n\nShe started a Change.org petition ﻿that has already attracted more than 3000 signatures and plans to petition Federal Parliament to reconsider the use of 1080 across the country.﻿\n\nColomb's only regret is not taking action and campaigning for a ban on 1080 sooner.﻿\n\n\"Why did I wait so long? I need to make Elsa's memory count.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/queensland-mena-creek-paraglider-dies-after-falling-20-metres-from-parachute/afddef2a-25c6-4964-a24a-c0a75acf820c",
        "title": "Paraglider dies after falling 20 metres from parachute",
        "publish_date": "Tue, 08 Jul 2025 01:23:32 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/bendigo-bank-shuts-down-10-branches-in-victoria-queensland-tasmania/7aee57c8-3eec-40ce-8b23-826d49986ba4",
        "title": "Bendigo Bank to shut 10 branches across three states",
        "publish_date": "Tue, 08 Jul 2025 00:43:43 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Bendigo Bank announced it will shut down 10 branches across three states, leaving five regional communities without any financial services.\n\nThe branch closures — six in Victoria, two in Queensland and two in Tasmania — will begin as early as August 1 and are slated to conclude by October 31.\n\nThe bank ﻿attributed the decision to a review into changing customer preferences, reduced business activity and increased costs.\n\nREAD MORE: ﻿ Timelapse video shows speed of floodwater rising in Texas\n\nBendigo Bank Chief Executive Richard Fennell said closing down branches was a last resort.\n\n\"To preserve what makes our bank unique, we must balance our physical network presence with the need to continue investing in the changing preferences of our 2.7 million customers,\" he said.\n\nBendigo Bank is working with affected staff and exploring opportunities to redeploy them to other parts of the business.\n\n9news.com.au understands there are about 30 staff members impacted by the closures.\n\nFinance Sector Union ﻿National Secretary Julia Angrisano has written to Fennell to urge him to reverse the decision as five regional communities — Bannockburn, Korumburra and Yarram in Victoria, Malanda in Queensland and Queenstown in Tasmania — will lose the last of their bank branches.\n\nREAD MORE: ﻿ Hope for more rate relief from RBA today\n\nBendigo Bank will shut down 10 branches across three states. (Supplied)\n\n\"The largest impact from this decision will be felt in the bank's home state of Victoria with six branches closing including larger regional branches in Geelong and Ballarat, and a suburban branch in South Melbourne,\" she said.\n\n\"This is an incredibly disturbing development and does not bode well for the future of Bendigo Bank's presence in regional Australia.\n\n\"For a bank which proudly has its regional centre hometown as part of its name, and is fondly known for its community branch network, this decision feels very 'big bank' for all the wrong reasons.\"\n\nFennell insisted Bendigo Bank had more branches per customer than any other Australian bank and operated the second-largest regional branch network.﻿\n\n\"We are proud of our regional heritage and in order to continue delivering for our customers and communities we must ensure our branches are adequately supported and resourced,\" he said. ﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/the-hidden-physical-powers-that-help-women-outlive-men/fc7764ba-022d-4c00-ab7a-9d51de1c47dc",
        "title": "The hidden physical powers that help women outlive men",
        "publish_date": "Tue, 08 Jul 2025 00:34:23 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "People who lived through the Irish Potato Famine, enslavement in Trinidad and Icelandic measles epidemics all have something in common: Women outlive men in dire circumstances.\n\nThat's because the female body is built for resilience and longevity, as CNN found while conducting research for a new book, \"The Stronger Sex.\"\n\nDespite having more complex reproductive organs and the burdensome, sometimes fatal, functions that come with them — menstruation, pregnancy, childbirth and breastfeeding — female bodies tend to outlast male bodies.\n\nREAD MORE: Texas flood death toll nears 90 with girl campers still missing ﻿\n\nPeople who lived through the Irish Potato Famine, enslavement in Trinidad and Icelandic measles epidemics all have something in common: Women outlive men in dire circumstances. (Nine)\n\nAnd that's the case even though girls in many parts of the world have access to fewer resources, such as food and medical care, than boys do.\n\nThat female toughness holds true in extreme circumstances, as Virginia Zarulli, now an associate professor of demography at Italy's University of Padua, found when she analyzed survival data across seven historical populations experiencing famines, epidemics and enslavement.\n\nUnder these brutal conditions, women outlived men across almost all ages and locations, including among the \"high-mortality\" populations who confronted famine in Ukraine, Ireland and Sweden; enslavement in Trinidad; and measles epidemics in Iceland, according to her 2018 study, published in the journal PNAS.\n\nEven newborn girls in these environments had a higher survival rate than newborn boys — a hint that the female survival advantage is rooted in biology.\n\nREAD MORE: ﻿ Ship attacked in Red Sea after rebels claim bulk carrier sinking\n\nSince viruses and bacteria are always mutating, an immune system that can quickly adapt is more resilient. (Getty)\n\nEssential female strength also shows up today in places where women experience fewer extreme physical stresses overall: \"When we analyze the empirical data, for modern people it shows that death rates for men are higher than for women, pretty much at every age,\" Zarulli said.\n\nRecognizing and building on these sex-based differences can help transform how we approach health care, including treatments for cancer and vaccine protocols — making medicine more precise, personalized and effective, especially for women.\n\nFemale chromosomes and hormones\n\nPeople assigned female at birth have two X chromosomes, a fundamental advantage over XY, the chromosomes males have at birth.\n\nThat's because the X chromosome is much larger, containing roughly 10 times more genes.\n\nFemale bodies therefore have access to a wider range of immune genes, making their defense system remarkably strong and diverse.\n\nREAD MORE: ﻿ Trump announces 25 per cent tariff on two key trading partners\n\nPeople assigned female at birth have two X chromosomes, a fundamental advantage over XY, the chromosomes males have at birth. (Getty)\n\nAs neurogeneticist and evolutionary biologist Dr. Sharon Moalem wrote in \"The Better Half: On the Genetic Superiority of Women,\" his book about the XX chromosome advantage, \"Women have immunologically evolved to out-mutate men.\"\n\nSince viruses and bacteria are always mutating, an immune system that can quickly adapt is more resilient.\n\nEstrogen, generally higher in female bodies, also confers a variety of immune advantages.\n\nAs a result, female mammals — including humans — have better-equipped immune systems, in both their innate, generalized responses and their adaptive, specialized responses.\n\nFemale bodies also have higher counts of active neutrophils, the most common type of white blood cell that fights infections.\n\nScientists have also found that female bodies have more robust B cell activity — the action of white blood cells that adapt to fight off viruses or bacteria.\n\nThis advantage may also be due in part to estrogen, and researchers are trying to tease apart what is mediated by hormones, what is affected by genes and what might be attributable to other causes.\n\nREAD MORE: ﻿ Texas flood death toll hits 70 as 21 children found dead\n\nEstrogen, generally higher in female bodies, also confers a variety of immune advantages. (Getty)\n\nWomen produce more targeted antibodies to fight infections and also retain immunological memory longer, making their bodies more adept at responding to future infections, according to researchers.\n\nthis all leads to \"the very well-known phenomenon that males tend to be more susceptible to a lot of diseases than females — though not in every disease or every individual, of course,\" said Marlene Zuk, a Regents Professor and evolutionary biologist at the University of Minnesota in St. Paul.\n\nSince female bodies mount stronger immune defenses, they generally have a stronger vaccine and virus response, a greater ability to fight off sepsis and a decreased risk of some cancers.\n\nThe downside of this powerful system, however, is that women get more autoimmune diseases than men do.\n\nWomen are also more likely to live with chronic illness after surviving diseases that would have killed male bodies.\n\nThe effect of testosterone\n\nTestosterone also seems to be an immune disadvantage, and males have more of that hormone than females do.\n\nZuk said that in early experiments scientists found they could \"neuter male animals and their immunity would get better or inject female animals with testosterone and their immunity would get worse.\"\n\nREAD MORE: ﻿ Father who died saving his family among victims of the Texas flooding tragedy\n\nTestosterone also seems to be an immune disadvantage, and males have more of that hormone than females do. (Getty)\n\nWhy?\n\nIt may be that testosterone enables male animals toward greater reproductive success by \"living hard and dying young,\" Zuk said.\n\nSome of the female immune advantage may be male immune disadvantage, and while it's accepted that hormones affect immunity, determining to what degree is an ongoing research question.\n\nPhysiology and culture\n\nSome scientists argue that lifestyle and culture lead to a significant part of the male longevity disadvantage.\n\nAs a population, men tend to smoke more, drink more alcohol and engage in riskier activities than women, and men tend to exclude most women from more physically dangerous jobs.\n\nStudies focused on what happens when women adopt some of the unhealthy habits traditionally more likely among male populations, such as smoking, still show that women live longer than men, Zarulli said.\n\nAs a population, men tend to smoke more, drink more alcohol and engage in riskier activities than women (Getty)\n\n\"In populations where men and women had the same lifestyle, there was still a difference in mortality — women had a higher life expectancy than men.\"\n\nThe female advantage is likely due to more than genetic and hormonal factors, according to new research: It's also found in the very structure of women's bodies.\n\nAt North Carolina State University, a team led by microbial ecologist Erin McKenney and forensic anthropologist Amanda Hale conducted a landmark study measuring the lengths of the small intestines in cadavers for the first time since 1885.\n\nThe team discovered that women's small intestines were significantly longer than men's — an advantage that allows women to extract more nutrition from the same quantity of food.\n\nThis finding, published in the journal PeerJ in a 2023 paper, might be explained by the extra demands on female bodies throughout human history: \"The vast majority of the nutrients you need to replenish your system — especially during reproduction and nursing, like protein and fat — that's what's being absorbed by your small intestine,\" Hale said.\n\nThis could be a key piece of the \"Female Buffering Hypothesis\" — the idea that female biology evolved to withstand environmental and physiological stress better — according to Hale.\n\nTraditional medical research has long ignored the complexities of the female body. As these genomic and physiological functions are better studied and understood, the drivers behind the strength and resilience of the female body will come into focus.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sydney-man-calls-for-action-from-airlines-after-wheelchair-damaged-five-times/f657c283-ce10-4b58-9571-34bcf6be72bf",
        "title": "Sydney man calls for action from airlines after wheelchair damaged five times",
        "publish_date": "Mon, 07 Jul 2025 20:54:27 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "When Sydney man Stuart Hurst - who is a paraplegic - prepares to go on a flight, he makes sure a laminated sign is displayed prominently on the back of his wheelchair.\n\nAlong with his contact details and the dimensions of his $35,000 chair, is a personal message to baggage handlers: \"Remember, this chair is my legs.\"\n\nIt was a plea that seemingly went ignored in December last year, when Hurst flew back to Sydney after a trip to Melbourne.\n\nStuart Hurst's wheelchair was damaged last December during a Virgin fight from Melbourne to Sydney. (Supplied: Stuart Hurst)\n\nThe 62-year-old went to disembark from the Virgin flight, only to find three spokes of his chair's wheel were bent and there was a hole in the wheel's rim.\n\n\"You've got no idea of the stress levels,\" Hurst said, while explaining the logistics of trying to get back to his Rockdale home that day.\n\nJust a month earlier, while flying back from Auckland, Air New Zealand accidentally left his wheelchair behind.\n\nFlying with Latam Airlines to Auckland in December 2023, Hurst's wheelchair was damaged so severely that the repairer suspected it had been dropped from the cargo hold onto the tarmac.\n\n\"The axle was bent, the wheel was bent, and I was hotel-bound for the whole time I was in Auckland,\" Hurst said.\n\n\"It meant I couldn't go and meet my grandson, who had just been born and was in hospital.\"\n\nAll up, Hurst says he has personally experienced his wheelchair getting lost or damaged by airlines five times in the last three years.\n\nHurst's frustration and despair led him to start a Change.org petition, calling on the airlines to treat wheelchairs \"with the respect and care they deserve\".\n\n\"It's not sympathy we're after, it's just empathy. I just want them to treat our chairs with the understanding that they are our lifelines - it's how I get around,\" Hurst said.\n\nStuart Hurst travels often. Pictured at left is a notice he has attached to his wheelchair for airline baggage handlers. (Supplied: Stuart Hurst)\n\nHurst said there was also little consistency shown by the airlines when things went wrong.\n\nVirgin covered the cost of repairing his wheelchair and offered him a travel voucher as compensation, while Latam paid only for the chair to be fixed.\n\nAir New Zealand, meanwhile, was brilliant in their response, and bent over backwards to make sure he got home safely in a taxi, with his wheelchair delivered to his door the next day, Hurst said.\n\nBut no matter how great the airline's actions after the event, the fact remained that having a wheelchair damaged or lost was a devastating and all too common experience for plane passengers with a disability, he added.\n\nWhile there are no statistics available to show recorded incidents in Australia, figures from the US Department of Transportation reveal that, in 2023, more than 11,000 wheelchairs or mobility scooters were lost or damaged by airlines.\n\nHurst has always been an avid traveller, both before and after the accident where he lost the use of his legs.\n\nIt was during a trip to Nepal in 2018 when he was paralysed in an almost fatal crash.\n\nHurst was airlifted to Bangkok after the catastrophic accident, where he spent a month in hospital undergoing multiple brain surgeries before being flown back to Sydney.\n\n\"I was brain dead,\" Hurst said.\n\n\"My brothers were called into Royal North Shore Hospital and I was on the bed with tubes hanging out everywhere.\n\n\"Doctors said that it was as good as I'd get, and I'd need 24-hour-a-day, seven-day-a-week care.\n\n\"Don't ask me how, or why, but I got through it. I was in hospital for 23 months. I've just been so lucky.\"\n\nHurst's appetite for travel has led him to start the website The Travelling Para and he said he hoped to use his platform to help advocate for the change that passengers with a disability desperately needed.\n\nIn response to Hurst's petition, Air New Zealand general manager customer, Alisha Armstrong, said: \"At Air New Zealand, we understand how essential wheelchairs and other types of mobility equipment are to our customers, and we take our responsibility to handle them with care extremely seriously.\n\n\"We have been in touch with Mr Hurst directly and thank him for bringing attention to this important issue.\n\n\"We recognise there is always more we can do to improve the travel experience for customers with accessibility needs.\"\n\nA Virgin Australia spokesperson said the airline was committed to ensuring that travelling with Virgin Australia was safe, accessible and dignified for all our guests.\n\n\"We recognise there is work to be done involving stakeholders from across the aviation ecosystem, including airlines and airports, to improve the travel experience for guests with a disability.\n\n\"We are actively engaged with government and industry stakeholders on accessibility matters and we will continue to work closely as the new Aviation Standards are developed as an output of the Aviation White Paper.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/emilien-12-coups-de-midi-french-gameshow-contestants-epic-21month-winning-streak-finally-ends/50eeeb9a-1566-4ca9-b300-45bdb641cb6b",
        "title": "French gameshow contestant's epic 21-month winning streak finally ends",
        "publish_date": "Mon, 07 Jul 2025 17:33:36 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": "A French gameshow contestant has been dethroned after a record-breaking run of 646 wins that lasted 21 months.\n\nÉmilien, 22, made his first appearance on the 12 Coups de midi daily game show on September 25, 2023, according to a statement from French TV network TF1, which announced the end of his run on Sunday. The network has not revealed his surname.\n\nIn the show, four contestants compete in a general knowledge quiz. The winner then answers a series of questions to determine their prize pot for that day, before returning to take on a new slate of opponents the day after.\n\nÉmilien, 22, made his first appearance on the 12 Coups de midi daily game show on September 25, 2023, according to a statement from French TV network TF1. (Endemol/TF1)\n\nÉmilien won more than €2.5 million euros ($4.5 million) in cash and other prizes, as well as 23 cars, making him the biggest winner in French game show history, said TF1. His haul more than doubled the previous record of one million euros ($1.8 million), held by Bruno Lafourcade.\n\n\"I never expected to have the chance to stay for such a long time,\" said Émilien, who comes from south-west France.\n\n\"It's amazing everything that has happened. It's hard to understand.\"\n\nPrior to appearing on the show, Émilien studied history at university and was aiming to become a teacher.\n\nHe then paused his studies to concentrate on his record-breaking run, which came to an end when he ran out of time to answer a question during Sunday's show.\n\nDespite his loss to Romain, an architect, Émilien has become the world record holder for the most solo game show appearances, and the European record holder for prizes won, according to TF1.\n\nREAD MORE: New details emerge after woman loses arm in zoo mauling\n\nThe headquarters of French TV network TF1. (Charles Platiau/Reuters via CNN Newsource)\n\nREAD MORE: Inside the courtroom as Patterson found guilty\n\nHis run became something of a sensation in France, with his defeat drawing an average of 5 million spectators on Sunday.\n\nTF1's 12 Coups de midi has some similarities with popular US quiz show Jeopardy , which airs every weekday for 30 minutes.\n\nThe record for the highest number of consecutive wins on Jeopardy is held by Ken Jennings, who won 74 games in a row in 2004, followed by Amy Schneider, who won 40 consecutive games in 2022.\n\nJennings also holds the record for the highest amount of prize money won on Jeopardy , at $US2,520,700 ($3,879,851) followed by James Holzhauer on $US2,462,216.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/tennis-mirra-andreeva-emma-navarro-wimbledon-win-reaction/105506616",
        "title": "Starstruck Andreeva didn't realise she won match point against Navarro",
        "publish_date": "Tue, 08 Jul 2025 01:55:43 +0000",
        "category": "sports",
        "authors": [],
        "text": "Mirra Andreeva was the last person on Centre Court to realise she beat Emma Navarro, a result that made her the youngest woman in 18 years to reach the Wimbledon quarterfinals.\n\nAndreeva was so focused on not thinking about the score — and avoiding looking at Roger Federer — that the 18-year-old Russian did not realise the fourth-round match was over when Navarro netted a forehand.\n\nSo instead of celebrating a 6-2, 6-3 win, the seventh-seeded Andreeva calmly turned back to her baseline and started fiddling with her racket, seemingly getting ready for the next point.\n\nIt wasn't until she noticed the reaction from the crowd — and coach Conchita Martinez — that it dawned on her she won.\n\n\"Honestly, I just kept telling myself that I'm facing break points. I tried to tell myself that I'm not the one who is up on the score, I'm the one who is down,\" Andreeva said in an on-court interview.\n\n\"In the end I completely forgot the score. I'm happy that I did it because I think that [otherwise] I would be three times more nervous on the match point.\"\n\nAndreeva became the youngest player since Nicole Vaidisova in 2007 to reach the women's quarterfinals at the grass-court grand slam.\n\nThe score was not the only thing Andreeva tried to ignore.\n\nShe was also afraid to look up at the Royal Box, where eight-time Wimbledon champion Federer was sitting with his wife Mirka.\n\n\"I really tried my best not to look over there in the box, because I knew that as soon as I would look there I would just completely lose my focus,\" she said, before addressing the couple directly.\n\n\"Honestly, it means a lot to me that you came and watched my match. It's been one of my dreams to see you in real life. So when I saw both of you I got really, really nervous.\"\n\nThe 10th-seeded Navarro had beaten defending champion Barbora Krejcikova in the previous round, ensuring there would be yet another first-time champion.\n\nIt will be the ninth different women's champion in the past nine Wimbledons.\n\nSerena Williams was the last repeat champ in 2016.\n\nAndreeva will next face Belinda Bencic, who also reached her first Wimbledon quarterfinal — 11 years after making her debut at the All England Club.\n\nBencic beat 18th-seeded Ekaterina Alexandrova 7-6 (7-4), 6-4 earlier on number one court.\n\nBelinda Bencic was overcome with emotion after booking a spot in the Wimbledon quarterfinals for the first time in her career. (Getty Images: Robert Prange)\n\nBencic, who lost in the fourth round on three previous occasions, failed to convert five match points while serving at 5-3 in the second set. But on the sixth one, Alexandrova sent a forehand long.\n\n\"For you guys it was entertaining,\" Bencic said about that marathon game at 5-3, where Alexandrova finally converted her fourth break point to stay in the match.\n\n\"For me it was a big stress.\"\n\nBencic's best result at a grand slam was reaching the semifinals at the 2019 US Open, where she also reached the quarters on two other occasions.\n\nThe Tokyo Olympic champion, playing at Wimbledon for the ninth time, had not been into the last eight at any of the other three majors, until now.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBencic missed last year's grass court grand slam tournament while she was on maternity leave, having given birth to her first child — a daughter named Bella — in April 2024.\n\nShe said travelling with a child on tour was still relatively easy, with Bella being so young, but that she was spending a lot more time taking pictures when she's at tournaments.\n\n\"I'm juggling it like every mum does,\" Bencic said.\n\n\"So, props to the mums.\"\n\nAlso, 19th seed Liudmila Samsonova reached her first grand slam quarterfinal by beating Jessica Bouzas Maneiro 7-5, 7-5 on number two court.\n\nSamsonova has yet to drop a set this tournament and will face former world number one Iga Swiatek, who reached her second Wimbledon quarterfinal by beating Clara Tauson 6-4, 6-1.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/literacy-for-life-program-teaches-aboriginal-adults-to-read/105494108",
        "title": "Adults return to the classroom to turn around literacy rates and lives",
        "publish_date": "Tue, 08 Jul 2025 01:31:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Having left school about 30 years ago without the reading and writing skills many Australians take for granted, Alton Sands's future did not appear to lie in a classroom.\n\nBut at 45, he takes a seat each week alongside dozens of other adults in his home community of Yarrabah, all determined to pick up the literacy skills they missed out on when they were younger.\n\n\"It was pretty complicated and hard,\" Mr Sands said.\n\n\" But now, since I've come to this course, I really know how to read and write. \"\n\nYarrabah, about an hour from Cairns, is one of the nation's largest Indigenous communities.\n\nIt has also become fertile ground for Literacy for Life, an Aboriginal-led program that has helped more than 500 adults nationwide achieve functional literacy.\n\nAlton Sands says he has developed skills that he did not learn at high school. (ABC Far North: Brendan Mounter)\n\nAs one of its graduates, Mr Sands intends to return for another term and is encouraging relatives and friends to join him.\n\nBut he said many might be reluctant to acknowledge their literacy limitations.\n\n\"I tried to tell them, break that shameness, that barrier in front of you,\" Mr Sands said.\n\n\" Break that out of the road and you won't have no fear, all that shameness be gone. \"\n\nFrom student to teacher\n\nThe Literacy for Life Foundation estimates between 40 and 70 per cent of Aboriginal adults have low English language literacy, a figure that is up to 90 per cent in some remote communities.\n\nThe foundation's executive director, Jack Beetson, said it was a real problem.\n\n\"We've got whole households that can't even read the dosage on a Panadol packet,\" Professor Beetson said.\n\n\"Yet our households are also the households that are home to more chronic disease than any other section of our community.\n\n\"Imagine being in a household where you've got sick children, sick adults and sick grandparents all at the same time and all of those medicine doses are committed to memory.\n\n\" If that was any other section of the Australian community, that would be considered a national disaster. \"\n\nLiteracy for Life is modelled on the Yes, I Can program developed in Cuba. (ABC Far North: Brendan Mounter)\n\nThe program — based on a Cuban model called Yo, Sí Puedo (Yes, I Can) — began at Wilcannia in Far West New South Wales in 2013.\n\nThe concept involves having Aboriginal and Torres Strait Islander locals delivering course content in a way that is tailored to the community.\n\nDwayne Street's life turnaround began when he took the program as a student.\n\nThe 49-year-old has since gone on to deliver the course to people like Mr Sands.\n\nDwayne Street started as an adult learner and now helps teach literacy skills. (ABC Far North: Brendan Mounter)\n\n\"I'm pretty blessful that I got the opportunity to teach my mob, and hopefully, this will spread right around Australia,\" Mr Street said.\n\nThe Yarrabah local admitted he found the classroom environment \"pretty challenging\" at first.\n\n\"But as we went on, I got used to it,\" he said.\n\nDoing it for the kids\n\nSome adult literacy learners take the plunge back into the classroom to improve their job prospects.\n\nMany are doing it for their children, including Mr Sands, who wants to set an example for his 12-year-old daughter Livvy.\n\nAshleigh Richards, 26, and her partner Lex Costello graduated in Yarrabah just two weeks after the birth of their third child.\n\nLex Costello and Ashleigh Richards say they wanted to be able to read to their children. (ABC Far North: Brendan Mounter)\n\n\"I felt comfortable being around people I know,\" Ms Richards said.\n\n\"When I was at school, I was down in Rockhampton, with hardly no-one I knew.\"\n\nThe couple wanted to improve their literacy to read to their children and help them with their studies.\n\nLiteracy for Life Foundation director Wendy Ludwig said people who reached adulthood without basic literacy skills often developed coping mechanisms, such as taking forms home to be filled out.\n\n\"It's very difficult for people, after having developed those skills and strategies … to then say, 'I actually need help and I want to learn how to do it myself,'\" Dr Ludwig said.\n\nFunding a challenge\n\nIn 2013, the foundation estimated it would cost $1.3 billion over 10 to 15 years to eradicate functional illiteracy in Indigenous communities.\n\nBut over the past decade, it has run on a \"piecemeal\" basis in different communities where funding becomes available.\n\nLiteracy for Life is helping tackle low literacy rates in Aboriginal communities. (ABC Far North: Brendan Mounter)\n\nLiteracy for Life has recently secured federal funding to continue for another four years in Yarrabah, and to expand to Cairns, Mossman and Mapoon in Far North Queensland.\n\nDespite boasting a course completion rate of 59 per cent — much higher than mainstream government-funded initiatives for First Nations adults — it has never secured long-term funding to expand more broadly.\n\nWendy Ludwig says teaching adults literacy skills can help entire households. (ABC Far North: Brendan Mounter)\n\n\"By having one literate person in a household, that then has a ripple effect on other people living in that house, and especially in terms of being able to support and help nurture young people,\" Dr Ludwig said.\n\nDr Ludwig said changes were needed at school level too, such as a shift toward teaching Indigenous students English as a second language, instead of framing them as \"bad speakers\" of English.\n\n\"I think that is a really fundamental part of some of the challenges for Aboriginal and Torres Strait Islander kids in schools,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/basketball-infrastructure-concerns-as-sport-rises-in-popularity/105489664",
        "title": "Basketball infrastructure falling behind popularity in regional areas",
        "publish_date": "Tue, 08 Jul 2025 01:13:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "Fifteen-year-old Emma Quinlan from Shepparton started playing basketball after the COVID-19 pandemic and now travels to compete for the North East Bushrangers in the Victorian Junior Basketball League (VJBL) every week.\n\nShe has also taken on assistant coaching roles with a mentor and aspires to coach full-time in the future.\n\nThere are local academy programs, but Emma must regularly travel to Melbourne and Bendigo for better training opportunities.\n\n\"For me, basketball is all about the relationships that I can make,\" she said.\n\nEmma Quinlan regularly heads to bigger cities to train and coach. (ABC Goulburn Murray: Callum Marshall)\n\nEmma's family is deeply involved in the sport — her mum, Sam Quinlan, coaches multiple teams in the area and her brother, Reese, has played since 2012 and coaches in the VJBL.\n\nMs Quinlan said infrastructure in the area was lagging behind the interest in basketball.\n\n\"The Mooroopna Cats are at a very, very old facility,\" she said.\n\n\"It's cold, it's dank and has a linoleum floor that's been there since the 1990s.\"\n\nParents travelling further\n\nWangaratta's basketball association recently relocated its under-12 and under-14 tournaments to Wodonga due to a lack of suitable courts to accommodate the area's 70 teams at the town's sports and aquatic centre.\n\nThe venue hosted an NBL match in August last year and received a $12.4 million upgrade for the facility, but it was not sufficiently complete to host the junior competition.\n\n\"There was a little bit of the stadium that wasn't finished, and that was the toilets and things like that,\" Wangaratta Basketball president Adam Maher said.\n\n\"There wasn't an easy way out of it until we did some more work with our council, so until we sort out those issues, we thought it was a better idea to go up to Wodonga.\"\n\nLauren Jackson fears young players will be turned away if more courts are not built. (ABC Goulburn Murray: Mikaela Ortolan)\n\nFormer Opal Lauren Jackson recently led training clinics across Australia and said she was concerned about the lack of courts for youth basketball.\n\n\"The more I talk to the states and territories, the more that you hear stories of kids having to be turned away from the game,\" she told the ABC while conducting training sessions in April.\n\nMore innovation needed\n\nDespite the challenges, Basketball NSW and Basketball Victoria said they were not sitting idle.\n\nBoth associations said they were working to meet the growing demand.\n\nBasketball NSW said the state needed 300 courts, and 54 were in the pipeline.\n\nThe Victorian government is either building or upgrading 16 courts through its Regional Sports Infrastructure Program announced in July 2023 after the 2026 Commonwealth Games were cancelled.\n\nThe government also allocated $800,000 to East Gippsland Council in its 2023 budget for upgrades to the basketball precinct at Lakes Entrance.\n\nBut Basketball Victoria general manager of government, strategy and innovation Jake Keogh said the state was 220 courts short of the number required.\n\nBasketball associations are scrambling to meet demand from young players. (ABC News: Sam Bradbrook)\n\n\"We have a strategic growth target of 4 per cent a year, which will mean we need 22 to 24 new courts a year,\" he said.\n\n\" In reality we are growing at 8 to 9 per cent and, in some parts of the state, we are growing at a 10 per cent rate. \"\n\nMr Keogh said initiatives were helping to attract more players to the sport, including organising more 3x3 street basketball tournaments, working with other sports such as netball to share courts, and delivering stripped-back facilities that were cheaper to build, such as the AWA stadium in Geelong.\n\nA state government spokesperson said more than $80 million had been invested in basketball infrastructure projects in regional areas.\n\n\"Councils are encouraged to apply for funding from our dedicated grants programs that support building and upgrading of basketball facilities across Victoria,\" the spokesperson said.\n\nFunding shortages\n\nBut regional councils said they were scrambling for scarce funding at best.\n\nGreater Shepparton City Council said it had campaigned for more funding from the Commonwealth ahead of the federal election and would continue to upgrade its sports stadium.\n\nThe Victorian government pledged $3 million towards the project.\n\nStage two of the Lauren Jackson Sports Centre upgrade is on the backburner. (ABC Goulburn Murray: Philippe Perez)\n\nThe second stage of upgrades to the Lauren Jackson Sports Centre in Albury has stalled amid funding uncertainty.\n\n\n\nIn the latest budget handed down in June, Albury City Council announced that the stage two upgrade would remain unfunded until at least 2029.\n\nA response to submissions in council papers said that was due to financial sustainability measures and competing project priorities, but the decision could be reviewed annually.\n\nDespite some of the issues, Mr Maher said the Wangaratta stadium was getting the improvements it needed, but would require more resources for completion.\n\n\"The council have produced four new courts and we have people coming down all the time saying it's a fantastic facility,\" he said.\n\n\"The council do recognise the facility needs more toilets … there's plumbing done, ready to go, but we obviously need to find some money to get to the next thing.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/pearl-jam-drummer-matt-cameron-departs-band-27-years/105506236",
        "title": "Pearl Jam drummer Matt Cameron quits band",
        "publish_date": "Tue, 08 Jul 2025 00:50:16 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Pearl Jam drummer Matt Cameron is departing the band after nearly three decades.\n\n\"After 27 fantastic years, I have taken my final steps down the drum riser for the mighty Pearl Jam,\" Cameron wrote in a statement on social media.\n\nHe offered \"much love and respect\" to frontman Eddie Vedder, guitarists Stone Gossard and Mike McCready, and bassist Jeff Ament for welcoming him into the group in 1998.\n\n\"And for giving me the opportunity of a lifetime, one filled with friendships, artistry, challenges and laughter.\n\n\"I am forever grateful to the crew, staff and fans the world over. It's been an incredible journey. More to follow.\n\n\"Thank you all from the bottom of my heart.\"\n\nThe 62-year-old drummer did not disclose specifics for his departure, nor did the remaining Pearl Jam members offer further explanation, instead celebrating Cameron in their own statement.\n\n\"He has propelled the last 27 years of Pearl Jam live shows and studio recordings. It was a deeply important chapter for our group and we wish him well always.\n\n\" He will be deeply missed and is forever our friend in art and music. \"\n\nLoading Instagram content\n\nPearl Jam's longest-serving drummer\n\nBefore joining Pearl Jam, Cameron was a member of Seattle-based rock bands Skin Yard and Soundgarden, performing on all the latter's studio albums.\n\nFollowing Soundgarden's initial break-up in 1997, Cameron was invited to tour with fellow grunge-era icons Pearl Jam on their 1998 Yield tour.\n\nHe became a permanent member, replacing Jack Irons — the latest in a series of departing Pearl Jam drummers — who had left to focus on health and family.\n\nCameron then permanently joined the line-up and his first album with Pearl Jam was their sixth, Binaural, released in 2000.\n\nHe played on the group's next six albums, the most recent being 2024's Dark Matter, which brought Pearl Jam — regular visitors to Australian shores since 1995 — back down under last year.\n\nMatt Cameron (far right) with his Pearl Jam bandmates (R-L) Eddie Vedder, Jeff Ament, Stone Gossard, and Mike McCready. (Danny Clinch)\n\nWhen Soundgarden reunited in 2010, Cameron recorded and toured as drummer for both bands until Soundgarden broke up permanently following the death of frontman Chris Cornell in 2017.\n\nHailed by Rolling Stone for playing that was \"as thoughtful as it is heavy\" when they ranked him 52nd on their list of the 100 Greatest Drummers of All Time, Cameron is a two-time Grammy Award winner and Rock & Roll Hall of Fame inductee, with both Pearl Jam and Soundgarden.\n\nLatest in a series of drummer departures\n\nThere is no indication who might fill Cameron's drum stool in Pearl Jam, but there are certainly a lot of options floating around.\n\nIn the past six months, several high-profile rock bands have parted ways with their drummers.\n\nIn May, Foo Fighters dismissed Josh Freese, who had drummed with Dave Grohl and co since the death of Taylor Hawkins in 2022, telling him they planned \"to go in a different direction with their drummer\".\n\nThe Who's drummer of nearly 30 years, Zak Starkey — son of The Beatles drummer Ringo Starr — was fired from the band in May for a second time, following an earlier firing and reinstatement in April 2025.\n\nEx-Foo Fighter Josh Freese is among more than a dozen drummers who have parted ways with high-profile rock bands this year.\n\nIn March, Guns N' Roses announced the \"amicable exit\" of their drummer of 19 years, Frank Ferrer. \"I will have immense gratitude and love always for Axl [Rose, frontman] and the band,\" Ferrer wrote on social media, \"while at the same time, disappointment that this chapter came to an end\".\n\nOther drummers looking for work include Chris Sharrock, who was not invited to join Oasis for their current reunion tour, Bob Dylan's long-term drummer Jim Keltner, ex-Primus drummer Tim \"Herb\" Alexander, Iron Maiden's Nicko McBrain and several more in a trend that US music publication Stereogum dubbed the \"Drumpocalypse\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-07-08/apple-pear-growers-struggling-in-goulbourn-valley/105450202",
        "title": "Australians urged to eat more fruit as growers struggle to break even",
        "publish_date": "Tue, 08 Jul 2025 00:47:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "After moving to Australia 19 years ago, Amarinder Bajwa built a career in Melbourne in transport.\n\nBut four years ago, he left it all behind to pursue his dream of being a farmer in Victoria's Goulburn Valley.\n\n\"I had no idea about Shepparton, but I came to visit a friend who had just bought a farm here,\" Mr Bajwa said.\n\n\"I really liked the weather and the way everything looked really green.\n\n\"It resembles my home country.\"\n\nApple growers are struggling to make a profit. (ABC Rural: Annie Brown)\n\nMr Bajwa, who grew up in Punjab in northern India, purchased a fruit orchard in Shepparton East with his brother, but it was not long before it got tough.\n\nHe lost nearly 70 per cent of his crop to a hailstorm, the orchard was flooded in 2022 and now the state is experiencing drought conditions.\n\nDespite all that, Mr Bajwa does not regret making the move.\n\n\"My only is regret is I made this decision very late — I could have done this 10 years ago,\" he said.\n\n\"I feel connected — farming brings communities together, whereas in metros you don't know your next-door neighbours.\n\n\"The support we've had from the community has been beyond my expectations.\"\n\nHard times for growers\n\nApple and Pear Australia Limited (APAL), which represents growers, said the industry was at a \"crossroads\" and most producers had not made a profit in the past four years.\n\nAPAL head of industry, government relations and advocacy Jeremy Griffith said he expected more orchards to be consolidated over the next five years.\n\nPear trees are ripped out as growers consolidate or diversify their orchards. (ABC Rural: Annie Brown)\n\n\"Input costs have ramped up dramatically, and supermarkets are not covering those costs,\" Mr Griffith said.\n\n\" Growers can survive one or two years like that, but they can't survive beyond that. \"\n\nMr Griffith said APAL's strategy for the next five years would focus on increasing consumer demand for fresh produce.\n\nNew export markets are opening up in China, but Mr Griffith said the industry really needed Australians to eat more fruit.\n\n\"Apple consumption has flatlined and we have certainly seen a decline in pear consumption,\" he said.\n\n\"We did see, in the last few years, 15 per cent of pear orchards removed.\"\n\nPears consumption in Australia continues to drop. (ABC Rural: Annie Brown)\n\nThe challenges continue to stack up, but Mr Griffiths said farm succession was one of the biggest concerns for orchardists.\n\n\"Their kids don't want to take over because they can't really see a future in it,\" he said.\n\n\"Working this hard and not being able to make a profit, it's a pretty depressing place for the industry to be in.\n\n\"It's a tough, tough business … and I'm yet to meet a grower who doesn't work seven days a week.\"\n\nTrying new things\n\nIt is Mr Bawja's unsinkable optimism that keeps him in the orchard every day.\n\nAmarinder Bajwa moved to Shepparton in 2021 to become an orchardist. (ABC Rural: Annie Brown)\n\n\"Everything has its pros and cons, but if you look at the positive side, it'll give you more energy to do good things,\" he said.\n\nMr Bawja is diversifying his crops so he does not have to rely on the income of an annual harvest, including growing broccolini year-round.\n\n\"This is the third year and we're really happy with the way things are coming up,\" he said.\n\nBroccolini has become an important crop for Amarinder Bajwa. (ABC Rural: Annie Brown)\n\nHe also plans to plant more apples and apricots.\n\n\"We are in the process of pulling old varieties out and replacing them with new varieties,\" Mr Bajwa said.\n\n\"They are better looking, better eating quality and better yields\n\n\" Business is not all about money — there are other businesses that make more money than this, but it's all about lifestyle balance. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/brick-portico-midland-highway-tasmania-relic-of-horton-college/105459350",
        "title": "Arch to nowhere is a Tassie landmark and relic of a 19th-century school",
        "publish_date": "Tue, 08 Jul 2025 00:24:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "All that remains of Horton College is the brick portico, an arch to nowhere that is a Midland Highway landmark.\n\nBut there once stood a prestigious 19th-century boys school that boasted of producing many of Tasmania's most successful barristers, doctors and well-known religious leaders.\n\nIt was built near Ross in 1852, after Captain Samuel Horton offered the Wesleyan Church 20 acres and 1,350 pounds to establish a boys school.\n\nThe Tasmanian Wool Centre in Ross holds some of Captain Horton's history.\n\n\"Captain Horton is a really important figure in the history of Ross,\" centre manager Jess Newton told ABC Radio Hobart.\n\nThe Horton College portico as it looks today, on the side of the Midland Highway. (Wikimedia Commons: JTdale, CC BY-SA 4.0)\n\nMs Newton said he was given a big parcel of land, known as Somercotes, when he arrived in 1823 from the merchant navy.\n\nThe farm is still in family hands, making it one of the few Australian properties to remain in continual family ownership.\n\nCaptian Horton was reportedly persuaded to come to Van Diemen's Land by his cousin, who was the first Wesleyan minister in Hobart Town.\n\n\"He was a staunch Wesleyan, he really wanted to bring a strong Methodist teaching to the Midlands,\" Ms Newton said.\n\nShe said the college was \"very prestigious\".\n\n\"People would send their boys over from the mainland,\" she said.\n\nAn advertisement for Horton College. (Supplied: Tasmanian Archives/Anson Brothers)\n\nHorton 'vanished as a school'\n\nThe foundation stone for Horton College was laid in 1852.\n\nFrom 1855 until its closure in 1894, 770 boys attended the school.\n\nEnrolments fluctuated over the years, from 15 to 86 boys.\n\n\"It burned bright and then they ended up running out of money,\" Ms Newton said.\n\nWhen the longstanding headmaster William Fox resigned due to ill health, the college passed through several hands of management during difficult economic times.\n\nThe college was also competing with schools in Launceston and Hobart that were considered more convenient.\n\nIt was decided to \"hold a sale of materials in and about the property to liquidate the debt which had fallen upon it,\" The Mercury reported.\n\n\"It vanished as a school amid the regrets of all but not before it had performed splendid services in the cause of education,\" the report said.\n\nThe Wool Centre holds the school's honour board, a seachest belonging to Captain Horton, and a portrait of him and his wife.\n\nThe school's bell went to the Hutchins School in Hobart, and some bricks went to Scotch Oakburn College in Launceston.\n\nHorton College inspired the establishment of Methodist Ladies' College, which later became Scotch Oakburn College.\n\nThe school boasted of producing some of Tasmania's best-known barristers, doctors and clergymen. (Supplied: Tasmanian Archives)\n\nLife at the college\n\nA 1920 report in The Mercury recounted the college's history to mark its demolition.\n\nLife at Horton College was described as \"free and pleasant\", with Sunday enjoyed especially because the boys didn't have to get out of bed until 7am instead of 6:30am.\n\nIt was described as being founded along the lines of a traditional old English boarding school, with the \"freer and more independent atmosphere of Australia\".\n\nAn hour after breakfast on Sundays, the boys would walk \"four abreast into Ross\" for church, which was about 4 kilometres one way.\n\nThe report said a popular way of spending afternoons was for small parties of the boys to visit huts and enjoy an \"alfresco meal of chipped potatoes, a rabbit boiled in a billy can and damper made on stones\".\n\nThe college closed in 1894 after experiencing financial difficulty. (Supplied: Tasmanian Archives)\n\n\"Bathing in the Macquarie River was a favourite sport of the boys, and they were often on hot days allowed to leave school at three o'clock instead of four for this purpose,\" the report said.\n\nDespite the boys' pedigree, it was reported some were still caught smoking.\n\n\"Boys of today will be glad to learn that boys of that generation were no better, and probably no worse, than they are now, and some of the Horton College boys used to indulge, as boys always do, in surreptitious smokes,\" the report said.\n\n\"One old boy, at present in Hobart, tells a story of a schoolmate who produced a couple of clay pipes and some fig tobacco, and persuaded him to master the gentle art of smoking behind a wood fence.\"\n\nPortico of light\n\nTasmanian landscape photographer Luke Tscharke brought Horton College back into the limelight by capturing the portico with a bright aurora australis behind it in 2018.\n\nLuke Tscharke captured the portico with the aurora overhead. (Supplied: Luke Tscharke)\n\n\"I'd seen it from the roadside, like how most Tasmanians have seen it in their lifetime,\" Mr Tscharke said.\n\n\"As a photographer, I'm always looking for interesting subjects and features to include in the photographs I take.\"\n\nHe said he stored it away in the \"location library\" in his mind.\n\nA few weeks after returning from photographing the northern lights in Norway, Tasmania experienced a significant aurora and Mr Tscharke was keen to continue his work.\n\nHobart had cloud, so he decided to head north to the Midlands with a friend.\n\nMr Tscharke thought of the portico, and got permission to go onto the Somercotes property.\n\n\"The aurora kicked off and I put a light inside the portico to create a little bit of warmth to it,\" Mr Tscharke said.\n\n\"It was very fortunate how the aurora worked with the scene.\n\n\"It was just one of those crazy evenings where everything happened to come together,\" he said.\n\nThe shot is one of his most popular aurora photos, and will be exhibited during the Beaker Street Festival in August.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/olympic-fencer-thibus-cleared-of-doping-kissing-defence/105505994",
        "title": "Olympic fencer beats doping case, saying kissing caused positive drug test",
        "publish_date": "Tue, 08 Jul 2025 00:10:49 +0000",
        "category": "sports",
        "authors": [],
        "text": "French Olympic fencer Ysaora Thibus has been cleared of a doping allegation because judges accepted she was contaminated by kissing her American partner over a period of nine days.\n\nThe Court of Arbitration for Sport ruling echoed a verdict clearing another French athlete with a similar defence in a doping allegation — tennis player Richard Gasquet in the celebrated \"cocaine kiss\" case in 2009.\n\nCAS said in the Thibus case its judging panel dismissed an appeal by the World Anti-Doping Agency, which asked for her to be banned for four years.\n\nThibus tested positive for the anabolic substance ostarine in January 2024. She was later cleared by an International Fencing Federation tribunal weeks before the Paris Olympics, which let her compete there.\n\nThibus and her then-partner, Race Imboden, pictured together prior to the Tokyo Olympics. (Getty Images: Elisa Ferrari)\n\nWADA challenged the explanation that Thibus was contaminated \"through kissing with her then partner, who had been using a product containing ostarine without her knowledge\", CAS said.\n\n\"It is scientifically established that the intake of an ostarine dose similar to the dose ingested by Ms Thibus's then partner would have left sufficient amounts of ostarine in the saliva to contaminate a person through kissing,\" the court said on Monday.\n\n\"[The judges] accepted that Ms Thibus's then-partner was taking ostarine from January 5, 2024, and that there was contamination over nine days with a cumulative effect.\"\n\nHer partner at the time was Race Imboden, a two-time Olympic fencing bronze medallist for the United States.\n\nThibus, a silver medallist for France in women's team foil at the Tokyo Olympics, placed fifth at that event in Paris and 28th in the women's individual foil.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/afl-willie-rioli-considered-retirement-racism-off-field-drama/105505792",
        "title": "Rioli considered retiring as racism and off-field drama became 'a bit too much'",
        "publish_date": "Mon, 07 Jul 2025 23:34:15 +0000",
        "category": "sports",
        "authors": [],
        "text": "Port Adelaide forward Willie Rioli says he almost quit football and feels some blame for the drop of Indigenous players drafted to the AFL.\n\nRioli has revealed he considered retiring in the midst of controversies in late April and early May.\n\nIn a social media post in late April, the Power forward expressed a hatred for Hawthorn in the wake of racism allegations against the rival club.\n\nAnd in early May, Rioli was banned for one game for a social media threat to Bailey Dale after the Western Bulldog made what Port described as a culturally insensitive remark during a game.\n\nRioli returns to Port as coach labels racist attacks an 'absolute disgrace' Photo shows Willie Rioli of the Power celebrates kicking a goal, pumping his fists and screaming Willie Rioli returned to training after being granted a day off as he dealt with racist attacks online as Port coach Ken Hinkley hit out.\n\n\"Definitely it gets to a point where it's a bit too much sometimes,\" Rioli told Port's club podcast, Peeled.\n\n\"And yeah I have spoken to my manager and the club a couple of times about walking away from the game, which I am not shy to talk about.\n\n\"More so … trying to not be putting any more pressure on the club. Get them out of the spotlight as well, in terms of not have to deal with my issues so much as a person off-field.\"\n\nRioli said he carried a weight of past indiscretions including his 18-month suspension from 2019 for trying to swap his marijuana-tainted urine sample with a clean sample in a drug test while at West Coast.\n\nDescribing the suspension as a \"dark time\", Rioli feared he may be scaring recruiters from drafting Indigenous players.\n\nThe number of Indigenous players has dropped to 62 this year, from a high of 87 in 2020.\n\n\"I know it's mainly because of COVID,\" Rioli said of the declining Indigenous representation.\n\n\" I do hold a bit of blame myself a little bit for some of the stuff I have been through, in terms of clubs not trusting Indigenous players. \"\n\nThe 104-gamer said he continued his career partly to rectify any such perception.\n\n\"I felt that was my driver to come back to footy … be the light in terms of 'we can go through this',\" he said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I look at the drop in terms of Indigenous players in the competition … that gives me the motivation to stick around longer, to help the next generation do better than what we are doing or what I am doing.\n\n\"It's more just trying to show the real person I am.\n\n\"And be a leader and be a role model for the next generation to be like, 'Look, he can take this stuff' but he's still been strong enough to hang around.\n\n\"I want the next [Indigenous] generation to be better than what we are right now.\n\n\"And I want them to have their confidence to make mistakes and not be judged by their mistakes.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/darling-downs-zoo-reopens-after-lion-attacks-woman/105503680",
        "title": "Queensland zoo reopens two days after woman loses arm in lion attack",
        "publish_date": "Mon, 07 Jul 2025 23:09:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Darling Downs Zoo south of Toowoomba has reopened two days after a woman lost her arm in a lioness attack.\n\nThe zoo's full program of visitor activities resumed this morning, as Workplace Health and Safety Queensland's investigation of the circumstances around Sunday's incident continued.\n\nOwner Steven Robinson said the woman who was attacked was his sister-in-law, a schoolteacher from NSW.\n\n\"In the enclosure, my wife and a carnivore keeper had just finished cleaning it out, so the animals … were in a holding enclosure,\" he said.\n\n\"They had just come out of the enclosure ... [and were] locking up the gates and they heard the call [for help].\"\n\nOwner Steven Robinson urged people not to jump to conclusions about the attack (ABC South Qld: Dan McCray)\n\nMr Robinson said his sister-in-law had stayed at the zoo regularly over the past 20 years and was aware of the safety regulations.\n\nHe said they were yet to speak to her, as she was still recovering in Brisbane's Princess Alexandra Hospital, but she had not entered the enclosure.\n\n\"Nobody saw what happened … it was all over in a split second,\" Mr Robinson said.\n\n\"One of our keepers who's well versed in first aid, she was the first responder … she saved her life.\"\n\nThe injured woman in her 50s underwent surgery yesterday morning and is recovering in a stable condition.\n\nQueensland Health Minister Tim Nicholls confirmed she had lost an arm.\n\nCommunity support\n\nVisitors returned to Darling Down Zoo this morning as soon as it reopened.\n\nRalph Bosch from Withcott in the Lockyer Valley decided to visit with his daughter and grandchildren.\n\nHe said he wanted to support the zoo and make it an exciting day for the children.\n\nRalph Bosch wants to keep supporting the zoo. (ABC South Qld: Dan McCray)\n\n\"I would have been here three months ago; it's good to see that [the zoo] is opening up and people can get on with their lives,\" he said.\n\n\"Hopefully the person who was involved will recover.\"\n\nInvestigations into the incident are ongoing. (ABC News)\n\nWorkplace Health and Safety Queensland said a number of compliance notices had been issued to the zoo.\n\nIn an earlier online post, Darling Downs Zoo operators said at no stage during the attack did the lioness leave its enclosure\n\n\"There was no risk at all to staff members or members of the public,\" the post read.\n\nSpatial buffers the gold safety standard\n\nAustralian zookeeping standards require spatial buffers between big cats and any keepers that enter their enclosures.\n\nConservation biologist Alex Braczkowski said this gold standard made attacks like Sunday's rare, but it was a reminder of the dangers of working with big cats.\n\n\"You are talking about animals that weigh anything from 180 to 250 kilograms and have canines that are over two inches long — these things, unfortunately, can still happen,\" Dr Braczkowski said.\n\nDarling Downs Zoo is home to several species of big cats. (ABC News: Tobi Loftus)\n\n\"If this had happened in western Uganda or eastern Kenya it's doubtful whether the victim would have been able to survive, just due to the proximity of medical care.\"\n\nDarling Downs Zoo said the lioness involved in the attack would not be put down.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/wa-estimates-reveal-bussell-highway-duplication-cost-blowout/105489998",
        "title": "Cost of long-awaited South West highway duplication doubles to $170m",
        "publish_date": "Mon, 07 Jul 2025 23:02:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "The cost of a long-awaited road upgrade pitched as a congestion-buster for tourists heading to Western Australia's South West has blown out to $170 million as the project finally nears completion.\n\nThe single-lane stretch of Bussell Highway between Capel and Busselton has long been a traffic bottleneck, particularly during holidays and long weekends when tens of thousands of tourists make the 200-kilometre drive south from Perth.\n\nSold as a solution to those frustrations, duplicating the highway has also come at double the initial projected cost, according to figures revealed during budget estimates hearings last week.\n\nLengthy roadworks associated with the duplication have frustrated residents. (ABC South West: Anthony Pancia)\n\nThe major road project has dragged on despite the Cook government promising its completion by the end of 2024.\n\nA Main Roads spokesperson said some short-term traffic management may remain in place, but the majority of work was now complete.\n\nHowever, months of delays and many millions in additional spending have left some locals pondering whether it was worth the cash and time.\n\nWas the road worth the wait?\n\nCapel resident Corrie Young said she was unimpressed with the final product.\n\nShe regularly uses the road to drive in and out of Busselton.\n\n\"I'm not very happy with it at all,\" she said.\n\n\" It's not a very good road … it's not very smooth, there's a lot of bumps. \"\n\nThe project was pitched as a solution to traffic jams that have plagued the highway. (ABC News: Jacqueline Lynch)\n\nMs Young said the last few years had been \"terrible\" as construction on the road had dragged on, leaving many drivers frustrated over lane closures and speed reductions.\n\nOthers were more positive.\n\n\"It's fantastic, I can just zip down from the farm to Busselton. It's flat, it's smooth, it's quick,\" commuter Steve Jones said.\n\n\" The new highway is great and the job they've done, particularly for the last six months, has been incredible. \"\n\nRita Saffioti says the cost blowout is due to rising construction prices worldwide. (ABC News: Andrew O'Connor)\n\nMinister blames rising costs\n\nIn WA's Legislative Council estimates last week, Transport Minister Rita Saffioti blamed the price escalation on rising construction costs around the world.\n\n\"I am very proud that we have delivered the Bussell Highway duplication,\" she said.\n\n\"It was not an election commitment, but I was very determined to get it done, and we did it through negotiations with the Commonwealth.\"\n\nThe Bussell Highway duplication is not the only road project that has blown out in WA's south.\n\nThe cost of the Bunbury Outer Ring Road that opened late last year — now the Wilman Wadandi Highway — swelled to $1.46 billion, more than $600 million over what was initially estimated.\n\nThe Wilman Wadandi Highway links the Bussell and Forrest highways. (Supplied: Nearmap)\n\nAre the roads still value for money?\n\nQuestions also remain around the overall benefit delivered by both projects.\n\nCurtin University researcher and former Infrastructure Australia board member Peter Newman said the development, while popular, came at the cost of alternatives.\n\n\"Both of them are extraordinarily over-designed … in my view, they take up a massive amount of space,\" Professor Newman said.\n\nThe Wilman Wadandi Highway went $600 million over budget. (Supplied: Main Roads)\n\nHe believed the money would be better spent on electric public transport links to the South West region.\n\n\"We need much better, faster and electric public transport services that can go from Perth to Bunbury, down to Busselton and into the South West,\" he said.\n\n\"These [ideas] are not ever getting onto the agenda because of the massive amount of money that is being spent on these kinds of [road] projects.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/tdf-jasper-philipsen-crashes-out-on-stage-three/105505672",
        "title": "Groves in line to lead team after Tour stage winner breaks collarbone",
        "publish_date": "Mon, 07 Jul 2025 22:41:15 +0000",
        "category": "sports",
        "authors": [],
        "text": "Belgian team Alpecin-Deceuninck could turn to Australian Kaden Groves to lead its Tour de France push after stage one winner Jasper Philipsen was forced to abandon his race after breaking his collarbone.\n\nBelgian rider Tim Merlier won the crash-marred third stage in a photo finish and Mathieu Van der Poel kept the yellow jersey.\n\nDefending champion Tadej Pogačar and two-time winner Jonas Vingegaard — the main contenders — finished safely as they rolled in together with the main pack.\n\nBut stage one winner Philipsen abandoned after he broke a collarbone in one of the early crashes.\n\n\"Philipsen was the victim of something he had nothing to do with,\" Alpecin-Deceuninck team manager Philip Roodhooft said.\n\n\"We can't blame the other two directly, either. It was just a stupid crash, something that unfortunately can happen in cycling. And unfortunately, Jasper is paying the price.\"\n\nRoodhooft said the team may turn to Groves to lead its campaign, with the Australian currently sitting in seventh.\n\n\"It's still too early to say what we're going to do, but we have other good riders. I'm thinking of Kaden Groves, but now is not the time to talk about that,\" Roodhooft said.\n\n\"Jasper is still suffering from burns and has been badly bruised, so how we proceed is not the most important thing right now. We have to keep going, and Jasper will want that too, but I'm putting that discussion on hold for now.\"\n\nMerlier just got the front of his wheel in front of Italian Jonathan Milan as they lunged to the line to finish the stage. German rider Phil Bauhaus was third.\n\nIt was Merlier's second career stage win on the Tour, four years after his first, which also came on stage three.\n\n\"It was a big battle and it was difficult to maintain my position, I came from very far back in the last 2 kilometres,\" he said.\n\n\"When I found myself next to Milan, I knew it would be complicated to beat him.\"\n\nVan der Poel, who rides for the Alpecin-Deceuninck team, did not contest the sprint the day after narrowly beating Pogacar to win Sunday's rainy and hilly second stage.\n\nRiders set off in wet conditions and wore light rain jackets on a 178km flat route from Valenciennes to coastal Dunkerque.\n\nThe pace was slower than the two first days but the conditions were treacherous and, about 50km from the end, Philipsen was knocked over by Frenchman Bryan Coquard and landed heavily on his side. Coquard was not to blame, however, as he lost balance only after being clipped by a rider overtaking him on the right.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBeside his broken right collarbone, Philipsen might have two broken ribs, his Alpecin–Deceuninck team said, adding he needed surgery.\n\nCoquard looked remorseful when he spoke to media outside the Cofidis team bus after the stage.\n\n\"I've seen the images again, I really didn't know what happened in the moment,\" he said.\n\n\"I would like to say sorry to Philipsen and Alpecin, even if it was not an intentional act.\"\n\nAnother crash with 3 kilometres left felled double Olympic champion Remco Evenepoel, who was able to continue.\n\nThen, with the finish in sight, a few more crashed — including Coquard, who somersaulted off his bike.\n\nThe 174km fourth stage is another hilly one for all-rounders like Van der Poel and his former cyclo-cross rival Wout van Aert. It starts from Amiens and ends with five consecutive small climbs to the Normandy city of Rouen.\n\nThis race is entirely in France, with no stages held abroad as in previous years, and ends on July 27 in Paris.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/bhp-mining-labour-hire-same-job-same-pay-defeat-pay-increase/105499828",
        "title": "Landmark ruling orders BHP to pay labour hire workers an average $30,000 more",
        "publish_date": "Mon, 07 Jul 2025 22:36:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mining giant BHP has been defeated in a landmark test of the federal government's \"same job, same pay\" laws and ordered to pay 2,200 of its Central Queensland coal miners an average of $30,000 more.\n\nLabour hire workers at BHP's Saraji, Peak Downs and Goonyella Riverside mines will now receive the same wages as their directly employed peers.\n\nIt is the largest ruling relating to the coal mining sector since the Albanese government's \"same job, same pay\" laws came into effect last year.\n\nThe laws require labour hires to be offered the same pay and conditions as full-time employees when doing the same work.\n\nIf applied to all labour hires across its mines, the ruling could cost BHP around $1.3 billion a year, according to the Australian Resources and Energy Employer Association (AREEA).\n\nThe Mining and Energy Union made the application to the Fair Work Commission and BHP had argued for an exemption on the grounds that the workers were providing a service, not labour, but its case was unsuccessful.\n\nThat service contractor exemption was added to the labour hire laws in negotiations with AREEA in 2023, and the association has renewed calls for further amendments following this case.\n\nThe mining union's Queensland president, Mitch Hughes, said the ruling was a significant win for coal workers and marked a \"nail in the coffin for BHP's sham labour hire model\".\n\n\"If you are doing the same job as the person beside you, you deserve the same pay,\" he said.\n\n\"What we'd like to see is the likes of BHP and mining companies turn these jobs into permanent jobs.\"\n\nBHP has been contacted for comment but has previously warned such a ruling could put thousands of jobs at risk.\n\nThe decision marks the seventeenth successful application for the union.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/easy-ways-to-obtain-medical-certificate-for-sick-carer-leave/105503422",
        "title": "Easiest and cheapest ways to get a medical certificate for sick leave",
        "publish_date": "Mon, 07 Jul 2025 22:29:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Winter has well and truly arrived — and so has cold and flu season — meaning some of us may need time off to care for ourselves or a loved one.\n\nWorkplaces often require evidence for sick or carer's leave, so what are your options for getting that?\n\nWhen do you need a medical certificate?\n\nAccording to the Fair Work Ombudsman, an employer can ask an employee to provide evidence showing they took leave because they were:\n\nUnable to work because of illness or injury, or Needed to provide care or support to an immediate family or household member because of illness, injury or an emergency\n\nHow to call in sick Photo shows woman holding her dog while on the phone We look at your obligations when it comes to calling in sick, including what to say and what evidence you may need.\n\nThis can be for as little as one day or part of a day off work, and an employee who does not supply documentation may not be entitled to be paid for their sick or carer's leave.\n\nHowever, Shae McCrystal, professor of Law at the University of Sydney Law School, on the traditional lands of the Gadigal people, says medical evidence is not always required for personal leave, and employees should familiarise themselves with their workplace's enterprise agreements and industrial awards.\n\nThe Fair Work Ombudsman says: \"While there are no strict rules on what type of evidence needs to be given, the evidence has to convince a reasonable person that the employee was genuinely entitled to the sick or carer's leave.\"\n\nGetting a medical certificate from a GP\n\nVisiting a fully bulk-billing doctor for a free consultation is an efficient and cost-effective way to get a medical certificate.\n\nHowever, recent surveys by ABC News and the Royal Australian College of GPs show fewer than 10 per cent of GPs exclusively bulk-bill patients, with average out-of-pocket costs to see a GP ranging from about $40 to $55.\n\nSecuring a GP appointment at short notice can also be difficult, especially for Australians living in regional and remote areas.\n\nUsing telehealth services\n\nBooking a telehealth appointment can be a convenient way of securing a medical certificate, particularly if you are physically unable to get to a doctor or cannot secure an appointment.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nThese appointments are offered via video or phone, and patients who use a telehealth service are generally directed to a short questionnaire and then assessed by an Australian Health Practitioner Regulation Agency-approved health practitioner.\n\nCosts of telehealth consultations can vary, with some costing less than $20, but according to Queensland Health, a telehealth appointment \"should cost the same as an in-person appointment\".\n\nPharmacy-issued absence-from-work certificates\n\nPharmacists can also issue absence-from-work certificates for a range of minor ailments within the scope of their practice.\n\nThe cost of a pharmacy-issued absence-from-work form usually ranges from $20 to $35 for a single-day certificate, and Pharmacy Guild of Australia's Victoria vice-president Anthony Tassone says they can be issued for illnesses such as cold and flu, diarrhoea or migraines and severe headaches, for example.\n\n\"[Illness where] they're not well enough to work, but it should resolve soon,\" Mr Tassone says.\n\nStatutory declarations for sick or carer's leave\n\nThe Fair Work Ombudsman says statutory declarations are also an acceptable form of evidence for sick or carer's leave.\n\nWhat is a digital stat dec and can you use one for sick leave? Photo shows A sick-looking woman with long brown hair wipes her nose with a tissue while sitting in front of a laptop, talking on a phone. You can now use an online statutory declaration as evidence for personal leave from work.\n\nAlthough there is no cost involved in getting a statutory declaration (stat dec), it has historically involved downloading and printing the form, filling out facts that you declare to be true and accurate, and having the document signed by a witness such as a justice of the peace.\n\nHowever, under legislative changes that came in early 2024, it is now possible to make commonwealth stat decs using your Digital Identity by creating a myGovID and attaching it to your myGov account.\n\nAustralian National University professor of law and regulation Veronica Taylor says digital and paper stat decs \"have exactly the same effect\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/snowy-hydro-lobs-hole-concrete-lab-closed-amid-silica-concerns/105435138",
        "title": "Concrete lab at Snowy 2.0 closes over silica exposure concerns",
        "publish_date": "Mon, 07 Jul 2025 22:21:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "A concrete testing lab at the multi-billion-dollar Snowy 2.0 pumped hydro project has been closed for nearly two months amid concerns workers were being exposed to silica.\n\nSafeWork NSW said it responded to a request for service at Lobs Hole Test Laboratory on May 15 regarding concerns about respirable crystalline silica (RCS).\n\nThe inhalation of fine silica dust can result in the lung disease silicosis, causing long-term lung damage that can be fatal.\n\nSafeWork NSW documents seen by the ABC revealed the health and safety authority believed workers were exposed to \"respirable dust and RCS in [a] lab building at Lobs Hole\".\n\nIn a statement, SafeWork NSW told the ABC the business had \"ceased use of the laboratory\" while the concerns were being addressed.\n\n\"SafeWork NSW enquiries remain open as work continues with the business and the health and safety representatives to ensure adequate control measures are implemented,\" the statement read.\n\nThe Snowy 2.0 project is expected to start delivering power to the national grid in 2027. (ABC South East NSW: Floss Adams)\n\nThe project's principal contractor, Future Generation Joint Venture (FGJV), was directed to take measures to mitigate further risks, including cleaning the lab's walls and floors, and putting in additional ventilation systems to extract dust from all rooms in the building.\n\nConcrete testing operations have not been impacted by the lab's closure, as testing has been diverted to another lab.\n\nSnowy Hydro confirmed up to 12 employees worked in the Lobs Hole concrete lab.\n\nIn a statement, Snowy Hydro said it expected \"the highest standards of safety, focus and leadership\" from FGJV.\n\n\"We are always clear that the safety and wellbeing of the Snowy 2.0 workforce must always come first,\" the statement read.\n\nThe project is located in the NSW Snowy Mountains.\n\nSnowy Hydro says it expects the highest safety standards from its delivery partner FGJV. (ABC South East NSW: Floss Adams)\n\nRisks of silica exposure\n\nIn March, the NSW government formed an expert taskforce of government, medical, industry and union representatives to address silica-related health risks to tunnelling project workers across the state.\n\nMonash University professor of respiratory pharmacology Jane Bourke said workers in industries like tunnelling, mining and construction, and those working with engineered stone bench tops, could be exposed to silica dust.\n\n\"If it [silica dust] is ground to very small-sized particles, it can bypass all the body's normal defence mechanisms that we have when we breathe in things that shouldn't be in our body,\" she said.\n\n\"The body's not able to cough it out or clear it from the lungs. And this eventually causes inflammation and scarring of the lungs.\"\n\nProfessor Bourke said silicosis in the tunnelling industry was \"an area of emerging concern\", after more than a dozen Sydney tunnel workers were diagnosed with the incurable disease.\n\n\"It would be naive to think that the disease is absent in other workplaces where there would be a similar level of risk,\" she said.\n\n\" There's no safe levels of silica … exposure is dangerous and everything should be done to ensure that workers are not exposed to it in the first place. \"\n\nJane Bourke says preventing exposure to silica dust is the most important way to protect workers. (ABC South East NSW: Floss Adams)\n\nIn a statement, FGJV said it prioritised \"the safety and wellbeing of its workforce as a fundamental aspect of the operation\".\n\n\"FGJV is proactive and works in collaboration with health and safety representatives and SafeWork NSW to ensure the highest standards of wellbeing for those delivering Snowy 2.0,\" it said.\n\nSafeWork NSW told the ABC it had an \"active presence in tunnelling projects\".\n\nProject setbacks\n\nThe Snowy 2.0 project is expected to provide up to 2.2 gigawatts of electricity to the national grid once completed.\n\nThe controversial project is expected to start delivering power in late 2027, following a string of setbacks.\n\nWork on the $12 billion project stopped in January when concerns were raised about the status of \"last resort\" chambers, designed to be used in an emergency when workers were unable to evacuate.\n\nUnderground work was also halted again for three weeks in late February, after a ventilation fan imploded on site and sent metal shrapnel flying through the air.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/cricket-wiaan-mulder-367-brian-lara-test-record-declaration/105505678",
        "title": "Proteas captain declares 34 runs short of beating Lara's Test record",
        "publish_date": "Mon, 07 Jul 2025 22:07:49 +0000",
        "category": "sports",
        "authors": [],
        "text": "South Africa stand-in captain Wiaan Mulder felt he had no right to dislodge West Indies great Brian Lara from the summit of highest Test innings scores and decided to declare his team's innings against Zimbabwe when he was 34 runs short of breaking the record.\n\nMulder was 367 not out at lunch on the second day of the second test at the Queens Sports Club on Monday when he made the surprise call not to continue batting, passing up the opportunity to set a unique cricketing milestone.\n\n\"First things first. I thought we'd got enough and needed a bowl. And, secondly, Brian Lara is a legend, let's be real,\" Mulder said at the close of play on Monday.\n\n\"He got 400 against England [in Antigua in 2004] and for someone of that stature to keep that record is pretty special. I think if I get the chance again, I'd probably do the same thing.\"\n\nThe 27-year-old all-rounder, in his first stint as captain, said he also got support for his decision from coach Shukri Conrad.\n\n\"He said to me, 'Let the legends keep the really big scores'. And you know, you never know what's my fate or what's destined for me, but I think Brian Lara keeping that record is exactly the way it should be.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nMulder did notch up the fifth-highest Test score and, on the list of triple centurions, now sits above the likes of Don Bradman and Gary Sobers.\n\nHe was only recently promoted up the South Africa order to fill the troublesome number three position and before his triple hundred averaged only 26.20 in 33 test innings, with two previous tons.\n\n\"To be honest with you, I've never even dreamed of getting a double hundred, never mind a triple hundred,\" he said on Monday after lashing a mediocre home attack to all corners in an impressive knock that included 53 boundaries.\n\n\"But it's super special and the most important thing is putting the team in a good position to hopefully win this test,\" Mulder added.\n\nSouth Africa, which declared on 5-626, is in a commanding position with Zimbabwe trailing by 405 runs, having been forced to follow on after being dismissed for 170 in their reply, with Mulder taking two wickets to top off a day he will never forget.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/willyama-high-school-demolition-after-mould-outbreak/105503538",
        "title": "Demolition of mould-infested high school begins 18 months after closure",
        "publish_date": "Mon, 07 Jul 2025 21:54:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Eighteen months after a Broken Hill high school was forced to close indefinitely due to a major mould infestation, demolition work has begun.\n\nMore than 600 Willyama High School students had to be relocated to alternate schools in January last year after the start of term one.\n\nThe public high school in Far West New South Wales was earmarked for demolition last March after an independent hygienist report found the mould infestation was so extreme the building would have to be stripped down to its bricks to be safe again.\n\nThe rebuild, which local MP Roy Butler believes will cost between $90–100 million, is expected to start early next year, with students returning from 2027.\n\nIn the past, locals living near the site voiced concerns about potentially coming into contact with hazardous material, including mould or asbestos, during the demolition.\n\nWhat appears to be insulation and other raw materials is being cleared and pushed into piles. (ABC Broken Hill: Bill Ormonde)\n\nIn a statement, a NSW Department of Education spokesperson said surrounding residents should not worry.\n\n\"Before heavy demolition began in the area, all associated hazardous materials were safely removed, and the area inspected to confirm remediation was safely completed,\" they said.\n\n\"The safety and wellbeing of our students, workers and the community is our highest priority, and we will keep the community updated as work progresses.\"\n\nThe spokesperson said the process had been carefully staged to \"prioritise safety and minimise disruption to the local community\".\n\n\"All demolition activities are being undertaken in alignment with the Remediation Action Plan developed by an independent hygienist for the site,\" they said.\n\nThe NSW government announced last month it had allocated more than $50 million in the state budget to start the Willyama High School rebuild.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-08/tennis-jannik-sinner-grigor-dimitrov-retirement-wimbledon/105505554",
        "title": "Dimitrov retires hurt while holding two-set lead over Sinner",
        "publish_date": "Mon, 07 Jul 2025 21:34:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jannik Sinner advanced to the Wimbledon quarterfinals despite hurting his right elbow in a fall and dropping the first two sets, because his opponent, Grigor Dimitrov, had to quit with an injured pectoral muscle.\n\nThe top-seeded Sinner hadn't dropped a set in the tournament until falling behind 19th seed Dimitrov 6-3, 7-5.\n\nBut at 2-2 in the third set, Dimitrov stopped playing.\n\nIt's the fifth consecutive grand slam tournament where the 34-year-old Dimitrov has retired hurt. He also did it at the Australian Open in January and the French Open in May, plus last year's Wimbledon and US Open.\n\n\"He's been so unlucky in the past couple of years. An incredible player. A good friend of mine, also. We understand each other very well, off the court, too,\" Sinner said.\n\n\"I hope he has a speedy recovery.\"\n\nOn the last point against Sinner, Dimitrov served and immediately clutched his chest with his left hand. He took a few steps and crouched, before sitting on the grass. Sinner walked over to that side of the court to check on him.\n\n\"My pec,\" Dimitrov told Sinner.\n\nDimitrov — a three-time major semifinalist, including at Wimbledon in 2014 — then went to the sideline, sat in his chair and was checked by a trainer and doctor.\n\nAs Dimitrov talked with them, Sinner knelt nearby. After a delay of a few minutes, Dimitrov walked toward the locker room with the medical personnel.\n\nSoon, he re-emerged and said he couldn't continue.\n\n\"I don't take this as a win, at all,\" Sinner said.\n\n\"This is just a very unfortunate moment to witness for all of us.\"\n\nTwo hours earlier, it was Sinner down on the ground and seemingly in trouble. He was hurt in the opening game, when his foot gave out from under him and he slipped and fell behind a baseline, bracing his fall with his right hand while still holding his racket.\n\nDuring a medical timeout while trailing 3-2 in the second set, Sinner winced as a trainer massaged the elbow.\n\nSinner's coaches, Darren Cahill and Simone Vagnozzi, looked on from their box with concern.\n\nSinner was given a pill to take and play resumed. He frequently shook his right arm or rubbed his elbow between points.\n\nSinner needed treatment on his troublesome right elbow during the match against Dimitrov. (Getty Images: Jordan Pettitt)\n\nThe 23-year-old Italian is a three-time grand slam champion who will play the 10th-seeded Ben Shelton of the United States for a berth in the semifinals. Sinner leads the head-to-head series 5-1 and has won their past five matches, all in straight sets, including at Wimbledon last year and the Australian Open this year.\n\nSinner entered Monday having lost a total of just 17 games in the tournament, tying the record for the fewest in the Open era by man at Wimbledon through three completed matches.\n\nRight after he fell behind by two sets against Dimitrov, the match was paused so the stadium's retractable roof could be closed because of fading sunlight.\n\nTwo-time Wimbledon champion Andy Murray was not a fan of that decision, writing on social media: \"So ridiculous to close the roof at this stage of the match. At least an hour of light left … well over a set of tennis can still be played..its an outdoor tournament!\"\n\nAbout a half-hour later, the match was over.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-07-08/sheep-producer-turns-to-cropping-to-drought-proof-property/105485398",
        "title": "Grazier prepares for drought by growing sorghum to bury in the outback",
        "publish_date": "Mon, 07 Jul 2025 21:28:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "While grazing cattle and sheep quietly move through the Mitchell grass plains of Boyd Webb's outback station, a harvester is reaping what he has sown in a nearby paddock.\n\nHis property at Muttaburra sits in the geographical centre of Queensland and the heart of its grazing country, but for the past four seasons it has also been home to a cropping experiment.\n\nGrowing grain without irrigation, he plans to bury the sorghum being cut as insurance for the next time the rain stops and his pasture dies.\n\nBut far from an outlier, he is part of a growing push to grow crops in the bush.\n\nCrops bring stability\n\nMr Webb has sown more than 280 hectares of dry land sorghum between his cattle and sheep paddocks that he will use to feed his animals in the next dry.\n\n\"As sure as night follows day, it will get dry in this country again,\" Mr Webb said.\n\nA harvester cuts the sorghum crop before it is stored in a silage pit. (ABC Rural: Maddelin McCosker)\n\nSpat into the back of a truck, the cut sorghum is moved to a deep pit that can store up to 3,000 tonnes of feed for years.\n\nStored this way, the green plant material ferments and becomes silage, a kind of \"pickled pasture\" that preserves the nutrients.\n\nThe silage will allow Mr Webb to keep feeding stock long after the grass stops growing.\n\n\"We're not [going to be] pushed into a corner and have to sell [stock] because we've run out of feed or it hasn't rained,\" he said.\n\n\" If we hit four or five dry years in a row, we'd have enough feed up our sleeves to get us through it. \"\n\nHe plans to expand his crop to more than 600 hectares next year, increasing the amount of feed he can store on the property.\n\nThe sorghum is cut, compressed and stored in pits in the ground. (ABC Rural: Maddelin McCosker)\n\nEventually, he wants to have 20,000 tonnes of silage sorghum in storage.\n\n\"There'll be droughts here every few years, so the fact that we can grow in a good season and put it away for a dry season is going to be worth a lot,\" he said.\n\n\" Building up to that over a period of time would allow us to basically feed every animal on the place for a year. \"\n\nWhile recent years have been a much-needed reprieve from the decade-long millennium drought, Mr Webb said those dry times still weighed heavily on the minds of producers.\n\nGrowing the sorghum allowed him to diversify and offered stability to his business in a part of the country where turbulent weather was common.\n\nBoyd Webb says growing sorghum has been a steep learning curve. (ABC Rural: Maddelin McCosker)\n\nGrowing dry land crops that rely on rain for moisture might seem risky in country known for its dry times, but Mr Webb said the rain in good seasons was enough to store moisture in the soil and plants.\n\n\"If you've got enough moisture to grow Mitchell grass, you've got enough moisture to grow sorghum,\" he said.\n\nA tractor is used to push and compress cut sorghum in a pit. (ABC Rural: Maddelin McCosker)\n\n\"It may be that you don't plant a crop every year, maybe [you do it] every second year.\n\n\"Basically, you keep letting it rain, store the moisture, and then once you've got enough moisture there to grow your crop, you can grow it.\"\n\nA steep learning curve\n\nMr Webb is not alone in experimenting with growing his own feed.\n\nIn the Northern Territory some of the biggest names in cattle have applied for permits to clear country for cropping, including Gina Rinehart's Helen Springs Station and Consolidated Pastoral Company (CPC).\n\nAt a recent Farm to Feed forum in Katherine, Andrew Cochrane, who previously managed CPC's Isis Downs station in western Queensland but now runs Newcastle Waters, shared their approach.\n\nLoading...\n\nHe said while some feed and supplements were still brought in, having access to their own feed had benefits, especially for younger cattle.\n\n\"That weaning process … it's a very integral time and a big stress period on those animals,\" Mr Cochrane said.\n\n\"You can smooth that out and keep them on a rising growth plane, we're turning those cattle off much sooner than in previous years.\n\n\"It's a two-fold benefit — it's not just those weaners doing well and gaining weight, it's the cow's body condition [as well].\"\n\n'A whole new world'\n\nTony Hayne is a vet, cattle producer and cotton grower at Douglas Station.\n\nHe planted silage hay this year and used cottonseed to supplement during the dry season, when protein was hard to source in the Top End.\n\n\"It takes a lot of pressure off through the dry and it's a by-product of the cotton,\" he said.\n\n\" For us, it's probably almost as important as the white, fluffy stuff that comes off. \"\n\nThe cropping experiment is unusual in Muttaburra, which is in the heart of grazing country. (ABC Rural: Maddelin McCosker)\n\nIn the four years since Mr Webb started experimenting, he has grown oats for hay and two sorghum crops before this latest crop.\n\nHe said \"farmer error\" had forced a steep learning curve with every new crop he planted.\n\n\"It's a whole new world,\" he said.\n\n\"Probably the biggest limiting factor is how quickly we can absorb it, understand it and implement it … to an outsider there's a lot to learn.\n\nBoyd Webb hopes the sorghum crop will feed his stock through the next drought. (ABC Rural: Maddelin McCosker)\n\n\" I knew nothing about ploughs and planters, and I still don't know anything, but I'm having an accelerated learning curve. \"\n\nTo get started, Mr Webb purchased second-hand machinery and equipment, and while that initial outlay could be expensive, he said older equipment did the job.\n\n\"When I started, all our farming equipment was basically less than what you'd buy a buggy for,\" he said.\n\n\"It doesn't have to be expensive because we're not trying to grow a cereal crop.\n\n\"I think that's where farming is going to end up out here. It won't be for growing cereals, it'll be for supporting the livestock industry.\"\n\nBoyd Webb runs cattle and sheep alongside his sorghum crop at Weewondilla. (ABC Rural: Maddelin McCosker)",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/gallen-all-praise-for-great-papalii-20250708-p5mddk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gallen all praise for 'great' Papali'i",
        "publish_date": "Tue, 08 Jul 2025 12:07:26 +1000",
        "category": "finance",
        "authors": [],
        "text": "Gallen all praise for 'great' Papali'i\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-declared-an-auction-but-no-bidders-turned-up-20250708-p5mdaf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump declared an auction but no bidders turned up",
        "publish_date": "Tue, 08 Jul 2025 12:03:52 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "In other words, Trump, having failed so far to bully countries into offering him the one-sided concessions he has been demanding, is effectively extending his deadline and the period for negotiations yet again, indefinitely. So much for “90 deals in 90 days” and the “Art of the Deal.” Loading In turns out that trade negotiations are more complicated, and his tariffs less intimidating, that he thought. Most trade deals take years, not months, to negotiate. What’s particularly significant about the first round of letters, apart from official communications between heads of state being posted on a privately-owned social media site, is that they target two of America’s major trading partners and closest allies. Japan and South Korea between them generate nearly 10 per cent of US goods imports and are major investors within the US.\n\nJapan is the largest foreign investor in US Treasury bonds, with holdings of more than $US1 trillion, and its auto companies alone have invested about $US62 billion ($A95 billion) in the US auto industry. South Korean companies have invested close to $US115 billion in the US over the past three years and its Hyundai auto group, by itself, has said it will invest $US21 billion in its US business over the next three years. South Korea has, or thought it had, a free trade agreement with the US. Hyundai Motor vehicles bound for shipment parked at the company’s plant in Ulsan, South Korea. Credit: Bloomberg Both countries are critical to America’s ambitions of containing China’s ambitions in the Asia Pacific region and both have co-operated – at some cost to their companies and economies – with US attempts to curtail China’s access to the most advanced semiconductors, the building blocks for most advanced industrial and military technologies. It’s insulting to those countries for Trump to say, as he did, that it was “a great honour” for him to send their leaders letters threatening them with punitive tariffs unless they bend to his will or to say that the letters demonstrate “the strength and commitment of our Trading Relationships.”\n\nHe’s invited those countries, among America’s closest trade and security partners, to “participate in the extraordinary Economy of the United States, the Number One Market in the World, by far.” They could be forgiven for thinking that they already do. Loading Yes, they, like the other countries being targeted with the so-called reciprocal tariffs – Thailand (36 per cent rate), Indonesia (32 per cent), Malaysia (25 per ent) and South Africa (30 per cent) were among the others – have trade surpluses with the US, which in Trump’s mind means they are ripping the US off via unfair trade practices. The view of most non-MAGA trade economists, however, is that the $US1.2 trillion US trade deficit in goods has more to do with Americans spending more than they produce – living beyond their means – than it does with unfair trade practices. In the letters, Trump described the deficits as “unsustainable” and a major threat to the US economy and national security.\n\nThe reality is that America’s last trade surplus was in 1975, so for half a century America has sustained, and generally prospered despite those trade deficits without them threatening its national security. Trump’s tariffs will raise the prices for imported goods for consumers, input costs for its manufacturers and disrupt its companies supply chains. Those effects will occur in the near term. Trump keeps asserting that the countries subjected to the tariffs will pay them but it is America and Americans that will have to absorb the cost of raising the duties paid by its importers from less than the 2.5 per cent effective average rate before Trump embarked on his trade war to something, once the reciprocal and sectoral tariffs are factored in, that could be well above 20 per cent. While the objective of the tariff policy is ostensibly to coerce foreign companies into investing in domestic manufacturing within the US, even if that were successful (and any success is likely to be relatively modest) it would take years for new plants to be constructed and skilled workforces to be assembled and, almost by definition, the costs of the end products would be higher than those of the imports they displace. The more likely “success” the policy might have in reducing the US trade deficit is if it ignites stagflation – reduced economic growth but increased inflation – and a recession that pulls US living standards and consumption and the demand for imported goods down.\n\nTrade wars are mutually destructive, with everyone losing. In America’s case, the damage will be self-inflicted. Trump’s obsession with Tariffs also betrays a misunderstanding of the nature of today’s US economy. He’s fixated on the trade deficit in goods, but the US economy is services-based. More than 75 per cent of US GDP is generated by the services sector; less than 25 per cent by goods-producing sectors. America has a trade surplus in services. In the letters, Trump warns that goods that are transhipped – goods that originate in a third country, which means China – will face an even higher tariff. That was a feature of last week’s deal, or at least the framework of a deal, the US announced it has reached with Vietnam, where the “reciprocal” rate of 20 per cent would be doubled for transhipped goods. He also threatened that, should the countries raise their own tariffs in response to US tariffs, that rate would be added to the rate the US charges.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/mcdonald-says-it-s-too-early-to-judge-whether-konstas-will-make-it-at-test-level-20250708-p5mda5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "McDonald says it’s too early to judge whether Konstas will make it at Test level",
        "publish_date": "Tue, 08 Jul 2025 12:00:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "St George’s: Australian coach Andrew McDonald says selectors remain committed to Sam Konstas, despite the young batter’s modest returns in the early stages of his Test career.\n\nAfter scores of 3, 5, 25 and 0 in Australia’s two Test victories over the West Indies in the Caribbean, things will get even more challenging for the 19-year-old in a pink ball day-night fixture in Jamaica starting Saturday (Sunday morning AEST).\n\nFrom four Tests, Konstas has made 146 runs at an average of 18.25. His first-class average is 31.66.\n\nMcDonald said the sample size was too small to form definitive judgments on the teenager’s long-term prospects and praised his efforts to be more proactive at the crease during the second Test in Grenada.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/missed-chances-and-baseline-warfare-the-key-moments-from-captivating-demon-djoker-clash-20250707-p5md8q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Missed chances and baseline warfare: The key moments from captivating Demon-Djoker clash",
        "publish_date": "Tue, 08 Jul 2025 11:56:21 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "It was just the second time this tournament that the former world No.1 had dropped serve. But arguably the key moment in deciding where this set was headed came in the second game, when Djokovic had the chance to immediately break back on de Minaur’s serve. Djokovic made a decent-enough return, which de Minaur countered with a backhand slice, but the Serbian superstar lost balance and awkwardly flayed a forehand well long. De Minaur held two points later for 2-0, then benefited from another erratic Djokovic serving performance in the fifth game. Djokovic dumped a mid-court backhand into the net, then double-faulted on the second point and again at break point to fall 4-1 behind. One last unforced error off Djokovic’s racquet – his 16th for the set – handed de Minaur a 6-1 lead. Demon misses his chance\n\nSecond set, Djokovic wins 6-4\n\nAny number of points seemed like crucial ones throughout this set as Djokovic began to assert his authority on the contest, only for de Minaur to repeatedly hit back. After they traded breaks to begin the second set, Djokovic poured the pressure on again to restrict de Minaur to 30-40. An incredible 35-shot rally followed, ending with de Minaur missing a backhand slice down the line. Djokovic sensed the moment, putting his finger behind his right ear and urging the crowd to make some noise. But de Minaur reeled in his 3-1 deficit to again level the set through six games. Djokovic came out on top in another titanic rally in the seventh game – this time 31 shots – to leave de Minaur 0-30, and the Australian eventually relented on serve. However, the critical moment for the set was still to come as Djokovic served to level the match at a set-all.\n\nDe Minaur had already had a break point, but the second one was where his big chance came, on a Djokovic second serve. The Aussie pounced on it, pounded a forehand at Djokovic’s feet, then, on a mid-court ball, ballooned a forehand long. Djokovic clinched the set two points later. Impatience costs de Minaur Third set, Djokovic wins 6-4\n\nBoth players fended off a break point each to start the set, and they held until four-all, when Djokovic made his move.\n\nDe Minaur found himself in a 15-40 hole, but a superb inside-out forehand set up the easiest of put-away volleys. On the second break point, he nailed a 206km/h first serve out wide – exactly what he was after – that enabled him to step into the court, but he sprayed a forehand wide going for a winner. De Minaur’s aggressive mindset helped him throughout the match, but, just like the previous set, his impatience and lack of execution at a key time cost him dearly. Djokovic leaked a forehand error in the next game to fall to 30-all, but was celebrating a two-sets-to-one lead soon after when he won a 27-shot rally with the simplest of dinks into the opposite service box. The damage was done two shots earlier when he ripped a cross-court forehand that sent de Minaur scurrying off court before forcing him to sprint across the other side with an off forehand near the opposite sideline. Brutal baseline warfare\n\nFourth set, Djokovic wins 6-4\n\nAfter saving a break point in the opening game, de Minaur stormed to a 4-1 lead as he threatened to send the match to a deciding fifth set. Djokovic even faced a break point to go 5-1 down, where de Minaur could not quite chase down an angled drop volley that ended up being his only opportunity for the game. The 24-time major champion made it out of the game without further damage, then tightened the screws. De Minaur defended back-to-back break points on excellent second serves and baseline play that drew Djokovic errors and got him back to deuce. But the Australian went break point down again trying to force the issue on his forehand. This is where Djokovic showed his mettle.\n\nA 32-shot rally followed of side-to-side brutal baseline warfare, but Djokovic took the initiative on a de Minaur backhand slice to rip a cross-court forehand on an extreme angle before crushing an inside-out forehand winner. Loading Starting with the final two points of that game, Djokovic captured 14 of the last 15 to complete his four-set defeat of a gallant de Minaur, who was left ruing his performance on the biggest of points. De Minaur won 36 of 52 points on rallies lasting nine shots or longer – an extraordinary feat – but Djokovic claimed four such exchanges mentioned above of 27 shots-plus at clutch moments that helped decide the match. Marc McGowan travelled to Wimbledon with the support of Tennis Australia.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/adam-liaw-s-berry-matcha-trifle-20250708-p5mdcy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s berry matcha trifle",
        "publish_date": "Tue, 08 Jul 2025 11:54:12 +1000",
        "category": "finance",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Step 1\n\nCombine the matcha with 20g of caster sugar in a bowl and pour in 150ml of boiling water. Whisk to dissolve the matcha and sugar, then add the cubes of cake, gently stirring to absorb the liquid without breaking up the cubes.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-e-biker-charged-with-riding-dangerously-assaulting-cop-20250707-p5md7t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Doors to Queensland zoo reopen after lion attack | Push for dogs to be allowed in pubs and cafes | E-biker charged with riding dangerously, assaulting cop",
        "publish_date": "Tue, 08 Jul 2025 11:45:29 +1000",
        "category": "finance",
        "authors": [],
        "text": "Mike Kaiser, who served as director-general of the Department of Premier and Cabinet under former Labor premier Steven Miles, has been given a job in the federal Labor government.\n\nPrime Minister Anthony Albanese announced Kaiser would become secretary of the Department of Climate Change, Energy, the Environment and Water, starting next Monday, with a five-year appointment, subject to Governor-General approval.\n\nLoading\n\n“Mr Kaiser’s experience includes delivering on large-scale projects, administering complex regulatory regimes and leading the Queensland government’s policies on planning and infrastructure,” Albanese said.\n\nOn LinkedIn, Kaiser described the new posting as a “consequential agenda” with passionate stakeholders.\n\n“High expectations. A lot to deliver,” he said, including the hashtag #publicserviceisaverb.\n\nKaiser was stood down by LNP Premier David Crisafulli after the October election.\n\nHe is also a former Queensland politician, but resigned after a branch stacking scandal in 2001.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/don-t-be-fooled-by-our-positive-sound-why-mental-as-anything-are-afraid-of-everything-20250706-p5mcu1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Don’t be fooled by our positive sound’: Why Mental as Anything are afraid of everything",
        "publish_date": "Tue, 08 Jul 2025 11:44:00 +1000",
        "category": "finance",
        "authors": [
            "Thomas Mitchell"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Reg Mombassa looks out of place in the middle of Sydney’s CBD. As the longtime creative force behind the clothing brand Mambo and frontman of the band Mental As Anything, the musician and artist is synonymous with suburbia: fibro houses, beach shacks, and backyard barbecues, that kind of thing. “I don’t like the city that much,” he admits, glancing up at the looming skyscrapers behind him. “But I love this restaurant.” Sitting next to Reg is his younger brother, Peter O’Doherty, also a former member of Mental As Anything, and a successful artist in his own right. Whether out of sibling obligation or genuine agreement, he echoes his brother’s sentiments. “I try to avoid coming into the city if I can, but this place is special.” The place in question is The Malaya, a one-time Sydney institution, founded in 1963 by Wong Tai See, a merchant seaman who migrated to Australia from Hong Kong in the 1940s. Formed on a whim by a group of bored art students in search of free drinks, Australia’s prankish Mental as Anything went on to forge a career spanning several decades. Credit: The original Malaya was located at 787 George Street, close to Central Station and Chinatown (the new version opened in April, just down the road at 225 George Street), before relocating to King Street Wharf in 2001, where it became a staple for long-lunching businessmen looking to make a dent with the corporate credit card. However, in the 1970s, The Malaya was overrun by a different crowd: students, artists, and musicians, curious folk who had heard whispers of the signature Sichuan eggplant that would sober you up in a mouthful. Among the devotees? A group of kids soon to be known as Mental As Anything. “We would come here all the time because it was open late and always reliable,” says Mombassa. “And the best thing is, it all feels the same, the menu, the food, the atmosphere.”\n\nAdvertisement\n\nTo prove his point, Mombassa reels off his favourites for the three of us to share – salt and pepper prawns, the coconut beef rendang and a Singapore curry fish. O’Doherty nods in agreement, before catching himself. “Well, actually, it looks a bit different to how it did in the 1970s, but then again, so do we.” Alongside bands like INXS, Cold Chisel and ACDC, the Mentals, as they’re affectionately known, helped provide the soundtrack to Australia in the 1970s and 1980s. The group formed in Sydney in 1976 when Martin Murphy (also known as Martin Plaza) met fellow student Chris O’Doherty (Reg Mombassa) at the National Art School. Coconut beef rendang: aromatic coconut, lemongrass, galangal and kaffir lime base. Credit: Janie Barrett The duo was soon jamming in guitarist and vocalist Mombassa’s Darlinghurst flat. Murphy, on guitar and vocals, brought in his college friend Steve Coburn on bass guitar, while another student, David Twohill (also known as Wayne de Lisle), was recruited on drums. According to Mombassa, their first gig was spectacularly unspectacular. “It was a party in Balmain at Martin’s girlfriend’s place,” he recalls. “We didn’t have a huge repertoire, so we played Can’t Be Satisfied by Muddy Waters three times.” In 1977, Peter O’Doherty replaced Coburn, and the group added Andrew Smith (known as Greedy Smith). With this, the classic Mental as Anything lineup was complete. The group would remain unchanged until 2000, when O’Doherty and Mombassa departed the band to focus on their two-piece act, Dog Trumpet. There was no controversial split; it was simply the closing of a chapter.\n\nAdvertisement\n\n“We certainly had a good run for people who didn’t plan on being in a popular band,” says O’Doherty, between mouthfuls of prawn. “We travelled the world and wrote some great songs.” “Yes, I suppose so,” adds Mombassa. I worry Mombassa’s reflection on his musical legacy is as modest as his appetite (my plate is piled with rendang while his sits largely untouched). Following their debut single, The Nips Are Getting Bigger, the band had Australian top 10 hits in 1981 with If You Leave Me, Can I Come Too? and Too Many Times, and in 1985 with Live It Up, which also featured in the 1986 film Crocodile Dundee. At their peak, the Mentals sold millions of albums, toured the US and Europe, and topped the charts at home and abroad. Surely, that counts as a great run? “It’s just a strange thing always to look back, I’m not sure if it is helpful,” says Mombassa. As the Singapore curry arrives, a glorious coral trout, surrounded by tomato and eggplant, talk turns to an upcoming-but-untitled Mental As Anything documentary, directed by Matthew Walker (I’m Wanita), which charts the band’s unlikely rise. “We’ve spent a lot of time over the last 18 months sitting like this, side by side, sifting through the memories,” says O’Doherty. “Sometimes it’s good, and sometimes it’s bad, you’re reminded of the disappointing and frustrating moments, as well as the enjoyable parts.” The documentary features hours of archival footage, which means the pair have been poring over early vision of Smith, who passed away in December 2019, following a heart attack. Smith’s death at 63 came as a shock, though Mombassa reliably informs me that the average life span of a rock and roller is “about 60”. “A lot of our contemporaries and friends are getting sick or dying,” he says. “It can be dangerous to find fame when you’re young, and then it fades away, and you’re not sure what to do with yourself. Some of them just burn out.”\n\nAdvertisement\n\nAt 66 and 73, respectively, O’Doherty and Mombassa are doing quite well, but both admit mortality is never far from their minds. “I think as you get older, you become very aware of how much time is behind you and how little is in front of you,” says O’Doherty. “Which explains why there is a lot of existential angst in all the songs that we write these days.” He’s not wrong. The pair’s latest album, their ninth as the double act Dog Trumpet, has a deceptively optimistic title, Live Forever, which is also the name of the lead single. Upbeat as it may sound, the lyrics are quite the opposite. “Sometimes I am afraid of everything in the world,” sings Mombassa on the album opener. “And sometimes I am ashamed to be a human, it’s a shame.” Salt and pepper prawns: wok-tossed with cracked black pepper. Credit: Janie Barrett Midway through a parcel of san choy bow seems like an inopportune moment to ask Mombassa if he’s really, truly, afraid of everything, but he’s more than happy to answer. “Well, I think if we can’t transform our consciousness, we’re headed for extinction,” he says matter-of-factly, returning his food to the table. “We need to get away from this obsession with alpha males and aggression, fuelled by guys like Trump and Putin, fascists masquerading as politicians.” O’Doherty feels much the same way, admitting that while the world has always been “cruel and unjust”, a uniquely modern issue has supercharged the collective anxiety: “The big problem is that we don’t seem to be able to agree on facts.”\n\nAdvertisement\n\nOne thing we can actually agree on is that no one needs dessert. Mombassa nurses sparkling mineral water, while O’Doherty and I opt for a glass of 2019 Morningside Pinot Noir. It’s hard to solve the world’s issues when you’re stone-cold sober. “Twenty-odd years ago, we demonstrated the US invasion of Iraq with 100,000 other people in Sydney,” says O’Doherty. “Before that, in the 1970s, we protested Vietnam too,” adds Mombassa. “Exactly,” O’Doherty continues. “And that’s my point. In my opinion, the right wing has always been dangerous, but considering where we find ourselves [now], people like Bush and Reagan seem almost reasonable in retrospect.” Talking politics over a nice meal might be frowned upon, but with Mombassa on hand to rib his brother – “You pining for the Bush administration?” – the mood remains upbeat. Chris O’Doherty aka Reg Mombassa’s artworks came to the attention of Mambo’s founder Dare Jennings in the mid-1980s. They went on to become synonymous with the renowned Australian surf and leisurewear label. Credit: Mambo Australia This ability to mix light and shade has long been a hallmark of Mombassa’s creative output, whether writing songs or creating T-shirts for Mambo. “The designs were political but ambiguous, so I often see people wearing my shirts and wonder if they know,” laughs Mombassa. “People have made similar comments about our songs, both with Mentals and Dog Trumpet; there is a cheerful melody hiding something deeper,” he says. “But don’t be fooled by the positive sound, I still want you to think, ‘what the f--k are we all doing?’”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/sister-in-law-visited-lions-about-80-times-before-losing-her-arm-20250708-p5mdc1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sister-in-law visited lions ‘about 80 times’ before losing her arm",
        "publish_date": "Tue, 08 Jul 2025 11:43:38 +1000",
        "category": "finance",
        "authors": [
            "Cameron Atfield",
            "Brittney Deguara"
        ],
        "text": "Darling Downs Zoo co-owner Steve Robinson has confirmed the victim of the lioness attack on Sunday morning was his sister-in-law, who had 20 years’ experience with the lions, with the ordeal “still very, very raw” for the zoo community.\n\nSpeaking to media outside the reopened zoo on Tuesday morning, Robinson said the woman – a teacher visiting from NSW – was “not terribly lucid” so it was not yet clear how the accident occurred.\n\n“We haven’t really pressed for answers as to what she was doing and how this happened,” he said.\n\n“We’ve got theories but until we get fact, I’m not going to be speculating or running with any what ifs or maybes or anything like that.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/money/investing/plain-gold-is-soulless-why-collectors-love-contemporary-jewellery-20250708-p5mdba.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Plain gold is soulless’: Why collectors love contemporary jewellery",
        "publish_date": "Tue, 08 Jul 2025 11:34:28 +1000",
        "category": "finance",
        "authors": [
            "Stephen Crafti"
        ],
        "text": "Contemporary jewellery or “art jewellery” as it’s sometimes referred to, has been ubiquitous since the 1950s. And despite shunning traditional materials such as diamonds and gold for resin or steel, these unique pieces can still command considerable sums.\n\nIf you ask Anne Rutland, a collector of contemporary jewellery, to choose between a chunk of gold or a well-designed piece of contemporary jewellery, it’s a clear decision. “Gold in its raw form is just soulless, dead,” says Rutland, who has spent the last 25 years collecting contemporary jewellery.\n\nContemporary jewellery may not involve massive diamonds and 24-carat gold, but the unique pieces – such as this collection by Lisa Roet – can still demand considerable sums.\n\nOne of her first acquisitions was a simple brooch, priced at $20 by Melbourne based artist/jeweller Roseanne Bartley. When her momentum for collecting built, Rutland purchased a couple of neck pieces by Carlier Makigawa from Gallery Funaki in Melbourne. Priced at well over $2000 for each, the value has since increased significantly.\n\n“A similar neck piece was purchased by the Decorative Arts Museum in Paris,” says Rutland. “Contemporary jewellery is still fairly niche and many still don’t get the idea of wearing something that’s more about the story it tells, than the value of materials,” she adds.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/japanese-style-chicken-schnitzel-curry-20250708-p5mdcw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s Japanese-style chicken schnitzel curry",
        "publish_date": "Tue, 08 Jul 2025 11:25:04 +1000",
        "category": "lifestyle",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Step 1\n\nHeat a medium saucepan over medium heat and add about 2 teaspoons of oil. Add the onion, carrot and potato and fry for about 3 minutes until just starting to soften. Add 600ml of boiling water and bring to a simmer. Simmer covered for about 15 minutes, until the carrot and potato have softened, then break in the curry mix block and stir until the mixture thickens. Keep warm while you cook the schnitzels.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/penguins-on-standby-as-trump-ruffles-global-trade-feathers-20250708-p5mdah.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Penguins on standby as Trump ruffles global trade feathers",
        "publish_date": "Tue, 08 Jul 2025 11:15:02 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "The penguins of Heard and McDonald Islands are back quaking in their flippers as they await a tariff letter from Donald Trump.\n\nAfter seeing what an eclectic group of nations is going to face if they sell goods to American consumers, the penguins (and seals) of the frigid outpost closer to Antarctica than Australia can be rightfully more than a little concerned about what the US president has in store for them – having been on the first list of “liberation day” tariffs in April.\n\nDonald Trump has identified the first 14 nations to face reciprocal tariffs. The penguins of Heard and McDonald Islands have escaped his plan, for now. Credit: Bloomberg\n\nThe only common element to Trump’s initial list of 14 countries to be hit with extra tariffs of between 25 per cent and 40 per cent is each runs a trade deficit with the United States. That stretches between $US69.4 billion with Japan and $US126 million with Bosnia and Herzegovina.\n\nThe common thread – deficits – is a positive sign (among the bleakness of the economic ramifications of Trump’s actions for American consumers) for Prime Minister Anthony Albanese.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/cardi-b-a-crow-and-the-americans-taking-over-paris-fashion-week-20250707-p5md6v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cardi B, a crow and the Americans taking over Paris Fashion Week",
        "publish_date": "Tue, 08 Jul 2025 11:09:35 +1000",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "A warm “howdy” is becoming more appropriate than a breathy “bonjour” backstage at Paris Fashion Week. On day one, Americans are already the flavour of the autumn/winter 2026 haute couture season at two leading fashion houses, leaving the acquired taste of French designers in short supply.\n\nThe week dedicated to clothes for the rich, where gowns can cost anywhere between $77,000 and $1,230,000, began with a collection brimming with historical references from US designer Daniel Roseberry at Schiaparelli.\n\nWho is buying the matador suits and gowns with jutting hips and shoulders? Lauren Sanchez wore a gold corset dress from Schiaparelli as part of her pre-wedding festivities with Amazon billionaire Jeff Bezos. The dress, with floral hand embroidery, was estimated to have cost $US100,000 ($154,000).\n\nCardi B accessorising with a crow at the Schiaparelli autumn/winter, 2025/2026 haute couture show in Paris. Credit: Getty Images\n\nRoseberry has risen to the top of the Parisienne ranks by embracing the drama of the label, founded by Italian designer Elsa Schiaparelli in 1927, which gained fame for its surrealist touches. In 2023, Roseberry gave us Kylie Jenner wearing a realistic lion’s head in the front row, yesterday it was Cardi B arriving cocooned in a black velvet gown with pearl fringing, an exaggerated U-neckline and a crow on a leash.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/no-antisemitism-taskforce-planned-says-albanese-midday-news-bulletin-8-july-2025/mg5xqty8x",
        "title": "No antisemitism taskforce planned says Albanese | Midday News Bulletin 8 July 2025",
        "publish_date": "Tue, 8 Jul 2025 02:05:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nIn this bulletin;\n\n\n\nJewish leaders call for a national taskforce to tackle antisemitism;\n\nDonald Trump and Benjamin Netanyahu hold ceasefire talks at the White House;\n\nAnd in sport, Alex de Minaur goes down to Novak Djokovic in the Wimbledon quarter final.\n\nAustralia's Jewish community is calling for more action from the federal government to combat antisemitism, following a string of attacks targeting the community over the weekend.\n\n\n\n\n\nThe Executive Council of Australian Jewry is urging the government to adopt a 15-point action plan including the establishment of a national task force focused on antisemitism.\n\n\n\n\n\nThe council's president Daniel Aghion also asked Victorian authorities to ban weekly pro-Palestine protests in their current form, and bring in protest zones instead.\n\n\n\n\n\nPolice have arrested 34-year-old man Angelo Loras for arson over the alleged firebombing of the East Melbourne synagogue on Saturday night.\n\n\n\n\n\nThe same evening, a group of protesters disrupted diners and damaged property at Israeli restaurant Miznon.\n\n\n\n\n\nThe protest group says they had nothing to with the attack on the synagogue.\n\n\n\n\n\n—\n\n\n\n\n\nEconomists are tipping the Reserve Bank will deliver its third interest rate cut of the year when it meets this afternoon.\n\n\n\n\n\nMoney markets have priced in a 75 per cent chance official interest rates will fall to 3.6 per cent.\n\n\n\n\n\nAnalysts say this is because both headline and underlying inflation are firmly within the Reserve Bank's 2 to 3 per cent target band.\n\n\n\n\n\nRabobank Senior Strategist Benjamin Picton says that is a result of lower demand.\n\n\n\n\n\n\"Business are telling us there is not enough demand out there to soak up higher prices, so they no longer have pricing power, they no longer have the ability to pass on cost increases, so as a result we are starting to see discounting popping up in certain sectors of the economy, most notably home construction costs, we're starting to see discounting there.\"\n\n\n\n\n\n—\n\n\n\n\n\nUnited States President Donald Trump has held a dinner for Israeli Prime Minister Benjamin Netanyahu at the White House.\n\n\n\n\n\nThe pair are meeting with top security aides to discuss the latest U-S backed Gaza ceasefire proposal.\n\n\n\n\n\nThe US-backed plan includes a 60-day ceasefire during which Hamas would hand over more hostages, Israeli forces would withdraw to a buffer zone, and more aid would be allowed into Gaza.\n\n\n\n\n\nIn answer to questions about the possibility of a two-state solution, Mr Netanyahu said, he believed peace could be achieved in the region.\n\n\n\n\n\n\"I think that Palestinians should have power to govern, but not the power to threaten us. And that means that certain powers like our security will always remain in our hands. Now, that is a fact. And no-one in Israel will allow or agree to anything else, because we don't commit suicide. We want life. We cherish life. For ourselves, for our neighbours and I think that we can work out a peace between us and the entire Middle East with President Trump's leadership.\"\n\n\n\n\n\nMr Netanyahu also announced he has nominated Mr Trump for a Nobel Peace Price, saying the President has forged peace in one country after another.\n\n\n\n\n\n—\n\n\n\n\n\nThe United Nations General Assembly has voted to adopt a resolution highlighting the plight of women and girls and decline of human rights under the Taliban in Afghanistan.\n\n\n\n\n\n116 countries voted for the resolution, introduced by Germany, and 12 abstained. The United States and Israel voted against it.\n\n\n\n\n\nNaseer Ahmad Faiq is the Chargé d'Affaires of the Islamic Republic of Afghanistan to the United Nations.\n\n\n\n\n\nHis government was in power from 2004 before it was toppled by the Taliban in 2021.\n\n\n\n\n\n“Mr. President, Afghanistan is at a crossroads. Since August 2021, the country has experienced alarming regression across all sectors—social, political, economic, and human rights. Nearly four years under Taliban rule have driven Afghanistan into one of the world’s gravest humanitarian and human rights crises, as extensively documented by the Secretary-General and the Special Rapporteur on the situation of human rights in Afghanistan.”\n\n\n\n\n\nLast week, Russia became the first country to formally recognise the Taliban’s government in Afghanistan.\n\n\n\n\n\n—\n\n\n\n\n\nAnd in sport,\n\n\n\n\n\nNovak Djokovic reached the Wimbledon quarter-finals, defeating Australian Alex de Minaur.\n\n\n\n\n\nAfter losing the first set in just 31 minutes, the Serb won the next three sets 6-4 each.\n\n\n\n\n\nAfter the match, de Minaur admitted he needed to lift his game, in order to match the top-ranked players.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-merlier-wins-crash-marred-third-stage-as-injuries-force-philipsen-out/dg3sy54pn",
        "title": "Tour de France: Merlier wins crash-marred third stage as injuries force Philipsen out",
        "publish_date": "Mon, 7 Jul 2025 21:09:36 +0000",
        "category": "sports",
        "authors": [],
        "text": "Belgian cyclist Tim Merlier pipped Italian Jonathan Milan right at the line to win stage three of the Tour de France at Dunkirk on Tuesday AEST, as Dutch competitor Mathieu van der Poel retained the race lead.\n\n\n\n\n\nThe stage was marred by a series of falls, but the two favourites for the title Tadej Pogacar and Jonas Vingegaard finished safely in the main pack and remain in second and third place overall behind Van der Poel .\n\n\n\n\n\nThe flat 179km run from Valenciennes along the Belgian border was marked above all by a high-speed fall that caused Dutch cyclist Jasper Philipsen to quit the race, after suffering a fractured collarbone and at least one broken rib.\n\n\n\n\n\nThe fall happened during an intermediate sprint 60km away from Dunkirk and ripped the green best sprinter's jersey from Philipsen's back as he slid along the road in the 70kph crash.\n\n\n\n\n\nPhilipsen's team Alpecin said in a statement surgery would be required.\n\n\n\nMuch of what the team had planned for the Tour revolved around the sprinter — who won the opening stage — teammate Van der Poel revealed.\n\n\n\n\n\n\"It's always one of our goals to win stages, so this is a bad day,\" the 30-year-old said. Van der Poel suggested the wind had emboldened the sprinters.\n\n\n\n\n\n\"In a headwind, it's easier to come from behind in the sprints, it made things more chaotic,\" he said.\n\n\n\nREAD MORE Think you could race the Tour de France? Explore the 2025 map and key stats\n\nThere were three more falls, including two nasty-looking ones in the finale with Olympic champion Remco Evenepoel, Merlier's teammate, involved.\n\n\n\n\n\nMerlier, 32, grew up just over the border from Dunkirk and had been hoping to win the opening stage.\n\n\n\n\n\n\"That was a mess,\" Merlier said of the falls. \"I lost a great deal of energy getting in position but it was a good bike throw. I knew I'd beat Milan.\"\n\n\n\n\n\nMilan led over most of the final 150m, but even without sealing the stage win, his efforts were still rewarded as he inherited the green sprint points jersey from the injured Philipsen.\n\n\n\nVan der Poel, in the leader's yellow jersey, is the grandson of French cycling legend Raymond Poulidor, who came second in the Tour de France seven times but never won and never got to wear the yellow tunic.\n\n\n\n\n\nAnother Belgian, the national champion Tim Wellens, gave cross-border fans even more to celebrate as he won the day's only climb, the 2.3km ascent of Mont Cassel at 31km from the finish line.\n\n\n\n\n\nThe 34-year-old will now hold the King of the Mountains polka dot jersey overnight.\n\n\n\nTim Merlier from Belgium wins the sprint on stage 3 in Dunkirk. Source: Getty / Tim de Waele Frenchman Kevin Vauquelin is in the best under-25 rider's white jersey after staying in the finishing mix in all three stages.\n\n\n\n\n\nRegional police said one million spectators had lined the roadsides on the opening day, and while rain dissuaded that kind of turnout for stage two, huge crowds turned out again for the run to Dunkirk.\n\n\n\n\n\nAfter 11 bikes were stolen from outside the Cofidis team's hotel on the weekend, all were all found before the stage's end — five of them were recovered abandoned in a forest next day, with the others being tracked down by the police later in the day.\n\n\n\nThe Tour de France's third stage was a 179km flat run from Valenciennes along the Belgian border. Source: Getty / Dario Belingheri Tuesday's fourth stage is a 174km run from Amiens, as the Tour leaves the North region, to Rouen in Normandy, with five hills in the final 25km designed to spark a series of race-splitting attacks.\n\n\n\n\n\nThe first section of the Tour is raced through the north and west of France.\n\n\n\n\n\nThe volcanic landscape of the Puy de Dome presents the first mountains as late as stage 10, with two more colossal climb days in the Pyrenees before the blockbuster final week in the Alps.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-could-happen-with-interest-rates-in-the-new-financial-year/1cug2bd55",
        "title": "RBA rate cut on the horizon: What it could mean for Australian homeowners",
        "publish_date": "Mon, 7 Jul 2025 19:38:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Reserve Bank of Australia (RBA) will meet today, and most economists expect the central bank to cut interest rates by a quarter of a percentage point to 3.6 per cent, its third reduction this year.\n\n\n\n\n\nEconomists say lower inflation and softer GDP growth are supporting the case for another rate cut, leaving the RBA with little choice.\n\n\n\n\n\nHeadline inflation dropped to 2.1 per cent in May, down from 2.4 per cent in April, according to the Australian Bureau of Statistics.\n\n\n\n\n\nTrimmed mean inflation, RBA's preferred measure, also fell to a three-and-a-half-year low of 2.4 per cent in May from 2.8 per cent in April.\n\n\n\n\n\nDevika Shivadekar, an economist at financial services firm RSM Australia, said last month's inflation figures were the decisive factor behind a likely rate cut in July.\n\n\n\n\"Softer GDP growth, subdued business conditions, weak consumer sentiment and tame inflation readings all point to price pressures fading faster than the Bank first thought, so waiting until August to make a cut makes little sense,\" Shivadekar said.\n\n\n\n\n\nShe said projected interest rate cuts are unlikely to have a follow-on effect on increased household spending.\n\n\n\n\n\n\"Even with earlier cuts, households are still cautious. Retail sales have been muted, and people seem to be saving for a rainy day rather than splashing out. A lower cash rate will help, but other worries, such as global uncertainty and possible tariffs, are weighing on spending,\" she said.\n\n\n\n\n\nHowever, some economists remain unconvinced about a July rate cut and believe the RBA may wait until August instead.\n\n\n\nREAD MORE Australian home prices climb to record high amid lower interest rates and supply shortage\n\nWestpac chief economist Luci Ellis said a cut was no \"shoo-in\", but the board would have no clear rationale to hold until August as even a hotter-than-expected June inflation outcome would be unlikely to change the equation.\n\n\n\n\n\n\"A decision to cut in July is one of timing and tactics, not whether to cut at all,\" said the former Reserve Bank economist.\n\n\n\n\n\n\"If the question is now or in five weeks' time, the juice is not worth the squeeze. Just get on with it.\"\n\n\n\n\n\nBut independent economist Sherman Chan told the ABC: \"The Reserve Bank has made it pretty clear that the quarterly CPI [Consumer Price Index] series is their preferred measure [of inflation], so there is a chance they may wait until the June quarter CPI data before they decide,\" she said.\n\n\n\n\n\n\"That would be in August.\"\n\n\n\nWhat a lower cash rate means for mortgages\n\nIf banks pass the reduction on in full, financial comparison website Canstar estimates the average variable rate for owner-occupiers could fall to about 5.55 per cent.\n\n\n\n\n\nSally Tindall, Canstar's data insights director, said the expected cut is a sign Australia has started its descent down the \"rate hike mountain\".\n\n\n\n\n\n\"While the relief from an RBA cut is reasonably minuscule in comparison to the previous 13 hikes, four of which were doubles, every small release of pressure is welcome. A third cash rate cut in four meetings will also be further confirmation we're now coming down the other side of the rate hike mountain,\" she said.\n\n\n\nREAD MORE How Australia's slowing economy could affect your mortgage repayments\n\n\"Whenever rate relief comes, we expect the banks to step up and pass it on in full to their variable customers. This would see the average owner-occupier variable rate drop to around 5.55 per cent; however, borrowers can and should aim lower than this,\" Tindall said.\n\n\n\n\n\nBut Canstar said many borrowers are choosing not to pocket the savings.\n\n\n\n\n\n\"Just 10 per cent of eligible Commonwealth Bank customers asked to lower their direct debits after May's reduction, while the rest left repayments unchanged,\" it said in a statement.\n\n\n\nWill rates fall further this financial year?\n\nShivadekar expects the cash rate to end the financial year at 3.35 per cent, implying one more cut following the anticipated July move.\n\n\n\n\n\nShe said if household spending falters further, there could be room for an additional cut that would nudge the rate towards 3.1 per cent.\n\n\n\n\n\n\"If you look at our global peers, they are somewhat cautious and still responding to inflation control measures, but the RBA is responding to local conditions, including slowing private sector momentum, reduced public stimulus, and China's outlook. All three are very important for us domestically.\"\n\n\n\n\n\n— With additional reporting by the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/crackdown-on-influencers-promoting-online-gambling/oeo44qz76",
        "title": "Crackdown on influencers promoting online gambling",
        "publish_date": "Mon, 7 Jul 2025 09:35:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/liberal-party-appealing-to-chinese-australians-after-failed-election-campaign/wsle3g4yw",
        "title": "Liberal Party appealing to Chinese Australians after failed election campaign",
        "publish_date": "Mon, 7 Jul 2025 09:21:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/will-the-rba-cut-interest-rates-in-july/2ogaf0cqx",
        "title": "Will the RBA cut interest rates in July?",
        "publish_date": "Mon, 7 Jul 2025 08:18:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/jacynta-galabadaarachchis-world-game-journey-comes-full-circle-with-return-to-matildas-squad/2wkebw6g2",
        "title": "Jacynta Galabadaarachchi’s world game journey comes full circle with return to Matildas squad",
        "publish_date": "Mon, 7 Jul 2025 07:58:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jacynta Galabadaarachchi’s world game journey comes full circle with return to Matildas squad\n\nPublished 7 July 2025, 4:09 am\n\nFrom Dandenong to Portugal, 24-year-old Jacynta Galabadaarachchi’s multicultural football journey has taken her across four countries. Now, the Matildas forward is home and hoping to inspire more diversity in Australian women’s football.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/data-registry-funds-plea-in-fight-against-mnd/b75g8f8ft",
        "title": "We 'don't know a lot' about motor neurone disease. This is what advocates say needs to change",
        "publish_date": "Mon, 7 Jul 2025 03:27:41 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A rare debilitating disease that eats away at the nervous system to shut down the body claims the lives of two people in Australia each day and two more are diagnosed.\n\n\n\n\n\nMotor neurone disease (MND) robs individuals of the ability to walk, talk, swallow, and eventually breathe, as it impairs nerve cells responsible for transmitting signals from the brain and spinal cord to the muscles.\n\n\n\n\n\nWith no known cure and limited treatment options, health advocates are calling on the government to launch a data registry, with $12 million needed to know the extent of the illness nationwide and target specific support to affected patients.\n\n\n\n\n\nOne of them is 41-year-old Canberra mother Sharon, who is confined to a wheelchair.\n\n\n\nREAD MORE AFL great and disability advocate Neale Daniher named 2025 Australian of the Year\n\nShe started noticing a slight limp and other minor issues with her right leg and foot when she was playing netball.\n\n\n\n\n\nWithin six months of being diagnosed in 2018 she started using a walker for short distances and a scooter for longer distances.\n\n\n\n\n\nShe later had a feeding tube inserted and transitioned to using a wheelchair.\n\n\n\n\n\n\"MND impacts every part of my body and every aspect of my life, but I'm just as intelligent and switched on as I've ever been,\" she said.\n\n\n\n\n\nThe mother of two of boys communicates using an eye-gaze technology machine which converts pre-recorded sentences into words. She has documented her journey on social media.\n\n\n\n\n\n\"MND is not an incurable disease, we just haven't found the cure yet.\"\n\n\n\nFormer AFL great Neale Daniher has campaigned for more MND research since being diagnosed. More research needs to be done and consolidated through a national database on the causes of the disease, MND Australia CEO Clare Sullivan said.\n\n\n\n\n\n\"It's one of those diseases we still don't know a lot about, there's no specific diagnosis,\" she told AAP.\n\n\n\n\n\n\"You have to exclude everything else, and then you're left with motor neurone disease.\n\n\n\n\n\n\"That also goes to why we need better data. We don't even know how many people in Australia have motor neurone disease.\"\n\n\n\n\n\nIt's estimated that it affects about one in 10,000 people with about 2,700 people in the country battling the degenerative condition, according to official figures extrapolated from different sources.\n\n\n\nREAD MORE I was researching motor neurone disease, then I was diagnosed with it myself\n\nThe average life expectancy for a person diagnosed with MND is between two to three years.\n\n\n\n\n\nIn a report published by the peak body earlier this year, it put the cost of the devastating disease at about $4.85 billion based on lost productivity, the unpaid carer burden and direct healthcare system costs.\n\n\n\n\n\n\"As a country, we can be much more empathetic and inclusive of people with disabilities,\" Sullivan said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/donald-trump-labels-former-adviser-elon-musks-new-political-party-ridiculous/loj8nhimk",
        "title": "Donald Trump labels former adviser Elon Musk's new political party 'ridiculous'",
        "publish_date": "Mon, 7 Jul 2025 02:22:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "United States President Donald Trump has called Elon Musk's plans to form a new political party \"ridiculous\", saying the US functions best under a two-party system.\n\n\n\n\n\nA day after Musk escalated his feud with Trump and announced the formation of a new US political party, the Republican president was asked about it before boarding Air Force One in Morristown, New Jersey, as he returned to Washington upon visiting his nearby golf club.\n\n\n\n\n\n\"I think it's ridiculous to start a third party. We have a tremendous success with the Republican Party. The Democrats have lost their way, but it's always been a two-party system, and I think starting a third party just adds to confusion,\" Trump told reporters.\n\n\n\n\n\n\"It really seems to have been developed for two parties. Third parties have never worked, so he can have fun with it, but I think it's ridiculous.\"\n\n\n\n\n\nMusk announced on the weekend he was establishing the \"America Party\" in response to Trump's tax cut and spending bill , which Musk said would bankrupt the country.\n\n\n\nBillionaire Elon Musk announced on the weekend he was establishing the \"America Party\". Source: Getty / Kevin Dietsch Musk, who served as a top adviser to Trump on downsizing and reshaping the federal government during the first few months of his presidency, said his new party would, in next year's midterm elections, look to unseat Republican politicians in Congress who backed the sweeping measure known as the \"Big, Beautiful Bill\".\n\n\n\n\n\nSpeaking on the CNN program State of the Union, US treasury secretary Scott Bessent said the boards of directors at Musk's companies — Tesla and rocket firm SpaceX — would probably prefer him to stay out of politics.\n\n\n\n\n\n\"I imagine that those boards of directors did not like this announcement ... and will be encouraging him to focus on his business activities, not his political activities,\" Bessent said.\n\n\n\nTrump-Musk relationship soured over 'Big, Beautiful Bill'\n\nMusk spent millions of dollars underwriting Trump's 2024 re-election effort and, for a time, regularly showed up at the president's side in the White House Oval Office and elsewhere.\n\n\n\nElon Musk spent millions of dollars backing Donald Trump's 2024 re-election campaign and served as an adviser on government spending during the first few months of Trump's presidency. Source: Getty / Brandon Bell Their disagreement over the spending bill led to a falling out which Musk briefly tried unsuccessfully to repair .\n\n\n\n\n\nThe bill, which cuts taxes and ramps up spending on defence and border security, passed last week on party-line votes in both chambers of Congress.\n\n\n\n\n\nCritics have said it will damage the US economy by significantly adding to the federal budget deficit.\n\n\n\nTrump has said Musk is unhappy because the measure, which Trump signed into law last week, takes away green-energy credits for Tesla's electric vehicles.\n\n\n\n\n\nHe has threatened to pull billions of dollars Tesla and SpaceX receive in government contracts and subsidies in response to Musk's criticism.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/most-older-australians-back-labors-3-million-super-tax-plan/xz6vomc4p",
        "title": "More than half of older Australians back Labor's $3 million super tax plan",
        "publish_date": "Sun, 6 Jul 2025 23:18:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than half of older Australians support increasing taxes on high superannuation balances.\n\n\n\n\n\nThe federal government is controversially considering lifting taxes on super balances above $3 million from 15 per cent to 30 per cent, a move predicted to affect about 0.5 per cent of savers.\n\n\n\n\n\nDespite outcry from the Opposition, about 57 per cent of seniors endorse the change, according to a survey of 3,000 people aged 50 and older conducted by National Seniors Australia for the Super Members Council.\n\n\n\n'Strong sense of fairness'\n\nSuper Members Council chief executive Misha Schubert said: \"There seems to be broad Australian understanding about the importance of equity and sustainability in the super system, and a strong sense of fairness as the starting point.\"\n\n\n\n\n\nSchubert said the survey results appear to track with broader public sentiment on Labor's bill.\n\n\n\nLower confidence in fairness among some Australians\n\nWhile a significant majority of those surveyed believed the super system was strong and sustainable, comparatively fewer thought it was equitable.\n\n\n\n\n\nWomen, those with poorer health and Australians with less formal education had lower levels of confidence in its fairness, the report found.\n\n\n\n\n\nMany of these demographics lack equal access to the benefits of superannuation due to a lack of employment opportunities or disrupted work histories.\n\n\n\nBut overall, older Australians almost universally understand the importance of super with 89.5 per cent believing it must be saved for retirement.\n\n\n\n\n\nOne in four respondents supported early release of funds beyond current rules.\n\n\n\nCoalition's housing plan\n\nThe Coalition has continued to push a housing plan that would allow first-time home buyers to access up to $50,000 from their super to put down a deposit, despite protests it would raise house prices and leave savers worse off in the future.\n\n\n\n\n\n\"Policy ideas that propose early release are dangerous and they make Australians poorer,\" Schubert said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/gallen-all-praise-for-great-papalii-20250708-p5mddk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gallen all praise for 'great' Papali'i",
        "publish_date": "Tue, 08 Jul 2025 12:07:26 +1000",
        "category": "finance",
        "authors": [],
        "text": "Gallen all praise for 'great' Papali'i\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-declared-an-auction-but-no-bidders-turned-up-20250708-p5mdaf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump declared an auction but no bidders turned up",
        "publish_date": "Tue, 08 Jul 2025 12:03:52 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "In other words, Trump, having failed so far to bully countries into offering him the one-sided concessions he has been demanding, is effectively extending his deadline and the period for negotiations yet again, indefinitely. So much for “90 deals in 90 days” and the “Art of the Deal.” Loading In turns out that trade negotiations are more complicated, and his tariffs less intimidating, that he thought. Most trade deals take years, not months, to negotiate. What’s particularly significant about the first round of letters, apart from official communications between heads of state being posted on a privately-owned social media site, is that they target two of America’s major trading partners and closest allies. Japan and South Korea between them generate nearly 10 per cent of US goods imports and are major investors within the US.\n\nJapan is the largest foreign investor in US Treasury bonds, with holdings of more than $US1 trillion, and its auto companies alone have invested about $US62 billion ($A95 billion) in the US auto industry. South Korean companies have invested close to $US115 billion in the US over the past three years and its Hyundai auto group, by itself, has said it will invest $US21 billion in its US business over the next three years. South Korea has, or thought it had, a free trade agreement with the US. Hyundai Motor vehicles bound for shipment parked at the company’s plant in Ulsan, South Korea. Credit: Bloomberg Both countries are critical to America’s ambitions of containing China’s ambitions in the Asia Pacific region and both have co-operated – at some cost to their companies and economies – with US attempts to curtail China’s access to the most advanced semiconductors, the building blocks for most advanced industrial and military technologies. It’s insulting to those countries for Trump to say, as he did, that it was “a great honour” for him to send their leaders letters threatening them with punitive tariffs unless they bend to his will or to say that the letters demonstrate “the strength and commitment of our Trading Relationships.”\n\nHe’s invited those countries, among America’s closest trade and security partners, to “participate in the extraordinary Economy of the United States, the Number One Market in the World, by far.” They could be forgiven for thinking that they already do. Loading Yes, they, like the other countries being targeted with the so-called reciprocal tariffs – Thailand (36 per cent rate), Indonesia (32 per cent), Malaysia (25 per ent) and South Africa (30 per cent) were among the others – have trade surpluses with the US, which in Trump’s mind means they are ripping the US off via unfair trade practices. The view of most non-MAGA trade economists, however, is that the $US1.2 trillion US trade deficit in goods has more to do with Americans spending more than they produce – living beyond their means – than it does with unfair trade practices. In the letters, Trump described the deficits as “unsustainable” and a major threat to the US economy and national security.\n\nThe reality is that America’s last trade surplus was in 1975, so for half a century America has sustained, and generally prospered despite those trade deficits without them threatening its national security. Trump’s tariffs will raise the prices for imported goods for consumers, input costs for its manufacturers and disrupt its companies supply chains. Those effects will occur in the near term. Trump keeps asserting that the countries subjected to the tariffs will pay them but it is America and Americans that will have to absorb the cost of raising the duties paid by its importers from less than the 2.5 per cent effective average rate before Trump embarked on his trade war to something, once the reciprocal and sectoral tariffs are factored in, that could be well above 20 per cent. While the objective of the tariff policy is ostensibly to coerce foreign companies into investing in domestic manufacturing within the US, even if that were successful (and any success is likely to be relatively modest) it would take years for new plants to be constructed and skilled workforces to be assembled and, almost by definition, the costs of the end products would be higher than those of the imports they displace. The more likely “success” the policy might have in reducing the US trade deficit is if it ignites stagflation – reduced economic growth but increased inflation – and a recession that pulls US living standards and consumption and the demand for imported goods down.\n\nTrade wars are mutually destructive, with everyone losing. In America’s case, the damage will be self-inflicted. Trump’s obsession with Tariffs also betrays a misunderstanding of the nature of today’s US economy. He’s fixated on the trade deficit in goods, but the US economy is services-based. More than 75 per cent of US GDP is generated by the services sector; less than 25 per cent by goods-producing sectors. America has a trade surplus in services. In the letters, Trump warns that goods that are transhipped – goods that originate in a third country, which means China – will face an even higher tariff. That was a feature of last week’s deal, or at least the framework of a deal, the US announced it has reached with Vietnam, where the “reciprocal” rate of 20 per cent would be doubled for transhipped goods. He also threatened that, should the countries raise their own tariffs in response to US tariffs, that rate would be added to the rate the US charges.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/mcdonald-says-it-s-too-early-to-judge-whether-konstas-will-make-it-at-test-level-20250708-p5mda5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "McDonald says it’s too early to judge whether Konstas will make it at Test level",
        "publish_date": "Tue, 08 Jul 2025 12:00:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "St George’s: Australian coach Andrew McDonald says selectors remain committed to Sam Konstas, despite the young batter’s modest returns in the early stages of his Test career.\n\nAfter scores of 3, 5, 25 and 0 in Australia’s two Test victories over the West Indies in the Caribbean, things will get even more challenging for the 19-year-old in a pink ball day-night fixture in Jamaica starting Saturday (Sunday morning AEST).\n\nFrom four Tests, Konstas has made 146 runs at an average of 18.25. His first-class average is 31.66.\n\nMcDonald said the sample size was too small to form definitive judgments on the teenager’s long-term prospects and praised his efforts to be more proactive at the crease during the second Test in Grenada.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/missed-chances-and-baseline-warfare-the-key-moments-from-captivating-demon-djoker-clash-20250707-p5md8q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Missed chances and baseline warfare: The key moments from captivating Demon-Djoker clash",
        "publish_date": "Tue, 08 Jul 2025 11:56:21 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "It was just the second time this tournament that the former world No.1 had dropped serve. But arguably the key moment in deciding where this set was headed came in the second game, when Djokovic had the chance to immediately break back on de Minaur’s serve. Djokovic made a decent-enough return, which de Minaur countered with a backhand slice, but the Serbian superstar lost balance and awkwardly flayed a forehand well long. De Minaur held two points later for 2-0, then benefited from another erratic Djokovic serving performance in the fifth game. Djokovic dumped a mid-court backhand into the net, then double-faulted on the second point and again at break point to fall 4-1 behind. One last unforced error off Djokovic’s racquet – his 16th for the set – handed de Minaur a 6-1 lead. Demon misses his chance\n\nSecond set, Djokovic wins 6-4\n\nAny number of points seemed like crucial ones throughout this set as Djokovic began to assert his authority on the contest, only for de Minaur to repeatedly hit back. After they traded breaks to begin the second set, Djokovic poured the pressure on again to restrict de Minaur to 30-40. An incredible 35-shot rally followed, ending with de Minaur missing a backhand slice down the line. Djokovic sensed the moment, putting his finger behind his right ear and urging the crowd to make some noise. But de Minaur reeled in his 3-1 deficit to again level the set through six games. Djokovic came out on top in another titanic rally in the seventh game – this time 31 shots – to leave de Minaur 0-30, and the Australian eventually relented on serve. However, the critical moment for the set was still to come as Djokovic served to level the match at a set-all.\n\nDe Minaur had already had a break point, but the second one was where his big chance came, on a Djokovic second serve. The Aussie pounced on it, pounded a forehand at Djokovic’s feet, then, on a mid-court ball, ballooned a forehand long. Djokovic clinched the set two points later. Impatience costs de Minaur Third set, Djokovic wins 6-4\n\nBoth players fended off a break point each to start the set, and they held until four-all, when Djokovic made his move.\n\nDe Minaur found himself in a 15-40 hole, but a superb inside-out forehand set up the easiest of put-away volleys. On the second break point, he nailed a 206km/h first serve out wide – exactly what he was after – that enabled him to step into the court, but he sprayed a forehand wide going for a winner. De Minaur’s aggressive mindset helped him throughout the match, but, just like the previous set, his impatience and lack of execution at a key time cost him dearly. Djokovic leaked a forehand error in the next game to fall to 30-all, but was celebrating a two-sets-to-one lead soon after when he won a 27-shot rally with the simplest of dinks into the opposite service box. The damage was done two shots earlier when he ripped a cross-court forehand that sent de Minaur scurrying off court before forcing him to sprint across the other side with an off forehand near the opposite sideline. Brutal baseline warfare\n\nFourth set, Djokovic wins 6-4\n\nAfter saving a break point in the opening game, de Minaur stormed to a 4-1 lead as he threatened to send the match to a deciding fifth set. Djokovic even faced a break point to go 5-1 down, where de Minaur could not quite chase down an angled drop volley that ended up being his only opportunity for the game. The 24-time major champion made it out of the game without further damage, then tightened the screws. De Minaur defended back-to-back break points on excellent second serves and baseline play that drew Djokovic errors and got him back to deuce. But the Australian went break point down again trying to force the issue on his forehand. This is where Djokovic showed his mettle.\n\nA 32-shot rally followed of side-to-side brutal baseline warfare, but Djokovic took the initiative on a de Minaur backhand slice to rip a cross-court forehand on an extreme angle before crushing an inside-out forehand winner. Loading Starting with the final two points of that game, Djokovic captured 14 of the last 15 to complete his four-set defeat of a gallant de Minaur, who was left ruing his performance on the biggest of points. De Minaur won 36 of 52 points on rallies lasting nine shots or longer – an extraordinary feat – but Djokovic claimed four such exchanges mentioned above of 27 shots-plus at clutch moments that helped decide the match. Marc McGowan travelled to Wimbledon with the support of Tennis Australia.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/adam-liaw-s-berry-matcha-trifle-20250708-p5mdcy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s berry matcha trifle",
        "publish_date": "Tue, 08 Jul 2025 11:54:12 +1000",
        "category": "finance",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Step 1\n\nCombine the matcha with 20g of caster sugar in a bowl and pour in 150ml of boiling water. Whisk to dissolve the matcha and sugar, then add the cubes of cake, gently stirring to absorb the liquid without breaking up the cubes.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-e-biker-charged-with-riding-dangerously-assaulting-cop-20250707-p5md7t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Doors to Queensland zoo reopen after lion attack | Push for dogs to be allowed in pubs and cafes | E-biker charged with riding dangerously, assaulting cop",
        "publish_date": "Tue, 08 Jul 2025 11:45:29 +1000",
        "category": "finance",
        "authors": [],
        "text": "Mike Kaiser, who served as director-general of the Department of Premier and Cabinet under former Labor premier Steven Miles, has been given a job in the federal Labor government.\n\nPrime Minister Anthony Albanese announced Kaiser would become secretary of the Department of Climate Change, Energy, the Environment and Water, starting next Monday, with a five-year appointment, subject to Governor-General approval.\n\nLoading\n\n“Mr Kaiser’s experience includes delivering on large-scale projects, administering complex regulatory regimes and leading the Queensland government’s policies on planning and infrastructure,” Albanese said.\n\nOn LinkedIn, Kaiser described the new posting as a “consequential agenda” with passionate stakeholders.\n\n“High expectations. A lot to deliver,” he said, including the hashtag #publicserviceisaverb.\n\nKaiser was stood down by LNP Premier David Crisafulli after the October election.\n\nHe is also a former Queensland politician, but resigned after a branch stacking scandal in 2001.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/don-t-be-fooled-by-our-positive-sound-why-mental-as-anything-are-afraid-of-everything-20250706-p5mcu1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Don’t be fooled by our positive sound’: Why Mental as Anything are afraid of everything",
        "publish_date": "Tue, 08 Jul 2025 11:44:00 +1000",
        "category": "finance",
        "authors": [
            "Thomas Mitchell"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Reg Mombassa looks out of place in the middle of Sydney’s CBD. As the longtime creative force behind the clothing brand Mambo and frontman of the band Mental As Anything, the musician and artist is synonymous with suburbia: fibro houses, beach shacks, and backyard barbecues, that kind of thing. “I don’t like the city that much,” he admits, glancing up at the looming skyscrapers behind him. “But I love this restaurant.” Sitting next to Reg is his younger brother, Peter O’Doherty, also a former member of Mental As Anything, and a successful artist in his own right. Whether out of sibling obligation or genuine agreement, he echoes his brother’s sentiments. “I try to avoid coming into the city if I can, but this place is special.” The place in question is The Malaya, a one-time Sydney institution, founded in 1963 by Wong Tai See, a merchant seaman who migrated to Australia from Hong Kong in the 1940s. Formed on a whim by a group of bored art students in search of free drinks, Australia’s prankish Mental as Anything went on to forge a career spanning several decades. Credit: The original Malaya was located at 787 George Street, close to Central Station and Chinatown (the new version opened in April, just down the road at 225 George Street), before relocating to King Street Wharf in 2001, where it became a staple for long-lunching businessmen looking to make a dent with the corporate credit card. However, in the 1970s, The Malaya was overrun by a different crowd: students, artists, and musicians, curious folk who had heard whispers of the signature Sichuan eggplant that would sober you up in a mouthful. Among the devotees? A group of kids soon to be known as Mental As Anything. “We would come here all the time because it was open late and always reliable,” says Mombassa. “And the best thing is, it all feels the same, the menu, the food, the atmosphere.”\n\nAdvertisement\n\nTo prove his point, Mombassa reels off his favourites for the three of us to share – salt and pepper prawns, the coconut beef rendang and a Singapore curry fish. O’Doherty nods in agreement, before catching himself. “Well, actually, it looks a bit different to how it did in the 1970s, but then again, so do we.” Alongside bands like INXS, Cold Chisel and ACDC, the Mentals, as they’re affectionately known, helped provide the soundtrack to Australia in the 1970s and 1980s. The group formed in Sydney in 1976 when Martin Murphy (also known as Martin Plaza) met fellow student Chris O’Doherty (Reg Mombassa) at the National Art School. Coconut beef rendang: aromatic coconut, lemongrass, galangal and kaffir lime base. Credit: Janie Barrett The duo was soon jamming in guitarist and vocalist Mombassa’s Darlinghurst flat. Murphy, on guitar and vocals, brought in his college friend Steve Coburn on bass guitar, while another student, David Twohill (also known as Wayne de Lisle), was recruited on drums. According to Mombassa, their first gig was spectacularly unspectacular. “It was a party in Balmain at Martin’s girlfriend’s place,” he recalls. “We didn’t have a huge repertoire, so we played Can’t Be Satisfied by Muddy Waters three times.” In 1977, Peter O’Doherty replaced Coburn, and the group added Andrew Smith (known as Greedy Smith). With this, the classic Mental as Anything lineup was complete. The group would remain unchanged until 2000, when O’Doherty and Mombassa departed the band to focus on their two-piece act, Dog Trumpet. There was no controversial split; it was simply the closing of a chapter.\n\nAdvertisement\n\n“We certainly had a good run for people who didn’t plan on being in a popular band,” says O’Doherty, between mouthfuls of prawn. “We travelled the world and wrote some great songs.” “Yes, I suppose so,” adds Mombassa. I worry Mombassa’s reflection on his musical legacy is as modest as his appetite (my plate is piled with rendang while his sits largely untouched). Following their debut single, The Nips Are Getting Bigger, the band had Australian top 10 hits in 1981 with If You Leave Me, Can I Come Too? and Too Many Times, and in 1985 with Live It Up, which also featured in the 1986 film Crocodile Dundee. At their peak, the Mentals sold millions of albums, toured the US and Europe, and topped the charts at home and abroad. Surely, that counts as a great run? “It’s just a strange thing always to look back, I’m not sure if it is helpful,” says Mombassa. As the Singapore curry arrives, a glorious coral trout, surrounded by tomato and eggplant, talk turns to an upcoming-but-untitled Mental As Anything documentary, directed by Matthew Walker (I’m Wanita), which charts the band’s unlikely rise. “We’ve spent a lot of time over the last 18 months sitting like this, side by side, sifting through the memories,” says O’Doherty. “Sometimes it’s good, and sometimes it’s bad, you’re reminded of the disappointing and frustrating moments, as well as the enjoyable parts.” The documentary features hours of archival footage, which means the pair have been poring over early vision of Smith, who passed away in December 2019, following a heart attack. Smith’s death at 63 came as a shock, though Mombassa reliably informs me that the average life span of a rock and roller is “about 60”. “A lot of our contemporaries and friends are getting sick or dying,” he says. “It can be dangerous to find fame when you’re young, and then it fades away, and you’re not sure what to do with yourself. Some of them just burn out.”\n\nAdvertisement\n\nAt 66 and 73, respectively, O’Doherty and Mombassa are doing quite well, but both admit mortality is never far from their minds. “I think as you get older, you become very aware of how much time is behind you and how little is in front of you,” says O’Doherty. “Which explains why there is a lot of existential angst in all the songs that we write these days.” He’s not wrong. The pair’s latest album, their ninth as the double act Dog Trumpet, has a deceptively optimistic title, Live Forever, which is also the name of the lead single. Upbeat as it may sound, the lyrics are quite the opposite. “Sometimes I am afraid of everything in the world,” sings Mombassa on the album opener. “And sometimes I am ashamed to be a human, it’s a shame.” Salt and pepper prawns: wok-tossed with cracked black pepper. Credit: Janie Barrett Midway through a parcel of san choy bow seems like an inopportune moment to ask Mombassa if he’s really, truly, afraid of everything, but he’s more than happy to answer. “Well, I think if we can’t transform our consciousness, we’re headed for extinction,” he says matter-of-factly, returning his food to the table. “We need to get away from this obsession with alpha males and aggression, fuelled by guys like Trump and Putin, fascists masquerading as politicians.” O’Doherty feels much the same way, admitting that while the world has always been “cruel and unjust”, a uniquely modern issue has supercharged the collective anxiety: “The big problem is that we don’t seem to be able to agree on facts.”\n\nAdvertisement\n\nOne thing we can actually agree on is that no one needs dessert. Mombassa nurses sparkling mineral water, while O’Doherty and I opt for a glass of 2019 Morningside Pinot Noir. It’s hard to solve the world’s issues when you’re stone-cold sober. “Twenty-odd years ago, we demonstrated the US invasion of Iraq with 100,000 other people in Sydney,” says O’Doherty. “Before that, in the 1970s, we protested Vietnam too,” adds Mombassa. “Exactly,” O’Doherty continues. “And that’s my point. In my opinion, the right wing has always been dangerous, but considering where we find ourselves [now], people like Bush and Reagan seem almost reasonable in retrospect.” Talking politics over a nice meal might be frowned upon, but with Mombassa on hand to rib his brother – “You pining for the Bush administration?” – the mood remains upbeat. Chris O’Doherty aka Reg Mombassa’s artworks came to the attention of Mambo’s founder Dare Jennings in the mid-1980s. They went on to become synonymous with the renowned Australian surf and leisurewear label. Credit: Mambo Australia This ability to mix light and shade has long been a hallmark of Mombassa’s creative output, whether writing songs or creating T-shirts for Mambo. “The designs were political but ambiguous, so I often see people wearing my shirts and wonder if they know,” laughs Mombassa. “People have made similar comments about our songs, both with Mentals and Dog Trumpet; there is a cheerful melody hiding something deeper,” he says. “But don’t be fooled by the positive sound, I still want you to think, ‘what the f--k are we all doing?’”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/sister-in-law-visited-lions-about-80-times-before-losing-her-arm-20250708-p5mdc1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sister-in-law visited lions ‘about 80 times’ before losing her arm",
        "publish_date": "Tue, 08 Jul 2025 11:43:38 +1000",
        "category": "finance",
        "authors": [
            "Cameron Atfield",
            "Brittney Deguara"
        ],
        "text": "Darling Downs Zoo co-owner Steve Robinson has confirmed the victim of the lioness attack on Sunday morning was his sister-in-law, who had 20 years’ experience with the lions, with the ordeal “still very, very raw” for the zoo community.\n\nSpeaking to media outside the reopened zoo on Tuesday morning, Robinson said the woman – a teacher visiting from NSW – was “not terribly lucid” so it was not yet clear how the accident occurred.\n\n“We haven’t really pressed for answers as to what she was doing and how this happened,” he said.\n\n“We’ve got theories but until we get fact, I’m not going to be speculating or running with any what ifs or maybes or anything like that.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/money/investing/plain-gold-is-soulless-why-collectors-love-contemporary-jewellery-20250708-p5mdba.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Plain gold is soulless’: Why collectors love contemporary jewellery",
        "publish_date": "Tue, 08 Jul 2025 11:34:28 +1000",
        "category": "finance",
        "authors": [
            "Stephen Crafti"
        ],
        "text": "Contemporary jewellery or “art jewellery” as it’s sometimes referred to, has been ubiquitous since the 1950s. And despite shunning traditional materials such as diamonds and gold for resin or steel, these unique pieces can still command considerable sums.\n\nIf you ask Anne Rutland, a collector of contemporary jewellery, to choose between a chunk of gold or a well-designed piece of contemporary jewellery, it’s a clear decision. “Gold in its raw form is just soulless, dead,” says Rutland, who has spent the last 25 years collecting contemporary jewellery.\n\nContemporary jewellery may not involve massive diamonds and 24-carat gold, but the unique pieces – such as this collection by Lisa Roet – can still demand considerable sums.\n\nOne of her first acquisitions was a simple brooch, priced at $20 by Melbourne based artist/jeweller Roseanne Bartley. When her momentum for collecting built, Rutland purchased a couple of neck pieces by Carlier Makigawa from Gallery Funaki in Melbourne. Priced at well over $2000 for each, the value has since increased significantly.\n\n“A similar neck piece was purchased by the Decorative Arts Museum in Paris,” says Rutland. “Contemporary jewellery is still fairly niche and many still don’t get the idea of wearing something that’s more about the story it tells, than the value of materials,” she adds.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/japanese-style-chicken-schnitzel-curry-20250708-p5mdcw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s Japanese-style chicken schnitzel curry",
        "publish_date": "Tue, 08 Jul 2025 11:25:04 +1000",
        "category": "lifestyle",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Step 1\n\nHeat a medium saucepan over medium heat and add about 2 teaspoons of oil. Add the onion, carrot and potato and fry for about 3 minutes until just starting to soften. Add 600ml of boiling water and bring to a simmer. Simmer covered for about 15 minutes, until the carrot and potato have softened, then break in the curry mix block and stir until the mixture thickens. Keep warm while you cook the schnitzels.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/penguins-on-standby-as-trump-ruffles-global-trade-feathers-20250708-p5mdah.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Penguins on standby as Trump ruffles global trade feathers",
        "publish_date": "Tue, 08 Jul 2025 11:15:02 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "The penguins of Heard and McDonald Islands are back quaking in their flippers as they await a tariff letter from Donald Trump.\n\nAfter seeing what an eclectic group of nations is going to face if they sell goods to American consumers, the penguins (and seals) of the frigid outpost closer to Antarctica than Australia can be rightfully more than a little concerned about what the US president has in store for them – having been on the first list of “liberation day” tariffs in April.\n\nDonald Trump has identified the first 14 nations to face reciprocal tariffs. The penguins of Heard and McDonald Islands have escaped his plan, for now. Credit: Bloomberg\n\nThe only common element to Trump’s initial list of 14 countries to be hit with extra tariffs of between 25 per cent and 40 per cent is each runs a trade deficit with the United States. That stretches between $US69.4 billion with Japan and $US126 million with Bosnia and Herzegovina.\n\nThe common thread – deficits – is a positive sign (among the bleakness of the economic ramifications of Trump’s actions for American consumers) for Prime Minister Anthony Albanese.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/cardi-b-a-crow-and-the-americans-taking-over-paris-fashion-week-20250707-p5md6v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cardi B, a crow and the Americans taking over Paris Fashion Week",
        "publish_date": "Tue, 08 Jul 2025 11:09:35 +1000",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "A warm “howdy” is becoming more appropriate than a breathy “bonjour” backstage at Paris Fashion Week. On day one, Americans are already the flavour of the autumn/winter 2026 haute couture season at two leading fashion houses, leaving the acquired taste of French designers in short supply.\n\nThe week dedicated to clothes for the rich, where gowns can cost anywhere between $77,000 and $1,230,000, began with a collection brimming with historical references from US designer Daniel Roseberry at Schiaparelli.\n\nWho is buying the matador suits and gowns with jutting hips and shoulders? Lauren Sanchez wore a gold corset dress from Schiaparelli as part of her pre-wedding festivities with Amazon billionaire Jeff Bezos. The dress, with floral hand embroidery, was estimated to have cost $US100,000 ($154,000).\n\nCardi B accessorising with a crow at the Schiaparelli autumn/winter, 2025/2026 haute couture show in Paris. Credit: Getty Images\n\nRoseberry has risen to the top of the Parisienne ranks by embracing the drama of the label, founded by Italian designer Elsa Schiaparelli in 1927, which gained fame for its surrealist touches. In 2023, Roseberry gave us Kylie Jenner wearing a realistic lion’s head in the front row, yesterday it was Cardi B arriving cocooned in a black velvet gown with pearl fringing, an exaggerated U-neckline and a crow on a leash.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/too-haas-cleared-play-nsw-235340894.html",
        "title": "To'o, Haas cleared to play for NSW in Origin decider",
        "publish_date": "2025-07-08T01:54:48Z",
        "category": "sports",
        "authors": [
            "Scott Bailey"
        ],
        "text": "To'o, Haas cleared to play for NSW in Origin decider\n\nBrian To'o has been declared fit for the State of Origin decider, after NSW coach Laurie Daley confirmed he would play an unchanged team at Accor Stadium.\n\nTo'o got through a full training session with NSW teammates on Tuesday night, despite suffering a grade-two tear to the lateral ligament in his knee.\n\nPayne Haas will also play for the Blues despite barely training in the lead-up because of a back issue that has plagued the Brisbane prop all season.\n\nThe Blues' Brian To'o has been cleared to play in the State of Origin decider. (Richard Wainwright/AAP PHOTOS)\n\nNSW used Monday evening as their last major training run before the Wednesday night showdown, with only a light walk-through at Accor Stadium on Tuesday.\n\nADVERTISEMENT\n\n\"Brian trained all the (Monday) session ... he did everything and looked in good spirits,\" Daley said.\n\n\"Payne did a little bit, but we always knew going into the game that Payne would be on restricted duties. He will be ready for the game.\"\n\nNSW have been something of a walking wounded for the past week, with Penrith players comparing the situation to their injury-hit 2021 premiership run.\n\nHalfback Nathan Cleary has battled a groin issue since the eve of game two, and while the Blues say he will be fine to kick in general play, there will be no goal-kicking.\n\nSecond-rower Hudson Young has also battled a groin injury that sidelined him for part of last week's training, but he too is fine to face Queensland.\n\nBut it is the Haas situation that is perhaps the most remarkable.\n\nThe front-rower was the Blues' best in the series-opening win at Suncorp Stadium after barely training in the lead-up due to a quad strain.\n\nADVERTISEMENT\n\nThe back issue continued to be a problem before he was again solid in the game-two loss, and he would be favourite to be named man of the series if NSW win on Wednesday.\n\nNSW coach Laurie Daley says Payne Haas will play in Origin III, despite a restricted lead-up. (Dan Himbrechts/AAP PHOTOS)\n\n\"Given what he was gone through in this series .... what he does is amazing,\" Daley said.\n\n\"Because of what Payne has done in the past you are prepared to back him.\n\n\"It probably helps him more than hinders him. He plays big minutes as a front-rower, plays every game and battles on.\n\n\"So he probably needs a bit of a freshen up to be fair. He wanted to do more last night.\n\n\"But it's not about having him right on a Monday night, it's important to have him right on the Wednesday.\"",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/no-words-slater-knows-munster-014249213.html",
        "title": "'No words': how Slater knows what Munster is feeling",
        "publish_date": "2025-07-08T01:42:49Z",
        "category": "sports",
        "authors": [
            "Jasper Bruce"
        ],
        "text": "'No words': how Slater knows what Munster is feeling\n\nIf there's anyone who understands what Cameron Munster has gone through in the lead-up to the State of Origin decider, it's Queensland coach Billy Slater.\n\nSlater knew there was nothing he could say to make everything better when he sat with Munster in his room at Queensland camp on Sunday, the day the new Maroons captain learned of his father Steven's sudden death.\n\nMunster vowed then and there to Slater that, after spending some time with his family, he would lead Queensland in Wednesday's Origin decider - one of the biggest games of his career.\n\n\"He didn't have a lot of answers for a lot of other things, but he gave that one to me pretty straight,\" Slater said.\n\nADVERTISEMENT\n\n\"It's a huge game and he wants to be a part of that.\"\n\nMaroons coach Billy Slater and captain Cameron Munster fronted the media ahead of Origin II. (Dan Himbrechts/AAP PHOTOS)\n\nTo give him as much time as possible with his family, the Maroons booked Munster on a separate flight that would get him to Sydney in time for Tuesday afternoon's captain's run at Accor Stadium.\n\n\"I can't wait to give him a hug,\" Slater said ahead of Munster's reunion with the team.\n\n\"Naturally, he's been pretty upset over the last couple of days, but I think the last couple of days he's been where he's needed to be, and that's with his mum and his sister.\"\n\nSlater understood the best thing he could do for Munster sitting in his room on Sunday was to be there as a mate, and give him all the time he needed with family.\n\nThe coach knew that because he lost his own father Ronnie earlier this year.\n\nADVERTISEMENT\n\n\"There's no real words that fix any of this,\" Slater said.\n\n\"Unfortunately there's not a switch (to flick).\n\n\"I haven't dealt with this as a coach, but I've dealt with it as a person. I lost my father in January. I know what it's like and Cam's an inspiration for many people.\n\nBilly Slater can empathise with Cameron Munster, having lost his own father this year. (Steven Markham/AAP PHOTOS)\n\n\"He's a hero to many people in Queensland. I can only imagine his dad would've been his first inspiration and his first hero. He'd be hurting right now.\"\n\nThat's why Slater knows Wednesday night is the time for the Maroons to show up for Munster, just as he showed up for his teammates guiding them to victory against the odds in Origin II.\n\n\"Their skipper is going to need them on Wednesday night,\" Slater said.\n\n\"I'm sure it'll give them a huge boost, to see their mate going through something that you only go through once in your life, losing your father. I'm sure it's going to have a huge impact on them.\"\n\nCameron Munster led by example in the Maroons' victory in State of Origin II. (Dan Himbrechts/AAP PHOTOS)\n\nSlater has already seen his senior players leading the group with aplomb in Munster's absence.\n\nADVERTISEMENT\n\nIt's been a blessing for the group to have Josh Papalii, the Canberra prop called out of representative retirement to reinvigorate the forward pack.\n\n\"It's a feel, with 'Papa',\" Slater said of the veteran's impact on the squad.\n\n\"The best way I could describe it is it's probably a calmness. Big Tino (Fa'asuamaleaui) has been like a little puppy dog, following him around all week.\"",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/injured-blacks-captain-ruled-test-012236391.html",
        "title": "Injured All Blacks captain ruled out of Test series",
        "publish_date": "2025-07-08T01:22:36Z",
        "category": "sports",
        "authors": [],
        "text": "All Blacks captain Scott Barrett has been ruled out of New Zealand's second and third rugby Tests against France after injuring his ankle in the series-opening win.\n\nBarrett was replaced midway through the second half of the first Test in Dunedin, which the All Blacks won 31-27.\n\nScans have since revealed a tear in Barrett's calf muscle.\n\nBack-rower Ardie Savea will lead the All Blacks in the second Test in Wellington on Saturday. The All Blacks have yet to name a replacement for Barrett at lock.\n\nAll Blacks assistant coach Scott Hansen said Barrett was a massive part of the team.\n\n\"We're obviously disappointed to lose the skip, but we've got to go forward,'' he said.\n\nADVERTISEMENT\n\n\"We trust our depth. There is an opportunity for someone else to step up.\"\n\nHansen said it wasn't yet clear how long Barrett will be sidelined.\n\n\"We'll just take it week for week,\" he said. \"He'll be keen to get back as quickly as possible, but we obviously have to do what's right for him in the injury process.\"",
        "source": "Yahoo"
    }
]