[
    {
        "url": "https://www.9news.com.au/national/federal-election-peter-dutton-reveals-housing-policy/41c1d8c4-af49-4052-b498-8aa2f535d56c",
        "title": "Early access super, international student cuts: Dutton unveils election housing policy",
        "publish_date": "Sat, 05 Apr 2025 23:24:49 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Peter Dutton has vowed to slash international student numbers, allow early access to superannuation for first home buyers and ban foreign investment to \"restore the dream of home ownership\" for young Australians. ﻿\n\nCampaigning in the Melbourne seat of McEwen this morning, the Opposition leader also pledged $5 billion to build 500 thousand homes to ease the nation's housing crisis.\n\n\"T﻿he dream of home ownership has been lost by young Australians,\" Dutton told reporters.\n\nEarly access super, immigration cuts: Dutton unveils election housing policy (Nine)\n\nUnder the Coalition's proposed housing policy, ﻿international student numbers would be capped at a figure 30,000 below Labor's proposal.﻿\n\nThe government would also ban foreign buyers and introduce early superannuation access of up to $50,000 for a house deposit.\n\nDu﻿tton said guaranteeing early access to superannuation would help first home buyers enter the property market.\n\n\"That is going to improve their net position as the price of the house increases over the course of their life,\" he said.\n\n\"When they dispose of the house, we want to put the money back into their superannuation so that that can compound and help them in retirement.\"\n\nDutton said the Coalition would also seek to deregister the CFMEU, claiming that the union had \"doubled the cost of construction\".\n\n\"We are going to be the government of home ownership,\"﻿ he said.\n\n\"I want to be the prime minister that restores the dream of home ownership, that has first and foremost in my mind, how can we help young Australians with affordability and accessibility to housing.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/four-rescued-after-douglas-park-mine-collapse/45ed14a1-085c-4bab-b75f-793ca0db9de3",
        "title": "Four rescued from rubble after mine collapse in Sydney's south",
        "publish_date": "Sat, 05 Apr 2025 22:51:04 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Four workers have been rescued following a coal mine collapse in Sydney's south.\n\nThe incident occurred at the Appin West Colliery mine site at Douglas Park around 3am today.\n\nThe group were trapped in the rubble for more than 30 minutes.\n\nOnce freed, two workers were taken to Liverpool hospital, ﻿including one with serious head injuries.\n\nThe two other workers were taken to Wollongong Hospital for treatment.﻿\n\nGM3, which recently acquired the mine site, confirmed operations at Appin Mine have been paused and an investigation was under way.\n\n\"Emergency services responded promptly, and all appropriate emergency protocols were enacted,\" a spokesperson said.\n\n\"An investigation is under way with the NSW Resources Regulator and other relevant authorities.\n\n\"Operations have been paused until further notice.\n\n\"At GM3, Our focus always remains on the safety of our people.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/jaguar-and-land-rover-maker-pauses-shipments-to-us-as-it-develops-posttariff-plans/5c15fac2-63bc-4ca5-8f8c-e696c80890f1",
        "title": "Global car giant stops shipments to the US over Trump tariffs",
        "publish_date": "Sat, 05 Apr 2025 22:52:53 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "The maker of Jaguar and Land Rover cars is pausing shipments to the US as Britain's struggling auto industry begins to respond to the 25 per cent tax on vehicle imports imposed by President Donald Trump.\n\nJaguar Land Rover Automotive, one of Britain’s biggest carmakers, said the pause would take place this month.\n\n“The USA is an important market for JLR’s luxury brands,” the company said in a statement. “As we work to address the new trading terms with our business partners, we are taking some short-term actions including a shipment pause in April, as we develop our mid- to longer-term plans.”\n\nJaguar Land Rover is pausing shipments of its cars to the US as it assesses Donald Trump's tariffs. (CNN)\n\nAnalysts said they expect other British carmakers to follow suit as the increased tariffs heap more pressure on an industry that is already struggling with declining demand at home and the need to retool their plants for the transition to electric vehicles.\n\n“I expect similar stoppages from other producers as firms take stock of what is unfolding,” said David Bailey, an automotive industry expert and professor of business economics at the University of Birmingham.\n\nThe number of cars made in the UK dropped 13.9 per cent to 779,584 vehicles last year, according to the SMMT. More than 77 per cent of those vehicles were destined for the export market. UK factories export cars such as Nissan's Qashqai and Juke, BMW Mini, and Toyota Corolla, as well as Land Rover and Jaguar models.\n\nREAD MORE﻿\n\nRange Rover sports utility vehicles in the paint shop at the company's manufacturing plant in Solihull, UK. Photographer: Chris Ratcliffe/Bloomberg (Bloomberg)\n\n“The industry is already facing multiple headwinds and this announcement comes at the worst possible time,” Mike Hawes, chief executive of the UK’s Society of Motor Manufacturers and Traders, said last week. “SMMT is in constant contact with government and will be looking for trade discussions to accelerate as we need to secure a way forward that supports jobs and economic growth on both sides of the Atlantic.”\n\nUK carmakers have already taken steps to lessen the immediate impact of the tariffs by building stockpiles in the US before the increase took effect. SMMT figures show that exports to the US jumped 38.5 per cent from a year earlier in December, 12.4 per cent in January and 34.6 per cent in February.\n\n\"This was manufacturers like JLR trying to get ahead of the game in terms of getting inventory to the U.S. before the tariffs were implemented,'' Bailey said.\n\nBritish carmakers shipped 8.3 billion pounds ($17.5 billion) worth of vehicles to the US in the 12 months through September, making cars the single biggest goods export to the US, according to government statistics.\n\nBut cars make up a relatively small part of overall trade between Britain and the U.S., which is heavily weighted toward services.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/investigation-after-brawl-among-crowd-at-rabbitohsroosters-match/cb3e2cdc-8770-4f8f-a960-c1e939f53409",
        "title": "Witnesses describe 'all-out brawl' at Rabbitohs-Roosters match",
        "publish_date": "Sat, 05 Apr 2025 07:25:40 +0000",
        "category": "sports",
        "authors": [
            "Apr"
        ],
        "text": "Witnesses have described seeing an \"all-out brawl\" at an\n\nNRL match\n\nbetween the South Sydney Rabbitohs and the Sydney Roosters at Accor Stadium last night.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-election-2025-independent-candidate-erchana-murray-bartlett-thinks-queensland-is-ready-for-teal-movement-gold-coast-politics-news/a1403e4c-596b-44fd-9eaa-0b65d059f204",
        "title": "Independent candidate eyeing off surprise 'next frontier' for teals",
        "publish_date": "Fri, 04 Apr 2025 20:09:58 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "A community independent candidate running on the Gold Coast believes the cost-of-living crisis and exposure to natural disasters could see the teal movement finally cut through the Liberal National Party's thin blue line this federal election .\n\nMarathon runner and nutritionist Erchana Murray-Bartlett is running for McPherson, which stretches from Burleigh to Coolangatta, where five-time incumbent Liberal MP Karen Andrews is retiring.\n\n\"﻿People live here because they're not engaged in politics and they want to, you know, surf and live this beautiful lifestyle, but at the end of the day, politics will affect all of us, particularly in such a vulnerable city to climate events,\" Murray-Bartlett told 9news.com.au.\n\nErchana Murray-Bartlett believes the Gold Coast is the \"next frontier\" for the teals. (Supplied)\n\n\"When we can't afford to live here and our grocery prices are soaring, there is a reason that this is happening.﻿\n\n\"This is a cost-of-living election... we need urgent cost-of-living relief.\"﻿\n\nEvery seat on the Gold Coast is a safe LNP seat. McPherson has been held by the Liberal Party since 1972.\n\nREAD MORE: Heat maps show least affordable electorates for renters in Australia\n\nAt the 2022 election, McPherson saw a 2.9 per cent swing to Labor, but Andrews comfortably retained the seat on a 9.3 per cent margin.\n\nBut Murray-Bartlett describes it as the \"next frontier\" for the teals, who have previously enjoyed success in inner-city seats in Sydney, Melbourne and Perth.﻿\n\n\"The Gold Coast has been taken for granted for so long, you know, we've been a safe LNP seat for many, many years.\"\n\nWhat politicians have been up to on the election campaign trail View Gallery\n\n\"I thought, you know what, just by being in the race and giving a strong, independent option, it's gonna do wonders for the community.﻿\n\n\"Maybe we've ﻿seen the influence of the independents from the south filter through and the incredible good that they've managed to do and it's filtered up north, I'm not sure but I do know it's very much a movement up here in Queensland now.\"﻿\n\nBacked by political crowdfunding group Climate 200, \"teal\" or community independent candidates won a host of once-safe Liberal seats at the last federal election , helping to create the largest crossbench in Australian history.\n\nREAD MORE: The 10 closest seats heading into the 2025 federal election\n\nMurray-Bartlett said she was happy to be called a teal - but doesn't use the label herself. (Supplied)\n\nMurray-Bartlett said she was happy to be called a teal - but doesn't use the label herself.\n\n\"Even though yes, there might be some areas that we are values-aligned, ultimately, at the end of the day, I'm only accountable to my electorate, and that's how I'll vote.﻿\"\n\nClimate 200 has backed Murray-Bartlett, as well as several other independent candidates running for Queensland seats, ﻿including Nicole Arrowsmith in the neighbouring electorate of Moncrieff, Ellie Smith in Peter Dutton's seat of Dickson, Suzie Holt in Groom on the Darling Downs, as well as Francis Wiig in Fairfax and Keryn Jones in Fisher, both on the Sunshine Coast.\n\n﻿Murray-Barlett will literally run the entire length of her electorate – all 120 kilometres of it – non-stop tomorrow to raise funds for her campaign.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/perth-dad-turning-pain-into-purpose-successful-campaign-lifevac-installed/596bb415-8ab9-47b6-abd2-f34a08fd15bc",
        "title": "Perth dad's personal tragedy inspired life-saving equipment campaign",
        "publish_date": "Fri, 04 Apr 2025 12:46:55 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "A Perth father has turned pain into purpose, convincing local councils to install anti-choking devices after the death of his son last year.\n\nThe life-saving kits will soon be found in 36 centres across Joondalup, in the hopes of stopping preventable deaths.\n\nZaza Bwoga was happy, cheeky, and full of life but in January last year, an innocent gesture turned tragic.\n\nBrian Bwoga's personal tragedy inspired campaign for life-saving equipment to be installed throughout community (9News)\n\nAnother toddler offered the one-year-old a grape before Zaza started to choke.\n\nDespite desperate efforts to save him, he died in his father's arms.\n\n\"I tried y'all, I tried,\" Brian Bwoga said, breaking down in tears.\n\n\"I'm very sorry I couldn't save my son but I hope another parent doesn't have to go through this.\"\n\nBwoga is now turning his grief into action, successfully pushing the City of Joondalup to install LifeVac devices at all community-based facilities.\n\nAnother toddler offered the one-year-old a grape before Zaza started to choke. (9News)\n\nDespite desperate efforts to save him, Zaza died in his father's arms. (9News)\n\nThe first of 36 was installed at Joondalup Library today.\n\nThe LifeVac device works like a plunger to clear the upper airway and the emergency suction tool is a last resort if first aid doesn't work.\n\n\"It's not going to push any foreign object in, it's just going to suction, you can hear that pop, that's how it works,\" Bwoga said.\n\n\"I'm very sure if we had the right tools he would have been here.\"\n\nAccording to the LifeVac website, it was created by Arthur Lih along with \"Dr Brody and a few friends\" after Lih heard a woman crying about her son's death when he choked on a grape and the Heimlich manoeuvre didn't work.\n\nThe LifeVac device works like a plunger to clear the upper airway and the emergency suction tool is a last resort if first aid doesn't work. (9News)\n\n\"I was amazed something so simple and so cheap could save lives,\" registered nurse Rebecca Pizzi told 9News.\n\nIn Australia, 140 children under four choked or suffocated on food in 2022-2023.\n\nThe Perth dad's mission is to drive those numbers down and save young lives.\n\n\"I want them in schools, daycare centres, I want first responders to have them,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/future-fund-weapons-manufacturers-tesla-palantir-technologies/105126100",
        "title": "As Europe rearms, where is Australia's Future Fund investing?",
        "publish_date": "Sun, 06 Apr 2025 01:15:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's worth watching.\n\nWith everything that's happening in the world, where is Australia's sovereign wealth fund (the Future Fund) investing on behalf of Australians?\n\nIt recently released its six monthly investment update.\n\nThe update shows what stocks it bought and sold between June and December, and what returns its stock holdings are generating.\n\nInvestments in weapons manufacturers and aerospace companies\n\nWe've previously written about the controversy surrounding a list of 30 \"defence companies\" the Future Fund has direct shareholdings in (i.e. global weapons manufacturers and aerospace companies).\n\nYou can see the original list here.\n\nLet's revisit that list to see how the Future Fund's investments in those stocks are going (according to its Periodic Investment Report 31 December 2024).\n\nFuture Fund's investments were always politicised Photo shows An aerial view of coal extracted from the Narrabri mine, with a landscape of lakes and mountains behind it. The federal government has been accused of politicising the Future Fund by changing its mandate, but its investments have always been tangled up in politics.\n\nThe latest data show that, between June and December, the value the fund's shareholdings in the companies on that list jumped by $94 million.\n\nThe value of its shareholdings increased significantly in Axon Enterprise Inc. (+132.5 per cent), Elbit Systems (+102 per cent), Lockheed Martin (+52.5 per cent) and Thales (+41.98 per cent).\n\nThe value of its shareholdings in Northrop Grumman (+33.4 per cent), the Boeing Co. (+26.6 per cent), and RTX Corporation (formerly Raytheon Technologies) (+13.9 per cent) also rose noticeably.\n\nMany of those companies are the subject of international divestment campaigns.\n\nThe table below shows the value of the fund's shareholdings in those companies.\n\nIn the table, a change in the value of the shareholdings reflects the Future Fund's decision to buy (or sell) more of each stock, an increase (or decrease) in the price of each stock, or both.\n\nNorway's sovereign wealth fund has many of those companies on its exclusions list for things like human rights violations, production of nuclear weapons, and particularly serious violations of fundamental ethical norms.\n\nHowever, there's currently a debate in Norway about the wisdom or otherwise of maintaining such strict ethical guidelines for its sovereign wealth fund in today's environment, when the global security landscape is evolving rapidly and defence spending is rising.\n\nJust last month, the president of the European Commission, Ursula von der Leyen, warned these were \"momentous and dangerous\" times and Europe was now living in \"an era of rearmament\".\n\nPalantir Technologies\n\nWith that in mind, another Future Fund investment worth watching is Palantir Technologies.\n\nBetween June and December, the value of the fund's shareholdings in Palantir increased from $5.5 million to $20 million (+263 per cent).\n\nThe company's share price jumped by 192 per cent in those six months, and the Future Fund bought more stock, increasing its shares from 144,897 to 163,479.\n\nWhat does Palantir do?\n\nWhat does the supermarket chain Coles and the CIA have in common? Photo shows Office workers walk past a Coles supermarket. Coles plans to deploy data company Palantir's tools across more than 840 supermarkets to cut costs and \"redefine how we think about our workforce\". At a time of increased food insecurity, Australians should question if this is the right direction.\n\nIt sits on the frontier of Big Data analytics (it was named after the seeing stones in J.R.R. Tolkien's The Lord of the Rings).\n\nEarly in its life, it received seed funding from In-Q-Tel, the CIA's venture capital arm, and much of its revenue derives from government clients such as military, immigration departments, and police agencies, in the United States and overseas.\n\nIt has been the subject of a slew of books about Silicon Valley's billionaires and the deep connection between modern national security and the surveillance state.\n\nIts artificial intelligence software has helped US Immigration and Customs Enforcement (ICE) officials conduct workplace raids, family separations and deportations.\n\nIt's the subject of international divestment campaigns due to its \"strategic partnership\" with Israel's military.\n\nIt also works with large companies such as Rio Tinto, WesTrac, and Coles supermarkets (it has offices in Canberra and Sydney).\n\nThe US billionaire Alex Karp, chief executive and co-founder of the company, published a book in February titled: The Technological Republic: Hard Power, Soft Belief and the Future of the West.\n\nIt's currently ranked No.1 on the New York Times bestseller list.\n\nIn the book, Mr Karp argues \"the West\" is superior and software and technology companies must forge a deeper bond with the state to help the West maintain its geopolitical and economic dominance this century.\n\nNorway's sovereign wealth fund recently took a huge $US1.4 billion position in Palantir (significantly increasing its stake in the company).\n\nLoading YouTube content\n\nTesla and BYD shares\n\nThe Future Fund also piled into Tesla stocks in the second half of last year.\n\nIts purchases roughly coincided with the election of US President Donald Trump in November.\n\nTesla sales slump in US Photo shows Elon Musk stands infront of the smashed windows of a Cybertruck Elon Musk's electric vehicle company has also been targeted by vandals in recent months amid backlash to his embrace of far-right politics.\n\nBetween June and December, the value of the Future Fund's Tesla shareholdings jumped from $159.2 million to $472.7 million (+196 per cent).\n\nThat's nearly half a billion dollars.\n\nTesla's share price jumped by 104 per cent in those six months, and the Future Fund increased its shareholdings by 34.8 per cent (from 537,358 to 724,704 shares).\n\nBut we'll have to see what happens to those shareholdings when the Future Fund releases its next six-monthly investment update.\n\nTesla shares have plummeted 40 per cent in value this year, due partly to the global backlash against Tesla chief executive Elon Musk.\n\nBYD takes on Tesla with ultra-fast EV chargers Photo shows People stand around a car with all its doors open with a sign in beg letters on the wall behind reading BYD. Chinese electric vehicle manufacturer BYD has unveiled its ultra-fast charger that promises to take just five minutes to fully power EVs — putting heat on rival Tesla in the process.\n\nInterestingly, the Future Fund also owns shares in Tesla's rival, the Chinese car maker BYD, but its shareholdings in BYD are small in comparison.\n\nAnd the fortunes of BYD are tracking in the opposite direction of Tesla's right now.\n\nBYD generated $170 billion in revenue in 2024 (soaring past Tesla's annual revenue of $155.5 billion).\n\nIt reported a 73 per cent surge in net profit to a record $3.3 billion for the fourth quarter last year, and its share price is up 32 per cent this year.\n\nBetween June and December, the value of the Future Fund's BYD shareholdings rose from $10.6 million to $17.9 million (+69 per cent), and it bought 88,900 more shares.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/medication-shortage-continues-adhd-menopause/105133500",
        "title": "'Out of stock' prescription concerns for patients and providers",
        "publish_date": "Sun, 06 Apr 2025 01:15:34 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When Albany mother Shannon Roberts dropped off her children's scripts to her regular pharmacy, she was surprised to be told they were out of stock.\n\nAccessing prescriptions is becoming an issue for many Australians, due to ongoing supply shortages of multiple medications.\n\nMs Roberts's three children have ADHD and all require medication.\n\nShannon Roberts's home is decorated with positive affirmations. (ABC Great Southern: Andrew Chounding)\n\nThe shortage has been time-consuming and frustrating for everyone in the family.\n\n\"I put in all of our scripts to be filled five days before they were due [in January] and they couldn't be filled,\" Ms Roberts said.\n\n\" Since then it's been really awful. \"\n\nThe issue has been exacerbated by the fact that her children have experienced side effects from other ADHD medications which makes finding an alternative difficult.\n\nShannon Roberts tries to keep ahead of scripts ending, but that still doesn't help. (ABC Great Southern: Andrew Chounding)\n\n\"My eldest is now on her third medication change, my second eldest is waiting to be seen at a clinic in April,\" she said.\n\n\"My kids had horrendous side effects from Ritalin. The eldest lasted one week because we were so worried about her mental health.\"\n\nDrugs in short supply\n\nThe Therapeutic Goods Administration (TGA) has 400 medications listed as in short supply, including menopause hormone treatments and blood pressure medication.\n\nAnother of the drugs in short supply is Concerta, one of the most popular ADHD drugs.\n\n18mg, 27mg, 34mg and 54mg dosages are all listed as limited in supply.\n\nJane McLean is an Albany based pharmacist. (ABC Great Southern: Andrew Chounding)\n\nAlbany pharmacist Jane McLean said supplies had ebbed and flowed in recent years.\n\n\"Last year Vyvanse was in short supply most of the year. This year Concerta is in short supply,\" she said.\n\nMs McLean said in the \"last few years we've seen more out of stocks than what we've seen in the previous 10 to 15 years\".\n\nPharmacist Jane McLean said supply issues are affecting many medications. (ABC Great Southern: Andrew Chounding)\n\nRegulations surrounding ADHD medication mean scripts can only be filled five days in advance of your last supply running out to prevent stockpiling.\n\nADHD WA clinical advisory board chair Roger Paterson said it could take months to find the right medication and prescription for a child, adding to the stress for families.\n\n\"The bottom line seemed to be that demand was gradually outstripping supply … there is a shortage of supply around the world,\" he said.\n\n\"We are just experiencing it in our own way within the field of ADHD.\"\n\nAustralia at end of supply chain\n\nThe TGA said the Concerta supply shortage was likely to continue through to December this year.\n\nPharmacy Guild of Australia WA president Andrew Ngeow said the country was at \"the end of a very long and complex worldwide supply chain\".\n\nAndrew Ngeow says off-label prescription of Ozempic has driven the strong demand. (ABC Perth: Glyn Jones)\n\nMr Ngeow said Australia imported 90 per cent of the medication it prescribed and created 2 per cent of the world's demand.\n\n\"When there is a shortage we are the first to feel it and the last to get replenished,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/appin-coal-miners-injured-colliery-explosion/105143162",
        "title": "Miners 'buried' in coal following suspected pressure blast",
        "publish_date": "Sun, 06 Apr 2025 00:54:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Four miners have been taken to hospital after being buried waist deep by coal during an incident at a south-west Sydney mine overnight.\n\nAppin Mine operator, GM3, confirmed the incident took place early Sunday morning, sparking an emergency response and the halt of mining operations \"until further notice\".\n\nNSW Ambulance attended the colliery on Douglas Park Drive about 3am after reports four men were trapped up to their waist in coal.\n\nTwo men were taken to Wollongong Hospital and two were taken to Liverpool Hospital, each in a stable condition.\n\nMining and Energy Union district secretary Andy Davey said it was believed the incident was caused by a \"pressure bump\".\n\n\"Some coal was ejected, and some men were buried in the coal,\" Mr Davey said.\n\n\"Our ISHR [Industry Safety and Health Representative] officers are onsite as well as the NSW Resource Regulator and investigations are ongoing.\"\n\nThe NSW Resources Regulator has been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/live-updates-tim-tszyu-vs-joey-spencer-boxing-newcastle/105143032",
        "title": "Live:Tim Tszyu fights to revive his boxing career, Sam Goodman confirms next fight",
        "publish_date": "Sun, 06 Apr 2025 00:49:58 +0000",
        "category": "sports",
        "authors": [
            "Simon Smale"
        ],
        "text": "(No Limit Boxing/Gregg Porteous)\n\nHello boxing fans and welcome to what will be a pivotal day in the career of Tim Tszyu, as he fights Joey Spencer in Newcastle.\n\nBoxing is a sport that embraces hyperbole like no other, but make no mistake, this is a big one.\n\nComing off two straight defeats, Tszyu's career is very much on the line.\n\nA third-successive defeat will surely, certainly end his status as a fighter worthy of the biggest stages and world title shots on merit alone.\n\nA win though, well that offers a glimmer of hope for the 30-year-old Sydneysider that he will be able to challenge again on those big stages and prove that he remains a power to be reckoned with in Australian and global sport.\n\nMy name is Simon Smale, it is a pleasure above all pleasures to be here today to take you through all the action as it happens, and a thrill to have you joining me.\n\nAs ever, if you have a question just launch it at me using the button at the top of the page.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/us-golf-developmental-tour-ryan-mccormick/105143220",
        "title": "'Shut myself up': US golfer tapes his mouth to control emotional outbursts",
        "publish_date": "Sun, 06 Apr 2025 00:43:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "American golfer Ryan McCormick has endured a challenging time on the US developmental tour this year, so he decided to control his emotions by taping his mouth shut.\n\nMcCormick made the peculiar move at this week's tournament at The Landings Golf and Athletic Club in Savannah, Georgia.\n\n\"Been having not-so-fun times this year on the golf course. Pretty angry and mad,\" McCormick told the tour's social media channels.\n\n\"So I figured I've tried a lot of things, and I just figured I'd shut myself up. So I put tape over my mouth.\"\n\nDid it work?\n\nNot judged on his score. After opening with a 1-over 73, he posted a 72 in the second round and missed the cut.\n\nMcCormick, who had a year on the PGA Tour in 2024, said he tried other methods of improving his game, such as reading books and talking to people.\n\nBut nothing seems to work for the 33-year-old, who turned professional in 2014.\n\nMcCormick missed the cut in Savannah after reaching 36 holes on 1-over. (Getty Images: Mogie Adamchik)\n\n\"I've run out of ideas, and I thought about the tape thing a couple of weeks ago,\" McCormick said.\n\n\"So just unfortunately it came down to that today. I was hoping maybe it would help me. Can't say that it did or didn't.\"\n\nOne reason for the extraordinary move was McCormick said he did not want to create a negative experience for his playing partners.\n\n\"Having a tough time, and that was my solution today,\" he said.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/trump-claims-australia-bans-american-beef-imports-incorrect/105139686",
        "title": "Trump says Australia has banned American beef, but that is not true",
        "publish_date": "Sun, 06 Apr 2025 00:17:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "When explaining his decision to put 10 per cent tariffs on Australian imports, US President Donald Trump singled out beef.\n\n\"Australia bans — and they're wonderful people, and wonderful everything — but they ban American beef,\" he said.\n\n\"Yet we imported $[US]3 billion of Australian beef from them just last year alone. They won't take any of our beef.\"\n\nBut is the US president correct?\n\nThe Sizzler years\n\nGlobal Agritrends global meat trader and analyst Simon Quilty remembers trading imported US beef in the 1990s.\n\n\"It was a really small window to bring that beef in, normally around August, September when there was a price fall in America,\" he said.\n\n\"At the time we had topsides coming in and sold to a restaurant chain called Sizzler.\n\n\" It was less than 1,000 tonnes, but today I don't think we'd see any beef come to Australia from America because of the price differences. \"\n\nRemember Sizzler? In the 1990s US beef was coming to Australia to supply its restaurants. (ABC News)\n\nAustralia placed restrictions on importing fresh US beef in 2003, after the US experienced an outbreak of mad cow disease.\n\nAccording to Australian Bureau of Statistics (ABS), Australia has not imported beef from the United States since 2005.\n\nAustralia has not imported beef from the US since 2005. (Graphic: Landline/ABS)\n\nBorn, raised and slaughtered\n\nThe Australian Department of Agriculture has confirmed there is no ban on importing United States beef.\n\n\"Import conditions into Australia are currently available for beef products sourced from cattle born, raised and slaughtered in the United States (US),\" a department statement read.\n\nThis is how Trump's new tariffs were calculated Photo shows US President Donald Trump holds up a chart of \"reciprocal tariffs\" while speaking during a “Make America Wealthy Again” Wondering how Trump's new tariffs were calculated? It would be funny if it wasn't so serious.\n\n\"However, the US has not commenced trade under these terms and has requested to expand its access to include beef products sourced from cattle from Mexico and Canada and legally imported into the US for export to Australia.\n\n\"Australia's assessment for this additional US request is progressing.\"\n\nCattle Australia chief executive Chris Parker said Mr Trump's logic for the new tariff on Australian beef was flawed.\n\nHe said it failed to recognise that the US had had access to the Australian market since 2019, provided it could demonstrate its beef came from cattle born, raised and slaughtered in the US.\n\nOther countries allowed to export beef to Australia are Japan and New Zealand.\n\nPrice is not right\n\nMr Quilty said US beef was perhaps facing a \"quasi-ban\" from accessing the Australian market.\n\n\"This is all related to the requirements for biosecurity and in particular traceability of cattle,\" he said.\n\n\"The terminology at the moment is US beef is allowed here [Australia], but the concern is Canadian and Mexican cattle that go into America, are fed and slaughtered there — are those cattle traceable?\n\n\"That question has been on the table to America for several years and up until now, with the Trump administration stepping in, that question had not been addressed.\n\n\"But there's now an urgency and I think this will be addressed very quickly.\"\n\nMr Quilty said cattle traceability systems had improved across North America, but he doubted it would be viable to export US beef to Australia.\n\n\" I don't see us being swamped by American beef, in fact I'd say for the next five years, even if the US had open access, we'd see next to nothing coming out of America. \"\n\nIn 2024, Australia produced more beef than ever before, turning off 2.57 million tonnes of beef, of which a record 1.34 million tonnes was exported around the world.\n\nWatch ABC TV's Landline at 12:30pm on Sunday or on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/golf-cam-davis-hypnotherapy-ahead-of-masters-augusta-national/105143134",
        "title": "Aussie Masters hopeful using hypnotic approach in bid to to avoid 'choker's mentality'",
        "publish_date": "Sat, 05 Apr 2025 23:50:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "Cam Davis desperately wants to perform at the Masters, but has lent on his hypnotherapy sessions to understand it will be best not to think that way at Augusta National.\n\nDavis is the first PGA Tour member to add a hypnotherapist to his support team.\n\nThe two-time PGA Tour winner's form has faded but he fancies his chances when he tees up among five contending Australians at the Masters from Thursday.\n\n\"Setting a goal to play well at an event, or place a certain position, or keep my card leads to more pressure because you don't want to let yourself down,\" Davis said.\n\n\"There are people that those goals fire them up, pump them up and it's a great way to be.\n\n\"But for me there's been history of not wanting to let myself down, rather than get after it.\n\n\"Some call it more of a 'choker's mentality', but for me it's being able to put myself in a place where I can play my best golf.\"\n\nDavis said his hypnotherapy sessions, initially a suggestion from his wife, were designed to find answers \"without the conscious mind trying to change it\".\n\nDavis is among five Australians contesting the Masters. (AAP: Jono Searle)\n\n\"It starts off with a goal, something you want to improve and then it's a guided meditation: no tricks or anything,\" he said.\n\n\"In that state I've found out things I didn't want to know, or didn't realise were causing blockages, to improve.\n\n\"But not just golf, how content I am in life in general.\n\n\"It's an eye-opening experience and I'm still unpacking stuff.\"\n\nLee holds nerve to claim Houston Open Photo shows Min Woo Lee holds the Houston Open trophy. After leading by a stroke heading into the final hole, Australia's Min Woo Lee breaks through for his first PGA Tour victory following a tense finish at the Houston Open.\n\nDavis had only worked with his hypnotherapist for a fortnight before winning in Detroit last year, a triumph that followed missing the cut at the US Open.\n\nHe will enter the year's first major on the back of five missed cuts mixed with three top-18 finishes, including a fifth place at Pebble Beach.\n\n\"I'm more in the camp of doing the little things well and let the big things happen,\" Davis said.\n\n\"I'd love to win and every guy out here wants to win a major. I've kind of been in contention, but I'd love to experience what it's like to hit the shots required to win the thing.\n\n\"I'm trying to get better and better every year and part of that is doing well in the majors.\n\n\"But I've figured out the goals that work best for me are not goals where I'm comparing myself to other people.\n\n\"That, finishing second but playing well, would feel like a failure to me.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/honouring-loved-ones-with-diy-headstones/105053644",
        "title": "Luke has honoured his late father with a headstone he made himself",
        "publish_date": "Sat, 05 Apr 2025 23:16:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Luke Parsons never had the chance to meet his dad.\n\nThe 25-year-old Wiradjuri man's father died two months before he was born.\n\n\"Hearing all of his stories growing up, it pushed me to be a better person and show his story,\" said Mr Parsons, who lives in Cowra in the NSW Central West.\n\nRecently, he has been able to honour his dad's final resting place with a headstone he has made himself.\n\n\"I came across this design on my phone and it sort of spoke his name, so putting that onto the plaque is pretty meaningful,\" Mr Parsons said.\n\n\"I've been speaking to my older brother and sisters. They love it.\n\n\"The fact that something's actually getting done about it.\"\n\nHeadstone healing Photo shows An Aboriginal woman standing among a group of colourful graves with mosaic headstones. An Aboriginal community in far west New South Wales works through grief for lost loved ones with a hands-on project using the art of mosaic.\n\nMr Parsons enrolled in a four-week course at TAFE NSW teaching people concreting skills to make headstones.\n\nHe has learnt how to make his own moulds, place and pour concrete, cure it and finish the surface.\n\nHe was also taught how to finish the base of the headstone so that the image sticks out from the surface like braille.\n\n\"By everyone doing their own design, it's telling their own stories,\" Mr Parsons said.\n\nMr Parsons is making a memorial that represents his father's life. (ABC Central West: Toby Hemmings)\n\nTAFE NSW head teacher of construction trades Mark Penman said the idea for the course came about when he noticed how many unmarked graves there were in rural or remote cemeteries across the region.\n\n\"Best case scenario, there was a little white timber cross on the grave but due to weather events, these are destroyed or eroded over time,\" Mr Penman said.\n\n\" The costs of buying a headstone are really high and out of reach for people in these communities. \"\n\nCowra cemetery has a number of graves without a permanent memorial. (ABC Central West: Toby Hemmings)\n\nHonouring a life\n\nThe course has been held in western New South Wales communities such as Collarenabri, Lightning Ridge and Brewarrina, and most of the participants have been Aboriginal people.\n\nAt the latest session, held recently in Cowra, students spent a day at the local cemetery to get a sense of how many graves lacked a permanent monument.\n\nDella Williams and her sister were among the 15 participants and were making headstones for their parents, who died more than 30 years ago.\n\n\"We lost count of how many graves need [a headstone]. Quite a few up there,\" Ms Williams said.\n\nShe said the cost of buying a headstone could range from several hundred to several thousand dollars and that meant the more permanent memorials had previously been beyond the budget of many grieving families.\n\n\"The community can't afford these things, so we can go out and make it ourselves. It works out easier for us.\n\n\"We can continue on with this, make some more for the rest of the community that really needs it.\n\n\"We made our own crosses but the rain damages that, so these will be more secure.\"\n\nIndenting butterflies into the corners is a way of personalising the tombstone. (ABC Central West: Toby Hemmings)\n\nCareer potential\n\nParticipants in the course also receive their white card upon completion, potentially unlocking a further career in the local construction industry.\n\nThe induction certificate recognises individuals who have completed the safety training needed to work on construction sites.\n\nMr Penman said the nature of the course appealed to people who might never have considered vocational training before.\n\nStudents can personalise and style the headstones they make however they like. (Supplied: Hayden Ellis)\n\n\"It can be extremely sensitive and personal to people,\" he said.\n\n\"Having that buy-in and really hoping to have a quality finished product at the end of it really provides motivation.\n\n\"To think that this could also be a pathway into a full qualification would also be a great outcome.\"\n\nSo far, the course has been run in communities across the north and far west of the state, and there are plans to head to Lake Cargelligo later this year.\n\nIn Cowra, the Local Aboriginal Land Council intends to continue to make headstones for the community after the course is finished.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/why-do-school-holidays-differ-by-state-territory/105131840",
        "title": "School holidays can be confusing. Here's why they vary across the country",
        "publish_date": "Sat, 05 Apr 2025 23:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Like many families, we pack up the kids every Easter and head away to enjoy the school holidays and cooler autumn weather.\n\nGood Friday marks the start of our annual week-long holiday. This usually works perfectly, being the start or middle of Queensland school holidays, except for this year.\n\nIn 2025 it falls on the final weekend of school holidays in both Queensland and Victoria, a move that's been dubbed \"a bit strange\" by some tourism providers and parents alike.\n\nABC Lifestyle Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nIn New South Wales, the ACT, South Australia, Tasmania and Western Australia, the Easter long weekend will be part-way through their school holidays.\n\nWhile kids in the Northern Territory will already be back in the classroom before Easter after a one-week break.\n\nSo why do school holidays differ in states and territories? And what challenges does it create?\n\nWhy school holidays aren't the same\n\nEach state and territory education department is responsible for its holidays \"because they're all responsible for their own education\", according to Dr Rebecca English.\n\nShe's a former teacher and education researcher at the Queensland University of Technology on Turrbal and Yugara lands.\n\nDr Rebecca English is a lecturer at QUT and a former teacher. (Supplied)\n\n\"The curriculum (except for NSW who do their own thing) is set at national level through the Australian Curriculum Assessment and Reporting Authority,\" she says.\n\n\"But each state is responsible, through various mechanisms, for implementing the curriculum.\n\n\"So, they can modify and alter things … and holidays seem to be a natural extension of that.\"\n\nWe asked each state and territory education department how they decide the dates for school terms and holidays.\n\nThere were some commonalities.\n\nThey all set the dates three to five years in advance.\n\nThey all consult with other sectors, such as Catholic education, independent schools and, where possible, other Australian jurisdictions.\n\nAnd they try to have consistent term lengths and examination periods each year.\n\nIn Queensland, term dates are set approximately three years ahead.\n\n\"To help schools, school communities, and the public with long-term planning,\" an Education Queensland spokesperson says.\n\n\"Each element is carefully considered to ensure a well-structured and balanced school calendar.\"\n\nThe general pattern is 190-200 school days per year for government schools. (ABC News: Steve Keen )\n\nThe South Australia Department for Education told us that setting holiday dates takes in a number of considerations.\n\n\"Such as, 40 weeks of instruction time for the year, divided into four terms of equal length, with two weeks of holiday between them,\" a spokesperson says.\n\n\"The Easter holiday period is normally taken into account, depending on where it falls.\n\n\"The Christmas holiday extends until the first non-public holiday after Australia Day, if possible.\"\n\nThe number of working days for teachers also needs to be consistent with the relevant industrial agreements, which may be different for each state or territory.\n\nWhile there is a general pattern of 190-200 school days per year for government schools, public holidays create their own localised interruptions.\n\n\"The other issue, of course, is with different public holidays in different states,\" Dr English says.\n\n\"I think all of it depends on so many different factors and each state and territory would be in the same boat.\"\n\nPrivate school holidays different again\n\nPaul Kidson, a senior lecturer in educational leadership, Australian Catholic University, says there is the added complexity of private and independent school holidays, which can also differ within states and territories.\n\n\"In the early days of these schools, they needed an earlier finishing date so rural students could return home.\n\n\"And the tradition has stuck.\"\n\nHow do mismatched school holidays affect your family, friendships and travel? We'd love to hear. Email lifestyle@abc.net.au\n\nSeasonal factors when determining holidays\n\nWhere you live in Australia can also have an impact on the length of school holidays.\n\nThe Northern Territory has a longer mid-year break (three weeks) during the northern dry season to allow Territorians to take advantage of milder weather conditions.\n\nChairman of Queensland Tourism Industry Council Shane O'Reilly says having the Easter long weekend at the end of the school holidays is strange. (Supplied)\n\nWhere school holidays fall in a calendar year can also have an impact on tourism providers, according to Shane O'Reilly, chairman of Queensland Tourism Industry Council.\n\nMr O'Reilly also manages a rainforest retreat on Yugambeh lands at the edge of Lamington National Park on the Scenic Rim.\n\n\"I do remember when Easter was at the end of the holidays many years ago, and it was a bit of a quieter school holidays than normal,\" he says.\n\nSkipping school for holidays Photo shows Sam Cardone (second from right) with her family at the Colosseum in Rome. Sam Cardone hasn't had a problem taking her children on short trips during the school term. She says they're better off for the experience.\n\n\" So, it's better when it's sort of near the beginning or in the middle at least but having it right at the very end is a bit strange. \"\n\nThe New South Wales education department told us that the timing of Easter \"should not determine the end of Term 1 vacation\".\n\n\"If Easter falls outside the school vacation period, it should be observed as a separate four-day holiday,” a spokesperson said.\n\nIf you're like me and your kids will miss a bit of school after Easter for holidays or to visit family and friends, Dr English says not to worry.\n\n\"They will learn so much more from being away with their family on holidays,\" she says.\n\n\"You all are doing important stuff like building relationships, negotiating where you're going to go, working together as a family.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/world-cup-canada-snowboard-cross-mia-clift/105143034",
        "title": "Aussie snowboarder Clift makes World Cup podium",
        "publish_date": "Sat, 05 Apr 2025 22:30:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Mia Clift has claimed a silver medal in the women's snowboard cross at the World Cup event held in Mont St Anne, Canada.\n\nClift secured second place behind France's Léa Casta in the big final via a photo finish, with Swiss Sina Siegenthaler placing third.\n\nIt was Clift's first World Cup medal of her career.\n\nThe result came a week after Clift took silver alongside fellow Australian Cameron Bolton in the snowboard cross mixed team final at the World Championships in St Moritz, Switzerland.\n\n\"It was such a fun day overall. I actually felt super chilled throughout the whole day which was nice,\" Clift said.\n\n\"Getting to race the big final with Lea, Sina and Aline [Albrecht] was fun and [we] really pushed each other all the way down.\"\n\nFellow Australian Josie Baff finished ninth.\n\nBaff is fourth on the overall World Cup standings (424 points), with Clift in ninth position on 282 points.\n\nCasta (705) sits in top spot on the standings.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/coalition-to-cap-international-students-240000/105142968",
        "title": "Coalition vows to limit international student enrolments to 240,000 a year",
        "publish_date": "Sat, 05 Apr 2025 22:25:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Peter Dutton has pledged to limit the number of international students able to start study in Australia each year at 240,000, after opposing Labor's attempts to pass legislation to cap enrolments last year.\n\nIf elected, the Coalition would also mandate that no more than about a quarter of students at public universities are enrolled from overseas from next year — a move that would not impact private universities and vocational providers.\n\nBoth major parties have so far focused on international students, who make up roughly half of all temporary migrants, as their main mechanism to bring migration rates back to pre-pandemic levels.\n\nUnder the Coalition's cap, public universities will be able to enrol no more than 115,000 international students a year, while private and non-university higher education facilities will be permitted to enrol up to 125,000.\n\nThe total cap is 30,000 less than the figure Labor proposed when it tried to pass legislation that would grant the education minister the power to limit student numbers during the last term of parliament.\n\nIn November the Coalition joined with the Greens to oppose the bill, describing it at the time as \"chaotic and confused\".\n\nAbout 315,000 new overseas students commenced study in the higher education and vocational sectors last year, according to indicative data from the Department of Education.\n\nThe opposition on Sunday said its policy would primarily impact the metropolitan Group of Eight universities, which are some of Australia's largest and most prestigious institutions.\n\nLoading...\n\nInternational students currently make up more than 25 per cent of the student bodies of most Group of Eight universities — which includes the University of Sydney, the University of Melbourne, and the Australian National University.\n\nUnder the proposed plan, the student visa application fee will also be increased to $5,000 for overseas students at Group of Eight institutions, while all other students would be charged half that.\n\nIn addition, a new $2,500 fee would be imposed on students who seek to change education providers.\n\n\"Our lower cap … will be very much focused on driving a housing availability and affordability particularly in Melbourne and Sydney,\" Coalition education spokesperson Sarah Henderson told reporters at a housing development.\n\n\"That's where the excessive numbers of students are and that is where we are focused.\"\n\nUniversities Australia — which represents Australia's 39 public universities — said the Coalition's plan to slash international student enrolments amounted to taking a \"sledgehammer to one of the nation's biggest income generators\".\n\n\"International students contribute over $50 billion to the economy and support more than 250,000 jobs across the country,\" chief executive Luke Sheehy said on Sunday.\n\n\"Every dollar from international students is reinvested into the university system. Reducing that income stream will mean less support for Australian students, fewer research breakthroughs and fewer opportunities to grow the skills our economy needs.\"\n\nInternational students blamed for rental crisis\n\nThe opposition leader told reporters at a housing development on Melbourne's outskirts that it was necessary to reduce the number of international students coming into the country to free up homes for young Australians.\n\n\"When you look at the price of the cost of rents over the last couple of years, they've skyrocketed under this government,\" he said.\n\nMore uncertainty on the cards for international students Photo shows A man in graduation outfit. The past year has seen the international education sector thrown into turmoil, as Labor targeted students in their plan to drive down migration. That uncertainty is set to continue into 2025.\n\n\"I want to make sure that we can get young Australians into houses. That's really our main priority here.\"\n\nA University of South Australia study this year found there was no link between the number of international students and the cost of rent.\n\nMr Sheehy, from Universities Australia, warned against making international students scapegoats for the housing crisis.\n\n“Students make up less than 6 per cent of the national rental market. The real solution is more homes, not fewer students,\" he said.\n\n“We urge all parties to base policy on facts, not finger pointing.\"\n\nIn the absence of legislated caps, the government has so far sought to manage international student numbers through regulatory means.\n\nIn December the government replaced a controversial ruling known as Ministerial Direction 107 that forced immigration officials to prioritise applications for people with offers from institutions considered lower risk.\n\nIn practice, it meant sandstone universities that typically attract the highest quality candidates got priority treatment, while smaller regional universities missed out.\n\nThe new direction — Ministerial Direction 111 — allows each institution to access the priority application stream until they reach 80 per cent of a personalised international student \"allocation\".\n\nForeign Minister Penny Wong told Insiders on Sunday that Labor would proceed with its existing policy to bring down international student numbers.\n\n\"We have put in place policies that seek to manage better the number of foreign students coming into Australia. He [Mr Dutton] opposed that,\" she said.\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/daniel-mcmahon-child-sexual-abuse-catholic-church-tasmania/104919270",
        "title": "'Mind-boggling': Abuse victim reported priest but he was never defrocked",
        "publish_date": "Sat, 05 Apr 2025 22:12:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Peter Cotton was in his first weeks at a Catholic boarding school in Perth in the 1960s when he was sexually abused by his class teacher.\n\nThat teacher was then-Christian Brother Daniel McMahon.\n\nWARNING: This story deals with trauma and child sexual abuse.\n\nLater, in 2002, Mr Cotton found out McMahon had moved to Tasmania in the 1990s to become a priest, and he was compelled to act.\n\nMr Cotton made a complaint about McMahon to the Archdiocese of Hobart, hoping he would be removed as a priest.\n\n\"I had a 12-year-old son at the time and that's what triggered me — action needed to be taken,\" he said.\n\n\" I'd sat on this McMahon information for decades at that stage, and I had good reason to act … and pursue a complaint to its end, which I hoped would be McMahon being defrocked. \"\n\nBut McMahon remained a priest until the day he died in 2012.\n\nPeter Cotton when he was a schoolboy in Perth, WA. (Supplied: Peter Cotton)\n\nLetters reveal archdiocese discussing McMahon\n\nA former journalist, Mr Cotton used his research and interviewing skills to write a manuscript about his own experiences and those of other victim-survivors who he contacted.\n\nHe also interviewed church figures and McMahon himself.\n\nFor Mr Cotton, it was never about getting a book published, but about putting all the information together so it could be shared with others.\n\nHe said letters he acquired indicated \"how complicit the Archdiocese of Hobart was in maintaining McMahon as a priest within their archdiocese\".\n\n\"The Archdiocese of Hobart claimed [to me that McMahon] was put out to pasture 18 months after my complaint.\n\n\"Letters I acquired as part of the writing of the book indicated that was anything but the truth,\" Mr Cotton said.\n\nDaniel McMahon was a Christian Brother in WA and SA before moving back to Tasmania where he became a priest. (ABC News: Hugh Sando)\n\nIn a letter from then-Christian Brothers province leader Kevin Ryan to Archbishop Adrian Doyle dated November 6, 2006, Brother Ryan wrote:\n\n\"We believe you would be making a very wise decision if you fully withdraw Fr Daniel [McMahon] from ministry.\"\n\nBrother Ryan then offered to meet with McMahon, Archbishop Doyle and the then-vicar-general to discuss the allegations.\n\nAhead of the December 19, 2006 meeting, Archbishop Doyle wrote to Brother Ryan that the meeting \"would be very valuable\".\n\n\"It would also assist in conveying the decision that his public priestly ministry come to an end\".\n\nFormer Archbishop of Hobart Adrian Doyle wrote to the former head of the Christian Brothers in Perth about Daniel McMahon several times. (Simon Frazer: ABC News)\n\nAt some point after Mr Cotton's complaint was received, McMahon was removed from the role of parish priest — someone who is responsible for a particular location and celebrates mass in that parish regularly.\n\nBut he was never stopped from practising as a priest altogether.\n\nHe became a relief priest, filling in when other priests were on holidays or ill.\n\n\"That continued pretty much through the years until his death in 2012. Parishioners were not informed as to his history,\" Mr Cotton said.\n\n\" To let him into parishes in they way they did was mind-bogglingly bad and stupid practice. \"\n\nAllegations from the 1950-1990s\n\nMcMahon was moved around various Christian Brothers schools in Western Australia and South Australia before he returned to his home state of Tasmania to become a priest.\n\nLawyer Judy Courtin's firm represents 10 McMahon victim-survivors.\n\nJudy Courtin says McMahon's victims could number in the hundreds. (ABC News: Peter Healy)\n\n\"McMahon was raping and sexually assaulting children over a period of 35 to 40 years. He started in Tasmania in the 50s, when he was still training to be a Christian Brother,\" Dr Courtin said.\n\n\"He was still raping and sexually assaulting children in the 90s when he returned to Tasmania.\"\n\nShe said he was moved every one to two years while he was a Christian Brother.\n\nDr Courtin estimated there could be 200 or more victims of McMahon, \"because we know that only about 5 per cent of boys who are sexually assaulted by Catholic clergy will ever report to the police\".\n\n'Abuse allowed to continue'\n\nA West Australian parliamentary committee heard evidence about McMahon as part of its inquiry into the options available to survivors of institutional child sexual abuse in WA who are seeking justice.\n\nIn its report from 2023, the Community Development and Justice Standing Committee said it understood McMahon \"abused children at every school he attended\".\n\n\"Despite knowledge of the abuse by at least the 1990s, Father McMahon's abuse was allowed to continue,\" the report said.\n\nThe committee also said it received evidence that \"the Archdiocese [of Hobart] allowed Father McMahon to continue as an active priest until his death in 2012\".\n\nA Western Australian parliamentary inquiry said it understood McMahon had \"abused children at every school he attended\". (ABC News: Loretta Lohberger)\n\nIt said \"credible evidence\" from Mr Cotton included that 24 men had come forward alleging assault by McMahon, \"including one from Tasmania when he was a priest\".\n\nThe committee also received evidence that the Christian Brothers had been paying compensation to victims of McMahon \"since at least the early 2000s\".\n\nThe Trustees of the Christian Brothers made a compensation payment to Mr Cotton in 2019 for the abuse he experienced while a student at Aquinas College.\n\nPeter Cotton made a successful claim for compensation for abuse he experienced as a child. (Supplied: Peter Cotton)\n\n'They run the risk of this all happening again'\n\nMr Cotton said while his contact with the Archdiocese of Hobart through his research had been \"cordial and professional\" he was concerned the archdiocese \"don't seem to have learnt from the experience of McMahon\".\n\n\"The Archdiocese of Hobart should own up to this situation. If they're not prepared to look into it seriously and make some admissions, they run the risk of this all happening again,\" he said.\n\n\"There should be a judicial inquiry looking into the way they dealt with my complaint and the complaints that followed, and what they did about McMahon, and how they used him, continued to use him as a [relief] priest despite these credible claims against him,\" he said.\n\nMr Cotton said he would also like to see the archdiocese publish a notice about McMahon that would invite others to come forward to make a complaint or seek support.\n\nPeter Cotton would like to see a judicial inquiry set up to look at how the Archdiocese of Hobart dealt with his complaint, and the complaints that followed. (ABC News: Matthew Holmes)\n\nNo comment from archbishops\n\nThe ABC asked the Archdiocese of Hobart for interviews with both Archbishop Doyle and the current Archbishop of Hobart, Julian Porteous, and gave an outline of what the interviews would cover.\n\nA spokesperson declined both interviews, saying:\n\n\" For reasons of confidentiality the Archdiocese of Hobart does not publicly comment on individual matters. \"\n\nThe ABC then went back to the archdiocese with specific questions for both archbishops, which included how the McMahon matter was handled at the time and what, if anything, had been learnt from it.\n\nNeither archbishop responded to any of the questions.\n\nLeah Bromfield says transparency is \"really, really important\" for victim-survivors of child sexual abuse. (Supplied: Australian Centre for Child Protection)\n\nThe director of the Australian Centre for Child Protection at the University of South Australia, Professor Leah Bromfield, said it was \"so important\" that institutions acknowledge and be transparent about their past mistakes.\n\n\"For victim-survivors that's about being seen, that's about an organisation demonstrating that they actually learned and that children in the future will be safer,\" Dr Bromfield said.\n\nDr Bromfield said institutions needed to do more than say sorry, they needed to \"act sorry\".\n\n\"And part of acting sorry when it comes to child sexual abuse is acknowledging your past, is being transparent,\" she said.\n\nThe WA parliamentary inquiry also wrote of the importance of transparency:\n\n\"Institutions that maintain an unholy wall of silence can only be doing so as a strategy to limit their financial liability rather than providing just outcomes for victim/survivors. Transparency would be a game-changer,\" its report said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/federal-election-2025-live-updates-albanese-dutton-campaign/105142980",
        "title": "Live: Coalition details international student cuts as Labor targets Queensland",
        "publish_date": "Sat, 05 Apr 2025 21:55:26 +0000",
        "category": "finance",
        "authors": [
            "Elissa Steedman",
            "Stephanie Dalzell",
            "On The Trail With Albanese",
            "Andrew Thorpe",
            "Jake Evans",
            "On The Trail With Dutton"
        ],
        "text": "Foreign Minister Penny Wong is up next on Insiders.\n\nDavid Speers begins the interview by lobbing her some softball questions about China and regional strategic concerns, whether Donald Trump is making Australia less safe, and whether or not the rules-based international order still exists.\n\n(I am, of course, being sarcastic. I'm also sympathetic to the view that it's a bit early in the day to be grappling with this kind of thing, but that's par for the course on the Sunday morning shows, I guess.)\n\nWong acknowledges that \"we live in changing times\", and says that's why it's important to have a leader \"who makes the right calls\".\n\n\"What we did see this week, and what Australians saw, is that Peter Dutton's stubborn, he's arrogant, always believes he knows best, and the problem is that leads him to make bad calls,\" she says. \"You see that in his stubborn insistence on a deal with President Trump at whatever cost, you see that in a reckless and risky linking of defence into this trade dispute.\"\n\nThe foreign ministersays the US is currently playing a \"very different role in the world and the global economy\", but stresses that Australia still has \"agency\" to engage with other countries and diversify its economic relationships.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/indigenous-home-ownership-palm-island-rent-to-buy/105095344",
        "title": "How a rent-to-buy scheme will allow Leon to own his home of 49 years",
        "publish_date": "Sat, 05 Apr 2025 21:35:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Leon Coutts has lived in the same three-bedroom home his entire life.\n\n\"There's a lot of memories — its Christmases, its birthdays,\" the Bwgcolman man said.\n\n\"I could never imagine living anywhere else.\"\n\nThe 49-year-old carpenter's father moved into the house on north Queensland's Palm Island in the late 1970s.\n\nBut the family never had the option to purchase their own home.\n\nOf the island's 480 properties only one is privately owned.\n\nEveryone else lives in state-run social housing.\n\nLeon Coutts has lived in the same Palm Island home his whole life. (Supplied)\n\nHome ownership has been a longstanding issue in Aboriginal communities.\n\nJust 38 per cent of Aboriginal and Torres Strait Islander households in Queensland own their own homes, compared to the state's overall home ownership rate of 64 per cent.\n\nIn discrete communities the number is just 5.3 per cent.\n\nBut on Palm Island a life-changing new housing model is set to fix that gaping chasm.\n\nRent-to-buy\n\nThe scheme will allow residents to purchase their Department of Housing social home by entering a rent-to-buy agreement with the Palm Island Aboriginal Shire Council.\n\nCouncil CEO Michael Bissell said homes will be valued between $50,000 to more than $100,000 in an arrangement signed off between the local and state government.\n\n\"[Residents] don't need a lump sum up front to be able to buy. Essentially, instead of paying rent to [the Department of] Housing you're paying a mortgage to the land trust,\" Mr Bissell said.\n\n\" You can tailor the time frame of your mortgage to ensure that you pay a similar or lesser amount [as] you will also be responsible for paying insurance, undertaking your own maintenance, paying rates and utilities to council. \"\n\nThe rent-to-buy scheme will allow people to take over the ownership of their social homes. (ABC News: Baz Ruddick)\n\nOnce a home is paid off a resident will own the property on a 99-year lease.\n\nThe council believes between 30 and 50 families will \"immediately\" sign up to the scheme, with 100 households expected to join in the first year.\n\nOver the next decade, 300 homes — more than 60 per cent of the island's housing stock — are anticipated to move into private hands.\n\n\"Being able to buy your own home is a real dream. It underpins your family's prosperity and your family's future, and can be used for equity in other things,\" Mr Bissell said.\n\n\"The position of the community in some regards was that we've been paying for these houses for decades because they are family homes that get passed down.\"\n\nThe council said the scheme would be up and running in the coming months.\n\nAchieving a dream\n\nHome ownership has not been an option for Palm Island residents until now. (ABC News: Baz Ruddick)\n\nPalm Island Mayor Alf Lacey said campaigning for home ownership had been a decades-long effort.\n\n\"I'm very pleased that I'm able to see it in my lifetime,\" Cr Lacey said.\n\n\" The next generation will have good stability rather than renting for the rest of their lives like we've done. \"\n\nHe praised the Queensland government for supporting the rent-to-buy scheme which he said was the best model for his community of roughly 2,200 people.\n\nThe council said Palm Island would be used as a trial site for other discrete Aboriginal communities.\n\nMayor Alf Lacey says home ownership has been an ambition of Palm Island residents for generations. (ABC News: Baz Ruddick)\n\n\"We'll be flying the flag for the rest of the 16 First Nations communities in Queensland to achieve one of the most important dreams that all Australians aspire to,\" Cr Lacey said.\n\nMr Bissell said the home ownership scheme would give residents autonomy by allowing them to make modifications to improve their quality of life.\n\n\"They don't want to have to constantly go to the Department of Housing to say, can you please put a rangehood in my kitchen? Can you please put a vent in my bathroom because it's full of mould?\" he said.\n\n\" This gives you the ability to control your own life, which is all anybody really wants. \"\n\n'It's your heart'\n\nNo new homes have been built on Palm Island for more than a decade.\n\nThe council said it was in the process of developing more than $17 million worth of new houses and units to meet community demand.\n\nLeon Coutts will be among the first to sign up to Palm Island's new home ownership scheme. (Supplied)\n\nOnce the rent-to-buy scheme formally begins Leon Coutts will be the first in line to sign up.\n\n\"All I really wanted is to own this house,\" he said.\n\n\"Words can't really explain it. It's every day you live, every time you come home. It's your heart.\n\n\"I've got nieces and nephews now, and [I'll] pass it down to them.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-06/chinese-australian-voters-reveal-what-issues-they-care-about/105068810",
        "title": "Chinese-Australian voters reveal key issues ahead of federal election",
        "publish_date": "Sat, 05 Apr 2025 21:15:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Read the story in Chinese\n\nWith a looming federal election, it's no surprise the major parties are paying close attention to the Chinese-Australian vote.\n\nAt the last election, the swing against the Liberals in electorates with a high concentration of Chinese Australians was almost twice that of other seats.\n\nAs polling day approaches, there's one part of the nation attracting particular attention.\n\nFor the first time this year, the Menzies electorate in Victoria has the most Chinese-Australian voters, followed by the neighbouring seat of Chisholm, after electoral boundaries were redrawn.\n\nThe redistribution shifted most of the suburb of Box Hill, which has a high Chinese-Australian population, from Chisholm into Menzies.\n\n\"There is this idea that whatever happens in outer eastern Melbourne dictates what happens to the whole country,\" said Jill Sheppard, a political scientist from the Australian National University.\n\nDr Sheppard said the redistribution made both seats more marginal and puts more of \"a national spotlight\" on the electorates.\n\nIn light of the changes, the ABC visited Menzies and Chisholm to find out what issues Chinese-Australian voters care about.\n\nCost of living key issue\n\nLinda Bekesi says cost of living and the quality of childcare are some issues she is most concerned about. (ABC News: Lachlan Bennett)\n\nChinese-Australian Linda Bekesi — who has lived in Box Hill South for five years — was in the Chisholm electorate but thanks to the redistribution is now a first-time voter in Menzies.\n\nDespite being in a new electorate, the issues Mrs Bekesi cares about haven't changed.\n\nThe mother-of-two cited the cost of living, the cost and quality of childcare, and security — including protection of personal data — as things that matter to her the most.\n\nInstead of short-term fixes, Mrs Bekesi wants the government to come up with a long-term plan to address the cost-of-living crisis.\n\n\"We've been having this cost-of-living crisis for some time now, so it's not really getting resolved in my view,\" she said.\n\nMrs Beksei, who spoke with the ABC for this story before Four Corners revealed failures and systemic issues in Australia's childcare sector, said she was not happy with the quality of the care her child had received.\n\nShe's pulled her child out of one centre because it \"wasn't a good fit\" and wants childcare practices across the board to be reviewed.\n\n\"So that they're actually meeting the needs of our children … not just working for the bottom profit line,\" she explained.\n\nVoters 'care deeply' about Australia-China relations\n\nRui Gu lives in Chisholm and wants Australia to have a good relationship with China. (ABC News: Kai Feng)\n\nIn more than 15 interviews the ABC did with voters in Menzies and Chisholm, the cost of living, housing affordability and community safety were raised as key issues.\n\nWhile Chinese Australians were also concerned about education, health and aged care, Sino-Australia relations was also a significant issue for voters, said Luxin Liu, a Chinese-Australian community political commentator.\n\n\"Many first-generation migrants also care deeply about Australia's relationship with China,\" Dr Liu said.\n\nSuch is the case for Rui Gu, who migrated to Australia from China 30 years ago and lives in Chisholm.\n\n\"For a lot of Chinese Australians, Australia is our second home, but China was our motherland, so we'd like to see Australia and China develop a friendship,\" said Mr Gu.\n\nLiu Luxin says the major parties are being careful with messaging to Chinese-Australian voters. (Supplied)\n\nMr Gu said if the bilateral relationship was good, it benefited Chinese Australians who work in business, education, tourism and trade sectors here.\n\n\"There's an old Chinese saying — being harmonious but maintaining differences,\" he said.\n\n\"Politics shouldn't get in the way of trade. We shouldn't shut the doors to business just because of political differences.\"\n\nDr Liu said both major parties were being more careful this time around with messaging to Chinese-Australian voters after the 2022 federal election results.\n\nJill Sheppard says Chinese-Australian voters may not take the parties on face value. (Supplied)\n\nIn the last election, in the top 15 seats with Chinese-Australian voters, the swing on a two-party-preferred basis was 6.6 per cent toward Labor, compared to 3.7 per cent in other seats, Liberal Party analysis found.\n\n\"I think it is really important to remember just how willing Chinese-Australian voters are to punish candidates in governments that they don't feel are talking to them,\" Dr Sheppard said.\n\n\"What's a particular challenge with Chinese-Australian voters is that they're not willing necessarily to take the parties on face value.\"\n\nRedistribution could impact results\n\nAlbanese and Dutton shake hands at LNY celebration in Box Hill. (Supplied: ABAW)\n\nIt's a point not lost on Anthony Albanese and Peter Dutton, who both visited Box Hill during Lunar New Year celebration events at the beginning of the year.\n\nShaking hands and smiling for local Chinese media, both leaders promised more financial support to the community's cultural events.\n\nLiberal MP Keith Wolahan won the seat of Menzies with a 0.7 per cent margin at the 2022 election, but because of the redistribution Menzies is now a notional Labor seat, according to ABC election analyst Antony Green.\n\nOne in four voters in Menzies are new to the electorate, Mr Wolahan said.\n\n\"The challenge for incumbents like me is that, although we like to think we've worked hard over three years, for a quarter of the electorate, they don't know you,\" he said.\n\nAustralian politicians take to Chinese social media Photo shows Collage of Australian politicians on Red. Of Red's 150 million active users, almost 700,000 are based in Australia. That presents both opportunities and risks for Australian politicians.\n\nGabriel Ng is the Labor candidate for Menzies, and it's his first tilt at politics.\n\n\"I think with any first-time candidate, there are some nerves, but I'm being well supported,\" he said.\n\nIn Chisholm, the redistribution has improved the Liberals' chance of defeating Labor, predicted Antony Green.\n\nBut Labor incumbent Carina Garland isn't paying too much attention to pre-election number crunching.\n\n\"If the analysts were all correct last time, I wouldn't be sitting here talking to you as the member for Chisholm, yet here we are,\" Ms Garland said.\n\nLiberals' candidate for Chisholm, Katie Allen, said there has been \"a change in mood\" in Chisholm.\n\n\"The question is just how much,\" Dr Allen said.\n\nRead the story in Chinese: 阅读中文版",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/comedy/melbourne-international-comedy-festival-2025-reviews-2-20250402-p5loi1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What’s good (and what’s great) at this year’s comedy festival so far",
        "publish_date": "Sun, 06 Apr 2025 11:59:06 +1000",
        "category": "entertainment",
        "authors": [
            "Cher Tan",
            "Donna Demaio",
            "Elizabeth Flux",
            "Guy Webster",
            "Hannah Francis",
            "John Bailey",
            "Lefa Singleton Norton",
            "Nell Geraets",
            "Sonia Nair",
            "Tyson Wray"
        ],
        "text": "Noah Szto | Med School\n\nACMI, until April 20 He can sing, he can dance, he can perform medical procedures. Newly minted doctor Noah Szto brings together music, comedy and PowerPoint to offer a skew-eyed look into the realities of what it takes to pursue a career in medicine. Med School is at ACMI until April 20. Credit: Ian Laidlaw While Szto does not shy away from getting into the weeds of his particular experiences, he does a deft job of navigating both the specific and the broad. If you are or know someone who is in the medical field, there are enough “in” jokes to make you feel catered to, but not so many to be alienating to everyone else. Yes, this is a show all about medicine and med school, in particular – Szto performs the whole thing in scrubs (and, yes, there is a minor medical procedure as promised). At the same time, if you’ve never set foot in a hospital, the running themes – art v science, prestige over precarity, loss of identity, and being worn down by an institution – extend far beyond the medical field. If you’ve ever had to make the sensible choice over following your passions, the core of this show taps into that complex web of feelings, jazzes it up with a song, a dance and a laugh, and offers up a glimmer of hope.\n\n★★★★\n\nReviewed by Elizabeth Flux\n\nFrankie McNair and Isaac Haigh | The Booth Variety Spectacular & Formal Apology Hour!\n\nArts Centre Melbourne – Members Lounge, until April 20 Tabitha Booth (a resplendent Frankie McNair in character) has been on air for 12 years – you may know her as the Long-Forked Lady. But as she inauspiciously turns 40, she’s being Substance-ed by young upstart Isaac Haigh. What antics can we expect from our favourite emotionally dysregulated silver-screen siren in her final show as host? The Booth Variety Spectacular & Formal Apology Hour! is on at Arts Centre Melbourne until April 20. As soon as you step into the Member’s Lounge, you’re immediately transported into the frenzied hubbub of a live-studio audience. This immersive veracity is maintained throughout – audience members are handed cue cards, the lights go up between the filming of zany segments, and we become privy to the unravelling of both Tabitha and the show as the night progresses. This meticulous attention to detail is mirrored in the set, costumes, ensemble cast and variety show ephemera. Perennially shimmying, McNair has perfected performing a woman perpetually on the brink, while Haigh is impeccable as her smooth, supercilious co-host-turned-interloper. Alice Tovey is our guest comedian of the night and although her contemporary references disrupt the old-world feel of 1969, it’s a solid set. The funniest moments transpire within the many immaculately constructed layers of the show: the action unfolding behind Tabitha as she demurs about turning 40, the televised close-ups of remonstrations, the uproarious ad breaks, and the disconnect between what’s seen to be happening and what’s actually happening in the thrilling denouement.\n\n★★★★\n\nReviewed by Sonia Nair\n\nLou Wall | Breaking the Fifth Wall\n\nComedy Republic, until April 20 The zeitgeist rumbles through every MICF. This year, it’s all about AI, conspiracy theories, truthism and bald-faced lies. Breaking The Fifth Wall is on until April 20. Lou Wall has built an entire show around telling porkies for laughs. Even though we’re told this upfront, the various betrayals, twists and turns that unfold as the hour progresses land perfectly every time. Wall is from the iPad Kid generation of comics for whom multimedia is always close at hand. This forms part of the elaborate set-up as we whiz through PowerPoints, Facebook Messenger recaps, deepfakes and Wall dialling into tense FaceTimes with themself. It’s an amped-up, maxed-out variety hour with a compelling meta-narrative, incorporating games, comedy tunes, sneaky sleight of hand and even some slam poetry. Wall is so relaxed and natural in every guise they inhabit, it’s no wonder we are putty in their hands.\n\n★★★★\n\nReviewed by Hannah Francis\n\nGuy Montgomery | I’ve noticed so many things, It’d be unfair to keep them to myself\n\nAthenaeum Theatre, until April 20 Will he or won’t he? This question (no spoilers as to why) will run through your mind regularly during the offbeat ponderings of Guy Montgomery, who by his own admission is staying in much nicer accommodation since the roaring success of his television panel game show Guy Montgomery’s Guy Mont-Spelling Bee. I’ve Noticed So Many Things, It’d Be Unfair To Keep Them To Myself is on until April 20. Self-deprecating as he warms up the crowd, the show launches with aplomb. On this night, he seems genuinely stunned that – when asked – a bloke in the front row publicly shares his actual email address. Montgomery’s artful play on words, his over-arching smarts and congeniality is lapped up. Thoughts on water temperature, real estate agents and zoos are riotous. It feels like the room is hanging on his every syllable. Each quip is met with laughter. It’s a delightful ride. And ultimately, the burning question that repeatedly surfaces gets answered.\n\n★★★★\n\nReviewed by Donna Demaio\n\nEmma Holland | Don’t Touch My Trinkets\n\nACMI, until April 20 Art lover Emma Holland’s origin story begins with being told off for touching the iconic Capitoline Wolf statue in Rome. Denied this contact, she embarks on a life where she will have unfettered access by making her own, which she displays here for us (but no touching). Don’t Touch My Trinkets is at ACMI until April 20. Credit: Your Local Film Lab Don’t Touch My Trinkets artfully combines physical comedy, props, audience engagement and PowerPoint presentation. Holland has many strings to her comedy bow and plays them to perfection, eliciting delighted laughter from the audience. She works the crowd with ease, using direct eye contact and the smallest of gestures to draw the whole room in. As Holland ends the show, she raises questions about her own relationship to art, creativity and audience. What ethical quandaries does it bring up? Have we become complicit in her weaponising the art form of comedy? It’s an interesting question that Holland ultimately leaves hanging, instead opting for an ending with more laughs.\n\n★★★★\n\nReviewed by Lefa Singleton Norton\n\nAnisa Nandaula | You Can’t Say That\n\nThe Victoria Hotel, until April 20 Anisa Nandaula is disarmingly charming, luring you in with her warmth and candour onstage. She shares how she acclimatised to Australian culture after migrating from Uganda, growing up in blaringly white cities in Queensland. You Can’t Say That is at the Victoria Hotel until April 20. Nandaula’s approach is conversational, from asking audience members casual questions, like their vocation, to more probing ones, such as if they’ve ever cut anyone out of their lives, eliciting interesting responses. For those unnerved by the limelight, she gives them latitude to rebuff her advances by responding with a “bye b—”. This generates an air of comfort, with one attendee chiming in on Nandaula’s enquiry about culturally diverse friendship groups: “There’s black people in Thornbury!” Her set starts off a little awkwardly as she occasionally falters her delivery and doesn’t quite land the punchlines. When she eventually hits her groove, she’s unstoppable, playing out scenarios with a bombastic side-eye and confident strut. If you’re seeking a comedic act that will keep you at ease, Nandaula should be your pick.\n\n★★★\n\nReviewed by Vyshnavee Wijekumar\n\nLizzy Hoo | Deja Hoo\n\nThe Victoria Hotel – Banquet Room, until April 20 If you weighed Lizzy Hoo’s likeability, you’d break the scales. In a testament to her skills, she’s racked up a multitude of television credits – including her 2023 Amazon Prime Video comedy special, Hoo cares!? – since her stand-up debut in 2017. Deja Hoo is on at The Victoria Hotel until April 20. Credit: Chris Hillary Confidently, she poses the question “are you ready for the best night of your life?” before embarking on a fun showcase of witticisms, celebrating her Chinese-Malaysian Irish-Australian heritage. There’s a slew of absorbing stories about dating, brotherly bullying, the joys of living solo and the perfect gift selection for a mother. The audience chuckles along. A line about greyhounds is blooming hilarious. It’s not a Lizzy Hoo show without a tale about dad, Chan Hoo, she says – admitting a quick call to her brother furnishes her with yet another delightful story to share.\n\n★★★\n\nReviewed by Donna Demaio\n\nHarry Jun | Friendship Safari\n\nThe Greek – Apollo, until April 20 Most classic stand-up falls into one of three categories: contrarian edgelord, trauma spiller, affable friend. Luckily, Harry Jun belongs to the latter, and that might just be the whole point of his show. Friendship Safari is at The Greek until April 20. While Friendship Safari is ostensibly about friendship and its complexities, Jun moves swiftly onto other subjects. There are snippets from a previous life as a schoolteacher – among other life stories – with some bemusing curveballs. His past wrangling dead-eyed teen children turns out to be a skill set transferable to bringing high energy to a quiet night. The night I go, only three people are in the audience. Yet, Jun takes it on the chin and delivers the show nonetheless with aplomb, although his brio gives way to a glimmer of defeat at the very end. If every comedian’s got a schtick, Jun’s is trivia. There’s a sense of watching an earnest friend regale you with their learnings and seeing how much fun they have doing it. In a world of chaos and irony, Jun’s sincerity charms.\n\n★★★\n\nReviewed by Cher Tan\n\nSuren Jayemanne | There’s A World Where My Head Ought To Be\n\nMelbourne Town Hall, until April 20 There’s a World Where My Head Ought Be is at the Melbourne Town Hall until April 20. Suren Jayemanne used to sell himself as the guy who gave up accounting to do comedy, but is now turning over a new leaf. When someone else called him an artist, he saw himself as one for the first time. He’s a smart comedian and unafraid to raise the stakes. Jayemanne is also having somewhat of an identity crisis provoked by getting a new photograph for his license. It’s worse than you think. In his photo, he’s a white woman. His time waiting at VicRoads has Jayemanne considering the divine within ourselves, and he thinks we should all be considering it, too. It’s the kind of smart comedy brave enough to bring big questions into the room and rely on the gravity of the story to bring the humour. The result is a satisfying show with something to say.\n\n★★★\n\nReviewed by Lefa Singleton Norton\n\nAlanah Parkin | Garage Sale\n\nDouble Tree by Hilton, until April 6 Allow yourself to be transported to Narre Warren South (39 kilometres south-east of Melbourne) for Alanah Parkin’s debut solo show, where older couple Denise and Greg are downsizing – hence, holding a garage sale. Garage Sale is at DoubleTree by Hilton until April 6. Among the sale items strewn across the stage are hats, scarves, doilies and a video porn collection. A wonderfully unpredictable, somewhat chaotic, 50 minutes of escalating comedy-drama ensues, presented by a variety of lively, absurd characters. Grandma is a hoot. A litany of giggles follows as the audience is invited to participate in a Jane Fonda-esque workout routine. Video and voiceover vignettes allow Parkin to dart backstage for necessary costume changes, giving rise to amusing moments. Clearly gifted, Parkin revels in gloriously ridiculous scenarios (picture a poetry-reciting rag-doll or a self-help guide for aged-out choir boys) in a quirky show that takes a rather unexpected turn.\n\n★★★\n\nReviewed by Donna Demaio\n\nPierre Novellie | Must We?\n\nThe Westin, until April 18 It’s easy to warm to this giant Millennial good boy in a baby-blue suit. His crisp delivery and Attenborough-esque enthusiasm might not endear him to the more blokey comedy crowd, but anyone at the Douglas Adams end of the humour spectrum will find themselves in good hands here. Must We? is at The Westin until April 18. He’s a detail guy: an impromptu bit of audience banter has him noting that our shrinking chocolate teddy bear snacks are due to illegal gold mining in Ghana. His brain carries a lot that way. The show’s first third is likeable if not groundbreaking guy-with-a-mic bizzo, but the remainder is tighter and generates those barks of recognition that fine observational comedy evokes. The show sticks the landing, too, with a quietly insistent reminder that stand-up, like society, must be a broad church if its members are to survive. (And for the blokes: denim condoms.)\n\n★★★\n\nReviewed by John Bailey\n\nAlex Ward | Clip Clop Don’t Stop\n\nSwiss Club, until April 20 Do you have pretty privilege? You probably don’t know if you do, according to how the theory goes. Alex Ward is convinced she has something similar: pretty approachable. That’s where you have a face that welcomes everyone and anyone to strike up conversation, ask you for directions or assume you work here … wherever here happens to be. Clip Clop Don’t Stop is at the Swiss Club until April 20. Being approachable has led to some entertaining situations, which Ward easily wins over her audience by telling us about. This show is filled with likeable banter and quick jokes. Mostly the target of her humour is herself, making her material all the more approachable. It’s relatable humour to go with her relatable face. This is a neatly structured show which takes satisfying sidetracks, entertaining diversions and clever callbacks. The audience keeps up a steady rate of laughter throughout. It takes skill to make it look this easy, which Ward does.\n\n★★★\n\nReviewed by Lefa Singleton Norton\n\nZoë Coombs Marr | The Splash Zone\n\nMelbourne Town Hall, until April 20 Zoë Coombs Marr is a master of meta. Her fast-paced comedy can be variously subversive, confoundingly circular and wildly clever. The Splash Zone is a light-hearted offering – and about as straight up and down as Marr gets. The Splash Zone is at the Melbourne Town Hall until April 20. Credit: Christa Holka We hear of growing up in Grafton, in northern NSW, life-defining moments that arrive while waiting for a train, Aussies abroad and Americans Down Under, and Trump-loving patrons who seem a bit lost. References to ADHD and audience distractions collide with commentary on social fragmentation, conspiracy theories and the growing disconnect between thoughts and facts. As a whole, the show relies too much on said audience distractions and cultural references. Some of the punchlines are predictably daggy, but the fans lap them up. While Marr’s award-winning character, Dave, skewered gendered structures in comedy to perfection almost a decade ago, a sidebar here about nasty male comedians misses the mark at a festival that has made increasing efforts to celebrate diversity in recent years. It’s early in the run, but Marr’s latest offering feels somewhat disjointed itself. Then again, perhaps that’s the point.\n\n★★★\n\nReviewed by Hannah Francis\n\nAmy Gledhill | Make Me Look Fit On The Poster\n\nThe Westin, until April 5 We’re barely two minutes into Amy Gledhill’s show and the audience is already swinging underwear in the air. Make Me Look Fit On The Poster is at The Westin until April 5. Just to be clear, no one was actually undressing – but having a show start with strangers handling mysterious undergarments certainly loosens a crowd up. This is what Gledhill’s stand-up is all about – stripping down to crack up. Fresh off the back of her award-winning Edinburgh Fringe Festival run, she shares personal tales like she’s chatting with a best friend. We learn about her experiences of “cursed” oral sex, and the time she mistook Stranger Things’ Finn Wolfhard for a “little tiny orphan boy”. Sprinkled in between the gags, she confides in us about her admittedly low self-esteem and warped body image.\n\nLoading Granted, not every yarn sticks the landing – a three-minute spiel about how much toilet paper she accumulates fizzles hard – and some of her references are too British to translate to an Australian crowd. But what she lacks in knee-slapping punchlines, she makes up for in both physical comedy (her re-enactment of dangling from a tree like a “little ginger bauble” was chef’s kiss) and genuine relatability. Maintaining knicker-swinging energy for an hour is no easy feat, but Gledhill gives it a fair crack.\n\n★★★\n\nReviewed by Nell Geraets Flo & Joan starring George Fouracres | One Man Musical\n\nArts Centre Melbourne - Fairfax Studio, until April 20 Comedic duo Flo & Joan have built a show around the idea that nothing brings people together like hating Andrew Lloyd Webber. They’re back this year with a 60-minute, high-energy tour of the man they describe as a legendary “cockroach of the West End”. Or, for legal reasons, a purely farcical one-man show about a random cat-loving narcissist who loves organ-heavy riffs and hating Lin-Manuel Miranda.\n\nThe show was a runaway hit at Edinburgh Fringe last year. Part-swansong, part-musical biopic, Flo & Joan fill the show to the brim with biographical details and melodic parodies of Webber’s classic style. Meanwhile, actor George Fouracres plays a short-tempered and entitled Webber, sitting on a throne dressed in purple velvet as he swings from the self-obsessed showstopper, All About Me, to nostalgic ballads mourning his glory days. One Man Musical is on at Arts Centre Melbourne until April 20. Moments that parodied Webber stood out over those that simply recounted his life. One scene, backed by bubble machines and technicolour lighting, married creative pastiche and biography spectacularly. But the show ultimately struggles to make the leap from Fringe venue to the Arts Centre’s Fairfax Studio. Loading Muted sound design left Fouracres out in the cold, making his high-octane delivery style seem overzealous and his high-pitched vocals like an attempt to overcompensate by yelling. It’s a bit grating. But for that reason, maybe One Man Musical has perfectly captured what it might be like to spend an hour with this living legend – for better or for worse.\n\n★★★\n\nReviewed Guy Webster\n\nJude Perl Tries To Finish A Sentence\n\nArts Centre Melbourne – The Show Room, until April 20 As the title of this show suggests, Jude Perl finds herself unable to say anything that doesn’t upset someone and is hyper focused on using “correct” language when expressing herself. Hence, why she can’t finish a sentence unless she’s belting out tunes on her piano. Jude Perl Tries To Finish A Sentence is at Arts Centre Melbourne until April 20. There’s something interesting to be said about the age of moral outrage we’re currently in and the polarised views that rest on either end of the spectrum. But Perl’s prevaricating show veers perilously close to embracing moral ambiguity at a time when crusades are being waged against “wokeism” and clear-eyed renunciations of injustice are being met with suppression. The framing of Perl’s show is such, but the scaffolding is weak as well. Perl inhabits different characters – a sentence mentor, an uncouth best man at a wedding, a cancelled pop star of yesteryears – to express the difficulty of forming a thought in the oversaturated world we live in and the corrosive power of nostalgia.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/federal-election-2025-live-updates-labor-s-4000-home-battery-subsidy-liberal-candidate-named-in-settlement-dad-vote-crucial-for-albanese-20250406-p5lph5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Dutton spruiks foreign student cuts to get young Australians into homes; Albanese campaigns on $4000 home battery subsidy",
        "publish_date": "Sun, 06 Apr 2025 11:47:33 +1000",
        "category": "finance",
        "authors": [
            "Olivia Ireland"
        ],
        "text": "Finishing his speech, Albanese said his party didn’t “beg and borrow” from other ideologies, but built its own.\n\nIn a subtle dig against Dutton’s policies that Labor is saying are similar to Trump’s, Albanese said Labor stood up for Australian values.\n\n“We don’t beg and borrow ... ideologies from anywhere else in the world. We build on our values, fairness and opportunity for all,” he said.\n\nPrime Minister Anthony Albanese holds up his Medicare card. Credit: Alex Ellinghausen\n\nAlbanese added Labor would never copy America on healthcare, education and social policies.\n\n“The future that we want is not an American-style wages system or American levels of student debt and never, ever American healthcare ... in this time of uncertainty, we should not try to be more like someone else or somewhere else. We only need to trust in what makes us Australian, a place in the world, our values, our people,” he said.\n\n“These are uncertain times, but I am absolutely certain of this. This is not a time of cutting and wrecking, of thinking small, punching down, aiming low, or looking back. This is a time for building, building the stronger Medicare that Australians deserve.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/billionaires-poised-to-lose-nearly-a-trillion-dollars-in-two-days-20250405-p5lpgw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Billionaires poised to lose nearly a trillion dollars in two days",
        "publish_date": "Sun, 06 Apr 2025 11:33:13 +1000",
        "category": "finance",
        "authors": [
            "Dylan Sloan"
        ],
        "text": "The world’s 500 richest people suffered the biggest two-day loss ever on the Bloomberg Billionaires Index as fallout from US President Donald Trump’s tariff announcement decimated markets across the globe.\n\nBillionaires on the wealth list lost a collective $US536 billion ($887 billion) from Thursday’s sharemarket open to Friday’s close as the S&P 500 Index dropped 10.5 per cent over the two days and the Nasdaq Composite fell 11.4 per cent.\n\nBillionaire hit: Mark Zuckerberg (left) and Elon Musk. Credit: AP\n\nFriday’s $US329 billion drop was the largest since the height of the COVID-19 pandemic in 2020, swamping Thursday’s $US208 billion slide. Almost 90 per cent of the billionaires tracked by the wealth index saw their fortunes fall on Friday, with an average decline of 3.5 per cent.\n\nNo one lost more over the two-day stretch than Tesla chief executive Elon Musk. The carmaker’s stock plunged more than 10 per cent on Friday, dragging Musk’s net worth down $US31 billion from Thursday’s open and bringing his yearly losses to $US130 billion.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-s-tariffs-raise-risk-of-global-recession-this-year-to-60-percent-jp-morgan-warns-20250406-p5lphu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s tariffs raise risk of global recession this year to 60%, JP Morgan warns",
        "publish_date": "Sun, 06 Apr 2025 11:27:23 +1000",
        "category": "finance",
        "authors": [
            "Eir Nolsoe",
            "Louis Goss"
        ],
        "text": "Meanwhile, Britain’s weaker economy coupled with the Treasury’s razor-thin headroom leaves the UK exposed to a “negative spiral” similar to Greece’s debt meltdown a decade ago, according to one of the world’s biggest investment firms. Neil Robson, the head of global equities at Columbia Threadneedle, said Britain’s £2.8 trillion ($6 trillion) debt pile, which nearly outstrips the size of the economy, leaves it vulnerable as Trump’s tariffs increase the risk of a global recession. Robson said: “We have had a Liz Truss moment here in the UK. Could we have a Labour version of that? Possibly. I think it’s quite likely.” He said Britain’s current financial situation mirrored the lead-up to the eurozone meltdown when bond markets turned aggressively against Greece when investors suddenly realised the country could not balance its books.\n\nHe said: “If you think about the problem of being very indebted, you can be as indebted as you like as long as your nominal growth is higher than your interest rate.” “But if ever your nominal GDP growth stalls – not just on a temporary basis – below your interest costs then you’re in a real negative spiral, and it can move really quickly. We saw that with Greece during the great financial crisis.” British Chancellor Rachel Reeves had banked on faster economic growth to offset the UK’s rising debt bill over the next five years, but an expected economic slump from The the US president’s trade war has left that plan in tatters. Trump slapped a flat 10 per cent tariff on all nations, rising to as high as 50 per cent for the worst off. Although Britain escaped with the flat 10 per cent rate, its exposure to the global economy means growth forecasts are likely to be pared back and could trigger a crisis for UK debt, known as gilts, which are bought and sold by global investors.\n\n‘Double blow’ for Britain Bruno Schneller, the managing partner at Erlen Capital Management, warned that the bond markets could turn against the UK if investors lose faith in Reeves’s economic plan. Loading “ Trump’s tariff blitz risks triggering a global stagflation shock – and for the UK, that’s a recipe for a gilt crisis,” he said. “Slower growth, higher inflation and a jittery investor base could combine to push UK borrowing costs higher at the worst possible time. This isn’t just trade war fallout; it’s the kind of external shock that can crack already fragile debt markets.”\n\nHe added: “Trump’s tariffs could deal a double blow to the UK – stalling global growth while fuelling inflation. That’s a nightmare for any chancellor trying to stabilise debt. If markets lose confidence in the UK’s fiscal path, a gilt sell-off isn’t just possible – it’s probable.” It follows a dramatic week for the global economy after the scale of Trump’s tariffs blitz caught markets by surprise. The turmoil also prompted JP Morgan to raise the risk of global recession this year to 60 per cent from 40 per cent as investor panic rattled stock markets around the world. Federal Reserve chairman Jerome Powell said the US president’s tariff increases were “significantly larger than expected”. Credit: AP Although UK gilts have been boosted so far by Trump’s tariffs, investors have warned this could soon change.\n\n“If Trump doesn’t course-correct, this crisis will affect many different areas in global markets,” said Harald Berlinicke, a partner at Sarnia Asset Management. Risk of more tax rises The gloomy message comes shortly after the chancellor slashed welfare benefits to restore £9.9 billion of fiscal headroom at the Spring Statement. The Office for Budget Responsibility warned that in a worst-case scenario, a full-blown trade war risked wiping out all the margin of error she had left herself against her fiscal rules. This means that after a record £40 billion tax-raising budget in October, Reeves may be forced to come back for more tax increases in her autumn Budget. Trump has vowed to persist with his aggressive tariffs despite last week’s market bloodbath, insisting “it’s going very well” and that the economy is “healing”.\n\nLoading The turmoil would be “something we are going to remember for a very long time”, Robson said. “Risks of recession have clearly gone up. I don’t see why there won’t be a recession at the moment. It’s difficult to see what the solution is unless America walks back on this,” he said. Some of the world’s most important financial leaders have warned Trump that his aggressive trade policies will wreak havoc by depressing growth and fuelling inflation. Jerome Powell, the chairman of the US Federal Reserve, said on Friday that the president’s tariff increases were “significantly larger than expected” and so the same would “likely be true of the economic effects”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/upset-result-on-tszyu-undercard-20250406-p5lpj2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Upset result on Tszyu undercard",
        "publish_date": "Sun, 06 Apr 2025 11:18:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "Upset result on Tszyu undercard\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-cyndi-lauper-20250403-p5lot6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Sex Pistols return to Melbourne in a tour Johnny Rotten describes as ‘karaoke’",
        "publish_date": "Sun, 06 Apr 2025 11:03:19 +1000",
        "category": "entertainment",
        "authors": [
            "Will Cox",
            "Andrew Fuhrmann"
        ],
        "text": "MUSIC\n\nCyndi Lauper: The Farewell Tour ★★★★\n\nRod Laver Arena, April 2 Cyndi Lauper walks on stage to an explosion of rainbow confetti and dives straight into She Bop, an ode to masturbation. She’s 71 years old, 160 centimetres tall, and exuberant as hell in blue-green hair, blasting through a recorder solo before chucking the instrument offstage. Cyndi Lauper performs at Rod Laver Arena, April 2, 2025. Credit: Martin Philbey The crowd are in tulle skirts, glitter and colourful wigs, which are on sale in the foyer – the money goes to her charity, Girls Just Wanna Have Fundamental Rights. Tonight is supposedly part of Lauper’s farewell tour, and she’s going out on top. She still has a voice like a box of crayons, bright, messy, and expressive. She uses everything, with soaring vibrato, sometimes audibly out of breath, imprecise and alive. The set is ’80s-heavy, leaning most on her ’83 debut She’s So Unusual, with some middle-of-the-road ’90s stuff and, to my delight, the song she did for The Goonies thrown in.\n\nIt’s a talky night. “It’s not just a bang-bang show,” she says unapologetically in her irresistible Brooklyn drawl (“It’s a paww-deee!”). She tells us about family, the cousin who had a pigeon coop on her roof, the women who raised her and the way they’d cut up old clothes and make something brand new with them. She does the same with her art, of course. Many of her songs are written by others but she makes them utterly her own. She tells us she recorded I Drove All Night, written for Roy Orbison, because there were no songs on the radio about women driving. “When you get in the car and you can drive anywhere you freakin’ want, that’s a power song.” Tonight is supposedly part of Lauper’s farewell tour, and she’s going out on top. Credit: Martin Philbey She cycles through about half-a-dozen costume changes, each with a different hair colour: sparkly, shoulder-padded jackets, asymmetrical suits, underwear on the outside, a floor-length Norma Desmond number, a red jacket with a bright yellow wig. “I tried to dress up faw ya,” she says. As this outfit’s designer Christian Siriano told her: “The gays want glamour.” For the evergreen Time After Time, Melbourne’s Tones and I joins for a duet that’s like every wedding dance floor you’ve ever been on: messy and beautiful. And she delivers True Colours flawlessly, standing on a small satellite stage in the middle of the arena with a long rainbow scarf metres in the air.\n\nFor the finale, Girls Just Wanna Have Fun, she’s joined by The Veronicas, who sink into the background in a stage designed in polka-dot tribute to artist Yayoi Kusama. Even this, her signature tune, is a cover of a late-’70s pop-punk number, sung by a man, but I defy you to listen to that original and think of it as anything less than a sketch for Lauper to colour in and make something wonderful, defiant and punch-the-air fun.\n\nReviewed by Will Cox DANCE\n\nPoesis and The Bastard ★★★\n\nDancehouse, Carlton, until April 5 The latest Dancehouse double bill features two works that differ wildly in their commitments to technique and virtuosity, but which together make for an invigorating and provoking evening of dance theatre. Gabriella Imrichova’s cheekily titled The Bastard aims to challenge expectations with a surprising blend of theatre, performance art and only little dance. It’s a bit punk and a bit mongrel, but consistently funny.\n\nThis is a performance in two halves. First, we get a dry parody of non-dance, a somewhat dated form of experimental dance in which movement is withheld: it’s slow and repetitious and very low effort. Loading Either side of this performance, Imrichova addresses the audience, simulating apprehension about its reception: about whether it fits the context and whether it works as dance. It’s mischievous but not without charm. Then follows a wild rant about art and novelty. There were a few walkouts on opening night, but that’s surely a victory for an artist who declares that trolling is a creative practice. Prue Lang’s Poesis sits more securely within the conventions of contemporary dance. It’s a duet in which the two dancers generate striking compositions from subtle contrasts in form, line and intention.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/tizzano-stars-in-force-five-try-win-over-highlanders-20250406-p5lpin.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tizzano stars in Force five-try win over Highlanders",
        "publish_date": "Sun, 06 Apr 2025 10:39:27 +1000",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "The Western Force have jumped to fourth spot on the Super Rugby Pacific ladder after coming from behind to post a 29-20 bonus-point win over the Highlanders in Perth.\n\nThe Force trailed 20-7 in the 27th minute of Saturday night’s match at HBF Park before piling on the next 22 points to seal the five-tries-to-two win.\n\nIt catapulted the Force (4-4) from eighth to fourth heading into their bye week.\n\nCarlo Tizzano (centre) scored his 11th try of the season as the Western Force beat the Highlanders. Credit: AAP\n\nThe Highlanders (2-5) are in ninth following their fourth straight defeat.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/pakistani-cricketer-afghan-fans-in-fiery-exchange-20250406-p5lpig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pakistani cricketer, Afghan fans in fiery exchange",
        "publish_date": "Sun, 06 Apr 2025 10:04:26 +1000",
        "category": "sports",
        "authors": [],
        "text": "Pakistani cricketer, Afghan fans in fiery exchange\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/mourinhos-bizarre-act-against-rival-manager-20250403-p5lotb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mourinho's bizarre act against rival manager",
        "publish_date": "Sun, 06 Apr 2025 09:19:27 +1000",
        "category": "sports",
        "authors": [],
        "text": "Mourinho's bizarre act against rival manager\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/movies/is-there-anything-left-to-learn-about-the-beatles-20250404-p5lp8l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is there anything left to learn about the Beatles?",
        "publish_date": "Sun, 06 Apr 2025 09:03:29 +1000",
        "category": "finance",
        "authors": [
            "The Economist"
        ],
        "text": "In 1967 Bryan Magee, a British philosopher and author, noted that 40-year-old songs by the likes of George Gershwin, Cole Porter and Jerome Kern still had wide currency. Given an “indifference to melody in favour of rhythm and intriguing new sound mixtures”, he doubted that the songs of the 1960s would fare so well. “Does anyone seriously believe that Beatles music will be an unthinkingly accepted part of daily life all over the world in the 2000s?” he dared to ask.\n\nFab Four: (from left) Paul McCartney, John Lennon, Ringo Starr and George Harrison in 1968. Credit: AP\n\nThe question now seems daft. Today, Eleanor Rigby, Norwegian Wood and Yesterday are widely judged to hold their own in the company of American songbook classics. But there is more to the Beatles’ continuing currency than the songs, and more, too, than the performances and recordings (those “intriguing new sound mixtures”) that made them known. In a way, it would be unreasonable to blame Magee for missing that the invention of teenagers as a market and television as a medium changed what it was to be famous. And they did so through the Beatles, making them the very model of a sort of fame that is still around 60 years on.\n\nMcCartney and Lennon: Friends and rivals in a partnership that changed the world. Credit: AP\n\nThe combination of songs and story means the Beatles remain fascinating; the fact that they are still fascinating means there is a market for fresh stories about them. And, happily, in recent years, those works have been good enough to add to the fascination rather than tapping it out.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/horrified-the-renewal-project-that-obscured-this-coastal-town-s-best-asset-20250404-p5lp6u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Horrified’: The renewal project that obscured this coastal town’s best asset",
        "publish_date": "Sun, 06 Apr 2025 09:00:00 +1000",
        "category": "finance",
        "authors": [
            "Benjamin Preiss"
        ],
        "text": "Residents of Port Campbell love to gaze out upon the ocean in all its moods from various vantage points in the south-west Victorian town.\n\nThe bay at Port Campbell attracts swimmers, fishers and surfers, with the wild Southern Ocean just beyond the cliffs. The stunning views are among the town’s best-loved features.\n\nRecently, the Corangamite Shire has been carrying out rejuvenation works in Port Campbell. The foreshore and main streetscape have been updated. There are new retaining walls, lawns and road improvements.\n\nSue Younis with the works at Port Campbell. Credit: Nicole Cleary\n\nBut among the most contentious works are a series of viewing decks under construction beneath towering Norfolk Island Pines overlooking the water. Critics of this part of the project argue the sweeping views of their beloved bay from one favoured section has been replaced by angular wooden barriers rising from the decks.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/weather/national-weather-forecast-for-sunday-april-6-20250406-p5lphr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "National weather forecast for Sunday April 6",
        "publish_date": "Sun, 06 Apr 2025 08:54:12 +1000",
        "category": "finance",
        "authors": [],
        "text": "National weather forecast for Sunday April 6\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/unlikely-rural-aussie-town-to-host-a-major-mosque-as-muslim-community-grows/zlmbj0cgp",
        "title": "'Surreal': An unlikely rural town will host a major mosque as its Muslim community grows",
        "publish_date": "Sun, 6 Apr 2025 01:16:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Omar Kowaider and Joanna Bryla believe the best years of their lives together began since they moved to Young three years ago.\n\n\n\n\n\nThe husband and wife live on an expansive property with their two young children in the NSW southwestern slopes.\n\n\n\n\n\nHorses, sheep and an active kelpy roam the farmland. A dozen chickens and a rooster can also be heard from their coup.\n\n\n\n\n\nThey say Young moves at a slower pace than what they left behind in \"sterile\" Sydney, something they observed after the COVID-19 outbreak.\n\n\n\n\n\n\"There was no sense of camaraderie or community [in Sydney]. There was no warmth anymore,\" Bryla told SBS News.\n\n\n\n\n\n\"Young was a way to escape that, to feel a bit of freedom,\" she told SBS News.\n\n\n\nOmar Kowaider and Joanna Bryla with their children. Source: SBS News / SBS News/Jack Giam With a vegetable patch and egg-laying chickens, they say a sustainable lifestyle has helped with the rising cost of living.\n\n\n\n\n\n\"You get more bang for your buck out here. In terms of renting, there's a significant difference [as compared to Sydney],\" Kowaider said.\n\n\n\n\n\nHe said the rent they would pay in a western Sydney home would be around twice that of what they are paying in Young and for a bigger space.\n\n\n\n\n\nThe couple believes the move has helped strengthen their relationship with their faith and also with each other.\n\n\n\n\n\n\"When you're in Sydney, you're so busy you don't have the time to sit and really connect with your partner,\" Bryla said. \"Here, we were able to learn things about each other … and rebuild the friendship that we had before we were married.\"\n\n\n\nA thriving Muslim community\n\nWith a population of around 10,000, Young is more than 370 kilometres away from Sydney and is best known for its rich cherry-growing heritage. There isn’t a single traffic light in town and everyone is less than a 10 minute drive from one another.\n\n\n\n\n\nAnd Kowaider and Bryla are among hundreds of Muslim families who have ditched the major capitals to move there.\n\n\n\n\n\nIt’s believed most of them settled here over the last five years, but their imprint on this town dates back to the late 1980s.\n\n\n\nBassem Ali (second from left) with his family in Young, NSW. His parents were amongst the first Muslims to call this rural town home nearly 40 years ago. Source: SBS News Bassem Ali’s uncle and parents were among the first Muslims to ever move there, taking a “plunge” into the unknown and buying an acreage.\n\n\n\n\n\nAli, 51, said his family opted for a lifestyle that resembled what they had left behind in the villages of northern Lebanon.\n\n\n\n\n\n\"My parents came from a farming family, and my uncle had orange orchards in Lebanon. And, they were vegetable growers in Lebanon,\" he said.\n\n\n\n\n\n\"I think they just took the risk, and they liked it, it paid off. I do think people try and stay with their community, but [people shouldn’t] be afraid. We did it, 37 years later, we're still here.\"\n\n\n\n\n\nFour decades later, Arabic has become the second most spoken language in Young after English, and it's said that out of every 10 locals, one is Muslim.\n\n\n\nThe growing need for a new mosque\n\nA drawcard for the Muslims moving here is the town's small mosque, which opened in 1994, and is managed by Sydney’s Lebanese Muslim Association.\n\n\n\n\n\nAbdullah Sultan, the head of committee at Young Mosque, said the move is a no-brainer for young Muslim families.\n\n\n\n\n\n“[Young] is away from the city, there's a mosque, there's a small community. Just by me saying that to you, you would want to move here,” he told SBS News.\n\n\n\nPeople plant trees but they don't pick their fruit. Their future does. And that's how we looked at it. Bassem Ali, Young resident\n\nLocal mayor Brian Ingram said the Muslim community’s contributions to the town have been invaluable.\n\n\n\n\n\n“[The Muslim community] just jump in every time with donations and time and thousands and thousands worth dollars, worth of contributions,” he said.\n\n\n\n\n\n\"They don't put it out there to highlight it. They don't do it for that. They do it because they care. And that's part of becoming a big part of our community.\"\n\n\n\nEmad Hamdy, Imam at the Young mosque. Last year, construction began for the new mosque that’s nearly five times bigger than the current one Source: SBS News / Jack Giam But as the Muslim population grew, so did the desire to build a new mosque with enough room for everyone to pray in.\n\n\n\n\n\nThat was clear this Eid al-Fitr , which was celebrated in Australia at the end of March, as the festive conclusion of the holy month of Ramadan.\n\n\n\n\n\nThe local mosque ran out of floor space for worshippers who had congregated there to offer the customary Eid morning prayer.\n\n\n\n\n\nLast year, construction began for the new mosque that’s nearly five times bigger than the current one, and is expected accommodate more than 1,000 people.\n\n\n\nAbdullah Sultan, the head of committee at Young Mosque, said the move to Young is a no-brainer for Muslim families. Source: SBS News / Jack Giam\n\nA 'surreal' experience\n\nSultan said it is a symbol of the community’s growth.\n\n\n\n\n\n\"A magnificent place of worship like this is going to attract more people to our town, increase that pool of potential and create opportunity for our children,\" he said.\n\n\n\n\n\nKowaider agrees, adding they found peace in the open spaces and a stronger connection to faith that Young had to offer.\n\n\n\n\n\n\"I believe … any kind of rural community brings out the best in you,\" Kowaider said.\n\n\n\n\n\n\"I think it definitely lets the soul search and gives it that yearning of coming back to where we belong and being closer to God.”\n\n\n\n\n\nWhere it all began on Ali’s family farm, he said it is \"surreal\" to see his family’s roots spread and grow into a flourishing town.\n\n\n\n\n\n\"We needed to establish something for the community and for the future. And that's how everything starts, doesn't it?,\" he said.\n\n\n\n\n\n\"People plant trees but they don't pick their fruit. Their future does. And that's how we looked at it.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/coalition-to-cut-international-student-numbers-by-80-000-raise-visa-application-fees/nofupp8l5",
        "title": "Coalition to cut international student numbers by 80,000, raise visa application fees",
        "publish_date": "Sun, 6 Apr 2025 01:05:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Coalition will reduce the number of overseas students coming to Australia each year by around 80,000 in what it says is a bid to address housing affordability for young Australians.\n\n\n\n\n\nOpposition Leader Peter Dutton announced on Sunday that a percentage cap of around 25 per cent would be applied to the number of foreign students admitted to public universities.\n\n\n\n\n\nThe Coalition said \"unsustainable\" migration levels were leading to housing unaffordability.\n\n\n\n\n\n\"The plan that we announce today is about getting young Aussies into homes more quickly and helping them afford that home,\" Dutton told reporters in Melbourne.\n\n\n\nWhat is the Coalition's plan for international students?\n\nAn elected Coalition government would allow 30,000 fewer foreign students into Australia each year, compared to Labor's figures. This would set the cap of international students each year at 240,000.\n\n\n\n\n\nLast year, Labor announced it would cap international student numbers at 270,000 from 2025.\n\n\n\n\n\nThe Opposition estimated there would be a maximum of 115,000 overseas student commencements each year at publicly funded universities and, at most, 125,000 enrolled in private and other higher education like VET courses.\n\n\n\n\n\n\"We're cutting migration because we want to put Australians first. We want Australians into homes,\" Dutton said.\n\n\n\n\n\nThe Coalition also said it would raise the student visa application charge to $5,000 for Group of Eight universities and $2,500 for remaining international students.\n\n\n\n\n\nStudents will also be charged a new $2,500 fee if they want to change education providers.\n\n\n\n\n\nWe will also conduct a rapid review into the Temporary Graduate Visas (subclass 485) to address the misuse of post-study work arrangements as a way to gain access to the Australian labour market and as a pathway to permanent migration.\n\n\n\n\n\nA recent study found international students were \"not the culprits of the rental crisis in Australia\" and its authors \"reject the assumption that the growth of international students 'caused' or exacerbated the housing crisis in Australia\".\n\n\n\nDutton says students save on commute\n\nDutton was asked how a student cap — which would largely impact metropolitan areas — would help a first-time home buyer in the suburbs.\n\n\n\n\n\nHe responded by flagging that the Coalition's promise to bring down the cost of petrol would save students money at the bowser.\n\n\n\nREAD MORE Are international students to blame for the housing crisis?\n\n\"If you're spending an hour and a half in a car, even a little Mazda2, or if you've got a bigger, gas-guzzling car, you're probably going to save, as a university student under our policy, maybe two tanks a week,\" he said.\n\n\n\n\n\n\"Two tanks a week. That's probably 30 bucks a week you're going to save as a university student. That is a huge saving.\"\n\n\n\n\n\nHe went on to say that students are buying houses across metropolitan and outer metropolitan areas, but have faced a \"housing crunch\" under the Labor government.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/what-does-the-genetic-data-revolution-look-like-now-23andme-is-going-bankrupt/sx7q7jaoe",
        "title": "What does the genetic data revolution look like, now 23andMe is going bankrupt?",
        "publish_date": "Sat, 5 Apr 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"We picked a number one invention of the year and this year it is the retail DNA test, pioneered by a company called 23andMe. Essentially what it is, it comes in this box, you open it up, inside is a vial, you spit in the vial, you send them the spit and they will scan your genome and they will tell you what health conditions you might be at risk for. We consider this to be an absolutely revolutionary invention that will change forever the way we think about healthcare and the way we think about our personal information.\"\n\n\n\n\n\nThat was Time Magazine's announcement of the invention of the year in 2008.\n\n\n\n\n\nThe company 23andMe had begun two years earlier in 2006 with a simple premise.\n\n\n\n\n\nIf you could know more about your DNA, you could understand your ancestry, your risk factors for health conditions and could even ensure your medical treatment was personalised for you.\n\n\n\n\n\nBut in the almost twenty years since the arrival of 23andMe, has the genetic revolution actually happened?\n\n\n\n\n\n\"No. It turns out biology is always more complicated than what we hoped.\"\n\n\n\n\n\nThat was Dr Philipp Bayer, one of the researchers behind an open-source database for people who had completed a direct-to-consumer genetic testing kit to upload their results.\n\n\n\n\n\nHe says the group created OpenSNP in 2011 to open access to everyone, not just the pharmaceutical companies that could afford access to commercial data sets.\n\n\n\n\n\nThey hoped that by increasing access to genetic data, more medical discoveries could occur.\n\n\n\n\n\nIn a blog post, a fellow researcher said it would give the individual the choice to contribute rather than having researchers or companies broker the access.\n\n\n\n\n\nBut Dr Bayer says genetic research hasn't gone the way that was expected.\n\n\n\n\n\n\"And back then we didn't know how much one of these pieces of DNA can tell you about someone's disease or propensity to disease or probability to develop some other melody in your life. We just didn't know back then, and by now, 14 years later, we know that the biology is always more complicated than you assume. There's always far more factors working on figuring these outcomes, and it's just not the single data point that can help you predict what's happening.\"\n\n\n\n\n\nDr Jan Charbonneau is an adjunct researcher at the Centre for Law and Genetics at the University of Tasmania.\n\n\n\n\n\nShe says that for some customers in the US, the results of genetic data testing can actually have unexpected impacts on eligibility for health insurance.\n\n\n\n\n\n\"When you sign up for health insurance through your company, whatever, you attest that you do not know of any genetic predispositions. Well, if you've had a 23 and me test, of course that's not part of your health record. But by saying no thinking, you're keeping your genetic results out of the official records. Of course that could compromise your health insurance later.\"\n\n\n\n\n\nIn 2008, the US Government passed the Genetic Information Nondiscrimination Act which protects against genetic discrimination in employment, a law that was expanded to include health insurance plans a year later.\n\n\n\n\n\nIn Australia, a doctors group has been campaigning for similar legislation.\n\n\n\n\n\nThe government announced in September 2024 that it would ban genetic discrimination in life insurance - but no legislation has passed yet.\n\n\n\n\n\nAustralian Medical Association vice president, Associate Professor Julian Rait, says the future of the ban is uncertain as we head into a federal election.\n\n\n\n\n\n\"Well look, we are still confident that the government's heart is in the right place about this particular piece of legislation. Obviously it’s been deferred as a consequence of the election and we would hope that in the new term of whatever the government might follow that we would be able to advocate for that legislation being passed and obviously then promulgated so that people are better protected.”\n\n\n\n\n\nThe AMA's statement on genetic testing says genomics will rapidly transform the sector, and should be incorporated into everyday healthcare.\n\n\n\n\n\nBut Associate Professor Rait says people should consult their doctor when considering one of these tests.\n\n\n\n\n\n\"The AMA has forewarned since about 2012 of the ethical challenges of genetic testing, in particular the privacy risk and also the cybersecurity risks, because of the shared nature of the information. It's not just your own DNA in some ways, it's also shared by many family members. And so, therefore there's the potential for information to be exposed that might not be necessarily, you know, to the comfort of all the other members of the family.\"\n\n\n\n\n\nThe researchers behind OpenSNP have decided to delete all of their data, along with their website, at the end of April.\n\n\n\n\n\nDr Bayer says the decision comes from a cost benefit analysis amid the issues with 23andMe - and the growth of far right governments.\n\n\n\n\n\n\"Is this data actually helping people or will it be used to the detriment of people and to us currently looks like it'll be more used to the detriment of people. So that's triggered this decision.\"\n\n\n\n\n\nFormer customers of 23andMe are also asking questions about what to do with their data, now 23andMe have filed for bankruptcy.\n\n\n\n\n\nAssociate Professor Rait says there are concerns around data protection, with some customer data appearing on the dark web after 23andMe experienced a data breach in 2023.\n\n\n\n\n\nBut it's the legitimate sale of the company's assets as the bankruptcy proceeds that is also raising questions.\n\n\n\n\n\nThe company has said in a statement that the sale would not impact how customer data is managed, but the Attorney-General of California, where the company's headquarters is located, has warned customers to consider deleting their data.\n\n\n\n\n\n\"Now there are procedures in place to be able to go in and ask 23andMe to delete your data. My question has always been, first off, will they do it? They tell you they're going to do it. What kind of confirmation do we have other than you get an email from them saying, we've deleted your data. But when you shop and think where that data has gone, how could we possibly delete it from these large databases?\"\n\n\n\n\n\nDr Charbonneau says the sale of the company will result in the sale of their information.\n\n\n\n\n\nShe says some customers might not understand yet that's what could happen - given they had to read 13 different documents to understand what they were signing up for.\n\n\n\n\n\n\"Now, even as lawyers, we have struggled with some of them and I wonder if the general public, what do they make of a jurisdiction clause? What do they make about assigning their rights in their DNA? Do they understand what these things mean in terms of their actual protections?\"\n\n\n\n\n\nDr Charbonneau has one piece of advice for those who are still considering a direct to consumer DNA test: to consider everything.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/morning-news-bulletin-6-april-2025/krtg9acs6",
        "title": "Morning News Bulletin 6 April 2025",
        "publish_date": "Sat, 5 Apr 2025 21:00:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\nDonald Trump's 10 per cent tariff comes into effect for Australia and other countries\n\nLabor pledges $2.3 billion for a household batteries plan to reduce power bills\n\nBrawling NRL fans face stadium bans\n\nUS customs agents have begun collecting President Donald Trump's 10 per cent tariff on all imports from many countries, including Australia.\n\n\n\n\n\nHigher levies on goods from 57 larger trading partners due to start next week.\n\n\n\n\n\nHidetoshi Tashiro is the chief economist at Infinity LLC, a Japanese consulting firm advising stock trading and real estate management.\n\n\n\n\n\nHe says the 24 per cent tariff announced for Japan will be very damaging - not only for Japanese companies, but also for the US economy.\n\n\n\n\n\n\"This tariff policy will only add fuel to the fire, rather than extinguishing it. In the current environment of severe high prices in the US, the life of US citizens will become even more difficult. The production of exported goods from various countries will decrease. This tariff policy is completely unreasonable for the development of the global economy, and even for the development of the US economy itself.\"\n\n\n\n\n\n**\n\n\n\n\n\nPrime Minister Anthony Albanese has promised that if re-elected, Labor will reduce the cost of installing a typical home battery by 30 per cent from July 1.\n\n\n\n\n\nBatteries store power from solar panels for households and businesses to use when needed.\n\n\n\n\n\nThe proposed discount would reduce the upfront cost of the 11.5-kilowatt-hour battery purchased for a household by $4,000.\n\n\n\n\n\nSmall businesses and community facilities would also be eligible for a battery discount.\n\n\n\n\n\nLabor says it expects the discount to help see 1 million new batteries installed by 2030 under the plan.\n\n\n\n\n\nThe measure is estimated to cost $2.3 billion over the forward estimates, including in the 2025-26 budget.\n\n\n\n\n\n**\n\n\n\n\n\nFootage from a slain Palestinian medic appears to contradict Israeli claims about the deaths of 15 medics in southern Gaza on the 23rd of March.\n\n\n\n\n\nThe Palestine Red Crescent Society recovered the mobile phone of one of the men killed which shows an almost seven-minute interview filmed from inside the moving vehicle.\n\n\n\n\n\nIt shows clearly marked ambulances driving at night, using headlights and flashing emergency lights. The vehicle is stopped, pulling up alongside an ambulance that had come under fire earlier.\n\n\n\n\n\nThen gunfire erupts and the screen goes black.\n\n\n\n\n\nIsraeli military spokesman Lieutenant Colonel Nadav Shoshani says troops opened fire on vehicles that had no prior clearance to enter the area, and were driving with their lights off.\n\n\n\n\n\nParamedic Munzer Abed survived the attack.\n\n\n\n\n\nHe confirmed the veracity of the video - and says he rejects Israel's account of what happened.\n\n\n\n\n\n\"There was heavy shooting directly at us in the vehicle. I took cover, going down in the cabin, in the backseat to protect myself from the shooting. I didn't hear a sound from my colleagues . I didn't see them because I was then surprised by people speaking Hebrew, who turned out to be special forces from the Israeli army, wearing their uniforms, and with guns and night vision goggles. They opened the side door, in the back, (leading) to me and they kicked me out of the vehicle. They made me take off all my clothes, then they let me put on my underwear.\"\n\n\n\n\n\nThe Israeli military says it did not randomly attack any ambulances, insisting they opened fired on who they believed were Hamas militants approaching them in suspicious vehicles.\n\n\n\n\n\nIsrael says a review is being conducted into the incident.\n\n\n\n\n\n**\n\n\n\n\n\nAid organisations have been praised for their humanitarian response to Myanmar's devastating earthquake as the death toll continues to climb - now reaching over 3300.\n\n\n\n\n\nThe UN Office of the High Commissioner for Human Rights says aid groups have been acting with courage, skill and determination to help the survivors, despite reports the junta has been restricting aid supplies to quake-hit areas where communities did not back its rule.\n\n\n\n\n\nThe UN's aid chief Tom Fletcher says the population has already been struggling to cope with widespread food insecurity and displacement caused by the post-coup civil war.\n\n\n\n\n\nVolunteer aid worker Zaw Win says they are also concerned about how to prevent disease.\n\n\n\n\n\n“We are concerned that diseases like cholera could break out in the community. The big issue is to manage trash properly as people are staying on the street and throwing away a lot of waste. That is the concern for people in the city.”\n\n\n\n\n\n**\n\n\n\n\n\nBrawling NRL fans could face the prospect of stadium bans following a clash between supporters at Friday night's classic match between rivals South Sydney and the Sydney Roosters.\n\n\n\n\n\nA Venues New South Wales spokesman says anyone found to be committing brawling offices will be dealt with by police, and face being stopped from coming to future events.\n\n\n\n\n\nNew South Wales Police have confirmed officers were called to a section of Accor Stadium during the second half of the game.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/bullwinkel-is-was-new-federal-seat-heres-how-it-could-impact-the-upcoming-federal-election/g7tksbwr0",
        "title": "Bullwinkel is WA's new federal seat. Here's how it could impact the upcoming federal election",
        "publish_date": "Sat, 5 Apr 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIt's not often a brand-new federal electorate is created.\n\n\n\n\n\nIn Western Australia, the seat of Bullwinkel is the latest example.\n\n\n\n\n\nThe first member for Bullwinkel will be elected at the upcoming federal election.\n\n\n\n\n\nFor local resident and sheep farmer Peter Boyle, the live sheep export issue is key to his economic livelihood.\n\n\n\n\n\n\"We've been farming here since 1855. I don't know where we are going to go next year, because there's huge reduction in sheep numbers all around us. We won't be able to buy shore sheep and fatten them for my type of market. It's going to be very difficult even to supply it for live shipping.\"\n\n\n\n\n\nThe federal government has announced it is banning live sheep exports by 2028.\n\n\n\n\n\nThe Coalition says it has a clear mandate to reverse the ban—promising to \"Keep the Sheep\" if it wins the upcoming election.\n\n\n\n\n\nNationals leader David Littleproud says the first step would be restoring trust with Middle Eastern trading partners.\n\n\n\n\n\n\"My first international trip will be to Kuwait, Qatar, Saudi Arabia, Jordan, to Morocco - to show them some respect, that we are an important part of their food security. And we should be a trusted partner that they can rely on. And when this madness has ended, and that they can rely on us to continue to send with the best animal welfare standards in the world.\"\n\n\n\n\n\nBut the fight for Bullwinkel is about more than just agriculture.\n\n\n\n\n\nThe new federal seat was introduced to accommodate Western Australia’s growing population - bringing WA’s total to 16 federal electorates.\n\n\n\n\n\nSpanning Perth’s eastern suburbs and parts of the Wheatbelt, it bridges two very different communities - each with their own priorities.\n\n\n\n\n\nCurtin University political expert, John Phillimore, says that mix makes it difficult to predict the outcome.\n\n\n\n\n\n\"Notionally a Labor seat, with a pretty close margin of two to three per cent. But I think most commentators would expect that in a normal federal election year, it would probably be a marginal Liberal seat because Labor got such a huge vote last time around.\"\n\n\n\n\n\nFor the Coalition, the key challenge is making rural issues resonate with suburban voters - where cost of living is the biggest concern.\n\n\n\n\n\nAt a small barbershop in the heart of the electorate, shop owner Hussein Naser says times are tough.\n\n\n\n\n\nHe has four kids, a mortgage and runs his own business—but with rising costs, he's struggling to keep up.\n\n\n\n\n\n\"I’ve had to cut the staff down because customers stopped spending enough money. We still have the same customers, but they don’t come as regularly as before. So some of them, every fortnight, they then come every month. And the people that come every month, they start coming from two to three months.\"\n\n\n\n\n\nFor Labor candidate Trish Cook, the economy is front and centre of her campaign.\n\n\n\n\n\nBut when she visited Bullwinkel recently, she was shielded from media questions on live exports—with [[Veterans' Affairs]] Minister Matt Keogh stepping in before she eventually responded.\n\n\n\n\n\nTrish Cook was pressed on whether focusing too much on cost-of-living concerns could risk alienating farming communities.\n\n\n\n\n\n\"Well, I am campaigning on the issues that matter to the people. So, I am a nurse, I've been a nurse for a long time, I've lived in this area for 20 odd years. I know this area very well.\"\n\n\n\n\n\nBut for voters like Hussein Naser, the biggest issue isn’t just what politicians promise - it’s whether they follow through.\n\n\n\n\n\n\"Politicians will promise you lots of stuff. But if they promise ten things, how many will actually be done?\"\n\n\n\n\n\nAnd when it comes to the race for Bullwinkel, the answer may depend on party politics.\n\n\n\n\n\nUnlike at the federal level, where the Coalition is united, the Nationals and Liberals in WA risk splitting the vote - especially if they clash on state issues.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/labor-to-offer-discounts-for-home-batteries-in-solar-energy-pledge/ey66qeblz",
        "title": "Labor to offer discounts for home batteries in solar energy pledge",
        "publish_date": "Sat, 5 Apr 2025 11:30:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Labor has announced a solar battery program it says could save households thousands of dollars per year in energy bills.\n\n\n\n\n\nOn Sunday, Prime Minister Anthony Albanese will formally announce that, if elected, the government will spend $2.3 billion to roll out the Cheaper Home Batteries Program.\n\n\n\n\n\nUnder the plan, households, small businesses and community facilities would receive a 30 per cent discount on the upfront cost of a typical battery — a saving of around $4,000.\n\n\n\n\n\nBy Labor's analysis, a household with existing rooftop solar could save up to $1,100 on energy bills every year, and a household installing new solar and a battery could save up to $2,300 per year.\n\n\n\n\"We want to make sure Australians have access to cheaper, cleaner energy,\" Albanese said in a statement on Saturday evening.\n\n\n\n\n\n\"This is good for power bills and good for the environment.\"\n\n\n\nHow would it work?\n\nOne in three Australian households have solar panels, but Labor estimates that just one in 40 have their own battery.\n\n\n\n\n\nA household with a typical battery would be able to store surplus power generated during the day, reducing its reliance on the grid, and pushing down peak demand and costs.\n\n\n\n\n\nLabor would roll out the battery subsidy program through the small-scale renewable energy scheme from 1 July.\n\n\n\nSupporting solar energy is part of Labor's goal of an 82 per cent renewable electricity target by 2030, achieving net zero by 2050.\n\n\n\n\n\nThe government has also committed to building more than 4,000km of high-voltage transmission lines to carry renewable energy and connect the country's grid.\n\n\n\nWhat are the other party's energy offerings?\n\nOpposition leader Peter Dutton has also promised Australians he'll reduce their electricity bills, through the introduction of a National Gas Plan.\n\n\n\n\n\nThe plan includes prioritising the domestic supply of gas through an east coast domestic gas reserve, fast-tracking new gas projects and halving approval times.\n\n\n\n\n\nThe Coalition has also pledged to build nuclear power plants at an estimated cost of $331 billion — converting seven end-of-life coal-fired power plants into nuclear reactors .\n\n\n\n\n\nThe Greens oppose the expansion of gas projects and a nuclear industry in Australia, and instead want to support people electrifying their homes.\n\n\n\n\n\nUnder the party's plan, households and small businesses would be able to access grants and low-interest loans to disconnect from gas appliances and install electric alternatives.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/a-citizenship-battle-just-got-harder-for-these-aussies/f3maxw3d9",
        "title": "'$700 of paperwork under the door': A citizenship battle just got harder for these Aussies",
        "publish_date": "Sat, 5 Apr 2025 04:21:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "A major shake-up in Italian citizenship laws has sent shockwaves through Australia's Italian community, making it significantly harder for many to obtain citizenship by descent.\n\n\n\n\n\nThe Italian government's new decree tightens eligibility criteria and imposes additional requirements on applicants. Based on the proposed new legislation, Italians living abroad can no longer apply for citizenship by demonstrating ancestry through their great-grandparents.\n\n\n\n\n\nMaria (not her real name), who was born in Australia but gained Italian citizenship through descent, spent years navigating the citizenship process.\n\n\n\n\n\nReflecting on her own struggle to secure an Italian passport, she feels for other Italian-Australians who will now face even greater hurdles in attaining citizenship.\n\n\n\n\n\n\"I ended up slipping my paperwork under the door of the Italian consulate in Brisbane,\" she told SBS News.\n\n\n\n\n\n\"They refused to open the door for me to give them the papers in person because apparently there was no security available to be present, even though I had prearranged and confirmed my appointment.\n\n\n\n\n\n\"$700 worth of paperwork slid ominously under a door. It was such a massive gamble.\"\n\n\n\n\n\nEven though Maria's application was successful in the end, it was exactly two years after Maria took the risk of leaving her paperwork at the consulate before her Italian citizenship was recognised.\n\n\n\n\n\n\n\nShe only found out she was successful by receiving a voting slip for an Italian election.\n\n\n\n\n\n\"I really feel for those who are now in limbo because so much work goes into preparing documents, not to mention costly lawyer fees, only to have the door literally shut in your face when proving your heritage,\" she said.\n\n\n\nREAD MORE Who you need to be friends with to apply for Australian citizenship\n\nWhat are the changes?\n\nUnder existing rules, anyone who can prove they had an Italian ancestor who was alive after 17 March 1861, when the Kingdom of Italy was created, can seek citizenship.\n\n\n\n\n\nBut the new legislation introduces several restrictions that particularly impact applicants residing abroad:\n\n\n\nItalian citizenship will now be automatically granted only up to the second generation, meaning only those with at least one parent or grandparent born in Italy will be eligible\n\nFor children born abroad to Italian citizens, automatic citizenship will apply only if one of their parents had resided in Italy for at least two continuous years before their birth\n\nThe new rules apply retroactively from 27 March 2025 — impacting individuals regardless of their birth date.\n\nIn a statement, the Italian consulate in Melbourne said: \"These reforms are part of a broader effort to modernise citizenship laws in line with contemporary migration patterns and international standards\".\n\n\n\n\n\nThe changes \"will free up resources to make consular services more efficient, allowing them to focus exclusively on those with a genuine need, based on their actual connection to Italy,\" it added.\n\n\n\nREAD MORE World leaders are cracking down on dual citizens — and Peter Dutton wants to join them\n\nWhy did the Italian government make the change?\n\nItalian foreign minister and deputy prime minister Antonio Tajani — a member of the conservative Forza Italia party, which governs in a coalition led by the nationalist right-wing Brothers of Italy — has defended the new rules, arguing that the citizenship process had been misused.\n\n\n\n\n\n\"Unfortunately, over the years, there have been abuses and citizenship requests that went somewhat beyond genuine interest in our country,\" Tajani said last week.\n\n\n\n\n\nItaly's foreign ministry said would-be Italians have swamped consulates abroad with requests for passports, which provide visa-free entry to more countries than almost any other nationality.\n\n\n\n\n\nBetween 2014 and 2024, the number of Italians living abroad rose by 40 per cent, from 4.6 million to 6.4 million, many registering thanks to their newfound nationality, according to the foreign ministry.\n\n\n\n\n\nTajani said companies were making a fortune by helping people track down their long-forgotten ancestors and seek birth certificates needed for applications — clogging up municipal offices with their demands for documentation.\n\n\n\n\n\n\"We are striking down very hard against those who want to make money from the opportunity of becoming an Italian citizen,\" Tajani said, adding that in future, nationality requests would be handled directly in Rome to free up overburdened consulates.\n\n\n\n\n\nItaly has a population of around 59 million, which has been shrinking over the past decade. The foreign ministry has estimated that, under the old rules, 60 to 80 million people worldwide were eligible for citizenship.\n\n\n\n\n\nBrisbane-based Italian lawyer Fabrizio Fiorino said that both sides of politics in Italy seem to be in agreement, signalling that citizenship reforms were long overdue.\n\n\n\n\n\n\"The last time we had a citizenship reform was 1992, so Italy is overdue for change,\" he said.\n\n\n\nAn estimated 0.6% of Australians were born in Italy according to the ABS. Source: SBS News\n\nBacklash from the Italian-Australian community\n\nAccording to the 2021 census, just over one million Australians have Italian ancestry, and more than 160,000 Australian residents were born in Italy.\n\n\n\n\n\nThe Italian parliament has four overseas electorates, and representing citizens in Australia is Nicola Carè — the Democratic Party MP for the constituency of Africa, Asia, Oceania and the Antarctic (AAOA).\n\n\n\n\n\nIt is estimated that the AAOA electorate has 250,000 Italian citizens living abroad, with the Guardian reporting an estimated 140,000 registered Italian voters living in Australia.\n\n\n\n\n\nCarè told Australia's Il Globo newspaper that the changes are \"an attack on the fundamental rights of emigrants and their descendants\".\n\n\n\n\n\n\"The recent changes to the Italian citizenship law are unacceptable and ridiculous,\" Carè said.\n\n\n\n\n\n\"Becoming an Italian citizen is not just a formality; it's a recognition of identity, culture and belonging.\n\n\n\n\n\n\"These changes upend and deny acquired rights, undermining the dignity of millions of Italians abroad and their families.\"\n\n\n\n\n\nFrancesco Giacobbe, the Democratic Party senator for the AAOA, also criticised the decree.\n\n\n\n\n\n\"What difference does it make to grant citizenship to someone who, before the birth of their children, lived for two years in Italy compared to someone who hasn't lived in Italy but deeply experiences Italian identity while living abroad?\" Giacobbe told SBS Italian.\n\n\n\n\n\nLegal experts have also voiced concern.\n\n\n\n\n\nAustralian-based Italian lawyer Alessia Comandini noted that while discussions about tightening citizenship rules had gone on for some time, the immediate implementation of the decree has left many applicants in limbo.\n\n\n\n\n\n\"We've seen cases where people who had all their documents prepared suddenly had their appointments cancelled with no explanation,\" she said.\n\n\n\nWhat happens next?\n\nThe decree is currently in effect but requires parliamentary approval within 60 days to become permanent law.\n\n\n\n\n\nSoon after the decree was enacted, the Italian consulates in Melbourne, Sydney, Brisbane, and Perth all announced that appointments and applications for citizenship by descent had been suspended.\n\n\n\n\n\nOnly the Melbourne consulate has since publicly stated that it has resumed processing citizenship applications.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/when-will-the-2025-australian-federal-election-debates-be/ot11zuqm0",
        "title": "Here's when the 2025 Australian federal election debates will be, and how to watch",
        "publish_date": "Sat, 5 Apr 2025 01:58:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "With the 2025 Australian federal election campaign well and truly underway, there are two upcoming televised debates between Prime Minister Anthony Albanese and Opposition leader Peter Dutton fast approaching in April.\n\n\n\n\n\nThis month, ahead of Australians going to the polls on 3 May, the Labor and Coalition leaders will answer questions from a crowd of 100 undecided voters, before facing off against one another in a more conventional debate.\n\n\n\n\n\nHere's what you need to know.\n\n\n\nREAD MORE Australian federal election 2025 explained: Everything you need to know\n\nWhen will the Albanese v Dutton events be held?\n\nAlbanese and Dutton will first present their competing visions for Australia's future on the evening of Tuesday, 8 April, from 7:30pm.\n\n\n\n\n\nAs they did during the 2022 campaign, the prime minister and Opposition leader will participate in a 'people's forum', hosted by Sky News and The Daily Telegraph.\n\n\n\n\n\nHeld in Western Sydney, the two leaders will face questions from 100 undecided New South Wales voters. It will be moderated by Sky News' chief news anchor Kieran Gilbert.\n\n\n\nThe event will be broadcast live on the Sky News channel, Sky News website or Daily Telegraph website. To watch, audiences will require a subscription to either Sky News or the Daily Telegraph.\n\n\n\n\n\nSBS News will also be live-blogging the debate on Tuesday night.\n\n\n\n\n\nJust over a week later, the ABC will host the first free-to-air leaders' debate from its studios in Parramatta on the evening of Wednesday, 16 April at 8pm.\n\n\n\n\n\nFor that one, the ABC will be choosing the topics and questions, and it will be moderated by Insiders host David Speers. Each leader will make opening and closing statements and will have equal time to respond to questions.\n\n\n\n\n\nThat debate will be broadcast live on ABC TV, iview and ABC radio.\n\n\n\nAre any other debates planned?\n\nOn 9 April — the day after Albanese and Dutton's first debate — Sky News will host a debate between Australia's Treasurer Jim Chalmers and Opposition treasury spokesperson Angus Taylor.\n\n\n\n\n\nAs for Albanese and Dutton, the Labor and Liberal campaigns are reportedly in discussions for multiple additional debates. Dutton has said the Coalition offered Labor four debates in the lead-up to the 3 May election.\n\n\n\n\n\nThere were three leader debates held during the 2022 federal election.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-aussie-dollar-has-dropped-to-pandemic-levels-whats-behind-the-fall/e3xd9kuus",
        "title": "The Aussie dollar has dropped to pandemic levels. What's behind the fall?",
        "publish_date": "Fri, 4 Apr 2025 22:49:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Australian dollar has hit a five-year low as the world's two largest economies ramp up tariffs against one another, creating uncertainty in the market.\n\n\n\n\n\nThe Australian dollar fell to its lowest point since April 2020, buying just 60.5 US cents.\n\n\n\n\n\nThe drop follows an intensifying trade standoff between America and China, which saw Beijing slap an additional 34 per cent tariff on all US imports on Friday in retaliation for similar US levies.\n\n\n\n\n\nSo why is the Aussie dollar falling?\n\n\n\nThe China effect\n\nTariffs between the US and China have been escalating since US President Donald Trump's inauguration in January.\n\n\n\n\n\nBut now the broader US tariffs against key economic allies of China, is causing instability for its currency the Yuan.\n\n\n\n\n\nMacroeconomist Janet Mui said China is facing \"critical\" economic struggles.\n\n\n\n\n\n\"China has been trying to re-diversify its supply chains through southeast Asia to avoid US tariffs, but now that can't happen,\" she told Reuters.\n\n\n\n\n\nThe Australian dollar is broadly considered a proxy of the Yuan, due to our exports being dependent on China's purchasing power.\n\n\n\n\n\nChief economist at the Australia Institute Greg Jericho told SBS News the two currencies are linked, which means when the Yuan takes a hit, it can impact the Australian dollar.\n\n\n\nTrickle-down impact\n\n\"Donald Trump raising tariffs on Chinese imports to the US means that for those products to maintain the same price, the value of the Chinese currency needs to fall. That in turn will affect the value of the Australian dollar,\" Greg Jericho, Australia Institute chief economist\n\n\n\nHow are consumers affected?\n\nA weak Australian dollar makes imports more expensive, which can make things tough for household budgets.\n\n\n\n\n\nJericho said this most significantly affects petrol prices, which are entirely dependent on global markets.\n\n\n\n\n\nOther imported household goods, on some non-essential items, could also increase in cost, but there shouldn't be changes to things like fees and charges, rent and childcare.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/china-to-impose-34-percent-retaliatory-tariffs-on-us-goods-as-trade-standoff-intensifies/f7o54usf7",
        "title": "China to impose 34 per cent retaliatory tariffs on US goods as trade standoff intensifies",
        "publish_date": "Fri, 4 Apr 2025 21:07:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Global stock markets have again plummeted after China confirmed it would retaliate against President Donald Trump with additional 34 percent tariffs on American goods, escalating a trade war that has rattled investors and fed fears of a coming recession.\n\n\n\n\n\nWall Street was down sharply on Friday following the Chinese response, which is set to be imposed from April 10, after the Trump administration's sweeping levies knocked off $4 trillion ($US2.4 trillion) from US shares.\n\n\n\n\n\nTrump said the response showed that Beijing had \"panicked\" after his administration announced a new 34% levy on Chinese goods last week, on top of an existing 20% duty on all imports from China.\n\n\n\nUK Prime Minister Keir Starmer called Prime Minister Anthony Albanese and Italy's Prime Minister Giorgia Meloni on Friday to discuss the potential fallout from the intensifying stand-off between the world's two largest economies.\n\n\n\n\n\n\"They all agreed that an all-out trade war would be extremely damaging and is in nobody's interests, while agreeing to keep in close contact in the coming days,\" a spokesperson from Starmer's office said.\n\n\n\n\n\nThe new measures also saw 11 US bodies added to China's \"unreliable entity list,\" which allows it to impose punitive actions against foreign entities, including firms linked to arms sales to Taiwan, a self-governing island, which China claims as part of its territory.\n\n\n\n\n\nThe tit for tat comes after Trump declared a 10 per cent baseline tax on imports from all countries, as well as higher tariff rates on dozens of nations that run trade surpluses with the US.\n\n\n\nCanada, which is America's largest trading partner, has said it is preparing to hit the US with retaliatory tariffs, following a move by the Trump administration to increase levies on Canadian goods to their highest level in more than a century.\n\n\n\n\n\nExperts have warned that the new trading climate, which is a stark departure from some of Trump's more business-friendly campaign promises, could continue to rattle markets.\n\n\n\n\n\nInvestment bank JP Morgan said it sees a 60 per cent chance of the global economy entering recession by year-end, up from 40 per cent previously.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/learning-to-cope-climate-adaptation-actions-stalls-for-over-a-decade/p0rczsvnq",
        "title": "'Learning to cope': Climate adaptation actions stalls for over a decade",
        "publish_date": "Fri, 4 Apr 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nHow can we learn to live with the effects of climate change?\n\n\n\n\n\nThat question was considered at length at the United Nations Climate Change Conference, COP-13, in 2007.\n\n\n\n\n\nThere, the international community came to understand that climate adaptation is just as important as mitigation.\n\n\n\n\n\nDr Simon Bradshaw, a fellow with the Climate Council and director at Climate-KIC Australia, explains.\n\n\n\n\n\n\"In responding to climate change, there's really two key tasks. First and most important is we've got to get our greenhouse gas emissions down as fast as possible by moving beyond fossil fuels. That's coal, oil and gas to renewable energy. That's essential to limiting future harms. We're already seeing a real acceleration in the impacts of climate change and worsening fire seasons, more destructive storms and downpours. Now, the second thing we have to do at the same time is adapt and build our resilience and learn to cope with these various impacts.\"\n\n\n\n\n\n\n\nA year later, in 2008, the federal government initiated the National Climate Change Adaptation Research Facility to develop the knowledge decision-makers needed to effectively adapt Australia to the impacts of climate change.\n\n\n\n\n\nBut its findings are yet to be translated into action.\n\n\n\n\n\nThat lag is reflected in a new report by researchers at Monash University.\n\n\n\n\n\nIt found local action on climate adaptation remains insufficient across tiers of government, with little change over the decade between 2012 to 2022.\n\n\n\n\n\nCo-author and Adjunct Senior Research Fellow at Green Lab in the Monash Business School, Dr Michael Spencer, says that's despite willingness from vulnerable communities.\n\n\n\n\n\nHe says those who have experienced bushfires, coastal erosion, flooding and drought want to help create adaptation measures.\n\n\n\n\n\n\"The governance structures weren't there, the finance wasn't there, the means of implementation wasn't there. So, in order to actually act on that information, you need to have the capacity to act, you need to have the governance regime at a local level to act, and you need to have access to the funds to actually implement that action.\"\n\n\n\n\n\nA second study, by researchers at the University of New South Wales, has found disaster recovery is being delayed by a lack of strategy.\n\n\n\n\n\nLead researcher and inaugural Judith Neilson Chair in Architecture at the University of New South Wales, Professor David Sanderson, says top-down bureaucracy has stifled any meaningful effort.\n\n\n\n\n\n\"This is a global evidence truth that the best recovery is as localised as possible. But we have in Australia and elsewhere systems which are largely top down and the sweet spot is supporting recovery of communities rather than, if you like, directing from afar. That's a quick summary of a complex story, but what we've noticed in our research – and again in pretty much every country – local governments are tasked with a lot of the picking up the pieces, if you like, but yet are woefully under-resourced.\"\n\n\n\n\n\nHe also says short-term solutions are wasteful and rob vulnerable communities of the chance to build resilience in the face of climate change.\n\n\n\n\n\n\"A kneejerk political reaction – it often is to think quick, we need to build temporary housing after a disaster and that's all over the place. But the problem with temporary housing is it's slow, it's expensive, and there's really a plan for what to do afterwards. So, we're arguing that temporary housing, if you build it, is an absolute last resort. There may be arguably a case for it, but a last resort and there must be a plan for its investment in continuation afterwards. There must be a plan for its investment in continuation afterwards so it's a valuable asset to the community.\"\n\n\n\n\n\nThe shortfall in strategy has also accelerated cost-of-living pressures.\n\n\n\n\n\nThe Treasury's Intergenerational Report pointed to the escalating costs of natural disasters borne by taxpayers, which reached $7 billion in 2022.\n\n\n\n\n\nDr Spencer says those higher costs are reflected in insurance policies and in other ways that are less immediately detectable.\n\n\n\n\n\n\"Natural disasters, which have a very dramatic impacts and you're seeing the impact of that in your insurance policies. In the last quarterly CPI, insurance was one of the biggest areas of increase in terms of cost of living. But the slow burn is in things like health and mental health, and we tend to not take as much notice of those areas because they're very slow, but cumulatively they can be just as severe if not more severe than the natural disaster impact.\"\n\n\n\n\n\nA 2023 Climate Trauma study by the Climate Council found 80 per cent of Australians experienced some form of disaster at least once since 2019.\n\n\n\n\n\nOne reason for that, Dr Bradshaw says, is houses are being zoned and built in high-risk areas.\n\n\n\n\n\n\"It's fair to say that updates to planning regulations have just not kept up with the increasing impacts of climate change, be that flood risk or be that fire risk. Now, we have seen some improvements here, some re-zoning, some restrictions on building in particularly flood prone areas. But we do still have new developments being built on flood plains and we still have an enormous number of our houses built in places where people are inevitably going to face real difficulty in future.\"\n\n\n\n\n\nWhile stressing urgency, Dr Spencer says the way adaption efforts are approached needs to be more holistic, pointing to what he calls \"district modelling\".\n\n\n\n\n\n\"Climate impacts don't respect jurisdiction. They will cross jurisdictions of local government, they'll involve the catchment management authority, they'll involve the chamber of commerce. So, the challenge is to cross jurisdictional boundaries, but also institutional silos. In Australia and in many other parts of the world, we tend to put responsibility for adaptation into our silos but we need to see it as an integrated whole. So the first thing is how we bring all those different players together in order to deal with it.\"\n\n\n\n\n\nDr Bradshaw says the only way forward is to listen to those on the front lines of the climate crisis.\n\n\n\n\n\n\"These impacts aren't felt equally, and we need to have a mind to those who were particularly exposed and vulnerable in our community. It was a few years ago on Masig Island and the Torres Strait Islands where we saw that communities there were working with almost no external support to hold back the coastal erosion using old tires and pallets, anything at their disposal and have been trying so hard to get additional resources to protect their islands and their millennia-old connection to place there. We need to be really listening to and looking out for those on the front lines of this crisis.\"\n\n\n\n\n\nThe Federal Government will deliver its now-overdue new National Climate Risk Assessment and National Adaptation Plan after the election.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/early-childhood-education-alarm-bells-have-long-been-ringing/naw8rp4az",
        "title": "Early childhood education: 'Alarm bells have long been ringing'",
        "publish_date": "Fri, 4 Apr 2025 20:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThere were calls for a royal commission 24 hours after allegations of abuse and neglect were revealed in a number of for-profit operators in Australia's childcare sector.\n\n\n\n\n\nGreens early childhood education spokesperson Senator Steph Hodgins-May led the calls.\n\n\n\n\n\n\"Alarm bells have long been ringing about the condition of state of the for-profit early childhood education sector in this country.\"\n\n\n\n\n\nPrime Minister Anthony Albanese disagrees.\n\n\n\n\n\n\"You don't need a royal commission to show that what was on TV last night was wrong.\"\n\n\n\n\n\nTen days later, the Minister for Early Childhood Education Anne Aly [[ah-lee]] said the federal government would look towards taking stronger action.\n\n\n\n\n\n\"We will also look to strengthen our powers to crack down on dodgy providers that pose an integrity risk to the childcare subsidy system.\"\n\n\n\n\n\nAs Australians became exposed to the diminishing quality of private childcare centres, for childcare educators and teachers like early learning specialist Victoria Mack, it came as no surprise.\n\n\n\n\n\n\"I know that I used to go into centres and I would be thinking, oh my goodness, how would this centre meet all these ratings and assessments? And sometimes they would get exceeding, and that's why I potentially left the other learning consultant role. I was so despondent with it because I thought, are you not seeing what I see?\"\n\n\n\n\n\nSo what has gone wrong with Australia's early childhood education and care system?\n\n\n\n\n\nThe problems within the sector rest on multiple fronts and make for a complicated web of policy, workforce education and regulation issues.\n\n\n\n\n\nTo understand it, we need to look at how early childhood education and care is provided and funded in Australia.\n\n\n\n\n\n“Early Childhood Education and Care in Australia hasn't always been a for-profit enterprise or been available to for-profit providers. So, in the seventies when childcare was originally introduced and funded by the Commonwealth, the system was built around direct subsidies provided to not-for-profit services. And they were able to regulate the qualification levels of staff. The Commonwealth used its funding to position childcare as a public good.”\n\n\n\n\n\nThat was University of Sydney Department of Political Economy Professor Elizabeth Hill explaining the impact government childcare subsidies have had on the sector.\n\n\n\n\n\nThe subsidies support the cost of early childhood education and care - the subsidy is given to families to purchase a service they want to use and is then paid to that service when the child enrols.\n\n\n\n\n\n“But then there was, we've had increased participation of women in, paid work and by the 1990s, there was real pressure on the federal government to expand the provision. And so at that point, federal government subsidies started to be extended to for profit providers, and that really changed the landscape in terms of who owns and who provides those services.”\n\n\n\n\n\nThis gave private investors incentive to open childcare centres to be provided by a mix of for-profit and not-for-profit suppliers.\n\n\n\n\n\nChildcare has become increasingly popular amongst commercial property investors, who can open centres with supportive government funding without being regulated by the government in terms of how they run, staff or locate their centres.\n\n\n\n\n\nEarly Childhood Australia CEO Samantha Page highlights the problems that occur when childcare services are opened as profit-making ventures.\n\n\n\n\n\n“We have what we call childcare deserts, which is where we have no services available to families because the numbers of children are too small or because providers simply have chosen not to go into that community. Particulary in regional and remote areas. We also have a problem with oversupply. So, If you've got too many services in one community, they're all competing for the same pool of staff, for the same children. And half empty services are not good, they're not viable and they're not high quality generally.”\n\n\n\n\n\nThe guidelines for childcare quality regulation are written under the National Quality Framework and enforced by state and territory regulators working under The Australian Children’s Education & Care Quality Authority ((ACECQA)).\n\n\n\n\n\nThe Authority responded to the recent investigations into unsafe for-profit services by taking action against the operators, and trying to ensure that 91 per cent of Australia's services are meeting or exceeding the National Quality Standard.\n\n\n\n\n\nThe government's 2024 Productivity Commission found that these regulators, like most areas of the early childhood education and care sector, are under-resourced.\n\n\n\n\n\nThe early childhood education and care profession is amongst the lowest paid in Australia and has been historically undervalued.\n\n\n\n\n\nProfessor Hill says this is because it's a hyper-feminised workforce.\n\n\n\n\n\n\"The fact that early childhood education and care has been normalised as women's work has meant that it's been historically undervalued. There's been a lot of change in the attitude of the public, but workers are still waiting for that attitude and that revaluation of their work to be reflected in their professional wages.\"\n\n\n\n\n\nThe poor treatment of these educators means students don't choose to study early childhood education past entry level qualifications.\n\n\n\n\n\nEarly childhood specialist Victoria Mack says the profession is viewed as an option of last resort.\n\n\n\n\n\n\"I know even when I was working at TAFE, and we'd have some of the students that they would start their cert three coming through tafe and they would say to us, oh, you're good with children or you're not very good at all maths and science, you're not going to get into uni, so you can just go and do childcare. I think sometimes these young girls go into early childhood and night-long daycare centres, and they don't see another option for them. I mean, I was an early childhood teacher and I had an opportunity to do lots of different things. I've worked overseas in international schools as an early childhood teacher.\"\n\n\n\n\n\nAs a federal election looms, calls have been heard across the sector to address the problems in Australia's early childhood education and care system.\n\n\n\n\n\nThe Albanese government has responded by saying it intends to take action against dodgy providers and improve childcare policy in consultation with state government regulatory bodies.\n\n\n\n\n\nEarly Childhood Australia CEO Samantha Page says it's also time to value early childhood education and care.\n\n\n\n\n\n\"The profession itself is really, very strong. We have a code of ethics, we have teaching standards we have the national quality standards. I think theres a strong and positive identity for early childhood educators and teachers. We need the rest of the country to see that. And we wanna recognise that the people who work in those services are educators and teachers.\"\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/comedy/melbourne-international-comedy-festival-2025-reviews-2-20250402-p5loi1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What’s good (and what’s great) at this year’s comedy festival so far",
        "publish_date": "Sun, 06 Apr 2025 11:59:06 +1000",
        "category": "entertainment",
        "authors": [
            "Cher Tan",
            "Donna Demaio",
            "Elizabeth Flux",
            "Guy Webster",
            "Hannah Francis",
            "John Bailey",
            "Lefa Singleton Norton",
            "Nell Geraets",
            "Sonia Nair",
            "Tyson Wray"
        ],
        "text": "Noah Szto | Med School\n\nACMI, until April 20 He can sing, he can dance, he can perform medical procedures. Newly minted doctor Noah Szto brings together music, comedy and PowerPoint to offer a skew-eyed look into the realities of what it takes to pursue a career in medicine. Med School is at ACMI until April 20. Credit: Ian Laidlaw While Szto does not shy away from getting into the weeds of his particular experiences, he does a deft job of navigating both the specific and the broad. If you are or know someone who is in the medical field, there are enough “in” jokes to make you feel catered to, but not so many to be alienating to everyone else. Yes, this is a show all about medicine and med school, in particular – Szto performs the whole thing in scrubs (and, yes, there is a minor medical procedure as promised). At the same time, if you’ve never set foot in a hospital, the running themes – art v science, prestige over precarity, loss of identity, and being worn down by an institution – extend far beyond the medical field. If you’ve ever had to make the sensible choice over following your passions, the core of this show taps into that complex web of feelings, jazzes it up with a song, a dance and a laugh, and offers up a glimmer of hope.\n\n★★★★\n\nReviewed by Elizabeth Flux\n\nFrankie McNair and Isaac Haigh | The Booth Variety Spectacular & Formal Apology Hour!\n\nArts Centre Melbourne – Members Lounge, until April 20 Tabitha Booth (a resplendent Frankie McNair in character) has been on air for 12 years – you may know her as the Long-Forked Lady. But as she inauspiciously turns 40, she’s being Substance-ed by young upstart Isaac Haigh. What antics can we expect from our favourite emotionally dysregulated silver-screen siren in her final show as host? The Booth Variety Spectacular & Formal Apology Hour! is on at Arts Centre Melbourne until April 20. As soon as you step into the Member’s Lounge, you’re immediately transported into the frenzied hubbub of a live-studio audience. This immersive veracity is maintained throughout – audience members are handed cue cards, the lights go up between the filming of zany segments, and we become privy to the unravelling of both Tabitha and the show as the night progresses. This meticulous attention to detail is mirrored in the set, costumes, ensemble cast and variety show ephemera. Perennially shimmying, McNair has perfected performing a woman perpetually on the brink, while Haigh is impeccable as her smooth, supercilious co-host-turned-interloper. Alice Tovey is our guest comedian of the night and although her contemporary references disrupt the old-world feel of 1969, it’s a solid set. The funniest moments transpire within the many immaculately constructed layers of the show: the action unfolding behind Tabitha as she demurs about turning 40, the televised close-ups of remonstrations, the uproarious ad breaks, and the disconnect between what’s seen to be happening and what’s actually happening in the thrilling denouement.\n\n★★★★\n\nReviewed by Sonia Nair\n\nLou Wall | Breaking the Fifth Wall\n\nComedy Republic, until April 20 The zeitgeist rumbles through every MICF. This year, it’s all about AI, conspiracy theories, truthism and bald-faced lies. Breaking The Fifth Wall is on until April 20. Lou Wall has built an entire show around telling porkies for laughs. Even though we’re told this upfront, the various betrayals, twists and turns that unfold as the hour progresses land perfectly every time. Wall is from the iPad Kid generation of comics for whom multimedia is always close at hand. This forms part of the elaborate set-up as we whiz through PowerPoints, Facebook Messenger recaps, deepfakes and Wall dialling into tense FaceTimes with themself. It’s an amped-up, maxed-out variety hour with a compelling meta-narrative, incorporating games, comedy tunes, sneaky sleight of hand and even some slam poetry. Wall is so relaxed and natural in every guise they inhabit, it’s no wonder we are putty in their hands.\n\n★★★★\n\nReviewed by Hannah Francis\n\nGuy Montgomery | I’ve noticed so many things, It’d be unfair to keep them to myself\n\nAthenaeum Theatre, until April 20 Will he or won’t he? This question (no spoilers as to why) will run through your mind regularly during the offbeat ponderings of Guy Montgomery, who by his own admission is staying in much nicer accommodation since the roaring success of his television panel game show Guy Montgomery’s Guy Mont-Spelling Bee. I’ve Noticed So Many Things, It’d Be Unfair To Keep Them To Myself is on until April 20. Self-deprecating as he warms up the crowd, the show launches with aplomb. On this night, he seems genuinely stunned that – when asked – a bloke in the front row publicly shares his actual email address. Montgomery’s artful play on words, his over-arching smarts and congeniality is lapped up. Thoughts on water temperature, real estate agents and zoos are riotous. It feels like the room is hanging on his every syllable. Each quip is met with laughter. It’s a delightful ride. And ultimately, the burning question that repeatedly surfaces gets answered.\n\n★★★★\n\nReviewed by Donna Demaio\n\nEmma Holland | Don’t Touch My Trinkets\n\nACMI, until April 20 Art lover Emma Holland’s origin story begins with being told off for touching the iconic Capitoline Wolf statue in Rome. Denied this contact, she embarks on a life where she will have unfettered access by making her own, which she displays here for us (but no touching). Don’t Touch My Trinkets is at ACMI until April 20. Credit: Your Local Film Lab Don’t Touch My Trinkets artfully combines physical comedy, props, audience engagement and PowerPoint presentation. Holland has many strings to her comedy bow and plays them to perfection, eliciting delighted laughter from the audience. She works the crowd with ease, using direct eye contact and the smallest of gestures to draw the whole room in. As Holland ends the show, she raises questions about her own relationship to art, creativity and audience. What ethical quandaries does it bring up? Have we become complicit in her weaponising the art form of comedy? It’s an interesting question that Holland ultimately leaves hanging, instead opting for an ending with more laughs.\n\n★★★★\n\nReviewed by Lefa Singleton Norton\n\nAnisa Nandaula | You Can’t Say That\n\nThe Victoria Hotel, until April 20 Anisa Nandaula is disarmingly charming, luring you in with her warmth and candour onstage. She shares how she acclimatised to Australian culture after migrating from Uganda, growing up in blaringly white cities in Queensland. You Can’t Say That is at the Victoria Hotel until April 20. Nandaula’s approach is conversational, from asking audience members casual questions, like their vocation, to more probing ones, such as if they’ve ever cut anyone out of their lives, eliciting interesting responses. For those unnerved by the limelight, she gives them latitude to rebuff her advances by responding with a “bye b—”. This generates an air of comfort, with one attendee chiming in on Nandaula’s enquiry about culturally diverse friendship groups: “There’s black people in Thornbury!” Her set starts off a little awkwardly as she occasionally falters her delivery and doesn’t quite land the punchlines. When she eventually hits her groove, she’s unstoppable, playing out scenarios with a bombastic side-eye and confident strut. If you’re seeking a comedic act that will keep you at ease, Nandaula should be your pick.\n\n★★★\n\nReviewed by Vyshnavee Wijekumar\n\nLizzy Hoo | Deja Hoo\n\nThe Victoria Hotel – Banquet Room, until April 20 If you weighed Lizzy Hoo’s likeability, you’d break the scales. In a testament to her skills, she’s racked up a multitude of television credits – including her 2023 Amazon Prime Video comedy special, Hoo cares!? – since her stand-up debut in 2017. Deja Hoo is on at The Victoria Hotel until April 20. Credit: Chris Hillary Confidently, she poses the question “are you ready for the best night of your life?” before embarking on a fun showcase of witticisms, celebrating her Chinese-Malaysian Irish-Australian heritage. There’s a slew of absorbing stories about dating, brotherly bullying, the joys of living solo and the perfect gift selection for a mother. The audience chuckles along. A line about greyhounds is blooming hilarious. It’s not a Lizzy Hoo show without a tale about dad, Chan Hoo, she says – admitting a quick call to her brother furnishes her with yet another delightful story to share.\n\n★★★\n\nReviewed by Donna Demaio\n\nHarry Jun | Friendship Safari\n\nThe Greek – Apollo, until April 20 Most classic stand-up falls into one of three categories: contrarian edgelord, trauma spiller, affable friend. Luckily, Harry Jun belongs to the latter, and that might just be the whole point of his show. Friendship Safari is at The Greek until April 20. While Friendship Safari is ostensibly about friendship and its complexities, Jun moves swiftly onto other subjects. There are snippets from a previous life as a schoolteacher – among other life stories – with some bemusing curveballs. His past wrangling dead-eyed teen children turns out to be a skill set transferable to bringing high energy to a quiet night. The night I go, only three people are in the audience. Yet, Jun takes it on the chin and delivers the show nonetheless with aplomb, although his brio gives way to a glimmer of defeat at the very end. If every comedian’s got a schtick, Jun’s is trivia. There’s a sense of watching an earnest friend regale you with their learnings and seeing how much fun they have doing it. In a world of chaos and irony, Jun’s sincerity charms.\n\n★★★\n\nReviewed by Cher Tan\n\nSuren Jayemanne | There’s A World Where My Head Ought To Be\n\nMelbourne Town Hall, until April 20 There’s a World Where My Head Ought Be is at the Melbourne Town Hall until April 20. Suren Jayemanne used to sell himself as the guy who gave up accounting to do comedy, but is now turning over a new leaf. When someone else called him an artist, he saw himself as one for the first time. He’s a smart comedian and unafraid to raise the stakes. Jayemanne is also having somewhat of an identity crisis provoked by getting a new photograph for his license. It’s worse than you think. In his photo, he’s a white woman. His time waiting at VicRoads has Jayemanne considering the divine within ourselves, and he thinks we should all be considering it, too. It’s the kind of smart comedy brave enough to bring big questions into the room and rely on the gravity of the story to bring the humour. The result is a satisfying show with something to say.\n\n★★★\n\nReviewed by Lefa Singleton Norton\n\nAlanah Parkin | Garage Sale\n\nDouble Tree by Hilton, until April 6 Allow yourself to be transported to Narre Warren South (39 kilometres south-east of Melbourne) for Alanah Parkin’s debut solo show, where older couple Denise and Greg are downsizing – hence, holding a garage sale. Garage Sale is at DoubleTree by Hilton until April 6. Among the sale items strewn across the stage are hats, scarves, doilies and a video porn collection. A wonderfully unpredictable, somewhat chaotic, 50 minutes of escalating comedy-drama ensues, presented by a variety of lively, absurd characters. Grandma is a hoot. A litany of giggles follows as the audience is invited to participate in a Jane Fonda-esque workout routine. Video and voiceover vignettes allow Parkin to dart backstage for necessary costume changes, giving rise to amusing moments. Clearly gifted, Parkin revels in gloriously ridiculous scenarios (picture a poetry-reciting rag-doll or a self-help guide for aged-out choir boys) in a quirky show that takes a rather unexpected turn.\n\n★★★\n\nReviewed by Donna Demaio\n\nPierre Novellie | Must We?\n\nThe Westin, until April 18 It’s easy to warm to this giant Millennial good boy in a baby-blue suit. His crisp delivery and Attenborough-esque enthusiasm might not endear him to the more blokey comedy crowd, but anyone at the Douglas Adams end of the humour spectrum will find themselves in good hands here. Must We? is at The Westin until April 18. He’s a detail guy: an impromptu bit of audience banter has him noting that our shrinking chocolate teddy bear snacks are due to illegal gold mining in Ghana. His brain carries a lot that way. The show’s first third is likeable if not groundbreaking guy-with-a-mic bizzo, but the remainder is tighter and generates those barks of recognition that fine observational comedy evokes. The show sticks the landing, too, with a quietly insistent reminder that stand-up, like society, must be a broad church if its members are to survive. (And for the blokes: denim condoms.)\n\n★★★\n\nReviewed by John Bailey\n\nAlex Ward | Clip Clop Don’t Stop\n\nSwiss Club, until April 20 Do you have pretty privilege? You probably don’t know if you do, according to how the theory goes. Alex Ward is convinced she has something similar: pretty approachable. That’s where you have a face that welcomes everyone and anyone to strike up conversation, ask you for directions or assume you work here … wherever here happens to be. Clip Clop Don’t Stop is at the Swiss Club until April 20. Being approachable has led to some entertaining situations, which Ward easily wins over her audience by telling us about. This show is filled with likeable banter and quick jokes. Mostly the target of her humour is herself, making her material all the more approachable. It’s relatable humour to go with her relatable face. This is a neatly structured show which takes satisfying sidetracks, entertaining diversions and clever callbacks. The audience keeps up a steady rate of laughter throughout. It takes skill to make it look this easy, which Ward does.\n\n★★★\n\nReviewed by Lefa Singleton Norton\n\nZoë Coombs Marr | The Splash Zone\n\nMelbourne Town Hall, until April 20 Zoë Coombs Marr is a master of meta. Her fast-paced comedy can be variously subversive, confoundingly circular and wildly clever. The Splash Zone is a light-hearted offering – and about as straight up and down as Marr gets. The Splash Zone is at the Melbourne Town Hall until April 20. Credit: Christa Holka We hear of growing up in Grafton, in northern NSW, life-defining moments that arrive while waiting for a train, Aussies abroad and Americans Down Under, and Trump-loving patrons who seem a bit lost. References to ADHD and audience distractions collide with commentary on social fragmentation, conspiracy theories and the growing disconnect between thoughts and facts. As a whole, the show relies too much on said audience distractions and cultural references. Some of the punchlines are predictably daggy, but the fans lap them up. While Marr’s award-winning character, Dave, skewered gendered structures in comedy to perfection almost a decade ago, a sidebar here about nasty male comedians misses the mark at a festival that has made increasing efforts to celebrate diversity in recent years. It’s early in the run, but Marr’s latest offering feels somewhat disjointed itself. Then again, perhaps that’s the point.\n\n★★★\n\nReviewed by Hannah Francis\n\nAmy Gledhill | Make Me Look Fit On The Poster\n\nThe Westin, until April 5 We’re barely two minutes into Amy Gledhill’s show and the audience is already swinging underwear in the air. Make Me Look Fit On The Poster is at The Westin until April 5. Just to be clear, no one was actually undressing – but having a show start with strangers handling mysterious undergarments certainly loosens a crowd up. This is what Gledhill’s stand-up is all about – stripping down to crack up. Fresh off the back of her award-winning Edinburgh Fringe Festival run, she shares personal tales like she’s chatting with a best friend. We learn about her experiences of “cursed” oral sex, and the time she mistook Stranger Things’ Finn Wolfhard for a “little tiny orphan boy”. Sprinkled in between the gags, she confides in us about her admittedly low self-esteem and warped body image.\n\nLoading Granted, not every yarn sticks the landing – a three-minute spiel about how much toilet paper she accumulates fizzles hard – and some of her references are too British to translate to an Australian crowd. But what she lacks in knee-slapping punchlines, she makes up for in both physical comedy (her re-enactment of dangling from a tree like a “little ginger bauble” was chef’s kiss) and genuine relatability. Maintaining knicker-swinging energy for an hour is no easy feat, but Gledhill gives it a fair crack.\n\n★★★\n\nReviewed by Nell Geraets Flo & Joan starring George Fouracres | One Man Musical\n\nArts Centre Melbourne - Fairfax Studio, until April 20 Comedic duo Flo & Joan have built a show around the idea that nothing brings people together like hating Andrew Lloyd Webber. They’re back this year with a 60-minute, high-energy tour of the man they describe as a legendary “cockroach of the West End”. Or, for legal reasons, a purely farcical one-man show about a random cat-loving narcissist who loves organ-heavy riffs and hating Lin-Manuel Miranda.\n\nThe show was a runaway hit at Edinburgh Fringe last year. Part-swansong, part-musical biopic, Flo & Joan fill the show to the brim with biographical details and melodic parodies of Webber’s classic style. Meanwhile, actor George Fouracres plays a short-tempered and entitled Webber, sitting on a throne dressed in purple velvet as he swings from the self-obsessed showstopper, All About Me, to nostalgic ballads mourning his glory days. One Man Musical is on at Arts Centre Melbourne until April 20. Moments that parodied Webber stood out over those that simply recounted his life. One scene, backed by bubble machines and technicolour lighting, married creative pastiche and biography spectacularly. But the show ultimately struggles to make the leap from Fringe venue to the Arts Centre’s Fairfax Studio. Loading Muted sound design left Fouracres out in the cold, making his high-octane delivery style seem overzealous and his high-pitched vocals like an attempt to overcompensate by yelling. It’s a bit grating. But for that reason, maybe One Man Musical has perfectly captured what it might be like to spend an hour with this living legend – for better or for worse.\n\n★★★\n\nReviewed Guy Webster\n\nJude Perl Tries To Finish A Sentence\n\nArts Centre Melbourne – The Show Room, until April 20 As the title of this show suggests, Jude Perl finds herself unable to say anything that doesn’t upset someone and is hyper focused on using “correct” language when expressing herself. Hence, why she can’t finish a sentence unless she’s belting out tunes on her piano. Jude Perl Tries To Finish A Sentence is at Arts Centre Melbourne until April 20. There’s something interesting to be said about the age of moral outrage we’re currently in and the polarised views that rest on either end of the spectrum. But Perl’s prevaricating show veers perilously close to embracing moral ambiguity at a time when crusades are being waged against “wokeism” and clear-eyed renunciations of injustice are being met with suppression. The framing of Perl’s show is such, but the scaffolding is weak as well. Perl inhabits different characters – a sentence mentor, an uncouth best man at a wedding, a cancelled pop star of yesteryears – to express the difficulty of forming a thought in the oversaturated world we live in and the corrosive power of nostalgia.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-updates-labor-s-4000-home-battery-subsidy-liberal-candidate-named-in-settlement-dad-vote-crucial-for-albanese-20250406-p5lph5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Dutton spruiks foreign student cuts to get young Australians into homes; Albanese campaigns on $4000 home battery subsidy",
        "publish_date": "Sun, 06 Apr 2025 11:47:33 +1000",
        "category": "finance",
        "authors": [
            "Olivia Ireland"
        ],
        "text": "Finishing his speech, Albanese said his party didn’t “beg and borrow” from other ideologies, but built its own.\n\nIn a subtle dig against Dutton’s policies that Labor is saying are similar to Trump’s, Albanese said Labor stood up for Australian values.\n\n“We don’t beg and borrow ... ideologies from anywhere else in the world. We build on our values, fairness and opportunity for all,” he said.\n\nPrime Minister Anthony Albanese holds up his Medicare card. Credit: Alex Ellinghausen\n\nAlbanese added Labor would never copy America on healthcare, education and social policies.\n\n“The future that we want is not an American-style wages system or American levels of student debt and never, ever American healthcare ... in this time of uncertainty, we should not try to be more like someone else or somewhere else. We only need to trust in what makes us Australian, a place in the world, our values, our people,” he said.\n\n“These are uncertain times, but I am absolutely certain of this. This is not a time of cutting and wrecking, of thinking small, punching down, aiming low, or looking back. This is a time for building, building the stronger Medicare that Australians deserve.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/billionaires-poised-to-lose-nearly-a-trillion-dollars-in-two-days-20250405-p5lpgw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Billionaires poised to lose nearly a trillion dollars in two days",
        "publish_date": "Sun, 06 Apr 2025 11:33:13 +1000",
        "category": "finance",
        "authors": [
            "Dylan Sloan"
        ],
        "text": "The world’s 500 richest people suffered the biggest two-day loss ever on the Bloomberg Billionaires Index as fallout from US President Donald Trump’s tariff announcement decimated markets across the globe.\n\nBillionaires on the wealth list lost a collective $US536 billion ($887 billion) from Thursday’s sharemarket open to Friday’s close as the S&P 500 Index dropped 10.5 per cent over the two days and the Nasdaq Composite fell 11.4 per cent.\n\nBillionaire hit: Mark Zuckerberg (left) and Elon Musk. Credit: AP\n\nFriday’s $US329 billion drop was the largest since the height of the COVID-19 pandemic in 2020, swamping Thursday’s $US208 billion slide. Almost 90 per cent of the billionaires tracked by the wealth index saw their fortunes fall on Friday, with an average decline of 3.5 per cent.\n\nNo one lost more over the two-day stretch than Tesla chief executive Elon Musk. The carmaker’s stock plunged more than 10 per cent on Friday, dragging Musk’s net worth down $US31 billion from Thursday’s open and bringing his yearly losses to $US130 billion.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-s-tariffs-raise-risk-of-global-recession-this-year-to-60-percent-jp-morgan-warns-20250406-p5lphu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s tariffs raise risk of global recession this year to 60%, JP Morgan warns",
        "publish_date": "Sun, 06 Apr 2025 11:27:23 +1000",
        "category": "finance",
        "authors": [
            "Eir Nolsoe",
            "Louis Goss"
        ],
        "text": "Meanwhile, Britain’s weaker economy coupled with the Treasury’s razor-thin headroom leaves the UK exposed to a “negative spiral” similar to Greece’s debt meltdown a decade ago, according to one of the world’s biggest investment firms. Neil Robson, the head of global equities at Columbia Threadneedle, said Britain’s £2.8 trillion ($6 trillion) debt pile, which nearly outstrips the size of the economy, leaves it vulnerable as Trump’s tariffs increase the risk of a global recession. Robson said: “We have had a Liz Truss moment here in the UK. Could we have a Labour version of that? Possibly. I think it’s quite likely.” He said Britain’s current financial situation mirrored the lead-up to the eurozone meltdown when bond markets turned aggressively against Greece when investors suddenly realised the country could not balance its books.\n\nHe said: “If you think about the problem of being very indebted, you can be as indebted as you like as long as your nominal growth is higher than your interest rate.” “But if ever your nominal GDP growth stalls – not just on a temporary basis – below your interest costs then you’re in a real negative spiral, and it can move really quickly. We saw that with Greece during the great financial crisis.” British Chancellor Rachel Reeves had banked on faster economic growth to offset the UK’s rising debt bill over the next five years, but an expected economic slump from The the US president’s trade war has left that plan in tatters. Trump slapped a flat 10 per cent tariff on all nations, rising to as high as 50 per cent for the worst off. Although Britain escaped with the flat 10 per cent rate, its exposure to the global economy means growth forecasts are likely to be pared back and could trigger a crisis for UK debt, known as gilts, which are bought and sold by global investors.\n\n‘Double blow’ for Britain Bruno Schneller, the managing partner at Erlen Capital Management, warned that the bond markets could turn against the UK if investors lose faith in Reeves’s economic plan. Loading “ Trump’s tariff blitz risks triggering a global stagflation shock – and for the UK, that’s a recipe for a gilt crisis,” he said. “Slower growth, higher inflation and a jittery investor base could combine to push UK borrowing costs higher at the worst possible time. This isn’t just trade war fallout; it’s the kind of external shock that can crack already fragile debt markets.”\n\nHe added: “Trump’s tariffs could deal a double blow to the UK – stalling global growth while fuelling inflation. That’s a nightmare for any chancellor trying to stabilise debt. If markets lose confidence in the UK’s fiscal path, a gilt sell-off isn’t just possible – it’s probable.” It follows a dramatic week for the global economy after the scale of Trump’s tariffs blitz caught markets by surprise. The turmoil also prompted JP Morgan to raise the risk of global recession this year to 60 per cent from 40 per cent as investor panic rattled stock markets around the world. Federal Reserve chairman Jerome Powell said the US president’s tariff increases were “significantly larger than expected”. Credit: AP Although UK gilts have been boosted so far by Trump’s tariffs, investors have warned this could soon change.\n\n“If Trump doesn’t course-correct, this crisis will affect many different areas in global markets,” said Harald Berlinicke, a partner at Sarnia Asset Management. Risk of more tax rises The gloomy message comes shortly after the chancellor slashed welfare benefits to restore £9.9 billion of fiscal headroom at the Spring Statement. The Office for Budget Responsibility warned that in a worst-case scenario, a full-blown trade war risked wiping out all the margin of error she had left herself against her fiscal rules. This means that after a record £40 billion tax-raising budget in October, Reeves may be forced to come back for more tax increases in her autumn Budget. Trump has vowed to persist with his aggressive tariffs despite last week’s market bloodbath, insisting “it’s going very well” and that the economy is “healing”.\n\nLoading The turmoil would be “something we are going to remember for a very long time”, Robson said. “Risks of recession have clearly gone up. I don’t see why there won’t be a recession at the moment. It’s difficult to see what the solution is unless America walks back on this,” he said. Some of the world’s most important financial leaders have warned Trump that his aggressive trade policies will wreak havoc by depressing growth and fuelling inflation. Jerome Powell, the chairman of the US Federal Reserve, said on Friday that the president’s tariff increases were “significantly larger than expected” and so the same would “likely be true of the economic effects”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/upset-result-on-tszyu-undercard-20250406-p5lpj2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Upset result on Tszyu undercard",
        "publish_date": "Sun, 06 Apr 2025 11:18:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "Upset result on Tszyu undercard\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-cyndi-lauper-20250403-p5lot6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Sex Pistols return to Melbourne in a tour Johnny Rotten describes as ‘karaoke’",
        "publish_date": "Sun, 06 Apr 2025 11:03:19 +1000",
        "category": "entertainment",
        "authors": [
            "Will Cox",
            "Andrew Fuhrmann"
        ],
        "text": "MUSIC\n\nCyndi Lauper: The Farewell Tour ★★★★\n\nRod Laver Arena, April 2 Cyndi Lauper walks on stage to an explosion of rainbow confetti and dives straight into She Bop, an ode to masturbation. She’s 71 years old, 160 centimetres tall, and exuberant as hell in blue-green hair, blasting through a recorder solo before chucking the instrument offstage. Cyndi Lauper performs at Rod Laver Arena, April 2, 2025. Credit: Martin Philbey The crowd are in tulle skirts, glitter and colourful wigs, which are on sale in the foyer – the money goes to her charity, Girls Just Wanna Have Fundamental Rights. Tonight is supposedly part of Lauper’s farewell tour, and she’s going out on top. She still has a voice like a box of crayons, bright, messy, and expressive. She uses everything, with soaring vibrato, sometimes audibly out of breath, imprecise and alive. The set is ’80s-heavy, leaning most on her ’83 debut She’s So Unusual, with some middle-of-the-road ’90s stuff and, to my delight, the song she did for The Goonies thrown in.\n\nIt’s a talky night. “It’s not just a bang-bang show,” she says unapologetically in her irresistible Brooklyn drawl (“It’s a paww-deee!”). She tells us about family, the cousin who had a pigeon coop on her roof, the women who raised her and the way they’d cut up old clothes and make something brand new with them. She does the same with her art, of course. Many of her songs are written by others but she makes them utterly her own. She tells us she recorded I Drove All Night, written for Roy Orbison, because there were no songs on the radio about women driving. “When you get in the car and you can drive anywhere you freakin’ want, that’s a power song.” Tonight is supposedly part of Lauper’s farewell tour, and she’s going out on top. Credit: Martin Philbey She cycles through about half-a-dozen costume changes, each with a different hair colour: sparkly, shoulder-padded jackets, asymmetrical suits, underwear on the outside, a floor-length Norma Desmond number, a red jacket with a bright yellow wig. “I tried to dress up faw ya,” she says. As this outfit’s designer Christian Siriano told her: “The gays want glamour.” For the evergreen Time After Time, Melbourne’s Tones and I joins for a duet that’s like every wedding dance floor you’ve ever been on: messy and beautiful. And she delivers True Colours flawlessly, standing on a small satellite stage in the middle of the arena with a long rainbow scarf metres in the air.\n\nFor the finale, Girls Just Wanna Have Fun, she’s joined by The Veronicas, who sink into the background in a stage designed in polka-dot tribute to artist Yayoi Kusama. Even this, her signature tune, is a cover of a late-’70s pop-punk number, sung by a man, but I defy you to listen to that original and think of it as anything less than a sketch for Lauper to colour in and make something wonderful, defiant and punch-the-air fun.\n\nReviewed by Will Cox DANCE\n\nPoesis and The Bastard ★★★\n\nDancehouse, Carlton, until April 5 The latest Dancehouse double bill features two works that differ wildly in their commitments to technique and virtuosity, but which together make for an invigorating and provoking evening of dance theatre. Gabriella Imrichova’s cheekily titled The Bastard aims to challenge expectations with a surprising blend of theatre, performance art and only little dance. It’s a bit punk and a bit mongrel, but consistently funny.\n\nThis is a performance in two halves. First, we get a dry parody of non-dance, a somewhat dated form of experimental dance in which movement is withheld: it’s slow and repetitious and very low effort. Loading Either side of this performance, Imrichova addresses the audience, simulating apprehension about its reception: about whether it fits the context and whether it works as dance. It’s mischievous but not without charm. Then follows a wild rant about art and novelty. There were a few walkouts on opening night, but that’s surely a victory for an artist who declares that trolling is a creative practice. Prue Lang’s Poesis sits more securely within the conventions of contemporary dance. It’s a duet in which the two dancers generate striking compositions from subtle contrasts in form, line and intention.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/tizzano-stars-in-force-five-try-win-over-highlanders-20250406-p5lpin.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tizzano stars in Force five-try win over Highlanders",
        "publish_date": "Sun, 06 Apr 2025 10:39:27 +1000",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "The Western Force have jumped to fourth spot on the Super Rugby Pacific ladder after coming from behind to post a 29-20 bonus-point win over the Highlanders in Perth.\n\nThe Force trailed 20-7 in the 27th minute of Saturday night’s match at HBF Park before piling on the next 22 points to seal the five-tries-to-two win.\n\nIt catapulted the Force (4-4) from eighth to fourth heading into their bye week.\n\nCarlo Tizzano (centre) scored his 11th try of the season as the Western Force beat the Highlanders. Credit: AAP\n\nThe Highlanders (2-5) are in ninth following their fourth straight defeat.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/pakistani-cricketer-afghan-fans-in-fiery-exchange-20250406-p5lpig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pakistani cricketer, Afghan fans in fiery exchange",
        "publish_date": "Sun, 06 Apr 2025 10:04:26 +1000",
        "category": "sports",
        "authors": [],
        "text": "Pakistani cricketer, Afghan fans in fiery exchange\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/mourinhos-bizarre-act-against-rival-manager-20250403-p5lotb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mourinho's bizarre act against rival manager",
        "publish_date": "Sun, 06 Apr 2025 09:19:27 +1000",
        "category": "sports",
        "authors": [],
        "text": "Mourinho's bizarre act against rival manager\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/movies/is-there-anything-left-to-learn-about-the-beatles-20250404-p5lp8l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is there anything left to learn about the Beatles?",
        "publish_date": "Sun, 06 Apr 2025 09:03:29 +1000",
        "category": "finance",
        "authors": [
            "The Economist"
        ],
        "text": "In 1967 Bryan Magee, a British philosopher and author, noted that 40-year-old songs by the likes of George Gershwin, Cole Porter and Jerome Kern still had wide currency. Given an “indifference to melody in favour of rhythm and intriguing new sound mixtures”, he doubted that the songs of the 1960s would fare so well. “Does anyone seriously believe that Beatles music will be an unthinkingly accepted part of daily life all over the world in the 2000s?” he dared to ask.\n\nFab Four: (from left) Paul McCartney, John Lennon, Ringo Starr and George Harrison in 1968. Credit: AP\n\nThe question now seems daft. Today, Eleanor Rigby, Norwegian Wood and Yesterday are widely judged to hold their own in the company of American songbook classics. But there is more to the Beatles’ continuing currency than the songs, and more, too, than the performances and recordings (those “intriguing new sound mixtures”) that made them known. In a way, it would be unreasonable to blame Magee for missing that the invention of teenagers as a market and television as a medium changed what it was to be famous. And they did so through the Beatles, making them the very model of a sort of fame that is still around 60 years on.\n\nMcCartney and Lennon: Friends and rivals in a partnership that changed the world. Credit: AP\n\nThe combination of songs and story means the Beatles remain fascinating; the fact that they are still fascinating means there is a market for fresh stories about them. And, happily, in recent years, those works have been good enough to add to the fascination rather than tapping it out.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/horrified-the-renewal-project-that-obscured-this-coastal-town-s-best-asset-20250404-p5lp6u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Horrified’: The renewal project that obscured this coastal town’s best asset",
        "publish_date": "Sun, 06 Apr 2025 09:00:00 +1000",
        "category": "finance",
        "authors": [
            "Benjamin Preiss"
        ],
        "text": "Residents of Port Campbell love to gaze out upon the ocean in all its moods from various vantage points in the south-west Victorian town.\n\nThe bay at Port Campbell attracts swimmers, fishers and surfers, with the wild Southern Ocean just beyond the cliffs. The stunning views are among the town’s best-loved features.\n\nRecently, the Corangamite Shire has been carrying out rejuvenation works in Port Campbell. The foreshore and main streetscape have been updated. There are new retaining walls, lawns and road improvements.\n\nSue Younis with the works at Port Campbell. Credit: Nicole Cleary\n\nBut among the most contentious works are a series of viewing decks under construction beneath towering Norfolk Island Pines overlooking the water. Critics of this part of the project argue the sweeping views of their beloved bay from one favoured section has been replaced by angular wooden barriers rising from the decks.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/take-the-age-quiz-20230608-p5df2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Take The Age quiz",
        "publish_date": "Sun, 06 Apr 2025 08:59:35 +1000",
        "category": "finance",
        "authors": [],
        "text": "WHERE AM I?\n\nWhere is this cathedral located? Credit: Wayne Taylor\n\nThis cathedral was consecrated in 1967 and is headed by Australia’s highest-ranking Catholic, who is also the world’s youngest cardinal. Where is it located? Check next week’s quiz for the answer.\n\nLast week’s WHERE AM I? The Flinders Street Station ballroom is located on the upper levels of the train station.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/the-amazing-feature-which-could-take-over-aussie-roads-footpaths-and-airports-213520773.html",
        "title": "The 'amazing' feature which could take over Aussie roads, footpaths and airports",
        "publish_date": "2025-04-05T21:35:20Z",
        "category": "finance",
        "authors": [],
        "text": "Glow in the dark paint has already been trialled on roads in two Aussie states, and one business would love to see it 'everywhere'.\n\nAustralia has an extensive road network that reaches some of the most isolated places in the world. But if you're one of the many 4WD or caravan adventurers or have been on a long road trip, you'll know first-hand that some of our most important roads aren't as well lit as they should be.\n\nThis fact prompted Transport for NSW to trial a new technology on a notoriously dangerous highway in a bid to increase driver safety and help motorists \"better see line markings\" in areas with low visibility.\n\nNow, pioneers in the road industry believe that the glow-in-the-dark technology could be used on roads, footpaths, bike paths, helicopter landing pads and air strips in a bid to improve visibility and safety.\n\nClive Todd, founder of Lihten, told Yahoo News that after having a serious car accident, he was compelled to work to improve safety on roads across the world. He'd like to see innovative glow paint used \"anywhere and everywhere\" it could improve safety.\n\nADVERTISEMENT\n\n\"I want it to be in the key places which would help save lives,\" he told Yahoo. But it's \"not about wanting to sell a lot of glow paint\", he said. \"It needs to be in the right places and for the right objective.\"\n\nNSW is trialling glow-in-the-dark road lines along a notoriously dangerous stretch of highway south of Sydney. Source: Supplied/TfNSW\n\nMost dangerous time to drive on roads is at night\n\nResearch conducted by the Federal Bureau of Infrastructure and Transport Research Economics (BITRE) showed that 1,300 people died on Australian roads in 2024 — up from 1,258 in 2023. The most dangerous time to be driving is, at night. Between the hours of 7:00pm – 10:00pm as 34 per cent of deaths occur during this time.\n\nWith authorities hoping to achieve the ambitious goal of achieving zero deaths and serious injuries by 2050, drastic action needs to be taken.\n\nTodd believes the luminescent paint could be the answer. \"It's environmentally friendly, it saves electricity and it could save people's lives,\" he said.\n\nADVERTISEMENT\n\nHe was inspired to develop the idea after being asked to work on a footpath project in Saudi Arabia. After extensive research, he found a supplier in France, and has already implemented the paint, known as LuminoKrom, on a footpath and bike path in Blacktown, Sydney.\n\nA chemical in the paint makes it glow after being activated by sunlight. Todd likens it to the chemicals inside fireflies or glow worms that make them glow in the dark.\n\nOne drawback, however, is that it is costly to implement. \"Some people say it’s expensive, I say it’s high value,\" said Todd. He believes there would be \"significant advantages\" to the paint being used not only on roads and footpaths but also on helicopter landing pads, on the tops of emergency vehicles, as well as on outback airstrips used by the RFDS.\n\nWhere in Australia are there glow-in-the-dark roads?\n\nIt comes after Victoria conducted a similar trial in 2022, with the line markings added to a 1km section of Metong Road in the state's southeast in May by Tarmac Linemarking, in collaboration with OmniGrip and Vic Roads. But back in July of this year, a VicRoads spokesperson told Yahoo the experiment was discontinued.\n\nADVERTISEMENT\n\nThey said an independent evaluation conducted once the trial had concluded determined there was insufficient road safety benefits to justify adding more of the fluro lines to the state's roads, effectively axing any hope of the $4 million scheme being rolled out further.\n\nIn New South Wales, the Bulli Pass trial uses the glow-in-the-dark thermoplastic feature on a small stretch of road, with insiders 'excited' to see its benefits.\n\n\"Being able to see the shape of the road ahead is critical to safe driving and that’s what Glow Roads do,\" NSW's Minister for Roads John Graham said. \"Data shows around a third of fatal crashes in NSW happen at night. If this trial is deemed a success, we will look at its application on other locations with a history of crashes or near-misses where better visibility is needed. The trial is nearly over — with many waiting with bated breath to see the results.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/tradies-cheeky-bunnings-act-prompts-warning-cant-support-that-052417418.html",
        "title": "Tradie's cheeky Bunnings act prompts warning: 'Can't support that'",
        "publish_date": "2025-04-05T05:24:17Z",
        "category": "finance",
        "authors": [],
        "text": "Hundreds and thousands of Aussies were in stitches after watching an apprentice's bold move at Bunnings.\n\nA cheeky trend emerging in Bunnings stores has prompted the hardware giant to weigh in. Source: TikTok/Getty\n\nA tradie and his apprentice have started a cheeky trend in Bunnings stores across the country, prompting the hardware giant to weigh in.\n\nDescribing it as a \"bit of harmless fun\", Brad, owner of decking and landscaping company HC Urban shared a video encouraging others to play Jenga with a pallet of timber at his local store in Perth.\n\nHe told Yahoo News that after sharing a video of an apprentice poking a piece of timber out of the middle of the pile and putting it on top, he was inundated with \"countless\" pictures and videos by people \"having a laugh\" by following suit.\n\nThe trend started after an off-the-cuff comment telling his apprentice that the pile of timber looked like a \"big Jenga set\".\n\nADVERTISEMENT\n\n\"It progressed from that,\" he told Yahoo. \"We’ve been doing it for a while but thought let’s make it [video] and see if everyone else can get around it for a bit of harmless fun,\" he said.\n\n\"Knowing that all Bunnings have the same layout, [we thought] hopefully everyone can join in the fun.'\n\nHundreds and thousands of Aussies who have seen the video have reacted to the funny scene, and while some couldn't wait to get to their local hardware store to give it a try, others said they've been told off for being caught doing it.\n\nBunnings weighs in on Jenga trend\n\nWhile Bunnings Director of Stores, Rod Caust, said he \"loves\" to see people having fun in stores, \"stacking timber like a giant Jenga tower isn’t quite what we had in mind.\"\n\n\"The safety of our team and customers is our number one priority, so we can’t support anything that puts anyone at risk,\" he said.\n\nADVERTISEMENT\n\n\"We ask our customers to keep the Jenga battles to the backyard, but if you need timber for a project — or a DIY Jenga tower — our team is always happy to help you stack it safely.\"\n\nHardware giant 'highly sought after' tactics to attract tradies\n\nIt was recently suggested Bunnings uses a clever tactic to lay out its stores, with one shopper noticing that some are designed \"in the order\" of building a house. \"It starts with timber, and then we go to plumbing, then flooring, electrical and then paint and landscaping,\" she said, adding that they are \"all in the order that you would do things\".\n\nAnother little-known perk sees Bunnings offer tradies a special breakfast targeted at their most loyal customers. Electrical apprentice Eleanor Gleeson previously told Yahoo News Australia that attending the breakfast is a \"rite of passage\" for those who work in trades and the merchandise handed out as freebies is \"highly sought after\".\n\nADVERTISEMENT\n\n\"Trade breakfasts are a morning event where they have free breakfast and coffees for tradies,\" the New Zealander told Yahoo, adding that it's also a chance to grab some merch and chat with suppliers and other tradies in the industry.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]