[
  {
    "url": "https://www.9news.com.au/world/british-monarchy-will-receive-around-180-million-in-government-funding-annual-report-shows/fa321086-03ef-49e8-8308-79f8363790b0",
    "title": "British monarchy will receive around $180 million in government funding",
    "publish_date": "Tue, 01 Jul 2025 01:10:39 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "The British Royal Household released its financial statement on Monday, revealing that the annual lump sum from the government remained at £86.3 million ($AU180 million).\n\nThe sum, called the Sovereign Grant, pays for the upkeep of royal palaces and the royals' official duties and is funded by British taxpayer money.\n\nIn return, the monarch hands over all profits from the Crown Estate — which includes vast swathes of central London property, the Ascot Racecourse and the seabed around England, Wales and Northern Ireland — to the government, in an arrangement dating back to 1760.\n\nThe sum, called the Sovereign Grant, pays for the upkeep of royal palaces and the royals' official duties and is funded by British taxpayer money. (Getty)\n\nThe Sovereign Grant functions like an expense account for the monarch and their representatives, covering the costs of their public duties, including travel, staff, and upkeep of historic properties.\n\nNotably, it excludes funding for security, which also incurs a high cost given the royals' numerous public engagements and events.\n\nRoyal family members undertook more than \"1,900 public engagements in the UK and overseas, while more than 93,000 guests attended 828 events at Official Royal Palaces,\" the annual Sovereign Grant Report said.\n\nThe total grant of £86.3 million ($180 million), which by law remains the same as the three previous financial years, is comprised of a £51.8 million ($108 million), core grant and £34.5 million ($72.6 million) to fund the refurbishment of Buckingham Palace.\n\nBuckingham Palace is undergoing a major modernisation project that will see upgrades to cabling and accessible bathrooms. (Getty)\n\nBuckingham Palace, a top tourist attraction in central London, is undergoing a major modernisation project that will see upgrades to electric cabling, pipework, elevators and accessible bathrooms.\n\nThe royal family will decommission the royal train \"following a thorough review into its use and value for money,\" according to the accounts report.\n\nThe monarchy has been using its own rail travel since Queen Victoria first boarded a specially built carriage from Slough, England, to London Paddington Station in 1842.\n\nThe report also said the Royal Household will increase its use of sustainable aviation fuel (SAF) and continue the electrification of its fleet of vehicles.\n\nLast year, the Royal Household announced it aimed to transition to an \"almost fully electric\" fleet of vehicles, without providing a target date.\n\nBritain's PA Media reported that the King's two Bentleys would be modified to run on biofuel.\n\nREAD MORE: Gunman who set blaze to ambush firefighters in US identified\n\nThe level of funding for the British royal family has long fueled criticism. (Getty)\n\nThe royal family's three main sources of income are the Sovereign Grant, the Duchy of Lancaster and Duchy of Cornwall estates and their personal property and investments.\n\nThe level of funding for the British royal family has long fueled criticism, with one anti-monarchy group calling for the Sovereign Grant to be abolished and for the British public to keep all the profits of the Crown Estate.\n\n\"The grant system is mad. Funding goes up not because of any need for extra money, but because the grant is linked to government profits from land managed by the Crown Estate,\" Graham Smith, a campaigner for the group Republic, said in a statement earlier this year.\n\n\"The palace has recycled the excuse of needing the money for refurbishment of Buckingham Palace, an excuse used to double the grant ten years ago.\"\n\n\"It's time that half a billion pounds was put to good use, that there was proper accounting for the cost of the monarchy and for that cost to be slashed to just a few million pounds,\" Smith added.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/tax-return-2025-when-is-the-best-time-to-lodge-refund-explained/85b8c807-ea2a-4037-ac3a-c6dfdab2d381",
    "title": "When's the best time to lodge your tax return? Experts reveal the 'sweet spot'",
    "publish_date": "Tue, 01 Jul 2025 01:26:07 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "Today marks the start of a new financial year and Australia's 'tax season' and millions of Australians will be eager to receive a cash injection in the form of a tax refund.\n\nSo when is the best time to lodge your tax return f﻿or the 2024-25 financial year?\n\n﻿According to three experts, the \"sweet spot\" falls a few weeks after tax season starts.\n\nToday marks the start of a new financial year and Australia's 'tax season'. So when should you lodge? (Getty Images/iStockphoto)\n\nMark Chapman, Director of tax communications at H&R Block, said mid-July to mid-August is usually the best time for Australians expecting a tax refund.\n\n\"The first week of tax season is basically just wasted time, because you're not going to get your refund any quicker,\" he told 9news.com.au.﻿\n\nThat's because the ATO doesn't actually start paying refunds until about a week into the month, regardless of how early you lodge your tax return.﻿\n\nIf you're expecting a tax bill, however, it might be better to wait until closer to the October 31 deadline so you can save up extra cash to cover the bill.﻿\n\n\"You don't actually have to pay the tax until you lodge,\" Chapman said.\n\nRevealed: The 10 richest postcodes in Australia View Gallery\n\nChartered Accountants Australia and New Zealand (CA ANZ) tax expert Susan Franks told 9news the best time to lodge your tax return may depend on your income sources.\n\n\"If you only earn salary or wages and interest, then just waiting a few weeks and lodging in August will probably be a safe sweet spot,\" she said.\n\n\"If you earn some dividend income as well, you'd wait a little bit longer to maybe the end of September.\n\n\"And if you have investments in a unit trust, then you'd probably wait until October and lodge it before 31 October.\"\n\n﻿CPA Australia Tax Lead Jenny Wong also cautioned Australians against lodging too early, as it can lead to mistakes.\n\nA lot of pre-fill tax return information, including wages and interest, isn't available until mid-July.﻿\n\n﻿Individuals can fill out these details themselves if they don't want to wait for the pre-fill information but those who do run the risk of getting it wrong.\n\n\"One of the biggest and most common mistakes taxpayers will make this tax time is rushing to lodge their returns early,\" Wong told 9news.\n\nAustralians who lodge their tax return with incorrect information have to amend it, or risk incurring interest and penalties.\n\nREAD MORE: Gunman who set blaze to ambush firefighters in US identified\n\nCommon deductions people forget to include on their tax return include memberships, subscriptions and super contributions. (Today)\n\nBut don't wait too long to lodge your tax return.﻿\n\nIndividuals who lodge their tax return themselves have until October 31 to get it in and those going through a tax agent must have appointed that agent by October 31.\n\n\"If you miss that deadline without lodging a tax return or appointing a tax agent, then you could be up for late lodgement fees,\" Franks warned.\n\nThe experts also cautioned Australians against rushing the process of filling out their tax return, as it can lead to silly mistakes.\n\nChapman has seen people misspell their own names, or get a single digit wrong, when entering their bank account details, causing headaches down the line.\n\n\"Those practical issues do cause real problems and can very much lead to tax returns disappearing into the ATO system, into a black hole, potentially for several weeks.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/technology/donald-trump-tiktok-buyer-here-are-the-players-who-have-been-vying-to-buy-the-app-us-social-media-news/a9b75c0a-ffe2-4fe0-8348-afc2ec0043df",
    "title": "Trump says he has a TikTok buyer. Here are the players vying to buy the app",
    "publish_date": "Tue, 01 Jul 2025 01:18:32 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "After months of speculation and multiple bids from would-be American buyers, TikTok may finally be getting a new owner.\n\nPresident Donald Trump teased over the weekend that there is a buyer for TikTok, whom he will announce in two weeks, which could secure the app's long-term future in the United States .\n\n\"We have a buyer for TikTok, by the way. I think I'll need probably China approval, and I think President Xi will probably do it,\" President Donald Trump said on Fox News' Sunday Morning Futures with Maria Bartiromo .\n\nDonald Trump says a buyer for TikTok may be finalised soon. (iStock)\n\nHe added: \"It's a group of very wealthy people.\"\n\nTikTok's parent company ByteDance is on the clock to spin off the popular short-form video app's US operations by September 17 or face a ban in the United States.\n\nTrump has repeatedly delayed enforcement of the TikTok sale-or-ban law signed by then-President Joe Biden last year — which was originally set to go into effect in January — in hopes of making a deal for an American owner to acquire the app.\n\nThe app is used by about 170 million Americans to find news, entertainment, community and, in some cases, to make a living.\n\nIt remains unclear whether the Chinese government would bless the sale of TikTok by its China-based owner.\n\nIn April, a deal that would have transferred majority control of TikTok's US operations to American ownership was nearly finalised.\n\nBut it fell apart after Trump announced additional tariffs on China, forcing the White House to announce another 75-day delay to keep the app operational in the United States.\n\nTrump extended the deadline again by 90 days earlier this month.\n\n\"Discussions with China regarding the sale of TikTok have been ongoing at the highest level, and they will continue,\" White House press secretary Karoline Leavitt said in a briefing on Monday.\n\n\"As you know, we have another 90-day extension, and it's just to continue to work out this deal and make sure that TikTok stays on for the American people — that's the president's main goal in this, while protecting their privacy and their security.\"\n\nByteDance and TikTok did not immediately respond to requests for comment on Monday.\n\nHere's what we know about who could buy TikTok.\n\nGroup of unnamed investors, tech companies had already been primed to buy TikTok\n\nPerhaps the most likely buyer for TikTok is a group of investors primed to acquire it in April before tariffs caused negotiations to stall.\n\nUnder that deal, a number of venture capital firms, private equity funds and tech giants were set to invest in a company that would control TikTok's US operations, with ByteDance retaining a 20 per cent stake in the spinoff company, a source familiar with the deal told CNN at the time.\n\nFor the deal to comply with the law, ByteDance can own no more than 20 per cent of the platform.\n\nThe law also states that the app's US operations cannot coordinate with ByteDance on the app's algorithm or data-sharing practices.\n\nByteDance is the Chinese tech company that developed Tiktok. (VCG/Getty)\n\nAt the time of Trump's April extension, the White House did not name the parties with whom it had been discussing a TikTok takeover deal.\n\nBut the source familiar with the discussions told CNN that new and existing US TikTok investors, ByteDance and the Trump administration had all agreed to the deal.\n\nEarlier this year, multiple news outlets, including Politico, NPR and Bloomberg reported that Oracle — TikTok's current US technology partner — was a top contender to take over the app's US operations, potentially in partnership with the app's American investors, such as private equity firm General Atlantic and investment firm Susquehanna International Group.\n\nOracle and Susquehanna did not immediately respond Monday to CNN's requests for comment.\n\nA representative for General Atlantic declined to comment.\n\nOther potential buyers\n\nThere are several other prominent bidders who have also raised their hands to acquire the platform's US operations.\n\nThey include a group led by billionaire former Los Angeles Dodgers owner and Project Liberty founder Frank McCourt and Shark Tank star Kevin O'Leary, with backing from Reddit co-founder Alexis Ohanian.\n\nThat group, which calls itself The People's Bid for TikTok, has said it would aim to update the app's technology to give users and creators more control over their data and experience on the platform.\n\nThere are several prominent bidders keen to take on the platform's US operations. (Nine)\n\n\"Every day that passes without a qualified divestiture of TikTok puts Americans at greater risk of manipulation and surveillance,\" a spokesperson for Project Liberty said Monday in a statement to CNN.\n\n\"The People's Bid remains the only solution under consideration that fully satisfies the law and moves TikTok to a made-in-America tech stack.\n\n\"We look forward to working with members of the Administration, policymakers, and our many outstanding partners in The People's Bid to achieve this goal.\"\n\nAnother potential buyer group includes social media influencer Jimmy Donaldson, better known as MrBeast, and Employer.com founder Jesse Tinsley.\n\nA representative for the group declined to comment on the status of the group's bid on Monday.\n\nThe artificial intelligence firm Perplexity said in March that it was seeking to acquire TikTok.\n\nIn a statement at the time, the company said it was \"singularly positioned to rebuild the TikTok algorithm without creating a monopoly, combining world-class technical capabilities with Little Tech independence\".\n\nPerplexity did not immediately respond to a request for comment on Monday.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/disney-cruise-father-and-daughter-rescued-after-going-overboard-on-cruise-ship/7c22682d-31e5-41e4-a1d6-744c7da0d629",
    "title": "Father and daughter rescued after going overboard on Disney cruise ship",
    "publish_date": "Tue, 01 Jul 2025 00:59:45 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "Two guests, said to be a father and his young daughter, have been rescued by crew after going into the water while onboard the Disney Dream cruise ship as it returned from a voyage around the Bahamas.\n\nDisney confirmed that the rescue happened on June 29, saying that both were returned to the ship within minutes of entering the water.\n\nSocial media posts from customers on board reported that the pair were a father and his young daughter.\n\nTwo guests, said to be a father and his young daughter, have been rescued by crew after going into the water while onboard the Disney Dream cruise ship as it returned from a voyage around the Bahamas. (CNN)\n\nThe father is said to have jumped in to rescue his daughter after she fell from the ship. It's unclear how she ended up overboard.\n\n\"The crew aboard the Disney Dream swiftly rescued two guests from the water,\" Disney said in a statement to CNN.\n\n\"We commend our Crew Members for their exceptional skills and prompt actions, which ensured the safe return of both guests to the ship within minutes.\n\nWe are committed to the safety and well-being of our guests, and this incident highlights the effectiveness of our safety protocols.\"\n\nThe ship was returning to Fort Lauderdale, Florida, after a four-night cruise in the Bahamas, Newsweek reported, citing Disney officials.\n\nPassengers took to social media to share their videos of the boat rescue.\n\nREAD MORE: Gunman who set blaze to ambush firefighters in US identified\n\nTwo guests, said to be a father and his young daughter, have been rescued by crew after going into the water while onboard the Disney Dream cruise ship as it returned from a voyage around the Bahamas. (CNN)\n\n\"We heard an M.O.B (man overboard) call over the ship's speaker,\" said Floridian Janice Martin-Asuque on Facebook.\n\n\"A little girl had fallen into the water, and her father jumped in after to save her.\n\n\"Thank God they're both safe.\"\n\nPassenger overboard incidents are relatively rare on cruise ships. Tales of rescue and survival can be even more extraordinary.\n\nIn 2022, 28-year-old James Michael Grimes fell overboard from a Carnival cruise ship in the Gulf of Mexico.\n\nHe swam for what he believed to be more than 15 hours before being rescued by the Coast Guard.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/montague-street-bridge-second-truck-in-two-days-slams-into-notorious-melbourne-bridge/3b9feeda-c755-4774-bf29-abb32d881be8",
    "title": "Second truck in two days slams into notorious Melbourne bridge",
    "publish_date": "Mon, 30 Jun 2025 23:59:34 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "Another truck has slammed into the Montague Street Bridge in\n\nThe removalist truck hit the bridge ﻿just before 8.30am, getting stuck underneath it and blocking a lane of traffic.\n\nThe removalist truck hit the bridge ﻿just before 8.30am, getting stuck underneath it and blocking a lane of traffic.\n\nIt is the second vehicle to get stuck under the bypass in two days. ﻿\n\nIt is the second vehicle to get stuck under the bypass in two days. ﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/the-lottery-australia-lottery-winners-reveal-what-they-spent-their-prize-on/afb7a760-a874-4499-a6b9-6699d9acb3a7",
    "title": "Lottery winners reveal exactly how they spent their fortune",
    "publish_date": "Mon, 30 Jun 2025 03:53:19 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "Many Australian lottery winners aren't splurging their cash on big-ticket items like cars or houses after taking home their winnings , according to a new report.\n\nThe Lott surveyed division one winners from 2024 – who won a combined $1.56 billion – on how they spent their millions, and most said they either invested in the future or lavished family and friends with gifts.\n\nMore than half of the winners said they set themselves up for the future with investments, while 38 per cent said they helped out loved ones with their shock windfall.\n\nThe Lott surveyed division one winners from 2024 on how they spent their winnings. (The Lott)\n\nThe Lott spokesperson Anna Hobdell said these results aren't surprising for division one winners, who take home life-changing amounts of money.\n\n\"Winners often tell us their bodies go into overdrive the moment they hear the life-changing news, with hearts racing, hands trembling, and even a wave of nausea setting in,\" Hobdell said.\n\n\"But once the news sinks in, most winners can't wait to share the joy with people in the know.\n\nREAD MORE: Pay boost for millions of Australians arrives tomorrow\n\n\"After the initial shock wears off, many winners are quick to tell their partners, family, or closest mates.\n\n\"Only about eight per cent keep it completely under wraps and tell absolutely no one.\"\n\nPlenty of lucky winners decided to buy some unique items, including a pair of hand-crafted leather shoes, a set of watches for their family, a hair transplant in Turkey, and some electric mountain bikes.\n\nAnother 33 per cent of winners said they bought a new car, but only 19 per cent reported buying a new house.\n\nSome said they decided to travel the world with their newfound fortune, flying to destinations such as Thailand, Bali, Phuket, the Gold Coast and Alaska.\n\nPlenty of winners said they travelled the world with their newfound fortune. (The Lott)\n\nAnd 17 per cent of the surveyed winners said they used their prize to donate to charity.﻿\n\nOne newly deep-pocketed Aussie simply updated their old washing machine.\n\nReflecting on the life-changing injection into their bank account, a few winners also shared their advice for future lottery recipients.\n\n\"Treat your win as an opportunity to improve your circumstances, so don't waste it,\" one said.\n\n\"Tell very few people and write down who you told,\" another warned.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/jemma-sbeg-conversations-psychology-of-your-20s-personal-growth/105309408",
    "title": "At a crossroads and unable to make a choice? Meet decision paralysis",
    "publish_date": "Tue, 01 Jul 2025 02:21:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "In times of change, the pressure to make the \"right\" decision can feel overwhelming — like that single choice could make or break your future.\n\nBe it changing your career direction, deciding if (or when) to have a child or contemplating the end of a relationship, it's easy to find yourself stuck in a cycle of indecision — or \"analysis paralysis\".\n\nThis pressure is something Jemma Sbeg, creator of podcast The Psychology of Your 20s, knows all too well.\n\nShe described her own crisis of indecision when her once-small podcast unexpectedly exploded in popularity.\n\nMs Sbeg told Sarah Kanowski on ABC Conversations how she suddenly found herself at a crossroads.\n\nWith a degree in psychology, Sbeg had a unique perspective to understand what was happening — and how to process it.\n\nWhen the stakes are high, it can sometimes feel impossible to know which path to take. (Getty: EyeEm Mobile GmbH)\n\n\"It became pretty apparent that I was going to have to quit my full-time job,\" she said.\n\n\"I was also in the process of applying for a master's [degree] because I wanted to become a clinical psychologist.\n\n\"I remember being like, 'OK, you have to make a choice. You just can't do both. The podcast is so much work. What are you going to do?'\"\n\nThe crisis of life transitions\n\nAs Ms Sbeg faced the difficult choice of reassessing her career trajectory, she says it triggered a \"quarter-life crisis\".\n\nWhether you're 25 or 45, the crisis feels the same: a growing urgency to figure your life out and make the most of your time.\n\n\"It's this impending realisation that … I don't have infinite time to find love, to figure out what I want to do with my life, to save money, to enjoy my experiences,\" Ms Sbeg said.\n\n\"It's realising that maybe the decisions you have made so far have kept you trapped, kept you small, made you kind of unhappy.\n\n\" It's a big door to open to acknowledge 'I'm unhappy', and then, 'I have to do something about it.' \"\n\nWhile inner turmoil is a tough feeling to sit with, Ms Sbeg points out it serves an important role.\n\nIt's a catalyst for personal growth, It brings clarity to see the path ahead, and, It's an opportunity to implement change\n\n\"You have to get to that place of extreme discomfort to realise that you have maybe outgrown a former version of yourself,\" she said.\n\n\"It's going to be painful, but that pain is so rewarding at the end.\"\n\nPodcaster and mental health advocate Jemma Sbeg gives practical insights for navigating early adulthood. (Supplied: Jemma Sbeg)\n\nWhy we get stuck\n\nIf this all sounds familiar, you might be experiencing decision paralysis — the fear of making the wrong move.\n\nClinical psychologist and chief executive of the Australian Psychological Society Zena Burgess says when this happens, people feel like they can't move forward.\n\n\"The more they think about it, the more overanalysing they do and they put off making the decision,\" Dr Burgess said.\n\n\"When you've got too many choices, people get crippled by a large number of variables.\n\n\"Or they overestimate the chances of a bad outcome.\"\n\nDr Zena Burgess is the CEO of the Australian Psychological Society. (Supplied)\n\nIn essence, decision paralysis is about avoiding negative consequences, and staying safe.\n\n\"People will hesitate when they think it will result in a loss to them, or people close to them,\" Dr Burgess said.\n\n\"Or because they're hoping to avoid any kind of judgement.\"\n\nTips to overcome decision paralysis Set a deadline: Tell yourself when it's due\n\nTell yourself when it's due Simplify: Reduce your options down to two choices\n\nReduce your options down to two choices Talk: Reach out to people you trust to get their perspective\n\nReach out to people you trust to get their perspective Be curious: Explore the underlying emotions holding up your decision\n\nExplore the underlying emotions holding up your decision Write: Create a list of pros and cons, and journal your concerns\n\nCreate a list of pros and cons, and journal your concerns Slow down: Big decisions take time to think through. You don't need to rush\n\nBig decisions take time to think through. You don't need to rush Ask yourself: What are you trying to achieve? Which option aligns best with what's most important to you right now? How will you look back on this in five or 10 years?\n\nSee a professional: A psychologist can guide you through the decision process and help you build skills\n\nWho's most affected?\n\nClinical psychologist Max von Sabler explains that while anyone can experience indecision, people with perfectionist personality traits may be more prone to it.\n\n\"Perfectionism is often at the heart of decision paralysis,\" he said.\n\n\"The need to make the 'right' choice can stall action entirely, particularly when uncertainty or competing demands are involved … and an internal pressure to uphold an impossible ideal.\"\n\nClinical psychologist Max von Sabler says indecision is a type of self-defence against what a choice might expose. (Supplied: Max von Sabler)\n\nAccording to Mr von Sabler, decision paralysis is also common in people who have:\n\nHigh anxiety,\n\nObsessive-compulsive traits, or\n\nA tendency to be highly critical of themselves\n\nIn the case of someone freezing at the thought of resigning when offered a better job, Mr von Sabler says there's often a deeper story.\n\n\"On the surface, it's about logistics or timing. But often, what may really be in play is the fear of letting people down, being seen as disloyal, or not living up to the new role,\" he says.\n\n\"Indecision can operate as a kind of defence in some circumstances — not against the decision itself, but against what it might expose.\"\n\nLife coach and self-help author Danielle Colley has seen analysis paralysis play out at different scales.\n\n\"Sometimes it can happen in fairly inconsequential ways, such as staring at the cheese in the deli and being overwhelmed by choice,\" she said.\n\n\"However, when that choice has to do with relationships, your work or your home — areas [where] we prefer stability for our overall sense of wellbeing — it can feel impossible to make a choice.\"\n\nThe fear of regret\n\nTo this, Ms Sbeg offers a simple and empowering perspective:\n\n\"If you are doing something, there's no way that you are doing it wrong. Any kind of action is important and purposeful,\" she said.\n\nStream Jemma Sbeg on surviving your 20s — and beyond Photo shows Colourful swirling graphic with bold text that SAYS \"CONVERSATIONS\" Jemma's biggest lesson is realising that while time is finite, we do have so much of it to \"figure it out\", and chances are you'll still be working many things out in your 30s, 40s, 50s and 60s.\n\nFor those prone to overthinking, Mr von Sabler adds:\n\n\"Commit to any action. Action is the antidote for thought,\" he said.\n\nMs Sbeg says this is backed up by a 2005 study from the University of Illinois that found it's a lack of action that people regret the most, rather than the decisions they make.\n\nIt's a powerful reminder that inaction often haunts us more than mistakes.\n\n\"Do anything that calls you deeply — do anything that even calls you mildly,\" Ms Sbeg said.\n\n\"Movement will get you somewhere faster than staying still, even if it means you have to turn around and come back.\"\n\nTrust yourself\n\nIf you still feel stuck or worried about taking a leap of faith, Ms Sbeg is quick to point out that failures are important.\n\nTips for helping teens with wellbeing Photo shows Children jumping in the air silhouetted by a vibrant pink and purple sunset We asked clinical psychologist Dr Sophie Li, from Old People's Home for Teens, for practical tips to support a teen through wellbeing challenges.\n\n\"It's so valuable to learn something from your mistakes and to trust yourself that you're going to be OK,\" she said.\n\n\" Every failure, at least, ends with the notion that you made it through. \"\n\nMs Colley agrees. She also warns that indecision is a decision in itself — one that can leave you feeling powerless.\n\n\"Indecision may even lead to someone else or circumstances making the decision for you and you lose your agency,\" she said.\n\n\"Trust in your ability to make the best of every situation you land in, and your ability to make new decisions as more information becomes available to you.\"\n\nThere's no 'right' path\n\nRegardless of the stage of life you're in, there's no magic blueprint to tell you all the answers, and that's OK.\n\nReassuringly, Ms Sbeg says there are multiple paths to a happy life.\n\n\"I feel like I wasted so much time in my early 20s worrying about where I was going to be at 30 that I didn't even get to enjoy that chapter,\" she said.\n\n\"I wish I could tell 21-year-old me, 'Just calm down. You don't need to figure it all out now. Just enjoy it.'\"\n\nListen to Jemma Sbeg's full interview on the Conversations podcast on the ABC listen app.\n\nThis is general information only. For personalised advice, you should see a qualified professional.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/doctors-give-conflicting-evidence-at-allyson-bailey-inquest/105477578",
    "title": "Doctors give conflicting evidence at inquest into mother's death",
    "publish_date": "Tue, 01 Jul 2025 01:13:32 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Two doctors have given conflicting accounts about the circumstances leading up to the death of a 42-year-old Tamworth woman.\n\nAllyson Bailey was found unresponsive in a seclusion room at Banksia Mental Health Unit on July 7, 2020.\n\nHow the mother of three came to be transferred from intensive care to a nearby mental health unit is being examined at a coronial inquest that began this week.\n\nAn autopsy ruled Ms Bailey died from a combination of pneumonia and the effects of prescription drugs.\n\nHer daughter, Sarah Potter, said she was determined to ensure her mother was remembered for who she was and not how she died.\n\n\"She was the best parent and I miss every part about her,\" Ms Potter said.\n\nSarah Potter says she misses her mother every day. (ABC New England North West: James Paras)\n\nA 'difficult' patient\n\nMs Bailey allegedly abused prescription drugs and cannabis for most of her adult life following a horse-riding injury in her teens.\n\nThe inquest heard her often violent and unpredictable behaviour made it difficult for medical professionals to provide care.\n\nCounsel assisting the coroner Emma Sullivan told the court Ms Bailey presented to Tamworth Base Hospital more than 50 times in the two years leading up to her death.\n\nShe told the inquest Ms Bailey was \"screaming constantly and could not be restrained\" when she arrived at the emergency department on July 5, 2020.\n\nThe court also heard the impacts COVID-19 had on staffing during July, 2020. (ABC New England North West: Patrick Bell)\n\nTamworth Base Hospital's senior intensive care specialist, Guyon Scott, told the court Ms Bailey would have to be heavily sedated during these episodes as she posed physical harm to herself and those around her.\n\n\"Allyson was far and away the most difficult mental health patient I have seen in my career,\" he said.\n\nDr Scott disputed suggestions that he medically cleared Ms Bailey's transfer to Banskia Mental Health Unit.\n\n\"I definitely do not recall it. It wouldn't be consistent with my documentation either,\" he said.\n\nDr Scott said the plan was not to medically clear Ms Bailey for transfer to Banksia until a psychiatric evaluation was performed.\n\n\"I didn't think [Banksia Mental Health Unit] could manage her without sedatives. I didn't know if that was possible,\" he said.\n\nHowever, Ms Sullivan told the coroner multiple witnesses had stated Dr Scott told them she was clear for transfer.\n\nOne of them was intensive care specialist Andrew Clift, who was also working at the time of Ms Bailey's admission.\n\nHe told the inquest he had a \"crystal clear memory\" of Dr Scott's clearance via a telephone call.\n\n\"[Dr Scott] was clear on that, he was categorical,\" Dr Clift said.\n\nThe Banksia Mental Health Unit was opened in 1993. (ABC News: Jennifer Ingall)\n\nDr Scott told the court a phone call with Dr Clift \"possibly\" happened but said he could not recall it.\n\nThe court heard medical assessments were not able to be conducted on Ms Bailey when she was transferred to the seclusion room at Banksia at about 2:45pm on July 6.\n\nNearly 10 hours later, doctors saw Ms Bailey motionless and started CPR, but she was pronounced dead at 12:34pm.\n\n'I would choose her every time'\n\nMs Potter said it was difficult to hear about her mother's last moments.\n\n\"I would choose her every time to be my mum, in every life,\" she said.\n\n\"[Because of her addiction], we had already prepared ourselves for losing her, we just didn't know how or when.\"\n\nSarah Potter says her mother loved her family despite her addiction struggles. (Supplied: Sarah Potter)\n\nThe 23-year-old, who is now a mother herself, said her mother's death had affected more people than just her family.\n\n\"I have to really show sympathy to everyone in that room, every nurse, every doctor — I know that it wasn't easy,\" she said.\n\nThe court heard Ms Bailey had a \"robust understanding\" of her drug addiction and had taken steps to address it.\n\n\"Her driving motivation was her family and her children who she fiercely loved,\" Ms Sullivan told the court.\n\nThe coronial inquest continues.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-07-01/agriculture-agcareerstart-gap-year-program-funding-concerns/105462838",
    "title": "Teens learn how to run 800-cow dairy farm on their gap year",
    "publish_date": "Tue, 01 Jul 2025 01:08:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's a bitterly cold winter's day on a dairy farm in Victoria's north east, and the ground has turned to mush as the rain falls from the grey sky.\n\nJesse Wallace is guiding 500 dairy cows up the muddy path to the dairy shed for their afternoon milking.\n\nThe cows are milked twice a day on the farm at Tallangatta South. (ABC Rural: Annie Brown)\n\nThe 18-year-old does it with ease, noting which cows are usual suspects for lingering at the back.\n\nHowever, six months ago this was a daunting task.\n\nMr Wallace collects the cows for their afternoon milking. (ABC Rural: Annie Brown)\n\n\"It was in the middle of summer, and they all get in the river and you have to get knee deep to get them out,\" he said.\n\n\"And you're worried about all the gates being shut.\"\n\nMr Wallace finished high school last year in Brisbane, and is now working on a dairy farm for his gap year.\n\nHe is a participant in the AgCAREERSTART program, run by the National Farmers' Federation.\n\nMr Wallace finished high school in Queensland before moving to Victoria. (ABC Rural: Annie Brown)\n\n\"There's not a lot of dairy opportunities in Queensland, because the weather is so hot, and I thought this would be a good area to get started in,\" Mr Wallace said.\n\n\"It's cold [in Victoria] — but I'm warming up and getting used to it.\n\n\" Even if you don't want agriculture to be your lifetime experience, it's a good way to get started in the workforce. \"\n\nTrialling a future career\n\nWaiting at the dairy ready to start attaching the cups to the udders, is Ruby Spicer, 18, who originally hails from Canberra.\n\nAlso in her gap year, she said she had no prior experience with farming and no connections in the industry.\n\nMs Spicer says the farm gap year has been a wonderful experience. (ABC Rural: Annie Brown)\n\n\"I like working outdoors and thought it would be a good opportunity to have a gap year,\" Ms Spicer said.\n\n\"Everyone is very patient with teaching you — you don't feel stupid for not knowing things.\n\n\"It is a lot of early mornings, but you get used to it — if you start at 3am, then you're usually done by 10am.\"\n\nMs Spicer said she would like to stay working on a farm next year if there was a position for her.\n\n\"I probably wouldn't have gone into agriculture without this program,\" she said.\n\n\"This is a good experience and you get to decide if this is a job for you.\"\n\nThe herd of cows head to the dairy for milking. (ABC Rural: Annie Brown)\n\nStaying in agriculture\n\nThe Australian Bureau of Statistics says the average age of an Australian farmer is 58, which is a decade older than the rest of the general workforce.\n\nAnd attracting young people to work in the agriculture industry has been a challenge across a range of sectors.\n\nThe AgCAREERSTART program is currently in its fourth year and has placed 250 students aged 17–25 onto working farms to support farmers facing workforce shortages.\n\nParticipants get paid to work, and also receive a $4,500 training bursary.\n\nOver the past four years, 85 per cent of participants kept working in the agriculture industry with 43 per cent finding ongoing work on the same farm.\n\nOne of those alumni is Hannah Dunn, 19, who is into her second year working on the dairy farm with Mr Wallace and Ms Spicer.\n\nMs Dunn grew up in Bathurst, NSW, before relocating to Victoria. (ABC Rural: Annie Brown)\n\n\"I love to work with animals and I'm currently studying a Bachelor of Animal Science,\" Ms Dunn said.\n\n\"I'd tell people to do it — it's a great way to get practical experience that employers are looking for.\n\n\"And it's a paid gap year, like, why not try it out?\"\n\nMs Dunn says she enjoys looking after the cows' nutrition. (ABC Rural: Annie Brown )\n\nFunding beyond 2026\n\nThe AgCAREERSTART program is funded by the federal government until 2026, currently allowing for one more intake.\n\nSince 2021, the program has received more than $ 5.5 million in funding.\n\nThe Department of Agriculture, Fisheries and Forestry has told the ABC that it is currently reviewing the program, and the Minister will decide on further federal funding.\n\nThe AgCAREERSTART program is only funded for one more intake. (ABC Rural: Annie Brown)\n\nRichard Hamilton is the manager of the dairy farm in Tallangatta South, which employs the three young workers.\n\nHe said it would be a shame to lose a program that worked so well to solve worker shortages in the industry.\n\n\"These three can run an 800-cow day-to-day operation without assistance,\" Mr Hamilton said.\n\nMr Wallace says he has learnt a lot and become more confidence since joining the program. (ABC Rural: Annie Brown)\n\n\"If they stay in dairy is irrelevant.\n\n\"If they can take some good practices from us and go on and develop, it's got to be good for Australian agriculture as a whole.\n\n\"It's a bigger picture than us; if they give us a good couple of years on their way and go on and do incredible things then it's a tick in the box from my point of view.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/westwood-kawakubo-exhibition-national-gallery-of-victoria/105478894",
    "title": "These two designers were born a year apart. They changed fashion history",
    "publish_date": "Tue, 01 Jul 2025 01:00:44 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "The National Gallery of Victoria (NGV) are hoping their just-announced summer exhibition will live up to the success of last summer's Yayoi Kusama, which this year became the most visited art exhibition in Australian history.\n\nWestwood | Kawakubo, which opens in December, will showcase the innovative work of two of the most celebrated names in fashion: the late British designer Vivienne Westwood (1941-2022), and Japanese designer and Comme des Garçons founder Rei Kawakubo (born 1942).\n\nRihanna wore a Comme des Garçons dress from Kawakubo's Fall 2016 collection to the 2017 Met Gala. (Getty Images: Francois Durand)\n\n\"We can only try to exceed those numbers, right?\" NGV's curator of fashion and textiles, Dani Whitfield, says with a laugh.\n\n\"What you're hoping for with these exhibitions is that people that maybe don't know these designers come along and learn something and walk away feeling inspired.\"\n\nWestwood | Kawakubo features more than 140 designs by Westwood and Kawakubo, including more than 100 from the NGV's own collection, as well as works from the Metropolitan Museum in New York, the Victoria and Albert Museum in London, and Palais Galliera in Paris. They'll be accompanied by archival material, photography, film and runway footage.\n\nThrough five themes — Punk and Provocation; Rupture; Reinvention; The Body: Freedom and Restraint; and The Power of Clothes — the exhibition charts Westwood and Kawakubo's careers: from Westwood's early work in London's punk scene, dressing the likes of the Sex Pistols and Siouxsie Sioux; to the latter work of Kawakubo, whose designs inspired the theme for the 2017 Met Gala.\n\nThe Sex Pistols — some of Westwood's most famous clients —performing in the US in 1978. (Getty Images: Richard E. Aaron/Redferns)\n\n\"We look at two designers who were born in a similar historical moment in different places, but who had this incredible desire to change fashion and to work within the system, but also critique it,\" Whitfield says.\n\n\" Ultimately, we're thinking about what it means to be a woman designing for women. \"\n\nChallenging the rules of fashion\n\nBoth Westwood and Kawakubo shaped and reshaped the rules of women's fashion in the late 20th century.\n\nWith her then-partner, Sex Pistols manager Malcolm McLaren, Westwood — who was also a teacher — opened the shop Let It Rock (later renamed SEX) in London in 1971. Their collaboration shaped the style of 70s punk rock; think tartan, ripped T-shirts and safety pins.\n\n\"I was messianic about punk, seeing if one could put a spoke in the system in some way,\" Westwood said. (Pictured with McLaren in 1977.) (Getty Images: Daily Mirror/Bill Kennedy)\n\n\"When you think about Westwood's origins in punk, it's really redefining the look of fashion,\" Whitfield explains. \"Fashion can be distressed; it can be ragged; it doesn't have to be beautiful.\n\n\"It changes the way that we think about gender ideals and what conventional femininity is supposed to look like. Through that challenge, [Westwood] creates [clothing] that feels empowering for the wearer.\"\n\nKey fashion moments of Vivienne Westwood Photo shows a man and a woman dressed in fashions ffrom Seditionaries boutique Vivinne Westwood's clothes epitomised non-conformity and pushed her anti-establishment agenda. Here's a look at some of her work that changed the fashion landscape.\n\nIn the 80s, Westwood subverted expectations, drawing on 18th- and 19th-century women's fashion, including corsetry, bustles and crinolines (stiff, structured petticoats).\n\nFor example, she was inspired by Stravinsky's ballet Petrushka to create a \"mini-crini\", combining the restrictiveness of the crinoline with the so-called \"liberation\" of the miniskirt, popularised by designer Mary Quant in the 60s.\n\n\"She brings [those garments] to the outer layer and turns them into these empowering items of clothing, which were about celebrating female sexuality,\" Whitfield says.\n\nMeanwhile, Kawakubo, who founded Comme des Garçons in 1969, crafted clothes that were the \"complete antithesis\" of those seen on Paris runways at the time, which veered towards spectacle and the male gaze.\n\nThe name Comme des Garçons was inspired by a 1962 Françoise Hardy song, and translates from French to \"like the boys\". (Pictured a look from the label's spring-summer 2024 collection.) (Supplied: Comme des Garçons)\n\n\"She really came to fashion with this idea of wiping the slate clean, producing collections that were black and asymmetrical and distressed,\" Whitfield says.\n\nKawakubo herself has said that she designed her clothes for \"self-sufficient\" working women; \"women who do not need to assure their happiness by looking sexy to men, by emphasising their figures, but who attract them with their minds\".\n\n\"Her clothing was shapeless and androgynous … It was a much more conceptual way of dressing, which was about taking ownership,\" Whitfield says.\n\nWestwood | Kawakubo even features designs from Comme des Garçons's upcoming collection — giving the exhibition a sense of the full scope of Kawukobo's career.\n\n\"Closer to the present day, the more and more avant-garde she becomes,\" Whitfield says. \"She's somebody who just continues to really push and push.\"\n\nBy pairing the two designers, NGV is emphasising their similar concerns — about beauty, taste, the ideal body, and the function and form of clothing.\n\n\"Fashion should be empowering, fashion should be challenging, it should ask questions,\" Whitfield says.\n\n\"[Westwood and Kawakubo's clothing] comes from a place of thinking really deeply about what fashion can mean.\n\n\"It's not simply just the look of it, but how fashion is used to express an identity … I think everybody's always using fashion to speak about themselves.\"\n\nBringing fashion into the gallery\n\nWestwood | Kawakubo is the third NGV summer blockbuster in the past five years to focus on fashion, following Gabrielle Chanel: Fashion Manifesto in 2021; and Alexander McQueen: Mind, Mythos, Muse in 2022.\n\nBut it's not the first time a major Australian gallery has turned its focus on Westwood and Kawakubo — following NGV's own Collecting Comme in 2019, and a Westwood retrospective at the National Gallery of Australia in Canberra in 2004.\n\nSarah Jessica Parker wearing a Vivienne Westwood wedding gown on the set of Sex and the City: The Movie in 2007. (Getty Images: James Devaney)\n\nWhitfield says bringing fashion into a gallery context doesn't change the meaning behind the clothes — but instead offers an opportunity to put the designs into a historical and cultural context.\n\n\"It's about drawing people's attention to the importance of those [cultural] shifts [and] of those designs,\" Whitfield says.\n\n\"[It's about] showing not just how [the clothing] looked, but how they were made and how they were constructed, and the innovations [behind them] — aesthetic or material or technical.\"\n\nDesigners like Westwood and Kawakubo belong in the gallery because, like all artists, they offer different ways of seeing the world.\n\n\"There's no one way of doing anything,\" Whitfield says.\n\n\"[Westwood and Kawakubo] played with form and function, they've turned [clothing] inside out, they've exaggerated, they've parodied, and they've questioned, and I think that's really appealing.\n\n\"It is in that kind of spirit that we should all be dressing every day, don't you think?\"\n\nWestwood | Kawakubo is at NGV International from December 7-April 19.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/regional-ambulance-ramping-reaches-record-high-bunbury-hospital/105478112",
    "title": "'Dire situation' as ambulance ramping in regional WA hits record high",
    "publish_date": "Mon, 30 Jun 2025 23:07:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "Ambulances in regional Western Australia spent more than 240 hours waiting outside hospitals to transfer patients last month — an average of eight hours a day.\n\nThe June figures from St John represent a new high for regional ramping, surpassing the previous record of 222.2 hours last September.\n\nRamping happens any time an ambulance spends more than 30 minutes waiting outside a hospital for their patient to be received.\n\nWhile every regional hospital except Northam experienced a month-on-month increase in June, Bunbury hospital bore the brunt of the problem, accounting for about 85 per cent of non-metropolitan ramping hours.\n\nMeanwhile, metropolitan hospitals collectively observed a small decrease.\n\nWA deputy opposition leader Libby Mettam says the spike in regional ramping hours is concerning. (ABC South West WA: Bridget McArthur)\n\nWA deputy opposition leader and shadow health minister Libby Mettam said the situation was putting regional West Australians' lives at risk.\n\nShe said spikes in ramping could also hamper the capacity of paramedics to respond to emergencies.\n\nHealth Minister Meredith Hammat said ramping was a nationwide issue with a range of complex contributing factors.\n\n\"Our government is throwing everything we can at it,\" she said.\n\n\"Bunbury Regional Hospital is currently undergoing a $471.5 million redevelopment to boost patient capacity, and we've significantly increased staff numbers statewide by more than 30 per cent since 2021.\n\n\"WA Country Health Service has several initiatives to attract and retain junior doctors in the regions, and I'm pleased to report a record 33 interns joined the health service this year.\"\n\nBeds not enough, AMA says\n\nThe state government began a significant redevelopment of Bunbury hospital in January to expand its capacity.\n\nBut the Australian Medical Association (AMA) said while the project would add more beds, it would not address staffing shortages, which it believed was behind the ramping increase.\n\nAMA WA president Kyle Hoath said it was a chronic and growing problem.\n\nBunbury Regional Hospital is undergoing a major redevelopment. (ABC South West WA: Bridget McArthur)\n\n\"The workforce in our regional areas is stretched really thin … particularly when we look at Bunbury,\" he said.\n\n\" We don't train enough people in the regions and we don't do enough to keep them there. \"\n\nDr Hoath said it was not just hospital staffing shortages having an impact on ramping.\n\nHe said general practitioners were under pressure in regional and rural areas too, partly due to a lack of specialist services, meaning some patients were forced to lean on emergency services instead.\n\nDr Hoath has urged the state government to invest more in attracting medical staff to the regions and incentivising them to stay.\n\nThe National Rural Health Alliance echoed that call.\n\n\"We need to make sure that we pay people well, not less, that we make sure their practices can function without feeling that they're stretched,\" chief executive Susanne Tegen said.\n\n\"It's about time people that live in rural Australia receive the same access to healthcare and the same amount of dollars [as is] spent on urban people.\"\n\nAmbulances across regional WA waited more than 240 hours to transfer patients in June. (ABC South West WA: Bridget McArthur)\n\nHousing crisis also a factor\n\nDental surgeon David McInerney is well acquainted with the difficulties of attracting staff to the region.\n\nBut the Margaret River-based practitioner said it was not always for lack of desire.\n\n\"There is simply nowhere for them to live,\" Dr McInerney said.\n\nRecently he had to put three of his dental staff up in vacant dwellings on his own property in order to keep them.\n\n\"Other health practices who don't have that additional help would be struggling to attract staff because if they don't have anywhere to live, they're not going to come,\" he said.\n\nDr Mclnerney said the area's growing population was also putting a strain on other essential infrastructure, including Margaret River Hospital itself.\n\nHe said this added pressure to Bunbury's system as locals were often forced to turn there instead.\n\nThe Australian Medical Association says staff shortages are behind recent increases in ramping. (ABC News: Keane Bourke)\n\n\"People are seriously ill but they're being shipped away from their families and their support networks simply because they don't have the beds available,\" he said.\n\n\" It's an absolute dire situation … the state government's really not keeping pace with the healthcare demands of rural communities. \"\n\nThe ABC has contacted the WA Country Health Service (WACHS) for comment.\n\nSt John WA declined to comment.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/act-sandwich-generation-care-children-relatives-work-flexability/105479260",
    "title": "Belle's aging mum forgot her birthday. It was the first sign of change",
    "publish_date": "Mon, 30 Jun 2025 23:03:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "For Canberra woman Belle Hogg, the first sign her life was about to change came when her mother forgot her birthday.\n\n\"You might say it's not a big deal, but she's the sort of mum that would send you something in the post two weeks before your birthday because it had to be perfect,\" Ms Hogg said.\n\n\"At the time, I was actually cranky … and I said, 'I'm going up there, something's not right.'\"\n\nHer mother had dramatically lost weight, and her home was in a state of disarray.\n\nSoon after, the then-68-year-old was diagnosed with dementia.\n\nSuddenly, Ms Hogg found herself juggling full-time work in the public service, a photography business, raising her three children and caring for her mother.\n\n\"I'd prepare school lunches for the kids and then lunch for Mum,\" Ms Hogg said.\n\nAva Hogg helping her grandmother Chrissy France get ready. (ABC News: David Sciasci)\n\n\"She just declined so quickly, and it was just so hard going to work and thinking, 'Is she OK at home?'\"\n\nMs Hogg is part of the \"sandwich generation\" — adults caring for both children and aging relatives.\n\nAs the population ages and people start their families later in life, a growing number of Australians are finding themselves squeezed by dual caring responsibilities.\n\n\"It's definitely a rollercoaster — Mum and I have always been besties, the person I call for every piece of advice,\" Ms Hogg said.\n\n\" I felt ripped off. \"\n\nBelle Hogg's family has always been tight, but it takes a fair amount of juggling on her behalf to care for everyone's needs. (ABC News: David Sciasci)\n\nRecognition 'needs to be a social revolution'\n\nResearch indicates about two-thirds of sandwich carers are women.\n\nCanberran Evie Kollas retired prematurely from teaching to care for her now 94-year-old mother and other family members.\n\nEvie Kollas retired from her teaching career prematurely to care for her 94-year-old mother, Helen Kollas. (ABC News: David Sciasci)\n\n\"That has financial implications. It also has social implications,\" Ms Kollas said.\n\n\" You can't work full time when you have a more than full-time caring role. \"\n\nShe said her caring and administrative responsibilities took up the time of a full-time job without the same recognition.\n\n\"If it was a job, it would be paid really well, and it would be really, really well-resourced, and we would have some status,\" Ms Kollas said.\n\n\"None of that applies to carers.\n\n\"Recognition is always something carers have called for, but it needs to be a wider recognition, it needs to be a social revolution, it needs to be appreciated on a political level.\"\n\nEvie Kollas said unpaid carers were undervalued in society despite it being almost a full-time job. (ABC News: David Sciasci)\n\nABC Canberra has been inundated with frustrated stories of carers in the sandwich generation who feel forgotten by the system.\n\n\"I personally feel completely ripped off as I had to retire early from a job I loved to care for parents AND In-laws AND grandchildren. I've spent 10 years trying to juggle everything, retired 4 years ago, and have no hope in the foreseeable future of having the retirement we planned. By the time my carer burden is gone, I will be too old/unwell to travel.\"\n\n\"I'm working full time, caring for my 2 primary school children, and now caring for my mother with dementia. My Aged Care has assessed her as needing a level 3 home care package, but they won't release the funding. So my mum sleep[s] in my living room. We are all at our wits' end. We get no help. The dementia hotline said when it gets too much, my best option is to leave her at the local hospital, which they call a 'social admission'. We are paying a consultant thousands of dollars to try and find an aged care placement. The system is broken.\"\n\n\"I'm in a double sandwich generation family. My 80yr-old parents have been caring for my grandmother for 20+ years (she has now been in aged care for a couple of years). I am supporting my parents whilst raising my kids, who are still young teenagers … I have limited my work (both in hours and in complexity) to prioritise my caring responsibilities. This [affects] my superannuation and plans for my aged care.\"\n\nEmployment challenges for sandwich carers\n\nMelissa Reader, chief executive of not-for-profit Violet Initiative, said sandwich carers were crying out for more support.\n\n\"Sixty-thousand Australians will turn 85 in the next five or six years … so it's a really phenomenal shift in our demographics and it's putting enormous pressure on the adult caregivers of those elderly Australians,\" Ms Reader said.\n\nMelissa Reader says there is a need for more flexibility in the workplace. (ABC News: David Sciasci)\n\nShe said the impact of people leaving the workforce would have widespread effects on society.\n\nShe said a high proportion of sandwich carers were stepping out of their position in the workforce as teachers, nurses or aged care staff.\n\n\"Flexibility in the workplace is paramount today, and it's only going to get more important,\" she said.\n\nWorkplaces need to learn flexibility\n\nMichelle O'Shea of the University of Western Sydney said a survey run by Carers NSW found sandwich carers wanted to be in paid employment.\n\n\"[Survey participants expressed] getting out of the home, getting ready for work, going to a workplace, engaging with people as being so important,\" Dr O'Shea said.\n\n\" Therein lies the challenge; if you don't have a supervisor or a manager who understands or is willing to provide that flexibility, that can be really problematic. \"\n\nCare Squeeze Photo shows The Care Squeeze Graphic no text The aged care sector is set for change after bipartisan agreement on a new fee structure, but where does it leave those Australians in an informal caring role?\n\nDr O'Shea said carers were often forced into making short-term decisions to look after themselves, which sometimes had long-term negative ramifications.\n\n\"Having to not go for promotion, not necessarily being available for the same number of shifts, or moving from full-time to part-time employment where that was practical — carers talked about the fact that there was often an unwillingness within their current employment to enable their ongoing work,\" she said.\n\n\"That is, you couldn't be a senior leader, or you couldn't be a supervisor, and be so on a part-time basis, for example.\"\n\nShe said it was important for employers to be able to provide carers with the flexibility they needed, such as starting later in the day, finishing later in the evening or allowing breaks in the day for medical appointments.\n\n\"We don't want to have a one-size-fits-all, we want to make sure that in workplaces there [are] degrees of flexibility to provide employees with,\" Dr O'Shea said.\n\nAnd when that sort of flexibility was given, Dr O'Shea said it benefited everyone.\n\n\"When that flexibility was provided there was a really positive sense — the employee felt really positive about their workplace, and said the fact they were being given flexibility [meant] that they were probably working over and above to acknowledge their employer's trust in them,\" she said.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/youth-allowance-numbers-drop-significantly/105479342",
    "title": "The number of students on Youth Allowance has dropped significantly",
    "publish_date": "Mon, 30 Jun 2025 22:54:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "The number of students receiving Youth Allowance payments has decreased sharply in the past 20 years, leading to concerns from experts that low-income and regional students are being locked out of tertiary education.\n\nThere were roughly 275,000 students receiving Youth Allowance in June 2005, compared to just under 162,000 in May this year, according to the Department of Social Services.\n\nOver the same period, there had been an increase in the overall number of students attending university.\n\nNeeve Nagle, who is a law student at the University of Technology, Sydney and a member of the National Union of Students, told triple j Hack the declining number of recipients hit low-income and regional students the hardest because they did not have the option of relying on their parents for support.\n\n\"Universities shouldn't be places that only rich and wealthy people can attend and learn from. It should be for all students,\" she said.\n\n\"But when we lock out students that can't financially afford to live independently [due to the parental income test] the sector will begin to collapse, and these students will no longer attend.\"\n\nMs Nagle moved from a small town in the Hunter Valley in New South Wales to attend university in Sydney.\n\nShe came from a single-parent household and was able to access Youth Allowance payments in the first couple of years of her degree.\n\nShe now works and studies full-time, making her income too high to receive Youth Allowance.\n\nShe said she had not encountered many classmates with similar backgrounds and that low rates of payment and parental income tests were keeping university out of reach for low-income and regional students.\n\n\"Students are not able to afford to have full days off for uni because they're not on Youth Allowance and they need to go work their job instead, and so they're taking half days off work popping into class, running back,\" Ms Nagle said.\n\nNeeve Nagle says she has not met many other students from low-income, single-parent families in her Sydney law class. (Supplied: Damon Peters)\n\nThere are two streams for Youth Allowance — student payments and job seeker payments.\n\nBoth apply to people aged 24 and younger, and payment rates are determined by personal and parental income, unless the applicant can demonstrate independence.\n\nYouth Allowance payment rates drop once combined parental income hits $65,189.\n\nThis year's federal budget projected nearly $500 million less in expenditure on student payments over the forward estimates due to fewer people taking up Youth Allowance.\n\nA spokesperson for the Department of Social Services told Hack that it was not accurate to compare 2005 data with recent rates, because of a 2012 policy change that removed 16- and 17-year-olds from being eligible for the payment while at high school.\n\n\"The decrease in student payment recipients partly reflects changes to how young people study, including combining part-time study with work,\" the spokesperson said.\n\n\"In the last two years alone the payment rate of Youth Allowance has increased by around $100 per fortnight for most recipients, depending on student circumstances.\"\n\nThe number of recipients was trending down before the 2012 changes and continued to fall after, according to DSS figures.\n\nWhy are so few people taking up Youth Allowance?\n\nAndrew Norton, an expert in higher education policy at Monash University noted the \"structural decline\" in Youth Allowance in 2023, but said research to explain why was hard to come by.\n\n\"We don't have any fantastic research on this,\" Professor Norton told Hack.\n\nHe thinks the strong labour market could be a key factor.\n\n\"If we take it back to 2014 … just over half [of Youth Allowance recipients] were working during semester and now it's over 70 per cent,\" he said.\n\n\"We've seen big increases in the rates of students working.\"\n\nYouth Allowance lets students work extra hours before their payments are reduced, compared to other forms of income support.\n\nHowever, Professor Norton said it must be \"impossibly difficult\" to do well academically if a person is forced to work and study full-time.\n\nNational Union of Students president Ashlyn Horton says students are being forced to choose between going to class and working to keep a roof over their heads. (triple j: Shalailah Medhora)\n\nNational Union of Students president Ashlyn Horton told Hack that having to work long hours while studying impacted disadvantaged students the most, and had led to a decline in campus culture.\n\n\"It is really destroying university life,\" she said.\n\n\"The tanking of the Youth Allowance rate is creating division, socio-economically.\n\n\" People are being forced to choose between going to their job or going to their classes and obviously people are going to pick their job because they need to be able to pay their rent. \"\n\nThe way the payment is designed may be to blame for falling rates, too.\n\n\"The parental income test does actually exclude a lot of people,\" Professor Norton said.\n\nMs Horton said the parental income test \"shouldn't exist in the first place\".\n\n\"Once you're 18, you're an independent adult. You should be treated as such and your parents' income should not matter.\"\n\nYouth allowance 'doesn't cover the basics'\n\nExperts are concerned that low payment rates are deterring people from going to university or are causing them to drop out before they graduate.\n\nThe rate of Youth Allowance remains much lower than other forms of income support.\n\nA young person aged 18 or older with no children who lives away from home to study can receive the full rate of just under $332 a week. That's a yearly income of $17,245.80.\n\n\"Youth Allowance is just $48 a day … To put that into perspective, that's just 35 per cent of the minimum wage,\" program director of social security at the Australian Council of Social Services (ACOSS), Charmaine Crowe, told Hack.\n\n\" ACOSS is really concerned that the low rate of the payment itself is leading to young people not studying because Youth Allowance simply isn't enough to cover the basics. \"\n\nACOSS has been calling on the government to raise the rate of payments like Youth Allowance for several years.\n\n\"We think these payments should be lifted to at least $82 a day so that students can cover the costs of essentials like food, energy, housing and focus on completing their course,\" Ms Crowe said.\n\n\"The risk is that unless the government strengthens the safety net and lifts Youth Allowance, young people on low incomes may either decide not to go to uni or … they may end up giving up their education part way through simply because they don't have enough money,\" she said.\n\nProfessor Norton said the data showed there had been \"attrition\" in student numbers over the years.\n\n\"Exactly what's causing that isn't entirely clear, but I think a lot of it is due to the cost-of-living issues, which require people to drop out,\" he said.\n\nCould we see the numbers change?\n\nProfessor Norton noted a \"modest increase\" in the number of people taking up Youth Allowance in recent months.\n\n\"It has gone up a bit, at this stage probably about 20,000 more than it was this time last year,\" he said.\n\nThat could be due to a higher number of domestic student enrolments than at any other time except for the brief COVID spike.\n\n\"The number of Australian students starting an undergraduate or a postgraduate degree this year looks set to be the highest on record,\" federal Education Minister Jason Clare announced in June.\n\nThe Universities Accord, a blueprint for the tertiary education sector in the decades ahead, said Australia must hit 80 per cent of its working age population with a tertiary education by 2050 to be globally competitive.\n\nThe document notes that to do that the government must make university more accessible to people from low socio-economic backgrounds as well as First Nations and rural and regional students, sections of society that are currently under-represented in the tertiary education sector.\n\nRaising the rate of payments like Youth Allowance has been the top priority of the Economic Inclusion Advisory Committee for three consecutive years.\n\nHack asked Social Services Minister Tanya Plibersek if the government had plans to raise the rate of Youth Allowance in its coming term, but did not receive a response.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/what-can-go-in-fogo-bins-local-council-nsw-epa/105454200",
    "title": "Know what's a no-go in your FOGO bin? Many don't and that's a problem",
    "publish_date": "Mon, 30 Jun 2025 22:48:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "By July 2030, every home in New South Wales should have its own food organics and garden organics (FOGO) bin.\n\nMany already do, but there is still widespread confusion about exactly what should go in the green bin.\n\nPizza boxes, tea bags, cardboard, timber and bamboo utensils were initially allowed when FOGO started in 2013, but the Environment Protection Authority (EPA) has since revised its advice.\n\nNow only food or garden waste should go under the green lid.\n\nOf the 128 LGAs in NSW, 57 have introduced FOGO bins, with the rest to follow by 2030. (Supplied)\n\n\"We want to keep things out like plastics and anything that might allow for microplastics to break down into the FOGO,\" EPA executive director of programs and innovation Alexandra Geddes said.\n\n\" Some of those containers that you might get [from a takeaway shop] that have plastic lining in them … are billed as compostable when they're actually not. \"\n\nOther problem items include pet faeces and poo bags, paper towels, vacuum cleaner dust and lint from tumble dryers.\n\nFOGO contamination is a serious issue, with the Australian Bureau of Statistics estimating 45 per cent of all organic waste still ends up in landfill.\n\nMany councils collect FOGO waste to turn into compost they either buy back or sell to farmers. (ABC Central West: Emily Middleton)\n\nThere are 128 local councils in NSW and, according to the EPA, 57 already have a FOGO service.\n\nAnother 13 have FOGO plans in place, 32 have green bins to collect garden waste only and 26 offer no organic collection.\n\nAt this stage, it is up individual councils to implement and enforce rules about what can go in the green bin, although the EPA does provide \"guidance\".\n\n\"That's because what we really want is [pure] organic matter that comes out of the process,\" Ms Geddes said.\n\nIt is also up to the individual councils to determine how they collect and process FOGO material, with many opting to send it to composting facilities and then buy it back for their fertiliser regimes.\n\nDan Nicholson says householder education on FOGO has a way to go. (ABC Central West: Emily Middleton)\n\nFrom FOGO to farmers\n\nDan Nicholson, director of Topsoil Organics, is acutely aware of confusion around FOGO.\n\nThe FOGO generated by 186,000 residents in Sydney's Inner West LGA are trucked to his composting facility at Forbes, in the NSW Central West, a round trip of more than 700 kilometres.\n\n\"We try to really harvest every bit of organics possible that comes on site … it's a circular economy,\" he said.\n\n\"We're still obviously getting the wrong things going into the bin, from drink bottles and milk cartons [to] the whole packet of bread still with the plastic around it.\"\n\nPickers sort the food and garden waste by hand to eliminate as much contamination as possible. (ABC Central West: Emily Middleton)\n\nMr Nicholson said he employed 10 people to pick through FOGO and remove contamination.\n\nAnything that comes in a green \"compostable\" bag is separated in the picking station and eventually processed using black soldier flies to harvest residual organics.\n\nBlack soldier fly maggots harvest the organic waste from containers and other FOGO contaminating material. (ABC Central West: Emily Middleton)\n\n\"We still need a lot more education and people need to understand that FOGO is a material that's being used in the agricultural sector,\" he said.\n\n\"We've got to get that material spotless so it fits the order and exemption to be able to go back into land.\"\n\nOrganic alternative to synthetic fertiliser\n\nClint Neville, a third-generation mixed farmer from Forbes who is using organic fertiliser produced by FOGO composting, said increasing organic carbon levels in the soil boosted its water-holding capacity while adding macro-nutrients.\n\nClint Neville has been using organic fertiliser for years. (ABC Central West: Emily Middleton)\n\n\"Every 30 years, your soil organic levels halve,\" Mr Neville said.\n\n\"We had one paddock where it was 0.5 per cent organic carbon [with 2 to 3 per cent being where we want to be] and we got about 600 tonnes of compost, and within 12 months we saw it bounce up to 1.7 per cent.\"\n\nMr Neville said his aim had been to build more resilience within his farming system and do more with less.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/channel-7-off-air-in-south-east-sa-riverland-and-riverina/105476060",
    "title": "Channel 7-WIN TV dispute leaves station off air, distressing footy fans",
    "publish_date": "Mon, 30 Jun 2025 22:04:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Channel 7 programming has gone off the air in parts of South Australia and New South Wales this morning in what could amount to a breach of licence conditions for WIN Television, a federal MP says.\n\nThis follows WIN and Seven West Media failing to reach an agreement for 7, 7mate and 7two to broadcast into South Australia's South East and Riverland, as well as Griffith in the Riverina, New South Wales, from July 1.\n\nThe WIN TV free-to-air channel now says \"Channel 7 programming is no longer available\" for thousands of residents across these regions.\n\nA graphic that appeared on Seven Network channels this morning. (ABC South East SA: Eugene Boisvert)\n\nFederal Barker MP Tony Pasin, who gathered more than 1,700 signatures on an online petition calling on Seven West Media to continue its contractual agreement with WIN TV, said anti-siphoning legislation required TV channel owners to broadcast sporting events like AFL finals, the Bathurst 1000 Supercars race and Test cricket free-to-air.\n\nThey could be in breach of their licence conditions and have their licence removed if the events were not shown on TV, Mr Pasin said, particularly blaming WIN for the impasse.\n\n\"Specifically, that legislation said streaming services, even free streaming services, don't amount to free-to-air because the Commonwealth government understands, of course, that we don't have universal internet coverage across the country,\" he said.\n\nBarker MP Tony Pasin says some constituents do not have access to the internet to use streaming services. (ABC South East SA: Eugene Boisvert)\n\nA spokesperson for WIN TV said it did \"not own rights to any listed events, therefore there is no obligation to the WIN Network to broadcast them\".\n\nSeven West Media chief executive Jeff Howard said the network had not turned off its signal but was continuing to provide content to WIN TV that it was now not sharing with viewers.\n\n\"While we are disappointed WIN has made this decision, these communities are important to us and they can access Seven's news, sport and entertainment content live, free and on demand on 7plus,\" Mr Howard said.\n\n\"In the meantime, Seven is seeking the assistance of the federal government and the Australian Communications and Media Authority to help resolve this matter as quickly as possible.\"\n\nThe removal of Channel 7 from the WIN Network will mean some regional residents will lose access to the AFL. (ABC Riverland: Shannon Pearce)\n\nShows will be missed\n\nBerri Senior Citizens Club president John Fewster said many elderly members would miss Channel 7 content.\n\n\"Unless they're really up with that sort of thing [streaming], they mostly wouldn't even try. It would be just too hard for them,\" he said.\n\n\" If there's any particular programs on 7 that they like watching and might be passionate about, then they just won't be able to watch them. \"\n\nJohn Fewster hoped talks between the networks would have been resolved before July 1. (ABC Riverland: Shannon Pearce)\n\nRiverland Crows Supporters Group president Peter Marks said watching AFL on free-to-air was good for members' mental health.\n\n\"They look so much forward to it every week and to be without it leaves them lonely and distressed,\" he said.\n\n\"I just think that [WIN Network and Channel 7] have to be aware that they're providing a big service to us and, if that's suddenly gone, where do we go?\"\n\nHe is calling on the AFL to step in.\n\n\"I'd like to see what their stance is on it and that they understand what the issue is and the pain people are going through,\" Mr Marks said.\n\nThe AFL has been contacted for comment.\n\nJobe Stewart lives in Mount Gambier and competes in the Super2 series, as well as co-driving in the Bathurst 1000 for Erebus Motorsport.\n\nRace driver Jobe Stewart (right) says kids need to see sport for free on TV and sport needs kids watching. (Instagram: Jobe Stewart)\n\nWhile acknowledging many fans watched on paid streaming services, the 21-year-old said free-to-air broadcasts were important for children to gain an interest in the sport.\n\n\"I think that's very important,\" he said.\n\n\"Whatever a kid wants to do — whether it's football, motorsport, whatever — I think the passion is going to come from a very young age, so it's very important to build profiles for the drivers so young kids can look on the TV or whatever and find out about the drivers and what they might want to be when they grow up.\"\n\nReduced services\n\nGriffith Swans Football Club treasurer Jeff Harris said the loss of some free-to-air sport would impact the club's ability to grow.\n\n\"Our Auskick numbers are at record levels with 180-odd kids; for that generation to not have access to watch the sport at all unless they're streaming it, is potentially fairly impactful for us,\" he said.\n\n\"A city the size of Griffith with our population base, limiting us for news and sport and things is certainly concerning.\"\n\nGriffith City Council Mayor Doug Curran said there had been a withdrawal of local news coverage in Griffith after the announcement of a weekend-only edition of the Area News.\n\n\"We seem to be going backwards in terms of media coverage ... It's certainly not going to enhance our region,\" he said.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/the-new-generation-changing-classical-music/105469430",
    "title": "How a new generation is invigorating classical music",
    "publish_date": "Mon, 30 Jun 2025 22:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "As a tradition spanning centuries, classical music has a rich history of composers, performers and music-lovers.\n\nBut for most of us, classical music is typified by a small group of European male composers from the 18th and 19th centuries, such as Mozart, Brahms and Beethoven.\n\n\"Classical music is not immune to politics, prejudices and world forces that have affected all kinds of art forms,\" says Jessica Cottis, the Chief Conductor and Artistic Director of the Canberra Symphony Orchestra.\n\nAudiences want to hear music that resonates with our stories, Jessica Cottis says. (Sydney Symphony Orchestra: Timothy Jeffes)\n\nOne of Cottis's main tasks is selecting music the orchestra rehearses and performs. This includes concert staples by beloved composers as well as newly commissioned music that reflects our ever-changing stories.\n\nAnd the audience, she says, are very excited to go on the journey with her.\n\nCottis and other musicians discuss how classical music is a living, breathing art form.\n\nWhat classical music used to be\n\nAustralia's state symphony orchestras and institutions have a decades-long history of supporting Australian music. However, this support wasn't always as available for musicians from diverse and marginalised backgrounds, or who deviated from the sounds of the classical 'canon.'\n\nIn the ABC's early years, trailblazing composer Margaret Sutherland frequently criticised the broadcaster for inopportune placement of Australian music.\n\nDuring the first live televised concert by the ABC in 1957, the Sydney Symphony Orchestra had only a handful of women in its ranks.\n\nThere has been progress, albeit slow.\n\nNoongar man Aaron Wyatt became the first Indigenous person to conduct an Australian state orchestra as recently as 2022.\n\nNew series busts classical music myth Photo shows Woman in blue shirt and pants sits on a stool smiling widely. She sits against a plain, grey background. ABC Classic presenter Megan Burslem hates the idea that classical music is just for some.\n\nIn recent years, the sustained efforts of advocates in broadening music selection in Australia has accelerated, Cottis says.\n\n\"We're now much more in a place where audiences can see [beloved classics] like Mahler alongside Australian composers and no one will blink twice,\" she says.\n\nThis shift in attitude has opened up classical music's wealth of creative voices.\n\n\"Australians have a very strong acoustic identity with land and landscape through our Indigenous connection,\" Cottis says.\n\nShe relishes the challenge of presenting Australia's multiple histories and lifting up diverse sets of voices.\n\n\"As a conductor and a programmer, it's fascinating to find ways to create programs that tell stories through music, whether that was written 100 years ago, 200 years ago or in 2025,\" Cottis says.\n\nHow multicultural traditions can co-exist in music\n\nWhen cellist Abel Selaocoe visited Australia in April, he proved how classical music can co-exist with African musical traditions.\n\nSelaocoe, who grew up in South Africa's Johannesburg, incorporates throat-singing and percussion as part of his performances.\n\nDuring his Australian debut with the Australian Chamber Orchestra, Selaocoe asked orchestral members to learn each other's languages through singing and improvising with their voices.\n\n\"The different thing that binds cultures together is the idea of the voice,\" he says.\n\nDuring his visit to ABC Classic's studios, Selaocoe demonstrated how he combines the Western classical music and African influences which are equally important to his identity.\n\nLoading...\n\nMusic hasn't always simply been for pleasure for Selaocoe, who grew up in post-apartheid South Africa as a black person.\n\n\"This is our survival tactic,\" he says. \"I think living in the township [around Johannesburg], you are very aware that other children who maybe live in the suburbs or live in better conditions, have opportunities.\"\n\nSelaocoe's love for music took him to the African Cultural Organisation of South Africa, an outreach program for young South Africans in Soweto.\n\nLater, he pursued his studies to Manchester in England, where Selaocoe refined his unique musical style.\n\nSelaocoe's international collaborators include the London Symphony Orchestra and Chineke! Orchestra, an ensemble focused on diversity and inclusion in classical music.\n\nEmbracing collaborations in today's classical music world\n\nMelbourne-based guzheng virtuoso Mindy Meng Wang has been gracing Australian stages for a decade.\n\nThe instrument has a venerable musical tradition going back 2,500 years. In Meng Wang's hands, the guzheng becomes a bridge between Chinese and Western classical music traditions.\n\nMeng Wang's practice includes experimenting with expanding the guzheng's musical capabilities, such as finding different tuning systems and working with composers on new repertoire.\n\n\"The guzheng is traditionally tuned to a pentatonic scale, which makes a unique and singular sound world,\" Meng Wang explains. \"For me, working with Western music is like learning to speak a different language on the same instrument.\"\n\nMindy Meng Wang invents new techniques to play the guzheng, an instrument with 2,500 years of history. (Melbourne Symphony Orchestra: Nico Keenan)\n\nMeng Wang recently premiered the Concerto for Guzheng and Orchestra by Australian composer Jessica Wells, marking the first concerto for the instrument written outside China.\n\nThe concerto was part of the Melbourne Symphony Orchestra's Metropolis Festival, designed to showcase music by Australian composers.\n\nMeng Wang describes the process of working with Wells as very collaborative, from finding children's tales which underpin the concerto to workshopping Meng Wang's role in the orchestra.\n\n\"I played the role of a demon, which then transformed into a beautiful ghost girl,\" Meng Wang says. \"In the concerto, I played two differently tuned guzheng, which represent the shifting of the story and my visual and musical transformations.\"\n\nMeng Wang's growing list of collaborators includes pianist Paul Grabowsky, composer and soprano Deborah Cheetham Fraillon, the Australian Art Orchestra, Orchestra Victoria and the Sydney Symphony Orchestra.\n\nShe says her favourite aspect of collaboration is leveraging music's power to create \"a space where we can share stories without language.\"\n\n\" It takes us to magical places where you can have deep and sincere conversations with music. \"\n\nStream the Australian Chamber Orchestra's concert with cellist Abel Selaocoe on Front Row with Megan Burslem on ABC iview.\n\nGet the latest classical music stories direct to your inbox",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/asx-markets-business-live-news-july1-2025/105479978",
    "title": "Live: ASX climbs as Aussie dollar jumps close to eight-month high",
    "publish_date": "Mon, 30 Jun 2025 21:32:14 +0000",
    "category": "finance",
    "authors": [
      "Gareth Hutchens",
      "David Taylor",
      "Michael Janda",
      "Daniel Ziffer"
    ],
    "text": "This blog is not financial advice and it's certainly not personal financial advice tailored to your individual situation.\n\nBut it turns out more information could make you richer.\n\nBusiness news can do more than report on financial markets; it can predict where they're headed.\n\nA new study by University of Auckland finance lecturer Justin J Case and Queensland University of Technology's Professor Adam Clements, used business news articles to more accurately forecast stock market volatility than other commonly used methods.\n\nJustin Case (By William Chea, Univeristy of Auckland)\n\n\"Volatility is a common proxy for financial risk. By accurately forecasting this risk, investors can take strategic steps to protect their investments before market shifts occur.\"\n\nThe study took more than 1.1 million Wall Street Journal articles published between January 2000 and December 2022 (what are we, chopped liver?) and analysed the language used in the reporting and linked it to fluctuations in the S & P 500 — the broad US equities index that is the world's most-watched.\n\nThe study shows that news text is a \"forward-looking, real-time lens on market conditions, delivering more accurate signals about risk than the retrospective data typically used in economic forecasting.\"\n\nThe researchers applied a machine learning algorithm to news articles, sorting the text into topics and analysing these alongside high-frequency data on the S & P 500 index.\n\nHere's Dr Case again:\n\n\"We're looking at the world's biggest equities market, and the biggest business newspaper in the US, and asking whether the news explains stock market volatility. \"We find that news coverage is strongly related to stock market volatility movements. And by analysing business news articles, we can identify both the topics and specific events influencing stock market volatility.\"\n\nIn a release, the researchers say they found incorporating their news-based measures into benchmark volatility forecasting models reduced forecast errors by over 40 per cent at the monthly horizon. They also found significant reductions in forecast errors at weekly horizons.\n\nTest out the theory\n\nOK, we're getting to the money bit.\n\nThe researchers used their news-enhanced forecasts in a simulated investment strategy. The strategy saw more invested when the market was expected to be stable and less when it was expected to be volatile. This approach, utilising the news, improved investment performance, with risk-adjusted returns higher than both a traditional buy-and-hold strategy and a strategy using standard volatility forecasts.\n\nAlso, lots of sports news (like the World Cup and Olympics) is related to a less volatile market.\n\n\"This could be interpreted as a distraction effect, where increased attention to non-economic news coincides with lower stock market volatility.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/afl-scg-surface-unsafe-as-fixture-change-considered/105479996",
    "title": "'It was unsafe': Coach weighs in on SCG surface as AFL looks at moving games",
    "publish_date": "Mon, 30 Jun 2025 21:28:27 +0000",
    "category": "sports",
    "authors": [],
    "text": "The AFL's independent turf consultant is part of a delegation sent to inspect the SCG after Fremantle coach Justin Longmuir added his voice to growing concerns over the venue's playing surface.\n\nSunday's Sydney and Fremantle clash could be moved away from the ground following uproar over players repeatedly struggling to keep their feet during the Western Bulldogs' win over the Swans on Friday night.\n\nThe surface has been below its best since a concert at the venue by Italian tenor Andrea Bocelli in April, with particular concern over the Paddington end of the ground.\n\nUp to 90mm of rain is forecast for Sydney on Tuesday in what will further hamper hopes of having the SCG turf up to scratch.\n\nOn Monday, the AFL said the independent turf consultant, members of the league's football department and AFL Players Association representatives would inspect the ground this week.\n\nThe group will assist the ground's curator with ongoing management of the playing surface.\n\nFremantle's finals hopes last year were torpedoed by a series of injuries to key players late in the season, and Longmuir fears his team will be put at elevated risk if they have to play at the SCG on Sunday.\n\n\"I watched the game on Friday night, and we'll be led by the AFL, but the moment my brain goes to 'that's unsafe for players', I have a concern,\" Longmuir said after his side's win over St Kilda on Sunday.\n\n\"And I went there on Friday night. I thought it was a bit unsafe, especially down the left-hand side.\"\n\nLoading...\n\nLongmuir made specific mention of an incident in which Bulldogs defender Bailey Williams got his foot caught in the turf.\n\n\"I think the Bailey Williams one — we just can't put players out there and risk their safety if the ground's not right,\" he said.\n\nLongmuir said he will abide by the AFL's decision.\n\n\"If the AFL deem it safe to play, we'll play, and I won't speak another moment of it,\" he said.\n\n\"The AFL approached us and they're going to look at it, like they should, and they've got the experts and will be guided by them.\n\n\"But I thought it was unsafe the other night.\"\n\nBulldogs coach Luke Beveridge hopes Sunday's game is not moved, despite clear problems with the surface.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Our players haven't complained about it … it's a level playing field, pardon the pun,\" Beveridge told AFL360.\n\n\"Some of the boys were losing their footing pretty easily in the early parts of the game. Even Marcus (Bontempelli) slipped over early.\n\n\"It would be such a shame if any games were moved from the SCG. Is it really dangerous? I don't know.\"\n\nFremantle (10-5) are just percentage adrift of third spot following a six-match winning run.\n\nBut their thrilling 11.15 (81) to 9.15 (69) victory over St Kilda on Sunday came with an injury cost, and in a bizarre manner.\n\nNat Fyfe will be sidelined for up to four weeks with a moderate-grade calf strain sustained while he was warming up as the substitute at half-time.\n\nThe 33-year-old veteran felt tightness at the time and the Dockers decided against sending him on, with the severity of the injury then confirmed on Monday.\n\nFyfe had been set to feature in his fourth match back after recovering from a hamstring injury.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/photos-of-the-month-june/105386690",
    "title": "Our top photos from WA in June, featuring people we can't show you",
    "publish_date": "Mon, 30 Jun 2025 21:26:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "By the end of June, our reporters had filed stories holding power to account, conveying the emotion of a high-profile court case and documenting the rapid spread of a beetle wrecking havoc on trees.\n\nThis collection of photographs offer a window into the people, places and moments behind the headlines — and tell a story of the month that was.\n\nCommunity's most vulnerable\n\nWe were unable to identify the people interviewed due to legal restrictions. (ABC News: Cason Ho)\n\nA pile of documents inks a timeline of Claire's* daughter's descent into the state care system.\n\nThe mother and daughter's story highlighted how a system which is meant to care for some of the community's most vulnerable people can be weaponised against them.\n\nIt spurred on an admission from the WA public guardian in a rare public appearance that some \"vexatious applicants\" are using the state guardianship and administration system to do harm.\n\nState control\n\nDaniel believes the Public Trustee has wronged his family. (ABC News: Cason Ho)\n\nDaniel's* mother's assets were put under the care of the Public Trustee during a family dispute.\n\nThe trustee charged huge fees to manage her assets, but made a loss on two rental properties in Perth.\n\nThe day after Daniel's story was published, the Public Trustee said he would support the reduction of his office's fees by the state government.\n\nReproductive rights\n\nJane was forced to travel over east to undergo IVF with her own frozen eggs. (ABC News: Briana Shepherd)\n\nJane* describes herself as a \"reproductive refugee\", having to travel interstate to undergo IVF with her own eggs because WA's laws prevent her from going through the same process at home.\n\nThe procedure was successful and she was 30 weeks pregnant, due to have a girl, when she talked to the ABC in June, while the state government has announced its \"intention\" to introduce new legislation by the end of year.\n\nChanging landscapes\n\nFood truck vendors said they are only seeing a few customers. (ABC Kimberley: Dunja Karagic )\n\nAt Broome's Cable Beach, 2,100 kilometres north of Perth, a local shire redevelopment has blocked access to parts of the famous beach, frustrating locals and businesses.\n\nFaced with declining customers, some food trucks have had to relocate, leaving vendors \"broken-hearted\".\n\nPursuit of justice\n\nMs Turvey and Detective Senior Sergeant Cleal hug outside court after the sentencing. (ABC News: Cason Ho)\n\nAlmost three years on from her son Cassius's death, Mechelle Turvey embraced the detective who led the murder investigation after the murderers were sentenced to life imprisonment.\n\nMechelle's courage and restraint paved the way for justice to take its course, and has helped to improve the way WA Police interact with Aboriginal victims of crime.\n\nFour-legged legend\n\nMarley the dingo brought light into many peoples' lives. (ABC South West WA: Bridget McArthur)\n\nMarley was Bunbury's much-loved alpine dingo who sadly died earlier in the month.\n\nThough few knew how he'd come to live independently at Bunbury's harbour area, most long-time residents had a story about him, and many said he helped them through dark times.\n\nOver the past 16 months, reporter Bridget McArthur went to the habour to try and photograph the beloved canine, but only got close-up pictures once.\n\nDeep connections\n\nTuesday Lockyer says she feels the presence of spirits when she visits the rock formation. (ABC News: Charlie Mclean)\n\nPanna Hill, or Parlapuni as the Robe River Kuruma people call it, is a rock formation 1,400 km north of Perth outside the remote town of Pannawonica.\n\nFor local woman Tuesday Lockyer, the outcrop is a place of spiritual significance where she feels at both peace and strength.\n\nSmall beetle, big problem\n\nThe green spaces at Hyde Park are becoming more barren. (ABC News: Andrew O'Connor)\n\nIn a sobering development in the state's fight against the polyphagous shot-hole borer, the government has conceded it is no longer feasible to eradicate the beetle, shifting to a management approach instead.\n\nAbout 4,800 trees in Perth have been infected, and iconic trees at Perth's Hyde Park have been chopped down and mulched as a result.\n\nThis composite shows the tree canopy at an island in Hyde Park in late May, compared to a month later.\n\nRegional footy\n\nThe crowd of nearly 13,000 set an attendance record for Hands Oval. (ABC South West WA: Bridget McArthur)\n\nThe round 13 game between West Coast and North Melbourne was the first ever in-season AFL game hosted in regional WA, bringing thousands of people to the city of Bunbury, which is often bypassed by Perth locals and tourists.\n\nLocal kids watched in awe as the oval they grew up playing on transformed into an AFL arena.\n\nThe council hopes it’s just the start of turning Bunbury into a sports capital.\n\nBuilding WA\n\nA shell ward, to be fitted out over the next year, at Joondalup Hospital. (ABC News: Keane Bourke)\n\nRoger Cook and Rita Saffioti's first budget since the election was pitched as being all about changing WA for the better.\n\nThere are grand plans for the future, but in the short-term they're focused on building more homes and creating more hospital beds.\n\nThat's meant they (and the journalists following them) have spent lots of time on construction sites lately.\n\nStepping back from the high-vis and stage-managed events, those construction sites can be full of different textures and lines, making for some interesting scenes to photograph.\n\nSlide-show nights\n\nThe way we share photos has changed a lot over the years. (ABC Midwest and Wheatbelt: Chris Lewis)\n\nWhile technology has evolved, has the reason we take photographs changed too?\n\nKevin Parsons has a unique view of photography from the past to the present day.\n\nHis mother, an avid photographer in Western Australia's Midwest in the 1950s and 60s, left him a cherished collection of photo slides and 8-millimetre film reels.\n\nTraditional woodwork\n\nDenzel Coyne in Albany, May 2025. (ABC News: Samantha Goerling)\n\nNoongar artist Denzel Coyne honours his late parents by making traditional Indigenous artefacts — his tattoos commemorating them, and the woodwork converging in this picture.\n\nHe started making the artefacts as an adult while in a rehab program, and has been enthralled by the process since — even teaching his daughter how to throw a boomerang.\n\n*Claire, Daniel and Jane are pseudonyms",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/rugby-league-brad-fittler-out-kangaroos-coaching-race/105479994",
    "title": "'Didn't think I could do it justice': Fittler pulls out of Kangaroos coaching race",
    "publish_date": "Mon, 30 Jun 2025 21:18:10 +0000",
    "category": "sports",
    "authors": [],
    "text": "Brad Fittler has withdrawn from the race to take over as Kangaroos coach, after opting to focus on his television commitments.\n\nFittler has told the ARL Commission he is no longer eyeing off the Australian Test job, after having been the initial favourite to replace Mal Meninga.\n\n\"There was an opportunity there, I'm very grateful for them thinking about me, but I think just in the situation I'm in at the moment, my commitments to Channel 9, I work for the NRL, I'm really enjoying that,\" Fittler told 2GB about his decision.\n\n\"When the role came about and I just started to think about it and start planning that this is maybe for someone else at the moment.\n\n\"It was an incredible opportunity, but I also didn't think I could do it justice. That's why I didn't want to commit to it.\n\n\"But what an incredible opportunity for someone. I think it's someone with a bit of time. They need to get hotels, grounds, training fields, equipment, everything — it's a big job ahead, but what an awesome experience it is going to be, three Tests over in England.\"\n\nThe former NSW mentor's decision leaves Cameron Smith as the front-runner for the role, having also emerged as a genuine contender.\n\nSmith only retired from representative football eight years ago, but has coaching experience as Billy Slater's Queensland assistant in 2022 and 2023.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nKevin Walters is also considered an option, after briefly meeting with the NRL as they searched for the Perth Bears' first coach.\n\nWalters is keen to get back into the coaching game, after being sacked by the Broncos at the end of last season.\n\nMeninga was forced to end his nine-year tenure at the helm of the Kangaroos in early June, after taking on the head coach job at the Bears.\n\nAppointing a new Kangaroos coach is a top priority for the ARLC, with an end-of-season Ashes tour of England looming.\n\nA full-time Jillaroos coach must also be appointed, after Brad Donald's exit earlier this year.\n\nHis former assistant Jess Skinner took over on an interim basis for Australia's Test against England in Las Vegas in March, which the Jillaroos won 90-4.\n\nAAP",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-01/wa-budget-new-financial-year-will-you-be-better-off/105477172",
    "title": "It's a new financial year. Here are the new charges West Australians face",
    "publish_date": "Mon, 30 Jun 2025 21:16:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's a new financial year, which means a new budget is in place.\n\nBut what does this mean for West Australians, and can they expect to be better or worse off over the next 12 months?\n\nHere's what will cost you more, where you'll get some assistance and more importantly, when it will happen.\n\nWhat is costing more?\n\nThere are several changes to this year's state budget coming into effect today that might have some West Australians revising their financial spreadsheet.\n\nFirstly, there will be an increase of 2.5 per cent to bills like water and electricity, which will cost the average household an extra $94 a year.\n\nThe WA government's power credits are over, but the federal government has offered some relief. (ABC News: James Carmody)\n\nFor the past five years, the Cook government has been helping WA households pay their power bills with electricity credits, but those payments will be put on hold.\n\nBut it's not all bad news, with the federal government promising to shave $150 off every household's yearly power bill.\n\nIt will also cost you more to keep your car on the road.\n\nMotorists will pay more to keep their cars on the road. (ABC News: Grace Burmas)\n\nCar registration and drivers licence fees are expected to increase by 3 per cent, which means you'll be spending more than $1,000 per annum in on-road costs for households with one car.\n\nWhat has the government promised?\n\nIn their budget's key initiatives, the WA government said it would spend almost a billion dollars — or $963 million to be exact — on cost-of-living relief measures.\n\nIf you have a mortgage, it's good news, with cash rates tipped to stay low.\n\nNew laws, changes and payments coming into effect this financial year Photo shows A hand holds up blocks that read 01 July. Stacks of paper sit below Minimum wage, parental leave and road fines will increase in changes to laws this new financial year.\n\nBut for renters, the next 12 months could see little reprieve, with weekly rents expected to remain high.\n\nThe government has allocated funding towards infrastructure to build new homes but this will take time, and it's unlikely benefits will be felt over the next year.\n\nThe budget set aside $337 million for the state's residential battery scheme, which is expected to support around 100,000 households.\n\nThe second round of the WA student assistance payment will get $89 million, supporting primary and kindergarten students.\n\nFor kids taking public transport to school, the government has promised $10 million to extend free public transport in the 2026 school year.\n\nThe latest budget has also pledged stamp duty relief for first home buyers.\n\nWho will this help?\n\nSo, will you be better off over the next 12 months?\n\nAlan Duncan, director of the BankWest Curtin Economics centre at Curtin University, said the budget had taken some steps to help households across the state, but it would not offer immediate relief to those struggling the most.\n\nMr Duncan said the amount of pressure people were currently under had taken time to accumulate and therefore would take time to overcome.\n\nAlan Duncan says WA is still in a better position than the other states and territories. (ABC News: Claire Moodie)\n\n\"Proportionately, the rising rental costs in Western Australia are amongst the largest in the country,\" he said.\n\n\"The housing supply sector has been under special pressure in Western Australia … our property sector has been quite challenged in meeting the increased demands of the housing supply.\"\n\nMr Duncan said while wages and salaries were growing at a faster rate than prices in some respects, it was still not substantial.\n\n\"If it was half a per cent … that rate of real wage growth, it will still take you possibly three or four years to get back to the purchasing power wages had before the start of this huge trajectory of rising prices,\" he said.\n\nIs it enough?\n\nIn assessing whether there are enough measures to alleviate immediate cost-of-living pressures, Mr Duncan believes we're \"a bit short\".\n\n\"Not everybody is able to take advantage of the lower public transport fares or the free transport for school children,\" he said.\n\nThe five things you should know about the WA budget Photo shows WA Treasurer Rita Saffioti stands speaking in parliament. Roger Cook's government has handed down its second budget. Here's what you need to know.\n\n\"We are seeing some relief for energy costs, but that comes through the Commonwealth government's measures and the state government's electricity credits being paused.\"\n\nBut he said the budget has been good for the time we are in.\n\n\"In the scheme of things, we're in a far, far better position in WA than pretty much any other state in that regard, so I'm very comfortable with the strength and the sustainability of our public finances,\" he said.\n\nMr Duncan said one budget could not overcome years of accumulated pressure.\n\n\"What I'm really looking for is a continuation and a sustained commitment to improve the support measures that are put in place to help our families and our community,\" he said.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/victoria/robbie-williams-key-to-the-city-award-prompts-rule-overhaul-at-city-of-melbourne-20250701-p5mbk7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Robbie Williams’ key to the city award prompts rule overhaul at City of Melbourne",
    "publish_date": "Tue, 01 Jul 2025 12:18:11 +1000",
    "category": "entertainment",
    "authors": [
      "Cara Waters"
    ],
    "text": "British pop star Robbie Williams being gifted the key to the city has caused an overhaul of City of Melbourne rules about who can receive the honour.\n\nWilliams was presented with the key to the city by Lord Mayor Nick Reece at a free surprise public concert at Federation Square on January 2 before an estimated crowd of 10,000.\n\nRobbie Williams in Melbourne in January. The singer was awarded a key to the city and staged a free concert to promote his biopic. Credit: Justin McManus\n\nHowever, the decision to give Williams the honour came under scrutiny after it was revealed Reece and council chief executive Alison Leighton made the decision alone, and the other councillors only found out the day before the public ceremony.\n\nCouncillors demanded a review of the City of Melbourne’s processes after Roadshow Films, a fully owned subsidiary of Village Roadshow and the distributor of the Williams biopic Better Man, requested the singer receive the key to the city.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-flights-cancelled-as-severe-weather-lashes-coast-20250701-p5mblb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane flights cancelled as severe weather lashes coast",
    "publish_date": "Tue, 01 Jul 2025 12:15:25 +1000",
    "category": "finance",
    "authors": [
      "William Davis"
    ],
    "text": "Flights to and from Brisbane have been cancelled or delayed, with “severe weather” set to lash parts of the east coast.\n\nHeavy rain and high-speed winds are predicted across much of NSW from today.\n\nThe Brisbane Airport website shows a significant number of services to and from Sydney, Melbourne, Newcastle, Townsville, Mackay and Hervey Bay have already been postponed or cancelled.\n\nVirgin has confirmed Brisbane flights have been affected by severe weather across parts of the east coast. Credit: Adobe Stock\n\n“[We have] been working with the aviation industry overnight to manage the impact of severe weather,” an Airservices Australia spokesperson said.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/it-was-great-while-it-lasted-jazz-master-farewells-his-second-home-20250628-p5maz7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "It was great while it lasted: Jazz master farewells his ‘second home’",
    "publish_date": "Tue, 01 Jul 2025 12:08:21 +1000",
    "category": "entertainment",
    "authors": [
      "John Shand"
    ],
    "text": "Nock tells stories in music, and he distils essences of emotion. Here little wisps of melody from the piano provoked response, commentary and elucidation from bassist Brett Hirst and drummer Toby Hall, the latter playing with his hands against Hirst’s groove, while Nock floated lines above them that were, by turns, pensive and supremely lyrical.\n\nAcross a career spanning seven decades, primarily in New Zealand, the US and Australia, Nock has proved himself a composer, improviser and band leader of the highest calibre. This was instantly evident on the opening Not We But One.\n\nSo it’s goodnight to Foundry 616, the love child of a man whose passion has been presenting jazz in Sydney for more than 40 years, Peter Rechniewski. People get Orders of Australia for doing much less. This was a hell of a penultimate gig, featuring the pianist who played the venue’s first concert 13 years ago, Mike Nock.\n\nThen, as the composition’s title suggests, the three instruments seemed to converge, and the interaction had a profundity like fine poetry, where each word contains a deeper truth. This was music playing the musicians, rather than the other way around, and it stayed at this peak when tenor saxophonist Karl Laskowski joined, generating a gruff sound, and playing short, stabbing phrases that drove the groove rather than riding on it. Nock then reoccupied the foreground, finding typically surprising implications in what the rhythm section was offering.\n\nThe band slipped back into a safer place with Foundry Start-Up Blues, although Laskowski grabbed the piece by the scruff and made it raw and real. Much more engrossing was the contemplative Acceptance, which had Nock making little rivulets of melody flow into the gentle, bossa nova-tinged groove, before Laskowski played a solo as languid as floating downstream in a dinghy without resort to oars.\n\nHall crafted a stonking, bucking solo on the boppish Transitions, and Hirst, Nock’s longest-serving collaborator, soloed with sinewy vigour on a blues in the second set, which also featured Laskowski deploying the brawny sound and loping lines beloved of Texan tenor saxophonists.\n\nEvery composition presented different facets of Nock the composer and Nock the improviser. One moment we’d hear his love of rhythmic puzzles and child-like joy in the game of making music, and the next his capacity for crystalline beauty; one moment rhythmic drive and the next flurries of abstraction.\n\nI began listening to Nock in the 1970s via records and an Australian tour when his fabled US career was peaking, and then in 1982 came the mysterious and ethereal Ondas masterpiece. When he returned to Australia permanently in 1985, he didn’t always find musicians who could consistently play at his level of invention. But he persisted. Three of the worthy ones were with him on this night, as he bid adieu to the venue that has been his second home for 13 years.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/shibasaki-opens-up-on-shock-maroons-debut-20250701-p5mbmr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Shibasaki opens up on shock Maroons debut",
    "publish_date": "Tue, 01 Jul 2025 12:03:56 +1000",
    "category": "finance",
    "authors": [],
    "text": "Shibasaki opens up on shock Maroons debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/politics/federal/union-boss-appointed-to-15b-government-fund-board-without-checks-20250630-p5mb8y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Union boss appointed to $15b government fund board without checks",
    "publish_date": "Tue, 01 Jul 2025 12:03:33 +1000",
    "category": "finance",
    "authors": [
      "Olivia Ireland"
    ],
    "text": "Prime Minister Anthony Albanese’s $15 billion fund to boost domestic manufacturing approved funding without finalising its strategy, did not obtain conflict of interest declarations from all suppliers and has a union boss on its board who received the role without due diligence checks.\n\nThe Australian National Audit Office’s review of the National Reconstruction Fund Corporation found that since its establishment in September 2023, the organisation had mostly functioned effectively, but one board appointment stood out.\n\nFormer industry minister Ed Husic. Credit: Alex Ellinghausen\n\nIt concluded that the appointment of Australian Manufacturing Workers’ Union president Glenn Thompson in October 2023 by then-industry minister Ed Husic did not have the checks that every other board member underwent before joining the fund.\n\nThe report casts doubt on federal Labor’s commitment to ending the practice of handing political allies plum government appointments, after Finance Minister Katy Gallagher announced a review in 2023 to end “jobs for mates” culture.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/politics/victoria/a-time-for-truth-yoorrook-justice-commission-20250625-p5ma8m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A time for truth: Yoorrook Justice Commission",
    "publish_date": "Tue, 01 Jul 2025 11:59:30 +1000",
    "category": "sports",
    "authors": [],
    "text": "Most of the dead were under two, and were either inside or known to the system over four years.\n\nOctober 29, 2024\n\nby Kieran Rooney",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/trump-magic-math-the-us-senate-has-just-made-5-8-trillion-disappear-20250701-p5mbjp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump’s ‘magic’ act: The US Senate has just made $5.8 trillion disappear",
    "publish_date": "Tue, 01 Jul 2025 11:58:58 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "That’s why the Republicans have resorted to accounting gimmickry. Conventional congressional policy measures outcomes by what’s known as “current law baseline,” which takes into account the legislated expiry of fiscal measures. That’s why the Trump tax cuts were scheduled to expire this year, to reduce the cost that would otherwise have been factored into the Congressional Budget Office’s 10-year deficit and debt projections. Republican Senator Lindsey Graham is “king of the numbers.” Credit: AP Extending policies with legislated extensions requires a new law, which is why the usual accounting convention is to treat the extension as a new cost.\n\nThe Republicans, however, have decided to use a “current policy baseline” approach, which assesses the impact on deficits and debt against current fiscal policies. On that basis, the Trump tax cuts never expire and therefore have no impact on the cost of the One Big Beautiful Bill. That simple change in accounting transforms the cost of the One Big Beautiful Bill from a $US3.3 trillion addition to US deficits over the next decade into a $US508 billion decrease in them. The accounting trickery is deceitful, creating the pretence that the Republicans are cutting spending while actually adding trillions of dollars to future deficits and debt while creating time bombs that future administrations will have to defuse, presumably by resorting to accounting trickery of their own. An indication of how the Republicans are manipulating the accounting rules to obscure the actual impact of the Trump budget on debt and deficits is provided by their treatment of Trump’s new tax breaks for tips, overtime, senior citizens, car loans and deductions for local and state taxes. The “temporary” spending measures in the bill are scheduled to expire at the end of the current Trump presidency. If they were extended indefinitely, they would add about $US1 trillion to deficits over the decade, according to the Committee for a Responsible Federal Budget.\n\nNormally, the question of whether the One Big Beautiful bill complied with the Senate rules would be referred to the non-partisan Senate parliamentarian, who has already ruled against inclusion of a number of items if the bill is to comply with the reconciliation process. Loading The Republicans, however, have avoided that scrutiny by giving the authority to decide the policy used for calculating the impact of the bill to the Senate Budget Committee chairman, Lindsey Graham, who said last week that he was “the king of the numbers.” “I’m Zeus, the budget king,” he said. At the weekend he said that, as budget chairman, he had decided to use current policy as the reference point for the tax cuts.\n\n“If you use current policy, they never expire, so the policies that were created in 2017 would not end in December. They would continue. And that’s a good thing for the American people, that’s a good thing for the economy, because it gives you certainty,” he said. Unsurprisingly, the Republican majority then voted to endorse Graham’s decision. The Democrats were quick to point out that the use of current policy as the baseline sets a precedent, one they could use to implement their own agendas – and undo Republicans’ – if they regained control of Congress. Effectively, they – or a future Republican majority – could create massive new programs, legislate their expiry in a few years to minimise their apparent impact on debt and deficits and then claim that their extension was costless, even though they could blow out deficits and debt over the longer term.\n\nWhile the change in accounting policy might help protect the use of the reconciliation process, it doesn’t disguise the reality that the One Big Beautiful Bill will significantly increase US deficits and debt, pushing the current federal government debt level up from $US36.2 trillion to around $US40 trillion by 2034. That’s caused some dissension among Republicans. In the Senate, two senators have already declared they’ll vote against the bill and as many as eight have expressed some opposition to it. With the Senate version of the bill significantly more expensive that the one the House passed narrowly, even if it scrapes through the Senate there is no certainty that it will remain intact once it returns to the House, where the House Freedom Caucus of fiscal conservatives are saying that the Senate version needs major changes if it is to gain their support. Trump has set a July 4 – Independence Day – deadline for passage of the bill, which is why the Republicans have been scrambling to try to lock in enough votes to ensure it clears the Senate and why Elon Musk, who went silent after his criticisms of the bill (and some verbal attacks on Trump) triggered an aggressive and threatening response from Trump, has re-emerged. In posts on his social media platform, X, Musk described the spending levels of the bill as “insane” and said the bill would increase the US debt ceiling by a record $US5 trillion. It was obvious, he said, that Americans were living in a one-party country, the “porky pig party.”",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/jorgensen-and-suaalii-to-return-for-wallabies-against-fiji-20250701-p5mbkz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jorgensen and Suaalii to return for Wallabies against Fiji",
    "publish_date": "Tue, 01 Jul 2025 11:55:44 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "Max Jorgensen and Joseph-Aukuso Suaalii will make returns from lengthy injury breaks in the Wallabies starting side against Fiji in Newcastle on Sunday, and Harry Wilson is set to retain the captaincy, as coach Joe Schmidt begins to show his hand for the British and Irish Lion series.\n\nAs the Lions continue their hectic tour schedule with games in Brisbane and Sydney this week, the Wallabies have been quietly preparing in Newcastle ahead of a clash with the Mick Byrne-coached Fiji.\n\nSchmidt will name his team on Friday but the shape of the side has been slowly revealed by Schmidt’s release of players back to play for Queensland, the Waratahs and the Brumbies against the Lions. Taniela Tupou, Andrew Kellaway and Corey Toole have all returned in the past few days, thus ruling them out of Test duty on Sunday.\n\nThe team is set to look very similar to the Wallabies sides from the Spring Tour last year, according to informed sources, with Suaalii returning from a broken jaw to line up at outside centre, alongside Len Ikitau.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/politics/nsw/wynyard-is-the-hub-start-up-founders-resist-move-to-tech-central-20250627-p5mawc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Wynyard is the hub’: Start-up founders resist move to Tech Central",
    "publish_date": "Tue, 01 Jul 2025 11:53:24 +1000",
    "category": "finance",
    "authors": [
      "Jessica Mcsweeney"
    ],
    "text": "The NSW government will soon move the city’s emerging businesses to its shiny new Tech Central precinct, billed as Australia’s largest innovation hub – but Sydney’s start-up founders say they don’t want to leave their current space.\n\nStart-ups, investors and coworking communities at the much-loved Sydney Startup Hub, due to close in August, said the change would fracture Sydney’s “start-up ecosystem”, with businesses unable to find appropriate space at Tech Central, or unwilling to move.\n\nAn impression of Atlassian’s planned building, the centrepiece of the city’s new tech hub.\n\nThe government insists Sydney Startup Hub, an office space near Wynyard with subsidised desk rentals, isn’t commercially viable.\n\nConstruction is under way on the 39-storey Atlassian headquarters beside Central Station, which will be the centrepiece of Tech Central.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/wa-news-live-findings-in-cleveland-dodd-inquest-expected-today-20250630-p5mbgy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Perth house prices hit new peak as listings fall",
    "publish_date": "Tue, 01 Jul 2025 11:52:40 +1000",
    "category": "finance",
    "authors": [],
    "text": "Perth’s median house price has increased by 0.8 per cent in June to $786,000, as active listings in the city fall below 4000 for the first time in nearly a year.\n\nAccording to REIWA, the price is 16.4 per cent higher than this time last year, with the market still experiencing strong demand.\n\nLoading\n\nThe median unit price increased by 0.9 per cent in June to $540,000, marking a huge 20 per cent jump year-on-year.\n\nThe suburbs that saw the most price growth in June were Mount Lawley (up 2.6 per cent to $1,580,000), Coodanup (up 2.6 per cent to $600,000), Ocean Reef (up 1.6 per cent to $1,300,000), Kewdale (up 1.5 per cent to $758,500) and Melville (up 1.5 per cent to $1,382,500).\n\nHouses in Perth sold in a median of 13 days in June while the median rent price increased 0.7 per cent to $680 per week.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/world/europe/the-royal-train-reaches-the-end-of-the-line-after-156-years-as-costs-bite-20250701-p5mbjd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Royal Train reaches the end of the line after 156 years, as costs bite",
    "publish_date": "Tue, 01 Jul 2025 11:52:38 +1000",
    "category": "finance",
    "authors": [
      "Michael Holden",
      "Danica Kirka"
    ],
    "text": "London: The Royal Train will soon leave the station for the last time, with King Charles deciding to scrap the service that dates back to Queen Victoria because it is no longer cost-effective.\n\nVictoria, Charles’ great-great-great-grandmother, commissioned the first royal rail carriages back in 1869. The latest incarnation is made up of nine carriages that can be hitched to commercial locomotives, the most recent of them added in 1986.\n\nQueen Elizabeth II and Meghan, the Duchess of Sussex, arrive by the Royal Train at Runcorn Station, in north-west England in 2018. Credit: AP\n\nBut it was used just twice during the past financial year, with the two journeys together costing almost £80,000 ($167,000).\n\nJames Chalmers, the king’s treasurer, said the monarch had now agreed that the train – which critics had long said was a waste of money – would reach the end of the line in 2027.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/from-reserve-grade-to-blues-squad-kiraz-is-on-the-cusp-of-origin-debut-20250630-p5mber.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "From reserve grade to Blues squad, Kiraz is on the cusp of Origin debut",
    "publish_date": "Tue, 01 Jul 2025 11:52:37 +1000",
    "category": "sports",
    "authors": [
      "Billie Eder"
    ],
    "text": "Jacob Kiraz couldn’t get a start in the NRL four years ago. Now, he’ll make his State of Origin debut if winger Brian To’o isn’t fit enough for the decider at Accor Stadium on July 9.\n\nWith To’o nursing a lateral ligament tear in his knee, Kiraz – the Blues 18th man – is a chance of starting.\n\n“Obviously, Bizza’s scan was a good one, but again [he’s on] restricted duties, so you just can’t afford to take any chances there, that’s the reason Jacob’s 18th man,” NSW coach Laurie Daley said.\n\n“So, he’ll [Kiraz] train the majority of the sessions so he won’t miss a beat, so if we need to make that change, we can, we’ve got that flexibility there, so it won’t disrupt our preparation. More importantly, Bizza can try and get right, and Jacob, if he plays, has got a good 11-day prep going into his first Origin.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/national/the-gen-z-dating-experience-20250701-p5mbmj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Gen Z dating experience",
    "publish_date": "Tue, 01 Jul 2025 11:50:07 +1000",
    "category": "finance",
    "authors": [],
    "text": "The Gen Z dating experience\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-1-july-2025/09lysaarv",
    "title": "Midday News Bulletin 1 July 2025",
    "publish_date": "Tue, 1 Jul 2025 02:00:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Key Points Emergency crews on standby as east coast storm hits\n\nHigh-risk Australians eligible for free lung-cancer screening\n\nCarlos Alcaraz beats Fabio Fognini at Wimbledon\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWhat's called a \"bomb cyclone\" is set to dump more than 100 millimetres of rain in the space of hours on Australia's east coast.\n\n\n\n\n\nMeteorologists say the fast-developing storm Sydney will impact significant stretches of the New South Wales coast today and tomorrow.\n\n\n\n\n\nIt's already sparked heavy rain, strong winds and hazardous surf - and up to 120 millimetres of rain is expected to lash Greater Sydney alone over the next six hours.\n\n\n\n\n\nSES state operations manager Dallas Burnes says emergency calls have already started to come through - as the weather system intensifies.\n\n\n\n\n\nHe says the mid north coast region is an area of concern for emergency services because of the soil is still saturated from the May floods.\n\n\n\n\n\nHelen Reid - from the Bureau of Meteorology - says flash flooding is also a risk for communities.\n\n\n\n\n\n\"There is isolated heavy rainfall, which may lead to flash flooding along the coastal fringe, north of Ulladulla with six-hourly totals between 70-90 millimetres up to 120 millimetres in isolated locations in that six-hour period. Towns impacted include Armidale, Newcastle, Gosford, Sydney, Wollongong, Nowra and Batemans Bay. Locally, destructive wind gusts of 125 kilometres an hour - also possible from midday on Tuesday for exposed coastal areas between Bondi and Wollongong.\"\n\n\n\n---\n\n\n\n\n\nFrom today, Australians at high risk of developing lung cancer can undergo a screening test - free-of-charge through Medicare.\n\n\n\n\n\nAustralia’s first new national cancer screening program in nearly 20 years is being rolled out, targeting people aged between 50 and 70 who have a history of smoking.\n\n\n\n\n\nAboriginal and Torres Strait Islander people are in particular, being encouraged to use the screening program, as lung cancer is the most common cause of cancer death among First Nations Australians.\n\n\n\n\n\nThe CEO of the Lung Foundation Australia, Mark Brooke, says early screening aims to improve the survival rate outcomes.\n\n\n\n\n\n\"Australia stands as leaders globally. We will be one of the first countries in the world to have a National Lung Cancer Screening Program that will look across Australia, and particularly because it's been co-designed with Aboriginal and Torres Strait Islander people, will support those people who have often been forgotten.\"\n\n\n\n---\n\n\n\n\n\nVictorian premier Jacinta Allan says the state's Voice to parliament won't be written into its constitution.\n\n\n\n\n\nThe Premier says it will not require constitutional change, unlike the failed Federal voice proposal.\n\n\n\n\n\nThe government has confirmed the First People's Assembly will be a permanent fixture and will be made up of 33 elected members who will provide advice on laws and policies that affect Indigenous communities in Victoria, from health and education to crime and development.\n\n\n\n\n\nMs Allan says the voice to parliament - as well as ongoing treaty negotiations - aim to enable First Nations people to have a better say in the policies that affect them.\n\n\n\n\n\n\"The treaty process and outcome is grounded in that pretty simple common sense approach, that when you listen to people who are affected by policies and programs, when you involve them in the processes, you get better outcomes.\"\n\n\n\n---\n\n\n\n\n\nThere are renewed calls for a Gaza ceasefire, after another deadly 24 hours in the enclave.\n\n\n\n\n\nLocal officials and medical staff say Israeli attacks have killed at least 72 Palestinians, including 21 people at a crowded seafront rest area near Gaza City.\n\n\n\n\n\nEarlier, Israel's military issued evacuation orders for those in northern Gaza, as it warned of intensifying military activity.\n\n\n\n\n\nUN spokesperson Stéphane Dujarric says there needs to be a swift resolution to end the violence.\n\n\n\n\n\n\"The Secretary-General is alarmed by the new evacuation orders in northern Gaza, which have once again displaced tens of thousands of people. The Secretary-General condemns the continued loss of civilian life resulting from Israeli airstrikes and other attacks. All parties must comply fully with international law at all times. The Secretary-General welcomes the continued efforts by the mediators and reiterates his appeal to the parties to urgently reach a permanent ceasefire.\"\n\n\n\n\n\nMeanwhile, a US official says President Donald Trump will host Israeli Prime Minister Benjamin Netanyahu for talks at the White House next Monday.\n\n\n\n---\n\n\n\n\n\nIn tennis, Carlos Alcaraz has survived Wimbledon's hottest-ever opening day, eventually triumphing against Fabio Fognini in five sets.\n\n\n\n\n\nWith air temperatures soaring to 32 degrees Celsius, the defending champion needed more than four hours to subdue veteran Fognini.\n\n\n\n\n\nOnly two defending men's champions had ever lost in the first round at Wimbledon, but there were moments when Alcaraz looked in danger of joining compatriot Manuel Santana on that short list.\n\n\n\n\n\nThe last set was interrupted, after a spectator became unwell in the heat and required assistance.\n\n\n\n\n\nAlcaraz charmed the crowd by offering his water bottle to the distressed fan.\n\n\n\n\n\nHe says he was nervous before the match - and he is relieved to get through to the next round.\n\n\n\n\n\n\"I've been playing really, really tough matches the last year, the last year in this tournament. Just really proud that I always find a way. Today I did it, even though Fabio was playing a great tennis. Just really proud to overcome the problem, to overcome the tough moments, and found my way.\"\n\n\n\n---\n\n\n\n\n\nMeanwhile, Jordan Thompson is the only Australian to advance to the second round at Wimbledon, after day one of the tournament.\n\n\n\n\n\nThe 31-year-old beat Czech player, Vit Kopriva in a match lasting three hours and 37 minutes.\n\n\n\n\n\nSeven other Australians were eliminated: including Ajla Tomljanovic, Olivia Gadecki, Chris O’Connell, and James Duckworth.\n\n\n\n\n\nAlexei Popyrin lost to English wildcard Arthur Fery - Fery's first win in a grand slam.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/thousands-in-norway-told-they-won-huge-sums-in-lottery-error/c3fbw8hpc",
    "title": "'Could it be true?': Thousands in Norway told they won huge sums in lottery error",
    "publish_date": "Tue, 1 Jul 2025 01:11:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "A Norwegian lottery company has apologised to 47,000 gamblers who were mistakenly told they had won huge sums in a lottery, with the firm blaming a currency conversion error.\n\n\n\n\n\nState-owned gambling group Norsk Tipping said it had published incorrect prize amounts following a Eurojackpot draw due to an error in converting from euro cents to Norwegian kroner.\n\n\n\n\n\nThe winnings had been multiplied by 100 instead of being divided by 100, the company said.\n\n\n\n\n\nAmong the disappointed was Ole Fredrik Sveen, who was on holiday in Greece when he received a message from Norsk Tipping that he had won 1.2 million kroner ($181,000).\n\n\n\n\n\n\"I thought: 'Wow, is it finally my turn? Could it be true?' I go onto the Norsk Tipping website, and there it says in black and white: 'Congratulations, you have won!',\" Sveen told public broadcaster NRK.\n\n\n\n\n\nIn reality, he had won 125 kroner ($19).\n\n\n\nThree days later, Sveen and the 47,000 others received apologies by text message from Norsk Tipping for the error.\n\n\n\n\n\n\"The apology was a poor consolation. They should have sent it out after the mistake, not today,\" he said.\n\n\n\n\n\nNorsk Tipping has been heavily criticised for the error, not only from devastated players like Sveen but also from the authorities.\n\n\n\n\n\nThe lottery authority said it had launched a review to determine if gambling laws had been breached, and culture minister Lubna Jaffery described the error as \"totally unacceptable\".\n\n\n\n\n\nNorsk Tipping's chief executive, Tonje Sagstuen, resigned over the weekend, leaving acting chief executive Vegar Strand to apologise.\n\n\n\nStrand said his company's state ownership made the mistake particularly problematic, noting that the firm was \"entirely dependent on the trust of the population\".\n\n\n\n\n\n\"We have deeply disappointed our customers and take full responsibility for rectifying the situation. Such errors are serious for a company that is supposed to manage the trust of Norwegians.\n\n\n\n\n\n\"The work to rebuild trust again has the highest priority going forward.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-home-prices-climb-to-record-high-amid-lower-interest-rates-and-supply-shortage/fqb1wiscs",
    "title": "Australian home prices climb to record high amid lower interest rates and supply shortage",
    "publish_date": "Tue, 1 Jul 2025 00:15:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Strong buyer demand and fewer listings have pushed home prices to record highs in June, amid expectations of more interest rate cuts.\n\n\n\n\n\nData from PropTrack showed national home prices climbed 0.4 per cent last month and were up 4.6 per cent over the year, with the median cost of a capital city home now sitting at $923,000.\n\n\n\n\n\nThe average home is now $40,000 costlier than a year earlier.\n\n\n\n\n\nAdelaide, up 0.6 per cent, posted the strongest monthly rise, followed by Sydney and Hobart, which both recorded 0.5 per cent gains.\n\n\n\n\n\nPerth, Melbourne, Brisbane and Canberra prices rose 0.3 per cent, while Darwin grew 0.2 per cent.\n\n\n\nRegional markets lifted 0.3 per cent, according to the data, which pointed to affordability and lifestyle appeal.\n\n\n\n\n\nPropTrack said the market was gathering pace amid renewed buyer confidence, which was boosted by falling interest rates and expectations of another rate cut in July.\n\n\n\n\n\n\"However, the upturn remains measured as affordability constraints keep the pace of growth in check,\" it said.\n\n\n\n\n\nThe company said interest rate cuts in coming months would ease borrowing costs and add to housing demand, pushing prices higher.\n\n\n\n\n\n\"In addition, population growth and limited new supply are also placing upward pressure on prices, especially at the more affordable end of the market,\" PropTrack said.\n\n\n\n\n\n\"With interest rates moving lower, these factors are likely to sustain price growth over the second half of 2025.\"\n\n\n\nMonthly data from property research firm Cotality, also released on Tuesday, backed the trends, showing housing values rose by 0.6 per cent in June.\n\n\n\n\n\nIt pointed to supply-side factors as a large contributor, saying the current housing rebound was occurring against a backdrop of relatively low home sales.\n\n\n\n\n\n\"Advertised supply is scarce, creating a more balanced market for buyers and sellers,\" Cotality's research director Tim Lawless said.\n\n\n\n\n\nMany economists predict the Reserve Bank will cut the official cash rate at its July meeting after last trimming it in May by 25 basis points to 3.85 per cent.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sbs-speaks-to-former-treasurer-wayne-swan-on-australias-new-super-guarantee/vwp5mksx6",
    "title": "SBS speaks to former Treasurer Wayne Swan on Australia's new super guarantee",
    "publish_date": "Mon, 30 Jun 2025 21:11:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-is-runit-the-new-collision-sport-raising-concussion-fears/bgiilx4v2",
    "title": "What is RUNIT, the new collision sport raising concussion fears",
    "publish_date": "Mon, 30 Jun 2025 19:43:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "A video posted online shows medics coming to the aid of a man who is knocked to the ground about a second into an international event showcasing a new \"sport\" created in Australia.\n\n\n\n\n\nOn the ground is former NRL player Kevin Proctor, who took part in an exhibition competition in Dubai over the weekend, for what its promoters call the \"world's fiercest, new collision sport\".\n\n\n\n\n\nRUNIT was created by a group of Melbourne friends less than a year ago, but the event in Dubai follows competitions in Melbourne and Auckland that have taken place in recent months, after the initiative gained traction on social media.\n\n\n\n\n\nRUNIT Championship League may have gained almost 200,000 followers on Instagram in a short time, but not everyone is a fan, with concerns around the safety of the competition.\n\n\n\nWhat is RUNIT?\n\n\"Hit hard, stand your ground and inflict damage\", that is the key to winning RUNIT, according to a video on the league's YouTube channel.\n\n\n\nThere are concerns about the dangers that the competition poses to not only the health and safety of those participating, but also to anyone who might copy what they see in these competitions. Source: Getty / Hannah Peters The video shows vision of big hits and tackles in rugby games alongside sounds of bodies colliding with force.\n\n\n\n\n\nIt was posted in the lead-up to the Melbourne competition at the end of April and presented by Melbourne Storm player Nelson Asofa-Solomona, who is understood to have since distanced himself from the league.\n\n\n\n\n\n\"The rules of the game are simple, with a run zone of 10 metres, one player carries the ball, and the other defends; if you're running, the job is simple, you run it straight,\" he said in the video.\n\n\n\n\n\nThe video explains that four rounds are played with judges deciding the winner as the person who dominated contact the most.\n\n\n\n\n\nThe league advertised the winner of the Dubai event received $200,000.\n\n\n\nWho created RUNIT?\n\nSports player agent Lou Sticca explained in a social media post that RUNIT was \"the brainchild of a dynamic team comprising four Samoan Australian brothers, a cousin, and two Italian Australians and a close mate of ours (CT), all hailing from Dandenong\".\n\n\n\n\n\nHe announced his involvement with RUNIT in the same LinkedIn post about a month ago.\n\n\n\nThe concept has been inspired by a game — Run it Straight — the creators and many other Pacific Islanders have played in their backyards since childhood.\n\n\n\nWhat are the concerns?\n\nAnnitta Siliato, executive director of the Concussion Legacy Foundation Australia, said this competition brought a lot of the work around reducing brain injury backwards.\n\n\n\n\n\n\"I just cannot believe we've got this competition, which is encouraging people to run towards each other to knock each other out,\" she said.\n\n\n\n\n\n\"It could cause death, and it could cause serious brain injury.\"\n\n\n\n\n\nSiliato said she was aware of people having seizures after participating in activities similar to RUNIT competitions and said repeated head knocks could cause chronic traumatic encephalopathy.\n\n\n\nBoth competitors run towards each other in RUNIT, one with the ball and one without. Source: Getty / Hannah Peters Siliato said a lot of public education and work with different sporting codes had been done in recent years, and \"activities like this really bring us backwards\".\n\n\n\n\n\n\"Today in the AFL and NRL, there are all these stand-down periods and concussion rules to reduce the likelihood of brain injury ,\" she said.\n\n\n\n\n\nThe AFL's concussion panel, last month, ordered West Coast Eagles player Jeremy McGovern to retire on medical grounds.\n\n\n\n\n\nSiliato said she was also worried that young people were being influenced by what they had seen of RUNIT on social media and may copy what they see online.\n\n\n\n\n\nIn May, Radio NZ reported that a 19-year-old from Palmerston North city on New Zealand's North Island died after being critically injured playing a tackling game based on RUNIT.\n\n\n\nBrain scans\n\nWhen asked about safety by a Dubai radio station in the lead-up to the United Arab Emirates event, Sticca, who was the head of the delegation at the event, said: \"We've developed some very, very quick procedures and we're developing these as we go.\"\n\n\n\n\n\nHe told Dubai Eye 103.8 that participants were screened before taking part.\n\n\n\n\n\n\"We screen every participant with full medicals, including brain scans. We certainly don't want anyone participating who has any issues with their residual health. We check the athletes after the event as well,\" Sticca said.\n\n\n\n\n\n\"We've had concussion experts that we've engaged to help us identify ways to add value to the sports.\"\n\n\n\nCompetitors get four runs, and judges decide the winner. Source: Getty / Hannah Peters Sticca urged people not to emulate what they see RUNIT competitors do.\n\n\n\n\n\n\"We don't encourage kids to be playing this in the backyard,\" he said.\n\n\n\n\n\n\"We don't encourage men and women to be running at each other that don't have the training required to undergo this.\"\n\n\n\n\n\nSBS News has contacted the RUNIT Championship League and Sport and Recreation Victoria for comment.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/video/countdown-on-for-canada-australia-as-us-tariffs-loom/xt27liwy5",
    "title": "Countdown on for Canada, Australia, as US tariffs loom",
    "publish_date": "Mon, 30 Jun 2025 09:25:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Countdown on for Canada, Australia, as US tariffs loom\n\nPublished 30 June 2025, 8:40 am\n\nCanada says it's scrapping a proposed tax on US technology companies. It had been a flashpoint in trade negotiations between the neighbours, which now appear to be back on after the announcement. The Albanese government continues to advocate for a 10% blanket tariff to be lifted. There are also calls within the US congress for the Prime Minister to make his case in person.",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/tax-time-tips-asx-enjoys-above-average-returns-in-fy25/mssueui0t",
    "title": "Tax time tips & ASX enjoys above average returns in FY25",
    "publish_date": "Mon, 30 Jun 2025 08:08:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Investors who negatively gear a property do not make a profit from the rental income they make, instead they rely on making a profit when they sell their property, meanwhile the loss they may reduces the amount of tax they have to pay. Source: Getty / krisanapong detraphiphat",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/thousands-seek-australian-climate-visas-as-tuvalu-sinks/vx6cvc364",
    "title": "Thousands seek Australian climate visas as Tuvalu sinks",
    "publish_date": "Mon, 30 Jun 2025 08:05:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nFor some time now, scientists have feared the tiny Pacific Island nation of Tuvalu [[tooh-VAH-looh]] may become uninhabitable within 80 years due to climate change.\n\n\n\n\n\nBy 2050, NASA scientists project daily tides will submerge half the main atoll of Funafuti, home to 60 per cent of Tuvalu's residents, where villagers cling to a strip of land as narrow as 20 metres.\n\n\n\n\n\n‘Alopi Latukefu is the director of the Global Centre for Social Justice and Advocacy Leadership.\n\n\n\n\n\nHe says the impacts are already being felt right now on Tuvalu's nine atolls scattered across the Pacific between Australia and Hawaii.\n\n\n\n\n\n\"We are seeing these communities faced with real challenges in the community from the perspective of not just inundation from the sea level rise, but also in terms of food security, water security in these communities, the impact from regular events, whether they be king tides or more serious events that are creating a very difficult situation.\"\n\n\n\n\n\n‘Alopi Latukefu says it's important to understand not everyone wants to leave Tuvalu.\n\n\n\n\n\n\"The decision to leave is a very big one and a very important one, and one which is tied to a range of other factors as well to support their families, to provide a pathway for a future, to have access to education, to have access to things that are part of the opportunity that Australia represents.\"\n\n\n\n\n\nBut some may feel they have little choice.\n\n\n\n\n\nTwo weeks ago, the Australian government opened an inaugural ballot that allows Tuvaluans to register their interest in a visa program created under the terms of a treaty known as the Falepili Union - which takes its name from the Tuvaluan term for neighbours who live in close houses.\n\n\n\n\n\nProfessor Stephen Howes is the Director of the Development Policy Centre at the Australian National University, and says those selected for the visa will have significant rights to live, work and study in Australia.\n\n\n\n\n\n\"It is a very generous visa. So most migrants to Australia have to endure a waiting period of several years before they're eligible for benefits. But that's not the case for migrants under this visa. I mean, they don't have access to Centrelink, so they can't come to Australia and just go straight onto unemployment benefits. But they do get access to Medicare, they get access to other benefits such as the family benefits, support to study.\"\n\n\n\n\n\nThe interest in the visa is significant.\n\n\n\n\n\nOut of Tuvalu's population of roughly 10,000 people, almost a third of them have begun the process of applying.\n\n\n\n\n\nThat's more than 3,000 people who have put their names into the lottery ballot - though only 280 people will be selected at random per year.\n\n\n\n\n\nProfessor Jane McAdam is Scientia Professor of Law and Founding Director of the Kaldor Centre for International Refugee Law at U-N-S-W Sydney.\n\n\n\n\n\nShe says it's the world's first bilateral mobility framework that references climate change.\n\n\n\n\n\n\"And I should note that the visa itself doesn't mention the words climate change at all, but the treaty pursuant to which it was created is framed very much around the existential threat that climate change poses in our region. And it was an element that the government of Tuvalu specifically requested from Australia.\"\n\n\n\n\n\nProfessor Stephen Howes says while the visa will benefit those selected in the lottery, Australia has also gained some strategic advantages through the Falepili Union.\n\n\n\n\n\n\"So what Australia got out of the agreements was a sort of veto power over Tuvalu's security arrangements or specifically security partnerships. So under the agreement, Tuvalu has to seek Australia's permission before entering into an agreement with the third country in relation to security, and that's clearly aimed at China.\"\n\n\n\n\n\nThis broader geopolitical picture is inevitably inflected by the global politics of climate change - as the Pacific pushes Australia to reduce emissions and exports of fossil fuels.\n\n\n\n\n\n'Alopi Latukefu has welcomed the new Tuvalu visa but says Australia needs to take stronger action to address climate change too.\n\n\n\n\n\n\"It's not a climate visa, let's be very clear about this. It's under the Falepili treaty with a treaty of friendship with Tuvalu. It's often referred to as a climate visa, but it is one that is not framed in that context. And that's partly because of Australia's need to not frame things in that context because of our own interests.\"\n\n\n\n\n\nHe says the fact Australia has just signed off on a 40-year extension to the North West Shelf gas project points to a fundamental contradiction in the way the visa is being positioned.\n\n\n\n\n\n\"How can we give a visa for something that we're causing the problem with? Okay, it's much easier to say it's a visa for friendship.\"\n\n\n\n\n\nMr Latukefu also says it's important that Tuvaluans are supported to maintain their connection to their lands and culture.\n\n\n\n\n\nFor many this will mean moving between countries, rather than relocating to live in Australia permanently.\n\n\n\n\n\n\"The reality is, very much as it's been the experience of many other diaspora communities from the Pacific, along with myself - I'm of Tongan descent and I go back to Tonga and we have links back to Tonga and a part of the Kāinga, the family with important links back to the land of my forefathers and the culture of my forefathers. And that's the same issue that Tuvaluans will have in future, that they won't leave necessarily forever.\"\n\n\n\n\n\nProfessor McAdam agrees ongoing mobility will be important feature of the new visa type.\n\n\n\n\n\n\"And that kind of parallels what we've seen in the labour mobility area where people often want to go between different countries. Obviously that's expensive. It's not going to be an easy option for people, but it does mean that they can go home, see family, see communities maintain land back at home. But it might also mean people can move here for educational opportunities for their children, take some of those skills back to Tuvalu, so it's not a fair accompli that we're going to suddenly see or over time see the whole population moving. What it does provide though is a safety net.\"\n\n\n\n\n\nAdvocates and observers are also watching closely to see what support will be offered to help people transition to life in Australia.\n\n\n\n\n\nProfessor McAdam says a Tuvaluan cultural liaison officer has been suggested as one way to help.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/article/public-servant-gave-improper-benefit-to-sisters-fiance-in-new-job-anti-corruption-body/fxlx3pi4i",
    "title": "Public servant gave 'improper benefit' to sister's fiancé in new job, anti-corruption body finds",
    "publish_date": "Mon, 30 Jun 2025 05:00:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "A senior official at the Department of Home Affairs engaged in corrupt conduct by helping her sister and her sister's fiancé with a job in the department, a federal corruption inquiry has found.\n\n\n\n\n\nIn a decision handed down on Monday, the new National Anti-Corruption Commission (NACC) said the senior executive service officer in the department promoted her sister's fiancé as a candidate for a position in the organisation.\n\n\n\n\n\nNACC said in its report: \"The commission found that this was an abuse by the official of her public office: she used her position to procure the transfer of her sister's fiancé into the department for the purpose of benefiting her sister's fiancé and her sister, knowing it to be improper.\"\n\n\n\n\n\nThe official had praised her sister's fiancé to colleagues, created the job requisition, approved it herself and forged a witness signature on paperwork to fast-track onboarding, while deliberately concealing the family relationship from others, the report said.\n\n\n\n\n\nShe did not disclose the relationship at any point during the process, NACC said, and also provided interview questions to her sister in advance of the recruitment for a separate employment process.\n\n\n\nREAD MORE Multicultural communities are not entirely responsible for social cohesion, says minister\n\nNACC said the conduct was serious due to the seniority of the official, \"the deception involved\", and the benefits of a public service role.\n\n\n\n\n\nIt said \"nepotism, cronyism and undeclared conflicts of interest\" in public service recruitment were matters of concern.\n\n\n\n\n\nNational Anti-Corruption commissioner Paul Brereton said in a statement: \"[This operation] reinforces the need for strong corruption prevention measures — including mandatory conflict of interest disclosures in all recruitment processes, and prevention of improper disclosures of official information.\"\n\n\n\n\n\nThe commission found this was an \"abuse by the official of her public office and a misuse by her of official information\".\n\n\n\n'I'm the boss': private messages revealed\n\nDuring the hearings, the officer's private messages with her sister regarding the fiancé's recruitment were revealed to the NACC.\n\n\n\n\n\nAfter the officer responded to a colleague's query about her sister's fiancé, she said he was a \"friend of a friend\".\n\n\n\n\n\nLater, she wrote to her sister: \"I told them I knew [him] through a friend. Technically not not [sic] true, he just needs to play along! Also, I'm the boss, so they will do whatever I say.\"\n\n\n\n\n\nWhen asked about this exchange, the officer said it was a \"joke between sisters\".\n\n\n\n\n\nIn the same exchange, the officer gave advice to her sister: \"He won't say you're my sister … Okay, so make sure [he] sells his ability to write briefs. Pick up subjects quickly. Good team member. Loves international work. Able to work across time zones. You are not my sister. He cannot say our surname. Or where you work.\"\n\n\n\n\n\nHer sister would later send a message of thanks to the officer: \"Thank you again for helping … I know you gain nothing from it and you are putting yourself on the line for him so it's truly appreciated xx.\"\n\n\n\n\n\nThe NACC said in its report: \"[The officer] admitted she knew at the time that she should have disclosed the relationship to senior management.\"\n\n\n\n\n\nThe officer has since resigned, but NACC said it would have called for her resignation otherwise.\n\n\n\n\n\nThe investigation was launched after the NACC received a complaint on 19 December 2023.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-30-june-2025/s36s2w7qp",
    "title": "SBS News In Easy English 30 June 2025",
    "publish_date": "Mon, 30 Jun 2025 04:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWelcome to SBS News In Easy English. I'm Catriona Stirrat.\n\n\n\n\n\nAnthony Albanese says Australia will not increase defence spending next April as part of the national defence strategy, after calls from the US to increase the defence budget.\n\n\n\n\n\nThis comes as Foreign Minister Penny Wong heads to the United States for high level discussions with counterpart Marco Rubio ahead of a meeting of Quad leaders.\n\n\n\n\n\nThe US has been calling for Australia to lift its defence spending to 3.5 per cent of GDP.\n\n\n\n\n\nThe Trump administration also announced this month that it would take a 30-day review of the AUKUS agreement, which will see Australia purchase US nuclear submarines.\n\n\n\n\n\nMr Albanese says the government is engaging with the US on the matter.\n\n\n\n\n\n\"Every opportunity, Australia, raises our points that we have and AUKUS benefits three countries; Australia, the UK and the US. But it does something more than that, as well, it benefits the world, because it makes our region and the world, more secure.\"\n\n\n\n\n\nPenny Wong is also expected to discuss tariffs during her visit to the US.\n\n\n\n\n\n—\n\n\n\n\n\nFrom July 1 Australians will have greater access to paid parental leave, the minimum wage will go up and millions will see an increase in their Centrelink payments.\n\n\n\n\n\nAustralia’s lowest-paid workers will receive a pay increase, with the national minimum wage increasing by 3.5 per cent.\n\n\n\n\n\nMillions will also see an increase to Centrelink payments, with a 2.4 per cent increase to help ease the rising cost of living.\n\n\n\n\n\nAustralian families will benefit from a more generous paid parental leave scheme, with the amount of government-funded leave increasing from 20 to 22 weeks.\n\n\n\n\n\nSpeaking on Nine's Today Show, Finance Minister Katy Gallagher says the expected changes will ease pressure on Australians.\n\n\n\n\n\n\"We're not pretending that people aren't still continuing to do it pretty tough, which is why there's a whole range of support that comes in on the first of July. So it is about increasing the minimum wage and increase in super but there's also increases in payments that come from the government. There's increase in PPL, and we're paying super on PPL. There's a whole range of areas where we're providing additional assistance, there's the energy bill rebates come in.\"\n\n\n\n\n\n—\n\n\n\n\n\nAuthorities across multiple European countries are urging people to take shelter as wildfires and a punishing heatwave hit the region.\n\n\n\n\n\nFires broke out in France and Turkiye over the weekend, with this summer's first major heatwave in Europe leaving others on high alert.\n\n\n\n\n\nAmbulances are standing by tourist sites as experts warn that such heatwaves, intensified by climate change, will only get worse.\n\n\n\n\n\nAttending the UN Development Summit in Spain, Nabeeha Kazi says it's very clear that climate action is needed.\n\n\n\n\n\n“The heat is incredible, no doubt about it. We are navigating it. We´ve been in a lot of indoor places. You know it is unfortunate that climate change is what it is. I don´t think they anticipated it will be this hot this year but we are here for an important mission which is about how we ensure that we are supporting countries that are also affected by climate change.”\n\n\n\n\n\n—\n\n\n\n\n\nNurses in Queensland are threatening industrial action after the state nurses union issued a pay deal ultimatum to the state government.\n\n\n\n\n\nThe Queensland Nurses and Midwives' Union is calling for a 13 per cent pay rise over three years, while the state government is offering an 8 per cent rise.\n\n\n\n\n\nWhile voting to take protected strike action earlier in June, Queensland nurses have not walked off the job since 2022.\n\n\n\n\n\nUnion secretary Sarah Beaman says the state health minister has until Tuesday to agree to the union's terms or they will escalate to stage two protected industrial action in early July.\n\n\n\n\n\n—\n\n\n\n\n\nTo sport now,\n\n\n\n\n\nAldrich Potgieter has ended the protracted Rocket Classic, making an 18-foot birdie putt on the fifth playoff hole to outlast Max Greyserman for his first PGA Tour title.\n\n\n\n\n\nHe celebrated on Sunday by embracing his caddie and shaking hands with Greyserman and his caddie before giving his father, Heinrich, a hug.\n\n\n\n\n\nThe 20-year-old Potgieter is the youngest player on the tour and its biggest hitter, averaging 326-plus yards off the tee.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 43
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-30-june-2025/f9yufx12l",
    "title": "PM pushes back on US calls to boost defence spending | Midday News Bulletin 30 June 2025",
    "publish_date": "Mon, 30 Jun 2025 02:00:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nIn this bulletin;\n\n\n\nAlbanese rules out increase to defence spending as Penny Wong heads to the US;\n\nWildfires break out in France and Turkiye as Europe swelters through a heatwave;\n\nAnd in Golf, Aldrich Potgieter outlasts Max Greyserman for his first PGA Tour title.\n\n\n\n—\n\nAnthony Albanese says Australia will not increase defence spending next April as part of the national defence strategy, after calls from the US to bolster the defence budget.\n\n\n\n\n\nThis comes as Foreign Minister Penny Wong heads to the United States for high level discussions with counterpart Marco Rubio ahead of a meeting of Quad leaders.\n\n\n\n\n\nThe US has been calling for Australia to lift its defence spending to 3.5 per cent of GDP.\n\n\n\n\n\nThe Trump administration also announced this month that it would take a 30-day review of the AUKUS agreement, which will see Australia purchase US nuclear submarines.\n\n\n\n\n\nMr Albanese says the government is engaging with the US on the matter.\n\n\n\n\n\n\"Every opportunity, Australia, raises our points that we have and AUKUS benefits three countries; Australia, the UK and the US. But it does something more than that, as well, it benefits the world, because it makes our region and the world, more secure.\"\n\n\n\n\n\nPenny Wong is also expected to discuss tariffs during her visit to the US.\n\n\n\n\n\n—\n\n\n\n\n\nFrom July 1 Australians will have greater access to paid parental leave, the minimum wage will go up and millions will see an increase in their Centrelink payments.\n\n\n\n\n\nAustralia’s lowest-paid workers will receive a pay boost, with the national minimum wage increasing by 3.5 per cent.\n\n\n\n\n\nMillions will also see a boost to Centrelink payments, with a 2.4 per cent increase to help ease the rising cost of living.\n\n\n\n\n\nAustralian families will benefit from a more generous paid parental leave scheme, with the amount of government-funded leave increasing from 20 to 22 weeks.\n\n\n\n\n\nSpeaking on Nine's Today Show, Finance Minister Katy Gallagher says the expected changes will ease pressure on Australians.\n\n\n\n\n\n\"We're not pretending that people aren't still continuing to do it pretty tough, which is why there's a whole range of support that comes in on the first of July. So it is about increasing the minimum wage and increase in super but there's also increases in payments that come from the government. There's increase in PPL, and we're paying super on PPL. There's a whole range of areas where we're providing additional assistance, there's the energy bill rebates come in.\"\n\n\n\n\n\n—\n\n\n\n\n\nGreens candidate Hannah Thomas could potentially be left without vision after suffering serious facial injuries during a police arrest at a pro-Palestinian protest.\n\n\n\n\n\nThe 35-year-old has been charged with resisting arrest and was among five arrested while protesting against the actions of Israel in Gaza.\n\n\n\n\n\nThe protest took place outside of an Australia firm allegedly linked to the manufacturing of fighter jet components used by the Israeli military.\n\n\n\n\n\nMs Thomas has slammed what she calls draconian anti-protest laws that allow police to violently crackdown on peaceful protest.\n\n\n\n\n\nNew South Wales Premier Chris Minns says he's concerned about Ms Thomas' wellbeing but denies that it was recent anti-protest laws to blame.\n\n\n\n\n\n\"I'm not prejudging the circumstances, relating to the injury, but I'm certainly not going to condemn police on the absence of information. All of the body worn camera footages, have been kept. We've got strong enforcement and oversight as well as investigation powers when it comes to police in the state and if anyone wants to make a statement. I know police will collect it straight away.\"\n\n\n\n\n\n—\n\n\n\n\n\nAuthorities across multiple European countries are urging people to take shelter as wildfires and a punishing heatwave hit the region.\n\n\n\n\n\nFires broke out in France and Turkiye over the weekend, with this summer's first major heatwave in Europe leaving others on high alert.\n\n\n\n\n\nAmbulances are standing by tourist hotspots as experts warn that such heatwaves, intensified by climate change, will only get worse.\n\n\n\n\n\nAttending the UN Development Summit in Spain, Nabeeha Kazi says it's very clear that climate action is needed.\n\n\n\n\n\n“The heat is incredible, no doubt about it. We are navigating it. We´ve been in a lot of indoor places. You know it is unfortunate that climate change is what it is. I don´t think they anticipated it will be this hot this year but we are here for an important mission which is about how we ensure that we are supporting countries that are also affected by climate change.”\n\n\n\n\n\n—\n\n\n\n\n\nTo sport now,\n\n\n\n\n\nAldrich Potgieter has ended the protracted Rocket Classic, making an 18-foot birdie putt on the fifth playoff hole to outlast Max Greyserman for his first PGA Tour title.\n\n\n\n\n\nHe celebrated on Sunday by embracing his caddie and shaking hands with Greyserman and his caddie before giving his father, Heinrich, a hug.\n\n\n\n\n\nThe 20-year-old Potgieter is the youngest player on the tour and its biggest hitter, averaging 326-plus yards off the tee.\n\n\n\n\n\nHe became the ninth player to win for the first time this season.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 43
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/grab-seafood-forward-dishes-in-the-cbd-at-this-southern-thai-diner-by-the-soi-38-team-20250701-p5mbm8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Grab seafood-forward dishes in the CBD at this Southern Thai diner by the Soi 38 team",
    "publish_date": "Tue, 01 Jul 2025 12:26:03 +1000",
    "category": "finance",
    "authors": [
      "Emma Breheny"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nFind crab fried rice, sour and spicy fish curry, plus more at R.Harn .\n\n1 / 9 Khanom jeen (rice noodles with curry and condiments). Supplied 2 / 9 Walls feature plates used for Lunar New Year celebrations by families in Thailand. Luis Enrique Ascui 3 / 9 Crispy fried sea bass with fish sauce. Supplied 4 / 9 Prawn pad mee. Supplied 5 / 9 Southern Thai gaeng som (sour and spicy fish curry). Supplied 6 / 9 Khao kluk kapi (shrimp paste fried rice) with pork, Chinese sausage and more. Supplied 7 / 9 Por pia sot pu (fresh spring roll) with butterfly pea and lime juice. Supplied 8 / 9 Khao yum (southern Thai rice salad) with green mango and nam budu dressing. Supplied 9 / 9 Crab meat and betel leaf curry. Luis Enrique Ascui Previous Slide Next Slide\n\nThai$$$$\n\nSouthern Thai food rules at the second restaurant by the Soi 38 team, found just opposite Melbourne Central station. Find comfort in crab fried rice and hokkien mee noodles, vibrant texture and colour in salads such as khao yum, and deeply savoury flavours in kanom jeen, the curry and rice noodle dish that’s a hallmark of coastal Thai cooking.\n\nThe long dinner menu is full of complementary dishes to be eaten banquet-style. There’s whole deep-fried pomfret, stir-fried cabbage with plump dried shrimp sourced especially from Thailand, and aromatic soups. Curries are a focus, with six choices ranging from “really intense” to “really light” but all of them emphasise fresh seafood.\n\nDrinkswise, you can get Thai milk tea and thirst-quenchers like a lime drink with butterfly pea flower extract.",
    "source": "TheAge",
    "cluster_id": 44
  },
  {
    "url": "https://www.theage.com.au/lifestyle/andy-allen-describes-the-morning-he-learnt-of-jock-zonfrillos-death-20250701-p5mbn5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Andy Allen describes the morning he learnt of Jock Zonfrillo's death",
    "publish_date": "Tue, 01 Jul 2025 12:25:29 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Andy Allen describes the morning he learnt of Jock Zonfrillo's death\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 45
  },
  {
    "url": "https://www.theage.com.au/national/victoria/robbie-williams-key-to-the-city-award-prompts-rule-overhaul-at-city-of-melbourne-20250701-p5mbk7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Robbie Williams’ key to the city award prompts rule overhaul at City of Melbourne",
    "publish_date": "Tue, 01 Jul 2025 12:18:11 +1000",
    "category": "entertainment",
    "authors": [
      "Cara Waters"
    ],
    "text": "British pop star Robbie Williams being gifted the key to the city has caused an overhaul of City of Melbourne rules about who can receive the honour.\n\nWilliams was presented with the key to the city by Lord Mayor Nick Reece at a free surprise public concert at Federation Square on January 2 before an estimated crowd of 10,000.\n\nRobbie Williams in Melbourne in January. The singer was awarded a key to the city and staged a free concert to promote his biopic. Credit: Justin McManus\n\nHowever, the decision to give Williams the honour came under scrutiny after it was revealed Reece and council chief executive Alison Leighton made the decision alone, and the other councillors only found out the day before the public ceremony.\n\nCouncillors demanded a review of the City of Melbourne’s processes after Roadshow Films, a fully owned subsidiary of Village Roadshow and the distributor of the Williams biopic Better Man, requested the singer receive the key to the city.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-flights-cancelled-as-severe-weather-lashes-coast-20250701-p5mblb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane flights cancelled as severe weather lashes coast",
    "publish_date": "Tue, 01 Jul 2025 12:15:25 +1000",
    "category": "finance",
    "authors": [
      "William Davis"
    ],
    "text": "Flights to and from Brisbane have been cancelled or delayed, with “severe weather” set to lash parts of the east coast.\n\nHeavy rain and high-speed winds are predicted across much of NSW from today.\n\nThe Brisbane Airport website shows a significant number of services to and from Sydney, Melbourne, Newcastle, Townsville, Mackay and Hervey Bay have already been postponed or cancelled.\n\nVirgin has confirmed Brisbane flights have been affected by severe weather across parts of the east coast. Credit: Adobe Stock\n\n“[We have] been working with the aviation industry overnight to manage the impact of severe weather,” an Airservices Australia spokesperson said.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/it-was-great-while-it-lasted-jazz-master-farewells-his-second-home-20250628-p5maz7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "It was great while it lasted: Jazz master farewells his ‘second home’",
    "publish_date": "Tue, 01 Jul 2025 12:08:21 +1000",
    "category": "entertainment",
    "authors": [
      "John Shand"
    ],
    "text": "Nock tells stories in music, and he distils essences of emotion. Here little wisps of melody from the piano provoked response, commentary and elucidation from bassist Brett Hirst and drummer Toby Hall, the latter playing with his hands against Hirst’s groove, while Nock floated lines above them that were, by turns, pensive and supremely lyrical.\n\nAcross a career spanning seven decades, primarily in New Zealand, the US and Australia, Nock has proved himself a composer, improviser and band leader of the highest calibre. This was instantly evident on the opening Not We But One.\n\nSo it’s goodnight to Foundry 616, the love child of a man whose passion has been presenting jazz in Sydney for more than 40 years, Peter Rechniewski. People get Orders of Australia for doing much less. This was a hell of a penultimate gig, featuring the pianist who played the venue’s first concert 13 years ago, Mike Nock.\n\nThen, as the composition’s title suggests, the three instruments seemed to converge, and the interaction had a profundity like fine poetry, where each word contains a deeper truth. This was music playing the musicians, rather than the other way around, and it stayed at this peak when tenor saxophonist Karl Laskowski joined, generating a gruff sound, and playing short, stabbing phrases that drove the groove rather than riding on it. Nock then reoccupied the foreground, finding typically surprising implications in what the rhythm section was offering.\n\nThe band slipped back into a safer place with Foundry Start-Up Blues, although Laskowski grabbed the piece by the scruff and made it raw and real. Much more engrossing was the contemplative Acceptance, which had Nock making little rivulets of melody flow into the gentle, bossa nova-tinged groove, before Laskowski played a solo as languid as floating downstream in a dinghy without resort to oars.\n\nHall crafted a stonking, bucking solo on the boppish Transitions, and Hirst, Nock’s longest-serving collaborator, soloed with sinewy vigour on a blues in the second set, which also featured Laskowski deploying the brawny sound and loping lines beloved of Texan tenor saxophonists.\n\nEvery composition presented different facets of Nock the composer and Nock the improviser. One moment we’d hear his love of rhythmic puzzles and child-like joy in the game of making music, and the next his capacity for crystalline beauty; one moment rhythmic drive and the next flurries of abstraction.\n\nI began listening to Nock in the 1970s via records and an Australian tour when his fabled US career was peaking, and then in 1982 came the mysterious and ethereal Ondas masterpiece. When he returned to Australia permanently in 1985, he didn’t always find musicians who could consistently play at his level of invention. But he persisted. Three of the worthy ones were with him on this night, as he bid adieu to the venue that has been his second home for 13 years.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/shibasaki-opens-up-on-shock-maroons-debut-20250701-p5mbmr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Shibasaki opens up on shock Maroons debut",
    "publish_date": "Tue, 01 Jul 2025 12:03:56 +1000",
    "category": "finance",
    "authors": [],
    "text": "Shibasaki opens up on shock Maroons debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/politics/federal/union-boss-appointed-to-15b-government-fund-board-without-checks-20250630-p5mb8y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Union boss appointed to $15b government fund board without checks",
    "publish_date": "Tue, 01 Jul 2025 12:03:33 +1000",
    "category": "finance",
    "authors": [
      "Olivia Ireland"
    ],
    "text": "Prime Minister Anthony Albanese’s $15 billion fund to boost domestic manufacturing approved funding without finalising its strategy, did not obtain conflict of interest declarations from all suppliers and has a union boss on its board who received the role without due diligence checks.\n\nThe Australian National Audit Office’s review of the National Reconstruction Fund Corporation found that since its establishment in September 2023, the organisation had mostly functioned effectively, but one board appointment stood out.\n\nFormer industry minister Ed Husic. Credit: Alex Ellinghausen\n\nIt concluded that the appointment of Australian Manufacturing Workers’ Union president Glenn Thompson in October 2023 by then-industry minister Ed Husic did not have the checks that every other board member underwent before joining the fund.\n\nThe report casts doubt on federal Labor’s commitment to ending the practice of handing political allies plum government appointments, after Finance Minister Katy Gallagher announced a review in 2023 to end “jobs for mates” culture.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/politics/victoria/a-time-for-truth-yoorrook-justice-commission-20250625-p5ma8m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A time for truth: Yoorrook Justice Commission",
    "publish_date": "Tue, 01 Jul 2025 11:59:30 +1000",
    "category": "sports",
    "authors": [],
    "text": "Most of the dead were under two, and were either inside or known to the system over four years.\n\nOctober 29, 2024\n\nby Kieran Rooney",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/trump-magic-math-the-us-senate-has-just-made-5-8-trillion-disappear-20250701-p5mbjp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump’s ‘magic’ act: The US Senate has just made $5.8 trillion disappear",
    "publish_date": "Tue, 01 Jul 2025 11:58:58 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "That’s why the Republicans have resorted to accounting gimmickry. Conventional congressional policy measures outcomes by what’s known as “current law baseline,” which takes into account the legislated expiry of fiscal measures. That’s why the Trump tax cuts were scheduled to expire this year, to reduce the cost that would otherwise have been factored into the Congressional Budget Office’s 10-year deficit and debt projections. Republican Senator Lindsey Graham is “king of the numbers.” Credit: AP Extending policies with legislated extensions requires a new law, which is why the usual accounting convention is to treat the extension as a new cost.\n\nThe Republicans, however, have decided to use a “current policy baseline” approach, which assesses the impact on deficits and debt against current fiscal policies. On that basis, the Trump tax cuts never expire and therefore have no impact on the cost of the One Big Beautiful Bill. That simple change in accounting transforms the cost of the One Big Beautiful Bill from a $US3.3 trillion addition to US deficits over the next decade into a $US508 billion decrease in them. The accounting trickery is deceitful, creating the pretence that the Republicans are cutting spending while actually adding trillions of dollars to future deficits and debt while creating time bombs that future administrations will have to defuse, presumably by resorting to accounting trickery of their own. An indication of how the Republicans are manipulating the accounting rules to obscure the actual impact of the Trump budget on debt and deficits is provided by their treatment of Trump’s new tax breaks for tips, overtime, senior citizens, car loans and deductions for local and state taxes. The “temporary” spending measures in the bill are scheduled to expire at the end of the current Trump presidency. If they were extended indefinitely, they would add about $US1 trillion to deficits over the decade, according to the Committee for a Responsible Federal Budget.\n\nNormally, the question of whether the One Big Beautiful bill complied with the Senate rules would be referred to the non-partisan Senate parliamentarian, who has already ruled against inclusion of a number of items if the bill is to comply with the reconciliation process. Loading The Republicans, however, have avoided that scrutiny by giving the authority to decide the policy used for calculating the impact of the bill to the Senate Budget Committee chairman, Lindsey Graham, who said last week that he was “the king of the numbers.” “I’m Zeus, the budget king,” he said. At the weekend he said that, as budget chairman, he had decided to use current policy as the reference point for the tax cuts.\n\n“If you use current policy, they never expire, so the policies that were created in 2017 would not end in December. They would continue. And that’s a good thing for the American people, that’s a good thing for the economy, because it gives you certainty,” he said. Unsurprisingly, the Republican majority then voted to endorse Graham’s decision. The Democrats were quick to point out that the use of current policy as the baseline sets a precedent, one they could use to implement their own agendas – and undo Republicans’ – if they regained control of Congress. Effectively, they – or a future Republican majority – could create massive new programs, legislate their expiry in a few years to minimise their apparent impact on debt and deficits and then claim that their extension was costless, even though they could blow out deficits and debt over the longer term.\n\nWhile the change in accounting policy might help protect the use of the reconciliation process, it doesn’t disguise the reality that the One Big Beautiful Bill will significantly increase US deficits and debt, pushing the current federal government debt level up from $US36.2 trillion to around $US40 trillion by 2034. That’s caused some dissension among Republicans. In the Senate, two senators have already declared they’ll vote against the bill and as many as eight have expressed some opposition to it. With the Senate version of the bill significantly more expensive that the one the House passed narrowly, even if it scrapes through the Senate there is no certainty that it will remain intact once it returns to the House, where the House Freedom Caucus of fiscal conservatives are saying that the Senate version needs major changes if it is to gain their support. Trump has set a July 4 – Independence Day – deadline for passage of the bill, which is why the Republicans have been scrambling to try to lock in enough votes to ensure it clears the Senate and why Elon Musk, who went silent after his criticisms of the bill (and some verbal attacks on Trump) triggered an aggressive and threatening response from Trump, has re-emerged. In posts on his social media platform, X, Musk described the spending levels of the bill as “insane” and said the bill would increase the US debt ceiling by a record $US5 trillion. It was obvious, he said, that Americans were living in a one-party country, the “porky pig party.”",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/jorgensen-and-suaalii-to-return-for-wallabies-against-fiji-20250701-p5mbkz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jorgensen and Suaalii to return for Wallabies against Fiji",
    "publish_date": "Tue, 01 Jul 2025 11:55:44 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "Max Jorgensen and Joseph-Aukuso Suaalii will make returns from lengthy injury breaks in the Wallabies starting side against Fiji in Newcastle on Sunday, and Harry Wilson is set to retain the captaincy, as coach Joe Schmidt begins to show his hand for the British and Irish Lion series.\n\nAs the Lions continue their hectic tour schedule with games in Brisbane and Sydney this week, the Wallabies have been quietly preparing in Newcastle ahead of a clash with the Mick Byrne-coached Fiji.\n\nSchmidt will name his team on Friday but the shape of the side has been slowly revealed by Schmidt’s release of players back to play for Queensland, the Waratahs and the Brumbies against the Lions. Taniela Tupou, Andrew Kellaway and Corey Toole have all returned in the past few days, thus ruling them out of Test duty on Sunday.\n\nThe team is set to look very similar to the Wallabies sides from the Spring Tour last year, according to informed sources, with Suaalii returning from a broken jaw to line up at outside centre, alongside Len Ikitau.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/politics/nsw/wynyard-is-the-hub-start-up-founders-resist-move-to-tech-central-20250627-p5mawc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Wynyard is the hub’: Start-up founders resist move to Tech Central",
    "publish_date": "Tue, 01 Jul 2025 11:53:24 +1000",
    "category": "finance",
    "authors": [
      "Jessica Mcsweeney"
    ],
    "text": "The NSW government will soon move the city’s emerging businesses to its shiny new Tech Central precinct, billed as Australia’s largest innovation hub – but Sydney’s start-up founders say they don’t want to leave their current space.\n\nStart-ups, investors and coworking communities at the much-loved Sydney Startup Hub, due to close in August, said the change would fracture Sydney’s “start-up ecosystem”, with businesses unable to find appropriate space at Tech Central, or unwilling to move.\n\nAn impression of Atlassian’s planned building, the centrepiece of the city’s new tech hub.\n\nThe government insists Sydney Startup Hub, an office space near Wynyard with subsidised desk rentals, isn’t commercially viable.\n\nConstruction is under way on the 39-storey Atlassian headquarters beside Central Station, which will be the centrepiece of Tech Central.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/wa-news-live-findings-in-cleveland-dodd-inquest-expected-today-20250630-p5mbgy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Perth house prices hit new peak as listings fall",
    "publish_date": "Tue, 01 Jul 2025 11:52:40 +1000",
    "category": "finance",
    "authors": [],
    "text": "Perth’s median house price has increased by 0.8 per cent in June to $786,000, as active listings in the city fall below 4000 for the first time in nearly a year.\n\nAccording to REIWA, the price is 16.4 per cent higher than this time last year, with the market still experiencing strong demand.\n\nLoading\n\nThe median unit price increased by 0.9 per cent in June to $540,000, marking a huge 20 per cent jump year-on-year.\n\nThe suburbs that saw the most price growth in June were Mount Lawley (up 2.6 per cent to $1,580,000), Coodanup (up 2.6 per cent to $600,000), Ocean Reef (up 1.6 per cent to $1,300,000), Kewdale (up 1.5 per cent to $758,500) and Melville (up 1.5 per cent to $1,382,500).\n\nHouses in Perth sold in a median of 13 days in June while the median rent price increased 0.7 per cent to $680 per week.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/world/europe/the-royal-train-reaches-the-end-of-the-line-after-156-years-as-costs-bite-20250701-p5mbjd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Royal Train reaches the end of the line after 156 years, as costs bite",
    "publish_date": "Tue, 01 Jul 2025 11:52:38 +1000",
    "category": "finance",
    "authors": [
      "Michael Holden",
      "Danica Kirka"
    ],
    "text": "London: The Royal Train will soon leave the station for the last time, with King Charles deciding to scrap the service that dates back to Queen Victoria because it is no longer cost-effective.\n\nVictoria, Charles’ great-great-great-grandmother, commissioned the first royal rail carriages back in 1869. The latest incarnation is made up of nine carriages that can be hitched to commercial locomotives, the most recent of them added in 1986.\n\nQueen Elizabeth II and Meghan, the Duchess of Sussex, arrive by the Royal Train at Runcorn Station, in north-west England in 2018. Credit: AP\n\nBut it was used just twice during the past financial year, with the two journeys together costing almost £80,000 ($167,000).\n\nJames Chalmers, the king’s treasurer, said the monarch had now agreed that the train – which critics had long said was a waste of money – would reach the end of the line in 2027.",
    "source": "TheAge",
    "cluster_id": 31
  }
]