[
  {
    "url": "https://www.9news.com.au/national/lucy-markovic-australias-next-top-model-star-dies-after-health-battle/c96551fe-06f2-4154-acee-894d592bd787",
    "title": "Top Australian model dies after years-long health battle",
    "publish_date": "Thu, 10 Apr 2025 23:54:23 +0000",
    "category": "lifestyle",
    "authors": [
      "Apr"
    ],
    "text": "Top Australian model and Australia's Next Top Model star ﻿Lucy Markovic has died after a years-long health battle.\n\nThe 27-year-old passed away overnight after a battle with brain arteriovenous malformation (AVM), a tangle of abnormal blood vessels that can cause brain damage.\n\nHer death was announced on her Instagram Story.\n\nAn Australian's Next Top Model star ﻿has passed away after a years-long health battle. (Instagram)\n\n\"Dear friends and family, I regret to inform you that Lucy has passed,\" the post read.\n\n\"She was at peace. Me, her mother and my mother were present with her.\n\n\"We ask you to please give us space in these hard times.\n\n\"May Lucy rest in peace.\"﻿\n\nModelling agency Elite NYC also confirmed the death, calling Markovic a \"bright shining light.\"\n\n\"We are heartbroken to share that Lucy Markovic has passed away after a brave battle with a brain AVM.\n\n\"Lucy was a bright shining light, and had an incredible dry sense of humor. Her smile and laughter could light up a room, and draw you closer to her.\n\n\"She loved to dance, she really shined.\n\nModelling agency Elite NYC also confirmed the death, calling Markovic a \"bright shining light.\" (Getty)\n\n\"Modeling was one of Lucy's dreams, and we are deeply honoured to have been part of that journey with her.\n\n\"She brought elegance, strength, and beauty to her work. But more than that, she brought herself—her warmth, her laughter, her light.﻿\"\n\nItalian fashion designer Donatella Versace paid tribute to the model on her Instagram story.\n\n\"I am so sorry to hear the news about Lucy Markovic, rest in peace, beautiful girl,\" she wrote.\n\nMarkovic modelled for Versace ﻿last year.\n\nLast month, Markovic posted a health update to her Instagram. (Getty)\n\nLast month, Markovic posted a health update to her Instagram where she revealed she was undergoing brain surgery.\n\n\"﻿Lucky + unlucky - Radiation, seizures, heavy medication and 4 years later,\" the post read.\n\n\"I will be undergoing brain surgery on the 26th of this month for the AVM in the back of my brain (arteriovenous malformation) that is the size of a golf ball. (Now has changed to the 2nd of April).\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/white-house-must-facilitate-return-of-mistakenly-deported-man/66fe2347-46a6-4f00-b2c0-a516eab61a83",
    "title": "Top court's order to White House over man mistakenly deported",
    "publish_date": "Fri, 11 Apr 2025 01:14:12 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "The Supreme Court today ordered President Donald Trump's administration to \"facilitate\" the return of a Maryland man mistakenly deported to El Salvador but stopped short of requiring the government to return him to the US.\n\nThe high court said that the administration must try to return Kilmar Armando Abrego Garcia, a Salvadoran national who was deported on March 15. It said part of the lower court's order requiring the government to \"effectuate\" his return was unclear and needed further review.\n\nThe court did not give the administration a deadline for when Abrego Garcia should be returned. The opinion was unsigned and no dissents were noted.\n\nKilmar Abrego Garcia's wife, Jennifer Vasquez Sura speaks during a news conference at CASA's Multicultural Centre in Hyattsville, Maryland. (Jose Luis Magana/AP via CNN)\n\n\"Although the ruling makes clear that the district court can order the Trump administration to facilitate Abrego Garcia's return to the United States, it is maddeningly vague about exactly how it's supposed to do so,\" said Steve Vladeck, CNN Supreme Court analyst and professor at Georgetown University Law Centre.\n\n\"For instance, if the judge asks the government about the specific arrangements it's made with the Salvadoran government and the government invokes the state secrets privilege, what happens then?\" Vladeck added.\n\n\"It is, yet again, punting in a context in which the government can take advantage of the punt – a loss for Trump on the big question, but a loss for Abrego García on what matters most.\"\n\nREAD MORE: Stocks tumbles as China tariffs set even higher than thought\n\nThis undated photo provided by CASA, an immigrant advocacy organization, in April 2025, shows Kilmar Abrego Garcia. (CASA via AP) (AP)\n\nThe court's three liberals didn't dissent from the decision but wrote separately to argue that the Trump administration's emergency appeal should have been denied in full.\n\nJustice Sonia Sotomayor pointed the administration to existing executive branch policy that the federal government should \"facilitate [an] alien's return to the United States if … the alien's presence is necessary for continued administrative removal proceedings.\"\n\nSotomayor's statement criticised the Trump administration for dismissing the mistaken removal as an \"oversight,\" rather than \"hastening to correct its egregious error.\"\n\n\"The government now requests an order from this court permitting it to leave Abrego Garcia, a husband and father without a criminal record, in a Salvadoran prison for no reason recognised by the law,\" she and the other liberals said.\n\nAfter ripping off 104 other women, his 105th wife tracked him down View Gallery\n\n\"The only argument the government offers in support of its request, that United States courts cannot grant relief once a deportee crosses the border, is plainly wrong.\"\n\nSotomayor said that when the proceedings go back to the lower court, the judge should \"continue to ensure that the Government lives up to its obligations to follow the law.\"\n\nAmong those obligations, she said, are several due process protections in immigration statute, as well as the United Nations' Convention Against Torture.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/woman-gives-birth-to-baby-of-stranger-in-ivf-clinic-bungle/d564380d-b352-40ab-9c64-0a48e9a49f81",
    "title": "Woman gives birth to stranger's baby after IVF bungle",
    "publish_date": "Thu, 10 Apr 2025 20:27:59 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "A woman has given birth to a stranger's child after the wrong embryo was mistakenly transferred at a leading Australian IVF clinic.\n\nMonash IVF has apologised for the bungle at its Brisbane clinic, which is said was the result of \"human error\".\n\nThe fertility company was alerted to the mistake in February when the birth parents requested to transfer their remaining frozen embryos to another provider.\n\nIVF (in vitro fertilization) or insemination of female egg with microscope (Getty)\n\nMonash IVF immediately launched an investigation which found strict laboratory safety measures to safeguard the embryos were followed.\n\n\"Instead of finding the expected number of embryos, an additional embryo remained in storage for the birth parents,\" a Monash IVF spokesperson said.\n\n\"The investigation confirmed that an embryo from a different patient had previously been incorrectly thawed and transferred to the birth parents, which resulted in the birth of a child.\"\n\nThe company says the incident was the result of \"human error\".\n\nThe healthiest places to live in Australia revealed View Gallery\n\nChief executive Michael Knaap says the clinic is supporting both families involved.﻿\n\n\"On behalf of Monash IVF, I want to say how truly sorry I am for what has happened,\" he said.\n\n\"All of us at Monash IVF are devastated and we apologise to everyone involved. We will continue to support the patients through this extremely distressing time.\n\n\"Since becoming aware of this incident, we have undertaken additional audits and we're confident that this is an isolated incident.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/us-egg-prices-increase-to-record-high-dashing-hopes-of-cheap-eggs-by-easter/f261b961-d5be-4318-975c-86db7e692422",
    "title": "US egg prices increase to record high, dashing hopes of cheap eggs by Easter",
    "publish_date": "Fri, 11 Apr 2025 00:22:56 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "US egg prices increased again last month to reach a new record-high of US$6.23 (A$10) per dozen despite President Donald Trump 's predictions, a drop in wholesale prices and no egg farms having bird flu outbreaks.\n\nThe increase reported Thursday in the Consumer Price Index means consumers and businesses that rely on eggs might not get much immediate relief. Demand for eggs is typically elevated until after Easter, which falls on April 20.\n\nIndustry experts were expecting the index to reflect a drop in retail egg prices because wholesale egg prices fell significantly in March. University of Arkansas agricultural economist Jada Thompson said the wholesale prices did not start dropping until mid-March, so there may not have been enough time for the average price for the month to decline. And grocery stores may not have immediately passed on the lower prices.\n\nREAD MORE: Stocks tumbles as China tariffs set even higher than thought\n\nBird flu has killed millions of chickens across the US. (Adobe Stock)\n\nThe bird flu effect\n\nBird flu outbreaks were cited as the major cause of price spikes in January and February after more than 30 million egg-laying chickens were killed to prevent the spread of the disease. Only 2.1 million birds were slaughtered in March and none of them were on egg farms.\n\nEgg prices hit US$5.90 (A$9.49) in February one month after setting a record at US$4.95 (A$7.96) per dozen, according to the US Bureau of Labor Statistics.\n\nThe farms that had fall outbreaks have been working to resume egg production after sanitising their barns and raising new flocks, but chickens must be about six months old before they start laying eggs. Thompson said those farms did not come back online as quickly as anticipated.\n\nIn the latest US Department of Agriculture numbers, there were only about 285 million hens laying eggs nationwide as of March 1. Before the outbreak, the flock typically numbered more than 315 million.\n\nSince the current bird flu outbreak began, more than 168 million birds have been slaughtered, most of them egg-laying chickens. Any time a bird gets sick, the entire flock is killed to help keep bird flu from spreading. That can have an effect on the egg supply because massive egg farms may have millions of birds.\n\nEgg prices have soared in recent years. (Adobe Stock)\n\nEgg price politics\n\nTrump tried to take credit for the lower wholesale egg prices the USDA reported in recent weeks.\n\n\"The egg prices they were going through the sky. And you did a fantastic job,\" Trump said to Agriculture Secretary Brooke Rollins before he announced the details of his tariffs at the White House last week. \"Now we have lots of eggs and they are much cheaper now.\"\n\nBut experts say the president's plan to fight bird flu by focusing on strengthening egg farmers' defences against the virus is likely to be more of a long-term help.\n\nThe Agriculture Department tried to find egg imports to add to the supply and nearly 4 million dozens of eggs were brought into the country in February. But egg traders saw an opportunity with the high prices and 7.6 million dozens were exported. Numbers for March were not yet available.\n\n\"I think there are lots of people who are looking to see the egg prices coming down because they wanted to call it a win. And I think it's a loss for everybody. I think we all want to see egg prices come down,\" Thompson said.\n\nRollins on Thursday suggested the rise in egg prices is temporary. She pointed to the overall consumer price index showing a slight dip in prices for goods and services across the US economy in March and suggested egg prices will soon follow.\n\n\"We're also moving into the Super Bowl of eggs, which is Easter,\" Rollins said. \"So from the beginning, I've said this is sort of the high price for retail for eggs, but we feel very confident that will continue to come back down.\"\n\nEarlier this week, Trump said the annual White House egg roll would use real eggs again this year despite the high prices. Egg farmers typically donate more than 30,000 eggs for the event.\n\nA carton of eggs sits on a kitchen counter. (AP)\n\nEgg prices around the country\n\nUS egg prices did began falling in mid-March, according to Datasembly, a market research company that tracks prices at thousands of stores. Datasembly said eggs averaged US$5.98 (A$9.62) per dozen the week beginning March 16 and dropped to US$5.51 (A$8.86) the week beginning March 30.\n\nBut prices vary widely around the country, depending on the location of recent bird flu outbreaks and some state laws requiring eggs to be cage-free. At a Walmart in Richmond, California, a dozen eggs were US$6.34 (A$10.20) on Thursday. In Omaha, Nebraska, Walmart was selling eggs for US$4.97 (A$7.99) per dozen. California requires eggs sold to be cage-free; Nebraska doesn't.\n\nThe latest numbers could increase scrutiny of Cal-Maine Foods, which provides 20 per cent of the nation's eggs, and other large egg producers.\n\nEarlier this week, Cal-Maine acknowledged it is being investigated by the antitrust division of the US Department of Justice, which is looking into egg price increases. Cal-Maine said it is cooperating with the investigation.\n\nIn its most recent quarter, which ended March 1, Cal-Maine said its net income more than tripled to US$508.5 million (A$817 million) compared to the same period a year ago.\n\nFaking it\n\nThe price of real eggs has some consumers turning to fake ones for Easter crafts this year.\n\nCraft retailer Michaels said sales of its plastic egg craft kits — which were listed for US$2.49 (A$4) on the company's website Thursday — are up 20 per cent over last year. Michaels said sales usually peak closer to Easter, but it started seeing a noticeable uptick in early March this year.\n\n\"With a little over a week still to go until Easter, our craft egg kits are nearly sold out,\" the company said.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/prada-agrees-to-buy-rival-fashion-house-versace-in-a-deal-valued-at-14-billion/129c4484-56ef-4277-90ed-e58f0d4f7224",
    "title": "Prada agrees to buy rival fashion house Versace in a deal valued at $2.2 billion",
    "publish_date": "Thu, 10 Apr 2025 22:48:24 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "The Prada Group has announced a deal to buy crosstown Milan fashion rival Versace from the US luxury group Capri Holdings under terms that values one of the most recognisable names in Italian fashion at $2.2 billion.\n\nThe deal will put Versace, known for sexy silhouettes and bold Greco and Medusa motifs, under the same roof as Prada’s “ugly chic” aesthetic and the youth-driven Miu Miu whose stunning growth in recent years has far outpaced the market. Prada said the 47-year-old Versace brand offered “significant untapped growth potential\".\n\n“This is exactly the strength for our group. There are no overlaps in terms of creativity, in terms of customer,″ said Lorenzo Bertelli, Prada’s chief marketing officer, who is being groomed to one day take over the business that his parents — Miuccia Prada, the group's creative force and largest shareholder, and Patrizio Bertelli, its chairman and executive director — have turned into a global fashion juggernaut.\n\nThe logo and lettering of the Versace brand. (dpa/picture alliance via Getty I)\n\n“We are buying a brand with huge potential, with a very recognizable aesthetic,\" Lorenzo Bertelli said, underlining that the Versace brand name recognition, putting it among the top 10 in the world, far outweighs its business performance.\n\nThe final value of the deal will be adjusted at closing, which is expected in the second half of the year, the Prada Group said. It will be funded by 1.5 billion euros in new debt and has been approved by the Prada and Capri Holdings board of directors.\n\nPrada Chief Executive Andrea Guerra said the deal was aimed at building a “sustainable revenue growth” and boosting the brand's identity, and was not about squeezing synergies.\n\nPrada's statement underlined that Versace will “maintain its creative DNA and cultural authenticity, ” while benefitting from its “industrial capabilities, retail execution and operations expertise. ”\n\nThe Versace Fall RTW 2025 fashion show is a key part of Milan Fashion Week. (WWD via Getty Images)\n\nThere are no plans to change the CEO and Miuccia Prada will not be involved in the creative side of Versace, the executives said. Guerra added that the recent creative shakeup at Versace, with Miu Miu head of design Dario Vitale replacing Donatella Versace as creative director effective April 1, had nothing to do with the deal. He called it “an independent, very personal” decision by Vitale.\n\nLorenzo Bertelli said the experience of Miu Miu's growth had shown that small changes can make all the difference. ”We don't need to change the brand, revolutionize it. We need to just evolve it, make the right things happen, and all together they are hopefully going to bring a huge spark and bring back Versace to be a huge success,'' he said.\n\nCapri Holdings, which owns Michael Kors and Jimmy Choo, paid $3.2 billion for Versace in 2018, but had been struggling to position Versace’s bold profile in the recent era of “quiet luxury.″\n\nVersace represented 20 per cent of Capri Holdings 2024 revenue of 5.2 billion euros. An analyst presentation for the Prada deal said that Versace would represent 13 per cent of the Prada Group's pro-forma revenues, with Miu Miu coming in at 22 per cent and Prada at 64 per cent. The Prada Group, which also includes Church’s footwear, reported a 17 per cent boost in revenues to 5.4 billion euros last year.\n\nDonatella Versace, who took over as creative director at the fashion house founded by her brother, Gianni Versace, after his 1997 murder, continues with the fashion house in the new role of chief brand ambassador.\n\n“I am absolutely delighted to become part of the Prada family,'' she wrote in a post on Instagram beneath a photograph of herself and Miuccia Prada. ”I am honored to have the brand in the hands of such a trusted Italian family business, and I am ready to support this new era for the brand in any way I can.”\n\nThe Italian government welcomed a deal that appears to secure Versace's longer term future as other family-owned fashion brands have faltered or even disappeared after opening up to outside investors.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/customer-satisfaction-award-winners-announced-for-2024/08aa2a72-2bf0-42b4-8eee-7ec49a311828",
    "title": "Customer satisfaction award winners announced for 2024",
    "publish_date": "Fri, 11 Apr 2025 01:27:12 +0000",
    "category": "finance",
    "authors": [
      "April"
    ],
    "text": "4 of 15 Attribution: A Current Affair\n\nMedibank won the award for Risk & Life insurer of the year, despite a rocky year for the company, which was impacted by a massive cyberattack.\n\nIt's a new entry for the winners list. ﻿",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/ivf-rebate-extended-for-single-women-lgbtiq-solo-mums-share-journey-before-infertility-definition-change-exclusive/2159a56e-6459-4bf6-9807-768622599756",
    "title": "Carly and Rikki spent $30k to have babies. That wouldn't happen today",
    "publish_date": "Fri, 11 Apr 2025 01:39:28 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Before this month, affordable IVF treatment was out-of-reach for women like Carly.\n\nThe Melbourne mother-of-one began the long and financially draining process of qualifying for subsidised IVF under Medicare as a single mum in 2022.\n\nCarly forked out $10,000 on two intrauterine insemination (IUI) procedures at age 37 to prove she was infertile and make herself eligible for the government rebate.\n\nSolo mum Carly went through two IUI procedures to be eligible for a rebate. (Supplied)\n\nIt wasn't until April 1 that the Medicare definition of \"infertility\" in Australia was extended to include single and LGBTIQ+ women, meaning they can access subsidised IVF treatments without needing to prove infertility first.\n\nIf this announcement took place a few years ago, Carly would have skipped this painful box-ticking exercise.\n\n\"I remember telling my parents, 'I have to complete two IUI cycles to be deemed infertile before commencing IVF with rebates'. I was a bit shocked, especially in this day and age,\" Carly told 9news.com.au.\n\n\"It just baffled me. I hadn't realised that was going to happen until I was in the process.\"\n\nTo be eligible for the rebate, Carly had to pay for two IUI treatments, which didn't work.\n\nThat came with its own heartbreak and grief.\n\n\"I wrote down everything from my parking to my medication and appointments, all things included, it cost me just over $10,000,\" Carly said.\n\n\"I didn't have limitless money or time, because now I'm 39, and you not only have to put in the money and time, with administering needles and medication, you're also going through so much emotionally and physically.\"\n\nThe two failed IUIs meant Carly then qualified for an IVF rebate, eventually saving her around $6000 all up.\n\nThe IVF rebate scheme differs from state-to-state.﻿\n\nShe welcomed her son, Rylan, six months ago.\n\nCarly said she's lucky it only took one round of IVF to fall pregnant.\n\nIf she didn't have the rebate to fall back on, a second try may not have been an option.\n\nShe's glad other solo mothers won't need to jump through the hoops she did.\n\n\"I think it's fantastic news. It could be the difference that means you can afford doing another round and getting a baby,\" Carly added.\n\nFellow single mother Rikki was in a very similar boat.\n\nThe Queensland mum didn't want to wait, however, and skipped IUI to pay for her almost $20,000 treatment fully out-of-pocket.\n\nRikki and her son Jasper. (Supplied)\n\nRikki told 9news.com.au she fell pregnant with son Jasper at age 33 after saving up for years.\n\n\"When I first considered it, I had assumed I would be eligible for Medicare rebate,\" Rikki explained.\n\n\"I was really frustrated... I pay taxes, I have private health, I've always done all those right things, yet I wasn't covered.\"\n\nNow happily raising an 18-month-old, Rikki said she's pleased the financial barrier to single motherhood isn't as high to climb.\n\nThough she said the announcement from the federal government went under the radar during a jam-packed election campaign, Rikki hopes the news will reach the right people.﻿\n\n﻿\"There is a whole spectrum of people doing this,\" she said.\n\n\"I think reducing kind of those financial barriers is essential to making sure that this is actually an option for all women and not just well-financed women.\"\n\nAlisha Burns, who created the Solo Mum Society, agreed with Rikki and said the \"long over-due change\" will help single women everywhere achieve their goal of motherhood.\n\n\"Updating the Medicare definition of infertility to include solo mums is a massive step forward in recognising that there's no one 'right' way to create a family—and that not having a partner shouldn't be a barrier to accessing fertility support,\" she said.\n\n\"As someone who went through multiple rounds of IVF on my own and now supports thousands of women through Solo Mum Society, I know how disheartening it's been for single women to be told they have to 'prove' infertility when all that's missing is a partner.\"\n\nRikki said she was glad other single mums won't have such a big barrier to access IVF. (Supplied)\n\nThe extended definition, announced by Assistant Health Minister Ged Kearney, also hugely impacts LGBTIQ+ people wanting to have a child.\n\nThe queer community, which has long lobbied for such a change, is celebrating this win in Australia.\n\n\"We've heard from community for a long time now about the discrimination they face when starting a family using an IVF clinic,\" said Executive Officer of Rainbow Families Ashley Scott.\n\n\"Some people were able to access the Medicare rebate on their first attempt, while others had to prove they were medically infertile — sometimes after three failed rounds of IVF or IUI. Even within the same clinics, there was a lack of consistency.\"\n\n\"We've been actively lobbying the Federal Government to ensure that LGBTQ+ people are treated like any other family,\" Scott added.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/world/donald-trump-tariffs-the-week-that-trump-pushed-the-global-economy-to-the-brink-with-tariffs--and-then-pulled-back/f361907f-e352-4597-a70b-63a1735ec092",
    "title": "Trump pushed global economy to the brink with tariffs — and then pulled back",
    "publish_date": "Thu, 10 Apr 2025 15:21:54 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "The stock market was soaring and the sun was shining when US President Donald Trump stepped out of the Oval Office on Wednesday afternoon. Less than two hours earlier, he had retreated from his plans to increase tariffs on many US trading partners, and investors were rejoicing after bracing for a global economic meltdown.\n\n\"You've got the markets seeing your brilliance,\" Senator John Barrasso, a Republican from Wyoming, told the president.\n\nTrump agreed. \"Nobody's ever heard of it,\" he declared.\n\nPresident Donald Trump speaks after signing an executive order in the Oval Office of the White House. (AP)\n\nIt was a typical bit of hyperbole that, in this case, was true. Even by the standards of Trump's second term, the saga that had played out over the past week left the world struggling to catch its breath.\n\nThe president, of his own doing, had single-handedly pushed the global economy to the brink of chaos with new tariffs. The stock market cratered, businesses tore up their plans and foreign leaders prepared for a future without the world's richest nation at the centre of international trade.\n\nAnd then Trump backed down. Seven days after announcing what would have amounted to America's largest tax hike since World War II in an elaborate Rose Garden ceremony, he rolled back most of the tariffs in a surprise post on his social media website.\n\n\"I think the word would be flexible,\" he said later despite days of insisting that he wouldn't bend. \"You have to be flexible.\"\n\nUncertainty lingers as trade talks continue\n\nIt was unclear what the president had accomplished, beyond the satisfaction of, in his words, having other countries \"kissing my ass\" to try to talk him out of the tariffs. No new trade deals have been reached, although administration officials said negotiations are underway.\n\nHowever, real damage has been done. The back-and-forth over tariffs shook confidence in U.S. leadership, exposed fractures within Trump's team and rattled companies that rely on global sources for products and international customers for sales. Americans who use the stock market to save for retirement and college suffered days of angst.\n\nExport vehicles are parked at Daikoku Pier in Yokohama, near Tokyo. (AP)\n\nThe turmoil isn't over yet, either. Trump's 10 per cent blanket tariffs initially imposed on Saturday are now applied to dozens of nations. He also jacked up tariffs to 125 per cent on imports from China, leaving the world bracing for a showdown between the first and second largest economies. There are 25 per cent tariffs on Canada and Mexico, America's largest trading partners, as well as 25 per cent taxes on imported autos, steel and aluminum.\n\nOther tariffs — including 24 per cent on Japan, 25 per cent on South Korea, 20 per cent on the European Union — are on hold for 90 days to allow for trade talks.\n\n\"This just accentuates the policy uncertainty and sense of unreliability Trump is creating,'' said William Reinsch, a former US trade official now at the Centre for Strategic and International Studies. While Reinsch said it's good news that Trump didn't move forward with some of his highest tariffs, \"how does anybody know that he won't change his mind on Friday or next week?\"\n\nTrump makes his announcement on 'Liberation Day'\n\nUS flags were draped along the White House colonnade for a red-white-and-blue backdrop when Trump announced his tariffs on Wednesday, April 2.\n\n\"My fellow Americans, this is Liberation Day,\" he said. The president held up a poster listing the tariffs that he would slap on each country — 32 per cent for Thailand, 49 per cent for Cambodia, 26 per cent for India, and on and on. People around the world squinted to decipher the numbers that would reset critical economic relationships.\n\nThe day after the announcement, Trump jetted to Florida for the weekend.\n\nPresident Donald Trump is displayed on a television on the floor at the New York Stock Exchange. (AP)\n\nPeople work on the floor at the New York Stock Exchange. (AP)\n\n\"The markets are going to boom, the stock is going to boom, the country is going to boom,\" he promised while leaving the White House, the whirring rotors of Marine One sometimes overpowering his voice.\n\nBut the market was crashing, posting its biggest single-day loss since the outbreak of the coronavirus pandemic five years earlier. And around the country and the world, the fallout spread over the weekend.\n\nFulcrum Coffee Roasters in Seattle braced for rising costs for beans from Southeast Asia and espresso machines from Italy. Stellantis, the automaker behind brands like Jeep and Ram, announced it would pause production at plants in Mexico and Canada, leading to temporary layoffs at other facilities in Indiana and Michigan, a reminder of how interconnected vehicle supply chains have become.\n\nThe Dutch division of Tata Steel said it would cut 1600 employees, about a fifth of its workforce. Ireland Prime Minister Michael Martin said \"there is no way to sugar coat\" the situation as business with the US started tapering off.\n\nTrump faces growing pushback from his own party\n\nThe markets were still in a panic on Monday when an unverified report circulated that the president was considering a 90-day pause on the tariffs. Stocks briefly soared before investors realised the information was wrong.\n\n\"We're not looking at that,\" Trump said as hopes for the rumored reprieve vanished.\n\nWorkers stitch garments at a factory run by the Bangladesh based Urmi Group in Narayanganj. (AP)\n\nWith fears of a recession growing, Republican lawmakers returning to the Capitol for the workweek were peppered with questions about the tariffs and what they would do in response.\n\nSen. Ron Johnson of Wisconsin was asked on Tuesday if he understood Trump's strategy, and responded by asking \"does anybody?\" Some of his state's premier companies like Kohl's expected higher costs, while its dairy farms expected to struggle to sell milk and cheese. Harley-Davidson was a target of planned reciprocal tariffs by the European Union.\n\nSen. Thom Tillis of North Carolina was even more blunt that day during a hearing with Trump's top trade representative, Jamieson Greer. If the tariff plans don't work, he said, \"I'm just trying to figure out whose throat I need to choke.\"\n\nTrump retreats, and aides call it part of the strategy all along\n\nThe tariffs on allies like Japan, South Korea and the European Union took effect at 12.01am on Wednesday, and there were no signs that Trump would back down when the sun came up in Washington.\n\n\"BE COOL! Everything is going to work out well,\" he posted on Truth Social.\n\nContainers with Yang Ming Marine Transport Corporation, a Taiwanese container shipping company, are stacked up at the Port of Los Angeles. (AP)\n\nTrump also wrote: \"THIS IS A GREAT TIME TO BUY!!!\" — advice that turned out to be fortuitous. The president later said he'd been talking with his aides that morning about pausing the tariffs, an announcement that would send the stock market soaring.\n\nGreer was back on Capitol Hill for another hearing when Trump made his announcement.\n\nRep. Steven Horsford, a Nevada Democrat, asked if Trump's trade representative knew that the tariffs he had just spent at least two hours defending had been paused.\n\n\"I understand the decision was made a few minutes ago,\" Greer said.\n\nHorsford erupted, saying \"this is amateur hour, and it needs to stop.\"\n\nAt the White House, press secretary Karoline Leavitt scolded reporters for not understanding the president's plans.\n\n\"Many of you in the media clearly missed The Art of the Deal,\" she said, referencing Trump's book from 1987. \"You clearly failed to see what President Trump is doing here.\"\n\nBut the administration sent mixed messages even as it rolled back the tariffs.\n\nPresident Donald Trump speaks after signing an executive order in the Oval Office of the White House. (AP)\n\nTreasury Secretary Scott Bessent said the decision had nothing to do with the markets.\n\n\"This was driven by the president's strategy,\" he told reporters outside the West Wing. \"He and I had a long talk on Sunday, and this was his strategy all along.\"\n\nTrump himself later contradicted Bessent.\n\n\"I was watching the bond market,\" he said. \"That bond market is very tricky.\"",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/national/sydney-retail-workers-tiny-injury-at-work-leads-to-amputation/e3dbcfd9-00cf-469b-904b-e4b3b9cfa22b",
    "title": "Sydney retail worker's tiny injury at work leads to amputation",
    "publish_date": "Thu, 10 Apr 2025 02:56:05 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "A Sydney retail worker has told how a tiny cut he got at work unexpectedly turned into a nightmarish, life-threatening injury.\n\nYvohn Ray Rosero, an international student from the Philippines, was working at a clothing store in Burwood when the seemingly innocuous accident happened.\n\n\"I was just doing my normal opening shift and I was trying to organise some denim pants in front of the store with some discount signage,\" Rosero told 9news.com.au.\n\nA small cut on a finger at work turned into a life-threatening infection for Yvohn Ray Rosero. (Supplied)\n\n\"I bumped my left index finger on the corner of the metal sign. It bled a little and created a small wound.\"\n\nNot thinking much of it, Rosero stopped the bleeding with a tissue, washed his finger and finished off his shift.\n\nIt wasn't until the next morning that Rosero started to feel a little off.\n\n\"When I woke up I could feel the stiffness in my left index finger. And then, after I showered, I started to feel shivery,\" he said.\n\nNot wanting to let his employer down, Rosero put a fresh bandaid on his finger and went in to work.\n\nA co-worker noticed Rosero did not look well and advised him to get medical attention straight away, so he went to the emergency department at Westmead Hospital.\n\n\"After a long wait of almost six hours, I was finally seen — and by that point, the infection had spread all the way to my left elbow,\" Rosero said.\n\n\"My finger had already turned necrotic. I was admitted right away.\"\n\nRosero sought help at the Westmead Hospital in Western Sydney. (Nine)\n\nDoctors told Rosero his infection was spreading alarmingly fast and had turned septic.\n\nLater that same day, Rosero was diagnosed with Necrotising Fasciitis, also known as flesh-eating bacteria.\n\nThe rare but aggressive infection spreads quickly and destroys tissue beneath the skin.\n\nRosero was admitted to the intensive care unit and has since undergone six surgeries in an attempt to get the infection under control.\n\nWhile doctors had initially been hopeful they could save Rosero's index finger, it eventually needed to be amputated.\n\nRosero said the experience was traumatic, but he was thankful for the doctors and nurses who cared for him.\n\n\"I never thought that a small, very tiny wound could change my life forever,\" he said.\n\nRosero is now facing a month off work while he recovers and an online fundraiser has been started to help with his medical and living costs.\n\nThe international student, who has been living in Australia for three years, said he had learned never to underestimate any open wound, no matter how small.\n\n\"I keep telling my friends and my family to always wash a cut or wound, no matter how small. Always make sure that you have an antiseptic cream or wipes,\" he said.",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-11/live-blog-perimenopause-questions-and-answers/105150078",
    "title": "Live: Got questions about perimenopause? Our experts are here to answer them",
    "publish_date": "Fri, 11 Apr 2025 01:27:38 +0000",
    "category": "lifestyle",
    "authors": [
      "Anastasia Safioleas"
    ],
    "text": "Perimenopause: it's a huge physical, mental and sexual upheaval in a person's life, and yet there's so much confusion as to how to make it through.\n\nSo, if you want to find answers about the months and years leading up to the final period, you're in the right place.\n\nWe have a fantastic selection of experts at the ready to answer any of your perimenopause questions.\n\nWhether it's about brain fog, sleep anxiety, mood swings, hot flashes or sex — nothing is off limits.\n\nFollow live.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-11/simple-pleasures-brand-sa-tourism-commission-frame-creative/105162320",
    "title": "Adelaide sidelined as SA tourism campaign kicks off for the Barossa",
    "publish_date": "Fri, 11 Apr 2025 00:35:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "Barossa imagery may be spearheading South Australia's latest tourism drive to capitalise on the AFL's Gather Round, but Adelaide's festivals and convenience will get a guernsey too in an episodic campaign for \"sophisticated travellers\".\n\nAdelaide's Frame Creative, in partnership with the SA Tourism Commission (SATC), this week started rolling out imagery and adverts that showcase the produce and \"simple pleasures\" of the Barossa and Fleurieu Peninsula.\n\nFrame Creative chief executive Tim Pearce said the state had been searching for a way to find its voice and a recent research paper had uncovered two key approaches, including not \"trying to be all things to all people\".\n\n\"We were picking up slightly more sophisticated travellers, those who aren't going travelling just to tick a box,\" he said.\n\n\"They don't need to fly to France to line up and take a photo of the Mona Lisa … they actually want more richness and quality from their tourism.\"\n\nThe '20-minute city'\n\nOne of Adelaide's unrivalled strengths is its scale and ease of access to the regions, to nature, to beautiful beaches and world-renowned wine regions, giving it the nickname of the \"20-minute-city\".\n\nThe campaign features artwork capturing South Australia's \"simple pleasures\". (Supplied: Frame Creative)\n\n\"We've got a place where it's very easy to experience serendipity, to experience unexpected nice things,\" Mr Pearce said.\n\n\"People come here and go, 'Oh wow. It's got a fair bit going on here, it's great', and you're like, 'Yeah, we know.'\"\n\nAdelaide, after all, is host to the largest arts festival in the southern hemisphere, when the Adelaide Fringe, the Adelaide Festival, Writers' Week and Womadelaide — events that draw nearly 100,000 tourists annually — combine to create what is known as Mad March.\n\nWomadelaide thrives as smaller city festival Photo shows Dancers at Womad Womadelaide's director says smaller cities such as Adelaide are perfect for major festivals because it's compact and residents offer loyal support.\n\nIt is all held within walking distance, with the Adelaide Motorsport Festival a recent addition to the listing.\n\n\"Here you can be picking cherries in Piccadilly and 20 minutes later be at the beach in Glenelg,\" Mr Pearce said.\n\n\"You can't get that easy, serendipitous, beautiful moment when you're fighting thousands of people on a train, or having to pay tollways to get from one side of the city to the other and it takes you two hours.\"\n\nHe said episodes that covered SA's \"broader story\" would be gradually released.\n\n\"So, unlike one and done, spending all our money on one hero ad and expecting the world to respond, we're actually putting out a more nuanced campaign that will grow and build and establish a new platform for us to have that conversation with people,\" Mr Pearce said.\n\n\"We've never had a platform to build on and there's a lot going on.\"\n\nThe rollout of the new SA tourism campaign started this week. (Supplied: Frame Creative)\n\nMoving on from past wrongs\n\nSATC chief marketing officer Erik de Roos said there was power in leveraging the fact SA had \"been designed so you can enjoy an easy, endless supply of these simple pleasures\".\n\n\"Our new brand platform looks to take ownership of this and create genuine distinction within the tourism category,\" he said.\n\nIt follows misfires by SATC in recent years, including a five-day online advert in 2018 that not even the former SA tourism minister had time to check out, and the infamous \"old mate\" advert of 2019, which left some viewers wondering if they were watching a message about depression.\n\nTourism ad controversy Photo shows Tourism SA ad causes social media furore An SA Tourism Commission ad that ends with an old man breaking down in tears is criticised for being \"depressing\", \"ageist\" and a \"terrible\" endorsement for the state.\n\nMr Pearce said the latest campaign would go live in Victoria, New South Wales and Queensland first, but in the middle of the year there would be material in China, the United Kingdom, the United States and New Zealand.\n\n\"Materials will be tailored to each of those markets. In China we know wildlife has more of a pull so we dial that up, but right now, for people popping across the border — mostly from Victoria but probably from WA and NSW too — for the footy, Gather Round's quite relevant,\" Mr Pearce said.\n\nHe said football fans had a taste for good food and wine as well, and with tens of thousands of visitors expected to visit the Barossa this weekend to watch North Melbourne play Gold Coast, and Richmond play Fremantle, the famed wine region was gearing up for a busy weekend.\n\n\"Hopefully this encourages them just to experience a little bit more,\" Mr Pearce said.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-11/ipl-starc-beats-hazelwood-but-both-hammered/105164390",
    "title": "Starc smashed, Hazlewood hammered in IPL slog-fest",
    "publish_date": "Fri, 11 Apr 2025 00:09:17 +0000",
    "category": "sports",
    "authors": [],
    "text": "Delhi Capitals have stretched their Indian Premier League winning streak to four games with a six-wicket victory, handing Royal Challengers Bengaluru a second home defeat at the Chinnaswamy Stadium.\n\nBengaluru wasted opener Phil Salt's quickfire 37 off 17 balls and was restricted to 7-163 on Thursday.\n\nWrist spinners Vipraj Nigam and Kuldeep Yadav picked up four wickets for just 35 runs in their combined eight overs.\n\nAussie pacemen Mitch Starc and Josh Hazlewood — on opposing sides playing for the Capitals and Challengers respectively — did not fare so well.\n\nBetween them, they bowled half-a-dozen overs, didn't get a sniff of a wicket and were carted around for 75 runs at 12-and-a-half an over.\n\nStarc's figures ended up at 3-0-35-0 and Hazlewood's 3-0-40-0, with Starc being plundered for 30 runs in a disastrous single, seven-ball over as England's Phil Salt went to town on the Aussie quick.\n\nDespite that, it was Starc who would have come away feeling slightly better with his day though after teammate Lokesh Rahul followed his 77 against Chennai Super Kings with another masterful unbeaten 93 off 53 balls as he led Delhi to 4-169 with more than two overs to spare.\n\nKL Rahul led Delhi to victory over the Royal Challengers Bengaluru at his home stadium in Bengaluru. (AP Photo: Aijaz Rahi)\n\nRahul soaked up the pressure of losing early wickets before counterpunching in the second half of Delhi's impeccable run-chase.\n\nFaf du Plessis scored only two off seven balls against his former franchise. Jake Fraser-McGurk (7) and Abishek Porel (7) went cheaply, skying catches to wicketkeeper Jitesh Sharma off Kumar's short balls, while captain Axar Patel (15) was taken at long-off as Delhi's chase got derailed in the ninth over.\n\n\"On a wicket like this, I knew what my pockets were,\" Rahul said.\n\n\"If I wanted to hit a big six, I knew what pockets to target, and [wicket] keeping gave me a feel for where other batters were dismissed and where they hit the sixes.\"\n\nRahul raised his half century off 37 balls but upped the ante when he smashed premier Bengaluru fast bowler Hazlewood for 22 runs in the 15th over, which featured three fours and a six over long off.\n\nBengaluru missed a golden opportunity when Rajat Patidar couldn't cling onto a difficult two-handed running catch off Rahul, who finished with six sixes and seven fours as he shared Delhi's best fifth-wicket IPL stand with Stubbs.\n\n\"Got lucky with the dropped catch,\" Rahul said.\n\n\"This is my ground, my home, know it better than anyone else.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nSalt's assault against Starc helped Bengaluru raise the fastest half-century by a team in this edition of the IPL, in just three overs, with the Australian paceman's second over going for 30 runs.\n\nSalt hit four fours and three sixes before he was involved in a bizarre run-out when he slipped after Virat Kohli ran him out having initially called for a tight single before turning back.\n\nBengaluru never got back the momentum against spinners Nigam and Yadav before Tim David slammed an unbeaten 37 off 20 balls.\n\nKohli made 22 off 14 balls.\n\nBengaluru had a chance when Bhuvneshwar Kumar's two strikes had Delhi stuttering at 4-58 before Rahul and Tristan Stubbs (38 not out) combined in a match-winning unbroken 111-run stand off 55 balls.\n\nDelhi, with eight points from four successive wins, shares top spot with Gujarat Titans, which has played one more game.\n\nBengaluru, with three away wins and two home defeats, is third on six points.\n\nAP/AAP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-11/bon-iver-interview-sable-fable-relationship/105152516",
    "title": "Bon Iver went back to the cabin in the woods to farewell his old self",
    "publish_date": "Thu, 10 Apr 2025 23:54:10 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Justin Vernon is 43 years old and five albums into his best-known musical project, the multi-Grammy-award-winning Bon Iver.\n\nHe's also newly in love, an important note when considering his new album Sable, Fable, an album dedicated to his new partner.\n\nListen to the full interview with Bon Iver here Photo shows Bon Iver's Justin Vernon in a white long sleeved top and black beanie with his arms folded across his chest Zan Rowe speaks with Justin Vernon in his only Australian interview about Bon Iver's first new album in six years, SABLE, fABLE.\n\n\"The whole concept is me reaching out to my counterpart, to the person I'm looking for in my life that could actually hang out with me, that I actually could do the story of life and love with,\" Vernon tells Double J's Zan Rowe in an exclusive Australian interview.\n\n\"It's a dedication to a person. They'll hear it all Friday for the first time. They've heard bits and bits and bobs, but yeah…\"\n\nGoing back to move forward\n\nWithout context, that person may be alarmed by the album's beginning. Its first three songs, which were released as the Sable EP late last year, see Vernon go back to the sound of his acclaimed 2007 Bon Iver debut, For Emma, Forever Ago.\n\nOn his fifth Bon Iver album, Justin Vernon accepts what troubled him about his early fame and approaches the future with wide eyes. (Supplied: Jagjaguwar)\n\n\"I would like the feeling gone, 'Cause I don't like the way it's looking,\" he sings in the album's first verse.\n\n\"I think those three songs are very intense,\" Vernon says. \"They're very heavy, and they're asking a lot of the listener.\n\n\"They're asking the listener — they asked me, certainly — to shed a lot of blood and shed a lot of weight and energy.\n\n\"I wanted people and myself to start this whole album process looking backwards and reflecting, and looking at the present and making a choice, looking at a fork in the road. I wanted people to have time to do that.\"\n\nSpoiler: the album's mood shifts significantly from here.\n\nSable, Fable has a distinct, though not entirely linear, emotional progression, which reflects Vernon's own soul-searching of recent years.\n\n\"I wanted me to have time to absorb what it felt like to put those three songs out in the world, and then to be able to really show that the passage of time was really valuable in trying to make a change in your life.\"\n\nLoading YouTube content\n\nEven though his work on the album is done, Vernon's path to emotional enlightenment continues.\n\n\"In the six months between Sable coming out and Fable dropping this week, I've healed a lot. I've grown a lot, and I think I really have to hang it on some of this art I've been making.\"\n\nIn a musical sense, the Sable songs had fans clamouring to exalt that the \"old\" Bon Iver was back.\n\nAfter a string of warped, sometimes challenging records that highlighted Vernon and his collaborators' hunger for experimentation, these three songs felt like a return to the man in the woods who made that iconic first album.\n\n\"I think I needed to do that for myself,\" Vernon says of revisiting those indie folk roots.\n\n\" It's like, I'm going to go back and be the guy in the cabin for a second and just try on all those clothes and accept who that guy was, and also say goodbye at the same time. \"\n\nEgo is not a dirty word\n\nVernon is not the first man in his early-40s to embark on a journey of self-discovery, but not many men have lived the bulk of their adult lives in the public eye.\n\nMoreover, not many artists as successful as Vernon have been as at odds with what we consider to be the classic persona of a rock star.\n\n\"I think I'm a pretty humble guy,\" he says. \"Growing up in Wisconsin, we're taught to be humble. We're taught to make sure that people around us know that we're humble, I think that's a really great way to grow up. At the same time, we're not immune to ego.\"\n\nThe realisation that ego has unwittingly informed some of your life's decisions and personal code is a tough one to face. As Vernon proceeds through his current emotional journey, he's starting to learn more about his younger self.\n\n\"I think I took a bit of pride in, in the whole jungle of the music industry, being one of the nice guys. One of the people that didn't need any of this for my ego at all.\"\n\nLoading YouTube content\n\nIn 'Awards Season', one of the tracks that appeared on the Sable EP, Vernon sings: \"I get caught looking in the mirror on the regular. What I see there resembles some competitor.\"\n\n\"I think that line means two things,\" he explains. \"One is me accepting that there was a part of my ego that was getting served by all of this.\n\n\"Even though I'm like, 'I don't need the Grammys, I don't need this, I don't do interviews, I just love the music,' I am susceptible and not immune to the pitfalls of some of that stuff. Also, not all of it's all bad. It's OK to accept who you are and to love yourself and to think that you have something to offer the world.\n\n\"I think the other part of that line is, we compete with ourselves, or we compare ourselves to our friends and other people that we see, and it's just a nauseating, endless battle that you'll never win.\"\n\nTwo sides to a record\n\nWhile the emotional progression on Sable, Fable is not entirely linear, these two parts of the record do clearly represent very different moods.\n\n\"Sable is that darkness and Fable is this blast off of happiness and joy,\" Vernon says.\n\n\"Then, by the end, there's sort of a resolve, that it's all part of the same cycle. There's a rhythm to everything, there's never a green pasture that you will endlessly rest in. Life and energy is ever ongoing, and there's an acceptance to that that I try to find here.\"\n\nAs the first three songs that make up Sable fade away, the Fable chapter begins. The shift of mood first comes via 'Short Story', where exultant chords blast some light into the record.\n\nLearning he has the power to change his life has been a powerful revelation for Justin Vernon while making the latest Bon Iver album.\n\nThen, 'Everything Is Peaceful Love' cranks the blissful vibes up further, sounding like 70s Philly soul processed through the Bon Iver machine to make it slightly gnarled while retaining its limerence.\n\n\"Hopefully, a lot of us have felt that sort of shiny, new-love feeling,\" Vernon considers.\n\n\"Sometimes in very dark periods of your life, those moments where you're in that thing with someone that you're falling in love with, it can be very, very powerful. Because maybe the rest of your life isn't really put together.\n\nLoading YouTube content\n\n\"A lot of those ecstatic ecstasy-like feelings, much like the drug, they're a little bit of a trick, even though they're beautiful.\n\n\"That song is not about necessarily all vapid love, or that it's all going to come cascading down and nobody should believe in love or anything like that. It's just that acceptance of that overwhelming feeling of ecstasy.\"\n\nEver since his debut album, an era-defining platinum record that inspired a generation of lovelorn indie balladeers, people have seen themselves in Vernon's work.\n\nWhile he's flattered to learn when he's inspired others, it wasn't always easy to accept the part he played in a stranger's emotional wellbeing.\n\n\"I just struggled a lot with the attention,\" he says. \"I struggled a lot with over exposure.\n\n\"I think what you see in Sable is me finally accepting that, that it's all been OK, and that I'm still here, and that I can change what my life is.\n\n\"If I'm not OK, it's my duty, if I have the privilege, to change my life moving forward. It takes strength and courage, and hopefully that strength and courage can also kind of be inspiring for other people.\"\n\nSex tends to go hand-in-hand with romantic love, and 'Walk Home' ensures Vernon has that part of the new-found love journey covered.\n\n\"There's always been sex in my songs and this kind of imagery and nods to the sexual,\" he says. \"But I think this time, I was like, 'We're just gonna come out and say it. Let's get in bed.'\"\n\nLoading YouTube content\n\nWhile it's not WAP, lines like \"Pull me close up to your face / Honey, I just want the taste\" are pretty frank for Bon Iver.\n\n\"It just kind of came out naturally that way,\" Vernon says. \"I wasn't thinking like, 'Now it's time to be sexy.' It's just sort of where I've been at, coming out with it and not having it all pooled up inside and trying to make it all shadowy. It's like, let's just call it what it is.\"\n\nArriving at this point felt liberating, as Vernon realised he finally had the confidence to put this part of himself out there and not wince at the reception.\n\n\"One of the most powerful things in the world is not giving a f*** anymore,\" he says. \"You can't just say you don't, you actually have to. I think that's in that song too. There's a bunch of stuff going on there.\"\n\nGood for the goose\n\nSable, Fable is out today, and fans are already devouring its luscious sounds and amorous themes. For Vernon, however, the album has already achieved what he wanted it to do.\n\n\"Even since finishing the record, I've grown so much and learned so much,\" he says.\n\nJustin Vernon says he is coming to terms with the struggles he faced early in his career. (Supplied: Jagjaguwar)\n\n\"I recognise I was trying to find a way to tell someone how I feel about them, how much I'd been going through before I met them [and] when I met them, and now getting to know them for the rest of my life.\n\n\"Once it's out there, my work with these songs is done and that's just a really clean feeling. It's a really great feeling. I know that these songs are going to mean something to people because the chance is, if they mean this much to me, there's going to be people out there that get something out of it.\"\n\nSable, Fable is out now",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-11/hope-returns-for-heritage-maryborough-pool-with-election-promise/105161152",
    "title": "Election pledge renews hope for country pool after three-year closure",
    "publish_date": "Thu, 10 Apr 2025 23:49:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "A long-awaited redevelopment may soon be on the horizon for a heritage-listed outdoor pool in regional Victoria, with federal Labor pledging $4.5 million towards its rebuild if the party wins the May election.\n\nClosed for the past three years, the Maryborough pool was deemed at \"end of life\" in 2022 by an independent assessor hired by the Central Goldfields Shire Council.\n\nThey recommended it be demolished and rebuilt — a project expected to cost about $10 million.\n\nThe 50-metre pool is the only outdoor facility of its kind for the town's 8,000 residents.\n\nThe nearest alternative is a 45-minute drive away in Castlemaine.\n\nThe Maryborough community has missed its outdoor pool. (ABC Central Victoria: Sarah Lawrence)\n\nThe Central Goldfields Shire has also committed $1.5 million to the redevelopment, while the community awaits the outcome of a $3 million state grant application.\n\n\"To see it in its current state has been a sad state of affairs,\" said Dan Davidson, president of the Friends of the Maryborough Outdoor Pool Precinct.\n\n\"It's important for the safety of our children, learning how to swim outdoors and get that shock of the cold water.\n\n\"It's also a place to catch up with their friends.\"\n\nSenator Jana Steward, second from left, announced the election promise. (ABC Central Victoria: Sarah Lawrence)\n\nFurther funding needed\n\nThe council is waiting to hear whether a $3 million grant application to the Victorian government's Regional Community Sports Infrastructure Fund will be awarded.\n\n\"Every country town deserves an outdoor pool. We want to see people having swimming lessons here and enjoying themselves,\" said state MP for Ripon, Martha Haylett.\n\n\"There are too many summers residents have missed having a pool here so hopefully it can be done as soon as possible.\"\n\nMaryborough is based in the federal seat of Mallee.\n\nNationals member Anne Webster said in a statement she was happy to fight for the project but was not in a position today to commit funding.\n\nDrowning rate increasing\n\nThe National Drowning Report 2024, published by the Royal Life Saving Society Australia (RLSSA), found there were 323 drowning deaths over the past 12 months, 16 per cent higher than the 10-year average (278).\n\nRLSSA general manager of capability and industry, RJ Houston, said all Australian children should have access to an outdoor local pool.\n\nThe Maryborough outdoor pool l is heritage listed. (ABC Central Victoria: Sarah Lawrence)\n\n\"Statistically, public pools are the safest place to swim and have the lowest drowning rate of any aquatic environment,\" he said.\n\n\"Public pools are supervised by professional lifeguards which is important in country communities which are often surrounded by rivers, lakes and dams.\"\n\nLife Saving Victoria is also backing the push for a new pool at Maryborough and wrote a letter supporting the grant application.\n\n\"Access to a functional, well-maintained aquatic facility is vital for the development of water safety skills, reducing drowning risks, and promoting community wellbeing,\" the letter said.\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-11/how-western-sydney-school-students-would-solve-urban-heat/105161400",
    "title": "45 degrees in the playground, here's how students would cool it down",
    "publish_date": "Thu, 10 Apr 2025 23:23:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "Public misting stations, fast-growing shade trees and minimised dark surfaces are some of the ideas high school students have come up with to help solve urban heat issues in their schools and community.\n\nA new program involving more than 900 students from nine public schools in Sydney's west asked students how they would address urban heat and spread the message to their community.\n\nOrange in this thermal image of a playground indicates hotter surfaces and purple indicates cooler surfaces. (Supplied: Doonside Technology High School)\n\nThe teens will pitch their final ideas to local government, academics, and industry figures on Friday at an event at Western Sydney University.\n\nDoonside Technology High students will pitch a plan to plant native strangler figs to shade the school's tennis courts, which the students found was the hottest part of the playground.\n\nUsing thermal imaging cameras and data loggers, the students found the tennis courts reached 45 degrees Celsius on a hot day.\n\nDiamond Mansouri says Ficus microcarpa, or strangler figs, are ideal trees for shade. (ABC Radio Sydney: Declan Bowring)\n\n\"Compared to other trees … rather than focusing on going up, [strangler figs] span out, creating more shade,\" year 10 student Diamond Mansouri said.\n\n\" Due to the lack of shade, people experience a lot of side effects of the heat such as heat stroke, heat exhaustion. \"\n\nFellow Doonside Technology student Celeste Martinez said more trees like this were needed in the Blacktown area.\n\nShe said walking home from school on a hot day took a lot longer because she needed to spend time waiting in the shade to cool down.\n\n\"The school is just a microclimate and we could do this on a bigger scale, which would help the Blacktown area,\" Celeste said.\n\nGranville Boys High School students came up with misting stations at the school gate to cool students down coming back to class from the oval.\n\nCeleste (middle) says more shady trees are needed at the school and in the Blacktown area. (ABC Radio Sydney: Declan Bowring)\n\n\"It's a very high-density area, so there are a lot of students squeezing through the gates to get to the bubblers,\" year 10 student Ayoe Holland said.\n\nOther ideas to cool down school environments include using cooler materials to build more shade, such as timber coated in greenery, and planting bushes that have high transpiration rates.\n\nBeyond the school helping the community\n\nStudents at Doonside Technology also designed a multilingual poster campaign to communicate with Western Sydney's diverse community.\n\nYear 10 student Yshie Cualbar helped develop signage in Tagalog, which is spoken by 3.8 per cent of residents in the Blacktown area, according to the latest census.\n\nYshie Cualbar helped develop signage in Tagalog. (ABC Radio Sydney: Declan Bowring)\n\nGeography teacher Liam Culhane said it was important to their class, which had students who spoke languages including Samoan, Tagalog, Burmese, and Farsi at home.\n\n\"They're [students] looking at how this project can spill out into the streets of their area,\" Mr Culhane said.\n\n\"They've recognised that our area needs this information and we are an area, based on urban heat island effect and heat sink, that is worse affected in Sydney compared to other places.\"\n\nStudents at Macarthur Girls High School will pitch to cool down their community by reducing dark surfaces and implementing a misting system in Parramatta Square.\n\nThe program, called 50°C: Climate, Heat and Resilience, was developed by Powerhouse Parramatta and Lang Walker Family Academy with support from the NSW Office of the Chief Scientist and Engineer.\n\nLocals developing local solutions\n\nUrban heat is a major issue in Western Sydney, where temperatures can be 10 degrees Celsius higher than in the city's coastal areas on hot days.\n\nClimate modelling suggests the number of heatwaves will increase, building to 16 days over 35C by 2030 and 46 days by 2090.\n\nSophie Poisel, who helped develop the program, said it was important to give students the chance to learn about the impacts of heat and how to work for change in their area.\n\n\"We know that heatwaves kill more people than all other natural disasters combined in Australia,\" Ms Poisel, the head of Lang Walker Family Academy said.\n\n\"It's really important that they know how to keep cool and then can develop some leadership skills to push for the types of changes that they want to see in their community and their school.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-11/latrobe-valley-divided-over-peter-dutton-nuclear-plan/105163106",
    "title": "Coal-fired community divided by power struggle for jobs and energy",
    "publish_date": "Thu, 10 Apr 2025 23:02:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tony Wolfe toiled at a coal-fired power station for more than 40 years to help keep the lights on across the nation.\n\nBut that does not mean he is a fan of coal.\n\nOverlooking the power plant's long shadows that fall across the Latrobe Valley's rolling hills in Victoria's east, Mr Wolfe dreams of a greener future.\n\n\"When I first started as a 15-year-old electrician we didn't know the damage that coal was doing [to the environment],\" Mr Wolfe said.\n\nMr Wolfe has since retired and now spends his days advocating for Australia's renewable energy transition.\n\nDespite his employment history, Tony Wolfe is not a fan of coal. (ABC News: William Howard)\n\nHe is not a fan of the Coalition's election promise to build a nuclear reactor in his old workplace if it forms government.\n\nAnd he thinks his fellow workers are being kicked around like an election football.\n\n\"I think coal workers have been used as a political toy,\" Mr Wolfe said.\n\n\"If it had happened 30 years ago it might have ended up being part of our energy mix.\n\n\"I think we're too late, we're too far behind.\"\n\nPeter Dutton has promised to build the seven reactors over 25 years at a cost of about $331 billion.\n\nHe said the proposal, with the first nuclear power plant operational by 2036, would be half the cost of the Labor government's renewables approach.\n\nThis claim is at odds with the CSIRO and Australian Energy Market Operator which say nuclear would cost twice as much as renewable energy.\n\nBuilt on coal\n\nHaving worked at most of the Gippsland region's power stations, Mr Wolfe has witnessed a lot of change.\n\nDutton's nuclear policy would have coal-fired power stations operating longer Photo shows Peter Dutton speaks at a press conference The opposition has finally put in place the last piece of its controversial nuclear policy, with modelling claiming its alternative would cost $260 billion less than Labor's transition path to net zero.\n\nHe is also well aware of the delicate relationship residents in the area have with brown coal.\n\n\"The workforce in the Latrobe Valley and the community is extremely proud of having produced electricity for Australia for 100 years,\" he said.\n\n\" This region's been built on coal. \"\n\nThere were four major power stations in operation at the peak of coal-power production in the Latrobe Valley — Loy Yang A and B, Yallourn and Hazelwood.\n\nHazelwood was decommissioned in 2017, Yallourn is scheduled to close by 2028, Loy Yang A by 2035 and Loy Yang B by the mid-2040s.\n\nMr Wolfe said he understood why they were being decommissioned.\n\n\"They're becoming more unreliable, they're requiring more maintenance, and we've worked out that there's cleaner, cheaper, safer ways to produce electricity,\" he said.\n\nYallourn coal-fired power station is slated to close in 2028. (ABC News: William Howard)\n\nAdding to the peculiarity of the region's power struggles is the fact Gippsland is also home to Australia's first declared offshore wind zone, a 15,000 square kilometre area in Bass Strait.\n\nThe Australian government has so far granted 12 feasibility licences for offshore wind projects.\n\nIf built, the Star of the South in Bass Strait will be one of the largest offshore wind farms in the world. (Supplied: Star of South)\n\n\"We're already at 40 per cent renewables in the grid, we need to continue that roll out,\" Mr Wolfe said.\n\n\" The coal workers and the community have been used as toys in a game backwards and forwards where neither party has been able to commit to energy policy. \"\n\nCommunity divided\n\nAndy McCarthy is no stranger to the energy debate, having established Gippsland's first solar panel installation company in 2010.\n\nHe has since sold the business but vividly recalls being laughed at when he started selling the solar dream to Latrobe Valley residents.\n\nAndy McCarthy faced backlash when he started the region's first solar installation company. (ABC News: William Howard)\n\n\"I lived in the inner green belt of Melbourne, where everybody believed that we were transitioning and that we all just felt the same way,\" Mr McCarthy said.\n\n\" And then I moved to Latrobe Valley, and I just got hit with this like visceral wall of resistance and hatred and ridicule. \"\n\nMr McCarthy said the Coalition's nuclear announcement has reignited energy division in the community.\n\n\"It's sad that the way that it's been preying on that fear, uncertainty and doubt that people have,\" he said.\n\n\"I think people want to believe that there is an easier way for the valley to transition.\"\n\nHarlequinn Goodes says potentially having a nuclear reactor near her home \"feels dangerous\". (ABC News: Darryl Torpy)\n\nYouth advocate Harlequinn Goodes said the environmental impacts of nuclear energy were too significant to ignore.\n\n\"I think we're doing a great job working on renewables already country wide and I don't see why we would suddenly switch and put a reactor so close to where people live,\" she said.\n\n\"It feels kind of dangerous.\"\n\nJobs in jeopardy\n\nThe upcoming federal election will go a long way to defining the future of the Latrobe Valley.\n\nWhile the national debate centres on energy, at a local level the impact will be on the workforce in hundreds of homes across the region.\n\nIt is a part of Victoria that is no stranger to job insecurity.\n\nSteven Doble worked at packaging and paper company Opal Australian Paper on the outskirts of Morwell.\n\nSteven Doble worked at Opal Australian Paper's factory in Maryvale. (ABC News: Darryl Torpy)\n\nIn 2023, after months of speculation, Opal announced it would close its white paper production line, slashing dozens of jobs.\n\nMr Doble said this, alongside the impending closure of Victoria's coal industry, influenced his opinion on nuclear energy.\n\n\"Nuclear is probably the way of the future, especially in the Valley,\" he said.\n\nThe Maryvale Mill was the last in Australia to make white paper. (ABC News)\n\n\" We've still got coal, but they're shutting down all the power stations, so we need to fill that void somehow and I don't think solar or wind power is going to do that. \"\n\nTraralgon grandparents Linda Benson and Lisa Tyres were of a similar mind.\n\n\"We definitely need more work in the valley, and nuclear could be a way to do that,\" Ms Benson said.\n\nLinda Benson worries for the future of her grandson's generation. (ABC News: Darryl Torpy)\n\nA Monash University report found about 7,200 coal jobs were lost between 1989 and 2001 when the sector was privatised, while the 2017 Hazelwood power station closure resulted in 750 direct job losses.\n\n\"The Latrobe Valley is going downhill fast, and they just need to bring more jobs, more opportunities and more business into town,\" Ms Tyres said.\n\nThe Hazelwood power station closed at the end of March 2017. (ABC News: Jarrod Whittaker)\n\nBut just because they supported the construction of a nuclear reactor, did not mean they were against renewables.\n\nThey said it was about finding the right balance.\n\n\"I love wind and solar, we've got solar on our house,\" Ms Benson said.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-11/the-masters-australians-jason-day-leads-the-way/105164248",
    "title": "Days leads the Aussies at the Masters and keeps in touch of first round leaders",
    "publish_date": "Thu, 10 Apr 2025 22:56:29 +0000",
    "category": "sports",
    "authors": [],
    "text": "Jason Day has warned against the tactic but Cameron Smith's \"unreal\" putting has encouraged him to attack Augusta National after a familiar first-round grind offered the Australian some Masters hope.\n\nA long birdie putt on the 18th helped Smith to a one-under-par 71 on Thursday, despite the 2022 British Open champ hitting just six greens in regulation and finding eight of 14 fairways on Thursday.\n\nThings went similarly for Smith a year earlier, with the 31-year-old battling on to finish in a tie for sixth, his fifth top-10 finish in the last seven years.\n\nOnly the great Tiger Woods, in 2005 and 2019, has won the tournament from outside the top 10 after the first round in the last 20 years.\n\nBut, with winds expected to pick up, Smith has found some confidence with the flat stick.\n\nCameron Smith had a good day with the putter after struggling with his long game. (Getty Images: Michael Reaves)\n\n\"Putting seems unreal at the moment,\" he said.\n\n\"This whole start of the year I've hit a lot of good putts and even a lot of great shots and haven't really got much out of it.\n\n\"Today I definitely got the most out of my round, which is a good way to start.\n\n\"It gives you the confidence to go at some pins and do stuff you wouldn't normally do and be aggressive. Looking forward to the weekend.\"\n\nCompatriot Day, who shot a blemish-free, two-under 70, has warned against that approach though and admits it's always tough to claw back ground at the year's first major.\n\n\"I just struggle to think that anyone can shoot a low one although it has been done,\" he said.\n\nThe LIV Golf talent Smith, seeking his first title in nearly two years, needed to draw on some early magic, threading a narrow gap after pulling his drive off the first tee.\n\nHis iron snuck between two huge pines and curled back towards the green, Smith then two-putting for par.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I don't think there were too many choices out there, to be honest,\" he said.\n\n\"They were all kind of a bit crappy. I've been in there a lot actually, on that left side, so I felt right at home.\"\n\nHe then scrambled with a long bogey putt on the fifth to avoid serious damage and drained a longer birdie putt from the fringe of the par-three sixth to return to even par.\n\nThat's where he stayed for the next 11 holes until a walk-off birdie at the 18th kept him in the conversation.\n\n\"I haven't left myself too much work,\" he said.\n\n\"For how I felt out there, it felt like it was going to be a bit of a long day.\n\n\"If I'm going to win this thing, I definitely need to do better than that but golf is such a weird game.\"\n\nMin Woo Lee, hot off his victory in Houston, joined Smith at one-under as England's Justin Rose led the field at seven-under.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-11/luke-metcalf-warriors-shaun-johnson-stacey-jones/105164060",
    "title": "New Warriors halfback Metcalf is learning to carry the weight of a nation",
    "publish_date": "Thu, 10 Apr 2025 21:53:33 +0000",
    "category": "sports",
    "authors": [],
    "text": "Being a halfback anywhere in the NRL is a serious business but in New Zealand it's a bigger task than most.\n\nRightly or wrongly, just like every other halfback, he bears a large part of the pride and glory when they win and wears the shame when they lose.\n\nBut if you're doing it for the Warriors it's a horse of a different colour, because no other playmaker carries the hopes of a nation on his shoulders every single week and it's hard to step lightly with a weight that heavy.\n\nNRL's Shaun Johnson seemed forever young Photo shows A man celebrates after scoring a try in a rugby league match From the first time we saw Shaun Johnson, he was a player of limitless possibility. It's only now, with his career winding down, that he has run out of tomorrows.\n\nStacey Jones found a way to do it, as did Shaun Johnson, even as it took all their brilliance, cunning and resilience.\n\nBetween them, they played halfback for the Warriors more than 470 times and the history of the club is moulded around them — Jones as the club's first home-grown folk hero, Johnson as a dazzlingly skillful modern icon.\n\nIf they ever built a Warriors' Mt Rushmore in Auckland, they'd both be on it.\n\nSo it's fair to say Luke Metcalf, even just four games into his new life as the inheritor of that legacy, has a lot to live up to, but instead of downplaying the task ahead of him or shrinking from it, he runs towards and isn't afraid to say that this isn't just what he wants, it's what he's always wanted.\n\n\"It is [a lot], but I like that. I like that challenge of having two of the best halves to ever play the game come before me and me being the next guy to take the Warriors where they want to get to,\" Metcalf said.\n\nMetcalf's confidence, which never hints at arrogance, is striking. He's been waiting for a chance like this for a long time given the 26-year-old has walked a winding path to the scrumbase.\n\nAmid stints with Manly and Cronulla, COVID and injuries have kept him to just 30 NRL games since his belated debut in 2021 even as his talents have been obvious whenever he's played at fullback or five-eighth. He's fast enough to run through a carwash and not get wet and has a fine sense for support play.\n\nLoading YouTube content\n\nTranslating those gamebreaking skills to halfback, or at least keeping the best of them while piloting the team around the park as lead playmaker, is a transition that took Jones and Johnson years to master and one Metcalf is now undertaking.\n\nMetcalf knows he's still at the beginning of that process, but given he's been a halfback since he was running around for Orara Valley Tomahawks as a boy he believes dictating terms comes more naturally to him than people might think.\n\n\"I always grew up being a halfback and it might sound weird but the organising and that sort of stuff, I feel like that comes naturally to me because I've always done it,\" Metcalf said.\n\n\"But the part where I'm still growing and learning is doing that and bringing my running game to it, becoming the complete player.\n\n\"Once I get a hold of that, that's when it'll all click for me — but I'm still figuring that stuff out.\n\n\"People might not think that comes natural but I think it does for me, I'm trying to mould it all together, I'm striving for perfection and hopefully one day I'll get there.\"\n\nMetcalf was at the centre of four key moments in the win over the Tigers two weeks ago, each of which showed a different aspect of his growing role as the side's halfback.\n\nThe first was the try he scored midway through the second, where he poured through in support to finish off some nice work from five-eighth Chanel Harris-Tavita and hooker Wayde Egan.\n\nMetcalf's speed and support play, two things he already excels at, were on show as was his developing combination with Harris-Tavita and Egan, which will be crucial if the Warriors are to continue to improve.\n\n\"We all think the same way about the game, we watch a lot of video together, we spend a lot of time together in spine meetings talking about what we want to do, what we want to set up and how we want to play,\" Metcalf said.\n\n\"Webby [Andrew Webster] puts a lot of faith in myself, Wadeo and Chanel to have a voice in the game plan and talk about stuff we want to do and how we want to look each week.\"\n\nThe second was perhaps the most subtle — a sharp run from deep in his own half that generated the quick play-the-ball, which led to Leka Halasima's remarkable 80-metre try.\n\nIt's rare a team would get some ruck speed from one of their halves taking a carry inside their own quarter but it's proof that for Metcalf, creation can come in many forms.\n\nHalasima's jaunt down the sideline captured much of the attention and rightly so, but Metcalf's carry was highlighted by none other than Johnson himself as a key element to what unfolded.\n\nLoading Instagram content\n\nThe two were halves partners for much of Johnson's renaissance year in 2023 and remain close mates, with Johnson acting as a key sounding board for Metcalf — as does Jones, who works as an assistant with the Warriors.\n\n\"Stacey's been awesome, we work very closely together and it's so cool to work with someone who's one of the best halfbacks to play the game,\" Metcalf said.\n\n\"I do a lot of kicking with him, a lot of talking around the game in general, he's so cool to work with.\n\n\"I speak to Shauny once a week still, he was one of my mates at Cronulla and then he came back to the Warriors, he's been really cool for me. He's always there if I need anything.\n\n\"It's pretty cool and an added bonus that I have them in my corner every step of the way.\"\n\nFinally came two kicks — first a conversion from out wide after Halasima's try, which levelled the scores, the second a penalty from just inside the 40-metre line to give the Warriors the lead with seven minutes to go.\n\nIt was his first game-winning kick in the NRL and Metcalf didn't just rise to the occasion, he relished it.\n\n\"I've done a lot of kicking in my life. Just trust your process, it's a big moment and you're talking to yourself in your head that it's a big moment,\" Metcalf said.\n\n\"But you live for those sort of things, especially as a kicker. You want to be in those moments and step up to the plate, it was awesome to get my first taste of it in first grade.\n\n\"I've always been like that, I've always been confident and I've always been that kid that wants the ball in my hands at the last moment.\n\n\"I want to kick the field goal, I want to kick the goal from the sideline, I've always had that in me.\n\n\"The game was going and I thought it would come down to something like that, so I wanted it in my hands and I was confident in myself that I could do that.\n\n\"I can't wait for more opportunities like that in my career.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nLike Metcalf, the Warriors as a whole are still a work in progress but the signs are promising.\n\nDespite an awful start to the season against Canberra in Las Vegas and a slew of injuries to the outside backs, they've won three in a row heading into Sunday's clash with Melbourne.\n\nNew Zealand once held the reputation of always playing the Storm well, which Jones and Johnson played a large roll in forging.\n\nBut it's now been many lean winters for the Kiwi club against the Victorians — the Storm have won the past 16 matches between the two dating back to 2016.\n\nMetcalf faces a considerable personal challenge as he goes head-to-head with another Kiwi maestro in Jahrome Hughes, who also had to bide his time to get a chance as a playmaker.\n\nTaking him and the Storm down is no easy task but it's another hard thing Metcalf is putting in his sights and by now the pattern should be clear.\n\nBe it taking a tough carry from his own line, getting the ball in his hands with the game in the balance or living up to the legacy of legends, Metcalf wants it all.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-11/jeremy-rockliff-stadium-legislation-likely-as-reports-questioned/105162744",
    "title": "Urgency creeps in as Tasmanian premier steps up response to stadium report",
    "publish_date": "Thu, 10 Apr 2025 21:44:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "The first time the Premier spoke about the Tasmanian Planning Commission's scathing stadium report he described it as \"perplexing\", the following day it was \"deeply concerning\", a week later it was \"tainted\".\n\nThese may seem like throwaway descriptions, but the careful shifts in language should ring alarm bells for some, each one signifying a greater disregard for a report that raises a lot of red flags about a very expensive project the government has staked its reputation on.\n\nThat's not to say the Tasmanian government does not have its reasons.\n\nPremier Jeremy Rockliff is looking into special legislation that would allow the stadium to bypass the planning system. (ABC News: Ebony ten Broeke)\n\nThose shifts in attitude have aligned with new evidence coming to light, such as the legal advice obtained by the Macquarie Point Development Corporation (MPDC) that claimed the report is \"argumentative, lacks balance and relies on untested material\".\n\nA list of stadium problems — from crowd squeeze to bus freeze Photo shows A map showing pinch points on three out of the four sides of a stadium and nearby areas. Macquarie Point is hemmed in by a highway, a working port, heritage buildings and a knoll, with just enough space for a stadium. The Planning Commission has laid bare the problems.\n\nOr more recently, an ABC story that revealed new information about how the TPC report, was compiled, leading the Premier to question its credibility.\n\n\"We can have no longer have faith in either report, I have to say, which is disappointing, because we wanted to work through all the issues,\" Mr Rockliff said.\n\nThe author of one of the reports the TPC has relied on, Nicholas Gruen, has defended his work suggesting the government is sidelining inconvenient truths.\n\n\"Some have found an easier course irresistible: to shoot the messenger rather than deal with the message,\" Dr Gruen said.\n\nIt is worth noting Mr Rockliff is not dismissing the TPC report and the issues it raises.\n\n\"We've been clear there are challenges, and we are continuing to work through our options,\" he told the ABC.\n\nBut the trashing of the TPC's report, deserved or otherwise, suits the government's narrative.\n\nThe AFL has stated many times it will not renegotiate its deal for a Tasmanian club license. The state must deliver a roofed stadium at Macquarie Point to secure a team. (Supplied: MPDC)\n\nEach dent it makes in the report's credibility paves the way for special legislation that would allow the stadium to bypass the planning system.\n\nBecause how can the government keep its pet project in a process that has produced a report it \"can no longer have faith in\"?\n\nWhy the Macquarie Point stadium is drawing 'pulp mill' comparisons Photo shows Anti-pulp mill protesters outside a Hobart court Amid the row over the proposed Hobart stadium there's been talk of it being a \"pulp mill\" moment — what does that mean?\n\nIt appears apparent that legislation to fast-track the project is now the government's preferred way to progress the stadium, buoyed by the fact Labor has offered unconditional support, regardless of the process.\n\nWhile the 'will they, won't they' go down the pulp-mill-shaped path discussion feels like it has been going on for some time, in fact it was just over a week ago that Premier Jeremy Rockliff revealed he had asked his department for advice about it.\n\nA quick history lesson. The pulp mill was a Project of State Significance in the mid 2000s but Gunns, the company behind it, pulled it out.\n\nThen Labor premier Paul Lennon recalled parliament to vote through fast-track legislation. It passed but the project fell over in the face of community opposition.\n\nBut back to the stadium, and once again, it comes down to language.\n\nStadium build in a pressure cooker\n\nLast week, Mr Rockliff was just canvassing options, days later the urgency was creeping in.\n\n\"At the very least, it throws into extreme doubt the timeline from for the project of state significance assessment,\" Mr Rockliff said.\n\n\"The clock is ticking, and we must get on with the job.\"\n\nThe proposed stadium is one of the biggest and most expensive projects in Tasmania's history. (Supplied: Macquarie Point Development Corporation)\n\nOn Wednesday this week it kicked up another notch, with Mr Rockliff referring to the \"very pressing timelines\".\n\n\"Given the fact that the Tasmania Devils are in the midst of a very important recruitment process, and the ongoing uncertainty that that sort of brings when it comes to attracting key personnel for the club, and given the fact that we are needing to get on and break ground when it comes to the training facility as well,\" Mr Rockliff told parliament.\n\n\" Timelines are crucially important, and I will do what I need to do, in terms of giving the public their say, but also ensuring that this house and the legislative council … has the opportunity to vote on this project. \"\n\nSo important that the government has refused to commit to the public hearings that were planned for June and July.\n\nHowever, Mr Rockliff has been very clear that regardless of the process, the public will have their say, pointing to the POSS process, where public submissions are open until May 8.\n\nMacquarie Point offers challenging location for a stadium build: a block of land that can only just squeeze in a football stadium between a working port, a highway, a steep knoll and a heritage streetscape. (Supplied: Macquarie Point Development Corporation)\n\nOn that urgency, it's worth pointing out that we've known for a long time the POSS process wouldn't be concluded until September. To put it in football terms, the goal posts haven't moved — yet.\n\nBut, to keep on the football theme, there is \"perceived pressure\" from the AFL and its club presidents as stadium and team deadlines creep closer — and the Tasmanian government is feeling the heat.\n\nAnd remember, it's not just about the team, but the high performance centre, the jobs and those pesky top-up payments the state will be liable for if it misses the mark.\n\nStadium legislation, likely\n\nThe urgency, the government's lack of faith in the report, and Labor's pledge of support all point to bespoke stadium legislation.\n\nRockliff seeks advice on bypassing planning commission for stadium project Photo shows Tasmanian Premier Jeremy Rockliff in parliament. After the release of a scathing draft report on Hobart's proposed stadium from Tasmania's planning commission, Premier Jeremy Rockliff confirms he is seeking advice on bypassing the current assessment process.\n\nAt this stage, it appears not to be a matter of if the government goes down that route, but when.\n\nThere are rumours the legislation is more advanced than the government is publicly letting on, but parliament has just wrapped up and is on another one of its many breaks for the year.\n\nGiven the POSS process would've resulted in a September vote, it is pretty safe to assume that if the government is going to embrace the more controversial track, it'll be aiming for something much sooner.\n\nA strong case can certainly be made for May. If it's ready.\n\nThe lower house will sit again on Tuesday May 6. Being the institution of many rules that it is, legislation needs to \"sit\" for two days. Meaning the soonest it could possibly be debated would be Thursday May 8.\n\nThe next option is less appealing, landing the government right in budget week.\n\nThe parliament will be busy and reporters will be focused on the state's finances.\n\nBut stranger things have happened. The federal Labor government certainly didn't shy away from amending the nation's environment laws during the budget week just gone.\n\nIndependent review finds new Hobart stadium costs to 'exceed $1 billion' Photo shows A concept image of the proposed Hobart stadium at Macquarie Poi nt. A leading independent economist tasked with reviewing Tasmania's proposal to build an AFL stadium on Hobart's waterfront finds the project is \"already displaying the hallmarks of mismanagement\" and is likely to exceed $1 billion.\n\nA cynical argument could be made that this timing would suit the Tasmanian government, with the budget being the main story of the day, the legislation might just slip through.\n\nAlthough that seems unlikely.\n\nThe later in the year it gets, the more pointless bespoke legislation will be.\n\nBut with the legislation appearing imminent, there are still so many questions.\n\nLike what will it look like? Will there be conditions on it given the many issues flagged by the interim report? Who ensures those issues are dealt with once it's approved? How can the public's views be taken into account when the process is so rushed and pre-determined?\n\nAnd there's a key question the government is still likely asking itself.\n\nWill its plan even work?\n\nWhile Labor's unconditional support will mean it will soar through the Lower House, the Upper House might not prove to be such an easy goal — the government needs two independents on side to get through.\n\nAnd if Tuesday's late night debate was anything to go by, it seems that up there, process still matters to some.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-11/tennis-monte-carlo-masters-de-minaur-and-popyrin/105164066",
    "title": "Aussie pair claim massive tennis scalps to reach Monte Carlo quarters",
    "publish_date": "Thu, 10 Apr 2025 21:28:01 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian tennis royalty has made majestic progress on the Court des Princes with both Alex de Minaur and Alexei Popyrin taking big-name scalps on the way to reaching the quarterfinals of the Monte Carlo Masters.\n\nFollowing each other on to the number two court at Monaco's Country Club on Thursday, Popyrin first saved two match points en route to outstaying world number seven Caper Ruud 6-4, 3-6, 7-5 before de Minaur raised eyebrows through the ease with which he demolished old foe Daniil Medvedev 6-2, 6-2.\n\nIt set up the rare treat for Australian tennis of having two players in the quarterfinals of a clay-court Masters 1000 event, with the tantalising prospect of further progress for the Sydneysider pals with de Minaur facing Grigor Dimitrov and Popyrin up against Alejandro Davidovich Fokina in Friday's last-eight ties.\n\nAfter a horror start to his season, Popyrin feels like he is starting his tennis year all over again as he earned his best victory of 2025 over Ruud.\n\nA year after he knocked out the then world number six Andrey Rublev at Monaco's prestigious Country Club, the beanpole Australian this time accounted for another big name at his most successful European clay court venue in a draining, near three-hour tussle.\n\nTwice, Popyrin was a point away from bowing out when 5-3 down in the deciding set, before he rallied and went on the attack against Norway's three-time grand slam finalist, reeling off the final four games for one of the best clay court triumphs of his career.\n\nIt also put a dreadful start to his year behind Popyrin, who had only won two matches before turning up in the Principality for his first outing of the clay court season.\n\n\"No, I'm 3 and 0 this year — I'm forgetting about the start of the year for me,\" the 25-year-old said when asked about his dismal opening to 2025.\n\n\"It was a tough start of the year but this week is a new week, and the year is really, really long, and I just have to put in the work and forget about the last couple of months — and that's what I've done this week.\"\n\nThe two-hour 56-minute win over Ruud, sealed by a cross-court volley which was his 49th winner of the match, set up a clash with Davidovich Fokina, who also pulled off a shock by defeating British fifth seed Jack Draper 6-3, 6-7 (6-8), 6-4.\n\nEighth seed De Minaur said he was now really finding his feet on clay after trouncing an out-of-sorts world number 11 Medvedev by earning seven breaks of serve in a one-sided affair lasting only 72 minutes.\n\nHe said he had taken confidence from how he had beaten Russia's US Open champ at Roland Garros last year.\n\n\"I thought I executed really well, just had a slight lapse in concentration. But apart from that, I thought I was very smart and tactically played the right way,\" said de Minaur, who will play 15th seed Dimitrov, a 6-3, 3-6, 6-2 victor over Novak Djokovic's Chilean conqueror Alejandro Tabilo.\n\nCarlos Alcaraz, the second seed, beat German qualifier Daniel Altmaier 6-3, 6-1 and will face rising French star Arthur Fils, while de Minaur's old nemesis Stefanos Tsitsipas looked in ominously good form with his 6-1, 6-1 win over Nuno Borges.\n\nThe Greek sixth seed will play Lorenzo Musetti, who won the all-Italian showdown with Matteo Berrettini 6-3, 6-3, in the last-eight.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-11/circus-oz-non-stop-melbourne-comedy-festival/105158408",
    "title": "A 65-year-old circus artist performs a 'dive of death' in new MICF show",
    "publish_date": "Thu, 10 Apr 2025 21:00:44 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "\"Are you with me?\"\n\nThere's an unspoken pact made at the start of Circus Oz's latest show, Non Stop, on at the Melbourne International Comedy Festival after a sold-out 2023 season.\n\n\"We're all in it together from the start, sharing the same experience,\" director Nicci Wilks says.\n\nWhile most audiences are passive, Non Stop is devised as more of a two-way conversation.\n\nYou'll see plenty of trapeze performers but never animals at Circus Oz; the company was one of the first to celebrate the human form only. (Supplied: Ian Sutherland)\n\n\"You're aware of this feeling that's being given to you [by audiences], just as much you're giving it to them,\" says Leo Pentland, who performs in the show and has worked with Circus Oz for three years.\n\n\" You feel that tension instantly. You instantly have the audience on your side. \"\n\nWhen he reveals mid-performance, for example, that — while he's hanging from a considerable height — the only thing supporting his body is something he's holding between his teeth, he can feel the audience engaging \"that little bit further\".\n\nCircus Oz performer Leo Pentland in training. In the lead-up to a show, performers train for hours each day. (Supplied)\n\nOr when a performer does a handstand on top of 10 stacked chairs, he says it \"gets an almost visceral response\".\n\n\"That's the really powerful thing about circus.\"\n\nPentland calls it a \"beautiful feeling of absolute unease\" — and Circus Oz has been cultivating it for decades.\n\nAvoiding, not chasing, risk\n\nWilks grew up in the Flying Fruit Fly Circus, Australia's national youth circus — and our only full-time circus school — where Circus Oz performers would visit and open up their tent to students to have a taste of professional circus performing.\n\nWilks is a seasoned theatre-maker and performer, but says creating circus requires the process to be slowed right down. (Supplied)\n\nCircus Oz is a trailblazer in Australian physical theatre and, since it was founded in 1977, the company has been responsible for showcasing our circus to the world.\n\nWilks says, given its prominence in her life and its incredibly rich history, directing her own Circus Oz show evoked a mix of feelings.\n\n\"It's exhilarating. Wonderful. Scary,\" she says.\n\nThey feel like words that could equally be applied to the show she's now directing.\n\nIn Non Stop, one stunt is performed by 65-year-old renowned circus performer Debra Batton, who is bringing back an \"old-school special\", disconcertingly named \"dive of death\".\n\nLoading Instagram content\n\n\"It's [an] incredible stunt,\" Wilks says.\n\nAnd though she assures that circus performers are \"the best risk-takers\" (or, as Pentland puts it, \"we respect risk\"), things can, and sometimes do, go wrong.\n\n\"We had someone snap their Achilles in WA,\" Wilks says. Though the performer told her it was an old injury.\n\nBoth Wilks and Pentland say there's a misconception that circus performers are adrenalin-chasing risk-lovers.\n\n\"What you see on stage is really just the final product of a lot of risk aversion, I would say,\" Pentland says.\n\n\"Circus people are probably the safest out there, because you understand the risks and you never take them for granted.\"\n\nDevising a performance that mitigates risk is a slow and precise art form.\n\nCircus Oz comedy can reach differently aged audience members, in different ways, at the same time. (Supplied: Ian Sutherland)\n\n\"Making circus is very different [from other performance],\" Wilks says.\n\n\"Because you've got all these bodies and brains working together that haven't necessarily worked together before, doing dangerous things with each other, trying to work out each other's idiosyncrasies and fears or determination or courage and what are they willing to try, or what are they not.\"\n\n\"People think that we get off on the whole adrenaline nature of it ... [but] I would say that circus people are probably some of the safest out there,\" Pentland says. (Supplied: Ian Sutherland)\n\nAmid all the rough and tumble moments, the slapstick, standing on top of each other and \"slapping each other around\", Pentland believes the care performers have for one another is clear to the audience.\n\n\"It's not just solo act after solo act. We all work together.\"\n\nCircus not going anywhere\n\nWhile that may be true on stage, it hasn't always been so true of the administration.\n\nCircus Oz hit trouble in the lead-up to 2021 when, after more than four decades of operation, disagreement peaked between circus members and funding partners.\n\nAt the time, Jo Caust, associate professor at the University of Melbourne's School of Culture and Communication, said the impact on the performing arts sector would be devastating.\n\n\"Circus Oz showed the world Australia was unique, Australians were capable of doing incredible things, and they had something special to offer on the world stage,\" she wrote.\n\nBut, at the final hour, Circus Oz announced that, thankfully, it had found a way to continue operating, albeit on a smaller scale.\n\nNonetheless, soon after, in 2023, when funding was threatened for the National Institute of Circus Arts (NICA) — a central part of the Australian circus ecosystem — circus veteran Anni Davey said, \"It feels like circus ... is under attack.\"\n\nTwo years on, both Circus Oz and NICA (after receiving 2024 funding) still stand — and Pentland is feeling confident about his sector.\n\nBoth Circus Oz, and circus in general, are making a comeback, he says.\n\n\"It's only getting better and better, and [there are] tours and consistency.\"\n\nCircus is a \"rapidly growing industry\" in Australia, Wilks says, pointing to a proliferation of small independent circus companies.\n\nA 'pinch-yourself moment'\n\nAnother persisting misconception is that circus is somehow a lesser art form — or not even an art form at all. Indeed, in Melbourne's performing arts awards, the Green Rooms, there is no category for circus performance.\n\nNon Stop, however, shakes off any stigma that might be attached to it. The show is \"relentless … It doesn't fade\", Pentland says.\n\n\"It's fierce, joyous fun.\"\n\nAnd Pentland is proud of the show's multi-generational cast, with members aged from their mid-20s to their mid-60s.\n\nAt 65, veteran performer Debra Batten is as bold a circus star as ever. (Supplied: Ian Sutherland)\n\n\"You aren't just seeing young bodies on stage [like] you'd expect. It's across a whole generation of performers — we have a member who used to teach me, so to share the stage with her now is an absolute privilege and delight,\" he says.\n\nBeing able to perform with Circus Oz — a company that he says \"has been such a pioneer, and given circus the credit it deserves\" — is also a huge privilege for Pentland.\n\n\"It's still sort of that pinch-yourself moment when you get into rehearsals and go, 'I get to be a part of this amazing space.'\"\n\nNon Stop is at the Melbourne International Comedy Festival from April 16–20, then tours regional Victoria (Karalyka, Shepparton and Bendigo) in July and New York City in December.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/the-panthers-are-in-disarray-how-did-it-get-to-this-20250411-p5lqyf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Panthers are in disarray. How did it get to this?",
    "publish_date": "Fri, 11 Apr 2025 11:55:59 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "We’re into the sixth week of the NRL competition and Penrith still hasn’t won a match in Australia. Their fifth consecutive defeat has left them languishing near the bottom of the ladder, leaving their title defence in tatters.\n\nHow did it get to this? Here are five reasons why Penrith’s reign could be coming to an end.\n\nCleary can’t do it all on his own\n\nNathan Cleary has always been a step ahead of the opposition. At the moment, his teammates can’t keep up with him either.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/afl/the-four-players-essendon-should-trade-and-a-couple-they-should-chase-20250408-p5lq21.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The four players Essendon should trade, and a couple they should chase",
    "publish_date": "Fri, 11 Apr 2025 11:55:37 +1000",
    "category": "sports",
    "authors": [
      "Chris Pelchen"
    ],
    "text": "Anyone associated with Essendon should be disappointed. Frustrated. Angry. Essendon have talked the talk, sometimes even walked the walk, but all too briefly. Too often they have been flaky or flawed – not qualities we or they would associate with great Essendon teams of the past. Brad Scott was uncompromising as a player and is trying to get Essendon to play with a hard edge. Credit: AFL Photos The Bombers have lacked steel, strength, and conviction and that needs to change. Success is earned through hard work and commitment, through proper strategy and execution. Essendon does have a strategy; they have started a three-year plan. Brad Scott knows what success looks like – as a player at Brisbane he was part of one of the greatest teams in AFL history. His coach, Leigh Matthews, is one of game’s most pre-eminent figures. Both are strong, both unyielding.\n\nBut the Bombers’ three-year plan should be part of a six to eight-year plan that incorporates the arrival of Tasmania into the competition. A plan that builds upon their recent primary focus on the draft. Essendon have had 12 picks inside the first two rounds of the AFL National Draft since 2020. They have another four selections in the first two rounds this year. That position assumes even greater significance when considering the limited access to early draft\n\nselections caused by forthcoming concessions for the Tassie Devils. Like Richmond, Essendon have made the right decision to attack the draft now. Those who hesitate will suffer – like the clubs that didn’t suitably plan for recruiting concessions granted to Gold Coast\n\nand GWS from 2009-2012. Such decisions were pivotal to Hawthorn assembling a player list to compete in four consecutive grand finals from 2012-2015.\n\nEssendon’s strategy should be reviewed, analysed, executed then reviewed again. Its development isn’t linear. It requires careful planning, periodical change and honest appraisal. No individual coach, staff member or executive can be allowed to hijack the process – some disagreement is expected, even encouraged, but it’s critical that the coaching, player development, high performance and list management teams are aligned. The Bombers have young talent. With the fourth-youngest list in 2025, their age demographic is skewed towards the future. They are not starting another re-build, that undertaking was initiated\n\nmore than five years ago. Twenty list changes in the past two years have only accelerated the program. But it’s essential they don’t look at their players through a biased lens – coaches and recruiters often favour their preferred players when success demands the same standards apply to everyone.\n\nThey have the nucleus of a successful team – Andrew McGrath and Jordan Ridley in defence, Zach Merrett, Jye Caldwell and Sam Durham in the midfield plus Kyle Langford and Nate Caddy in attack provide a solid foundation for the future. But there are still too many players who show potential rather than consistent talent. Good one week, poor the next. Willing to follow rather than lead. Satisfied with playing at AFL level over being the best. Neither unflinching, uncompromising or unconditional. Zach Merrett leads Essendon onto the MCG. Credit: Getty Images More players need to become like their captain and coach – tough and relentless – strong leaders who view team success as their legacy. While 2025 is an important step along the way, Essendon must keep their focus on the bigger picture – they simply don’t have the right personnel to win a premiership just yet.\n\nSo where to from here? Two statistics from 2025 clearly point to immediate needs. First, kicking efficiency – ranked 16th in the competition. Second, hard ball gets – also ranked 16th. Zak Butters will be a restricted free agent in 2026, and is the type of elite player Essendon should look to recruit. Credit: Getty Images Both statistics have been integral to premiership teams over the past 20 years, so ignore them at\n\nyour peril. The Bombers need players who can hurt the opposition by foot and/or win contested\n\npossession under pressure. And players who can break lines with their disposal. Essendon have high draft selections to work a trade for specific players in 2025 – they should firmly set their sights on Zak Butters (Port Adelaide) and Harley Reid (West Coast) if they can be convinced to return to Victoria.\n\nTheir early draft picks should only be expended to secure players of this calibre or to maximise their\n\ndraft position in 2025-26. Loading The draft is likely to be compromised by the Tassie Devils from 2027 so recruiting the best available young players now is of even more importance. While 2025 does not offer the same depth of talent as last year, the draft window is closing, so selection value is going to become greater over the next two years. Similarly, the Bombers should look to trade players who don’t form part of their premiership model.\n\nThis doesn’t mean releasing players at any cost but being prepared to take a step back to go forward\n\nin the longer term. These choices are sometimes contentious, but it is often the difficult decisions\n\nthat bring the biggest rewards. Players to consider:\n\nSam Draper As a free agent in 2025, Essendon should look to move him to improve their draft currency via AFL compensation or initiate a trade to a club offering the most favourable return. Essendon could be richly rewarded if they were willing to offload Sam Draper. Credit: AFL Photos Nik Cox v Harrison Jones Both players possess ability but have struggled with injury. With multiple “talls” on the list, they will compete for a position in the same team. Retain one, move the other.\n\nDarcy Parish Loading Has been unlucky with injury but the development of Caldwell and Durham means he is better served at a club competing for a premiership in the short term. Peter Wright While he adds depth to their forward line, the Bombers should look to trade him while he still has limited currency. Not part of their premiership model.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/victoria/baby-mia-lived-for-only-eight-hours-her-parents-still-wonder-if-hospital-staff-could-have-saved-her-20250409-p5lqdy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Baby Mia lived for only eight hours. Her parents still wonder if hospital staff could have saved her",
    "publish_date": "Fri, 11 Apr 2025 11:48:45 +1000",
    "category": "lifestyle",
    "authors": [
      "Melissa Cunningham"
    ],
    "text": "The findings, while devastating, did not come as a shock to the Iskanders. “When it is your first pregnancy, you leave your care in the hands of experts. You trust them,” Danielle said. “But from day one we received very mixed and confusing messages from the hospital.” The Iskanders and Mia in hospital after the delivery. The couple remember being told Danielle required an emergency cesarean, but rather than being rushed to the operating theatre, all they remember is waiting. “We weren’t too stressed because we thought obviously if it was an emergency, they would rush me into surgery,” Danielle said.\n\nThe first inclination that something was seriously wrong would come when Stephen was sitting outside the operating theatre waiting to be brought in to hold his newborn daughter, and he heard a message blare over the PA system. “They were calling a neonatal code blue,” Stephen said, his voice cracking with emotion. “I’m seeing people running in, but nobody is telling me what’s going on.” The hours that followed Mia’s birth are a blur. They remember seeing Mia in a knitted beanie, wrapped in a blanket, with wires all over her tiny body, and taking photos of her to send to their family. The couple said they were not told the severity of the situation until an infant emergency team arrived to take the critically ill Mia to another hospital. “When they told us to prepare for the worst and say goodbye to Mia, we were just completely blindsided,” Danielle said. “There are no words to explain that moment.”\n\nMia died less than eight hours after she was born. An independent expert, senior obstetric clinician Jeremy Chin, examined the case and found Mia’s heart rate should have been treated as a red flag for “significant fetal compromise” that required immediate management. However, Chin found that while a quicker delivery may have seen Mia delivered in a less severe state of oxygen deprivation, she was suffering from a perinatal infection that was “ultimately overwhelming”. Danielle had been previously hospitalised and was receiving ongoing antibiotic treatment for a bacterial infection, which had progressed to an infection in the baby. The coroner found Danielle’s treatment by the hospital before the day of Mia’s delivery was reasonable and appropriate.\n\nThe official cause of Mia’s death was found to be complications of a uterine infection in the setting of premature pre-labour rupture of membranes. Northern Health management declined to comment when contacted by The Age. “As this matter is currently before the courts, we are unable to comment at this time,” a spokesperson said. The Iskanders said they were speaking out to prevent their tragedy from happening to another family. They also said a lack of mental health care and lack of support shown by the hospital after the ordeal further traumatised them.\n\nLoading “We were just left to deal with it all on our own,” Danielle said. “Every time we called the hospital they were like ‘why are you calling us? You’ve already had your baby?’ We would have to explain, yes, I had the baby, but the baby died.” They called for reform in the healthcare system after several other deaths of babies and children in Victorian hospitals. On July 1, last year, they gave birth to another daughter, Maddison.\n\n“It was bittersweet,” Danielle said. “We were so happy, but there is still so much grief about Mia.” Mia’s death is one of a number of hospital deaths of young children or babies being investigated by Victorian coroners. Last year, an inquest into the death of a 19-month-old Victorian toddler Noah Souvatzis in 2021 found his death was preventable. Noah died on December 30, 2021, from meningitis. The coroner found that the toddler was discharged after an inadequate review by an under-trained, junior locum doctor on his first shift. Latrobe Regional Hospital is also facing calls for an independent inquiry after it was revealed several patients, including infants, had died or experienced serious harm.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/business/companies/guardian-australia-had-a-12-year-dream-run-has-it-lost-its-edge-20250402-p5lojb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Guardian Australia had a 12-year dream run. Has it lost its edge?",
    "publish_date": "Fri, 11 Apr 2025 11:45:00 +1000",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "“Obviously, we’d prefer not to be going into an election campaign with vacancies in Canberra, but I think the Canberra team is really stepping up. I think they’re doing a really good job,” Taylor says. Former prime minister Malcolm Turnbull. Credit: Alex Ellinghausen Middleton replaced Katharine Murphy, who left her position as political editor last year to join the Prime Minister’s Office. Asked about the next steps for Guardian Australia, Taylor reaffirms a company policy not to discuss operational matters or anything related to the recent events in Canberra. Yet, in the 12 months since Murphy left, arguably, things in Canberra could not have gone worse. They included an independent HR investigation into claims and counterclaims within the team and a swift exodus of talent. (Four of its most senior reporters and its veteran photographer have left.)\n\nSix months after Middleton started as political editor, she filed an informal complaint against the company’s long-standing chief political correspondent, Paul Karp, who responded with a counter-complaint of bullying.\n\nTaylor was kept at arm’s length, considering she and Middleton were close friends of 35 years, having been cadets together at The Canberra Times and were former housemates. Former editor-in-chief of The Guardian, Alan Rusbridger. Credit: Paul Morigi The investigation involved interviews with Karp, Middleton and other staff, and delivered its findings in December. All involved were bound by strict confidentiality agreements. The investigation found Middleton’s bullying allegation against Karp could not be substantiated. Karp resigned soon after, and Middleton went on leave, where she remained until March when she and the organisation agreed on her exit. (In that tumultuous period, blogger and reporter Amy Remeikis joined the think tank, the Australia Institute, reporter Daniel Hurst moved to communications, and photographer Mike Bowers also departed.) It was a major decision to part ways with one of the most experienced press gallery journalists and biographer of the prime minister on the eve of a federal election, with incoming chief political correspondent Tom McIlroy to join only days before polling day.\n\nLoading Middleton and Karp did not respond to a series of questions. The situation punctuates a growing sentiment among journalists, many former and some current staff, that The Guardian has reached a point of maturity in Australia. It has succeeded where other international interlopers, such as BuzzFeed and HuffPost, have failed in breaking into Australia’s media establishment, but now, it is no longer the punchy upstart it was 12 years ago, for better or worse. Part of the early success matched experienced editors from The Guardian’s UK office with big-name local hires, says Rusbridger. It was a delicate balance between being the outsider and the disruptor, he says, but names such as Murphy and Taylor, alongside up-and-coming talent, helped, too. “That helped reassure readers it wasn’t some external transplant; it wasn’t outsiders parachuted in, it was people who had a local perspective.”\n\nSome have argued the exit of major characters associated with the brand (Turnbull still refers to Murphy as “Murpharoo”, for example) over a sustained period has led to a loss of its once-renowned edge, a contention Taylor doesn’t buy into. Loading “I think we’re growing a whole new generation of fantastic names for Australians,” says Taylor. “I think it would be really arrogant for a senior journalist to say, ‘no one will ever be a name like I was, or like my successor was’. We’ve got a whole new generation of fantastic journalists who are names already or who are going to be names.” Taylor’s confidence is backed up by several indicators of success. She is particularly pleased she proved former Fairfax boss Greg Hywood wrong when he told her on her departure there would only ever be two recognised news brands in Australia, alongside News Corp. Guardian Australia, which is published digitally in Australia, is one of the country’s top-read outlets, with a monthly audience of between 7 million and 8 million Australians. Its audience grew 9 per cent over the past two years, according to the February figures from ratings agency Ipsos, but was outpaced by international publishers The New York Times (up 12 per cent) and the BBC (29 per cent) across the same period. Albeit, those had more room for growth.\n\nIn 2024, Guardian Australia made a modest $1.3 million in profit, yet this isn’t a top priority for the not-for-profit trustee ownership. It remains free to access, urging its readers to pay on a voluntary basis, and has significantly grown its newsrooms and areas of coverage, Taylor says. “It is true, we’re bigger and much more influential now, and I think that’s a good thing,” Taylor says. “Being a start-up is exciting, but there’s not really anything romantic about trying to cover all the news in an ongoing way with a handful of reporters.” Former Guardian Australia journalists Karen Middleton and Paul Karp. One criticism levelled by current and former staff is a legendarily low appetite for legally tricky stories which, they say, means it has lost some of its bite over the years. It’s a contention Taylor, unsurprisingly, disagrees with. “I think we are still breaking a lot of news. We still do hard-hitting analysis and opinion, and we’ve added a lot of investigative clout to that as well,” Taylor says.\n\n“I think any publisher in Australia is aware of how our defamation laws work, so you need to be calculated and deliberate in the risks that you take, but we’re not shy of taking risks if the story is in the public interest and worth it.” Despite the commentary and exits, there is no need to reinvent the wheel or the mindset at Guardian Australia, says Taylor. Loading “I think we are still distinctive in the same way that we were then, in that we are progressive. We look at the world through a progressive lens. That doesn’t mean that we’re partisan. We always follow the facts, but we look at things with the view that Australia and the world can change to be better and fairer. “The sort of essence of The Guardian is here as it’s always been.”\n\nOne senior News Corp editor, who requested anonymity to comment freely, affirms the outlet as a “professional” news outfit. “But the point to make is that all media organisations today define themselves and their business model according to a political slant.” This applies to both The Guardian and The Australian, they say, which has led to an increasingly polarised electorate. “Media organisations don’t want to admit that. It’d be helpful if they did.” Taylor’s own role as editor has been the subject of speculation for some time, given she is now Australia’s longest-serving editor after The Australian Financial Review’s Michael Stutchbury stood down in mid-2024. Staff constantly speculate she is in line for a move to the UK head office or to take up an editorial role at the ABC, neither of which are happening, Taylor says.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/ange-says-the-football-gods-won-t-save-him-but-he-still-has-a-pulse-at-spurs-20250411-p5lqyo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ange says the ‘football gods’ won’t save him, but he still has a pulse at Spurs",
    "publish_date": "Fri, 11 Apr 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "There’s no getting away from it: it’s been an awful season. They’re 14th in the Premier League with 16 defeats in 31 games so far, the most they’ve suffered in a single campaign for more than two decades.\n\nAngeball is not dead. Not yet. Worst-case scenario, this project has exactly one week to live, assuming we believe the talk that Postecoglou’s future in North London depends entirely upon winning the Europa League.\n\nThe English media might be openly speculating about Ange Postecoglou’s replacement, and it might be that at least half of the Tottenham Hotspur fanbase is counting down the seconds until the club posts a generic social media graphic and the words ‘Club Statement: Ange Postecoglou’ on its official channels, and there might be a priest in the room, holding a bible, ready to go - but there is still a pulse.\n\nInjuries explain it - at one stage they were missing a dozen key first-team players, and had zero centre-backs available for weeks on end - but only to a point. All their big stars have returned over the past few weeks, but they have generally stunk it up. Patience has run out, and something resembling psychological warfare has broken out between the manager and the supporters.\n\nThere have been shades of 2017 about Postecoglou’s prickly demeanour of late. That was his last year with the Socceroos, when he walked out on the Australian game just six months before the World Cup, having realised he alone couldn’t ‘fix’ it. He admitted he had become worn down and didn’t like who he’d become.\n\nAnge Postecoglou - celebrating, not praying. Credit: Getty Images\n\nIt’s a bit similar now. He doesn’t look happy. His contempt for certain journalists in the Spurs press pack is no longer concealed, and he can’t help but snap back at the fans who taunt him during and after games. Last week, after the away fans at Chelsea chanted “You don’t know what you’re doing” when he took off Lucas Bergvall for Pape Matar Sarr, he cupped his ears in their general direction when Sarr scored shortly afterwards. The goal was then disallowed. He tried to explain later that he just wanted to hear the fans supporting the team, but nobody believed him.\n\nIt was, as they say, Spursy behaviour. He’s supposed to be the antidote, but it’s infecting him.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/blinded-to-what-i-had-i-spent-a-mad-day-stalking-my-younger-hotter-self-20250410-p5lqu5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Blinded to what I had, I spent a mad day stalking my younger, hotter self",
    "publish_date": "Fri, 11 Apr 2025 11:31:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "When the rogue dumper slammed my gasping, half-dacked husband on the Thailand beach in 2018, he took a while to regroup. From the safety of his towel, he scanned for a second Poseidon Adventure-style wave and then for the roving ice cream seller to take the sting off near-death.\n\nToo rattled to read, Chris started watching a nearby couple. I did too. Late 20s, arguably the best-looking pair I’d ever seen in real life. And I’ve been in the same room as Chris Hemsworth and Elsa Pataky.\n\nIt’s easy to become absorbed in the lives of beautiful people like Elsa Pataky and Chris Hemsworth. Credit: Chris Pizzello/Invision/AP\n\nThey were so beautiful Chris wondered if he’d actually died and these glorious people were his eternal heavenly reward. But they were real. We ate watermelon ice creams, checked them out. The guy wore only faded boardies – think Robert Irwin’s thirst trap photos – but somehow ... glowing. His girlfriend looked like a French film star crossed with the Caramel Big M girl.\n\nJust when we were discussing adopting them, they left. “Grab your stuff – we’re following them.” Chris was dubious. “Darling, perving’s one thing. Stalking – really?”",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/politics/federal/copied-from-america-dutton-launches-election-fight-over-evs-20250402-p5loib.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Copied from America’: Dutton launches election fight over EVs",
    "publish_date": "Fri, 11 Apr 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Mike Foley"
    ],
    "text": "Follow our live coverage of the 2025 Federal election here.\n\nThe Coalition’s pledge to scrap fines for carmakers that exceed emissions caps imposed by Labor has raised concerns about new barriers to the influx of cheap EV models and entrenching petrol guzzlers that cost more to run.\n\nCoalition leader Peter Dutton has said that the penalties for carmakers under the Albanese government’s New Vehicle Efficiency Standard would spike the price of popular models, including that of the Toyota RAV4, which he said would increase by $9700.\n\nPeter Dutton spruiking his fuel excise policy on Thursday. Credit: James Brickwood\n\nEnergy Minister Chris Bowen rejected this claim and said every developed economy has implemented vehicle efficiency standards, which had not caused car prices to rise in any jurisdiction.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/afl/what-we-re-paid-to-do-how-jezza-danger-turned-game-for-cats-after-pep-talk-20250411-p5lqzd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Smith gave Crows fan the bird, now the AFL’s investigating; Danger reveals Jezza’s pep talk",
    "publish_date": "Fri, 11 Apr 2025 11:13:35 +1000",
    "category": "sports",
    "authors": [
      "Andrew Wu",
      "Peter Ryan"
    ],
    "text": "Loading\n\nGeelong’s star recruit Bailey Smith is set to come under scrutiny from the AFL for making an offensive gesture to the crowd after the Cats’ stirring victory over Adelaide on Thursday night.\n\nFootage has emerged on social media of Smith flipping a double bird to a fan as he and his teammates left Adelaide Oval after the opening match of Gather Round.\n\nThe AFL will look at the incident on Friday, according to a source with direct knowledge of the matter.\n\nSmith can be seen high-fiving a supporter leaning over the race before responding to another fan, wearing a Crows scarf and club polo, and raising both middle fingers.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/goodfood/perth-eating-out/is-perth-s-best-mexican-ish-cooking-found-in-a-european-ish-wine-bar-20250411-p5lr0t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Is Perth’s best Mexican(ish) cooking found in a European(ish) wine bar?",
    "publish_date": "Fri, 11 Apr 2025 11:11:52 +1000",
    "category": "finance",
    "authors": [
      "Max Veenhuyzen"
    ],
    "text": "Advertisement\n\nReview Eating outMount Hawthorn Is Perth’s best Mexican(ish) cooking found in a European(ish) wine bar? A subtle shift in direction makes an inner-city favourite even more compelling. Pass the mezcal. Max Veenhuyzen April 11, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 6 The brooding mole poblano. Matt O’Donohue 2 / 6 Mayan-influenced pumpkin seed dip with focaccia. Matt O’Donohue 3 / 6 Casa in Mt Hawthorn. Matt O’Donohue 4 / 6 Casa in Mt Hawthorn. Matt O’Donohue 5 / 6 Casa in Mt Hawthorn. Matt O’Donohue 6 / 6 Casa in Mt Hawthorn. Matt O’Donohue Previous Slide Next Slide Good Food hat 15.5 / 20 How we score Mexican$$$$ Consider, for a moment, the evolution of the wine bar in Australia. Previously\n\navailable in just four flavours – French, Italian and Spanish, plus a broadly\n\n“European” catch-all – wine bars have significantly broadened their horizons over the past decade. In Melbourne, there’s Manze: a Mauritian wine bar that taps into the diverse island heritage of co-owner Nagesh Seethiah. The enduring popularity of Brisbane’s Snack Man, meanwhile, is a reminder that lo-fi wines can do things for Asian food that tea can only dream of. (See also the Taiwanese-inspired cooking at Muni in McLaren Vale, South Australia: one of my standout meals of 2024.) Following the recent discovery of a maverick inner-city wine bar serving bold, brilliant Mexican cookery, Perth has entered the genre’s DEI chat. Sort of.\n\nAdvertisement\n\nNew-era Mexican cooking for the discerning (wine) drinker. Matt O’Donohue I say sort-of because the food at Casa, the Mount Hawthorn wine bar in question,\n\ndoesn’t just hang its hat on cocina Mexicana. Italy, for one, forms a healthy chunk of its playbook: think thick shoelaces of tonnarelli pasta and tiny mopheads of crab meat bound in a lurid jalapeno butter. Toast graffitied with fat squiggles of chicken liver parfait is typical of the bistro cooking that might appear while the menu occasionally dabbles in retro throwbacks (hello prawn cocktail lettuce cups). I also say sort-of because, according to Casa chef Paul Bentley, his cooking isn’t\n\nwhat he’d describe as Mexican food. Or at least Mexican food made by someone\n\nwith an intrinsic understanding of the cuisine and culture. “I didn’t grow up with an abuela [grandmother] cooking birria [a classic Mexican goat stew] on the weekends,” says Bentley. What our man did do, though, was spend a decade working in Mexico where, among other things, he opened Magno Brasserie – a distillation of everything he learned under legendary Perth chef Alain Fabregues at The Loose Box and Daniel Boulud of New York’s French powerhouse Daniel – operated ramen bars, plus ran a string of bakeries. (So that’s why Casa’s pillowy focaccia and the dough at its pizzeria spin-off are both so good! The peso drops.) The other thing Bentley did in Mexico was eat plenty of Mexican food, from the fancy to the street. So much so that when COVID lockdowns stranded our man in Perth, he brought his understanding of spice and acidity to the food he was cooking at Si Paradiso – the tepache (fermented pineapple juice) he’d slip onto pizzas, say – as well as Scarborough’s goodtime beachside cantina, El Grotto.\n\nAdvertisement\n\nSo when Bentley and fellow Casa partners Cale Mason and Sydney-based chef\n\nEnrico Tomelleri of Darlinghurst’s magnetic Paski Sopra opened Casa in 2021, it felt inevitable that Mexican influences would seep into that menu too. That octopus would be cooked al pastor taco style and laid across toast. (No longer on the menu, alas.) That a herbal Mayan-influenced pumpkin seed dip would partner said focaccia, and that those pepitas would also be turned into a salsa for grilled cabbage, charry from the grill. Both, thankfully, are still on the menu, as are more recent creations a la skewers of juicy lamb rump brightened by a sauce bright with barbacoa spice. A new kind of wine bar. Matt O’Donohue But for the new-new stuff, it’s all about the $79 chef’s menu. Once an outlet for\n\nBentley’s classically minded French cooking, the set-course option is now a four-\n\nstage meal comprised largely of off-menu items sporting a strong Mexican flavour. Sometimes the influence is subtle: the zip of pickled cactus in the flank steak tartare, maybe, or casting crunchy tostadas as ideal vehicles for highlighting the silken pleasures of pristine cured bonito.\n\nAdvertisement\n\nOther times though, the accent comes through loud and clear. That would be the\n\nbrooding mole poblano – a rich, slow-cooked fantasy of dark chocolate, dried fruit and a supermarket aisle’s worth of spice – pooled underfoot rosy, dry-aged Wagin duck breast. The bird’s legs, meanwhile, form the filling for dainty flautas: rolled-up, fried tacos that are even more fun to eat than they sound. (The tortillas for the flautas and tostada, incidentally, are made locally by the nixtamalized corn whisperers at La Tortilla.) Good Food hat 15.5 / 20 Review This French bistro is a masterclass in knowing when to follow and when to flout the rules For anyone that’s been stung by tasting menus that feel lazy, underdone or\n\noffer questionable bang-for-buck, Casa’s offering may help restore your faith in the format. Not that committing to a (somewhat restaurant-y) menu is mandatory for enjoying yourself here. Like any self-respecting wine bar, Casa has a welcoming, third-place charm that makes it feel like an extension of home, even if those rendered walls, mid-century accents and finely tuned speakers make it feel like the living room of an especially well-designed holiday home in Milan. You can push the boat out, even on a weeknight, or drop in a bowl of chips with green Goddess sauce or a scoop of pistachio gelato: switched-on and engaged staff will make you feel welcome, regardless.\n\nAdvertisement\n\nOf course, Casa isn’t the first place to have thought of serving tacos alongside vino. While not explicitly wine bars, establishments such as El Publico and La Cholita helped expose Perth eaters to Mexican food-and-drink matches beyond Coronas and bottles of tequila with worms in them. The joys of eating jarred salsa and packet corn chips on the couch are near universal, not least with bottles of juicy pinot noir, Yellowglen and the remote in easy reach. Thanks to the ubiquitousness of Old El Paso et al, you and I can enjoy such Tex-Mex pleasures without having to leave the house. But for Mexican-ish cooking of a higher calibre – and plenty more besides –\n\nwe’ll have to go to Casa. The low-down Vibe: New-era Mexican cooking for the discerning (wine) drinker Go-to dish: Charred bonito tostada, focaccia with pumpkin seed dip Drinks: One of Australia’s finest explorations of organic winemaking supplemented with thoughtfully chosen beers, spirits and cocktails Cost: About $150 for two, excluding drinks Five WA food and drink events to put into your autumn calendar Beloved Margaret River eatery to close\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/afl/roo-coup-ldu-shuns-free-agency-offers-to-sign-long-term-deal-with-north-20250411-p5lr0n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Roo coup: LDU shuns free agency offers to sign long-term deal with North",
    "publish_date": "Fri, 11 Apr 2025 11:02:17 +1000",
    "category": "sports",
    "authors": [
      "Sam Mcclure"
    ],
    "text": "North Melbourne midfielder Luke Davies-Uniacke has shunned huge offers from rival clubs to commit to the Roos for the rest of his career.\n\nThe 25-year-old, who was out of contract and set to become one of the game’s most in demand free agents, has signed a seven-year contract extension that will keep him at Arden Street until the end of 2032.\n\nNorth’s Luke Davies-Uniacke gets a handball away despite being tackled by Hawthorn’s Mabior Chol. Credit: AFL Photos via Getty Images\n\nCollingwood, Geelong and St Kilda will all be disappointed with Davies-Uniacke’s re-signing, with all three clubs showing interest in the star midfielder, who won his first best and fairest last season.\n\nHis commitment to North Melbourne is a significant fillip for the club when you consider the No.4 draft pick from 2017 has only played in 22 wins out of 112 games.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/politics/federal/coalition-to-pay-public-servants-to-leave-in-redundancy-scheme-20250411-p5lqz6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Coalition to pay public servants to leave in redundancy scheme",
    "publish_date": "Fri, 11 Apr 2025 10:59:48 +1000",
    "category": "finance",
    "authors": [
      "Natassia Chrysanthos"
    ],
    "text": "A Coalition government would offer voluntary redundancies to public servants to speed up its plan for reducing headcount in the bureaucracy, party spokesman James Paterson revealed for the first time on Friday morning.\n\nThe latest tweak to the opposition’s public service policy comes days after it walked away from its plan to cut 41,000 jobs and instead said the Coalition would rely on natural attrition and a hiring freeze to achieve an eventual $7 billion a year in savings.\n\nCoalition campaign spokesman James Paterson said public servants could get payouts to leave. Credit: Alex Ellinghausen\n\nThose savings are core to the Coalition’s plan for managing the federal budget and paying for spending promised during the election campaign, such as more than $9 billion for Medicare, but the opposition has been pressured over detail.\n\nIntroducing voluntary redundancies would allow the Coalition to target areas of waste and bring down numbers faster, but will also saddle the government with the cost of payouts to public servants. Paterson did not specify how many redundancies would be offered nor to what parts of the public service.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/sport/volk-opponent-separated-from-other-fighter-20250411-p5lr0z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Volk opponent separated from other fighter",
    "publish_date": "Fri, 11 Apr 2025 10:55:35 +1000",
    "category": "sports",
    "authors": [],
    "text": "Volk opponent separated from other fighter\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/coalition-vows-to-abolish-penalties-on-cars-that-dont-meet-fuel-efficiency-standards/5kqbhpbls",
    "title": "Coalition vows to abolish penalties on cars that don't meet fuel efficiency standards",
    "publish_date": "Fri, 11 Apr 2025 00:08:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Coalition would roll back multi-billion dollar penalties under Labor's fuel efficiency standards if elected, branding them a \"tax\" on Australian drivers.\n\n\n\n\n\nThe National Vehicle Emissions Scheme (NVES) was legislated by the government in 2024 and comes into effect on 1 July.\n\n\n\n\n\nMirroring other international schemes, it penalises high-polluting vehicles by setting an emissions ceiling for each auto manufacturer's fleet, incentivising consumers to buy low-emission vehicles including hybrids and electric vehicles (EV).\n\n\n\n\n\nUnited States President Donald Trump's tariff trade war has thrust the automotive sector into great uncertainty, and the Coalition has said the fines levied on the sector would cost voters $2.7 billion by 2029.\n\n\n\n\n\nOpposition leader Peter Dutton said: \"This is a tax on families who need a reliable car and small businesses trying to grow. Instead of making life easier, Labor is making it harder and more expensive.\"\n\n\n\nREAD MORE How new fuel rules could save Australian drivers thousands of dollars\n\n\"We want cleaner, cheaper cars on Australian roads as we head towards net zero by 2050, but forcing unfair penalties on car makers and consumers is not the answer,\" Dutton said.\n\n\n\n\n\nThe penalties under Labor's scheme will be accrued, and fines would only have been paid after 2028.\n\n\n\n\n\nBut some makers have already flagged they would either pass these down to consumers or remove popular models from sale to minimise penalties.\n\n\n\n\n\nIn 2019, the Coalition ran a campaign critical of electric vehicles, with then small business minister Michaelia Cash pledging to \"save our utes\".\n\n\n\nOpposition leader Peter Dutton has warned US President Donald Trump's tariff trade creates uncertainty for the automotive sector and may cost voters. Source: AAP / Lukas Coch The Opposition says it will maintain Labor's standards to continue to incentivise manufacturers to produce cleaner vehicles.\n\n\n\n\n\nOpposition transport spokesperson Bridget McKenzie said the Coalition supports low-emissions technologies but added that for many families, EVs are not practical.\n\n\n\n\n\n\"We want cleaner, cheaper cars on Australian roads as we head towards net zero by 2050, but forcing unfair penalties on car makers and consumers is not the answer.\"\n\n\n\nPM labels changes 'nonsensical' as industry responds\n\nSpeaking in Darwin, Prime Minister Anthony Albanese labelled the Coalition's policy \"nonsensical\" and would basically remove the incentive for the policy to be implemented.\n\n\n\n\n\n\"I find it extraordinary that Peter Dutton, who says he cares about the price of fuel, doesn't want people to have more fuel efficient cars, which reduce the costs of filling up their car,\" he said.\n\n\n\n\n\nAlbanese said the policy had been designed with consultation from manufacturers, saying before the laws were passed, the only nations without such standards were Australia and Russia.\n\n\n\nREAD MORE Why Australians are buying EVs even if they can't charge the cars at home\n\nThe Electric Vehicle Council said the Coalition's proposed changes to the regulations would render them \"toothless,\" and leave Australians to pay more for transport in the long run.\n\n\n\n\n\n\"Removing fines from the NVES is like having road rules without enforcement — no consequences for breaking the rules and no motivation to follow them,\" Electric Vehicle Council chief executive officer Julie Delvecchio said.\n\n\n\n\n\n\"Scrapping fines takes us back to the bad old days we left firmly in the rear-view mirror where Australia, alongside Russia, was a dumping ground for the world’s unwanted, fuel-guzzling, inefficient cars.\"\n\n\n\n\n\nThe Caravan Industry Association was more supportive.\n\n\n\n\n\n\"The NVES, as it currently stands, threatens to penalise the core of Australia’s vehicle fleet for non-compliance – families, tradies and caravanners will pay that penalty,\" it said in a statement.\n\n\n\n\n\n\"The Coalition's commitment reflects a practical approach that balances environmental objectives with economic realities.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-australia-could-benefit-from-a-us-china-trade-war/ke7ub7mzj",
    "title": "How Australia could benefit from a US-China trade war",
    "publish_date": "Thu, 10 Apr 2025 20:00:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Trump administration has announced a 90-day pause on its plan to impose so-called 'reciprocal' tariffs on nearly all US imports.\n\n\n\n\n\nBut the pause does not extend to China, where import duties will rise to around 125 per cent, on top of an existing 20 per cent tariff that is already in place.\n\n\n\n\n\nThe move signals a partial retreat from what had been shaping up as a broad and aggressive trade war.\n\n\n\n\n\nFor most countries, the US will now apply a 10 per cent baseline tariff for the next three months.\n\n\n\nBut the White House made clear that its tariffs on Chinese imports will remain in place.\n\n\n\n\n\nSo why did President Trump back away from the broader tariff push?\n\n\n\nThe answer is simple: the economic cost to the US was too high.\n\n\n\nModelling the fallout\n\nUsing a global economic model, we have been estimating the macroeconomic consequences of the Trump administration's tariff plans as they have developed.\n\n\n\n\n\nThe following table shows two versions of the economic effects of the tariff plan:\n\n\n\n\n\n1. 'pre-pause' – as the plan stood immediately before Wednesday's 90-day pause, under a scenario in which all countries retaliate except Australia, Japan, and South Korea (which said they would not retaliate)\n\n\n\n\n\n2. 'post-pause' - after reciprocal tariffs were withdrawn.\n\n\n\nSource: The Conversation As is clear, the US would have faced steep and immediate losses in employment, investment, growth, and most importantly, real consumption, the best measure of household living standards.\n\n\n\nHeavy costs of the tariff war\n\nUnder the pre-pause scenario, the US would have seen real consumption fall by 2.4 per cent in 2025 alone. Real gross domestic product (GDP) would have declined by 2.6 per cent, while employment falls by 2.7 per cent and real investment (after inflation) plunges 6.6 per cent.\n\n\n\n\n\nThese are not trivial adjustments. They represent significant contractions that would be felt in everyday life, from job losses to price increases to reduced household purchasing power. Since the current US unemployment rate is 4.2 per cent, these results suggest that for every three currently unemployed Americans, two more would join their ranks.\n\n\n\n\n\nOur modelling shows the damage would not just be short-term. Across the 2025–2040 projection period, US real consumption losses would have averaged 1.2 per cent, with persistent investment weakness and a long-term decline in real GDP.\n\n\n\n\n\nIt is likely that internal economic advice reflected this kind of outlook. The decision to pause most of the tariff increases may well be an acknowledgement that the policy was economically unsustainable and would result in a permanent reduction in US global economic power. Financial markets were also rattled.\n\n\n\nThe scaled-back plan: still aggressive on China\n\nThe new arrangement announced on 9 April scales the higher tariff regime back to a flat 10 per cent for about 70 countries, but keeps the full weight of tariffs on Chinese goods at around 145 per cent.\n\n\n\n\n\nRates on Canadian and Mexican imports remain at 25 per cent.\n\n\n\n\n\nIn response, China has announced an 84 per cent tariff on US goods.\n\n\n\n\n\nThe table's 'post-pause' column summarises the results of the scaled-back plan if the pause becomes permanent. For consistency, we assume all countries except Australia, Japan and Korea retaliate with tariffs equal to those imposed by the US.\n\n\n\n\n\nAs is clear from the 'post-pause' results, lower US tariffs, together with lower retaliatory tariffs, equal less damage for the US economy.\n\n\n\n\n\nTariffs applied uniformly are less distortionary, and significant retaliation from just one major partner (China) is easier to absorb than a broad global response.\n\n\n\n\n\nHowever, the costs will still be high. The US is projected to experience a 1.9 per cent drop in real consumption in 2025, driven by lower employment and reduced efficiency in production. Real investment is projected to fall by 4.8 per cent, and employment by 2.1 per cent.\n\n\n\n\n\nPerhaps we should not be surprised that the costs are still so high. In 2022, China, Canada and Mexico accounted for almost 45 per cent of all US goods imports, and many countries were already facing 10 per cent reciprocal tariffs in the 'pre-pause' scenario.\n\n\n\n\n\nTrump's tariff pause has not changed duty rates for these countries.\n\n\n\nWhat does this mean for Australia?\n\nMuch of the domestic commentary in Australia has focused on the risk of collateral damage from a US-China trade war. Given Australia's economic ties to both countries, it is a reasonable concern.\n\n\n\n\n\nBut our modelling suggests that Australia may actually benefit modestly. Under both scenarios, Australia's real consumption rises slightly, driven by stronger investment, improved terms of trade (a measure of our export prices relative to import prices), and redirection of trade flows.\n\n\n\nOne mechanism is what economists call trade diversion: if Chinese or European exporters find the US market less attractive, they may redirect goods to Australia and other open markets.\n\n\n\n\n\nAt the same time, reduced global demand for capital, especially in the US and China, means lower interest rates globally. That stimulates investment elsewhere, including in Australia. In our model, Australian real investment rises under both scenarios, leading to small but sustained gains in GDP and household consumption.\n\n\n\n\n\nThese results suggest that, at least under current policy settings, Australia is unlikely to suffer significant direct effects from the tariff increases.\n\n\n\n\n\nHowever, rising investor uncertainty is a risk for both the global and Australian economies, and this is not factored into our modelling. In the space of a single week, the Trump administration has whipsawed global investor confidence through three major tariff announcements.\n\n\n\nA temporary reprieve\n\nTariffs appear to be central to the administration’s economic program. So Trump’s decision to pause his broader tariff agenda may not signal a shift in philosophy: just a tactical retreat.\n\n\n\n\n\nThe updated strategy, high tariffs on China and lower ones elsewhere, might reflect an attempt to refocus on where the administration sees its main strategic concern, while avoiding unnecessary blowback from allies and neutral partners.\n\n\n\n\n\nWhether this narrower approach proves durable remains to be seen. The sharpest economic pain has been deferred. Whether it returns depends on how the next 90 days play out.\n\n\n\n\n\nJames Giesecke is a professor at the Centre of Policy Studies and the Impact Project, Victoria University.\n\n\n\n\n\nRobert Waschik is associate professor and deputy director at the Centre of Policy Studies, Victoria University.\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/michele-bullock-reserve-bank-speech-tariffs-trump/q88slb0fb",
    "title": "Reserve Bank governor says Australia 'well placed' to handle volatility amid tariff turmoil",
    "publish_date": "Thu, 10 Apr 2025 10:40:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Michele Bullock has made her first public remarks since the US announced sweeping tariffs on many countries last week.\n\nThe Reserve Bank of Australia governor said there would be an \"inevitable period of uncertainty and adjustment\" ahead.\n\nBullock said the RBA was \"carefully considering several factors\" ahead of a decision on interest rates in May.\n\nThe Reserve Bank governor has sought to allay concerns following a week of economic tumult brought about by United States President Donald Trump's trade war.\n\n\n\n\n\nAddressing a women's economic inclusion event on Thursday evening, Michele Bullock conceded she hadn't initially intended on speaking about the central bank's policy imperatives.\n\n\n\n\n\n\"Inevitably, there will be a period of uncertainty and adjustment as countries respond to the ongoing tariff announcements by the United States administration,\" she told the Chief Executive Women annual dinner in Melbourne.\n\n\n\n\n\n\"It will take some time to see how all of this plays out and the added unpredictability means we need to be patient as we work through how all of this could affect demand and supply globally.\"\n\n\n\nFinancial markets have experienced volatility since Trump's initial tariff announcement a week ago , with bonds and equities plunging or soaring at each development.\n\n\n\n\n\nThe US president's latest announcement of a 90-day pause on country-specific tariffs above 10 per cent, with the exception of China, reassured markets across the globe and sent Australian shares soaring more than 4.5 per cent .\n\n\n\n\n\nThe VIX index, which measures market volatility, has spiked up to 60 — the highest level since the early stages of the COVID-19 pandemic.\n\n\n\nAustralia in good place to weather volatility, Bullock says\n\nVolatility was to be expected as the process unfolded, Bullock said, but Australia was in a good position to weather the storm.\n\n\n\n\n\n\"First, we're not currently seeing the same degree of impact as previous market events like in 2008, for example,\" she said, referencing the global financial crisis.\n\n\n\n\n\n\"And second, the Australian financial system is strong and well placed to absorb shocks from abroad.\"\n\n\n\n\n\nBullock said that, being mindful of not adding to uncertainty, it was too early for the RBA \"to determine what the path will be for interest rates\", but that it was closely monitoring financial market conditions at home and abroad.\n\n\n\n\"We are carefully considering several factors, including the response of our trading partners, additional counter-responses from the US, the response of our exchange rate and adjustments in other financial markets,\" she said.\n\n\n\n\n\n\"A key focus for us is how all this uncertainty is affecting decisions made by households and businesses in Australia.\"\n\n\n\n\n\nOn Wednesday, traders had been pricing in five rate cuts by the end of the year, including the possibility of an emergency 50-basis-point reduction at the RBA's next meeting in May.\n\n\n\nEach 25 basis point cut would shave about $90 off monthly repayments on a typical, $600,000 mortgage.\n\n\n\n\n\nBut Trump's pivot prompted markets to walk back their bets, with just 25 basis points priced in for May and a total of 116 basis points by year's end.\n\n\n\n\n\nDeutsche Bank chief economist Phil O'Donaghoe, who 48 hours earlier had predicted a 50 basis point cut for May, reverted his call to his previous prediction of 25 basis points for May.\n\n\n\n\n\n\"That said, our general conviction around the path for lower RBA rates has increased,\" he said.\n\n\n\nThe remaining tariffs of 125 per cent on China and 10 per cent on the rest of the world will still weigh on the RBA's assessment for global growth, while diversion of goods from the US to Australia would reduce inflation domestically.\n\n\n\n\n\nNAB went the other way, doubling its forecast for a May cut from 25 to 50 basis points , having revised upwards the near-term unemployment rate while shaving growth expectations for 2025.\n\n\n\n\n\nThe bank's chief economist Sally Auld and head of Australian economics Gareth Spence said the RBA needed to play catch-up, with the 4.1 per cent cash rate still in restrictive territory.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/as-campaigning-continues-china-appeals-for-stronger-economic-ties-with-australia/jj2ps4dta",
    "title": "As campaigning continues, China appeals for stronger economic ties with Australia",
    "publish_date": "Thu, 10 Apr 2025 09:16:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "As campaigning continues, China appeals for stronger economic ties with Australia\n\nPublished 10 April 2025, 6:47 am\n\nAustralia is now on the hunt for new economic partners, still facing a 10 per cent US tariff. In the midst of the federal election, China’s top diplomat in Australia has appealed for Australia to consider stronger ties, something the government is rebuffing.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/ausbils-paul-xiradis-says-trump-tariff-pause-is-turning-point-plus-did-president-manipulate-market/f9el7dxwb",
    "title": "Ausbil's Paul Xiradis says Trump tariff pause is \"turning point\"; plus did President manipulate market?",
    "publish_date": "Thu, 10 Apr 2025 08:07:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-energy-minister-and-his-opposition-counterpart-lock-horns-over-power-prices/lfpug1lr5",
    "title": "The Government and Opposition lock horns over power prices |Evening News Bulletin 10 April 2025",
    "publish_date": "Thu, 10 Apr 2025 06:28:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Energy Minister and his Opposition counterpart lock horns over power prices ..\n\nThe Trump administration denies its suspension of sweeping tariffs is related to global market fallout...\n\nAustralians Alex de Minaur and Alexei Popyrin through to the next round at the Monte Carlo Masters.\n\n\n\nFederal Energy and Climate Change Minister Chris Bowen has defended the government's handling of power prices at a debate on energy with his Opposition counterpart at the National Press Club.\n\n\n\n\n\nAs well as policies to develop renewable energy sources, Labor is offering a further $150 rebate on power bills over two years in addition to its current bill relief.\n\n\n\n\n\nBoth leaders were asked if the Australian public should trust politicians' promises to ease power prices given that gas and electricity bills continue to rise.\n\n\n\n\n\nMr Bowen has said energy prices were affected by changing geopolitical and environmental conditions but renewable energy was the cheapest form of power.\n\n\n\n\n\n\"I don't pretend this is easy. We're not doing this for fun. We are doing this because the planet depends on it and it's a massive economic opportunity for our country. And because some fundamental things don't change. The fundamentals that renewables are the cheapest form of energy, even with the cost of storage, even with the cost of transmission, renewables remain the cheapest form of energy. That's what the science tells me.\"\n\n\n\n\n\nThe Coalition is planning to build seven nuclear power stations by the coming decades - and says its policy to incentivise energy producers to reserve more gas for domestic use will reduce household gas bills by 7 per cent and electricity bills by 3 per cent.\n\n\n\n\n\nOpposition Energy spokesperson Ted O'Brien says the government is failing to engage in big reforms.\n\n\n\n\n\n\"I believe the big problem we've seen over the last three years has been the treatment of regional Australia, in particular, who are carrying the burden of Labor's policies. They've been steamrolled here. And you can't expect communities, let alone the whole country, to come with you when you treat them with reckless indifference.\"\n\n\n\n\n\nOpposition Leader Peter Dutton has confirmed that any cut to overseas migration under a Coalition government would only be for two years.\n\n\n\n\n\nAustralia is on track to reduce net overseas migration by 120,000 to 260,000 next financial year according to government figures in the May budget, following Labor's reforms to reduce the migration intake from record post-COVID highs.\n\n\n\n\n\nMr Dutton has already promised to cut net overseas migration by 100,000 from whatever the current figure is if the Coalition wins office.\n\n\n\n\n\nToday he has clarified the cuts would only be temporary.\n\n\n\n\n\n\"We are going to cut migration numbers so we can increase home ownership in this country. We do it for a two year period then we bring back the numbers but it allows us to create about 100,000 homes , or free up about 100,000 homes, in addition to the $5 billion plan that we've outlined which will create about 500,00 homes. That's a serious housing policy and it will help get Aussie kids into Australian homes.\"\n\n\n\n\n\nIsraeli aircraft have struck a residential block in northern Gaza killing at least 23 people.\n\n\n\n\n\nThe Hamas-run Health Ministry says eight children are among the dead after the strike hit a four-story building in the Shijaiyah neighbourhood of Gaza City.\n\n\n\n\n\nThe Israeli military says it struck a senior Hamas militant who was behind attacks from the area but didn't name him or provide further details.\n\n\n\n\n\nIsrael has blamed the deaths of Palestinian civilians on the militant group, saying it embeds itself in dense urban areas.\n\n\n\n\n\nA key member of the Trump administration has denied the President's decision to pause sweeping new tariffs is motivated by falling global stockmarkets.\n\n\n\n\n\nUS Commerce Secretary Howard Lutnick says the decision is designed to give other countries time to negotiate with the U-S.\n\n\n\n\n\n\"So how can you be respectful when a country says, 'I want to come and talk, I will do it'? How do you deal with that when you have so many countries that deserve our time and our respect? So he decided he would pause it, start at 10 per cent for everybody, right? And let's go negotiate with all of these great countries and let's see if we can do great deals for America, much better deals for America, but that's the model.\"\n\n\n\n\n\nUnited States President Donald Trump has announced a 90-day pause on his so-called \"Liberation Day\" tariffs on all countries except China who remains subject to a tariff of 125 per cent.\n\n\n\n\n\nA universal 10 per cent tariff will still apply to all other countries throughout the period.\n\n\n\n\n\nAbout one-in-three Australian adults are collectors according to a report by eBay and Deloitte Access Economics.\n\n\n\n\n\nThe median Australian hobbyist has 50 collectables worth a total of $2200, based on a survey of 2000 collectors.\n\n\n\n\n\nExpanded to the entire population, the report estimates Australians own about 380 million collectables at a price tag of $16.8 billion.\n\n\n\n\n\nThe report says technological, economic and social change over the past 25 years have expanded people's access across the globe - with Australians spending a record of $69 billion on online shopping in 2024.\n\n\n\n\n\nCoins are the most popular collectable followed by toys, pre-loved fashion items, and antiques, while trading cards amount to some of the most expensive collectables on eBay.\n\n\n\n\n\nTo sport and in tennis,\n\n\n\n\n\n24-time grand slam champion Novak Djokovic has been knocked out of the Monte Carlo Masters with a 6-3, 6-4 loss to Chilean Alejandro Tabilo.\n\n\n\n\n\nThe defeat has ended the Serbian's quest for a 100th career title for the time being.\n\n\n\n\n\nAustralians Alex de Minaur and Alexei Popyrin fared better in the first major European clay-court event.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/nab-forecasts-a-double-rate-cut-in-may/pj5qiqywq",
    "title": "NAB predicts a double rate cut in May. How much would it save you?",
    "publish_date": "Thu, 10 Apr 2025 05:36:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Reserve Bank of Australia (RBA) will cut interest rates by 0.5 percentage points when its board next meets, National Australia Bank (NAB) predicts, as it forecasts a cash rate of 2.6 per cent by February next year.\n\n\n\n\n\nThe cash rate is currently at 4.10 per cent after the RBA's board made a 0.25 percentage point cut at its February meeting . It will next meet in May after leaving rates on hold in April .\n\n\n\n\n\nNAB's economics team also predicted standard 0.25 percentage point cuts in July, August, and November, stating that a restrictive policy stance from the RBA was \"no longer appropriate\".\n\n\n\n\n\nSally Auld, NAB chief economist, said: \"Headwinds from the global environment have intensified, but error bounds around our forecast are large given uncertainty remains exceptionally elevated.\"\n\n\n\n\n\n\"Our call for a 50bps (0.5 percentage points) easing in May reflects the fact that with the real cash rate of 1.3 per cent and policy currently restrictive, the RBA needs to play catch up,\" she said.\n\n\n\n\n\n\"Once the cash rate reaches a level more consistent with a neutral policy setting, we then expect the RBA to pause for a few months before taking the cash rate into modestly accommodative territory.\"\n\n\n\nNAB is predicting a double rate cut in May, with estimations that rates will lower to 2.60 per cent by February 2026. Source: SBS News\n\nCould Trump's tariffs lead to more RBA cuts?\n\nEarlier this month, the RBA left the cash rate unchanged at 4.10 per cent, denying borrowers back-to-back mortgage relief after its first cut since 2020 in February .\n\n\n\n\n\nBut after United States President Donald Trump implemented sweeping global tariffs, markets around the world witnessed their worst trading day since 2020, with trillions wiped off the market .\n\n\n\n\n\nThe economic uncertainty had some experts predicting rate cuts, while Trump's last-minute reversal could reduce the chances of a cut when the RBA meets again in mid-May.\n\n\n\nRBA governor Michele Bullock is expected to speak on Thursday evening for the first time since the economic turmoil.\n\n\n\n\n\nBullock previously noted the central bank was concerned that uncertainty over Trump's tariffs could lead to slower economic growth.\n\n\n\nWhat are other big banks predicting?\n\nANZ : Predicts three more cuts, taking the cash rate to 3.35 per cent by August.\n\nCBA: Predicts a cut each quarter, taking the cash rate to 3.35 per cent by the end of the year.\n\nWestpac: Predicts a cut each quarter, taking the cash rate to 3.35 per cent by the end of the year.\n\nNAB: Predicts five cuts (including a double in May), taking the cash rate to 2.60 per cent by February 2026.\n\nThe rest of the 'big four' banks are predicting the cash rate to reach 3.35 per cent by next February. Source: SBS News\n\nHow much could it save you?\n\nAccording to financial comparison site Canstar, a 0.5 percentage point cut would mean the monthly repayments on a $600,000 mortgage drop by $181.\n\n\n\n\n\nIf NAB's forecast were to come true, with five more cuts through to the first quarter of next year, then the total drop in monthly repayments could be an estimated $526.\n\n\n\nIf NAB's predicted cash rate comes to fruition, some households could save over $300 a month. Source: SBS News\n\n'Difficult' to see a double rate cut\n\nSally Tindall, data insights director at Canstar, said while a double rate cut couldn't be ruled out, it was unlikely.\n\n\n\n\n\n\"A cash rate cut in May is a live option on the back of an evolving global trade war and a double cut, while unlikely, can't be ruled out,\" she said.\n\n\n\n\"That said, it's difficult to see the data-driven RBA firing off a double cut when it next meets in May. The highly methodical central bank usually likes to take time to see how volatile events play out in the Australian economy,\" Tindall said.\n\n\n\n\n\n\"The RBA has previously said it would be hesitant to fire off rate cuts in quick succession; however, the reduction in the number of times the board meets could push it into making decisions earlier than it previously would.\"\n\n\n\n\n\nTindall encouraged Australians to keep a \"calm and level head\" despite rising economic uncertainty.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/article/virgin-australia-refunds-overcharged/j09v85z40",
    "title": "Virgin Australia to refund 61,000 customers it overcharged",
    "publish_date": "Thu, 10 Apr 2025 05:21:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tens of thousands of Virgin Australia customers are in line for refunds after the airline found a system error that overcharged travellers for years.\n\n\n\n\n\nSome 61,000 customers will get refunds averaging $55 for the error, which occurred between April 2020 and March 2025.\n\n\n\n\n\nThe airline said it had policies that determine what extra costs a customer will be charged when they make a change to their itinerary.\n\n\n\nREAD MORE Could paying Australians for travel frustrations drive up airfares?\n\nAffected customers being contacted\n\nAll those affected will be contacted by Virgin but will need to lodge a claim to receive their refund.\n\n\n\n\n\nThey will have a year to make a claim, with the airline committing to donate any unclaimed money to charity.\n\n\n\n\n\nVirgin has engaged the Australian Competition and Consumer Commission (ACCC) and will work with it on anything else necessary to make up for the error.\n\n\n\nWhat has Virgin said about the error?\n\n\"We recently found that in some instances … bookings were repriced in a way that does not align with our policy and we are refunding all impacted guests for that amount,\" a Virgin spokesperson said.\n\n\n\n\n\n\"We sincerely apologise to those affected guests and have launched [a program] under which all eligible guests are being proactively contacted to process their refunds.\"\n\n\n\nIn case you missed it\n\nVirgin Australia recently sold a 25 per cent stake in its business to Qatar Airways.\n\n\n\n\n\nThe ACCC ticked off a five-year partnership that's set to double flights between Australia and Doha.\n\n\n\n\n\nVirgin claimed the deal could be worth $3 billion to the national tourism economy across the period.\n\n\n\n\n\nThat approval came more than two years after the federal government rejected Qatar's application to run an extra 21 weekly flights into Australia, saying the change could cause problems for local carrier Qantas.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/abrupt-reversal-of-tariff-plans-by-president-trump/7kg2kml2b",
    "title": "Abrupt reversal of tariff plans by President Trump",
    "publish_date": "Thu, 10 Apr 2025 04:38:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt has been a week since Donald Trump upended the global trade system by announcing steep country-specific tariffs as high as 50 per cent for 57 nations.\n\n\n\n\n\nBut less than 24 hours after they came into effect, he used a post on social media to announce an abrupt reversal in policy: a 90-day pause on those tariffs, with a lower 10 per cent tariff to be applied as negotiations continue.\n\n\n\n\n\nThe announcement caught people by surprise, including the US Trade Representative Jamieson Greer, who was in the middle of a hearing [[before the House Ways and Means Committee]], facing questions from Democratic Representative Steven Horsford on the country's trade strategy.\n\n\n\n\n\nGreer: \"I understand it is 90 days. I haven't spoken to the President...\"\n\n\n\n\n\nHorsford: \"So the trade representative hasn't spoken to the President of the United States about a global reordering of trade.\"\n\n\n\n\n\nGreer: \"Yes, I have. I have just been in a meeting with you - \"\n\n\n\n\n\nHorsford: \"And yet he (Donald Trump) announced it on a tweet – WTF, who is in charge?\"\n\n\n\n\n\nGreer: \"The President of the United States is in charge.\"\n\n\n\n\n\nHorsford: \"And what do you know about those details?\"\n\n\n\n\n\nGreer: \"As I mentioned...\"\n\n\n\n\n\nHorsford: \"It looks like your boss just pulled the rug out from under you.”\n\n\n\n\n\nStock markets around the world rallied on the news of the tariff pause, with the S&P 500 posting its best day since October 2008. The Australian sharemarket soared as much as 6 per cent.\n\n\n\n\n\nIt marks a turn for the better for investors, after the most intense period of financial market volatility in five years, since the pandemic.\n\n\n\n\n\nClient portfolio manager at Zacks Investment Management, Brian Mulberry says it is a welcome correction.\n\n\n\n\n\n“And the best way I can summarise it is just the difference between certainty and uncertainty. When we have maximum tariff pressure for a maximum period of time, the range of outcomes on individual businesses as well as consumers starts to become less certain. That uncertainty creates the wall of worry. Are we in a growth scare? Are we facing a recession? There's so many possible outcomes, the negative sentiment pulls the value of the market down. With a 90-day pause in tariffs, now we only have to deal with basically a 10% baseline tariff. That creates a much more certain outcome in terms of the cost of goods, what trade will look like, and obviously much less of an impact on consumers.”\n\n\n\n\n\nAfter days of insisting he would not be backing down, President Trump admits what's called the market jitters - seen in the sustained volatility on financial markets - did play a big role in his decision-making.\n\n\n\n\n\n“People were jumping a little bit out of life. They were getting yippy, afraid. Look, nothing is over yet. But we have a tremendous amount of spirit from other countries including China. China wants to make a deal. They just don't know how quite to go about it. So there is one of those things - they're quite proud people.”\n\n\n\n\n\nThe only country to be excluded from the pause on tariffs is China.\n\n\n\n\n\nMr Trump says the tariff on imported Chinese goods will now be increased by a further 21 per cent - to 125 per cent, saying China has shown a \"lack of respect\" by responding to the US tariffs with a 84 per cent levy on US imports.\n\n\n\n\n\n“Sometimes you have to be able to go under the wall, around the wall - or over the wall. So I think in financial markets - because they change. Look at how much it changed today. It went from pretty moderate today. But over the last few days it looked pretty glum, to I guess, I say it was the biggest day in financial history. That is a pretty big change. And I think the word would be flexible. You have to be flexible.”\n\n\n\n\n\nWhether China will increase its tariffs even further - remains to be seen.\n\n\n\n\n\nChina has taken the toughest approach so far to the US tariffs, but a number of countries are evaluating their own responses and have promised more retaliation.\n\n\n\n\n\nThe European Union has approved tariffs to hit about A$38 billion (21 billion euros) of US goods in retaliation for the 25 per cent duties imposed by the US last month on the bloc's steel and aluminium exports.\n\n\n\n\n\nThe World Trade Organization says trade tensions between the world's two largest economies, the US and China, could lead to a long-term reduction in global real GDP by nearly 7 per cent.\n\n\n\n\n\nIt also says that could see the trade of goods between the two economies reduce by as much as 80 per cent.\n\n\n\n\n\nUS Treasury Secretary Scott Bessent says this is not economic warfare.\n\n\n\n\n\n“Well, I'm not calling it a trade war. But I am saying that China has escalated. And President Trump has responded very courageously to that. And we are going to work on a solution with our trading partners.”\n\n\n\n\n\nHe says it was Mr Trump's strategy all along to not have the tariffs as announced to be permanent, but rather create the opportunity for new trade negotiations.\n\n\n\n\n\n“This was driven by the President's strategy. He and I had a long talk on Sunday. And this was his strategy all along. You might even say that he goaded (provoked) China into a bad position. They have responded. They have shown themselves to the world to be the bad actor. And we are willing to co-operate with our allies and with our trading partners who did not retaliate.”\n\n\n\n\n\nThe Trump administration says the 90-day pause does not impact tariffs already imposed, such as those on steel and aluminium - and Mr Trump indicated there will be come to come on sectors like pharmaceuticals and lumbar.\n\n\n\n\n\nThe US tariff situation for Australia remains unchanged by the pause.\n\n\n\n\n\nA so-called baseline 10 per cent tariff came into effect at the weekend.\n\n\n\n\n\nAustralia's Deputy Prime Minister, Richard Marles, says the federal government is continuing to make the case to be exempt from the tariffs.\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-10-april-2025/1lifggk1z",
    "title": "SBS News in Easy English 10 April 2025",
    "publish_date": "Thu, 10 Apr 2025 04:09:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nDonald Trump’s decision to ease tariffs for most countries won’t directly affect Australia, but may open the door to further talks with the U-S.\n\n\n\n\n\nThe U-S president has lowered tariffs to 10 per cent for many nations for 90 days, while sharply increasing the rate on Chinese imports to 125 per cent.\n\n\n\n\n\nAustralia's tariff rate remains unchanged at 10 per cent, as set during the first week of the federal election campaign.\n\n\n\n\n\nAsked if the move would impact Australia, Deputy Prime Minister Richard Marles tells Channel Nine, it would not.\n\n\n\n\n\n“No, and nor does our policy. ... We would prefer there were no tariffs between Australia and the United States, and we’ll continue to make that case, but we're also going to build our own economic resilience and look for other markets, which is what we have been doing and that will be our focus.\"\n\n\n\n\n\nChina and the European Union have imposed new tariffs on US goods in response to steep tariffs introduced by President Donald Trump.\n\n\n\n\n\nChina raised its tariffs on U-S imports from 34 per cent to 84 per cent, shortly after the US slapped 104 per cent duties on Chinese products.\n\n\n\n\n\nThe EU followed suit, announcing 25 per cent tariffs on a range of U-S imports as part of its initial countermeasures.\n\n\n\n\n\nMore schoolchildren will be able to visit the Great Barrier Reef under a new $10 million Labor pledge, as Prime Minister Anthony Albanese takes his campaign to one of Australia’s most popular natural landmarks.\n\n\n\n\n\nOf the total funding, $6 million will go towards subsidising school excursions to the UNESCO World Heritage site.\n\n\n\n\n\n\"The Great Barrier Reef is a magnet for the world, and in order for it to be a magnet for the world who want to see a pristine environment, we need to be able to show that we're behaving responsibly and sustainably, and that is what we are doing. this reef programme that we're announcing today will provide six million dollars for Kids For the Reef, for young people who wouldn't get the opportunity otherwise, to see the reef first hand.\"\n\n\n\n\n\nThe United Nations says the Israeli military has blocked more than two-thirds of 170 humanitarian aid missions in Gaza since the ceasefire ended.\n\n\n\n\n\nIsrael has said it won't allow the entry of any goods and supplies into Gaza until Hamas releases all the remaining hostages.\n\n\n\n\n\nUN spokesman Stéphane Dujarric says the denials are preventing the U-N from carrying out critical lifesaving work.\n\n\n\n\n\n\"As we have warned repeatedly, there is no safe place in Gaza. And we've, as we've repeatedly said, civilians must be protected, whether they stay, whether they leave. Those fleeing the fighting must be allowed to do so safely, and they must be allowed to voluntarily return when the situation allows.\"\n\n\n\n\n\nDespite the worsening conditions, Mr Dujarric says aid partners have resumed services in northern Gaza, providing urgent case management, psychological first aid, and support for traumatised communities.\n\n\n\n\n\nAdelaide and Geelong will play at the Adelaide Oval tonight.\n\n\n\n\n\nThe Crows, aiming for their first finals appearance since 2017, come off a narrow one-point loss to the Suns, following three strong wins.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-share-market-trump-tariff-pause/zm2gdx0n7",
    "title": "Australian share market has biggest daily gain in five years after Trump tariff backflip",
    "publish_date": "Thu, 10 Apr 2025 04:06:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Australian share market has had its best day in five years after a backflip on tariffs by United States President Donald Trump helped return more than $119 billion to its top-500 stocks.\n\n\n\n\n\nOvernight, Trump announced a temporary lowering of tariffs his administration had placed on dozens of countries around the world, sending equities surging.\n\n\n\n\n\nThe S&P/ASX200 jumped 334.6 points, or 4.54 per cent, to 7709.6 while the broader All Ordinaries surged 352.2 points, or 4.66 per cent, to 7913.9.\n\n\n\n\n\nIt was the benchmark index's best performance since March 2020, when the COVID-19 global pandemic declaration hammered markets but made room for occasional relief bounces.\n\n\n\n\n\nAll local sectors traded higher on Thursday, with IT stocks up 7.6 per cent as financials, energy and materials stocks bounced more than 4, 5 and 6 per cent respectively.\n\n\n\n\n\nThe Australian dollar has recovered to 61.94 US cents, up from 59.97 on Wednesday at 5pm, after grinding about the 60 US cent level for most of the week.\n\n\n\nGlobal markets rally after Trump's about-face\n\nThe bounce came after a Wall Street rally in the US overnight, with the S&P500 surging 9.5 per cent higher, its best daily result since the global financial crisis in 2008, as the tech-heavy Nasdaq jumped 12.2 per cent.\n\n\n\n\n\nMeanwhile, Japan's Nikkei surged 8 per cent, and European futures shot up.\n\n\n\n\n\nREAD MORE How can trillions just disappear? What you may not know about the stock market\n\nHowever, a 10 per cent blanket duty on almost all US imports will remain in effect. Australia has not received a lowered tariff thanks to the temporary pause, as it was already set to have a 10 per cent tariff applied.\n\n\n\n\n\nThe U-turn is believed to be a response to dislocation in bond markets as yields surged and confidence in US treasuries began to falter.\n\n\n\n\n\nThe US excluded China from the break and instead increased tariffs on Chinese goods to 125 per cent, after China lifted its impost on US goods to 84 per cent from 34 per cent hours earlier.\n\n\n\nWhat are analysts saying about the rebound?\n\nJessica Amir, market analyst for trading firm Moomoo, said: \"Just like that, US President Donald Trump paused higher tariffs on most countries for 90 days and investors jumped back into stocks, gold and oil, selling out of bonds.\"\n\n\n\n\n\nTony Sycamore, analyst for trading platform IG Markets, said while Trump appeared willing to look through equity market losses, the overnight backflip showed \"the bond market remains the ultimate master of markets and politicians alike by virtue of its role as the 'plumbing' of the financial system\".\n\n\n\n",
    "source": "SBS",
    "cluster_id": 43
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/the-panthers-are-in-disarray-how-did-it-get-to-this-20250411-p5lqyf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Panthers are in disarray. How did it get to this?",
    "publish_date": "Fri, 11 Apr 2025 11:55:59 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "We’re into the sixth week of the NRL competition and Penrith still hasn’t won a match in Australia. Their fifth consecutive defeat has left them languishing near the bottom of the ladder, leaving their title defence in tatters.\n\nHow did it get to this? Here are five reasons why Penrith’s reign could be coming to an end.\n\nCleary can’t do it all on his own\n\nNathan Cleary has always been a step ahead of the opposition. At the moment, his teammates can’t keep up with him either.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/afl/the-four-players-essendon-should-trade-and-a-couple-they-should-chase-20250408-p5lq21.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The four players Essendon should trade, and a couple they should chase",
    "publish_date": "Fri, 11 Apr 2025 11:55:37 +1000",
    "category": "sports",
    "authors": [
      "Chris Pelchen"
    ],
    "text": "Anyone associated with Essendon should be disappointed. Frustrated. Angry. Essendon have talked the talk, sometimes even walked the walk, but all too briefly. Too often they have been flaky or flawed – not qualities we or they would associate with great Essendon teams of the past. Brad Scott was uncompromising as a player and is trying to get Essendon to play with a hard edge. Credit: AFL Photos The Bombers have lacked steel, strength, and conviction and that needs to change. Success is earned through hard work and commitment, through proper strategy and execution. Essendon does have a strategy; they have started a three-year plan. Brad Scott knows what success looks like – as a player at Brisbane he was part of one of the greatest teams in AFL history. His coach, Leigh Matthews, is one of game’s most pre-eminent figures. Both are strong, both unyielding.\n\nBut the Bombers’ three-year plan should be part of a six to eight-year plan that incorporates the arrival of Tasmania into the competition. A plan that builds upon their recent primary focus on the draft. Essendon have had 12 picks inside the first two rounds of the AFL National Draft since 2020. They have another four selections in the first two rounds this year. That position assumes even greater significance when considering the limited access to early draft\n\nselections caused by forthcoming concessions for the Tassie Devils. Like Richmond, Essendon have made the right decision to attack the draft now. Those who hesitate will suffer – like the clubs that didn’t suitably plan for recruiting concessions granted to Gold Coast\n\nand GWS from 2009-2012. Such decisions were pivotal to Hawthorn assembling a player list to compete in four consecutive grand finals from 2012-2015.\n\nEssendon’s strategy should be reviewed, analysed, executed then reviewed again. Its development isn’t linear. It requires careful planning, periodical change and honest appraisal. No individual coach, staff member or executive can be allowed to hijack the process – some disagreement is expected, even encouraged, but it’s critical that the coaching, player development, high performance and list management teams are aligned. The Bombers have young talent. With the fourth-youngest list in 2025, their age demographic is skewed towards the future. They are not starting another re-build, that undertaking was initiated\n\nmore than five years ago. Twenty list changes in the past two years have only accelerated the program. But it’s essential they don’t look at their players through a biased lens – coaches and recruiters often favour their preferred players when success demands the same standards apply to everyone.\n\nThey have the nucleus of a successful team – Andrew McGrath and Jordan Ridley in defence, Zach Merrett, Jye Caldwell and Sam Durham in the midfield plus Kyle Langford and Nate Caddy in attack provide a solid foundation for the future. But there are still too many players who show potential rather than consistent talent. Good one week, poor the next. Willing to follow rather than lead. Satisfied with playing at AFL level over being the best. Neither unflinching, uncompromising or unconditional. Zach Merrett leads Essendon onto the MCG. Credit: Getty Images More players need to become like their captain and coach – tough and relentless – strong leaders who view team success as their legacy. While 2025 is an important step along the way, Essendon must keep their focus on the bigger picture – they simply don’t have the right personnel to win a premiership just yet.\n\nSo where to from here? Two statistics from 2025 clearly point to immediate needs. First, kicking efficiency – ranked 16th in the competition. Second, hard ball gets – also ranked 16th. Zak Butters will be a restricted free agent in 2026, and is the type of elite player Essendon should look to recruit. Credit: Getty Images Both statistics have been integral to premiership teams over the past 20 years, so ignore them at\n\nyour peril. The Bombers need players who can hurt the opposition by foot and/or win contested\n\npossession under pressure. And players who can break lines with their disposal. Essendon have high draft selections to work a trade for specific players in 2025 – they should firmly set their sights on Zak Butters (Port Adelaide) and Harley Reid (West Coast) if they can be convinced to return to Victoria.\n\nTheir early draft picks should only be expended to secure players of this calibre or to maximise their\n\ndraft position in 2025-26. Loading The draft is likely to be compromised by the Tassie Devils from 2027 so recruiting the best available young players now is of even more importance. While 2025 does not offer the same depth of talent as last year, the draft window is closing, so selection value is going to become greater over the next two years. Similarly, the Bombers should look to trade players who don’t form part of their premiership model.\n\nThis doesn’t mean releasing players at any cost but being prepared to take a step back to go forward\n\nin the longer term. These choices are sometimes contentious, but it is often the difficult decisions\n\nthat bring the biggest rewards. Players to consider:\n\nSam Draper As a free agent in 2025, Essendon should look to move him to improve their draft currency via AFL compensation or initiate a trade to a club offering the most favourable return. Essendon could be richly rewarded if they were willing to offload Sam Draper. Credit: AFL Photos Nik Cox v Harrison Jones Both players possess ability but have struggled with injury. With multiple “talls” on the list, they will compete for a position in the same team. Retain one, move the other.\n\nDarcy Parish Loading Has been unlucky with injury but the development of Caldwell and Durham means he is better served at a club competing for a premiership in the short term. Peter Wright While he adds depth to their forward line, the Bombers should look to trade him while he still has limited currency. Not part of their premiership model.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/victoria/baby-mia-lived-for-only-eight-hours-her-parents-still-wonder-if-hospital-staff-could-have-saved-her-20250409-p5lqdy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Baby Mia lived for only eight hours. Her parents still wonder if hospital staff could have saved her",
    "publish_date": "Fri, 11 Apr 2025 11:48:45 +1000",
    "category": "lifestyle",
    "authors": [
      "Melissa Cunningham"
    ],
    "text": "The findings, while devastating, did not come as a shock to the Iskanders. “When it is your first pregnancy, you leave your care in the hands of experts. You trust them,” Danielle said. “But from day one we received very mixed and confusing messages from the hospital.” The Iskanders and Mia in hospital after the delivery. The couple remember being told Danielle required an emergency cesarean, but rather than being rushed to the operating theatre, all they remember is waiting. “We weren’t too stressed because we thought obviously if it was an emergency, they would rush me into surgery,” Danielle said.\n\nThe first inclination that something was seriously wrong would come when Stephen was sitting outside the operating theatre waiting to be brought in to hold his newborn daughter, and he heard a message blare over the PA system. “They were calling a neonatal code blue,” Stephen said, his voice cracking with emotion. “I’m seeing people running in, but nobody is telling me what’s going on.” The hours that followed Mia’s birth are a blur. They remember seeing Mia in a knitted beanie, wrapped in a blanket, with wires all over her tiny body, and taking photos of her to send to their family. The couple said they were not told the severity of the situation until an infant emergency team arrived to take the critically ill Mia to another hospital. “When they told us to prepare for the worst and say goodbye to Mia, we were just completely blindsided,” Danielle said. “There are no words to explain that moment.”\n\nMia died less than eight hours after she was born. An independent expert, senior obstetric clinician Jeremy Chin, examined the case and found Mia’s heart rate should have been treated as a red flag for “significant fetal compromise” that required immediate management. However, Chin found that while a quicker delivery may have seen Mia delivered in a less severe state of oxygen deprivation, she was suffering from a perinatal infection that was “ultimately overwhelming”. Danielle had been previously hospitalised and was receiving ongoing antibiotic treatment for a bacterial infection, which had progressed to an infection in the baby. The coroner found Danielle’s treatment by the hospital before the day of Mia’s delivery was reasonable and appropriate.\n\nThe official cause of Mia’s death was found to be complications of a uterine infection in the setting of premature pre-labour rupture of membranes. Northern Health management declined to comment when contacted by The Age. “As this matter is currently before the courts, we are unable to comment at this time,” a spokesperson said. The Iskanders said they were speaking out to prevent their tragedy from happening to another family. They also said a lack of mental health care and lack of support shown by the hospital after the ordeal further traumatised them.\n\nLoading “We were just left to deal with it all on our own,” Danielle said. “Every time we called the hospital they were like ‘why are you calling us? You’ve already had your baby?’ We would have to explain, yes, I had the baby, but the baby died.” They called for reform in the healthcare system after several other deaths of babies and children in Victorian hospitals. On July 1, last year, they gave birth to another daughter, Maddison.\n\n“It was bittersweet,” Danielle said. “We were so happy, but there is still so much grief about Mia.” Mia’s death is one of a number of hospital deaths of young children or babies being investigated by Victorian coroners. Last year, an inquest into the death of a 19-month-old Victorian toddler Noah Souvatzis in 2021 found his death was preventable. Noah died on December 30, 2021, from meningitis. The coroner found that the toddler was discharged after an inadequate review by an under-trained, junior locum doctor on his first shift. Latrobe Regional Hospital is also facing calls for an independent inquiry after it was revealed several patients, including infants, had died or experienced serious harm.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/business/companies/guardian-australia-had-a-12-year-dream-run-has-it-lost-its-edge-20250402-p5lojb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Guardian Australia had a 12-year dream run. Has it lost its edge?",
    "publish_date": "Fri, 11 Apr 2025 11:45:00 +1000",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "“Obviously, we’d prefer not to be going into an election campaign with vacancies in Canberra, but I think the Canberra team is really stepping up. I think they’re doing a really good job,” Taylor says. Former prime minister Malcolm Turnbull. Credit: Alex Ellinghausen Middleton replaced Katharine Murphy, who left her position as political editor last year to join the Prime Minister’s Office. Asked about the next steps for Guardian Australia, Taylor reaffirms a company policy not to discuss operational matters or anything related to the recent events in Canberra. Yet, in the 12 months since Murphy left, arguably, things in Canberra could not have gone worse. They included an independent HR investigation into claims and counterclaims within the team and a swift exodus of talent. (Four of its most senior reporters and its veteran photographer have left.)\n\nSix months after Middleton started as political editor, she filed an informal complaint against the company’s long-standing chief political correspondent, Paul Karp, who responded with a counter-complaint of bullying.\n\nTaylor was kept at arm’s length, considering she and Middleton were close friends of 35 years, having been cadets together at The Canberra Times and were former housemates. Former editor-in-chief of The Guardian, Alan Rusbridger. Credit: Paul Morigi The investigation involved interviews with Karp, Middleton and other staff, and delivered its findings in December. All involved were bound by strict confidentiality agreements. The investigation found Middleton’s bullying allegation against Karp could not be substantiated. Karp resigned soon after, and Middleton went on leave, where she remained until March when she and the organisation agreed on her exit. (In that tumultuous period, blogger and reporter Amy Remeikis joined the think tank, the Australia Institute, reporter Daniel Hurst moved to communications, and photographer Mike Bowers also departed.) It was a major decision to part ways with one of the most experienced press gallery journalists and biographer of the prime minister on the eve of a federal election, with incoming chief political correspondent Tom McIlroy to join only days before polling day.\n\nLoading Middleton and Karp did not respond to a series of questions. The situation punctuates a growing sentiment among journalists, many former and some current staff, that The Guardian has reached a point of maturity in Australia. It has succeeded where other international interlopers, such as BuzzFeed and HuffPost, have failed in breaking into Australia’s media establishment, but now, it is no longer the punchy upstart it was 12 years ago, for better or worse. Part of the early success matched experienced editors from The Guardian’s UK office with big-name local hires, says Rusbridger. It was a delicate balance between being the outsider and the disruptor, he says, but names such as Murphy and Taylor, alongside up-and-coming talent, helped, too. “That helped reassure readers it wasn’t some external transplant; it wasn’t outsiders parachuted in, it was people who had a local perspective.”\n\nSome have argued the exit of major characters associated with the brand (Turnbull still refers to Murphy as “Murpharoo”, for example) over a sustained period has led to a loss of its once-renowned edge, a contention Taylor doesn’t buy into. Loading “I think we’re growing a whole new generation of fantastic names for Australians,” says Taylor. “I think it would be really arrogant for a senior journalist to say, ‘no one will ever be a name like I was, or like my successor was’. We’ve got a whole new generation of fantastic journalists who are names already or who are going to be names.” Taylor’s confidence is backed up by several indicators of success. She is particularly pleased she proved former Fairfax boss Greg Hywood wrong when he told her on her departure there would only ever be two recognised news brands in Australia, alongside News Corp. Guardian Australia, which is published digitally in Australia, is one of the country’s top-read outlets, with a monthly audience of between 7 million and 8 million Australians. Its audience grew 9 per cent over the past two years, according to the February figures from ratings agency Ipsos, but was outpaced by international publishers The New York Times (up 12 per cent) and the BBC (29 per cent) across the same period. Albeit, those had more room for growth.\n\nIn 2024, Guardian Australia made a modest $1.3 million in profit, yet this isn’t a top priority for the not-for-profit trustee ownership. It remains free to access, urging its readers to pay on a voluntary basis, and has significantly grown its newsrooms and areas of coverage, Taylor says. “It is true, we’re bigger and much more influential now, and I think that’s a good thing,” Taylor says. “Being a start-up is exciting, but there’s not really anything romantic about trying to cover all the news in an ongoing way with a handful of reporters.” Former Guardian Australia journalists Karen Middleton and Paul Karp. One criticism levelled by current and former staff is a legendarily low appetite for legally tricky stories which, they say, means it has lost some of its bite over the years. It’s a contention Taylor, unsurprisingly, disagrees with. “I think we are still breaking a lot of news. We still do hard-hitting analysis and opinion, and we’ve added a lot of investigative clout to that as well,” Taylor says.\n\n“I think any publisher in Australia is aware of how our defamation laws work, so you need to be calculated and deliberate in the risks that you take, but we’re not shy of taking risks if the story is in the public interest and worth it.” Despite the commentary and exits, there is no need to reinvent the wheel or the mindset at Guardian Australia, says Taylor. Loading “I think we are still distinctive in the same way that we were then, in that we are progressive. We look at the world through a progressive lens. That doesn’t mean that we’re partisan. We always follow the facts, but we look at things with the view that Australia and the world can change to be better and fairer. “The sort of essence of The Guardian is here as it’s always been.”\n\nOne senior News Corp editor, who requested anonymity to comment freely, affirms the outlet as a “professional” news outfit. “But the point to make is that all media organisations today define themselves and their business model according to a political slant.” This applies to both The Guardian and The Australian, they say, which has led to an increasingly polarised electorate. “Media organisations don’t want to admit that. It’d be helpful if they did.” Taylor’s own role as editor has been the subject of speculation for some time, given she is now Australia’s longest-serving editor after The Australian Financial Review’s Michael Stutchbury stood down in mid-2024. Staff constantly speculate she is in line for a move to the UK head office or to take up an editorial role at the ABC, neither of which are happening, Taylor says.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/ange-says-the-football-gods-won-t-save-him-but-he-still-has-a-pulse-at-spurs-20250411-p5lqyo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ange says the ‘football gods’ won’t save him, but he still has a pulse at Spurs",
    "publish_date": "Fri, 11 Apr 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "There’s no getting away from it: it’s been an awful season. They’re 14th in the Premier League with 16 defeats in 31 games so far, the most they’ve suffered in a single campaign for more than two decades.\n\nAngeball is not dead. Not yet. Worst-case scenario, this project has exactly one week to live, assuming we believe the talk that Postecoglou’s future in North London depends entirely upon winning the Europa League.\n\nThe English media might be openly speculating about Ange Postecoglou’s replacement, and it might be that at least half of the Tottenham Hotspur fanbase is counting down the seconds until the club posts a generic social media graphic and the words ‘Club Statement: Ange Postecoglou’ on its official channels, and there might be a priest in the room, holding a bible, ready to go - but there is still a pulse.\n\nInjuries explain it - at one stage they were missing a dozen key first-team players, and had zero centre-backs available for weeks on end - but only to a point. All their big stars have returned over the past few weeks, but they have generally stunk it up. Patience has run out, and something resembling psychological warfare has broken out between the manager and the supporters.\n\nThere have been shades of 2017 about Postecoglou’s prickly demeanour of late. That was his last year with the Socceroos, when he walked out on the Australian game just six months before the World Cup, having realised he alone couldn’t ‘fix’ it. He admitted he had become worn down and didn’t like who he’d become.\n\nAnge Postecoglou - celebrating, not praying. Credit: Getty Images\n\nIt’s a bit similar now. He doesn’t look happy. His contempt for certain journalists in the Spurs press pack is no longer concealed, and he can’t help but snap back at the fans who taunt him during and after games. Last week, after the away fans at Chelsea chanted “You don’t know what you’re doing” when he took off Lucas Bergvall for Pape Matar Sarr, he cupped his ears in their general direction when Sarr scored shortly afterwards. The goal was then disallowed. He tried to explain later that he just wanted to hear the fans supporting the team, but nobody believed him.\n\nIt was, as they say, Spursy behaviour. He’s supposed to be the antidote, but it’s infecting him.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/blinded-to-what-i-had-i-spent-a-mad-day-stalking-my-younger-hotter-self-20250410-p5lqu5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Blinded to what I had, I spent a mad day stalking my younger, hotter self",
    "publish_date": "Fri, 11 Apr 2025 11:31:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "When the rogue dumper slammed my gasping, half-dacked husband on the Thailand beach in 2018, he took a while to regroup. From the safety of his towel, he scanned for a second Poseidon Adventure-style wave and then for the roving ice cream seller to take the sting off near-death.\n\nToo rattled to read, Chris started watching a nearby couple. I did too. Late 20s, arguably the best-looking pair I’d ever seen in real life. And I’ve been in the same room as Chris Hemsworth and Elsa Pataky.\n\nIt’s easy to become absorbed in the lives of beautiful people like Elsa Pataky and Chris Hemsworth. Credit: Chris Pizzello/Invision/AP\n\nThey were so beautiful Chris wondered if he’d actually died and these glorious people were his eternal heavenly reward. But they were real. We ate watermelon ice creams, checked them out. The guy wore only faded boardies – think Robert Irwin’s thirst trap photos – but somehow ... glowing. His girlfriend looked like a French film star crossed with the Caramel Big M girl.\n\nJust when we were discussing adopting them, they left. “Grab your stuff – we’re following them.” Chris was dubious. “Darling, perving’s one thing. Stalking – really?”",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/politics/federal/copied-from-america-dutton-launches-election-fight-over-evs-20250402-p5loib.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Copied from America’: Dutton launches election fight over EVs",
    "publish_date": "Fri, 11 Apr 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Mike Foley"
    ],
    "text": "Follow our live coverage of the 2025 Federal election here.\n\nThe Coalition’s pledge to scrap fines for carmakers that exceed emissions caps imposed by Labor has raised concerns about new barriers to the influx of cheap EV models and entrenching petrol guzzlers that cost more to run.\n\nCoalition leader Peter Dutton has said that the penalties for carmakers under the Albanese government’s New Vehicle Efficiency Standard would spike the price of popular models, including that of the Toyota RAV4, which he said would increase by $9700.\n\nPeter Dutton spruiking his fuel excise policy on Thursday. Credit: James Brickwood\n\nEnergy Minister Chris Bowen rejected this claim and said every developed economy has implemented vehicle efficiency standards, which had not caused car prices to rise in any jurisdiction.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/afl/what-we-re-paid-to-do-how-jezza-danger-turned-game-for-cats-after-pep-talk-20250411-p5lqzd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Smith gave Crows fan the bird, now the AFL’s investigating; Danger reveals Jezza’s pep talk",
    "publish_date": "Fri, 11 Apr 2025 11:13:35 +1000",
    "category": "sports",
    "authors": [
      "Andrew Wu",
      "Peter Ryan"
    ],
    "text": "Loading\n\nGeelong’s star recruit Bailey Smith is set to come under scrutiny from the AFL for making an offensive gesture to the crowd after the Cats’ stirring victory over Adelaide on Thursday night.\n\nFootage has emerged on social media of Smith flipping a double bird to a fan as he and his teammates left Adelaide Oval after the opening match of Gather Round.\n\nThe AFL will look at the incident on Friday, according to a source with direct knowledge of the matter.\n\nSmith can be seen high-fiving a supporter leaning over the race before responding to another fan, wearing a Crows scarf and club polo, and raising both middle fingers.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/goodfood/perth-eating-out/is-perth-s-best-mexican-ish-cooking-found-in-a-european-ish-wine-bar-20250411-p5lr0t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Is Perth’s best Mexican(ish) cooking found in a European(ish) wine bar?",
    "publish_date": "Fri, 11 Apr 2025 11:11:52 +1000",
    "category": "finance",
    "authors": [
      "Max Veenhuyzen"
    ],
    "text": "Advertisement\n\nReview Eating outMount Hawthorn Is Perth’s best Mexican(ish) cooking found in a European(ish) wine bar? A subtle shift in direction makes an inner-city favourite even more compelling. Pass the mezcal. Max Veenhuyzen April 11, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 6 The brooding mole poblano. Matt O’Donohue 2 / 6 Mayan-influenced pumpkin seed dip with focaccia. Matt O’Donohue 3 / 6 Casa in Mt Hawthorn. Matt O’Donohue 4 / 6 Casa in Mt Hawthorn. Matt O’Donohue 5 / 6 Casa in Mt Hawthorn. Matt O’Donohue 6 / 6 Casa in Mt Hawthorn. Matt O’Donohue Previous Slide Next Slide Good Food hat 15.5 / 20 How we score Mexican$$$$ Consider, for a moment, the evolution of the wine bar in Australia. Previously\n\navailable in just four flavours – French, Italian and Spanish, plus a broadly\n\n“European” catch-all – wine bars have significantly broadened their horizons over the past decade. In Melbourne, there’s Manze: a Mauritian wine bar that taps into the diverse island heritage of co-owner Nagesh Seethiah. The enduring popularity of Brisbane’s Snack Man, meanwhile, is a reminder that lo-fi wines can do things for Asian food that tea can only dream of. (See also the Taiwanese-inspired cooking at Muni in McLaren Vale, South Australia: one of my standout meals of 2024.) Following the recent discovery of a maverick inner-city wine bar serving bold, brilliant Mexican cookery, Perth has entered the genre’s DEI chat. Sort of.\n\nAdvertisement\n\nNew-era Mexican cooking for the discerning (wine) drinker. Matt O’Donohue I say sort-of because the food at Casa, the Mount Hawthorn wine bar in question,\n\ndoesn’t just hang its hat on cocina Mexicana. Italy, for one, forms a healthy chunk of its playbook: think thick shoelaces of tonnarelli pasta and tiny mopheads of crab meat bound in a lurid jalapeno butter. Toast graffitied with fat squiggles of chicken liver parfait is typical of the bistro cooking that might appear while the menu occasionally dabbles in retro throwbacks (hello prawn cocktail lettuce cups). I also say sort-of because, according to Casa chef Paul Bentley, his cooking isn’t\n\nwhat he’d describe as Mexican food. Or at least Mexican food made by someone\n\nwith an intrinsic understanding of the cuisine and culture. “I didn’t grow up with an abuela [grandmother] cooking birria [a classic Mexican goat stew] on the weekends,” says Bentley. What our man did do, though, was spend a decade working in Mexico where, among other things, he opened Magno Brasserie – a distillation of everything he learned under legendary Perth chef Alain Fabregues at The Loose Box and Daniel Boulud of New York’s French powerhouse Daniel – operated ramen bars, plus ran a string of bakeries. (So that’s why Casa’s pillowy focaccia and the dough at its pizzeria spin-off are both so good! The peso drops.) The other thing Bentley did in Mexico was eat plenty of Mexican food, from the fancy to the street. So much so that when COVID lockdowns stranded our man in Perth, he brought his understanding of spice and acidity to the food he was cooking at Si Paradiso – the tepache (fermented pineapple juice) he’d slip onto pizzas, say – as well as Scarborough’s goodtime beachside cantina, El Grotto.\n\nAdvertisement\n\nSo when Bentley and fellow Casa partners Cale Mason and Sydney-based chef\n\nEnrico Tomelleri of Darlinghurst’s magnetic Paski Sopra opened Casa in 2021, it felt inevitable that Mexican influences would seep into that menu too. That octopus would be cooked al pastor taco style and laid across toast. (No longer on the menu, alas.) That a herbal Mayan-influenced pumpkin seed dip would partner said focaccia, and that those pepitas would also be turned into a salsa for grilled cabbage, charry from the grill. Both, thankfully, are still on the menu, as are more recent creations a la skewers of juicy lamb rump brightened by a sauce bright with barbacoa spice. A new kind of wine bar. Matt O’Donohue But for the new-new stuff, it’s all about the $79 chef’s menu. Once an outlet for\n\nBentley’s classically minded French cooking, the set-course option is now a four-\n\nstage meal comprised largely of off-menu items sporting a strong Mexican flavour. Sometimes the influence is subtle: the zip of pickled cactus in the flank steak tartare, maybe, or casting crunchy tostadas as ideal vehicles for highlighting the silken pleasures of pristine cured bonito.\n\nAdvertisement\n\nOther times though, the accent comes through loud and clear. That would be the\n\nbrooding mole poblano – a rich, slow-cooked fantasy of dark chocolate, dried fruit and a supermarket aisle’s worth of spice – pooled underfoot rosy, dry-aged Wagin duck breast. The bird’s legs, meanwhile, form the filling for dainty flautas: rolled-up, fried tacos that are even more fun to eat than they sound. (The tortillas for the flautas and tostada, incidentally, are made locally by the nixtamalized corn whisperers at La Tortilla.) Good Food hat 15.5 / 20 Review This French bistro is a masterclass in knowing when to follow and when to flout the rules For anyone that’s been stung by tasting menus that feel lazy, underdone or\n\noffer questionable bang-for-buck, Casa’s offering may help restore your faith in the format. Not that committing to a (somewhat restaurant-y) menu is mandatory for enjoying yourself here. Like any self-respecting wine bar, Casa has a welcoming, third-place charm that makes it feel like an extension of home, even if those rendered walls, mid-century accents and finely tuned speakers make it feel like the living room of an especially well-designed holiday home in Milan. You can push the boat out, even on a weeknight, or drop in a bowl of chips with green Goddess sauce or a scoop of pistachio gelato: switched-on and engaged staff will make you feel welcome, regardless.\n\nAdvertisement\n\nOf course, Casa isn’t the first place to have thought of serving tacos alongside vino. While not explicitly wine bars, establishments such as El Publico and La Cholita helped expose Perth eaters to Mexican food-and-drink matches beyond Coronas and bottles of tequila with worms in them. The joys of eating jarred salsa and packet corn chips on the couch are near universal, not least with bottles of juicy pinot noir, Yellowglen and the remote in easy reach. Thanks to the ubiquitousness of Old El Paso et al, you and I can enjoy such Tex-Mex pleasures without having to leave the house. But for Mexican-ish cooking of a higher calibre – and plenty more besides –\n\nwe’ll have to go to Casa. The low-down Vibe: New-era Mexican cooking for the discerning (wine) drinker Go-to dish: Charred bonito tostada, focaccia with pumpkin seed dip Drinks: One of Australia’s finest explorations of organic winemaking supplemented with thoughtfully chosen beers, spirits and cocktails Cost: About $150 for two, excluding drinks Five WA food and drink events to put into your autumn calendar Beloved Margaret River eatery to close\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/afl/roo-coup-ldu-shuns-free-agency-offers-to-sign-long-term-deal-with-north-20250411-p5lr0n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Roo coup: LDU shuns free agency offers to sign long-term deal with North",
    "publish_date": "Fri, 11 Apr 2025 11:02:17 +1000",
    "category": "sports",
    "authors": [
      "Sam Mcclure"
    ],
    "text": "North Melbourne midfielder Luke Davies-Uniacke has shunned huge offers from rival clubs to commit to the Roos for the rest of his career.\n\nThe 25-year-old, who was out of contract and set to become one of the game’s most in demand free agents, has signed a seven-year contract extension that will keep him at Arden Street until the end of 2032.\n\nNorth’s Luke Davies-Uniacke gets a handball away despite being tackled by Hawthorn’s Mabior Chol. Credit: AFL Photos via Getty Images\n\nCollingwood, Geelong and St Kilda will all be disappointed with Davies-Uniacke’s re-signing, with all three clubs showing interest in the star midfielder, who won his first best and fairest last season.\n\nHis commitment to North Melbourne is a significant fillip for the club when you consider the No.4 draft pick from 2017 has only played in 22 wins out of 112 games.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/politics/federal/coalition-to-pay-public-servants-to-leave-in-redundancy-scheme-20250411-p5lqz6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Coalition to pay public servants to leave in redundancy scheme",
    "publish_date": "Fri, 11 Apr 2025 10:59:48 +1000",
    "category": "finance",
    "authors": [
      "Natassia Chrysanthos"
    ],
    "text": "A Coalition government would offer voluntary redundancies to public servants to speed up its plan for reducing headcount in the bureaucracy, party spokesman James Paterson revealed for the first time on Friday morning.\n\nThe latest tweak to the opposition’s public service policy comes days after it walked away from its plan to cut 41,000 jobs and instead said the Coalition would rely on natural attrition and a hiring freeze to achieve an eventual $7 billion a year in savings.\n\nCoalition campaign spokesman James Paterson said public servants could get payouts to leave. Credit: Alex Ellinghausen\n\nThose savings are core to the Coalition’s plan for managing the federal budget and paying for spending promised during the election campaign, such as more than $9 billion for Medicare, but the opposition has been pressured over detail.\n\nIntroducing voluntary redundancies would allow the Coalition to target areas of waste and bring down numbers faster, but will also saddle the government with the cost of payouts to public servants. Paterson did not specify how many redundancies would be offered nor to what parts of the public service.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/volk-opponent-separated-from-other-fighter-20250411-p5lr0z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Volk opponent separated from other fighter",
    "publish_date": "Fri, 11 Apr 2025 10:55:35 +1000",
    "category": "sports",
    "authors": [],
    "text": "Volk opponent separated from other fighter\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://au.news.yahoo.com/aussie-shoppers-shocked-as-hundreds-of-birds-die-in-front-of-apple-store-072447798.html",
    "title": "Aussie shoppers shocked as 'hundreds' of birds die in front of Apple store",
    "publish_date": "2025-04-10T07:24:47Z",
    "category": "finance",
    "authors": [
      "Authorities Had Considered Birds A 'Shining Case' Of Wildlife In A City"
    ],
    "text": "Inside, the store was continuing to sell iPhones and Macbooks, but out on the street there was carnage as migratory tree martins flew into the window.\n\nWitnesses watched as dozens of tree martins flew into Apple's Adelaide storefront on Wednesday night. They estimate hundreds have struck glass over the last week. Source: Supplied\n\nA brightly-lit Australian Apple store selling iPhones and Macbooks has become the location of nightly carnage involving native wildlife that's leaving shoppers shocked. As flocks of migratory tree martins “plummet” from high in the sky to roost in trees at dusk, dozens are missing their mark and instead faceplanting hard into the brightly lit shopfront.\n\nFor over a decade, around 10,000 migratory tree martins have flocked to Leigh Street, one of Adelaide’s most popular cafe strips. While their presence has delighted bird lovers, the city council has been less than impressed, claiming droppings from the “problem” birds are a “serious risk to public hygiene”, and so it netted their trees to drive them away.\n\nBut the decision created an entirely new “problem” for the birds after they arrived from the tropical north this season. Unable to roost in their preferred habitat, they’ve been forced to an even busier location, Rundle Mall. The birds spend their days high in the sky, catching insects, then fly down to roost in large groups as fast as they can to avoid predators like peregrine falcons.\n\nLocal rescuer Rachel is one of a handful of volunteers who have begun standing in front of the Apple store to collect the dead and dying tree martins. She estimates 30 are dying every evening and morning as the birds disperse. As they started coming into care around the city a week ago, she fears hundreds have already collided with the windows around Rundle Mall.\n\nADVERTISEMENT\n\n“It’s a lot of birds. They come down fast and don’t see the windows. I feel traumatised, disgusted and really upset,” she told Yahoo News.\n\nRelated: New York City map reveals horrifying bird strike statistic\n\nAnother rescuer named Alyia watched on as dozens of shoppers excitedly gathered on the street to watch the birds fly into the nearby trees, but the mood changed after they began to hit the glass.\n\n\"People were there filming in amazement at the sheer amount of birds, but they quickly dispersed after the birds started hitting the windows. They stopped filming and walked off because it was horrific,\" she told Yahoo News.\n\n\"I saw two birds nearly stepped on. I screamed at one guy to stop him, because he didn't realise what he was about to do. And he looked back in absolute shock.\"\n\nShoppers shocked by bird carnage in front of Apple store\n\nExtensive video shot on Wednesday night shows the store closing for the day as the birds strike the glass. Passing shoppers appear stunned, and some rush to help as the carnage unfolds. Rescuers do their best to collect the birds and assess them for damage. \"This is as horrible as I thought it would be,\" one says. \"This is actually breaking my heart,\" another later adds.\n\nADVERTISEMENT\n\nSome birds die immediately, others need to be euthanised, a handful go into care with trained rescuers, a lucky few fly away, but the fate of others is unknown. “Some were hitting the windows and falling onto roofs and we couldn’t get to them, others were able to fly off again,” Rachel explained.\n\nUS-based Apple has dimmed storefront lights in its home country to lessen its impact on migratory birds. But Rachel claims her pleas to the company’s management in the Adelaide store have fallen on deaf ears. Apple did not immediately respond to a request for comment from Yahoo, so it remains unclear what it will do to mitigate the problem tonight.\n\nThe situation in Adelaide is believed to have been occurring for at least five days, and rescuers estimate hundreds of birds may have been affected. On Thursday, Adelaide’s City Council told Yahoo News it has been “discussing” ways to respond to the problem.\n\n“The City of Adelaide became aware of increasing bird strikes against windows within Rundle Mall in the past week. We have been discussing mitigation measures with retailers, including trialling new lighting,” it said in a statement.\n\n“The situation is being closely monitored by City of Adelaide staff and government environmental agencies.”\n\nADVERTISEMENT\n\nSome birds have died instantly, while others were taken into care. Source: SA Native Animal Rescue\n\nBird expert 'saddened' by Adelaide bird deaths\n\nBirdlife Australia’s Sean Dooley told Yahoo News news of the carnage had left him “quiet sad”. “It’s so rare to have such good numbers of a native species using a dense urban setting as a roosting site. It’s very unusual,” he said.\n\nCollisions with windows are common in the United States, particularly in Chicago and New York City where large building have been built in the middle of migratory pathways birds have used for thousands of years. But in Australia, most native birds are territorial, and so window strikes are less of a problem.\n\nBright storefronts confuse birds, particularly when its reflective. “They don’t see the windows as as a solid object, they just see sky, so they continue to fly,” Dooley said.\n\nADVERTISEMENT\n\nIn the evening, lights inside stores can disorientate birds, preventing them from understanding where they are spatially in relation to the moon.\n\n“The more buildings are lit up, the more likely birds are to blunder into them,” Dooley added.\n\nThe birds were forced to relocate after the City of Adelaide placed nets on their traditional roosting trees. Source: Supplied\n\nAuthorities had considered birds a 'shining case' of wildlife in a city\n\nGreen Adelaide, an urban sustainability group run by the state government, confirmed it was aware of the “recent challenges” faced by tree martins flocking to Rundle Mall which are caused by “reflections in business windows”.\n\n“We are deeply saddened by the resulting injuries and fatalities for the species. We consider Adelaide’s tree martins a shining case for how our city can be wild,” a spokesperson said in a statement.\n\n“We are actively engaged in discussions with the City of Adelaide and welcome collaborative opportunities to enhance welfare outcomes for these birds.”\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
    "source": "Yahoo",
    "cluster_id": 44
  }
]