[
    {
        "url": "https://www.9news.com.au/world/elon-musk-leaves-donald-trump-white-house-doge-body/8cd046ca-f458-4955-b2de-8619d96d5357",
        "title": "Elon Musk confirms departure from Trump's White House",
        "publish_date": "Thu, 29 May 2025 01:04:59 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "E﻿lon Musk has confirmed the end of his tenure in the Trump White House after a turbulent effort to slash government jobs and spending.\n\nThe richest man in the world headed up the Department of Government Efficiency (DOGE) from the start of the second Trump administration, vowing to cut $1 trillion in public spending.\n\nHowever, critics said his efforts to do so only hampered the role of government and left crucial departments dangerously under-resourced, while Musk also reportedly clashed with other administration members.\n\n﻿ Recently, Musk said he would be reducing his political spending and stepping back from the role, as the value and brand of his company Tesla plummeted around the world and in the US.\n\nMusk took to his social media site, X, to say his \"scheduled time\" as a special government employee had come to an end.\n\nHe said DOGE would stay active despite his departure.﻿\n\nAlthough it's been claimed as a pre-planned departure, the change comes ﻿after Musk, initially an extremely prominent figure in Trump's return to the Oval Office, became increasingly sidelined, and parted company with the president on a number of economic issues.\n\nElon Musk with Donald Trump in the Oval Office. (AP)\n\nMost recently, he criticised the legislation dubbed by Trump as \"the big, beautiful bill\" , which critics claim will increase the burden on poorer and working-class Americans, while giving tax cuts to the rich.\n\nMusk said he was \"disappointed\" in the bill and that it was a case of major over-spending that would undermine the work of DOGE.﻿\n\nThe multi-billionaire has also not been fully onboard with Trump's wide-ranging tariff impositions in recent months﻿, calling presidential trade adviser Peter Navarro \"dumber than a sack of bricks\".\n\nUS House Speaker Mike Johnson thanked Musk for his work in the administration and pledged that the Republican-majority Congress would continue to cut spending based on DOGE's findings.\n\nREAD MORE: The top ten richest people in Australia\n\nMusk during a Trump campaign rally in October 2024. (AP)\n\nMusk in the White House\n\nIf this truly is a scheduled departure, with Musk quietly departing as was planned all along after 130 days, it could be considered a triumph.\n\nTrump's first presidential term was notorious for rapid-swing hirings and firings by presidential edict, most famously in Anthony Scaramucci's bombastic 11-day tenure as White House Communications Director. ﻿\n\nBut so far, Trump's second presidential term has been marked by a greater tendency to pick-and-stick, even in the face of mounting establishment criticism of figures such as Defence Secretary Pete Hegseth.﻿\n\nMusk wields a chainsaw onstage, celebrating the slashing of thousands of government jobs. (Nine)\n\nMusk was omnipresent during Trump's time as president-elect, reportedly staying with him at Mar-a-Lago﻿ and even joining phone calls with world leaders.\n\nHe was also often at Trump's side when the Republican returned to the White House post-inauguration, with the president even partaking in a display of Musk's Tesla cars on the White House lawn.\n\nTrump's endorsement of DOGE, which despite the acronym was not a government department nor seemingly accountable to any process, kept Musk prominent as he set about slashing government jobs and programs.\n\nAs well as rapidly becoming unpopular around the US, many of Musk's cuts triggered legal fightbacks that remain entangled in the courts.﻿\n\nCelebrity Trump supporters now turning on the US president View Gallery\n\nMusk, who until recent years was publicly Democrat-leaning, came on board Trump's 2024 presidential campaign with a US$250 million ($389 million) donation﻿ and a major social media force in the form of his online platform X.\n\nIt guaranteed him a place in the sun, but in recent months and weeks he has dropped further into the periphery of the administration, particularly as the Trump administration's focus became international in the form of trade wars, and actual wars in Gaza and Ukraine.\n\nMusk's own plummeting popularity had also been considered a factor in the rapidly falling value of his electric car company Tesla, and he recently indicated he would cut back on political spending, saying, \"I think I've done enough.\n\nHe also admitted to the Washington Post that he had fallen short of his goal of slashing US$1 trillion from the federal budget.\n\n\"The federal bureaucracy situation is much worse than I realised,\" he said.\n\n\"I thought there were problems, but it sure is an uphill battle trying to improve things in DC, to say the least.\"﻿﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/donald-trump-tariffs-blocked-by-us-court/00a4da32-9b8a-4b2c-93e3-d060242e3d94",
        "title": "US federal court blocks Trump's sweeping tariffs",
        "publish_date": "Thu, 29 May 2025 00:13:20 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "A US federal trade court has blocked President Donald Trump from imposing sweeping tariffs on imports under an emergency-powers law.\n\nThe ruling from a three-judge panel on Wednesday (Thursday AEST) came after several lawsuits arguing Trump has exceeded his authority, left US trade policy dependent on his whims and unleashed economic chaos.\n\nAt least seven lawsuits are challenging the levies, the centrepiece of Trump's trade policy.\n\nWho will pay the price for Donald Trump's escalating trade war? (Nine)\n\nTariffs must typically be approved by Congress, but Trump says he has the power to act because the country's trade deficits amount to a national emergency.\n\n\"The Worldwide and Retaliatory Tariff Orders exceed any authority granted to the President by IEEPA to regulate importation by means of tariffs,\" the court wrote, referring to the 1977 International Emergency Economic Powers Act.\n\nThe White House did not immediately respond to a message seeking comment.\n\nThe Trump administration is expected to appeal.\n\nThe plaintiffs argued that the emergency powers law does not authorise the use of tariffs, and even if it did, the trade deficit does not meet the law's requirement that an emergency be triggered only by an \"unusual and extraordinary threat\".\n\nThe US has run a trade deficit with the rest of the world for 49 consecutive years.\n\nTrump imposed tariffs on most of the countries in the world, including Australia, in an effort to reverse America's massive and longstanding trade deficits.\n\nHe earlier plastered levies on imports from Canada, China and Mexico to combat the illegal flow of immigrants and the synthetic opioids across the US border.\n\nREAD MORE: Trump administration orders some US software companies to halt sales to China\n\nChina was hit with some of the toughest US tariffs. (AP)\n\nHis administration argues that courts approved then-president Richard Nixon's emergency use of tariffs in 1971, and that only Congress, and not the courts, can determine the \"political\" question of whether the president's rationale for declaring an emergency complies with the law.\n\nTrump's Liberation Day tariffs shook global financial markets and led many economists to downgrade the outlook for US economic growth.\n\nSo far, though, the tariffs appear to have had little impact on the world's largest economy.\n\nThe lawsuit was filed by a group of small businesses, including a wine importer, V.O.S. Selections, whose owner has said the tariffs are having a major impact and his company may not survive.\n\nA dozen US states also filed suit, led by Oregon.\n\n\"This ruling reaffirms that our laws matter, and that trade decisions can't be made on the president's whim,\" Attorney-General Dan Rayfield said.\n\nPresident lashes reports of 'TACO acronym' used among traders\n\n﻿There's a new type of trade taking hold on Wall Street: TACO, short for Trump Always Chickens Out.\n\nIn other words, don't fret too much about Trump's latest tariff threat and go on a selling spree, because eventually he'll back down and a relief rally will ensue.\n\nTrump said he first learned of the term, coined by Financial Times commentator Robert Armstrong, on Wednesday when a reporter sought his reaction to it.\n\n\"I chicken out? Oh, I've never heard that. You mean because I reduced China from 145 per cent that I set down to 100 and then to another number?\" Trump said, referring to tariff rates he imposed on imported Chinese goods.\n\nREAD MORE: China mission lifts off to two unusual space objects never observed before\n\nPresident Donald Trump speaks in the Oval Office of the White House, Tuesday, May20, 2025, in Washington. (AP Photo/Alex Brandon) (AP)\n\nThe rate is now 30 per cent, after Trump raised it as high as 145 per cent last month, much to investors' dismay, only to reduce it a few weeks later.\n\nLast week, Trump threatened to impose 50 per cent tariffs on goods from the European Union come June 1.\n\nStocks turned lower after his threat, which he doubled down on later in the day, claiming there was no room to negotiate.\n\nTwo days later, he said he'd wait until July 9 to levy a 50 per cent tariff on EU goods following promising talks.\n\nWhen US markets reopened after Memorial Day, stocks closed well in the green.\n\nTrump said he was willing to delay the move because EU counterparts called him up saying, \"Please, let's meet right now.\"\n\nUS President Donald Trump shows documents as he meets South Africa's President Cyril Ramaphosa in the Oval Office of the White House, Wednesday, May 21, 2025, in Washington. (AP Photo/Evan Vucci)\n\n﻿\"You call that chickening out?\" Trump responded to a reporter at an Oval Office event overnight, referring to his recent announcements on EU and Chinese tariff rates.\n\n\"It's called negotiation,\" Trump added, saying that part of his tactic can include setting \"a ridiculous high number\" for tariff rates and going down if he gets other nations to give in to his demands.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/victorias-secret-takes-down-its-website-after-a-security-incident/cfd6824e-d084-4ca3-8677-6e33c93c3593",
        "title": "Victoria's Secret takes down US website after 'security incident'",
        "publish_date": "Thu, 29 May 2025 00:12:25 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "Shares of Victoria's Secret fell today after the lingerie company took down its US website, saying there was a prolonged \"security incident\".\n\nShoppers visiting the website will see a blank screen with the company's statement rather than its usual selection of lingerie, sleepwear and other products.\n\nThe retailer has \"identified and are taking steps to address a security incident\", according to a statement posted to its website.\n\nCustomers saw this screen while trying to visit the Victoria's Secret website. (Victoria's Secret)\n\n\"We have taken down our website and some in store services as a precaution.\"\n\nIt's rare for a company of Victoria Secret's size to have such a lengthy site-wide outage.\n\nWhile its physical retail stores remain open, revenue from online shopping is critical for Victoria's Secret.\n\nThe brand generated $US2 billion ($3.1 billion) in net sales from direct channels that include online shopping in 2024, or roughly a third of its annual sales.\n\nShares of Victoria's Secret fell after the lingerie company took down its US website. (AP)\n\nHackers are getting increasingly sophisticated thanks to artificial intelligence, Richard Blech, chief executive officer of AI security firm XSOC Corp., told CNN.\n\nAnd many retailers may not be prepared for such attacks since they usually outsource cybersecurity to third-party organisations managing multiple accounts, he said.\n\n\"Hackers are ahead of the game and well-resourced,\" Blech said.\n\n\"It's a critical failure in digital trust.\"\n\nIn a statement to CNN, Victoria's Secret said that it \"immediately enacted our response protocols\" and that \"third-party experts are engaged\".\n\nShoppers visiting the website will see a black screen with the company's statement rather than its usual selection of lingerie. (CNN)\n\nAttacking unprepared retailers seems to be a new trend for sophisticated hackers, according to Blech.\n\nCNN reported that US retail companies were targeted by hackers associated with a notorious cybercriminal group this month, prompting FBI intelligence briefings.\n\nThe group was suspected of hacking UK-based Marks & Spencer, which severely hindered the company's online presence and will cost the retailer £300 million ($627.7 million) in lost operating profits and disruptions until July, Reuters reported.\n\nBlech said the intensity of Victoria's Secret hack could follow a similar trajectory.\n\nCNN has asked the company for more detail.\n\nA report from Bloomberg and posts on social media indicate the outage has been going on since at least Monday.\n\nLast year, Victoria's Secret nabbed Hillary Super as its chief executive officer as the company struggled to maintain demand.\n\nSuper was previously the chief executive officer of Rihanna's Savage X Fenty, the buzzy, digital-first lingerie venture that gave Victoria's Secret fresh competition.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/trump-administration-orders-some-us-software-firms-to-stop-china-exports/6d5c0903-c034-4d9b-b5ec-00dc8e37f459",
        "title": "Trump administration orders US software companies to halt China sales",
        "publish_date": "Wed, 28 May 2025 23:43:23 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "The Trump administration has effectively cut off some American companies from selling software used to design semiconductors to China, according to a UK report. Financial Times reported.\n\nImpacted companies include Cadence, Synopsys and Siemens EDA, according to the Financial Times , which cited people familiar with the matter.\n\nCNN was not immediately able to confirm that. The three companies didn't return requests for comment.\n\nThe Trump administration has ordered some US software companies to halt exports to China, reports say. (Nine)\n\nThe US Commerce Department said on Wednesday it is \"reviewing exports of strategic significance to China\".\n\n\"In some cases, Commerce has suspended existing export licences or imposed additional licence requirements while the review is pending,\" a spokesperson said.\n\nHowever, they didn't respond to CNN's inquiry regarding which companies that included.\n\nThe move could be the latest blow in an ongoing trade war between the world's two biggest economies.\n\nWhile that trade war is ostensibly on pause while the US and China continue to negotiate a trade deal, the US Commerce Department's actions underscore the acrimony between the two nations and the challenges in keeping the peace.\n\nThe pause came after Chinese government officials and Trump administration officials met in Geneva earlier this month.\n\nThe US lowered tariffs on products from China to a minimum of 30 per cent from 145 per cent.\n\nMeanwhile, China lowered tariffs on American goods to a minimum of 10 per cent from 125 per cent.\n\nThe truce is set to expire in August and is intended to give both countries more time to negotiate a potentially longer-term trade deal.\n\nHowever, either country could raise tariff rates again and throw the relationship back into turmoil.\n\nREAD MORE: ﻿ Travel warning after Cook Islands declares dengue fever outbreak\n\nUS and Chinese top officials held trade talks in the Swiss city of Geneva earlier this month. (Martial Trezzini/Keystone via AP) (AP)\n\nLiu Pengyu, a spokesperson for the Chinese embassy in the US, declined to comment on the US Commerce Department's latest actions.\n\nHowever, he said in a statement that \"China firmly opposes the US's overstretching the concept of national security, abusing export controls, and maliciously blocking and suppressing China.\"\n\n\"China will keep a close eye on relevant developments, and take resolute measures to firmly defend the legitimate and lawful rights and interests of Chinese companies,\" he added.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/unknown-woman-found-with-rose-on-her-chest-identified-7-years-later/7679b783-a5fe-43d8-9cd1-7943cb37a251",
        "title": "Unknown woman found with rose on her chest identified, seven years later",
        "publish_date": "Wed, 28 May 2025 22:04:55 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "The identity of a Jane Doe found in the US state of Ohio in 2018, partially buried in a mulch bed with a rose placed delicately on her chest, has been learned.\n\nShe was 71-year-old Patricia Colina Goodwin.\n\nGoodwin's body was discovered in a shallow grave near a playground outside of an Cincinnati apartment complex on May 31, 2018 — Memorial Day weekend, nearly seven years ago.\n\nIn 2019, a clay sculpture of the Jane Doe's suspected likeness was unveiled. (Ohio BCI's Criminal Intelligence Unit)\n\nShe'd been wrapped in cloth, a rose placed carefully on her chest.\n\nSince then, the Hamilton County Coroner's Office has been working to discover her identity.\n\nMonths after she was found, a sketch was released depicting what Goodwin may have looked like; one year later, in 2019, a clay sculpture of her suspected likeness was also unveiled.\n\nHer fingerprints were taken, her DNA was uploaded and run through CODIS with no results.\n\nThen, in 2023, the coroner's office held a press conference to release digital 3D images created by BCI.\n\nThe woman was wearing grey, silky pyjama bottoms and a grey tank top.\n\nA name, possibly \"Schrader,\" was written in permanent marker on the tag inside the pyjama bottoms.\n\nA white metal hair stylist-type hair clip was in her hair.\n\nShe was wearing silver hoop earrings and three hair ties on her wrist.\n\nDuring a press conference on Tuesday, Sammarco pointed out that earrings Goodwin is wearing in a BMV photo taken for her driver's licence match the earrings found on the woman in Avondale.\n\nOver four separate press conferences in the last seven years, Hamilton County Coroner Lakshmi Sammarco has said her office did not suspect Goodwin was a victim of foul play.\n\nGoodwin's autopsy had revealed she'd had drugs in her system and her cause of death is believed to be an overdose.\n\nThat's the same cause of death determined for Goodwin's son, whose body arrived at the Hamilton County Coroner's Office one year after Goodwin was discovered.\n\nElena Iatarola, special agent in charge for FBI Cincinnati, said the department's Investigative Genetic Genealogy team were able to use Goodwin's DNA to tie her more closely to family trees already in the FBI's database.\n\nThat led to Goodwin's family.\n\nThrough that connection, officials discovered Goodwin's son had died from an overdose in 2019.\n\nDNA testing performed on the Jane Doe discovered in 2018 and Goodwin's son's body showed that it was 99.99 per cent likely the Jane Doe was his mother, Patricia Goodwin.\n\nSammarco said some of the other details of the case have been cleared up in speaking with Goodwin's family, and others who knew her son.\n\n\"It's likely that they were together and that he tried to bury his mother the best that he could and left a rose on her chest,\" said Sammarco.\n\n\"That's what we think might have happened, but it's sort of a guess at this point.\"\n\nAt least one person who knew Goodwin's son said that he'd mentioned being with his mother, but that she'd died a year prior.\n\nSammarco said unfortunately, Goodwin's brother died a year ago, without ever learning what happened to his sister.\n\nHe'd never stopped looking for her, Sammarco said.\n\nStill, she said now the rest of Goodwin's family knows.\n\n\"This kind of closure, it's one of the things we do in this office is try and bring that peace and closure to these families,\" Sammarco said.\n\nJennifer Lester, a criminal intelligence analyst with BCI who's worked on Goodwin's case since 2018 had a message for families who may be missing a loved one.\n\nEven if your loved one has been reported missing to a local law enforcement agency, you can still call 855.BCI.OHIO to report them missing with BCI.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/melbourne-fires-two-homes-destroyed-families-escape/54701ebe-1ddc-4968-9465-243a5206e75a",
        "title": "Photo shows fire devouring house as families flee in Melbourne",
        "publish_date": "Wed, 28 May 2025 22:50:05 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "Two families have been left homeless after their neighbouring houses were gutted by fire in Melbourne's north-west overnight.\n\nThe blaze broke out on Brosnan Crescent in Strathmore at about 2am.\n\nIt's believed the fire may have started with two cars parked in the driveway in one of the homes, with a bursting tyre alerting residents.\n\nA resident took this photo from inside the burning home before escaping. (9News)\n\nOne resident took a photo of the view from inside the house, showing flames leaping at the windows.﻿\n\nAll the occupants of both houses were able to get out, but the homes were badly damaged by the time firefighters could bring the blaze under control.\n\nOne resident said he had lived in the house for 26 years, since his childhood.\n\nTwo houses have been badly damaged in a fire in Strathmore. (9News)\n\nThe cause of the fire is still being investigated.\n\nFirefighters on the scene told 9News they believed neither house had a working fire alarm.﻿\n\n9news.com.au has contacted Fire Rescue Victoria.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/hailey-biebers-beauty-brand-rhode-just-sold-to-elf-for-1-billion/eb7a70a1-19d5-4e38-aa0a-1a1d515dd921",
        "title": "Hailey Bieber makes $1.56 billion overnight with massive deal",
        "publish_date": "Wed, 28 May 2025 22:40:20 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "Hailey Bieber's beauty brand rhode has been sold to budget makeup powerhouse e.l.f. Beauty for US$1 billion (A$1.56 billion).\n\nIt's e.l.f.'s largest acquisition to date, eclipsing its US$355 million (A$552 million) purchase of skin care brand Naturium in 2023.\n\nFounded in 2022, Bieber's brand racked up US$212 million (A$330 million) in net sales in its last fiscal year, which ended in March. And earlier this year, rhode announced that its products will be seen in-stores at Sephoras in North America and the United Kingdom.\n\nHailey Bieber attends the Vanity Fair Oscar Party in Beverly Hills, California, on March 12. Bieber's beauty brand rhode sold to budget makeup powerhouse e.l.f. Beauty for $1 billion on May 28. (Lionel Hahn/Getty Images via CNN Newsource)\n\nBieber will serve as rhode's chief creative officer and head of innovation, the company said. She's the company's founder and current creative director.\n\nWith a strong social media presence, in addition to Bieber's own digital footprint both before and after her marriage to singer Justin Bieber, rhode \"has a powerful engagement model,\" e.l.f. said in its earnings call just after the announcement Wednesday. Fans will often wait hours in line for rhode pop-ups, and its products are frequently sold out on its website.\n\n\"One of the things we really like about rhode is just how tight the product assortment is. It's only 10 products across skincare, colour cosmetics and accessories,\" CEO Tarang Amin said in the same earnings call.\n\nE.l.f., meanwhile, dominates the skincare and makeup market for young consumers and is teens' top cosmetic brand, according to a survey from investment firm Piper Sandler . The company said it could help rhode expand into retail and increase its global footprint.\n\nThe massive acquisition comes as e.l.f. is at a crossroads with President Donald Trump's chaotic tariff war with China. As of mid-May, about 75 percent of its global production came from China and is now subject to tariffs of 55 percent, including the tariffs put in place in 2019, the company said in its Wednesday earnings.\n\nIn response to the tariffs, e.l.f. is increasing prices by $1 across its entire portfolio on August 1 . The majority of its products are priced under US$10.\n\nE.l.f. also did not issue guidance for this fiscal year because of uncertainty around tariffs.\n\nBut it is still sticking by its production model.\n\n\"We believe our unique China-based supply chain is an area of competitive advantage we've been honing for the past 21 years… (We) are committed to our China team and suppliers,\" the company said in its Wednesday earnings call.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/afr-top-ten-rich-list/76572e2f-95a1-417c-8f1a-07c23fecb888",
        "title": "Revealed: The top ten richest people in Australia",
        "publish_date": "Wed, 28 May 2025 20:57:42 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "3 of 11 Attribution: Luis Enrique Ascui\n\nNicola Forrest this year again leads her husband Andrew 'Twiggy' Forrest, who drops from second in 2023 to 11th, following their separation in 2023.\n\nForrest's financial separation resulted in her gaining control of slightly more Fortescue shares than him.\n\nThe pair also co-founded the Minderoo Foundation.\n\nElsewhere in the list, Atlassian CEO Mike Cannon-Brookes has dropped from the top 10 after his separation from wife Annie.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/freak-dirt-bike-accident-uncovered-unrelated-condition-that-left-doctors-stunned/15abb581-93ed-4f11-86c7-e99fa4d05073",
        "title": "Freak bike accident uncovers unrelated condition that leaves doctors stunned",
        "publish_date": "Wed, 28 May 2025 02:10:23 +0000",
        "category": "lifestyle",
        "authors": [
            "May"
        ],
        "text": "Exclusive: When 13-year-old Theo Phillips had an accident on his bike last month, it was nothing new for his parents, who initially chalked it up as yet another trip to the emergency room for their stunt-performing son.\n\n\"We're always at the hospital, at least once every six or seven months, because he's broken a bone doing bike jumps at the local park, or getting concussion,\" Theo's mother, Lucy Phillips, told 9news.com.au .\n\nTheo's latest accident seemed relatively minor, compared to his long list of previous injuries, his mother said.\n\nWATCH THE FULL STORY IN 9NEWS PERTH FROM 5PM AWST ON CHANNEL NINE IN WA OR 9NOW.﻿\n\nLucy Phillips, left, pictured with her son Theo in hospital. (Supplied: Lucy Phillips)\n\n\"It was a little, freak accident. He wasn't even on his bike at the time. He just literally tripped over his back tyre,\" she said.\n\nLanding face first on the bike's handlebars, the brake lever pierced the roof of Theo's mouth and cut his cheek.\n\nTheo's parents took him to Joondalup Hospital's emergency room, where a doctor glued together the cut.\n\nAs a precautionary measure, the doctor also ordered a CT scan to check his jaw.\n\nThe scan uncovered something no-one saw coming: a tumour the size of an orange lodged deep in Theo's brain.\n\nIncredibly, Theo had not shown any symptoms or warning signs of the massive, 10-centimetre tumour in his brain.\n\nTheo Phillips is now recovering after undergoing two brain surgeries. (Supplied: Lucy Phillips)\n\n\"The doctors were stunned,\" Phillips said, adding that it was terrifying to think her son had been \"a walking time bomb\".\n\n\"They couldn't believe how big it was — or how he was still out there riding bikes, doing tricks at the skate park, breaking bones, getting concussions.\"\n\nIt was only later that tests showed Theo had no right-hand peripheral vision, which may well have contributed to his accidents in the past, his mother said.\n\nDoctors believe Theo may have had the rare and benign tumour - called a papilloma choroid plexus - since birth and it slowly grew over his lifetime.\n\nScans of Theo Phillip's brain revealed the enormous tumour, 10cm in circumference. (Supplied: Lucy Phillips)\n\nTheo was taken by ambulance to Perth Children's Hospital, where specialists began preparing for what would become two major brain surgeries — one to remove the massive tumour, and another, just days later, to relieve dangerous pressure caused by bleeding on the brain.\n\nThe first operation — a complex eight-hour procedure — took place less than two weeks after the discovery. Surgeons warned Theo's parents about the risks: paralysis, stroke, impaired speech, or worse.\n\n\"They told us if they went even a millimetre the wrong way, he might not make it, or he could be paralysed or lose the ability to speak,\" Phillips said.\n\nTheo underwent the marathon brain operation, but, in the hours and days following surgery, it became clear something wasn't right.\n\nTheo's family had no idea the seemingly happy and active 13-year-old had a growing tumour in his brain. (Supplied: Lucy Phillips)\n\n\"He didn't open up his eyes and didn't know the names of people he knew, like his brother,\" Phillips said.\n\nSeven days after the operation, a CT scan revealed a build-up of blood on his brain, and Theo was taken back into surgery — this time for another seven-hour procedure.\n\n\"This time he was feeling much better and came around a lot quicker from the first op,\" Phillips said.\n\n\"He's starting to remember things and trying to put sentences together now.\"\n\nThat second operation was a fortnight ago. Within a week, Theo's energy had returned — briefly.\n\n\"He was up and trying to play basketball at the hospital,\" Phillips said. \"And then after that, he said, 'Oh, I feel really dizzy.'\"\n\nWhile Theo was up eating and drinking, and still recovering slowly, his progress had been set back by an infection, she said.\n\nThankfully, Theo was able to come home from the hospital on Tuesday, but her son now faces a﻿ long and uncertain recovery with a lot of rehabilitation, Phillips said.\n\nThe teenager is still in pain and having trouble finding words and forming sentences.\n\nHowever, Phillips said she and her husband were overwhelmed by their son's strength.\n\n\"He's still got a long way to go, but we're just so incredibly proud of him,\" she said.\n\n\"He's been unbelievably brave through all of this.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/most-popular-towns-for-city-residents-moving-to-regions/60b09690-962e-4747-b231-bf8f94c4696f",
        "title": "The top regional destinations for city folk fleeing the rat race",
        "publish_date": "Wed, 28 May 2025 03:43:17 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "The most popular regional areas sought by capital city dwellers looking for improved lifestyles have been revealed.﻿\n\nThe regional movers index (RMI) released today shows the Geelong local government area in Victoria tops the list of city folk seeking a tree or sea change in the 12 months up to March.\n\nGeelong captured a 9.3 per cent share of total net internal migration, ahead of the 8.9 per cent held by the Sunshine Coast in Queensland, which had been in top place for the last two years.\n\nThe Eastern Beach in Geelong, Victoria. (Nine)\n\nThe index, drawn up by the ﻿the Regional Australia Institute (RAI) and the Commonwealth Bank, shows more people are moving from metropolitan areas.\n\nDuring the previous quarter, migration to regional areas recorded an 11 per cent hike compared with the previous quarter.\n\nThe figure represents a 20 per cent increase on the pre-pandemic average.\n\nRAI chief executive Liz Ritchie said the results in the report confirmed shifting migration patterns in Australia.\n\n\"The nation's love affair with regional living is showing no signs of abating with 25 per cent more people moving from capital cities to the regions, than back in the opposite direction,\" she said.\n\n\"Further, net migration to regional Australia is now sitting 40 per cent higher than the prevailing level in the pre-pandemic era.\"\n\nGreater Geelong's top spot reflected the rising popularity in regional Victoria as a whole.\n\nThe surprising housing markets tipped for growth this year View Gallery\n\nThe state captured 34 per cent of the total net inflows into all of regional Australia during the March 2025 quarter, larger than the 28 per cent share in the March 2024 quarter.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/nsw-floods-damage-aerial-photographs-before-and-after/1f716490-37f4-495f-af9d-209e3566c3f9",
        "title": "Shocking before and after aerial images expose the severity of the NSW floods",
        "publish_date": "Wed, 28 May 2025 01:49:18 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "1 of 37 Attribution: Nearmap\n\nNewly released aerial imagery from the NSW Mid North Coast has captured the sobering scale of flood damage.\n\nThe images from Nearmap show the before and after of the situation.\n\nNearmap's Senior Director of Survey and Geospatial Content Operations M'Shenda Turner spoke of the devastation.\n\n\"This has been one of the most severe weather events we've seen in NSW in recent years — entire communities have been cut off, and the scale of the damage is staggering.\n\n\"These imagery and insights give us a powerful way to help emergency services, insurers and local councils understand exactly what they're facing on the ground.\n\n\"In moments like this, fast, clear information is everything - it helps guide critical decisions, prioritise support, and ultimately, speed up the path to recovery for the impacted communities.\"\n\nIn this photo, cows are crowded in a tiny island that was previously a small patch of a paddock.﻿\n\nClick through to see the before and after photos.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-29/wadumbah-aboriginal-dance-group-and-james-webb-dispelling-myths/105347908",
        "title": "Dispelling 'all the crazy myths' drives this Aboriginal dance group",
        "publish_date": "Thu, 29 May 2025 01:39:19 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "James Webb has been performing traditional Aboriginal dance for over 30 years, but it has always been about more than just the show.\n\n\"It's about sharing this incredible information. You can't ignore 65,000 years,\" James said.\n\nHis Perth-based dance group Wadumbah shares Aboriginal Dreamtime stories, woven together with traditional tribal paint and the powerful sounds of a didgeridoo.\n\nJames says he has been playing the didgeridoo since he was a child. (ABC News: Lily Kristanto)\n\nTheir focus is teaching people about Aboriginal culture and correcting misconceptions.\n\n\"We're out there to dispel all the crazy myths,\" James said.\n\n\"It's about empowering us and empowering mainstream Australians … they want to know the truth.\"\n\nJames, who was given the traditional name Gumbiardi, started the dance group three decades ago.\n\nThe Wadumbah dance group shares Aboriginal dreamtime stories to help teach people about Noongar culture. (ABC News: Lily Kristanto)\n\n\"As a child growing up, there wasn't any information on First Nations peoples,\" he said.\n\n\"I thought, 'What's a better way of trying to get the message out?'\"\n\nChanging perceptions\n\nSince then Wadumbah — which means 'Big Flood Waters' — has performed at schools, festivals and ceremonies, and has even toured overseas to a host of countries.\n\nJames said the public perception about Aboriginal culture had shifted greatly over the years. He said when the dance group started, people squirmed when watching them perform.\n\nOne of James's grandsons Nathaniel James Webb in the Wadumbah dance group. (ABC News: West Matteeussen)\n\n\"They just didn't understand or want to know because of what they've been told [about Aboriginal people],\" he said.\n\nNow, the Noongar elder said people were more accepting and curious, especially at school incursions.\n\n\"We let them be Aboriginal and join us and get them up dancing with us,\" he said.\n\n\"There's a sense of pride.\"\n\n'Showing you our culture'\n\nJames said he was not concerned about recent incidents of hecklers during Welcome to Country ceremonies, saying they represented \"only a small per cent\".\n\nAnother of James Webb's grandsons Stanley Webb in the Wadumbah dance group. (ABC News: Lily Kristanto)\n\n\"I noticed that the Aussies that were around those hecklers were telling them to get going,\" he said.\n\n\"When the media concentrates on the big old heckler, they forget to pan around and see how many people are disgusted with it.\n\n\"All we're doing is showing you our culture, which has been here for thousands of years. What's your problem, you know?\"\n\nDance group a family affair\n\nJames has taught traditional dance to scores of people and now performs with his sons and grandsons, something he said brought a vibrancy to the group.\n\nHis son Terrence Webb said being in Wadumbah meant being part of a bigger purpose.\n\nJames with his son Terrence Webb (left) and his grandson Stanley Webb (right). (ABC News: West Matteeussen)\n\n\"It's not so much keeping our culture alive, we've just been asleep,\" he said.\n\n\"We are invigorating the Australian culture.\n\n\" To do it with my family is an honour and a privilege. \"\n\nJames's love of dance also inspired his oldest daughter, who runs an all-female dance group.\n\nHe said it was crucial future generations knew about Noongar traditions from WA's south-west.\n\nTraditional tribal paint forms part of the Wadumbah dance group's storytelling. (ABC News: Lily Kristanto)\n\n\"They're getting to be a part of their culture, they learn about it,\" James said.\n\n\"Our culture is not lost like it's been for the last 200 years. You know, we weren't visible at all.\n\n\"We encourage other Noongar people, men and women, all over the place. It's our sense of looking after each other and sharing.\"\n\nReconciliation Week performance\n\nWadumbah performed in Perth's CBD this week as part of National Reconciliation Week, which runs until next Tuesday.\n\nWhat to watch this Reconciliation Week Photo shows An Aboriginal mother (Megan Hoosan) and her child (Dujuan Hoosan) in the documentary In My Blood It Runs This year's Reconciliation Week theme is, \"Be a voice for generations.\"\n\nJames is hoping every dance Wadumbah performs sparks increasing curiosity about Noongar culture, told by those who know it best.\n\n\"If you wanna fix your car, go to a mechanic,\" he said.\n\n\"If you want brain surgery, you go to a brain surgeon.\n\n\"But if you want to know about us, our people, come to us.\"\n\nHe hopes Wadumbah continues telling his people's stories for many generations to come.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-29/donald-trump-trade-tariffs-block-us-court/105351386",
        "title": "US trade court blocks Trump's 'Liberation Day' tariffs",
        "publish_date": "Thu, 29 May 2025 00:49:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "A US trade court has blocked President Donald Trump from using emergency powers to impose sweeping tariffs on imports.\n\nThe ruling on Wednesday, local time, by a three-judge panel at the New York-based Court of International Trade followed several lawsuits arguing that the president exceeded his authority, left US trade policy subject to his whims, and unleashed economic chaos.\n\n\"The Worldwide and Retaliatory Tariff Orders exceed any authority granted to the President by IEEPA to regulate importation by means of tariffs,\" the court wrote, referring to the 1977 International Emergency Economic Powers Act.\n\nDeputy Chief of Staff for Policy and Homeland Security Stephen Miller, posted the news on social media, writing \"the judicial coup is out of control\".\n\nIn a statement, the White House said it is \"not for unelected judges to decide how to properly address a national emergency\".\n\nLoading...\n\nThe ruling faces certain appeal — and the Supreme Court will almost certainly be called upon to lend a final answer — but it casts a sharp blow on Mr Trump's policy.\n\nAt least seven lawsuits are challenging the levies, the centrepiece of Mr Trump's trade policy.\n\nTariffs must typically be approved by Congress, but Mr Trump says he has the power to act because the country's trade deficits amount to a national emergency.\n\nThe plaintiffs argued that the emergency powers law does not authorise the use of tariffs, and even if it did, the trade deficit does not meet the law's requirement that an emergency be triggered only by an \"unusual and extraordinary threat\".\n\nThe US has run a trade deficit with the rest of the world for 49 consecutive years.\n\nGlobal allies were plunged into uncertainty after Donald Trump announced the tariffs. (Reuters: Francis Mascarenhas)\n\nMr Trump imposed tariffs on most of the countries in the world in an effort to reverse America's massive and longstanding trade deficits.\n\nHe earlier plastered levies on imports from Canada, China and Mexico to combat the illegal flow of immigrants and synthetic opioids across the US border.\n\nHis administration argues that courts approved then-president Richard Nixon's emergency use of tariffs in 1971, and that only Congress, and not the courts, can determine the \"political\" question of whether the president's rationale for declaring an emergency complies with the law.\n\nMr Trump's \"Liberation Day\" tariffs shook global financial markets and led many economists to downgrade the outlook for US economic growth.\n\nFactories in China rush to fulfil US orders Photo shows A man in white and a man in blue in front of a production line. Manufacturers in China race to fulfil US orders as the reciprocal tariff pause takes effect, but the renewed trade war has already caused some businesses to take drastic measures.\n\nSo far, though, the tariffs appear to have had little impact on the world's largest economy.\n\nThe lawsuit was filed by a group of small businesses, including a wine importer, V.O.S. Selections, whose owner said the tariffs are having a major impact and his company may not survive.\n\nA dozen states also filed suit, led by Oregon.\n\n\"This ruling reaffirms that our laws matter, and that trade decisions can't be made on the president's whim,\" Attorney-General Dan Rayfield said.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-29/families-touched-by-spastic-paraplegia-type-56-look-for-cure/105288082",
        "title": "Families with 'bond deeper than blood' unite to find rare disease cure",
        "publish_date": "Thu, 29 May 2025 00:23:48 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "It's a cosy scene in the Whitrod home, with the family of four nestled on a rug as they play with a wooden shop.\n\nTallulah Moon is taking coffee orders — and taking charge.\n\nThe sassy six-year-old demands dad pays first before he receives his imaginary beverage, and gets him to tap his phone on a block.\n\nIt's hard to believe that just 18 months ago she was non-verbal.\n\nFive years ago, Tallulah was given just months to live after initially being misdiagnosed.\n\n\"I still get choked up thinking about it,\" her mother Golden Whitrod said.\n\n\" We were going to say goodbye to our little girl, then they told us she's got an ultra-rare genetic condition. \"\n\nTallulah Moon has a hereditary genetic disease called spastic paraplegia type 56. (Supplied: Golden Whitrod)\n\nGenome mapping revealed their child had hereditary spastic paraplegia type 56 (SPG56), which causes degeneration of the nerve cells of the brain.\n\nChildren typically begin to show symptoms between the ages of one and two, losing the ability to sit, stand, walk or talk.\n\n\"Tallulah was 14 months old, hitting all of the milestones. She went from walking to suddenly crawling again, then not crawling and her little arms couldn't hold her up,\" Ms Whitrod said.\n\nChris Whitrod said they were initially relieved to know what was causing their daughter's decline.\n\n\"We thought finally there's a name, there must be a medicine. If you know what it is, fix her,\" Mr Whitrod said.\n\n\" But then they broke the news that Tallulah was the only person in Australia with this disease — and the only thing you can do is go home and love her. \"\n\nTallulah loved meeting Medea (left) and Mario (right) Voinea, who also have SPG56. (Supplied: Mile Productions)\n\n'Soul families' unite\n\nAfter learning there was no cure, the Whitrod family decided to do whatever it took to find one.\n\nThey moved from the Northern Territory to be closer to research labs, sold their dream home, set up the foundation Our Moon's Mission and hired a team of scientists.\n\nThere are only about 30 known cases of SPG56 worldwide, but through their fundraising efforts the Queenslanders have connected with families from across the globe, including Romania, Moldova, Türkiye and the Czech Republic.\n\nThe Whitrod family, pictured with the Voinea family from Romania. (Supplied)\n\n\"We're a little soul family of SPG56 kids. The genetic mutations are different and therefore affect the child in different ways,\" Ms Whitrod said.\n\nThe Australians have had access to a range of therapies through the National Disability Insurance Scheme (NDIS), which have drastically improved Tallulah's condition, but that hasn't been the case for their overseas counterparts.\n\n\"So some of the little cherubs are doing OK and others are really struggling,\" Ms Whitrod said.\n\n\" It's bittersweet but I think knowledge is power and just finding that connection builds strength and resilience in our little community. \"\n\nScientists show the Whitrod and Voinea families the work they are doing to find a treatment. (Supplied: Mile Productions)\n\nA bond like no other\n\nThe Voinea family from Romania recently travelled to meet the Whitrods and see the research they've helped fund at the Australian Institute for Bioengineering and Nanotechnology (AIBN) in Brisbane.\n\nAfter Vlad and Madalina Voinea's first child David battled leukaemia, they discovered their second child Mario and third child Medea had SPG56 in quick succession.\n\n\"We were devastated — we cried a lot and did not understand why all three children got sick,\" Mr Voinea said.\n\n\" For a long time we felt like monsters \"\n\nChris and Golden Whitrod with Vlad and Madalina Voinea in Brisbane. (Supplied: Mile Productions)\n\nLike the Whitrods, the Voinea family has worked tirelessly, raising more than $2 million in donations.\n\n\"Tallulah is Maria and Medea's sick sister. I say sister because their bond runs deeper than blood,\" Mr Voinea said.\n\n\" It's a rare, deep and painful bond of children united by the same struggle. \"\n\nScientists at the AIBN are developing a state-of-the-art gene therapy that could halt or even reverse the progress of the disease.\n\n\"This isn't just a medical victory — it's proof that when love is joined with hope, the impossible becomes possible,\" Mr Voinea said.\n\nGolden Whitrod says Tallulah was \"fascinated\" by her meet-up with the Voinea children.\n\n'Hearts the size of Australia'\n\nTallulah quickly won the hearts of the team at the AIBN, led by Ernst Wolvetang.\n\n\"She's an amazing little girl with a lot of courage and positive energy, and that's true for the whole family,\" Professor Wolvetang said.\n\nResearchers culture living brain tissue Photo shows University of Queensland scientist Ernst Wolvetang with a scientist looking at a petrie dish. About a third of people with epilepsy never achieve effective seizure control, but University of Queensland researchers hope they can soon end the trial and error of treatment.\n\n\"They've got hearts the size of Australia. They are doing this not just for their daughter but for all these other kids and we are energised by it as a research team.\"\n\nThe team is using human stem cells to recreate the brain in a dish so they can test different gene therapies.\n\n\"The idea is to make stem cell models from the actual patients that are going to be receiving the therapy to see if it is safe and effective to apply,\" Professor Wolvetang said.\n\n\"This type of disease is not usually on the radar of the big pharmaceutical companies because there are just not enough patients to actually make money.\"\n\nBut he said the AIBN team was creating a \"replica framework\" that could help treat other brain and genetic diseases.\n\nThey hope to begin a clinical trial by the end of the year, and are in the process of finding a suitable site.\n\nTallulah Moon joined her big brother Finn at school this year. (Supplied: Our Moon's Mission)\n\nIn the meantime, the Whitrods continue to celebrate each victory in their unique journey, including having their daughter start school this year.\n\n\"In the first week the feedback we got from the teachers was that no, she wasn't having any trouble fitting in, she was more like Taylor Swift — we had to push the fans away from Tallulah to give her space,\" Ms Whitrod said.\n\n\"We were just so heartened by that.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-29/wigmaker-rachel-walker-makes-wigs-for-medical-hair-loss/105314432",
        "title": "It takes up to 450 hours to make a human-hair wig, but it's Rachel's passion",
        "publish_date": "Wed, 28 May 2025 23:21:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Master wigmaker Rachel Walker can spend up to 450 hours painstakingly attaching human hair, strand by strand, to a Swiss lace base to create a single wig.\n\nThe time-consuming process has become a passion for her after seeing the impact a wig can have on the self-esteem of people experiencing medical hair loss.\n\nMs Walker, who has been a hairdresser for 36 years, expanded her skills to wig-making 10 years ago, when she became frustrated by the lack of options available to her clients.\n\nEach strand of hair is individually knotted by hand to a wig base. (ABC Hobart: Lucie Cutting)\n\nShe largely relies on hair donations to keep wig costs as low as possible, but her wigs still cost thousands of dollars because of the skill and time required to make them.\n\nEven the simplest wigs can take close to 100 hours to complete.\n\n\"Sometimes I get in a real zone and can ventilate [the process of hand-tying hair strands] for five to six hours,\" Ms Walker said.\n\n\" Then some days you're fighting to find your zone and you've got to get up and walk away. \"\n\nOther options are available for people experiencing medical hair loss, including a service by the Cancer Council, which provides free wigs for people suffering hair loss due to cancer treatment.\n\nPonytails of hair await use in Rachel Walker's studio. (ABC Hobart: Lucie Cutting)\n\nBecoming a wigmaker\n\nMs Walker, one of just a handful of human-hair wigmakers in Australia, was inspired to learn the skill when she realised the range of wigs available to her clients did not reflect their identities before they started losing their hair for medical reasons.\n\n\"I thought, after years of frustration, I can do better than this,\" she said.\n\nSeeing no training opportunities in Australia at the time, she travelled to New York, where she studied under two master wigmakers.\n\n\"I've been going strong ever since,\" she said.\n\nRachel Walker aims to make the wigs as natural-looking as possible. (ABC News: Lucie Cutting)\n\nSitting surrounded by boxes of hair in her home studio in southern Tasmania, Ms Walker said the only downside was finding strands of hair everywhere.\n\n\"I have hair in my food, I have hair in my washing, I have hair in my hair — my house is full of hair,\" she said before laughing.\n\nToday, she is working on a topper, a piece made to blend with a client's existing hair.\n\nLooking through a magnifying glass, she skilfully adds a single strand of hair to the lace.\n\nThis topper will take an estimated 98 hours to complete.\n\nDonations of hair help to keep the cost of wigs down. (ABC News: Lucie Cutting)\n\nThe clock starts ticking before Ms Walker even picks up the Swiss lace, as she must first match donated hair to her client's existing or lost hair in density, texture and colour, if maintaining their former look is what they desire.\n\nFor clients who had, or still have, the beginnings of white or grey hair, Ms Walker individually selects grey or white strands from her compendium of hair.\n\nShe said silver and white hair was the most difficult to source because people with those hair types generally wear their hair short or colour it.\n\n'Bunches' of donations sent by mail\n\nMs Walker receives \"bunches of packages\" of donated hair from all over Australia and New Zealand.\n\nRachel Walker recently received a donation of a 37-year-old ponytail. (ABC Hobart: Lucie Cutting)\n\nA recent donation of a brown ponytail of hair was cut 37 years ago and kept by a parent, who was willing to part with their daughter's hair in the hope that it could help someone else.\n\nThe donation arrived with its 80s plastic, hair-bobble ties still intact.\n\n\"For somebody to donate it, and to willingly cut off that adornment … to share what they have, and to give [it] out of the loveliness and generosity of their own heart … it's just beautiful,\" she said.\n\n'Wow, where have you been?'\n\nBarb Jeffery of Western Australia bought one of Ms Walker's toppers after years of living with extensive scarring alopecia, a permanent type of hair loss.\n\nBarb Jeffery wearing \"Moira\" at her 70th birthday party. (Supplied: Barb Jeffery)\n\nShe and her friends call her topper Moira, after a character from the television show Schitt's Creek who has a wig for all occasions.\n\nMs Jeffery says Moira is a celebrated member of her family and community, and is \"known about town by lots of people … she has a personality\".\n\nBarb Jeffery at 16, before she developed extensive scarring alopecia. (Supplied: Barb Jeffery)\n\n\"I've noticed a huge difference. When I'm out with my normal hair, people will say hello and immediately look at the top of my head,\" Ms Jeffery said.\n\n\"That used to upset me. I didn't want to be in family photographs — now I take a photo any time I have Moira.\n\n\"It makes you feel good again.\"\n\nMs Jeffery said wearing the topper for the first time was overwhelming for everyone.\n\n\"I think I burst into tears, Rachel did as well … I looked in the mirror and thought, 'Wow, where have you been?' I was glad to see me come back,\" she said.\n\nHuman hair trade largely unregulated\n\nWhen unable to meet a client's needs through local donations, Ms Walker buys ethically harvested hair, but said she was facing difficulty in accessing ethical hair because of the war in Ukraine, where her supplier was based.\n\nAssa Doron says a certification system for the ethical collection of human hair is needed. (Supplied: YouTube/ANU)\n\nAnthropologist Assa Doron, of the Australian National University, has spent more than a decade exploring the global trade of human hair as part of a larger project on waste.\n\nHe said the trade was built on the exploitation of labour, primarily in the Global South, and was largely unregulated because of its \"fragmented\" and \"informal\" nature.\n\nHair donations for wigs growing Photo shows A teacher with long hair sits in a music room with hairdresser and student assessing hair. A high school PE teacher cuts his long hair in honour of his mum, as donations of human hair for medical wigs increases.\n\nIn 2013, Professor Doron travelled to India, where he observed waste pickers, people who collect refuse from gutters, collecting hair in unsafe conditions and with minimal protection.\n\nHe also traced the supply route of temple hair, which is cut by religious pilgrims as a sign of devotion but then collected and sold for profit, in his co-authored book Waste of a Nation.\n\nProfessor Doron said there was no standardised certification, like the Fair Trade certification, that verified ethically sourced hair.\n\nThe curly story of how hair extensions are made Photo shows A vendor displays human hair at a wholesale market A New Yorker sets up shop just inside an open doorway in a back alley in Ho Chi Minh City, taking out a set of scales, zip ties, some scissors and ziplock bags. He's here for hair.\n\n\"While such systems are not perfect, they do help raise awareness and can contribute to improving industry practices,\" he said.\n\nUntil such mechanisms existed for hair, ethical sourcing would remain difficult, and conditions would not improve for \"the most vulnerable in this trade\".\n\nMs Walker said she refused to buy hair from temple hair sources and had a stance against unethically sourced hair.\n\nOther options for medical hair loss\n\nFree wigs are among options for those experiencing medical hair loss.\n\nThe Cancer Council offers access to a wide range of synthetic wigs and turbans for free to anyone who has lost their hair due to cancer treatment.\n\nClaire Prior says wigs can restore cancer patients' confidence. (ABC Hobart: Lucie Cutting)\n\nClaire Prior, the council's Tasmanian director of supportive care, said the wigs could be tailored to suit a client's face.\n\n\"I certainly see the impact that having a new wig fitted makes on people … I often get to see people walking out with their shoulders up,\" she said.\n\nA woman is fitted with a wig at the Cancer Council of Tasmania. (ABC Hobart: Lucie Cutting)\n\nThe Cancer Council accepts donated wigs, and other organisations, such as Sustainable Salons — who sort and send hair to wigmakers and charities across Australia — accept donations of plaited natural or coloured hair ponytails of 20 centimetres or longer.\n\nThe Australia Alopecia Areata Foundation offers wig advice online for children and adults living with alopecia.\n\n\"You don't have to donate to me … you can donate to any wig-making charity that supports people who have medical hair loss,\" Ms Walker said.\n\n\" It's a way of bringing joy into people's lives when they've lost what they've lost. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-29/giro-d-italia-isaac-del-toro-wins-stage-17/105350972",
        "title": "Del Toro extends Giro lead, Aussie duo abandon race",
        "publish_date": "Wed, 28 May 2025 22:41:26 +0000",
        "category": "sports",
        "authors": [],
        "text": "Isaac del Toro has maintained his excellent form at the Giro d'Italia to win stage 17 with a perfectly timed sprint, while Australian riders Jay Vine and Luke Plapp both withdrew from the race.\n\nDel Toro led home the field in the 155-kilometre route from San Michele all'Adige to Bormio to extend his lead in the general classification.\n\nThe young Mexican's first stage victory meant the day ended in triumph for the UAE Emirates-XRG team after an early blow when Vine was forced to retire.\n\nVine appeared to have withdrawn on the category-two Tonale climb, about 90km from the stage finish.\n\nPlapp (Team Jayco AlUla), who won stage eight, was similarly placed when he abandoned the race.\n\nAdding to the disappointment of the Australian contingent, Michael Storer (Tudor Pro Cycling Team) faded to lose more than 4 minutes on del Toro, finishing in 29th place.\n\nStorer appears out of contention in the general classification, sitting 7 minutes and 46 seconds adrift of Del Toro in 10th place on the standings.\n\nDel Toro was the freshest rider at the end of the final ascent and he broke away from Romain Bardet (Picnic-PostNL) and Richard Carapaz (EF Education-EasyPost) with just over 2km left in the stage.\n\nBardet crossed the line four seconds after Del Toro, with Carapaz in third.\n\nDel Toro's spectacular effort breathed new life into his bid to win a first Grand Tour.\n\nHis display erased any doubts that arose after the pink jersey holder saw his lead shrink in a chaotic stage 16.\n\n\"I imagined that I could win a stage with the Maglia Rosa (pink jersey),\" del Toro said after his win.\n\n\"The Giro has been very good so far.\n\n\"The fight for the podium is incredible. Today I realised that I will never give up. I will always try to win.\n\n\"I have nothing to lose. It wasn't any easier today than yesterday.\"\n\nDel Toro now leads overall by 41 seconds from Carapaz, who has a 10-second advantage over Simon Yates (Visma-Lease a Bike).\n\nReuters/AAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-29/surgeries-cancelled-at-major-regional-nsw-hospital-orange/105338504",
        "title": "'Sickest patients wait longer' as bed shortages force surgery delays",
        "publish_date": "Wed, 28 May 2025 22:30:16 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When a \"code black\" is declared at a New South Wales hospital it means staff safety is at threat.\n\nFor clinicians it also signals their hospital is at capacity.\n\nSenior doctors at Orange in the state's central west say this declaration is being made at the city's public hospital, Orange Health Service, too often.\n\nDirector of surgery Rob Knox said recently the hospital had spent half a month in the most \"critical state of bed block\".\n\n\"[That's] where we've used up all surge capacity. There are no more beds available for patients. Patients can't leave [the emergency department],\" Dr Knox said.\n\n\" We can't get patients into the hospital. [It's] termed code black, which is effectively gridlock. \"\n\nDr Knox recently went public with concerns that he and his colleagues had been asked to reduce the clinical urgency of cancer surgeries so the hospital did not breach waiting list targets.\n\nThe Western NSW Local Health District (WNSWLHD) rejected the claims, however NSW Health has ordered a review of the re-categorisation of surgeries at Orange Hospital.\n\nSurgeons have suggested solutions they say will ease waiting list pressures and future-proof the workforce. (ABC News: Shaun Kingma)\n\nDr Knox said he now felt compelled to speak up for colleagues in other hospital departments.\n\n\"When messages are going around from fellow surgeons asking if anyone has the option to accommodate a child who's been stuck in ED for over 24 hours with appendicitis [and she] is the same age as your daughter, that's when it starts to become a personal issue,\" he said.\n\nEmergency surgery's 'hidden crisis'\n\nThe Orange Health Service's intensive care unit (ICU) and emergency surgery regularly experience high demand.\n\nThe ABC has seen correspondence from doctors detailing operations which had been postponed due to a shortage of ICU or high dependency beds despite some of their patients' surgeries being overdue.\n\nThe hospital's anaesthetics department wrote to management in September 2024 expressing its alarm about what its doctors were seeing.\n\n\"For a while now, the department of anaesthesia (sic) at OHS [Orange Health Service] has raised concern at a local level that patients requiring emergency surgery are given a lower priority than patients waiting for an elective procedure,\" the letter stated.\n\n\"We suggest that both the hospital and the district [WNSWLHD] need to prioritise the sickest surgical patients in the district rather than meet KPIs for elective surgery.\n\n\" We are making the sickest patients wait longer than they need to. \"\n\nDr Rob Knox says several departments, including intensive care, are under constant pressure. (ABC News: Shaun Kingma)\n\nDr Knox said the hospital's management of emergency surgeries prompted his department to make a tough decision.\n\n\"I think emergency surgery is the real hidden crisis,\" he said.\n\n\"We've certainly agreed that if we have an enormous volume of patients waiting, who do not look like they're going to get their emergency surgery operation in time, we are going to cancel patients off our elective lists.\"\n\nIn a statement, a WNSWLHD spokesperson said they \"reject claims that surgeons have been asked to reclassify surgical procedures and prioritise waiting list targets over patient care\".\n\n\"During periods of significant demand for emergency care, resources are directed to people with the most critical needs,\" they said.\n\n\"Decisions to postpone surgery are not taken lightly, and are made with appropriate clinical consultation and consideration.\"\n\nDoctors suggest robotics common in the city\n\nSenior doctors have put forward proposals to hospital management which they say will slash waiting lists, deliver high quality patient care and future-proof the hospital and its workforce.\n\nThey have been campaigning for robotic surgical equipment to be installed.\n\nUrological surgeon Clair Whelan said she had to refer half of her patients to Sydney because she could not see them in the recommended time frame, and many expected to receive robotic surgery which was only available at metropolitan hospitals.\n\nDr Clair Whelan says the future of Orange's urology service hinges on the availability of robotic surgical equipment. (ABC News: Shaun Kingma)\n\nTwo urologists are due to start in Orange in 2026, but Dr Whelan said their appointments would be compromised if the equipment was not available.\n\n\"I can say unequivocally that the young urologists, who have trained on robotic surgery, will not be able to work in the Orange area or in the western district because they won't have that facility,\" she said.\n\n\" What we're talking about is the difference between having any urology service at all within the next two years. \"\n\nDr Whelan said Sydney hospitals would then have to care for all of the Central West's surgical patients, including those requiring prostate cancer operations which was the most common cancer in NSW since 2020.\n\n\"It basically means every one of them will be going over to Sydney to see someone,\" she said.\n\n\"That's a massive burden on what is already an overstretched system in Sydney as well.\n\n\"Hospitals are stretched, regardless of where they are. The burden of half the state coming to them is not going to help.\"\n\nCancer surgeries delayed to make hospital look good Photo shows Hospital buildings. A surgeon is speaking out after hospital management re-categorised the urgency of some cancer surgeries from highest to lowest without consulting him.\n\nIn an email to senior doctors, seen by the ABC, WNSWLHD chief executive Mark Spittal said while work was being done on the proposal for robotic surgery at a ministerial level, he did not want to apply pressure.\n\n\"I do not necessarily want to be forced to justify of (sic) why Orange would be the rural pilot site against another rural/regional hospital with a larger catchment such as Wagga, Tweed, Port Macquarie or others etc.\" he wrote.\n\nDr Whelan said a decision was needed soon.\n\n\"We kind of need a plan within the next six months because without that plan the rest of it will topple over, the workforce will topple over,\" she said.\n\nOutsourcing proposal\n\nThe doctors have approached the hospital and WNSWLHD with another proposal to help ease surgery waiting list pressures.\n\nThey want them to consider using vacant operating theatres at a neighbouring private hospital for lower acuity surgeries.\n\nA vacant theatre across the road could be used immediately, while two others would be available once fitted out. (ABC News: Shaun Kingma)\n\nRamsay Healthcare leases level four of the Bloomfield Medical Centre for its Ramsay Surgical Centre.\n\nIt has one vacant theatre and two others available once they are fitted out.\n\n\"It's this very frustrating situation when we have a public hospital that's bursting at the seams … to know that literally across the road are empty operating theatres that could be staffed, funded, used at short notice, that will deal with this,\" Dr Knox said.\n\nSenior doctors want Orange Hospital's management to utilise theatres at a neighbouring private hospital (right). (ABC News: Shaun Kingma)\n\nHe said using private resources would not result in problems experienced at Northern Beaches Hospital in Sydney.\n\n\"If it's a question of patient safety I think the obvious safe situation is literally across the road from the main referral hospital of the district,\" Dr Knox said.\n\n\"There's an on-site ICU, cardiologists, interventional radiologists, specialists, anaesthetists, and it's a 10-minute walk or 30-second ambulance trip.\"\n\nIn a statement, Ramsay Surgical Centre chief executive Ben Chiarella said its facility had \"significant capacity and resources available for growth and further utilisation if and when required\".\n\n\"We have a good working relationship with Western NSW LHD's executive team and continue to offer our support in any strategic discussions or collaboration required to improve health access, equity, and outcomes in this region,\" Mr Chiarella said.\n\nOrange Health Service is the hub of medical services in central western NSW. (ABC News)\n\nOn March 27, State Health Minister Ryan Park told the NSW parliament that adverse patient outcomes at Sydney's Northern Beaches Hospital did not preclude other types of arrangements with the private sector.\n\n\"The bill does not and is not intended to prohibit or impact on other arrangements entered into with the private sector,\" Mr Park told parliament.\n\n\"[The private sector] can also be contracted to provide specific clinical services to public patients, such as [instances like] private health facilities providing elective surgery to public patients to reduce waiting lists after the COVID‑19 pandemic.\n\n\"Such arrangements can be beneficial to NSW Health, patients, and the private sector, and are generally relatively simple to administer.\"\n\nA WNSWLHD spokesperson said working with the private sector was \"not currently required\" because its existing resources were \"activated\" when needed.\n\nThey said there had been discussions about robotic surgical equipment with clinicians and that the development of a new clinical services plan was underway.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-29/state-of-origin-game-one-quiz/105336382",
        "title": "Were you paying attention to last night's State of Origin match?",
        "publish_date": "Wed, 28 May 2025 22:28:42 +0000",
        "category": "sports",
        "authors": [],
        "text": "The first match in this year's State of Origin series has wrapped up and the coaches are reviewing the footage.\n\nBut let's see how closely you were paying attention — how many players were sin-binned? And how many tries were converted?\n\nIf you hit the hay before the game was over last night, or were scrolling social media during the game, we listen and we don't judge — here's a link to last night's live blog if you want a hand with some of the questions.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-29/state-of-origin-maroons-blues-dearden-cherry-evans/105350842",
        "title": "'Pull the trigger': Blues great tells Maroons to make shock selection call",
        "publish_date": "Wed, 28 May 2025 21:55:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "NSW great Andrew Johns has called for Queensland captain Daly Cherry-Evans to be axed and replaced by Tom Dearden at halfback ahead of State of Origin II.\n\nClunky Queensland with a mountain to climb Photo shows Tino Fa'asuamaleaui cries during the national anthem before State of Origin I. Watching the Maroons run around Lang Park in Origin Game I, you would swear this team met for the first time a few days ago, rather than experienced campaigners who have seen it all.\n\nCherry-Evans, the oldest player in Origin history at 36, was below his best in his 26th match for the Maroons, who went down 18-6 in the series opener in Brisbane on Wednesday night.\n\nJohns said it was time for Dearden, who played off the bench in Origin I, to replace Cherry-Evans.\n\n\"No-one beats Father Time … I think they have to pull the trigger and bring Dearden in,\" Johns said on the Nine Network.\n\n\" I don't know where the improvement comes with this group.\n\n\"NSW, if they were on tonight, they win by 40 or 50 (points). They left so many tries out there and they'll be better for that.\n\n\"I don't know if they can go up another level, Queensland. I think there has to be changes.\"\n\nFormer Maroons skipper Cameron Smith also weighed in on Cherry-Evans's Origin future.\n\nMaroons skipper Daly Cherry-Evans may face the axe before Origin II in Perth. (AAP: Dave Hunt)\n\nBut Smith made it clear Maroons coach Billy Slater would be the crucial voice at the selection table.\n\n\"I think Billy will have that discussion with his selection panel and he'll go through this game thoroughly,\" Smith said.\n\n\"There's no doubt that the key position players of Queensland lacked a bit of cohesion tonight.\n\n\"In the crucial moments of the game they just couldn't get the job done.\"\n\nOrigin II will be played in Perth on June 18.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-29/auditor-general-finds-could-have-been-fraud-at-developmentwa/105349906",
        "title": "State property valued at $800k sold for $385k, audit of land agency finds",
        "publish_date": "Wed, 28 May 2025 21:42:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "An audit into DevelopmentWA, sparked in part by the conviction of a former public servant who stole millions of taxpayer dollars, has found significant vulnerabilities to fraud at the government-owned entity.\n\nDevelopmentWA is one of Western Australia's biggest land and property developers, but unlike commercial developers, it is owned by the state government — meaning any profits or losses belong to taxpayers.\n\nAuditor-general Caroline Spencer said the intention of the audit, which looked at transactions between 2017 and 2022, was to determine whether there were irregularities in public land sale information that could indicate fraud, corruption or misconduct.\n\nCaroline Spencer says DevelopmentWA could not show value for money was achieved in all of its public land sales. (ABC News: Cason Ho)\n\n\"We have the dubious honour here in WA of the largest known public sector fraud with Paul Whyte,\" she told ABC Radio Perth's Drive program.\n\n\"He was the head of the housing authority within the Department of Communities, and so we saw through the Corruption and Crime Commission's hearings that land was identified as a way that you could settle gambling debts if someone was given the heads up — you know, 'buy this land because the government will be buying it in the future'.\n\nPaul Whyte was at the centre of one of WA's biggest corruption scandals. (ABC News: Hugh Sando)\n\n\"And so we saw there a case where a seller got $260,000 profit just by, if you like, buying it in advance of a government purchase.\n\n\"We wanted to see if there was any unreasonable growth in value, or properties selling too low, over a five-year period [at DevelopmentWA].\n\n\" Absolutely there could have been fraud within this period. \"\n\nProperty valued at $800k sold for $385k\n\nMs Spencer said her office was able to identify a number of serious issues that meant DevelopmentWA was unable to demonstrate value for money had been achieved in all of the public land sales.\n\n\"We found that one property sold for more than 50 per cent lower than its most recent valuation, with no formal rationale documented on the files, so the most recent valuation was $800,000 and then it was sold for $385,000,\" she said.\n\nDevelopmentWA, one of the state’s biggest land and property developers, is owned by the WA government. (ABC Pilbara: Susan Standen)\n\n\"We found 50 per cent of 1,100 properties under a regional stimulus program, during the audit period, didn't demonstrate compliance with approved pricing methods.\n\n\"We've got a case study of a piece of land that's four times larger than the lot next door drop to the same price with no justification why.\"\n\nMuch of the detail in the report highlights issues with appropriate documentation and the following of proper processes, which Ms Spencer said led her to the conclusion that fraud could have been taking place.\n\nThe audit details serious risks at DevelopmentWA. (ABC News: Kenith Png)\n\n\"If you look at it like Swiss cheese, that you get too many holes and gaps in process and people not doing their job reviewing what's being done by the staff around them and you line up those holes, then you can get things getting through,\" she said.\n\n\"So absolutely there could have been fraud within this period.\"\n\nCommercial interests seek influence\n\nMs Spencer stressed the importance of DevelopmentWA, and those who work for it, understanding why following appropriate processes was so important.\n\n\"What you have to understand in this environment is there are commercial interests here … third parties that DevelopmentWA interacts with, they are going to want to sell property for the highest value or buy property from government for the lowest value,\" she said.\n\n\"And so every decision that is made by this agency to sell property needs to be properly documented, it needs to be on an approved basis.\"\n\nThe probe covers a five-year period from 2017-2022. (ABC News: Kenith Png)\n\nAnother area of concern for the auditor-general was the lax way in which conflicts of interest, gifts and benefits had been handled at the government agency.\n\n\"Being aware that people are going to seek to influence you and maintaining impartiality so you can have fair dealing with all developers, with all residential or industrial buyers of state-owned land is really important,\" she said.\n\n\"We had 891 invitations where the information was incomplete to understand what was the benefit to DevelopmentWA, what was the actual management of that potential conflict of interest by the entity for those staff members.\"\n\nSigns of shift in culture\n\nIn both her audit and in talking on ABC Radio Perth, Ms Spencer highlighted that a change in leadership at the board level had led to a better culture within DevelopmentWA in recent times, but stressed those changes needed to continue.\n\nWA Labor promised $298 million to local sports projects. A new audit has found only $36m was justified Photo shows Photographs of a report pages laying on a table An Auditor General report finds hundreds of millions of dollars were allocated to sporting and community projects without any evidence of them being rigorously assessed.\n\nA number of recommendations were made in the audit, and DevelopmentWA responded by saying while it \"believes it has solid foundations of well-defined policies and procedures, it acknowledges best-practice requires constant evolution and improvement\".\n\n\"DevelopmentWA's Board and Executive will build on these audit findings and continue to strive for the highest standards in governance and decision-making robustness,\" it finished.\n\nMs Spencer tabled the Fraud Risks in Land Transactions by Development WA report in parliament on Wednesday and said her office would continue to have oversight.\n\n\"This is the biggest audit that my office has done on this organisation. It doesn't normally get this level of scrutiny,\" she said.\n\n\"But … we're going to continue to monitor the governance and the transactions and the transfers of state land to ensure that the public interest is served.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-29/asx-markets-business-live-news-29-may-2025/105350800",
        "title": "Live: Trump administration to appeal court's decision to block tariffs",
        "publish_date": "Wed, 28 May 2025 21:39:27 +0000",
        "category": "finance",
        "authors": [
            "Stephanie Chalmers",
            "Nassim Khadem",
            "Michael Janda"
        ],
        "text": "\"Imagine sailing a state-of-the-art ship directly into a fierce storm, with towering waves and relentless wind. Yet not only does your vessel remain intact—it accelerates ahead.\"\n\nThat's how Saxo Global Head of Investment Strategy Jacob Falkencrone describes Nvidia's recent quarterly earnings.\n\nHe says the tech giant \"powered through intense geopolitical headwinds, particularly stemming from escalating US-China tensions and export restrictions\".\n\nNvidia reported quarterly revenues of US$44.1 billion, up 69 per cent year-over-year, surpassing analyst forecasts.\n\n\"The data-centre segment, central to Nvidia's success, soared to $US39.1 billion, a 73 per cent increase,\" Falkencrone noted.\n\n\"Nvidia's data-centre revenue now dwarfs that of all its closest rivals combined, underscoring its dominance as the preferred supplier of AI infrastructure to tech giants like Amazon, Microsoft, Alphabet, and Meta.\n\n\"However, for investors, it's the resilience beneath these impressive figures that truly matters.\"\n\nFalkencrone says Nvidia is in a \"uniquely complex position\" being \"right at the intersection of geopolitical tensions and transformative AI innovation\".\n\n\"The risks it faces from China are significant, but so too are its strategic opportunities globally, evidenced by substantial new partnerships in places like Saudi Arabia and across the Middle East,\" he said.\n\n\"The immediate challenge for Nvidia—and thus its investors—is clear: the company must successfully navigate these geopolitical storms while delivering on its ambitious technological roadmap. Any missteps or unforeseen disruptions could swiftly change investor sentiment.\"\n\nNvidia's CEO Jensen Huang has emphasised the company's role at the heart of the ongoing AI revolution.\n\n\"Countries worldwide recognize AI as essential infrastructure—like electricity, like the internet. Nvidia stands at the very centre of this profound transformation,\" Falkencrone said.\n\nNvidia guided for next-quarter revenue of $USD45 billion, broadly in line with analyst expectations, despite an anticipated $US8 billion hit from China restrictions.\n\n\"Recent US government export restrictions on Nvidia's advanced H20 chips, tailored specifically for China, led to a substantial $US4.5 billion inventory write-down,\" Falkencrone said.\n\n\"This impact will deepen next quarter, with Nvidia projecting a further USD8 billion revenue shortfall due to the inability to sell these chips into China.\"\n\n\"Navigating stormy waters has never been easy, but Nvidia's impressive execution so far suggests it's uniquely equipped not just to survive—but thrive.\"\n\nVanEck Cross Asset Research Specialist Anna Wu says because of geopolitical trade barriers, \"it's reasonable to expect NVIDIA's earnings growth will moderate in the coming quarters\".\n\n\"However, we think there is still a strong case for NVIDIA retaining its status as the world leader in AI technology given its competitive advantage in scale, technology, and efficiency,\" Ms Wu said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-29/french-open-popyrin-advances-tomljanovi%C4%87-departs/105350746",
        "title": "Popyrin advances at French Open as Tomljanović departs in second round",
        "publish_date": "Wed, 28 May 2025 21:32:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "Alexei Popyrin has reached the third round of the French Open for the first time, becoming the first Australian into the last 32 on a drizzly day in Paris.\n\nPopyrin conquered Chile's Alejandro Tabilo 7-5, 6-3, 6-4 to set up a third-round date with Portugal's Nuno Borges.\n\nBorges advanced after defeating two-time finalist and seventh seed Casper Ruud 2-6, 6-4, 6-1, 6-0.\n\nPopyrin was all smiles after delivering a solid performance against Tabilo.\n\n\"I've always had that confidence. On my day I can beat anybody, but that's not important to me,\" Popyrin said.\n\n\"What's important to me is bringing a consistent level day in, day out. That's what I've struggled with in the past.\"\n\nFellow Australian Ajla Tomljanović failed to progress from the second round after recording a 6-3, 6-3 loss to 2024 finalist Jasmine Paolini.\n\n\"I didn't find my 'A' game. It was a tough performance out there,\" Tomljanović said.\n\nSabalenka shrugs off slow start\n\nWorld number one Aryna Sabalenka started off on the wrong foot before dismissing Swiss Jil Teichmann 6-3, 6-1.\n\nLeft-hander Teichmann troubled Sabalenka throughout the early part of the opening set but the top seed composed herself and pulled level at 3-3.\n\nSabalenka broke her unseeded opponent again in the eighth game and then took control of the match.\n\n\"She started really well and played her best game. It's always tricky against her,\" Sabalenka said.\n\nAryna Sabalenka found her groove to defeat Jil Teichmann in the second round. (Getty Images: Robert Prange)\n\nSabalenka next faces Olga Danilović, who beat Danielle Collins 6-4, 3-6, 6-4.\n\nIga Świątek, chasing a fourth straight women's singles crown, made light work of Emma Raducanu with a 6-1, 6-2 victory to stretch her winning run in Paris to 23 consecutive matches.\n\nDefending men's champion Carlos Alcaraz sealed a 6-1, 4-6, 6-1, 6-2 win over unseeded Hungarian Fábián Marozsán.\n\nBut former French Open finalist Stefanos Tsitsipas posted a shock second-round loss to Italian qualifier Matteo Gigante, who triumphed 6-4, 5-7, 6-2, 6-4.\n\nReuters/AAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-29/woodside-nw-shelf-approval-to-enable-browse-basin-development-/105344468",
        "title": "Woodside approval paves the way for the mother of all climate battles",
        "publish_date": "Wed, 28 May 2025 21:24:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "When all the hype and the fury is stripped away, the decision to extend the life of the gigantic North West Shelf gas plant boils down to one thing.\n\n\"It's really all about Browse,\" says RISC Advisory boss Martin Wilkes in relation to the huge gas field off the Kimberley coast of Western Australia.\n\nBrowse is one of the country's biggest untapped resources projects, with gas reserves large enough to meet the equivalent of Australia's entire domestic demand for almost 20 years.\n\nTo the Western Australian government and the state's industry, it represents energy security, jobs and billions of dollars of investment.\n\nAnd for some of the world's biggest oil and gas companies — not to mention Australia's flag-bearer, Woodside — Browse presents as the last great hurrah for the country's gas export industry.\n\nBut the problem is Browse is a long way from anywhere.\n\nIt's also full of carbon.\n\nWhat's more, it has no shortage of detractors.\n\nFor those reasons, it has always remained an elusive development for its backers since being discovered more than half a century ago.\n\nThe North West Shelf is therefore the only viable pathway to development Browse has left, according to those in the industry who have followed the project for decades.\n\n\"They want to bring Browse back to the North West Shelf, which has been on the cards for a pretty long time, really,\" Mr Wilkes explains.\n\n\"And that development has nowhere to go unless they got an extension of the North West Shelf.\n\n\"It's a big gas field, but it's in the middle of nowhere.\n\n\"That's why it hasn't been developed — it's hard.\"\n\nProtesters are calling the approval a \"lightening rod\" for anger. (ABC News: Keane Bourke)\n\nBy provisionally extending the licence for the North West Shelf to operate another 40 years to 2070, Canberra has thrown Browse a lifeline.\n\nBut in doing so, it has also set itself on a collision course.\n\nThat's because Browse is likely to be the mother-of-all environmental fights — a pivotal clash between those seeking an end to new fossil fuel mega-project and those in the opposite corner.\n\nAlex Hillman from the Australasian Centre for Corporate Responsibility (ACCR) says the resistance to any bid to develop Browse will be fierce.\n\n\"It's insane,\" Mr Hillman says of the decision announced on Wednesday.\n\n\"This will get people marching on the streets.\n\n\" This is the lightning rod — this is kind of like its own level of protest that would come out of this project progressing. \"\n\nQuestion marks hang over viability of carbon capture\n\nClimate groups have labelled Browse a \"carbon bomb\", claiming the project could lead to emissions of up to 1.6 billion tonnes of carbon dioxide equivalent over its lifetime — an amount three times Australia's annual pollution output.\n\nEven if Woodside can capture carbon, it will still only have a tiny impact on the total facility's lifetime emissions. (ABC News: Keane Bourke)\n\nIn anticipation of this charge, Woodside and its project partners in Browse have pivoted in recent times to say they'll try to capture and bury much of the carbon contained in the Browse gas fields.\n\nIndeed, the carbon content of Browse is in its own right significant.\n\nCarbon dioxide accounts for as much as 12 per cent of the fields' reserves — far higher than most projects and utterly dwarfing Woodside's Scarborough development, which has a carbon content of less than 1 per cent.\n\nCarbon capture a solution or distraction? Photo shows A drone image of Chevron's Gorgon project on Barrow Island. Amid the spinifex on a remote WA island looms Chevron's troubled carbon capture facility. The role the technology might play in cutting greenhouse gas emissions is likely to get a fresh airing at global climate talks in Azerbaijan.\n\nMr Hillman says there are big question marks still hanging over the effectiveness and viability of carbon capture and storage technologies.\n\nHe points to the well-documented challenges at the Gorgon LNG project off the Pilbara coast, where US behemoth Chevron has struggled to make the technology work.\n\nEven if Woodside could do a better job, he says it would barely make a difference, noting the lion's share of emissions from gas projects come from the burning of the fuel — not the release of carbon from the fields.\n\nAnd on this score — the measure of so-called scope 3 emissions — he says the Browse partners aren't proposing to do much of anything at all.\n\n\"The vast bulk of emissions is still in the scope three for customers,\" Mr Hillman says.\n\n\"If Woodside manages to implement carbon capture and storage and it manages to do it successfully … it's still only a tiny impact on the total facility's lifetime emissions.\"\n\nOthers take a different view.\n\nAn image showing how the Browse project will work. (Supplied: Woodside)\n\nThe enduring appeal of Browse comes back to WA's economy\n\nSteve Lewis is an industry veteran whose consultancy, BrightSource, helps gas users such as mines buy the fuel.\n\nMr Lewis says to understand the enduring appeal of Browse it's first necessary to get a handle on the composition of WA's economy.\n\nHe notes that gas is still the main fuel used for so much of the state's industrial base, from mineral processing to mining.\n\nAnd much more than other states, he says the west is still heavily dependent on gas to generate electricity — a dependency that's only likely to grow deeper amid efforts to get out of state-owned coal by the end of the decade.\n\nWhile gas accounts for only a tiny share of the electricity mix on the eastern seaboard, he says in WA its more like a third.\n\nSuch is WA's need for gas, he notes the state uses more of the fuel in its own economy than all of the eastern states combined despite having a much smaller population.\n\nWoodside intends to build two floating production storage and offloading facilities, which look like big ships, for the Browse Project. (Supplied: Woodside)\n\n\"Western Australia has a long history of gas usage going back to the 80s,\" Mr Lewis says.\n\n\"It's very significant for the state.\"\n\nAccording to Mr Lewis, the North West Shelf itself marked the beginning of WA's modern gas industry and, more broadly, Australia's presence as an LNG superpower.\n\nBut he notes the fields which have underpinned the North West Shelf and its colossal importance — the facility once accounted for 1 per cent of Australia's economy — are in terminal decline.\n\nKeeping a huge asset alive for longer\n\nTo that end, Mr Lewis says the decision to extend the life of the gas plant is aimed at solving two problems — keeping a huge, valuable asset alive for longer and enabling the development of another one.\n\nBy piping Browse gas 900 kilometres south and processing it through the North West Shelf, he says Woodside et al would avoid the need for a new LNG plant that would come at huge cost.\n\nSecondly, and by extension, they would also pay less in processing — or \"tolling\" — fees to the Shelf than they would in depreciation at a vastly expensive new LNG plant.\n\nWoodside's Karratha Gas Plant would process gas from the Browse Basin. (Supplied: Woodside)\n\nAfter all, he says, the costs of building the North West Shelf have already been recovered by its owners.\n\n\"It's all about encouraging more gas supply into the state by using existing infrastructure,\" he says.\n\n\"And that's an economically efficient way to develop gas fields and gas projects — to use existing infrastructure to toll new gas to ensure there's enough gas for the state going forward.\"\n\nIn the absence of Browse, Mr Lewis reckons WA is headed for structural shortages in gas that could have painful consequences for the state's economy.\n\nAluminium refineries that are WA's biggest users of gas could struggle to survive, he warns, shortfalls would lead to sky-high prices that would also make it harder to build gas-fired generators needed to help replace retiring coal plants.\n\nPerversely, Mr Lewis says a raft of new critical minerals processing plants required for the energy transition could also be hit — or left on the drawing board.\n\nOn Western Australia's Burrup Peninsula, sacred Aboriginal rock art sits near a major gas plant and other chemical plants. (ABC News: Charlie McLean)\n\n\"It becomes pretty challenging,\" Mr Lewis says, if Browse is never developed.\n\n\"The market operator forecast is there won't be sufficient supply from around 2028, 2029 onwards unless significant new amounts of gas come into the market.\n\n\"And that's really just a function of existing fields in decline.\"\n\nFor Mr Wilkes and Mr Lewis, an extension of the North West Shelf's operating licence is one thing, but access to enough gas to keep its giant refrigerators turning natural gas into LNG is another.\n\nA mockery of Australia's greenhouse gas ambitions\n\nThere are already indications about what might happen in the event of a failure on that front.\n\n'See you in court': Climate advocates left devastated by gas project decision Photo shows Giant metal pipes form part of the Karratha gas plant, with two workers dwarfed by its size. The Greens, the Australian Conservation Federation and traditional owners are among those expressing their opposition to Woodside's North West Shelf expansion approval.\n\nLast year, Woodside shut one of these refrigerators — or trains as they are known in the industry — that had been part of the original development more than 40 years ago.\n\n\"There are several implications, aren't there,\" says Mr Wilkes when asked about what would happen if insufficient amounts of gas are found to replace depleting supplies at the North West Shelf.\n\n\"One is that facility gets dismantled and abandoned earlier than it would have done otherwise.\n\n\"Another is the gas never gets to market, never gets produced.\"\n\nFor Mr Hillman from the ACCR, that would be best outcome.\n\nHe reckons the dogged pursuit of Browse by its corporate and political backers flies in the face of commercial common sense, saying the project comes with huge risks and may never be profitable.\n\nBowse's plans could fly in the face of plans to wipe out Australia's greenhouse gas emissions. (Supplied: Australian Institute of Marine Science)\n\nWorse still, he argues, Browse would make a mockery of Australia's ambitions to stamp out greenhouse gas emissions and decarbonise by the middle of the century.\n\n\"This just enables Woodside to continue making bad decisions with investor funds,\" Mr Hillman says.\n\n\"It enables Woodside to chase this dream of investing in this project which it's been trying and failing to do for years.\n\n\"We don't think Browse stacks up financially, but that doesn't mean the project won't happen.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/tips-for-introverts-to-become-more-socially-confident-20250529-p5m399.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tips for introverts to become more socially confident",
        "publish_date": "Thu, 29 May 2025 12:01:08 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Tips for introverts to become more socially confident\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/wealthy-people-are-already-preparing-for-the-new-super-tax-here-s-how-20250528-p5m2sm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wealthy people are already preparing for the new super tax. Here’s how",
        "publish_date": "Thu, 29 May 2025 11:54:51 +1000",
        "category": "finance",
        "authors": [
            "Millie Muroi"
        ],
        "text": "High net worth individuals are already funnelling their super into trusts and housing for their children, and financial advisers say there will likely be a bigger exodus once the federal government’s new tax on superannuation earnings comes into play.\n\nWhile the tax change has not yet passed parliament, and the government will need to make concessions to secure support from the Greens, people with super balances larger than $3 million have already begun reassessing their investment strategies.\n\nThe tax change will only affect about one in 200 Australians, but the impact could be bigger over time. Credit: iStock\n\nThe change, set to start from July, will double the tax rate for superannuation earnings from 15 per cent to 30 per cent for the portion above $3 million in a super balance, including unrealised capital gains on amounts above this threshold. The move is expected to raise $2.7 billion in its first year of operation.\n\nFinancial and tax advisers who deal with high net worth clients, including those with self-managed super funds, said many had been rattled by the incoming change.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/us-trade-court-blocks-trump-s-liberation-day-tariffs-20250529-p5m36g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "US court blocks Trump’s tariffs, rules president exceeded his authority",
        "publish_date": "Thu, 29 May 2025 11:52:34 +1000",
        "category": "finance",
        "authors": [
            "Dietrich Knauth",
            "Daniel Wiessner"
        ],
        "text": "New York: A US trade court has blocked President Donald Trump’s tariffs from taking effect, ruling that the president overstepped his authority by imposing across-the-board duties on imports from countries that sell more to the United States than they buy.\n\nThe Court of International Trade on Thursday (AEST) said the US Constitution gives Congress the exclusive authority to regulate commerce with other countries, and it could not be overridden by the president’s emergency powers to safeguard the US economy.\n\nUS President Donald Trump. Credit: Bloomberg\n\n“The court does not pass upon the wisdom or likely effectiveness of the President’s use of tariffs as leverage. That use is impermissible not because it is unwise or ineffective, but because [federal law] does not allow it,” a three-judge panel said in the decision.\n\nMinutes later, the Trump administration filed a notice of appeal and questioned the authority of the court. The decisions of the Manhattan-based Court of International Trade, which hears disputes involving international trade and customs laws, can be appealed to the US Court of Appeals for the Federal Circuit in Washington, DC, and ultimately the US Supreme Court.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/drury-serves-secret-ban-for-inappropriate-comment-20250529-p5m38x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Drury serves secret ban for inappropriate comment",
        "publish_date": "Thu, 29 May 2025 11:50:43 +1000",
        "category": "finance",
        "authors": [],
        "text": "Drury serves secret ban for inappropriate comment\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/glacier-collapse-covers-swiss-village-20250529-p5m391.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Glacier collapse covers Swiss village",
        "publish_date": "Thu, 29 May 2025 11:50:04 +1000",
        "category": "finance",
        "authors": [],
        "text": "Glacier collapse covers Swiss village\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/disrespectful-footy-commentary-war-between-seven-foxtel-gets-personal-20250528-p5m2zn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Disrespectful’: Footy commentary war between Seven, Foxtel gets personal",
        "publish_date": "Thu, 29 May 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "The Seven football advertisement which ran in the Herald Sun on Tuesday, May 27. Credit: Herald Sun An industry expert said the ad would cost between $8000 and $16,000. The message was simple, but multilayered, placed provocatively in a News Corp paper – the Rupert Murdoch company that will hand control of Foxtel to UK sports streaming service DAZN in the second half of this year as part of a $3.4 billion deal. When asked about the ad on Tuesday, Seven’s director of sport Chris Jones said the network wanted people to know they would “turn up and be at every single match” they covered this year. “That comes at great expense, but it certainly has a big impact on the coverage and makes the commentators’ lives a whole heap easier,” Jones said. “It is a really important message for us to put out.” When asked about Taylor’s jab at Fox, Jones said he loved it when BT was being himself and calling uninhibited. Taylor was contacted for comment.\n\n“It’s very difficult as a lead caller or as an expert commentator to be able to get the full perspective of what is going on when they are not at the ground,” Jones said. “It is something that we are really happy to invest in because we think it has a material impact on the coverage. Seven’s Brian Taylor had a crack at Fox Footy. Credit: Simon Schluter “So for BT to be able to be there and to be able to get down to ground level, talk the players before the game, speak to those in and around the team, and then be able to have that full perspective of the ground – it is certainly something that gives him the best chance of calling and being his best.” Jones would not be drawn on Foxtel’s decision to call a Melbourne match from its Melbourne studio.\n\nLoading “What I want to do is always focus on what Channel Seven are doing,” he said. “I don’t have a view on what others are doing. But I do know what makes our coverage the best it can possibly be, and being at venues is something that we’ve put a major focus on, which is why we will be at every game this year.” Foxtel declined to comment, but the company is flying a commentary team to Brisbane to call Thursday’s match between the Lions and Essendon at the Gabba. Helping anchor Seven’s Thursday night coverage will be Jones’ No.1 recruit and chief agitator Kane Cornes, who dominated coverage last week by having a verbal dust-up with Western Bulldogs coach Luke Beveridge before the game.\n\nCornes continues to make headlines after last year defecting from Nine, publisher of this masthead, in a move that sparked a battleground on a different front in the footy wars. Jones poached Cornes as well as his long-time friend Craig Hutchison and award-winning journalist Caroline Wilson from Nine to create Seven’s mid-week footy panel, The Agenda Setters, a news-breaking and analytical program that goes head-to-head with Nine’s Footy Classified. Seven’s team on the Monday night edition of The Agenda Setters. Jones also recruited former Fox Footy headline act Nick Riewoldt to join Seven’s coverage, while Shaun Burgoyne jumped from Seven to Fox and Leigh Matthews crossed from Nine to Fox. “What we have done this year is create a seven-day-a-week strategy where there is brand-new football content every day of the week,” Jones said.\n\n“That is a strategy that clearly has worked with many new shows, new attitudes, and we are very proud of what we have been able to do to this point in the season, but we have got a lot of work to do still.” This season, Fox Footy has assigned a commentary team for every match of every round, rather than last year’s model of taking Seven’s feed when the free-to-air network was the host broadcaster. Just who is winning the war is yet to emerge as the networks continue to cobble together their mid-season ratings and accompanying spin. On Thursday morning, Foxtel released figures trumpeting the success of its sport streaming service Kayo Sports, saying Kayo’s year-on-year numbers were up 25 per cent, Thursday nights were up 41 per cent and Friday nights 30 per cent. Fox Footy numbers were not released. The Collingwood-Geelong clash in round eight on a Saturday night was Kayo’s most streamed match of the season with an audience of 389,000, while its Saturday audiences are up 27 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/gallen-snubs-sbw-at-boxing-presser-20250520-p5m0ox.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gallen snubs SBW at boxing presser",
        "publish_date": "Thu, 29 May 2025 11:44:15 +1000",
        "category": "sports",
        "authors": [],
        "text": "Gallen snubs SBW at boxing presser\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/the-blues-win-was-decided-in-the-selection-room-the-rest-of-the-series-will-be-too-20250528-p5m31k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Blues win was decided in the selection room. The rest of the series will be, too",
        "publish_date": "Thu, 29 May 2025 11:41:38 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Back when he was coaching the Roosters, Jack Gibson would receive selection advice – albeit unsolicited – from the club’s backer, Kerry Packer.\n\nFiguring the money he tipped in entitled him to a say, Packer would contact club boss Ron Jones with his team list for the week. When it was relayed to Gibson, the original supercoach delivered his verdict.\n\n“That’s a very good team,” Gibson mused. “But it won’t be the f---king team running onto the paddock.”\n\nIf there is one inalienable truth in rugby league, it is that the coach lives and dies by their selections. It is a lesson Laurie Daley has learnt the hard way.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/swiss-alpine-village-wiped-out-by-collapsing-glacier-20250529-p5m382.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Swiss alpine village wiped out by collapsing glacier",
        "publish_date": "Thu, 29 May 2025 11:39:23 +1000",
        "category": "finance",
        "authors": [],
        "text": "Swiss alpine village wiped out by collapsing glacier\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-queensland-needs-an-extra-350-mental-health-beds-20250528-p5m2wk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Court rules Story Bridge protest can’t go ahead | PM criticises council over bridge maintenance | Queensland ‘needs an extra 350 mental health beds’",
        "publish_date": "Thu, 29 May 2025 11:33:04 +1000",
        "category": "finance",
        "authors": [],
        "text": "Brisbane Lord Mayor Adrian Schrinner has bitten back after Prime Minister Anthony Albanese criticised the council’s management of the Story Bridge:\n\nI’ve been working closely with Federal Minister King, however, I’m also happy to brief the Prime Minister on the independent report written by respected experts, which found we’ve been excellent stewards of the Story Bridge.\n\nAs the report noted, we have invested more than $120 million into maintaining the Story Bridge over the past 20 years in addition to investing $3 million into ongoing maintenance every year over the long term.\n\nThe Story Bridge is an 85-year-old national icon that was only built to last 100 years and we want to restore it so it can last another 100 years, just like we did with City Hall.\n\nThe latest advice states the Story Bridge footpaths would need to be replaced “in the next two to five years,” however, we’re progressing a replacement sooner to ensure they’re safe.\n\nWhat we’re proposing now is a long-term restoration project over the next 15 to 20 years, just like what has been undertaken on the Sydney Harbour Bridge in recent times.\n\nThe state and federal governments collect 97 cents in every tax dollar paid, which is why we’re saying no to a toll and yes to sustained investment from all three levels of government.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/why-jesse-southwell-is-poised-to-be-nsw-s-halfback-for-next-10-years-20250528-p5m2t3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Jesse Southwell is poised to be NSW’s halfback for next 10 years",
        "publish_date": "Thu, 29 May 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "Andrew Johns describes her as “one of my favourites”, and NSW tyro Jesse Southwell has a chance to entrench herself as the Blues’ long-term halfback by steering them to a State of Origin series whitewash in Newcastle on Thursday.\n\nThe 20-year-old halfback has already helped NSW clinch the title with victories in the first two games, and the Blues will be chasing a piece of history by becoming the first women’s team to complete a 3-0 clean sweep.\n\nAs was the case with Johns 30 years ago, Southwell’s first Origin experience was underwhelming.\n\nJohns was dropped after his first two Origins in 1995, only to return 12 months later as a dominant force in a 3-0 series triumph. The rest, as they say, is history.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/from-wastewater-to-your-tap-20250528-p5m32c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From wastewater to your tap",
        "publish_date": "Thu, 29 May 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "From wastewater to your tap\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/this-50m-park-poses-an-unlikely-threat-to-sydney-s-new-airport-20250528-p5m2vk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This $50m park poses an unlikely threat to Sydney’s new airport",
        "publish_date": "Thu, 29 May 2025 11:29:43 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "Plans to build a $50 million urban park near Western Sydney Airport have sparked fears of strikes on low-flying aircraft due to a spike in bats and birds that could be drawn to the sprawling green space.\n\nWestern Sydney Airport officials have called for a range of wildlife management protocols to reduce risks from the park set to be built two kilometres from the airport’s runway.\n\nAn artist’s impression of the new parkland set to be built near the Western Sydney Airport. Credit: Bradfield Development Authority\n\nThe two-hectare green space, approved by the NSW government in March, will be located on top of the future Bradfield metro station and feature at least 550 trees, wetlands and open green spaces for public events.\n\nThe Bradfield Development Authority (BDA), which is delivering the project, hopes the park will become an “urban oasis” in the heart of Bradfield City Centre, which is projected to have a population of 3000 by 2036.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/in-the-sheds-at-halftime-blues-coaches-were-worried-zac-lomax-offered-to-fix-the-problem-20250528-p5m328.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "In the sheds at halftime, Blues coaches were worried. Zac Lomax offered to fix the problem.",
        "publish_date": "Thu, 29 May 2025 11:27:31 +1000",
        "category": "sports",
        "authors": [
            "Roy Masters"
        ],
        "text": "At half-time in Wednesday night’s absorbing State of Origin match, the NSW coaches huddled\n\ntogether to address a major problem: how to defend for 10 minutes with 12 men.\n\nThe Blues’ left winger, Brian To’o, had been ludicrously sinbinned for tackling his opposite, Xavier Coates, as both contested the ball in the air on the last tackle of the first half.\n\nThe bunker had achieved what Queensland could not by making the game more competitive and creating an opportunity for the maroons to eat into NSW’s 12-point lead.\n\nAs the coaches pondered their options, right-winger Zac Lomax approached them and volunteered to swap sides.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/west-coast-take-tom-mccarthy-with-first-pick-in-mid-season-draft-20250528-p5m2u7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Oh my god’: The best mates taken two picks apart in the AFL mid-season draft",
        "publish_date": "Thu, 29 May 2025 11:27:25 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan",
            "Michael Gleeson"
        ],
        "text": "Injury ravaged Essendon plunged on key forwards and a ruckman in the mid-season rookie draft, taking the son of Dermott Brereton’s partner as well as Carlton’s VFL captain, who was once drafted to Collingwood, among their haul of tall reinforcements.\n\nWith 10 players 190 centimetres or above on their injury list, the Bombers needed urgent back-up to get through the season, so they took 198cm tall forward Archer May with their first pick. May’s mother, Julie, is the long-term partner of Brereton, who through his storied career with Hawthorn was the long-term tormentor of their arch-rivals, the Bombers.\n\nArcher May has landed at Essendon, a club his mother’s partner, Hawthorn great Dermott Brereton (inset), long tormented in the 1980s. Credit: X / Getty\n\nThe Bombers also took ready-to-play 203 cm tall ruckman Lachlan Blakiston, who has been playing for East Fremantle in the WAFL with their second pick. They took medium/tall forward Oskar Smartt from their VFL program and, with their last pick, selected Liam McMahon, who is co-captain of Carlton’s VFL team. He has kicked 24 goals for the Blues in the VFL this season.\n\nMcMahon was taken by Collingwood with pick 31 in the 2020 national draft and lasted two years on the Magpies’ list. Given the injuries the Bombers are carrying, he could even now find himself playing against the Blues as soon as next round.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/joyce-says-hell-keep-campaigning-against-net-zero-midday-news-bulletin-29-may-2025/bkytv78uq",
        "title": "Joyce says he'll keep campaigning against net-zero | Midday News Bulletin 29 May 2025",
        "publish_date": "Thu, 29 May 2025 02:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nBarnaby Joyce has vowed to keep campaigning against net zero targets in the Coalition, despite being dumped from the frontbench.\n\n\n\n\n\nNational Party leader David Littleproud has not clarified if the party will stay committed to net zero emissions by 2050.\n\n\n\n\n\nMr Joyce says he accepts his demotion because that's a part of politics.\n\n\n\n\n\nBut he has told Channel Nine that he intends to be open about not accepting policies he argues are not right for his constituents.\n\n\n\n\n\n\"I'm going to focus very much on getting rid of net zero. You can see the silhouette of those heels. We don't want them covered in swindle factories, wind towers, solar panels. We have got to make sure that we keep the power price right for pensioners. They're more worried about power prices than they are about the Paris Agreement. So I am going to look after the pensioners before I look after Paris.\"\n\n\n\n\n\n+++\n\n\n\n\n\nPrime Minister Anthony Albanese has defended his government against allegations that defence spending is too low.\n\n\n\n\n\nThe Australian Strategic Policy Institute has released an analysis that claims the latest defence budget misses a crucial opportunity to prepare Australia's military and industrial base for future challenges.\n\n\n\n\n\nIt says the Defence Department needs to be more transparent, that the government has to commit to funding national resilience measures across the economy, and that Australia needs a defence communications strategy to combat nations with propaganda expertise.\n\n\n\n\n\nBut Mr Albanese has told the ABC the Institute's criticism is predictable, and the government is committed to lifting defence spending to 2.3 of Gross Domestic Product by the end of the decade.\n\n\n\n\n\n+++\n\n\n\n\n\nThe Tasmanian government has backed away from pursuing a treaty with the state's Indigenous people, four years after the consultation process began.\n\n\n\n\n\nA government-commissioned report tabled in 2021 had recommended working on treaty and truth-telling at the same time.\n\n\n\n\n\nThe government says it will instead be focusing on the truth-telling process with the appointment of truth and healing commissioners.\n\n\n\n\n\nIt's committed 4-point-4 million dollars over the next four years for Closing the Gap initiatives and other economic opportunities.\n\n\n\n\n\n+++\n\n\n\n\n\nAn United Nations aid warehouse in Gaza has been broken into by hungry Palestinians, as the UN warns the situation there is so bad, much-needed additional aid may be too late for many.\n\n\n\n\n\nThe U-N says two people have died and more have been injured in the incident at the warehouse in central Gaza.\n\n\n\n\n\nU-N Middle East envoy Sigrid Kaag says Israel's recent lifting of its blockade to allow aid into Gaza has so far been a case of too little, too late.\n\n\n\n\n\n\"On May 18th, the United Nations was informed by the Israeli authorities of the approval for the resumption of limited aid entry into Gaza. Since then, very limited numbers of goods have entered and have been distributed by the United Nations and its partners - but this is comparable to a lifeboat after the ship has sunk.\"\n\n\n\n\n\nThe U-N is continuing its calls for an immediate scale-up of aid allowed into Gaza by Israel, saying those still there need reassurance they won't starve.\n\n\n\n\n\n+++\n\n\n\n\n\nA federal trade court in the United States has blocked President Donald Trump's sweeping tariff measures on imports.\n\n\n\n\n\nMr Trump has bypassed U-S Congress to try and impose the tariffs, saying the 1977 Emergency Economic Powers Act gives him the power to impose them, because the U-S trade deficit amounts to a national emergency.\n\n\n\n\n\nBut the three-judge panel in New York has ruled Mr Trump has exceeded his authority.\n\n\n\n\n\nMr Trump's administration is expected to appeal against the decision.\n\n\n\n\n\nMr Trump declared the day the tariffs came in last month to be Liberation Day.\n\n\n\n\n\nHis measures impose tariffs on imports from most countries around the world, including a ten per cent baseline tariff on Australia.\n\n\n\n\n\n+++\n\n\n\n\n\nElon Musk says he is leaving his US government role as a top adviser to US President Donald Trump.\n\n\n\n\n\nThe billionaire entrepreneur posted his decision on X, his social media website.\n\n\n\n\n\nMusk's departure comes just one day after he criticised the tax bill centrepiece of Mr Trump's legislative agenda, saying it increased the federal deficit and undermined the work of the Department of Government Efficiency, or DOGE.\n\n\n\n\n\nMusk's step back from government work means he will be rededicating himself to companies like the rocket manufacturer SpaceX and electric car maker Tesla, which has experienced a 49 percent drop in European sales in the last month alone.\n\n\n\n\n\n+++\n\n\n\n\n\nFrench surgeon Joel Le Scouarnec has been sentenced to 20 years in prison, after pleading guilty to raping and sexually assaulting 299 people.\n\n\n\n\n\nMany of his victims were children and patients in his care, including those who were under anaesthetic when he abused them.\n\n\n\n\n\nProsecutors say there may be another trial on behalf of those whose victimisation was not included in this case.\n\n\n\n\n\nThere are ongoing investigations into whether agencies, including public hospitals, could have prevented the abuse - but a mother of one of the victim-survivors identified as Catherine has called this a crucial first step.\n\n\n\n\n\n(French to English translation)\" I see this as a mother. All I hope is that this man can't do it again. I have grandchildren. It's important to me that this stops and that, at the national level, at the institutional level, at all levels, there is a real awareness that our children are in danger. I really want to see this change.\"\n\n\n\n\n\n+++\n\n\n\n\n\nIn rugby league... Queensland coach Billy Slater says his team has to be more disciplined if they want to beat New South Wales.\n\n\n\n\n\nThe Maroons must now come from behind to win this year's State of Origin series after losing game one at home, 18 points to 6.\n\n\n\n\n\nSlater says his players have the talent to win, but their discipline let them down.\n\n\n\n\n\n\"I know what this team's capable of. And that's why- you can probably see- I'm disappointed. Because they haven't played their best footy. And I feel responsible to try and help them get there. So, yeah, it's definitely not a personnel thing. To be honest, they had a great attitude as well. But... to the discipline side of the game, they attitude wasn't good enough, no.\"\n\n\n\n\n\nZac Lomax scored two tries for the Blues in their victory, whilst Blues forward Payne Haas won the official player of the match award.\n\n\n\n\n\nQueensland now must win game two to keep the series alive.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/sussan-ley-defends-makeup-of-her-new-cabinet/rls0yyu4b",
        "title": "'The party is led by a woman': Sussan Ley defends makeup of her new cabinet",
        "publish_date": "Thu, 29 May 2025 01:26:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "A day after the Coalition reunited following an eight-day Liberal–Nationals spli t and the unveiling of a new shadow ministry, Opposition leader Sussan Ley has sought to differentiate her leadership style from that of her predecessor, Peter Dutton\n\n\n\n\n\n\"I said we would do things differently and I would bring a fresh approach,\" the Opposition leader told ABC News Breakfast on Thursday.\n\n\n\n\n\n\"I intend to be very consultative, very approachable, and to listen carefully, not just to my colleagues in the party room ... But listening to the Australian people, not lecturing from the top down, listening from the ground up.\n\n\n\n\n\n\"It's tough times for many Australians out there. We got a tough message from them at the last election, and we need to approach communities that we seek to represent with humility.\"\n\n\n\nLISTEN TO Back together again: a new Coalition deal after eight days apart SBS News 28/05/2025 04:43 Play\n\nWhy are there fewer women in the shadow ministry?\n\nLey unveiled the Coalition's new front bench on Wednesday, making several changes in the shadow ministry.\n\n\n\n\n\nWhile Ley is the Opposition's first female leader, the number of women in the cabinet has decreased compared to the previous term.\n\n\n\n\n\nWhen questioned on this, Ley said 40 per cent of her cabinet is \"made up of women\".\n\n\n\n\n\n\"The party is led by a woman. When we make the calls that we need to, I will be at the table for every single one of those big calls,\" she told the ABC.\n\n\n\n\n\nThere are 15 men and eight women in the new shadow cabinet, and 19 men and 11 women across the wider ministry. Peter Dutton's final shadow cabinet included 11 women and 12 men, and his wider ministry had 17 men and 13 women overall.\n\n\n\n\n\nJane Hume, former finance spokesperson, is one of the women who lost their role in the new Coalition cabinet.\n\n\n\nHume is known for her involvement in the Opposition's strategy during the elections to restrict work-from-home for public servants — a plan the Coalition ultimately ditched.\n\n\n\n\n\nLey said Hume's demotion was not related to this policy.\n\n\n\n\n\n\"This isn't about who is sitting at what table and what role they have. It's broader than that ... It's about every one of the 54 members of our party room having a role to play,\" she said.\n\n\n\n\n\n\"This is about putting the best team on the field and respecting Jane's talents ... The communication skills of so many of my team mean that they will feature prominently across the debate and carry that argument and that advocacy forward.\"\n\n\n\n'Last week was a messy week'\n\nFormer National Party leader Michael McCormack, who had been advocating for the reunification of the Coalition, said the parties \"shouldn't have split in the first place.\"\n\n\n\n\n\n\"Last week was a messy week ... It looked messy and people out in voter land must have looked and thought, what on earth are those people doing, naval-gazing, talking about themselves?\" he told ABC News Breakfast.\n\n\n\n\n\n\"The Liberals and Nationals have been very good, very, very good for decades, and it was madness that we separated, but it’s taken a week, we’re back together, and thankfully that is so.\"\n\n\n\n\n\nAsked if Nationals leader David Littleproud had \"misled the party room\", McCormack said: \"We weren't told everything that went on between Sussan Ley and David [Littleproud], ... That was, I suppose, a thing that David chose to do,\" he said.\n\n\n\nThe former party leader, who had previously criticised Littleproud's handling of the split, acknowledged that he approached Ley for the reunification.\n\n\n\n\n\nWhen questioned about whether he had been punished for this by not being offered any frontbench positions, he said, \"you have to ask David Littleproud about that\".\n\n\n\n\n\nLittleproud has previously denied claims of vengeance, pointing out his plans on \"generational change\".\n\n\n\n\n\nIn response to a question on whether he will lead the party again, McCormack said: \"You never say never.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/trade-court-bocks-donald-trumps-liberation-day-tariffs/dpwiyq2si",
        "title": "US trade court blocks Donald Trump's 'Liberation Day' tariffs",
        "publish_date": "Thu, 29 May 2025 00:18:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "A United States trade court has blocked Donald Trump's \"Liberation Day\" tariffs from going into effect, ruling that the president overstepped his authority by imposing across-the-board duties on imports from nations that sell more to the US than they buy.\n\n\n\n\n\nThe Manhattan-based Court of International Trade said the US constitution gives Congress exclusive authority to regulate commerce with other countries that is not overridden by the president's emergency powers to safeguard the US economy.\n\n\n\n\n\n\"The court does not pass upon the wisdom or likely effectiveness of the President's use of tariffs as leverage. That use is impermissible not because it is unwise or ineffective, but because [federal law] does not allow it,\" a three-judge panel said in the decision.\n\n\n\n\n\nThe ruling came in a pair of lawsuits, one filed by the nonpartisan Liberty Justice Center on behalf of five small US businesses that import goods from countries targeted by the duties and the other by 13 US states.\n\n\n\nThe companies, which range from a New York wine and spirits importer to a Virginia-based maker of educational kits and musical instruments, have said the tariffs will hurt their ability to do business.\n\n\n\n\n\nAt least five other legal challenges to the tariffs are pending.\n\n\n\n\n\nOregon attorney-general Dan Rayfield, a Democrat whose office is leading the states' lawsuit, called Trump's tariffs unlawful, reckless and economically devastating.\n\n\n\n\n\n\"This ruling reaffirms that our laws matter, and that trade decisions can't be made on the president's whim,\" Rayfield said in a statement.\n\n\n\nTrump has claimed broad authority to set tariffs under the International Emergency Economic Powers Act (IEEPA), which is meant to address \"unusual and extraordinary\" threats during a national emergency.\n\n\n\n\n\nThe law has historically been used to impose sanctions on enemies of the US or freeze their assets. Trump is the first US president to use it to impose tariffs.\n\n\n\n\n\nThe justice department has said the lawsuits should be dismissed because the plaintiffs have not been harmed by tariffs that they have not yet paid, and because only Congress, not private businesses, can challenge a national emergency declared by the president under IEEPA.\n\n\n\n\n\nIn imposing the tariffs in early April, Trump called the trade deficit a national emergency that justified his 10 per cent across-the-board tariffs on all imports, with higher rates for countries with which the US has the largest trade deficits, particularly China.\n\n\n\nMany of those country-specific tariffs were subsequently paused. The Trump administration announced on 12 May that it would also temporarily reduce the steepest tariffs on China while working on a longer-term trade deal. Both countries agreed to cut tariffs on each other for at least 90 days.\n\n\n\n\n\nTrump's on-and-off-again tariffs, which he has said are intended to restore US manufacturing capability, have shocked US financial markets.\n\n\n\n\n\nThe US dollar rose against both the Swiss franc, a traditional currency safe-haven, and the Japanese yen following the court decision.\n\n\n\n\n\nThe trade court's decision can be appealed to the US Court of Appeals for the Federal Circuit in Washington, and ultimately the US Supreme Court.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/a-new-covid-variant-is-driving-up-infections-in-australia-heres-what-to-know-about-nb-1-8-1/tr67z8yql",
        "title": "A new COVID-19 variant is driving up infections in Australia. Here's what to know about NB.1.8.1",
        "publish_date": "Wed, 28 May 2025 19:33:33 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "As we enter the colder months in Australia, COVID-19 is making headlines again, this time due to the emergence of a new variant: NB.1.8.1.\n\n\n\n\n\nLast week, the World Health Organization (WHO) designated NB.1.8.1 as a \"variant under monitoring\", owing to its growing global spread and some notable characteristics which could set it apart from earlier variants.\n\n\n\n\n\nSo, what do you need to know about this new variant?\n\n\n\nThe current COVID-19 situation\n\nMore than five years since COVID-19 was initially declared a pandemic, we're still experiencing regular waves of infections.\n\n\n\n\n\nIt's more difficult to track the occurrence of the virus nowadays, as fewer people are testing and reporting infections. But available data suggests in late May 2025, case numbers in Australia were ticking upwards.\n\n\n\nGenomic sequencing has confirmed NB.1.8.1 is among the circulating strains in Australia, and is generally increasing. Of cases sequenced up to 6 May across Australia, NB.1.8.1 ranged from less than 10 per cent in South Australia to more than 40 per cent in Victoria.\n\n\n\n\n\nWastewater surveillance in Western Australia has determined NB.1.8.1 is now the dominant variant in wastewater samples collected in Perth.\n\n\n\n\n\nInternationally, NB.1.8.1 is also growing. By late April 2025, it comprised roughly 10.7 per cent of all submitted sequences — up from just 2.5 per cent four weeks before. While the absolute number of cases sequenced was still modest, this consistent upward trend has prompted closer monitoring by international public health agencies.\n\n\n\n\n\nNB.1.8.1 has been spreading particularly in Asia — it was the dominant variant in Hong Kong and China at the end of April.\n\n\n\nWhere does this variant come from?\n\nAccording to the WHO, NB.1.8.1 was first detected in samples collected in January 2025.\n\n\n\n\n\nIt's a sublineage of the Omicron variant, descending from the recombinant XDV lineage. \"Recombinant\" is where a new variant arises from the genetic mixing of two or more existing variants.\n\n\n\nWhat does the research say?\n\nLike its predecessors, NB.1.8.1 carries a suite of mutations in the spike protein. This is the protein on the surface of the virus that allows it to infect us, specifically via the ACE2 receptors, a \"doorway\" to our cells.\n\n\n\n\n\nThe mutations include T22N, F59S, G184S, A435S, V445H, and T478I. It's early days for this variant, so we don't have much data on what these changes mean yet. But a recent preprint (a study that has not yet been peer-reviewed) offers some clues about why NB.1.8.1 may be gathering traction.\n\n\n\nUsing lab-based models, researchers found NB.1.8.1 had the strongest binding affinity to the human ACE2 receptor of several variants tested — suggesting it may infect cells more efficiently than earlier strains.\n\n\n\n\n\nThe study also looked at how well antibodies from vaccinated or previously infected people could neutralise or \"block\" the variant. Results showed the neutralising response of antibodies was around 1.5 times lower against NB.1.8.1 compared to another recent variant, LP.8.1.1.\n\n\n\n\n\nThis means it's possible a person infected with NB.1.8.1 may be more likely to pass the virus on to someone else, compared to earlier variants.\n\n\n\nWhat are the symptoms?\n\nThe evidence so far suggests NB.1.8.1 may spread more easily and may partially sidestep immunity from prior infections or vaccination. These factors could explain its rise in sequencing data.\n\n\n\n\n\nBut importantly, the WHO has not yet observed any evidence it causes more severe disease compared to other variants.\n\n\n\n\n\nReports suggest symptoms of NB.1.8.1 should align closely with other Omicron subvariants.\n\n\n\n\n\nCommon symptoms include sore throat, fatigue, fever, mild cough, muscle aches and nasal congestion. Gastrointestinal symptoms may also occur in some cases.\n\n\n\nHow about the vaccine?\n\nThere's potential for this variant to play a significant role in Australia's winter respiratory season. Public health responses remain focused on close monitoring, continued genomic sequencing, and promoting the uptake of updated COVID-19 boosters.\n\n\n\n\n\nEven if neutralising antibody levels are modestly reduced against NB.1.8.1, the WHO has noted COVID-19 vaccines should still protect against severe disease with this variant.\n\n\n\n\n\nThe most recent booster available in Australia and many other countries targets JN.1, from which NB.1.8.1 is descended. So it makes sense that it should still offer good protection.\n\n\n\n\n\nAhead of winter and with a new variant on the scene, now may be a good time to consider another COVID-19 booster if you're eligible. For some people, particularly those who are medically vulnerable, COVID-19 can still be a serious disease.\n\n\n\n\n\nLara Herrero receives funding from the National Health and Medical Research Council.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/extension-of-north-west-shelf-gas-project-approved/elvkg37li",
        "title": "Extension of North West Shelf Gas Project approved",
        "publish_date": "Wed, 28 May 2025 10:58:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Extension of North West Shelf Gas Project approved\n\nPublished 28 May 2025, 8:40 am\n\nFederal Environment Minister Murray Watt has approved the extension of Woodside's North West Shelf Gas Project for another forty years. The project is based on the Burrup Peninsula, also known as Murujuga, an area of immense cultural and environmental significance.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/nt-police-investigate-death-in-custody-of-yuendumu-man/wn0tqvsn5",
        "title": "NT police investigate death in custody of Yuendumu man",
        "publish_date": "Wed, 28 May 2025 10:42:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/reunited-coalition-reveals-new-shadow-cabinet/cnb8upp0u",
        "title": "Reunited Coalition reveals new shadow cabinet",
        "publish_date": "Wed, 28 May 2025 10:33:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Reunited Coalition reveals new shadow cabinet\n\nPublished 28 May 2025, 8:39 am\n\nEight days after the Coalition sensationally split up, the Liberal and Nationals are back together. It's a deal struck on key policies that paved the way for the unveiling of a shadow cabinet with plenty of surprises.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/inflation-in-check-but-many-basics-more-expensive/w7vz5x08d",
        "title": "Inflation in check but many basics more expensive",
        "publish_date": "Wed, 28 May 2025 08:29:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australias-new-regional-hotspot-for-city-leavers-as-sunshine-coast-slips/b5rq1rf8z",
        "title": "Australia's new regional hotspot for city leavers as Sunshine Coast slips",
        "publish_date": "Wed, 28 May 2025 05:11:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "Geelong has emerged as Australia's top regional pick for movers, according to a new report, as tree-changers leave capital cities at above pre-pandemic levels.\n\n\n\n\n\nThe bayside region in Victoria has become the most popular place for capital city escapees to settle, accounting for a share of 7.4 per cent of net migration from capital cities.\n\n\n\n\n\nIt marginally dethroned Queensland's Sunshine Coast, with a share of 7.3 per cent, according to the latest Regional Movers Index by the Regional Australia Institute and Commonwealth Bank.\n\n\n\n\n\nRounding out the top five regional picks were Lake Macquarie, NSW; Moorabool, Victoria; and Maitland, NSW.\n\n\n\nREAD MORE How much you could save by renting and buying regionally - and how to pull off a move\n\nThe Regional Movers Index, which uses Commonwealth Bank data, also shows most tree-changers are coming from Sydney and Melbourne.\n\n\n\n\n\n\"The nation's love affair with regional living is showing no signs of abating with 25 per cent more people moving from capital cities to the regions, than back in the opposite direction,\" Regional Australia Institute CEO Liz Ritchie said.\n\n\n\n\n\nThe number of capital city folk moving to Australia's regions each quarter has remained elevated since the onset of the pandemic through to the post-COVID-19 era, according to the report — at around 20.5 per cent higher than the pre-COVID average level of quarterly migration.\n\n\n\n\n\nHowever, a demographer and social researcher said that might not be entirely accurate and is at odds with other national population data.\n\n\n\n\n\n\"I don't think we're seeing a massive exodus of people from city areas to regional areas. And with that, I don't think we are going to start seeing people establish themselves as a first priority in these regional areas,\" Dr Liz Allen, from the Australian National University's Centre for Social Research and Policy, told SBS News.\n\n\n\nREAD MORE I was priced out of my city into a regional town. It was the best thing that ever happened to me\n\n\"That said, it is no surprise that regional areas like Greater Geelong are going to flourish because for a lot of the first home buyers, their most affordable areas are in these fringe areas.\"\n\n\n\n\n\nAccording to property data firm CoreLogic, Geelong's median house price was $715,574 in April, while in the Sunshine Coast it was $1,065,140.\n\n\n\nRegional growing pains\n\nGreater Geelong is Australia's largest regional council area, home to more than 282,000 people.\n\n\n\n\n\nIts rise on the regional migration leaderboard reflects a rise in popularity in regional Victoria as a whole, according to the report.\n\n\n\nA state breakdown of net migration in terms of the share of net migration out of capital cities and net migration into regional areas. Source: SBS News The state captured 34 per cent of the total net inflows into all of regional Australia during the March quarter, up 28 per cent year-on-year.\n\n\n\n\n\n\"Victoria is a very attractive place to be the vital social and economic infrastructure that seems to be really setting the right notes for residents there,\" Allen said.\n\n\n\n\n\n\"But that footprint is increasing at an alarming rate and in fact we're seeing the rates of increase and population growth occurring the fastest in regional areas ... which spells some really difficult times for policymakers and people wanting to build vital infrastructure.\"\n\n\n\n\n\nGeelong, in particular, is experiencing significant growing pains according to the council's draft five-year plan.\n\n\n\n\n\nLike most regional areas, Greater Geelong is confronting a housing shortage, ageing infrastructure and congestion as it expands.\n\n\n\n\n\n\"Greater Geelong is one of Australia's fastest-growing regions, and managing this expansion will be crucial to our success over the coming decades,\" the plan says.\n\n\n\n\n\nTo support the demand for housing, the Victorian government has set a target of an extra 128,600 dwellings in Greater Geelong by 2051.\n\n\n\nThe number of capital-city folk moving into Australia's regions each quarter is overall higher the onset of the COVID-19 pandemic. Source: SBS News Maitland, NSW's Hunter Valley, is also experiencing rapid growth, attracting new residents from both the capitals and other regions.\n\n\n\n\n\nThe region, which had a population of 78,000 in 2016, is on track to exceed 100,000 people by the end of 2026, with six new residents arriving every day, according to a council report.\n\n\n\n\n\n\"We've got to be really careful here,\" Allen said.\n\n\n\n\n\n\"We have an opportunity to examine what kind of footprint — in both an environmental and social way — we want for this country.\n\n\n\n\n\n\"We can't just have growth going on without us understanding what needs are for people in areas.\"\n\n\n\n\n\n— With additional reporting by Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/whos-in-and-whos-out-ley-littleproud-name-new-frontbench-after-coalition-reunites/9zw3deoi9",
        "title": "Who's in, and who's out? Ley, Littleproud name new frontbench after Coalition reunites",
        "publish_date": "Wed, 28 May 2025 01:26:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Liberal leader Sussan Ley denies punishing colleagues when deciding her new shadow ministry, revealed hours after the Coalition renewed their decades-long partnership.\n\n\n\n\n\nLey said she had \"balanced experience with new talent\" and talked to all 54 members of her party room before announcing the roles.\n\n\n\n\n\nThe Nationals got six positions, one fewer than leader David Littleproud had pushed for. Littleproud will remain as agriculture spokesperson.\n\n\n\n\n\nThe Liberals, who are still the majority party despite losing 13 lower house seats, got the biggest portfolios.\n\n\n\n\n\nTed O'Brien, architect of the Coalition's nuclear election pitch, has been promoted to treasury spokesperson.\n\n\n\n\n\nHe replaces Angus Taylor, who ran against Ley for the Liberal leadership and has since been moved to be defence spokesperson.\n\n\n\nMichaelia Cash has been elevated to foreign ministry spokesperson, James Paterson is the finance spokesperson and Andrew Hastie will take on home affairs.\n\n\n\n\n\nJulian Leeser retakes his old role as shadow attorney-general after he resigned from the shadow cabinet to campaign for the Indigenous Voice referendum in 2023.\n\n\n\n\n\nDan Tehan takes on energy and emissions reduction, with Ley downplaying the removal of climate change from the portfolio title.\n\n\n\n\n\n\"I look at the substance of what's going on and the policy areas and don't get hung up on the titles,\" she said.\n\n\n\n\n\nNationals deputy Kevin Hogan retains trade and Senate leader Bridget McKenzie keeps infrastructure.\n\n\n\nWho has been demoted?\n\nA notable absence from the shadow cabinet was former finance spokesperson Jane Hume, who oversaw the Coalition's disastrous work-from-home policy.\n\n\n\n\n\nLey denied Hume and other conservatives, such as Sarah Henderson, had been punished for supporting Angus Taylor during the Liberal leadership spill.\n\n\n\n\n\n\"Absolutely not. I'm not going to reflect on the qualities of individuals with respect to the qualities of other individuals. I don't think that's a fair question,\" she said.\n\n\n\nFormer finance spokesperson Jane Hume has been demoted from cabinet. Source: AAP / . Jacinta Nampijinpa Price was demoted to the outer ministry after defecting from the Nationals to the Liberals.\n\n\n\n\n\nShe will become the Opposition's defence industry and personnel spokesperson.\n\n\n\n\n\nLittleproud denied similar claims of vengeance after both former national leader Michael McCormack and Barnaby Joyce questioned his leadership in recent days and were not offered positions.\n\n\n\n\n\n\"I made it clear when I became leader three years ago that I wanted to have generational change but, at that point, wanted to respect the leadership that was before me to allow them to impart their wisdom,\" Littleproud said.\n\n\n\n\n\nQueensland senator Matt Canavan is also absent from the shadow ministry, allowing him to break cabinet solidarity on issues such as net zero.\n\n\n\nREAD MORE Sussan Ley faces net zero challenge amid personal struggles in first week\n\nLey denies 'bitter break up' amid new Coalition agreement\n\nLey denied the Coalition's temporary split had been \"bitter\", maintaining that she gets along well with Littleproud and looks forward to moving \"forward together\".\n\n\n\n\n\n\"Personally, David and I will be friends,\" she said.\n\n\n\n\n\n\"I think a woman who got her start in the shearing sheds of western Queensland can always find something to talk about over a steak and a beer, David, with you, the person who represents those communities now.\"\n\n\n\n\n\nLast Tuesday, Nationals leader David Littleproud announced his party would be leaving the Coalition as it wanted to cement four policy areas into the agreement.\n\n\n\nThis included lifting a moratorium on nuclear, powers to split up the major supermarkets, a $20 billion regional fund and mobile coverage in the bush.\n\n\n\n\n\nThe Liberals wanted time to review their election policy agenda after a historic loss but offered to support the demands \"in principle\" by the end of the week.\n\n\n\n\n\nAfter days of conjecture over the terms of the split, the Nationals party room met on Wednesday morning to sign off on the agreement.\n\n\n\n\n\nLittleproud noted negotiations over the week with Ley had been effective, despite \"gossip and innuendo through the halls of the gallery\", seemingly a shot at the Canberra reporters.\n\n\n\n\n\n\"Sussan and I have always kept the lines of communication open. We’ve risen above that. We haven’t let us get distracted by what’s been reported.\"\n\n\n\n\n\nWith additional reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/tips-for-introverts-to-become-more-socially-confident-20250529-p5m399.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tips for introverts to become more socially confident",
        "publish_date": "Thu, 29 May 2025 12:01:08 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Tips for introverts to become more socially confident\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/wealthy-people-are-already-preparing-for-the-new-super-tax-here-s-how-20250528-p5m2sm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wealthy people are already preparing for the new super tax. Here’s how",
        "publish_date": "Thu, 29 May 2025 11:54:51 +1000",
        "category": "finance",
        "authors": [
            "Millie Muroi"
        ],
        "text": "High net worth individuals are already funnelling their super into trusts and housing for their children, and financial advisers say there will likely be a bigger exodus once the federal government’s new tax on superannuation earnings comes into play.\n\nWhile the tax change has not yet passed parliament, and the government will need to make concessions to secure support from the Greens, people with super balances larger than $3 million have already begun reassessing their investment strategies.\n\nThe tax change will only affect about one in 200 Australians, but the impact could be bigger over time. Credit: iStock\n\nThe change, set to start from July, will double the tax rate for superannuation earnings from 15 per cent to 30 per cent for the portion above $3 million in a super balance, including unrealised capital gains on amounts above this threshold. The move is expected to raise $2.7 billion in its first year of operation.\n\nFinancial and tax advisers who deal with high net worth clients, including those with self-managed super funds, said many had been rattled by the incoming change.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/us-trade-court-blocks-trump-s-liberation-day-tariffs-20250529-p5m36g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "US court blocks Trump’s tariffs, rules president exceeded his authority",
        "publish_date": "Thu, 29 May 2025 11:52:34 +1000",
        "category": "finance",
        "authors": [
            "Dietrich Knauth",
            "Daniel Wiessner"
        ],
        "text": "New York: A US trade court has blocked President Donald Trump’s tariffs from taking effect, ruling that the president overstepped his authority by imposing across-the-board duties on imports from countries that sell more to the United States than they buy.\n\nThe Court of International Trade on Thursday (AEST) said the US Constitution gives Congress the exclusive authority to regulate commerce with other countries, and it could not be overridden by the president’s emergency powers to safeguard the US economy.\n\nUS President Donald Trump. Credit: Bloomberg\n\n“The court does not pass upon the wisdom or likely effectiveness of the President’s use of tariffs as leverage. That use is impermissible not because it is unwise or ineffective, but because [federal law] does not allow it,” a three-judge panel said in the decision.\n\nMinutes later, the Trump administration filed a notice of appeal and questioned the authority of the court. The decisions of the Manhattan-based Court of International Trade, which hears disputes involving international trade and customs laws, can be appealed to the US Court of Appeals for the Federal Circuit in Washington, DC, and ultimately the US Supreme Court.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/drury-serves-secret-ban-for-inappropriate-comment-20250529-p5m38x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Drury serves secret ban for inappropriate comment",
        "publish_date": "Thu, 29 May 2025 11:50:43 +1000",
        "category": "finance",
        "authors": [],
        "text": "Drury serves secret ban for inappropriate comment\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/glacier-collapse-covers-swiss-village-20250529-p5m391.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Glacier collapse covers Swiss village",
        "publish_date": "Thu, 29 May 2025 11:50:04 +1000",
        "category": "finance",
        "authors": [],
        "text": "Glacier collapse covers Swiss village\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/disrespectful-footy-commentary-war-between-seven-foxtel-gets-personal-20250528-p5m2zn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Disrespectful’: Footy commentary war between Seven, Foxtel gets personal",
        "publish_date": "Thu, 29 May 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "The Seven football advertisement which ran in the Herald Sun on Tuesday, May 27. Credit: Herald Sun An industry expert said the ad would cost between $8000 and $16,000. The message was simple, but multilayered, placed provocatively in a News Corp paper – the Rupert Murdoch company that will hand control of Foxtel to UK sports streaming service DAZN in the second half of this year as part of a $3.4 billion deal. When asked about the ad on Tuesday, Seven’s director of sport Chris Jones said the network wanted people to know they would “turn up and be at every single match” they covered this year. “That comes at great expense, but it certainly has a big impact on the coverage and makes the commentators’ lives a whole heap easier,” Jones said. “It is a really important message for us to put out.” When asked about Taylor’s jab at Fox, Jones said he loved it when BT was being himself and calling uninhibited. Taylor was contacted for comment.\n\n“It’s very difficult as a lead caller or as an expert commentator to be able to get the full perspective of what is going on when they are not at the ground,” Jones said. “It is something that we are really happy to invest in because we think it has a material impact on the coverage. Seven’s Brian Taylor had a crack at Fox Footy. Credit: Simon Schluter “So for BT to be able to be there and to be able to get down to ground level, talk the players before the game, speak to those in and around the team, and then be able to have that full perspective of the ground – it is certainly something that gives him the best chance of calling and being his best.” Jones would not be drawn on Foxtel’s decision to call a Melbourne match from its Melbourne studio.\n\nLoading “What I want to do is always focus on what Channel Seven are doing,” he said. “I don’t have a view on what others are doing. But I do know what makes our coverage the best it can possibly be, and being at venues is something that we’ve put a major focus on, which is why we will be at every game this year.” Foxtel declined to comment, but the company is flying a commentary team to Brisbane to call Thursday’s match between the Lions and Essendon at the Gabba. Helping anchor Seven’s Thursday night coverage will be Jones’ No.1 recruit and chief agitator Kane Cornes, who dominated coverage last week by having a verbal dust-up with Western Bulldogs coach Luke Beveridge before the game.\n\nCornes continues to make headlines after last year defecting from Nine, publisher of this masthead, in a move that sparked a battleground on a different front in the footy wars. Jones poached Cornes as well as his long-time friend Craig Hutchison and award-winning journalist Caroline Wilson from Nine to create Seven’s mid-week footy panel, The Agenda Setters, a news-breaking and analytical program that goes head-to-head with Nine’s Footy Classified. Seven’s team on the Monday night edition of The Agenda Setters. Jones also recruited former Fox Footy headline act Nick Riewoldt to join Seven’s coverage, while Shaun Burgoyne jumped from Seven to Fox and Leigh Matthews crossed from Nine to Fox. “What we have done this year is create a seven-day-a-week strategy where there is brand-new football content every day of the week,” Jones said.\n\n“That is a strategy that clearly has worked with many new shows, new attitudes, and we are very proud of what we have been able to do to this point in the season, but we have got a lot of work to do still.” This season, Fox Footy has assigned a commentary team for every match of every round, rather than last year’s model of taking Seven’s feed when the free-to-air network was the host broadcaster. Just who is winning the war is yet to emerge as the networks continue to cobble together their mid-season ratings and accompanying spin. On Thursday morning, Foxtel released figures trumpeting the success of its sport streaming service Kayo Sports, saying Kayo’s year-on-year numbers were up 25 per cent, Thursday nights were up 41 per cent and Friday nights 30 per cent. Fox Footy numbers were not released. The Collingwood-Geelong clash in round eight on a Saturday night was Kayo’s most streamed match of the season with an audience of 389,000, while its Saturday audiences are up 27 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/gallen-snubs-sbw-at-boxing-presser-20250520-p5m0ox.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gallen snubs SBW at boxing presser",
        "publish_date": "Thu, 29 May 2025 11:44:15 +1000",
        "category": "sports",
        "authors": [],
        "text": "Gallen snubs SBW at boxing presser\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/the-blues-win-was-decided-in-the-selection-room-the-rest-of-the-series-will-be-too-20250528-p5m31k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Blues win was decided in the selection room. The rest of the series will be, too",
        "publish_date": "Thu, 29 May 2025 11:41:38 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Back when he was coaching the Roosters, Jack Gibson would receive selection advice – albeit unsolicited – from the club’s backer, Kerry Packer.\n\nFiguring the money he tipped in entitled him to a say, Packer would contact club boss Ron Jones with his team list for the week. When it was relayed to Gibson, the original supercoach delivered his verdict.\n\n“That’s a very good team,” Gibson mused. “But it won’t be the f---king team running onto the paddock.”\n\nIf there is one inalienable truth in rugby league, it is that the coach lives and dies by their selections. It is a lesson Laurie Daley has learnt the hard way.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/swiss-alpine-village-wiped-out-by-collapsing-glacier-20250529-p5m382.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Swiss alpine village wiped out by collapsing glacier",
        "publish_date": "Thu, 29 May 2025 11:39:23 +1000",
        "category": "finance",
        "authors": [],
        "text": "Swiss alpine village wiped out by collapsing glacier\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-queensland-needs-an-extra-350-mental-health-beds-20250528-p5m2wk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Court rules Story Bridge protest can’t go ahead | PM criticises council over bridge maintenance | Queensland ‘needs an extra 350 mental health beds’",
        "publish_date": "Thu, 29 May 2025 11:33:04 +1000",
        "category": "finance",
        "authors": [],
        "text": "Brisbane Lord Mayor Adrian Schrinner has bitten back after Prime Minister Anthony Albanese criticised the council’s management of the Story Bridge:\n\nI’ve been working closely with Federal Minister King, however, I’m also happy to brief the Prime Minister on the independent report written by respected experts, which found we’ve been excellent stewards of the Story Bridge.\n\nAs the report noted, we have invested more than $120 million into maintaining the Story Bridge over the past 20 years in addition to investing $3 million into ongoing maintenance every year over the long term.\n\nThe Story Bridge is an 85-year-old national icon that was only built to last 100 years and we want to restore it so it can last another 100 years, just like we did with City Hall.\n\nThe latest advice states the Story Bridge footpaths would need to be replaced “in the next two to five years,” however, we’re progressing a replacement sooner to ensure they’re safe.\n\nWhat we’re proposing now is a long-term restoration project over the next 15 to 20 years, just like what has been undertaken on the Sydney Harbour Bridge in recent times.\n\nThe state and federal governments collect 97 cents in every tax dollar paid, which is why we’re saying no to a toll and yes to sustained investment from all three levels of government.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/why-jesse-southwell-is-poised-to-be-nsw-s-halfback-for-next-10-years-20250528-p5m2t3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Jesse Southwell is poised to be NSW’s halfback for next 10 years",
        "publish_date": "Thu, 29 May 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "Andrew Johns describes her as “one of my favourites”, and NSW tyro Jesse Southwell has a chance to entrench herself as the Blues’ long-term halfback by steering them to a State of Origin series whitewash in Newcastle on Thursday.\n\nThe 20-year-old halfback has already helped NSW clinch the title with victories in the first two games, and the Blues will be chasing a piece of history by becoming the first women’s team to complete a 3-0 clean sweep.\n\nAs was the case with Johns 30 years ago, Southwell’s first Origin experience was underwhelming.\n\nJohns was dropped after his first two Origins in 1995, only to return 12 months later as a dominant force in a 3-0 series triumph. The rest, as they say, is history.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/from-wastewater-to-your-tap-20250528-p5m32c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From wastewater to your tap",
        "publish_date": "Thu, 29 May 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "From wastewater to your tap\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/this-50m-park-poses-an-unlikely-threat-to-sydney-s-new-airport-20250528-p5m2vk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This $50m park poses an unlikely threat to Sydney’s new airport",
        "publish_date": "Thu, 29 May 2025 11:29:43 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "Plans to build a $50 million urban park near Western Sydney Airport have sparked fears of strikes on low-flying aircraft due to a spike in bats and birds that could be drawn to the sprawling green space.\n\nWestern Sydney Airport officials have called for a range of wildlife management protocols to reduce risks from the park set to be built two kilometres from the airport’s runway.\n\nAn artist’s impression of the new parkland set to be built near the Western Sydney Airport. Credit: Bradfield Development Authority\n\nThe two-hectare green space, approved by the NSW government in March, will be located on top of the future Bradfield metro station and feature at least 550 trees, wetlands and open green spaces for public events.\n\nThe Bradfield Development Authority (BDA), which is delivering the project, hopes the park will become an “urban oasis” in the heart of Bradfield City Centre, which is projected to have a population of 3000 by 2036.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/in-the-sheds-at-halftime-blues-coaches-were-worried-zac-lomax-offered-to-fix-the-problem-20250528-p5m328.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "In the sheds at halftime, Blues coaches were worried. Zac Lomax offered to fix the problem.",
        "publish_date": "Thu, 29 May 2025 11:27:31 +1000",
        "category": "sports",
        "authors": [
            "Roy Masters"
        ],
        "text": "At half-time in Wednesday night’s absorbing State of Origin match, the NSW coaches huddled\n\ntogether to address a major problem: how to defend for 10 minutes with 12 men.\n\nThe Blues’ left winger, Brian To’o, had been ludicrously sinbinned for tackling his opposite, Xavier Coates, as both contested the ball in the air on the last tackle of the first half.\n\nThe bunker had achieved what Queensland could not by making the game more competitive and creating an opportunity for the maroons to eat into NSW’s 12-point lead.\n\nAs the coaches pondered their options, right-winger Zac Lomax approached them and volunteered to swap sides.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/west-coast-take-tom-mccarthy-with-first-pick-in-mid-season-draft-20250528-p5m2u7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Oh my god’: The best mates taken two picks apart in the AFL mid-season draft",
        "publish_date": "Thu, 29 May 2025 11:27:25 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan",
            "Michael Gleeson"
        ],
        "text": "Injury ravaged Essendon plunged on key forwards and a ruckman in the mid-season rookie draft, taking the son of Dermott Brereton’s partner as well as Carlton’s VFL captain, who was once drafted to Collingwood, among their haul of tall reinforcements.\n\nWith 10 players 190 centimetres or above on their injury list, the Bombers needed urgent back-up to get through the season, so they took 198cm tall forward Archer May with their first pick. May’s mother, Julie, is the long-term partner of Brereton, who through his storied career with Hawthorn was the long-term tormentor of their arch-rivals, the Bombers.\n\nArcher May has landed at Essendon, a club his mother’s partner, Hawthorn great Dermott Brereton (inset), long tormented in the 1980s. Credit: X / Getty\n\nThe Bombers also took ready-to-play 203 cm tall ruckman Lachlan Blakiston, who has been playing for East Fremantle in the WAFL with their second pick. They took medium/tall forward Oskar Smartt from their VFL program and, with their last pick, selected Liam McMahon, who is co-captain of Carlton’s VFL team. He has kicked 24 goals for the Blues in the VFL this season.\n\nMcMahon was taken by Collingwood with pick 31 in the 2020 national draft and lasted two years on the Magpies’ list. Given the injuries the Bombers are carrying, he could even now find himself playing against the Blues as soon as next round.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/photos-of-completely-useless-caravan-park-spark-grim-warning-for-aussie-tourism-074827261.html",
        "title": "Photos of 'completely useless' caravan park spark grim warning for Aussie tourism",
        "publish_date": "2025-05-28T07:48:27Z",
        "category": "finance",
        "authors": [],
        "text": "The increasing frequency of weather events means Aussie holiday operators are facing multiple disasters with little time in between to recover.\n\nAussies staying at the Weeroona Holiday Park on NSW's Mid North Coast were forced to flee last week after it flooded for the second time in four years. Source: Supplied\n\nWith the rain pelting on his back and a torch in one hand, Bren Abbott-Hammel waded through the deep floodwaters at his family’s caravan park late on Thursday night last week, banging on vans and urging those still inside to evacuate. In a scene that was all too familiar, the Weeroona Holiday Park in Manning Point, on NSW’s Mid North Coast, was underwater for the second time in a little over four years.\n\nWhile the majority of the park's 24 permanent residents, short-stay visitors and campers had already fled the area, a few people appeared to be “in a little bit of denial” about facing another emergency given the “close time frame” between the catastrophic flooding events.\n\n“There were some people that didn’t hear me, and around 2.30am I got a phone call from a lady who was woken up by the water hitting her in bed,” he told Yahoo News. “I walked and swam down to her and then carried her out with a couple of bags and whatnot.”\n\nTragically, many of those who call the caravan park home had “only recently” recovered from the 2021 flood, only to have to start from scratch once again.\n\nADVERTISEMENT\n\n“They finally got their place set up after chipping away at it for the last four years, and then it’s just happened again, and all that hard work and sacrifice and saving money just gets ripped away,” Abbott-Hammel, whose parents took over Weeroona in 2023, said, noting the heartbreaking loss of sentimental items such as photos.\n\n“All the vans are 100 per cent uninhabitable at the moment, and all the campgrounds are completely useless to the point of the power being cut off.”\n\nIt could take months before the family-run caravan park is running as normal. Source: Supplied\n\nExtreme weather a serious 'concern' for caravan park\n\nWhile recovery efforts began after the water started to recede on Saturday, it could take months before the caravan park returns to normal, leaving Abbott-Hammel pondering the effect of Australia’s natural disasters on the tourism industry.\n\n“The weather has become more extreme, so what does that mean for tourism-related businesses? I’m sure there’s other industries impacted but for us it’s less than ideal,” he said.\n\nADVERTISEMENT\n\nThe Aussie admitted he has had several conversations with family members about the “direct loss of revenue” and the “definite possibility” of the flood zone’s reputation putting people off visiting.\n\n“It’s a concern, and I have seen it before,” he told Yahoo, explaining that several campers decided to leave early in April after a predicted 60mm of rainfall. “And you don’t get to measure the people who don’t come because they are afraid.”\n\nThe damage caused to the roads could also deter travellers, given they are often hauling a $100,000 to $150,000 caravan with them.\n\nHypothetically, if Weeroona Holiday Park was unable to recover from last week’s floods, which also claimed the lives of five people, the other small businesses in the area would also suffer, Abbott-Hammel said.\n\n“The general store, they will struggle. The bowls club, I assume they would lose 20 to 30 per cent of their business.” And he’s not the only one with concerns.\n\nEvery single caravan at the Weeroona Holiday Park is currently inhabitable, with residents grieving the loss of precious items like photos. Source: Supplied\n\nClimate change has devastating impacts on Aussie tourism\n\nNSW’s Mid-North Coast has experienced back-to-back extreme weather events in the last few years and communities are suffering the consequences “again and again”, Climate Council CEO Amanda McKenzie said this week, pointing the finger at what she said is the “root cause\" — \"pollution from coal, oil and gas”.\n\nADVERTISEMENT\n\n“It is critical that we understand that such disasters are no longer simply ‘natural’,” she said.\n\nThe increasing frequency and severity of such events means residents are facing successive disasters with little time in between to recover, which could ultimately hurt the country’s tourism industry in the long run.\n\n“The impact of climate change has had devastating impacts on tourism businesses all over the country and over time, it has caused people to close their doors,” Dr Heather Downey told Yahoo. Repeatedly cleaning up and dealing with insurance companies and various government agencies, as well as the “emotional element”, can take a huge toll on Aussies, the associate professor of social work at La Trobe said.\n\n“It’s a very difficult time. Then, you have to contact people who’ve made bookings and let them know what’s going on, it's a multi layered event,” Downey added. “Unless something is done about root causes of climate change, we can expect increased severity and frequency of these types of devastating events.”\n\nA GoFundMe page has been created to help provide the Weeroona Holiday Park with necessary supplies.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]