[
    {
        "url": "https://www.9news.com.au/world/donald-trump-pharmaceutical-tariffs-copper-import-taxes-us-politics-news/63d66e95-1a2d-470b-bd5f-d96f1a4c4133",
        "title": "Trump threatens to double taxes on Australia's second biggest export",
        "publish_date": "Tue, 08 Jul 2025 23:37:02 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Donald Trump has threatened extraordinary new taxes on one of Australia's biggest exports to the US .\n\nThe US president said he was looking to announce 200 per cent tariffs on all imported pharmaceuticals.\n\n\"If they have to bring the pharmaceuticals into the country ... they're going to be tariffed at a very, very high rate, like 200 per cent.\"\n\nPresident Donald Trump has announced a doubling of pharmaceutical tariffs. (AP)\n\n\"We'll give them a certain period of time to get their act together.\"\n\nThe tariffs would make Australian-made vaccines and drugs far more expensive for Americans to buy.\n\nPharmaceuticals are Australia's second biggest export to the US, behind beef.\n\nAccording to the Observatory of Economic Complexity, vaccines, antisera, toxins and cultures are worth more than $1.6 billion each year.\n\nMuch of this comes from one company, Melbourne-based CSL, which manufactures flu shots, among other pharmaceuticals.\n\nAustralia exports more than a billion dollars worth of vaccines to the US each year. (Nine Archives)\n\nInternationally, the pharmaceutical tariffs will hit Ireland and Germany the hardest.\n\nTrump's tariff threat comes as he announced a new tariff on copper.\n\nWhile Australia is a major copper exporter, very little of it goes to the United States.\n\nMost of Australia's copper exports go to Japan, the Philippines, South Korea and India.\n\n\"Our exports of copper to the US are actually quite small,\" Treasurer Jim Chalmers told ABC Radio National.\n\n\"Our pharmaceuticals industry is much more exposed to the US market, and that's why we're urgently seeking some more detail on what's been announced.\"\n\nCopper futures prices surged more than 10 per cent in the moments after Trump announced his new tariffs.\n\nTrump's so-called Liberation Day tariffs were supposed to take effect today.\n\nBut yesterday the president announced the implementation would be pushed back to August 1.\n\nChalmers decried Trump's tariff plan at a press conference yesterday.\n\n\"﻿We've made it very clear that we think these tariffs are bad for the US, bad for Australia and bad for the global economy,\" he said.\n\nWall Street ended the day mixed, with the S&P 500 dropping slightly the day after a massive drop.\n\nWhat do we sell to America?\n\nAustralia's exports are largely raw materials, measured by the tonne.\n\nBut the US is selling finished products, where single items cost thousands of dollars.\n\nThe most valuable Australian export is beef, either frozen or fresh.\n\nBeef is Australia's top export to the US. (Asanka Ratnayake/Getty Images)\n\nAustralia sold about $2.7 billion worth of beef to the US in 2023, much of it going to McDonald's.\n\nLamb and goat accounted for another $1.4 billion. ﻿\n\nAustralia's second most valuable export to the US is vaccines and other pharmaceuticals.\n\nRaw metals like aluminium, gold, nickel, lead and zinc are also big exports to the US.\n\nShould Australia impose retaliatory tariffs on the US? Yes 867 No 449",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/qantas-data-leak-extent-of-airlines-data-breach-revealed/c5e3e96a-51d1-49e4-a0fd-0468ec97ac67",
        "title": "Extent of major Qantas data breach revealed",
        "publish_date": "Wed, 09 Jul 2025 00:01:28 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "More precise details of last week's Qantas data breach can now be revealed as the company begins contacting customers with information about just how much of their personal data is in the hands of cybercriminals today.\n\nOf the 6 million customers whose details were in the affected system, almost all have had at least some of their information stolen.\n\nA total of 5.7 million unique customer records are impacted, 4 million of which were limited to name, email address and Qantas Frequent Flyer details.\n\nREAD MORE: What Qantas customers should do next following the cyberattack\n\nOf the 6 million customers whose details were in the affected system, almost all have had at least some of their information stolen. (Qantas/Supplied)\n\nOf those, 1.2 million were name and email only, while 2.8 million also included the Frequent Flyer number, most of which also had their Status Tier included.\n\nWhile not outlined by Qantas today, for some of those 2.8 million, described as a \"smaller subset\", the information also included their Points Balance and Status Credit balance - indicating a more precise targeting by scammers of those account holders.\n\nAmong the remaining 1.7 million customers, the data was only some of the above, but additionally, one or more additional fields with 1.3 million addresses leaked - these might be home, business or hotel addresses used in baggage re-delivery.\n\nFinally, within that 1.7 million, there are many that included Date of Birth (1.1 million), phone numbers (900,000), Gender (400,000) and for 10,000 customers, their meal preference is part of the data leak.\n\nNone of the data stolen in the breach has appeared online or on the Dark Web at this time. (iStock/Getty)\n\n\"Our absolute focus since the incident has been to understand what data has been compromised for each of the 5.7 million impacted customers and to share this with them as soon as possible,\" Qantas CEO Vanessa Hudson said today.\n\n\"From today we are reaching out to customers to notify them of the specific personal data fields that were held in the compromised system and offer advice on how they can access the necessary support services.\n\n\"Since the incident, we have put in place a number of additional cybersecurity measures to further protect our customers data, and are continuing to review what happened.\n\n\"We remain in constant contact with the National Cyber Security Coordinator, Australian Cyber Security Centre and the Australian Federal Police.\n\n\"I would like to thank the various agencies and the Federal Government for their continued support.\"\n\n10,000 Qantas customers meal preferences were accessed during the leak (Fairfax Media)\n\nNone of the data stolen in the breach has appeared online or on the Dark Web at this time, though 9News understands Qantas has been contacted by a potential cybercriminal and is unable to comment further as the matter is in the hands of the Australian Federal Police.\n\nIf legitimate, those responsible will be looking to hold the data at ransom, and may leak small amounts of the data onto the web in an effort to legitimise their claims.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/victoria-pub-manager-landlord-clash-the-hobson-stores-sandringham/8b3a7df7-e8e5-4808-990c-8fdf404679e2",
        "title": "Landlord and publican locked in fierce battle over this Melbourne pub",
        "publish_date": "Wed, 09 Jul 2025 00:54:26 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Exclusive: It doesn't look like much from the outside but Hobson's pub has ignited a fierce battle between its publican and landlord.\n\nThe lease for the Sandringham watering hole, located in the beachside suburb just 30 minutes from Melbourne's CBD, is set to expire in October and publican Andrew Watson is doing everything in his power to convince landlord Daniel Enright to renew it.\n\nThat includes starting an online petition, filming a short documentary and encouraging locals to email Enright in a bid to save the pub.\n\nThe Hobson's Stores, better known as Hobson's, has been serving Sandringham locals for about 18 years. (Instagram/@thehobsonstores)\n\n\"Quite a few people within the community have written to him and voiced their disapproval,\" Watson told 9news.com.au.\n\n\"Unfortunately, he just doesn't care.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nWatson ﻿bought the business from the previous tenant back in 2007 and transformed Hobson's from an Italian restaurant into a bar and live music venue.\n\n﻿His original lease ran until 2010 but he was offered three five-year extensions, which he used to extend the lease until October 2025.\n\nIn that time, he and late daughter Jessica, who was the pub's manager, have served almost every member of the Sandringham community.\n\nSo Watson was devastated when Enright informed him that there would be no option to extend the lease for another five years.﻿\n\nAndrew Watson with his daughter Jessica, who was the manager at Hobson's pub. (Instagram/@thehobsonstores)\n\nIt means he has to find a new venue to operate out of by October, or lose the business entirely.﻿\n\n\"I'd walk away with nothing, basically, other than just selling the assets we own,\" Watson said.\n\n\"We're trying to find somewhere where we could maybe transpose everything that we have into another building [but] it's looking very, very shaky.\"\n\nMoving into a new venue would be a costly endeavour, one Watson isn't sure he can afford.\n\nIt would also mean leaving behind priceless memories with daughter Jessica, who died in 2023, and his wife, who passed in 2024.﻿\n\nWatson has spent months trying to convince Enright to extend the lease so he can keep the pub going.\n\nHe started a Save Our Pub campaign and publicised Enright's personal email address, encouraging patrons and Sandringham locals to email him about the campaign.\n\n\"The building is not just a building, it's a sense of community,\" Watson said.\n\nThis letter was posted outside Hobson's and included the personal email address of the landlord. (Instagram/@strahany)\n\nAlmost 13,000km away, Enright has spent the last few months fending off angry emails from total strangers.\n\n\"People are trying to shame me and bully me into allowing him to have what he wants,\" he told 9news.com.au.\n\n\"But people have leases in businesses all the time, and leases end.\"﻿\n\nBorn and raised in Melbourne﻿, Enright helped his mother buy the Hobson's building in 1998 and became sole proprietor when she died in 2011.\n\nBy then, he was living in Palm Springs, California and was more than happy to let the existing tenant – Watson – carry on business as usual for a while.\n\nBut he had always dreamed of running his own business in the building.﻿\n\n\"I started talking to my wife about it and we decided that when the lease ran out, our kids would be off to college, the timing would be really good,\" Enright said\n\nHe told Watson about these plans around 2017, at which point the relationship soured.\n\nREAD MORE: Childcare giant G8 Education to put CCTV in all centres after horror sexual abuse charges\n\nDaniel Enright described himself as a family man who just wants to start his own business. (Supplied)\n\nEnright said that he is conscious of Watson's personal connection to the building and the pub's contribution to the local community over the years, but he has his own dream for the building – one that may be more lucrative.\n\nWatson acknowledged business had been slow since the COVID-19 pandemic and that he had been on a fixed rent for several years.\n\nEnright alleged that the fixed rent agreement has cost him up to $400,000 in potential profit over the years.\n\n\"The business struggles. He [Watson] struggles to pay rent,\" Enright claimed.\n\n\"I'm not trying to be some white knight or anything, but I literally chose to give my tenant a better deal ... because I wanted it to work for him.\"\n\nBut with the lease coming to an end, Enright is ready to take over the building and turn it into something new for himself and Sandringham.﻿\n\nLooking for an extra buck? These are Australia's top side hustles View Gallery\n\nWatson is still hopeful that he can change Enright's mind about extending the lease and his Change.org petition has attracted more than 750 signatures.﻿\n\nBut with every day that passes, his hope wanes.\n\nSoon he fears his only option will be to find a new venue for the business he spent the better part of two decades building.\n\n﻿\"There might be someone out there that owns a building and wouldn't mind taking it on,\" he said hopefully.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/travelers-no-longer-have-to-remove-their-shoes-during-security-screenings-at-us-airports/3b01baed-884a-4fe2-89a2-cf6fd40447d3",
        "title": "Travellers no longer have to remove their shoes for security at US airports",
        "publish_date": "Tue, 08 Jul 2025 22:38:50 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Travellers racing to catch a flight at US airports no longer are required to remove their shoes during security screenings, Homeland Security Secretary Kristi Noem said.\n\nThe end of the ritual put in place almost 20 years ago was effective nationwide effective immediately, she said on Tuesday.\n\nNoem said a pilot program showed the Transportation Security Administration had the equipment needed to keep airports and aircraft safe while allowing people to keep their shoes on.\n\nTaking shoes off at airport security checkpoints in the US will no longer be required. (iStock)\n\n“TSA will no longer require travellers to remove their shoes when they go through security checkpoints,” Noem said.\n\nWhile shoe removal no longer is standard procedure, some travellers still may be asked to take off their footwear “if we think additional layers of screening are necessary,” she added.\n\nSecurity screening sans shoes became a requirement in 2006, several years after “shoe bomber” Richard Reid’s failed attempt to take down a flight from Paris to Miami in late 2001.\n\nAll passengers between the ages of 12 and 75 were required to remove their shoes, which were scanned along with carry-on luggage.\n\nThe travel newsletter Gate Access was first to report that the security screening change would happen soon.\n\nTravellers previously were able to skirt the requirement if they participated in the TSA PreCheck program, which costs around US$80 (A$120) for five years. The program allows airline passengers to get through the screening process without removing shoes, belts or light jackets, and without having to take their laptops and bagged toiletries out.\n\nThe TSA began in 2001 when President George W. Bush signed legislation for its creation two months after the 9/11 attacks. The agency included federal airport screeners that replaced the private companies airlines had used to handle security.\n\nMan passes though Transportation Security Administration TSA security checkpoint at Seattle-Tacoma International Airport. (iStock)\n\nOver the years the TSA has continued to look for ways to enhance its security measures, including testing facial recognition technology and implementing Real ID requirements.\n\nOne of the most prominent friction points for travellers is the TSA at screening checkpoints. President Donald Trump's Transportation Secretary Sean Duffy asked the public in an April social media post what would make travel more seamless.\n\nThe following day, Duffy posted on X that, “It’s clear that TSA is the #1 travel complaint. That falls under the Department of Homeland Security. I’ll discuss this with @Sec_Noem.”\n\nTrump fired TSA Administrator David Pekoske in January in the middle of a second five-year term, though he was appointed by Trump during his first term in the White House. Pekoske was reappointed by President Joe Biden.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/doctor-chris-webster-doctor-who-treated-erin-patterson-after-lunch-reveals-initial-suspicions/0702c661-f22c-4f6f-8fbd-e3de8c1ab1a1",
        "title": "'She's evil': Doctor who treated Erin Patterson reveals initial suspicions",
        "publish_date": "Tue, 08 Jul 2025 08:41:07 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "The doctor who first treated triple-murderer Erin Patterson when she presented to hospital after poisoning her in-laws says he knew she was guilty from the start.\n\nDoctor Chris Webster was the first medical professional to speak to Erin Patterson when she presented to Leongatha Hospital about 8am on July 31, 2023.\n\nWhen she was reluctant to get treatment and self-discharged against medical advice, Webster called triple zero.\n\nREAD MORE: Bullets sprayed at Sydney home as toddler slept inside\n\nDr Chris Webster was the first medical professional to treat Erin Patterson days after the fatal lunch. (Nine)\n\nErin Patterson (Martin Keep AFP)\n\nFor the first-time, the triple zero call, along with dozens of other exhibits in the case﻿ against the triple-murderer, have been released.\n\n\"This is Dr Chris Webster calling from Leongatha Hospital.﻿ I have a concern regarding a patient that presented here earlier but has left the building and is potentially exposed to a fatal toxin from mushroom poisoning,\" Webster told authorities in the triple zero call.\n\n\"I've tried several times to get hold of her on her mobile phone.﻿\"\n\n﻿Patterson left just five minutes after presenting to the hospital, when the nurse was due to begin observations﻿, Webster told the triple zero operator.\n\n\"I had a brief chat with her about where the mushrooms were obtained and after that, ﻿while I was attending to the other patients, the nurse informed me she had discharged herself against medical advice,\" he told the operator.\n\nCCTV footage shows Patterson attempting to leave Leongatha Hospital shortly after arriving on the morning of July 31. (Nine)\n\nSpeaking out for the first time, Webster said his \"heart skipped a beat\" when Patterson presented to hospital with gastro symptoms and revealed her name. ﻿\n\n\"I bypassed all of the usual triage protocols and just brought her straight in and sat her down and just looked her straight in the eye directly and said 'the people at Dandenong suspect death cap mushroom poisoning, where did you get the mushrooms?'\" Webster recalled.\n\n\"That's when she said 'Woolworths'. She was fairly impassive, wasn't loud or hysterical, wasn't crying. She just answered the question in a pretty matter-of-fact way.\n\n\"A﻿fter that I was like OK, I don't want to talk to you anymore, I know what you've done.\"\n\nIan and Heather Wilkinson, were also at the hospital, desperately sick, but the doctor says something felt very sinister.\n\nWebster (middle) was one of several prosecution witnesses during the murder trial. (Nine)\n\n\"She wasn't shaking, Erin was sat in a chair, I don't even remember her looking at Ian and Heather,\" Webster said.\n\n\"She's evil. She wanted people out of her life and rather than using normal channels she snuffed out their lives and attempted to snuff out another.\"\n\nWebster's triple zero call was the first domino to fall in a chain reaction that ultimately exposed a killer.\n\nA supplied image obtained on Monday, July 7, 2025 of Erin Patterson inside Leongatha Hospital in Melbourne, on July 31, 2023, where she was taken after presenting with what she claimed was diarrhea from eating beef Wellingtons. (Supreme Court of Victoria)\n\n\"When she didn't respond in a way that would instantly explain it was a tragic accident, from that moment in my mind she was guilty. She was evil, and she was very smart to carry it all out but she didn't cross the Ts and dot the Is,\" he said.\n\nThe next time Webster came face-to-face with Patterson was in the courtroom when he was called as a witness.\n\n\"When I looked at her, when I found the opportunity to sneak a peek, it was visceral, I felt the intensity, the hostility, the negativity, it was an intense gaze,\" he said.\n\n\"She's evil and she had a problem, she had a dilemma, and the solution that she chose is sociopathic.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/reserve-bank-interest-rate-decision-votes-released/e46423d1-e6f9-44de-b4e7-d11deaace2ba",
        "title": "'6-3': The RBA just did something it's never done before",
        "publish_date": "Tue, 08 Jul 2025 09:23:48 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "This afternoon, the Reserve Bank did something it had never done before.\n\nAnd no, it wasn't disappointing millions of borrowers by keeping interest rates on hold at 3.85 per cent in a call that shocked financial markets.\n\n﻿For the first time, it revealed how many board members voted in favour of the decision, and how many voted against – a far cry from Governor Michele Bullock routinely being asked after each meeting whether a call was unanimous or not.\n\nThe Reserve Bank has started publishing the results from its monetary policy decision votes. (Dominic Lorrimer)\n\nIn today's case, it was six in favour and three dissenting voices﻿ – something Bullock said \"demonstrates, I hope, that there was really good active debate in the boardroom about the pros and cons of holding and easing\".\n\nTreasurer Jim Chalmers welcomed the change﻿, saying the added transparency around the 6-3 majority decision was a positive development.\n\n\"Obviously, it will be a source of some interest that the Reserve Bank board was not unanimous on this occasion, that there were different views expressed around the boardroom table,\" he told reporters.\n\nREAD MORE: Footage shows mushroom killer buy snacks at petrol station after poisonings ﻿\n\n\"We know that because of the publication of these unattributed votes.\n\n\"I think that transparency is a welcome change, and I'm grateful to the Reserve Bank and particularly to [Bullock] for the role that she has played in making sure that those decisions are more transparent.\"\n\nIn her press conference following her board's decision, Bullock said she wouldn't reveal which way she – or anyone else – voted.\n\n\"They're unattributed votes ... they are unattributed for a reason,\" she says.\n\n\"And so the answer to that is no, I won't tell you how I voted.\"\n\nShe said publishing the votes would \"stifle free and frank debate\", and Chalmers agreed the new policy struck the right balance.\n\nREAD MORE: Former radio host sues broadcaster over infamous 2012 royal prank ﻿\n\nJim Chalmers welcomed the decision to publish the final vote counts. (Rohan Thomson)\n\n\"This is an appropriate level of transparency,\" he said.\n\n\"It's certainly much more transparency than we've seen ... and so I think a very big step in the right direction.\n\n\"We want to make sure that people can participate in these Reserve Bank meetings openly, and that the public knows whether the decision was taken unanimously or otherwise.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/flight-delays-after-volcano-erupts-for-second-time-in-recent-months-bali-indonesia/9c34a14d-01ce-41ed-8ba9-90df0841c1ff",
        "title": "Flight delays after volcano erupts in popular holiday hotspot",
        "publish_date": "Tue, 08 Jul 2025 02:00:00 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Some flights between Australia and Bali have been delayed after an Indonesian volcano erupted for the second time in recent months.\n\nMount Lewotobi Laki-Laki erupted on Monday and sent ﻿a cloud of ash 18 kilometres into the sky at the popular holiday destination.\n\nA Virgin Australia spokesperson said two scheduled morning departures out of Brisbane and Melbourne to Denpasar have been delayed this afternoon as the airline monitors ash cloud movement.\n\nREAD MORE: Paraglider dies after falling 20 metres from parachute over Far North Queensland\n\nMount Lewotobi Laki-Laki erupted on Monday for the second time in a month. (AP)\n\n\"Our team of expert meteorologists is closely monitoring conditions and ash cloud activity following the eruption of Mount Lewotobi yesterday,\" the spokesperson said.\n\n\"We encourage guests travelling to or from Bali today to closely monitor their flight status via the Virgin Australia website or app.\"﻿\n\nJetstar and Qantas flights between Australia and Bali are expected to operate as normal today.\n\nREAD MORE: Bendigo Bank to shut 10 branches across three states\n\nA Virgin Australia spokesperson said two scheduled morning departures out of Brisbane and Melbourne to Denpasar have been delayed this afternoon as the airline monitors ash cloud movement. (Glenn Hunt)\n\n\"Our meteorologists and operations teams are closely monitoring the movement of volcanic ash from the latest eruption of Mount Lewotobi in Indonesia,\" a spokesperson for the airlines said.\n\n\"Safety is always our top priority, and we will contact customers directly if their flight is disrupted.\n\n\"We thank customers for their patience and understanding.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/france-s-second-largest-city-suspends-flights-due-to-wildfire/105510716",
        "title": "France's second-largest city suspends flights due to wildfire",
        "publish_date": "Wed, 09 Jul 2025 01:53:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "A wildfire spurred by hot summer winds has reached France's second-largest city, Marseille, this week, grounding all inbound and outbound flights.\n\nThe wildfire has also forced many residents to leave or barricade themselves indoors as smoke choked the Mediterranean air.\n\nA big city hospital switched to generator power, train traffic was halted in most of the surrounding area and some roads were closed, while others were tangled with logjams.\n\nMore than 1,000 firefighters were deployed to tackle the fire, which broke out near the town of Les Pennes-Mirabeau before racing toward Marseille.\n\nSome 720 hectares were hit by the blaze, the prefecture said.\n\nNine firefighters were injured, according to the prefecture. No deaths have been reported.\n\nThe prefecture said in a statement on Tuesday evening that ''the situation is under control\", though the fire has not yet been extinguished. It described the fire as ''particularly virulent\".\n\nSmoke rises behind buildings during a wildfire in the La Castellane district of Marseille. (AP: Lewis Joly)\n\nIt came on a cloudless, windy day after a lengthy heatwave around Europe left the area parched and at heightened risk for wildfires.\n\nSeveral have broken out in southern France in recent days.\n\nLight grey smoke gave the sky over Marseille's old port a dusty aspect as water-dropping planes tried to extinguish the fire in the outskirts of the city, which has some 900,000 inhabitants.\n\nA helicopter drops water while flying over smoke rising from the wildfire in Marseille. (Reuters: MALIK H./@thisisoim_ /@qn13officiel)\n\nHundreds of homes were evacuated. The prefecture urged people in the affected areas to stay indoors and off the roads. With the fire approaching Marseille, the prefecture also advised residents in the north of the city to keep windows closed to prevent toxic smoke from entering their homes.\n\nOne distressed family watched the smoke over their neighbourhood in the hills above the port city and showed reporters how the roof of their neighbour's house had been damaged in the fire as they worried about their own.\n\nMarseille airport announced that the runway had been closed at around midday.\n\nThe prefecture said train traffic was halted, notably after a fire neared the tracks in L'Estaque, a picturesque neighbourhood of Marseille.\n\nSmoke rises over Marseille as a fast-moving wildfire spreads on the outskirts of the city. (Reuters: Alexandre Dimou)\n\nAs a safety measure, the city's Hospital Nord switched to generators \"due to micro power cuts\".\n\n\"The aim is to secure the imaging sector. We are not worried as we have a high level of autonomy,\" the University Hospitals of Marseille said.\n\nIt added that because of the disrupted traffic, it had asked workers to remain at their posts until the next teams started their shifts.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/marnie-sebire-sydney-symphony-orchestra-hawkesbury-boat-captain/105452878",
        "title": "Retraining later in life opened up a new world for symphony musician",
        "publish_date": "Wed, 09 Jul 2025 01:44:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Central Coast resident Marnie Sebire, who captains an oyster boat during the day and performs with an orchestra at night, says she has \"the best of both worlds\".\n\nMs Sebire is a French hornist with the Sydney Symphony Orchestra and drives her boat, The High Cs, to work each day from her home on the Hawkesbury River.\n\nIn 2021 the 51-year-old relocated from the hustle and bustle of Sydney's North Shore to her Bar Point home, which is only accessible by water.\n\nThe only catch was that she'd never driven a boat.\n\nMarnie Sebire (third from the right) has toured with the Sydney Symphony Orchestra and the Australian World Orchestra. (Supplied: Marnie Sebire)\n\n\"It was serendipity — a friend was selling the house and I had actually just sold my house in Sydney,\" Ms Sebire said.\n\n\"COVID had shut everything down. I was thinking about what it meant to be an artist during that time and it provoked a reassessment of my priorities.\n\n\"I bought the house and I haven't looked back.\"\n\nMarnie Sebire works as an oyster tour guide during the day. (ABC Central Coast: Shauna Foley)\n\nA nautical novice\n\nBeginning a life on the water was a steep learning curve that required rethinking the most basic aspects of life.\n\n\"[You have] to be organised, you can't just pop down the street for a bottle of milk,\" Ms Sebire said.\n\nA simple task like grocery shopping can be \"labour intensive\".\n\n\"You've got to get [the shopping] from the shop to the car, then into the boat, in an esky and eventually upstairs into the house,\" Ms Sebire said.\n\n\"The biggest thing is how to handle a boat … without it, you couldn't live on a boat-access property.\"\n\nMs Sebire says it is mind-blowing to be able to commute to the city via the river. (ABC Central Coast: Shauna Foley)\n\nMs Sebire wanted to feel totally independent on the water, so she enrolled in a maritime course at TAFE.\n\n\"Out here you're really reliant upon yourself, \" she said.\n\n\"I knew that I needed to know a lot more about boating if I was going to be living here for a long time.\n\n\"The focus of the course was getting familiar with what a boat is and how it operates … it was essential knowledge.\"\n\nMs Sebire has become a proficient boat operator. (ABC Central Coast: Shauna Foley)\n\nMs Sebire followed up with an additional course and qualified as a coxswain, which means she can command and operate a vessel up to 12 metres in length.\n\nIt's a skill that has opened up opportunities she would never have previously imagined, but she needed access to a bigger boat in order to undertake the training.\n\n\"I had to find someone who was willing to let me work on their vessel and I bumped into a fifth generation oyster farmer … and it went from there,\" Ms Sebire said.\n\nMs Sebire played with Silverchair on the 2008 Big Day Out tour. (Supplied: Marnie Sebire)\n\nA balancing act\n\nMs Sebire started playing the French horn in her early teens.\n\nMs Sebire took up the French horn in high school. (Supplied: Marnie Sebire)\n\nOver the years she has toured with the Sydney Symphony Orchestra, the Australian World Orchestra and Silverchair during the 2008 Big Day Out festival.\n\nNowadays Ms Sebire's office is the Sydney Opera House.\n\n\"Generally we do four performances a week — there's a lot of travel backwards and forwards,\" she said.\n\nBut she is still touring as the captain of an oyster boat.\n\n\"It's a bit of a balancing act, [but] to have this within an hour of Sydney blows my mind,\" Ms Sebire said.\n\n\"Sharing this place with others is something I can see myself doing long into the future.\n\n\"I've done a lot of travelling and I just didn't think there was anything like this, that I could balance my music and life on the water.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/afl-michael-voss-responds-to-threatening-text-message/105510920",
        "title": "'You don't belong here': Voss lashes angry fans over threatening message",
        "publish_date": "Wed, 09 Jul 2025 01:41:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Carlton coach Michael Voss has delivered a powerful response to a threat aimed at him amid the club's poor form.\n\nA threatening text message directed at Voss was left on the MCG's anti-social hotline service during the team's loss to Collingwood on Friday, and is currently being investigated by the AFL's integrity unit.\n\nVoss admitted he was initially dismissive of the threat, but then delivered a take-down of frustrated fans who have responded to the club's current slump with anger.\n\nLoading...\n\n\"We think by showing passion is about anger — and it's not about that at all,\" he said at a press conference on Wednesday morning.\n\n\"There's a way we need to behave and there's a way we need to go about it — and when things are tough, you've got to show that support the right way. Not the wrong way.\n\n\"Now, if that's a measure for some people on what it should look like, then I'm sorry you don't belong here.\n\n\"We'll move on and we'll make sure we continue to bring a supporter base that will support in the good times and it will support in the bad, and we'll continue to support our people to be able to do that.\"\n\nA recent form slump has seen Voss's Carlton side slip right out of finals contention. (Getty Images: Robert Cianflone)\n\nVoss said while he was \"dismissive at first\", he quickly thought about the impact such a threat would have on his loved ones.\n\n\"The first thing you always think about is the person beside you, or the family member, or the team. Because, as a result of what I do, you appreciate there's an element of scrutiny that comes with that,\" he said.\n\n\"But then there's a part that's completely unacceptable — and I think we can all agree that part is unacceptable. And we don't tolerate that as an industry.\n\n\"We leave that with the AFL Integrity (Unit) at the moment, and I expect a pretty forthright response. But this is the current nature we need to consider within the AFL environment, and we all have responsibilities … and you've got to understand that the ripple effect goes beyond what your opinion is. It reaches deeper.\"\n\nBrisbane Lions coach Chris Fagan described the threats aimed at Voss as an unfortunate constant of the AFL's coaching caper.\n\n\"We've all been through that,\" he said.\n\n\"It's tough. I see there was some death threats … that's pretty average.\n\n\"I've got no doubt he'd be doing the best job that he can, but that's just the world AFL coaches live in.\n\n\"Faceless people, lack of courage. As coaches, we try to brush those things off, to be honest.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/sea-burials-rare-but-possible-in-australia/105500146",
        "title": "Son overcomes obstacles to fulfil father's lifelong sea burial wish",
        "publish_date": "Wed, 09 Jul 2025 01:22:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "In the past decade, just 15 sea burial permits have been granted in Australia for people who wished to find their final resting place in the deep blue ocean.\n\nIn some states, such as Tasmania, no sea burial permits have been granted since electronic records started in 1997.\n\nTravis Hamilton recently took on the \"huge\" challenge of fulfilling his dad Alan's burial wishes.\n\nMr Hamilton said his father was a visionary with an unconventional approach to life, who held a lifelong wish to be interred at sea.\n\nAlan Hamilton's lifelong wish for burial at sea was fulfilled by his son Travis. (Supplied: Travis Hamilton)\n\nAlan's send-off in April, 120 kilometres off the coast of Portland in Victoria, fulfilled that wish.\n\nHe was the first Victorian in a decade to be buried at sea.\n\nA last wish fulfilled at sea\n\nIt took 4.5 hours by boat to reach what became Alan's final resting place in the Southern Ocean.\n\nAs the sun rose that morning, his body, wrapped in a natural shroud, was secured to a specially made wooden platform on a boat.\n\nAlan Hamilton's body was wrapped in a natural shroud for his burial. (Supplied: Travis Hamilton)\n\nA small group of family was there for the final farewell, supported by funeral staff and the boat's crew.\n\nThey faced challenging 3-metre swells to reach the chosen location.\n\nBut when they arrived, it was \"eerily calm\" and the \"perfect\" patch of blue.\n\nAlan's shrouded and weighted body quickly disappeared after being released into the sea.\n\nA biodegradable wreath and letters from family and friends were thrown into the ocean afterwards, and the boat traced a circle of honour around the burial site.\n\nFlowers and personal letters were left at the location of Alan Hamilton's burial. (Supplied: Travis Hamilton)\n\nMr Hamilton said dolphins broke the surface of the water near the vessel soon after they departed.\n\n\"It was spectacular, it was beautiful; I'd say it was joyous,\" Mr Hamilton told ABC Radio Melbourne.\n\n\" Of course there was grief — it was really sad finally putting that body to rest, but it's something I'll never forget. \"\n\nMr Hamilton began researching sea burials when his father shared his desire for one in about 2020.\n\nHe quickly realised how many challenges he'd have to overcome to achieve it.\n\n\"When I told dad all of these challenges … he just smiled and said, 'Well, that's what I want,'\" Mr Hamilton said.\n\nAlan Hamilton, pictured in 2016. (Supplied: Travis Hamilton)\n\nWhat is required for sea burial?\n\nA state and federal permit was required for Alan's sea burial, which had to be done at a location with a depth of no less than 3,000 metres.\n\nTo reach a patch of water of that depth, his body had to be transported beyond Australia's continental shelf.\n\nA chartered boat made the journey, requiring a captain willing to participate who then needed permits for the boat to travel the required distance and additional safety gear onboard.\n\nPortland is the closest port to the continental shelf in Victoria, and so became the location for departure.\n\nThis required collaboration with a local funeral home to ensure Alan's body could be kept in a climate-controlled environment following transit from metropolitan Melbourne.\n\nDaybreak at the marina in Portland before Alan Hamilton's sea burial. (Supplied: Travis Hamilton)\n\nFuneral operator Simon Mummé said many roadblocks and logistical challenges were overcome to ensure the burial could happen.\n\n\"Every single decision I needed to solve, there was a 'no' … or there was no information on how to solve it,\" Mr Mummé said.\n\nHe advised others organising a sea burial to start planning as early as possible, allowing time to overcome the many obstacles that must be faced.\n\nBurial at sea a tradition shrouded in mystery Photo shows Burial at sea is a tradition filled event Once a tradition set aside for sailors from days of yore, the process of burial at sea has not completely disappeared.\n\nEmbalming of the body, as is typically done, is prohibited for a sea burial.\n\nMr Mummé said Alan's body could only be bathed and washed, then was kept in a climate-controlled environment to slow nature's processes.\n\nThe shroud had to be biodegradable and weighted, Mr Mummé opted for iron weights over lead to reduce the environmental impact.\n\nCrucially, written consent from the deceased is needed.\n\nA formal letter or information in a will expressing the desire for a sea burial is essential.\n\nSimon Mummé of Candour Funerals. (Supplied: Candour Funerals)\n\nMr Mummé said he was advised that online information stating the deceased must have a strong connection to the sea was not true or current.\n\n\"Anybody can apply for the permit, as long as it's a written wish in their will or a formal letter,\" he said.\n\nAlan did not have a strong connection to the sea, but liked to fish occasionally.\n\nSea burial alternatives\n\nA sea burial can cost upwards of $35,000 and the date must be flexible to allow for poor weather.\n\nIf the cost or need for flexibility is prohibitive, there are alternatives that provide a connection to the sea.\n\nFuneral director Kimba Griffith once worked with clients attempting to fulfil a friend's wish for a sea burial, but ultimately advised them to choose a different option.\n\nKimba Griffith (right) with The Last Hurrah Funerals co-founding partner Nastassia Jones. (Supplied: Wild Rose Pictures)\n\n\"We found a charter company who would do it and we also found a funeral director in Warrnambool who would assist,\" she said.\n\n\" It was going to be extremely expensive and almost impossible to do from [Melbourne], so in the end we did something else. \"\n\nDo you have a plan for when you die? Photo shows Older style concrete graves with large headstones and iron fencing set in an area with lawn. Death literacy advocates are seeing a shift in how death and dying is perceived in the community.\n\nFor alternative memorials or burials, Ms Griffith suggested returning a person's ashes to the water using a biodegradable urn, made from sand and vegetable matter.\n\nA coastal drive-by in a hearse, during which family and friends gather to toast the person, is another idea.\n\nA paddle out, where ashes are scattered by a group on surfboards or a vessel, is another popular choice.\n\n\"There are so many ways you can think about fulfilling someone's wishes,\" Ms Griffith said.\n\nNo permit for scattering ashes at sea\n\nLady Nelson tall ship master Astrid Wilson likes the simple but meaningful gesture of scattering ashes at sea.\n\nMs Wilson has attended many memorials in a professional and personal capacity, where ashes were scattered from a boat or ship.\n\nNo permit is required to scatter ashes in the ocean or water in Australia.\n\nMs Wilson advised caution when scattering ashes, to ensure they did not blow back on participants.\n\nAshes did blow back during an emotional memorial she once attended on a large ferry.\n\nMs Wilson said she believed the person being remembered would have seen the humour in it.\n\nTall ship master Astrid Wilson has attended many memorials at sea. (Supplied: Astrid Wilson)\n\n\"It was for a chick who worked on Bass Strait her whole life — she was quite young — and cancer took her,\" she said.\n\n\"She just wanted to go back to where she felt her happiest, which was at work on a ship on Bass Strait.\n\n\"It was so special … she [her ashes] did swirl around and end up on the boat, but it was really good because it was just part of her.\"\n\nMr Hamilton said he felt a huge sense of relief in being able to fulfil his dad Alan's final wish for a sea burial.\n\nThrough his father's burial, and his own journey working in the funeral industry, he said he had learnt the importance of ritual.\n\n\"Even if someone is cremated, the act of going out and having some sort of ceremony is really important,\" Mr Hamilton said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/checking-in-with-doctor-about-the-contraceptive-pill/105462794",
        "title": "Why you shouldn't 'set and forget' the contraceptive pill",
        "publish_date": "Wed, 09 Jul 2025 01:07:28 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Stephanie Jenkins was 18 years old when she was prescribed a hormonal contraception tablet to help her with acne.\n\nThe now-32-year-old from Kabi Kabi land on the Sunshine Coast took the same medication for a decade before she started experiencing debilitating migraines.\n\n\"They were aura migraines, so disturbances in vision, light sensitivity, I couldn't see out of my right eye properly,\" she says.\n\nAfter having her symptoms dismissed by a GP, Stephanie saw another doctor through an online prescription renewal service.\n\n\"As soon as I told her all of the symptoms and how often it had been occurring … she just point blank said, 'you immediately need to cease [the pill you are on]',\" she says.\n\nThe doctor told Stephanie the migraines were an indicator of an 'oestrogen overload', a side-effect of the pill which heightens the risk of stroke.\n\n\"I didn't even know it was because of the pill, I just thought it was related to my period.\n\n\"You just get put on it, you take it … set and forget.\"\n\nWhy we shouldn't 'set and forget' the pill\n\nDr Phoebe Holdenson Kimura says generally, GP's should conduct a yearly review for repeat prescriptions.\n\nThe lecturer at the University of Sydney's General Practice Clinical School says the key message is that taking hormonal contraception should not be \"a set-and-forget process\".\n\n\"Finding out when it was started, what it was started for is important,\" Dr Holdenson Kimura says.\n\n\"So, recognising many women take the combined contraceptive pill for contraception, but it also can be used for acne as well as for the management of heavy menstrual bleeding or painful periods.\n\n\" Then asking how do you feel it's going? Are you happy on the pill? Did you want to discuss any alternatives? \"\n\nShe says doctors should also be checking risk factors with patients, including if they have had lifestyle changes or had medical issues such as migraines, deep vein thrombosis, a pulmonary embolism, high blood pressure, or have liver disease.\n\nWomen don't need to 'take a break' from the pill Photo shows Contraceptive pill You may be surprised to know there is no biological evidence for \"giving your body a break\" from oral contraceptives and, in fact, it could do your health more harm than good.\n\nDr Eveline Mu is a research fellow at Monash University's HER Centre in Naarm/Melbourne and says there needs to be greater awareness at GP-patient consultations of the risks of depressive disorders.\n\nShe has been studying the neurological impacts of hormonal contraceptive medication on women's moods.\n\n\"We've found that there are certain types of common hormone contraception that will be worse for women who are susceptible to mood disorders or who have mood disorders,\" Dr Mu says.\n\n\"Fluctuation or any differences in the oestrogen level can impact a lot of other neurotransmitters like serotonin or dopamine which are linked to mood and involved in emotion processing as well.\"\n\nOther milestones in your life when you should check-in\n\nDr Pav Nanayakkara, a minimally invasive gynaecological surgeon from Jean Hailes for Women's Health, says along with a yearly consult there are other life milestones that should prompt a contraceptive medication check-in.\n\n\"Any sort of significant life change — so pregnancy, around the time of perimenopause, any diagnosed medical conditions, any lifestyle changes,\" she says.\n\nPav Nanayakkara is a gynaecological surgeon from Jean Hailes for Women's Health. (Supplied: Jean Hailes for Women’s Health)\n\n\" Or a big birthday, so any birthday ending in a zero or a five is a really good time to check in. \"\n\n\"Because lifestyle factors can change as we age, we might have different requirements, or we might develop medical conditions.\"\n\nResearch conducted by the Jean Hailes for Women's Health shows that just over half of the 3,537 women it surveyed last year, aged 18 to 50 years, didn't know about the full range of contraceptive medications available to them.\n\n\"This finding was even more significant in the 40-to-50-year age group,\" Dr Nanayakkara says.\n\n\"[These women] are then often giving advice to their daughters and may not necessarily know about all of the options.\"\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nStephanie says her mother took the pill, so it seemed like the right thing to do at the time.\n\n\"It was the only thing that was offered to me as an acne treatment which seems wild to me because now I'm more educated,\" she says.\n\nStephanie says she now tracks her menstrual cycle and uses other contraceptive methods.\n\nBe cautious of social media advice\n\nDr Holdenson Kimura says it is also important to get advice from your doctor and not social media.\n\nGoing off the pill Photo shows A woman stands near a cliff overlooking the sea, with friends in the background for a story on going off the contraceptive pill. So you've decided to stop taking the pill. What happens next could be a bumpy ride or something to embrace.\n\n\"I'm having a lot more women coming in saying 'I want to talk about going off the pill' or, 'I've made the decision to go off the pill because I'm curious to know what it feels like',\" she says.\n\n\"I think that's fine … but equally it is important to be having those conversations [with their GP] about what to consider.\n\n\"Especially if the pill's been managing heavy periods or painful periods and women want to come off it then we really need to look at what are the other options to help you with that.\"\n\nThis is general information only. For detailed personal advice, you should see a qualified medical practitioner who knows your medical history.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/eight-people-detained-in-china-after-233-children-poisoned/105510538",
        "title": "Arrests after 233 children poisoned with lead at Chinese preschool",
        "publish_date": "Wed, 09 Jul 2025 00:36:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Authorities have arrested eight people after more than 200 children who consumed food at a preschool in China's north-west were found to have abnormally high levels of lead in their blood.\n\nHealth authorities identified 233 pupils at a preschool in the Gansu province city of Tianshui had abnormal levels of lead in their blood, out of a total of 251 children enrolled at the centre.\n\nAt least 201 of the children had been admitted to hospital.\n\nThe kindergarten's principal, surnamed Zhu, and an investor surnamed Li were detained along with six other people on suspicion of \"producing poisonous or harmful food\", state media reported.\n\nInvestigators found that they allowed kitchen staff to produce food using paint pigments purchased online that were later found to contain lead and were marked inedible.\n\nMany Australian towns are contaminated by lead, but sparrows can predict if kids have lead poisoning Photo shows A male house sparrow, with brown and black markings around its face, sits on a tin fence. A new study has found lead levels in sparrows matches those of children who live in two Australian mining towns, suggesting the bird could be used to help monitor contamination.\n\nTesting revealed that samples of three-colour steamed date cakes and corn rolls contained more than 2,000 times the national safety standard for food contaminants.\n\nThe cake, served at breakfast, returned a reading of 1,052 milligrams per kilogram and the roll, served at another meal, was found with 1,340 milligrams per kilogram.\n\nThe nationwide limit for lead in wheat and starch is 0.5 milligrams per kilogram, according to Chinese government records.\n\nA parent told the state-run Jimu News tabloid that children were experiencing stomach pain and nausea and that some of their teeth turned black.\n\nFood safety has improved in China following a series of scandals, including the 2008 discovery of toxic infant milk, which undermined public trust and consumer confidence.\n\nInspections by regulators in 2022 found safety issues were more common in the catering industry and agricultural products, according to state media reports.\n\nABC/wires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/diogo-jota-likely-speeding-before-fatal-crash-spain-police-say/105510554",
        "title": "Diogo Jota was likely speeding before fatal crash, Spanish police say",
        "publish_date": "Wed, 09 Jul 2025 00:18:32 +0000",
        "category": "sports",
        "authors": [],
        "text": "Spanish police say it is believed that star Liverpool forward Diogo Jota was likely driving over the speed limit when he and his brother died in a car crash in the country's north-west.\n\nSpain's Civil Guard said on Tuesday local time that while their investigation into the cause of the crash last Thursday was continuing, they believed Jota was driving too fast when his Lamborghini veered off course after a tyre burst.\n\nThe civil guard said in a statement that its forensics team was analysing marks left by one of the car's wheels on the asphalt that pointed to the tyre bursting and whether that and excessive speed caused the crash.\n\nLoading...\n\nThe police had previously not said if Jota or his 26-year-old brother, André Silva, were driving. On Tuesday they said that it appeared Jota was.\n\nThe civil guard had also previously suggested that the pair's car appeared to have been overtaking another vehicle at the time of the crash.\n\nFootballers join family in mourning Diogo Jota at funeral Photo shows Virgil van Dijk and Andrew Robertson carry wreaths of red flowers in the shape of football shirts The last time many of his friends in football made the trip to Porto was two weeks prior, for Jota's wedding.\n\nHaving concluded their investigation, police will send a report to the local court before it is made public.\n\nThe siblings died in the car when it burst into flames on an isolated section of highway early in the morning.\n\nPortuguese media reported Jota was heading to the northern Spanish city of Santander to take a ferry to England, where he would rejoin his Premier League club after being advised not to fly following a recent lung procedure.\n\nThe crumpled, burnt-out wreck of the Lamborghini was removed from the site early on Thursday, but debris remained on the side of the road.\n\nLoading...\n\nJota's death at the age of 28 sent shock waves through the world of soccer and beyond, with messages of condolences pouring in from national leaders as well as fellow football players.\n\nThe Portuguese striker was renowned globally for his exploits on the pitch.\n\nHe scored 47 goals in 123 matches for Liverpool, where he played for the past five seasons. He also made 49 appearances for Portugal's national team.\n\nThe loss was felt sharply in his home town, especially at his first soccer club, where Jota started playing at age nine.\n\nLiverpool Football Club fans have been united in their outpouring of grief and displays in tribute to Diogo Jota outside Anfield. (Reuters: Phil Noble)\n\n\"He never forgot his roots, nor his friends, because he had a group of friends who were with him in the training here in Gondomar and who he even invited from time to time to go and watch Liverpool games in England,\" Gondomar SC director Anselmo Serra told The Associated Press.\n\n\" They were like a group of friends that he never forgot over the years. \"\n\nThe brothers' funeral was held in Portugal on Saturday, where players from Liverpool and the Portuguese national team joined members of Jota's family with red floral arrangements in the shape of a soccer shirt adorned with his club number, 20.\n\nPortugal international Rúben Neves served as a pallbearer for Jota a day after playing for Al Hilal at the Club World Cup in the United States.\n\nJota's legacy will live forever Photo shows Diogo Jota looks to the heavens and smiles Diogo Jota wasn't Liverpool's best player or the most famous. But he will be immortalised in a song that is proof of how deeply he wove himself into the fabric of the city.\n\n\"More than a friendship, we're family, and we're not going to stop being family just because you've decided to sign a contract a little further away from us,\" he said.\n\n\"I'll make sure you're always there and I'll make sure your family never lacks anything while you're there, far away but thinking of us, waiting for us.\"\n\nThe private service was presided over by the Bishop of Porto, Manuel Linda.\n\nIn an emotional homily addressed to Jota's parents, his wife and their three children, the bishop said \"solidarity in love is always stronger than death\".\n\nThe church was filled to capacity and a couple of dozen people followed the service via loudspeaker from outside.\n\nThe fatal incident also came just two weeks after Jota married his partner of 10 years and mother of his three children, Rute Cardoso.\n\nIn the days that followed his death, Liverpool fans flocked to the club's home ground, Anfield, in a mass display of grief and tribute to Jota.\n\nWires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/qantas-confirms-number-of-customers-impacted-in-cyber-attack/105510654",
        "title": "Qantas confirms 5.7 million customers were impacted in cyber attack",
        "publish_date": "Tue, 08 Jul 2025 23:53:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Qantas has confirmed 5.7 million customers were impacted in last week's cyber attack.\n\nQantas Group chief executive Vanessa Hudson said the airline is focused on understanding what details of their data have been compromised and will let them know as soon as possible.\n\n\"From today, we are reaching out to customers to notify them of the specific personal data fields that were held in the compromised system and offer advice on how they can access the necessary support services,\" she said.\n\nThe airline said it was carrying out a \"forensic analysis\" of the data that was compromised and had accounted for duplicate records.\n\n4 million customers had their name, email address and frequent flyer numbers exposed to the attack.\n\nQantas customers 'let down' by cyber attack Photo shows Qantas logo on Sydney Airport terminal glass Qantas customers say they feel vulnerable, angry and unsupported following last week's major cyber security breach — and are now questioning whether the airline is doing enough to protect Australians' personal data.\n\nOut of those records, 1.2 million only contained names and email addresses.\n\nOf the 2.8 million who had their frequent flyer numbers in the system that was accessed, \"a smaller subset\" also had their points balance and status credits included.\n\nA further 1.7 million customers had more data on the compromised records, including address, date of birth, phone number, gender and meal preferences.\n\n\"Qantas is progressively emailing affected customers to advise them of the types of their personal data that was contained in the impacted system and provide advice and support,\" the company said.\n\nAirline advises customers to 'stay alert'\n\nEarlier this week, the airline revealed it had been contacted by a \"potential cybercriminal\" and said it was working with the Australian Federal Police to verify the legitimacy of the contact.\n\nWhat the Qantas cyber attack could mean for your data Photo shows Qantas Departure sign outside airport terminal Cybersecurity experts are warning Qantas customers to remain vigilant to scams and hacking attempts in coming days, after as many as 6 million Australians were caught up in a data breach\n\nIn its latest update, Qantas urged customers to \"stay vigilant to any misuse of their personal information\" and take general precautions.\n\nThe advice included remaining alert to communications, including emails, texts and phone calls, purporting to be from the airline, using two-factor authentication for personal accounts and staying across threat and scam notifications.\n\n\"Do not provide your online account passwords, or any personal or financial information,\" the statement noted.\n\n\" Qantas will never contact customers requesting passwords, booking reference details or sensitive login information. \"\n\nIt said customers who believed they have been targeted by scammers could report it to Scamwatch, a service run by Australia's consumer watchdog.\n\nDozens of Qantas customers have contacted the ABC in the wake of the cyber attack to express their frustration at the airline, including some who had been targeted by scammers or received alerts about attempts to access accounts.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/state-of-origin-iii-nathan-cleary-jarome-luai-legacy-decider/105510548",
        "title": "Luai and Cleary face chance to cement Origin legacy in decider",
        "publish_date": "Tue, 08 Jul 2025 23:45:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "It is enough to send tingles up Jarome Luai's spine.\n\nNine months on from his \"last ride\" with Nathan Cleary at Penrith, Luai and his old partner in crime join forces for a chance to cement their State of Origin legacy.\n\nWednesday night's decider is uncharted waters for the NSW halves, who won four premierships alongside each other at Penrith but have never featured together in a victorious game three decider.\n\nLuai says in some respects, Sydney's first Origin decider since 2019 is bigger than a grand final.\n\nTo'o and Haas both cleared to line up for Blues in Origin decider Photo shows Brian To'o shouts on the ground. NSW will go into State of Origin III unchanged, after Brian To'o got through a crucial training session unscathed at Sydney's Olympic stadium.\n\n\"The rivalry I think is a lot stronger than two teams in the NRL,\" said five-eighth Luai.\n\n\"You're playing for a lot more people and for their pride, for their upbringing, for their childhood. It's pretty massive.\n\n\"We've just got to do our job, put that scale aside and be present in the moment.\"\n\nCleary and Luai had less than a week to reignite their chemistry in the lead-up to the tight Origin II loss, with the five-eighth only coming in late to replace the injured Mitch Moses.\n\nBut with a full training camp under their belt, the duo's long-standing connection will go a long way to deciding Wednesday's hotly anticipated match at Stadium Australia.\n\nJarome Luai and Nathan Cleary are looking to add to their already incredible legacy as a halves pairing. (Getty Images: Cameron Spencer)\n\n\"I get tingles [thinking] about it, being back with a lot of guys that I've had a lot of success with,\" Luai said.\n\n\"But I think it's all about putting that away now and focusing on what we can do next.\"\n\nIt is a frightening prospect for Queensland that the always confident Luai is expecting the halves' self-belief will rise following a full camp spent together.\n\n\"Everyone would say the more prep you have, the more reps you get in the bank, the more confidence you have from your training. Basically, it's just more confidence in the bank,\" he said.\n\nCleary will enter rarefied air running onto Stadium Australia, passing Mitchell Pearce and Andrew Johns to become NSW's most-capped halfback.\n\nCleary is set to become the most-capped New South Wales halfback when he runs onto the field for the Origin decider. (AAP: Dave Hunt)\n\nThe Panthers co-captain would almost certainly have reached the 17-game milestone sooner had injury not precluded him from selection in five of the six Origin games played in 2023 and 2024.\n\n\"It's a big achievement, obviously,\" said Panthers coach and father Ivan Cleary. \"But he'd be more interested in just playing well. Let's hope he does.\"\n\nNSW great Brett Kimmorley said for Cleary and Luai's four-time NRL premiership-winning combination to flourish, their teammates needed to lift for Origin III.\n\nABC Sport is live blogging every round of the AFL and NRL seasons in 2025.\n\nThe Blues were left to rue conceding eight unanswered penalties and falling behind 26-6 at half-time of the two-point loss in Origin II.\n\n\"For the halves to be able to control the game and build some pressure, it certainly comes from a high completion rate and a low penalty count against you,\" Kimmorley told AAP.\n\n\"I would expect game three will be a lot better, a lot more desperation, they'll be looking forward to having a bigger game.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/pharmaceutical-benefits-scheme-ruled-out-us-tariff-deal/105510310",
        "title": "PBS 'not on the table' to escape concerning pharmaceuticals tariff",
        "publish_date": "Tue, 08 Jul 2025 23:01:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia is urgently investigating \"concerning\" new tariffs on pharmaceuticals announced by the United States, repeating that the nation will not be bullied into weakening its Pharmaceutical Benefits Scheme in order to escape a tariff.\n\nUS President Donald Trump imposed a fresh round of tariffs overnight, including a possible 200 per cent tax on pharmaceutical imports and a 50 per cent tax on copper imports.\n\nPharmaceuticals are one of Australia's largest exports to the US, with about $2.2 billion in pharmaceutical products exported to the US last year.\n\nTreasurer Jim Chalmers told ABC Radio National the new tariffs would inject more volatility into global trade.\n\n\"They're obviously very concerning developments, we are talking about billions of dollars of exports to the US,\" Mr Chalmers said.\n\n\"Our pharmaceuticals industry is much more exposed to the US market, and that's why we're seeking, urgently seeking, some more detail on what's been announced.\"\n\nThe treasurer also used the interview to voice the disappointment of millions of households \"who were hoping for rates relief yesterday, and didn't get it\", after the Reserve Bank decided to leave the cash rate on hold at 3.85 per cent amid ongoing global uncertainty.\n\nJim Chalmers says the new round of proposed tariffs are \"very concerning\" to Australia. (ABC News: Callum Flinn)\n\nPBS pain point for US big pharma\n\nThe Trump administration had been urged by America's powerful pharmaceutical lobby to slap tariffs on Australian pharmaceuticals in retaliation for its Pharmaceutical Benefits Scheme, which requires drug companies to negotiate prices with the government in order for customers to receive a subsidy for their medicines.\n\nIn March, industry lobbying body PhRMA labelled PBS subsidies an \"egregious and discriminatory\" trade instrument.\n\nThe federal government has flatly ruled out negotiating away the scheme that underpins cheaper medicines for millions of Australians.\n\n\"Our Pharmaceutical Benefits Scheme is not something we are willing to trade away or do deals on,\" Mr Chalmers said.\n\n\" We'll work through it in a methodical way, but we make it clear once again … that the PBS is not on the table. \"\n\nProductivity Commission urges Australia to ditch tariffs Photo shows An older man wearing a red tie, white shirt and a black suit jacket with a serious expression The federal government's economic think tank says Australia will likely be a winner from Donald Trump's tariffs if it does not retaliate and that we would be better off by removing more of the nation's remaining tariffs.\n\nA Productivity Commission report released this week concluded that Mr Trump's first round of tariffs, which hit Australian steel and aluminium, could actually be \"good\" for the Australian economy, with global trade reshaping around growing US protectionism.\n\nIt concluded Mr Trump's \"liberation day\" tariffs could provide a 0.37 per cent boost to Gross Domestic Product.\n\nHowever, the tariffs on steel and aluminium will sit at a much smaller rate of 10 per cent, and the share of Australian steel and aluminium exports that go to the US is much smaller than pharmaceuticals.\n\nAbout 40 per cent of Australia's pharmaceutical exports are to the United States.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/pilbara-rents-more-expensive-than-mortgages/105496030",
        "title": "Cheaper to buy than rent as this WA city's housing crunch worsens",
        "publish_date": "Tue, 08 Jul 2025 22:30:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Home owners were disappointed by the Reserve Bank's decision on Tuesday to hold the cash rate at 3.85 per cent.\n\nBut despite the unexpected hold, Karratha resident Bianca Dawson said she was glad she purchased her house.\n\n\"We have no regrets about buying,\" she said.\n\nHer relief at exiting the rental market is not a surprise.\n\nA recent Domain report found the Pilbara accounted for 11 of the top 12 suburbs across Australia with the biggest discrepancy between the cost of renting and buying a home.\n\nIn Karratha, 1,500 kilometres north of Perth, the median house price ranges from $545,000 to $755,000, depending on the suburb.\n\nBut rents in the town have surged to well over $1,000 per week.\n\n\"Our median [rent] now is at $1,350 a week, but what's happened compared to the rest of the country is the housing prices actually haven't gone up as much,\" Mayor Daniel Scott said.\n\n\"They have risen, but they haven't risen as fast.\n\n\"We are now in a unique position where if you move to Karratha, particularly if you're a young person, you can get a good-paying job … and you can buy a house.\"\n\nThe City of Karratha's population is expected to increase in the coming years, with modelling showing the population reaching 30,000 by 2030.\n\nRental market flatlines\n\nBankwest Curtin Economics Centre director Alan Duncan said the report was not surprising.\n\n\"The population has grown across all regional areas of WA by around 2.2 per cent, but at the same time our rental stock has flatlined,\" Professor Duncan said.\n\n\"That pressure is the thing that's really sort of pushing rents higher.\"\n\nModular housing has been one of the options looked at to ease Karratha's housing crunch. (ABC Pilbara: Charlie McLean)\n\nBut buying is far from a guarantee for people in town looking for somewhere to live.\n\nRay White Karratha managing director Richard Naulls said a shortage of housing generally continued to pose challenges for the community.\n\n\"Obviously we've got a shortage of housing. It's always about supply and demand,\" he said.\n\nRichard Naulls says a lack of houses is pushing rental prices up in Karratha. (ABC Pilbara: Kate Ferguson)\n\nMr Naulls also said the high rent yield attracted interstate investors.\n\n\"They're trying to get a 10 per cent return sort of thing,\" he said.\n\n\"You're not going to get that sort of return putting your money in a term deposit.\"\n\nBuying the answer?\n\nBianca Dawson said she and her partner were lucky they purchased privately.\n\n\"There were lots of people at the home opens, lots of calls from real estate agents and things like that, saying it was time to put the offer in if we wanted to,\" she said.\n\n\" I saw [a rental property] come up the other day for $2,000 a week; we're not even paying close to that amount monthly. \"\n\nAlthough the mortgage itself worked out cheaper, Ms Dawson said there were other costs.\n\nMortgage prices in Karratha are cheaper than rents. (Back Roads: Dai Cookes)\n\n\"Land rates here are crazy high because they're to do with the rental value of the property,\" she said.\n\n\"With the water, you don't just pay your water bill; you have to pay for the usage and the rights and everything like that.\n\n\"Home and contents insurance was way more expensive than what we would have ever thought.\"\n\nCity says help is on the way\n\nThe situation has forced the local council to intervene.\n\nThe City of Karratha adopted a policy providing accommodation to low and middle-income earners at its June council meeting, as well as investing in a project that will see 37 new residences.\n\nKarratha Mayor Daniel Scott says the council is working on solutions to housing affordability in Karratha. (ABC Pilbara: Charlie McLean)\n\nCr Scott said the project was funded out of necessity.\n\n\"The council made a decision to invest $26 million plus GST, which we funded from our infrastructure reserves to make that project in Baynton West … a reality,\" he said.\n\n\"The city doesn't really want to own all these properties, but we recognise there's a market failure and we're playing our role to get more accommodation in the city.\"\n\nMr Naulls said these new construction projects would likely see property prices increase.\n\n\"It's been very stable, very gradual, but as soon as this construction takes off, you'll see investors, companies coming to town,\" he said.\n\n\"That's where prices then get pushed up, and it makes it more difficult for people to buy or afford to buy.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/asx-markets-business-live-news/105510298",
        "title": "Live: ASX slips after RBA 'shock' rates decision, Trump announces more tariffs",
        "publish_date": "Tue, 08 Jul 2025 22:07:20 +0000",
        "category": "finance",
        "authors": [
            "David Chau",
            "Michael Janda",
            "Business Correspondent David Taylor",
            "Daniel Ziffer"
        ],
        "text": "Former RBA Assistant Governor (Economic) Luci Ellis now works as the chief economist for the Westpac group.\n\nHer thoughts on the central bank's decision to hold rates have an insider's eye. Check out Luci Ellis's latest note, just released:\n\n\"In a decision split 6 in favour, 3 against, the RBA Board decided to wait before cutting rates. It wasn’t a shoo-in to cut, and in the end, the RBA chose caution over decisiveness.\"\n\nThe decision defied widespread predictions.\n\n\"The post-meeting statement noted the gradual recovery in private sector demand and a tight labour market as justification for the decision. It also said that the Board judged that it could wait for a “little more information”, which the Governor subsequently clarified included the quarterly CPI and another labour force release. \"\n\nIn the press conference, Michele Bullock also discussed how the monthly CPI reading — which was only started in recent years — isn't as substantial as the long-running quarterly one.\n\n\"In its May minutes, the Board had expressed a preference to be “cautious and predictable” in its conduct of monetary policy. Today it erred on the side of the former. The general tone of today’s post-meeting statement was of a central bank that has not been updating its view of the economy that quickly.\"\n\nEllis notes what Governor Bullock emphasised, that the hold was a \"question of timing, not direction\". A majority of Board members simply opted to wait for more information, principally the quarter 2 CPI release.\n\n\"We read the tone of the media conference as flagging that the rate cut is still on for August, provided the trimmed mean inflation rate for June quarter does not surprise too much on the upside. Accordingly, we reinstate the likely timing of the next cut to August, though there is a small chance even this is delayed. We also retain the spread-out timing (November, February, May) of subsequent cuts as being in line with the cautious approach the RBA has flagged.\"\n\nCutting this month was not the \"shoo-in\" that markets expected, she says.\n\n\"The RBA has been a reluctant rate-cutter in recent months, especially earlier in the year. Still, the decision to hold is surprising, and the 6–3 split vote shows how finely balanced the decision was. Given the lack of consensus on the Board, the low information content of the post-meeting statement was not that surprising; this was the text a split Board could agree upon.\"\n\nHow did people vote?\n\nHere's some sport, Luci Ellis is juggling who she thinks voted what way:\n\n\"While votes are unattributed, we think it is unlikely that the external Board members all voted to hold while the Governor, Deputy Governor and new Treasury Secretary all voted to cut. It is more likely that the Governor, Deputy and some external Board members aligned to a staff recommendation to hold, but not all the external members were convinced to wait.\"\n\nSo her tip is the RBA staff wanted to hold, and convinced a few more to join them.\n\nAnd expect more shocks, with the new structure meaning they'll not be jaw-boning where they are going.\n\n\"The main other lesson from today’s decision is the step change it implies for the RBA’s approach to communication. With the Monetary Policy Board more explicitly central to the decision-making process (in form only – they always were central in substance), the RBA Governor will be unwilling to push back on market pricing in between meetings because they will want to avoid pre-judging what the Board decides, or prejudicing the deliberations, at the next meeting. This means that episodes of the RBA surprising market pricing, as it has done today, will be more common. This is one of the downsides of the RBA Review recommendations. Not only are there fewer inter-meeting speeches by the senior officials now that there is a press conference instead, but those opportunities might also not be used to steer market pricing.\"\n\nMaybe not even August?\n\nIn what would be a publicly unpopular move, Luci Ellis suggests the RBA may not cut at the next meeting:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-09/tennis-wimbledon-line-calling-malfunction-fritz-alcaraz/105510088",
        "title": "Fritz sets up Alcaraz date amid more Wimbledon line-calling drama",
        "publish_date": "Tue, 08 Jul 2025 21:56:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "A malfunction with Wimbledon's new electronic line-calling system required a point to be replayed during a quarterfinal match between Taylor Fritz and Karen Khachanov overnight.\n\nThe latest issue with the system occurred during the opening game of the fourth set on Court No.1 after Fritz had served at 15-0 and the players exchanged shots. Then came a random \"fault\" call.\n\nChair umpire Louise Azemar-Engzell stopped play and a few moments later announced: \"Ladies and gentlemen, we will replay the last point due to a malfunction.\"\n\nPavlyuchenkova fumes after Wimbledon's 'deactivated' electronic line system misses call Photo shows A disgruntled Russian tennis player stands on court with hands on her hips after a point at Wimbledon. Wimbledon's move to electronic line calls has raised the ire of Anastasia Pavlyuchenkova after the Russian lost a key point because the system was 'deactivated'.\n\nThe system had tracked Fritz's shot in the rally as if it was a serve, the All England Club said.\n\n\"The player's service motion began while the (ball boy/ball girl) was still crossing the net and therefore the system didn't recognise the start of the point. As such the chair umpire instructed the point be replayed,\" the club said in a statement.\n\nAfter the \"fault\" call, a perplexed Fritz turned to the umpire's chair and spread his hands as if asking: \"What was that?\"\n\nNeither player seemed upset and Khachanov won the replayed point, but the fifth-seeded Fritz advanced to the semifinals with a 6-3, 6-4, 1-6, 7-6 (4) victory.\n\n\"If it would happen on a break point or deuce or maybe tiebreaker, OK, you can get more mad,\" the 17th-seeded Khachanov said.\n\n\"But it was just beginning of the set, 15-love or love-15. I don't remember. It was maybe not that important moment. That's why I stayed really focused and calm.\"\n\nWimbledon switched this year to the electronic system from human line judges but it has been anything but smooth.\n\nOn Sunday, there was a glaring mistake at Centre Court during Anastasia Pavlyuchenkova's three-set victory over Sonay Kartal in the fourth round.\n\nA shot by Kartal clearly landed past the baseline but was not called out by the automated set-up — called Hawk-Eye — because it had been shut off.\n\nOn Monday, club officials blamed \"human error\" for the oversight.\n\nClub chief executive Sally Bolton said the technology was \"inadvertently deactivated\" by someone for three points in the match.\n\nFritz, who will face defending champion Carlos Alcaraz for a spot in the final, says he still prefers the new system.\n\n\"There's going to be some issues here and there but, to be honest, I still think it's much better to just have the electronic line-calling [system] calling the lines as opposed to umpires,\" he said.\n\n\"I do like not having to think about challenging calls in the middle of points,\" Fritz continued.\n\n\"I do like that we don't have to argue about calls and all this stuff. I think it's a better system.\"\n\nAlcaraz sets up semifinal meeting with Fritz\n\nDefending Wimbledon champion Carlos Alcaraz has eased into the semifinals, where he will face the fifth-seeded Fritz.\n\nAlcaraz brushed aside the remaining home player, Briton Cameron Norrie, 6-2, 6-3, 6-3.\n\nThe Spaniard lost the first three points on serve, but prevented Norrie from securing the break and never looked back. He took the first set in 28 minutes and the match in 99.\n\nThe victory extended his winning streak to 23 matches and his record on grass to 34 wins from 37.\n\n\"To be able to play another semifinal here at Wimbledon is really special,\" Alcaraz said.\n\n\"I am really happy with the level I played today against a really difficult player like Cam.\"\n\nAP/AAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-07-09/sheep-flock-shrinks-further-drought-record-lamb-prices/105506010",
        "title": "Record lamb prices continue as Australian sheep flock shrinks further",
        "publish_date": "Tue, 08 Jul 2025 21:44:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's sheep flock is shrinking because of the drought and is not expected to recover until at least 2027.\n\nMeat & Livestock Australia (MLA) said farmers in Victoria and South Australia had been forced to sell sheep as feed became scarce.\n\n\"We ask producers what the biggest impact is on their decision making and, overwhelmingly, it's the drought, especially in the southern states,\" MLA market information manager Steve Bignall said.\n\nA recent survey by MLA and Australian Wool Innovation (AWI) revealed farmers planned to decrease their female breeding sheep numbers by 9 per cent over the next 12 months.\n\n\"We did see an intention for producers to drop both ewe numbers going forward for 2026 and wether numbers,\" Mr Bignall said.\n\n\"Western Australia, South Australia and Victoria are driving that drop in ewe production.\"\n\nSteve Bignall says ewe numbers are expected to drop 9 per cent in the next 12 months. (Supplied: Meat & Livestock Australia)\n\nRecovery of the flock is not expected until at least 2027.\n\n\"We had a drop in 2025, a slight drop [is forecast] in 2026, before in an increase in 2027 as seasonal conditions return to normal,\" Mr Bignall said.\n\nLamb price records\n\nThe decline in sheep numbers is contributing to record prices at the saleyards.\n\nA pen of heavy lambs sold for a national record of $435 a head in Bendigo in central Victoria on Monday, making it the fifth record broken nationally in the past six weeks.\n\nIt just pipped the previous high set in Griffith, New South Wales, last month.\n\nJenny Kelly from the National Livestock Reporting Service said the top pen of grain-fed lambs was from Swan Hill and the record created \"a bit of excitement\" among the crowd in Bendigo.\n\nLambs are selling for record prices at the saleyards. (Supplied: Aaron Zwar)\n\n\"Seven pens of lambs made over $400 in this market,\" Ms Kelly said.\n\n\"They were really impressive and sold very well.\"\n\nMs Kelly said the high lamb price was supply-driven, with fewer lambs available this winter.\n\nThe last of the autumn-born animals are moving through the yards, with up to six months until the spring-born lambs will be ready for market, increasing the desperation of abattoirs to fill orders.\n\nSupply has also dwindled because of drought conditions in southern Australia, and strong demand from overseas markets.\n\n\"No-one really predicted the market [would get this high],\" Ms Kelly said.\n\n\"The spring run [of lambs] is going to be late because of the season and bad autumn, so processors have tough times ahead.\"\n\nAustralia's sheep flock is not expected to increase again until 2027. (ABC Rural: Angus Verley)\n\nSentiment is improving\n\nThe MLA and AWI survey showed sentiment among sheep farmers was improving, despite the declining flock and challenging weather conditions.\n\n\"The low supply in winter drives prices up, but the levels that it has got to are extremely impressive,\" Mr Bignall said.\n\n\"Prices for sheep meat are very high and that is largely the reason that sentiment is strong for the sheep meat sector.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/markets/the-unintended-consequences-of-trump-s-copper-tariff-20250709-p5mdld.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The unintended consequences of Trump’s copper tariff",
        "publish_date": "Wed, 09 Jul 2025 12:09:07 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The US has substantial reserves and resources of unmined copper, but only produced about half the 1.64 million tonnes of copper that it consumed last year. It gained another 150,000 or so tonnes from recycling but imported 810,000 tonnes of the refined metal. The challenge for the US is that it has copper in the ground but its smelting and refining capacity has shrunk over the past several decades. A slump in the copper price in the 1980s and 1990s led to the closure of US mines and smelters. In the late 1990s it still had 11 smelters in operation; today it has two, with a third that processes scrap. By contrast, China, which saw a strategic opportunity in the 1990s, made major investments in smelting and now has more than half the world’s smelting capacity. Ore from the rest of the world is exported to China to be smelted and refined and then either increasingly consumed within China – which is leading the global electrification race – or re-exported. Given the centrality of copper to the 21st Century economy and advanced industrial and military technologies, China’s dominance of the sector is obviously seen by the US as a national security threat.\n\nThe obvious response would be to produce and process more of its own copper. The problem it has is that most of its undeveloped resources are on federal land, which creates challenging and very lengthy approval processes. The average time to bring a new US mine into operation has blown out to about 29 years. The giant Resolution copper project in Arizona owned by Rio Tinto and BHP, for instance, was discovered in 1995. The Resolution Copper mine in Arizona. Credit: Darryl Webb Rio submitted a mine plan for the project, in which the companies have already invested several billion dollars, in 2013. It took until May this year for the US Supreme Court to clear the way for a land swap, opposed by native Americans, that will enable the project to proceed. It will take a decade or more to actually bring a mine into production. (BHP and Rio, via the giant Escondida mine in Chile will, incidentally, be exposed to the copper tariff, although more of that project’s output is exported to Asia. Rio does have a mine – and a smelter – in the US that might benefit from the tariff and the higher domestic copper prices it will produce).\n\nAdding more domestic supply of copper might address the threat of supply shortages and the increasing reliance on Latin America (although the US has a free trade agreements with Chile, the major producer), but it doesn’t solve the shortage of processing capacity. Loading Smelters take at least a decade and $US3 billion-plus of investment to construct and involve environmentally unfriendly processes, which is part of the explanation for why much of the global capacity migrated to China which, at the time, was more interested in economic and strategic benefits than its environment. Even if that capacity could be built in the US, it is unlikely to be competitive with China’s smelters. China already has about 8 of the 20 largest copper smelters in the world. In the meantime, with the likelihood that Trump’s new tariff will apply not only to imports of refined copper but downstream semi-fabricated products like copper sheeting and wire, US manufacturers reliant on copper will face a steep increase in costs.\n\nAmerica’s reliance on imported copper, once the tariff is in place, means that those manufacturers will not only incur higher costs that they will try to pass onto their own customers, but those costs will be unique to the US and therefore they will, to the extent that they compete outside the US or with imports, be at a significant competitive disadvantage. The ubiquity of copper usage means that will be an economy-wide issue, adding to inflation while damaging US competitiveness. That’s a familiar aspect of Trump’s trade war on the rest of the world. US copper buyers have already seen a preview of what’s to come within the differential in US copper prices and those in the rest of the world as traders scrambled to get in ahead of the tariffs. That rush to get their hands on physical metal not only forced the copper price to record levels, but has inverted the normal futures price curve for copper, known as contango, where future prices are higher than the spot price to reflect the costs of storage, opportunity costs and risk. The price curve is now in “backwardation” – spot prices are higher than future prices, with the prospect of losses for traders and hedged sellers of copper as their contracts expire and they are forced to cover their exposures at higher prices.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/voss-reacts-to-vile-personal-threat-20250709-p5mdo8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Voss reacts to vile personal threat",
        "publish_date": "Wed, 09 Jul 2025 11:57:05 +1000",
        "category": "finance",
        "authors": [],
        "text": "Voss reacts to vile personal threat\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/origin-iii-our-experts-make-the-call-on-who-will-win-the-decider-and-why-20250708-p5mda3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Origin III: Our experts make the call on who will win the decider and why",
        "publish_date": "Wed, 09 Jul 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [],
        "text": "Origin III: Our experts make the call on who will win the decider and why\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/the-next-big-thing-and-no-room-for-sentiment-what-we-learnt-from-joe-montemurro-s-first-matildas-matches-20250708-p5mdeo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The next big thing, and no room for sentiment: What we learnt from Joe Montemurro’s first Matildas matches",
        "publish_date": "Wed, 09 Jul 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "The tactical identity is clear – and will become clearer We know what Montemurro is trying to do: introduce an attacking, possession-based style of play into a team that has lacked on-field direction for some time. And when they last had a tactical direction, which feels like a lifetime ago, it wasn’t this one, with Tony Gustavsson’s preference to play a more transitional game. There were times when we saw it come to life, times when it broke down, and times when it didn’t look like there was a plan at all. That’s natural, given the circumstances: players are at the end of their seasons, many have had to be managed carefully, and chemistry can’t just be built overnight when you’re throwing together an unfamiliar team under a new coach who says he only knows one way of working. Behind the Matildas: Leanne Hall, Emanuele Chiappero, Joe Palatsides, head coach Joe Montemurro, Tony Franken and Emily Husband. Credit: Getty Images Fortunately, it’s unlikely to get worse. The players to come in are more technically adept at executing Montemurro’s plan, though being able to limit turnovers and stroke the ball around for long periods has proven a challenge for many of them in the past. And the ones who had a taste of it in this window can go away and work on what they know they’ll be asked to do next time they’re called in.\n\nThe midfield remains a puzzle Most people thought Paris 2024 would be Gorry’s last tournament. Now she’s about to turn 33 but she’s still kicking around. But does she come straight back into this team when she’s fit again? Should she, given the progress made by Wheeler (a late withdrawal from this window) and Cooney-Cross as a tandem midfield pairing? And where does Emily van Egmond fit into the picture, if anywhere? Matildas veteran Katrina Gorry. Credit: Visionhaus via Getty Images Montemurro rifled through a bunch of different combinations in this window – including the use of Kennedy as a defensive midfielder, which is where she plays for Angel City FC – to try and figure out how many viable options he may have to work with in future. Going back to the likes of Alex Chidiac and Chloe Berryhill didn’t go too well, and opinion is split as ever on van Egmond. If the Asian Cup was tomorrow, the make-up of the midfield would be anyone’s guess right now. Montemurro really needs to get some flying hours into the ones he deems to be first-choice to help them build up as much synergy as they can, as quickly as they can.\n\nAmy Sayer has finally arrived Sayer was 16 years old when made her international debut at the 2018 Tournament of Nations – in the same window as Fowler, who was 15. But as Fowler’s career exploded in the ensuing years, Sayer chose to take the US college route, and became a bit out of sight, out of mind. An ACL injury amplified that. She came close, but Gustavsson never picked her in the squad for a major tournament. Amy Sayer and Joe Montemurro. Credit: Getty Images Now 23, Sayer has come on in leaps and bounds. She has been arguably the “find” of the last few months, stealing the spotlight in Tom Sermanni’s final games in charge and then keeping that momentum rolling under Montemurro. Best used as a No.10, she can also play out wide in attack, and her poise and vision are, if not Fowler-esque, then of the same genre. She can be a huge player for the Matildas for many years to come.\n\nThe Matildas have depth in defence For once! The emergence of Jamilla Rankin and the development of Courtney Nevin and Charli Grant mean that Montemurro will have the incredible luxury of using Catley as a centre-back. Matildas defender Jamilla Rankin (right) in action against Panama. Credit: Getty Images And with Clare Hunt kicking on and Heatley making big strikes, there’s now red-hot competition for who should partner her – as well as, in the case of Kennedy, the possibility of more time anchoring the midfield rather than the back four. Factor in Carpenter on the other side, who will no doubt be rejuvenated by her move to Chelsea, and the Matildas suddenly have what they’ve not really had in a number of years: true depth in defence.\n\nThere’s no room for sentiment in selection anymore We mentioned van Egmond and Gorry before. What about Tameka Yallop? Or Emily Gielnik? For every player like Hayley Raso or Michelle Heyman who can demonstrate their unarguable worth to the team, there’s a fellow veteran who might be coasting along on reputation rather than currency. The idea of peak van Egmond, for example, is compelling. But how often do we see that idea in a match? Same goes for Chidiac. And while some of these established players are vital for dressing room morale, or in the case of Yallop and Gielnik are incredibly versatile, at what point do they risk being overtaken by emerging talents who can offer as much, if not more? Are we there yet? Possibly. Emily van Egmond. Credit: Getty Images These are the sort of questions Montemurro needs to consider carefully. If he can’t see a future for a player at Matildas level, and can’t be sure that someone else couldn’t do their job better at the Asian Cup, then he needs to tap them on the shoulder, because every minute matters right now.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/masterchef-uk-host-sacked-as-50-more-people-make-allegations-against-him-20250709-p5mdls.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "MasterChef UK host sacked as 50 more people make allegations against him",
        "publish_date": "Wed, 09 Jul 2025 11:43:58 +1000",
        "category": "finance",
        "authors": [
            "Anita Singh"
        ],
        "text": "Sophie alleged that Wallace had groped her while she was standing at a bar with him and his co-host, John Torode, at the 2013 series wrap party, doing it “covertly” so that Torode did not notice. She did not complain at the time because she feared being “booted off” the MasterChef team. Another MasterChef crew member, known as Alice, alleged that Wallace invited her into his dressing room in 2012, saying that he needed help getting changed into black tie, then pushed her down onto a sofa and pulled his trousers down. She reported the “disgusting and predatory” behaviour to the independent production company which made the show, but was allegedly told by a senior member of the production team: “You’re over 16, you’re not being ‘Jimmy Saviled’.” Allegations spanning decades\n\nThe allegations date back to 2002, when a participant on the BBC’s Saturday Kitchen – which was at the time produced in-house by the BBC– said that Wallace put a hand on her groin during a pre-show dinner and asked: “Do you like that?” Gregg Wallace (right) with MasterChef co-host, Australian-born John Torode. Credit: The Telegraph’s investigation heard from a junior production worker on the show who alleged that Wallace groped her breasts and bottom, but she dared not speak out for fear of losing her job. She said that Wallace’s conduct appeared to be condoned by senior members of staff who worked on the program. “It was like no one else had a problem with what was happening, so I couldn’t have a problem either,” she said. While MasterChef in the UK is made by Banijay, an independent production company, it is on the BBC’s list of eight “flagship programmes” which have special status owing to the length of time they have been established and how popular they are with audiences – raising questions of why there was no oversight from BBC management.\n\nThe new allegations about Wallace and the findings of the review will pile fresh pressure on Davie, the BBC director-general, who is already facing criticism over his handling of Bob Vylan’s controversial set at Glastonbury. The BBC is also braced for a highly critical report into its decision to broadcast a Gaza documentary without sufficient checks to establish that the child narrator was the son of a Hamas minister. Wallace stepped back from MasterChef in November after a number of allegations came to light. He had co-presented the show since 2005. In a statement ahead of the report’s publication, and anticipating the BBC’s new allegations, Wallace said: “After 21 years of loyal service to the BBC, I cannot sit in silence while my reputation is further damaged to protect others.” He claimed that the report will clear him of serious wrongdoing but will find him “primarily guilty of inappropriate language”.\n\n“I recognise that some of my humour and language, at times, was inappropriate. For that, I apologise without reservation,” he said. Loading He previously admitted to opening his dressing room door and shouting “hooray” while naked except for a sock on his penis, but said this was after the day’s filming had finished. Wallace hits back at BBC He hit out at the BBC News allegations, saying: “The BBC is no longer providing balanced and impartial public service journalism. It is peddling baseless and sensationalised gossip masquerading as properly corroborated stories.\n\n“The BBC is choosing to allow BBC News to run with this uncorroborated tittle-tattle in an attempt to ‘get ahead’ of the Silkin summary report and derail what has been an extremely thorough process. “This feels to me like BBC News is chasing slanderous clickbait rather than delivering impartial journalism.” The 60-year-old presenter complained that his suspected autism had made the MasterChef studio “a dangerous environment” for him. He added: “I was hired by the BBC and MasterChef as the cheeky greengrocer. A real person with warmth, character, rough edges and all. For over two decades, that authenticity was part of the brand. Now, in a sanitised world, that same personality is seen as a problem.” Kirsty Wark, the former Newsnight presenter, claimed that Wallace had told “sexualised” jokes while she was a contestant on Celebrity MasterChef in 2011.\n\nWallace hit back by saying that the complaints were coming from “a handful of middle-class women of a certain age,” a comment for which he later apologised. He said in his statement that “the most damaging claims including allegations from public figures… have not been upheld [and] were found to be baseless after a full and forensic six-month investigation.” Wallace also suggested that some of his behaviour was down to autism and criticised bosses for failing to take that into account. “My neurodiversity, now formally diagnosed as autism, was suspected and discussed by colleagues across countless seasons of MasterChef. “Yet nothing was done to investigate my disability or protect me from what I now realise was a dangerous environment for over 20 years. That failure is now being quietly buried,” he said. Wallace suggested that others were guilty of more serious offences than him, but that their behaviour would be brushed under the carpet.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/1000-lb-sisters-star-tammy-slaton-confirms-her-engagement-20250625-p5ma43.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "1000-Lb Sisters star Tammy Slaton confirms her engagement",
        "publish_date": "Wed, 09 Jul 2025 11:41:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "1000-Lb Sisters star Tammy Slaton confirms her engagement\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/1000-lb-sisters-star-tammy-slaton-receives-sweet-message-from-tv-twins-20250709-p5mdny.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "1000-Lb Sisters star Tammy Slaton receives sweet message from TV twins",
        "publish_date": "Wed, 09 Jul 2025 11:41:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "1000-Lb Sisters star Tammy Slaton receives sweet message from TV twins\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/dance/michael-flatley-lord-of-the-dance-20250707-p5md46.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Michael Flatley retired from dancing and made a spy movie. What’s he working on now?",
        "publish_date": "Wed, 09 Jul 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Will Cox"
        ],
        "text": "“I had a lot of miles on me,” he says. “Very, very, very few dancers ever dance past 30 years old. I didn’t actually get my start in the business until I was 35. And I miss it to this day. I miss coming on and stage at the end and seeing thousands of people standing up screaming and clapping for the show.”\n\nHis focus has shifted from dancer to impresario, mentor, entrepreneur. He describes his cast as “danceletes” – they’re at the peak of physical perfection, clear of mind and pure of body. They meditate and practice yoga together. “The men are cut and ripped,” he says. “The women are beautifully sculpted.”\n\n‘Very, very, very few dancers ever dance past 30 years old. I didn’t actually get my start in the business until I was 35.’ Michael Flatley\n\nBut the show’s aim, as he describes it, is far more humble. “I’m in the joy business,” he says. It’s a “good clean show,” he says, “a family show.” He wants no barriers between him and the crowd. It’s a grab for the widest possible audience. “When people come to my show – and a lot of the husbands probably get dragged to the show – they might have had a bad week or a bad day, but by the end they’re all happy, tapping their feet, clapping, and they go home humming a tune. And that’s a good place to be.”\n\nFlatley keeps busy with many other projects. There are the whiskey brand, the flute album and the abstract paintings, which he creates by dancing across a canvas with paint-covered shoes. There’s his spy movie, Blackbird (2018), which he financed, wrote, directed, produced, and starred in (it was dismissed by critics as a vanity project – but you don’t get to his position without the absolute self-belief required to get past the occasional misstep). All bear his name and his boundless enthusiasm.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/mitchell-starc-plays-his-100th-test-in-jamaica-not-even-his-wife-will-be-there-20250709-p5mdjn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mitchell Starc plays his 100th Test in Jamaica. Not even his wife will be there",
        "publish_date": "Wed, 09 Jul 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Ahead of the third Test on Saturday (Sunday morning AEST), this masthead spoke to the trio – and coach Andrew McDonald – about Starc’s impact on the team and his imminent entry into an exclusive club: he’s just the second Australian fast bowler, after Glenn McGrath, and 16th Australian to play 100 Tests. “I don’t think you’ll actually see that [commitment] again, especially in the next few generations,” Lyon said. “The amount of pride that Starcy puts on that baggy green is incredible.” Australia captain Alyssa Healy will not be in Jamaica for her husband Mitchell Starc’s 100th Test. Credit: Getty The captain’s view As one of Starc’s longest-serving teammates, Cummins knows better than anyone how difficult it is to play 100 Tests as a fast bowler. Cummins made his Test debut against South Africa a fortnight before Starc was given a baggy green against New Zealand in December 2011.\n\nThe NSW pair has bowled together for the best part of 15 years, and Cummins has the utmost respect for Starc’s resilience. So high is Starc’s standing in Cummins’ eyes, that he still gets the new ball over the skipper. Australia’s captain Pat Cummins talks to bowler Mitchell Starc on day three of the first cricket Test match against West Indies at Kensington Stadium in Bridgetown, Barbados. Credit: AP “We’ll come up with something [to celebrate]. It’s a huge effort,” Cummins, who has played 55 of his 70 Tests with Starc, said. “It’s a pretty small crew that have played 100 Tests. He’s the second fast bowler, which is really rare and tough to do. Proud of him. “He’s still bowling 145km/h at the end [of the recent Test against the West Indies]. I can’t fathom playing 100 games and keeping that kind of speed. He’s a warrior, turns up every week and just cracks on. He’s such a low-fuss kind of guy. All things going well, it’ll be a great week for him.”\n\nHazlewood: ‘It’s the late night physio sessions’ Hazlewood, a year younger than Starc, is another close friend and a constant presence in Australia’s attack. The pair has played 59 Tests together. Hazlewood, who debuted three years after Starc in Tests, reflected on the unseen side of Starc’s longevity – the mental and physical toll fast bowling takes on the body. “One of the things I admire is the work ethic,” Hazlewood said. “Everyone just sees you play the games and don’t see much else. Being in his shoes as well, and being around it for so long, you see everything that goes into it. It’s the late night physio treatment sessions. Josh Hazlewood of Australia celebrates a wicket with Mitchell Starc in January 2024. Credit: Getty “It’s a pretty amazing achievement to play 100 Tests. It’ll be awesome to be part of it.”\n\nAsked if there was a spell or match that he vividly remembers Starc being at the peak of his powers, Hazlewood said: “I think you see snippets of it nearly every game. You know when he’s in your team, wickets can fall in a heap, whether it be up front, in the middle or the tail. If he gets the ball in hand and gets on a roll, he can go bang, bang, bang and turn the game on its head. No matter the conditions, no matter the opposition, no matter the situation, he can turn the game on its head in space with two overs.” Lyon: Why Starc is special Lyon, Australia’s most prolific off-spinner, has played in all but five of Starc’s 99 Tests. He has seen it all. “How long have we got?” Lyon said. “I’ll be over the moon. I’ll probably get emotional seeing him play and go out there. I’ve seen the work and the injuries he’s been through. He’s basically the first picked in every Australian cricket team in my life. “Starcy is special. He’s the ultimate professional in the way he prepares and also recovers. For him to be on the verge of 100 Test matches … and be the second fast bowler, I feel like that’s a phenomenal record.\n\n“The number of times that he plays through pain or injury or soreness is phenomenal.” Lyon is adamant Starc is still bowling as well as ever. This year, he’s averaging 20.86 with the ball. “To be honest with you, I feel like over the last 12 months, it’s probably the best that Starcy’s ever bowled,” Lyon said. Nathan Lyon celebrates with Pat Cummins and Mitchell Starc. Credit: AP\n\n“The rhythm that he bowled with in the World Test Championship final a couple of weeks ago was incredible viewing. Even when he’s not at his best, he finds a way. He’s just that competitor that you want to play with.” A coach’s love Loading McDonald opened the batting against Starc in his final first-class match in 2014. Eleven years on, Starc is a stalwart in the team he coaches and selects. “It’s an incredible achievement,” McDonald said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/cook-not-concerned-by-japan-on-selling-surplus-australian-gas-20250708-p5mdic.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cook not concerned by Japan on-selling surplus Australian gas",
        "publish_date": "Wed, 09 Jul 2025 11:27:44 +1000",
        "category": "finance",
        "authors": [
            "Hamish Hastie"
        ],
        "text": "WA Premier Roger Cook has shrugged off criticism of Japan’s on-selling of surplus Australian gas to other Asian customers, saying it is just part of their business model.\n\nCook has just returned from a mission to Japan where the country emphasised the need for a continued stable supply of Australian gas to stabilise its energy grid as it moved away from coal-fired power.\n\nWA Premier Roger Cook in Japan.\n\nCook met with senior Japanese bureaucrats and politicians, including Vice-Minister for International Affairs Matsuo Takehiko to discuss energy security, resources and decarbonisation.\n\nIn the face of criticism from environmental groups of Australia’s fossil fuel industry, Cook has repeatedly pressed the point that Australia’s LNG helps larger Asian economies reduce carbon pollution by moving out of coal.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/emotional-tino-to-dig-deep-for-maroons-and-a-grieving-munster-20250708-p5mdgd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Emotional Tino to dig deep for Maroons – and a grieving Munster",
        "publish_date": "Wed, 09 Jul 2025 11:20:21 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Tears cascaded down Tino Fa’asuamaleaui’s face, his eyes gleaming in the stadium lights, as the national anthem was sung to launch State of Origin 2025.\n\nAbout a year before he watched from the sidelines, recovering from a ruptured ACL, as Queensland suffered a series defeat.\n\nNow, the softly spoken enforcer was back where he belonged.\n\n“I love this state, everybody probably saw that in game one,” Fa’asuamaleaui said before the decider in Sydney.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/diners-singing-in-aftermath-of-attack-20250709-p5mdn9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Diners singing in aftermath of attack",
        "publish_date": "Wed, 09 Jul 2025 11:09:05 +1000",
        "category": "finance",
        "authors": [],
        "text": "Diners singing in aftermath of attack\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/more-than-100-dead-and-160-still-missing-after-texas-floods/wd1r7sng0",
        "title": "More than 100 dead and 160 still missing after Texas floods",
        "publish_date": "Tue, 8 Jul 2025 21:37:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Torrential rains struck a region of Texas last Friday, unleashing deadly flooding.\n\nThe death toll has risen past 100, including children.\n\nThere have been questions raised about the county's emergency management operations and preparedness.\n\nThe death toll from a flash flood that ravaged a part of Texas in the United States last week has risen to at least 109, many of them children, as search teams pressed on through mounds of mud-encrusted debris for scores of people still missing.\n\n\n\n\n\nThe bulk of fatalities and the search for additional victims were concentrated in Kerr County and the county seat of Kerrville, a town of 25,000 residents transformed into a disaster zone when torrential rains struck the region early last Friday, unleashing deadly flooding along the Guadalupe River.\n\n\n\n\n\nThe bodies of 94 flood victims, more than a third of them children, have been recovered in Kerr County alone as of Tuesday, Texas governor Greg Abbott said at a late-afternoon news conference after touring the area by air.\n\n\n\n\n\nHe said 161 other people were known to be missing in the flood zone.\n\n\n\n\n\nThe Kerr County dead included 27 campers and counsellors from Camp Mystic, a nearly century-old all-girls Christian summer retreat on the banks of the Guadalupe near the town of Hunt.\n\n\n\n\n\nThe camp director also perished. Five girls and a camp counsellor were still unaccounted for on Tuesday, Abbott said, along with another child not associated with the camp.\n\n\n\nTwenty-seven campers and counsellors from a century-old, all-girls Christian summer retreat called Camp Mystic were among the dead. Source: AAP / AP / Eli Hartman As of midday, 15 other flood-related fatalities had been confirmed across a swath of Texas Hill Country known as \"flash flood alley\", the governor said, bringing the overall death toll from the disaster to 109.\n\n\n\n\n\nReports from local sheriffs' and media have put the number of flood deaths outside Kerr County at 22.\n\n\n\n\n\nHindered by continuing intermittent thunderstorms and showers, rescue teams from federal agencies, neighbouring states and Mexico have joined local efforts to search for missing victims, though hopes of finding more survivors faded as time passed.\n\n\n\n\n\nThe last flood victim found alive in Kerr County was on Friday.\n\n\n\n\n\n\"The work is extremely treacherous, time-consuming,\" lieutenant colonel Ben Baker of the Texas Game Wardens said at a press conference.\n\n\n\n\n\n\"It's dirty work. The water is still there.\"\n\n\n\nQuestions over flood warnings\n\nMore than a foot of rain fell in the region in less than an hour before dawn last Friday, sending a wall of water cascading down the Guadalupe River basin that killed dozens of people and left behind mangled piles of debris, uprooted trees and vehicles.\n\n\n\n\n\nLocal, state and federal emergency officials have faced days of angry questions about whether they could have warned people in flood-prone areas sooner.\n\n\n\n\n\nAt an earlier news briefing on Tuesday, Kerr County sheriff Larry Leitha rebuffed questions about the county's emergency management operations and preparedness and declined to say who in the county was ultimately in charge of monitoring weather alerts and issuing a flood warning or evacuation orders.\n\n\n\nLISTEN TO 'We had no warning': locals questioning lead-up to deadly floods in Texas SBS News 08/07/2025 05:21 English\n\nHe said his office first started receiving emergency 911 calls between 4am and 5am local time on Friday, several hours after the local National Weather Service station issued a flash-flood alert.\n\n\n\n\n\n\"We're in the process of trying to put (together) a timeline,\" Leitha said.\n\n\n\n\n\nUS President Donald Trump plans to visit the devastated region this week, a spokesperson said.\n\n\n\n\n\nDemocrats in Washington have called for an official investigation into whether the Trump administration's job cuts at the National Weather Service affected the agency's response to the floods.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/complaints-surge-as-customer-frustration-with-telcos-grows/c9viq8t07",
        "title": "Australians are becoming more frustrated with their telcos — and escalating their complaints",
        "publish_date": "Tue, 8 Jul 2025 21:11:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians are increasingly escalating complaints about phone providers to the industry ombudsman when telcos can't solve them.\n\n\n\n\n\nAnalysis from the communications watchdog, released on Wednesday, highlighted a nearly sevenfold increase in the rate of complaints about the worst-performing company being escalated to the industry ombudsman.\n\n\n\n\n\nCircles.Life racked up 152 complaints per 10,000 services — the most escalations out of the nation's 36 largest telcos in the March 2025 quarter.\n\n\n\n\n\nBut its former customers may receive a reprieve, after Circles.Life shut up shop.\n\n\n\n\n\nIts customer accounts were acquired by larger provider Amaysim, which finished above the nation's big-three telcos Telstra, Optus and TPG in the Australian Communications and Media Authority (ACMA) complaints-handling performance table.\n\n\n\n\n\nAmaysim was acquired by Optus in 2021 and uses the larger telco's network, as did Circles.Life.\n\n\n\nOptus fared poorly in the analysis, taking the 31st spot out of 36 companies. Source: AAP Amaysim said the ACMA findings relating to Circles.Life have no implication on their operations and the final customers transferred in June now have access to Amaysim's \"award-winning\" customer support.\n\n\n\n\n\nMore broadly, the rate of customer complaints being referred to the Telecommunications Industry Ombudsman (TIO) has risen for the third consecutive quarter.\n\n\n\n\n\nThe report from ACMA says 7.1 per cent of customer complaints were referred to the ombudsman, up from 6.9 per cent in the previous quarter.\n\n\n\n\n\nReferring a complaint to the TIO means the issue was not able to be resolved between customers and their provider.\n\n\n\nACMA member Samantha Yorke said having to refer complaints to the ombudsman adds to consumers' frustrations about making a complaint in the first place.\n\n\n\n\n\n\"The data shows that some telcos need to do a lot more to address complaints so that customers don't have to escalate the matter to the TIO to have it fixed,\" she said.\n\n\n\n\n\nA spokeswoman for the TIO said customer issues with financial hardship rose 71.9 per cent in the last quarter.\n\n\n\n\n\nTwo of the nation's biggest telcos fared particularly poorly in the analysis, with Optus (31st) and TPG (34th) occupying spots near the bottom of the 36-ranked companies for rate of referred complaints.\n\n\n\n\n\nTelstra — Australia's biggest provider — was 18th, with 31 complaints per 10,000 services.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-four-pogacar-claims-100th-career-victory-with-explosive-win/elblhsxme",
        "title": "Tour de France stage four: Pogacar claims 100th career victory with 'explosive' win",
        "publish_date": "Tue, 8 Jul 2025 20:20:51 +0000",
        "category": "sports",
        "authors": [],
        "text": "Slovenian cyclist Tadej Pogacar blew past his rivals in an \"explosive\" finish to take Tour de France stage four at Rouen on Wednesday morning AEST and claim his 100th professional victory.\n\n\n\n\n\n\"That was really pure, classic Tour-de-France-style explosive,\" said an elated Pogacar.\n\n\n\n\n\nThe win did not quite bring him the overall lead. Dutch powerhouse Mathieu van der Poel finished second to keep the yellow jersey.\n\n\n\n\n\nPogacar attacked on an incline to the line to finish just ahead of Van der Poel with Jonas Vingegaard third.\n\n\n\n\n\nIt was the 26-year-old cyclist's 18th Tour de France stage win as he seeks a fourth overall triumph on the Tour.\n\n\n\n\"There was big adrenaline and a big field of contenders,\" Pogacar said.\n\n\n\n\n\nFans were treated to another Pogacar-Vingegaard head-to-head duel as five hills made the final 40km a roller-coaster.\n\n\n\n\n\nVan der Poel also entered the fray and kept the overall lead he took from Alpecin teammate Jasper Philipsen, who quit the Tour injured after a nasty fall .\n\n\n\nFans were treated to a head-to-head duel between Danish cyclist Jonas Vingegaard and Slovenian cyclist Tadej Pogacar. Source: AAP / Belga / Sipa USA / Bernard Papon \"Jasper needs to recover, and I hope he understands how hard I tried to win for him today,\" Van der Poel said.\n\n\n\n\n\nOn the day's final real climb, Pogacar dropped all his rivals, with only Vingegaard offering a real fight.\n\n\n\n\n\nBut van der Poel and Vingegaard both came back at Pogacar, making him fight all the way to the line in a thunderous finale.\n\n\n\n\n\nThe same trio top the overall standings, with Pogacar second and Vingegaard in third.\n\n\n\nVan der Poel took the overall lead on stage two but risks losing it on Wednesday's time trial.\n\n\n\n\"I should be happy to have the jersey again,\" said Van der Poel. \"I was surrounded by climbers out there, you know.\"\n\n\n\n\n\n\"Tadej was stronger and it's as simple as that.\"\n\n\n\n\n\nUnlike the opening three stages, there was hardly a puff of wind and not a drop of rain, but there were still plenty of falls.\n\n\n\nPolice shoot man wielding knife\n\nThere was also a knifing incident with a man at Rouen slightly injuring a police officer before being shot by French riot police as he tried to escape.\n\n\n\n\n\nNeither the police officer nor the alleged culprit suffered life-threatening injuries.\n\n\n\nTime trial for stage five\n\nStage five will shake up the overall standings with a 33km individual time trial around Caen.\n\n\n\n\n\nThe stage is being billed as the day Remco Evenepoel will finally slip into the overall leader's yellow jersey.\n\n\n\n\n\nTo do so, the 25-year-old Belgian world and Olympic champion in the discipline will need to cover the course 59 seconds faster than Pogacar and Vingegaard.\n\n\n\nREAD MORE Think you could race the Tour de France? Explore the 2025 map and key stats\n\n\"Tomorrow will be the big day, the real test of how good everyone is,\" said Pogacar.\n\n\n\n\n\n\"Don't count Remco out,\" he added. \"He's the best in the world, and he'll be going full gas, like me.\"\n\n\n\n\n\nThe man who designs the race, Thierry Gouvenou, predicted big time differences on the time trial.\n\n\n\n\n\n\"It's flat and runs through exposed plains. This is a course designed for the specialists. You need to be aerodynamic and powerful,\" he said, which suggests it could suit Evenepoel in particular.\n\n\n\n\n\n\"This is a red letter day for all the main contenders.\"\n\n\n\n\n\nRarely lacking in confidence, Evenepoel was true to form.\n\n\n\n\n\n\"I can put a minute into them all tomorrow,\" he said in Rouen after the fourth stage.\n\n\n\n\n\nThe first mountains come as late as stage 10 over the volcanic landscape of the Puy de Dome, with two more colossal climbing days in the Pyrenees before the blockbuster final week in the Alps.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/anthony-albanese-the-us-and-china-explained/a86m9xogb",
        "title": "'Political tension': Anthony Albanese, the US and China, explained",
        "publish_date": "Tue, 8 Jul 2025 19:36:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "As Prime Minister Anthony Albanese prepares to meet with his Chinese counterpart Xi Jinping, questions have been raised over how the US will view the visit and whether there could be consequences for Australia.\n\n\n\n\n\nThe visit comes after US President Donald Trump announced new tariff rates of 25 per cent on some trading partners, including Japan and South Korea.\n\n\n\n\n\nUS tariffs on Australian products remain at 10 per cent, but with relations between the two allies strained, could the US respond negatively to Australia potentially strengthening ties with China?\n\n\n\n\n\nHere's what you need to know.\n\n\n\nAustralia's relationship with China\n\nAlbanese is set to visit China from Saturday, his second trip to the country since he became prime minister in 2022.\n\n\n\n\n\nChina is Australia's largest two-way trading partner, and buys almost a third of Australia's exports. Trade between the two countries was worth almost $312 billion in 2024, according to the Department of Foreign Affairs and Trade.\n\n\n\nREAD MORE Trump declares 25 per cent tariffs on Japan and South Korea in first wave of letters\n\nThe relationship appears to be strengthening after a period of volatility, which included China placing restrictions on some Australian exports between 2020 and 2024.\n\n\n\n\n\nChina's ambassador to Australia, Xiao Qian, has called for greater collaboration in fields such as AI, healthcare and green energy under a revised free-trade deal between the two nations.\n\n\n\n\n\nIn an opinion piece published in the Australian Financial Review, Xiao wrote that it was \"time to advance bilateral relations with steady progress\".\n\n\n\n\n\nHe wrote that China was willing to review the two countries' trade agreement with \"a more open attitude and higher standard\", including further consolidating traditional areas and actively pursuing new growth areas.\n\n\n\n\n\nChristoph Nedopil, director of the Griffith University Asia Institute, said while there is a \"mutual interest\" in strengthening the relationship between Australia and China, this has been years in the making.\n\n\n\n\n\nHe does not believe China is seeking to take advantage of rocky relationships between the US and its allies, including Australia.\n\n\n\n\"China has been trying to make bilateral and multilateral alliances even before Trump was in office, it's not that the stabilisation of the Australia-China relationship only came when Trump was in office,\" Nedopil said.\n\n\n\n\n\n\"And a number of the topics that are on the agenda are not new topics.\"\n\n\n\n\n\nIn a press conference on Tuesday, Treasurer Jim Chalmers was asked whether the Australian government was considering freer trade with China, Korea and Japan in response to Trump's tariffs. Trump announced on Tuesday he would impose tariffs of at least 25 per cent on South Korea and Japan from August unless the countries can strike deals with the US.\n\n\n\n\n\nThe US imposed tariffs on China of 145 per cent earlier this year and average US tariffs on Chinese exports now stand at around 50 per cent, according to the US-based Peterson Institute for International Economics.\n\n\n\n\n\nWhile Chalmers did not directly address the issue of the US tariffs, he said stabilising Australia's relationship with China was positive for the economy, workers, employers and industries.\n\n\n\n\"A good, stable, reliable trading relationship with China is key to making sure that our economy continues to grow the right way,\" he said.\n\n\n\n\n\n\"We want good, reliable, diverse trading relationships right around the world. We've got wonderful exports, we've got huge opportunities.\"\n\n\n\n\n\nChalmers said the government was \"optimistic about the future when it comes to Australia's place in the global economy\".\n\n\n\n'Political tension' between Australia and the US\n\nWhile Australia's ties with China could be building, the relationship with the US is somewhat strained, according to David Andrews, senior policy advisor at the Australian National University's National Security College.\n\n\n\n\n\n\"It's a relationship we've had for decades and decades now, and we have consistently viewed that as our most important strategic partner and one of our closest international friends and alliances,\" he said.\n\n\n\n\n\n\"At the same time, it's clear that we're going through a period of political tension and relational tension.\"\n\n\n\nAndrews believes much of the tension has come as a result of Trump's tariffs, which he announced in April, along with \"heavy-handedness\" of the US government.\n\n\n\n\n\nBut he said while the relationship is \"challenging\" at the moment, diplomacy and international relations are constantly evolving.\n\n\n\n\n\n\"There is an ongoing, persistent rebalancing of that relationship to understand what is being asked of us and therefore how much we are willing to accept as well,\" he said.\n\n\n\n\n\n\"I think that the prime minister has been very clear that [in] putting a very public sense of boundary or limit on what we will do and how far we'll go and the implications for the relationship.\"\n\n\n\nCould the US change tariffs on Australia?\n\nAt the time of writing, Australia has not received a tariff increase, meaning most of its exports to the US remain subject to the baseline 10 per cent, while there is a 50 per cent tariff on steel and aluminium exports.\n\n\n\n\n\nThe government would continue to try to negotiate a total exemption from US tariffs, Albanese said, even though no country in the world had done so.\n\n\n\nAndrews said the \"status quo\" of the 10 per cent tariff is likely Australia's \"best case scenario\", and pointed out that no other trading partners had been unable to negotiate an exemption.\n\n\n\n\n\n\"Obviously, it would be great if we could get some sort of exemption on the steel and aluminium tariff, for example, but I don't see any evidence that's likely to change,\" he said.\n\n\n\n\n\n\"It's a dispositional change in the way the United States views the international economic order, and we can't convince them otherwise.\n\n\n\n\n\n\"It would be wildly optimistic to think that we could make any, I think, improvement on our situation.\"\n\n\n\nWhile a tariff reduction or exemption may be unlikely, some have questioned whether the US government could raise tariffs on Australia in retaliation to Albanese's meeting with Xi.\n\n\n\n\n\nNedopil said it's difficult to predict the actions of the Trump administration.\n\n\n\n\n\n\"In a way, the US policymaking at this time seems to be very news-driven and so very short-term sentiment-driven,\" he said.\n\n\n\n\n\n\"So what President Trump might consider as disrespect can lead to a short-term decision announcement that might be more negative.\"\n\n\n\n\n\nThe relationship between China and the US is complex, with the two considered economic and strategic competitors.\n\n\n\n\n\nNedopil said he believes the rivalry has become \"much more intense\" on a number of fronts, which he says is \"undermining US dominance\", which Trump may take into consideration.\n\n\n\n\n\n\"And I think the other shift that has taken place ... is that actually a lot of Asian countries and emerging economies are not viewing China as negatively as they used to.\n\n\n\n\n\n\"I think there are dynamics that make the US seem not as strong and potentially [not] feel as strong and therefore also trying to hold onto power with a number of different means.\"\n\n\n\n\n\nAdditional reporting by the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/reserve-bank-holds-interest-rates-at-3-85/kj75gf2vt",
        "title": "Reserve Bank holds interest rates at 3.85%",
        "publish_date": "Tue, 8 Jul 2025 09:09:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Reserve Bank holds interest rates at 3.85%\n\nPublished 8 July 2025, 6:31 am\n\nThe Reserve Bank has disappointed borrowers and gone against market expectations by holding interest rates at 3.85% at today's board meeting. It wasn't a unanimous decision - but the RBA ultimately decided it could afford to wait a little longer, to make sure inflation is moderating sustainably.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/why-the-rba-didnt-cut-interest-rates-in-july/6y71facsa",
        "title": "Why the RBA didn't cut interest rates in July",
        "publish_date": "Tue, 8 Jul 2025 07:45:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-8-july-2025/z95ncefeq",
        "title": "Evening News Bulletin 8 July 2025",
        "publish_date": "Tue, 8 Jul 2025 05:44:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nIn this bulletin;\n\n\n\nThe Reserve Bank holds interest rates steady despite expected cuts;\n\nNT Police acknowledge institutional racism and pledge to reform;\n\nAnd in rugby league, New South Wales carry an experience advantage into the State of Origin decider tomorrow.\n\n\n\n\n\nThe Reserve Bank has kept interest rates on hold in a move that will disappoint borrowers hoping for further mortgage relief.\n\n\n\n\n\nThe surprise decision went against expectations of most traders and economists, who were leaning towards a 25 basis point cash rate cut to reflect the under-control inflation and sluggish retail spending.\n\n\n\n\n\nThe RBA board says maintaining price stability and full employment is their priority and they want to ensure inflation rates have stabilised in a sustainable fashion before more cuts.\n\n\n\n\n\nTreasurer Jim Chalmers says, while it's not the decision millions of Australians were hoping for, he trusts independent decisions made by the board.\n\n\n\n\n\nHe praises Australia's ability to make progress on inflation without the consequences of a deteriorating economy or high unemployment rates.\n\n\n\n\n\n\"Under the life of this government, we've got inflation down. We've got real wages growing. Unemployment is low. Our economy has continued to tick over. Interest rates have come down twice in five months, but we know the job's not finished because people are still under pressure and the global environment is so uncertain.\"\n\n\n\n\n\n—\n\n\n\n\n\nNorthern Territory Police have acknowledged systemic racism within their organisation and have promised to stamp out bigotry and reform policies.\n\n\n\n\n\nIt comes after the end of the three year coronial inquiry into the fatal police shooting of 19-year-old First Nations man Kumanjayi Walker.\n\n\n\n\n\nCoroner Elizabeth Armitage's report found Mr Walker's death was avoidable, and that the state's police force failed to protect the public through poor supervision and management of constable Zachary Rolfe's use of force.\n\n\n\n\n\nIn her statement she says she also found that \"Mr Rolfe was racist and that he worked in and was the beneficiary of an organisation with hallmarks of institutional racism.\"\n\n\n\n\n\nNT Police Deputy Commissioner Martin Dole says they have acknowledged the coroner's 18 recommendations to police and will act to meaningfully reform the organisation.\n\n\n\n\n\n\"We also acknowledge the coroners findings that all forms of racism have existed within the Northern Territory police force at various times. That is confronting but it is a truth that we must face. What was tolerated in the past will no longer be acceptable. We are committed to stamping out racism. That includes seriously re-examining how we return to a meaningful version of community policing, one that reflects the needs and expectations of Aboriginal people and builds trust at a local level.\"\n\n\n\n\n\n—\n\n\n\n\n\nPrime Minister Anthony Albanese has responded to the latest twist in United States President Donald Trump's tariff roll-out, saying Australia will not stop pushing for an exemption.\n\n\n\n\n\nShares on Wall Street have fallen after President Trump sent letters to 14 countries, including allies Japan and South Korea, unveiling sharply higher tariffs on imports into the United States, while postponing their implementation to August 1.\n\n\n\n\n\nAustralian goods to the US have already been subjected to the country's baseline 10 per cent tariffs, the minimum rate imposed on all US trading partners.\n\n\n\n\n\nMr Albanese says he's not expecting a higher tariff rate as Australia hasn't proposed counter-tariffs on US goods.\n\n\n\n\n\n\"No, because we're not increasing tariffs. Australia has a tariff rate of 10 per cent. No country has a better deal than Australia. Now, we'll continue to put our case that tariffs are an act of economic self-harm and we should be entitled to reciprocal tariffs that are zero. But the U-S administration has a view and no country has secured an exemption.\"\n\n\n\n\n\n—\n\n\n\n\n\nIn rugby league,\n\n\n\n\n\nNew South Wales will carry an advantage into the State of Origin decider, with Penrith's five-year NRL dynasty helping prepare the Blues for rugby league's grandest stage.\n\n\n\n\n\nNew South Wales will enter tomorrow night's decider at Sydney's Accor Stadium as firm favourites, despite Queensland's game-two win in Perth keeping the series alive.\n\n\n\n\n\nOrigin deciders are considered the second biggest game of each NRL season behind the grand final and it is in that department where the Blues have their biggest advantage.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-8-july-2025/d2z01bnfz",
        "title": "SBS News In Easy English 8 July 2025",
        "publish_date": "Tue, 8 Jul 2025 05:00:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWelcome to SBS News In Easy English. I'm Catriona Stirrat.\n\n\n\n\n\nPrime Minister Anthony Albanese has dismissed calls for a national task force to help address antisemitism, following a string of attacks targeting the community over the weekend.\n\n\n\n\n\nThe Executive Council of Australian Jewry is urging the government to adopt a 15-point action plan including the establishment of a national task force, and the Opposition has supported calls for a national cabinet to address the issue.\n\n\n\n\n\nMr Albanese says the federal government has provided action and funding to address antisemitism.\n\n\n\n\n\n\"Every time an issue comes up, people say let's have a national cabinet. Let's be clear, what people want is not a meeting, they want action. Indeed on Saturday one of the reasons why this gentleman has been caught so quickly is because the CCTV that was in place there was as a direct result of federal government funding. In addition the reinforcement of that door of the synagogue was done with that Commonwealth security funding.\"\n\n\n\n\n\nExecutive Council of Australian Jewry President Daniel Aghion has also asked Victorian authorities to introduce protest zones to confine weekly pro-Palestine protests.\n\n\n\n\n\nA 34-year-old man Angelo Loras has been charged with arson and reckless conduct endangering life over the alleged firebombing of the East Melbourne synagogue on Saturday night.\n\n\n\n\n\nThe same evening, a group of protesters disrupted diners and damaged property at Israeli restaurant Miznon.\n\n\n\n\n\n—\n\n\n\n\n\nEconomists are expecting the Reserve Bank will deliver its third interest rate cut of the year when it meets this afternoon.\n\n\n\n\n\nMoney markets have priced in a 75 per cent chance official interest rates will fall to 3.6 per cent.\n\n\n\n\n\nAnalysts say this is because both headline and underlying inflation are firmly within the Reserve Bank's 2 to 3 per cent target band.\n\n\n\n\n\nRabobank Senior Strategist Benjamin Picton says that is a result of lower demand.\n\n\n\n\n\n\"Business are telling us there is not enough demand out there to soak up higher prices, so they no longer have pricing power, they no longer have the ability to pass on cost increases, so as a result we are starting to see discounting popping up in certain sectors of the economy, most notably home construction costs, we're starting to see discounting there.\"\n\n\n\n\n\n—\n\n\n\n\n\nUS President Donald Trump has confirmed he will send additional weapons to Ukraine, after the White House announced a pause to some arms shipments for Kyiv the previous week.\n\n\n\n\n\nSpeaking during a dinner with Israeli Prime Minister Benjamin Netanyahu and members of their respective staffs, Trump was asked if he planned to send more weapons for use by Kyiv.\n\n\n\n\n\nJOURNALIST: \"On Ukraine, Mr President, are you planning to send more weapons to Ukraine?\"\n\n\n\n\n\nTRUMP: \"We're going to send some more weapons. We have to. They have to be able to defend themselves. They're getting hit very hard now. They're getting hit very hard. We're going to have to send more weapons, yeah, defensive weapons, primarily. But they're getting hit very, very hard. So many people are dying in that mess.\"\n\n\n\n\n\nRussia has launched some of the largest missile and drone attacks of the three-year war, and the Trump administration's pause on sending munitions posed a potentially serious challenge for Kyiv.\n\n\n\n\n\nUnder former president Joe Biden, Washington provided more than $65 billion in military assistance to Ukraine.\n\n\n\n\n\nPresident Trump didn't follow suit upon his election, announcing no new military aid packages for Kyiv since he took office in January of this year.\n\n\n\n\n\n—\n\n\n\n\n\nAnd in cycling,\n\n\n\n\n\nBelgian rider Tim Merlier has won the third stage of the Tour de France after edging ahead of Italian Jonathan Milan in a chaotic sprint chase.\n\n\n\n\n\nA photo finish confirmed the line result in the coastal city of Dunkerque.\n\n\n\n\n\nThe stage also saw another dramatic turn 60 kilometres from the end, when Belgian Jasper Philipsen was forced to withdraw from the race following a brutal collision with Bryan Coquard.\n\n\n\n\n\nHis team says he has fractured his collarbone and broken at least one rib and will require surgery.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/reserve-bank-of-australia-interest-rates-decision-july/ej20umyw5",
        "title": "Reserve Bank's message after surprise interest rate decision: 'Wait a few weeks'",
        "publish_date": "Tue, 8 Jul 2025 04:31:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Interest rates will remain on hold at 3.85 per cent — but the Reserve Bank of Australia (RBA) has suggested an \"easing cycle\" is coming for millions of borrowers.\n\n\n\n\n\nMany economists and commentators had tipped the RBA would cut rates following July's meeting, which would have been the third this year after 0.25 percentage point decreases in both February and May.\n\n\n\n\n\nThree of the board's nine members also pushed for a change to the interest rate, but six — a majority — opted for a hold.\n\n\n\n\n\nRBA governor Michele Bullock said inflation data released at the end of July, ahead of the next meeting on 12 August, would be key.\n\n\n\n\n\n\"Provided we are still on top of inflation, which is what we intend to be, then, and we're getting confirmation that we are, then, yes, there is an easing cycle coming,\" she said.\n\n\n\nThe RBA has kept interest rates on hold at 3.85 per cent. Source: SBS News \"We just want to confirm with a full quarterly CPI that we're still on track to deliver inflation continuing down to the middle of the band over time,\" Bullock said.\n\n\n\n\n\n\"That's the reason we're waiting. We decided to hold and we'll reconsider again in August with this extra information and new forecasts. And that will allow us to decide whether or not we're still on track for continuing to ease.\n\n\n\n\n\n\"The board decided to wait a few weeks to confirm that we're still on track to meet our inflation and employment objectives, as well as a very thorough consideration of Australian economic conditions.\"\n\n\n\n'Not the outcome a lot of people wanted'\n\nTreasurer Jim Chalmers said the decision to hold the rate cut was \"not the outcome that a lot of people wanted\", but highlighted the Reserve Bank was independent of government.\n\n\n\n\n\n\"I don't second-guess decisions taken independently by the bank or its board. I don't make predictions or pre-empt future movements in interest rates,\" he told reporters on Tuesday.\n\n\n\n\n\n\"Interest rates have come down twice in five months. But we know the job's not finished because people are still under pressure, and the global environment is so uncertain.\"\n\n\n\nLISTEN TO Reserve Bank keeps interest rates on hold despite expected cuts SBS News 08/07/2025 01:19 English\n\nBut Ted O'Brien, the Opposition's Treasury spokesperson, said Australian households were \"on their knees\" and said Labor could not manage the economy.\n\n\n\n\n\n\"Here in Australia, under the Albanese government, interest rates have been too high for too long.\n\n\n\n\n\n\"This is a direct consequence of Labor not being able to manage money. Labor continues on its spending spree and as the RBA itself has recognised, public sector spending is only leading to homegrown inflation.\n\n\n\n\n\n\"Until Labor starts reinstalling some discipline around fiscal responsibility, it will only make the job of the RBA harder. The RBA's job is harder because of Labor's actions, not easier, and the Australian people are poorer, not wealthier.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/un-highlights-humanitarian-and-human-rights-crises-in-afghanistan/6xvq7y7kp",
        "title": "UN highlights humanitarian and human rights crises in Afghanistan",
        "publish_date": "Tue, 8 Jul 2025 03:45:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAt the UN headquarters in New York, 116 countries voted in favour of a resolution introduced by Germany, expressing grave concern about Afghanistan’s humanitarian situation, particularly the rights of women and girls under Taliban rule.\n\n\n\n\n\nThe United States and Israel voted against, while a dozen countries, including China and Pakistan, abstained.\n\n\n\n\n\nGermany’s Ambassador to the UN, Antje Leendertse, facilitated the resolution.\n\n\n\n\n\nShe said the measure reaffirmed the international community’s continued engagement with the Afghan people.\n\n\n\n\n\n“The situation in Afghanistan remains of concern to the international community. The United Nations and its member states remain engaged on the future of Afghanistan and its people. And that is the main message of the resolution before us. As the facilitator of this resolution, Germany has actively engaged all UN member states over the past weeks and months.”\n\n\n\n\n\nShe acknowledged that while many find the Taliban’s governance deeply troubling, engagement remains unavoidable.\n\n\n\n\n\n“As many others, Germany acknowledges that there is no alternative to engagement with the Taliban, and we will continue to actively contribute to the UN-led Doha process. We support the approach of the UN working groups and remain open for further pragmatic forms of cooperation with the de-facto authorities, including on the safe return of Afghan refugees.”\n\n\n\n\n\nBut Afghanistan’s own representative to the UN painted a much bleaker picture.\n\n\n\n\n\nChargé d'Affaires Naseer Ahmad Faiq, who represents the ousted Islamic Republic, accused the Taliban of dragging the country backwards.\n\n\n\n\n\n“ Afghanistan is at a crossroads. Since August 2021, the country has experienced alarming regression across all sectors, social, political, economic, and human rights. Nearly four years under Taliban rule have driven Afghanistan into one of the world’s gravest humanitarian and human rights crises, as extensively documented by the Secretary-General and the Special Rapporteur on the situation of human rights in Afghanistan.”\n\n\n\n\n\nMr Faiq supported the resolution’s call for inclusive governance and intra-Afghan dialogue, not Taliban rule by decree.\n\n\n\n\n\n“The resolution rightly underscores that lasting peace in Afghanistan requires inclusive, representative, and participatory governance. We strongly support the call for a credible political process rooted in genuine intra-Afghan dialogue that reflects the diverse aspirations of all Afghans—women, youth, minorities, and civil society. The Taliban are a group which – should they wish – be part of the solution to Afghanistan’s crisis, but they can never be the sole solution by themselves.”\n\n\n\n\n\nThat message of cautious engagement comes at a delicate time.\n\n\n\n\n\nLast week, Russia officially recognised the Taliban government, becoming the first country to do so since the group seized power in August 2021.\n\n\n\n\n\nMoscow’s foreign ministry says it has accepted credentials from the Taliban’s appointed ambassador and called it the start of productive bilateral cooperation.\n\n\n\n\n\nTaliban Foreign Minister Amir Khan Muttaqi welcomed the decision, calling it “a good example for other countries.”\n\n\n\n\n\nNo other country has formally recognised the Taliban government that took over after US-led forces staged a chaotic withdrawal from Afghanistan following 20 years of war.\n\n\n\n\n\nHowever, China, the United Arab Emirates, Uzbekistan and Pakistan have all designated ambassadors to Kabul, in a step towards recognition.\n\n\n\n\n\nThe Taliban has been seeking international legitimacy, while maintaining strict enforcement of their version of Islamic law, including banning girls from secondary schools and restricting women from work and public life.\n\n\n\n\n\nThe UN resolution is symbolic and carries no legal force, but it reflects global unease about rewarding a regime many still view as illegitimate.\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/no-antisemitism-taskforce-planned-says-albanese-midday-news-bulletin-8-july-2025/mg5xqty8x",
        "title": "No antisemitism taskforce planned says Albanese | Midday News Bulletin 8 July 2025",
        "publish_date": "Tue, 8 Jul 2025 02:05:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nIn this bulletin;\n\n\n\nJewish leaders call for a national taskforce to tackle antisemitism;\n\nDonald Trump and Benjamin Netanyahu hold ceasefire talks at the White House;\n\nAnd in sport, Alex de Minaur goes down to Novak Djokovic in the Wimbledon quarter final.\n\nAustralia's Jewish community is calling for more action from the federal government to combat antisemitism, following a string of attacks targeting the community over the weekend.\n\n\n\n\n\nThe Executive Council of Australian Jewry is urging the government to adopt a 15-point action plan including the establishment of a national task force focused on antisemitism.\n\n\n\n\n\nThe council's president Daniel Aghion also asked Victorian authorities to ban weekly pro-Palestine protests in their current form, and bring in protest zones instead.\n\n\n\n\n\nPolice have arrested 34-year-old man Angelo Loras for arson over the alleged firebombing of the East Melbourne synagogue on Saturday night.\n\n\n\n\n\nThe same evening, a group of protesters disrupted diners and damaged property at Israeli restaurant Miznon.\n\n\n\n\n\nThe protest group says they had nothing to with the attack on the synagogue.\n\n\n\n\n\n—\n\n\n\n\n\nEconomists are tipping the Reserve Bank will deliver its third interest rate cut of the year when it meets this afternoon.\n\n\n\n\n\nMoney markets have priced in a 75 per cent chance official interest rates will fall to 3.6 per cent.\n\n\n\n\n\nAnalysts say this is because both headline and underlying inflation are firmly within the Reserve Bank's 2 to 3 per cent target band.\n\n\n\n\n\nRabobank Senior Strategist Benjamin Picton says that is a result of lower demand.\n\n\n\n\n\n\"Business are telling us there is not enough demand out there to soak up higher prices, so they no longer have pricing power, they no longer have the ability to pass on cost increases, so as a result we are starting to see discounting popping up in certain sectors of the economy, most notably home construction costs, we're starting to see discounting there.\"\n\n\n\n\n\n—\n\n\n\n\n\nUnited States President Donald Trump has held a dinner for Israeli Prime Minister Benjamin Netanyahu at the White House.\n\n\n\n\n\nThe pair are meeting with top security aides to discuss the latest U-S backed Gaza ceasefire proposal.\n\n\n\n\n\nThe US-backed plan includes a 60-day ceasefire during which Hamas would hand over more hostages, Israeli forces would withdraw to a buffer zone, and more aid would be allowed into Gaza.\n\n\n\n\n\nIn answer to questions about the possibility of a two-state solution, Mr Netanyahu said, he believed peace could be achieved in the region.\n\n\n\n\n\n\"I think that Palestinians should have power to govern, but not the power to threaten us. And that means that certain powers like our security will always remain in our hands. Now, that is a fact. And no-one in Israel will allow or agree to anything else, because we don't commit suicide. We want life. We cherish life. For ourselves, for our neighbours and I think that we can work out a peace between us and the entire Middle East with President Trump's leadership.\"\n\n\n\n\n\nMr Netanyahu also announced he has nominated Mr Trump for a Nobel Peace Price, saying the President has forged peace in one country after another.\n\n\n\n\n\n—\n\n\n\n\n\nThe United Nations General Assembly has voted to adopt a resolution highlighting the plight of women and girls and decline of human rights under the Taliban in Afghanistan.\n\n\n\n\n\n116 countries voted for the resolution, introduced by Germany, and 12 abstained. The United States and Israel voted against it.\n\n\n\n\n\nNaseer Ahmad Faiq is the Chargé d'Affaires of the Islamic Republic of Afghanistan to the United Nations.\n\n\n\n\n\nHis government was in power from 2004 before it was toppled by the Taliban in 2021.\n\n\n\n\n\n“Mr. President, Afghanistan is at a crossroads. Since August 2021, the country has experienced alarming regression across all sectors—social, political, economic, and human rights. Nearly four years under Taliban rule have driven Afghanistan into one of the world’s gravest humanitarian and human rights crises, as extensively documented by the Secretary-General and the Special Rapporteur on the situation of human rights in Afghanistan.”\n\n\n\n\n\nLast week, Russia became the first country to formally recognise the Taliban’s government in Afghanistan.\n\n\n\n\n\n—\n\n\n\n\n\nAnd in sport,\n\n\n\n\n\nNovak Djokovic reached the Wimbledon quarter-finals, defeating Australian Alex de Minaur.\n\n\n\n\n\nAfter losing the first set in just 31 minutes, the Serb won the next three sets 6-4 each.\n\n\n\n\n\nAfter the match, de Minaur admitted he needed to lift his game, in order to match the top-ranked players.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/markets/the-unintended-consequences-of-trump-s-copper-tariff-20250709-p5mdld.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The unintended consequences of Trump’s copper tariff",
        "publish_date": "Wed, 09 Jul 2025 12:09:07 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The US has substantial reserves and resources of unmined copper, but only produced about half the 1.64 million tonnes of copper that it consumed last year. It gained another 150,000 or so tonnes from recycling but imported 810,000 tonnes of the refined metal. The challenge for the US is that it has copper in the ground but its smelting and refining capacity has shrunk over the past several decades. A slump in the copper price in the 1980s and 1990s led to the closure of US mines and smelters. In the late 1990s it still had 11 smelters in operation; today it has two, with a third that processes scrap. By contrast, China, which saw a strategic opportunity in the 1990s, made major investments in smelting and now has more than half the world’s smelting capacity. Ore from the rest of the world is exported to China to be smelted and refined and then either increasingly consumed within China – which is leading the global electrification race – or re-exported. Given the centrality of copper to the 21st Century economy and advanced industrial and military technologies, China’s dominance of the sector is obviously seen by the US as a national security threat.\n\nThe obvious response would be to produce and process more of its own copper. The problem it has is that most of its undeveloped resources are on federal land, which creates challenging and very lengthy approval processes. The average time to bring a new US mine into operation has blown out to about 29 years. The giant Resolution copper project in Arizona owned by Rio Tinto and BHP, for instance, was discovered in 1995. The Resolution Copper mine in Arizona. Credit: Darryl Webb Rio submitted a mine plan for the project, in which the companies have already invested several billion dollars, in 2013. It took until May this year for the US Supreme Court to clear the way for a land swap, opposed by native Americans, that will enable the project to proceed. It will take a decade or more to actually bring a mine into production. (BHP and Rio, via the giant Escondida mine in Chile will, incidentally, be exposed to the copper tariff, although more of that project’s output is exported to Asia. Rio does have a mine – and a smelter – in the US that might benefit from the tariff and the higher domestic copper prices it will produce).\n\nAdding more domestic supply of copper might address the threat of supply shortages and the increasing reliance on Latin America (although the US has a free trade agreements with Chile, the major producer), but it doesn’t solve the shortage of processing capacity. Loading Smelters take at least a decade and $US3 billion-plus of investment to construct and involve environmentally unfriendly processes, which is part of the explanation for why much of the global capacity migrated to China which, at the time, was more interested in economic and strategic benefits than its environment. Even if that capacity could be built in the US, it is unlikely to be competitive with China’s smelters. China already has about 8 of the 20 largest copper smelters in the world. In the meantime, with the likelihood that Trump’s new tariff will apply not only to imports of refined copper but downstream semi-fabricated products like copper sheeting and wire, US manufacturers reliant on copper will face a steep increase in costs.\n\nAmerica’s reliance on imported copper, once the tariff is in place, means that those manufacturers will not only incur higher costs that they will try to pass onto their own customers, but those costs will be unique to the US and therefore they will, to the extent that they compete outside the US or with imports, be at a significant competitive disadvantage. The ubiquity of copper usage means that will be an economy-wide issue, adding to inflation while damaging US competitiveness. That’s a familiar aspect of Trump’s trade war on the rest of the world. US copper buyers have already seen a preview of what’s to come within the differential in US copper prices and those in the rest of the world as traders scrambled to get in ahead of the tariffs. That rush to get their hands on physical metal not only forced the copper price to record levels, but has inverted the normal futures price curve for copper, known as contango, where future prices are higher than the spot price to reflect the costs of storage, opportunity costs and risk. The price curve is now in “backwardation” – spot prices are higher than future prices, with the prospect of losses for traders and hedged sellers of copper as their contracts expire and they are forced to cover their exposures at higher prices.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/voss-reacts-to-vile-personal-threat-20250709-p5mdo8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Voss reacts to vile personal threat",
        "publish_date": "Wed, 09 Jul 2025 11:57:05 +1000",
        "category": "finance",
        "authors": [],
        "text": "Voss reacts to vile personal threat\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/origin-iii-our-experts-make-the-call-on-who-will-win-the-decider-and-why-20250708-p5mda3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Origin III: Our experts make the call on who will win the decider and why",
        "publish_date": "Wed, 09 Jul 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [],
        "text": "Origin III: Our experts make the call on who will win the decider and why\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/the-next-big-thing-and-no-room-for-sentiment-what-we-learnt-from-joe-montemurro-s-first-matildas-matches-20250708-p5mdeo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The next big thing, and no room for sentiment: What we learnt from Joe Montemurro’s first Matildas matches",
        "publish_date": "Wed, 09 Jul 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "The tactical identity is clear – and will become clearer We know what Montemurro is trying to do: introduce an attacking, possession-based style of play into a team that has lacked on-field direction for some time. And when they last had a tactical direction, which feels like a lifetime ago, it wasn’t this one, with Tony Gustavsson’s preference to play a more transitional game. There were times when we saw it come to life, times when it broke down, and times when it didn’t look like there was a plan at all. That’s natural, given the circumstances: players are at the end of their seasons, many have had to be managed carefully, and chemistry can’t just be built overnight when you’re throwing together an unfamiliar team under a new coach who says he only knows one way of working. Behind the Matildas: Leanne Hall, Emanuele Chiappero, Joe Palatsides, head coach Joe Montemurro, Tony Franken and Emily Husband. Credit: Getty Images Fortunately, it’s unlikely to get worse. The players to come in are more technically adept at executing Montemurro’s plan, though being able to limit turnovers and stroke the ball around for long periods has proven a challenge for many of them in the past. And the ones who had a taste of it in this window can go away and work on what they know they’ll be asked to do next time they’re called in.\n\nThe midfield remains a puzzle Most people thought Paris 2024 would be Gorry’s last tournament. Now she’s about to turn 33 but she’s still kicking around. But does she come straight back into this team when she’s fit again? Should she, given the progress made by Wheeler (a late withdrawal from this window) and Cooney-Cross as a tandem midfield pairing? And where does Emily van Egmond fit into the picture, if anywhere? Matildas veteran Katrina Gorry. Credit: Visionhaus via Getty Images Montemurro rifled through a bunch of different combinations in this window – including the use of Kennedy as a defensive midfielder, which is where she plays for Angel City FC – to try and figure out how many viable options he may have to work with in future. Going back to the likes of Alex Chidiac and Chloe Berryhill didn’t go too well, and opinion is split as ever on van Egmond. If the Asian Cup was tomorrow, the make-up of the midfield would be anyone’s guess right now. Montemurro really needs to get some flying hours into the ones he deems to be first-choice to help them build up as much synergy as they can, as quickly as they can.\n\nAmy Sayer has finally arrived Sayer was 16 years old when made her international debut at the 2018 Tournament of Nations – in the same window as Fowler, who was 15. But as Fowler’s career exploded in the ensuing years, Sayer chose to take the US college route, and became a bit out of sight, out of mind. An ACL injury amplified that. She came close, but Gustavsson never picked her in the squad for a major tournament. Amy Sayer and Joe Montemurro. Credit: Getty Images Now 23, Sayer has come on in leaps and bounds. She has been arguably the “find” of the last few months, stealing the spotlight in Tom Sermanni’s final games in charge and then keeping that momentum rolling under Montemurro. Best used as a No.10, she can also play out wide in attack, and her poise and vision are, if not Fowler-esque, then of the same genre. She can be a huge player for the Matildas for many years to come.\n\nThe Matildas have depth in defence For once! The emergence of Jamilla Rankin and the development of Courtney Nevin and Charli Grant mean that Montemurro will have the incredible luxury of using Catley as a centre-back. Matildas defender Jamilla Rankin (right) in action against Panama. Credit: Getty Images And with Clare Hunt kicking on and Heatley making big strikes, there’s now red-hot competition for who should partner her – as well as, in the case of Kennedy, the possibility of more time anchoring the midfield rather than the back four. Factor in Carpenter on the other side, who will no doubt be rejuvenated by her move to Chelsea, and the Matildas suddenly have what they’ve not really had in a number of years: true depth in defence.\n\nThere’s no room for sentiment in selection anymore We mentioned van Egmond and Gorry before. What about Tameka Yallop? Or Emily Gielnik? For every player like Hayley Raso or Michelle Heyman who can demonstrate their unarguable worth to the team, there’s a fellow veteran who might be coasting along on reputation rather than currency. The idea of peak van Egmond, for example, is compelling. But how often do we see that idea in a match? Same goes for Chidiac. And while some of these established players are vital for dressing room morale, or in the case of Yallop and Gielnik are incredibly versatile, at what point do they risk being overtaken by emerging talents who can offer as much, if not more? Are we there yet? Possibly. Emily van Egmond. Credit: Getty Images These are the sort of questions Montemurro needs to consider carefully. If he can’t see a future for a player at Matildas level, and can’t be sure that someone else couldn’t do their job better at the Asian Cup, then he needs to tap them on the shoulder, because every minute matters right now.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/masterchef-uk-host-sacked-as-50-more-people-make-allegations-against-him-20250709-p5mdls.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "MasterChef UK host sacked as 50 more people make allegations against him",
        "publish_date": "Wed, 09 Jul 2025 11:43:58 +1000",
        "category": "finance",
        "authors": [
            "Anita Singh"
        ],
        "text": "Sophie alleged that Wallace had groped her while she was standing at a bar with him and his co-host, John Torode, at the 2013 series wrap party, doing it “covertly” so that Torode did not notice. She did not complain at the time because she feared being “booted off” the MasterChef team. Another MasterChef crew member, known as Alice, alleged that Wallace invited her into his dressing room in 2012, saying that he needed help getting changed into black tie, then pushed her down onto a sofa and pulled his trousers down. She reported the “disgusting and predatory” behaviour to the independent production company which made the show, but was allegedly told by a senior member of the production team: “You’re over 16, you’re not being ‘Jimmy Saviled’.” Allegations spanning decades\n\nThe allegations date back to 2002, when a participant on the BBC’s Saturday Kitchen – which was at the time produced in-house by the BBC– said that Wallace put a hand on her groin during a pre-show dinner and asked: “Do you like that?” Gregg Wallace (right) with MasterChef co-host, Australian-born John Torode. Credit: The Telegraph’s investigation heard from a junior production worker on the show who alleged that Wallace groped her breasts and bottom, but she dared not speak out for fear of losing her job. She said that Wallace’s conduct appeared to be condoned by senior members of staff who worked on the program. “It was like no one else had a problem with what was happening, so I couldn’t have a problem either,” she said. While MasterChef in the UK is made by Banijay, an independent production company, it is on the BBC’s list of eight “flagship programmes” which have special status owing to the length of time they have been established and how popular they are with audiences – raising questions of why there was no oversight from BBC management.\n\nThe new allegations about Wallace and the findings of the review will pile fresh pressure on Davie, the BBC director-general, who is already facing criticism over his handling of Bob Vylan’s controversial set at Glastonbury. The BBC is also braced for a highly critical report into its decision to broadcast a Gaza documentary without sufficient checks to establish that the child narrator was the son of a Hamas minister. Wallace stepped back from MasterChef in November after a number of allegations came to light. He had co-presented the show since 2005. In a statement ahead of the report’s publication, and anticipating the BBC’s new allegations, Wallace said: “After 21 years of loyal service to the BBC, I cannot sit in silence while my reputation is further damaged to protect others.” He claimed that the report will clear him of serious wrongdoing but will find him “primarily guilty of inappropriate language”.\n\n“I recognise that some of my humour and language, at times, was inappropriate. For that, I apologise without reservation,” he said. Loading He previously admitted to opening his dressing room door and shouting “hooray” while naked except for a sock on his penis, but said this was after the day’s filming had finished. Wallace hits back at BBC He hit out at the BBC News allegations, saying: “The BBC is no longer providing balanced and impartial public service journalism. It is peddling baseless and sensationalised gossip masquerading as properly corroborated stories.\n\n“The BBC is choosing to allow BBC News to run with this uncorroborated tittle-tattle in an attempt to ‘get ahead’ of the Silkin summary report and derail what has been an extremely thorough process. “This feels to me like BBC News is chasing slanderous clickbait rather than delivering impartial journalism.” The 60-year-old presenter complained that his suspected autism had made the MasterChef studio “a dangerous environment” for him. He added: “I was hired by the BBC and MasterChef as the cheeky greengrocer. A real person with warmth, character, rough edges and all. For over two decades, that authenticity was part of the brand. Now, in a sanitised world, that same personality is seen as a problem.” Kirsty Wark, the former Newsnight presenter, claimed that Wallace had told “sexualised” jokes while she was a contestant on Celebrity MasterChef in 2011.\n\nWallace hit back by saying that the complaints were coming from “a handful of middle-class women of a certain age,” a comment for which he later apologised. He said in his statement that “the most damaging claims including allegations from public figures… have not been upheld [and] were found to be baseless after a full and forensic six-month investigation.” Wallace also suggested that some of his behaviour was down to autism and criticised bosses for failing to take that into account. “My neurodiversity, now formally diagnosed as autism, was suspected and discussed by colleagues across countless seasons of MasterChef. “Yet nothing was done to investigate my disability or protect me from what I now realise was a dangerous environment for over 20 years. That failure is now being quietly buried,” he said. Wallace suggested that others were guilty of more serious offences than him, but that their behaviour would be brushed under the carpet.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/1000-lb-sisters-star-tammy-slaton-confirms-her-engagement-20250625-p5ma43.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "1000-Lb Sisters star Tammy Slaton confirms her engagement",
        "publish_date": "Wed, 09 Jul 2025 11:41:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "1000-Lb Sisters star Tammy Slaton confirms her engagement\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/1000-lb-sisters-star-tammy-slaton-receives-sweet-message-from-tv-twins-20250709-p5mdny.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "1000-Lb Sisters star Tammy Slaton receives sweet message from TV twins",
        "publish_date": "Wed, 09 Jul 2025 11:41:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "1000-Lb Sisters star Tammy Slaton receives sweet message from TV twins\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/dance/michael-flatley-lord-of-the-dance-20250707-p5md46.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Michael Flatley retired from dancing and made a spy movie. What’s he working on now?",
        "publish_date": "Wed, 09 Jul 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Will Cox"
        ],
        "text": "“I had a lot of miles on me,” he says. “Very, very, very few dancers ever dance past 30 years old. I didn’t actually get my start in the business until I was 35. And I miss it to this day. I miss coming on and stage at the end and seeing thousands of people standing up screaming and clapping for the show.”\n\nHis focus has shifted from dancer to impresario, mentor, entrepreneur. He describes his cast as “danceletes” – they’re at the peak of physical perfection, clear of mind and pure of body. They meditate and practice yoga together. “The men are cut and ripped,” he says. “The women are beautifully sculpted.”\n\n‘Very, very, very few dancers ever dance past 30 years old. I didn’t actually get my start in the business until I was 35.’ Michael Flatley\n\nBut the show’s aim, as he describes it, is far more humble. “I’m in the joy business,” he says. It’s a “good clean show,” he says, “a family show.” He wants no barriers between him and the crowd. It’s a grab for the widest possible audience. “When people come to my show – and a lot of the husbands probably get dragged to the show – they might have had a bad week or a bad day, but by the end they’re all happy, tapping their feet, clapping, and they go home humming a tune. And that’s a good place to be.”\n\nFlatley keeps busy with many other projects. There are the whiskey brand, the flute album and the abstract paintings, which he creates by dancing across a canvas with paint-covered shoes. There’s his spy movie, Blackbird (2018), which he financed, wrote, directed, produced, and starred in (it was dismissed by critics as a vanity project – but you don’t get to his position without the absolute self-belief required to get past the occasional misstep). All bear his name and his boundless enthusiasm.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/mitchell-starc-plays-his-100th-test-in-jamaica-not-even-his-wife-will-be-there-20250709-p5mdjn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mitchell Starc plays his 100th Test in Jamaica. Not even his wife will be there",
        "publish_date": "Wed, 09 Jul 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Ahead of the third Test on Saturday (Sunday morning AEST), this masthead spoke to the trio – and coach Andrew McDonald – about Starc’s impact on the team and his imminent entry into an exclusive club: he’s just the second Australian fast bowler, after Glenn McGrath, and 16th Australian to play 100 Tests. “I don’t think you’ll actually see that [commitment] again, especially in the next few generations,” Lyon said. “The amount of pride that Starcy puts on that baggy green is incredible.” Australia captain Alyssa Healy will not be in Jamaica for her husband Mitchell Starc’s 100th Test. Credit: Getty The captain’s view As one of Starc’s longest-serving teammates, Cummins knows better than anyone how difficult it is to play 100 Tests as a fast bowler. Cummins made his Test debut against South Africa a fortnight before Starc was given a baggy green against New Zealand in December 2011.\n\nThe NSW pair has bowled together for the best part of 15 years, and Cummins has the utmost respect for Starc’s resilience. So high is Starc’s standing in Cummins’ eyes, that he still gets the new ball over the skipper. Australia’s captain Pat Cummins talks to bowler Mitchell Starc on day three of the first cricket Test match against West Indies at Kensington Stadium in Bridgetown, Barbados. Credit: AP “We’ll come up with something [to celebrate]. It’s a huge effort,” Cummins, who has played 55 of his 70 Tests with Starc, said. “It’s a pretty small crew that have played 100 Tests. He’s the second fast bowler, which is really rare and tough to do. Proud of him. “He’s still bowling 145km/h at the end [of the recent Test against the West Indies]. I can’t fathom playing 100 games and keeping that kind of speed. He’s a warrior, turns up every week and just cracks on. He’s such a low-fuss kind of guy. All things going well, it’ll be a great week for him.”\n\nHazlewood: ‘It’s the late night physio sessions’ Hazlewood, a year younger than Starc, is another close friend and a constant presence in Australia’s attack. The pair has played 59 Tests together. Hazlewood, who debuted three years after Starc in Tests, reflected on the unseen side of Starc’s longevity – the mental and physical toll fast bowling takes on the body. “One of the things I admire is the work ethic,” Hazlewood said. “Everyone just sees you play the games and don’t see much else. Being in his shoes as well, and being around it for so long, you see everything that goes into it. It’s the late night physio treatment sessions. Josh Hazlewood of Australia celebrates a wicket with Mitchell Starc in January 2024. Credit: Getty “It’s a pretty amazing achievement to play 100 Tests. It’ll be awesome to be part of it.”\n\nAsked if there was a spell or match that he vividly remembers Starc being at the peak of his powers, Hazlewood said: “I think you see snippets of it nearly every game. You know when he’s in your team, wickets can fall in a heap, whether it be up front, in the middle or the tail. If he gets the ball in hand and gets on a roll, he can go bang, bang, bang and turn the game on its head. No matter the conditions, no matter the opposition, no matter the situation, he can turn the game on its head in space with two overs.” Lyon: Why Starc is special Lyon, Australia’s most prolific off-spinner, has played in all but five of Starc’s 99 Tests. He has seen it all. “How long have we got?” Lyon said. “I’ll be over the moon. I’ll probably get emotional seeing him play and go out there. I’ve seen the work and the injuries he’s been through. He’s basically the first picked in every Australian cricket team in my life. “Starcy is special. He’s the ultimate professional in the way he prepares and also recovers. For him to be on the verge of 100 Test matches … and be the second fast bowler, I feel like that’s a phenomenal record.\n\n“The number of times that he plays through pain or injury or soreness is phenomenal.” Lyon is adamant Starc is still bowling as well as ever. This year, he’s averaging 20.86 with the ball. “To be honest with you, I feel like over the last 12 months, it’s probably the best that Starcy’s ever bowled,” Lyon said. Nathan Lyon celebrates with Pat Cummins and Mitchell Starc. Credit: AP\n\n“The rhythm that he bowled with in the World Test Championship final a couple of weeks ago was incredible viewing. Even when he’s not at his best, he finds a way. He’s just that competitor that you want to play with.” A coach’s love Loading McDonald opened the batting against Starc in his final first-class match in 2014. Eleven years on, Starc is a stalwart in the team he coaches and selects. “It’s an incredible achievement,” McDonald said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/cook-not-concerned-by-japan-on-selling-surplus-australian-gas-20250708-p5mdic.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cook not concerned by Japan on-selling surplus Australian gas",
        "publish_date": "Wed, 09 Jul 2025 11:27:44 +1000",
        "category": "finance",
        "authors": [
            "Hamish Hastie"
        ],
        "text": "WA Premier Roger Cook has shrugged off criticism of Japan’s on-selling of surplus Australian gas to other Asian customers, saying it is just part of their business model.\n\nCook has just returned from a mission to Japan where the country emphasised the need for a continued stable supply of Australian gas to stabilise its energy grid as it moved away from coal-fired power.\n\nWA Premier Roger Cook in Japan.\n\nCook met with senior Japanese bureaucrats and politicians, including Vice-Minister for International Affairs Matsuo Takehiko to discuss energy security, resources and decarbonisation.\n\nIn the face of criticism from environmental groups of Australia’s fossil fuel industry, Cook has repeatedly pressed the point that Australia’s LNG helps larger Asian economies reduce carbon pollution by moving out of coal.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/emotional-tino-to-dig-deep-for-maroons-and-a-grieving-munster-20250708-p5mdgd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Emotional Tino to dig deep for Maroons – and a grieving Munster",
        "publish_date": "Wed, 09 Jul 2025 11:20:21 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Tears cascaded down Tino Fa’asuamaleaui’s face, his eyes gleaming in the stadium lights, as the national anthem was sung to launch State of Origin 2025.\n\nAbout a year before he watched from the sidelines, recovering from a ruptured ACL, as Queensland suffered a series defeat.\n\nNow, the softly spoken enforcer was back where he belonged.\n\n“I love this state, everybody probably saw that in game one,” Fa’asuamaleaui said before the decider in Sydney.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/diners-singing-in-aftermath-of-attack-20250709-p5mdn9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Diners singing in aftermath of attack",
        "publish_date": "Wed, 09 Jul 2025 11:09:05 +1000",
        "category": "finance",
        "authors": [],
        "text": "Diners singing in aftermath of attack\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-drivers-dash-cam-video-shows-increasingly-common-problem-in-aussie-cities-020222133.html",
        "title": "Aussie driver's dash cam video shows 'increasingly common problem' in Aussie cities",
        "publish_date": "2025-07-09T02:02:22Z",
        "category": "finance",
        "authors": [],
        "text": "The concerningly close encounter in Canberra is becoming more common across the country – and can cost driver more than $3 million a year.\n\nDash cam footage has captured the moment a feral deer suddenly bolted in front of drivers on a road in Canberra. Source: Invasive Species Council/Chris Per\n\nDash cam footage has captured the shocking moment two drivers almost collided with an invasive pest after it darted across a busy road, highlighting an “increasingly common problem” plaguing Aussie cities.\n\nVideo of the incredibly close call filmed “in the middle of Canberra” shows a large feral deer suddenly appear on a grass median strip before bolting across two lanes of traffic, just metres in front of startled motorists who couldn’t help but exclaim “what the f***”.\n\nConcerningly, the dangerous encounter is becoming a more frequent occurrence as one of the country’s most problematic introduced species continue to spill onto roads.\n\n“This is an increasingly common problem in our cities as feral deer numbers have exploded, and governments have failed to invest enough to effectively control them,” the Invasive Species Council said on Wednesday when sharing the dash cam footage. “We are seeing more and more feral deer on train lines, crossing roads and trashing and trampling our precious places.”\n\nDeer were introduced in the early 1800s by European settlers — mainly imported for recreational hunting — but because they have no natural predators here, numbers have risen exponentially across the entire continent, but they are particularly common in Victoria, NSW and Tasmania.\n\nADVERTISEMENT\n\nEarlier this year, South Australian residents said an “avalanche” of the feral invaders had started wreaking havoc in their gardens and posing a series threat on roads.\n\nAs well as the danger of collision, deer “trash and eat native vegetation, ringbark trees, create wallows, trample undergrowth and spread weed seeds, all things that threaten the survival of native flora and fauna,” National Deer Management Coordinator for the Centre for Invasive Species Solutions, Dr Annelise Wiebkin, previously told Yahoo News.\n\nIn 2021, deer were responsible for costing the Australian economy approximately $91.3 million, largely due to agricultural losses. The economic impact also extends to infrastructure, with deer-related motor vehicle collisions causing an estimated $3.3 million in damages, as well as $1.2 million in train collisions.\n\nThere's estimated to be between one and two million deer in Australia, with their introduced pest regularly spilling onto roads. Source: Tasmanian Government\n\nInvasive Species Council argues shooting lobby responsible for deer explosion\n\nAccording to the Invasive Species Council, the pest’s numbers have grown exponentially in part due to pressure from the shooting lobby “delaying, undermining and stopping effective feral deer control”.\n\nADVERTISEMENT\n\n“It surprises many people to discover the shooting lobby are the reason feral deer numbers are so high and growing, but the truth is that they spent decades stopping deer being declared a pest in NSW and are still working hard to keep them protected under law as ‘game animals’ in Victoria and Tasmania,” the group said.\n\n“The aim is to have our national parks and state forests become game reserves for their sport — but we all cop the consequences of this.”\n\nTo reduce feral deer populations, the ISC said “well-funded professional control programs based on thermal assisted aerial control” are necessary. Since 2021 the ACT Government has been using this technology to help detect and cull the animals, with local experts telling the ABC earlier this year that the program had “positive results”.\n\nThe ISC argues that while recreational ground shooting alone “is generally ineffective for population control, it can contribute to effective control as a supplement to other methods or in easily accessible small areas” such as farms.\n\nADVERTISEMENT\n\n“We support strategic collaborations with recreational shooters aligned with coordinated well-planned programs that have clear targets,” it said. “But it’s important to be clear that recreational hunting is a supplementary, not primary, solution and that these programs often involve very high bureaucratic costs for already stretched agencies.”\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/one-thing-aussies-no-longer-013012054.html",
        "title": "One thing Aussies no longer do",
        "publish_date": "2025-07-09T01:30:12Z",
        "category": "finance",
        "authors": [
            "Blair Jackson"
        ],
        "text": "The significant cost of housing play a factor in more and more couples deciding not to get divorced. Picture: NewsWire / Jeremy Piper\n\nDivorces are becoming less common because of the heightened cost of living, an Australian lawyer says, with government data backing up the anecdotal evidence.\n\n“The question we’re hearing more and more is: Can either of us afford to live after this?” family law specialist Kylie Burke said.\n\n“In 2025, we’re seeing more disputes over school fees, medical costs and even basic shared-care logistics – because everyone is under pressure.”\n\nGovernment data shows divorce rates in 2023 hit their lowest since the mid-70s.\n\nThe rate of divorce in Australia has decelerated over the past few decades but not as abruptly as the marriage rate. Picture: NewsWire / Brenton Edwards\n\nIn 1975, no-fault divorce was written into law, removing the need to prove adultery or desertion, meaning divorces could be granted because of irreconcilable differences.\n\nADVERTISEMENT\n\nDivorce rates fell by almost half over the next decade and have gradually tapered down since, as the overall marriage rate continues to dip at an even quicker rate.\n\nIn 1976, 6.3 people (aged over 16) per 1000 got divorced versus 13 people per 1000 getting married.\n\nIn 2023, 2.3 people per 1000 called it quits, while 5.5 per 1000 tied the knot.\n\nBurke Mangan Lawyers partner Ms Burke said she was seeing more and more couples stay together because they could not afford to live separately.\n\nAustralian marriage rates have fallen about one-third since the turn of the century. Picture: NewsWire / Nikki Short\n\n“Dividing assets is just one part of the picture now – it’s also about ensuring both parties can afford to live, support the children and plan for their financial future,” she said.\n\n“With rents up 30 per cent in some capital cities and lending conditions tight, many people are being forced to stay under the same roof – even after they’ve split.\n\nADVERTISEMENT\n\n“The old model, where one person keeps the home and the other rents nearby, is increasingly off the table.”\n\nLiving together after separation was called “financial flatmates” among lawyers, and “fraught with emotional and legal risk”.\n\n“It might feel like a short-term fix, but without proper agreements in place, they often lead to major conflict down the track,” she said.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/major-change-coming-to-iconic-australian-national-park--but-is-it-enough-011042395.html",
        "title": "Major change coming to iconic Australian national park – but is it enough?",
        "publish_date": "2025-07-09T01:10:42Z",
        "category": "finance",
        "authors": [],
        "text": "It's the largest national park expansion in a generation, but environmental groups say there's still more that needs to be done.\n\nLocals and tourists alike flock to Litchfield for camping, swimming and hiking, and now there will be even more to love. Source: Getty\n\nOne of Australia’s most iconic national parks is about to undergo a drastic change. Litchfield National Park in the Northern Territory is about to expand by 30,000 hectares, with more campgrounds, walking trails and even a hunting range being opened to the public. But while the announcement has been largely applauded, environmental groups say more needs to be done to protect the territory's landscape.\n\nThe expansion follows the government's $7.5 million purchase of 'Silkwood', a stunning parcel of land near the regional town of Adelaide River, boasting waterfalls, gorges, hot springs and 4WD tracks. Described as the largest addition to the Territory’s national park estate in 25 years, the acquisition will increase the park’s size by 20 per cent.\n\nChief Minister Lia Finocchiaro said the expansion was a key part of her government’s vision to “restore the Territory lifestyle”.\n\nThe land purchase include waterfalls, gorges, hot springs and 4WD tracks. Source: Supplied\n\n“This is exactly what restoring the Territory lifestyle looks like — protecting our wide-open spaces while making sure Territorians have more places to enjoy the activities we love,” she said.\n\nADVERTISEMENT\n\nThe new southern section of the park will eventually be opened up for camping, swimming, four-wheel-driving, exploring, and potentially hunting, delivering a boost for tourism and recreation in the region, local authorities say.\n\n\"Silkwood boasts untapped tourism potential,\" a spokesperson from the NT’s Department of Tourism and Hospitality told Yahoo News.\n\n\"It's positioned amidst breathtaking scenery, offering unparalleled access to an abundance of natural attractions and neighbouring Litchfield National Park. It’s close proximity to Darwin and being along the Stuart Highway makes it an ideal stop off location for self-drive tourists.\"\n\nThe popular Robin Falls is included in the new expansion, with Finocchiaro promising visitors they can still bring their leashed dogs.\n\nAn opening date is yet to be set, with planning and budgeting underway for roads, pathways, signage and viewing platforms.\n\nADVERTISEMENT\n\n\"Work around the planning of this site is in the early stages. There will be more detailed master-planning conducted for the site later this year,\" the Tourism spokesperson told Yahoo.\n\nIt comes just weeks after South Australia announced extensions to three national parks, adding an extra 725 acres to their estate of protected land.\n\nMore should be done to protect Territory's landscape, environmentalists say\n\nEnvironment Centre Northern Territory (ECNT) Executive Director, Kirsty Howey, called the deal “a positive step”, but told Yahoo News the government could be doing more to protect local lands.\n\n\"The Finocchiaro government has abandoned its commitment to deliver a 43 per cent reduction in greenhouse gas emissions by 2030, scrapped our renewable energy target, and unleashed bulldozers on the world's last intact tropical savanna,\" Howey said.\n\nADVERTISEMENT\n\n\"The scale of destruction is staggering, yet it occurs largely hidden from public view on pastoral estates that comprise 45 per cent of the Territory’s land.\"\n\nIn the first six months of this year, Howey said, the Finocchiaro government approved the destruction of almost 26,000 hectares of native vegetation — close to the size of the Litchfield expansion.\n\nThe impending public expansion comes after South Australia also increased access to public national park lands. Source: NT Government\n\nShe pointed to the Pastoral Land Board as a key issue, accusing it of routinely approving large-scale land clearing.\n\n“Week after week, thousands of hectares receive rubber-stamp approval for bulldozing,” she said. “On 13 June, this same board... approved clearing 3,300 hectares at Claravale Station. This isn't just any paddock, this site contains one of only five confirmed maternity roosts for ghost bats in the entire Territory.\n\nADVERTISEMENT\n\n\"If habitat for bilbies and Gouldian finches were being destroyed at this rate near Melbourne or Sydney, there would be public outrage.\"\n\nAdding to the concern is the spread of gamba grass, a highly invasive species that dramatically increases fire risk. Experts warn that if left unchecked, the weed could overtake more than 42,000 hectares of Litchfield by 2032.\n\n“With more than 250,000 visitors annually, Litchfield faces a silent threat,” Howey said. “Gamba grass creates extreme fire risks that endanger both visitors and the park’s unique ecosystems.”\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]