[
    {
        "url": "https://www.9news.com.au/world/elon-musk-jeffrey-epstein-donald-trump-department-of-justice-epstein-files-latest-updates/05be6505-aacc-434e-adfa-88e43abb4a8e",
        "title": "Elon Musk asked to visit Jeffrey Epstein's island for his 'wildest party'",
        "publish_date": "Fri, 30 Jan 2026 22:41:09 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "In a late November 2012 exchange, Epstein inquired how many people Musk would like flown by helicopter to the island he owned — Little Saint James in the US Virgin Islands.\n\n\"Probably just Talulah and me,\" Musk responded, referencing his partner at the time, actress Talulah Riley . \"What day/night will be the wildest party on =our island?\"\n\nREAD MORE: List of Trump allegations released in Epstein files ﻿\n\nElon Musk asked to visit Jeffrey Epstein's island for his \"wildest\" party. (AP)\n\nMusk messaged Epstein again ahead of a planned trip to the Caribbean in late December 2013. \"Will be in the BVI/St Bart's area over the holidays,\" he wrote. \"Is there a good time to visit?\"\n\nEpstein responded by extending an invite for sometime after the New Year holiday.\n\n\"play it by ear if you want,\" he wrote. \"always space for you.\"\n\n\"I will come and get you,\" Epstein wrote in a follow up email.\n\nIt's not immediately clear if the island visits took place.\n\nNine.com.au is not suggesting that by appearing in any of the Epstein documents implies wrongdoing, only that names have appeared.\n\nSpokespersons for Musk's companies, Tesla and X, didn't immediately respond to emails seeking comment Friday. Musk has maintained that he repeatedly turned down the disgraced financier's overtures.\n\n\"Epstein tried to get me to go to his island and I REFUSED,\" he posted on X in 2025 when House Democrats released an Epstein calendar with an entry mentioning a potential Musk visit to the island.\n\nElon Musk and his then-partner Talulah Riley on 2014. (WireImage)\n\nEpstein supported Trump's first-term efforts to oust Fed chair\n\nIn a 2018 exchange, Epstein and Trump advisor Steve Bannon discussed the president's threats to oust Federal Reserve Chairman Jerome Powell, whom he had named to the post just the year prior.\n\n\"should have been done months ago too old!!!!\" Epstein wrote.\n\n\"Can u get rid of Powell or really get rid of mnuchin,\" Bannon replied, referring to then-Treasury Secretary Steve Mnuchin.\n\n\"no, mnuchin is ok,\" Epstein replied.\n\nTrump on Friday named Kevin Warsh to succeed Powell after spending the past year assailing him for not cutting interest rates quickly enough.\n\nJeffrey Epstein and Ghislaine Maxwell. (US Department of Justice)\n\nNew files related to Epstein's time in jail﻿\n\nSome documents are related to Epstein's incarceration and suicide.\n\nOthers centre around Ghislaine Maxwell's incarceration and her grievances related to her imprisonment conditions.\n\nThe records contain emails between investigators that discuss Epstein's death, including his last note — with the email stating that it does not appear to be a suicide note.\n\nThousands of pages of documents related to Epstein's jail suicide have already been released.\n\nREAD MORE: Bill and Hillary Clinton risk prison after vote by Epstein committee ﻿\n\nCommerce Secretary appears to have visited Epstein's island\n\nOn one occasion in December 2012, Epstein invited Commerce Secretary Howard Lutnick to his private island in the Caribbean for lunch, according to documents released on Friday show. Lutnick's wife, Allison Lutnick, enthusiastically accepted the invitation and said they would arrive on a yacht with their children. On another occasion in 2011, the two men had drinks, according to a schedule shared with Epstein.\n\nLutnick has tried to distance himself from associations with Epstein, saying in a 2025 interview that he cut ties with the sex offender decades ago, calling him \"gross\".\n\nThe two men's lives continued to intersect as recently as 2018, documents show. That year, Epstein contributed to a philanthropic dinner honoring Lutnick, according to email exchanges. The year prior, the two men sent each other emails about the construction of a building across the street from both of their homes.\n\nLutnick didn't respond to an emailed request for comment on Friday afternoon.\n\nA \"No Trespassing\" sign on Esptein's island. (via CNN)\n\nDemocrats decry limited release﻿\n\n\"The DOJ said it identified over six million potentially responsive pages but is releasing only about 3.5 million after review and redactions. This raises questions as to why the rest are being withheld,\" said Rep. Ro Khanna, a California Democrat who sponsored the bill that mandated the disclosure.\n\nKhanna said he was looking to see whether the files released Friday included FBI interviews with victims, a draft indictment and information prosecutors collected during a 2007 investigation into Epstein in Florida.\n\nThe House Oversight Committee has also issued a separate subpoena to Attorney General Pam Bondi for the files without redactions, but that has not been fulfilled.\n\nRep. Robert Garcia, the top Democrat on the oversight panel, called the limited release of documents \"outrageous and incredibly concerning.\"\n\nOver the years, prosecutors received tips from people with wild stories about being sexually abused by famous figures.\n\nIn some instances, FBI investigators diligently reached out to these tipsters and alleged victims and listened to their implausible sounding stories — some involving the occult and human sacrifice — then wrote dry reports summarising what the people had to say and sent them to their superiors.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/melbourne-roadworks-small-businesses-closing-down/c7eaaaa0-ea91-4c84-ada0-d1989316dd51",
        "title": "Dragging Melbourne roadworks threaten to put locals out of jobs",
        "publish_date": "Fri, 30 Jan 2026 20:44:22 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Exclusive: When Rebekah Becsi spoke to A Current Affair last year, she was terrified that roadworks might send her out of business.\n\nNow she's told 9news.com.au she's just weeks away from being forced to shut down.\n\nAnd help﻿ – if it ever comes – might just be too little, too late.\n\nREAD MORE: Urgent safety warning issued over counterfeit melatonin sleep supplements\n\nRebekah Becsi owns Pakenham Bulk Foods, a discount bulk grocery store about an hour out of Melbourne CBD. (Supplied)\n\n﻿Becsi runs Pakenham Bulk Foods on Bald Hill Road﻿ in Pakenham, about an hour southeast of Melbourne's CBD.﻿\n\nSales plummeted when Big Build Victoria roadworks blocked off half the road in February last year.\n\nThey took another hit when the whole road was blocked a few months later.\n\n\"We've had a total 80 per cent decrease in sales from February last year till now,\" Becsi told 9news.com.au.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nThe roadworks, which were supposed to finish by the end of 2025, are expected to drag out until the end of February and Becsi's business won't survive that long.\n\nShe doubts it will even last another month.﻿\n\n\"We need immediate assistance, otherwise we will not last until the end of February,\" Becsi said.\n\n\"And I know there's other businesses in the area that are in the same boat as us.\"\n\nThe roadworks outside Becsi's Pakenham business have caused an 80 per cent drop in sales. (Supplied)\n\nThe roadworks and road closures have made it too hard for customers to reach stores like ﻿Pakenham Bulk Foods, so most just go elsewhere.\n\nIt's left Becsi unable to afford new stock and struggling to cover crucial costs.﻿\n\n\"We're only just paying rent now, we don't have any spare money,\" she said.\n\nShe and a number of local businesses are also ﻿allegedly being chased for council rate payments they can't afford.\n\nBecsi and other Bald Hill locals ﻿spoke to A Current Affair last year about the devastating impacts the roadworks had had on their businesses.\n\nThey had hoped the segment would help them get compensation from Big Build Victoria or Cardinia Shire Council for lost revenue.\n\nIt's been weeks since the segment aired. They're still waiting.﻿\n\n\"We're getting no kind of relief or support,\" Becsi said.\n\nThis map shows the convoluted path customers need to follow to get to Pakenham Bulk Foods while the roadworks are ongoing. (Facebook/Pakenham Bulk Foods)\n\nCardinia Shire Council Mayor Councillor Brett Owen told 9news.com.au that while council is not a delivery partner on the roadworks project, he recognises local business owners' frustrations.\n\n\"On behalf of our community and businesses, Council has continued to advocate to the State Government to manage and minimise construction disruptions and ensure access is maintained to reduce impacts wherever possible,\" he said.\n\nA Big Build Roads spokesperson told 9news.com.au, \"we appreciate the community's patience while the get on with more than $1 billion in upgrades to road and rail infrastructure in the area.\n\n\"We will continue to provide support to local traders during construction.\"\n\nThey said the Pakenham roads upgrade will be complete in mid-2026 with the intersection near Pakenham Bulk Foods set to reopen in late February.\n\nBut ﻿Becsi's business may not survive that long.\n\nBy the time these signs are cleared and the road reopens, Becsi's Pakenham business may be shut down. (Supplied)\n\nWithout immediate financial support, she will have to cut her losses and close ﻿Pakenham Bulk Foods.\n\nBecsi worries about what will happen to the handful of customers who are still relying on the discount store for affordable groceries.\n\n\"You've got people who are struggling with the cost of petrol and groceries in the general supermarkets, and they'll come to us,\" she said.\n\n\"Even if we do close down, something has to be done about it.\"\n\nBecsi started a Change.org petition demanding financial support in the form of compensation for loss of revenue, grants, or low-interest loans for businesses affected by the roadworks until they're complete.\n\nMore than ﻿800 people have signed.\n\nDragging Melbourne roadworks threaten to put locals out of jobs as businesses face closure. (Supplied)\n\nBut if Becsi wants to take the issue to the Parliament of Victoria - which is her hope - she'll need to create an official paper petition or digital e-Petition.\n\nA paper petition needs more than 2000 signatures to trigger a debate in Parliament; an e-petition (alone or alongside a paper petition) needs 10,000.\n\nAnd none of the Change.org signatures will carry over.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/chris-picton-first-interview-death-brother-tim-picton-coward-punch/f0b4e182-e196-478b-bf57-848a0e3ac8bd",
        "title": "MP 'beyond angry' over death of brother in alleged one-punch attack",
        "publish_date": "Fri, 30 Jan 2026 12:58:46 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "After 12 years in politics and countless media interviews, today marked Chris Picton's toughest exchange.\n\nThe South Australian health minister spoke publicly for the first time since his brother Tim Picton died from an alleged one-punch attack in Perth last month.\n\n\"Beyond angry as to what's happened,\" Chris said of the incident.\n\nREAD MORE: More human remains and clothes found in search for missing Belgian tourist\n\nThe South Australian health minister spoke publicly for the first time since his brother Tim Picton died, following an alleged one-punch attack in Perth last month. (9News)\n\n\"The shock that we had on that Saturday morning, getting that phone call, still haunts me and my family to this day.\"\n\nTim, 36, died in hospital after a three-week-long coma following the incident.\n\n\"It was unlikely that Tim was going to come back, but we were still obviously all hoping for a miracle,\" Chris said.\n\nThe 20-year-old charged over the incident has been granted bail, angering the MP.\n\n\"I cannot believe that that happened and I think that was a very significant mistake,\" Chris said.\n\nTim, who made a name for himself in Labor's ranks as a talented political strategist, had a bright future ahead.\n\nTim Picton, 36, died in hospital after a three-week-long coma following the alleged attack. (Supplied)\n\n\"The prime minister said he very easily, at the very least, could have been on the frontbench of federal parliament, and I strongly believe that,\" Chris said.\n\nHe is survived by his wife Priya and their four-year-old daughter Charlotte.\n\nAt a memorial for Tim last week, guests were asked to write their memories of Tim for Charlotte to read when she's older.\n\n\"There's a hole in our family that is never, ever going to be filled,\" Chris said.\n\nPrime minister and two premiers among hundreds at memorial for Labor figure Tim Picton (9News)\n\nAs for Chris, he tells 9News that despite the heartache, he's committed to returning to state parliament should he be re-elected in March and wants to continue serving in the ministry.\n\n\"Going through some difficult personal experiences hopefully can make you a better representative, a better leader,\" Chris said.\n\n\"This is not the sort of thing that you get over, it's the sort of thing that eventually you learn to live with.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/royal-visit-queen-mary-and-king-frederik-to-visit-australia-in-march/473c39af-8969-4c44-ae53-f5248e6dcb0e",
        "title": "Queen Mary and King Frederik announce official visit to Australia",
        "publish_date": "Fri, 30 Jan 2026 07:19:07 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Queen Mary and King Frederik of Denmark are set to visit Australia in March for an anticipated six-day tour.\n\nDuring the visit from March 14 to 19, the couple will attend a number of business and cultural engagements.\n\nThis will be their fourth official visit to Australia and their first since the King's ascension to the Danish throne.\n\nQ﻿ueen Mary and King Frederik of Denmark are set to visit Australia in March for an anticipated six-day tour. (WireImage)\n\nIn a statement tonight, the palace said: \"The state visit will further develop the already strong relations between Australia and Denmark, both culturally, economically and in foreign policy.\n\n\"A strengthened partnership with Australia is particularly important at a time when geopolitical upheavals have economic and security policy consequences that bind developments in Europe and the Indo-Pacific region together.\n\n\"Building on the strategic partnership that was entered into between Australia and Denmark in 2023, the state visit will strengthen cooperation in a wide range of areas, including green transition and economic security.\"\n\nPrime Minister Anthony Albanese said he felt honoured to welcome the royals to Australia.\n\n\"It is wonderful that the visit includes many parts of our great country, from the Northern Territory to Victoria, the Australian Capital Territory, and of course Tasmania,\" he said.\n\n\"Denmark and Australia are great friends, and together we are working to build a more sustainable, secure and peaceful future.\n\n\"This visit is an opportunity to deepen our cooperation across a number of shared interests such as sustainability, renewable energy and innovation.\n\n\"Their Majesties The King and Queen of Denmark have a very special connection with Australia, and I know Australians will welcome them.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/nine-sells-radio-network-to-billionaire-publican/cc5eb8b6-501f-4970-81f3-16f6a85c54d9",
        "title": "Nine sells radio empire for $56 million",
        "publish_date": "Fri, 30 Jan 2026 08:43:04 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Nine Entertainment has sold its broadcast radio assets, including the top-rating talkback stations 2GB and 3AW, to Australian publican Arthur Laundy and his family for $56 million.\n\nThe sale, which includes 2GB, 3AW, 4BC, 6PR, 2UE, Magic1278 and 4BH, was announced to shareholders this morning among a number of changes to the media giant's strategy which also include acquiring outdoor media platform QMS Media for $850 million.\n\nNine, which is the publisher of this website, told shareholders that the sale to the Laundy Family Office is expected to be completed by the end of June this year and that Nine will remain a long-term partner of the radio stations.\n\nR EAD MORE: ﻿ Australian government 'monitoring' Nipah virus closely\n\nPublican Arthur Laundy and his family are purchasing the Nine Radio business. (Photo: Peter Rae/AFR) (Peter Rae)\n\n\"Laundy is expected to remain a long-term partner of Nine, with plans to utilise Nine News journalists on radio, showcase Stan Sport through Laundy venues, provide promotion and advertising sales collaboration, as well as increased advertising spend by Laundy on Nine properties,\" the release reads.\n\nNine this morning also announced it was buying leading digital ﻿outdoor media platform, QMS Media and converting regional television station NBN (Northern NSW) from a wholly-owned business to an affiliate, owned and operated by Nine's regional partner, WIN Network.\n\nNine Group chief executive officer Matt Stanton says the move positions the media giant well for the future.\n\n\"Today's announcements mark a critical milestone in our Nine2028 transformation. These transactions will create a more efficient, higher-growth, and digitally powered Nine Group for our consumers, advertisers, shareholders and people,\" he said.\n\n\"This positions Nine well for the future, enabling the group to withstand industry disruption and deliver long-term sustainable value to our shareholders.\"\n\nREAD MORE: ﻿ How Australian spy base could play role in US strike on Iran\n\nThe sale, which includes 2GB, 3AW, 4BC, 6PR, 2UE, Magic1278 and 4BH, was announced to shareholders this morning. (Janie Barrett)",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/elon-musk-is-betting-teslas-future-isnt-about-cars-at-all/b12bba27-6578-466b-ae7f-df17256c3e41",
        "title": "Elon Musk is betting Tesla's future isn't about cars at all",
        "publish_date": "Fri, 30 Jan 2026 01:32:18 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Tesla dominated the electric vehicle industry by the mid-2010s with sleek, fast cars that helped combat the public perception that EVs were severely limited by short ranges.\n\nNow the company, and its controversial Chief Executive, Elon Musk , face stiffer competition and political headwinds.\n\nIts EV sales fell by a record 9 per cent in 2025, amid increasing rivalry from China and the expiration of the US EV sales tax credit.\n\nIn November last year, Elon Musk offered a sneak peak of Tesla's Optimus robot. (Tesla Australia)\n\nBut Musk has been steering the company toward an audacious bet.\n\nHe believes Tesla's future won't ride on cars but on humanoid robots.\n\nOn Tesla's earnings call on Wednesday, Musk laid out a literal replacement of Tesla cars by robots – announcing Tesla would discontinue the Model S and Model X in favour of making more of its Optimus robots.\n\n\"We're gonna take the Model S and X production space in our Fremont factory and convert that into an Optimus factory, with the long-term goal of having one million units a year of Optimus robots in the current SX space in Fremont,\" he said.\n\nIt is the quintessential science-fiction dream of the future: Musk says Tesla's Optimus robots will do everything from cleaning your house to performing surgery.\n\nHe's called Optimus, the key to eliminating world poverty, making human work optional and reaching Mars .\n\nAnd he claims they'll be on sale by the end of 2027.\n\n\"Every human on earth is going to have their own personal R2-D2, C3PO,\" Musk said in November, referring to the personal robots from Star Wars .\n\n\"But actually, Optimus will be better than that.\"\n\nBut critics say these are fever-dream distractions from Tesla's core automotive business.\n\nAnd plenty of companies, like Boston Dynamics and Figure, are already deep into the humanoid robot business.\n\nMusk's own success and pay are directly at stake.\n\nTesla must deliver one million Optimus robots within 10 years for Musk to fully realise an almost $US1 trillion ($1.4 trillion) Tesla pay plan approved by shareholders late last year.\n\n\"Elon is a big thinker, and he wants to be pushing the edge of people's imagination,\" a former Tesla senior engineer told CNN in an interview.\n\nBut the EV and robot markets are very different, the engineer said.\n\n\"With electric vehicles, Tesla was really the only one working on this hard problem. There's a lot of companies now and tons of competition.\"\n\nMusk laid out a literal replacement of Tesla cars by robots. (Supplied)\n\n'Infinite money glitch'\n\nTesla first unveiled its humanoid robot project at a 2021 event, where a silvery figure danced to thumping techno music on a stage.\n\nIt was an actor in a robot suit, complete with a face that looked like a screen. \"Obviously, that's not real,\" Musk said as the costumed figure left the stage.\n\nJust months later, in January 2022, Musk said he thought Optimus could be \"more significant than the vehicle business\" for Tesla over time.\n\nTesla says Optimus can now sort objects, serve popcorn, throw out trash and dance.\n\nIt does \"some basic tasks in the factory,\" Musk said Wednesday, progress, but still a far cry from Musk's futuristic vision, even as he predicted Optimus could eventually generate $US10 trillion ($14 trillion) of revenue.\n\nYet Musk has set a speedy timeline for Optimus.\n\nAt the World Economic Forum this month, he said the robot will be available for sale by the end of 2027.\n\nIt is a lofty goal, one experts say may be tougher than Musk's bets on electric vehicles or SpaceX.\n\nREAD MORE: Melbourne nail salon firebombed twice in two days\n\nMusk has set a speedy timeline for Optimus. (AP)\n\nHumanoid robots are among the most complex machines imaginable, and the race to build them is already heating up.\n\nTesla is not the only company in this space.\n\nHyundai and Google DeepMind are also deploying their Atlas humanoid robot internally in the coming months before rolling it out to customers.\n\nMeanwhile, the CES tech show in January was full of companies, including Nvidia, Qualcomm and Intel, showing off humanoid robots powered by their chips and technologies.\n\nMore than 90 companies have a humanoid robot product, according to Ani Kelkar, a partner at McKinsey & Company who leads the firm's advanced automation and autonomy sector. More are coming, especially in the United States and China.\n\nExperts from McKinsey, Goldman Sachs and Morgan Stanley estimate the humanoid robot market could eventually be worth anywhere from $US370 billion ($524 billion) by 2040 to $US5 trillion ($7 trillion) by 2050.\n\nTesla does have critical advantages in its expertise in motors, batteries and mechanisms, said Ken Goldberg, a professor who supervises research in robotics and automation at the University of California, Berkeley.\n\n\"They also understand how to make something advanced in high volume – with cost effectiveness, and that's really important,\" Goldberg said.\n\nREAD MORE: Man kept alive for 48 hours with lungs removed\n\nMusk's commentary and support of US President Donald Trump have made him a polarising figure. (AP)\n\nThe company could also benefit from using Optimus internally and selling it externally, giving it a \"cost advantage\" that could enable Tesla to make \"several thousand dollars per robot,\" Goldman Sachs said in an October report.\n\nBut most experts agree it'll be at least a decade before humanoid robots are widely deployed.\n\n\"A giant leap may happen, but we don't know when,\" Goldberg said.\n\n\"Most technology develops as a slow burn over time, so I think the expectations about having fully general humanoids seems over-inflated.\"\n\nOthers are sceptical about whether humanoid robots will ever be broadly useful in society.\n\nBill Ray, an analyst following emerging technologies and robotics for market research firm Gartner, previously told CNN that humanoid robots face too many limitations to be practical.\n\nOptimus challenges\n\nMusk has swung big with timelines before – and missed. He previously said Tesla cars would be fully autonomous by 2018, and that SpaceX would start sending rockets to Mars by 2018 – neither of which has happened yet.\n\nAnd already with Optimus, Tesla has missed its leader's ambitious schedule. Musk had initially set internal goals for Tesla to produce at least 5000 Optimus units in 2025, according to The Information .\n\nThat goal was slashed to 2000 a few months later and has been lowered again since, The Information reported in October.\n\nTesla did not respond to CNN's request for comment.\n\nMusk has acknowledged that his goals are not easy.\n\n\"Right now, we're struggling with the final design of the hardware,\" especially of the arm and hand, Musk said at the All In Summit in September.\n\n\"Human-like hands are notoriously hard for robots to emulate. Unlike people, robots have a hard time knowing how to grip different objects like a wet glass versus a piece of metal.\n\n\"People think of space travel as extraordinarily difficult, and it is, no doubt, but it turns out that getting a robot to reliably tie a sneaker is harder than getting a rocket out of the atmosphere,\" Goldberg said.\n\nMusk's political commentary and support of US President Donald Trump have also made him a polarising figure, resulting in protests and vandalism at Tesla dealerships across the country.\n\nProtests and vandalism occured at Tesla dealerships across the country. (Getty)\n\nA man uses chalk to write messages on the side of a San Francisco Tesla store during a protest. (AP Photo/Noah Berger)\n\n\"If they won't buy his cars, why would they buy a huge robot for their home from him?\" posted Ross Gerber, an early Tesla investor and CEO of investment firm Gerber Kawasaki, who is now a prominent critic of Musk.\n\nMusk acknowledged the \"many who doubt our ambitions for creating amazing abundance\" on Wednesday's earnings call.\n\n\"But we're confident it can be done, and that we're making the right moves technologically to ensure that it does.\"\n\n\"And Tesla's obviously never been a company to shy away from solving some of the hardest problems,\" he added.\n\nBut Musk's version of the future won't happen instantly – and maybe not for a long time.\n\n\"Elon is a visionary, but he promises things that sometimes may take more time than his engineers can deliver,\" said Goldberg.\n\n\"The research community all over the world is working very hard on this, but it's not going to get solved overnight.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/interest-rate-hike-likely-finder-survey-found/508c05a1-f1f6-4be7-89b6-4cb89d7415cb",
        "title": "'Cold shower' for mortgage holders: Experts' gloomy rates' forecast",
        "publish_date": "Thu, 29 Jan 2026 20:28:51 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "M﻿ortgage holders across Australia are likely to be hit with an interest rate hike next week, according to a survey of experts.\n\nMore than half the 33 economists and financial experts in the Finder Cash Rate Survey believe a sudden spike in inflation will force the Reserve Bank of Australia's hand when it announces its decision next Tuesday.\n\nNew inflation data released this week showed the trimmed mean, the RBA's preferred measure of ﻿underlying inflation , increased to 3.3 per cent and headline inflation shot up to 3.8 per cent in the year to December – both well outside the central bank's target band.\n\nMortgage holders are likely to be hit with an interest rate hike next week, experts forecast. (Photo by ROB HOMER SPECIAL 103506) (Rob Homer) (Nine)\n\nThe Finder research found 17 of those surveyed, or 51 per cent, believe the central bank will green-light a 0.25 per cent rise in the cash rate, raising it to 3.85 per cent﻿.\n\nThis is a marked turnaround from last December when only 9 per cent of experts in a Finder survey forecast a February rates lift.\n\nHead of Finder consumer research Graham Cooke says the big four banks and most economists are now backing a hike.\n\n\"This news will feel like a cold shower for homeowners after a brief reprieve.\n\n\"Many who refinanced or entered the market during the 2025 easing cycle may feel blindsided, as the pivot from falling to rising rates in just six months has created significant whiplash.\"\n\nREAD MORE: ﻿ How Australian spy base could play role in US strike on Iran\n\nAdding to the gloomy outlook, more than four in five experts who weighed in believe a rate cut in the next 12 months is unlikely.﻿\n\nHomeowners on the average home loan of $693,802 will see an annual increase of $1313 to their mortgage repayments if the RBA raises the cash rate by 0.25 per cent next Tuesday.\n\nOn a $1 million mortgage, the same hike would cost a homeowner nearly $1893 a year more in interest – a rise of $158.\n\nA rates rise next week would be the first in Australia since November 2023, and would follow the RBA's easing cycle that brought relief for mortgage holders. ﻿\n\nCooke says mortgage they should now scrutinise their interest rate with the easing cycle unlikely to restart again soon.﻿\n\n\"If your rate isn't one of the best, now might be a good time to give yourself a rate cut. Many banks will also throw in some cash for your trouble.\"\n\nNEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.\n\nThe information provided on this website is general in nature only and does not constitute personal financial advice. The information has been prepared without taking into account your personal objectives, financial situation or needs. Before acting on any information on this website you should consider the appropriateness of the information having regard to your objectives, financial situation and needs.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-31/albany-surf-school-finds-a-way-to-ignite-ndis-passion-for-sport/106267650",
        "title": "How catching waves is 'just bloody awesome' in changing people's lives",
        "publish_date": "Sat, 31 Jan 2026 01:40:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "Max Forster-Ross can't get enough of surfing.\n\n\"It's just bloody awesome,\" he said.\n\nMr Forster-Ross began participating in a unique surf program in Albany on Western Australia's south coast a year and a half ago.\n\nBringing together both surfers who are participants in the National Disability Insurance Scheme (NDIS) and non-NDIS surfers, the inclusive school is a place where participants can hone their skills together and build community.\n\nMax Forster-Ross rides a wave to the shore. (ABC News: Samantha Goerling)\n\nNow, Mr Forster-Ross hits the waves three times a week with his new crew.\n\n\"[It] gets me out of the house; I don't game as much,\" he said.\n\n\"[It's been] awesome, people to talk to, people to hang out with, I bloody know half of Albany now.\n\n\"I feel like I'm just a different person. I know I'm not that old, but I feel young again.\"\n\nParticipants pop up on a \"party wave\". (ABC News: Samantha Goerling)\n\nSascha de Lacy-Koenig, who started Sacha's Surf Experience, spends most of his waking hours in a wetsuit running the two intertwining surf programs.\n\n\"One is our NDIS surf program where we help people achieve their life goals using surfing as a tool,\" he said.\n\n\"When you're surfing, you're making a lot of decisions; you're deciding which waves you should go on, you're deciding which board you should use.\"\n\nHe encourages participants to apply the goal-setting and decision-making they learn in the waves to other areas of their lives, from daily tasks to pursuing bigger goals.\n\nSascha de Lacy-Koenig wanted to share the therapeutic benefits of surfing with others. (ABC News: Samantha Goerling)\n\nSurfers who are part of the NDIS program also meet up with the open surf stream, which anyone can join.\n\n\"The most fun thing we get to do is bring both those groups together and have a fun time in the ocean,\" Mr de Lacy-Koenig said.\n\n\"It doesn't matter what your background is; if you enjoy the ocean and you love seeing these waves come through and riding them, you can connect with others in that space.\"\n\nSurfing helps clear the mind. (ABC News: Samantha Goerling)\n\nLearning to surf 'transformative'\n\nIt's this broad community that keeps Monique Blaikie showing up rain, hail or shine.\n\n\"Even if the conditions are average, we're all still going to go out because I know there's a friend out there, or I know there's someone out there who's going to cheer me on, or encourage me, or make me feel good,\" she said.\n\nHer experience over the past year has been transformative.\n\nMonique Blaikie loves to surf at the beaches around Albany. (ABC News: Samantha Goerling)\n\n\"Before I started surfing, drowning was my big fear,\" she said.\n\n\"I wouldn't go out past waist deep. I was scared of the waves, I was very afraid of the water.\n\n\" I would call myself an ocean person now, that's part of my personality, and how I would define myself, which is completely different to who I was two years ago. \"\n\nRiley Coffey has become a mentor for some of the younger surfers. (ABC News: Samantha Goerling)\n\nRiley Coffey joined the program to learn to surf with his son and has become a mentor to some of the NDIS participants.\n\nHe hopes surfing will offer them something positive as they step into new stages of life.\n\n\"It's such a nice thing, and I feel it's something that you can hold forever,\" Mr Coffey said.\n\n\"Compared to footy and cricket — which I grew up playing — they start getting a lot more competitive as you get older, whereas [surfing] you go at your own pace and there's no expectation, it's just enjoyment, which I find really great.\"\n\nParticipants surf a wave near Albany. (ABC News: Samantha Goerling)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-31/nt-darwin-lord-mayor-peter-styles-ntec-lost-donations-return/106289926",
        "title": "'Bit of a mystery': Darwin lord mayor's donations disclosure goes missing",
        "publish_date": "Sat, 31 Jan 2026 01:19:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Northern Territory Electoral Commission (NTEC) is investigating the campaign donations disclosure of Darwin's lord mayor, following his claim an envelope containing the information has been lost.\n\nFormer NT deputy chief minister Peter Styles was elected Darwin Lord Mayor in August and was meant to reveal his campaign donors to the NTEC by the start of November.\n\nBut the NTEC has said it did not receive Mr Styles's donor information until Tuesday this week, four days after the ABC sent questions to the lord mayor about why it had not been lodged.\n\nAsked why he had lodged his return three months late, Mr Styles said he had actually provided a physical envelope containing his donation information to the NTEC's Darwin office on October 27.\n\nHe claimed it was then lost by the electoral commission.\n\nThe NT local government elections were held in August of 2025, with Peter Styles voted in as Darwin's Lord Mayor. (ABC News: Michael Franchi)\n\n\"So that's a bit of a mystery, really,\" he told ABC Radio Darwin.\n\n\"I dropped an envelope in there with my [donation] returns in it at the end of October and [the NTEC] don't seem to have recorded that somewhere.\n\n\"So I don't know what's happened to it.\"\n\nMr Styles said he physically dropped off the envelope \"to make sure it got there\".\n\n\"Electronic things can go missing from time to time and can be deleted,\" he said.\n\n\"I made sure that it was actually delivered, personally delivered.\n\n\"I fulfilled my obligation and I've since sent them the information again.\"\n\nPeter Styles says he fulfilled his obligation when he provided the NT Electoral Commission with a physical copy of his donations information. (ABC News: Marcus Kennedy)\n\nMr Styles said he was only aware that his donation information had not been recorded by the NTEC when the ABC sent him questions last Friday.\n\n\"The ABC did enquire about it, which raised the issue that it's not there,\" he said.\n\n\"So, I actually contacted [the NTEC] to find out what's going on and I've since given them an electronic copy this time.\"\n\nNTEC investigating envelope drop-off\n\nNT Electoral Commissioner Kirsten Kelly said the NTEC was investigating the matter and so far, it had found no information to confirm Mr Styles physically provided the envelope in October.\n\n\"But the NT Electoral Commission is working with Mr Styles and his campaign manager to work through to substantiate if it was provided [in October] and how we can demonstrate that,\" she told ABC Radio Darwin.\n\nKirsten Kelly says it is unlikely the electoral commission would issue Peter Styles with a penalty. (ABC News: Tiffany Parker)\n\n\"We'll continue to work with Mr Styles and his campaign manager just to determine dates and times and who was spoken to and work with the staff in the [NTEC] office.\"\n\nMs Kelly said it was unlikely a penalty would be issued to Mr Styles.\n\n\"At the moment we're just looking to publish those returns and continue those discussions to see if we can confirm the date of the return and that's really important,\" she said.\n\nMr Styles's disclosure was uploaded to the NTEC website on Friday afternoon, showing he received $11,000 in total from three donors.\n\nThose donors were Thomas Lewis, Sunny The and the owner of the NT Oriental Emporium and Asia-United Food Service, Kivi Lay.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-31/prime-minister-and-sa-premier-announce-800m-housing-deal/106290888",
        "title": "PM and SA premier announce $800m deal for 17,000 new homes",
        "publish_date": "Sat, 31 Jan 2026 01:07:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "About 17,000 new homes have been promised in an $800 million partnership between the South Australian and federal governments.\n\nPrime Minister Anthony Albanese, alongside Premier Peter Malinauskas, announced the deal this morning, and said nearly 7,000 of those homes would be allocated to first-home buyers.\n\nMr Malinauskas said a focus of the project was to build new homes as fast as possible.\n\n\"The only way we can take on this challenge is to unlock supply and do it quickly — and what this program is all about isn't just about building more homes but getting on with it and doing it quickly,\" Mr Malinauskas said.\n\nThe deal focuses on development in Adelaide's north. (ABC News: Brant Cumming)\n\nHousing affordability is set to be a major issue in March's state election, with the median house price in Adelaide reaching close to $1 million and an interest rate rise predicted on Tuesday.\n\nSome housing estates in Adelaide's north have been built and sold to home owners before water and sewerage infrastructure has been installed, while other land releases have been announced without plans for water to be delivered for several years into the future.\n\nModel for other states\n\nThe prime minister said the announcement was part of federal Labor's 2025 election commitment to build 100,000 homes for first-home buyers nationally.\n\nMr Albanese said today's commitment would act as a model for other states.\n\n\"During the election campaign we announced that it will be a model for a national scheme and that's what we're doing today,\" Mr Albanese said.\n\n\"This is an agreement worth more than $800 million partnering with the South Australian government.\"\n\nPrime Minister Anthony Albanese and South Australian Peter Malinauskas in Adelaide's north today. (ABC News: Lincoln Rothall)\n\nThe federal government will loan the state government $534 million, including $300 million for water infrastructure in Adelaide's northern suburbs and $184 million to deliver 1,700 homes at urban renewal projects around Adelaide.\n\nThe state government will match $134 million in federal funding for 750 houses for first-home buyers.\n\nFamily grateful for help\n\nThe prime minister and premier made the announcement at John Tramontano's family's home in the northern Adelaide suburb of Munno Para.\n\nMr Tromantono said he was only able to buy the house with help from first-home buyer schemes.\n\n\"Without those, we would not be standing at our house today, so I'm really grateful, and I think our family is too, to finally have our own home,\" he said.\n\n\"It's something I thought i would never achieve, to be honest, and yet here we are.\"\n\nThe state opposition says stamp duty and payroll tax need to be cut. (ABC News: Lincoln Rothall)\n\nA housing industry group welcomed the announcement.\n\n\"This investment is critical to build more homes faster,\" Housing Industry Association managing director Jocelyn Martin said.\n\n\"Builders often tell us that getting this key 'last-mile' infrastructure is what holds many projects back from being delivered in a more timely fashion.\"\n\nBut opposition spokesperson Ben Hood said a shortage in construction materials and construction workers would lead to the housing promises being broken.\n\n\"South Australians know that Peter Malinauskas loves an announcement but he doesn't focus on delivery,\" Mr Hood said.\n\nHe said a Liberal promise to remove stamp duty on all first-home purchases up to $1 million would make a bigger difference, along with increasing the payroll tax threshold and exempting trainees and apprentices from the tax.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-31/bruny-island-to-get-childcare-solution/106290778",
        "title": "Island to get childcare solution, too late for the Archers",
        "publish_date": "Fri, 30 Jan 2026 23:22:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Home to around 1,000 Tasmanians, Bruny Island has seen parents spend years advocating for local access to early childhood education, without success.\n\nMother-of-four Teisha Archer is one of those.\n\nShe described hearing the news this week that a breakthrough had been found as \"wonderful\" for the community.\n\n\"We very much welcome the announcement,\" she said.\n\n\" I'm getting lots and lots of messages of like, yay, finally, it's happening. \"\n\n$3.5 million has been allocated to build the centre on the site of Bruny Island District School, providing places for up to 20 children.\n\nThe federal and state governments made the announcement yesterday as part of a joint funding deal to improve access to early childhood education services, especially in regional communities.\n\nOther communities set to receive new early learning services include Westbury, Rosetta, St Mary's, Bothwell and Huonville.\n\nDo you live in an out-of-school care desert? In large parts of Australia, accessing a spot at before and after-school care is not an option for many parents.\n\nThe six centres will be delivered under a joint funding agreement, including $25.5 million from the federal government's Building Early Education Fund, alongside a $5 million contribution and land from the Tasmanian government.\n\nIn a joint statement, Tasmanian Minister for Education Jo Palmer said: \"We know that quality early learning gives children the best possible start in life and the Tasmanian Government is delivering for our youngest learners on this lifelong journey.\n\n\"This joint investment is an exciting opportunity for these regions which we know are lacking access to ECEC services.\n\n\" We are proud to be partnering with the Commonwealth to deliver for Tasmanian families. \"\n\nFederal Minister for Education Jason Clare said: \"The Building Early Education Fund will help deliver more quality early education places for families in communities that need them most.\n\n\"Where you grow up shouldn't determine whether you can access early education.\n\n\" These projects in Tasmania mean more families can access early learning close to home and more children start school ready to go and ready to learn. \"\n\n'It's been a long time coming'\n\nTeisha Archer's youngest children will be too old to benefit from the centre by the time it opens. (ABC News: Georgie Burgess)\n\nMs Archer had been meeting with the education department since 2023, when it was announced that Bruny Island had been selected as a location to trial three-year-old kinder; something that failed to eventuate.\n\nPromised early learning trial behind schedule Parents in this island community, which has no child care services, were \"very excited\" when an early learning trial for three-year-olds was promised by 2024.\n\nAfter numerous delays and seemingly dead ends with the state government getting the program up and running, Ms Archer said the community reached a \"compromise\" last year, with the introduction of adjunct care, but now even that was at risk.\n\nThe adjunct care program allows toddlers and preschoolers to be dropped off at a school-based care environment on the condition their parents do not leave the premises.\n\n\"What we would do is go into another room as parents and do whatever we wanted to do for that hour, study or work or chat or whatever,\" Ms Archer said.\n\nLast year, the service ran three days a week, including one full day.\n\nIt offered a temporary solution to parents on the island seeking needed breaks from their children, one that was much \"appreciated\" by everyone despite its limitations, according to Ms Archer.\n\nHowever, the service is being reduced this year.\n\n\"We received a notification from the department saying that the adjunct care service would be cut by 5.5 hours per week,\" she said.\n\nThis year, it is only returning for two days, both of which will be half days.\n\nFor some parents, like Ms Archer, the timing of the cuts has raised questions about the government's broader messaging on early childhood services.\n\n\"It seems a little counterintuitive that on one hand, we've got the premier announcing the importance of early childhood services,\" she said.\n\n\" And then we're also seeing what our community feel is a diminishment of that offering as part of this program we're currently operating in. \"\n\nWhile the adjunct care program has offered some relief, parents say it falls well short of what families on Bruny Island actually need, as it makes it difficult to participate in farm work or run businesses that can not be done from home when parents are required to stay on school grounds.\n\n\"It also doesn't allow you to go off-island without the kids for basic things like shopping,\" said Ms Archer.\n\n\"And it becomes a really gender-loaded decision, because a lot of men who live and work on the island work physically within the environment, so they can't take their kids to adjunct care […] so what you see is all mums.\"\n\nEven with a permanent childcare centre now announced, families say the timing remains a major concern.\n\nThe federal government said the Bruny Island childcare centre was not expected to open until late 2027 at the earliest, by which time Ms Archer's youngest children would already be at school full-time.\n\nHowever, significant questions remain about how parents will manage in the years before the centre opens.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-31/kakadu-national-park-jabiru-airport-demolished-rio-tinto/106288904",
        "title": "Kakadu National Park airport to be shut and demolished, raising alarm",
        "publish_date": "Fri, 30 Jan 2026 23:04:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "The main airport servicing the Northern Territory's Kakadu National Park has been earmarked for closure and demolition later this year, with local businesses and leaders raising the alarm for the region.\n\nThe Jabiru Airport is part of the lease area for Rio Tinto's Ranger uranium mine, which ceased operations in 2021 and is currently in the process of being rehabilitated.\n\nUnder federal regulations around the closure, the company is required to close and bulldoze the airport, which a spokesperson confirmed was its intention from October this year.\n\nAs well as the popular national park, the airport serves the nearby town of Jabiru and numerous remote Aboriginal communities in the area.\n\nWith its famous crocodile-shaped hotel, Jabiru is a gateway to Kakadu National Park. (ABC News: Michael Franchi)\n\nIn a statement, Labor opposition frontbencher and Arafura MLA Manuel Brown, whose electorate covers Jabiru, said there were \"serious concerns\" about the \"devastating consequences [the airport's] loss will bring\".\n\n\"Jabiru Airport is essential for healthcare access, emergency services, employment, tourism and connection to the rest of the territory,\" he said.\n\n\" That is not an acceptable outcome in any part of the Northern Territory. \"\n\nAt the last census in 2021, there were 755 residents in Jabiru, and 315 in the surrounding national park, while the nearby Aboriginal community of Gunbalanya had 1,177.\n\nManuel Brown says Gunbalanya is particularly reliant on Jabiru Airport due to road closures forced annually by the wet season. (ABC News: Ian Redfearn)\n\nMr Brown said he had spoken with stakeholders, including the West Arnhem Regional Council, the Northern Land Council, Gundjeihmi Aboriginal Corporation and multiple tourism operators \"who are united in their alarm about the ripple effects the airport's closure will have on the region\".\n\nHe said Gunbalanya and its surrounding homeland communities were particularly reliant on Jabiru Airport due to road closures forced annually by the wet season.\n\nLarge parts of the Arnhem Land community of Gunbalanya end up under water during heavy rain. (Supplied)\n\n\"If Jabiru Airport is lost, and with it the services that support it, Gunbalanya, a community cut off by road for at least six months of the year, will be seriously impacted,\" he said.\n\n\" Without reliable air access, there will be no guaranteed supply of food, no timely access to medical treatment, and no emergency evacuation capability. \"\n\n'The end of Jabiru'\n\nCharter air operator Kakadu Air is among the businesses impacted by the impending demolition.\n\nThe company's logistics manager, Mat Jones, said he believed the closure of the airport would have a dire impact on Jabiru and the surrounding West Arnhem Land.\n\nHe said the town would struggle to get food and medical supplies in during the wet season.\n\nKakadu Air staff have been told the gates of the airport will be locked from October. (Supplied: Kakadu Air)\n\n\"If there's no airstrip there, pretty much it will be the end of Jabiru,\" he said.\n\n\"We've been told that from October, the gates [of the airport] will be locked and no-one will be able to get in or out.\n\n\" It's at the point now where we think it's been left too late. \"\n\nJabiru has also recently been struggling with its power supply, with rolling blackouts affecting the township in early January due to faults in its power station's generators.\n\nIn a statement, a Rio Tinto spokesperson said \"[we] acknowledge and respect the views of all stakeholders to keep Jabiru Airport open\".\n\nJabiru and its surrounds are home to about 1,000 people, with another 1,177 residing in the nearby community of Gunbalanya. (ABC News: Roxanne Fitzgerald)\n\n\"[We] are supportive of efforts to retain the airport subject to appropriate arrangements being agreed,\" they said.\n\nIf no third-party operator is found to keep the airport open, Rio Tinto is required by legislation to decommission and demolish the airport by late 2026.\n\nNature has long warned us about rising sea levels In wet season, Jonathan and his family have to drive, boat and drive again if they want to reach town. The remote NT traditional owner says nature has long been warning us about climate change.\n\nMr Brown called on the NT's Country Liberal Party government and the Commonwealth to \"find a permanent solution to keep Jabiru Airport operational, not just a short-term bandaid solution\".\n\n\"The people of Jabiru and West Arnhem deserve clear answers and a firm decision now,\" he said.\n\nA spokesperson for Resources and Northern Australia Minister Madeleine King said: \"The Commonwealth remains in discussions with the NT government and other stakeholders on the future status of the airport as a matter of priority to provide certainty for traditional owners, local communities and businesses.\"\n\nNT Housing, Local Government and Community Development Minister Steve Edgington said the government was \"working with the Commonwealth and key stakeholders to come to a resolution\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-31/heatwaves-mean-netting-installations-for-fruit-crops-to-increase/106278420",
        "title": "Growers turn to netting to save crops from heatwave sunburn",
        "publish_date": "Fri, 30 Jan 2026 22:32:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Humans are told to slip, slop, slap, seek and slide, but for agricultural crops, seeking shade has never been more important.\n\nThe latest heatwave that gripped the south-east of the country broke temperature records, with highs above 49 degrees Celsius in New South Wales and South Australia.\n\nBut the extreme temperatures have raised questions in key fruit-growing regions about how to protect crops and businesses from heat in the future.\n\nCraig Burne says sustained hot days either side of a heatwave are a problem. (ABC Riverland: Amelia Walters)\n\nFor persimmon and avocado grower Craig Burne in South Australia's Riverland, netting infrastructure across his persimmon crop has been a lifeline.\n\n\"We have overhead misting systems that come on at 35 degrees to help cool the avocado orchard ... and we have our nets for the persimmons,\" he said.\n\n\"Without these two systems in place, I don't think we'd successfully grow either of these crops in this climate anymore.\n\nCraig Burne says it will take days until he knows the full extent of his avocado crop loss. (ABC Riverland: Amelia Walters)\n\n\" I think [netting] is going to be absolutely mandatory for many crops to survive the heat. \"\n\nMr Burne said while some of his persimmon crop was heat-affected, it held up better than his avocado crops, which were not covered by netting.\n\nFruit exposed to the sun can quickly become sunburnt and turn brown. (ABC Riverland: Amelia Walters)\n\n\"Without those net structures protecting fruit from that sun and those extreme heat events, you're not going to get through without crop loss, it's as simple as that,\" he said.\n\nNetting the way of the future?\n\nG2 Netting Group sales director Kyle Lamont said netting sales across Australia had increased in recent years, especially in regions including the Riverland, Sunraysia and Goulburn Valley.\n\n\"Over the last five to 10 years, there's definitely been an uptake and an increase in growers looking for protection,\" he said.\n\nKyle Lamont says some netting structures can reduce UV exposure by up to 20 per cent. (Supplied: Kyle Lamont)\n\n\"There's really no growing regions that aren't increasing netting structures.\n\n\"[Growers] can maintain a more stable environment under the netting structures, and during the peak of those heatwaves, it's probably 2 or 3 degrees cooler under those structures.\"\n\nMr Lamont said export markets in countries such as China, Korea and Japan were only accepting \"pristine\" fruit, highlighting the need for sun protection.\n\n\"People buy with their eyes, so unfortunately, that means [growers] have to produce blemish-free fruit, and that's getting harder with these extreme challenges from Mother Nature,\" he said.\n\nMr Lamont said some netting structures could cost about $60,000 per hectare to install.\n\nNetting infrastructure usually has a lifespan of around 15 years. (ABC Riverland: Amelia Walters)\n\nMr Lamont said while he believed there was still a place for small fruit producers who were unable to afford netting, it was a no-brainer for corporate growers to install the infrastructure.\n\n\"Netting is an insurance policy, and I believe most large-scale or major growers will be going that way,\" he said.\n\nSouth Australia's Department of Primary Industries and Regions previously offered grants of up to 50 per cent on netting infrastructure installation or repairs for Riverland and Adelaide Hills growers.\n\nThe funding stream ended on June 30, 2025.\n\nHotter days and longer heatwaves\n\nAdelaide University environmental health researcher Peng Bi said heatwaves would continue to be an issue across the country.\n\n\"We are seeing the increase of heatwaves across Australia. In Adelaide [for example], heatwaves occurred in 2009, 2014, 2019, 2024, and now 2026, so there are a lot of heatwaves happening,\" he said.\n\nPeng Bi says inland regions are likely to be affected by heatwaves more than coastal regions. (ABC News: Brant Cumming)\n\n\"Those intense heatwaves have and will continue to impact society, including productivities from agricultural areas.\"\n\nProfessor Bi said mitigation and adaptation to climate change would be crucial.\n\n\"[Heatwaves] will affect the population's health, and it will likely impact farming communities and their outdoor activities, for example,\" he said.\n\nCraig Burne says despite the harsh conditions, he will continue to grow fruit into the future. (ABC Riverland: Amelia Walters)\n\nBack in the state's Riverland, Mr Burne said consolidating his crop varieties may be the way forward.\n\n\"The question will be, do we start consolidating our business in terms of moving away some of the avocado orchards that aren't as productive ... and replant to persimmons to remain under net?\" he said.\n\n\"In an ideal situation, I'd have my whole farm under net, but avocados are just too damn big to grow under nets.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-31/state-library-of-victoria-hosts-lgbtqia-fantasy-ball/106272364",
        "title": "Ballroom community takes over Australia's oldest library",
        "publish_date": "Fri, 30 Jan 2026 21:48:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "A dozen performers donning angelic white and crimson outfits dance along a runway to thunderous applause from the crowd and chants of \"Hey hey what's up, Furia f*** it up!\"\n\nThis is not a conventional Saturday night for the State Library Victoria.\n\nNormally a space of quiet reading, the 172-year-old institution was transformed into the Fantasy Ball, a queer pageant-like event where attendees from across the country come to watch participants \"walk\" in eight categories.\n\nLoading...\n\nBallroom is a burgeoning subculture with roots in late 20th-century Harlem, New York, created to foster community and safety for LGBTQIA+ people of colour, particularly trans women.\n\nThe subject of the 1990 documentary Paris is Burning and the hit drama series Pose, ballroom has since found its way to Australian cities.\n\nFounding mother of the House of Furia, Angel, says the Fantasy Ball is about allowing queer people to live out their dreams. (ABC News: Jacob Gamble)\n\nFantasy Ball curator Angel Furia says ballroom provided a space for queer people living on the margins to experience their fantasy.\n\n\"In ballroom, the fantasy of walking a category is usually walking a category that does not exist in your everyday life,\" Angel says.\n\n\" The fantasy is creating that visual representation of yourself. It's almost like manifesting for yourself who you can be. \"\n\n'Vogue fem'\n\nIn the beginners' performance category, participants dressed as fairies fly down the runway performing \"vogue fem\", a high-energy dance characterised by fluid, feminine movement.\n\nVogue fem is a dance style integral to ballroom, with five elements including duck walks and dips. (ABC News: Jacob Gamble)\n\nCompetitors weave their arms in flamboyant patterns, and synchronise their dips to drops in the backing music, while a quick-witted commentator stirs up the crowd.\n\nSolana Iman was living \"every fantasy\" after winning the beginner's performance category. (ABC News: Jacob Gamble)\n\nAfter a few rounds of eliminations, a battle ensues between the final two fairies, with Solana Iman declared the victor.\n\n\"For me, voguing is an expression, it's a feeling, it's not just a dance move. It's a struggle that queer POC [people of colour] have to go through,\" she tells the ABC.\n\nTakudzwa 007 vogues the house down in the beginners' performance category. (ABC News: Jacob Gamble)\n\nRunner-up Takudzwa 007 says voguing is the \"main attraction\" of ballroom for him.\n\n\"A lot of it has an element to it that expresses the feminine in such a raw way for me,\" he says.\n\n\"It just feels like that side of my queer identity can be fully out there.\"\n\nChosen family\n\nWithin ballroom, participants compete as individuals, known as 007s, or as a member of a collective, known as a house.\n\nThe house often serves as a \"chosen family\", a support system for community members who may struggle to connect with their biological family.\n\nExperienced members nurture younger talent.\n\nBallroom houses give queer people a chosen family, with house mothers nurturing their children. (ABC News: Jacob Gamble)\n\n\"Chosen family is really important for me because they've been there for me during my ups and downs,\" Solana says.\n\n\"I grew up in a conservative Muslim black family household, so they're not really accepting.\"\n\n\" When I found ballroom, that's when I found family and who I was as a person. \"\n\nHouse of Furia opens the ball with a grand march, showcasing sharp dance skills and impeccable fashion. (ABC News: Jacob Gamble)\n\nThe category is …\n\nThe categories demand an intimate knowledge of ballroom, sharp performance skills, and the right dose of artistic flair.\n\nPerformers are judged by a panel of seasoned judges, with the goal of achieving a perfect score or \"10s across the board\".\n\nThe Bizarre x Best Dressed category calls for an effect inspired by a deity from your ancestry. (ABC News: Jacob Gamble)\n\nJudge Chantal 007 Revlon says she looks for performers who are \"fearless\".\n\n\"I'm looking for you to be audacious, and I'm looking for you to tell me your story,\" she says.\n\nChantal 007 Revlon sits on the judging panel and says ballroom is a safe space, and a brave space. (ABC News: Jacob Gamble)\n\n\"I want you to be able to bring me into your world, like this is your world and I'm just living in it.\n\nLGBTQI+ community support services ABCQueer has compiled this list of national and state-based support services relevant to LGBTQI+ people, their families and friends.\n\n\"Ballroom is sometimes a safe space, but it's mostly a brave space, and it's a space where you are required to be fearless and believe in yourself.\"\n\nBut if you fail to meet the requirements of the category, you face being chopped.\n\nFor the femme queens\n\nThroughout the evening, commentators remind the audience that the event is about celebrating \"femme queens\", ballroom terminology for trans women.\n\nLilo 007 puts on a fierce showing in the Victoria's Secret inspired European Runway category. (ABC News: Jacob Gamble)\n\n\"A femme queen is a woman who owns her power no matter what,\" Heidi Furia said.\n\nOnce an online streamer, Heidi was encouraged by one of her viewers to explore the ballroom scene.\n\nEventually, it led her to being welcomed into a community of trans women.\n\nWinner, winner: Mother Leah Iman's house triumphs in four categories. (ABC News: Jacob Gamble)\n\n\"I met those women for the first time in my life, but it really felt like I knew them for so many years,\" she says.\n\n\" It felt really nice to be around people who are just like me. \"\n\nStepping onto the stage with her house, Heidi says she is living her dream.\n\n\"Ballroom is so important because in this climate, this is where our queer youth need to be celebrated, understood, accepted and lifted up,\" Heidi said.\n\nCyrus Iman takes Kylie Minogue 'Padam Padam' red to new heights in the European Runway category. (ABC News: Jacob Gamble)\n\n\"We need to be able to feel like we can conquer this world just as much as anyone else.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-31/sabalenka-the-favourite-rybakina-pledges-to-fight-to-the-end/106290682",
        "title": "Sabalenka the favourite but Rybakina pledges 'fight to the end'",
        "publish_date": "Fri, 30 Jan 2026 21:08:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "Aryna Sabalenka will bid for a third Australian Open trophy in four years when the Belarusian collides with fellow power-hitter Elena Rybakina in a heavyweight rematch of their title showdown three years ago.\n\nThe dynamics have shifted since Sabalenka's breakthrough win in 2023, the 27-year-old now the clear favourite following three more Grand Slam triumphs and Rybakina yet to win another major after her 2022 Wimbledon success.\n\nDjokovic hits out at critics Novak Djokovic sets his sights on those who doubted whether he could still be an Australian Open contender.\n\nThe pair know each other well, having met 14 times on tour, with Sabalenka holding a narrow edge in a rivalry marked by bruising baseline battles and momentum swings.\n\nBut the top seed said history would count for little on Rod Laver Arena.\n\n\"We both are different players,\" Sabalenka said.\n\n\"We went through different things and we're much stronger mental and physically. We're playing better tennis now. So I'll approach this as completely different match.\n\n\"We have long history after that final. I'll approach this match as the very first one and I will do my very best.\"\n\nVictory would give Sabalenka her fifth Grand Slam title, drawing her level with Martina Hingis and Maria Sharapova and cementing her place among the most successful players of the modern era.\n\nAryna Sabalenka can make it three Australian Open titles in four years. (Getty Images: Clive Brunskill)\n\nRussian-born Kazakh Rybakina holds the recent bragging rights, having defeated Sabalenka in the WTA Finals title match at the end of 2025.\n\nThe fifth seed said she was banking on that experience to get her over the line at Melbourne Park.\n\n\"Of course, many years have passed and a lot of matches have been played,\" Rybakina said.\n\n\"Hopefully all the experience I got from the last match, and the last final that I played here, I can bring it to Saturday's match and do my best.\n\n\"Since we're both very aggressive players the serve will be important. I'll fight till the end, and hopefully this time it's going to go my way.\"\n\nBut the 2023 AO final between the pair, in which Sabalenka fought back from a set down to claim the first of her four major crowns so far, stands out.\n\n\"It was very close. Throughout the match, of course, I had some little opportunities but in the end of this third set I think Aryna stepped in,\" Rybakina said.\n\n\"She served much better. Yeah, she deserved that win.\"\n\nElena Rybakina is hoping to win her second grand slam title. (Getty Images: Fred Lee)\n\nMelbourne has been especially kind to Sabalenka.\n\nShe has won 26 of her last 27 matches at the year's first Grand Slam with her only defeat coming against Madison Keys in the 2025 final, which denied her a Melbourne Park \"three-peat\".\n\nAustralian Open day 13 quick hits Gadecki and Peers make their own bit of history and \"old man\" Djokovic turns back the clock to reach his 11th Aussie final. Here are the quick hits from day 13 at the Australian Open.\n\nSabalenka's game is tailor-made for the fast, blue hardcourts which have rewarded her heavy first serve and flat groundstrokes, and she has not dropped a set en route to the final this year.\n\nRybakina has been just as efficient, marking the first time that both Australian Open women's finalists have reached the decider without surrendering a set since Justine Henin and Kim Clijsters in 2004.\n\nWhile Sabalenka breezed past Elina Svitolina 6-2, 6-3 in the semi-finals, Rybakina had to battle against Jessica Pegula to earn a 6-3, 7-6(9/7) win and keep her record intact.\n\nThe 2022 All England Club champion has been in blistering form since the latter stages of last year, piecing together 13 wins from her last 14 matches and sustaining a level of consistency that has made her a threat.\n\nWires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-31/virginia-trioli-template/106252054",
        "title": "Parental estrangement isn't new but social media makes it harder",
        "publish_date": "Fri, 30 Jan 2026 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "A mere 2,000 years after the disciple Luke taught us about the Prodigal Son, social media has finally discovered the concept of \"going no contact\" with your parents.\n\nUnusually, Oprah got there a little later than everybody else who had already been mass-posting about quitting toxic relatives, when she broadcast a blockbuster YouTube show featuring abandoned parents and rejecting children over this \"new\" trend — she called it — of cutting parents out of your lives.\n\nA short time afterwards, Brooklyn — the first-born son of interstellar celebrities, Victoria and David Beckham — also got the memo and very publicly sacked his parents. The world has been in a kind of ecstatic, voyeuristic, schadenfreudic freefall ever since.\n\nOprah Winfrey broadcast a blockbuster YouTube show featuring abandoned parents and rejecting children. (AP: Paul Drinkwater)\n\nAn age-old sorrow\n\nBack home, just a scant two years ago, high-flying PWC chief and Carlton Football Club president, Luke Sayers, was jetting to the walled Renaissance town of Lucca in Tuscany for the 50th birthday celebrations of his wife, Cate, along with enough of their close personal friends to book out almost the entire town.\n\nLoading Instagram content\n\nThe roiling PWC tax leaks scandal was blowing up behind him as he left, and yet Sayers's magical life of expensive, luxurious celebrations appeared untouched.\n\nFast-forward to today and the couple are now estranged, and engaged in a defamation action involving a lewd picture, with their daughters publicly taking the side of their father against their mother.\n\nHappy families, unhappy families — Tolstoy told you years ago how this goes. But most of that sad and sorry stuff of parents who can't connect with kids, and kids who can't trust their parents goes on in quiet desperation behind walls we never get to see through.\n\nSo, when this age-old sorrow explodes in public, it's almost reassuring, a kind of sick-making corrective when the rich and beautiful and blessed and entitled and seemingly perfect are also revealed to have car-crash lives, just like the rest of us.\n\nThere is little mystery to family breakdown. The complexity of making those intertwined, sometimes traumatised, sometimes poorly managed connections work is so dense, it is a wonder so many of these units thrive at all.\n\nEstrangement not a new concept\n\nA lot of us can reproduce. That biological ability is absolutely no predictor of us being able to parent. Home and family have never been safe for many many people. Walking away has a long history, as Brooklyn Beckham's similarly estranged close friends, the Sussexes, have found.\n\nSign up for Weekend Reads in your inbox Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\nBut it is a continuing mystery when the seemingly perfect family chooses to implode so publicly, briefs so many other conduits of their drama, and seeks so many witnesses to their pain. The final taboo — Shakespeare's serpent-toothed, ungrateful child — will always be shocking. The spectacle is an enduringly irresistible one, but after a short period of ogling it, one feels compelled to look away.\n\nSo, it's clear that while recent social media may have given it a hashtag, the phenomenon of cutting off parents perceived as unkind or damaging is as old as the concept of family itself. As Oprah found, we have many new terms for an age-old disaffection. You can lose yourself in the social-media miasma of \"recognising toxic parents\" or \"setting boundaries\".\n\nBrooklyn Beckham recently announced he was cutting ties with his parents. (Reuters: Aude Guerrucci/File Photo)\n\nCuriously, the therapist on Oprah's podcast who leaned towards the importance of reconciliation wanted to suggest that the more people heard such terms the more they might be led to cutting parents out of their lives (intriguingly, his daughter had done that to him for several years).\n\nBut after decades of interviewing people on my radio shows from any and all backgrounds but with complex family histories, it was always mind-blowing to me how children are wired to love and forgive their parents to an extraordinary degree.\n\nDavid Beckham breaks silence after son Brooklyn cuts ties The soccer superstar tells broadcasters at the World Economic Forum that \"children are allowed to make mistakes\" in his first public comments since his son's allegations went public.\n\nI spoke to adult kids of people who faced problems with gambling or drug and alcohol use, absconders, fathers who were barely there, mothers who were barely coping, and despite the sadness and the trauma they were sharing, they almost all concluded with how much they loved their parents. I heard it again and again. \"I know that despite all that (insert horror here) she really loved me and I loved her.\"\n\nThe connection and the empathy and the need to make that primary relationship work and thrive is hard-wired into children. It takes so much to break it — so much more than many well-meaning therapists realise, I think.\n\nIt's a classic iceberg dilemma: you will only ever see the very top.\n\nHistories with long tails\n\nIn a case like the Beckhams, we will get to see the seemingly minor absolute last straw — an apparently inappropriate mother-son dance at a wedding — but not what one of Oprah's guests called \"the one thousand little things\" that finally led to the decision to walk. Those histories have very long tails.\n\nThere is perhaps one very contemporary lesson in these age-old family sorrows, and that is the dangerous game of commodifying children and so perfectly packaging a family on social media and its possible consequences.\n\nBrooklyn Beckham cut ties with his parents. Here's how it went down Celebrity family rifts are not new. Experts weigh in on how they can spark negative feelings about our own family dynamics.\n\nPerhaps when such families, particularly the Beckhams, have built a literal brand (they trademarked their kids' names at birth) out of an image of family perfection, the rot sets in early for children who eventually chafe against it. It's a risky strategy when kids will always grow up, develop their own point of view and start to do the most ordinary but always confounding thing to their parents: they look at us and they judge us.\n\nThis weekend there is really only one thing I want to read about and understand — and only Julia Baird can help me: why are all these sharks attacking us?\n\nHave a safe and happy weekend and let's start our year of sounds with a beautiful, yearning tune from London-born Arlo Parks, who wrote this song as an ode to the beautiful oblivion found of the dancefloor, somewhere we'll need to find ourselves a lot more this year. I feel. Nice to see you all again. Go well.\n\nVirginia Trioli is presenter of Creative Types and a former co-host of ABC News Breakfast and Mornings on ABC Radio Melbourne.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/six-hospitalised-during-seven-hours-of-e-scooter-carnage-overnight-20260131-p5nyhu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Six hospitalised during seven hours of e-scooter carnage overnight",
        "publish_date": "Sat, 31 Jan 2026 12:16:35 +1100",
        "category": "finance",
        "authors": [
            "Matt Dennien"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSix people, including one primary-school-aged boy in Brisbane, were hospitalised from the Gold Coast to Townsville overnight after accidents involving e-scooters or e-bikes.\n\nIn seven hours, from 7.30pm on Friday to early Saturday morning, paramedics were called to six crashes, as well as an e-scooter fire in Kawana in which no-one was injured.\n\nThe primary-school-aged boy was taken to the Queensland Children’s Hospital with a leg injury after an “e-scooter and pedestrian incident” on South Brisbane’s Grey Street just before 10pm.\n\nPremier David Crisafulli has promised action on e-scooters and e-bikes, but not before an inquiry delivers its report. QUT\n\nOn the Gold Coast, a teenage boy was hospitalised in a stable condition with leg injuries after falling from an e-bike at Helensvale, while another suffered head injuries after a scooter fall at Coomera.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/divinyls-legend-chrissy-amphlett-lives-on-in-potent-and-moving-performance-20260131-p5nyhz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Divinyls legend Chrissy Amphlett lives on in potent and moving performance",
        "publish_date": "Sat, 31 Jan 2026 12:05:44 +1100",
        "category": "entertainment",
        "authors": [
            "John Shand"
        ],
        "text": "Advertisement\n\n★★★★½ CultureLive reviewsSydney live reviews Divinyls legend Chrissy Amphlett lives on in potent and moving performance John Shand January 31, 2026 — 12:05pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nCABARET\n\nAmplified\n\nBelvoir St Theatre, January 30\n\nUntil February 8\n\nReviewed by JOHN SHAND\n\n★★★★½ Long after Chrissy Amphlett’s band Divinyls ground to a halt, she imagined doing a one-woman theatrical show about herself and her songs. Having spent her Divinyls career playing a fiery, racy, pouting, unpredictable schoolgirl, she wanted a character this time, too, reportedly settling on a crow. It was never to be. She died of breast cancer before the half-formed dream took flight. Enter Sheridan Harbridge, Glenn Moorhouse and Sarah Goodes. Together, they envisaged a ghost of the show Amphlett had contemplated, subtitling it The Exquisite Rock and Rage of Chrissy Amphlett. Harbridge wrote it, with Moorhouse as musical director and Goodes directing Harbridge’s performance. They’ve done a storming job. Sheridan Harbridge as Chrissy Amphlett in a potent performance. Jade Ellis Harbridge doesn’t become Chrissy, in the sense that the story is told in the third person, but Amphlett’s spirit is alive and living dangerously inside Harbridge’s performance.\n\nAdvertisement\n\nWhat a range the latter has, from being the best Blanche I’ve seen in A Streetcar Named Desire, to now exploding off the stage with a singing voice I didn’t know she had, that could be brutally powerful when required, yet also sweetly soulful. Harbridge’s voice can be brutally powerful but also sweetly soulful. Jade Ellis Beyond the potency of her performance and the engaging storytelling, the music and spoken word are interwoven so that a Divinyls hit might start, shudder to a stop while Harbridge tells us more, pick up again, and repeat this process. It’s done so well that you’re not cursing the fact that they won’t get on with the song; you’re engrossed in an ever-growing tension that finally finds release when the song takes centre-stage. Sheridan Harbridge in full flight. Jade Ellis\n\nAdvertisement\n\nAnother strength is the music itself, with Moorhouse (on guitar) joined by Clarabell Limonta (keyboard), Ben Cripps (bass) and Dave Hatch (drums). I never particularly rated Divinyls as a band, compared with their songs and Amphlett’s performance of them. Moorhouse and company have knocked some bricks out of the wall of sound and replaced them with nuance, without losing the kick to the surging chorus of, say, Boys in Town. Related Article What’s on Chrissy Amphlett wrote a show in which she was a crow. Years after her death, her vision lives on The fearless Harbridge, meanwhile, doesn’t just enter the audience, she invades it. She’s also funny, and the humour makes for a completeness of emotional impact, given the inherent sadness of a story of excess, of Amphlett’s repeatedly having to smash the same glass ceiling, and then suffering multiple sclerosis before the cancer hit. Perhaps it’s also so moving because the show exudes such immense affection for its subject. If the intensity of grip is released a little in the final phase, it’s certainly reasserted when they launch into I Touch Myself, the song that made the teenage Harbridge a fan.\n\nAdvertisement\n\nI suspect Amphlett would approve. She’d have appreciated the absence of hagiography and sugar-coating, and she may have recognised a fellow traveller in the high-stakes game of being audacious on stage. She may have even stood up with the rest of us at the end. The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/perth-eating-out/a-turkish-favourite-expands-to-vic-park-and-brings-an-exclusive-doner-with-it-20260130-p5nyfo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A Turkish favourite expands to Vic Park – and brings an exclusive doner with it",
        "publish_date": "Sat, 31 Jan 2026 11:06:31 +1100",
        "category": "finance",
        "authors": [
            "Max Veenhuyzen"
        ],
        "text": "Advertisement\n\nReview Eating outVictoria Park A Turkish favourite expands to Vic Park – and brings an exclusive doner with it A doner kebab with a difference, the smoky kiss of charcoal, great breads plus an all-time baklava: just four reasons to set course for Antep Mangal’s new outpost. Max Veenhuyzen January 31, 2026 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\n1 / 7 Yaprak doner plate. Matt O'Donohue 2 / 7 Chicken shish plate. Matt O'Donohue 3 / 7 An Iskender plate being finished with tomato sauce and melted butter. Matt O'Donohue 4 / 7 Chicken pide. Matt O'Donohue 5 / 7 Adana shish plate. Matt O'Donohue 6 / 7 The fine-boned Turkish flatbread lahmacun. Matt O'Donohue 7 / 7 Walnut baklava. Matt O'Donohue Previous Slide Next Slide 14 / 20 How we score Turkish$$$$ “Daaaaad,” bleats one of the teenage boys on the table next to us. “Do they do meat boxes here?” “Of course they do meat boxes,” says Mr I-Can’t-Wait-Till-The-School-Holidays-Are-Over, somewhat shortly. As it turns out, his reply is somewhat incorrect, too. Yes, the menu at Antep Mangal Victoria Park – a shiny 40-seat Turkish takeaway that opened on New Year’s Day – features doner kebab meat, a key component of the meat box, also known as the halal snack pack or HSP. Yes, the menu also includes chips: thick, crunchy blocks of potato that are the colour of a Simpsons character.\n\nAdvertisement\n\nBut no, the menu doesn’t include an option to order both items together, or at least not in a box, drowned in sauces. Veteran chef Celal Per cutting slices of meat off a yaprak (leaf) doner. Matt O'Donohue Restaurant reviews, news and the hottest openings served to your inbox. Sign up A theory: maybe dad is a regular at the original Antep Mangal that Welat Yilmaz and Hasan Siringul opened six years ago on Beaufort Street to address the shish kebab, gozleme, pide and meat box deficiencies that the area was facing? So when news broke that Antep Mangal was expanding south, it’s a given that venue number two would offer the same menu, right? Wrong. Instead, Yilmaz and Siringul want you to consider getting your doner hit via more traditional formats. As an Iskender, perhaps: a saucy arrangement of meat, tomato sauce and melted butter, piled on flatbread and presented alongside a cooling snowdrift of tangy yoghurt. Turkey has strong historical ties to Central Asia, hence the prevalence of dairy in its cuisine. (See the house-made ayran, a mildly salted drinking yoghurt.)\n\nAdvertisement\n\nOr maybe you could try the doner plate that invites buttery rice, unusually verdant salad plus fluffy bulgur (cracked wheat) simmered in the Turkish capsicum paste biber salcasi to the party. It’s an option that doesn’t just help you tick off your five serves of veg for the day: it also showcases the chew and eating quality of the meat itself. Look carefully at the hunk of flesh slowly gyrating on the vertical spit in the open kitchen, and you’ll spy countless strata lines throughout. This is no garden-variety doner, but a yaprak or “leaf” doner: its name a reference to the layers – or leaves – of lamb and beef that veteran chef Celal Per uses to build each towering mille-feuille of meat. Per is also on cutting duties and shaves slices off the doner in both long strips and short patches to create different mouthfeels and textures. The kicker? The yaprak is exclusive to Antep Mangal’s new Vic Park spin-off. Related Article Pop-up prodigies drop a line in Perth’s north Like the Mount Lawley mothership, all the skewers (shish) are grilled to order over compressed charcoal. Crucially, the mangal – the Turkish word for “grill” – smoulders all day, meaning char-grilled meat is available from just before lunch to early supper and any time in between. (Many grill places, perhaps understandably, only light their charcoal at night and during peak periods.) True, you’ll wait longer for your shish here than some places, but the juiciness and controlled char of finished dishes suggests that your patience isn’t going unrewarded. My pick of the shish is the adana, a succulent blend of minced beef and lamb, capsicum and spice that’s pressed by hand onto each skewer.\n\nAdvertisement\n\nSkewers of meat being grilled over the charcoal-fuelled mangal. Matt O'Donohue In addition to being served with rice and salad, these shish can also be ordered as kebabs tucked into puffy sleeves of Turkish bread alongside red onion, diced tomato, some leafy things and nothing else. No questions about sauces. No egg upsell. No double-meat option. These are minimalist kebabs that have been deliberately designed to not just highlight the quality of the meat, but also to quietly reinforce the restaurant’s less-is-more mantra. Vic Park’s menu might not cover as much ground as Mount Lawley’s, but it takes diners closer to Turkey. That kebab bread, by the by, is one of many items made in-house. There’s also an assortment of boat-shaped pide that are either baked open-faced or sealed like a pastie depending on its filling. They’re good eating, but my picks among the baked goods are the lahmacun (thin flatbreads of impressive finesse topped with minced lamb and beef) and the excellent baklava, dense with walnuts and crowned with tanned, ruffled edges of crunchy yufka pastry. Related Article Good Food hat 15 / 20 Review This fine dining destination in the Perth Hills embodies the spirit (and flavours) of Australia Yet for all the understated detail in its cooking, Antep Mangal looks a lot like your average neighbourhood kebab joint. Diners order at a long counter. (The layout of the room occasionally causes bottlenecks if there’s a queue and staff need to deliver food to dine-in guests.) Extraction fans work valiantly to yank out all that smoke but aren’t quite strong enough. The fridge is filled with multinational soft drinks. But don’t be fooled. Beneath this unassuming exterior is a shop cooking and serving some quietly impressive Turkish food. I dig it. A lot.\n\nAdvertisement\n\nBut I also dig Turkish cuisine’s wilder, less-classical moments too, not least the restorative power of a saucy, two-handed kebab at the end of a night out. (But please don’t bring alcohol to Antep Mangal, it’s a halal restaurant.) Some might suggest that makes me a bogan. I prefer the term open-minded. This town, I think, is big enough for both styles of Turkish food. For anyone keen to think and eat outside the (meat) box, Vic Park awaits. The low-down Atmosphere: a promising second act gently expanding the public’s perception of Turkish food. Go-to dishes: adana shish kebab ($20), Yaprak doner plate ($27), lahmahcun ($10). Drinks: the Turkish salted drinking yoghurt ayran supplemented with a fridge full of multinational soft drinks (no BYO). Cost: about $65 for two people, excluding drinks. Good Food reviews are booked anonymously and paid independently. A restaurant can’t pay for a review or inclusion in the Good Food Guide.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/us-olympic-star-airlifted-after-horror-crash-20260131-p5nyhq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "US Olympic star airlifted after horror crash",
        "publish_date": "Sat, 31 Jan 2026 10:37:14 +1100",
        "category": "sports",
        "authors": [],
        "text": "US Olympic star airlifted after horror crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/bill-gates-caught-std-from-russian-girls-epstein-claimed-20260131-p5nyhi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bill Gates caught STD from Russian girls, Epstein claimed",
        "publish_date": "Sat, 31 Jan 2026 10:09:01 +1100",
        "category": "finance",
        "authors": [
            "Gordon Rayner",
            "Verity Bowman",
            "Nick Gutteridge"
        ],
        "text": "Advertisement\n\nWorldNorth AmericaEpstein fallout Bill Gates caught STD from Russian girls, Epstein claimed Gordon Rayner , Verity Bowman and Nick Gutteridge January 31, 2026 — 10:09am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nBill Gates caught a sexually transmitted disease after sleeping with “Russian girls”, Jeffrey Epstein claimed in files released by the US Justice Department. Epstein, who died in prison in 2019, also claimed the Microsoft founder asked for antibiotics he could “surreptitiously give” to his then-wife Melinda, from whom he is now divorced. Bill Gates’s spokesperson denied the claim as “absolutely absurd and completely false”. AP In a separate email, Epstein told Peter Mandelson he had “monstrous fun” with Gates in Seattle. Three million pages of documents released by the Trump administration also contain new photographs of Epstein with Gates.\n\nAdvertisement\n\nThe files also reveal that Epstein offered Andrew Mountbatten-Windsor dinner with a 26-year-old Russian girl, as well as a claim that Epstein gave Lord Mandelson’s husband £10,000 for an osteopathy course. Related Article Epstein fallout US Justice Department releases millions of pages of Epstein documents Seven years after his death, Epstein continues to cast a long shadow over those who were in his orbit – and Gates, once the world’s richest man, is among them. On July 18, 2013, Epstein sent a memo to himself including a number of allegations about Gates. It said: “To add insult to the injury you them [sic] implore me to please delete the emails regarding your std, your request that I provide you antibiotics that you can surreptitiously give to Melinda and the description of your penis.”\n\nAdvertisement\n\nEpstein sent himself another email at 1.03 the same morning, announcing a resignation from the Bill and Melinda Gates Foundation. Epstein never worked for the foundation, so it is believed he was writing the email in someone else’s voice. Gates was given an honorary knighthood by Queen Elizabeth II at Buckingham Palace in 2005, in recognition of his services to charity. He was made a Knight Commander of the Order of the British Empire but is not known as “Sir”, a title reserved only for British citizens. It is likely there will now be calls for the honour to be revoked, though Whitehall sources would not be drawn on whether No.10 would back such a move. A spokesman for Gates said: “These claims are absolutely absurd and completely false. “The only thing these documents demonstrate is Epstein’s frustration that he did not have an ongoing relationship with Gates, and the lengths he would go to entrap and defame.”\n\nAdvertisement\n\nFresh questions for Mandelson Other files raise fresh questions about the relationship between Epstein and Lord Mandelson, who was sacked as the British ambassador to Washington last year over previous revelations about his links to a man he called his “best pal”. Lord Mandelson referred to Epstein as “a good friend and totally trustworthy” in another newly released message. In a separate July 2011 email, Lord Mandelson asked Epstein, “what u doing?” Epstein replied: “Spent the day with Gates, in Seattle. Having monstrous fun.” Documents that were included in the previous batch of files. AP\n\nAdvertisement\n\nMeanwhile, Mountbatten-Windsor will face fresh scrutiny over his own relationship with the convicted sex abuser, whose friendship led to him being stripped of his titles last year. The files show that Epstein introduced him to a 26-year-old Russian woman in 2010, after his conviction for soliciting prostitution. In emails to a contact listed as “The Duke”, Epstein wrote: “I have a friend who i think you might enjoy having dinner with, her name is irina she will be london 20-24 [sic].” In response, the former Duke of York appeared to reply: “Of course. I am in Geneva until the morning of 22nd but would be delighted to see her. Will she be bringing a message from you? Please give her my contact details to get in touch.” It was signed “HRH The Duke of York KG”. Epstein later clarified the woman was “26, Russian, clevere [sic] beautiful, trustworthy and yes she has your email”.\n\nAdvertisement\n\nOther emails between Mountbatten-Windsor and Ghislaine Maxwell, who is currently serving a 20-year prison sentence for child trafficking, were also published on Friday. Related Article Royal family Prince Andrew photo no fake, says photographer who sourced it in 2011 The disgraced British socialite sent an email to an address linked to Mountbatten-Windsor with her condolences after the death of his grandmother in 2002. The email, sent on March 31, 2002, and addressed to “The Invisible Man”, refers to him as “sweet pea” and says of the late Queen Mother: “She was wonderful, and I am happy that I managed to meet her and speak with her.” The following day she received a reply thanking her and signed “A xxx”.\n\nAdvertisement\n\nTodd Blanche, the deputy US attorney-general, said the material published included more than 2000 videos and 180,000 images, though not all were taken by Epstein or those close to him, and they included “large quantities of commercial pornography”. The Trump administration was required by law to release all the material it holds on Epstein, who was jailed in 2009 after admitting soliciting prostitution, by December 19 last year. It had only released a fraction of the files by the deadline. The remainder of the material is believed to have now been published. Epstein’s wide network of rich and powerful friends also included Donald Trump, who Epstein had claimed “knew about the girls”. However, Blanche insisted Trump had been exonerated by the full release of the files. He said: “In none of these communications, even when doing his best to disparage President Trump, did Epstein suggest President Trump had done anything criminal or had any inappropriate contact with any of his victims.” The Telegraph, London Get a note directly from our foreign correspondents on what’s making headlines around the world. Sign up for our weekly What in the World newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/brook-celebrates-quickfire-century-20260131-p5nyhk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brook celebrates quickfire century",
        "publish_date": "Sat, 31 Jan 2026 09:53:08 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/if-a-summer-of-sharks-restores-our-respect-for-the-ocean-that-s-no-bad-thing-20260130-p5ny8q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "If a summer of sharks restores our respect for the ocean, that’s no bad thing",
        "publish_date": "Sat, 31 Jan 2026 09:30:00 +1100",
        "category": "finance",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "Advertisement\n\nNationalNSWSharks Opinion If a summer of sharks restores our respect for the ocean, that’s no bad thing Malcolm Knox Journalist, author and columnist January 31, 2026 — 9:30am\n\nJanuary 31, 2026 — 9:30am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\n“Going for a swim?” It had been a stinking hot day’s work, and Manly beach was metres away, but the tradie wasn’t interested. “Not a chance, not even up to my ankles.” Fear is not going in above the ankles one day, then diving straight into a rip the next. DIONNE GAIN The Manly stretch has been a sobering sight since January 19 when, in the third Sydney shark incident in barely 24 hours, a surfer was pulled from the waves at North Steyne with critical injuries. Andre de Ruyter would lose his lower leg, and the previous day at Nielsen Park in Sydney Harbour, 12-year-old Nico Antic suffered fatal injuries. Between those two events, a surfer’s board was bitten at Dee Why, not far from where, a few months earlier, Mercury Psillakis died. If we are lucky, 2025-26 will be marked out as the freak year when people in Sydney became too scared of sharks to go into the water. Gradually, they’re creeping back. No Nippers yet, but the heat has propelled a handful of swimmers into the water at South Manly. The Queenscliff ocean pool, warm with weed and wee, has been doing brisk business. In the last few days some swimmers, sticking tight and staying close to shore, have tested the open water. The patrolling jet skis and rubber duckies have eased off. Sirens, set off by electronic signals from tagged sharks, go off at their usual three or four times a week. If there were surfable waves (there haven’t been), boardriders would be edging back.\n\nAdvertisement\n\nNorth Steyne was among a number of Sydney beaches closed after shark sightings and incidents in January. George Chan/Getty Images Fear isn’t meant to be logical. One headland north, normality resumed quicker at Freshwater. South of the harbour, beach life was only momentarily interrupted, as if bull sharks only knew to turn left at Sydney Heads. There has been a widespread sense of loss, as if people have had their territorial rights to their ocean summer rescinded. Warm days have heightened this feeling that an entitlement has been taken away. As one proponent of shark culling asked, “Sharks can have the whole ocean. Can’t we just have the first hundred metres?” While understandable, these sentiments are based more in emotion and habit than evidence. It hasn’t taken long for humans to get used to the idea that they own this fringe of littoral water, and that sharks, like those other beach infringers, the cabana builders, have violated their free space. I’m not saying that selfish cabana people are any smarter than sharks, but regulation and negotiation can at least modify their behaviour. Sharks tend not to listen to reasoning. If a positive can be taken from this year’s shark incidents, it will be to reverse some assumptions and restore respect for the ocean. It’s not our swimming pool. It was never ours to take away.\n\nAdvertisement\n\nThere has been an alarming, and frankly astonishing, divergence between Australians’ use of the ocean and their respect for its risks. A March 2025 study by Royal Surf Lifesaving Australia found that among year 6 students, nearly half cannot swim 50 metres and tread water for two minutes. Only one in six 17-year-olds can swim the national benchmark distance of 400 metres. Swimming lessons in schools are in decline, a quarter of schools have no swimming carnivals, and Australians’ swimming ability shows “little improvement” after year 7. Each of these indicators had worsened since the COVID-19 pandemic, and yet the public, of all ages, is gravitating to the beach more and more. Irrational fear of sharks, as characterised in Jaws fictional Amity Island, is no better than irrational entitlement when it comes to how we interact with the ocean. Universal Pictures Notwithstanding efforts to educate people on swimming in rips, particularly from Rob “Dr Rip” Brander, there were 357 drowning deaths in Australia last year according to the National Drowning Report, 84 of them at beaches, a 27 per cent rise on the 10-year average. Shark incidents are different, of course, but they also involve assessing risk. Calls for improved education are thrown into sharp relief by the incident at North Steyne. I was there that day. The waves were ordinary but, Manly being Manly, in normal late-afternoon conditions there would have been dozens of surfers out. Days of rain had left murky water, so there were only three surfers on the entire stretch. The rest had weighed up the chance of an infection, and the two other shark incidents, and decided not to surf. Possibly de Ruyter and the two others saw a rare chance for empty North Steyne waves. They measured the odds. The chance of a shark incident was minuscule, if well above the normal. De Ruyter was incredibly unlucky – and also incredibly lucky that the two others were there to pull him from the water. These complex calculations of risk can be inbuilt through years of experience and grounded in respect for nature. But they’re still new in the scale of things. It’s easy to forget how recently the coastal ocean has come into non-Indigenous use. For colonial Australians, beach swimming began only a century ago and escalated to mass popularity in the last 50 years. In a blink, society has escalated the ocean environment from something unknown to a feature of cultural identity as Australian as the quarter-acre block. Irrational fear to reckless overconfidence in two generations.\n\nAdvertisement\n\nThe high prevalence of beach drownings among inexperienced swimmers underscores how long it takes to even begin to understand the ocean. Education of this kind is not a one-day course; it’s a lifelong accumulation of knowledge, of trial and error. Related Article Opinion\n\nSharks Surfers like me can’t get spooked by sharks. Then the fear wins Luke Kennedy Surfer and writer If there is one hope to take from the sad sight of this January’s empty beaches, it’s that respect for the ocean must be rebuilt. Not fear. Fear is not going in above the ankles one day, then diving straight into a rip the next. Respect, on the other hand, is a matter of acquiring skills, calculating probabilities, figuring out when the odds are with you and when they are against you, learning from experience, and above all not taking the ocean for granted as if it’s your personal playground. Being in the ocean is always a game of odds. Learning how to swim, learning rips and learning about sharky conditions are not guarantees of safety; they’re only ways of tilting the odds in your favour. The decline in swimming education, coinciding with an increase in beach use, is a snapshot of irrational entitlement. Its flipside is irrational fear, Amity Island in Jaws. Fatalities on our beaches shouldn’t terrify us; they should make us more humble in our approach to the ocean, more respectful, and more willing to learn. If absorbed in this way, the grim misfortunes of the past months can leave a positive legacy. Malcolm Knox is a journalist, author and columnist for The Sydney Morning Herald.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/denmark-s-king-frederik-and-queen-mary-to-visit-australia-20260131-p5nyhb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Denmark’s King Frederik and Queen Mary to visit Australia",
        "publish_date": "Sat, 31 Jan 2026 09:22:16 +1100",
        "category": "finance",
        "authors": [
            "Tom Wark"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nKing Frederik and Queen Mary of Denmark are heading to Australia for a six-day state visit.\n\nThe couple, who met at the Sydney Olympics and married in 2004, will make their fourth official visit to Australia in March - their first since the King took the throne in 2024 following the abdication of his mother, Queen Margrethe II.\n\nThe royals will travel from the Northern Territory through the ACT, Victoria and Tasmania, where the queen was born and raised.\n\nLoading\n\nThe couple will be accompanied by Denmark’s deputy prime minister, foreign minister and climate minister and a delegation representing 55 Danish businesses.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/prodigal-guns-how-the-waratahs-harnessed-hunger-of-stars-they-previously-brushed-20260129-p5ny4e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prodigal guns: How the Waratahs harnessed hunger of stars they previously brushed",
        "publish_date": "Sat, 31 Jan 2026 09:18:00 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Fast-forward to 2025, and Fainga’a found himself re-considering his earlier position. After a five-season stint with the Brumbies and a year in Perth, Fainga’a had moved to France to play for Clermont. With a year left on his contract, the coach who gave him a debut at the Brumbies - Dan McKellar - was on the phone asking if he’d come home to play for the Waratahs. Dave Porecki had retired, opening up a spot. The bitterness had receded, and with the chance to not only play under McKellar again, but re-ignite his Test career before the 2027 Rugby World Cup, Fainga’a accepted. A decade late, Fainga’a is a Waratah, and he is stoked. The 30-year-old will run out for NSW against the Reds in a trial at Ballymore on Saturday, and in a few weeks, make a Super Rugby debut for NSW as well. Fainga’a’s back-to-blue story is not an isolated one, either. The Waratahs squad in 2026 is littered with outstanding players who have been recruited back to their home state this season after initially being overlooked by the Tahs.\n\nNew captain Matt Philip, a former NSW under-20s skipper, had to move to Perth to debut and become a Wallaby. Pete Samu starred for Randwick and trialled with the Tahs in 2014, but left for New Zealand after missing a contract. Jack Debreczeni left for the Rebels in 2013, and Wallabies winger Harry Potter departed for Melbourne and then Leicester. All are back in Sydney with distinguished CVs and set to make Waratahs debuts next month. Matt Philip will lead the Waratahs in 2026. Credit: Peter Rae Like Fainga’a, the past has been forgiven but not forgotten, given how much it shaped them as players. Unlike many Waratahs in the past who were recruited as first-pick junior talent and didn’t fulfil their potential via the armchair route, the prodigal sons of 2026 were instilled with the hunger that comes from rejection. “I’ve always played with a little bit of a chip on my shoulder because of that, if I’m honest,” Philip said.\n\n“That was obviously a very strong Waratahs team back in 2013-14, they won the comp. A part of me, definitely at the time, I was super frustrated, I would have loved to play in it. “But I think I wouldn’t be where I am today without that kind of setback. It’s made me hungry my whole career. I always wanted to prove them wrong, not making it that early in my career and having to go about things the hard way. Pete Samu left NSW and joined the Crusaders before becoming a Wallaby. Credit: Getty “But I’m also really grateful to be here. I can see how lucky we are to be playing for the NSW Waratahs. This is the home of rugby in Australia.” Samu was a rising star out of Melbourne who moved to Sydney in the hope of cracking the Waratahs, and was on the cusp after dominant seasons for Randwick in 2012 and 2013.\n\n“That was definitely the aim,” Samu said. “I was lucky enough that I was part of the academy. “I got asked to do a pre-season with the Tahs - Cheik was the coach - and I played a couple of pre-season games as well. It was 2014, the start of that year. I was fighting for the last contract spot, which went to Ben Volavola at the time. But yeah, it’s pretty cool to have this full circle moment.” Samu’s next steps were good ones - he made his debut for the Crusaders - before Cheika righted his wrong and recruited him back to Australia to play for the Brumbies and the Wallabies. Debreczeni played NSW Schools and was also in the academy, which was national but based at the Waratahs. The big-kicking No.10 also had to leave Sydney to get a start at the Rebels, and 13 years and seven clubs later, also accepted an offer from McKellar for a belated run in blue.\n\n“To see a lot of other blokes come back home, and who are keen to put on that blue jersey and represent their state, yeah, it gives good vibes around the group,” Fainga’a said. Loading Though a successful former Brumbies coach, McKellar has been at pains to say since taking over the Tahs last year that he doesn’t want to transplant the Canberra club’s style and culture. But there are definitely signs of some Brumbies’ DNA being spliced in. The Brumbies built their identity on being the discards of NSW, and the hunger that came with it. McKellar has strategically sought to repatriate lost Tahs - many of them from the Brumbies. He also signed Warringah’s Test flanker Luke Reimer for next year, too. “We want to be a club, an organisation - there’s no shortage of talent in New South Wales - where we retain and develop our best young players,” McKellar said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/catherine-o-hara-passes-away-aged-71-20260131-p5nyh3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Catherine O’Hara passes away aged 71",
        "publish_date": "Sat, 31 Jan 2026 07:28:50 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/powerful-winds-cause-power-outages-across-adelaide-20260131-p5nyh0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Powerful winds cause power outages across Adelaide.",
        "publish_date": "Sat, 31 Jan 2026 07:19:02 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/two-injured-after-stabbing-in-sydney-s-west-20260131-p5nyh1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Two injured after stabbing in Sydney’s West",
        "publish_date": "Sat, 31 Jan 2026 07:18:55 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland-police-to-roll-out-more-police-patrols-and-rbt-sites-across-the-state-20260131-p5nyh2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Queensland Police to roll out more police patrols and RBT sites across the state",
        "publish_date": "Sat, 31 Jan 2026 07:18:15 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/protect-every-solitary-moment-the-viral-app-that-asks-users-if-theyre-still-alive/ldab9huwu",
        "title": "'Protect every solitary moment': The viral app that asks users if they're still alive",
        "publish_date": "Sat, 31 Jan 2026 01:23:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "A Chinese personal safety app called Are You Dead? — recently rebranded as Demumu — has gone viral in recent weeks, attracting widespread media attention.\n\nBehind its sudden popularity lie deeper social transformations, including demographic shifts and changing personal and family relationships.\n\nAt the same time, demand is growing for trust-based, non-medical, easy-to-use care networks tailored to the rapid rise of one-person households.\n\nDemumu also shows how digital technologies are not only responding to everyday safety concerns but also reshaping social and cultural norms.\n\nAs traditional kinship ties and community support structures weaken, technology is stepping in to fill — and capitalise on — the gaps.\n\nDemumu's virality: from local to global\n\nIn mid-2025, with a development cost of around 1,500 yuan ($308), three young Chinese professionals from Moonscape Technologies launched a personal safety app called Are You Dead?.\n\nThe app was designed to address the safety concerns of China's growing population of people who live alone. As described on its official store page, the app aims to \"protect every solitary moment with simple solutions and build a solid safety line for solo living\".\n\nUsers are prompted to click an on-screen button daily or fortnightly via their smartphone to verify they are alive. If a user fails to do so, the system automatically sends email alerts to two nominated emergency contacts.\n\nShortly after the app's release, it went viral and quickly became the most downloaded paid app in China.\n\nA 10 per cent stake in the company reportedly increased in value from 1 million yuan ($205,834) to nearly 10 million yuan ($2 million) within three days. This suggests an overall valuation of close to 100 million yuan ($20.57 million) for the developer.\n\nIn mid-January 2026, the app rebranded as Demumu as part of a global expansion.\n\nIt has now gained traction in more than 40 countries and is ranked near the top in global markets such as the United States, the United Kingdom and Canada.\n\nChina is moving towards smaller families and more individualised lives\n\nThe 2020 China Population Census showed there were more than 125 million one-person households in China. That's one in every four households in the country.\n\nAround two-thirds of these solo dwellers are aged between 20 and 59. It is estimated there will be 200 million such households by 2030.\n\nThe rapid rise of solo living in China can be attributed to several factors.\n\nFirst, a growing number of 'empty nest' older adults. This has been caused by population ageing, and the decline of marriage and fertility while divorce rates rise. These trends have been intensified by longer life expectancy and the legacy of the decades-long One Child Policy.\n\nREAD MORE China reimposes taxes on condoms, contraceptive drugs to spur flagging birth rate\n\nSecond, intimate relationships and family formation have become less attainable for many.\n\nMen are often expected to own a home and a car even at the courtship stage, which is increasingly difficult due to rising living costs and high property prices. 'Bride prices' — paid by a man's family to a woman's before marriage — are also escalating.\n\nThird, large-scale migration from rural to urban areas and between cities has produced many 'split households'.\n\nMillions of 'empty-nest youths' live alone for extended periods under intense work-related pressures before forming or reuniting with families. A common anxiety among this group is 'disappearing in loneliness'.\n\nLISTEN TO INTERVIEW: Loneliness - the hidden health danger SBS News 06:37 English\n\nNumerous reports have documented 'empty nesters' who died and were only found days, weeks, or even months later, particularly in gated urban communities. These incidents highlight the vulnerabilities associated with solo living, as well as the absence of trust-based safety networks.\n\nThis is a problem Demumu seeks to address.\n\nMoreover, among younger generations in China – particularly highly educated urban women – attitudes towards marriage and singlehood are shifting. Living alone is increasingly a deliberate choice.\n\nCareer development and personal autonomy are becoming higher priorities. Many women wish to avoid taking on a disproportionate share of domestic and caregiving responsibilities.\n\nSolo living: a high-potential market\n\nChina's singles economy is booming, and the market still has significant room to grow.\n\nIn major metropolitan centres such as Beijing, Shanghai, and Guangzhou, products and services tailored to people living alone are more and more visible.\n\nThese include one-person hotpot restaurants, single-person karaoke booths, and micro-apartments designed for solo dwellers. Compact household appliances such as mini-fridges, coffee machines, and kettles are also readily available, as well as solo travel packages offered by tourism agencies.\n\nCompanionship of various kinds is also on offer. Owning pets — particularly dogs and cats — often plays an important role in the everyday lives of people who live alone.\n\nThe intimate services market has also expanded rapidly through digital platforms and smartphone apps. This includes love mentoring and relationship counselling, online dating and digital romance games.\n\nAI-powered chatbot companions and humanoid dolls designed to meet the emotional and relational needs of solo dwellers are also becoming more common.\n\nThere's also an emerging niche business known as date-renting. This practice was initially popularised among young 'bare branches' seeking to bring a temporary partner home for Lunar New Year family gatherings.\n\nREAD MORE 2026 Lunar New Year: Celebrations Across Australia You Need to Know\n\nHowever, date-renting has since evolved into a personalised service economy in which individuals exchange intimacy, companionship, and dating experiences. In the process, dating is transformed into an 'emotional commodity', made visible for public consumption and increasingly shaped by platform profiteering.\n\nTogether with the emergence of safety apps such as Demumu, these singles-oriented businesses and technologies are energising China's solo-driven economy.\n\nMore importantly, they are also filling the gaps left by shrinking families and increasingly individualised living arrangements. In the process, they are reshaping contemporary social and personal relations and normalising single-centred cultures and lifestyles in everyday life.\n\nPan Wang is an associate professor in Chinese and Asian Studies at UNSW Sydney.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australian-beef-farmers-scramble-to-find-new-markets-as-a-billion-dollar-export-hit-looms/vhw14vxqb",
        "title": "Australian beef farmers scramble to find new markets as a billion-dollar export hit looms",
        "publish_date": "Fri, 30 Jan 2026 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT:\n\nContinuing a family tradition that began in the late 1800s, Robert Mackenzie raises Black Angus cattle for sale locally and worldwide.\n\n\"China is a key part of our operation, they're taking roughly about 10 per cent of our production every month. And we're supplying a high-quality product from paddock to plate. And Australia has worked extremely hard to build that trust in China. Personally, I've been to China 16 times in ten years, so that shows our commitment to China.\"\n\nChinese television has even featured a live cross to Mr Mackenzie’s Port Stephens property, promoting sustainability.\n\n\"To be featured in China TV, where 80 million people watched us - my family, my father - cook Australian red meat in the paddock right here is humbling, but that goes to show that China values our quality beef.\"\n\nHowever, from January, China’s new rules will add a 55 per cent tariff to Australian beef imports exceeding specific quotas.\n\nThe Australian Meat Industry Council predicts a financial hit of up to $1 billion, as CEO Tim Ryan explains.\n\n\"A billion dollars is a lot of beef to redirect at relatively short notice and particularly for beef supply chains that aren't just a short-term decision. These animals have grown over multiple years and produced for certain markets. The last time I looked, there's not another China out there on the world market, so it's really hard to replace a destination with the scale and wealth of consumers as China.\"\n\nAustralia exported almost 300,000 tonnes of beef to China last year.\n\nMr Ryan says the new tariffs may cut that by a third.\n\n\"Australia's become a major supply of beef into the China market and over the last couple of decades, Chinese consumers have learned to love Australian beef. So, it'll hurt Australian producers that have targeted the China market specifically and they're the producers that will have to, I suppose, reconsider their business model going forward.\"\n\nTo protect its local industry, China has capped beef imports from Australia and several countries for the next three years.\n\n\"Under these new trade measures, Australia will be largely limited to trade about 205,000 tonnes of beef into the China market before 55% tariffs are triggered, which would largely make trade prohibitive for many exporters beyond that.\"\n\nCharcoal Chen is a China-based sales manager for an Australian cattle farm, with more than 20 years’ experience.\n\nHe expects exporters of premium beef like Black Angus and Wagyu to be hardest hit.\n\n\"Structurally, lower-end grass-fed products are not heavily affected. The biggest impact will be on mid-to long-term grain-fed products, such as Wagyu, where volumes are relatively large.\"\n\nAnd that’s forcing producers like Robert Mackenzie, who has cattle already fattening in feed lots, to urgently seek new markets.\n\n\"Our cattle are grass fed, grain finished. But those animals go into the feedlot for up to 200 days. And this is definitely put a speed bump in front of our operation that again, we have to scramble to work out exactly what are we going to do?\"\n\nMr Chen says exporters of chilled beef, which has a shorter shelf life, will be among the first forced to adapt.\n\n\"I expect the higher tariff to be enforced in the third quarter, around July or August 2026. Some distributors will encourage chilled-beef customers to switch to frozen products and increase frozen purchases in the first half to fill the supply gap later in this year.\"\n\nOther beef producing countries and big Australian producers are expected to move swiftly quickly to secure market share, says Mr Chen.\n\n\"It is survival of the fittest. If you hesitate and wait, you will be eliminated. Producers will have to adjust, whether by changing sales strategies, redirecting products to other markets, or absorbing them domestically.\"\n\nIt’s a challenge for family producers like Robert Mackenzie who runs 3,500 commercial cows on eight properties.\n\n\"It's disappointing. We've worked as a family extremely hard on developing that market. We've spent a lot of money, a lot of money in China. It's not as simple as just going out and finding another market.\"",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/first-cohort-of-migrants-under-tuvulu-deal-arrive-in-australia/f7r88618d",
        "title": "First cohort of migrants under Tuvulu deal arrive in Australia",
        "publish_date": "Fri, 30 Jan 2026 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nThe smell of dinner for a growing family of six is wafting through the house in Melbourne's outer west.\n\nIt's the typical routine for any family in suburban Australia, but for the Manuellas, it's still completely new.\n\nIt was barely two weeks ago that Telieta Kaumaile and their four children arrived.\n\nTelieta says it's a reality still dawning on her.\n\n'It's not like we're just coming on a vacation, it's like we are staying. It's a new home and it's a new journey. We realised that in the past few days. Tuvalu will always be in our heart and our home, but Australia is another new chapter to our family journey's life.'\n\nThe Manuellas are here on a special new visa stream, called the Falepili Mobility Pathway.\n\nIt's available to 280 Tuvaluan applicants each year, decided by random ballot.\n\nTelieta worked for Tuvalu's department of labour, while her husbad Kaumaile was in the government's public works department with a background in architecture.\n\nThe couple decided they would be among the more than 8,700 people to apply for the visa.\n\n'We came to the conclusion that in case we were selected, it would be a good opportunity in terms of better life, better education for our children, better job opportunities.'\n\nThe prospect of being chosen was a one in more than 30 chance.\n\nKaumaile recalls the moment he heard the unlikely news his family had been successful.\n\n'I was actually in the shower *laughs* ... It was funny, I was in the shower and then came out of the room, and my wife was on the phone. I saw her face was like changing, it was like surprised. So I said 'oh, what happened?' and I thought something happened to her family or relative. But actually she just told me that we're on, we got an email saying that we'd been selected.'\n\nThe new visa grants migrants from Tuvalu permanent residency in Australia.\n\nProfessor Jane McAdam, Director of the University of New South Wales' Evacuations Research Hub, explains the visa doesn't require applicants to have work or study plans already arranged.\n\n'It provides opportunities for what we call livelihood diversification, it enables kids to go to school in Australia, for people to acquire further skills and training which they might want to use here, but equally might want to take back to Tuvalu, and I think that's why this is something that the Tuvaluan government actually requested from Australia, because it sees it as embedding that skills diversification, that broader opportunity for remittances to be sent back to Tuvalu to support the economy there, rather than this being a one-way street for people to leave Tuvalu.'\n\nThe Tuvaluan diaspora in Melbourne is small but tight-knit.\n\nThe Manuellas consider themselves lucky to be staying with a relative, Niuelesolo Boland.\n\nHe's also deeply involved with the community and helps newcomers from Tuvalu adjust to life here.\n\n'I personally think that the Australian government could do a little bit more. I think it's falling back on the Tuvaluan diaspora in Australia to pick up the burden. Like a lot of them are looking at forms like 'what is this?' you know? Coming from Tuvalu where we don't even have tax file numbers you know? Or a Medicare scheme. So to them it's totally foreign.'\n\nWhile the Falepili Mobility Pathway has proven hugely popular in Tuvalu, one expert has taken issue with the random nature of the visa ballot system.\n\nDr Yvonne Su, from Harvard University's School of Public Health, points to the fact this visa was partially designed to assist those on the frontline of climate change and rising sea levels.\n\n'Climate change is not random. Climate change doesn't just happen to anybody, unfortunately, right. So, because climate change is not by chance, it frightens me that we've allowed the people on this visa, that I have to say has been branded with climate change resilience as a big part of it, and saying climate mobility and saying you're protecting them from climate change as a big part of it, you're saying that could be by chance.'\n\nBut the Federal Minister for Pacific Affairs, Pat Conroy, says the random nature of the ballot is critical to the treaty.\n\n'The thing that we definitely need to avoid is brain drain. If you didn't have a ballot system that introduced an element of random selection, in the end the people who would qualify first for this visa would be the people with the highest educational and professional qualifications within Tuvalu, and that would lead to a brain drain.'\n\nBack in Melbourne, both Kaumaile and Telieta are grateful, but also deeply aware of the threat climate change poses to their home country.\n\n'In another 50 years they say Tuvalu will be gone. But my countrymen they're still fighting, at the moment they're still fighting. But we just fought for the betterment of our family, to come here and use this opportunity.'",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/leader-in-dementia-research-shares-four-ways-you-can-reduce-your-risk/z65n663g7",
        "title": "Leader in dementia research shares four ways you can reduce your risk",
        "publish_date": "Fri, 30 Jan 2026 19:33:48 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Professor Henry Brodaty has dedicated his life to dementia research and care.\n\nIt was seeing his father’s diagnosis and death with the disease at just 59-years-old that led him to want to understand more about dementia.\n\nBrodaty, now 78, holds the titles of professor of ageing and mental health and co-director of UNSW Sydney’s Centre for Healthy Brain Ageing (CHeBA) — and was on Australia day awarded the Senior Australian of the Year honour.\n\nMore than 420,000 Australians were living with dementia in 2024, according to the Australian Institute of Health and Welfare, and the disease was the leading cause of death in Australia in 2023.\n\nDementia is not one specific disease but is an umbrella term for a group of symptoms caused by disorders affecting the brain.\n\nREAD MORE More than a million Australians could be living with dementia in 40 years. These are possible risk factors\n\nDementia can impact memory, speech, thought, personality, behaviour and mobility. It is a degenerative, terminal illness.\n\nThe most common form of dementia is Alzheimer's disease.\n\nHowever, research published in the Lancet Commission in 2024 that 45 per cent of dementia cases are avoidable through lifestyle changes.\n\nIn his acceptance speech for the Senior Australian of the Year Award, Brodaty called for a whole-of-life approach to brain health.\n\nAfter spending most of his life trying to understand the disease, he shared with SBS News measures one can take to reduce or delay the risk of developing dementia.\n\nGet moving\n\nBrodaty said that \"both aerobic and strength training\" is good for reducing the risk of dementia, and encourages people to \"pull or push weight a couple days a week\".\n\nCHeBA notes that exercise is one of the best medicines available, and reduces the risk of not only dementia, but an array of other conditions such as heart disease, diabetes, cancer, high blood pressure, obesity and depression.\n\n\"Build regular exercise into your schedule — make time for it,\" Brodaty said.\n\n\"Going for a walk with your friend and chatting probably isn’t enough. You need to get puffed and sweaty.\"\n\nUse your brain\n\nMuch like exercise, complex mental activity strengthens and enhances the function of the brain.\n\nBy learning throughout our lives and supporting kids’ education, we can reduce the risk of dementia.\n\n\"In the early stages of life, it’s getting an education — the more education you have, the greater your cognitive reserve. It’s like a buffer,\" he told SBS.\n\nProfessor Henry Brodaty AO has reshaped the diagnosis, treatment and prevention of dementia, enhancing the lives of countless people in Australia and around the world. Source: AAP / Mick Tsikas\n\n\"So we may build up pathology in our brain, but our ability to withstand the effects of it are improved if we have more cognitive reserve. And that whole process of buffering against pathology is called resilience. So it's cognitive resilience.\"\n\nThe CHeBA recommends not only formal education, but also learning a new skill, language or dance, socialising, volunteering and brain training as ways to ensure complex mental activity.\n\nEating a good diet\n\n\"Particularly based on the Mediterranean diet: lots of vegetables, legumes, extra virgin olive oil, almonds, walnuts,\" Brodaty said.\n\nHe also encourages people to avoid drinking excess alcohol.\n\nCHeBA recommends a healthy, balanced diet rich in micronutrients, proteins, essential oils and complex carbohydrates.\n\nIn 2024, two new dementia risk factors were updated to the standing Lancet Commission on dementia prevention, intervention and care. One of them being high LDL [Low-density lipoprotein, otherwise known as \"bad\"] cholesterol. It’s important to monitor your cholesterol and reduce consuming foods with high saturated and trans fats.\n\nProtect your head\n\n\"People worry more about their hair than what’s underneath it. We should treasure our brains,\" Brodaty said.\n\nHe encourages the use of helmets when riding bicycles or playing contact sports.\n\n\"We need to be as conscious of our brains as we do our heart.\"\n\nBrodaty and a team of researchers ran a study called Maintain Your Brain which involved 8,000 people between the ages of 55 and 77 who did not already have dementia.\n\nThey found that through online coaching and support in the areas of physical activity, nutrition, brain training and mental health, the participant’s overall cognition improved.\n\nThis was compared to the other half of participants who only received publicly available information on dementia and risk reduction.\n\n\"The group that got the coaching improved almost three times as much ... we think our program delayed the onset at least a year.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/is-it-too-late-to-fix-your-mortgage-interest-rate-trump-ready-to-announce-fed-chair-pick/l5yu505me",
        "title": "Is it too late to fix your mortgage interest rate? & Trump ready to announce Fed Chair pick",
        "publish_date": "Fri, 30 Jan 2026 06:53:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/hastie-says-he-wont-challenge-for-leadership-as-ley-gives-nationals-one-week-ultimatum/j3ageb006",
        "title": "Hastie says he won't challenge for leadership as Ley gives Nationals one-week ultimatum",
        "publish_date": "Fri, 30 Jan 2026 06:03:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Liberal MP Andrew Hastie will not contest for the leadership of the party, ending speculation about his political future.\n\nOpposition leader Sussan Ley has come under pressure as leader of the party following the Liberals' split with the Nationals, with Hastie and frontbencher Angus Taylor emerging as possible contenders.\n\nBut on Friday, Hastie ruled himself out of running for the party's leadership.\n\n\"I've previously stated that I would welcome the opportunity to serve my party and our country as leader of the Liberal Party,\" he said in a statement.\n\n\"But having consulted with colleagues over the past week and respecting their honest feedback to me, it is clear that I do not have the support needed to become leader of the Liberal Party.\n\n\"On this basis, I wish to make it clear I will not be contesting the leadership of the Liberal Party.\"\n\nHastie had met with Taylor on Thursday in Melbourne about a potential deal to run for the party leadership, but the talks ended in a stalemate.\n\nThe Western Australian MP said he would continue to focus on immigration and energy.\n\n\"I believe that those families and our country are best served by a strong Coalition government, and I will work every day to make my party the very best version of itself,\" he said.\n\nLey gives Nationals one week to reclaim frontbench positions\n\nIt comes as Ley gave the Nationals a week to reconcile with the Coalition before she replaces their leadership team.\n\nLey has appointed acting spokespeople in portfolios previously held by Nationals MPs in shadow cabinet, following the junior Coalition partner walking away from the political marriage.\n\nSenior Liberals have been given acting roles to cover the Nationals' portfolio areas as the party is now the sole official opposition after the split.\n\nThe Coalition splits its cabinet and ministry on a proportional basis between Liberals and Nationals.\n\nThe acting arrangements will be in place until the start of the second parliamentary sitting week in February.\n\nLey said she would then appoint six parliamentarians to the shadow cabinet and two in the outer shadow ministry \"on an ongoing basis\".\n\nForeign affairs spokesperson Michaelia Cash takes on the trade portfolio, health spokesperson Anne Ruston picks up agriculture, energy spokesperson Dan Tehan adds resources, and defence spokesperson Angus Taylor has been given veterans' affairs.\n\nDeputy Liberal leader and shadow treasurer Ted O'Brien has taken on the assistant treasurer portfolio, while environment spokesperson Angie Bell adds water and emergency management.\n\nNationals leader David Littleproud walked away from the Coalition when Ley accepted the resignations of three Nationals senators from shadow cabinet after they voted against hate speech laws.\n\nShadow cabinet members are required to vote in line with the agreed Coalition position or resign.\n\nLittleproud gave Ley an ultimatum that all Nationals in the shadow ministry would tender their resignations if she sacked the three rebels, saying the decision was a collective party room one.\n\nShe accepted the dissenting trio's resignations, resulting in the walkout.\n\nNationals in the lower house abstained on the vote as they sought to move amendments in the Senate, which if accepted, would have resulted in them supporting the hate speech legislation.\n\nThe Liberal leader has sought talks to reconcile the Coalition.\n\nLittleproud has turned down a meeting at least until after a party room meeting on Monday, when he faces his own leadership challenge from rogue backbencher Colin Boyce, which is not expected to succeed.\n\n\"Following Monday's parliamentary meeting of The Nationals, I will attempt to meet with whoever is elected as their leader,\" Ley said.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/older-australians-waiting-longer-to-access-home-support-services-sbs-news-in-easy-english-30-january-2026/h55f369r1",
        "title": "Older Australians waiting longer to access home support services | SBS News In Easy English 30 January 2026",
        "publish_date": "Fri, 30 Jan 2026 02:58:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nWelcome to SBS News in Easy English. I'm Biwa Kwan.\n\nThe federal government has offered to delay the start of a new program providing access to early intervention autism services for children, after state and territory leaders say they are not ready.\n\nHealth Minister Mark Butler says the date for the Thriving Kids early intervention program will be delayed from its original plan to roll out from July 1st.\n\nThe issue will be discussed as part of negotiations on finalising a five-year deal on funding public hospitals between leaders from the federal government, states and territories.\n\nFederal Health Minister Mark Butler says it is ideal to have a seperate funding arrangement for the Thriving Kids program - outside the National Disability Insurance Scheme or NDIS.\n\n\"Well existing participants aren't coming off the program. I made a very clear commitment that existing participants would stay on the program subject to all the usual rules. But state and territories in the Commonwealth agreed way back in 2023 that far too many young children were ending up on the NDIS. In some parts of the country, as many as one in four young boys were ending up on a scheme that was established for severe and permanent disability.\"\n\n---\n\nOlder Australians are waiting an average of eight months* [[245 days]] to get access to home support services, which includes showering, meal preparation and cleaning.\n\nThe data in the Productivity Commission's Report on Government Services represents almost a doubling in the median wait time over the last financial year.\n\nA spokesman for Aged Care Minister Sam Rae says action is being taken to reduce wait times. The spokesperson says the report includes data that predates the government’s aged care reforms, including a new single assessment system which came in at the start of 2025.\n\nThe federal government announced the release of 20,000 home care packages late last year, and another 63,000 by the middle of this year.\n\nOverall, Australia spent nearly $40 billion on aged care in the 2024/25 financial year, up from $38 billion the previous year.\n\n---\n\nEmergency services have found the body of a 16-year-old boy in the Blue Mountains, after he lost touch with his friend while on a camping trip.\n\nHe and his 17-year-old friend travelled by train to Leura, 80 kilometres west of Sydney, and then set off for Mount Hay on foot as part of a 3-day trip.\n\nPolice say the older boy activated his personal locator beacon on Wednesday evening after they became separated.\n\nEmergency crews rescued the 17-year-old, while the other teen's body was found nearby in a creek.\n\nA report will be prepared for the coroner.\n\n---\n\nUS border chief Tom Homan says federal agents will focus on targeted operations, shifting away from broad street sweeps that have provoked outrage in America and abroad.\n\nMr Homan admitted the federal immigration agency ICE could \"do better\" - in a rare acknowledgment from the administration that their operations had not been perfect.\n\nThis follows the fatal shooting of two U-S citizens in Minneapolis by ICE agents in the past month.\n\nMr Homan adds he would reduce the number of agents deployed to the city if he received cooperation from state and local leaders.\n\nMinneapolis Mayor Jacob Frey says there are serious concerns about the operation and the way it has been conducted.\n\n\"What's become clear to me is this is obviously not about safety. This is not even about immigration. This is about silencing a narrative or a political position that differs from that of a federal administration. We've seen this kind of conduct in other countries. We cannot see it right here in America.\"\n\n---\n\nIn Tennis, world No 1, Aryna Sabalenka has welcomed the possibility of Serena Williams' return to the sport.\n\nThe 23-time grand slam singles champion did not rule out a potential comeback when interviewed on the NBC's Today Show.\n\nSerena Williams: I am just having fun and enjoying me life right now.\n\nInterviewer: Okay, but that's not a yes or a no.\n\nSerena Williams: That is not a yes or a no. I don't know. I'm going to see what happens. I have two kids. When I filled out the form the other day - occupation? I put down housewife. Listen, I can't discuss this. (laughs).\n\nThe 44-year-old retired after the 2022 US Open, but rejoined the drug testing pool late last year.\n\nThe action is a requirement before returning to the sport.\n\nThat's SBS News in Easy English. I'm Biwa Kwan.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/six-hospitalised-during-seven-hours-of-e-scooter-carnage-overnight-20260131-p5nyhu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Six hospitalised during seven hours of e-scooter carnage overnight",
        "publish_date": "Sat, 31 Jan 2026 12:16:35 +1100",
        "category": "finance",
        "authors": [
            "Matt Dennien"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSix people, including one primary-school-aged boy in Brisbane, were hospitalised from the Gold Coast to Townsville overnight after accidents involving e-scooters or e-bikes.\n\nIn seven hours, from 7.30pm on Friday to early Saturday morning, paramedics were called to six crashes, as well as an e-scooter fire in Kawana in which no-one was injured.\n\nThe primary-school-aged boy was taken to the Queensland Children’s Hospital with a leg injury after an “e-scooter and pedestrian incident” on South Brisbane’s Grey Street just before 10pm.\n\nPremier David Crisafulli has promised action on e-scooters and e-bikes, but not before an inquiry delivers its report. QUT\n\nOn the Gold Coast, a teenage boy was hospitalised in a stable condition with leg injuries after falling from an e-bike at Helensvale, while another suffered head injuries after a scooter fall at Coomera.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/divinyls-legend-chrissy-amphlett-lives-on-in-potent-and-moving-performance-20260131-p5nyhz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Divinyls legend Chrissy Amphlett lives on in potent and moving performance",
        "publish_date": "Sat, 31 Jan 2026 12:05:44 +1100",
        "category": "entertainment",
        "authors": [
            "John Shand"
        ],
        "text": "Advertisement\n\n★★★★½ CultureLive reviewsSydney live reviews Divinyls legend Chrissy Amphlett lives on in potent and moving performance John Shand January 31, 2026 — 12:05pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nCABARET\n\nAmplified\n\nBelvoir St Theatre, January 30\n\nUntil February 8\n\nReviewed by JOHN SHAND\n\n★★★★½ Long after Chrissy Amphlett’s band Divinyls ground to a halt, she imagined doing a one-woman theatrical show about herself and her songs. Having spent her Divinyls career playing a fiery, racy, pouting, unpredictable schoolgirl, she wanted a character this time, too, reportedly settling on a crow. It was never to be. She died of breast cancer before the half-formed dream took flight. Enter Sheridan Harbridge, Glenn Moorhouse and Sarah Goodes. Together, they envisaged a ghost of the show Amphlett had contemplated, subtitling it The Exquisite Rock and Rage of Chrissy Amphlett. Harbridge wrote it, with Moorhouse as musical director and Goodes directing Harbridge’s performance. They’ve done a storming job. Sheridan Harbridge as Chrissy Amphlett in a potent performance. Jade Ellis Harbridge doesn’t become Chrissy, in the sense that the story is told in the third person, but Amphlett’s spirit is alive and living dangerously inside Harbridge’s performance.\n\nAdvertisement\n\nWhat a range the latter has, from being the best Blanche I’ve seen in A Streetcar Named Desire, to now exploding off the stage with a singing voice I didn’t know she had, that could be brutally powerful when required, yet also sweetly soulful. Harbridge’s voice can be brutally powerful but also sweetly soulful. Jade Ellis Beyond the potency of her performance and the engaging storytelling, the music and spoken word are interwoven so that a Divinyls hit might start, shudder to a stop while Harbridge tells us more, pick up again, and repeat this process. It’s done so well that you’re not cursing the fact that they won’t get on with the song; you’re engrossed in an ever-growing tension that finally finds release when the song takes centre-stage. Sheridan Harbridge in full flight. Jade Ellis\n\nAdvertisement\n\nAnother strength is the music itself, with Moorhouse (on guitar) joined by Clarabell Limonta (keyboard), Ben Cripps (bass) and Dave Hatch (drums). I never particularly rated Divinyls as a band, compared with their songs and Amphlett’s performance of them. Moorhouse and company have knocked some bricks out of the wall of sound and replaced them with nuance, without losing the kick to the surging chorus of, say, Boys in Town. Related Article What’s on Chrissy Amphlett wrote a show in which she was a crow. Years after her death, her vision lives on The fearless Harbridge, meanwhile, doesn’t just enter the audience, she invades it. She’s also funny, and the humour makes for a completeness of emotional impact, given the inherent sadness of a story of excess, of Amphlett’s repeatedly having to smash the same glass ceiling, and then suffering multiple sclerosis before the cancer hit. Perhaps it’s also so moving because the show exudes such immense affection for its subject. If the intensity of grip is released a little in the final phase, it’s certainly reasserted when they launch into I Touch Myself, the song that made the teenage Harbridge a fan.\n\nAdvertisement\n\nI suspect Amphlett would approve. She’d have appreciated the absence of hagiography and sugar-coating, and she may have recognised a fellow traveller in the high-stakes game of being audacious on stage. She may have even stood up with the rest of us at the end. The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/perth-eating-out/a-turkish-favourite-expands-to-vic-park-and-brings-an-exclusive-doner-with-it-20260130-p5nyfo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A Turkish favourite expands to Vic Park – and brings an exclusive doner with it",
        "publish_date": "Sat, 31 Jan 2026 11:06:31 +1100",
        "category": "finance",
        "authors": [
            "Max Veenhuyzen"
        ],
        "text": "Advertisement\n\nReview Eating outVictoria Park A Turkish favourite expands to Vic Park – and brings an exclusive doner with it A doner kebab with a difference, the smoky kiss of charcoal, great breads plus an all-time baklava: just four reasons to set course for Antep Mangal’s new outpost. Max Veenhuyzen January 31, 2026 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\n1 / 7 Yaprak doner plate. Matt O'Donohue 2 / 7 Chicken shish plate. Matt O'Donohue 3 / 7 An Iskender plate being finished with tomato sauce and melted butter. Matt O'Donohue 4 / 7 Chicken pide. Matt O'Donohue 5 / 7 Adana shish plate. Matt O'Donohue 6 / 7 The fine-boned Turkish flatbread lahmacun. Matt O'Donohue 7 / 7 Walnut baklava. Matt O'Donohue Previous Slide Next Slide 14 / 20 How we score Turkish$$$$ “Daaaaad,” bleats one of the teenage boys on the table next to us. “Do they do meat boxes here?” “Of course they do meat boxes,” says Mr I-Can’t-Wait-Till-The-School-Holidays-Are-Over, somewhat shortly. As it turns out, his reply is somewhat incorrect, too. Yes, the menu at Antep Mangal Victoria Park – a shiny 40-seat Turkish takeaway that opened on New Year’s Day – features doner kebab meat, a key component of the meat box, also known as the halal snack pack or HSP. Yes, the menu also includes chips: thick, crunchy blocks of potato that are the colour of a Simpsons character.\n\nAdvertisement\n\nBut no, the menu doesn’t include an option to order both items together, or at least not in a box, drowned in sauces. Veteran chef Celal Per cutting slices of meat off a yaprak (leaf) doner. Matt O'Donohue Restaurant reviews, news and the hottest openings served to your inbox. Sign up A theory: maybe dad is a regular at the original Antep Mangal that Welat Yilmaz and Hasan Siringul opened six years ago on Beaufort Street to address the shish kebab, gozleme, pide and meat box deficiencies that the area was facing? So when news broke that Antep Mangal was expanding south, it’s a given that venue number two would offer the same menu, right? Wrong. Instead, Yilmaz and Siringul want you to consider getting your doner hit via more traditional formats. As an Iskender, perhaps: a saucy arrangement of meat, tomato sauce and melted butter, piled on flatbread and presented alongside a cooling snowdrift of tangy yoghurt. Turkey has strong historical ties to Central Asia, hence the prevalence of dairy in its cuisine. (See the house-made ayran, a mildly salted drinking yoghurt.)\n\nAdvertisement\n\nOr maybe you could try the doner plate that invites buttery rice, unusually verdant salad plus fluffy bulgur (cracked wheat) simmered in the Turkish capsicum paste biber salcasi to the party. It’s an option that doesn’t just help you tick off your five serves of veg for the day: it also showcases the chew and eating quality of the meat itself. Look carefully at the hunk of flesh slowly gyrating on the vertical spit in the open kitchen, and you’ll spy countless strata lines throughout. This is no garden-variety doner, but a yaprak or “leaf” doner: its name a reference to the layers – or leaves – of lamb and beef that veteran chef Celal Per uses to build each towering mille-feuille of meat. Per is also on cutting duties and shaves slices off the doner in both long strips and short patches to create different mouthfeels and textures. The kicker? The yaprak is exclusive to Antep Mangal’s new Vic Park spin-off. Related Article Pop-up prodigies drop a line in Perth’s north Like the Mount Lawley mothership, all the skewers (shish) are grilled to order over compressed charcoal. Crucially, the mangal – the Turkish word for “grill” – smoulders all day, meaning char-grilled meat is available from just before lunch to early supper and any time in between. (Many grill places, perhaps understandably, only light their charcoal at night and during peak periods.) True, you’ll wait longer for your shish here than some places, but the juiciness and controlled char of finished dishes suggests that your patience isn’t going unrewarded. My pick of the shish is the adana, a succulent blend of minced beef and lamb, capsicum and spice that’s pressed by hand onto each skewer.\n\nAdvertisement\n\nSkewers of meat being grilled over the charcoal-fuelled mangal. Matt O'Donohue In addition to being served with rice and salad, these shish can also be ordered as kebabs tucked into puffy sleeves of Turkish bread alongside red onion, diced tomato, some leafy things and nothing else. No questions about sauces. No egg upsell. No double-meat option. These are minimalist kebabs that have been deliberately designed to not just highlight the quality of the meat, but also to quietly reinforce the restaurant’s less-is-more mantra. Vic Park’s menu might not cover as much ground as Mount Lawley’s, but it takes diners closer to Turkey. That kebab bread, by the by, is one of many items made in-house. There’s also an assortment of boat-shaped pide that are either baked open-faced or sealed like a pastie depending on its filling. They’re good eating, but my picks among the baked goods are the lahmacun (thin flatbreads of impressive finesse topped with minced lamb and beef) and the excellent baklava, dense with walnuts and crowned with tanned, ruffled edges of crunchy yufka pastry. Related Article Good Food hat 15 / 20 Review This fine dining destination in the Perth Hills embodies the spirit (and flavours) of Australia Yet for all the understated detail in its cooking, Antep Mangal looks a lot like your average neighbourhood kebab joint. Diners order at a long counter. (The layout of the room occasionally causes bottlenecks if there’s a queue and staff need to deliver food to dine-in guests.) Extraction fans work valiantly to yank out all that smoke but aren’t quite strong enough. The fridge is filled with multinational soft drinks. But don’t be fooled. Beneath this unassuming exterior is a shop cooking and serving some quietly impressive Turkish food. I dig it. A lot.\n\nAdvertisement\n\nBut I also dig Turkish cuisine’s wilder, less-classical moments too, not least the restorative power of a saucy, two-handed kebab at the end of a night out. (But please don’t bring alcohol to Antep Mangal, it’s a halal restaurant.) Some might suggest that makes me a bogan. I prefer the term open-minded. This town, I think, is big enough for both styles of Turkish food. For anyone keen to think and eat outside the (meat) box, Vic Park awaits. The low-down Atmosphere: a promising second act gently expanding the public’s perception of Turkish food. Go-to dishes: adana shish kebab ($20), Yaprak doner plate ($27), lahmahcun ($10). Drinks: the Turkish salted drinking yoghurt ayran supplemented with a fridge full of multinational soft drinks (no BYO). Cost: about $65 for two people, excluding drinks. Good Food reviews are booked anonymously and paid independently. A restaurant can’t pay for a review or inclusion in the Good Food Guide.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/us-olympic-star-airlifted-after-horror-crash-20260131-p5nyhq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "US Olympic star airlifted after horror crash",
        "publish_date": "Sat, 31 Jan 2026 10:37:14 +1100",
        "category": "sports",
        "authors": [],
        "text": "US Olympic star airlifted after horror crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/bill-gates-caught-std-from-russian-girls-epstein-claimed-20260131-p5nyhi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bill Gates caught STD from Russian girls, Epstein claimed",
        "publish_date": "Sat, 31 Jan 2026 10:09:01 +1100",
        "category": "finance",
        "authors": [
            "Gordon Rayner",
            "Verity Bowman",
            "Nick Gutteridge"
        ],
        "text": "Advertisement\n\nWorldNorth AmericaEpstein fallout Bill Gates caught STD from Russian girls, Epstein claimed Gordon Rayner , Verity Bowman and Nick Gutteridge January 31, 2026 — 10:09am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nBill Gates caught a sexually transmitted disease after sleeping with “Russian girls”, Jeffrey Epstein claimed in files released by the US Justice Department. Epstein, who died in prison in 2019, also claimed the Microsoft founder asked for antibiotics he could “surreptitiously give” to his then-wife Melinda, from whom he is now divorced. Bill Gates’s spokesperson denied the claim as “absolutely absurd and completely false”. AP In a separate email, Epstein told Peter Mandelson he had “monstrous fun” with Gates in Seattle. Three million pages of documents released by the Trump administration also contain new photographs of Epstein with Gates.\n\nAdvertisement\n\nThe files also reveal that Epstein offered Andrew Mountbatten-Windsor dinner with a 26-year-old Russian girl, as well as a claim that Epstein gave Lord Mandelson’s husband £10,000 for an osteopathy course. Related Article Epstein fallout US Justice Department releases millions of pages of Epstein documents Seven years after his death, Epstein continues to cast a long shadow over those who were in his orbit – and Gates, once the world’s richest man, is among them. On July 18, 2013, Epstein sent a memo to himself including a number of allegations about Gates. It said: “To add insult to the injury you them [sic] implore me to please delete the emails regarding your std, your request that I provide you antibiotics that you can surreptitiously give to Melinda and the description of your penis.”\n\nAdvertisement\n\nEpstein sent himself another email at 1.03 the same morning, announcing a resignation from the Bill and Melinda Gates Foundation. Epstein never worked for the foundation, so it is believed he was writing the email in someone else’s voice. Gates was given an honorary knighthood by Queen Elizabeth II at Buckingham Palace in 2005, in recognition of his services to charity. He was made a Knight Commander of the Order of the British Empire but is not known as “Sir”, a title reserved only for British citizens. It is likely there will now be calls for the honour to be revoked, though Whitehall sources would not be drawn on whether No.10 would back such a move. A spokesman for Gates said: “These claims are absolutely absurd and completely false. “The only thing these documents demonstrate is Epstein’s frustration that he did not have an ongoing relationship with Gates, and the lengths he would go to entrap and defame.”\n\nAdvertisement\n\nFresh questions for Mandelson Other files raise fresh questions about the relationship between Epstein and Lord Mandelson, who was sacked as the British ambassador to Washington last year over previous revelations about his links to a man he called his “best pal”. Lord Mandelson referred to Epstein as “a good friend and totally trustworthy” in another newly released message. In a separate July 2011 email, Lord Mandelson asked Epstein, “what u doing?” Epstein replied: “Spent the day with Gates, in Seattle. Having monstrous fun.” Documents that were included in the previous batch of files. AP\n\nAdvertisement\n\nMeanwhile, Mountbatten-Windsor will face fresh scrutiny over his own relationship with the convicted sex abuser, whose friendship led to him being stripped of his titles last year. The files show that Epstein introduced him to a 26-year-old Russian woman in 2010, after his conviction for soliciting prostitution. In emails to a contact listed as “The Duke”, Epstein wrote: “I have a friend who i think you might enjoy having dinner with, her name is irina she will be london 20-24 [sic].” In response, the former Duke of York appeared to reply: “Of course. I am in Geneva until the morning of 22nd but would be delighted to see her. Will she be bringing a message from you? Please give her my contact details to get in touch.” It was signed “HRH The Duke of York KG”. Epstein later clarified the woman was “26, Russian, clevere [sic] beautiful, trustworthy and yes she has your email”.\n\nAdvertisement\n\nOther emails between Mountbatten-Windsor and Ghislaine Maxwell, who is currently serving a 20-year prison sentence for child trafficking, were also published on Friday. Related Article Royal family Prince Andrew photo no fake, says photographer who sourced it in 2011 The disgraced British socialite sent an email to an address linked to Mountbatten-Windsor with her condolences after the death of his grandmother in 2002. The email, sent on March 31, 2002, and addressed to “The Invisible Man”, refers to him as “sweet pea” and says of the late Queen Mother: “She was wonderful, and I am happy that I managed to meet her and speak with her.” The following day she received a reply thanking her and signed “A xxx”.\n\nAdvertisement\n\nTodd Blanche, the deputy US attorney-general, said the material published included more than 2000 videos and 180,000 images, though not all were taken by Epstein or those close to him, and they included “large quantities of commercial pornography”. The Trump administration was required by law to release all the material it holds on Epstein, who was jailed in 2009 after admitting soliciting prostitution, by December 19 last year. It had only released a fraction of the files by the deadline. The remainder of the material is believed to have now been published. Epstein’s wide network of rich and powerful friends also included Donald Trump, who Epstein had claimed “knew about the girls”. However, Blanche insisted Trump had been exonerated by the full release of the files. He said: “In none of these communications, even when doing his best to disparage President Trump, did Epstein suggest President Trump had done anything criminal or had any inappropriate contact with any of his victims.” The Telegraph, London Get a note directly from our foreign correspondents on what’s making headlines around the world. Sign up for our weekly What in the World newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/brook-celebrates-quickfire-century-20260131-p5nyhk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brook celebrates quickfire century",
        "publish_date": "Sat, 31 Jan 2026 09:53:08 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/if-a-summer-of-sharks-restores-our-respect-for-the-ocean-that-s-no-bad-thing-20260130-p5ny8q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "If a summer of sharks restores our respect for the ocean, that’s no bad thing",
        "publish_date": "Sat, 31 Jan 2026 09:30:00 +1100",
        "category": "finance",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "Advertisement\n\nNationalNSWSharks Opinion If a summer of sharks restores our respect for the ocean, that’s no bad thing Malcolm Knox Journalist, author and columnist January 31, 2026 — 9:30am\n\nJanuary 31, 2026 — 9:30am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\n“Going for a swim?” It had been a stinking hot day’s work, and Manly beach was metres away, but the tradie wasn’t interested. “Not a chance, not even up to my ankles.” Fear is not going in above the ankles one day, then diving straight into a rip the next. DIONNE GAIN The Manly stretch has been a sobering sight since January 19 when, in the third Sydney shark incident in barely 24 hours, a surfer was pulled from the waves at North Steyne with critical injuries. Andre de Ruyter would lose his lower leg, and the previous day at Nielsen Park in Sydney Harbour, 12-year-old Nico Antic suffered fatal injuries. Between those two events, a surfer’s board was bitten at Dee Why, not far from where, a few months earlier, Mercury Psillakis died. If we are lucky, 2025-26 will be marked out as the freak year when people in Sydney became too scared of sharks to go into the water. Gradually, they’re creeping back. No Nippers yet, but the heat has propelled a handful of swimmers into the water at South Manly. The Queenscliff ocean pool, warm with weed and wee, has been doing brisk business. In the last few days some swimmers, sticking tight and staying close to shore, have tested the open water. The patrolling jet skis and rubber duckies have eased off. Sirens, set off by electronic signals from tagged sharks, go off at their usual three or four times a week. If there were surfable waves (there haven’t been), boardriders would be edging back.\n\nAdvertisement\n\nNorth Steyne was among a number of Sydney beaches closed after shark sightings and incidents in January. George Chan/Getty Images Fear isn’t meant to be logical. One headland north, normality resumed quicker at Freshwater. South of the harbour, beach life was only momentarily interrupted, as if bull sharks only knew to turn left at Sydney Heads. There has been a widespread sense of loss, as if people have had their territorial rights to their ocean summer rescinded. Warm days have heightened this feeling that an entitlement has been taken away. As one proponent of shark culling asked, “Sharks can have the whole ocean. Can’t we just have the first hundred metres?” While understandable, these sentiments are based more in emotion and habit than evidence. It hasn’t taken long for humans to get used to the idea that they own this fringe of littoral water, and that sharks, like those other beach infringers, the cabana builders, have violated their free space. I’m not saying that selfish cabana people are any smarter than sharks, but regulation and negotiation can at least modify their behaviour. Sharks tend not to listen to reasoning. If a positive can be taken from this year’s shark incidents, it will be to reverse some assumptions and restore respect for the ocean. It’s not our swimming pool. It was never ours to take away.\n\nAdvertisement\n\nThere has been an alarming, and frankly astonishing, divergence between Australians’ use of the ocean and their respect for its risks. A March 2025 study by Royal Surf Lifesaving Australia found that among year 6 students, nearly half cannot swim 50 metres and tread water for two minutes. Only one in six 17-year-olds can swim the national benchmark distance of 400 metres. Swimming lessons in schools are in decline, a quarter of schools have no swimming carnivals, and Australians’ swimming ability shows “little improvement” after year 7. Each of these indicators had worsened since the COVID-19 pandemic, and yet the public, of all ages, is gravitating to the beach more and more. Irrational fear of sharks, as characterised in Jaws fictional Amity Island, is no better than irrational entitlement when it comes to how we interact with the ocean. Universal Pictures Notwithstanding efforts to educate people on swimming in rips, particularly from Rob “Dr Rip” Brander, there were 357 drowning deaths in Australia last year according to the National Drowning Report, 84 of them at beaches, a 27 per cent rise on the 10-year average. Shark incidents are different, of course, but they also involve assessing risk. Calls for improved education are thrown into sharp relief by the incident at North Steyne. I was there that day. The waves were ordinary but, Manly being Manly, in normal late-afternoon conditions there would have been dozens of surfers out. Days of rain had left murky water, so there were only three surfers on the entire stretch. The rest had weighed up the chance of an infection, and the two other shark incidents, and decided not to surf. Possibly de Ruyter and the two others saw a rare chance for empty North Steyne waves. They measured the odds. The chance of a shark incident was minuscule, if well above the normal. De Ruyter was incredibly unlucky – and also incredibly lucky that the two others were there to pull him from the water. These complex calculations of risk can be inbuilt through years of experience and grounded in respect for nature. But they’re still new in the scale of things. It’s easy to forget how recently the coastal ocean has come into non-Indigenous use. For colonial Australians, beach swimming began only a century ago and escalated to mass popularity in the last 50 years. In a blink, society has escalated the ocean environment from something unknown to a feature of cultural identity as Australian as the quarter-acre block. Irrational fear to reckless overconfidence in two generations.\n\nAdvertisement\n\nThe high prevalence of beach drownings among inexperienced swimmers underscores how long it takes to even begin to understand the ocean. Education of this kind is not a one-day course; it’s a lifelong accumulation of knowledge, of trial and error. Related Article Opinion\n\nSharks Surfers like me can’t get spooked by sharks. Then the fear wins Luke Kennedy Surfer and writer If there is one hope to take from the sad sight of this January’s empty beaches, it’s that respect for the ocean must be rebuilt. Not fear. Fear is not going in above the ankles one day, then diving straight into a rip the next. Respect, on the other hand, is a matter of acquiring skills, calculating probabilities, figuring out when the odds are with you and when they are against you, learning from experience, and above all not taking the ocean for granted as if it’s your personal playground. Being in the ocean is always a game of odds. Learning how to swim, learning rips and learning about sharky conditions are not guarantees of safety; they’re only ways of tilting the odds in your favour. The decline in swimming education, coinciding with an increase in beach use, is a snapshot of irrational entitlement. Its flipside is irrational fear, Amity Island in Jaws. Fatalities on our beaches shouldn’t terrify us; they should make us more humble in our approach to the ocean, more respectful, and more willing to learn. If absorbed in this way, the grim misfortunes of the past months can leave a positive legacy. Malcolm Knox is a journalist, author and columnist for The Sydney Morning Herald.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/denmark-s-king-frederik-and-queen-mary-to-visit-australia-20260131-p5nyhb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Denmark’s King Frederik and Queen Mary to visit Australia",
        "publish_date": "Sat, 31 Jan 2026 09:22:16 +1100",
        "category": "finance",
        "authors": [
            "Tom Wark"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nKing Frederik and Queen Mary of Denmark are heading to Australia for a six-day state visit.\n\nThe couple, who met at the Sydney Olympics and married in 2004, will make their fourth official visit to Australia in March - their first since the King took the throne in 2024 following the abdication of his mother, Queen Margrethe II.\n\nThe royals will travel from the Northern Territory through the ACT, Victoria and Tasmania, where the queen was born and raised.\n\nLoading\n\nThe couple will be accompanied by Denmark’s deputy prime minister, foreign minister and climate minister and a delegation representing 55 Danish businesses.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/prodigal-guns-how-the-waratahs-harnessed-hunger-of-stars-they-previously-brushed-20260129-p5ny4e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prodigal guns: How the Waratahs harnessed hunger of stars they previously brushed",
        "publish_date": "Sat, 31 Jan 2026 09:18:00 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Fast-forward to 2025, and Fainga’a found himself re-considering his earlier position. After a five-season stint with the Brumbies and a year in Perth, Fainga’a had moved to France to play for Clermont. With a year left on his contract, the coach who gave him a debut at the Brumbies - Dan McKellar - was on the phone asking if he’d come home to play for the Waratahs. Dave Porecki had retired, opening up a spot. The bitterness had receded, and with the chance to not only play under McKellar again, but re-ignite his Test career before the 2027 Rugby World Cup, Fainga’a accepted. A decade late, Fainga’a is a Waratah, and he is stoked. The 30-year-old will run out for NSW against the Reds in a trial at Ballymore on Saturday, and in a few weeks, make a Super Rugby debut for NSW as well. Fainga’a’s back-to-blue story is not an isolated one, either. The Waratahs squad in 2026 is littered with outstanding players who have been recruited back to their home state this season after initially being overlooked by the Tahs.\n\nNew captain Matt Philip, a former NSW under-20s skipper, had to move to Perth to debut and become a Wallaby. Pete Samu starred for Randwick and trialled with the Tahs in 2014, but left for New Zealand after missing a contract. Jack Debreczeni left for the Rebels in 2013, and Wallabies winger Harry Potter departed for Melbourne and then Leicester. All are back in Sydney with distinguished CVs and set to make Waratahs debuts next month. Matt Philip will lead the Waratahs in 2026. Credit: Peter Rae Like Fainga’a, the past has been forgiven but not forgotten, given how much it shaped them as players. Unlike many Waratahs in the past who were recruited as first-pick junior talent and didn’t fulfil their potential via the armchair route, the prodigal sons of 2026 were instilled with the hunger that comes from rejection. “I’ve always played with a little bit of a chip on my shoulder because of that, if I’m honest,” Philip said.\n\n“That was obviously a very strong Waratahs team back in 2013-14, they won the comp. A part of me, definitely at the time, I was super frustrated, I would have loved to play in it. “But I think I wouldn’t be where I am today without that kind of setback. It’s made me hungry my whole career. I always wanted to prove them wrong, not making it that early in my career and having to go about things the hard way. Pete Samu left NSW and joined the Crusaders before becoming a Wallaby. Credit: Getty “But I’m also really grateful to be here. I can see how lucky we are to be playing for the NSW Waratahs. This is the home of rugby in Australia.” Samu was a rising star out of Melbourne who moved to Sydney in the hope of cracking the Waratahs, and was on the cusp after dominant seasons for Randwick in 2012 and 2013.\n\n“That was definitely the aim,” Samu said. “I was lucky enough that I was part of the academy. “I got asked to do a pre-season with the Tahs - Cheik was the coach - and I played a couple of pre-season games as well. It was 2014, the start of that year. I was fighting for the last contract spot, which went to Ben Volavola at the time. But yeah, it’s pretty cool to have this full circle moment.” Samu’s next steps were good ones - he made his debut for the Crusaders - before Cheika righted his wrong and recruited him back to Australia to play for the Brumbies and the Wallabies. Debreczeni played NSW Schools and was also in the academy, which was national but based at the Waratahs. The big-kicking No.10 also had to leave Sydney to get a start at the Rebels, and 13 years and seven clubs later, also accepted an offer from McKellar for a belated run in blue.\n\n“To see a lot of other blokes come back home, and who are keen to put on that blue jersey and represent their state, yeah, it gives good vibes around the group,” Fainga’a said. Loading Though a successful former Brumbies coach, McKellar has been at pains to say since taking over the Tahs last year that he doesn’t want to transplant the Canberra club’s style and culture. But there are definitely signs of some Brumbies’ DNA being spliced in. The Brumbies built their identity on being the discards of NSW, and the hunger that came with it. McKellar has strategically sought to repatriate lost Tahs - many of them from the Brumbies. He also signed Warringah’s Test flanker Luke Reimer for next year, too. “We want to be a club, an organisation - there’s no shortage of talent in New South Wales - where we retain and develop our best young players,” McKellar said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/catherine-o-hara-passes-away-aged-71-20260131-p5nyh3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Catherine O’Hara passes away aged 71",
        "publish_date": "Sat, 31 Jan 2026 07:28:50 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/powerful-winds-cause-power-outages-across-adelaide-20260131-p5nyh0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Powerful winds cause power outages across Adelaide.",
        "publish_date": "Sat, 31 Jan 2026 07:19:02 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/two-injured-after-stabbing-in-sydney-s-west-20260131-p5nyh1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Two injured after stabbing in Sydney’s West",
        "publish_date": "Sat, 31 Jan 2026 07:18:55 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland-police-to-roll-out-more-police-patrols-and-rbt-sites-across-the-state-20260131-p5nyh2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Queensland Police to roll out more police patrols and RBT sites across the state",
        "publish_date": "Sat, 31 Jan 2026 07:18:15 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/landmark-state-federal-housing-agreement-224149117.html",
        "title": "'Milestone deal' for 100,000 first homes target",
        "publish_date": "2026-01-31T02:18:30Z",
        "category": "finance",
        "authors": [],
        "text": "An $800 million Commonwealth-state deal for 17,000 new homes is a milestone in the promise to provide 100,000 dwellings for first-time buyers, the federal government says.\n\nThe agreement will include almost 7000 homes for first-up owners in Adelaide and Prime Minister Anthony Albanese said other jurisdictions were \"all very keen to sign up\".\n\n\"But we looked at giving credit where credit's due and the South Australian model works … and it's going to be rolled out,\" he told reporters on Saturday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"This is the first big commitment - $801 million is a substantial investment … we're looking at every possible measure we can to make a difference.\"\n\nAnthony Albanese says other states are ready to follow South Australia's lead. (Abe Maddison/AAP PHOTOS)\n\nThe deal includes a $300 million concessional loan to deliver water infrastructure to Adelaide's north, where 100,000 litres of sewage a day were being hauled by trucks in 2024 due to connection failures.\n\n\"One of the things that has held expansions back into new land releases is that you don't have the water and energy infrastructure built,\" Mr Albanese said.\n\nSA Premier Peter Malinauskas said he \"couldn't stress enough\" how important investment in water was.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"We are making the tough decisions to make sure water infrastructure is delivered to the growth corridors,\" he said, referencing bill hikes to fund a separate $1.5 billion investment in water and sewer infrastructure.\n\nThe political leaders visited the new home of John and Yolanda Tramontano in Munno Para, in Adelaide's far northern suburbs.\n\nThe family moved in just before Christmas and Mr Tramontano said the affordability of the land, first-home owners grant and a range of other programs \"have let us live our dream\".\n\n\"Our last rental increase was significant and it really reinforced the fact we're making the right decision … because it was getting very uncertain, very stressful,\" he said.\n\nNew home owner John Tramontano says he is finally able to live the dream. (Abe Maddison/AAP PHOTOS)\n\nIn December, the federal government pledged $2 billion in grants and $8 billion in concessional loans to deliver up to 100,000 homes reserved for first-home buyers over eight years from 2026-27, as part of its wider target of building 1.2 million new homes by June 2029.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Tramontano family's story \"speaks precisely to why we are so focused on housing supply in metropolitan Adelaide - we've got a housing crisis around the country and if you're not doing something about supply, you're not serious\", Mr Malinauskas said.\n\n\"John was explaining that this went from a vacant block of land to a slab and a home in the space of five months because the government is playing an active role.\"\n\nAustralian Bureau of Statistics figures show more new homes being built in South Australia than ever, with 14,916 dwellings under construction at the end of September 2025.\n\nThe state deal includes a $50 million three-year concessional loan to deliver a new first-homebuyer precinct of 400 residences in Munno Para and another worth $184 million to deliver more than 1700 homes at urban renewal projects across Adelaide.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nUrban Development Institute of Australia president Oscar Stanley said the $800m agreement demonstrated the kind of supply-focused reform needed to unlock housing delivery at scale.\n\n\"The industry applauds the ... measures that create a template for housing creation around Australia and also provide a test-bed to fast-track housing which is often held up by planning and enabling infrastructure,\" Mr Stanley said.\n\nThe Tramontanos moved into their new home in Munno Para just before Christmas. (Abe Maddison/AAP PHOTOS)\n\nMeanwhile, a new Productivity Commission report says 41 per cent of people waiting to get into public housing are either homeless or at risk of homelessness.\n\nAnalysis by the Australian Council of Social Service shows the government is spending more on tax breaks for property investors than on social housing, homelessness services and rent assistance combined.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIndependent senator David Pocock said this \"showed just how cooked the Australian housing market is\".\n\n\"It is not working for Australians ... and we actually need some structural change here, and to look at things like the capital gains tax discount,\" he told ABC News.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/explosion-injures-5-popular-holiday-230653582.html",
        "title": "‘Huge’ explosion injures 5 at holiday spot",
        "publish_date": "2026-01-31T01:50:07Z",
        "category": "lifestyle",
        "authors": [],
        "text": "A gas explosion has rocked a popular holiday destination, injuring five people, including two young children.\n\nEmergency services were called about 7.30am on Saturday after a barbecue explosion at the BIG4 Ingenia Holidays park at Lake Conjola on the NSW South Coast.\n\nMultiple paramedic units responded to the explosion and an ambulance rescue helicopter was sent to treat the injured.\n\nEye-witnesses said they heard an incredibly loud explosion, finding a family injured at the scene Credit: Supplied\n\nAt least two children were among the injured. Credit: Supplied\n\nOne eyewitness described the terrifying moment the explosion occurred.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I was sitting on the balcony and it was just a huge explosion,” the witness said.\n\nThe witness said a holidaying family had been preparing breakfast on the barbecues when the blast happened.\n\n“It looks like they’ve got probably gone to start it. There been a gas leak and it’s just blown up.”\n\nImmediately afterwards, holidaygoers rushed to the aid of the family.\n\n“All I could see was a woman and a guy, and the guy was holding the kid with a big group of people trying to calm the kid down,” the eyewitness said.\n\nMap showing the location of BIG4 Ingenia Holidays Lake Conjola. Picture: Google\n\nAnother holiday maker said she heard the “Loudest bang and then children screaming”.\n\n“Everyone was like ‘what was that?’ We headed up to the pool area to see what had happened that’s when I saw a family being comforted.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“The barbecue was obliterated. On the table you could still see there butter and things planned for breakfast.\n\n“What looked to be the parents of one of the injured children was trying to calm one down. The ambulance crew was quick. It’s a pretty isolated spot but they got here in good time.”\n\nNSW Ambulance have confirmed that five people were treated on the scene for injuries.\n\nA man in his 30s was flown to Wollongong Hospital for facial injuries and is in a stable condition.\n\nThree of the injured were taken to Shoalhaven Memorial Hospital, including a woman and two children under the age of five.\n\nThe woman, who is in her 30s, is being treated for abdominal injuries and is in a stable condition, while the two children are being treated for minor injuries.\n\nPictures on the holiday park’s website show the barbecue area before the explosion. Picture: Supplied\n\nThe area was completely flattened by the explosion. Picture: Supplied\n\nThe barbecue area was reduced to rubble from the explosion, with damage to the neighbouring pool area as well.\n\nAmong the rubble, baby wipes, children’s toys, food and cooking utensils can be seen.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/hatred-albo-brutal-swipe-libs-010203574.html",
        "title": "‘Hatred’: Albo’s brutal swipe at Libs chaos",
        "publish_date": "2026-01-31T01:02:03Z",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese has taken a brutal swipe at the opposition, labelling them a “joke” and a party in “shambles” as the infighting continues.\n\nIn a press conference to announce a new $800m housing package in South Australia on Saturday, the Prime Minister was asked about the opposition and what the ending of the Coalition could mean for democracy.\n\n“They’re a shambles and they are focused on their hatred of each other,” Mr Albanese said. “We are focused on the Australian people, their needs and the national interest.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“You can’t fight for Australians if you are obsessed with fighting yourselves and that is what the former Coalition has become.”\n\nPrime Minister Anthony Albanese labelled the opposition a joke. Picture: NewsWire/ Kelly Barnes\n\nThe future of Liberal leader Sussan Ley is under pressure from the right wing of the party. Picture: NewsWire / Luis Enrique Ascui\n\nWhen pressed further about the possibility of facing former shadow treasurer Angus Taylor, who is rumoured to be readying for a challenge to Sussan Ley, Mr Albanese continued to take aim at those sitting across from him in parliament.\n\n“You had a funeral to farewell Katie Allen – who was not just respected in the Liberal Party but across the board – and a bunch of blokes sitting in a house somewhere in Melbourne plotting to knock off the first female leader of the Liberal Party,” he said.\n\n“This is beyond belief frankly”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Taylor and Andrew Hastie – the two possible contenders to challenge Ms Ley – met face-to-face at a house in Melbourne on Thursday, just a few hours before the memorial service for Dr Allen.\n\nAngus Taylor has emerged as the man most likely to mount a challenge to Sussan Ley. Picture: NewsWire / Luis Enrique Ascui\n\nAndrew Hastie, who had put his hand up, announced he would not challenge Ms Ley. Picture: NewsWire / Luis Enrique Ascui\n\nJust a day latr, Mr Hastie, the MP for Canning in Perth, announced he would not challenge Ms Ley for the party’s leadership.\n\n“Over the past few weeks there has been speculation about the future leadership of the Liberal Party of Australia,” Mr Hastie said in a statement released late on Friday afternoon.\n\n“I’ve previously stated that I would welcome the opportunity to serve my party and our country as leader of the Liberal Party.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“But having consulted with colleagues over the past week and respecting their honest feedback to me, it is clear that I do not have the support needed to become leader of the Liberal Party.\n\n“On this basis, I wish to make it clear I will not be contesting the leadership of the Liberal Party.”\n\nNewsWire understands this was done to clear the way for a run from Mr Taylor, which is not expected to be imminent.\n\nAndrew Hastie says he will not challenge Sussan Ley as opposition leader, while Angus Taylor had a cryptic message for the opposition leader. Picture: Newswire\n\nMeanwhile, Mr Taylor – who is in Ms Ley’s shadow cabinet as defence spokesman – posted a cryptic message as the rumours continued to swirl around who would lead the opposition.\n\nMr Taylor praised Mr Hastie as a “great asset” to the Liberal cause, but gave no indication of his own intentions.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Andrew Hastie is many things: a former SAS soldier, a loving father and husband, and a fierce intellect,” said in a post on X.\n\n“He is a patriot committed to tackling the big problems our country faces, and I share many of his views on reducing immigration, restoring cheap energy, reviving Australian industry, and rebuilding national pride.\n\n“An individual of his abilities and principles has much to contribute on the front lines of our fight for the promise of Australia and to ensure that our best days lie ahead.\n\n“My colleague and friend is a great asset to the Liberal cause, with formidable strengths and an unwavering commitment to serving our country.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMs Ley narrowly won the leadership ballot against Mr Taylor following Peter Dutton’s bruising 2025 election loss.\n\nParliament sits next week, but Mr Taylor is not expected to make a move before the Reserve Bank – which is expected to increase the official cash rate on Tuesday – announces its decision Tuesday.\n\nAnthony Albanese was in Adelaide to announce funding for 7000 new homes in South Australia. Picture: NewsWire/ Kelly Barnes\n\nMeanwhile, Mr Albanese announced almost 17,000 new homes will be built as part of the federal government commitment to build 100,000 new homes nationally for first-home buyers.\n\nThe $801.5m funding package, announced alongside SA Premier Peter Malinauskas, includes measures for 6877 places for first-home buyers mainly in northern Adelaide.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Albanese said getting into the housing market was “tough” and pointed to the need to increase supply in order to help young families achieve their goals of home ownership.\n\n“We’re determined to make it easier for young people and first-home buyers to achieve the dream of owning a home,” he said.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/support-kids-autism-delayed-pushback-163000116.html",
        "title": "No concern over delay to kids' autism program, says PM",
        "publish_date": "2026-01-31T00:20:00Z",
        "category": "finance",
        "authors": [],
        "text": "The delay of an early intervention program for children linked to National Disability Insurance Scheme costs isn't a mark of uncertainty, Anthony Albanese insists.\n\nState and territory leaders have agreed to help limit annual growth of the NDIS to six per cent in exchange for an extra $25 billion in Commonwealth funding for public hospitals over the next five years.\n\nHowever, a program to move children with mild to moderate levels of autism off the NDIS and into state-based programs has been delayed by several months to give jurisdictions more time to adjust to changes.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe $2 billion Thriving Kids program was due to begin in July but will now start in October and be fully implemented by early 2028, the prime minister said on Friday.\n\nAnthony Albanese has agreed to the states' request to delay the Thriving Kids scheme. (Bianca De Marchi/AAP PHOTOS)\n\n\"The states put to us the possibility of a short delay in the full implementation of Thriving Kids,\" he said in Sydney.\n\n\"We agreed that proposal was reasonable, that we get this right, and so it is a positive move.\"\n\nPressed on Saturday morning over whether the delay would add to uncertainty about the program, Mr Albanese rebuffed the suggestion.\n\n\"No, not at all,\" he told reporters in Adelaide.\n\n\"We're making sure we get it right. It'll be rolled out from this year and we'll be fully rolled out, fully implemented, on the 1st of January 2028.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"That's what good governments do. Good governments get the detail right.\"\n\nThe states say they will increase their share of contributions for the NDIS. (Mick Tsikas/AAP PHOTOS)\n\nState leaders had previously said they were blindsided by NDIS Minister Mark Butler's announcement of the Thriving Kids scheme in 2025 during a speech at the National Press Club.\n\nOpposition health spokeswoman Anne Ruston said the delay to Thriving Kids was concerning.\n\n\"Young Australians living with a disability and their families remain in ongoing uncertainty due to the complete lack of clarity and detail around the new Thriving Kids program,\" she said.\n\nACT Chief Minister Andrew Barr said jurisdictions would increase their share of contributions for the NDIS over the next five years.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Two billion dollars will be matched to deliver Thriving Kids as the first phase of foundational supports, with the Commonwealth providing $1.4 billion of its contribution to support states,\" he said.\n\nAndrew Barr says the states and territories will increase their share of contributions for the NDIS. (Mick Tsikas/AAP PHOTOS)\n\nDespite the extra $25 billion secured by the states in return for their co-operation on NDIS spending, Doctors Reform Society president Tim Woodruff said public hospital patients would keep languishing on wait lists.\n\n\"It's all about smoke and mirrors,\" he said on Saturday.\n\n\"Of course it's a record spend. Any new spending will be a record because our population is growing, it is ageing and demand is increasing.\n\n\"What we really want to know is whether this new spending increases the federal contribution up towards the 50 per cent level it was set at decades ago.\"",
        "source": "Yahoo"
    }
]