[
  {
    "url": "https://www.9news.com.au/national/australia-post-seeks-stamp-price-rise/f1b587f2-e8c8-45a7-9762-c420f2e5058a",
    "title": "Australia Post wants to raise letter stamp price",
    "publish_date": "Fri, 13 Feb 2026 00:40:33 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "A﻿ustralia Post is planning to lift stamp prices by 15 cents per letter from the middle of the year to offset losses.\n\nThe postal service announced today it was seeking approval from the Australian Competition and Consumer Commission (ACCC) to increase the basic postage rate from $1.70 to $1.85.\n\nThe price of concession stamps and seasonal greeting cards won't change, remaining at 60 cents and 65 cents respectively.\n\nAustralia Post is seeking to increase the cost of stamps to offset losses in its letters division. (Getty)\n\nAustralia Post says it has also offered further cost-of-living relief by increasing the number of concession stamps eligible customers can purchase, from 50 to 75 per year.\n\nFewer than 3 per cent of letters are sent by individuals, with the vast majority mailed by businesses and government agencies.\n\nThe average cost impact to Australian households of the proposed price rise to $1.85 will be less than $1 extra per year.\n\nAustralia Post's letters service has steeply declined and is now at levels recorded in the 1930s.\n\nIn the past financial year, volumes dropped a further 11.7 per cent (excluding election activities).\n\nEven with the contribution of elections, the letters service still reported a $230.4 million loss.\n\nAustralia Post group chief executive officer Paul Graham says despite the slump in demand for letters, the corporation was still delivering them to more addresses.\n\n\"As letter volumes continue to fall as customers increasingly take up digital options, Australia Post needs to ensure the Letters service remains sustainable now and into the future,\" he said.\n\n\"The proposed increase is one of the ways we are responsibly addressing our financial challenges so we can keep serving our customers and communities.\"\n\nNEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/ricotta-recalled-over-ecoli-fears/12b29247-0f6d-4d72-83ab-88514fa3f956",
    "title": "Popular ricotta pulled off shelves over potential contamination",
    "publish_date": "Fri, 13 Feb 2026 00:18:10 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "is being conducted of a popular ricotta product over fears of an E. coli\n\nLa Vera is conducting a recall of its ﻿500g Fresh Ricotta due to a potential E. coli contamination. The product is sold at independent retailers across\n\nProducts with the following date markings may be at risk of contamination:\n\nProducts with the following date markings may be at risk of contamination:",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/ivf-unaffordable-cost-of-living-crisis-exclusive/c6f1b3ac-086e-41d3-83ff-7dea9bbadfff",
    "title": "Katelyn and Joel's $50,000 fight for something many Aussies get for free",
    "publish_date": "Thu, 12 Feb 2026 18:43:27 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "E﻿xclusive: Katelyn Hughes, 29, and her husband Joel always wanted to be parents but didn't anticipate it would cost them $50,000 and counting.\n\nThey're among the one in six Australian couples affected by infertility, many of whom are going into debt to start a family or can't afford to try in the cost-of-living crisis.\n\nThe average total cost per standard cycle for In Vitro Fertilization (IVF) in Australia can range from $11,500 to $17,000﻿, according to Minerva Fertility.\n\nKatelyn Hughes, 29, has adenomyosis and endometriosis. She and husband Joel have spent $50,000 trying to start a family. (Supplied)\n\nMedicare rebates may apply to ﻿specific components but even then, IVF can be prohibitively expensive for some would-be parents.\n\nThe couple started IVF in 2021 and were floored by the cost.\n\n﻿\"We had just gotten married and we were really focused on trying to get into the housing market [but] all of our money was spent on IVF,\" Katelyn told nine.com.au.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nShe fell pregnant in 2023 on their ninth round of IVF﻿ but son Fletcher was stillborn at 26 weeks.\n\nThe heartbreaking loss only made the couple more determined to have another child.\n\nNow on their 15th round of IVF, ﻿﻿Katelyn and Joel have had to dip into their superannuation.\n\n\"There are so many more costs than just the direct IVF cost,\" she said.\n\n\"There's years of testing and trying, medications, mental health support.\"\n\nHaving to say goodbye to stillborn son Fletcher broke Katelyn's heart but made her more determined to continue IVF. (Supplied)\n\nKatelyn also had to drop down to part-time work for the flexibility to continue with IVF, slashing their income.\n\nThe Hugheses know continuing IVF will have a huge impact on their ﻿long-term finances and retirement plans but will do whatever it takes to have another baby.\n\nThey'd like to see more ﻿targeted investment in IVF to support Aussies dealing with infertility have children.\n\nIncreasing Medicare rebates, reducing out-of-pocket costs, and supporting more cycles could make a huge difference to couples already struggling with the cost of living.\n\n\"IVF isn't a lifestyle choice – for many, it's the only path to having a child,\" Katelyn said.\n\nRowan Berry, 33, and his wife Anastacia, 35, had to delay starting ﻿IVF for longer than they'd like due to the cost-of-living crisis.\n\nRowan Berry, 33, and his wife Anastacia, 35, had to delay starting ﻿IVF due to the cost-of-living crisis. (Supplied)\n\n\"Our rent has increased from $620 per week to $750 per week in the last couple of years,\" Rowan told nine.com.au.\n\n\"House prices to become unreasonable for anyone who is struggling to begin a family.\"\n\nGrocery costs are also through the roof, so it took the couple a while to save up for IVF.\n\nThey've been ﻿quoted up to $1000 for specialist appointments and $1200 for each IVF cycle in NSW.\n\n﻿﻿\"We only have the finances for one attempt but we will find a way to do more if we have to,\" Rowan said.﻿\n\nThey feel the cost is worth it after eight years of trying to start a family naturally and suffering two miscarriages.﻿\n\nREAD MORE: This surgical procedure is booming in Australia as cost of living bites\n\nAt 35, Anastacia is worried that time is running out for her and Rowan to start a family. (Supplied)\n\nJenna Adams, from South Australia, said ﻿the cost of IVF ruined her family financially.\n\nShe and her partner spent more than $50,000 on multiple cycles in the 2010s.\n\nThey had to access their superannuation and sell Adams' car to afford it and managed to have two daughters, now aged four and two.\n\nBecoming a mother has been one of the biggest joys of Adams' life but the cost was crippling.\n\n\"We still haven't been able to financially recover,\" she told nine.com.au.\n\n\"It left us with nothing left in savings and we've had to make voluntary contributions to our super to try and build it back up.\"\n\nGoing through multiple rounds of IVF also took a significant and lasting toll on her physical and mental health.﻿\n\nAdams would have loved to have more children﻿ but with the cost of living and the price of IVF, it just wasn't possible.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/sharked-spotted-stalking-dolphin-carcass-on-sydney-beach/6c589dbe-7395-4625-890a-87454ac77053",
    "title": "Shark spotted stalking carcass metres offshore of North Sydney beach",
    "publish_date": "Thu, 12 Feb 2026 08:45:39 +0000",
    "category": "sports",
    "authors": [
      "Feb"
    ],
    "text": "The sighting of the ﻿shark forced the closure of the\n\nbeach\n\n, with lifeguards immediately ordering swimmers out of the water.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/australia-covid-19-vaccine-astra-zeneca-blood-clot-cause/730c03ce-f908-4d0d-a7f8-781534429a85",
    "title": "Reason why COVID vaccine caused serious blood clots revealed",
    "publish_date": "Thu, 12 Feb 2026 03:54:57 +0000",
    "category": "lifestyle",
    "authors": [
      "Feb"
    ],
    "text": "The AstraZeneca vaccine was one of the two primarily used in Australia during the early stages of the\n\npandemic\n\n, but caused blood clots in about two to three people out of every 100,000 who received it.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/tradie-shortage-chippies-like-caitlyn-could-be-the-key-to-solving-our-housing-crisis/27a85e67-c1f6-43c0-80c7-5647e120f81e",
    "title": "Chippies like Caitlyn could be the key to solving our housing crisis",
    "publish_date": "Thu, 12 Feb 2026 02:37:42 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "When Caitlyn Goodman was growing up as one of four girls in her family, she never dreamed she would one day be building houses as a carpenter.\n\nThe prospect of becoming a female tradie just never occurred to her, she said.\n\nBut the signs were there, even from a young age.\n\n\"My dad was a fencer, and growing up, he taught me how to use power tools. I was always very drawn to it.\" Goodman, 22, said.\n\nCaitlyn Goodman is a third-year carpentry apprentice in Victoria. (Supplied Nine)\n\nDuring her final year of high school, Goodman worked at Bunnings in the timber yard.\n\n\"I was becoming very familiar with all the types of timbers and power tools. I was learning a lot,\" she said.\n\nAfter finishing her higher school certificate, Goodman briefly toyed with the idea of becoming a nurse, having also worked as a ward clerk, before deciding to follow her heart and become a carpenter.\n\n\"One day, I just said, Screw it. I'm just going do it, why not? Why can't I do it?\" Goodman said.\n\nWith the construction industry facing a critical shortage of workers, particularly in carpentry, getting apprentice job proved to be easy, especially after her dad put a call out to builders he knew, Goodman said.\n\n\"We got in contact with Chris, who is my boss now. He had an interview with me. He was really happy, and said, 'When can you start?'\" Goodman said.\n\nGoodman is now a third-year apprentice, helping build residential homes in the Greater Melbourne area.\n\nThe Housing Industry Association (HIA) says Australia desperately needs more people like her to have any hope of meeting Australia's ambitious construction targets.\n\nChippies top list of workers in demand\n\nAt the top of the \"short supply\" list are carpenters - the very trade Goodman is mastering.\n\nAccording to the HIA, the math of the National Housing Accord simply doesn't add up without a massive influx of new boots on the ground.\n\nUnder the Accord, the Federal Government has set a target to build 1.2 million homes over five years. But according to Mike Hermon, HIA Executive Director for Future Workforce, the industry is currently missing a vital piece of the puzzle.\n\n\"Workforce shortages remain one of the biggest constraints on increasing home building activity, with the nation needing an estimated 83,000 additional skilled workers across our key trades,\" Hermon said.\n\n\"Shortages across key residential construction trades, particularly carpentry, are limiting building capacity across the states. Builders across the country are telling us the same thing - demand for housing is there, but access to skilled labour is holding projects back.\"\n\nRecent HIA data reveals a sobering reality for the sector. A survey of small business members found that 67 percent of respondents are having trouble recruiting or retaining staff.\n\n\"If we do not train more apprentices now, the homes Australia needs simply will not be built,\" Hermon said.\n\n\"Every new home starts with an apprentice on site.\"\n\nFor Goodman, the reasons behind the shortage aren't a mystery. While she loves the reward of \"building someone's dream,\" she said the financial barriers for young people were steep.\n\n\"People start their apprenticeship, and then it's just not everything they want - like the pay,\" Goodman said. \"They don't want to stick around and bend over backwards for $16 an hour. Carpenters are one of the lowest-paying trades.\"\n\nWhile the government has introduced incentives like a $10,000 apprentice grant, Goodman said the fine print often excluded those who needed it most.\n\n\"You have to be living out of home [to get the full grant], but I can't afford to move out of home,\" she said. \"Rather than giving out grants and all that, I think, honestly, just increase the pay.\"\n\nNo looking back\n\nGoodman admits that stepping on site for the first time as an apprentice was daunting.\n\n\"I was really scared, honestly, starting out,\" she said.\n\n\"I'd heard quite a few stories of apprentices not being treated the greatest on site, which is really disheartening to even hear now.\"\n\nCaitlyn Goodman, 22, was named HIA's Victorian Apprentice of the year in 2025. (Supplied)\n\nHowever, those fears were quickly dispelled.\n\nGoodman said she found herself in a small, supportive team and was even working alongside a female chippie.\n\n\"She's made me feel a lot more comfortable working in the industry,\" Goodman said. \"I don't get treated differently, and I don't get treated with disrespect.\"\n\nGoodman is a staunch advocate for the trades, especially for other women.\n\n\"Every single time I tell people what I do, they go, 'Oh, really?' or they think I'm lying,\" she said.\n\n\"I tell other girls - why not? Just do it.\n\n\"I'm going to graduate and be able to actually save up to buy a house, rather than paying off student debt.\"\n\nTradie salaries by occupation\n\n﻿Electrician $95,000 – $115,000\n\nPlumber $85,000 – $100,000\n\nCarpenter $80,000 – $95,000\n\nPainter $80,000 – $90,000\n\nBricklayer$75,000 – $85,000\n\n(Source: Seek.com.au)\n\nDo you have a story? Contact reporter Emily McPherson at EMcPherson@nine.com.au",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/australia-first-home-buyer-loans/1fd19b39-e67f-42c2-b7d6-791c3e91e614",
    "title": "One state driving the biggest spike in first home buyer loans in years",
    "publish_date": "Thu, 12 Feb 2026 00:42:23 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "First home buyer loans in New South Wales grew by nearly 11 per cent, with\n\nWestern Australia\n\nand\n\nQueensland\n\nalso having rises of 9.8 per cent and 6.4 per cent respectively.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-13/winter-olympics-2026-daily-guide-scotty-james/106334738",
    "title": "Winter Olympics 2026 quick guide: What to watch",
    "publish_date": "Fri, 13 Feb 2026 02:46:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "Get the latest:\n\nWinter Olympics day six: Australia wins first gold as US great pipped in halfpipe\n\nStay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-13/snowboard-halfpipe-judging-2026-winter-olympics/106333290",
    "title": "How the judges will decide Scotty James's halfpipe fate",
    "publish_date": "Fri, 13 Feb 2026 02:10:32 +0000",
    "category": "sports",
    "authors": [],
    "text": "In the lead-up to one of the most hotly anticipated events at this year's Winter Olympics, Scotty James says winning a gold medal will not \"validate\" who he is as a snowboarder.\n\nBut it is the one thing that he does not have in his medal cabinet and, at 31 years old and in his fifth Olympics, this could be his final chance.\n\nGet the latest: Winter Olympics day six: Australia wins first gold as US great pipped in halfpipe Stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nThe men's snowboard halfpipe final is arguably one of the biggest ticket items in the entire Games and the eyes of the world will be fixed on this picturesque northern Italian valley.\n\nThe rumours are that everyone is about to throw down something incredible special.\n\nValentino Guseli says this competition could be anyone's. (Getty Images: Anadolu/Mine Kasapoglu)\n\n\"I think, for the first time in quite a long time in halfpipe, it almost could be anyone's day,\" Valentino Guseli said after the epic qualifying campaign.\n\n\"But Scotty's got some stuff that's pretty insane and pretty hard to beat.\n\nLoading...\n\n\"I know if I do my best stuff then I could potentially be up there, but yeah, I'll have to do some pretty good riding, I think.\n\n\"The Japanese guys have way more … I don't know.\n\n\"It's going to be crazy and it's hard to speculate on.\n\n\"But I think all you can do is watch and see what happens and enjoy the show.\"\n\nQualifying started 'like a final'. The actual final will be 'the greatest show on earth' Scotty James is the man to beat in the snowboard halfpipe at the 2026 Winter Olympics, but a stunning qualifying competition proves that the final is going to be on another level entirely.\n\nIf James has got something special planned for the final, he is not letting on just yet.\n\n\"I've learned over the years that my lips should never be looser than a wizard's sleeve when it comes to tricks in the halfpipe,\" he said earlier this week.\n\nIf qualifying proved anything it is that the field is absolutely stacked heading into the final.\n\nOne of the most remarkable series of runs ever to take place at an Olympic Games took place at the Livigno Snow Park on Wednesday night, which saw James claim the top spot heading into the final.\n\nIn Beijing it took two historic triple corks from the Japanese megastar Ayumu Hirano to take the gold ahead of James.\n\nEven then James was adamant that there was more to life in the pipe than triples and that his sublime technicality should be rewarded.\n\nScotty James knows he needs to bring his best to have a chance in the halfpipe final. (Getty Images: Ian MacNicol)\n\nIn part that's down to his height — it's far harder to complete a triple when you stand at 185 centimetres. Hirano is just 165cm tall.\n\nSo James has to think outside the box.\n\n\"My plan this year, regardless of the results, is to try and revolutionise halfpipe snowboarding in the way I would interpret it,\" he said earlier this week.\n\n\"It's obviously subjective, but I wanted to push it in the direction that made me excited to go up there and push it.\n\n\"I feel like I'm snowboarding the way I want to snowboard and, fortunately, being rewarded for that.\"\n\nSubjectivity is obviously key in this.\n\nAs with any judged sport, athletes can only do so much. It's the six judges that will ultimately determine James and Guseli's fate and those of all 12 finalists.\n\nAnd, under extraordinary pressure from both time and occasion, judges can make understandable mistakes.\n\nOne of the six judges for the halfpipe in Livigno is Slovenian Iztok Šumatić, who was head judge at the controversial slopestyle competition in Beijing, where a missed knee-grab was credited as a board grab and helped give American Max Parott gold.\n\nThe others are Great Britain's Gaz Wessman Vogan, Sweden's Fredrik Westman, Switzerland's Andrin Regli, Julien Haricot of France and Japan's Ryo Hashimoto.\n\nThe same six judges were in the booth for the World Cup event in Laax last month, where James won gold and Guseli bronze.\n\nJudges rule on execution and amplitude. (Getty Images: David Ramos)\n\nOverseeing those six is Australian Adam Begg.\n\nBegg has been in snowboarding for more than 30 years and got into judging after a severe injury kept him off the snow in 2000.\n\nHe first judged internationally in 2006 and has is now officiating in his third Winter Olympics.\n\nSpeaking to ABC Sport earlier this week, Begg outlined the key things the judges were looking for to score a run.\n\n\"With halfpipe, we base [scoring] off five major criteria, which is progression, amplitude, execution, variety and difficulty,\" he said.\n\n\"And then it's just a mix of them, so we're looking to make sure it's a well-rounded run.\n\n\"I guess for people at home, amplitude is an easy one to quantify because it's how big they go out of the halfpipe.\n\n\"And the other one that's really easy to see, if you're not experienced with the sport, is execution — so whether they put a hand down, fall over, grab, long or short. It's those sort of things that we try and look forward to discern between the runs.\n\n\"For us, difficulty comes in spins, and progression is whether it's been done before in the halfpipe or whether that combination links well.\"\n\nSo how is James going to catch the eyes of the judges?\n\nFor a start, he is pushing his ability to ride switch — with the non-dominant foot forward — and backside, with his back facing down the pipe.\n\nScotty James will no doubt attract a massive crowd for the snowboard halfpipe final. (Getty Images: Adam Pretty)\n\nHis winning run at the recent X Games, albeit in a much reduced field as many of the sport's best chose to stay in Europe to hone their skills, featured a switch backside 1440 into a backside 1440 — four complete spins.\n\nThose tricks had never been seen before in combination in the Aspen Superpipe.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Sometimes I feel I sound like a broken record when I talk about what's technical in the halfpipe and how I'm pushing it,\" James said.\n\n\"There's still only a handful of guys that are really doing switch backside riding.\n\n\"This year the majority of the field is doing two backside hits with three frontside hits, because that's the direction they're pushing.\n\n\"This Games, I'm doing two frontside hits with three backside hits. So that's how I interpret it to be more technical, more difficult, more demanding physically.\"\n\nAs to whether the judges will agree with James's sentiments, only time will tell.\n\nThe men's snowboard halfpipe final gets underway on Saturday morning at 7:05am AEDT.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-13/katie-holmes-pays-tribute-to-james-van-der-beek/106340686",
    "title": "Holmes pays tribute to Dawson's Creek co-star Van Der Beek in letter",
    "publish_date": "Fri, 13 Feb 2026 01:57:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Katie Holmes has shared a handwritten letter on social media expressing sorrow over the death of fellow actor James Van Der Beek and gratitude for his impact.\n\nVan Der Beek — who shot to fame in the late 1990s and early 2000s as Dawson Leery in the television series Dawson's Creek — died of colorectal cancer on Wednesday. He was 48.\n\nHolmes, who played Dawson's love interest Joey Potter, posted her tribute to Instagram.\n\n\"James,\" she wrote.\n\n\"Thank you. To share space with your imagination is sacred — breathing the same air in the land of make believe and trusting that each other's hearts are safe in their expression … these are some of the memories along with laughter, conversations about life, James Taylor songs — adventures of a unique youth …\"\n\nLoading Instagram content\n\nHolmes went on to highlight Van Der Beek's bravery, as well as his compassion, selflessness and strength.\n\n\"An appreciation for life and the action taken to live life with the integrity that life is art — creating a beautiful marriage, six loving children — the journey of a hero.\"\n\nHolmes said she is mourning the loss of her friend \"with a heart holding the reality of his absence and deep gratitude for his imprint on it\".\n\nShe informed his wife and children, she would be there for them always.\n\nJames Van Der Beek embraced his character with humour James Van Der Beek's death prompts wide-ranging tributes from co-stars and friends who have praised his kindness and humour.\n\nIn her caption, Holmes said she had formed these words with a heavy heart and that Van Der Beek's death was a lot to process.\n\nA GoFundMe page has been set up to raise funds for his wife, Kimberly, and his six children.\n\nAccording to the fundraising page, they face an uncertain future after doing everything they could to support Van Der Beek and provide for his care.\n\nThe fundraiser has attracted a huge response from fans and prominent donors, exceeding its $US1.5 million ($2.10 million) target.\n\nDawson's Creek was a hit teen drama that aired from 1998 to 2003, and followed the lives of a close-knit group of friends in the fictional town of Capeside. It currently streams on Stan.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-13/bangladesh-nationalist-party-wins-first-election-since-uprising/106338732",
    "title": "Former PM's son leads party to victory in post-uprising Bangladeshi election",
    "publish_date": "Fri, 13 Feb 2026 01:41:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Bangladesh Nationalist Party has won a landmark parliamentary election, according to local TV stations, securing a resounding mandate in a pivotal vote that is expected to restore political stability in the South Asian nation.\n\nThe BNP is led by top prime ministerial contender Tarique Rahman, the 60-year-old son of former prime minister Khaleda Zia and former president Ziaur Rahman.\n\nThe parliamentary election, held yesterday, was Bangladesh's first vote since the 2024 gen Z-driven uprising that toppled long-time premier Sheikh Hasina — who fled to live in exile in New Delhi, India.\n\nA clear outcome had been seen as crucial for stability in the Muslim-majority country of 175 million after months of deadly anti-Hasina unrest disrupted everyday life and hit major industries, including the apparel ‌sector in the world's second-largest garment exporter.\n\nVote counting continued long into the night across Bangladesh on Thursday. (Reuters: Mohammad Ponir Hossain)\n\nLocal TV stations showed BNP won an overwhelming two-thirds of the 300 seats in the \"Jatiya Sangsad\" or House of the Nation.\n\nShafiqur Rahman, head of the Islamist Jamaat-e-Islami party, conceded defeat, with his party-led alliance on just 68 seats.\n\nThe National Citizen Party (NCP), led by youth activists who were instrumental in toppling Hasina, and which was part of the Jamaat-led alliance, won just five of 30 seats it contested.\n\nAlongside the election, preliminary results of a referendum showed people voted in favour of reforming the constitution to protect it from future authoritarian rule.\n\nDubbed the \"July Charter\", the set of reforms was drafted after the 2024 uprising to establish good governance, democracy and social justice.\n\nVoters flocked to polling booths across Dhaka to vote in Bangladesh's 2026 election. (ABC News: Som Patidar)\n\nBNP leader Mr Rahman has pledged to recalibrate Bangladesh's international partnerships to attract investment without tying the country too closely to any single power, in contrast with Sheikh Hasina, who was seen as aligned with New Delhi.\n\nHe has also highlighted expanding financial aid for poor families, reducing reliance on garment exports by promoting industries such as toys and leather goods, and introducing a two‑term, 10‑year limit for prime ministers to deter autocratic tendencies.\n\nA victory regardless of the result\n\nTurnout appeared on track to exceed the 42 per cent recorded in the most recent election in 2024.\n\nLocal media reported that more than 60 per cent of registered voters were expected to have cast ballots.\n\nMore than 2,000 candidates — including many independents — were on the ballot, and at least 50 parties contested — a national record.\n\nAlthough many people on the streets had passionate views on their preferred candidates, the one common agreement was the need for a successful election to re-establish democracy.\n\nMohammatul Islam joined millions of other Bangladeshis casting their votes at the general election in Dhaka. (ABC News: Som Patidar)\n\nThe past three Bangladesh elections have been marred by corruption, allegations of vote-rigging and boycotts by opposition parties.\n\nDespite their political differences, people who spoke with the ABC said this election should be celebrated for heralding a new era for the country.\n\nNazmul Haque had not voted for the past three elections, but could not stop smiling while lining up at a polling booth on Thursday.\n\n\"I'm feeling great, so relaxed, that everything is so beautiful, and the atmosphere is so good,\" he said.\n\n\" All I can say is God bless Bangladesh. \"\n\nNazmul Haque returned to vote at Bangladesh's 2026 election after not casting a ballot in the previous three polls. (ABC News: Som Patidar)\n\nOn the streets of Bangladesh, polling check-in stations were adorned with balloons, glittery streamers and fairy lights.\n\nCoffee and biscuits were handed around as people laughed and celebrated the monumental day.\n\nMore than 4 million young voters were also expected to cast their ballot for the first time, including many who participated in the 2024 protests, like Chowdhury Maria Tabassaum.\n\n\"I was a part of [the] 2024 student movement and I'm really proud that now I can practise my rights and my right to vote,\" she said.\n\n\" I put my life at risk in that movement and that's why I am participating in this vote today, and that's why this election is important for me. \"\n\nThe election was a memorable one for first-time voter Chowdhury Maria Tabassaum. (ABC News: Som Patidar)\n\nThe right to vote, without fear of repercussion or violence, was not something many Bangladeshis could imagine just two years ago.\n\nNow, regardless of the outcome of the election, people on the streets say they already have reason to celebrate.\n\nA political lineage\n\nThe election marked a remarkable reversal of fortune for prime minister-elect Tarique Rahman, whose father was a leading independence figure from 1977 to 1981 until he was assassinated.\n\nMr Rahman left the country in 2008 saying he needed medical treatment after being released from detention under a military‑backed caretaker administration.\n\nHe had been held after a crackdown on corruption.\n\nTarique Rahman, whose mother died last year, has pledged to diversify Bangladesh's industries, attract investment and increase support for the poor. (Reuters)\n\nUnder Sheikh Hasina's rule, Mr Rahman became a central target of corruption cases and was convicted in absentia in several of them.\n\nIn 2018, he was also sentenced to life in prison over a 2004 grenade attack on a rally Hasina was addressing that killed and wounded many.\n\nHe has always denied the allegations against him, calling them politically motivated, and has since been acquitted in all cases following Hasina's ouster.\n\nHe returned home to a hero's welcome in December after the youth‑driven uprising ended Hasina's rule.\n\nABC/wires",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-13/organisations-branch-out-help-mens-mental-health-rural-nsw/106332542",
    "title": "A heart transplant reminded Keith how important his mates were",
    "publish_date": "Fri, 13 Feb 2026 00:58:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Farmer Keith Cowen was alone on his remote New South Wales property when he suffered a heart attack eight years ago.\n\nIt was five hours before he got from his Weethalle farm to an operating table in Wagga Wagga to have a stent put in.\n\nThe delay in treatment led to a second diagnosis, heart failure.\n\n\"I would have to give up farming, I could no longer work and I was basically preparing myself for the end — I was quite determined to pursue having a heart transplant,\" Mr Cowen said.\n\nThree years ago, he matched a donor.\n\nBut he needed more help to be eligible.\n\nLoading...\n\n\"To be able to have a heart transplant, I had to come up with a list of people who would help me through the four months that I lived in Sydney — you can't be left on your own,\" Mr Cowen said.\n\nAfter starting a Facebook group with his closest friends asking for help, he had four months worth of assistance within two days.\n\nHis transplant was successful, but it got him thinking about how many men in regional communities might not be so well-supported in a time of need.\n\n\"I thought, how lucky am I to have such close connections, and how sad is it that so many men don't and they can't even come up with a couple of weeks of support,\" Mr Cowen said.\n\n\" That was kind of heartbreaking to think there are men out there like that. \"\n\nDetermined to ensure other men could foster the same kind of friendships and connections, he started a Men's Table in Griffith, where he now resides.\n\nKeith Cowen says loneliness is a struggle for a lot of men in regional areas. (ABC Riverina: Nicola Ceccato)\n\nThe group is in line with the national not-for-profit organisation The Men's Table, which consists of a group of men coming together once a month to have intentional discussions about life over dinner.\n\nHe also reached out to Grab Life by the Balls, a charity that organises social events to improve male mental health and wellbeing through mateship, and recently started a Griffith group.\n\n\"What helps men more than anything else is to have three to five close friends they can call on when they're in trouble,\" he said.\n\nCombating loneliness\n\nAccording to Ending Loneliness Together, a group of organisations addressing loneliness in Australia, men are 1.5 times more likely to experience persistent social isolation than women.\n\nCarl Nelms says social connection is important. (Supplied: Carl Nelms)\n\nLead psychologist and founder of Blokes Psychology, Carl Nelms, said casual mateship networks like Grab Life by the Balls could be quite successful in helping men.\n\n\"If there's a connection there, there's camaraderie as well,\" he said.\n\n\" It can enable people to just live a happier and better-quality life if they're feeling socially connected and supported. \"\n\nMr Nelms said a lack of targeted services for men and understanding about how the male brain worked were barriers to accessing support.\n\n\"For many men, they're still largely expected to or expect themselves to be the provider — so if they're taking time out of their schedule to seek support themselves, unfortunately, things have to be pretty dire to do so,\" Mr Nelms said.\n\nGrab Life by the Balls founder Sam Parker said the issues inspired him to start his charity.\n\nCharity for change\n\nSam Parker is passionate about supporting men and combating male loneliness. (Supplied: Sam Parker)\n\nOriginally from the Leeton area in the western Riverina, Mr Parker said growing up in regional NSW shaped his understanding of how mateship was key to social connection.\n\nThe Men's Table and Grab Life by the Balls have made their way to the Riverina. (ABC Riverina: Nicola Ceccato)\n\n\"Work with dad having beers over the barbed wire fence … or in the shearing shed,\" Mr Parker said.\n\n\"I think that instilled this blokey way of engaging people — having a casual chat and staying socially connected.\"\n\nNow in its ninth year, the charity has grown to include 25 groups from across Queensland, the ACT and regional NSW.\n\n\"I wanted to give back and do something for the community and certainly improve the outcomes in men's mental health in regional Australia,\" Mr Cowen said.\n\n\"It's been wonderful.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-13/mystery-barge-seen-struggling-off-bali/106338134",
    "title": "Mystery barge washed up in Torres Strait last seen 'struggling' off Bali",
    "publish_date": "Fri, 13 Feb 2026 00:33:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "One of the last known people to have seen a foreign-owned barge at sea before it washed up on a remote Australian island says it was being towed by a boat not suited to the job.\n\nThe 100-metre barge Nelly 112 ground to a halt on Athikho Poji, a rocky islet in the Torres Strait, on January 26.\n\nThe Nelly 112 could have drifted up to 2,000 kilometres from Indonesian waters. (Supplied)\n\nA retired commercial skipper with almost four decades of maritime industry experience said he saw the barge off the Balinese coast nine days before it washed up near Badu Island.\n\nAustralian Noel Gaunt said he came within 100 metres of Nelly 112 on January 17 while on a fishing boat offshore from Amed, in northern Bali.\n\nHe said the barge was being towed by a boat he did not believe was suitable for the job.\n\n\"It was not a tug … it was a [towing vessel] around 50 to 60-feet trying to pull this massive barge [which would be] well in excess of a hundred [tonnes],\" Mr Gaunt said.\n\n\" It's like towing a five-trailer road train in the Pilbara with a Hilux. \"\n\nMr Gaunt, originally from Nelson Bay in regional New South Wales, relocated to Bali last November after being diagnosed with a terminal illness.\n\nNoel Gaunt now lives in Bali after working for 38 years in the Australian maritime industry. (Supplied: Noel Gaunt)\n\nHe said it appeared those towing the barge were trying to keep it in a channel of the Banda Sea to avoid it entering the Timor Sea.\n\n\"It would've caused havoc to go through there because [the towing vessel] wasn't in command of the barge,\" he said.\n\n\"It was struggling every metre that it took.\"\n\nMr Gaunt said he did not know what happened to the barge as it proceeded east.\n\nHowever, that region of Indonesia was hit with severe weather in the days that followed.\n\n\"My guess is they cut it loose to protect the towing vessel and [in that] situation a skipper would,\" Mr Gaunt said.\n\n\" It's the safety of life at sea. You've got to look after yourself [and] he would've had crew. \"\n\nMr Gaunt said it was plausible currents had caused the barge to drift 2,000 kilometres over nine days toward the Torres Strait.\n\nFinders can't call 'keepers'\n\nA salvage team has been contracted to return the barge to Indonesia \"as soon as practicable\", according to Maritime Safety Queensland (MSQ).\n\nMaritime Safety Queensland says it won't disclose the name of the barge owner due to privacy reasons. (Supplied)\n\nBadu Island traditional owner Edmund Tamwoy had hoped he could claim the barge given it washed up on his country.\n\nBut Dr Rosemary Gibson from the University of Queensland's marine and shipping law unit said the concept of \"finders keepers\" did not exist under maritime law.\n\n\"Where you do have an owner and the vessel is registered somewhere we can trace it,\" she said.\n\n\" There's nothing to stop them from purchasing the vessel but they wouldn't just be able to tie a rope around it and declare it theirs. \"\n\nDr Rosemary Gibson says the mystery barge can't simply be claimed. (Supplied: University of Queensland)\n\nMr Tamwoy has since told the ABC he was trying to contact the barge owner to make an offer to buy it.\n\nDr Gibson cautioned against making a bid without properly costing the salvage, repairs and on-going maintenance.\n\n\"There are administrative hurdles that you then have to go through,\" she said.\n\n\"You'd be wanting to factor all those things in as to whether it's actually worthwhile.\"\n\nNo timeline has been given as to when authorised inspectors would travel to Badu Island. (Supplied)\n\nMSQ said it had arranged to inspect the barge.\n\nHowever, a spokesman gave no timeline as to when its inspectors would travel to Badu Island.\n\nMSQ said it was unable to disclose the name of the barge owner for privacy reasons.\n\nThe ABC has contacted an Indonesian shipping company which launched Nelly 112 for comment.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-13/winter-olympics-snowboard-cross-emotional-toll-cam-bolton/106338726",
    "title": "Snowboard cross heartbreak a long time in the making",
    "publish_date": "Fri, 13 Feb 2026 00:00:58 +0000",
    "category": "sports",
    "authors": [],
    "text": "Things have simply not gone to plan for Australia's men's snowboard cross riders at the 2026 Winter Olympic Games.\n\nAnd to be honest how could any of the men competing be focused when one of their teammates was recovering from a broken neck suffered just days before?\n\nThe desperate toll of Aussie injuries at the Winter Games Games-ending injuries to Cam Bolton and Misaki Vaughan have emphasised the dangers of winter sport as the Australian team copes with issues early in the Milano Cortina Games.\n\nLosing Cam Bolton put the entire squad on the back foot, and there they remained, with none of the three riders making it past the round of 16 on day six in Livigno.\n\nAnd although all three riders tried to play it down, the trials and tribulations all have faced in recent weeks clearly played a role in their respective performances, with Adam Lambert particularly emotional when speaking about his good friend.\n\n\"I never want to see a teammate, let alone a friend, go down with such a terrible injury,\" a teary Lambert said after his race.\n\n\"He's playing it down but it's hard to watch somebody who you've looked up to your whole life go out like that, and then have to get airlifted to hospital.\n\n\"Yeah, it affected me a little bit. I tried to not let it affect me, but …\" he said, before trailing off.\n\nSnowboard cross is one of many dangerous sports at the Winter Games. (Getty Images: Hannah Peters)\n\nLambert had come into this Olympics in career-best form.\n\nNot only was Lambert the FIS World Cup series leader but had claimed a first ever career World Cup medal in Dongbeiya after eight years of trying.\n\nLoading...\n\n\"Fourth place in the first heat is definitely not the level of riding that I've been showing this year,\" Lambert said.\n\n\"It wasn't my greatest performance. Pretty disappointed overall, obviously, but my training over the last few days definitely indicated I was better than that.\"\n\nSo much has been made of the injuries that have torn through the Australian team to start this Olympics, but none have been as badly affected as the snowboard cross team.\n\nGet the latest: Winter Olympics day six: Australia wins first gold as US great pipped in halfpipe Stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nIt was only in the weeks before the Games that former world champion Belle Brockhoff, who broke her back in March last year and finished in fourth at the last Olympics, was finally forced to retire from the sport as a result of her injuries.\n\nBrockhoff had contested the mixed team event in Beijing with Bolton, finishing ninth.\n\nNow both were facing lengthy recovery periods.\n\n'They were the ones that believed, not me'\n\nEven one of the athletes who did make the start line in Livigno, Jarryd Hughes, only just made it.\n\nThe 30-year-old suffered a horror foot injury 10 months ago at Mont Sainte Anne when his navicular bone splintered, threatening his career.\n\nHe can barely walk and only had four days on snow before qualifying for the Games, and the toll it is taking on him is severe.\n\nAfter his seeding runs earlier in the day he was left doubled over, pain etched across his face as clearly as the gouges in the snow on course.\n\nJarryd Hughes arguably shouldn't be competing thanks to a badly broken foot. (Getty Images: Hannah Peters)\n\n\"Oh, astronomical,\" Hughes said of the impact his injury has had on him.\n\n\"I mean … I didn't think I would make these Games, let alone be on snow at this point.\n\n\"Between our medical staff and everybody who's helped out — because there's a massive crew to get me back to this point — they were the ones that believed, not me.\"\n\nHughes, who confirmed that this Olympics would be his last competition, said getting to the start line was an achievement in itself.\n\n\"It's been nice to be able to do it because the last 10 months has been kind of hell,\" he said.\n\n\"I couldn't walk for four months, and then trying to get back on a snowboard and try and compete at the top level.\n\n\"It's nice to be here and compete at my fourth Olympics. I didn't think I would come to one Olympics, most people didn't think I was good enough to do it when I was younger. So to now be standing here at my fourth it's pretty incredible.\"\n\n'Bittersweet' debut\n\nJames Johnstone faced a steep learning curve after being added late to the squad. (Getty Images: Patrick Smith)\n\nThe emotional toll that Bolton's injury had on the squad was in evidence even before the competition got underway.\n\nJimmy Johnstone was only told on Tuesday that he would be competing, his obvious excitement and enthusiasm tempered by the disappointment and concern he held for his role model.\n\n\"Obviously it's bittersweet with everything that's happened with Cam,\" the 21-year-old said on Wednesday.\n\n\"Cam, for me, has been a massive role model and inspiration for me in my snowboard cross career.\n\n\"He's been a really good teammate to me the last year or so since I came onto the World Cup team, so to see him go out like that it's a real shame and I'm gutted for him.\"\n\nJames Johnstone led his heat at one point, before being overrun. (Getty Images: Adam Pretty)\n\nAfter the race, as the snow fell and the wind howled, turning what had been a warm day into a chilly one, Johnstone said he had been in touch with Bolton.\n\n\"He earned this spot and he was going to compete, and, in my opinion, he was a medal chance,\" Johnstone said.\n\n\"So it's devastating for him.\n\n\"But it's an opportunity for me, and he sent me a message and I was texting back and forth with him and I said to him 'mate, this is for you and I'll be doing it for you and I'll leave it all out there'.\n\n\"He gave me a few words of encouragement which was really nice.\n\n\"I hope he's doing alright, from what I hear he's doing OK. It's a crazy moment and it's such a shame.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe 21-year-old may well be blessed to be at the Games but he is clearly no slouch.\n\nIn 2023 he was crowned junior world champion in Italy at Passo San Pellegrino and has had 15 starts on the World Cup circuit with a career high of 24th.\n\nThis year he has mostly been competing on the Europa Cup circuit where he sits fifth overall.\n\nSince the last World Cup event in Dongbeiya, Johnstone has competed six times in France and Austria so is certainly race sharp.\n\nBut his lack of practise on the Olympic course showed as he finished 30th-fastest in the seeding round.\n\nAlthough he raced to the front at the start of his heat he was unable to finish it off and went out of the competition.\n\nPrior to getting on course for the first qualification run Johnstone had only ever been down it three times — far too few to get a proper read on conditions or the character of the course, especially for someone so young and relatively inexperienced.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-13/flower-farmers-heatwave-victoria-losses-valentines-day/106329998",
    "title": "Scorched flower farms face Valentine's Day without blooms",
    "publish_date": "Thu, 12 Feb 2026 23:57:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "Natalie Thomson cannot bring herself to photograph what last month's heatwave did to her micro flower farm in Nyah West.\n\nFive years into developing her floral \"passion project\", she had been ready for the heat of summer with drip irrigation and a mix of varieties carefully selected for the hot, dry climate\n\nBut neither she nor her plants were prepared for the record-breaking temperatures experienced last month.\n\n\"I'd never experienced a 48-degree day myself,\" she said.\n\nNatalie Thomson's flower farm started as a COVID lockdown project. (Supplied: Natalie Thomson)\n\n\"Zinnias … were probably one of the most resilient types of fresh flowers to grow in the Mallee during summer and it actually bowled quite a few of those plants over.\"\n\nThe heat-induced destruction has forced Ms Thomson to cut back her entire half-acre crop and start again.\n\nAs a result, she has nothing to offer for one of the industry's peak occasions: Valentine's Day.\n\nNatalie Thomson recorded this heat damage in early January, before the record-breaking heatwave. (Supplied: Natalie Thomson)\n\n\"I haven't even been able to photograph [the damaged crop] because it makes me feel sad,\" she said.\n\n\" This year I'm not going to be able to have anything to put out into the world. \"\n\nA flower bed at Natalie Thomson's Drift Sand Blooms property in December. (Supplied: Natalie Thomson)\n\nLast summer was so challenging, she opted not to advertise for weddings this year as she was uncertain what she could deliver.\n\n\"I do watch in envy down in areas where the climate's better, so that can be a bit disheartening,\" she said.\n\n\"But the core of all this is so that fresh flowers are still available in some of the more challenging parts of the state to grow them.\"\n\nNatalie Thomson says her dahlias and zinnias have been particularly affected. (Supplied: Drift Sand Blooms)\n\nGreen shoots are appearing, and Ms Thomson is optimistic she will see a \"second season\" by Mother's Day.\n\nWhen flowers are fried\n\nLike other farming industries, flower growers and traders are used to taking hits from the weather — but this year's scorching summer has hurt some more than others.\n\nIn Katunga, north of Shepparton, Sarah Stammers was left questioning the future of her business after her crop was wiped out in the heat.\n\nIn the south-west between Camperdown and Cobden, Rachael Rendell said sustained temperatures in the 40s had caused her to lose income from a major order.\n\n\"The florists came back … to say that probably about half of it didn't last for a couple of days and that it all wilted,\" she said.\n\n\"This season just seems to have had a run of those days so I think that's where it's really affected us.\"\n\nShe has extra orders this Valentine's Day, and is confident she will meet them after additional maintenance at the farm.\n\nRachael Rendell has seen mild summers, floods, and scorching temperatures. (Supplied: Rachael Rendell)\n\nChris Paquin-Bowden is also ready for a particularly busy Valentine's Day on his micro flower farm, 730m above sea level at Lyonville, south of Daylesford.\n\n\"We're actually one of the coldest flower farms in the country,\" he said.\n\n\"We've got lots of old pines around us that's kind of helped with the hot winds, as well as blocking out the hottest part of the sun in the late afternoon.\"\n\nChris Paquin-Bowden says his farm is lucky due to its location and climate. (Supplied: Fleurs de Lyonville)\n\nEven so, his team had to take extra measures to beat the heat on January 27.\n\n\"We were up at the crack of dawn and just picked like mad,\" he said.\n\nValentine's Day must go on\n\nAs a sales and procurement director for a major wholesaler, Ryan Musson has a bird's eye view of cut flower supply.\n\nHe has seen a patchwork of localised effects from this season's hot temperatures, reducing availability of certain outdoor-grown varieties like sunflowers, strawflowers, achillea, snapdragons, and hydrangea.\n\nRyan Musson says Valentine's Day is second only to Mother's Day for flower orders. (Supplied: Fleurs de Lyonville)\n\nHe said even growers who did not lose their crops could have had their plans disrupted by above-average temperatures.\n\n\"If they were growing a specific crop for Valentine's Day it might have come in a couple of weeks earlier, [even] if it wasn't impacted quality-wise,\" he said.\n\nDespite this, he dic not anticipate problems filling the triple volume of orders for the occasion.\n\nRyan Musson says the Australian wildflower supply has also suffered from drought. (Supplied: Wafex)\n\n\"There will be some crops that are not around this Valentine's Day that maybe some florists or the public are used to seeing,\" he said.\n\n\"But there'll certainly be a large variety of other locally grown flowers … to substitute for any of the issues we've seen.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-13/winter-olympics-2026-milano-cortina-medal-tally/106339814",
    "title": "Medal tally: Australia ahead of China and Canada after first gold",
    "publish_date": "Thu, 12 Feb 2026 23:02:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia now features on the medal tally for the 2026 Winter Olympics.\n\nCooper Woods's gold in the men's moguls overnight saw Australia move from non-factor to 14th on the official Milano Cortina tally, ahead of snow-covered Canada and powerhouse China.\n\nThe Canadians and Chinese have more overall medals, with seven and four respectively, but are both waiting for their first gold of the Games, leaving them behind Australia.\n\nHere is the full tally after six days of competition.\n\n1. Norway — 7 gold, 2 silver, 5 bronze\n\nNorway has won five medals (two gold and three bronze) in cross-country skiing, one of each colour in speed skating, a gold and silver in ski jumping, gold and bronze in biathlon, while Birk Ruud and Jens Luraas Oftebro nabbed golds in slopestyle skiing and nordic combined.\n\n2. Italy — 6 gold, 3 silver, 8 bronze\n\nThe host nation has more total medals than any team, split across a slew of events.\n\nThe six golds came in women's super-G alpine skiing, men's and women's doubles luge, the short-track speed skating mixed team relay, and the women's 3,000m and 5,000m speed skating (both to Francesca Lollobrigida).\n\n3. USA — 4 gold, 7 silver, 3 bronze\n\nBreezy Johnson won the women's downhill. (Getty Images: NurPhoto/Andrzej Iwanczuk)\n\nThe Americans picked up gold — which immediately broke — in women's downhill skiing thanks to Breezy Johnson and Liz Lemley capitalising on Jakara Anthony's stumble.\n\nThe US also showed off their skating brilliance with gold in the team event figure skating and Jordan Stolz won the men's 1,000m speed skating.\n\nTheir 10 minor medals in moguls, slopestyle, super-G, cross-country skiing, curling, ice dance, luge and snowboard halfpipe keep them ahead of their fellow quadruple-gold winners.\n\n4. Germany — 4 gold, 3 silver, 2 bronze\n\nThe Germans have dominated with five medals in the luge, winning the men's and women's singles and the team relay, picking up silver and bronze in the women's and men's doubles too.\n\nPhilipp Raimund also won gold in the men's normal hill ski-jumping, while the women's alpine skiing crew picked up two silvers in individual and team downhill skiing.\n\nThey also took bronze in the mixed biathlon relay.\n\n5. Sweden — 4 gold, 3 silver, 1 bronze\n\nSeven of Sweden's eight medals at Milano Cortina have come in the cross-country skiing, with three gold, three silver and one bronze.\n\nThe other gold came in the mixed doubles curling.\n\n6. Switzerland — 4 gold, 1 silver, 2 bronze\n\nSwitzerland's Franjo von Allmen is an alpine skiing superstar. (AP: Rebecca Blackwell)\n\nAlpine skier Franjo von Allmen has done some heavy lifting for the Swiss in Italy, with three golds in the men's downhill, men's super-G and the team event.\n\nIn the team event and super-G, von Allmen was joined by compatriots on the podium.\n\nMathilde Gremaud won the team's other gold in the women's free-ski slopestyle, while Gregor Deschwanden took bronze in men's normal hill ski-jumping.\n\n7. Austria — 3 gold, 6 silver, 3 bronze\n\nParallel giant slalom gold medallist Benjamin Karl is comfortable in the cold. (Getty Images: David Ramos)\n\nAustria has 12 medals — more than Germany, Sweden and Switzerland — but remain behind them on the tally because of fewer gold finishes.\n\nAustria's three wins have come in women's team combined alpine skiing, men's snowboard cross and men's parallel giant slalom snowboarding.\n\n8. France — 3 gold, 4 silver, 1 bronze\n\nFrance won a dramatic gold in the ice-dance figure skating, as well as two biathlon golds.\n\n9. Netherlands — 3 gold, 3 silver\n\nAll six of the Dutch team's medals have come in the speed skating — two golds in short track, and gold in the women's 1,000m, as well as silvers in men's and women's 1,000m, and women's 5,000m.\n\n10. Japan — 2 gold, 2 silver, 6 bronze\n\nJapan's two gold medals came in the women's and men's snowboard big air courtesy of Kokomo Murase and Kira Kimura.\n\n11. South Korea — 1 gold, 1 silver, 2 bronze\n\nSeventeen-year-old Gaon Choi won the Koreans' only gold of the Games thus far with a stunning run to deny Chloe Kim a third straight women's snowboard halfpipe title.\n\nThe minor medals came in men's parallel giant slalom, women's snowboard big air and men's 1,000m short track speed skating.\n\n12. Czechia — 1 gold, 1 silver\n\nZuzana Maderova won the women's parallel giant slalom, while Metodej Jilek was second in the men's 5,000m speed skating.\n\n12. Slovenia — 1 gold, 1 silver\n\nBoth Slovenian medals came in the ski jumping — gold in the mixed team event and silver to Nika Prevc in the women's normal hill.\n\n14. Australia — 1 gold\n\nThere are three gold medallists in this picture — Alyssa Camplin, Cooper Woods and Jessica Fox — but only one from 2026. (AAP: Dan Himbrechts)\n\nWe thought it might have happened a little earlier, but it was Cooper Woods's stunning gold in the men's moguls that ultimately put Australia on the board in the 2026 Winter Olympic Games.\n\nWill there be more to come?",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-13/former-tottenham-manager-ange-postecoglou-on-club-issues/106339490",
    "title": "Postecoglou says Tottenham 'not a big club' as Spurs sack successor",
    "publish_date": "Thu, 12 Feb 2026 22:26:02 +0000",
    "category": "sports",
    "authors": [],
    "text": "Tottenham Hotspur are \"not a big club\" because of their policy in the transfer market, former manager Ange Postecoglou has said in the wake of the London club's sacking of head coach Thomas Frank on Wednesday.\n\nFrank replaced Postecoglou after the Australian was sacked despite winning the Europa League last season, but struggled and left with his side in 16th position in the Premier League, five ‌points above the relegation zone.\n\n\"When you look at their expenditure and particularly their wages structure, they're not a big club,\" Postecoglou told The Overlap's Stick to Football podcast.\n\n\"I saw that because ‌when we were trying to sign players we weren't in the market for those players.\"\n\nPostecoglou took Tottenham to fifth in his first season in ‌charge but they failed to build on that and finished ‌17th in his second campaign, despite winning the Europa League to end a 17-year wait for silverware.\n\nHe said the club's reluctance to compete with the Premier League's big hitters in the transfer market was holding it back.\n\n\"I think they didn't realise that ‌to actually win you've got to take some risks,\" he said.\n\n\"I felt like Tottenham as a club were saying 'we're one of the big boys', and the reality is I don't think they are.\"\n\nFrank ‌was Tottenham's fifth full-time manager ‌since the popular Mauricio Pochettino was sacked in 2019, months after leading them to the Champions ‌League final.\n\nOne of the major gripes of the club's fan base is they fail to land their transfer targets.\n\nFrank had hoped to ‌sign Nottingham Forest's Morgan Gibbs-White last summer but he stayed at Forest while Arsenal beat Tottenham to the signing of Eberechi Eze.\n\nPostecoglou, who was sacked by Nottingham Forest after 39 days in charge earlier this season, suggests Frank did not realise the type of structure he was walking into.\n\n\"There's no guarantee whichever manager you bring in. They've had world-class managers there and they ‌haven't had success. ‌And for what reason?\" he said.\n\n\"Thomas is walking in and what's his objective? What's the club's objective? Did Thomas know he was walking into that? I don't know.\"\n\nReuters",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/goodfood/sydney-eating-out/woolly-bay-hotel-20260213-p5o247.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Woolly Bay Hotel",
    "publish_date": "Fri, 13 Feb 2026 13:51:29 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\n1 / 4 The Woolly Bay Hotel in Woolloomooloo. Jared Lyons 2 / 4 The downstairs restaurant at The Woolly Bay Hotel. Jared Lyons 3 / 4 Arturo’s Rooftop. Jared Lyons 4 / 4 The rooftop has city skyline views. Jared Lyons Previous Slide Next Slide\n\nPub dining$$$$\n\nLaundy Hotels has more than 20 venues in its growing pub portfolio, and this sprawling harbourside destination is one of the group’s glitzier offerings. The ground-level bistro isn’t bad, but you really want to book a table for crudo at Arturo’s rooftop bar. Striped cushions, terracotta and frilly umbrellas mean the place looks more like Amalfi than Woolloomooloo.\n\nBest for: Sinking into a rooftop couch with something Aperol-based.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/goodfood/sydney-eating-out/the-lord-nelson-brewery-hotel-20260213-p5o23q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Lord Nelson Brewery Hotel",
    "publish_date": "Fri, 13 Feb 2026 13:24:51 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nA cosy sandstone pub where the beer is brewed onsite.\n\n1 / 5 The Lord Nelson hotel in The Rocks. Supplied 2 / 5 The Lord Nelson is Australia’s oldest brewery hotel. Supplied 3 / 5 The ground-level bar. Wolter Peeters 4 / 5 The Aussie beef pie. Wolter Peeters 5 / 5 Steak and chips. Wolter Peeters Previous Slide Next Slide\n\nPub dining$$$$\n\nPraise be, The Lord. Built in 1836, the grand-but-cosy sandstone establishment is Sydney’s oldest continuously licensed hotel. It brews its own beer (the Trafalgar English Bitter is our favourite for a session), oysters are shucked to order, and the pie with mushy peas is a must-have for any visiting tourists. Bonus points for being pokies-free for the past four decades.\n\nBest for: A pork pie and a pint of bitter.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/afl/giants-fear-losing-key-onballer-to-acl-injury-20260213-p5o235.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Fearing the worst’: Green goes down with suspected ACL",
    "publish_date": "Fri, 13 Feb 2026 12:36:53 +1100",
    "category": "sports",
    "authors": [
      "Danny Russell"
    ],
    "text": "The pre-season injury curse has struck at Greater Western Sydney following news this morning that prime onballer Tom Green has been sent for scans for a suspected ACL.\n\nThe Giants released a statement to say that Green hurt his knee during an intra-club practice match on Friday morning.\n\nThe Giants fear Tom Green has torn his ACL. Credit: via Getty Images\n\n“We are hoping for the best, but fearing for the worst regarding a suspected ACL injury,” GWS footy boss Jason McCartney said.\n\nGreen’s knee buckled during a tackle, and he was helped from the ground by trainers.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/men-allegedly-run-from-police-after-major-cannabis-raid-in-victoria-20260213-p5o23e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Men allegedly run from police after major cannabis raid in Victoria",
    "publish_date": "Fri, 13 Feb 2026 12:26:43 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/afl/afls-full-star-power-on-display-at-origin-training-20260213-p5o23b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL's full star power on display at Origin training",
    "publish_date": "Fri, 13 Feb 2026 12:16:41 +1100",
    "category": "sports",
    "authors": [],
    "text": "AFL's full star power on display at Origin training\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/property/news/el-jannah-co-founders-put-11-million-sydney-estate-on-the-market-20260209-p5o0rv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "El Jannah co-founders put $11 million Sydney estate on the market",
    "publish_date": "Fri, 13 Feb 2026 11:55:05 +1100",
    "category": "finance",
    "authors": [
      "Kristy Johnson"
    ],
    "text": "Investing in chicken has proven fruitful for Andre and Carole Estephan, co-founders of the Lebanese charcoal chicken chain El Jannah.\n\nThey have just put their multimillion-dollar Dural estate on the market, and it was left to local sources to confirm a price guide of $11 million, as Louis Stapleton of McGrath Castle Hill declined to comment on any aspect of the listing or buyer’s identity.\n\nAndre and Carole Estephan, co-founders of El Jannah, have put their Dural estate on the market. Credit:\n\nThe Lebanese immigrants opened their first charcoal chicken store in Granville, in western Sydney, in 1998 and had five locations across western Sydney by 2020. They recently chose an investor in US investment giant General Atlantic, an asset manager of some $180 billion.\n\nThe Estephans bought the six-bedroom, eight-bathroom home from Jacqueline Dominello for $4.6 million in 2014, records show. It came with an outdoor pool, tennis court and giant backyard chess set, and over the years, the Estephans updated the property.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Fri, 13 Feb 2026 11:46:53 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this gallery for later\n\nAdd galleries to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/a-board-game-classic-at-the-comedy-theatre-with-a-serving-of-slapstick-20260211-p5o1d0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "For one night only, this gig in Thornbury felt like the centre of the music universe",
    "publish_date": "Fri, 13 Feb 2026 11:39:47 +1100",
    "category": "entertainment",
    "authors": [
      "Marcus Teague",
      "Cameron Woodhead"
    ],
    "text": "Advertisement\n\n★★★★★ CultureLive reviewsMelbourne live reviews For one night only, this gig in Thornbury felt like the centre of the music universe Marcus Teague and Cameron Woodhead Updated February 13, 2026 — 11:39am ,first published February 11, 2026 — 1:35pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nKey points MUSIC: Remarkably, Geese live up to the hype at their Thornbury gig\n\nTHEATRE: Cluedo at the Comedy Theatre is a zany mystery with a dose of nostalgia\n\nMUSIC\n\nGeese ★★★★★\n\nThe Croxton, February 12 An hour and a half before buzzy New York four-piece Geese are due on stage, there’s two lines of people on the footpath outside: one waiting to get in, the other sheepishly holding up signs for tickets: “Friend didn’t show up? I’ll buy your ticket,” reads one. Another: “This Goose has no tix”. Frontman Cameron Winter performs with Geese at The Croxton on Thursday, February 12. Martin Philbey Gooses they were. Ever since 23-year-old frontman Cameron Winter’s wonky, astonishing solo LP Heavy Metal grew from late-2024 curiosity into revered modern classic, the cult of Cameron has turbocharged Geese’s trajectory. When Winter’s Tuesday night solo piano show at The Forum went on sale in August 2025, it sold out instantly. In September, Geese released their third LP, the knotty Getting Killed, to rapturous reception. It means here now, on their debut Australian tour for Laneway Festival, both Winter and Geese could have played at venues three times the size, many times over. For one night only in High Street in Thornbury, it feels like being at the molten centre of the music universe. Shockingly, Geese live up to the hype. Augmented by keyboard player Sam Revaz, Geese demonstrate they’re far more than their famous frontman’s backing band, with a dissonant clinic of sizzling indie rock, laced with prog, blues, punk, folk and anything else ever made with guitars. Somehow, nothing’s ornamental, no one slacks off.\n\nAdvertisement\n\nFrom the opening slow burn of Husbands, the rammed crowd yell every word of Winter’s knack for self-flagellation: “I’m falling apart”, “I’ve been hit by the bus of life”, “Baby, you can change and still choose me”. They blast through all of Getting Killed and a couple of songs from 3D Country (2023), including an unhinged 2122, inspiring the first circle pit of the night. Geese are the most exciting new band, and a damn marvel to see. Martin Philbey There’s a wild vibrancy to Geese live that just isn’t present on the airtight audio of their records. New chordal passages emerge as guitarist Emily Green and drummer Max Bassin lead odd, telekinetic choices – where Winter was his own wry agent of chaos at Tuesday’s intimate solo show, tonight he’s the steely, charismatic fulcrum around which Geese expands and contracts. Cobra, Au Pays du Cocaine and Taxes are gorgeous, given a spectral heft in this quasi-religious setting, while 100 Horses and the set-closing barnstormers, Long Island City Here I Come and Trinidad put the crowd on spin cycle. The rumours are true: Geese are the most exciting new band, and a damn marvel to see. You’re a goose if you missed it.\n\nReviewed by Marcus Teague\n\nAdvertisement\n\nTHEATRE\n\nCluedo ★★★\n\nComedy Theatre, until March 15 Every generation from the Boomers down knows Cluedo. Editions of the game have been around since 1949, and kids tend to learn what a murder mystery is by playing it – well before they’re introduced to Agatha Christie. The usual suspects ham it up in Cluedo. Eddie Jim Childhood nostalgia for the franchise undergirds this commercial comedy. It adapts Jonathan Lynn’s 1985 film Clue (a box office flop that developed a cult following) and a talented cast embraces the zaniness of a show that’s feather-light on suspense and plot but slathered with mildly diverting drollery. Six usual suspects are invited to an English country house under the assumed names of characters from the game – Professor Plum (David James), Miss Scarlett (Olivia Deeble), Mrs Peacock (Genevieve Lemon), Colonel Mustard (Adam Murphy), Mrs White (Rachael Beck) and Reverend Green (Laurence Boxhall).\n\nAdvertisement\n\nThey’re greeted by the butler Wadsworth (Grant Piro), French maid Yvette (Lib Campbell) and a dour knife-wielding Cook (Octavia Barron-Martin). When their elusive host Mr Boddy (Joshua Monaghan) appears, it’s only for long enough to reveal sinister designs before adding to the body count. What follows is a chaotic hunt for the killer(s) that gets serially interrupted by yet more potential victims, and features a blend of ridiculous sight gags, exaggerated caricature, inane banter and comforting in-jokes, and tightly choreographed physical humour with strong elements of revolving-door farce. Cluedo is cosy, well-turned commercial entertainment. Eddie Jim Each actor confects moments in the spotlight. They all have fun playing with genre stereotype, though it’s Piro’s butler who acts as a kind of MC and gives the most versatile (and ludicrous) performance, with Boxhall’s neurotic, jelly-limbed slapstick not far behind. Production values are high, the set and costume design on par with the style of murder mystery theatre – think The Mousetrap – that Cluedo merrily lampoons.\n\nAdvertisement\n\nRelated Article Melbourne live reviews Tradition and modernity collide in this story of loneliness I’d like to see a push towards more diverse casting in shows of this ilk. The play’s nominal setting in 1940s England hardly calls for historical accuracy or naturalism when it’s based on a game played by everyone, and the familiarity Cluedo trades on might have even broader appeal if it better reflected contemporary Australian audiences. That said, Cluedo isn’t envelope-pushing stuff. Nor is it “a killer night out” as billboards claim. No, it’s undemanding comedy – a cosy, well-turned commercial entertainment that doesn’t outstay its welcome.\n\nReviewed by Cameron Woodhead The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/a-line-in-the-snow-why-the-ukrainian-athlete-was-banned-and-others-were-not-20260212-p5o1xf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A line in the snow: Why the Ukrainian athlete was banned and others were not",
    "publish_date": "Fri, 13 Feb 2026 11:30:00 +1100",
    "category": "sports",
    "authors": [
      "Jake Niall"
    ],
    "text": "Milan: The disqualification of Ukrainian Vladyslav Heraskevych for displaying on his helmet images of Ukrainian athletes killed in the Russian war places him in the unofficial hall of fame for Olympic dissent, alongside American sprinters Tommy Smith and John Carlos for their black power salute at Mexico City in 1968.\n\nUnlike Smith and Carlos, who were given short shrift by the hard line IOC and expelled from the Olympics with scant due process, the Ukrainian skeleton pilot was offered choices by this more compassionate iteration of the IOC.\n\nDisqualified Ukrainian athlete Vladyslav Heraskevych. Credit: AP\n\nHe would be permitted to wear the tribute helmet after he finished his runs and when facing the media afterwards and in practice. But the IOC and his sport’s governing body drew a line in the snow on him wearing it in competition.\n\nThe Ukrainian would not bend. In a sport that involves hurtling downhill at 130 km/h head-first, Heraskevych, as per Margaret Thatcher, was not for turning. He would exercise his right to be a one-man memorial.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/you-guys-can-t-score-me-low-how-the-boy-from-merimbula-became-olympic-champion-20260213-p5o1y4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘You guys can’t score me low’: How the boy from Merimbula became Olympic champion",
    "publish_date": "Fri, 13 Feb 2026 11:30:00 +1100",
    "category": "sports",
    "authors": [
      "Billie Eder",
      "Vince Rugari"
    ],
    "text": "Qualifying: fire in the belly In Olympic moguls, there is a field of 30 athletes, and two initial stages of qualifying. In the first, the top 10 go through to the finals, held the next day. The rest have to go again, and in that second run, the bottom 10 of the remaining 20 are eliminated. Woods came 15th on his first attempt with a score of 73.67. His family’s reaction was disappointment; not in him, but how the judges assessed his performance, though he later revealed he not only shared their view, but that it motivated him. So the next day, after a check-in with his sports psychiatrist, he came out breathing fire, putting down a vastly-improved 80.46 - the best score by any competitor in the second round of qualifiers, and the second-best from the entire field to that point.\n\n“I was a bit pissed off at the judges from the day before,” Woods said. “I was pretty fired up. I was going out there with vengeance. I was like, ‘I’m leaving nothing on the table. You guys can’t score me low.’ “I was in the gate with my coach, and there were probably a couple of explicit words just before we dropped in to get [me] really fired up.” Suddenly, confidence was flowing. Final one: pressure makes diamonds But Woods knew he had to up the ante to mix it with the medal contenders.\n\nThere are two jumps in moguls, each positioned between all the bumpy snow; in his qualifiers, he performed a back full and an off-axis 720 grab, but he felt that wasn’t going to be enough for the finals. Not only did he plan to go faster, but he wanted to add an extra degree of difficulty to his top jump. “Originally heading into the first final, we were going to go back to the qualification two run, because we scored so well. Then we had a couple of opportunities in finals training, and I just wasn’t missing,” he said. “I was like, ‘Let’s go all in. We’re at the Olympics. Let’s do it.’”\n\nThat meant adding an extra 360-degree spin to the back full, turning it into what’s called a back double full. In the first final, only eight of the 20 skiers progress for a shot at the podium. From being middle of the road on Wednesday, Woods scored a stunning 83.60 - the best of the round, meaning he would be last to jump in the decisive run. “I didn’t actually realise that I was the top qualifier of that round. It was only until I started putting my skis on that my coach told me,” he said. “Then I kind of freaked out a little bit.” Final two: all on the line\n\nWith his Olympic dreams on the line, Woods was locked in. The plan was simple: rinse and repeat. “I kept reminding myself that it is a pleasure to drop last,” he said. “I’ve never dropped last in my career, and I was dropping last behind some serious heavy hitters. I just need to relax up there, got a good coach, he kept me dialled in. I was pretty bloody nervous … [but] I knew what I had to do.” While he was waiting for his turn, for the first time - and only because he was feeling so good about himself - Woods allowed his coach to let him in on what the seven other competitors were doing, and how they were scoring. He even saw some of it for himself. “There’s a game plan,” he said.\n\n“We have so many awesome staff that are videoing and analysing other people … They were pretty straight up on what I needed to do and I needed to trust them and believe in that. I heard there was another 83 that got scored when I was up top and I was like, ‘Oh my goodness.’ It’s a big mountain to get a score like that … the coach that I had up top, he was like, ‘Stay disciplined. Do the same thing.’ “It worked out.” The score to beat for gold was 83.71, from Canadian veteran Mikael Kingsbury, widely considered one of the greatest moguls skiers of all time, who went just before him, the seventh of the eight still in contention. This was his final Olympics, and after winning gold in 2018 and silver in 2022 in this event, he was aiming to finish as champion again. And it looked like he might have done enough … until Woods dropped in.\n\nHe produced the same score, 83.71. In those situations, the tiebreaker is the turns score, or how the panel of judges assesses how they handled skiing on the moguls, and how smoothly and straight they moved. That was the difference. Woods’ turn score was 48.4, while Kingsbury’s was 47.7 – so he won gold, upsetting one of the sport’s true GOATs in the most high-pressure way imaginable, with the last run of an Olympic final. “He kind of ticked all the boxes,” said teammate Jackson Harvey. “He jumped really well, execution on the jumps was close to perfect and his skiing was very composed.”\n\nLoading What got him over the line was his precision and attention to detail. “Just the overall cleanliness of it,” said teammate Matt Graham, who lifted Woods in the air when the final scores were revealed. “He connected the dots, it was seamless. Landed the top air really well and just skied out, didn’t make a mistake … whereas Mick made a little mistake in the middle, and then I think they were both pretty similar in time.” The Winter Olympic Games is broadcast on the 9Network, 9Now and Stan Sport.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/angus-taylor-elected-new-liberal-party-leader-after-spill-motion-midday-news-bulletin-13-february-2026/n5ywyr6pg",
    "title": "Angus Taylor elected new Liberal Party leader after spill motion | Midday News Bulletin 13 February 2026",
    "publish_date": "Fri, 13 Feb 2026 01:07:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nAngus Taylor elected new leader of the Liberal Party, after winning a spill motion\n\nAdvocates call for urgent action on Indigenous deaths in custody\n\nAustralia's Kookaburras secure their second win of the FIH Pro League Hobart block\n\nAngus Taylor has replaced Sussan Ley as the leader of the opposition after a Liberal Party leadership spill motion saw Mr Taylor secure a decisive 34-17 majority.\n\nJane Hume emerged as the winner of the deputy leadership ballot, winning against incumbent Ted O'Brien.\n\nIt's a new leadership team, but Angus Taylor and Jane Hume have both been ministers in Coalition governments.\n\nIn his first post on social media after the vote, Mr Taylor says he's honoured to lead the party.\n\n---\n\nSussan Ley has announced she is quitting politics after she was toppled as leader of the Liberal party.\n\nHer resignation will trigger a by-election in her seat of Farrer, New South Wales.\n\nAddressing a party still facing scrutiny over the way it treats women, she said she is grateful she had the opportunity to be the Liberal Party's first female leader.\n\n\"When something ends in sadness, don't dwell on the disappointment. Be grateful that you had it at all. So today I want to express gratitude to the Liberal Party that I have belonged to and loved for more than half of my adult life, to the party room that elected me as their leader nine months ago, and to the Parliament of Australia that has been the most extraordinary workplace for 25 years.\"\n\n---\n\nThe group representing 80 Aboriginal community-controlled representative organisations says local networks are key to Closing the Gap.\n\nOf the 19 Closing the Gap targets, four are on track to be completed, with a further six improving.\n\nIn his annual Closing the Gap speech to parliament, Anthony Albanese says the federal government is determined to achieve the targets.\n\nHe has announced extra funding for services like the 24-hour Indigenous crisis support hotline 13YARN.\n\nThe deputy co-covenor of Coalition of Peaks, Scott Wilson, says the support is welcome and the effort to improve outcomes must continue.\n\n\"We welcome the further investments that were announced that by the prime minister in the House of Reps in employment, food security and access to mental health services. They are not abstract policy areas. They go directly to whether our people can live with dignity, stability and hope.\"\n\n---\n\nThe Aboriginal Legal Service in New South Wales and the ACT is calling for more action on Indigenous deaths in custody.\n\nNadine Miles, from the Aboriginal Legal Service in New South Wales and the ACT, says data shows more Indigenous deaths in custody have been recorded this year, on top of last year's record-high number.\n\nAboriginal people now make up over a third of adults in New South Wales prisons.\n\nMs Miles says the high incarceration rate and tough-on-crime policies are diverting the focus from strategies like prevention and investing in frontline and local Aboriginal services.\n\n---\n\nThe powerful reach of radio is being celebrated on World Radio Day.\n\nOne broadcaster who loves the medium is Sagar Mehrotra who has spent the past 22 years of his career at Indian Link Radio.\n\nHe told SBS Hindi, radio is even more powerful today because of the use of the internet which enables content to reach even more people through digital platforms.\n\n\"Radio is a product that can reach to millions and gazillions. TV, you can't have it in your car, TV, you can't have it in while in the air. But radio is something that if you have the slightest internet connection these days, you have the reach. You have that facility not just to listen but to interact, TV doesn't give you that.\"\n\n---\n\nTo sport and in hockey, Australia's Kookaburras have secured their second win of the FIH Pro League Hobart block against Germany, defeating the visitors 3–0 in Tasmania.\n\nIt was a disciplined start from Australia, who absorbed early German pressure before building momentum through strong defensive structure and controlled possession.\n\nWith back-to-back wins on home soil, the Kookaburras now turn their attention to a Friday night clash against Pakistan.",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/live-blog/liberal-party-leadership-spill-sussan-ley-angus-taylor/myjm5rtw9",
    "title": "Follow live: Angus Taylor speaks after becoming new Liberal leader",
    "publish_date": "Thu, 12 Feb 2026 20:18:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Angus Taylor is criticising Labor, saying the government \"has undermined our standard of living, and has failed to protect our way of life\".\n\nHe makes references to the rising cost of living and the Bondi Beach terror attack as examples of Labor's shortcomings.\n\nPivoting to his own plan, the new Liberal leader says the party's priority is restoring the standard of living.\n\n\"As Liberals, we are for lower inflation, lower interest rates, and lower taxes,\" he said.\n\nHe goes on to say he will fight Labor's \"bad\" taxes — \"taxes on homes, taxes on our children's future\".\n\nTaylor also indicated the Liberals oppose net zero and high levels of immigration, while ensuring defence is properly funded.\n\n\"My message to Anthony Albanese is this: We will fight every bad tax, and every reckless spending policy that drives up inflation and keeps interest rates higher for longer.\"\n\n\"The Liberal Party is under new leadership, and with that leadership will come change, because our country needs change for the better.\"\n\n— Cameron Carr",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-cooper-woods-wins-gold-at-milano-cortina-olympics/i7vsnond5",
    "title": "'Something you dream of': Cooper Woods claims gold, Australia's first medal at Milano Cortina Winter Olympics",
    "publish_date": "Thu, 12 Feb 2026 20:14:47 +0000",
    "category": "sports",
    "authors": [],
    "text": "Cooper Woods has stunned himself as well as the moguls world by coming from nowhere to win gold, claiming Australia's first medal of the Milano Cortina Winter Olympics.\n\nThe 25-year-old had never even won a World Cup event and didn't advance through the first qualification in the top 10.\n\nBut Woods remarkably rose to the occasion.\n\nHe topped the second qualification round on Thursday morning, then shocked the field to also gain the number one ranking for the final, meaning he came out of the gates last.\n\nAll-time greats Mikaël Kingsbury of Canada and Japan's Ikuma Horishima were the skiers to beat, and when Woods' score lit up, it was the same as Kingsbury — 83.71 — but the Australian had the higher turns score, giving him the gold.\n\nREAD MORE In pictures: Twin flames and message of unity open Milano Cortina Winter Olympics\n\nFinishing sixth in Beijing in his debut Olympics, Woods had had a lean 2025-26 World Cup season and had only been on the podium once in his career back in 2024.\n\n\"This season, I've struggled with a lot of self-belief — I've had such a good year of training but not competing and what a time to get it dialled and sorted,\" said Woods, who grew up in Pambula Beach on NSW's far south coast.\n\n\"There's something when there's so much pressure where you can just let it all go and embrace it.\n\n\"Happened in Beijing, too, where I was, I got nothing to lose — let's have it.\"\n\n'An absolute journey'\n\nHe said being the new Olympic champion hadn't really sunk in.\n\nMikaël Kingsbury of Canada and Japan's Ikuma Horishima were the skiers to beat, but the Australian had the higher turns score. Source: SIPA USA / Hu Chao\n\n\"It's something you dream of, day in, day out, as a kid, through the hard days, through the good days,\" he said.\n\n\"It's an absolute journey, and a lot of people don't get to be in this position.\n\n\"But you know what? I'm very proud of the hard work and the sacrifice and the moments that I've shared with people around the world and more importantly, my family.\n\n\"I don't spend a lot of time back home in Australia, we don't have a lot of snow, so it's everyone's medal, not just mine.\"\n\nAustralia had three men advance to the top eight medal round — Woods, Matt Graham and debutant Jackson Harvey. Graham placed fifth and Harvey eighth.\n\nWoods' triumph is Australia's third gold medal in the moguls after successes by Dale Begg-Smith the last time the Games were in Italy, Turin 2006, and Jakara Anthony in Beijing four years ago.\n\nIt is Australia's seventh Winter Olympic gold overall.\n\nWoods and his teammates still have the dual moguls, which have been added to the Olympic program in Milano Cortina.\n\nBut that wouldn't dampen his plans to celebrate with his family and friends, who've travelled from Australia before Saturday's event.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/pat-is-living-in-a-dangerous-and-run-down-home-then-their-rent-went-up/etu3vn4b8",
    "title": "Pat is living in a 'dangerous' and run-down home. They've been hit with a rent increase",
    "publish_date": "Thu, 12 Feb 2026 18:45:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Pat — not their real name — received a rental increase from their real estate agent, they couldn't believe it.\n\nThe Sydney house they share with three others has leaks in the roof, several broken doors, a washing machine with defunct plumbing — meaning the household needs to use a laundromat — as well as what Pat describes as \"large-scale\" damage to the home's foundation.\n\n\"We had a couple of tiles collapse earlier in the year and it took a month to get it fixed up,\" Pat told SBS News.\n\n\"When the plumber came in, he was like, 'This is large-scale damage to the property and it's dangerous. I don't like you guys using this bathroom and this shower because there's a danger you'll just fall through'.\"\n\n\"That was a bit scary to hear,\" they said. \"But nothing's really been fixed. It's pretty dire.\"\n\nPat says the foundation of their rental is dangerous and has water damage, including black mould. Still they faced a rental increase. Source: Supplied\n\nWhen Pat and their housemates were notified of a $70-a-week rental increase, they decided to end the lease.\n\n\"Our response to the rent increase would have been different if the house had been cared for.\"\n\nNow, they're worried about finding a new rental to move into. Despite all housemates working full-time, Pat says they're all still struggling to manage rent in Australia's most expensive rental market.\n\n\"It's not the most extreme rent increase I've ever experienced, but it's tough at the moment,\" they said. \"It feels pretty disheartening.\"\n\nPat said they had fears that challenging the rent increase would backfire.\n\n\"I feel like if we say we feel the rent increase is unfair because of the lack of care shown to the home, I'm worried they're going to kick us out or say that we're difficult tenants to the next place we try and rent.\"\n\nFaced with a rental increase in a \"dangerous\" run-down home, Pat is looking for somewhere else to live. But even with a full-time job, they're worried about how they'll afford it. Source: Supplied\n\nRental affordability hits record low\n\nPat's experience reflects a broader trend unfolding across the country.\n\nThe cost of renting in Australia has risen at more than double the pace of wages over the past five years, pushing rental affordability to record lows.\n\nNew analysis by property research firm Cotality found national rents rose 43.9 per cent in the five years to September 2025, compared with wage growth of 17.5 per cent over the same period.\n\nNew analysis by property research firm Cotality found national rents rose 43.9 per cent in the five years to September 2025, compared with wage growth of 17.5 per cent over the same period. Source: SBS News\n\nAs a result, rental households are now spending an average 33.4 per cent of their pre-tax income on rent — the highest level on record. That compares with a decade average of 29.2 per cent and a recent low of 26.2 per cent in the September quarter of 2020.\n\nHousing is generally considered affordable when renters spend no more than 30 per cent of their income on rent.\n\nThe widening gap reflects persistently low vacancy rates, shrinking household sizes, and a lack of new housing supply coming online, Cotality said.\n\nWestern Australia hit hardest\n\nWA recorded the sharpest rental growth in the nation, with rents climbing 66 per cent over five years, while wages rose just 18.5 per cent.\n\n\"Nowhere is the pressure more evident than in Western Australia, where rents have climbed by around two-thirds in just five years,\" Cotality research director Tim Lawless said.\n\n\"Even with wages growing a little faster than the national average, they have come nowhere near keeping up with housing costs in that state.\"\n\nWA recorded the sharpest rental growth in the nation, with rents climbing 66 per cent over five years, while wages rose just 18.5 per cent. Source: SBS News\n\nThe ACT was the only market where rent and wage growth were close to aligned, with rents rising 18.5 per cent and wages increasing 17.8 per cent over the five years to September 2025.\n\n\"In the ACT, income growth has managed to track rental growth more closely, which has helped contain the deterioration in affordability compared with other parts of the country,\" Lawless said.\n\nA bleak outlook\n\nCotality's analysis shows rental growth has been accelerating since mid-2025, with demand continuing to outstrip supply.\n\n\"With vacancy rates still around record lows in many markets and new housing completions running below what is needed to meet population growth, it is hard to see rents materially easing in the near term,\" Lawless said.\n\n\"Unless wage growth accelerates meaningfully, or we see a step change in rental supply, the risk is that affordability will deteriorate further for lower-income households in particular.\"\n\nHe said measures to boost housing supply — including more build-to-rent developments, incentives for private investment, and planning reforms to allow greater density in well-located areas — would be critical to easing pressure on renters.\n\n\"Closing the gap between rent and income growth will require a coordinated effort across governments, industry and investors,\" he said.\n\n\"The sooner we can bring more supply to market, the sooner renters will start to see some relief.\"\n\nFor Pat, that outlook offers little reassurance.\n\nDespite having a secure full-time job and a stable income, Pat says it's still \"really difficult\" to find somewhere to live in Sydney.\n\n\"If you're single and you're trying to find somewhere to live, that's a big part of your income. It's a substantial part of my pay each week,\" they said, adding that each move has pushed them further away from the city.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/jimmy-lais-death-sentence-japans-takaichi-takes-on-china-the-bulging-olympic-controversy/ceaay1r0d",
    "title": "Jimmy Lai’s ‘death’ sentence, Japan’s Takaichi takes on China & the bulging Olympic controversy",
    "publish_date": "Thu, 12 Feb 2026 07:05:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/amp-ceo-alexis-george-on-results-super-changes-and-female-leadership/1shzygtje",
    "title": "AMP CEO Alexis George on results, super changes and female leadership",
    "publish_date": "Thu, 12 Feb 2026 06:42:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/latest-report-on-closing-the-gap-targets-not-a-story-of-failure-says-pm/jfrqxb8d9",
    "title": "Latest report on Closing the Gap targets not a story of 'failure', says PM",
    "publish_date": "Thu, 12 Feb 2026 05:45:09 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nEvery year, the federal government releases data on what are known as Closing the Gap targets.\n\nThe Prime Minister, Anthony Albanese, says they're a set of goals agreed on between state and federal governments, and the Indigenous organisation Coalition of Peaks, to improve the lives of First Nations Australians.\n\n“You have the right to a full and equal place in our nation and our future. Unburdened by discrimination or disadvantage. Empowered by opportunity and security. That is the test - and the purpose - of Closing the Gap.”\n\nThere are 19 Gap targets in total.\n\n“The Closing the Gap targets are a measure of our national progress - and there is real progress. Four targets are on track. And based on progress to date, later this year we expect confirmation that the target of 95 per cent of Aboriginal and Torres Strait Islander children enrolled in preschool has been achieved. A further six targets are improving. And that number is based on the national average.”\n\nThe PM says there are also four areas where progress has stalled, or going backwards: namely youth incarceration, child removal, early development, and suicide.\n\n“The most urgent is suicide. Suicide shatters families, it tears apart communities. So often amidst the grief, loved ones return to the heartbreaking question: how did it come to this? Compared to non-Indigenous Australians, Aboriginal and Torres Strait Islander people are two and a half times more likely to die by suicide. “\n\nThe figures on First Nations involvement in the justice system are also especially troubling.\n\nFirst Nations children are 27 times more like ly to be in youth detention than their non-Indigenous peers and 10 times more likely to be in out-of-home care.\n\nFor Catherine Liddle, from the national Indigenous organisation for children SNAICC, it's no surprise that young people feature so heavily in the report.\n\n“I think today's report reinforces what SNAICC has always known and what I know as deputy convener is that Closing the Gap starts with our children. The story of children was at the heart of the tabling of the report today. And when you think about all the conditions that our children need to be thriving, they were mentioned in that report.”\n\nThe government already hopes the appointment of a permanent Indigenous children's commissioner will have a positive impact here.\n\nBut their approach has already come under heavy criticism, with Independent Senator Lidia Thorpe saying $230 million was recently funnelled to Northern Territory police rather than to community-led solutions.\n\nMs Thorpe says communities must keep the pressure on the Minister for Indigenous Affairs to move beyond rhetoric and deliver material results.\n\n“I only spoke to an elder yesterday who reeled off the number of reports and recommendations in her 50 years of working in youth justice and child protection, and she said, we are sick of it. Our people are dying. And I echo her sentiments because that Commissioner's role needs to have teeth.”\n\nMeanwhile, in New South Wales alone, the number of Indigenous people in jail is higher than ever before.\n\nNumbers from the New South Wales Bureau of Crime Statistics and Research show First Nations people represent more than a third of the state's prison population - the highest number and proportion on record - despite making up three per cent of the general population.\n\nThe Indigenous Affairs Minister, Malarndirri McCarthy, says it's proved a challenge to address incarceration and other justice issues because of the different legal frameworks and policies in systems around the country.\n\nBut she says she remains keen to make progress by working with First Nations communities.\n\n“We must do it in collaboration with the Aboriginal and Torres Strait Islander community across Australia, and that is through the Coalition of Peaks. That is why we have the Joint Council twice a year to look at some of the structural and systemic change that has to occur. But also in terms of doing it partnership to see the changes for First Nations people.”\n\nIn the end, Anthony Albanese maintains the latest Closing the Gap figures are not a bad news story.\n\n“We are now five years away from most of the target deadlines. We are clear about where there is more to do. We must also guard against talk of failure, because talk of failure dismisses the aspirations and achievements of Indigenous Australians. It ignores the leaders and communities who are changing lives. Failure is a word for those who have stopped trying - or given up listening.”\n\nScott Wilson from the Coalition of Peaks agrees.\n\nHe says the announcements on boosting health funding to Aboriginal health organisations, mental health services, and even funding to remote stores to help keep food fresh are all good initiatives.\n\nBut he says the government must commit to putting its money where its mouth is.\n\n“We also need to be honest. Investments like the ones announced today must be backed up by ongoing sustainable funding. Our organisations need certainty to plan, to employ people and retain staff, and to deliver lasting change - not just survive from one funding round to the other.”\n\nFor culturally appropriate Indigenous support call 13 YARN.. a 24 hour national telephone helpline on 13 92 76 which provides support across a range of issues including mental health. https://www.13yarn.org.au/\n\nOr call Lifeline 13 11 14\n\n1800 RESPECT (1800 737 732)\n\nMen's Referral Service 1300 766 491",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/angus-taylor-launches-leadership-bid/iby8avx5a",
    "title": "Angus Taylor launches leadership bid",
    "publish_date": "Thu, 12 Feb 2026 05:34:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nAngus Taylor has officially resigned his front bench role as Shadow Minister for Defence to challenge for the Liberal leadership, ending months of speculation surrounding Sussan Ley’s position.\n\nMs Ley took to social media ((Instagram and X)), leaning into the Liberal Party’s tradition of three-line slogans, posting: \"We will take the pressure off families, fix the budget, and keep Australia safe.\"\n\nWhen Ms Ley initially got the leadership position following the 2025 election defeat, she defeated Mr Taylor by only four votes, making her vulnerable from the beginning.\n\nMr Taylor also took to social media ((Instagram and X)) to confirm his bid for the leadership.\n\n\"The Labor government has failed and the Liberal Party has lost its way. I'm running to be the leader of the Liberal Party because I believe that Australia is worth fighting for. I believe we need strong and decisive leadership that gives Australians clarity, courage and confidence in providing a vision for the future. We must start by holding this failing Labor government to account for their total mismanagement of our country and advocate for solutions to the problems that Australians are facing. I'm dedicated to serving you, the Australian people, and giving you a strong alternative that re enlivens the Great Australian Dream.\"\n\nFollowing the decision by Mr Taylor to quit the front bench, a series of staggered resignations has been orchestrated to trigger a party room spill.\n\nTo date, six frontbenchers have resigned from their positions including Mr Taylor, with more expected to announce their resignations.\n\nSenator Jonno Duniam, Senator James Paterson, Senator Matt O’Sullivan, Shadow Minister Claire Chandler, and Shadow Assistant Minister Philip Thompson all quit their posts in a coordinated move.\n\nThe resignations began with the recently appointed Shadow Minister for Cyber Security and Science, the Senator for Tasmania, Claire Chandler.\n\n\"In recent weeks, I've been contacted every day by Tasmanians, by Australians who feel that the Liberal Party has let them down. They don't see an opposition that is tackling the Albanese government head on and holding them accountable for their failures. They just see an opposition that is obsessed with talking about itself. Now I know that the Liberal Party is better than this, but in recent days, I've come with a view that that's not going to happen under the current leadership, and that's why today I've resigned from the front bench.\"\n\nHowever, a loyal faction of Liberals is rallying to defend Ms Ley.\n\nProminent supporters, including MP Tim Wilson, MP Andrew Wallace, and high-profile moderate Senator Andrew Bragg, are pushing back against the spill.\n\nMr Bragg told Sky News that the challenge is premature, insisting that Ms Ley deserves at least one year in the role to prove her leadership.\n\n\"Sussan has policies which are ready to go. Housing stuff, immigration stuff, and I think she ought to be given an opportunity to do that work. As I say, the last few months have been, I think, a particularly difficult time to be the opposition leader. It's always probably the hardest job in Australia. But I think Sussan has been dealt a pretty difficult hand. She's a tough person, and I think she ought to be given more time in the role. And as I think most normal people would expect 12 months in a job is at least a reasonable attempt.\"\n\nSo far, Mr Taylor is backed by Liberal Senator Sarah Henderson, Senator Jess Collins, Shadow Minister for Finance James Paterson, and Phillip Thompson, the Shadow Assistant Minister for Defence and the NDIS.\n\nResponding to questions regarding the ousting of the Liberal Party’s first female leader, Senator Paterson is insisting the challenge is about merit rather than gender.\n\nHe says that the verdict on Ms Ley’s leadership is now very clear.\n\n\"Newspoll shows she's at negative 39 personal approval rating. That is the worst performance of an opposition leader in 23 years. You have to go back to Simon Crean. You have to go back to 2003 and Simon Crean to find an opposition leader who has polled so badly. Sometimes Prime Ministers can recover from bad opinion polls, but it is very difficult for opposition leaders to do so, and I don't believe she'll do so.\"\n\nSenator Henderson says she has sympathy for Sussan Ley but is throwing her support behind Mr Taylor, as she believes he will prioritise the interests of the Australian people.\n\nShe is warning that the Liberal Party is facing its most dire situation since 1994, noting the stark contrast between current polling and the 45.5% primary vote Tony Abbott secured upon becoming Prime Minister.\n\nCiting the latest Newspoll, which places the Coalition's primary vote at just 18% - Senator Henderson says that a leadership change is essential to avoid a total wipe out in the House of Representatives.\n\n\"Angus is very experienced. He's very principled. He's got a wonderful background as a business person. He's got a great empathy with regional Australians. And he's very determined, he's very courageous, and he's very focused on our values. One of the difficulties I have had is that when I wanted to take forward some really important amendments to a very bad Labor bill to prosecute the case for us to step up in the national interest on immigration policy and cap foreign students to make sure that we managed our migration program in the national interest. I was forced across the floor to prosecute what I felt was a really strong common sense policy, which had a lot of support from my colleagues. I don't believe that was consistent with Liberal values, and I believe we will see some very strong, courageous leadership from Angus.\"\n\nAt least six candidates are currently vying for the deputy leadership, with some reports that MP Zoe McKenzie might enter the race.\n\nSenator Sarah Henderson is publicly backing Jane Hume for deputy leader, despite the rarity of a leader being based in the Senate.\n\nTraditionally, the position belongs to a member of the House of Representatives to sit alongside the party leader.\n\nThe last Senator to hold the deputy Liberal leadership was Western Australian Senator Fred Chaney, who served in the role from 1989 to 1990.\n\nSenator Henderson is arguing that Senator Hume and Mr Taylor would recreate the outstanding partnership they shared as Shadow Treasurer and Shadow Finance Minister under Peter Dutton.\n\n\"I mean, this is, of course, yet to be sorted through, and there's only been various speculation. But I do hope Jane puts up her hand. I think they would be a very formidable combination. There's no ticket, of course, but I do hope that Jane puts up her hand.\"\n\nProminent conservative frontbenchers, including Michaelia Cash and Shadow Minister for Energy and Emissions Reduction Dan Tehan, have yet to announce their intentions.\n\nAs the wave of departures continues, Ms Ley is remaining active on social media.\n\nA party room meeting will take place on Friday morning to vote on a leadership spill.",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/who-is-angus-taylor-the-man-taking-on-sussan-ley-ahead-of-liberal-leadership-showdown/pqndd5kxm",
    "title": "'Smartest policy brain' or controversial deal-maker: Who is the real Angus Taylor?",
    "publish_date": "Thu, 12 Feb 2026 05:16:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "With over a decade in the political ring — and having survived several controversies in parliament — Angus Taylor is ready for his next round: challenging Sussan Ley for Liberal leadership.\n\nTaylor ended weeks of speculation on Wednesday night when he tendered his resignation to Ley, stating he no longer had faith in the party leader.\n\n\"I'm running to be the leader of the Liberal Party because I believe that Australia is worth fighting for,\" the NSW MP said when announcing the move that triggered a wave of resignations from his backers.\n\n\"I believe we need strong and decisive leadership that gives Australians clarity, courage and confidence in providing a vision for the future.\"\n\nREAD MORE Angus Taylor steps down ahead of expected Liberal leadership spill\n\nFactional ally and prominent Opposition frontbencher James Paterson has publicly backed Taylor as Liberal leader, saying it was a \"change or die\" moment for the party.\n\n\"Angus is the smartest policy brain in the shadow cabinet, a man of courage and values,\" he told reporters on Thursday.\n\nHowever, some episodes of Taylor's career — from 'Watergate' to the viral \"good job\" faux pas — continue to haunt him, and are unlikely to remain outside the spotlight as he launches his bid for the Liberals' top job.\n\nWho is Angus Taylor?\n\nThe 59-year-old grew up in southern NSW to a fourth-generation farmer, going on to study law and economics.\n\nLike former Liberal leaders Tony Abbott and Malcolm Turnbull, Taylor earned a Rhodes Scholarship to Oxford University, focusing on economic philosophy.\n\nThe father of four later started up several businesses in irrigation and agriculture alongside his family — ventures which would later plague him.\n\nTony Abbott (left) and Angus Taylor (right) were both recipients of the Rhodes Scholarship. Source: AAP / Mick Tsikas\n\nDuring his time as a consultant for McKinsey & Co, he played a key role as a go-between for New Zealand dairy farmers, leading to the launch of Fonterra, the country's largest dairy exporter.\n\nHis grandfather, William Hudson, is regarded as the father of the Snowy Mountains hydro-electric scheme.\n\nWhen he was elected in the NSW seat of Hume in 2013, he was touted as a future prime minister, due to his \"Kennedy-like\" looks, education, business links, as well as agricultural background.\n\nWatergate and 'well done Angus': Life in politics\n\nConsidered a conservative, Taylor became aligned with Tony Abbott and Peter Dutton early in his political career.\n\nHe was appointed to the energy and emission reduction portfolio under Scott Morrison, a move that raised eyebrows given his presence at anti-wind farm rallies.\n\nAs part of Ley's shadow cabinet, he was defence spokesperson, having also served as shadow treasurer under Peter Dutton.\n\nConservative Angus Taylor has spoken at several anti-wind farm rallies. Source: YouTube / Stop These Things / Crispin Trist\n\nTaylor came under criticism in 2019 after revelations that the federal government spent $80 million on water rights in 2017 from Eastern Australia Agriculture, a company where he was previously co-founder and director.\n\nThe Hume MP denied knowing about the sale or that his family benefited from the transaction, but the high price tag came under scrutiny. It was referred to as 'Watergate', with then-Twitter users placing water drops on their profiles.\n\nThat same year, Taylor was embroiled in 'grassgate' after it was found that he had met with officials to discuss illegal land clearing on a property partly owned by his family trust.\n\nTaylor was later accused of using allegedly forged documents to criticise Sydney lord mayor Clover Moore in 2019 over her council's travel costs, later issuing an apology to Moore.\n\nDuring the 2019 election, Taylor — energy minister at the time — was caught replying to his own Facebook post, praising himself for a job \"well done\" after announcing an extra 1,000 car spots at a train station in his electorate.\n\nFast forward to 2026, and as Taylor announced his leadership candidacy, Australians were quick to flood his comments section with the viral remark: \"Fantastic. Great move. Well done, Angus.\"\n\nFormerly shadow treasurer under Peter Dutton, Taylor narrowly lost the leadership spill against Ley last May. Source: AAP / Mick Tsikas\n\nTaylor's economic credentials were brought into question during the 2025 election campaign when he opposed Labor's income tax cuts, traditionally a Liberal issue.\n\nFollowing the May election defeat, Ley initially beat Taylor in a leadership contest 29 to 25, but three of her supporters have since left the party room.\n\nAs of late afternoon Thursday, nine other Liberal Party members — including Michaelia Cash and Dan Tehan — have joined Taylor and tendered their resignations.\n\n— with additional reporting from Australian Associated Press.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/angus-taylor-challenges-sussan-ley-for-leadership-of-liberal-party-midday-news-bulletin-12-february-2026/v8mfp7mg6",
    "title": "Angus Taylor challenges Sussan Ley for leadership of Liberal Party | Midday News Bulletin 12 February 2026",
    "publish_date": "Thu, 12 Feb 2026 00:57:27 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nAngus Taylor challenges Sussan Ley for leadership of the Liberal Party\n\nA special envoy appointed to progress investigations into the methanol poisoning deaths of two Australians in Laos\n\nAustralians Scotty James and Valentino Guseli reach the snowboard halfpipe final at the Milano Cortina Games\n\nLiberal MP Angus Taylor has officially launched his challenge for the Liberal leadership, ending months of speculation over Sussan Ley’s position.\n\nIn a coordinated blow to the current leadership, a wave of frontbenchers have resigned in support of Mr Taylor - including Claire Chandler, Matt O’Sullivan, and Phillip Thompson.\n\nWith a leadership ballot expected within the next 48 hours, Mr Taylor posted a video on social media to pitch his vision for a decisive alternative to the Labor government.\n\n\"The Labor government has failed and the Liberal Party has lost its way. I'm running to be the leader of the Liberal Party because I believe that Australia is worth fighting for. I believe we need strong and decisive leadership that gives Australians clarity, courage and confidence in providing a vision for the future. We must start by holding this failing Labor government to account for their total mismanagement of our country and advocate for solutions to the problems that Australians are facing.\"\n\nMs Ley posted a photo of herself smiling on social media, with a statement vowing to \"take the pressure off families, fix the budget, and keep Australia safe\".\n\n---\n\nAnthony Albanese says he is \"not contemplating failure\" on Closing the Gap between Indigenous and non-Indigenous Australians.\n\nSet to give his annual Close the Gap speech today, Mr Albanese will also hand down his annual report card on progress under the National Agreement on Closing the Gap.\n\nThe latest data shows just four out of 19 targets are on track to be met by 2031.\n\nThe Minister for Indigenous Australians, Malarndirri McCarthy, says there is a lot of work to be done.\n\n\"We're certainly determined to Close the Gap. We've got five more years as part of the national agreement that was signed under Ken Wyatt. We know there's incredible challenges, especially in the justice space and also the out of home care with the removal of Aboriginal and Torres Strait Islander children, but we are determined to keep working with the states and territories to ensure we do close the gap, but also with Aboriginal and Torres Strait Islander communities.\"\n\n---\n\nForeign Minister Penny Wong has appointed a special envoy over the methanol poisoning of two Australian teenagers in Laos .\n\nA lack of transparency from overseas authorities prompted the appointment of seasoned diplomat Pablo Kang, who has been asked explore all avenues to progress the 2024 case.\n\nThe families of Holly Morton-Bowles and Bianca Jones were outraged this week after revelations that 10 people connected to the poisonings faced court in January and were fined just $185 for destroying evidence.\n\nNo charges were laid.\n\nMs Wong has announced Mr Kang's appointment in a statement, after the Department of Foreign Affairs and Trade apologised for not providing more information to the victims' families.\n\n---\n\nThe Triple Zero phone call made by 13-year-old Austin Appelbee to get help for his family who were swept out to sea has been released by Western Australia police.\n\nThe teenager swam four hours to shore last month after he, his mother and two sisters - aged 12 and 8 years old - had drifted out to sea south of Perth on paddleboards and a kayak.\n\nThe family were rescued after an estimated 10 hours at sea, after Austin then ran two kilometres from the shore to find his mother's phone so he could make the emergency call.\n\nIn the now-released audio of the call, he calmly tells an operator that his family likely need a helicopter and says he may need an ambulance for hypothermia.\n\n\"Hello, my name is Austin and I'm outside Quindalup beach. I have two siblings: Beau and Grace. We went out on a kayak trip and we got lost out there. We couldn't get back to shore and Mum told me to go back to get help. I think we need a helicopter to go find them. I'm sitting on the beach right now and I think I need an ambulance because I think I have hypothermia.\"\n\n---\n\nTo sport,\n\nAustralians Scotty James and Valentino Guseli have both secured places in the Men’s Snowboard Halfpipe finals at Milano Cortina Games.\n\nThe top-ranked qualifier for the finals, James scored 94.00 in his opening run in the pipe; delivering a switch backside double cork 1440, which he performed for the first time in a competition Switzerland last month.\n\nFellow Australian, Valentino Guseli has also secured a spot in the finals, delivering two strong and consistent runs to comfortably qualify in sixth place.",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/goodfood/sydney-eating-out/woolly-bay-hotel-20260213-p5o247.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Woolly Bay Hotel",
    "publish_date": "Fri, 13 Feb 2026 13:51:29 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\n1 / 4 The Woolly Bay Hotel in Woolloomooloo. Jared Lyons 2 / 4 The downstairs restaurant at The Woolly Bay Hotel. Jared Lyons 3 / 4 Arturo’s Rooftop. Jared Lyons 4 / 4 The rooftop has city skyline views. Jared Lyons Previous Slide Next Slide\n\nPub dining$$$$\n\nLaundy Hotels has more than 20 venues in its growing pub portfolio, and this sprawling harbourside destination is one of the group’s glitzier offerings. The ground-level bistro isn’t bad, but you really want to book a table for crudo at Arturo’s rooftop bar. Striped cushions, terracotta and frilly umbrellas mean the place looks more like Amalfi than Woolloomooloo.\n\nBest for: Sinking into a rooftop couch with something Aperol-based.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/goodfood/sydney-eating-out/the-lord-nelson-brewery-hotel-20260213-p5o23q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Lord Nelson Brewery Hotel",
    "publish_date": "Fri, 13 Feb 2026 13:24:51 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nA cosy sandstone pub where the beer is brewed onsite.\n\n1 / 5 The Lord Nelson hotel in The Rocks. Supplied 2 / 5 The Lord Nelson is Australia’s oldest brewery hotel. Supplied 3 / 5 The ground-level bar. Wolter Peeters 4 / 5 The Aussie beef pie. Wolter Peeters 5 / 5 Steak and chips. Wolter Peeters Previous Slide Next Slide\n\nPub dining$$$$\n\nPraise be, The Lord. Built in 1836, the grand-but-cosy sandstone establishment is Sydney’s oldest continuously licensed hotel. It brews its own beer (the Trafalgar English Bitter is our favourite for a session), oysters are shucked to order, and the pie with mushy peas is a must-have for any visiting tourists. Bonus points for being pokies-free for the past four decades.\n\nBest for: A pork pie and a pint of bitter.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/afl/giants-fear-losing-key-onballer-to-acl-injury-20260213-p5o235.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Fearing the worst’: Green goes down with suspected ACL",
    "publish_date": "Fri, 13 Feb 2026 12:36:53 +1100",
    "category": "sports",
    "authors": [
      "Danny Russell"
    ],
    "text": "The pre-season injury curse has struck at Greater Western Sydney following news this morning that prime onballer Tom Green has been sent for scans for a suspected ACL.\n\nThe Giants released a statement to say that Green hurt his knee during an intra-club practice match on Friday morning.\n\nThe Giants fear Tom Green has torn his ACL. Credit: via Getty Images\n\n“We are hoping for the best, but fearing for the worst regarding a suspected ACL injury,” GWS footy boss Jason McCartney said.\n\nGreen’s knee buckled during a tackle, and he was helped from the ground by trainers.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/men-allegedly-run-from-police-after-major-cannabis-raid-in-victoria-20260213-p5o23e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Men allegedly run from police after major cannabis raid in Victoria",
    "publish_date": "Fri, 13 Feb 2026 12:26:43 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/afl/afls-full-star-power-on-display-at-origin-training-20260213-p5o23b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL's full star power on display at Origin training",
    "publish_date": "Fri, 13 Feb 2026 12:16:41 +1100",
    "category": "sports",
    "authors": [],
    "text": "AFL's full star power on display at Origin training\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/property/news/el-jannah-co-founders-put-11-million-sydney-estate-on-the-market-20260209-p5o0rv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "El Jannah co-founders put $11 million Sydney estate on the market",
    "publish_date": "Fri, 13 Feb 2026 11:55:05 +1100",
    "category": "finance",
    "authors": [
      "Kristy Johnson"
    ],
    "text": "Investing in chicken has proven fruitful for Andre and Carole Estephan, co-founders of the Lebanese charcoal chicken chain El Jannah.\n\nThey have just put their multimillion-dollar Dural estate on the market, and it was left to local sources to confirm a price guide of $11 million, as Louis Stapleton of McGrath Castle Hill declined to comment on any aspect of the listing or buyer’s identity.\n\nAndre and Carole Estephan, co-founders of El Jannah, have put their Dural estate on the market. Credit:\n\nThe Lebanese immigrants opened their first charcoal chicken store in Granville, in western Sydney, in 1998 and had five locations across western Sydney by 2020. They recently chose an investor in US investment giant General Atlantic, an asset manager of some $180 billion.\n\nThe Estephans bought the six-bedroom, eight-bathroom home from Jacqueline Dominello for $4.6 million in 2014, records show. It came with an outdoor pool, tennis court and giant backyard chess set, and over the years, the Estephans updated the property.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Fri, 13 Feb 2026 11:46:53 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this gallery for later\n\nAdd galleries to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/a-board-game-classic-at-the-comedy-theatre-with-a-serving-of-slapstick-20260211-p5o1d0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "For one night only, this gig in Thornbury felt like the centre of the music universe",
    "publish_date": "Fri, 13 Feb 2026 11:39:47 +1100",
    "category": "entertainment",
    "authors": [
      "Marcus Teague",
      "Cameron Woodhead"
    ],
    "text": "Advertisement\n\n★★★★★ CultureLive reviewsMelbourne live reviews For one night only, this gig in Thornbury felt like the centre of the music universe Marcus Teague and Cameron Woodhead Updated February 13, 2026 — 11:39am ,first published February 11, 2026 — 1:35pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nKey points MUSIC: Remarkably, Geese live up to the hype at their Thornbury gig\n\nTHEATRE: Cluedo at the Comedy Theatre is a zany mystery with a dose of nostalgia\n\nMUSIC\n\nGeese ★★★★★\n\nThe Croxton, February 12 An hour and a half before buzzy New York four-piece Geese are due on stage, there’s two lines of people on the footpath outside: one waiting to get in, the other sheepishly holding up signs for tickets: “Friend didn’t show up? I’ll buy your ticket,” reads one. Another: “This Goose has no tix”. Frontman Cameron Winter performs with Geese at The Croxton on Thursday, February 12. Martin Philbey Gooses they were. Ever since 23-year-old frontman Cameron Winter’s wonky, astonishing solo LP Heavy Metal grew from late-2024 curiosity into revered modern classic, the cult of Cameron has turbocharged Geese’s trajectory. When Winter’s Tuesday night solo piano show at The Forum went on sale in August 2025, it sold out instantly. In September, Geese released their third LP, the knotty Getting Killed, to rapturous reception. It means here now, on their debut Australian tour for Laneway Festival, both Winter and Geese could have played at venues three times the size, many times over. For one night only in High Street in Thornbury, it feels like being at the molten centre of the music universe. Shockingly, Geese live up to the hype. Augmented by keyboard player Sam Revaz, Geese demonstrate they’re far more than their famous frontman’s backing band, with a dissonant clinic of sizzling indie rock, laced with prog, blues, punk, folk and anything else ever made with guitars. Somehow, nothing’s ornamental, no one slacks off.\n\nAdvertisement\n\nFrom the opening slow burn of Husbands, the rammed crowd yell every word of Winter’s knack for self-flagellation: “I’m falling apart”, “I’ve been hit by the bus of life”, “Baby, you can change and still choose me”. They blast through all of Getting Killed and a couple of songs from 3D Country (2023), including an unhinged 2122, inspiring the first circle pit of the night. Geese are the most exciting new band, and a damn marvel to see. Martin Philbey There’s a wild vibrancy to Geese live that just isn’t present on the airtight audio of their records. New chordal passages emerge as guitarist Emily Green and drummer Max Bassin lead odd, telekinetic choices – where Winter was his own wry agent of chaos at Tuesday’s intimate solo show, tonight he’s the steely, charismatic fulcrum around which Geese expands and contracts. Cobra, Au Pays du Cocaine and Taxes are gorgeous, given a spectral heft in this quasi-religious setting, while 100 Horses and the set-closing barnstormers, Long Island City Here I Come and Trinidad put the crowd on spin cycle. The rumours are true: Geese are the most exciting new band, and a damn marvel to see. You’re a goose if you missed it.\n\nReviewed by Marcus Teague\n\nAdvertisement\n\nTHEATRE\n\nCluedo ★★★\n\nComedy Theatre, until March 15 Every generation from the Boomers down knows Cluedo. Editions of the game have been around since 1949, and kids tend to learn what a murder mystery is by playing it – well before they’re introduced to Agatha Christie. The usual suspects ham it up in Cluedo. Eddie Jim Childhood nostalgia for the franchise undergirds this commercial comedy. It adapts Jonathan Lynn’s 1985 film Clue (a box office flop that developed a cult following) and a talented cast embraces the zaniness of a show that’s feather-light on suspense and plot but slathered with mildly diverting drollery. Six usual suspects are invited to an English country house under the assumed names of characters from the game – Professor Plum (David James), Miss Scarlett (Olivia Deeble), Mrs Peacock (Genevieve Lemon), Colonel Mustard (Adam Murphy), Mrs White (Rachael Beck) and Reverend Green (Laurence Boxhall).\n\nAdvertisement\n\nThey’re greeted by the butler Wadsworth (Grant Piro), French maid Yvette (Lib Campbell) and a dour knife-wielding Cook (Octavia Barron-Martin). When their elusive host Mr Boddy (Joshua Monaghan) appears, it’s only for long enough to reveal sinister designs before adding to the body count. What follows is a chaotic hunt for the killer(s) that gets serially interrupted by yet more potential victims, and features a blend of ridiculous sight gags, exaggerated caricature, inane banter and comforting in-jokes, and tightly choreographed physical humour with strong elements of revolving-door farce. Cluedo is cosy, well-turned commercial entertainment. Eddie Jim Each actor confects moments in the spotlight. They all have fun playing with genre stereotype, though it’s Piro’s butler who acts as a kind of MC and gives the most versatile (and ludicrous) performance, with Boxhall’s neurotic, jelly-limbed slapstick not far behind. Production values are high, the set and costume design on par with the style of murder mystery theatre – think The Mousetrap – that Cluedo merrily lampoons.\n\nAdvertisement\n\nRelated Article Melbourne live reviews Tradition and modernity collide in this story of loneliness I’d like to see a push towards more diverse casting in shows of this ilk. The play’s nominal setting in 1940s England hardly calls for historical accuracy or naturalism when it’s based on a game played by everyone, and the familiarity Cluedo trades on might have even broader appeal if it better reflected contemporary Australian audiences. That said, Cluedo isn’t envelope-pushing stuff. Nor is it “a killer night out” as billboards claim. No, it’s undemanding comedy – a cosy, well-turned commercial entertainment that doesn’t outstay its welcome.\n\nReviewed by Cameron Woodhead The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/a-line-in-the-snow-why-the-ukrainian-athlete-was-banned-and-others-were-not-20260212-p5o1xf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A line in the snow: Why the Ukrainian athlete was banned and others were not",
    "publish_date": "Fri, 13 Feb 2026 11:30:00 +1100",
    "category": "sports",
    "authors": [
      "Jake Niall"
    ],
    "text": "Milan: The disqualification of Ukrainian Vladyslav Heraskevych for displaying on his helmet images of Ukrainian athletes killed in the Russian war places him in the unofficial hall of fame for Olympic dissent, alongside American sprinters Tommy Smith and John Carlos for their black power salute at Mexico City in 1968.\n\nUnlike Smith and Carlos, who were given short shrift by the hard line IOC and expelled from the Olympics with scant due process, the Ukrainian skeleton pilot was offered choices by this more compassionate iteration of the IOC.\n\nDisqualified Ukrainian athlete Vladyslav Heraskevych. Credit: AP\n\nHe would be permitted to wear the tribute helmet after he finished his runs and when facing the media afterwards and in practice. But the IOC and his sport’s governing body drew a line in the snow on him wearing it in competition.\n\nThe Ukrainian would not bend. In a sport that involves hurtling downhill at 130 km/h head-first, Heraskevych, as per Margaret Thatcher, was not for turning. He would exercise his right to be a one-man memorial.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/you-guys-can-t-score-me-low-how-the-boy-from-merimbula-became-olympic-champion-20260213-p5o1y4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘You guys can’t score me low’: How the boy from Merimbula became Olympic champion",
    "publish_date": "Fri, 13 Feb 2026 11:30:00 +1100",
    "category": "sports",
    "authors": [
      "Billie Eder",
      "Vince Rugari"
    ],
    "text": "Qualifying: fire in the belly In Olympic moguls, there is a field of 30 athletes, and two initial stages of qualifying. In the first, the top 10 go through to the finals, held the next day. The rest have to go again, and in that second run, the bottom 10 of the remaining 20 are eliminated. Woods came 15th on his first attempt with a score of 73.67. His family’s reaction was disappointment; not in him, but how the judges assessed his performance, though he later revealed he not only shared their view, but that it motivated him. So the next day, after a check-in with his sports psychiatrist, he came out breathing fire, putting down a vastly-improved 80.46 - the best score by any competitor in the second round of qualifiers, and the second-best from the entire field to that point.\n\n“I was a bit pissed off at the judges from the day before,” Woods said. “I was pretty fired up. I was going out there with vengeance. I was like, ‘I’m leaving nothing on the table. You guys can’t score me low.’ “I was in the gate with my coach, and there were probably a couple of explicit words just before we dropped in to get [me] really fired up.” Suddenly, confidence was flowing. Final one: pressure makes diamonds But Woods knew he had to up the ante to mix it with the medal contenders.\n\nThere are two jumps in moguls, each positioned between all the bumpy snow; in his qualifiers, he performed a back full and an off-axis 720 grab, but he felt that wasn’t going to be enough for the finals. Not only did he plan to go faster, but he wanted to add an extra degree of difficulty to his top jump. “Originally heading into the first final, we were going to go back to the qualification two run, because we scored so well. Then we had a couple of opportunities in finals training, and I just wasn’t missing,” he said. “I was like, ‘Let’s go all in. We’re at the Olympics. Let’s do it.’”\n\nThat meant adding an extra 360-degree spin to the back full, turning it into what’s called a back double full. In the first final, only eight of the 20 skiers progress for a shot at the podium. From being middle of the road on Wednesday, Woods scored a stunning 83.60 - the best of the round, meaning he would be last to jump in the decisive run. “I didn’t actually realise that I was the top qualifier of that round. It was only until I started putting my skis on that my coach told me,” he said. “Then I kind of freaked out a little bit.” Final two: all on the line\n\nWith his Olympic dreams on the line, Woods was locked in. The plan was simple: rinse and repeat. “I kept reminding myself that it is a pleasure to drop last,” he said. “I’ve never dropped last in my career, and I was dropping last behind some serious heavy hitters. I just need to relax up there, got a good coach, he kept me dialled in. I was pretty bloody nervous … [but] I knew what I had to do.” While he was waiting for his turn, for the first time - and only because he was feeling so good about himself - Woods allowed his coach to let him in on what the seven other competitors were doing, and how they were scoring. He even saw some of it for himself. “There’s a game plan,” he said.\n\n“We have so many awesome staff that are videoing and analysing other people … They were pretty straight up on what I needed to do and I needed to trust them and believe in that. I heard there was another 83 that got scored when I was up top and I was like, ‘Oh my goodness.’ It’s a big mountain to get a score like that … the coach that I had up top, he was like, ‘Stay disciplined. Do the same thing.’ “It worked out.” The score to beat for gold was 83.71, from Canadian veteran Mikael Kingsbury, widely considered one of the greatest moguls skiers of all time, who went just before him, the seventh of the eight still in contention. This was his final Olympics, and after winning gold in 2018 and silver in 2022 in this event, he was aiming to finish as champion again. And it looked like he might have done enough … until Woods dropped in.\n\nHe produced the same score, 83.71. In those situations, the tiebreaker is the turns score, or how the panel of judges assesses how they handled skiing on the moguls, and how smoothly and straight they moved. That was the difference. Woods’ turn score was 48.4, while Kingsbury’s was 47.7 – so he won gold, upsetting one of the sport’s true GOATs in the most high-pressure way imaginable, with the last run of an Olympic final. “He kind of ticked all the boxes,” said teammate Jackson Harvey. “He jumped really well, execution on the jumps was close to perfect and his skiing was very composed.”\n\nLoading What got him over the line was his precision and attention to detail. “Just the overall cleanliness of it,” said teammate Matt Graham, who lifted Woods in the air when the final scores were revealed. “He connected the dots, it was seamless. Landed the top air really well and just skied out, didn’t make a mistake … whereas Mick made a little mistake in the middle, and then I think they were both pretty similar in time.” The Winter Olympic Games is broadcast on the 9Network, 9Now and Stan Sport.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://au.news.yahoo.com/newest-leader-federal-liberal-party-020849511.html",
    "title": "Who is the newest leader of the federal Liberal Party?",
    "publish_date": "2026-02-13T02:08:49Z",
    "category": "finance",
    "authors": [],
    "text": "Angus Taylor has been elected as Liberal Party leader, deposing Sussan Ley in a spill after weeks of speculation on his political future. But how did he come to head the party?\n\n* Growing up in southern NSW, Mr Taylor goes on to study law and economics at the University of Sydney\n\n* He wins a Rhodes scholarship to study at Oxford University, focusing on philosophy\n\n* Goes on to work for consulting firm McKinsey alongside his brother in 1994, and becomes a partner in 1999\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n* He goes on to start up several businesses in irrigation and agriculture along with his family, including Eastern Australia Irrigation, with Mr Taylor serving as its director\n\n* Runs for Liberal pre-selection for the NSW federal seat of Hume ahead of the 2013 election and wins the endorsement of branch members. He's elected on an 11 per cent margin at the poll as part of Tony Abbott's landslide victory and return to power for the coalition\n\nAngus Taylor entered parliament in 2013 after being elected for the NSW regional seat of Hume. (Stefan Postes/AAP PHOTOS)\n\n* Becomes an assistant minister for cities and digital transformation in 2015 after Malcolm Turnbull becomes prime minister after a leadership spill\n\n* Wins re-election in 2016 and becomes law enforcement minister\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n* Resigns from the front bench in 2018 to declare support for Peter Dutton in a leadership spill. He becomes energy minister as part of Scott Morrison's cabinet\n\n* He comes under criticism in 2019 after revelations the federal government spent $80 million on water rights in 2017 from Eastern Australia Agriculture, a company where Mr Taylor was a co-founder and former director.\n\n* Mr Taylor was accused of using allegedly forged documents to criticise Sydney Lord Mayor Clover Moore in 2019 over her council's travel costs. He later issued an apology to Ms Moore\n\n* Attracts unwanted attention in the 2019 election campaign after congratulating himself on his own Facebook post with \"fantastic. Great move. Well done Angus\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n* After the coalition loses the 2022 election, he's appointed shadow treasurer under opposition leader Peter Dutton\n\n* Challenges for the leadership of the Liberal Party after 2025's landslide defeat for the coalition, but narrowly loses 29-25 to Sussan Ley. Becomes the opposition's defence spokesman\n\n* In early 2026, pictures emerge of a meeting with leadership rival Andrew Hastie at a home in Melbourne, hours before a memorial service for former Liberal MP Katie Allen. The following day, Mr Hastie declared he would not seek party leadership\n\n* In February 2026, he resigns from Ms Ley's front bench, and later challenges for the leadership. Others in the shadow ministry follow suit\n\n* A leadership spill is then held on February 13, with Mr Taylor winning 34 votes to 17. Victorian senator Jane Hume is elected as his deputy",
    "source": "Yahoo",
    "cluster_id": 27
  }
]