[
    {
        "url": "https://www.9news.com.au/national/oz-lotto-prize-of-70-million-dollars-to-give-winner-a-great-easter-present/477ff0d2-ca93-4215-a0fe-a7d212f32b6c",
        "title": "Fifteen strangers split single Oz Lotto win worth $70 million",
        "publish_date": "Tue, 15 Apr 2025 13:15:25 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Fifteen complete strangers brought together by chance have become instant millionaires days out from Easter.\n\nA single entry from Queensland claimed the entire $70 million Oz Lotto jackpot but it was split by 15 people who bought shares in the syndicate at different newsagents from Townsville to the Gold Coast.\n\nThe winning numbers for tonight's draw number 1626 were 14, 32, 13, 29, 41, 23 and 8 with supplementary numbers 43, 4 and 40.\n\nThe Oz Lotto division one prize had $70 million up for grabs. (The Lott)\n\nIf the winner had been a single person rather than a syndicate, they would have become Oz Lotto's second biggest individual lottery winner.\n\nSome of the lucky winners were still yet to learn the good news but others with registered entries were contacted tonight.\n\nReactions ranged from sleepy excitement to disbelief.\n\n\"I was just asleep! Bloody hell!\" a Bribie Island man told The Lott.\n\n\"Oh my God, that's so good. This changes our lives. We've been trying to get our first home, so this will do that.\"\n\nAnother was considering retirement and, almost unbelievably, ruing a missed opportunity.\n\nREAD MORE: Almost every state and territory is expecting rain over Easter long weekend\n\nMystery lottery winner takes nine months to claim staggering $1.8 billion prize View Gallery\n\n\"I thought you were shitstirring me!\" he laughed.\n\n\"I just can't believe it.\n\n\"Funnily enough, I went to the outlet today to buy another share into the syndicate but it had sold out. If I had, I would have won double. But I'm still happy with my $4.7 million.\"\n\nThe Lott spokesperson Anna Hobdell said she hoped the winners checked their tickets quickly.\n\n\"It's remarkable that 15 Queenslanders became multimillionaires tonight,\" she said.\n\n\"While we've tried contacting those who registered their tickets to The Lott Members Club, some may have yet to discover the good news.\n\n\"We're encouraging anyone who purchased a syndicate entry in Queensland for tonight's Oz Lotto draw to check their tickets as soon as possible.\"\n\nFifteen complete strangers brought together by chance have become instant millionaires days out from Easter. (The Lott)\n\nOz Lotto earlier said thousands of entries per minute were generated at lottery outlets and online. ﻿\n\n\"The last time we saw a $70 million Oz Lotto draw was in January 2025 when the peak of sales was at 12.06pm on the day of the draw when 4297 tickets were sold in a single minute,\"﻿ Hobdell said.\n\nIn February, officials from The Lott contacted a woman from Elizabeth Hills in Western Sydney shortly after the draw to tell her she'd won the $100 million Oz Lotto prize, thanks to her ticket being registered to an online account.\n\nThe winning entries were bought at the following newsagents:\n\nArundel Plaza News, Arundel\n\nBellara News, Bellara\n\nBiota Street News, Inala\n\nFriendly Grocer Heritage Park, Heritage Park\n\nInala Newsagency, Inala\n\nLuck Lifestyle Rochedale\n\nMetro News on 1st, Indooroopilly\n\nNewsExtra @ Parkinson News & Gifts, Parkinson\n\nnewsXpress Nerang Newsagency, Nerang\n\nNextra Bribie Island, Bribie Island\n\nNextra Kenmore Village, Kenmore\n\nNoosa Village News, Noosaville\n\nShamrock News & Lotto, Southport\n\nSupercentre News, Mermaid Waters\n\nThe Lucky Charm Hyde Park, Hyde Park﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/exercise-before-bed-linked-to-disruptive-sleep-study-finds/ea0704e3-a865-4d9a-9d41-817c5175e5a2",
        "title": "Exercise before bed linked to disruptive sleep: study",
        "publish_date": "Wed, 16 Apr 2025 00:36:29 +0000",
        "category": "lifestyle",
        "authors": [
            "Apr"
        ],
        "text": "Exercising too close to bedtime may lead to disruptive sleep, a landmark Australian study has found.﻿\n\nResearchers at Monash University in Melbourne tracked more than 14,000 people over a year and found high-impact exercise at night keeps the body and brain alert before bedtime.\n\nThe study, published in the journal Nature Communications , showed that exercising four hours or less before bedtime was linked to falling asleep later, experiencing less and worse quality sleep and a higher heart rate.\n\nVigorous exercise too close to bedtime may impact sleep quality, a new Australian study found. (Getty)\n\nIt was the first and largest study to identify this.\n\nThe research involved an international sample of 14,689 people wearing a multi-sensor biometric device to record exercise, sleep and cardiovascular data over one year.\n\nThe results were adjusted for gender, age, weekday, season, general fitness and the prior night's sleep.\n\nResearchers found high-strain activities, such as ﻿HIIT workouts (high-intensity interval training), football and rugby games or a long run, had the biggest impact on sleep patterns.\n\nThey lead to sustained increases in breathing rate, core body temperature, heart rate and mental alertness.\n\nThe healthiest places to live in Australia revealed View Gallery\n\nFirst author Dr Josh Leota, from the Monash University School of Psychological Sciences, said fitness enthusiasts would be better off picking lower intensity pursuits closer to bedtime.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/trump-tariffs-china-australia-small-business-raq-apparel-bikini-founder/5e24cf10-8008-43a2-9dd6-9d9a11711c8c",
        "title": "Sophia lost 20 per cent of her business' revenue because of Trump",
        "publish_date": "Tue, 15 Apr 2025 21:57:41 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Most Australians are yet to feel the direct impact of the trade war between the United States﻿ and China, which has seen US tariffs on Chinese imports spike from 10 per cent in February to 145 per cent in April.﻿\n\nThe same can't be said for some small business owners like Sophia Argyropoulos, director and designer of swimwear brand RAQ .\n\nLast week she was forced to shut down the brand's US website and pause all sales to the US as a result of ﻿US President Donald Trump﻿'s skyrocketing tariffs, wiping out 20 per cent of RAQ's revenue in the process.\n\nSophia Argyropoulos is director and designer for RAQ, an Australian D cup+ swimwear brand. (Instagram/@raqapparel)\n\n\"You remove 20 per cent of your revenue that can mean you're not profiting at all,\" Argyropoulos told 9news.com.au.\n\nThough the brand is Australian owned and operated and all orders are shipped out of a warehouse in Melbourne, ﻿RAQ's bikinis are manufactured in China and are therefore considered Chinese goods when being imported to the US.\n\nThat means that any orders ﻿RAQ sends to the US are subjected to Trump's China tariffs.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nSo when he signed the first ﻿executive order imposing 10 per cent tariffs on Chinese goods in February, Argyropoulos passed the fee on to US customers.\n\nThen, when the tariffs jumped to 20 per cent in March, she decided that RAQ would raise prices for US shoppers and absorb the cost of the tariffs.\n\nBut that tactic was not sustainable: When the tariffs skyrocketed﻿ to 145﻿ per cent on April 9 that meant a ﻿RAQ bikini top priced at $95 would incur an additional $137.75 fee.\n\nAbsorbing the cost of 145 per cent import tariffs would wipe out the brand's revenue entirely and there's no way RAQ's US customers would be willing to pay an extra $140 on top of an almost $100 bikini top.\n\nRAQ used to ship about 20 per cent of its orders to the US. Trump's tariffs changed that. (Instagram/@raqapparel)\n\nArgyropoulos only saw one option for the brand.\n\n\"I made the call then and there to turn off our US website. We lost 20 per cent of our sales,\" she said.\n\n\"We're barely making a profit as it is, given the cost of living crisis and people not being able to spend as much, plus skyrocketing costs of running a business.\"\n\nBut closing RAQ's US website and pausing all US orders has raised new challenges for the small business.\n\nSwimwear is a seasonal industry and RAQ usually relies on orders from the US to get through the cooler winter months when Aussies aren't shopping for bikinis.﻿\n\nWith winter less than two months away, the tariffs that forced Argyropoulos to pull out of the US market couldn't have come at a worse time.\n\n\"Our business model relies on us pivoting to the US at this time of year to generate some cash flow to pay for our production for the next season in Australia,\" Argyropoulos said.\n\n\"So we're literally turning that tap off.\"\n\nCancelling the brand's US marketing helped her save some cash but it won't cover the cost of lost sales from the US market this winter, which could have a long-term impact on the business.\n\nArgyropoulos cancelled the brand's US advertising to try to recover some cash. (Instagram/@raqapparel)\n\nMoving manufacturing to Australia to get around Trump's China tariffs isn't an option either.﻿\n\nThe bikini tops ﻿Argyropoulos designs are similar to bras and require specific technical skills to produce; technical skills which aren't currently available in Australia.\n\nIf she wanted to produce the same designs in Australia, she'd ﻿have to invest a fortune into setting up a factory, buying machinery and training a whole new labour force.\n\nIt's another cost she just can't afford as a small business owner.\n\nNot to mention that ﻿Argyropoulos has a years-long working relationship with her Chinese manufacturer and doesn't want to put them out of work either.\n\nArgyropoulos fears the situation will only get worse in the coming months.\n\n﻿Small businesses that manufacture products in China and rely on the US for the majority of their sales may not survive if Trump's tariffs remain as they are or continue to rise.\n\nArgyropoulos (second left) fears how losing the US market will affect her business in the long run. (Instagram/@raqapparel)\n\nRAQ's sales have not recovered since ﻿Argyropoulos shut down the US website.\n\nNow she's turned her focus to breaking into the UK market and while she's hopeful it will help the brand get through winter, there are no guarantees.﻿\n\n\"You can't just turn that on overnight,\" she said.\n\n\"I'm trying to stay optimistic in that there are other markets out there, and I'm trying to focus on what I can control [but] I don't know if I can just create a market out of nothing.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-election-2025-labor-and-coalition-slammed-for-dismal-economic-plans/2c08b250-cd08-4527-b25b-ee64f5ad5880",
        "title": "'Dismal' housing plans by Labor and Coalition risk skyrocketing debt, says expert",
        "publish_date": "Tue, 15 Apr 2025 22:23:44 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "T﻿he big-spending economic plans put forward by Labor and the Coalition in the election campaign have been dismissed as \"dismal\" by one veteran commentator.\n\nThe economics editor of the Australian Financial Review , John Kehoe, told Today this morning the \"ridiculous housing policies\" released by both parties risked ﻿pushing up prices and debt levels.\n\n\"This is the most dismal election for economics in my 40-odd years,\" he said.\n\nAustralian Financial Review journalist John Kehoe. (Today)\n\nThe Coalition policy for tackling the housing crisis revolved around generous tax breaks that could save a first-home buyer $11,000 a year, or $55,000 over the maximum five years.\n\nIt has budgeted $1.2 billion for the plan, but some economists say it could cost as much as four to eight times.\n\nLabor's also ready to splash the cash in a bid to make housing more affordable. The party unveiled a $10 billion policy aimed at building ﻿100,000 new homes over eight years.\n\nBut it also involves providing free lenders mortgage insurance to all first-home buyers, which currently is required by one in three. And if those loans go bad, the Aussie taxpayer will be left picking up the bill.\n\nLabor and the Coalition have unveiled ambitious housing plans. (AAP)\n\nKehoe says he risks \"sounding like an old crank\", but Anthony Albanese and Peter Dutton are showing little sign of the economic leadership of former prime ministers Bob Hawke, Paul Keating and John Howard.\n\nREAD MORE: Where Anthony Albanese and Peter Dutton have been on the campaign trail\n\n'Almost impossible': Dutton's son Harry said he can't afford a house deposit View Gallery\n\nThey weren't afraid of making \"hard decisions\" the current leaders were backing away from.\n\n\"Now all we're seeing is short-term sugar hits.\"\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/boeing-shares-fall-over-report-china-halts-deliveries-in-trade-war/ebc55d23-244a-4d93-bde5-a9f0e3729d58",
        "title": "Boeing shares fall on report that China has halted its deliveries",
        "publish_date": "Tue, 15 Apr 2025 20:24:07 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Shares of Boeing have fallen following a report that China has halted the delivery of all its jets to airlines in the country as part of an escalating trade war that has enveloped the world's two biggest economies.\n\nBoeing, a component of the Dow Jones Industrial Average, fell in early trading on Tuesday (Wednesday AEST) after a Bloomberg report that Chinese authorities had ordered its airlines not to take any further Boeing deliveries. Shares were down 1 per cent by midday.\n\nNeither Chinese authorities, Boeing nor the White House immediately responded to CNN requests for comment on the report, ﻿although US President Donald Trump said in a social media post that China \"just reneged on the big Boeing deal, saying that they will 'not take possession' of fully committed to aircraft.\"\n\nBoeing is the largest American exporter and is especially vulnerable in a trade war. (AAP)\n\nThe full list of Trump's 'reciprocal' tariffs View Gallery\n\nThe move would be a blow not just to Boeing, America's largest exporter, but also to the US economy, the world's largest.\n\nAs Trump has levied tariffs on trading partners - including at least 145 per cent on many Chinese products – other nations have retaliated as well, in some cases sparking a tit-for-tat that now threatens to hurt companies, manufacturing and jobs around the world.\n\nTrump's acrimony toward China has been particularly acute, with a spiralling trade war with that nation threatening everything from American farmers to iPhone shipments – even as confusion has mounted over exemptions and delays.\n\nBoeing is particularly vulnerable to the current trade disputes between the US and its trading partners. Unlike many multinational companies, Boeing builds all of its planes at US factories before sending nearly two-thirds of its commercial planes to customers outside the US.\n\nBoeing builds all its planes in the US and sells two-thirds of them overseas. (AP)\n\nAnd Boeing is a major part of the US economy, contributing an estimated $US79 billion and supporting 1.6 million jobs both directly and indirectly. It has nearly 150,000 US employees of its own.\n\nBoeing has been struggling for six years, racking up $US51 billion in operating losses since 2018, the last year it reported an annual profit.\n\nChina is the world's largest market for aircraft purchases, with Boeing's own recent analysis estimating that Chinese airlines are expected to purchase 8830 new planes over the next 20 years.\n\nBoeing was already dealing with a drop in sales for years in China, even before the introduction of tariffs. China has put tariffs of 125 per cent on all imports from the US.\n\nBoeing's jets cost tens of millions of dollars each, so tariffs that more than double the price would make them unaffordable to any Chinese customers even without any new limits on deliveries.\n\nChina has put tariffs of 125 per cent on all imports from the US. (Getty)\n\nDeliveries are crucial to Boeing, since that's when it gets paid. The company builds the plane first and gets most of its payment after delivering the finished product.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/missing-sausage-dog-kangaroo-island-cctv-video/e20df58c-495b-4362-862a-a3d31af745d3",
        "title": "Moment dog missing for 519 days comes agonisingly close to rescue",
        "publish_date": "Tue, 15 Apr 2025 10:40:36 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "A volunteer rescue team has released video footage of a dog they believe to be Valerie, the dachshund who's been missing on Kangaroo Island for 519 days.\n\nThe footage shows the sausage dog walking inside a carefully prepared trap, filled with Valerie's toys and clothing from her owners.\n\nUnfortunately the trap door can't be closed remotely so the dog was able to walk out and it is yet to be reunited with owners Josh and Georgia, who are adamant it is their beloved pet.\n\nA volunteer rescue team has released video footage of a dog they believe to be Valerie, the dachshund who's been missing on Kangaroo Island for 519 days. (9News)\n\n\"I was sitting there in bed one night, just going through old photos and comparing all her little marks and everything and being like 'it's 100 per cent her',\" Josh said.\n\nThe search for Valerie has garnered international attention, with her story featured in major newspapers and social media users commenting from New Zealand, the Netherlands, and the United States.\n\nThe increased awareness has brought hope to the rescue team, who believe it could lead to more resources and donations for their efforts.\n\n\"The more information that's out there about Val, the more resources they can get, the more donations they get towards the work they're doing,\" Georgia said.\n\nThe search team is planning to install a mechanism that will allow the trap door to be closed remotely by the end of this week.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/pm-stands-with-canadian-cafe-owner-on-vegemite-dispute/4f1dd2c3-6f48-4fa6-a9f3-84f68add5a29",
        "title": "PM stands by shopkeeper over Canada's demand for Vegemite's destruction",
        "publish_date": "Tue, 15 Apr 2025 08:48:03 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Prime Minister Anthony Albanese has backed a cafe owner in his dispute with Canada's food authority after they demanded he destroy an $8000 shipment of Vegemite .\n\nLeighton Walters, who runs an Australian-style cafe chain in Toronto, Canada, said the Canadian Food Inspection Agency had ordered him to stop selling the iconic Aussie food because it has added vitamin B - in breach of regulations.\n\nNow, Albanese has weighed in on the dispute, today saying: \"I stand with the Aussie cafe owner.\"\n\nPM stands with Canadian cafe owner on Vegemite dispute (Nine)\n\n﻿\"I can confirm here today that I am pro-Vegemite, and indeed, I actually put a lot of Vegemite on my toast when I eat bread,\" Albanese said.\n\n\"I love Vegemite, it's a good thing.\"\n\nThe PM then took a dig at Vegemite's British cousin Marmite - which seemingly escaped Canada's food laws.\n\n\"It's rather odd that they're letting Marmite in – which is rubbish, frankly.\"\n\n\"Let's be clear here, pro-Vegemite, anti-Marmite.\n\n\"That's my position.\"\n\nThe stoush first emerged in January when cafe owner Walters was told that Vegemite did not comply with Canadian food regulations.\n\nREAD MORE: Popular fast food chain to leave Australia\n\nLeighton Walters who runs an Australian-style cafe in Toronto, Canada, said the Canadian Food Inspection Agency had ordered him to stop selling the iconic Aussie food because it has added vitamin B. (Nine)\n\n﻿In a social media post last Friday, Walters pointed out that some major Canadian retailers were still allowed to sell the spread.\n\n\"Despite Amazon and major grocery stores continuing to profit of the sale of Vegemite and similar products like Marmite, for some reason, our genuinely Australian/Canadian coffee shops offering a healthy slice of home away from home, is seemingly worth targeting,\" he said.\n\n\"I don't expect Canadians to care about Vegemite, I know it's an acquired taste, but the principle and double standard doesn't make sense to me, and it doesn't seem right.\n\n\"As someone born with a birth defect, this is deeply personal.\n\n\"Vegemite is high in B vitamins and folate, that helps minimise the likelihood of babies being born with conditions like mine and living through the pain my family and I have throughout out my life so far.\"\n\nREAD MORE: Russia requests to base aircraft 1300km from Australia\n\nWalters was in hospital when he was told to destroy the shipment of Vegemite. (Nine)\n\nWalters poses for a photo with a shipment of Vegemite. (Supplied)\n\nWalters told 9news.com.au he did not expect anyone in Australia to care about his plight, let alone the prime minister.\n\n\"It's easy to feel lonely being so far from home, but to hear that people are cheering me on - even the PM himself, trying to fight for Vegemite and our Aussie cultural icon over here is so moving,\" he said.﻿\n\n\"﻿Makes me even more proud to be Australian — if that's even possible.\"\n\nDespite the contradiction, the Canadian food authority told Canada's CBC that the added vitamins in Vegemite made it ineligible for sale.\n\nThe CBC was told that Vegemite sold in Canada must be altered to meet regulations.\n\nBega Group, the company that produces Vegemite, said it was aware of the situation, but since they do not export directly to Canada, the decision was out of their hands.\n\n\"We're aware of the recent reports regarding the removal of Vegemite from the shelves at Found Cafe in Toronto, and the disappointment this has caused for our fellow Aussies abroad,\" a spokesperson for the company said.\n\n\"Vegemite is more than just a breakfast spread – it's a taste of home and we know how much comfort that brings to Australians living overseas.\"\n\nThe company said it does not directly export the spread to Canada.\n\n\"﻿After looking into it, we can confirm we do not currently export Vegemite to Canada for sale within Canada. As such, we're not directly involved in or across the specific import regulations that apply – including those set by the Canadian Food Inspection Agency (CFIA),\" it said.\n\n\"While we're limited in our ability to influence the outcome, we're sending our support to Leighton, his team and the Found Cafe community of happy little Vegemites in Toronto who are missing their favourite Aussie icon.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/time-capsule-1985-telstra-hunting-group-of-school-children-from-forty-years-ago/484f04d2-a1b6-48a4-a541-aa9852b201a8",
        "title": "There's a nationwide hunt for the kids in this 40-year-old photograph",
        "publish_date": "Tue, 15 Apr 2025 03:13:48 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "A nationwide search is under way for a group of schoolchildren who buried a time capsule back in 1985.\n\nIt's been 40 years since the kids won a national competition to help Telstra, then known as Telecom, celebrate its 10th anniversary by burying items in a time capsule in Adelaide, South Australia.\n\nAll the participants were aged 10 at the time they put items in the capsule and are now hopefully approaching their milestone 50th birthdays.\n\nThe group of 10 schoolchildren buried a time capsule in 1985. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nThe telco giant is hoping the nearly 50-year-olds can reunite after 40 years to dust off the capsule and sift through a piece of Australian history.\n\nSo far, Telstra has only been able to track down one member of the group.\n\nTelstra regional general manager Michael Patterson told 9news.com.au he wants the people of Australia to help the company find the other nine children.\n\n\"People move around all over the place, so we're on the hunt to find these time capsule kids,\" Patterson said.\n\n\"These are young people from different schools across Adelaide, so they may not have ever come back into contact with each other.\"\n\nThe telco giant is hoping the nearly 50-year-olds can reunite after 40 years. (Bloomberg via Getty Images)\n\nPatterson said Telstra has no idea what is locked inside the time capsule.\n\nThough he hopes it might be a fascinating dive into '80s technology and pop culture.\n\n\"In that era, they had the landline, they were using payphones… it wasn't until two years later that the first mobile handset came out,\" he said.\n\n\"We've since had the invention of social media, we've got artificial intelligence.\n\n\"The technology's just evolving constantly.\"\n\nTelstra plans to crack open the time capsule on July 1 this year.\n\nIf you recognise yourself or know someone in the photo, you can contact timecapsule@team.telstra.com .﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/foord-double-blasts-gunners-to-big-women-s-super-league-win/105182412",
        "title": "Foord double blasts Gunners to big Women's Super League win",
        "publish_date": "Wed, 16 Apr 2025 01:45:09 +0000",
        "category": "sports",
        "authors": [],
        "text": "Matildas star Caitlin Foord has scored a brace to headline Arsenal's 5-1 thrashing of Leicester City, moving the Gunners to within three points of Women's Super League leaders Chelsea.\n\nWith Alessia Russo, Chloe Kelly and Daphne van Domselaar all missing from the squad due to injury, Arsenal boss Renee Slegers made five changes to the side that beat Crystal Palace 4-0.\n\nAfter just 10 minutes on Tuesday, Frida Maanum fired a cross to the back post with Foord there to bag her 10th goal this season.\n\nFoord also played a role in Arsenal's second goal, with a nicely weighted pass across the square for Stina Blackstenius to tap in.\n\nThe Australian winger continued her strong performance before half-time, finding the net once more.\n\nShe was played in by Mariona Caldentey and hit a quick one-two with Blackstenius, before striking the ball from the top of the box.\n\nHer shot took a deflection off as a Leicester defender slid in to stop, but Janina Leitzig was unable to stop the ball hitting the back of the net.\n\nThe Gunners stretched the lead to four early in the second half before Yuka Momiki got one back for the visitors.\n\nCaitlin Foord scored her fourth and fifth goals of the season in Arsenal's 5-1 Women's Super League win over Leicester City. (Getty Images: Arsenal FC/Alex Burstow)\n\nArsenal's fifth goal came from substitute Victoria Pelova, the Dutch midfielder scoring for the first time since returning from an ACL injury earlier this year.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\nWhile Arsenal's attention now turns to the Champions League, Slegers wants her side to take the WSL title race all the way.\n\n\"For us it was important for us to be focused on this game,\" she said post-match.\n\n\"We know there were four games left of the WSL now there's three. We wanted to win four out of four so this result is important.\n\n\"We did a lot of things really well today.\"\n\nIn the Champions League, Arsenal host the first leg of the semifinal against Lyon in north London on Saturday, where they've won their last eight matches in all competitions by an aggregate score of 31-2.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/the-history-of-the-handball-australian-rules-football/105182030",
        "title": "The history of the handball, and how it changed Australian rules football",
        "publish_date": "Wed, 16 Apr 2025 01:35:58 +0000",
        "category": "sports",
        "authors": [],
        "text": "On a warm, dry Adelaide afternoon Port Adelaide decided to put the \"foot\" part of football mostly to rest.\n\nLoading YouTube content\n\nIn one spectacular sequence the Power decided to move the ball down the ground by hand. Dodging and weaving through the defence, Port executed eight handballs, and just one kick prior to the goal.\n\nThe ball moved effortlessly from defensive 50 to their own arc without hitting the deck, with Sam Powell-Pepper's punctuating bounce setting the scene for Jason Horne-Francis's open goal.\n\nFor many this second quarter goal exemplifies what makes footy great. Dynamic movement, stellar skill and line-breaking speed.\n\nFor hours each week footballers across the league and country operate in lines, triangles and circles, honing their ability to get the ball away with speed and under pressure. The best in the game can get a handball away in a fraction of a second in almost any situation.\n\nBut for all the beauty of the handball, the codification and adoption of the skill is relatively recent when compared with the code's 167-year history. The handball as we know it today — with one clenched fist punching the ball from the other resting hand — has been the norm for less than half the sport's history.\n\nThe handball has radically evolved as the game has developed, now representing an essential skill for all players across all parts of the ground.\n\nThis is the story of the handball, and the brilliance of the skill today.\n\nThe first handballs\n\nThe first rules of the game in 1858 were clear about one thing — there was to be no throwing of the ball in the Australian code. But equally missing from the early rules was any mention of a handball or handpass.\n\nIt's likely that for the first 40 or so years of football history the handball was likely not a part of the game. One of the first \"instructional manuals\" for football, contained within Thomas Power's 1879 'The Footballer' said that \"the hand is very useful to strike back, forward or catch a ball in the air…to stop a ball…(or) to change the direction of it suddenly…but beyond this its use should not be allowed to go\".\n\nInstead, early Australian Football often moved the ball via the \"little mark\" — a mark that went as little as inches to give a player a free kick.\n\nWhen the distance for the kick was set at 10 yards (about 9 metres) in 1897, players were forced to find another way to get rid of the ball when unable to kick. This is where the handpass came to the fore.\n\nLoading YouTube content\n\nThe first recorded forms of the handball involved the ball being either tossed above the head and hit like a tennis serve or flicked well above the head.\n\nThe handball was first codified for the 1911 season, defined as \"when the ball is clearly held in one hand and knocked with the other hand\".\n\nThis interpretation allowed room for the \"flick\" pass to continue — where a ball was held with one hand and pushed out with an open hand.\n\nLoading YouTube content\n\nThe flick pass was explicitly banned before the 1924 season, with only a clenched fist permitted from the 1925 season onwards.\n\nIn 1934 the rule was rolled back, stating that a handball is \"knocked with the other hand\". This caused more confusion across the nation. South Australia fully re-adopted the flick pass under this rule, while Victorian officials largely insisted on closed fists. Different leagues — big and small — often had different interpretations of the word \"knocked\". Interstate play was especially fraught.\n\nIn 1938 the VFA in Victoria went a step further and allowed throw passes in an effort to speed up the game, though reverted in 1949.\n\nLoading YouTube content\n\nBy the late 1940s and early 1950s many believed the flick pass was actually illegal, with the ANFC running statements reasserting that this was not the case. A more restricted flick pass re-emerged across the 1950s and continued to be legal until 1966, exemplified by players such as Ted Whitten.\n\nThrough most of this time the handball was considered a secondary weapon — only to be resorted to when the kick was not possible. Len Smith — brother of Demons great Norm — was a coaching pioneer of the use of the handball but even his coaching rules stated that a \"handball does not take the place of a kick. It is a means of getting out of trouble.\"\n\nThis approach continued right up until the 1980s, when the handball started to come into prominence as an attacking weapon as the game began to fully professionalise. As footballers became fitter, the need to utilise other methods than the kick and hope became necessary.\n\nThe modern handball\n\nThese days the handball isn't a weapon of last resort — it's a key part of any successful team's strategy. Those endless hours of handball drills have had a clear impact on the way that the modern game is played.\n\nThe two players with the most handballs on record at the top level are currently in the league, with Lachie Neale likely to grab the third spot by the end of the year. Just one of the top 20 for handballs retired before the year 2000 (Greg Williams), with the former Brownlow Medallist likely to fall outside this elite club before the end of the season.\n\nThe exit from stoppages has moved from dump kicks to smooth overlap handballs — with these exits semi-scripted and programmed in advance. Some teams — such as Hawthorn — thrive on backfeeding from contests. Others — such as GWS — look for overlap handballs from set positions or to utilise foot speed to beat static defences.\n\nTeams tend to handball most often in the heat of the centre of the ground, where the space to find smooth marking targets is rare. In defence there's also a tendency to use a couple of sets of hands in order to find a good kick, rather than dumping it out under pressure and risking an intercept mark.\n\nIt's the handballs through the middle that now open up the field of play for pinpoint kicks to be targeted inside forward 50.\n\nAllowing the long, flowing team chains to occur has been a continual development of the techniques around the handball. Much like the tennis slap of 1909 slowly evolved into the rocket handballs of the 1980s, the handball of 2025 utilises a variety of different skills and techniques to release the ball legally.\n\nLoading YouTube content\n\nOne of the most important developments over the year relates to the \"hold\" arm. Instead of the ball resting on the hand like players of yesteryear, players are taught to \"palm\" or firmly grip the ball to increase the range of possible release angles. This allows skills like Nick Daicos's \"backwards\" handball while still retaining control of the ball.\n\nPlayers are also becoming increasingly adept at adjusting the position of their \"hold\" arm to outside of their torso and tackle cylinder. Some players like to shift the ball to their outside arm and away from their body horizontally, while others such as Tom Green raise their arms up so they can get a handball away while their body is being tackled.\n\nThe skill of getting the ball away while falling to the ground is also critical, with double Brownlow Medallist Lachie Neale one of the finest at the art. The difference between an effective falling handball and getting trapped holding the ball can often be the difference between a goal and one conceded.\n\nAs teams have become more willing to attack via the handball, opposition sides have increasingly focused on blocking handball lanes with arms and bodies. The underground handball is one of the best tools to avoid these obstacles, as Steele Sidebottom demonstrates above.\n\nIt's not just technique that is forged in those endless handball drills, but also the connection between different players. Certain combinations crop up as common, building on well established rapport between teammates.\n\nAll Australians, Brownlow Medallists and stars of the game are littered on this list, underlining the importance of the handball to the game of the modern greats. That connection — tied with the technical and tactical advances — has helped the handball become such a useful tool.\n\nAs football continues to age, the importance of a well placed and executed handball continues to grow.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/harriet-dart-lois-boisson-deodorant-tennis/105182190",
        "title": "Tennis player apologises for complaining to umpire about opponent's stench",
        "publish_date": "Wed, 16 Apr 2025 01:00:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "British tennis player Harriet Dart has apologised after asking the chair umpire to tell her opponent to put on deodorant because she \"smells really bad\".\n\nWhile losing 6-0, 6-3 to French player Loïs Boisson in the first round of the clay-court Rouen Open, Dart was picked up by a microphone during a changeover complaining to the umpire about Boisson's body odour.\n\n\"Can you tell her to wear deodorant? … Because she smells really bad,\" Dart said.\n\nAfter the footage spread on social media, Dart posted an apology on her Instagram stories.\n\n\"It was a heat-of-the-moment comment that I truly regret,\" she said.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\n\"That's not how I want to carry myself, and I take full responsibility.\n\n\"I have a lot of respect for Lois and how she competed today. I'll learn from this and move forward.\"\n\nBoisson, who made her first WTA Tour appearance of the season and is working her way back up from 303rd in the rankings after injuries, gave a light-hearted response.\n\nShe posted a photo on Instagram of her on court with a Dove deodorant edited into the frame above her hand, tagging the company and writing that they \"apparently need a collab\".\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/sydney-sticker-expo-sticker-artists-street-art-roni-hind/105164344",
        "title": "When Roni realised she had 5,000 photos of stickers, she had to share them",
        "publish_date": "Wed, 16 Apr 2025 00:56:57 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Photographing sticker art started as a hobby for Roni Hind, but when she'd accumulated more than 5,000 shots, she had to acknowledge that stickers had become her passion.\n\nAnd it was time to do something with it.\n\nInspired by sticker expos she'd heard about around the world, she founded the Sydney Sticker Expo, which she believes to be the first of its kind in Australia.\n\nHind, who curated and organised the expo of sticker art from Australia and across the world, is drawn to the democratic nature of sticker art.\n\n\"I really enjoy the accessibility of it,\" she says.\n\nA sticker placed somewhere is a sort of invitation for more, and overlapping, stickers to be added.\n\nSticker art, a sub-culture of street art, isn't always cheap to create, but Hind says there are ways to do it on a budget.\n\n\" Not everybody is able to go to art school, but they can still express their art through a sticker. \"\n\nFrom political messages and cheeky parodies of well-known logos, to cute animals and graffiti-style tags, there's a lot of ground being covered by Australia's sticker artists.\n\nMore than 150 artists from 13 countries submitted stickers to the expo.\n\nA subculture of street art, sticker art is democratic, accessible and born from a strong community of creators. (Supplied: Roni Hind)\n\nHind says the scene in Australia is thriving, though relatively small compared to countries like the United States and Germany.\n\nInspired by Banksy\n\nOne of the featured artists in the expo is Melbourne's Robbo-T, who has been creating stickers for about five years. His work often features an expressive silver robot exploring its environment.\n\nLoading Instagram content\n\nRobbo-T became interested in making stickers on a street art tour in Sydney, where he noticed a sticker from a well-known local artist.\n\n\"That was an 'a-ha' moment that opened my eyes to the whole sticker culture,\" he says.\n\nHe's inspired by Banksy's playful approach, and particularly the way the renowned street artist \"is able to interact with the world around him; his pieces interact with drain pipes and shop fronts\".\n\n\"There are a lot of big, plain, industrial-looking areas out there, and stickers are a way of bringing some of those to life and adding a little bit of interest to people's daily commutes,\" Robbo-T says.\n\nLike many sticker artists, he enthusiastically trades his work with other artists.\n\n\"You make connections locally and internationally,\" he explains.\n\n\"It's a unique sticker thing. People will send you their stickers that you'll put up in your region.\" (He was recently chuffed to hear one of his stickers was spotted in Türkiye.)\n\nRobbo-T joined a group that meets monthly in Melbourne to do street art in laneways and he says he was \"dubious\" when the group first invited him.\n\n\"I'm a bit older, and I was expecting [the group members] to be the stereotypical kind of taggers,\" he says.\n\n\"But what I found was a group of artists of all different types and age groups. There was a mixture of photographers, people that did stencils, paste-ups [posters or paper art that is pasted on walls] and old-school graffiti artists who have been spraying their whole lives.\n\n\"It's a vibrant community.\"\n\nArtists living double lives\n\nSydney's Onnie O'Leary, also a prominent tattoo artist, branched out into stickers around 2021.\n\nHer work — both tattoos and stickers — is inspired by erotic comic books of the 1970s, and often depicts vividly coloured angels and demons.\n\nO'Leary branched out into stickers around 2021, initially giving her stickers to her tattoo clients as a promotional tool. (Supplied: Onnie O'Leary)\n\nShe says, like street art, sticker art appeals to creatives who want to keep their identity a secret.\n\nShe's had in-depth online conversations with other sticker makers without knowing their names.\n\n\"We're just going off handles. I don't know what gender they are or how old they are, but regardless of those things, we have these stickers in common and that becomes the generative spark for swapping and talking about art.\"\n\nHind enjoys the anonymity of the scene.\n\n\"That's kind of the excitement of it … everyone's almost got this double life. A lot of my friends don't even know that I take photos of street art.\"\n\n'Undercurrent of art and activity'\n\nSticker artists often paste their works in public spaces in a practice known as sticker slapping or sticker bombing. Certain areas can organically become home to a cluster of stickers.\n\n\"It tends to be contagious,\" O'Leary says.\n\n\"One person sees a sticker, then they put another one down, and then someone else comes along and adds to that, until there are layers and layers of overlapping history there.\"\n\nO'Leary found promoting her art work on social media was getting harder and harder. \"So I thought, 'What about the real world?'\" (Supplied: Onnie O'Leary)\n\nWhile she loves coming across stickers in the wild, O'Leary's looking forward to seeing this often guerilla art form in the expo's gallery space.\n\n\"Often, I think [sticker art] is looked at as graffiti — with a negative rather than artistic connotation.\"\n\nBut they're \"really beautiful\", she argues.\n\n\"I love that there's this undercurrent of art and activity that's happening just on the surface of the streets that a lot of people don't notice.\"\n\nThe Sydney Sticker Expo is at Goodspace Gallery on April 23.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/china-halts-orders-of-american-boeing-planes-trump-tariffs/105181864",
        "title": "China halts orders of US-made Boeing jets, scrapping deals worth billions",
        "publish_date": "Wed, 16 Apr 2025 00:51:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "China has reportedly ordered its airlines to pause all incoming deliveries of American-made Boeing aircraft in response to Donald Trump's 145 per cent tariffs on Chinese goods.\n\nThe three main Chinese airlines were expected to take delivery of 179 Boeing planes between now and 2027 — more planes than the entire Qantas main fleet — in deals worth billions of dollars.\n\nBut that plan has been put on hold, according to reports from Bloomberg News.\n\nChina to increase tariffs on US goods to 125 per cent Photo shows A man in a royal blue suit, white shirt and light blue tie sits in a room with red carpet looking toward something out of frame In his first public comments about the US-China trade war, President Xi Jinping says there are no winners in a tariff war.\n\nInternational aviation consultant Neil Hansford said China would be the biggest loser from this latest trade spat.\n\n\"In the end China is cutting off its nose to spite its face because [the country] has a shortage of aircraft after COVID,\" he said.\n\n\" Its aviation industry isn't recovering in passenger terms — it's emotive, but when it gets to the cut and thrust, it's China who will pay the price. \"\n\nMr Hansford said the upheaval meant Boeing could focus on sending planes elsewhere.\n\n\"It'll assist Boeing because they can actually start bringing deliveries to other customers,\" he said.\n\n\"Everybody is short of equipment, we're all trying to give maintenance to aircraft.\n\n\"So for the rest of the aviation world it's a good thing.\"\n\nMr Hansford said China would still have access to jets from elsewhere, \"but they need Boeing's because COVID set us years behind in the building of aircraft\".\n\n'Handshakes rather than fist fights'\n\nThe larger trade war between China and the United States shows no sign of cooling.\n\nUS tariffs on China stand at 145 per cent and in return China has imposed 125 per cent tariffs on American goods entering its borders.\n\nChina's Foreign Ministry spokesman Lin Jian said his country was open for business.\n\n\"In the face of external uncertainties, China will adhere to handshakes rather than fist fights, tearing down walls rather than building barriers, and connecting rather than decoupling,\" he said.\n\n\"We will continue to expand our circle of friends in trade, strengthen the gravitational field of investment, and inject more stability and positive energy into the world economy through high-quality development and high-level opening-up.\"\n\nMeanwhile, a Communist Party official in Hong Kong, Xia Baolong, has clapped back to a recent reference to Chinese \"peasants\" made by US Vice President JD Vance.\n\n\"The repeated attempts of the US to contain and suppress Hong Kong will only result in the end of its agents in Hong Kong, and will backfire, and harm itself,\" he said.\n\n\"Those peasants from the US will soon be crying tears in front of China's 5,000 years of civilisation.\"\n\nDonald Trump attends a bilateral meeting with China's President Xi Jinping during the G20 leaders summit in 2019. (Reuters: Kevin Lamarque)\n\nUS waiting on China\n\nWhite House press secretary Karoline Leavitt said the US president was waiting on China to come to the table.\n\n\"The president has made his position on China quite clear,\" she said.\n\n\"The ball is in China's court — China needs to make a deal with us, we don't have to make a deal with them.\n\n\"There's no difference between China and any other country except they are much larger and China wants what we have … they need our money.\n\n\"The president has made it quite clear that he's open to a deal with China, but China needs to make a deal with the United States of America.\"\n\nMost countries are facing a 10 per cent tariff, except for some goods from Canada and Mexico.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/albanese-confronted-by-alt-right-protesters-at-hotel/105181484",
        "title": "Albanese confronted by alt-right protesters at hotel, raising security fears",
        "publish_date": "Tue, 15 Apr 2025 22:43:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Security fears have been raised after the prime minister was approached by alt-right protesters in the lobby of a Melbourne hotel he was staying in, a location that is meant to remain secret.\n\nA video circulating on social media shows two men confronting Anthony Albanese as he spoke with a staffer, yelling questions about the cost of housing before being moved on by the prime minister's security.\n\nGroups with far-right links — Melbourne Freedom Rally and Tactical Force Combatives — have taken credit for the videos.\n\nIt's not the first time the prime minister, Coalition leader Peter Dutton, or other senior politicians have been ambushed by protesters on the campaign trial, despite security detail being beefed up for the federal election campaign.\n\nAbout 10 events have been disrupted over the past few weeks — both Liberal and Labor — at locations from a brewery to a Chinese restaurant to a mental health clinic.\n\nEarly in the campaign, two climate activists yelled at the prime minister in a packed corridor in Maitland Hospital, in NSW's Hunter Valley.\n\nIt is understood they had gained access to the closed event filled with journalists, aides and medical staff, by posing as members of Mr Albanese's staff and providing those names to security.\n\nThe following day in Perth, at a battery wholesaler in the city's north, two protesters gatecrashed Treasurer Jim Chalmers' media event.\n\nThey had donned high-vis vests to blend into the crowd, masquerading as journalists.\n\nA climate protester holds up a sign at a brewery where Peter Dutton was speaking. (ABC News)\n\nNew 'guerilla tactics' being used\n\nWhile Australians may be accustomed to seeing politicians heckled on the street or larger demonstrations outside a closed event, this time around protesters have managed to get inside venues that have been kept under wraps — chosen and pre-vetted by politicians' staff.\n\nJosh Roose, a politics professor at Deakin University, said this required the use of \"guerilla tactics\".\n\n\"In order to get into a closed event, by definition, you're using some form of guerilla tactic like infiltration, disguise, using false accreditation, or hiding out,\" he said.\n\nDr Roose said while protest was normal and an important part of democracy, the tactics being used, such as \"bird-dogging\", were becoming more sophisticated.\n\nBird-dogging refers to activists hijacking politicians' media events to try to force an answer on questions they feel are being avoided.\n\n\"What we're seeing is Australian activists drawing on an international repertoire of tactics that have been developed, particularly in the US,\" he said.\n\n\"The key here though, is the danger of just one of those individuals demonstrating malevolent intent and a willingness to use violence.\n\n\"It only takes one individual to be successful and to slip through the net who's prepared to use violence.\"\n\nThe group behind many of the protests so far, climate action group The Rising Tide, told the ABC it's deeply committed to non-violence.\n\nPoliticians ramp up security\n\nSecurity measures have been beefed up around the high-profile figures this election campaign.\n\nDr Roose said that the threat of violence set against the \"highly polarised environment we're living in\" provides an enormous challenge for state and federal police and parliamentary security.\n\nIt comes after Australian Federal Police Commissioner Reece Kershaw warned on the eve of the election being called that federal politicians were facing increasingly menacing security risks, including threats to kill and threats of sexual violence.\n\nThe warning included advice for parliamentarians to protect their safety during the federal election campaign.\n\nProtester Alexa Stuart interrupts Anthony Albanese's press conference on Day 11 of the campaign. (ABC News: Adam Kennedy)\n\n\"Security is one of those things that's most effective when you don't see it,\" Dr Roose said.\n\n\"There's obviously not only the individuals on the ground, but there would be strong monitoring of what's going on online using open source intelligence.\n\n\"It's going to take more and more resources, particularly in the climate that we're in.\"\n\nHe said it was a difficult but important balance between acknowledging the role of protest in democracy, but also being alert to and tackling the threat.\n\nMr Albanese said he had confidence in the AFP and that protesters should not be encouraged by giving them attention.\n\nProtesters claim new tactics are necessary for their aim\n\nAlexa Stuart, an organiser for The Rising Tide group, said they wanted conversation focused on their message rather than their tactics, which they're keeping close to their chest.\n\nShe claimed the group uses publicly accessible information to enter events.\n\n\"We're sick of asking nicely and we're sick of being ignored,\" she said.\n\n\"That's the rationale behind this tactic. Major parties should be talking about climate they should be talking about their energy policies. We really want to force them to talk about it.\"\n\nThe 20-year-old made national headlines after crashing the prime minister's visit to a Headspace mental health clinic in Sydney's inner west earlier this week.\n\nShe did not comment on how she learnt about the location of the media conference. Asked how she got in, she told reporters: \"I was walking past.\"\n\nFears raised after report of alleged terror plot\n\nEvents away from the campaign trail have also heightened concerns.\n\nA report in The Australian suggested Mr Dutton was the target of a 16-year-old boy, who allegedly bought bomb-making ingredients in preparation for an attack last year.\n\nAfter the story emerged, the prime minister alleged he had also been the subject of \"a pretty serious incident\" which he said was \"before legal processes at the moment\".\n\nEarlier this week, more than 20 masked Neo-Nazi protesters dressed in black rallied outside Senator James Paterson's office, chanting racist slogans.\n\nSenator Paterson condemned the display, calling them losers.\n\n\"I certainly won't be lectured on patriotism from people who worship a failed foreign regime. These protesters only make me more determined to protect Australians from extremists of all stripes,\" he said.\n\n\"I'm not remotely intimidated by cosplaying losers who hide their faces behind masks.\"\n\nThe AFP has developed election-specific security advice and established a taskforce, Operation AUSTRALIS25, to assess and respond to political threats.\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/asx-markets-business-live-news-16-april/105181516",
        "title": "Live: Wall Street closes in the red after volatile trade",
        "publish_date": "Tue, 15 Apr 2025 22:13:18 +0000",
        "category": "finance",
        "authors": [
            "Stephanie Chalmers",
            "Nassim Khadem",
            "Daniel Ziffer"
        ],
        "text": "Nvidia will take a quarterly charge of about US$5.5 billion after the US government limited exports of its H20 artificial intelligence chip to China, a key market for one of its most popular chips.\n\nThe news sent its stock price sliding about 6 per cent in after-hours trading.\n\nThe H20 is currently Nvidia's most advanced chip for sale in China.\n\nNvidia said the US government informed it on April 9 that the H20 chip would require a license to be exported to China, and on April 14 told Nvidia those rules would be in place indefinitely.\n\nIt's a big hurdle for Nvidia, which earlier in the week said it was planning to build AI servers worth as much as US$500 billion in the US over the next four years.\n\nTech stock analyst Daniel Ives from Wedbush said Nvidia now faced \"massive restrictions and hurdles in selling to China\", which had been building during the Biden Administration.\n\n\"The Trump Administration knows there is one chip and company fueling the AI Revolution and its Nvidia ... and put a 'Do Not Enter' sign in front of China for Nvidia and Jensen (Huang CEO of Nvidia) with this restriction,\" Mr Ives said.\n\n\"The financial impact is small relatively, but the strategic blow is the focus of the market as Nvidia now has massive blockades going after the China market in the middle of this raging US/China tariff battle.\"\n\nNvidia builds chips that help power AI applications (Reuters: Dado Ruvic)\n\nMr Ives notes Nvidia is a \"key strategic asset\" for the US and the Trump Administration during this very tense period with China.\n\n\"And the White House is going to make sure Jensen and Nvidia's chips do not land in China for now and help Beijing in the AI Revolution,\" he added.\n\n\"The Street will take this news with clear nervousness worried these are the first shots fired in the tech battle between the US and China and Beijing/Xi are not just going to take this news and walk away.\"\n\nMr Ives said there would likely be \"a major back and forth between the US and China as the market and the economy is caught in the middle with this tariff battle royale.\"\n\n\"While the Nvidia news is concerning it's not a shock as we are in the middle of a trade war between the US and China and expect more punches thrown by both sides before cooler heads prevail and negotiations in some form can start to get these 145 per cent reciprocal tariffs down to a digestible level,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/aston-villa-psg-champions-league-second-leg/105181422",
        "title": "Villa fall short of miraculous Champions League comeback as PSG hold on",
        "publish_date": "Tue, 15 Apr 2025 21:55:03 +0000",
        "category": "sports",
        "authors": [],
        "text": "Paris St Germain kept alive their dream of a first Champions League title by squeezing past Aston Villa 5-4 on aggregate after a thrilling second leg of their quarter-final which the English side won 3-2.\n\nAhead 3-1 from the first leg, PSG appeared to have sealed the contest within the first half-hour as their marauding full-backs Achraf Hakimi and Nuno Mendes scored from two flowing counter-attacks to stun the Villa Park crowd.\n\nBut Youri Tielemans revived hope with a 34th-minute deflected goal before Villa stunned the visitors early in the second half with two goals in two minutes from John McGinn and Ezri Konsa.\n\nVilla poured forward, drawing a string of outstanding saves from PSG goalkeeper Gianluigi Donnarumma to preserve the aggregate win and enable his side to move into a semi-final against either Real Madrid or Arsenal.\n\nPSG were hot favourites to win the quarter-final given their first-leg advantage and recent form, including sealing a fourth straight Ligue 1 title and reaching the final of the French Cup.\n\nBut Villa were not lacking belief themselves, especially at home where they were on a 17-match unbeaten run in all competitions. The hosts came out flying, nearly taking the lead from a corner in an early flurry of attacks.\n\nHowever, PSG struck first blood in the 11th minute when Hakimi stroked the ball in after Villa's usually ultra-reliable goalkeeper Emiliano Martinez pushed it into his path.\n\nSixteen minutes later, Mendes curled in Villa's second goal off the post at the end of another fast-flowing counter-attack.\n\nTielemans's first-half goal appeared unlikely to swing the tie but it inspired Villa to storm out in the second half, with McGinn letting fly from outside the box to score in the 55th minute, helped by a small deflection.\n\nThen Konza struck Villa's third on the night after being set up with a brilliant dribble from Marcus Rashford.\n\nOne more goal would have put Villa level on aggregate but Donnarumma defied Rashford, Tielemans and then substitute Marco Asensio during a nerve-wracking finale.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/alex-de-minaur-barcelona-tomas-martin-etcheverry-first-round/105181316",
        "title": "De Minaur continues hot clay court form with opening win in Barcelona",
        "publish_date": "Tue, 15 Apr 2025 21:07:15 +0000",
        "category": "sports",
        "authors": [],
        "text": "Four days after being edged out in an epic semi-final duel in Monte Carlo, Alex de Minaur was back on the clay-court victory march in Barcelona.\n\nThe Australian star moved smoothly into the second round of the Barcelona Open with a 6-4, 6-4 defeat of Argentina's Tomas Martin Etcheverry.\n\nTalking before the match, De Minaur had warned he was \"starting to become dangerous on this surface\".\n\nTrue to his word, the world number seven dominated throughout. He seized the initiative with early breaks in both sets and consolidated without conceding a single break point.\n\nIn contrast, Etcheverry, also beaten 6-1, 6-4 by De Minaur at the United Cup in Sydney in December, failed to convert two break points of his own. lt was all over in 82 minutes.\n\nDe Minaur last week signalled his clay-court intentions by scorching through to the last four at the Monte Carlo Masters, demolishing Daniil Medvedev 6-2, 6-2 in the last 16 before an astonishing 'double bagel' 6-0, 6-0 victory over Grigor Dimitrov gave him a semi-final berth.\n\nLooking set to become the first Australian since John Newcombe in 1969 to reach the final of the prestigious Masters 1000 event, he was only halted by in a near three-hour battle that ended in a tie-break defeat against Italy's Lorenzo Musetti, who fought back to win 1-6, 6-4, 7-6 (7/4).\n\nPerhaps the victory took a heavy toll for Musetti, who crumbled to a 3-6, 6-1, 6-0 reverse at the hands of Carlos Alcaraz in the final 24 hours later.\n\nBack in Barcelona, De Minaur now faces Jacob Fearnley, the British number two who claimed his first ATP Tour main draw win on clay against Roberto Carballes Baena. The Scot, who made it into the main draw as a lucky loser, beat the Spaniard 6-1, 7-5 .\n\nFearnley was ranked outside the top 600 a year ago, but won four ATP Challenger titles in 2024 to rise inside the top 100.\n\nMeanwhile, Australia's Christopher O'Connell was edged out 7-6 (7/3), 7-6 (7/3) by recent Marrakesh champion Luciano Darderi at the BMW Open in Munich.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/mount-gambier-airport-ticket-price-hike-for-security/105174330",
        "title": "Mount Gambier airport passengers face 'unsustainable' $90 fare hike",
        "publish_date": "Tue, 15 Apr 2025 21:01:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tickets for flights out of the biggest city in regional South Australia will rise by an \"unsustainable\" $90 if the council is not able to get assistance to pay for installing security screening.\n\nMount Gambier airport, in the state's south-east, is currently exempt from security screening, but has been told it is nearing passenger number thresholds that would trigger mandatory screening.\n\nThe District Council of Grant, which operates the airport, has said security screening will cost in excess of $1.5 million up-front, and $300,000 each year.\n\nCouncil chief executive Darryl Whicker said increasing flight costs to Adelaide and Melbourne by $90 would risk making the airport unsustainable.\n\n\"Airports need to have frequency of flights and affordability,\" he said.\n\n\"Any impact that increases ticket prices substantially will reduce affordability which means people won't travel and therefore airports become unsustainable.\"\n\nThe Mount Gambier airport will soon need to add security screening due to the number of passengers. (ABC South East SA: Josh Brine)\n\nA national concern\n\nAustralian Airports Association (AAA) chief executive Simon Westaway said he had heard similar concerns across the country on a recent tour of regional airports.\n\n\"A lot of these airports are council-run and owned, and the margins are finite,\" he said.\n\n\"Fifteen per cent of the overall Australian market for air travel is regional flying.\n\n\"The reality is if [costs] go up, they need to be managed.\"\n\nFormer senator and current SA Senate candidate for the Jacqui Lambie Network Rex Patrick said regional passengers paid significantly more per flight for security screening than their city counterparts.\n\n\"At Port Lincoln Airport, passengers pay about $15 per ticket, $45 at Whyalla, and, as will be the case soon, $90 per passenger at Mount Gambier,\" he said.\n\n\"Yet passengers in Sydney pay only 70 cents.\"\n\nRex Patrick (second from left) met with the Grant District Council to discuss the cost of security screening. (ABC South East SA: Josh Brine)\n\nImplementing the fee in Whyalla caused a significant drop in passengers, from 1,500 per week to 900 per week.\n\nRex Airlines also halted services to Whyalla.\n\nMr Whicker said a reduction in flights to Mount Gambier would impact a number of critical services for the region.\n\n\"We can attract teachers, doctors, nurses and allied health professionals from Melbourne and Adelaide,\" he said.\n\n\" An airport is just as valuable as a hospital, as education, and all those other services that regional communities rely on and enjoy. \"\n\nThe Whyalla airport experienced a drop in passengers when it added the cost of security screening. (Supplied: Whyalla City Council)\n\nProposal to share costs\n\nIf successful in the federal election, Mr Patrick and Senator Jacqui Lambie promised to introduce a bill to share the costs of security screening between all passengers in Australia.\n\n\"We need to have a regime in Australia where each passenger pays a levy for security screening costs, and that levy is used to fund the security screening costs all around the country,\" Mr Patrick said.\n\n\"What that means is people in Sydney who now pay 70 cents per passenger might have to pay a dollar.\n\n\"But it means that the people in Mount Gambier, instead of having to pay $90 will also only have to pay a dollar.\n\n\" It's a national security cost, it shouldn't be borne by local councils. \"\n\nMr Westaway said the AAA would push for more support for regional airports with the next federal parliament.\n\n\"We need to see a more sustainable commitment of funding to support both capital and operational requirements at our regional airfields,\" he said.\n\nA spokesperson for the Department for Home Affairs said it worked with airport operators to ensure appropriate security measures were in place.\n\n\"Within the aviation security framework, airports and airlines are responsible for delivering aviation security requirements and managing day-to-day security operations, including the associated costs,\" they said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/nt-national-online-gambling-regulator-federal-election-albanese/105135600",
        "title": "Online gambling regulator chair admits accepting gifts from bookmakers",
        "publish_date": "Tue, 15 Apr 2025 20:52:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "The chair of Australia's de facto gambling regulator concedes he's accepted gifts from corporate bookmakers while overseeing an industry worth tens of billions of dollars.\n\nThe Northern Territory has become a haven for online gambling companies including Sportsbet, bet365 and Ladbrokes — 36 in total — all of which base themselves in the territory for its low fees and taxes.\n\nRegulating the bookmakers is the little-known NT Racing and Wagering Commission (NTRWC), an arm of the territory government consisting mostly of Darwin-based career public servants.\n\nMeeting once a month, the NTRWC has become the industry's de facto regulator, conducting investigations into bookmaker conduct and managing punters' complaints.\n\nAlastair Shields is the chair of the NT Wagering and Racing Commission. (ABC News: Pete Garnish )\n\nTim Costello is the chief advocate at the Alliance for Gambling Reform (AGR) and says a national regulator is needed.\n\n\"Bookies will always go to the place where the regulation is weakest, where the jurisdiction is smallest,\" he said.\n\n\"[It] explains why Australia has the greatest per capita gambling losses in the world.\"\n\nRecent data shows Australians lose more than $25 billion a year on legal forms of gambling.\n\nLarge corporate bookmakers such as bet365 are based in the NT. (ABC News: Mike Donnelly)\n\nWho's on the commission and what are their industry links?\n\nDespite its critical role in scrutinising the actions of the gambling industry, several of the NTRWC's six members have links to it.\n\nCommission chair Alastair Shields conceded he has previously accepted gifts from gambling industry insiders.\n\nWhen asked, Mr Shields said he \"had in the past attended the Darwin Cup as a guest\" of bookmakers.\n\nLoading...\n\nHe is also the NT's representative on the board of Greyhounds Australasia and has \"been involved in syndicates who have owned thoroughbreds in the distant past\".\n\nCommission member Scott Perrin is a former chief executive of Racing Victoria's online and television network Racing.com.\n\nFellow member Ian Curnow was last year a part-owner of racehorse Tolima, while Cindy Bravos — a former NT director-general of licensing — defended the territory's low tax rate for gambling companies in her past role.\n\nThe NT Racing and Wagering Commission meets once a month. (ABC News: Matt Garrick)\n\nMr Shields said any conflicts or perceived conflicts of interest are declared in commission meetings, in which \"very robust processes\" are in place.\n\nThe NTRWC declined the ABC's request for a list of its members' register of interests.\n\n(From right) Scott Perrin, Susan Kirkman, Rachel Shanahan, Alastair Shields, Cindy Bravos and Ian Curnow are members of the commission. They are pictured here with gambling psychologist Sally Gainsbury (second from left). (Supplied: Linkedin)\n\nRacing minister also accepts industry gifts\n\nMembers of the NTRWC's board are appointed by the NT's racing minister.\n\nThe current minister, Marie-Clare Boothby, was last year gifted tickets to the Darwin Cup gala ball by Sportsbet.\n\nMs Boothby was also given tickets to the corporate area at the Darwin Cup by Tabcorp and the Darwin Turf Club.\n\nThe minister's tickets were declared in NT parliament's register of members' interests.\n\nMarie-Clare Boothby has been gifted tickets to the Darwin Cup gala ball and Darwin Cup by corporate bookmakers. (ABC News: Pete Garnish)\n\nMs Boothby said if those companies \"want to contribute to the cost of that, then that's something that happens quite regularly across all ministries\", noting it was \"quite traditional\" in the NT.\n\n\"Many ministers from across many generations have accepted those things,\" Ms Boothby said.\n\nMr Costello said the disclosures and government response showed \"how utterly absurd the situation is\".\n\n\"The whole thing is a complete farce,\" he said.\n\nTim Costello is calling for a national regulator to be established. (ABC News: Scott Jewell)\n\nMs Boothby said the NT government was currently undertaking a review of its boards and committees, including the NTRWC, to make sure \"the right people are on the right boards\".\n\n\"There may be in the future some changes to some boards, and we will make no apologies for that,\" she said.\n\nCommission weighed down with backlog of complaints\n\nMark Kempster, a now-AGR advocate who previously lost $100,000 to an online gambling addiction, has dealt with the NTRWC.\n\nAfter putting himself on a self-exclusion register, Mr Kempster said he was pestered by three bookmakers and subsequently made complaints to the NTRWC.\n\n\"I found them extremely difficult to deal with,\" he said of the commission.\n\n\"I would be waiting weeks and months sometimes to get feedback or to find out what's happening with my case. Most of the time, I wouldn't hear back from them.\n\n\" They are such a small fish, and they [don't] have the right resources to actually undertake regulation of a whole national industry from where they are. \"\n\nMark Kempster lost $100,000 to an online gambling addiction. (ABC News: Maren Preuss)\n\nMr Shields said the NTRWC provided \"very effective and proactive regulation\", but admitted it was \"currently working through a bit of a backlog\" of complaints against bookmakers.\n\nHe could not say how big that backlog was.\n\n\"We're confident that we have that under control,\" he said.\n\nMr Shields also said he believed the commission's resources were the best they'd ever been, following an overhaul of the NT's gambling laws in 2024.\n\nUnder Mr Shields' chairmanship, the NTRWC has also handed some substantial penalties to bookmakers found to have committed serious breaches, including $75,000 worth of fines to News Corp-backed bookie Betr in 2023.\n\nMark Kemspter was contacted by bookmakers after he had put himself on a self-exclusion register. (ABC News: Maren Preuss)\n\nRecommendation not implemented\n\nDuring the most recent term of federal parliament, a landmark gambling report was delivered by a parliamentary committee chaired by the late Labor MP Peta Murphy.\n\nIt found that one of two explanations for Australia's world-leading online gambling losses was \"insufficient regulation of online gambling and restrictions on gambling advertising\".\n\nOne of the report's 31 recommendations was for a national online gambling regulator to be established, \"with the sole purpose of reducing harm, and with responsibility for all licensing and regulation\".\n\nPeta Murphy chaired an inquiry that recommended a national regulator be established. (ABC News)\n\nThe Albanese Labor government has failed to implement the recommendation.\n\nA spokesperson for federal Communications Minister Michelle Rowland said if Labor was elected for a second term, it would \"work through\" the report's 31 recommendations, \"including the establishment of a national regulator\".\n\n\"We recognise that this is taking longer than hoped, but it's critical that we get this right to ensure that future reforms are effective and comprehensive,\" the spokesperson said.\n\nA spokesperson for the Albanese Labor government says it's still working through the report. (ABC News: Simon Tucci)\n\nShadow Communications Minister Melissa McIntosh said the Coalition had \"a clear approach to gambling reform, including in areas like advertising\".\n\n\"If elected, the Coalition will continue to work with all stakeholders to develop fit-for-purpose policies that protect people,\" Ms McIntosh said.\n\nMr Kempster said the lack of reform, and leaving the NTRWC in charge of industry regulation, was contributing to ongoing harm in the community.\n\n\"They know the harm that the industry is doing, because they can see it in the report that's sitting on the prime minister's desk at the moment which he's refusing to look at,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/drought-funding-delays/105180412",
        "title": "Farmer waits on drought relief payments for months",
        "publish_date": "Tue, 15 Apr 2025 20:42:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Some South Australian farmers experiencing drought conditions are still waiting on assistance, despite government relief packages being made available months ago.\n\nMichael Kowald is a second-generation farmer in the Adelaide Hills and applied for a grant with a state government rebate scheme in January.\n\nBut on Tuesday morning, Mr Kowald still had not heard back from the state government.\n\n\"It's coming up to three months with no contact, and that's the only thing I've applied for in this round,\" he said.\n\n\"We could probably have had this done already.\"\n\nMichael Kowald says farmers across the state are feeling the impact of dry conditions. (ABC News: Guido Salazar)\n\nMr Kowald is one of many residents doing it tough in the Hills region due to a lack of rainfall last winter.\n\n\"I've seen dry summers and we can deal with those, this one's taking a bit more of a toll,\" Mr Kowald said.\n\n\" The low rainfall and no rain … I reckon it's one out of the box. \"\n\nMr Kowald said he's not the only dairy farmer in the region experiencing hardship.\n\n\"We're all in the same boat,\" he said.\n\n\"Everybody's dealing with the same issues, and that goes statewide too.\n\n\"It doesn't matter what you're farming, you're experiencing dry times.\"\n\nProjects halted as cash flow falls stagnant\n\nIn order to provide stock water for his cattle, Mr Kowald wants to restore an old bore on his property.\n\nHe applied for a $5,000 grant from the state government to help bring potable water up from 40 metres below ground.\n\nMichael Kowald says drought conditions in the Adelaide Hills are taking a toll on farmers. (ABC News: Guido Salazar)\n\n\"A simple solar pump would fix this problem, bring the water up from the ground,\" he said.\n\n\"[I was] using that $5,000 to assist with that project, and it's all come to a standstill.\"\n\nMr Kowald said the delay in getting the funding means he won't finish the job for months.\n\n\"I was planning to do it in February … things have changed a little … so I'll probably sit on the project a bit longer,\" he said.\n\nThe state government has vowed to get money out quicker to farmers affected by drought. (ABC News: Guido Salazar)\n\nLast week, the government acknowledged the delays experienced by farmers across the state and vowed to process applications within 30 days.\n\nThis week, a second round of the On-farm Drought Infrastructure Rebate Scheme was opened for applications.\n\nTreasurer Stephen Mullighan said extra staff have been hired to streamline that process.\n\n\"Farmers who have previously experienced delays should see money flowing far more quickly than what's been the case before,\" he said.\n\nOn Tuesday afternoon, Mr Kowald was contacted by the state government after an interview with ABC News.\n\nOpposition calls for wider relief eligibility\n\nThe state government's $55 million drought relief package announced last week also includes financial relief through rebates for the Emergency Services Levy (ESL) and commercial vehicle registration fees.\n\nBut these rebates are only available to those receiving the Farm Household Allowance, a means-tested payment run by the Commonwealth.\n\nOpposition Leader Vincent Tarzia said that means relief is not getting to enough people in need.\n\n\"On our numbers it's only hundreds of farmers across the state that actually qualify for that, but we know that there's around 9,000 farming businesses across the state,\" he said.\n\n\" It's only going be a fraction of farmers in our state that would be able to qualify … and that's just simply not good enough. \"\n\nMr Tarzia called on the government to make more farmers eligible for that relief.\n\n\"The government should open up that criteria to make sure that they can provide that assistance to farmers right across the board,\" he said.\n\n\"Because we know that many are going through a drought that has never been seen like this before.\"\n\nThe opposition has called on the government to expand the eligibility of drought relief funding. (ABC News: Guido Salazar)\n\nIn response, Mr Mullighan said the government is using the means test put in place by the Commonwealth and does not intend to change that.\n\n\"We are trying to focus on those farmers, and those other people adversely affected by the drought who are in the most need,\" he said.\n\n\"We are making sure the money gets out to them and gets out to them as quickly as possible.\"\n\nMr Kowald said the Farm Household Allowance would be \"tricky\" to apply for and he does not believe it is \"for him\" anyway.\n\n\"I hope there are farmers in SA getting it and able to get the things the government are offering along with that,\" he said.\n\n\"It's a good package and it does help, it's just not for everybody.\"\n\nThe Bureau of Meteorology is predicting an 80 per cent chance of any rain for the town of Stirling on Saturday.\n\nBut Mr Kowald said even rain will not instantly solve the issues farmers are facing.\n\n\"It'll give us green grass. It's not going to fix the feed shortage, it's not gonna fix that need to get feed immediately.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/fremantle-patrick-voss-afl-tribunal-nick-vlaustin/105181292",
        "title": "Docker Voss fails to reduce ban for strike that left Tiger with broken nose",
        "publish_date": "Tue, 15 Apr 2025 20:37:44 +0000",
        "category": "sports",
        "authors": [],
        "text": "Patrick Voss must serve his three-game ban after the AFL tribunal ruled his roundhouse on Richmond defender Nick Vlastuin was severe in its impact.\n\nThe Dockers argued at Tuesday night's tribunal hearing the charge should be downgraded to high impact, which would have reduced the penalty by one game.\n\nVlastuin was left with a broken nose and tribunal chair Jeff Gleeson KC said he could have suffered a more serious injury.\n\n\"It is apparent from the video footage that the force here was very considerable indeed,\" Gleeson said in his verdict.\n\n\"The players met at speed and Voss swung his arm at speed.\n\n\"The extent and nature of the force of impact and the fact that full force of the impact struck Vlastuin's face leads us to find that the potential for more serious injury was real.\n\n\"The video evidence shows quite clearly that this was a forceful blow to the head, and one that experience and common sense indicate could have readily result in a concussion.\"\n\nDockers advocate Tim Hammond SC pointed to Richmond's medical report, which said Vlastuin was not concussed.\n\nThe Tigers added Vlastuin will not miss any training and is available for Saturday night's game against Gold Coast at Docklands Stadium.\n\nBut after deliberating for nearly half an hour, the tribunal jury ruled the original penalty would stand.\n\nVoss attempted to lay a tackle on Vlastuin during the Dockers' 61-point win on Sunday, but caught the Tigers premiership player across the face with a swinging right arm.\n\nVlastuin collapsed from the impact and was sent from the field under the blood rule.\n\nThe incident was graded as severe impact, high contact and careless conduct by match review officer Michael Christian.\n\nTigers midfielder Tim Taranto remonstrated with Voss, and Vlastuin made a swinging arm motion when he described the incident to medical staff as he was helped from the field.\n\nHe was later spotted chatting amicably with Voss after the full-time siren.\n\nIn the Tribunal hearing, AFL advocate Amara Hughes said there were six reasons why it was severe impact, including the risk of a more serious injury.\n\nThe Dockers pointed to a tribunal case two years ago when Port Adelaide's Willie Rioli faced a three-game game for striking Essendon opponent Jordan Ridley.\n\nWhile Ridley missed a game because of his injury from the incident, Rioli's charge was downgraded from severe to high and his penalty reduced to two matches.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-16/federal-election-blog-2025-live-dutton-albanese-/105180768",
        "title": "Live: Dutton 'too aggro' to be PM, Wong says, after Russian base comments",
        "publish_date": "Tue, 15 Apr 2025 20:32:34 +0000",
        "category": "finance",
        "authors": [
            "Andrew Thorpe",
            "Caitlin Rawling",
            "Kate Higgins",
            "Tom Crowley",
            "On The Trail With Dutton",
            "Stephen Dziedzic"
        ],
        "text": "Peter Dutton has been asked if his comments have risked damaging the relationship Australia has with Indonesia.\n\n\"The fact is when you have a foreign minister, a defence minister and a prime minister finding out about decisions from our friends and countries abroad, when they found out about that on CNN or Fox or whatever, you know this government is not up to it,\" Dutton says.\n\nHe says if we want to have strong relationships we need to be having open discussions.\n\n\"That has not happened here, so there are a lot of details I hope we can get out of the briefing. The government has delayed the briefing obviously, and we'll hopefully get that briefing today,\" he says.\n\n\"How on Earth can the prime minister of our country only find out about these activities in relation to the naval ships circumnavigating the country from a Virgin pilot?\n\n\"How can the foreign minister not have had a phone call from her counterpart in the United States to say tariffs were coming?\n\n\"This is a government out of its depth in relation to international relations and I think they have demonstrated it in the defence space as well.\n\n\"The relationship between Indonesia and Russia is closer and we want to work very closely with Indonesia, because we don't want a presence of Russian assets in our region.\n\n\"It would be difficult for us, difficult for other Asian nations and that is not something we should sit idly by and pretend is not part of a discussion,\" Dutton says.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/romance-book-event-interrupted-by-firefighters-after-fire-alarm-goes-off-20250416-p5ls76.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Romance book event interrupted by firefighters after fire alarm goes off",
        "publish_date": "Wed, 16 Apr 2025 11:59:45 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Romance book event interrupted by firefighters after fire alarm goes off\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/pictures-capture-prince-william-s-hope-and-heartbreak-during-champions-league-thriller-20250416-p5ls51.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pictures capture Prince William’s hope - and heartbreak - during Champions League thriller",
        "publish_date": "Wed, 16 Apr 2025 11:59:26 +1000",
        "category": "sports",
        "authors": [
            "Tom Morgan"
        ],
        "text": "Aston Villa’s hopes of a Champions League miracle were extinguished in agonising fashion as a valiant fightback against Paris Saint-Germain fell narrowly short in their quarter-final second leg on Wednesday morning (AEST).\n\nPrince William and Prince George, who passionately support Aston Villa, were in attendance and riding the emotions of the night. The Prince of Wales’ face said it all in pictures that tell the story of the night the dream ended.\n\nPre-match nerves\n\nPrince William and Prince George get ready for the big game. Credit: Getty Images\n\nA stiff drink might be required, but Prince William opts for water instead just minutes from kick off in the VIP box. Villa’s most famous fan looks significantly more anxious than the cool, calm and remarkably insightful William who was on punditry duties pre-match last week.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/it-can-t-last-why-gould-believes-galvin-won-t-see-out-tigers-deal-20250416-p5ls52.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It can’t last’: Why Gould believes Galvin won’t see out Tigers deal",
        "publish_date": "Wed, 16 Apr 2025 11:55:00 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Loading\n\n“Every decision, everything we try to teach our players, and everything we try to build about a culture of a club, and we talk about culture and all that, there has to be a club-first mentality,” Gould said.\n\nSpeaking on the Six Tackles with Gus podcast , Gould feared there could be “long-lasting effects” after the team turned on the teenager.\n\nTigers coach Benji Marshall, at the urging of senior players, has dropped Galvin to NSW Cup after Galvin revealed he wouldn’t be staying at the club when his contract expires at the end of 2026, due to a belief he couldn’t take his game to the next level under Marshall.\n\nPhil Gould has described the relationship between Lachlan Galvin and Wests Tigers as “untenable” after the wantaway playmaker put himself before the club.\n\n“The individual comes third. It’s not about the CEO, it’s not about the general manager. It’s not about the coach, it’s not about the trainer, it’s not about the doctor, it’s about what’s in the best interest of the club, then the team, then the individual comes third.\n\n“And with this one, with this statement, they’re putting the individual first. Lachlan is putting himself first over the rest. I found that, firstly, extraordinary that that would be endorsed – and also that it is untenable, it can’t go on. It’s not going to last.”\n\nGalvin will play at Lidcombe Oval on Easter Monday for Western Suburbs and it’s unclear how long his demotion will last. Gould predicted the parties would have to cut ties early, and if that was Galvin’s ultimate objective, it would come at a huge personal cost.\n\n“If in fact it was seen as strategy to create a situation where the club would let him go now, I don’t think that they knew it would degenerate to this level, that within hours, the senior playing group would divorce themselves from his comments and divorce [themselves] from the young player and say we don’t want to play with him,” Gould said.\n\n“Now that’s terrible, that’s terrible for a young player, to have the rest of the playing group say [that] … I think if it was a strategy being used to get him out of his contract in the short term so he can go somewhere next year, well then to that extent it’s probably backfired to where it is at the moment.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/chris-scott-does-not-care-what-anyone-thinks-about-geelongs-late-outs-20250416-p5ls71.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Chris Scott does not care what anyone thinks about Geelong's late outs",
        "publish_date": "Wed, 16 Apr 2025 11:50:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "Chris Scott does not care what anyone thinks about Geelong's late outs\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/entrepreneurship/notorious-internet-message-board-4chan-has-been-hacked-posts-claim-20250416-p5ls3v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Notorious internet message board 4chan has been hacked, posts claim",
        "publish_date": "Wed, 16 Apr 2025 11:49:06 +1000",
        "category": "finance",
        "authors": [
            "Raphael Satter"
        ],
        "text": "The notorious internet messageboard 4chan has been hacked, according to posts circulating online, some of which said that the hacker involved had revealed identifying details of the site’s moderators to the public.\n\nThe alleged hack first came to light when a defunct section of the site sprang back to life with the words “U GOT HACKED” emblazoned across the top, according to Wired magazine.\n\n4chan has for years served as an incubator for some of the internet’s most viral memes, as well a range of subcultures. Credit: Bloomberg\n\nAlon Gal, co-founder of Israeli cybercrime monitoring company Hudson Rock, said the claim of a hack “looks legit”, citing the publicly circulating screenshots purporting to show 4chan’s backend infrastructure.\n\nThe publication TechCrunch cited an unnamed 4chan moderator as saying they had no reason to dispute the authenticity of the screenshots, and the site was only intermittently available on Tuesday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/not-about-the-money-unsw-dumps-controversial-trimesters-20250414-p5lroe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Not about the money’: UNSW dumps controversial trimesters",
        "publish_date": "Wed, 16 Apr 2025 11:46:04 +1000",
        "category": "finance",
        "authors": [
            "Christopher Harris"
        ],
        "text": "The University of NSW will dump its controversial trimester system that allows students to complete their degrees faster and revert to a traditional academic calendar in a bid to give students a better on-campus experience.\n\nVice chancellor Attila Brungs said the message from 5000 students who provided feedback was they wanted to engage deeply in subjects and have more time for part-time work, internships and extracurricular activities.\n\nIt’s back to normal service at the University of NSW from 2028 when trimesters will be dumped and replaced with normal semesters. Credit: Louise Kennerley\n\n“It’s not about the money, no, it’s about getting a really good student experience,” Brungs said of the decision to come into effect in 2028.\n\nIn 2019, the university and its then vice chancellor Ian Jacobs unleashed a firestorm of criticism for adopting the trimester model – which was decried as a shameless money-making exercise by students. Protests attended by about 1000 students erupted on campus while a social media account was set up called UNSW Cry-mesters, with the objective of getting the whole thing binned.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/tigers-to-blame-as-bullies-and-hypocrites-pile-on-galvin-20250416-p5ls5k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tigers to blame as bullies and hypocrites pile on Galvin",
        "publish_date": "Wed, 16 Apr 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Peter Fitzsimons"
        ],
        "text": "Loading\n\nThe Lachie Galvin carry-on?\n\nFriends, when it comes to hyperbolic hypocrisy, when it comes to bullying bastardry, when it comes to sheer shittiness in rugba league, I think we have a post-war record, yes? (Which is saying something.)\n\nFor those who’ve joined us late, Galvin is the 19-year-old wunderkind of the newly resuscitated Wests Tigers, a great player who’s been carving ’em up a little like Benji Marshall in his prime. He’s got verve in his swerve, Veuve in his make-up. He plays champagne rugby league that is a joy to watch!\n\nBut here’s the thing. Marshall is now Galvin’s coach, and despite the Tigers recently tabling a $5.5 million offer for five years of the young man’s services, Galvin quietly declined. He did not loudly decline. He quietly declined. All the noise since has come from Tigers management and players. It is understood that the reason for Galvin declining to sign the contract is not because he wants more money, necessarily, but because he thinks he might become a better player under another coach, and that Marshall is not necessarily his kind of coach.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/musicals/mahalia-barnes-jesus-christ-superstar-20250317-p5lk6h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What made Mahalia Barnes say yes to Jesus Christ Superstar",
        "publish_date": "Wed, 16 Apr 2025 11:31:00 +1000",
        "category": "finance",
        "authors": [
            "Elizabeth Flux"
        ],
        "text": "It was around this age that she and her younger siblings started performing more formally – first with their father, then as a group called the Tin Lids. She’s quick to clarify that the band skewed more towards the fun than the serious. “I say this all the time, but we were no Jackson Five. We were just kids, do you know what I mean? But everyone we knew was making music, so we thought, well, why don’t we get to do that?” Her family is never far from her mind. I quickly learn that both her parents are excellent cooks, that her eldest daughter is following in her footsteps as a singer-songwriter, and that her husband, fellow musician Ben Rodgers, is also a skilled photographer. “We’ve got a massive family. There’s lots of us. With my mum and dad, there’s four of us, and I’m the oldest of the four – but I’ve got older half-siblings as well, who I’m also close with, but didn’t grow up in the same way with.” Zaru soba noodles, seared tuna, bonito-infused aged soy. Credit: Jason South I don’t know if Barnes would agree with my assessment of her as easygoing. Both she and her mother are eldest children, and she feels that there is a certain personality type that goes along with that. “I take on a lot of responsibility, whether it’s mine or not. I feel the need to manage all the situations. But really, it’s just that I’m a control freak,” she says with a laugh.\n\n“I think that there was a lot of responsibility for me growing up with my siblings as well, just because of the way our lifestyle was. We’re a very close family, so I’m lucky – it’s not a weight that I’m unwilling to have.” As we leisurely make our way through the different small dishes, Barnes makes it feel like she has all the time in the world when in reality her life is a careful juggling act of work, family and a collision of the two. She and her husband are raising two daughters aged eight and 15 while also touring regularly. As a musician, she performs solo and with her band, while also taking on projects like her current role. On days off from Jesus Christ Superstar she’ll arrange gigs or work on other projects. I’m just about to ask how she navigates all this when she says,“I also manage my dad – but he works more than I do.” Barnes worked as her father’s tour manager for many years before slowly transitioning into her current role. “It was a gradual progression,” she explains. It can be tricky, trying to navigate the personal and the professional. Mahalia Barnes as Mary Magdalene and Michael Paynter as Jesus in the Melbourne production of Jesus Christ Superstar. Credit: Luis Enrique Ascui “There’s definitely some moments that are testing. We get along very, very well, and I think that where it works in this role is that [my mum and dad] know that no one could possibly care more than I do as his child,” she reflects. “Some days when I have to tell them something they don’t want to hear, that’s always ... no one really wants to be told what to do by their child.” Being family makes her both the most qualified and the least qualified she reflects. “So it’s going well, but it’s a lot. It’s hard.” And, she adds, with her eldest daughter now starting to release music, “suddenly we’re in a position where Ben and I are managing her too, essentially”.\n\nIt seems fitting that Barnes explains how she navigates her intense schedule while also casually dissecting and serving out the flounder, something she makes look effortless, but which 10 minutes later I learn is far from the case. As I tentatively cut into it with a spoon she looks on with a quiet concern and I apologise for possibly mangling it. (“No, no,” she reassures me. “It’s just that that’s the difficult part, because there’s all the little bones”.) The sauce that comes with the fish is a particular favourite – and one that she and her husband have (unsuccessfully, she adds) attempted to replicate at home. Food, she explains, is one of her love languages. “Food and music.” Whenever she can, she cooks for her friends and family. On the set of Jesus Christ Superstar on days when they are performing two shows she will duck out to find some kind of treat to bring back to share with everyone to boost morale and energy. The bill at Supernormal. Credit: Though she has been approached to take part in musicals previously, Jesus Christ Superstar is the first one she’s said yes to. “As an artist, I would say I’m more of a blues, soul, rock ’n’ roll type singer. And part of what I love and am drawn to about that sort of music is the freedom of expression and the spontaneity and the improvisation and all of those things that maybe don’t really fit into the musical theatre world.” Barnes chose this musical because it resonated with her – partly because of the music itself and partly because as part concert, part theatrical production, it didn’t hew too closely to more traditional musical theatre. She feels there’s more flexibility in the story for musicians to express themselves.\n\nWith lyrics by Tim Rice and music by Andrew Lloyd Webber, Jesus Christ Superstar started as a concept album in 1970 and, following the success of the music, was developed into a Broadway production the following year. It tells the story of Jesus and Judas, with the narrative dissecting themes of fame, love, power and betrayal. Going into the musical, Barnes’ initial read on her character was that “it felt a little bit too passive, for my liking, a little bit too, I guess, gentle, a little bit weak”. On paper, Mary Magdalene’s role in the musical is a conciliatory one. She tends to Jesus and interrogates her own emotions. Barnes was keen to bring “a little bit more strength” to the role. “I’m not coming out there trying to change the character drastically, but just trying to maybe reinterpret and understand that the ‘being gentle’ approach doesn’t have to equal weak.” When I see the show a few days later, it’s clear she has succeeded. Barnes’ Mary is both calming and fierce, holding her own in the quiet battle between herself and Judas. Loading She points to the tension that runs through the story. “Mary’s role is to come in and sort of settle that down a little bit and bring a little bit of calm to the group, to Jesus, and try and bring that to the community,” she reflects. “I mean literally I come in and say everything’s all right, you know.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/comedy/i-guess-i-can-t-ever-do-comedy-again-new-mum-becky-lucas-on-the-medical-emergency-that-changed-her-20250220-p5ldq2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I guess I can’t ever do comedy again’: New mum Becky Lucas on the medical emergency that changed her",
        "publish_date": "Wed, 16 Apr 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Nick Dent"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Famous comedians typically don’t hand out their phone numbers to just anyone, but Becky Lucas is the exception. If you check out the details for her upcoming shows, you’ll find her phone number listed in her artist blurb, along with an invitation to text her and ask her to “say something funny”. Lucas came up with the idea because, with a new baby, George, keeping her so busy, she didn’t have the time to write the usual funny bio. Instead, she thought punters could decide whether to see her based on her witty replies. What could possibly go wrong? The number, for a start. Becky Lucas worried that she might not be able to perform stand-up again after her son was born with a heart condition. Credit: James Brickwood “Some poor woman in the Blue Mountains called Mary started receiving hundreds of text messages from people saying, ‘Tell me something funny’. I gave her a nervous breakdown, I think. “Anyway, it’s fixed now, so you can text me, but I have to say, it’s quite a huge job to be texting a bunch of people back.” She sighs. “I really should have just written the bio.” Although her nervous manager urged Lucas to get a burner phone for the exercise, she hasn’t been trolled on the number.\n\nAdvertisement\n\n“I haven’t received any vitriolic text, which I think means I’m, you know, not famous enough.” But Brisbane-born Lucas has been a professional stand-up for over a dozen years, hosted the Melbourne International Comedy Festival Gala, and delivered an insouciant five-minute set on Conan O’Brien’s show in 2019. During her appearance, she joked with the legendary late-night host that his dogs could tell if he had cancer. She was offered the spot after supporting O’Brien at the State Theatre in Sydney. “Nothing happened, though. You know, back in the day, you’d do well on late night TV, and then you’d have the whole world at your fingertips, but these days, everyone’s a star.” We’re chatting ahead of Lucas’ new tour, titled Things Have Changed, but the Essence Remains. It’s her first stand-up show since 2022 and her first since becoming a mum. For a while, Lucas had doubts it would happen at all. The past year has not exactly been funny, she says. Becky Lucas performing at the Melbourne International Comedy Festival in 2022. “My lovely little son was born with quite a complex heart defect that was picked up in utero, the 20-week scan. And so, my pregnancy, my first child, the journey was quite different. There’s so much about it that was normal and joyful, but there was just a lot of terror and anxiety around it.”\n\nAdvertisement\n\nIn August 2024, when George was five months old, he underwent five hours of open-heart surgery and spent 11 days recovering at the Children’s Hospital at Westmead. “I was so sad and so scared that I just thought, ‘Oh, I guess I can’t ever do comedy again.’ How can I marry these two parts of myself, like, being silly and irreverent, and then dealing with the heaviest, saddest thing possible?’ “This show was written in the times when things were improving. And now, he’s recovered fully, he’s doing so well. I’ll always worry, but life is pretty good. And returning to stand-up feels like things are normal again.” Lucas’ new show is not entirely about parenthood but, of course, it’s a part of it. “It really does take a toll on your body. Having a kid is just being hunched over a bag and fiddling around with zips constantly. I’m like the letter C.” Oddly enough, Lucas has been thinking about motherhood since she was little. In her 2021 memoir, Acknowledgments, she recalls walking into rooms as a child and announcing that she loved kids but was not sure if she’d be ready to have them. Her exasperated stepmum would reply: “For god’s sake! You’re seven years old!” Lucas now realises that this obsession stemmed from her parents’ divorce. “Maybe I realised that I was a bit of a hindrance,” she says.\n\nAdvertisement\n\nLucas grew up on the mosquito-ridden Coochiemudlo Island, off Victoria Point in Moreton Bay. Her mum, Mandy, is a country music singer, and her dad, Timothy, is an inventor who created the puddle flange, now a standard feature in Australian bathroom drains. They split when Becky was two. She attended Brisbane State High, a selective public school she describes as “a microcosm of the world”, graduating three years after Matt Okine, with whom she later helped write the Stan series The Other Guy. (From left) Frank Woodley, Joel Creasey, Becky Lucas and Sam Simmons in the series LOL: Last One Laughing. Credit: Amazon Prime Video The stand-up penny dropped for her during a visit to San Francisco, where she stayed with an American flame from an earlier backpacking trip to Brazil. It quickly became crushingly obvious that the guy didn’t really want her staying in his apartment and was avoiding her. Left to explore the city on her own, she found her way to The Purple Onion comedy club in North Beach. After the hit her self-esteem had taken, the idea of getting up on stage herself no longer seemed so scary. She made the finals of Raw Comedy in 2013, and from there, she was off and running. But Brisbane isn’t the most welcoming environment for a young comedian. “You’re doing some of the worst gigs in the country, like RSLs, pub gigs, gigs at truck stops on the side of the road.” This is the origin of Lucas’ style, which a Herald Sun reviewer accurately likened to “putting a silencer on a gun: you don’t hear the pearlers coming, you only know when they hit”.\n\nAdvertisement\n\n“You won’t find many Brisbane comics telling long stories with a soft finish,” she says. “You have to pretend you’re constantly performing next to a screen with dog racing, because you probably are.” She was once paid to perform in broad daylight at a food court in a regional Queensland shopping centre, to a tiny and completely uninterested audience, as part of a Mexican food promotion. It lasted two minutes before the franchisee gently escorted her off. Becky Lucas says motherhood is the “most beautiful, meaningful thing I’ve ever done”. Credit: James Brickwood In 2013, at 24, she moved to Sydney and bonded with the Brisbane wave of comedians: Okine, Mel Buttle, Sam Campbell, Damien Power, and Josh Thomas. Before The Other Guy, she contributed to two seasons of Thomas’ show Please Like Me, working in the writers’ room to punch up scripts and make the other writers laugh. Loading Not everything she writes does so well. In 2018 Lucas was banned from Twitter for drunk-tweeting that she would behead then-prime minister Scott Morrison. “It’s something I always say to people,” she said at the time. “‘Oh, I’m going to chop your head off!’ It’s a joke. I say it to my friends.” She now thinks her account might have been reinstated because Elon Musk doesn’t care. But she can’t remember her username. “I wouldn’t mind being able to log back on, but I also think, why would I want to introduce that back into my life?”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-john-howard-in-perth-to-help-liberals-win-key-seats-20250415-p5ls1n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: John Howard in Perth to help Liberals win key seats",
        "publish_date": "Wed, 16 Apr 2025 11:24:16 +1000",
        "category": "finance",
        "authors": [
            "Heather Mcneill"
        ],
        "text": "Two Mineral Resources directors tasked with supervising a governance overhaul in the wake of an offshore tax scandal involving its founder Chris Ellison have resigned with immediate effect.\n\nThe iron ore miner declared the departure of Jacqueline McGill AO and Susie Corlett in a statement to the market this morning, an announcement which coincides with a plummeting share price that has wiped more than $3 billion from the business in the past six months.\n\nLoading\n\nCorlett, who also serves as a non-executive director at Iluka Resources and Aurelia Metals Ltd, leaves after more than four years on the board of the company, while McGill departs after just 15 months.\n\nThe pair were appointed to the governance committee the Osborne Park-headquartered miner established in late 2024 after the Australian Financial Review exposed an alleged offshore tax scheme Ellison and four other executives had profited from that ran for a decade.\n\nThe committee had been tasked with strengthening governance practices by introducing new protocols for related party transactions, exiting legacy agreements between MinRes and its senior directors and eliminating the use of company resources by key managers.\n\nThe departures come as the corporate watchdog continues its probe into the scheme, which is set to cost Ellison his managing director role at the company he founded in 2006.\n\nMinRes chair James McClements, who also intends to depart the company after more than 10 years, thanked the pair for their “enormous” contributions and wished them well.\n\n“Both Susie and Jacqui have dedicated substantial time and effort over recent months in our efforts to improve governance and procedures across the business, whilst navigating their significant other professional commitments,” he said.\n\nShares in the miner were down 3.5 per cent this morning to trade at $17.62.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/100-leggings-for-five-bucks-the-viral-tiktok-post-taunting-us-consumers-20250415-p5lrv4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "$100 leggings for five bucks? The viral TikTok post taunting US consumers",
        "publish_date": "Wed, 16 Apr 2025 11:23:48 +1000",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "Chinese manufacturers purportedly behind big-name brands like Nike, lululemon and Ralph Lauren are hitting back at US tariffs on TikTok by exposing the actual cost of making their products.\n\nIn a video from user LunaSourcing China, which has now clocked more than 12 million views and 1.4 million likes, a woman claims to reveal the manufacturers of brands like lululemon, Fila and Under Armour.\n\n“They sell you a legging pants for $100. And guess what, here in these two factories you can get them for around five to six bucks,” she says in the video.\n\nThe woman also claims that “the material and craftsmanship are basically the same because they all come from the same production line.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/shaine-dowd-jokes-about-tasering-his-mother-20250416-p5ls6j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Shaine Dowd jokes about Tasering his mother",
        "publish_date": "Wed, 16 Apr 2025 11:12:21 +1000",
        "category": "finance",
        "authors": [],
        "text": "Shaine Dowd jokes about Tasering his mother\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-vegemite-is-causing-a-stir-in-canada/rjgnk5s8m",
        "title": "Canada's war on Vegemite: Why this Aussie icon is causing a stir",
        "publish_date": "Wed, 16 Apr 2025 01:44:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Found Coffee, a chain of Aussie-style cafes in Toronto, has become the centre of an unexpected culture clash after Canada’s food authority ordered its owner to stop serving Vegemite.\n\n\n\n\n\nOwner Leighton Walters, who is a dual Canadian and Australian citizen, has been importing the iconic spread for five years but was recently told by the Canadian Food Inspection Agency (CFIA) that Vegemite was non-compliant with its health regulations due to added vitamins in the product.\n\n\n\n\n\n\"I grew up as a Vegemite kid ... eating it for breakfast every second day,\" Walters told CBC Toronto.\n\n\n\n\n\n\"It's an iconic Australian product ... we've been so proud to serve it to thousands and tens of thousands of Australians, Canadians, travellers and tourists,\n\n\n\n\n\n“Pulling Vegemite off our shelves hits at the core and the heart of our brand,” he said.\n\n\n\nPrime Minister Anthony Albanese weighs in\n\nPrime Minister Anthony Albanese has come out in support Walters.\n\n\n\n\n\nAfter reporters asked if he had a message for Canada, the Prime Minister said \"I stand with the Aussie café owner\".\n\n\n\n\n\n\"I can confirm here today that I am pro-Vegemite. I actually put a lot of Vegemite on my toast when I eat bread,\" the Prime Minister added.\n\n\n\n\n\n\"It’s a good thing. I did hear the report — it’s rather odd they’re allowing Marmite, which frankly, is rubbish. Let’s be clear, I’m pro-Vegemite, anti-Marmite. That’s my position.\"\n\n\n\n\n\nVegemite’s British rival, Marmite, was granted approval by CFIA in 2020 despite the fact that an earlier shipment was blocked due to concerns about added vitamins.\n\n\n\n\n\nIn a video posted to Instagram, Walters shared his disappointment over the CFIA’s decision to remove approximately $8,000 worth of stock and ban the spread from the cafe's menu.\n\n\n\n\n\n\"Despite Amazon and major grocery stores continuing to profit of the sale of Vegemite and similar products like Marmite, for some reason, our genuinely Australian/Canadian coffee shops offering a healthy slice of home away from home, is seemingly worth targeting,\" Walters said.\n\n\n\n\n\nSpeaking from a hospital bed while receiving treatment for spina bifida, a condition linked to folate deficiency at conception, he said Vegemite had a personal significance of Vegemite, which is fortified with folic acid.\n\n\n\n\n\n\"Spina bifida exists because there's a lack of folate in the diet at conception. One of the major things that Vegemite adds to everyone's daily intake is folate,\" Walters said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/a-lot-of-risk-why-buying-a-new-property-isnt-appealing-to-some-first-home-buyers/g0xohrx2o",
        "title": "'A lot of risk': Why buying a new property isn't appealing to some first home buyers",
        "publish_date": "Tue, 15 Apr 2025 19:49:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sam (not his real name) worries about putting his life savings into an off-the-plan new home, fearing the risks involved.\n\n\n\n\n\nIt's taken the 30-year-old at least two years of intentional saving to grow his deposit to around $30,000.\n\n\n\n\n\nThe Canberra resident doesn't want to take any unnecessary risks when deciding on a property.\n\n\n\n\n\n\"I know a few people have done it, but I feel like it's assuming a lot of risk in something that's already a big leap,\" he told SBS News of buying a new build.\n\n\n\n\n\nHe said new policies released by the major parties for first home buyers \"hold some weight\" as he considers his vote ahead of the upcoming election, because it will directly influence the purchase of his first home.\n\n\n\n\n\nOver the weekend, the Coalition unveiled its plan to allow first-home buyers access to tax-deductible interest payments on their first home — if they buy a newly built property.\n\n\n\nLabor also announced a plan in partnership with the states and territories aimed at getting people into newly built properties, saying it will spend $10 billion over eight years to build 100,000 new homes, exclusively for first-home buyers.\n\n\n\n\n\nHousing Minister Clare O'Neil told the ABC Insiders program that prices for the homes would be negotiated state by state, but the aim is to create affordable housing for low and middle-income earners.\n\n\n\n\n\n\"In the South Australian example, we're building homes at that affordable entry level of the market, somewhere between $500 and $600,000,\" O'Neil said on Sunday morning.\n\n\n\nHousing Minister Clare O’Neil said the commonwealth will expedite the build of new homes and address the underlying supply issue. Source: AAP / Mick Tsikas Sam said he preferred Labor's proposal for 100,000 new homes because adding to supply might bring prices down.\n\n\n\n\n\nBut he is still worried about the risks involved with buying off-the-plan.\n\n\n\n\n\nHe said another problem is that new freestanding houses are often built on the outskirts of major cities where land is cheaper.\n\n\n\n\n\nThese are far from workplaces and other opportunities.\n\n\n\n\n\n\"Or you take a gamble on a new build apartment, which might get you closer to the CBD but [it's] still outrageously priced for a shoebox,\" he said.\n\n\n\n\n\n\"Plus it feels irresponsible to go that way with one’s life savings [considering] the current trend in new build standards — look at the incident in Mascot a few years ago with that whole apartment block,\" he said about the Mascot Towers complex in Sydney that is now uninhabitable due to serious cracks that appeared in 2019.\n\n\n\nSam said he may also have to wait longer to move into a new build depending on how long it takes to construct, and faces the risk of paying rent at the same time as he's making repayments on a mortgage.\n\n\n\n\n\nIt raises the question, will the housing proposals appeal to the entry-level buyers it's targeting?\n\n\n\nAre we building the right homes?\n\nDr Liam Davies, a lecturer in Urban Planning and Sustainability at RMIT University, said the greatest challenge with Labor's policy is the lack of detail about what will be built and where.\n\n\n\n\n\n\"Building more suburban housing in the urban fringes isn't overly helpful, that market is very well established,\" he told SBS News.\n\n\n\n\n\nHe said developers were also not delivering new homes that were suitable for families, including three or four-bedroom apartments.\n\n\n\n\n\n\"The moment those households want to look at having children, they also have to look at moving,\" he said.\n\n\n\n\n\n\"And you can't sell a flat in the inner city or middle suburbs and buy a townhouse or three-bedroom on a comparable income. You have to be moving further out.\"\n\n\n\nREAD MORE Australia is building a million new homes — but we may not want to live in them\n\nHowever, Matthew Bowes from the Grattan Institute cautioned against this rhetoric, stating that a developer's business model relies on building homes that people are guaranteed to buy.\n\n\n\n\n\n\"Our family sizes are decreasing, and people want to economise on housing costs as house prices have risen, so it’s not surprising to me that a lot of our newer housing stock has fewer bedrooms,\" he said.\n\n\n\n\n\nHe suggested the best way to address housing choice is for state governments to unlock the planning laws that restrict building medium-density housing in these areas.\n\n\n\nAs the government focuses on ramping up new construction, it appears buyer sentiments towards new builds are changing too.\n\n\n\n\n\nOne in three residential homes bought in 2023 were newly constructed, according to Australian Bureau of Statistics (ABS) building activity data analysed by PropTrack.\n\n\n\n\n\nProptrack said several factors contributed to the trend, including the more affordable price of new builds, lower initial maintenance costs, the ability to tailor the home to buyers' specific needs, access to the latest technology and energy efficiency.\n\n\n\nQuality homes can restore consumer confidence\n\nMajor defects in new builds including Sydney's Mascot Towers and Opal Towers, in which residents were evacuated and faced expensive bills, have raised concerns in recent years.\n\n\n\n\n\nConsumer confidence in off-the-plan builds, particularly apartments, has also been rocked by media reports of gas explosions, water leaks, flammable cladding and fire safety issues.\n\n\n\n\n\nA NSW strata survey in 2023 found 53 per cent of buildings had serious defects in common property, but it found faults in newer buildings were on a downward trend.\n\n\n\n\n\nSome home buyers have faced lengthy disputes and high-strata fees as they work with developers to correct the issues.\n\n\n\n\n\nDavies acknowledged the hesitation this has created in the new-build market.\n\n\n\nDefects in apartment buildings across the country have contributed to a crisis in confidence among first-home buyers. Source: Getty / Andrew Merry \"There is a certain amount of hesitation amongst buyers for buying off-the-plan because of building defects, but also because of changes the developers can make,\" Davies said, referring to changes made during construction that were not included in original plans.\n\n\n\n\n\n\"And I think that any policy that a state government would be looking to introduce to become a producer of housing does need to provide confidence to those purchases.\"\n\n\n\n\n\nDavies said the way to restore first-home buyer confidence was through quality builds.\n\n\n\n\n\n\"The government producing quality dwellings that people want to buy and want to live in — that is what will start to drive confidence in these types of schemes,\" he said.\n\n\n\n\n\nBowes added that both the NSW and Victorian governments had taken \"really positive\" steps to improve building regulations and ensure quality builds.\n\n\n\nIn March, the Victorian government introduced legislation to create a new building and plumbing watchdog to oversee aspects including regulation, insurance and dispute resolution.\n\n\n\n\n\nThe new regulator will have the power to stop the completion of off-the-plan sales for apartment buildings if serious defects aren't rectified.\n\n\n\n\n\nThe bill, which is yet to pass the upper house, includes a developer bond scheme. It will require builders to put aside a bond — 2 per cent of the cost of construction — which can later be released to cover repairs.\n\n\n\n\n\nWhile the government aims to protect consumers and restore confidence, the Property Council of Australia has said the significant reforms have been rushed through and need adequate industry consultation.\n\n\n\n\n\nThe Victorian changes mirror those made in NSW in 2023, to give inspectors the ability to stop construction while defects are investigated; a similar security scheme to use as insurance in case of building issues; and powers to immediately suspend building certifiers and practitioners.\n\n\n\nCan Australia build enough homes?\n\nIn August 2023, National Cabinet agreed on a target of building 1.2 million \"new, well-located homes\" across the country by 2029.\n\n\n\n\n\nThe Albanese government has faced scrutiny over whether this is possible, as it would require the industry to build around 240,000 homes a year.\n\n\n\n\n\nHal Pawson is a professor of Housing Research and Policy at the UNSW City Futures Research Centre.\n\n\n\n\n\nHe says history shows the industry is capable of \"significant scale\", pointing to the booms of government-led construction after World War Two.\n\n\n\n\n\n\"They were building homes for sale at cost price, and that was one of the key reasons why we saw a very rapid increase in the home ownership rate in Australia … in the 50s and 60s in particular,\" Pawson said.\n\n\n\nMore recently, a construction boost between 2015 and 2019 saw over one million residential units and houses built. This peaked in 2018 with the construction of 219,285 dwellings according to the ABS.\n\n\n\n\n\nO'Neil is confident Labor's target can be met and cheaper homes built, especially with Commonwealth assistance helping buyers to gain access to land and shorten timelines.\n\n\n\n\n\n\"One of [the levers] is that we've got access to land that's available from state, local and federal government,\" she said.\n\n\n\n\n\n\"We can also ask the states to do things like significantly truncate the timelines.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/the-australian-suburbs-at-risk-of-becoming-un-insurable-due-to-climate-fuelled-disasters/7z5cu03ii",
        "title": "The Australian suburbs at risk of becoming un-insurable due to climate-fuelled disasters",
        "publish_date": "Tue, 15 Apr 2025 09:54:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Australian suburbs at risk of becoming un-insurable due to climate-fuelled disasters\n\nPublished 15 April 2025, 9:33 am\n\nAccording to a report commissioned by the Climate Council, climate-fuelled weather disasters are leading to more Australian homes becoming uninsurable. It identified dozens of areas that are high risk across the country, with many already feeling the impacts on their premiums.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/one-of-the-most-common-sexually-transmitted-infections-in-australia-can-now-be-tested-at-home/84m03kesd",
        "title": "One of the most common sexually transmitted infections in Australia can now be tested at home",
        "publish_date": "Tue, 15 Apr 2025 09:22:30 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "One of the most common sexually transmitted infections in Australia can now be tested at home\n\nPublished 15 April 2025, 8:36 am\n\nAt-home rapid tests for sexually transmitted infections, chlamydia and gonorrhoea, are now available for women Australia-wide. There has been an increase in the STIs across the country - particularly gonorrhoea, which, globally is becoming more resistant to treatment. But scientists believe they've found an new effective antibiotic for the infection.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/albanese-and-dutton-courting-voters-with-housing-policies-and-wage-increases/awm33jt7u",
        "title": "Albanese and Dutton courting voters with housing policies and wage increases",
        "publish_date": "Tue, 15 Apr 2025 09:22:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Albanese and Dutton courting voters with housing policies and wage increases\n\nPublished 15 April 2025, 7:45 am\n\nOpposition Leader, Peter Dutton, has stopped short of endorsing his own frontbencher's call for wages to rise ahead of house prices. Both party campaigns now converging on the key state of Victoria as the election housing sell continues.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/australias-new-gold-rush-amid-us-trade-war/yjl91bezp",
        "title": "Australia's new gold rush amid US trade war",
        "publish_date": "Tue, 15 Apr 2025 07:40:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's new gold rush amid US trade war\n\nPublished 14 April 2025, 8:06 am\n\nAmid the chaos of the US trade war and stock market ructions, people are flocking to the safety of gold. The precious metal has seen its value surge by more than 20% this year alone as investors take advantage of global economic uncertainty .",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/first-home-buyers-caught-in-the-spotlight-of-election-campaigning/o7ii2qpi9",
        "title": "First home buyers caught in the spotlight of election campaigning",
        "publish_date": "Tue, 15 Apr 2025 07:37:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "First home buyers caught in the spotlight of election campaigning\n\nPublished 14 April 2025, 8:27 am\n\nEconomists and industry experts are raising the alarm about election campaign housing policies, warning they could end up increasing house prices and inflation. First home buyers are in both party’s sights now, outnumbering older voters and considered critical to electoral fortunes.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/some-global-businesses-press-pause-as-tariff-uncertainties-persist/v7we3anq1",
        "title": "Some global businesses press pause as tariff uncertainties persist",
        "publish_date": "Tue, 15 Apr 2025 07:35:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/faddish-teaching-methods-blamed-for-decline-in-maths-literacy/n4iyptve3",
        "title": "'Faddish' teaching methods blamed for decline in maths literacy",
        "publish_date": "Tue, 15 Apr 2025 07:31:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "'Faddish' teaching methods blamed for decline in maths literacy\n\nPublished 14 April 2025, 7:54 am\n\nA Grattan Institute study has found that a third of Australian students are failing to meet basic standards in maths, with many teachers lacking the confidence to teach it even at a Year Six level.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/massive-research-project-finds-new-ways-to-treat-osteoarthritis/c2zr3675r",
        "title": "Massive research project finds new ways to treat Osteoarthritis",
        "publish_date": "Tue, 15 Apr 2025 07:16:22 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAbout one in five people in Australia are affected by osteoarthritis.\n\n\n\n\n\nGlobally - it affects 600 million people.\n\n\n\n\n\nAt the Queensland-based medical research institute QIMR Berghofer, scientist Associate Professor Michelle Lupton was a part of the world’s largest study of the genetics of osteoarthritis.\n\n\n\n\n\n\"Osteoarthritis affects people from all different cultures around the world, this study mainly focused on people of European ancestry, but it also included people of other ancestries. In this particular study we didn't see any differences between or kind of any different findings from these other ancestries. But this is probably just due to the fact that the sample size is much smaller. So one of the important kind of future work that needs to be done is looking more in other ancestries.\"\n\n\n\n\n\nThe findings from an international research team led by Helmholtz Munich in Germany, and involving QIMR Berghofer scientists, have been published in Nature - a science newsletter available online.\n\n\n\n\n\nThe study has identified more than 500 previously unknown genetic links to the disease, and hundreds of potential new drug targets that could fast track the development of more effective treatments.\n\n\n\n\n\n\"The study looks particularly at drug repurposing. This is the idea where instead of developing new drugs, you can use genetics to test whether you think current drugs would be useful in treating arthritis. So basically, we carried out screen and identified more than 270 approved drugs that could target protein that has been shown to be important in the disease. So this opens up these opportunities to repurpose drugs that can accelerate new treatments.]\n\n\n\n\n\nProfessor Lupton says factors such as age, environment, joint overuse, obesity, family history and genetics are among some of the significant factors they identified.\n\n\n\n\n\nMusculoskeletal Health Australia or MHA is a consumer focused organisation.\n\n\n\n\n\nThey support those living with musculoskeletal diseases such as osteoarthritis.\n\n\n\n\n\nHelen Jentz is the CEO at MHA. She says osteoarthritis is the most common joint disease in the country.\n\n\n\n\n\n\"It's around the joints. So think of things like your knee joints, your hip joints. So what happens is the cartilage starts to break down. The cartilage is important because it helps with movement, and it helps with us being able to do things like walk, run, bear weight. And osteoarthritis impacts the cartilage and breaks it down so it's hard when the bone is rubbing together and that's what causes the pain and disability.\"\n\n\n\n\n\nMs Jentz says more than two million people in Australia suffer from osteoarthritis.\n\n\n\n\n\n\"In Australia there are approximately 2.2 million people who are estimated to have osteoarthritis. And this is expected to increase certainly because we have an aging population here in Australia. But the other critical factor is that as our obesity level increase so does the prevalence of osteoarthritis.”\n\n\n\n\n\nShe says osteoarthritis can affect anyone at any age.\n\n\n\n\n\n\"With the increasing prevalence of obesity and overweight in Australia, osteoarthritis and other musculoskeletal diseases in Australia are actually starting to affect people at younger and younger ages.\"\n\n\n\n\n\nMs Jentz commends the study saying MHA will take individualised treatment from that research.\n\n\n\n\n\nDr Leticia Deveza is a rheumatologist based in Sydney.\n\n\n\n\n\nShe deals with rheumatological conditions including rheumatoid arthritis and osteoarthritis.\n\n\n\n\n\nPatients are usually referred to her after seeing a doctor or a physiotherapist if their pain is not decreasing.\n\n\n\n\n\nDr Deveza talks about the difference between osteoarthritis and osteoporosis.\n\n\n\n\n\n\"Osteoarthritis is a joint disease affecting joints in the body - most commonly the hands, the spine, the knees and the hips. While osteoporosis is a disease of the bone metabolism that affects the quality of the bone - predisposes to fracture but is usually asymptomatic.\"\n\n\n\n\n\nThe study found that the number of patients is predicted to increase to one billion by 2050, making osteoarthritis one of the fastest growing health conditions in the world.\n\n\n\n\n\n\"Genetic plays a very big role in osteoarthritis, we know that genetic studies that certain ethnicities are more proposed to getting osteoarthritis particularly the joint in the hips. But it's a disease that affects the population globally -- can affect all ranges. Genetic studies are important to identify the target for the development of the drugs trying to find a cure for osteoarthritis.\"\n\n\n\n\n\nThe researchers uncovered 513 new genetic associations linked to osteoarthritis, bringing the total number of known genetic links to 962.\n\n\n\n\n\nIt also pinpointed eight biological processes involved in osteoarthritis development, providing further targets for therapeutic interventions.\n\n\n\n\n\nThese processes include the circadian rhythm which is the body’s internal clock, and glial cell functions which support the nervous system.\n\n\n\n\n\nProfessor Lupton says her study talks about important disease pathways that may not have been previously looked at.\n\n\n\n\n\n\"One example is circadian rhythm which is our bodies internal clock that regulates sleeping pattern. And the study showed that circadian rhythm seems to have an effect on your rest that could be the disruptions of your circadian rhythm could affect your bones and joint tissues to repair. So that's kind of a new avenue of research that could lead to potentially new drugs.\"\n\n\n\n\n\nThe new insights into the genetic architecture of osteoarthritis could lead to more personalised treatment strategies and help improve the design of clinical trials.\n\n\n\n\n\nThe genome-wide association (GWAS) study is the largest ever performed for osteoarthritis.\n\n\n\n\n\nIt analysed data from genetic samples donated by nearly two million people globally, including nearly 490,000 people diagnosed with the disease.\n\n\n\n\n\nThe datasets included thousands of Australians who participated in other QIMR Berghofer-led studies, funded by the National Health and Medical Research Council (NHMRC).\n\n\n\n\n\nMusculoskeletal Health Australia CEO Helen Jentz urges anyone with questions related to musculoskeletal health to reach out to her team.\n\n\n\n\n\n\"It's a free national Healthline that anyone can ring and talk to a qualified healthcare professional about their musculoskeletal health or about their musculoskeletal diseases. And what we are very focused on is patients and consumer empowerment. So our focus is about providing people with the support and information that they need so that they can make informed decisions about how they manage their musculoskeletal health.\"\n\n\n\n\n\nMs Jentz says at MHA they are research and evidence based providing people with the right tools to make informed decisions about their nutrition, mental health and musculoskeletal health.\n\n\n\n\n\n\"One of the big campaigns that we run each year is called The World's Biggest Sit-In. And what that’s about chair-based exercise. And it's a challenge to everyone to think differently about how they move and how they engage with physical activity. And a first step to doing that could be a chair-based workout. So, you can actually sit in a chair, move, build up a bit of a sweat, build up some cardio, but you're still engaging in movement which is good for your musculoskeletal health.\"\n\n\n\n\n\nDr Deveza talks about the importance of exercise and weight management in treating osteoarthritis.\n\n\n\n\n\n\"In terms of the treating of osteoarthritis we highlight the importance of physical therapy, exercise therapy, and weight management because these are very important factors that drive the progression of the disease with the appropriate exercise program, with the weight management guided by your health professional patients help. Health professionals’ symptoms can improve greatly in the majority of patients.\"\n\n\n\n\n\nAdding that it's important to tailor the treatments accordingly to cater to each patient's capability.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/as-tariffs-bite-heres-why-chinas-president-xi-jinping-is-touring-asia/7rb2czurr",
        "title": "Why Xi Jinping is touring Southeast Asia amid rising tariff tensions",
        "publish_date": "Tue, 15 Apr 2025 06:28:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "After being hit with steep tariffs by President Donald Trump, Chinese President Xi Jinping is stepping up his diplomatic outreach in Southeast Asia, hoping to shore up economic alliances and position China as a more reliable trade partner than the United States.\n\n\n\n\n\nXi's multi-country trip includes stops in Vietnam, Malaysia, and Cambodia — three nations negotiating with the US for lower tariffs on their exports.\n\n\n\n\n\nAt the same time, each country relies heavily on trade with China, leaving them to straddle a diplomatic line between two economic giants.\n\n\n\nWhat's Xi Jinping doing in the region?\n\nXi's first stop was in Vietnam, where he met with the country's top leader, To Lam. The pair announced dozens of new agreements and pledged deeper cooperation in supply chains, green technology, and artificial intelligence.\n\n\n\n\"There are no winners in trade wars and tariff wars,\" Xi said in an article in Nhan Dan, the newspaper of Vietnam's Communist Party, ahead of his arrival on Monday.\n\n\n\n\n\nChina has invested heavily in Vietnam in recent years, especially as manufacturers have relocated from China to avoid earlier rounds of US tariffs during Trump's first term. Despite this, tensions persist between the two over territorial disputes in the South China Sea.\n\n\n\n\n\nNext up, Xi will visit Malaysia, which regards China as one of their largest trading partners. Malaysia is also facing a 24 per cent reciprocal tariff from the US, slightly lower than Vietnam's 46 per cent.\n\n\n\n\n\nOn his final stop, Xi will head to Cambodia, which has been hit with a whopping 49 per cent tariff by the US. Cambodia is a staunch Chinese ally with deep military ties and a Chinese-dominated manufacturing sector. Half of the factories in Cambodia are Chinese-owned, and the two countries have a free trade agreement.\n\n\n\n\n\nXi last visited Cambodia and Malaysia nine and 12 years ago, respectively.\n\n\n\nREAD MORE How Australia could benefit from a US-China trade war\n\nWhat's behind the timing?\n\nXi's tour comes as China faces tariffs of up to 145 per cent from the US.\n\n\n\n\n\nAmid growing economic uncertainty, he is pitching China as a steady, long-term partner at a time when the US's trade policy looks unpredictable.\n\n\n\n\n\nAs Trump's trade war continues to rattle global markets, Xi is likely making a clear pitch: In uncertain times, it pays to bet on China.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-15-april-2025/bb38jyhuo",
        "title": "Evening News Bulletin 15 April 2025",
        "publish_date": "Tue, 15 Apr 2025 06:05:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nAustralia says it's engaging with Indonesia as Russia requests access to a military base\n\nThe Greens ditch a disco fundraiser on Anzac Day after accusations of disrespect\n\nA task force will support Afghan women cricketers.\n\nPrime Minister Anthony Albanese says the government is seeking further clarification from Indonesia about Russia's desire to base several long-range aircraft in the country.\n\n\n\n\n\nMilitary website \"Janes\" has reported that Russia had sought permission for Russian Aerospace Forces aircraft to be based at a facility in Indonesia's easternmost province.\n\n\n\n\n\nAnthony Albanese says the relationship with Indonesia has never been better.\n\n\n\n\n\n\"We have a good relationship with our friends in Indonesia, and we're seeking further clarification.\"\n\n\n\n\n\nAnna Henderson: \" Does it give you a pause for thought and concern about the state of the Indo Pacific and what this could mean, Prime Minister?\"\n\n\n\n\n\nAnthony Albanese: Well our friends in Indonesia, the relationship has never been better than it is right now.\"\n\n\n\n_\n\n\n\nAustralia's finance minister has defended Labor's housing alternative as the stronger policy, as both major parties announce centrepiece measures for first-home buyers.\n\n\n\n\n\nLabor's policy is all about deposit sizes, allowing first-home buyers to purchase with just a 5 per cent deposit while using the Commonwealth as a guarantor.\n\n\n\n\n\nIn contrast, the opposition's pitch hinges on maximising borrowing power, with a push to let Australians draw from their superannuation accounts.\n\n\n\n\n\nIn both cases, economists have raised concerns about the potential for the schemes to further inflate house prices.\n\n\n\n\n\nFinance Minister Katy Gallagher has said she's been advised by Treasury that the impact of Labor's policy on prices would \"not be significant\".\n\n\n\n\n\nSpeaking to ABC Radio, she's restated her confidence in the plan.\n\n\n\n\n\n\"We're not allowing first home buyers to borrow more money or to ransack their super, under the Dutton idea, it's about allowing people to get into homeownership with a smaller deposit.\"\n\n\n\n_\n\n\n\nA disco fundraiser on Anzac Day has caused a stir with the Greens backtracking after accusations of disrespect.\n\n\n\n\n\nIn a since-deleted social media event, Western Australia's Greens advertised a five-hour D-J event in Perth to help fundraise for candidate Sophie Greer and senator Jordon Steele-John.\n\n\n\n\n\nThe event reportedly offered tickets of between $30 and $1000 with an optional donation.\n\n\n\n\n\nIt drew scorn from Opposition Leader Peter Dutton, a former defence minister, who has called it \"completely inappropriate\".\n\n\n\n_\n\n\n\nThe World Food Programme is calling for an end to violence in Sudan on the second anniversary of the civil war.\n\n\n\n\n\nWhile tens of thousands have been killed as a result of the fighting, nearly 25 million more — half of Sudan’s population — are facing extreme hunger, giving rise to what's been called the largest humanitarian crisis ever recorded.\n\n\n\n\n\nOver 12 million people have been displaced from their homes amid a power struggle between the Sudanese military and the paramilitary Rapid Support Forces, which has sharply escalated the humanitarian crisis.\n\n\n\n\n\nFamine was initially confirmed last August the Zamzam refugee camp in Sudan's western Darfur region, where about 500-thousand people have sought refuge.\n\n\n\n\n\nShaun Hughes, the W-F-P's emergency coordinator for Sudan and the region, says it's since spread to other areas in Darfur and Kordofan.\n\n\n\n\n\n\"Two years since the onset of the war, Sudan has now become the world's largest hunger crisis. Nearly half the population are acutely food insecure. Famine has taken hold in parts of Darfur and is spreading. In order to turn the tide, WFP needs access in order to reach people that have been isolated by the conflict and we also need funding.\"\n\n\n\n_\n\n\n\nThe International Cricket Council says it will form a task force to support Afghan women cricketers who have been displaced by the Taliban regime.\n\n\n\n\n\nThe initiative, backed by Cricket Australia, will involve funding and a high-performance program to ensure players can continue pursuing the game.\n\n\n\n\n\nHalima Noori is former member of the Afghan team, and among the 22 players who were evacuated following the fall of Afghanistan to the Taliban.\n\n\n\n\n\nSpeaking to SBS Pashto, she has expressed her gratitude to Cricket Australia for their support, saying that none of this would have been possible without them.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/would-labors-1-000-instant-tax-deduction-really-help-with-the-cost-of-living/95m61cvrb",
        "title": "Would Labor's $1,000 'instant tax deduction' really help with the cost of living?",
        "publish_date": "Tue, 15 Apr 2025 05:31:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's been billed as a time-saver designed to cut down on paperwork, reduce reliance on professional tax advice, and a vehicle for cost-of-living relief.\n\n\n\n\n\nIf re-elected, Labor will let Australians claim an instant $1,000 tax deduction to cover work expenses, something Prime Minister Anthony Albanese says will \"provide more permanent cost of living relief and make tax time quicker and easier for 5.7 million taxpayers\".\n\n\n\n\n\nBut what do the experts think about Labor's proposed tax change?\n\n\n\n\n\nLow-income earners would benefit most\n\nMark Chapman, director of tax communications at H&R Block, says the proposal, which would come in from next year, would benefit lower-income earners the most.\n\n\n\n\n\n\"It does hit the sweet spot between offering cost of living relief, simplifying the tax system for those on very low incomes and retaining the basic right to claim deductions for those on higher incomes, or with more complexity,\" he told SBS News.\n\n\n\n\"If you currently claim less than $1,000 in work-related expenses (for example, if you claim $100), you will be able to claim the full standard deduction of $1,000 – which is effectively a tax cut. This is bound to assist with cost of living pressures for low income earners — not by much, but every little bit helps.\"\n\n\n\nNot a 'substantial' cost of living relief measure\n\nDr Luke Hartigan from the University of Sydney's School of Economics says the initiative will reduce paperwork, but doubts it will significantly help reduce the cost of living.\n\n\n\n\n\n\"I think this is a good initiative and will help reduce some of the paperwork related to tax deductions,\" he told SBS News.\n\n\n\n\n\n\"Albanese’s claims that this will lead to cost of living relief is reasonable, but on its own, the policy is not really a substantial cost of living relief measure.\"\n\n\n\n\n\nChapman said those on higher incomes or with more complicated tax returns wouldn't see as much benefit.\n\n\n\n\n\n\"Higher-income taxpayers generally have a broader range of deductions which total more than $1,000. I’d say that this is targeted squarely at low and middle-income taxpayers (earning up to about $80,000),\" he said.\n\n\n\n\n\n\"If you claim more than $1,000 in work-related expenses, you simply carry on claiming your deductions as you do at the moment.\"\n\n\n\n2021/22 data from the Australian Taxation Office shows the average work-related expenses deduction was $2,506.\n\n\n\n\n\nHartigan agrees that those who claim less at tax time will benefit, estimating $205 of relief.\n\n\n\n\n\n\"Around 5.7 million taxpayers who currently claim less than the $1,000 amount will benefit,\" Hartigan said. \"The average amount of annual tax relief for those who will benefit is estimated to be $205.\"\n\n\n\n\n\n\"Anyone who is earning less than $135,000 in 2026/27 will benefit from this policy.\"\n\n\n\nTime is money, says consumer advocate\n\nWhile the tax deduction may not solve the cost of living crisis, Sally Tindall from financial comparison site Canstar, says consumers may gain time back as they step away from an \"overly complicated\" tax system.\n\n\n\n\n\n\"The cost-of-living crisis has put plenty of family budgets under extreme pressure, however, many of these households are often under time pressures as well. Money might not be of abundance, but often time isn’t either,\" she told SBS News.\n\n\n\n\n\n\"Millions of Australians may find they start claiming more on their tax returns, up to the $1,000 threshold, while others, who might have slightly more than a $1,000 in claimable expenses could decide to ditch the collecting and tallying up of receipts in favour of ticking a box.\n\n\n\n\n\n\"Life is too short to be chasing after receipts, particularly for those with minimal work-related expenses. This move will help millions of Australians submit their tax returns faster and more efficiently.\"\n\n\n\nTaxpayers urged to approach with caution\n\nOther experts say that while the instant deduction could save people time, it might also mean taxpayers miss out on some much-needed funds.\n\n\n\n\n\n\"Taxpayers should be encouraged to take greater responsibility for their finances and tax obligations,\" CPA Australia tax lead Jenny Wong told AAP.\n\n\n\n\n\n\"Clicking a few buttons to get a basic deduction may be easy, but it is unlikely to be in the best interests of taxpayers or the economy.\"\n\n\n\n\n\nWhile the initiative says taxpayers can claim their $1,000 without any receipts, Chapman urges Australians to still keep their receipts in case their work expenses turn out to be over $1,000.\n\n\n\n'Minimalist' take on tax reform\n\nChapman says the initiative is a \"minimalist\" take on a policy spoken about off the back of the 2009 Henry tax review, which prompted calls for a $3,000 annual standard tax deduction.\n\n\n\n\n\n\"This idea has been talked about for a long time,\" Chapman explained.\n\n\n\n\n\n\"This is very much a minimalist take on the policy — $1,000 is not a huge amount. I've seen figures as high as $3,000 suggested in other iterations of the policy in the past.\"\n\n\n\nSteven Hamilton is an economics professor at George Washington University in the US. He said Labor's proposal would save the tax office and people money, in addition to moving to a system where no one has to itemise.\n\n\n\n\n\n\"The ATO has to spend a lot of money policing those deductions, and it's just simpler for everybody,\" he told AAP.\n\n\n\n\n\n\"It's a great example of how making our tax system simpler and more straightforward can lift a big weight off of the economy.\"\n\n\n\n\n\nWith additional reporting by Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/romance-book-event-interrupted-by-firefighters-after-fire-alarm-goes-off-20250416-p5ls76.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Romance book event interrupted by firefighters after fire alarm goes off",
        "publish_date": "Wed, 16 Apr 2025 11:59:45 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Romance book event interrupted by firefighters after fire alarm goes off\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/pictures-capture-prince-william-s-hope-and-heartbreak-during-champions-league-thriller-20250416-p5ls51.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pictures capture Prince William’s hope - and heartbreak - during Champions League thriller",
        "publish_date": "Wed, 16 Apr 2025 11:59:26 +1000",
        "category": "sports",
        "authors": [
            "Tom Morgan"
        ],
        "text": "Aston Villa’s hopes of a Champions League miracle were extinguished in agonising fashion as a valiant fightback against Paris Saint-Germain fell narrowly short in their quarter-final second leg on Wednesday morning (AEST).\n\nPrince William and Prince George, who passionately support Aston Villa, were in attendance and riding the emotions of the night. The Prince of Wales’ face said it all in pictures that tell the story of the night the dream ended.\n\nPre-match nerves\n\nPrince William and Prince George get ready for the big game. Credit: Getty Images\n\nA stiff drink might be required, but Prince William opts for water instead just minutes from kick off in the VIP box. Villa’s most famous fan looks significantly more anxious than the cool, calm and remarkably insightful William who was on punditry duties pre-match last week.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/it-can-t-last-why-gould-believes-galvin-won-t-see-out-tigers-deal-20250416-p5ls52.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It can’t last’: Why Gould believes Galvin won’t see out Tigers deal",
        "publish_date": "Wed, 16 Apr 2025 11:55:00 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Loading\n\n“Every decision, everything we try to teach our players, and everything we try to build about a culture of a club, and we talk about culture and all that, there has to be a club-first mentality,” Gould said.\n\nSpeaking on the Six Tackles with Gus podcast , Gould feared there could be “long-lasting effects” after the team turned on the teenager.\n\nTigers coach Benji Marshall, at the urging of senior players, has dropped Galvin to NSW Cup after Galvin revealed he wouldn’t be staying at the club when his contract expires at the end of 2026, due to a belief he couldn’t take his game to the next level under Marshall.\n\nPhil Gould has described the relationship between Lachlan Galvin and Wests Tigers as “untenable” after the wantaway playmaker put himself before the club.\n\n“The individual comes third. It’s not about the CEO, it’s not about the general manager. It’s not about the coach, it’s not about the trainer, it’s not about the doctor, it’s about what’s in the best interest of the club, then the team, then the individual comes third.\n\n“And with this one, with this statement, they’re putting the individual first. Lachlan is putting himself first over the rest. I found that, firstly, extraordinary that that would be endorsed – and also that it is untenable, it can’t go on. It’s not going to last.”\n\nGalvin will play at Lidcombe Oval on Easter Monday for Western Suburbs and it’s unclear how long his demotion will last. Gould predicted the parties would have to cut ties early, and if that was Galvin’s ultimate objective, it would come at a huge personal cost.\n\n“If in fact it was seen as strategy to create a situation where the club would let him go now, I don’t think that they knew it would degenerate to this level, that within hours, the senior playing group would divorce themselves from his comments and divorce [themselves] from the young player and say we don’t want to play with him,” Gould said.\n\n“Now that’s terrible, that’s terrible for a young player, to have the rest of the playing group say [that] … I think if it was a strategy being used to get him out of his contract in the short term so he can go somewhere next year, well then to that extent it’s probably backfired to where it is at the moment.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/chris-scott-does-not-care-what-anyone-thinks-about-geelongs-late-outs-20250416-p5ls71.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Chris Scott does not care what anyone thinks about Geelong's late outs",
        "publish_date": "Wed, 16 Apr 2025 11:50:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "Chris Scott does not care what anyone thinks about Geelong's late outs\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/entrepreneurship/notorious-internet-message-board-4chan-has-been-hacked-posts-claim-20250416-p5ls3v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Notorious internet message board 4chan has been hacked, posts claim",
        "publish_date": "Wed, 16 Apr 2025 11:49:06 +1000",
        "category": "finance",
        "authors": [
            "Raphael Satter"
        ],
        "text": "The notorious internet messageboard 4chan has been hacked, according to posts circulating online, some of which said that the hacker involved had revealed identifying details of the site’s moderators to the public.\n\nThe alleged hack first came to light when a defunct section of the site sprang back to life with the words “U GOT HACKED” emblazoned across the top, according to Wired magazine.\n\n4chan has for years served as an incubator for some of the internet’s most viral memes, as well a range of subcultures. Credit: Bloomberg\n\nAlon Gal, co-founder of Israeli cybercrime monitoring company Hudson Rock, said the claim of a hack “looks legit”, citing the publicly circulating screenshots purporting to show 4chan’s backend infrastructure.\n\nThe publication TechCrunch cited an unnamed 4chan moderator as saying they had no reason to dispute the authenticity of the screenshots, and the site was only intermittently available on Tuesday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/not-about-the-money-unsw-dumps-controversial-trimesters-20250414-p5lroe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Not about the money’: UNSW dumps controversial trimesters",
        "publish_date": "Wed, 16 Apr 2025 11:46:04 +1000",
        "category": "finance",
        "authors": [
            "Christopher Harris"
        ],
        "text": "The University of NSW will dump its controversial trimester system that allows students to complete their degrees faster and revert to a traditional academic calendar in a bid to give students a better on-campus experience.\n\nVice chancellor Attila Brungs said the message from 5000 students who provided feedback was they wanted to engage deeply in subjects and have more time for part-time work, internships and extracurricular activities.\n\nIt’s back to normal service at the University of NSW from 2028 when trimesters will be dumped and replaced with normal semesters. Credit: Louise Kennerley\n\n“It’s not about the money, no, it’s about getting a really good student experience,” Brungs said of the decision to come into effect in 2028.\n\nIn 2019, the university and its then vice chancellor Ian Jacobs unleashed a firestorm of criticism for adopting the trimester model – which was decried as a shameless money-making exercise by students. Protests attended by about 1000 students erupted on campus while a social media account was set up called UNSW Cry-mesters, with the objective of getting the whole thing binned.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/tigers-to-blame-as-bullies-and-hypocrites-pile-on-galvin-20250416-p5ls5k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tigers to blame as bullies and hypocrites pile on Galvin",
        "publish_date": "Wed, 16 Apr 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Peter Fitzsimons"
        ],
        "text": "Loading\n\nThe Lachie Galvin carry-on?\n\nFriends, when it comes to hyperbolic hypocrisy, when it comes to bullying bastardry, when it comes to sheer shittiness in rugba league, I think we have a post-war record, yes? (Which is saying something.)\n\nFor those who’ve joined us late, Galvin is the 19-year-old wunderkind of the newly resuscitated Wests Tigers, a great player who’s been carving ’em up a little like Benji Marshall in his prime. He’s got verve in his swerve, Veuve in his make-up. He plays champagne rugby league that is a joy to watch!\n\nBut here’s the thing. Marshall is now Galvin’s coach, and despite the Tigers recently tabling a $5.5 million offer for five years of the young man’s services, Galvin quietly declined. He did not loudly decline. He quietly declined. All the noise since has come from Tigers management and players. It is understood that the reason for Galvin declining to sign the contract is not because he wants more money, necessarily, but because he thinks he might become a better player under another coach, and that Marshall is not necessarily his kind of coach.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/musicals/mahalia-barnes-jesus-christ-superstar-20250317-p5lk6h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What made Mahalia Barnes say yes to Jesus Christ Superstar",
        "publish_date": "Wed, 16 Apr 2025 11:31:00 +1000",
        "category": "finance",
        "authors": [
            "Elizabeth Flux"
        ],
        "text": "It was around this age that she and her younger siblings started performing more formally – first with their father, then as a group called the Tin Lids. She’s quick to clarify that the band skewed more towards the fun than the serious. “I say this all the time, but we were no Jackson Five. We were just kids, do you know what I mean? But everyone we knew was making music, so we thought, well, why don’t we get to do that?” Her family is never far from her mind. I quickly learn that both her parents are excellent cooks, that her eldest daughter is following in her footsteps as a singer-songwriter, and that her husband, fellow musician Ben Rodgers, is also a skilled photographer. “We’ve got a massive family. There’s lots of us. With my mum and dad, there’s four of us, and I’m the oldest of the four – but I’ve got older half-siblings as well, who I’m also close with, but didn’t grow up in the same way with.” Zaru soba noodles, seared tuna, bonito-infused aged soy. Credit: Jason South I don’t know if Barnes would agree with my assessment of her as easygoing. Both she and her mother are eldest children, and she feels that there is a certain personality type that goes along with that. “I take on a lot of responsibility, whether it’s mine or not. I feel the need to manage all the situations. But really, it’s just that I’m a control freak,” she says with a laugh.\n\n“I think that there was a lot of responsibility for me growing up with my siblings as well, just because of the way our lifestyle was. We’re a very close family, so I’m lucky – it’s not a weight that I’m unwilling to have.” As we leisurely make our way through the different small dishes, Barnes makes it feel like she has all the time in the world when in reality her life is a careful juggling act of work, family and a collision of the two. She and her husband are raising two daughters aged eight and 15 while also touring regularly. As a musician, she performs solo and with her band, while also taking on projects like her current role. On days off from Jesus Christ Superstar she’ll arrange gigs or work on other projects. I’m just about to ask how she navigates all this when she says,“I also manage my dad – but he works more than I do.” Barnes worked as her father’s tour manager for many years before slowly transitioning into her current role. “It was a gradual progression,” she explains. It can be tricky, trying to navigate the personal and the professional. Mahalia Barnes as Mary Magdalene and Michael Paynter as Jesus in the Melbourne production of Jesus Christ Superstar. Credit: Luis Enrique Ascui “There’s definitely some moments that are testing. We get along very, very well, and I think that where it works in this role is that [my mum and dad] know that no one could possibly care more than I do as his child,” she reflects. “Some days when I have to tell them something they don’t want to hear, that’s always ... no one really wants to be told what to do by their child.” Being family makes her both the most qualified and the least qualified she reflects. “So it’s going well, but it’s a lot. It’s hard.” And, she adds, with her eldest daughter now starting to release music, “suddenly we’re in a position where Ben and I are managing her too, essentially”.\n\nIt seems fitting that Barnes explains how she navigates her intense schedule while also casually dissecting and serving out the flounder, something she makes look effortless, but which 10 minutes later I learn is far from the case. As I tentatively cut into it with a spoon she looks on with a quiet concern and I apologise for possibly mangling it. (“No, no,” she reassures me. “It’s just that that’s the difficult part, because there’s all the little bones”.) The sauce that comes with the fish is a particular favourite – and one that she and her husband have (unsuccessfully, she adds) attempted to replicate at home. Food, she explains, is one of her love languages. “Food and music.” Whenever she can, she cooks for her friends and family. On the set of Jesus Christ Superstar on days when they are performing two shows she will duck out to find some kind of treat to bring back to share with everyone to boost morale and energy. The bill at Supernormal. Credit: Though she has been approached to take part in musicals previously, Jesus Christ Superstar is the first one she’s said yes to. “As an artist, I would say I’m more of a blues, soul, rock ’n’ roll type singer. And part of what I love and am drawn to about that sort of music is the freedom of expression and the spontaneity and the improvisation and all of those things that maybe don’t really fit into the musical theatre world.” Barnes chose this musical because it resonated with her – partly because of the music itself and partly because as part concert, part theatrical production, it didn’t hew too closely to more traditional musical theatre. She feels there’s more flexibility in the story for musicians to express themselves.\n\nWith lyrics by Tim Rice and music by Andrew Lloyd Webber, Jesus Christ Superstar started as a concept album in 1970 and, following the success of the music, was developed into a Broadway production the following year. It tells the story of Jesus and Judas, with the narrative dissecting themes of fame, love, power and betrayal. Going into the musical, Barnes’ initial read on her character was that “it felt a little bit too passive, for my liking, a little bit too, I guess, gentle, a little bit weak”. On paper, Mary Magdalene’s role in the musical is a conciliatory one. She tends to Jesus and interrogates her own emotions. Barnes was keen to bring “a little bit more strength” to the role. “I’m not coming out there trying to change the character drastically, but just trying to maybe reinterpret and understand that the ‘being gentle’ approach doesn’t have to equal weak.” When I see the show a few days later, it’s clear she has succeeded. Barnes’ Mary is both calming and fierce, holding her own in the quiet battle between herself and Judas. Loading She points to the tension that runs through the story. “Mary’s role is to come in and sort of settle that down a little bit and bring a little bit of calm to the group, to Jesus, and try and bring that to the community,” she reflects. “I mean literally I come in and say everything’s all right, you know.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/comedy/i-guess-i-can-t-ever-do-comedy-again-new-mum-becky-lucas-on-the-medical-emergency-that-changed-her-20250220-p5ldq2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I guess I can’t ever do comedy again’: New mum Becky Lucas on the medical emergency that changed her",
        "publish_date": "Wed, 16 Apr 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Nick Dent"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Famous comedians typically don’t hand out their phone numbers to just anyone, but Becky Lucas is the exception. If you check out the details for her upcoming shows, you’ll find her phone number listed in her artist blurb, along with an invitation to text her and ask her to “say something funny”. Lucas came up with the idea because, with a new baby, George, keeping her so busy, she didn’t have the time to write the usual funny bio. Instead, she thought punters could decide whether to see her based on her witty replies. What could possibly go wrong? The number, for a start. Becky Lucas worried that she might not be able to perform stand-up again after her son was born with a heart condition. Credit: James Brickwood “Some poor woman in the Blue Mountains called Mary started receiving hundreds of text messages from people saying, ‘Tell me something funny’. I gave her a nervous breakdown, I think. “Anyway, it’s fixed now, so you can text me, but I have to say, it’s quite a huge job to be texting a bunch of people back.” She sighs. “I really should have just written the bio.” Although her nervous manager urged Lucas to get a burner phone for the exercise, she hasn’t been trolled on the number.\n\nAdvertisement\n\n“I haven’t received any vitriolic text, which I think means I’m, you know, not famous enough.” But Brisbane-born Lucas has been a professional stand-up for over a dozen years, hosted the Melbourne International Comedy Festival Gala, and delivered an insouciant five-minute set on Conan O’Brien’s show in 2019. During her appearance, she joked with the legendary late-night host that his dogs could tell if he had cancer. She was offered the spot after supporting O’Brien at the State Theatre in Sydney. “Nothing happened, though. You know, back in the day, you’d do well on late night TV, and then you’d have the whole world at your fingertips, but these days, everyone’s a star.” We’re chatting ahead of Lucas’ new tour, titled Things Have Changed, but the Essence Remains. It’s her first stand-up show since 2022 and her first since becoming a mum. For a while, Lucas had doubts it would happen at all. The past year has not exactly been funny, she says. Becky Lucas performing at the Melbourne International Comedy Festival in 2022. “My lovely little son was born with quite a complex heart defect that was picked up in utero, the 20-week scan. And so, my pregnancy, my first child, the journey was quite different. There’s so much about it that was normal and joyful, but there was just a lot of terror and anxiety around it.”\n\nAdvertisement\n\nIn August 2024, when George was five months old, he underwent five hours of open-heart surgery and spent 11 days recovering at the Children’s Hospital at Westmead. “I was so sad and so scared that I just thought, ‘Oh, I guess I can’t ever do comedy again.’ How can I marry these two parts of myself, like, being silly and irreverent, and then dealing with the heaviest, saddest thing possible?’ “This show was written in the times when things were improving. And now, he’s recovered fully, he’s doing so well. I’ll always worry, but life is pretty good. And returning to stand-up feels like things are normal again.” Lucas’ new show is not entirely about parenthood but, of course, it’s a part of it. “It really does take a toll on your body. Having a kid is just being hunched over a bag and fiddling around with zips constantly. I’m like the letter C.” Oddly enough, Lucas has been thinking about motherhood since she was little. In her 2021 memoir, Acknowledgments, she recalls walking into rooms as a child and announcing that she loved kids but was not sure if she’d be ready to have them. Her exasperated stepmum would reply: “For god’s sake! You’re seven years old!” Lucas now realises that this obsession stemmed from her parents’ divorce. “Maybe I realised that I was a bit of a hindrance,” she says.\n\nAdvertisement\n\nLucas grew up on the mosquito-ridden Coochiemudlo Island, off Victoria Point in Moreton Bay. Her mum, Mandy, is a country music singer, and her dad, Timothy, is an inventor who created the puddle flange, now a standard feature in Australian bathroom drains. They split when Becky was two. She attended Brisbane State High, a selective public school she describes as “a microcosm of the world”, graduating three years after Matt Okine, with whom she later helped write the Stan series The Other Guy. (From left) Frank Woodley, Joel Creasey, Becky Lucas and Sam Simmons in the series LOL: Last One Laughing. Credit: Amazon Prime Video The stand-up penny dropped for her during a visit to San Francisco, where she stayed with an American flame from an earlier backpacking trip to Brazil. It quickly became crushingly obvious that the guy didn’t really want her staying in his apartment and was avoiding her. Left to explore the city on her own, she found her way to The Purple Onion comedy club in North Beach. After the hit her self-esteem had taken, the idea of getting up on stage herself no longer seemed so scary. She made the finals of Raw Comedy in 2013, and from there, she was off and running. But Brisbane isn’t the most welcoming environment for a young comedian. “You’re doing some of the worst gigs in the country, like RSLs, pub gigs, gigs at truck stops on the side of the road.” This is the origin of Lucas’ style, which a Herald Sun reviewer accurately likened to “putting a silencer on a gun: you don’t hear the pearlers coming, you only know when they hit”.\n\nAdvertisement\n\n“You won’t find many Brisbane comics telling long stories with a soft finish,” she says. “You have to pretend you’re constantly performing next to a screen with dog racing, because you probably are.” She was once paid to perform in broad daylight at a food court in a regional Queensland shopping centre, to a tiny and completely uninterested audience, as part of a Mexican food promotion. It lasted two minutes before the franchisee gently escorted her off. Becky Lucas says motherhood is the “most beautiful, meaningful thing I’ve ever done”. Credit: James Brickwood In 2013, at 24, she moved to Sydney and bonded with the Brisbane wave of comedians: Okine, Mel Buttle, Sam Campbell, Damien Power, and Josh Thomas. Before The Other Guy, she contributed to two seasons of Thomas’ show Please Like Me, working in the writers’ room to punch up scripts and make the other writers laugh. Loading Not everything she writes does so well. In 2018 Lucas was banned from Twitter for drunk-tweeting that she would behead then-prime minister Scott Morrison. “It’s something I always say to people,” she said at the time. “‘Oh, I’m going to chop your head off!’ It’s a joke. I say it to my friends.” She now thinks her account might have been reinstated because Elon Musk doesn’t care. But she can’t remember her username. “I wouldn’t mind being able to log back on, but I also think, why would I want to introduce that back into my life?”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-john-howard-in-perth-to-help-liberals-win-key-seats-20250415-p5ls1n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: John Howard in Perth to help Liberals win key seats",
        "publish_date": "Wed, 16 Apr 2025 11:24:16 +1000",
        "category": "finance",
        "authors": [
            "Heather Mcneill"
        ],
        "text": "Two Mineral Resources directors tasked with supervising a governance overhaul in the wake of an offshore tax scandal involving its founder Chris Ellison have resigned with immediate effect.\n\nThe iron ore miner declared the departure of Jacqueline McGill AO and Susie Corlett in a statement to the market this morning, an announcement which coincides with a plummeting share price that has wiped more than $3 billion from the business in the past six months.\n\nLoading\n\nCorlett, who also serves as a non-executive director at Iluka Resources and Aurelia Metals Ltd, leaves after more than four years on the board of the company, while McGill departs after just 15 months.\n\nThe pair were appointed to the governance committee the Osborne Park-headquartered miner established in late 2024 after the Australian Financial Review exposed an alleged offshore tax scheme Ellison and four other executives had profited from that ran for a decade.\n\nThe committee had been tasked with strengthening governance practices by introducing new protocols for related party transactions, exiting legacy agreements between MinRes and its senior directors and eliminating the use of company resources by key managers.\n\nThe departures come as the corporate watchdog continues its probe into the scheme, which is set to cost Ellison his managing director role at the company he founded in 2006.\n\nMinRes chair James McClements, who also intends to depart the company after more than 10 years, thanked the pair for their “enormous” contributions and wished them well.\n\n“Both Susie and Jacqui have dedicated substantial time and effort over recent months in our efforts to improve governance and procedures across the business, whilst navigating their significant other professional commitments,” he said.\n\nShares in the miner were down 3.5 per cent this morning to trade at $17.62.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/100-leggings-for-five-bucks-the-viral-tiktok-post-taunting-us-consumers-20250415-p5lrv4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "$100 leggings for five bucks? The viral TikTok post taunting US consumers",
        "publish_date": "Wed, 16 Apr 2025 11:23:48 +1000",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "Chinese manufacturers purportedly behind big-name brands like Nike, lululemon and Ralph Lauren are hitting back at US tariffs on TikTok by exposing the actual cost of making their products.\n\nIn a video from user LunaSourcing China, which has now clocked more than 12 million views and 1.4 million likes, a woman claims to reveal the manufacturers of brands like lululemon, Fila and Under Armour.\n\n“They sell you a legging pants for $100. And guess what, here in these two factories you can get them for around five to six bucks,” she says in the video.\n\nThe woman also claims that “the material and craftsmanship are basically the same because they all come from the same production line.”",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-hikers-stunned-by-steep-camping-cost-of-new-four-day-42km-rainforest-trail-011144278.html",
        "title": "Aussie hikers stunned by 'steep' camping cost of new four-day 42km rainforest trail",
        "publish_date": "2025-04-16T01:11:44Z",
        "category": "finance",
        "authors": [],
        "text": "The lush multi-day hike around the rim of an ancient caldera opened last week, but the price tag has left the hiking community a little taken aback.\n\nParks authorities explained to Yahoo there are \"higher operational costs\" involved with the trail due to its remote location. Source: NSW National Parks and Wildlife Service\n\nA stunning new four-day, 42km hike has opened in the Tweed Byron Hinterland, taking explorers through a volcanic landscape covered in rainforest, clear creeks and waterfalls. But unlike most national park walks in NSW, the Gidjuum Gulganyi Walk comes with a hefty fee, leading hikers to debate how much they would pay for the multi-day trek.\n\nThe trail is rated as a grade 4 hike, where adventurers would be walking between four and nine hours per day, at times covering steep and uneven ground. For those who are keen to explore it alone with their own equipment, there is a price tag of $173 to camp along the trail – with each site holding up to two people.\n\nThe campsites include raised wooden platforms that can either hold two small tents, or one medium sized tent. Also at each of the campgrounds are non-flush toilets, picnic tables, shelters and rainwater tanks.\n\nWhile the announcement of the hike itself had Aussies excited, many felt the cost was almost as steep as the terrain.\n\nADVERTISEMENT\n\n\"To pay almost $200 for a national park hike is cooked!\" one man wrote on Facebook.\n\n\"So bloody expensive,\" another agreed.\n\nThe impressive new track has sparked heated discussion about the prices of the guided and self-guided tours. Source: NSW National Parks\n\nGuided tours available for over $3,000\n\nFor those looking for a guided tour, the prices skyrocket even further.\n\nOne company offers a \"luxurious\" guided walk where your bags are transported for you, meaning you only have to carry a light day pack. The experience includes chef-prepared meals, hot showers, \"comfy sleeping cots\", solar USB chargers and even wine in the evenings, and will set you back $3,200 per person, twin share. Single occupancy has a higher charge.\n\nOne man noted that it's cheaper to get a guided tour of Mount Everest – and he’s right. A 15-day trek over glaciers and valleys to base camp on Everest, including transfers and accommodation, is currently on offer for $1,684.\n\nADVERTISEMENT\n\n\"Cheaper to go hiking in another country, which is crazy. Come on Australia we can do better,\" one person wrote.\n\nBushwalking community shocked at 'exorbitant' fees\n\nKirsten Mayer, executive officer of Bushwalking NSW, told Yahoo she was “flabbergasted” by the charges, saying the high prices will mean the full walk will not be accessible for all Australians.\n\n\"This high cost of camp sites is likely to reduce the engagement in national parks by people of a lower income, and what are they doing about that? Because these are public assets and everybody should be included and given access,\" she said.\n\n\"$173 for three nights camping in a national park is a very steep ask.\n\n\"We do not fully support expensive campgrounds and we certainly don’t support broadened manufactured walking tracks that don’t allow people to connect with nature, because we vitally need that.\"\n\nNational Parks explains the reason behind $173 fee\n\nA spokesperson for NSW National Parks and Wildlife Service explained there are \"higher operational costs\" involved with the trail due to its remote location.\n\nADVERTISEMENT\n\n\"There is no fee for walking on the track but staying three nights in the campgrounds along the track costs $172.80 for up to 2 people. That is about $28.80 per person, per night twin share,\" the spokesperson said.\n\nThere are three campgrounds along the trail, each with hardwood platforms for tents. Source: NSW National Parks\n\n\"These new campgrounds have been carefully designed to balance visitor comfort while protecting the surrounding environment. Their remote locations mean they require higher operational costs, including waste removal and ongoing servicing to ensure a safe and enjoyable experience.\n\n\"All visitor fees are reinvested directly into the management of national parks, helping to maintain tracks, campgrounds, signage, and conservation programs.\"\n\nThe walk is part of the $7.34 million Tweed Byron Hinterland Trails project, and includes shorter day walks that visitors can enjoy for free, the spokesperson added.\n\nADVERTISEMENT\n\nFor those interested in checking out the Gidjuum Gulganyi, check out the different options here.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/live/oz-lotto-creates-15-millionaires-overnight-labor-blasts-really-concerning-dutton-move-china-unimpressed-with-google-move-000933834.html",
        "title": "Oz Lotto creates 15 millionaires overnight, Labor blasts 'really concerning' Dutton move, China unimpressed with Google move",
        "publish_date": "2025-04-16T00:11:14Z",
        "category": "finance",
        "authors": [
            "Tom Flanagan"
        ],
        "text": "Australia’s economy could take a hit worse than the global financial crisis or Covid if the geopolitical tensions between China and the US continue.\n\nAs the two superpowers vow “to fight until the end”, Australia could be stuck in the middle.\n\nUS President Donald Trump has implemented tariffs of 145 per cent against Chinese imports.\n\nIn what has become a tit-for-tat trade war, China has added its own tariffs, which now sit at 125 per cent, on US imports.\n\nIG market analyst Tony Sycamore sounded the alarm of what the potential trade war could mean for Australia.\n\n“At the risk of sounding dramatic, we are on the verge of seeing the two largest economic and military superpowers collide at high speed, with Australia caught squarely in the middle,” Mr Sycamore said.\n\n“If current lines hold, the fallout has the potential to dwarf the economic impact on the Australian economy felt during the GFC and Covid.”\n\nThe tariff fallout has not been missed on the Australian market, which sank by 2.71 per cent over the last 7 days to April 11, with about $71 billion wiped out by close of trade on Friday, following days of volatility.\n\nMr Trump’s announcement of reciprocal tariff policies, which added between 10 per cent and 50 per cent on goods imported to the US, sent shockwaves around the world.\n\nRead more from NCA NewsWire here.",
        "source": "Yahoo"
    }
]