[
  {
    "url": "https://www.9news.com.au/national/australia-imposes-tariffs-on-chinese-steel-imports/c768c50d-2000-4e07-a160-c78e680ee310",
    "title": "Australia quietly introduces tariffs on Chinese steel",
    "publish_date": "Mon, 09 Feb 2026 01:14:00 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "The A﻿ustralian government has quietly imposed tariffs on some Chinese steel products, risking retaliation from the emerging superpower.\n\nCeiling frames imported from China will be slapped with a 10 per cent tariff, the Department of Industry has confirmed.\n\nThe levy follows an inquiry by the ﻿Anti-Dumping Commission that found local manufacturers were being unfairly undercut and the products received government subsidies.\n\nHAPPENING NOW: Israeli president arrives in Australia under heavy security\n\nAustralia has imposed tariffs on some Chinese steel imports. (AP Photo/Robert F. Bukaty) (AP)\n\nLast month, Treasurer Jim Chalmers requested the Productivity Commission carry out an urgent inquiry into the effect of structural steel imports on the local market.\n\nAustralian steel fabricators, commonly small to medium-sized businesses, told the investigation a flood of cheap imported products were leaving them uncompetitive.\n\nIndustry Minister Tim Ayres said the government was standing up for Australian businesses in support of free and fair trade.\n\n\"This is because Australia's prosperity is linked to open and rules-based trade – one in four Australian jobs depend on trade,\" he said.\n\n\"When trade is not fair, the government will stand up for Australian farmers, manufacturers and workers.\"\n\n\"This includes applying measures at the border to address unfair imports.\"\n\nChina's sluggish construction sector has led to a glut of steel made there, triggering a flood of shipments to overseas markets.\n\nAccording to Commonwealth Bank of Australia analysis, Chinese crude steel output fell by 4.4 per cent last year – marking the largest annual fall since the data began in 1990.\n\nWhile heavy US tariffs have deterred Chinese steel importers, other markets, including Australia, became export targets.\n\nThe move by Australia was in addition to temporary tariffs ranging form 35 per cent and 113 per cent on steel products, which started last December.\n\nDumping, defined by the World Trade Organisation, is a form of price discrimination, involving selling a product in the importing country at less than the price in the market where it is made.\n\nThe latest tariffs come after warmer trade relations between Canberra and Beijing since the 2022 election victory of the Albanese government.\n\nIt followed years of bitter trade disputes under the former Morrison government when bilateral relations chilled over suspicions of Chinese interference in Australia increased.\n\nChina also hit out at Australia's call for an inquiry into the origins of the COVID-19 pandemic and allegations it was seeking to intimidate members of the Chinese-Australian community.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/royal-australian-mint-search-under-way-for-former-school-children-pictured-in-iconic-1965-photo-before-changeover-day/758ac65f-bff4-47aa-acc6-bfd0464c86ec",
    "title": "Search for former Aussie school kids pictured in iconic 1965 photo",
    "publish_date": "Mon, 09 Feb 2026 02:07:47 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "A search is underway for a group of former school children pictured in an iconic 1965 photograph taken before the biggest financial transformation in Australian history.\n\nThe Royal Australian Mint said the photograph was taken in a Sydney classroom during a lesson as part of a ﻿national education program prior to Changeover Day or 'C-Day'.\n\nAustralians previously used pounds, shillings and pence as part of a complicated system where £1 equalled 240 pence.\n\nHAPPENING NOW: Israeli president arrives in Australia under heavy security ﻿\n\nThe iconic photo shows children learning about decimal currency in 1965. (Australian News and Information Bureau)\n\nThe nation ﻿officially embraced dollars and cents on February 14, 1966.﻿\n\nA nationwide campaign had launched the year before to prepare every Australian for the new money.\n\nIt featured a beloved cartoon character called Dollar Bill and a catchy jingle that became a part of Australian culture .\n\nRoyal Australian Mint chief executive Emily Martin said no information was recorded about the school or children in the photograph.\n\n\"The Mint is calling on the public for assistance in identifying the individuals in the photograph to share their memories of this pivotal national moment,\" Martin said.\n\n\"Now, 60 years later, we're hoping to solve a charming mystery from that exciting era.\n\n\"Guessing they are in their early 70s now, we'd like to find these children and hear their stories of singing along with Dollar Bill or counting their shiny new coins.\"\n\nThe Royal Australian Mint opened in 1965 and was hard at work striking one billion brand-new coins , which featured iconic Australian animals designed by Stuart Devlin.\n\nThe Royal Australian Mint is seeking the former students featured in the iconic photograph to help tell the story of Changeover Day.\n\nIf you recognise any of the students, contact the Mint media team on media@ramint.gov.au or call 02 6202 3466 during business hours.﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/fine-for-using-mobile-phone-while-driving-australia-device-in-lap-explainer/0a66e482-73d8-4cdb-baeb-77b1cb499a44",
    "title": "Bad habit while driving could cop Aussies up to $1200 in fines",
    "publish_date": "Mon, 09 Feb 2026 02:34:16 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "It's a bad habit many Australians are guilty of; driving with a phone in their lap.\n\nSome Australians even use it as an excuse to try to get out of ﻿mobile phone fines, claiming the phone was in their lap and not their hand.\n\nWhat many don't realise is that even though they're not touching the phone with their hands, they're still breaking the law.\n\nHAPPENING NOW: Israeli president arrives in Australia under heavy security\n\nA NSW driver caught resting their phone in their lap while behind the wheel. (Supplied/Transport for NSW)\n\n﻿﻿Using or touching a phone with any part of your body is illegal in all Australian states and territories, and is punishable by more than $1200 in fines in one state.\n\nThat includes resting a phone on your lap, leg, or between your shoulder and ear.\n\nIt is still illegal even if you are stopped﻿ at traffic lights or stuck in traffic.\n\n﻿Fines and penalties for mobile phone offences in each state and territory are as follows:\n\nNSW: fines start at $423 and five demerit points\n\nQueensland: $1,251 fine and four demerit points﻿\n\nVictoria: $611 fine and four demerit points\n\nACT: $548 fine to $674 and three to four demerit points\n\nSA: $658 fine and three demerit points\n\nWA: $500 fine to $1000 and four demerit points\n\nNT: $500 fine and three demerit points\n\nTasmania:﻿ $410 fine and three demerit points\n\nEven if this driver's hand wasn't touching their phone, they'd still cop a fine for having it resting on their leg. (Supplied/Transport for NSW)\n\nThere are a few very limited circumstances in which drivers can touch or operate a mobile while driving, but while it's resting in a driver's lap isn't one of them.﻿\n\nFully licenced drivers may use a phone for a few specific things if it is ﻿secured in a cradle, or can be operated hands-free (e.g. voice control).\n\nIf operating a phone in a cradle, the cradle must be fixed to the vehicle and must not obscure the driver's view of the road﻿.\n\nREAD MORE: Coastal communities brace for landfall as Cyclone Mitchell bears down\n\n﻿A phone in a cradle or being operated hands-free can only legally be used to ﻿take or receive audio calls and use music or audio functions like navigation systems.\n\nThe only other situation in which it is legal for a driver to touch a phone is if they're passing it to a passenger.﻿\n\nThousands of NSW drivers attempted to dodge mobile phone fines﻿ last year using bizarre excuses, like claiming the item they were caught holding was a KitKat or calculator.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/super-bowl-2026-half-time-show-bad-bunny-all-american/585ce64c-66f5-4735-b95f-c326d13e36df",
    "title": "Why the American right has created its own 'All American' Super Bowl show",
    "publish_date": "Mon, 09 Feb 2026 00:02:03 +0000",
    "category": "sports",
    "authors": [
      "Feb"
    ],
    "text": "The eyes of the world will be on\n\nSan Francisco\n\nfor\n\nSuper Bowl\n\n60, for both the action on the pitch and the half-time show.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/hong-kong-media-mogul-jimmy-lai-sentenced-to-20-years-jail/106321070",
    "title": "Breaking: Hong Kong media mogul Jimmy Lai sentenced to 20 years' jail in landmark case",
    "publish_date": "Mon, 09 Feb 2026 02:28:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "Former Hong Kong media mogul and one of the city's most outspoken critics of China, Jimmy Lai, has been sentenced to 20 years in prison in a landmark national security case that has drawn international scrutiny.\n\nLai, 78, was found guilty in late 2025 of using his independent media outlet to produce seditious materials against Hong Kong and China and colluding with foreign forces to endanger national security.\n\nSupporters of Lai, including the United States and the United Kingdom — where he is a citizen — say the case is politically motivated and designed to silence one of the region's most prominent pro-democracy activists.\n\nA prison van believed to be carrying Jimmy Lai arrives at court ahead of his sentencing. (Reuters)\n\nLai has been one of the fiercest critics of China's increasingly tight controls under President Xi Jinping and has always maintained his innocence.\n\nHis case has become the most high-profile example of China's crackdown on rights and freedoms in Hong Kong, under a sweeping national security law imposed after mass pro-democracy protests in 2019.\n\nThe millionaire media mogul was the founder of the now-shuttered Apple Daily newspaper, which was well known for its critical stance against the Chinese and Hong Kong governments.\n\nWhen he was arrested in 2020, Lai was accused of using the Apple Daily platform to conspire with six former executives and others to produce seditious publications between April 2019 and June 2021, and to collude with foreign forces between July 2020 and June 2021.\n\nHe was convicted in December 2025 of two counts of conspiracy to collude with foreign forces, and one count of publishing seditious materials.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/winter-olympics-rivals-pay-credit-to-lindsey-vonn/106320254",
    "title": "'My heart broke for her': Rivals heap praise on 'idol' Vonn after crash",
    "publish_date": "Mon, 09 Feb 2026 02:07:34 +0000",
    "category": "sports",
    "authors": [],
    "text": "Alpine skiing rivals have paid credit to skiing \"icon\" Lindsey Vonn after the 41-year-old's horror crash at the Milano Cortina Winter Olympics on Sunday.\n\nVonn, competing just nine days after she ruptured her ACL at the Crans Montana World Cup in Switzerland, crashed heavily on the opening section of the Trofane course and had to be flown to hospital.\n\nIt was later revealed she had broken her leg and was being \"treated by a multidisciplinary team\" and \"underwent an orthopaedic operation to stabilise a fracture reported in her left leg,\" according to the Ca' Foncello hospital.\n\nGET THE LATEST: Look back at day two of the Winter Olympics as Coady and Stalker soar as Vonn crashes out Stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nThe US Ski Team said Vonn was \"in stable condition and in good hands\".\n\nVonn knew the risks as just a part of this crazy, foolhardy sport she loves Lindsey Vonn's shocking downhill crash at the 2026 Milano Cortina Winter Olympic Games was always a possibility given the American was competing just nine days after rupturing her ACL. But it was never going to stop her from trying.\n\nThe 41-year-old American had made a comeback this season from six years out of the sport after having a partial knee replacement in her right leg.\n\nIt had been a huge success too, with Vonn winning three World Cup events and standing on the podium a total of seven times across downhill and Super G events.\n\nThe 2010 Olympic downhill champion was ranked number one in the World Cup downhill standings coming into the Olympics and third in Super G, giving rise to hopes that she could add to her three Olympic medals 24 years after her debut in Salt Lake City.\n\nVonn set the third-fastest time in the final downhill training session on Saturday.\n\nLindsey Vonn had been skiing superbly. (Getty Images: Al Bello)\n\nGiven her injury though, her final Olympics always had the potential to turn into a nightmare, the fairytale comeback ending in tears on the mountainside.\n\nGold medallist Breezy Johnson, also of the USA, said she hoped Vonn would be able to compete again.\n\n\"I don't claim to know what she's going through but I do know what it's like to be here, to be fighting for the Olympics and to have this course burn you and to watch those dreams die,\" Johnson said.\n\nBreezy Johnson claimed gold for Team USA. (Getty Images: NurPhoto/Andrzej Iwanczuk)\n\n\"I can't imagine the pain she's going through, and it's not the physical pain.\n\n\"We can deal with the physical pain, but the emotional pain is something else.\n\n\"I wish her the best and I hope this isn't the end.\"\n\nFourth-placed finisher American Jacqueline Wiles said it was \"awful\" to see Vonn crash.\n\nThe airlift rescue was affecting for everyone who saw it. (Getty Images: PA Images/Andrew Milligan)\n\n\"We have such a sisterhood. We travel with each other on the road. We're a family.,\" she said.\n\n\"To watch someone that you care about so much, it sucks. My heart broke for her in that moment, but that is the inherent risk of the sport.\n\n\"We all know what can happen, and we all have a lot of love and respect for each other because of the inherent risk.\"\n\nThe third American in the field, Bella Wright, said she just wanted to support Vonn.\n\n\"We're here to support her,\" Wright said.\n\n\"Regardless [of what happened], she showed that she could do a lot of things that other people can't.\n\nLoading...\n\n\"It was really heartbreaking. Jackie [Wiles] and myself were up top, so we saw it live. You don't want that for anyone, and you especially don't want it for your teammate.\n\n\"Lindsey, she deserved a better ending than that, so I'm very heartbroken for her.\n\n\"I always say this, 'If anyone can do it, it's Lindsey'. Whatever it is, or whatever the situation, she's very strong. We're going to support her the best we can.\"\n\nSnoop Dogg was a disappointed observer in the crowd. (Getty Images: picture alliance/Michael Kappeler)\n\nNorway's Kajsa Vickhoff Lie, who finished seventh, said she looked up to Vonn as an icon.\n\n\"She's crazy. For her, it's all or nothing. It's a huge inspiration, and to see what you can do with your body and with your mind,\" Lie said.\n\n\"I don't think anyone could do what Lindsey has been doing now. I mean, I am 27 years old, and maybe I could do it, but if I was 41 years old and felt like that, I really don't think so.\n\n\" She has been my idol since I started watching ski racing. \"\n\nLie, a two-time world championship bronze medallist in Super G, said Vonn simply overcooked the top of the course.\n\nLindsey Vonn clipped a gate early in her run and took a nasty fall. (AP: Jacquelyn Martin)\n\n\"It is a critical section [where Vonn crashed], because it's in the beginning, and you really need a lot of speed coming out of it. It's super flat after it, so the goal is to be as close to that gate as possible,\" she said.\n\n\"She really nailed the turn, but she was too close to it, so she was hooked into it. But that's how it is with the Olympics — you really want to be at the limit, and she was a little bit over the limit.\"\n\nLie said having the opportunity to compete with Vonn was incredible and added that despite Vonn's injury, she would not be surprised to see her on the World Cup start list later in the year.\n\n\"I'm really happy she came back so I can compete with her at least one more year, and learn from her as much as possible,\" Lie said.\n\n\"I'm crossing my fingers for her, and I hope to see her back.\n\nThe crowd were emotional after the crash. (Getty)\n\n\"We still have a World Cup to do after the Olympics, and I don't know if we will see her [again] in the Olympics. I wouldn't be surprised if she suddenly shows up at the start gate.\n\n\"But the crash didn't look good.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nPresident of the FIS Johan Eliasch said the crash was \"tragic\" but normal for ski racing.\n\n\"I can only say thank you for what she has done for our sport, because this race has been the talk of the Games and it's put our sport in the best possible light,\" he said.\n\n\"I hope she will have a speedy recovery and be back on skis very soon.\"\n\nHe said that Vonn was taken to hospital but had no details of her condition.\n\nWhen asked about whether she shouldn't have competed without her ACL, he said there was no way she wouldn't have competed.\n\n\"They don't know Lindsey. That's all I can say,\" he said.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/hesta-superannuation-ceo-debby-blakey-resigns/106321478",
    "title": "HESTA chief executive resigns after superannuation outage",
    "publish_date": "Mon, 09 Feb 2026 01:30:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "HESTA chief executive Debby Blakey will step down later this year after more than a decade in the role at Australia's 10th-biggest superannuation fund.\n\nThe announcement comes after the fund underwent an outage, originally planned to last seven weeks, as it changed from administration provider MUFG to Grow Inc.\n\nRegulator acts against super fund APRA says the fallout of HESTA's planned outage led to a \"severe, prolonged disruption\" that caused direct harm to some members.\n\nThe outage quickly blew out by weeks, in some cases months, leaving many of its members unable to access funds for surgery, home deposits or nursing home fees.\n\nIt also left members waiting on the phone for hours.\n\nOngoing reporting by the ABC and questioning by Senator Jane Hume led to Australian Prudential Regulation Authority (APRA) taking action in December, raising concerns about the fund's risk management and board governance during its transition period between administration providers.\n\n\"While some disruption is unavoidable when changing service providers, APRA expects that any transitions are well managed and do not result in any unnecessary impact on members' ability to access their accounts,\" APRA deputy chair Margaret Cole said.\n\nHESTA has more than 1 million members, predominantly in the health sector, and holds assets of more than $100 billion.\n\nDebby Blakey will step down in the second half of the year. (Supplied: HESTA)\n\nMs Blakey said that after 11 years in the role and 17 years at the fund, it felt like the right time to shift her focus to a board position, having led the organisation through a period of significant transformation.\n\n'Just gobsmacked': HESTA super outage A consumer advocacy group has called for transparency around why the seven-week HESTA super fund outage was approved.\n\n\"Leading HESTA and serving our members as CEO for more than a decade has been an incredible honour and the greatest privilege of my career,\" Ms Blakey said.\n\n\"I want to thank the board and my colleagues for their terrific support through such an impactful period for the fund and the industry.\n\n\"I am firmly focused on delivering a seamless leadership transition to support the delivery of great long-term outcomes for HESTA members.\"\n\nSuperannuation's peak body, Association of Superannuation Funds of Australia (ASFA) chief executive Mary Delahunty said Ms Blakey had made a positive impact on the industry.\n\n\"Debby has strengthened the superannuation sector significantly through her leadership at HESTA, her service on ASFA's Board and the various other roles she has played,\" she said.\n\n\"She has been a steadfast advocate for equity in superannuation and in all areas that she has touched in her role, bringing gender and broader diversity conversations to the investment process with data and evidence.\n\n\"She has defined for Australia what it means to be an investor with impact.\n\n\"Debby has completely transformed the way institutional investors influenced corporate boardrooms, evidenced by her leadership of the sector's response to the destruction of the Juukan Gorge historical site by Rio Tinto.\n\n\"Whatever she decides to do next, I'm sure she'll keep doing what she's always done – lead with skill, strategy and a clear sense of purpose.\"\n\nThe HESTA board is undertaking a search for Ms Blakey's replacement and expects to announce the new chief executive by July.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/winter-olympics-2026-daily-guide-holly-harris-jason-chan/106307460",
    "title": "Winter Olympics 2026 quick guide: What to watch tonight",
    "publish_date": "Mon, 09 Feb 2026 01:08:39 +0000",
    "category": "sports",
    "authors": [],
    "text": "GET THE LATEST:\n\nLook back at day two of the Winter Olympics as Coady and Stalker soar as Vonn crashes out\n\nStay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/broome-school-air-conditioning-issues/106314502",
    "title": "Kimberley students sweltering through summer with broken air con",
    "publish_date": "Mon, 09 Feb 2026 00:31:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Teachers and students in Western Australia's far north are facing intense humidity and heat, with broken air conditioning in classrooms taking its toll.\n\nAn internal source at Broome North Primary School, who did not wish to be identified, said damaged systems could take up to two months to be repaired.\n\nThey said it was a consistent problem at the Kimberley school, where classrooms could reach temperatures towards 30 degrees Celsius.\n\n\"It's putting a lot of stress on teaching staff and students,\" they said.\n\nDamaged air conditioning could take between a week and two months to be repaired, according to a source. (ABC Kimberley: Dunja Karagic)\n\nEfforts to keep the cool\n\nAlongside other communities across northern Australia, Broome's wet season brings intense heat and humidity between November and April.\n\nThe average temperature hovers between 33C and 34C, while the average humidity sits close to 67 per cent.\n\nThe source said school staff did \"everything possible\" to keep temperatures down in classrooms if the air conditioning broke down, which included utilising fans and portable air conditioning.\n\n\"And opening internal doors to suck the air conditioning into classrooms that don't have any, but it is really warm in there,\" they said.\n\nOne classroom without functioning cooling systems had about 30 students, in addition to a teacher and education assistant, the source said.\n\nThe hot conditions were also putting a strain on special needs students.\n\n\"Thirty-two bodies in that classroom, it's very stressful for them,\" they said.\n\n\"All of those things impact on how they can regulate themselves, and how their day goes … it's not good enough.\"\n\nLong waits for repairs\n\nThe source said two systems were completely broken at the school, while multiple others worked inefficiently, particularly by midday and into the afternoon.\n\nThey said repairs could take anywhere from a week to two months for the air conditioning systems.\n\nThe source says a faulty part in the air conditioning systems was a regularly reported issue. (ABC Kimberley: Dunja Karagic)\n\n\"One of the air conditioning jobs has been outstanding since November last year,\" they said.\n\nThe source said a faulty part in the air conditioning systems was a known, regularly reported issue.\n\n\"If they could come through and replace this one particular part, it would save some time,\" they said.\n\nRepairs underway\n\nA WA Department of Education spokesperson said since January 27 there had been \"a small number of reports\" of air conditioning issues at the school.\n\n\"These were logged directly through the appropriate processes,\" they said.\n\n\"Some of the required repairs are awaiting parts and material supply and will be completed as soon as possible.\n\n\"The department is committed to providing safe and fit-for-purpose learning environments for students and staff, which is why arrangements have been made for temporary air conditioning units to be provided to the school until the outstanding repairs have been completed.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/backyard-pods-wont-fix-the-housing-crisis/106314472",
    "title": "Backyard pods won't fix the housing crisis but they signal a shift",
    "publish_date": "Sun, 08 Feb 2026 23:57:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia is in a deep housing crisis.\n\nThe latest National Housing Supply and Affordability Council analysis shows the country is likely to fall more than a quarter-of-a-million homes short of the federal government's target to build 1.2 million homes by 2029. Its data shows only around 938,000 dwellings are expected to be built in the five-year period, leaving a shortfall of about 262,000.\n\nAnother economic estimate suggests demand exceeds supply by 200,000 to 300,000 homes, pushing prices and rents higher as Australians compete for a limited stock of houses.\n\nThis gap between demand and supply is why many voices in policy and industry argue traditional ways of building houses are too slow and too expensive.\n\nAs Bunnings, Australia's biggest hardware retailer, starts selling tiny homes, it feels like a turning point.\n\nBut are backyard pods the answer to a national housing crisis?\n\nPrefab and modular homes in Australia\n\nIn response to slow and costly traditional building, many in industry and government have pointed to modern solutions such as modular, prefab or even 3D-printed homes as a key part of the solution.\n\nThe idea is to make components or whole sections of homes in dedicated facilities and then assemble them quickly on site.\n\nAre 'flatpack' homes Australia's future? From early colonial settlers to the post-war construction boom, prefabricated and modular housing has a long history in Australia. Can factory-built homes fix our housing woes and help the climate?\n\nRecent government analysis shows some of these factory-based homes can be built up to 50 per cent faster than conventional construction, helping speed housing delivery.\n\nThe market for prefab and modular buildings is growing in Australia and globally.\n\nThe Australian prefab construction sector is valued at $12.91 billion and is forecast to grow by about 7.88 per cent a year.\n\nHowever, these methods account for less than 8 per cent of the construction sector.\n\nThis is far below countries such as Sweden, where prefab makes up a majority of detached housing.\n\nBunnings' pods novel but not the solution\n\nBunnings has recently started selling flat-pack backyard pods that have captured attention.\n\nThe pods, small modular units costing from about $26,000, can be assembled in days.\n\nAt first glance, this looks like an affordable housing innovation. But the reality is more nuanced.\n\nThese pods are fundamentally temporary. Their size, layout and fit-out reflect short-term or secondary use rather than long-term residential living.\n\nBesides this, many pods avoid full planning or building approval in some locations, which is a strong signal they are being treated, legally, as ancillary structures.\n\nThey are most useful as offices, studios, guest rooms or extra space but unlikely to be suitable as permanent homes for families.\n\nWhile the price is eye-catching, it does not include site preparation, ground works, connections for power and water, or any compliance costs, all of which can add substantially to the final price.\n\nBuyers would also need somewhere to put the pod — either owning land, or being able to use someone else's.\n\nPermits and approvals may be required depending on the location and intended use, further complicating the picture.\n\nBunnings has not said it is entering the housing market to help solve the national crisis. But its decision to partner with prefab manufacturers comes as major lenders and builders are embracing factory-built housing as part of broader affordability responses, and as analysts note growing consumer interest in faster, lower-cost housing options amid soaring property prices.\n\nThe market for prefab and modular buildings is growing in Australia and globally. (ABC News: Joel Wilson)\n\nWhy scale matters\n\nThe key to reducing housing costs through industrialised construction is scale.\n\nWhen production levels are small, factories cannot spread fixed costs over many units.\n\nThis results in high prices, even if units can be completed quickly.\n\nIn countries where factory-built housing works at scale, companies build the same homes repeatedly. That allows workers to get faster and factories to spread the cost of specialised equipment across many homes. They also have strong supply chains for components and labour.\n\nBy comparison, Australia's sector is still small and most manufacturers produce only a handful of units each year.\n\nWithout big volumes and steady demand, off-site building can't unlock real cost reductions.\n\nThat said, Bunnings's entry is noteworthy.\n\nIt shows mainstream retail channels see a business opportunity in modular building products. It may help raise public awareness of alternative construction methods in everyday Australian life.\n\nWhat are the long-term fixes?\n\nThe housing challenge will not be solved by pods.\n\nWhat is needed is much larger investment into these alternative methods of construction, from both state and federal governments, aligned with international partnerships that bring technology, expertise and industrial scale.\n\nCountries that have succeeded in using factory-built homes at scale have done so through coordinated policy support, strong industrial strategies, workforce training and investment in manufacturing facilities.\n\nSome also combine this with land reform, faster approvals and direct procurement of homes for public needs.\n\nA way forward\n\nBunnings's backyard pods may be an interesting new product line.\n\nThey can provide extra space and appeal to certain buyers but they are not a long-term housing solution for most Australians.\n\nBunnings is riding the shift toward factory-built housing but the real shift is bigger: Australia needs to build high-quality homes at scale, not just sell small pods.\n\nAustralia needs a dramatic expansion of factory-based building capacity, supported by policy, investment and a clear pathway from small prototypes to large-volume, high-quality homes for communities in need.\n\nEhsan Noroozinejad is a senior researcher and Sustainable Future Lead at the Urban Transformations Research Centre at Western Sydney University. This piece first appeared on The Conversation.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/nt-greens-mla-kat-mcnamara-quits-politics/106320616",
    "title": "First Greens politician quits NT parliament 18 months after historic win",
    "publish_date": "Sun, 08 Feb 2026 23:30:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "The first Greens politician in the Northern Territory parliament is quitting 18 months after being elected to the seat of Nightcliff.\n\nKat McNamara is leaving the role effectively immediately due to \"ongoing health challenges\", she said in a statement on Monday.\n\n\"I have made the extraordinarily difficult decision to resign as the Member for Nightcliff,\" she said.\n\n\"I cannot stress enough how difficult this decision has been to come to.\n\n\"It has been an enormous privilege to serve the people of Nightcliff and to be the first Greens member elected to the Northern Territory Legislative Assembly.\n\n\"This has been something beyond my wildest dreams, and I have shouldered the immense responsibility of the role with pride every day.\"\n\nKat McNamara won the seat of Nightcliff in the August 2024 NT election, marking the Greens first win in the NT. (ABC News: Andie Smith)\n\nMcNamara said she could no longer give the job her all.\n\n\"I am someone that likes to commit 150 per cent to everything I do,\" she said.\n\n\"This community deserves to continue to have someone who can give them that, and unfortunately, I cannot anymore.\n\n\"As anyone in parliament will tell you, the responsibility of the role bears a significant toll on us all, particularly for those of us with young children.\"\n\nKat McNamara has been vocal on environmental and integrity issues, and also spoke out about the NT's new administrator. (ABC News: Pete Garnish)\n\nDuring her time in parliament, McNamara has championed environmental and integrity issues.\n\nMcNamara also called for a ban on gifts from corporate bookmakers to members of the NT's gambling commission.\n\nShe was one of seven crossbench and opposition MLAs who walked out of Question Time last week in protest of the appointment of David Connolly as NT administrator.\n\nIn October, McNamara was referred to the privileges committee for an investigation into the alleged misuse of an electorate office for electioneering.\n\nThe referral from the CLP government came one day after McNamara brought a parliamentary censure motion against Deputy Chief Minister Gerard Maley, for alleged disrespect, aggression and intimidation against women in the chamber.\n\nKat McNamara was banned from NT Parliament for 24 hours, after protesting the government's administrator appointment. (ABC News: Pete Garnish)\n\nMcNamara's exit will trigger a by-election in the Darwin-based Nightcliff seat, one of the territory's most progressive.\n\nNightcliff was held by Labor for 24 consecutive years, before McNamara beat former chief minister Natasha Fyles to win it for the Greens in 2024.\n\nThe by-election will be the first test for Labor Opposition Leader Selena Uibo since the party was thumped at the 2024 election.\n\nLabor was left with just four remote-based seats in the 25-seat parliament.\n\nIn her statement, Kat McNamara said she hopes the next member for Nightcliff will reflect the electorate's \"progressive\" character. (ABC News: Pete Garnish)\n\nIn her statement, McNamara said she hoped her successor honoured the progressive \"values and spirit\" of the electorate.\n\n\"Nightcliff is uniquely progressive, engaged, and full of hope, and must be represented by someone who truly listens and is led by this community,\" she said.\n\n\"That is something I have strived to do every day as the Member for Nightcliff, and I hope that my successor honours the values and spirit of this wonderful place.\"\n\n'Paved the way'\n\nNT Greens party convenor Jonathan Parry said McNamara had made an \"enormous contribution\" to the Nightcliff electorate.\n\nGreens make history with first NT politician The Greens are set to claim an historic victory in the Northern Territory election, winning their first ever territory seat in what was once Labor's safest electorate.\n\n\"Supporting and listening to constituents, hosting regular community dinners, film nights, policy information sessions, and starting Nightcliff's first community pantry,\" he said.\n\n\"In parliament, they have been a strong advocate for climate action, gambling reform, integrity, social justice, renters' rights, and for raising awareness of the ongoing genocide in Palestine.\n\n\"They have re-imagined what it means to be a member of the Legislative Assembly and have paved the way for strong progressive representation into the future.\"\n\nNT Speaker Robyn Lambley said the NT's acting administrator and chief minister had been advised of McNamara's resignation.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/isaac-herzog-to-visit-israel-president-bondi-attacks/106320994",
    "title": "Live: Isaac Herzog lays wreath at Bondi to commemorate victims of antisemitic attack",
    "publish_date": "Sun, 08 Feb 2026 23:08:50 +0000",
    "category": "finance",
    "authors": [
      "Georgie Hewson",
      "Daniela Pizzirani",
      "Shannon Corvo",
      "Ted O'Connor",
      "Miriah Davis",
      "Alexander Lewis"
    ],
    "text": "Laura Tingle is the ABC's global affairs editor, and she's closely watching this visit while giving her analysis to ABC News Channel.\n\nShe says Israel's president emphasised solidarity with Jewish people while expressing frustration more couldn't be done to deal with antisemitism in the lead-up to the Bondi attack.\n\nShe noted his response to a question about the protesters taking aim at his visit.\n\n\"He tended to say these are people who don't believe the state of Israel should have the right to exist, (are) hostile to Israel as a nation, and he pointed out that Israel is a nation of Jewish people,\" she says.\n\nMore broadly, Tingle says, while the federal government’s invitation was well intentioned, it probably didn’t anticipate just how divisive Isaac Herzog’s visit would be.\n\nShe says the tension comes down to the intersection of two really fraught issues, being the Bondi attack and Israel’s conduct in Gaza.\n\n“President Herzog is a contentious figure because of the finding by a UN commission of inquiry last year that he had been found to have incited genocide,” she says.\n\n“But more broadly, I think, it's this question of the extent to which this has really raised the issue of the actions of the Israeli government, and to what extent that may have escalated the tensions that we ended up seeing in Bondi.\n\n“And that's been something that people have been trying to avoid linking until now.”\n\nShe wrote more on the topic at the weekend.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/cyclists-slam-shared-path-at-new-sydney-fish-market/106307556",
    "title": "Cyclists say Sydney Fish Market bike route 'accident waiting to happen'",
    "publish_date": "Sun, 08 Feb 2026 22:53:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Cyclists say a shared bike path outside the new Sydney Fish Market is an accident waiting to happen because it forces busy crowds to clash with riders.\n\nRunning beside the fish market is a crucial cycling route from Sydney's inner west to the city, used by hundreds of cyclists a day.\n\nBut instead of constructing a separated cycleway during the $836 million build, the state government opted for a wide pavement designed to be shared by pedestrians and cyclists.\n\nCity of Sydney Council Deputy Mayor Jess Miller said the decision had created a \"nightmare\".\n\nCyclists say a new shared bike path at the new Sydney Fish Market is an \"accident waiting to happen\". (ABC Radio Sydney: Aston Brown)\n\n\"We know from experience that whenever you put cyclists and pedestrians and cars and coaches [dropping people at the market] all in one busy environment, it's a recipe for absolute disaster,\" Cr Miller said.\n\n\"We had been advocating [to the state government] for a separated cycleway since the very start,\" she said. \"At every juncture where we requested, pleaded, cajoled to have this bit of infrastructure included, we were just ignored.\"\n\nCyclist Bek Hawkins said the new shared path was an improvement on riding in traffic, but it had created a new hurdle.\n\nSome cyclists say they prefer to ride on the road to avoid the foot traffic. (ABC Radio Sydney: Aston Brown)\n\n\"You get to the markets [and] everybody is walking around looking at the new building, and you're just on your commute. It creates a clash,\" Ms Hawkins said.\n\n\"It just feels like an accident waiting to happen,\" said Emma Taviani, who also rides past the fish market on her commute.\n\n'The best we could do at the time'\n\nFormer Liberal transport minister Rob Stokes said the project's final design reflected \"very ingrained views\" inside some quarters of government that backed road traffic over pedestrians and cyclists.\n\nMr Stokes said \"two clans\" existed within Transport for NSW.\n\n\"There were those who were very people-focused, then there were those who were almost vehicle-focused,\" he said.\n\n\" I think a lot of the decisions that had gone into the cycle infrastructure around the fish market had been made by the latter group. \"\n\nTransport for NSW opted against a separated cycleway to keep a lane for car traffic. (ABC Radio Sydney: Aston Brown)\n\nMr Stokes also described \"very powerful vested interests\" — due to a revolving door between government and the private sector — that prioritised large road and rail projects over active transport infrastructure.\n\nIn response to Mr Stokes's remarks, a Transport for NSW spokesperson said the government recognised Sydney's walking and cycling network as a \"vital part\" of the transport system and said it was committed to its expansion.\n\nA preliminary design of the precinct, seen by ABC Radio Sydney, shows a fully separated cycleway running by the fish market along Bridge Road, with one less traffic lane than there is now.\n\nA planning document shows plans for a potential separated cycleway outside the Sydney Fish Market. (Supplied: City of Sydney)\n\nAs transport minister, Mr Stokes approved the final design but said it \"definitely\" should have included a dedicated cycleway.\n\nHe said the shared path was \"the best we could do at the time\" because the \"early work hadn't been done\".\n\nA NSW government spokesperson did not specify why concept plans for a separated cycleway did not proceed. In a statement, they said the shared path at the fish market was constructed to \"best accommodate\" pedestrians and cyclists of all ages and abilities, and that the government would continue to monitor travel patterns in the area.\n\n\"Given the constrained environment and current demand, there is a need to cater for a wide range of different types of transport users to the fish market as well as through the area,\" they said.\n\n\"This includes pedestrians, bike riders, public transport, coach visitors, as well as motor vehicle traffic, given that Bridge Road is an important access point to ANZAC Bridge and the city.\"\n\nThe new Sydney Fish Market opened on January 19. (ABC News: Monish Nand)\n\nNSW government policy recommends building separated bike lanes in busy areas along \"strategic cycling corridors\" such as this one.\n\nMichael Harrison, a Sydney-based urban designer and planner with more than 40 years of experience, said the final design contradicted this policy and was \"inexplicable\".\n\n\"The excuse might have been that the traffic lanes are needed for traffic — and they are. But there still would have been space available for a dedicated cycleway due to the deep setback of the building,\" he said.\n\n'It's disjointed and illogical'\n\nMr Stokes said that while the fish market shared path was functioning better than he expected, his biggest frustrations were the \"missing links\" between it and existing cycling infrastructure.\n\nCyclist Bek Hawkins's commute between Glebe and Pyrmont only takes 10 minutes, but she is sometimes shaken up by the time she arrives at work.\n\nBefore passing the fish market, she says she has to negotiate \"several dangerous pinch points\" that require her to suddenly merge in and out of busy footpaths and traffic.\n\nBecause of these clunky connections, many cyclists, including Gemma Bassett, prefer to avoid the shared path altogether and ride on the road.\n\n\"It's disjointed and illogical,\" Ms Bassett said.\n\n\" It's quicker and more convenient to cycle on the road. \"\n\nPeter McLean is the chief executive of the state's peak cycling advocacy group, Bicycle NSW. \"The real shame is it'll cost so much more installing a bike path retrospectively,\" he said.\n\nMcLean said attitudes towards cycling were improving as more cycleway projects were opening across the city.\n\n\"But we have a long way to go before best practice and world-class bicycle infrastructure is rolled out without Bicycle NSW having to pester and harass the government,\" he said.\n\nAnother local cyclist, Ben, who asked for his surname to be withheld, rides past the fish market regularly. \"You ride on the footpath and get in the way of pedestrians, you ride on the road and car drivers get frustrated,\" Ben said.\n\n\"Everyone just gets the shits. It makes us look bad.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/winter-olympics-2026-day-two-quick-hits-lindsey-vonn/106319962",
    "title": "Quick hits: Breezy's broken medal and Lindsey's broken leg",
    "publish_date": "Sun, 08 Feb 2026 22:47:31 +0000",
    "category": "sports",
    "authors": [],
    "text": "US great Lindsey Vonn breaks her leg, and her compatriot breaks her gold medal as Tess Coady sneaks through to the final after a nervous wait on the bubble.\n\nHere are the quick hits from the Winter Olympics.\n\n1. Vonn airlifted out\n\nLindsey Vonn was taken to hospital via helicopter after her big crash in the women's downhill at Cortina. (AP: Jacquelyn Martin)\n\nUS skiing superstar Lindsey Vonn was already making headlines this Olympic Games for deciding to compete despite having a completely torn ACL.\n\nAll eyes were on the 41-year-old as she went to make her run in the women's downhill racing, 24 years after her debut in 2002.\n\nBut just 12 seconds in, she had an awful crash.\n\nLindsey Vonn was airlifted off the downhill track after a horrible crash. (Getty Images: PA Images/Andrew Milligan)\n\nIt was a sight no-one wanted to see, and an eerie silence took hold of Cortina d'Ampezzo. She lay on the track for about 10 minutes while being seen by medics until a helicopter came to take her away.\n\nAn official statement from Team USA said Vonn was \"in stable condition and in good hands with a team of American and Italian physicians\", undergoing surgery to stabilise a broken left leg.\n\nFans were stunned into silence when Lindsey Vonn crashed 12 seconds in to her downhill racing run. (Getty Images: Mattia Ozbot)\n\n2. 'Tom Daley, I broke my medal for you'\n\nThere is one thing, more than anything else, you would hope not to do to your gleaming, newly acquired gold medal.\n\nAnd that one thing is break it.\n\nUnfortunately for Breezy Johnson, who topped the podium in the women's downhill skiing on day two, that's exactly what she did.\n\nJohnson is an avid knitter, and when a BBC reporter told her she would receive a message from British diving superstar and fellow knitter Tom Daley, she could hardly contain her excitement.\n\nBouncing up and down, the medal snapped from its lanyard and fell to the floor.\n\n\"Tom Daley, I broke my medal for you,\" Johnson said.\n\nJohnson later put out a call on Instagram to any makers on Etsy for a custom carrying case, seeing as she could no longer wear it around her neck.\n\nBreezy Johnson needs a new way to carry her Olympic gold. (Instagram: breezyjohnsonski)\n\n3. Coady's nervous wait\n\nAustralian Tess Coady was always in a tricky spot in the women's snowboard big air qualification.\n\nThe 2022 slopestyle bronze medallist was the first rider, meaning she had to watch 28 other women try to better her score, with only the top 12 going through to the final.\n\nOnly the top two scores from the three qualifying runs counted, and Coady added a 75 with her switch backside 900 to a strong 78.50 from her first run, leaving her with a solid but surmountable total of 153.50, and a long wait ahead of her.\n\nA bronze medallist in Beijing, Tess Coady only just scraped through to the final of the women's big air. (Getty Images: Michael Reaves)\n\nBy the time China's Zhang Xiaonan pipped her by a point, Coady was officially bumped down to 12th spot and sitting on the bubble with 11 riders still to come.\n\nThankfully for the 25-year-old, it was the last time her score was bettered, as she managed to progress to the Olympic final for the second straight time, accompanying compatriot Meila Stalker.\n\nThe cameras found a gleeful Coady in the holding pen, and she wiped a bit of faux sweat off her brow as attention turned to the final on Tuesday at 5:30am AEDT.\n\n4. Karl goes topless\n\nIt was a celebration to match the most epic of parallel giant slalom victories.\n\nTrailing for much of the men's final, 40-year-old Benjamin Karl stormed home to defend his gold medal from Beijing and set in motion one of the Winter Olympics' more memorable celebration sequences.\n\nThe roaring veteran wasted no time in removing his top, flexing his muscles and holding the pose with authority.\n\nIt was quite the performance, even before taking into account the sub-zero Italian temperatures he had exposed himself to.\n\nBenjamin Karl roared after removing his top in celebration of his gold medal. (Getty Images: David Ramos)\n\nAnd he wasn't done there.\n\nThe now two-time Olympic champion capped off the display by flinging himself towards the ground, where he lay motionless and face down in the snow.\n\nBenjamin Karl produced a celebration to remember after defending his gold medal. (Getty Images: Hannah Peters)\n\n5. How to watch the Super Bowl in Italy\n\nWhether it be European football, cricket in India or the Winter Olympics, Australian sport fans are well-accustomed to an interrupted sleep schedule.\n\nBut for American bobsleigh athletes Joshua Williamson and Boone Niederhofer, it seems to be something of a novel idea.\n\nThe bobsleigh program gets underway Thursday night AEDT. (Getty Images: Maddie Meyer)\n\nSpeaking at the Olympic village in Cortina, the pair explained how they planned to watch this morning's Super Bowl between the New England Patriots and the Seattle Seahawks, beginning at 12:30am in Italy.\n\n\"My plan is to wake up and watch maybe the second half or the fourth quarter to make sure I'm still doing my job here,\" Williamson said.\n\n\"I'll probably just watch it on my phone in bed, throw it on and make sure I can catch some of it.\"\n\nNiederhofer, who played college football for Texas A&M before becoming an Olympian, said he would be taking a similarly pragmatic approach.\n\nBoone Niederhofer played college football as a receiver for Texas A&M from 2014 to 2016. (Getty Images: Thomas B. Shea)\n\n\"We were talking about it. I think we're going to stay up and watch kick-off and then take a two-hour nap, wake up and watch the fourth quarter,\" he said.\n\n\"I'm okay forfeiting the half-time show.\"\n\nABC Sport will live blog Super Bowl LX, which gets underway at the much more reasonable time of 10:30am AEDT.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/super-bowl-lx-live-blog-seahawks-vs-patriots-bad-bunny/106320762",
    "title": "Live: Bad Bunny brings out superstar surprise guests in SBLX half-time show",
    "publish_date": "Sun, 08 Feb 2026 22:29:40 +0000",
    "category": "sports",
    "authors": [
      "Chris De Silva"
    ],
    "text": "Well, well, well!\n\nDrake May throws two absolute DIMES out of nowhere and suddenly the Pats are on the board!\n\nAn absolutely brilliant 35-yard pass into the left corner from Maye and it's Mack Hollins who gets the touchdown.\n\nThat 35-yarder followed a 24-yard sniper that found Hollins in the middle of the field.\n\nThe conversion is in and here come the Patriots! An interesting choice from the Pats to not go for a two-point conversion.\n\nThere's 12:27 left on the clock, still plenty of time if they can get their offence humming.\n\nSeahawks 19-7 Patriots",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/kimberley-growers-wrap-up-first-season-processing-cotton-locally/106303718",
    "title": "Cotton processing in northern WA an 'excellent' success after first season",
    "publish_date": "Sun, 08 Feb 2026 22:23:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Western Australia's newest cotton gin has completed its first operational season, with the final modules moving through the facility last week.\n\nDesigned to process cotton from the Ord Valley, the Kimberley Cotton Gin opened in Kununurra about 3,000 kilometres north-east of Perth in August 2025.\n\nThe region's growers planted a record-breaking 10,000 hectares of cotton in preparation, up from 2,200 hectares the previous year.\n\nNew era for the Ord\n\nKimberley Cotton Company (KCC) chair Jim Engelke said the facility processed more than 81,000 bales in its inaugural season.\n\n\"It's a good feeling to get to the end,\" he said.\n\n\"An excellent outcome with a lot of effort from a lot of people to make that all happen, and overall, [I'm] very pleased with where we've got to.\"\n\nJim Engelke says the Kimberley Cotton Gin processed 81,000 bales in its first season. (ABC News: Jess Baker)\n\nThe KCC, supported by Kimberley Agricultural Investment, Ord River District Cooperative, and Miriuwung Gajerrong Corporation, was formed in 2021 to lead the construction and operation of the gin.\n\nPreviously, growers had to send their cotton interstate, up to 3,500km, to be processed.\n\nLessons learned\n\nSecond-generation Ord farmer and KCC investor Christian Bloecker said getting the gin off the ground was not easy, but the effort would ultimately pay off.\n\n\"It keeps everything local. The jobs local, the processing and the money that comes from that local,\" he said.\n\n\"It's a way better option than sending cotton by road to Katherine or Queensland like we used to.\"\n\nAlthough 2025 was not Mr Bloecker's first year producing cotton, it was his biggest — in terms of area — by more than double.\n\nKimberley growers no longer have to send their cotton interstate to get processed. (ABC News: Kelsey Reid)\n\nHe said he learned plenty about the crop and how to grow it well.\n\n\"Definitely the aim for this year is grow shorter cotton,\" Mr Bloecker said.\n\n\"But there's lots of things in terms of nutrition and irrigation, and from a supply chain point of view, how we make things work.\"\n\nLooking ahead\n\nThere was already cotton in the ground at Mr Bloecker's Ord Valley farm this time last year.\n\nHe delayed planting for the 2026 season due to wet weather, and hopes a deferred start might produce a shorter crop.\n\nChristian Bloecker says he is waiting for the rain to subside before planting again. (ABC News: Kelsey Reid)\n\nOther growers began planting for the coming season before the final modules from 2025 had been processed through the Kununurra gin.\n\nMr Engelke said Kimberley Agricultural Investment planted its first fields for the season in January.\n\n\"Our anticipated plant area is very similar to last year, which is around about the 4,000-odd hectares,\" he said.\n\n\"For the region, I don't exactly know, but we're expecting somewhere around about 10,000 hectares, possibly a bit more.\"\n\nPrices stagnant\n\nAs producers in the north navigate the formation of their cotton industry, international cotton prices remain subdued.\n\nCotton Australia northern manager Simone Cameron said the price of raw cotton lint was \"not ideal\".\n\n\"Prices have been holding around that mid-$500 per bale price for about 12-18 months,\" she said.\n\n\"Historically, it sits at around $600.\"\n\nLast season, Australia produced about 5.4 million bales of cotton, collectively worth about $3.7 billion. (ABC News: Kelsey Reid)\n\nMs Cameron said the cotton industry was up against the synthetic fibre industry, which was \"very good\" at marketing itself as cleaner and greener than natural fibres.\n\n\"We do have some work to do there to help really drive that natural fibres are much better for the planet than a synthetic fibre,\" she said.\n\nThe decline of global cotton prices over the past year has impacted the profitability of the crop, but Mr Bloecker said it was still viable in the Kimberley.\n\n\"That's the thing about selling it on the world market, there are going to be these cycles where the price is lower,\" he said.\n\n\"I'd love the price to be higher, but even at $500 a bale, an industry can grow off that.\"\n\nWyndham port gateway to the world\n\nMeanwhile, growers in the Ord eagerly await the Port of Wyndham, located 100 kilometres north-west of Kununurra, gaining First Point of Entry (FPOE) status.\n\nPrime Minister Anthony Albanese granted FPOE status last year, but the change will not come into effect until the port has the infrastructure to manage biosecurity threats.\n\nThe Kimberley Cotton Gin has the capacity to process more than 100,000 bales annually. (ABC News: Michael Franchi)\n\nThe first shipment of locally grown cotton was exported from Wyndham in October, consisting of about 60 containers, each carrying about 104 bales of cotton.\n\nHaving FPOE status will allow the port to receive empty containers for immediate export and enable direct international shipping for the Kimberley cotton industry.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/federal-court-orders-sale-of-rockhampton-plaza-hotel/106308402",
    "title": "Court order brings end to long-running saga over 'eyesore' hotel property",
    "publish_date": "Sun, 08 Feb 2026 22:07:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Rockhampton Plaza Hotel looks less than inviting when you drive into the central Queensland city.\n\nIt sits surrounded by temporary fencing, with smashed windows and timber boards nailed across its seven-storey façade.\n\nOvergrown gardens cover the site and public footpath, hiding piles of rubbish of broken glass and mattresses.\n\nThe hotel was popular in its heyday, hosting weddings and even politicians. (ABC Capricornia: Vanessa Jarrett)\n\nAfter years of complaints from local authorities a judge has ordered the sale of the property by owner its James Chang, director of Chang Holdings Pty Ltd, who is known to live at the site.\n\nThe Federal Circuit Court has appointed Nick Combis of accounting firm Vincents to sell the building.\n\nMr Combis told the ABC the property was being sold \"as is\".\n\nCalls for redevelopment\n\nA sign has been painted on the concrete warning the public of fines for trespassing. (ABC Capricornia: Vanessa Jarrett)\n\nThe chief executive of tourism body Capricorn Enterprise, Mary Carroll, described the building as an \"absolute eyesore\" which impacted the city's reputation.\n\n\"The sooner it is demolished or sold, rebuilt, the better,\" she said.\n\n\"It's a wasted site and we are desperate for new hotel accommodation in this region; demand has never been higher for hotel development.\"\n\nMs Caroll said she hoped an investor would redevelop the property.\n\n\"It will most likely need to be demolished, but I'm not an engineer or building expert.\n\n\"My dream would be that something be constructed there, a brand-new hotel, and opened in the next six years.\"\n\nMary Carroll says the site has a lot of potential for development. (ABC Capricornia: Katrina Beavan)\n\nThe property was purchased in 1996 for $3 million and has been closed to the public since 2014.\n\nIt is unclear what the offering price will be, but according to real estate data the 4,047-square-metre block of land was valued at $1.45 million in June 2025.\n\nQueensland-based qualified and registered trustee Andrew Weatherley said appointing a statutory trustee was generally a \"last resort\".\n\n\"They're not all that common,\" he said.\n\nAndrew Weatherley says a court-appointed trustee is often a last resort. (Supplied: Andrew Weatherley)\n\nThe statutory trustee acts to coordinate the sale following any specific terms of the court order and directions on distribution of the sale proceeds.\n\n\"Sometimes that's auction, sometimes it's an expression of interest,\" Mr Weatherley said.\n\n$200,000 outstanding rates bill\n\nLast year, the Rockhampton Regional Council sought a public health order through the courts for the clean-up of the site.\n\nThe court documents stated the property had piles of waste containing used kitchen items, needles and faeces, and was likely a breeding ground for rodents and could contribute to human diseases.\n\nThe order, issued in August 2025 by the Rockhampton Magistrates Court, gave leave for the council to undertake works to tidy the outside of the property and that all gates, doors and windows be blocked and temporary fencing erected to prevent public access.\n\nThe costs of these works have been passed onto the owner.\n\nIn 2023, Chang Holdings Pty Ltd was ordered in the Rockhampton Magistrates Court to pay more than $44,000 in fines for 16 charges related to fire safety breaches at the building.\n\nThe court action stemmed from visits and investigations by the Queensland Fire Department regarding failures of the fire doors, extinguishers, hose reels and exit lighting and signage.\n\nRockhampton Regional Council was also successful in another court order in 2021 for unpaid rates against the property of $207,008.05.\n\nDuring the court proceedings, Mr Chang said he could not afford the bills and the hotel was closed so he should not be charged.\n\nThe owner was fined in 2023 for fire safety breaches at the building. (ABC Capricornia: Vanessa Jarrett)\n\nOutstanding bills would likely be paid out of the sale proceeds, Mr Weatherley said.\n\nMost people did not know the legislation existed and was used as a last resort but could be quite costly, he added.\n\n\"If in a worst-case scenario that you can make an application to court, and there's some costs involved in that, but usually with the value of the property and the equity that's often available, those costs will come out of the sale proceeds.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-09/cobargo-deua-river-still-rebuilding-after-black-summer-bushfires/106273804",
    "title": "New bushfires a stark reminder that Black Summer recovery still not over",
    "publish_date": "Sun, 08 Feb 2026 21:58:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "As communities along the NSW South Coast continue to deal with the scars of Black Summer six years on, the smell and sight of smoke this summer brought back painful memories.\n\nResidents on the NSW far south coast said they felt triggered when heatwave conditions led to a bushfire starting in the Wadbilliga National Park, 20 kilometres north-west of Cobargo, last month.\n\nIn December 2019, Cobargo's main street was gutted by a fire that became linked to the deaths of seven people.\n\nThe Wadbilliga fire was not extinguished until last week.\n\nWith the devastation of the 2019-20 fires — which claimed close to 1,000 homes and more than 1.5 million hectares in the region — still fresh, it has made many in its vicinity take stock of how prepared they are for the next big fire season.\n\nA bushfire started in January in the Wadbilliga National Park, but was eventually brought under control by the RFS. (Supplied: NSW RFS)\n\nTelecommunications lifeline\n\nIn the remote Deua River Valley, south-west of Batemans Bay and to the north of the Wadbillinga NP, Clay Stafford gets emotional when recalling Black Summer.\n\nHe remembers being out with the Rural Fire Service (RFS) when his community's lifeline to the outside world — a telecommunications tower — went down.\n\n\"We had got used to updates from the fire app, and we'd also gotten used to looking at ABC News to see what was going on,\" Mr Stafford said.\n\n\"All that just ceased in one day, it just stopped.\"\n\nOn December 31, 2019, the Mount Wandera telecommunications tower was destroyed.\n\nThe access road to the Mount Wandera transmitter after the Currowan fire went through in January 2020. (Supplied: Clay Stafford)\n\nExtreme heat from the fire melted cables and infrastructure and knocked out critical services including mobile phone and internet coverage, radio and television transmission and emergency communications.\n\nIt took five months for mobile phone reception to return in the valley, compounding the challenge of fighting the fires.\n\n\"It did make us go back to basics. We got our old CB radios just to communicate with other people in the RFS,\" Mr Stafford said.\n\nThe Mount Wandera transmitter is vital for internet, mobile and emergency communication, as well as radio and television across the NSW South Coast. (ABC South East NSW: Toby Hemmings)\n\nWhile the tower was rebuilt in October 2020, the Eurobodalla Shire Council received federal government funding in 2023 to improve the resilience of its site.\n\nBut Mr Stafford said he was concerned about the lack of preparation in the lead up to summer, with access roads only cleared in the past few weeks.\n\nIn the middle of heatwaves and conditions reminiscent of Black Summer last month, Mr Stafford said he had been worried whether the site would be resilient enough to survive the next blaze.\n\n\" For us, having seen it burn, it's a big issue. \"\n\nIn a statement, a spokesperson for the Eurobodalla Shire Council said advice received from the NSW RFS was that clearing around the tower would offer limited bushfire protection.\n\n\"To improve access to the telecommunications site, dangerous or high-risk trees and vegetation along Knowles and Wandera Trig Road are being removed,\" the statement said.\n\n\"Due to restrictions to crown land approvals, ongoing maintenance costs and NSW RFS advice that clearing would offer limited bushfire protection, Council is instead focusing on improving access and strengthening the site itself.\n\n\"This includes installing fireproof lagging on the cables and replacing the existing chain-mesh fencing with Colorbond fencing.\"\n\nCouncil said works would be completed later this year.\n\nThe Cobargo Historic Village sign was destroyed during the January 2020 bushfires. (ABC News: Matt Roberts)\n\nA gradual rebuild\n\nOne hundred kilometres further south, and to the east of the Wadbillinga NP fire, the town of Cobargo is still trying to regain what was lost during Black Summer.\n\nThe main street of Cobargo was destroyed by fire during the January 2020 bushfires. (ABC News: Matt Roberts)\n\nIn the aftermath of the destruction of many of the buildings in the main street, a group of volunteers set up the Cobargo Community Development Corporation (CCDC) to help the reconstruction of the town.\n\nLoading...\n\nCCDC chairperson John Walters said without rebuilding the main street in a timely and coordinated fashion, Cobargo's future looked bleak.\n\n\"We faced relegation to being just a forgotten little whistle stop on the highway,\" he said.\n\nJohn Walters heads the Cobargo Community Development Corportation, which was set up by volunteers. (ABC South East NSW: Vanessa Milton)\n\nUsing funding from the Bushfire Local Economy Recovery Fund (BLERF), co-funded by the federal and state governments, the CCDC has so far managed the construction of a new post office, village square and market hall.\n\nMr Walters believes it is the only BLERF project to receive funding to rebuild commercial infrastructure.\n\n\"To do that, we had to take the land out of private ownership and transfer it to community ownership as a not-for profit,\" he said.\n\nMr Walters said the projects have faced up to 18 months worth of external delays, but they now aim to be finished by March.\n\nIt is a similar story for the new Cobargo Bushfire Resilience Centre on the main street.\n\nThe Cobargo Bushfire Resilience Centre will honour the people who lost their lives during the Black Summer bushfires. (ABC South East: Jacinta Counihan)\n\nThe centre aims to be a space for commemoration for the people who lost their lives in Black Summer, plus a place to hold events, exhibitions and education programs.\n\nThe building is complete, but the open date is unknown due to bureaucratic complications with neighbouring construction.\n\nRhonda Ayliffe, whose family donated the land for the centre, said the bushfire in Wadbilliga NP last month was a reminder of how far the recovery still has to go.\n\nRhonda Ayliffe led the creation of the Cobargo Bushfire Resilience Centre on a site her family had owned for generations. (ABC South East NSW: Vanessa Milton)\n\n\"When you have a fire in the same spot where one was before, people think, 'Gosh, we haven't even recovered, we haven't even got the main street back operating again'.\"\n\nMore than bricks and mortar\n\nDespite the setbacks, Ms Ayliffe said the small close-knit communities along the South Coast know that recovery and resilience is more than rebuilding physical structures.\n\n\"Our idea of resilience was not just bouncing back, it's bouncing forward,\" she said.\n\nJason Miles and his family moved to Cobargo after Black Summer. (ABC South East NSW: Vanessa Milton)\n\nJason Miles and his family moved to Cobargo in the aftermath of Black Summer and renovated the historic Cobargo bank building as a cafe.\n\nHe said his family had been embraced by the community in the continuing journey of recovery.\n\nThe rebuild of Cobargo's main street is close to completion. (ABC South East NSW: Vanessa Milton)\n\n\"There's still ones in the community who will never get back what they've lost,\" Mr Miles said.\n\n\"But the general hope of the area, that underlying positivity for the future, it's risen.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/nfl/super-bowl-2026-live-updates-new-england-patriots-v-seattle-seahawks-in-santa-clara-california-20260208-p5o0ii.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Super Bowl 2026 LIVE updates: Patriots stay in fight with vital score after Seahawks break touchdown drought",
    "publish_date": "Mon, 09 Feb 2026 13:51:38 +1100",
    "category": "sports",
    "authors": [
      "Iain Payten",
      "Frances Howe"
    ],
    "text": "A block party in fields of sugar cane as reggaeton and salsa take over.\n\nIt’s the land of the white plastic chairs. The land of asado (Latin barbeque), of the bodega store, of plastic tables where you play dominoes, of stalls selling Piraguas (ice topped with coloured syrups), of perreo (twerking), long-acrylic nails being cured under UV lamps and delicious dancing.\n\nIt is not the land of illegal people.\n\nThe detail! Credit: Getty Images\n\nWomen’s edges are laid with gel and their lips are outlined with dark brown lip liner. They wear large gold hoops with gold chains. Their hair is thick, curly and their outfits are made to accommodate the sway of their hips.\n\nEmerging from a pink casita (the little house), Mr Bunny passes an array of notable guests dancing. The line-up includes Colombian superstar Karol G, actor Pedrol Pascal, influencer Alix Earle (this one is a bit random), actress Jessica Alba and rappers Cardi B and Young Miko – with more to be uncovered.\n\nBad Bunny’s performance was an homage to Puerto Rico. Credit: Getty Images\n\nThe Puerto Rican flag hoisted onto Bad Bunny’s shoulders shone in a light blue – a symbol of independence and sovereignty – instead of its normal dark blue.\n\nA post by writer Rohan Nadkarni said that sources close to Bad Bunny’s performance said the wedding during the show was real. “They invited Bad Bunny to their wedding and in turn he invited them to get married during his performance” the post says.\n\nTo finish the show, Benito raises the football he carried periodically throughout the performance to the camera. Behind him is the lush, tropical landscape of his home, Puerto Rico, drums, dancers, flags and fireworks. “Together, we are America,” is inscribed into the football.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/world/barner-touchdown-breaks-pats-hearts-in-super-bowl-60-20260209-p5o0r4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Barner touchdown breaks Pats hearts in Super Bowl 60",
    "publish_date": "Mon, 09 Feb 2026 13:36:24 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/lifestyle/george-clooney-stars-in-victorian-era-themed-ad-for-grubhub-20260209-p5o0r0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "George Clooney stars in Victorian era-themed ad for Grubhub",
    "publish_date": "Mon, 09 Feb 2026 13:25:32 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/lifestyle/charli-xcx-stars-in-super-bowl-ad-20260209-p5o0qx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Charli XCX stars in Super Bowl ad",
    "publish_date": "Mon, 09 Feb 2026 13:21:17 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/lifestyle/pokemon-airs-star-studded-super-bowl-ad-20260209-p5o0qu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pokémon airs star-studded Super Bowl ad",
    "publish_date": "Mon, 09 Feb 2026 13:20:14 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/business/companies/asio-v-abc-broadcaster-stands-by-bondi-investigation-after-spy-agency-rebuke-20260209-p5o0mb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASIO v ABC: Broadcaster stands by Bondi investigation after spy agency rebuke",
    "publish_date": "Mon, 09 Feb 2026 12:57:10 +1100",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "Advertisement\n\nBusinessCompaniesBondi shooting ASIO v ABC: Broadcaster stands by Bondi investigation after spy agency rebuke Calum Jaspan February 9, 2026 — 12:57pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nASIO has issued a rare public statement declaring it holds “grave concerns” about the accuracy of an ABC investigation into the Bondi massacre set to air on Four Corners on Monday night and warning of further action if false claims are broadcast. The statement released on Sunday evening claims the ABC has relied in part on an “unreliable and disgruntled” source who had misidentified one of the alleged gunmen, 24-year-old Naveed Akram, and confused some of his actions before the attack with things done by someone else. ASIO Director-General Mike Burgess last week. Alex Ellinghausen The ABC is standing by the story, which it said used extensive reporting and numerous sources to examine the Akrams’ actions leading up to the attack. ASIO, which has not seen the program, said its ability to respond to Four Corners′ questions was constrained as it did not want to risk prejudicing the royal commission into antisemitism and the ongoing criminal investigation against Akram.\n\nAdvertisement\n\nAkram has been charged with murdering 15 people in the December 14 attack, in which his father and alleged co-conspirator Sajid Akram was shot dead by police. The first of two parts of Four Corners′ investigation was led by reporter Mark Willacy, airing last week. It provided an account of the events of the day of the attack, told by those present. The second part, led by reporter Sean Rubinsztein-Dunlop, will investigate “the secret lives of the terrorists, uncovering astonishing new information about the years leading up to the attack”, according to the ABC. The ABC will on Monday night air the second part of a Four Corners investigation into the Bondi terror attack. Christopher Pearce ASIO’s statement, made in response to unknown ABC questions and released publicly in an unusual pre-emptive move, notes that the domestic intelligence agency investigated Naveed Akram in 2019 using its “most sensitive capabilities.” “We assessed he did not adhere to or intend to engage in violent extremism at that time. Having reviewed all available intelligence, we stand by our assessment at that point in time,” the statement said. “Four Corners’ claims contain significant errors of fact.”\n\nAdvertisement\n\nASIO said “if the ABC chooses to publish claims it cannot substantiate [...] we will reserve our right to take further action.” Related Article Live\n\nIsraeli-Palestinian conflict Herzog visit LIVE updates: Israeli president lays wreath at Bondi Pavilion; protesters launch last-minute challenge to ‘extraordinary’ police powers The Bondi royal commission is required to complete its first report by April. It will examine, among other things, whether Australia’s intelligence and law enforcement services were as effective as they could have been in stopping the attack, how they co-operated and whether they were hampered by legal rules. ASIO said an ABC source had a track record of making statements that are untrue. The agency rejected previously reported claims that Naveed Akram is a close associate of terrorists. “The claims Four Corners is making were investigated at the time and found to be unsubstantiated,” ASIO said.\n\nAdvertisement\n\n“The ABC’s source mis-identified Naveed Akram. That is, the source claimed Naveed Akram said and did things that were actually said and done by an entirely different person. To be clear, Four Corners′ source mis-identified Naveed Akram, and therefore the associated claims are untrue.” Related Article Bondi shooting A father, a son and the radical world of terror An ABC spokesperson defended the program as a comprehensive investigation examining the events leading up to the worst terrorist attack on Australian soil. “Four Corners spoke to numerous people and provides a number of sources of information for a detailed picture of the Akrams’ actions and associations in the years leading up to the Bondi attack,” the spokesperson said. “Detailed questions were put to ASIO and its response is reflected in the story. The public will be able to watch the full investigation tonight.”\n\nAdvertisement\n\nRubinsztein-Dunlop declined to comment. Related Article ABC More Insight than Q+A: David Speers to host ABC’s new town hall show ASIO also rejected expected ABC accusations of understaffing and suggestions that redundancies at the intelligence agency in 2020 might have contributed in some way to its ability to prevent the massacre. “The claim any resourcing decision increased the likelihood of the Bondi attack is false, irresponsible and demonstrates profound ignorance of ASIO’s prioritisation frameworks and enduring investment in counterterrorism,” ASIO said. “Tragically, ASIO did not know what the perpetrators of the Bondi attack were planning – or indeed that they were planning anything.”\n\nAdvertisement\n\nASIO said given the questions the ABC asked and that reporter Rubinsztein-Dunlop had “previously broadcast false claims about ASIO and the Akrams”, it held “grave concerns about the accuracy of the proposed story”. Cut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/super-bowl-half-time-show-highlights-20260209-p5o0q2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Super Bowl half-time show highlights",
    "publish_date": "Mon, 09 Feb 2026 12:48:23 +1100",
    "category": "finance",
    "authors": [],
    "text": "Super Bowl half-time show highlights\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/business/companies/second-gold-system-looms-for-gateway-in-wa-20260209-p5o0px.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Second gold system looms for Gateway in WA",
    "publish_date": "Mon, 09 Feb 2026 12:46:34 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Second gold system looms for Gateway in WA Brought to you by BULLS N’ BEARS Rowena Duckworth February 9, 2026 — 12:46pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nGateway Mining has added another attractive piece to its growing Yandal gold puzzle, unveiling shallow gold mineralisation at a newly defined prospect known as Hummer, just west of the company’s Haflinger discovery in Western Australia. The early results have come from wide-spaced aircore drilling targeting a structural splay off the regionally significant Celia Shear Zone - the same fertile architecture that underpins much of the company’s gold endowment across its Horse Well gold camp. Drilling rig at Gateway Mining’s Yandal gold project in Western Australia. Gateway’s first pass has already delivered oxide gold intercepts, highlighted by 16 metres at 1.0 grams per tonne (g/t) gold from 64m, featuring a higher-grade 4-metre thick domain running at 2.7g/t gold. Notably, those shallow oxide hits came from just two drill lines spaced 400 metres apart. The extent of the mineralisation bears strong similarities to the northernmost aircore intercepts at Gateway’s nearby Haflinger discovery, suggesting the company may be sitting on the fringes of a much larger mineralised system.\n\nAdvertisement\n\n‘Our systematic approach to exploration through the Celia-Mustang area is continuing to yield very significant results.’ Gateway Mining executive chairman Andrew Bray Historical drilling in the area barely scratched the surface, with most holes stopping in the depletion zone and never reaching the key shear-hosted targets now being unlocked by Gateway’s more systematic approach. Within the Yandal camp, stacked mineralised gold veins tend to develop along sheared contacts between intermediate volcanics, mafic volcanic units and intrusive margins. This is a classic signature for Yilgarn-style shear-hosted gold systems, with the same geological architecture seemingly present at Hummer. Data modelling shows that Hummer sits on a flexed segment of a splay structure branching from the main Celia Shear Zone. The flexure is critical as it creates dilation zones that act as pressure-release valves for gold-bearing fluids. Significantly, around 4km of strike length remains untested. Magnetic imagery shows stronger structural bending further south, where a northeast-trending fault offsets the splay structure. Gateway believes this area could host enhanced dilation and potentially higher-grade gold as drilling steps out along strike.\n\nAdvertisement\n\nThe company has already added 52 additional aircore holes to its ongoing two-rig drilling campaign to infill and extend the Hummer footprint north and south. Notably, no drilling to date has intersected the target shear zone in fresh rock, leaving plenty of blue-sky upside once deeper and more focused drilling begins. Gateway Mining executive chairman Andrew Bray said: “Our systematic approach to exploration through the Celia-Mustang area is continuing to yield very significant results, and we look forward to discovering further major zones of gold mineralisation as drilling continues southwards through the broader project area.” Gateway’s Yandal project lies 85 kilometres northeast of Wiluna and spans a vast 1,780 square kilometre patch on the eastern flank of the world-class Yandal Greenstone Belt. This belt is one of Australia’s most prolific gold-producing regions and home to Northern Star Resources’ nearby Jundee mine. Jundee has been a cornerstone operation in the region since mining began 30 years ago, producing gold from both underground and open-pit operations. Its success has long underlined the prospectivity of the Yandal Greenstone Belt, particularly for Archaean, high-grade, narrow-vein lode-style deposits. Gateway’s broader Yandal project already hosts an inventory of 8.17 million tonnes at 1.52 grams per tonne gold for 400,400 ounces. The resource is centred on the Horse Well Gold Camp and the Dusk ’til Dawn deposit and provides a solid foundation for ongoing exploration success.\n\nAdvertisement\n\nThe company’s growth push at Yandal is backed by a strong balance sheet, with $19.4 million in cash and a further $9.3 million in liquid ASX-listed securities as at the end of the December quarter. Gateway says that firepower gives it ample runway to aggressively test multiple targets across the broader Celia–Mustang trend this year. With gold prices hovering near record highs and majors increasingly hungry for quality ounces in safe jurisdictions, Gateway’s emerging discoveries near Haflinger are shaping up as more than just geological curiosities. If Hummer continues to deliver as drilling tightens up, the company may well be on its way to defining the next meaningful gold system in the Yandal belt. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nShares\n\nSharemarket",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/how-much-does-it-cost-to-travel-australia-full-time-in-a-caravan-20260203-p5nz66.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How much does it cost to travel Australia full-time in a caravan?",
    "publish_date": "Mon, 09 Feb 2026 12:42:36 +1100",
    "category": "finance",
    "authors": [],
    "text": "How much does it cost to travel Australia full-time in a caravan?\n\nAustralian couple Jess and Allan reveal how much it really costs to travel around the country in a caravan after several years on the road.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/property/news/red-hill-stunner-built-with-bits-of-treasury-building-and-brett-s-wharf-smashes-reserve-20260209-p5o0lt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Red Hill stunner built with bits of Treasury Building and Brett’s Wharf smashes reserve",
    "publish_date": "Mon, 09 Feb 2026 12:41:56 +1100",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A Brisbane man who spent four years hoping to get his hands on a rare Red Hill home was finally handed the keys on Saturday – after splashing a reserve-smashing $2.32 million to get them.\n\nHaving fallen in love with the striking four-bedroom house at 111 Arthur Terrace during the pandemic, he outmuscled three other bidders in just eight minutes to seal the deal.\n\nOn a 506 square-metre-block, two-bathroom home is steeped in Brisbane history, featuring bricks from the Cannon Hill stockyards, cupboards from a convent and benchtops crafted out of floor joists from the Treasury Building – alongside supporting pillars from Brett’s Wharf.\n\nHeld by a local investor, the home was rented out for $1000 a week and last sold in 2018 for $1.03 million.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/lifestyle/chris-hemsworth-fights-a-bear-in-super-bowl-ad-20260209-p5o0ps.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chris Hemsworth fights a bear in Super Bowl ad",
    "publish_date": "Mon, 09 Feb 2026 12:34:56 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/lifestyle/the-backstreet-boys-reunite-for-t-mobile-super-bowl-ad-20260209-p5o0pc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Backstreet Boys reunite for T-Mobile Super Bowl ad",
    "publish_date": "Mon, 09 Feb 2026 12:33:47 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/lifestyle/liquid-death-s-super-bowl-ad-literally-blowing-minds-20260209-p5o0pd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Liquid Death’s Super Bowl ad literally blowing minds",
    "publish_date": "Mon, 09 Feb 2026 12:33:45 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/lifestyle/sofia-vergara-stars-in-super-bowl-ad-for-skechers-20260209-p5o0pb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sofía Vergara stars in Super Bowl ad for Skechers",
    "publish_date": "Mon, 09 Feb 2026 12:33:41 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-food-causes-a-stir-at-university-canteen-in-germany/pusyh6g0i",
    "title": "Australian food causes a stir at university canteen in Germany",
    "publish_date": "Mon, 9 Feb 2026 02:09:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "An exotic dish has caused a stir in a university canteen in Germany: kangaroo chilli.\n\nThe meal was recently served with Basmati rice in the canteen of a university in the Bavarian city of Erlangen, the newspaper Münchner Merkur reported on Sunday.\n\nThe communications department at the Friedrich Alexander University said although a few guests on site asked for confirmation to ensure it was indeed kangaroo meat, the dish was overall very well received.\n\n\"The planned approximately 400 portions were sold, and we received a lot of positive feedback,\" the university was further quoted in the newspaper as saying.\n\nKangaroos are abundant in Australia. Source: Getty / Robert Cianflone\n\nA user on the social platform Reddit posted an excerpt of the menu under the headline: When the canteen is in an experimental phase again.\n\nUsers exchanged views about the taste.\n\n\"Can highly recommend kangaroo, tastes very good,\" one person wrote.\n\nDirectly below came an opposite opinion: \"Kangaroo meat tastes disgusting.\"\n\nKangaroos in abundance\n\nThere was an estimated population of 58 million kangaroos in Australia in 2002. They are among the most abundant large wild land mammal on earth.\n\nThere are 48 species of macropods in Australia and of these, only five can be commercially harvested. In addition, two species of wallaby are harvested in Tasmania.\n\nThe kangaroo industry is worth around $200 million per year and directly employs 4,000 people.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 24
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/australian-researchers-on-a-mission-to-save-millions-of-lives-from-antibiotic-resistance/ur9klrb22",
    "title": "Australian researchers on a mission to save millions of lives from antibiotic resistance",
    "publish_date": "Mon, 9 Feb 2026 00:21:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/article/who-is-michael-dickson-the-australian-vying-for-super-bowl-glory/f6xzz3df5",
    "title": "Who is Michael Dickson, the Australian vying for Super Bowl glory?",
    "publish_date": "Mon, 9 Feb 2026 00:03:39 +0000",
    "category": "sports",
    "authors": [],
    "text": "Michael Dickson has gone from being an aspiring Australian rules footballer to becoming the highest-paid punter in the NFL, and now vying for victory in today's Super Bowl.\n\nSydney-born Dickson was overlooked in the 2014 AFL draft when he was 18. From that point on, he was set on a different kind of football journey.\n\nNow he is lining up for the Seattle Seahawks against the New England Patriots in Super Bowl 60 in California today.\n\nIf his team wins, he'll become just the second Australian to play in a Super Bowl and win and the third Australian to win a Super Bowl overall.\n\nSydney's Jordan Mailata won last year playing for the Philadelphia Eagles, while in 2014, Jesse Williams became the first Australian to win a Super Bowl when his Seattle Seahawks team won the title. Williams did not play in the game because of injury but was still awarded the winner's ring.\n\nREAD MORE From SoundCloud to the Super Bowl — Bad Bunny set to make halftime history\n\nIn 2015, Dickson moved from Sydney to Melbourne to trial a program called Prokick, where Australians receive coaching to launch into American football. He was soon scouted as a punter by the University of Texas.\n\nThe punter position in football receives the snapped ball directly from the line of scrimmage, and then kicks the football to the opposing team.\n\nOutstanding performances for the University of Texas Longhorns team led to him being drafted by the Seattle Seahawks in 2018.\n\nWhen did Dickson make his NFL debut?\n\nDickson made his debut during the season opener against the Denver Broncos. By week 8, he made an unconventional game-winning move against the Detroit Lions, when he ran the ball, an unusual move for a punter. Dickson's bold move was labelled \"the Aussie sweep.\"\n\nAlthough Dickson had defied his instructions, then-coach Pete Caroll said: \"That's going to be my favourite play for a while.\"\n\nIn 2021, Dickson punted the ball 83 times for 3,895 yards during the 2021 season, an average of 46.9 yards per punt — a career high. That same year, he made 40 punts inside the opponents' 20-yard line, the most in the league that season, and the 10th most in a single season in NFL history.\n\nLast year, Dickson signed a four-year contract extension with the Seahawks for US$16.2 million ($23.1 million) — making him the highest-paid punter in the NFL's history.\n\nOne of the Seattle Seahawks' biggest stars, Michael Dickson, was overlooked by the AFL. Source: AP / Brynn Anderson\n\nThe 2026 Super Bowl marks a career high for Dickson, where he's playing for the first time.\n\nThe Super Bowl is America's most-viewed television broadcast. A record 127.7 million Americans tuned in to watch the 2025 game, eclipsing the estimated 123 million viewership a year earlier.\n\nWhen is the Super Bowl and how can I watch in Australia?\n\nThe Seattle Seahawks will be playing against the New England Patriots. The two teams competed at the 2015 Super Bowl, where the Patriots won.\n\nThe Patriots have won six Super Bowl titles, in 2002, 2004, 2005, 2015, 2017, and 2019. The Seahawks won in 2014 against the Denver Broncos.\n\nThe Super Bowl will screen in the US on Sunday at 3.30pm local time, which is Monday morning in Australia.\n\nThe game will be at 10.30am on Monday in NSW, the ACT, Victoria, and Tasmania, 10am in South Australia, 9.30am in Queensland and 7.30am in Western Australia.\n\nThe 2026 Super Bowl will be available to watch free-to-air on Channel 7, and online at 7plus.\n\nIt will be broadcast on Disney+, Foxtel's ESPN channel, and KAYO.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/japanese-pm-sanae-takaichi-set-to-win-supermajority-in-snap-election/jmyhsm2ra",
    "title": "Japan's Sanae Takaichi rides youth-led frenzy towards supermajority after election win",
    "publish_date": "Sun, 8 Feb 2026 20:37:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Japan's Prime Minister Sanae Takaichi is savouring a likely election triumph, with her ruling coalition projected to have won a two-thirds majority in the powerful lower house.\n\nIf confirmed by official results, the outcome gives Japan's first female premier a strong mandate to implement her conservative agenda and stamp her mark on the country of 123 million people over the next four years.\n\nThe Asia-Pacific region will be watching closely however to see if Takaichi, 64, ups the ante or lowers the temperature with China after enraging Beijing in November with comments about Taiwan.\n\nFinancial markets may also be nervous about Japan's public finances and its gargantuan debt pile if Takaichi decides to cut taxes and boost spending in Asia's number-two economy.\n\nREAD MORE Japanese PM Sanae Takaichi dissolves parliament after three months in office\n\n\"We have consistently stressed the importance of responsible and proactive fiscal policy,\" Takaichi insisted late Sunday.\n\n\"We will prioritise the sustainability of fiscal policy. We will ensure necessary investments. Public and private sectors must invest. We will build a strong and resilient economy,\" she said.\n\nHit with young voters\n\nCapitalising on her honeymoon start after becoming Japan's fifth premier in as many years in October, Takaichi called the snap election last month.\n\nThe gamble paid off handsomely, with local media projecting late Sunday that her Liberal Democratic Party (LDP) won around 300 seats of the 465 contested.\n\nTogether with its junior coalition partner, the ruling bloc was expected to have garnered at least the 310 seats needed for a two-thirds majority.\n\nTakaichi has injected new life into the LDP, which has governed Japan almost non-stop for decades but which has shed support in recent elections because of unhappiness about rising prices and corruption.\n\nA heavy metal drummer in her youth, Takaichi was an admirer of Britain's \"Iron Lady\" Margaret Thatcher, and on the ultra-conservative fringe of the LDP when she became party chief.\n\nShe has been a hit with voters, especially young ones, with fans lapping up everything from her handbag to her jamming to a K-pop song with South Korea's president.\n\nBut she will have to deliver on the economy to remain popular.\n\n\"With prices rising like this, what matters most to me is what policies they'll adopt to deal with inflation,\" voter Chika Sakamoto, 50, told AFP at a voting station in snowy Tokyo on Sunday.\n\nRelationship with China\n\nBefore becoming prime minister, Takaichi was seen as a China hawk.\n\nShe was a regular visitor to the Yasukuni Shrine, which honours convicted war criminals along with 2.5 million war dead and is seen as a symbol of Japan's militarist past.\n\nBarely two weeks in office, Takaichi suggested that Japan could intervene militarily if Beijing sought to take self-ruled Taiwan by force.\n\nChina regards the democratic island as part of its territory and has not ruled out force to annex it.\n\nWith Takaichi having days earlier pulled out all the stops to welcome US President Donald Trump, Beijing was furious with her unscripted remarks. It summoned Tokyo's ambassador, warned its citizens against visiting Japan and conducted joint air drills with Russia.\n\nMargarita Estevez-Abe, associate professor of political science at Syracuse University, said that Takaichi can afford to dial down tensions now.\n\n\"Now she doesn't have to worry about any elections until 2028, when the next upper house elections will take place,\" Estevez-Abe told AFP before the vote.\n\n\"So the best scenario for Japan is that Takaichi kind of takes a deep breath and focuses on amending the relationship with China.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/cyclone-mitchell-fears-as-storm-closes-in/mz5ou8z8d",
    "title": "Residents told 'too late to leave' as Tropical Cyclone Mitchell nears West Australian coast",
    "publish_date": "Sun, 8 Feb 2026 04:24:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "Coastal communities are enduring another day of wild weather after a category three storm swept past the West Australian coast overnight.\n\nTropical Cyclone Mitchell continues to stalk the Pilbara coast, with landfall between Onslow and Exmouth forecast for late Sunday or early Monday.\n\nResidents from Whim Creek to Onslow have been told it is too late to leave and they must seek shelter indoors immediately.\n\nResidents in Karratha remain sheltered in place after Mitchell brought wind gusts of up to 95km/h overnight.\n\n\"No one can get out and about yet, so I don't know what the town looks like outside,\" Karratha Econo Lodge venue manager Nadine Askevold told the Australian Associated Press.\n\nShe said it was the first time many of her guests had experienced a cyclone.\n\n\"They were a bit nervous,\" she said, adding staff supplied them with information and cyclone packs including torches and water.\n\nConditions were expected to escalate until the system makes landfall, with the worst impacts expected where the system crosses the coast, senior meteorologist Miriam Bradbury said.\n\n\"Wind gusts are going to be 170km/h or possibly even higher around the eye of the cyclone. We call them damaging winds for a reason,\" she said, adding trees and power lines would likely tumble.\n\nHeavy rainfall, flash flooding, dangerous river rises are expected across parts of the Pilbara and the Gascoyne.\n\nThe cyclone may make landfall at Exmouth, where locals have been clearing their properties and gathering supplies for days.\n\nREAD MORE What to do in a cyclone\n\n\"I haven't seen the town looking so clean and tidy for as long as I can remember,\" Exmouth Shire president Matthew Niikkula said.\n\nHe said the town has not experienced a cyclone of this strength in a decade, adding conditions could be \"extremely frightening\".\n\n\"It's just that darkness and the screaming 200km/h winds that sound like banshees running around outside,\" he said.\n\nInfrastructure damage is of particular concern, with authorities working to keep water and power running and roads clear.\n\n\"Being on a peninsula, there's one road in and one road out and it's very susceptible to flooding,\" Niikkula said.\n\nThe cyclone is expected to weaken shortly after making landfall, losing steam as it drifts in a more southerly direction inland.\n\nWhile peak winds are expected to ease within hours, flooding risks could persist for days, Bradbury said.\n\nMajor ports along the Pilbara coastline were forced to close on Saturday as the weather system passed north of Port Hedland.\n\nAn evacuation centre has been set up at Karratha Leisureplex, and a second evacuation centre is being opened further south at the Onslow Multi Purpose Centre.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/anger-builds-ahead-of-the-israeli-presidents-arrival-midday-news-bulletin-8-february-2026/wgaq3i5j0",
    "title": "Anger builds ahead of the Israeli president's arrival | Midday News Bulletin 8 February 2026",
    "publish_date": "Sun, 8 Feb 2026 00:52:50 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\nIn this bulletin;\n\nAnger builds ahead of the Israeli president's arrival\n\nReports the coalition is poised to reunite\n\nAustralia's first medal hope dashed at the Winter Olympics.\n\n---\n\nAn organiser of a Melbourne march against Israeli President Isaac Herzog's visit to Australia says the federal government's invitation to him made no sense.\n\nMr Herzog was formally invited to Australia by Prime Minister Anthony Albanese, following an earlier invitation from the Zionist Federation of Australia.\n\nProtests are planned across Australia from Monday, with writer and activist Noura Mansour saying the visit is problematic.\n\n\"I think his visit, extending an invitation to someone with statements that are problematic, someone who has signed missiles that have been dropped on Palestinian children, Palestinian hospitals, schools, someone who has blamed an entire population in Gaza for the actions of some, clearly generalisation fallacy.\"\n\nWhile some groups welcome his trip as a moment of deep significance following the December 14 Bondi attack others want the invitation rescinded.\n\nMr Albanese says people have a right to express their views in a democracy — but he hopes they will be respectful in this difficult time.\n\n—\n\nReports are emerging that the Coalition is poised to reunite, with speculation Sussan Ley is set to accept a deal from David Littleproud to rejoin the Nationals.\n\nAn announcement confirming the reunion is expected on Sunday, which would see the coalition restored and all former Nationals frontbenchers reinstated to shadow cabinet.\n\nThe pair are also expected to sign an agreement codifying the convention of shadow cabinet solidarity, in which frontbenchers must step down if they vote against an agreed position of the joint party room.\n\nSpeaking to Nine's Today Show, Mr Littleproud says the Coalition is stronger together.\n\n\"Because of the timelines Anthony Albanese put on us to vote on a free speech bill, we couldn't get comfort in it, and we couldn't bring ourselves to vote for it. We had less than five hours to determine whether we wanted to vote for this bill or not, and I don't think that's good legislating. So we've been consistent all the way, we're back to with integrity and respect, and we'll continue to have those discussions with the Liberal Party, but I hope that in the near future, that there is a coalition because that's the only way to bring Anthony Albanese down.\"\n\nUnited States President Donald Trump's so-called \"Board of Peace\" will meet for the first time in two weeks.\n\nThe first meeting is scheduled for 19 February and will reportedly also serve as a fundraising conference for the reconstruction of Gaza.\n\nMany rights experts say that Mr Trump overseeing a board to supervise a foreign territory's affairs resembled a colonial structure, and they criticised the board for not including a Palestinian.\n\nSecretary-general of the League of Arab States, Ahmed Aboul-Gheit, says he's hopeful that Palestinians can govern themselves.\n\n\"I hope for a continuous rebuilding of the cities that have been demolished and destroyed beyond recognition, and I hope that the Palestinian Authority would be allowed to emerge back in Gaza, aiming at the establishment of a Palestinian state ruled by the Palestinians themselves.\"\n\nPolling has opened in Japan, where Prime Minister Sanae Takaichi is hopeful the election will allow her to push new conservative policies.\n\nPolls predict the election will hand Ms Takaichi's ruling coalition a resounding win, though record snowfall in parts of the country could keep many voters at home.\n\nOpinion polls suggest the conservative coalition, led by Japan's first female prime minister, could win more than 300 of the 465 seats in the lower house of Parliament.\n\nAhead of the vote, some residents say they fear the direction Japan is heading.\n\n“I feel Japan may have drifted too far to the right. I also want Japan to be protected, but things seem to be moving towards an extreme direction, that scares me.\"\n\nSnowboarder Valentino Guseli has fallen short in his unexpected bid for Australia’s first medal at the Winter Olympics in Italy.\n\nThe 20-year-old reached the final of the men’s big air event — a single jump off a huge ramp — but couldn’t land two of his jumps, finishing 10th.\n\nJapan’s Kira Kimura claimed gold ahead of compatriot Ryoma Kimata, with China’s defending champion Su Yiming taking bronze.\n\nIn other results, Alex Ferlazzo sits 20th after the first round of the men’s luge, while Rosie Fordham was Australia’s best in the women’s skiathlon, finishing 49th.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/off-again-on-again-coalition-reunites-after-almost-month-long-split/qhy1jiqg0",
    "title": "'We trust each other': Coalition reunited after Ley, Littleproud strike fresh deal",
    "publish_date": "Sun, 8 Feb 2026 00:29:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Liberal leader Sussan Ley and Nationals leader David Littleproud insist they \"trust\" each other after the parties agreed on a deal to reunite and reform the Coalition after a three-week split.\n\nIn a joint press conference on Sunday, the pair confirmed earlier reporting of the deal, which will allow all former Nationals frontbenchers reinstated to shadow cabinet after they were sacked or stood down for breaking solidarity conventions over hate speech laws.\n\nLey said the Coalition was \"looking to the future, not the past\".\n\n\"We are back in coalition. We are stronger. Differences have been resolved,\" she said.\n\n\"We're squarely focused on representing the Australian people and fighting for their needs, their aspirations and their hopes. They deserve no less. They expect no less. And they will receive no less.\"\n\nWhen asked during the press conference about reports Littleproud had asked for Ley's resignation, and whether they trusted each other, the duo said they did.\n\nLey said: \"Yes, 100 per cent, I trust David and I value and respect the National Party as one of the two great parties.\"\n\n\"I wouldn't be standing here today if I didn't trust Susan, if I didn't trust the Liberal Party,\" Littleproud said.\n\n\"So I'm very comfortable and we've said to one another, this is where we can look each other in the eye and say, this is the team that will go to the next election.\"\n\nLittleproud and deputy Nationals leader Kevin Hogan will immediately rejoin leadership meetings and shadow cabinet processes.\n\nThe leaders also signed an agreement codifying the convention of shadow cabinet solidarity, in which frontbenchers must step down from their roles if they vote against an agreed position of the Liberal-National joint party room.\n\nThe written agreement clearly sets out that the joint party room has primacy over the individual National and Liberal party rooms, addressing the contradiction that instigated the split.\n\nLISTEN TO What is behind the surge in support for Pauline Hanson and One Nation? SBS News 05:38 English\n\nThree Nationals frontbenchers — Ross Cadell, Bridget McKenzie and Susan McDonald — voted against Labor's hate speech laws, in line with a party decision but in defiance of an agreed shadow cabinet position.\n\nThe trio later tendered their resignations to Ley, which she accepted.\n\nBut the move triggered a furious response from Littleproud and the Nationals, who resigned from shadow cabinet en masse and caused the Coalition's collapse.\n\nSpeaking at the press conference on Sunday, Littleproud said the fall-out was \"disappointing\".\n\n\"The Coalition isn't one party, but we're two parties and we've been able to work together. But when it matters, we've got to be able to say to the Australian people what we stand for.\n\n\"And that's the maturity and leadership that I thank Susan for, that we've been able to say we've got to find a better way forward.\"\n\nThe reunification comes during a seismic shift in Australia's right-wing political landscape, with minor-party One Nation surging past the former Coalition partners in some polls.\n\n— With additional reporting from the Australian Associated Press.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-measles-cases-are-on-the-rise/sxtbm9vr7",
    "title": "'Spreads like wildfire': Why measles cases are on the rise and what we should do about it",
    "publish_date": "Sun, 8 Feb 2026 00:20:59 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Health experts are concerned about the rise of measles in Australia, with 22 cases already reported this year, mirroring a global increase in the spread of the viral disease.\n\nAcross Australia, Queensland accounts for eight of those cases, while seven are in NSW, five in Victoria and one each in Western Australia and South Australia, according to Australian Centre for Disease Control (CDC) data as of 6 February.\n\nHealth authorities in Victoria noted in early February that a recent increase in measles cases was linked to overseas travel and warned that outbreaks of the highly contagious disease had been reported in popular Australian travel destinations, including Indonesia, Thailand and India.\n\nIndonesia, which became Australia's favourite international travel destination in 2023, had the highest number of cases between June and November 2025, according to the World Health Organization (WHO).\n\nTwo experts SBS News spoke to said increased international travel following the end of COVID-19 restrictions was partly behind rising measles infection rates in Australia.\n\nThey also cited vaccine scepticism, and an underestimation of how serious and contagious measles can be, as factors.\n\nMeasles can spread through air conditioning\n\nInfectious disease physician and clinical microbiologist Paul Griffin said some Australians underestimate the danger measles can pose to health.\n\n\"About one in 1,000 to one in 10,000 cases will lead to severe complications. And that could be a nasty pneumonia, for example, or could be brain inflammation and swelling that can lead to death or permanent disability,\" he said.\n\nHe also highlighted the extreme contagiousness of the disease.\n\n\"It's so infectious that you can be in an exposure site after someone with measles was there, even up to a few hours afterwards, and still get infected.\n\n\"It's one of these infections that can travel through air conditioning circuits, and we can see people be infected in other rooms if they're on the same circuit ... So it's spread very easily via the airborne route.\"\n\nChair of child and young person's health at the Royal Australian College of General Practitioners (RACGP) Dr Tim Jones agreed, telling SBS News: \"It spreads like wildfire. It's orders of magnitude more contagious than COVID was.\"\n\nUp to nine out of 10 people who don't have immunity will become infected after exposure to an infected person, according to the CDC.\n\nVaccine hesitancy and misinformation\n\nThe CDC also advises that two measles vaccinations are 99 per cent effective at preventing measles infection.\n\nHowever, Australian vaccination rates, particularly among children, have decreased in recent years.\n\nAccording to recent Department of Health data, around 93 per cent of five-year-olds have had all vaccines recommended for their age, while around 89.5 per cent of two-year-olds are fully vaccinated.\n\nThe department warned that, over the last three years, the nation's vaccination rate has dropped below its aspirational target of 95 per cent, which it says is needed to reach the \"herd immunity\" required to stop the spread of vaccine-preventable diseases such as measles.\n\nThe Australian Medical Association issued a call in December last year for \"immediate action to combat vaccine hesitancy and reverse declining immunisation rates across the country\". Source: Getty / Halfpoint Images\n\nBoth experts interviewed by SBS News pointed to vaccine hesitation as driving the increased spread of measles, with Griffin saying it was \"getting harder to convince people to make the right decision and get the vaccine\".\n\nJones said the years of COVID-19 restrictions and mandates had induced a hesitation about vaccination in some Australians.\n\n\"Families are just burnt out after COVID. They were tired of the constantly changing advice that was given on vaccination. So they're sceptical about whether the [measles] vaccination truly is as important as we say it is.\"\n\nJones said that, in his experience as a doctor, sitting down with families and discussing the risks associated with the disease changed most people's minds.\n\n\"What I find I need to do as a clinician for those families is to put what was happening in COVID in context — that things were changing very, very quickly — versus something like measles, where it's a disease that's been around for a very long time.\n\n\"We know it very well, and the vaccinations that we've been using have also been around for a long time, and we know what they are.\"\n\nMajor outbreak to elimination to a tripling of cases\n\nIn 1994, Australia faced a major measles outbreak with 4,794 confirmed cases. It was that year that the two-dose vaccination schedule was introduced for children aged between 10 and 16 years old.\n\nAt first, vaccination rates were low, but by 2000 they were sufficient to reduce the circulation of the virus, according to the Communicable Diseases Network Australia.\n\nThe two-dose vaccine offers 99 per cent protection against illness and serious complications, according to the CDC\n\nMeasles often comes with flu-like symptoms — such as a fever and runny nose — but it's important to also look out for a rash, cough and conjunctivitis, which are tell-tale signs of measles.\n\nThe National Immunisation Program now includes two doses of the measles vaccine for children aged 12 and 18 months. Source: AAP\n\nSince 1994, most Australians have received their vaccination as part of the National Immunisation Program (NIP).\n\nIn 2014, measles was declared eliminated in Australia by WHO due to the endemic measle strain not circulating for several years — thanks to the effectiveness of the vaccine.\n\nHowever, cases continue to occur in Australia, mostly in those who have travelled overseas.\n\n\"What we need to recognise is that what's kept those numbers down is consistently keeping the measles vaccination rate in Australia over 95 per cent of our population. And that's a number that's been steadily slipping over the last few years,\" Jones said.\n\n\"We've seen a tripling of measles cases in Australia over the last year ... I do think there needs to be some, at least a mild degree of, concern about what's going on.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/nfl/super-bowl-2026-live-updates-new-england-patriots-v-seattle-seahawks-in-santa-clara-california-20260208-p5o0ii.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Super Bowl 2026 LIVE updates: Patriots stay in fight with vital score after Seahawks break touchdown drought",
    "publish_date": "Mon, 09 Feb 2026 13:52:28 +1100",
    "category": "sports",
    "authors": [
      "Iain Payten",
      "Frances Howe"
    ],
    "text": "A block party in fields of sugar cane as reggaeton and salsa take over.\n\nIt’s the land of the white plastic chairs. The land of asado (Latin barbeque), of the bodega store, of plastic tables where you play dominoes, of stalls selling Piraguas (ice topped with coloured syrups), of perreo (twerking), long-acrylic nails being cured under UV lamps and delicious dancing.\n\nIt is not the land of illegal people.\n\nThe detail! Credit: Getty Images\n\nWomen’s edges are laid with gel and their lips are outlined with dark brown lip liner. They wear large gold hoops with gold chains. Their hair is thick, curly and their outfits are made to accommodate the sway of their hips.\n\nEmerging from a pink casita (the little house), Mr Bunny passes an array of notable guests dancing. The line-up includes Colombian superstar Karol G, actor Pedrol Pascal, influencer Alix Earle (this one is a bit random), actress Jessica Alba and rappers Cardi B and Young Miko – with more to be uncovered.\n\nBad Bunny’s performance was an homage to Puerto Rico. Credit: Getty Images\n\nThe Puerto Rican flag hoisted onto Bad Bunny’s shoulders shone in a light blue – a symbol of independence and sovereignty – instead of its normal dark blue.\n\nA post by writer Rohan Nadkarni said that sources close to Bad Bunny’s performance said the wedding during the show was real. “They invited Bad Bunny to their wedding and in turn he invited them to get married during his performance” the post says.\n\nTo finish the show, Benito raises the football he carried periodically throughout the performance to the camera. Behind him is the lush, tropical landscape of his home, Puerto Rico, drums, dancers, flags and fireworks. “Together, we are America,” is inscribed into the football.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/world/barner-touchdown-breaks-pats-hearts-in-super-bowl-60-20260209-p5o0r4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Barner touchdown breaks Pats hearts in Super Bowl 60",
    "publish_date": "Mon, 09 Feb 2026 13:36:24 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/lifestyle/george-clooney-stars-in-victorian-era-themed-ad-for-grubhub-20260209-p5o0r0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "George Clooney stars in Victorian era-themed ad for Grubhub",
    "publish_date": "Mon, 09 Feb 2026 13:25:32 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/lifestyle/charli-xcx-stars-in-super-bowl-ad-20260209-p5o0qx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Charli XCX stars in Super Bowl ad",
    "publish_date": "Mon, 09 Feb 2026 13:21:17 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/lifestyle/pokemon-airs-star-studded-super-bowl-ad-20260209-p5o0qu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pokémon airs star-studded Super Bowl ad",
    "publish_date": "Mon, 09 Feb 2026 13:20:14 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/business/companies/asio-v-abc-broadcaster-stands-by-bondi-investigation-after-spy-agency-rebuke-20260209-p5o0mb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASIO v ABC: Broadcaster stands by Bondi investigation after spy agency rebuke",
    "publish_date": "Mon, 09 Feb 2026 12:57:10 +1100",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "Advertisement\n\nBusinessCompaniesBondi shooting ASIO v ABC: Broadcaster stands by Bondi investigation after spy agency rebuke Calum Jaspan February 9, 2026 — 12:57pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nASIO has issued a rare public statement declaring it holds “grave concerns” about the accuracy of an ABC investigation into the Bondi massacre set to air on Four Corners on Monday night and warning of further action if false claims are broadcast. The statement released on Sunday evening claims the ABC has relied in part on an “unreliable and disgruntled” source who had misidentified one of the alleged gunmen, 24-year-old Naveed Akram, and confused some of his actions before the attack with things done by someone else. ASIO Director-General Mike Burgess last week. Alex Ellinghausen The ABC is standing by the story, which it said used extensive reporting and numerous sources to examine the Akrams’ actions leading up to the attack. ASIO, which has not seen the program, said its ability to respond to Four Corners′ questions was constrained as it did not want to risk prejudicing the royal commission into antisemitism and the ongoing criminal investigation against Akram.\n\nAdvertisement\n\nAkram has been charged with murdering 15 people in the December 14 attack, in which his father and alleged co-conspirator Sajid Akram was shot dead by police. The first of two parts of Four Corners′ investigation was led by reporter Mark Willacy, airing last week. It provided an account of the events of the day of the attack, told by those present. The second part, led by reporter Sean Rubinsztein-Dunlop, will investigate “the secret lives of the terrorists, uncovering astonishing new information about the years leading up to the attack”, according to the ABC. The ABC will on Monday night air the second part of a Four Corners investigation into the Bondi terror attack. Christopher Pearce ASIO’s statement, made in response to unknown ABC questions and released publicly in an unusual pre-emptive move, notes that the domestic intelligence agency investigated Naveed Akram in 2019 using its “most sensitive capabilities.” “We assessed he did not adhere to or intend to engage in violent extremism at that time. Having reviewed all available intelligence, we stand by our assessment at that point in time,” the statement said. “Four Corners’ claims contain significant errors of fact.”\n\nAdvertisement\n\nASIO said “if the ABC chooses to publish claims it cannot substantiate [...] we will reserve our right to take further action.” Related Article Live\n\nIsraeli-Palestinian conflict Herzog visit LIVE updates: Israeli president lays wreath at Bondi Pavilion; protesters launch last-minute challenge to ‘extraordinary’ police powers The Bondi royal commission is required to complete its first report by April. It will examine, among other things, whether Australia’s intelligence and law enforcement services were as effective as they could have been in stopping the attack, how they co-operated and whether they were hampered by legal rules. ASIO said an ABC source had a track record of making statements that are untrue. The agency rejected previously reported claims that Naveed Akram is a close associate of terrorists. “The claims Four Corners is making were investigated at the time and found to be unsubstantiated,” ASIO said.\n\nAdvertisement\n\n“The ABC’s source mis-identified Naveed Akram. That is, the source claimed Naveed Akram said and did things that were actually said and done by an entirely different person. To be clear, Four Corners′ source mis-identified Naveed Akram, and therefore the associated claims are untrue.” Related Article Bondi shooting A father, a son and the radical world of terror An ABC spokesperson defended the program as a comprehensive investigation examining the events leading up to the worst terrorist attack on Australian soil. “Four Corners spoke to numerous people and provides a number of sources of information for a detailed picture of the Akrams’ actions and associations in the years leading up to the Bondi attack,” the spokesperson said. “Detailed questions were put to ASIO and its response is reflected in the story. The public will be able to watch the full investigation tonight.”\n\nAdvertisement\n\nRubinsztein-Dunlop declined to comment. Related Article ABC More Insight than Q+A: David Speers to host ABC’s new town hall show ASIO also rejected expected ABC accusations of understaffing and suggestions that redundancies at the intelligence agency in 2020 might have contributed in some way to its ability to prevent the massacre. “The claim any resourcing decision increased the likelihood of the Bondi attack is false, irresponsible and demonstrates profound ignorance of ASIO’s prioritisation frameworks and enduring investment in counterterrorism,” ASIO said. “Tragically, ASIO did not know what the perpetrators of the Bondi attack were planning – or indeed that they were planning anything.”\n\nAdvertisement\n\nASIO said given the questions the ABC asked and that reporter Rubinsztein-Dunlop had “previously broadcast false claims about ASIO and the Akrams”, it held “grave concerns about the accuracy of the proposed story”. Cut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/super-bowl-half-time-show-highlights-20260209-p5o0q2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Super Bowl half-time show highlights",
    "publish_date": "Mon, 09 Feb 2026 12:48:23 +1100",
    "category": "finance",
    "authors": [],
    "text": "Super Bowl half-time show highlights\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/business/companies/second-gold-system-looms-for-gateway-in-wa-20260209-p5o0px.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Second gold system looms for Gateway in WA",
    "publish_date": "Mon, 09 Feb 2026 12:46:34 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Second gold system looms for Gateway in WA Brought to you by BULLS N’ BEARS Rowena Duckworth February 9, 2026 — 12:46pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nGateway Mining has added another attractive piece to its growing Yandal gold puzzle, unveiling shallow gold mineralisation at a newly defined prospect known as Hummer, just west of the company’s Haflinger discovery in Western Australia. The early results have come from wide-spaced aircore drilling targeting a structural splay off the regionally significant Celia Shear Zone - the same fertile architecture that underpins much of the company’s gold endowment across its Horse Well gold camp. Drilling rig at Gateway Mining’s Yandal gold project in Western Australia. Gateway’s first pass has already delivered oxide gold intercepts, highlighted by 16 metres at 1.0 grams per tonne (g/t) gold from 64m, featuring a higher-grade 4-metre thick domain running at 2.7g/t gold. Notably, those shallow oxide hits came from just two drill lines spaced 400 metres apart. The extent of the mineralisation bears strong similarities to the northernmost aircore intercepts at Gateway’s nearby Haflinger discovery, suggesting the company may be sitting on the fringes of a much larger mineralised system.\n\nAdvertisement\n\n‘Our systematic approach to exploration through the Celia-Mustang area is continuing to yield very significant results.’ Gateway Mining executive chairman Andrew Bray Historical drilling in the area barely scratched the surface, with most holes stopping in the depletion zone and never reaching the key shear-hosted targets now being unlocked by Gateway’s more systematic approach. Within the Yandal camp, stacked mineralised gold veins tend to develop along sheared contacts between intermediate volcanics, mafic volcanic units and intrusive margins. This is a classic signature for Yilgarn-style shear-hosted gold systems, with the same geological architecture seemingly present at Hummer. Data modelling shows that Hummer sits on a flexed segment of a splay structure branching from the main Celia Shear Zone. The flexure is critical as it creates dilation zones that act as pressure-release valves for gold-bearing fluids. Significantly, around 4km of strike length remains untested. Magnetic imagery shows stronger structural bending further south, where a northeast-trending fault offsets the splay structure. Gateway believes this area could host enhanced dilation and potentially higher-grade gold as drilling steps out along strike.\n\nAdvertisement\n\nThe company has already added 52 additional aircore holes to its ongoing two-rig drilling campaign to infill and extend the Hummer footprint north and south. Notably, no drilling to date has intersected the target shear zone in fresh rock, leaving plenty of blue-sky upside once deeper and more focused drilling begins. Gateway Mining executive chairman Andrew Bray said: “Our systematic approach to exploration through the Celia-Mustang area is continuing to yield very significant results, and we look forward to discovering further major zones of gold mineralisation as drilling continues southwards through the broader project area.” Gateway’s Yandal project lies 85 kilometres northeast of Wiluna and spans a vast 1,780 square kilometre patch on the eastern flank of the world-class Yandal Greenstone Belt. This belt is one of Australia’s most prolific gold-producing regions and home to Northern Star Resources’ nearby Jundee mine. Jundee has been a cornerstone operation in the region since mining began 30 years ago, producing gold from both underground and open-pit operations. Its success has long underlined the prospectivity of the Yandal Greenstone Belt, particularly for Archaean, high-grade, narrow-vein lode-style deposits. Gateway’s broader Yandal project already hosts an inventory of 8.17 million tonnes at 1.52 grams per tonne gold for 400,400 ounces. The resource is centred on the Horse Well Gold Camp and the Dusk ’til Dawn deposit and provides a solid foundation for ongoing exploration success.\n\nAdvertisement\n\nThe company’s growth push at Yandal is backed by a strong balance sheet, with $19.4 million in cash and a further $9.3 million in liquid ASX-listed securities as at the end of the December quarter. Gateway says that firepower gives it ample runway to aggressively test multiple targets across the broader Celia–Mustang trend this year. With gold prices hovering near record highs and majors increasingly hungry for quality ounces in safe jurisdictions, Gateway’s emerging discoveries near Haflinger are shaping up as more than just geological curiosities. If Hummer continues to deliver as drilling tightens up, the company may well be on its way to defining the next meaningful gold system in the Yandal belt. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nShares\n\nSharemarket",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/how-much-does-it-cost-to-travel-australia-full-time-in-a-caravan-20260203-p5nz66.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How much does it cost to travel Australia full-time in a caravan?",
    "publish_date": "Mon, 09 Feb 2026 12:42:36 +1100",
    "category": "finance",
    "authors": [],
    "text": "How much does it cost to travel Australia full-time in a caravan?\n\nAustralian couple Jess and Allan reveal how much it really costs to travel around the country in a caravan after several years on the road.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/property/news/red-hill-stunner-built-with-bits-of-treasury-building-and-brett-s-wharf-smashes-reserve-20260209-p5o0lt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Red Hill stunner built with bits of Treasury Building and Brett’s Wharf smashes reserve",
    "publish_date": "Mon, 09 Feb 2026 12:41:56 +1100",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A Brisbane man who spent four years hoping to get his hands on a rare Red Hill home was finally handed the keys on Saturday – after splashing a reserve-smashing $2.32 million to get them.\n\nHaving fallen in love with the striking four-bedroom house at 111 Arthur Terrace during the pandemic, he outmuscled three other bidders in just eight minutes to seal the deal.\n\nOn a 506 square-metre-block, two-bathroom home is steeped in Brisbane history, featuring bricks from the Cannon Hill stockyards, cupboards from a convent and benchtops crafted out of floor joists from the Treasury Building – alongside supporting pillars from Brett’s Wharf.\n\nHeld by a local investor, the home was rented out for $1000 a week and last sold in 2018 for $1.03 million.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/lifestyle/chris-hemsworth-fights-a-bear-in-super-bowl-ad-20260209-p5o0ps.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chris Hemsworth fights a bear in Super Bowl ad",
    "publish_date": "Mon, 09 Feb 2026 12:34:56 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/lifestyle/the-backstreet-boys-reunite-for-t-mobile-super-bowl-ad-20260209-p5o0pc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Backstreet Boys reunite for T-Mobile Super Bowl ad",
    "publish_date": "Mon, 09 Feb 2026 12:33:47 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/lifestyle/liquid-death-s-super-bowl-ad-literally-blowing-minds-20260209-p5o0pd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Liquid Death’s Super Bowl ad literally blowing minds",
    "publish_date": "Mon, 09 Feb 2026 12:33:45 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/lifestyle/sofia-vergara-stars-in-super-bowl-ad-for-skechers-20260209-p5o0pb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sofía Vergara stars in Super Bowl ad for Skechers",
    "publish_date": "Mon, 09 Feb 2026 12:33:41 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 18
  }
]