[
  {
    "url": "https://www.9news.com.au/national/reddit-high-court-challenge-social-media-ban/cc7b5b8b-3f9d-40ff-9145-1a577fc2815c",
    "title": "Reddit launches High Court challenge against social media ban",
    "publish_date": "Fri, 12 Dec 2025 01:37:56 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "R﻿eddit has launched a High Court challenge against Australia's social media ban for children aged under 16.\n\nThe US-based company confirmed it had filed the challenge this morning, arguing the ban both infringes on political communication and should not apply to the popular, public forum website in the first place.\n\n\"This law has the unfortunate effect of forcing intrusive and potentially insecure verification processes on adults as well as minors, isolating teens from the ability to engage in age-appropriate community experiences (including political discussions), and creating an illogical patchwork of which platforms are included and which aren't,\" it posted.\n\nREAD MORE: Childcare worker admits to producing child abuse material\n\nReddit is challenging Australia's social media ban in court. (Supplied/Reddit)\n\n\"Even the eSafety commissioner said the law's approach is not what she preferred. Many leading organisations and many of our own users have raised similar concerns.\n\n\"As the Australian Human Rights Commission put it, 'There are less restrictive alternatives available that could achieve the aim of protecting children and young people from online harms, but without having such a significant negative impact on other human rights'.\n\n\"Lastly, this law is applied to Reddit inaccurately, since we're a forum primarily for adults and we don't have the traditional social media features the government has taken issue with.\"﻿\n\nThe company, which says it is complying with the ban, also pointed to the fact it had a 17-plus age rating on the Apple App store before the new laws came into effect – although it still has a 12-plus rating on the Google Play store.\n\nREAD MORE: Idyllic tourist hotspot introduces the death penalty for a common offence\n\nReddit is one of ten social media companies forced to keep young children off its platform under the ban. (Getty)\n\nIt also insisted its case is not about trying to keep young users for commercial reasons, nor an attempt to oppose child safety measures or regulation.\n\n\"There are more targeted, privacy-preserving measures to protect young people online without resorting to blanket bans,\" a spokesperson said.\n\n\"Despite the best intentions, this law is missing the mark on actually protecting young people online,\" they added.\n\n\"So, while we will comply with this law, we have a responsibility to share our perspective and see that it is reviewed by the courts.﻿\"\n\nReddit is one of ten platforms forced by the new laws, which came into effect on Wednesday, to stop under-16s accessing its ﻿site, alongside the likes of Facebook, Instagram, Snapchat and TikTok.\n\nIts legal challenge is the second major attempt to overturn the ban in the High Court, with a similar case ﻿from two teenagers and NSW Libertarian MP John Ruddick due to be heard next year.\n\nIn a statement, the federal government said it stands by its new laws.\n\n\"The Albanese government is on the side of Australian parents and kids, not platforms,\" a spokesperson said.\n\n\"We will stand firm to protect young Australians from experiencing harm on social media.\n\n\"The matter is before the courts so it is not appropriate to comment further.\"﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/time-magazine-person-of-the-year-2025-architects-of-ai/7b52f1b2-afe1-45a1-b7b2-8442f9d1f710",
    "title": "Time magazine names 'Architects of AI' as its person of the year for 2025",
    "publish_date": "Thu, 11 Dec 2025 19:28:03 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "The \"Architects of AI\" have been named Time magazine's person of the year with the publication citing 2025 as when the potential of Artificial Intelligence \"roared into view\" with no turning back.\n\n\"For delivering the age of thinking machines, for wowing and worrying humanity, for transforming the present and transcending the possible, the Architects of AI are TIME's 2025 Person of the Year,\" Time said in a social media post on Thursday (Friday AEDT).\n\nThe magazine was deliberate in selecting people - the \"individuals who imagined, designed, and built AI\" - rather than the technology itself, though there would have been some precedent for that.\n\nThe cover of Time magazine showing the AI architects named Person of the Year 2025. (Supplied Nine)\n\n\"We've named not just individuals but also groups, more women than our founders could have imagined (though still not enough), and, on rare occasions, a concept: the endangered Earth, in 1988, or the personal computer, in 1982,\" wrote Sam Jacobs, the editor-in-chief, in an explanation of the choice.\n\n\"The drama surrounding the selection of the PC over Apple's Steve Jobs later became the stuff of books and a movie.\"\n\nOne of the cover images resembling the \"Lunch Atop a Skyscraper\" photograph from the 1930s shows eight tech leaders sitting on the beam: Meta CEO Mark Zuckerberg, AMD CEO Lisa Su, Tesla CEO Elon Musk, Nvidia CEO Jensen Huang, OpenAI CEO Sam Altman, the CEO of Google's DeepMind division Demis Hassabis, Anthropic CEO Dario Amodei and AI pioneer Fei-Fei Li, who launched her own start up World Labs last year.\n\nAnother cover image shows scaffolding surrounding the giant letters \"AI\" made to look like computer componentry.\n\nFive of the eight people selected — Musk, Zuckerberg, Huang, Altman and Su — are already billionaires with a collective fortune of $US870 billion, based on the latest estimates compiled by Forbes magazine. Much of the wealth has been accumulated during the past three years of AI fever.\n\nTime magazine chief executive Jessica Sibley, centre, rung the bell at the New York Stock Exchange, on Thursday, December 11, 2025 as the publication announced its Person of the Year. (AP Photo/Richard Drew) (AP)\n\nIt made sense for Time to anoint AI because 2025 was the year that it shifted from \"a novel technology explored by early adopters to one where a critical mass of consumers see it as part of their mainstream lives,\" Thomas Husson, principal analyst at research firm Forrester, said by email.\n\nThe magazine noted AI company CEOs' attendance at US President Donald Trump's inauguration this year in Washington DC as a herald for the prominence of the sector.\n\n\"This was the year when artificial intelligence's full potential roared into view, and when it became clear that there will be no turning back or opting out,\" Jacobs wrote.\n\nAI was a leading contender for the top slot, according to prediction markets, along with Huang and Altman. Pope Leo XIV, the first American pope whose election this year followed the death of Pope Francis, was also considered a contender, with Trump, Israeli Prime Minister Benjamin Netanyahu and New York Mayor-elect Zohran Mamdani topping lists as well.\n\nThe magazine's selection dates from 1927, when its editors have picked the person they say most shaped headlines over the previous 12 months.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/bupa-fined-3-million-for-misleading-thousands-of-customers/3ee0e39d-6433-4336-9959-44bb57fd47b1",
    "title": "Bupa fined $35m for misleading thousands of customers for over five years",
    "publish_date": "Thu, 11 Dec 2025 05:28:55 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "B﻿upa has been handed a $35 million fine for misleading customers, hospitals and medical providers about its private health insurance benefits.\n\nThe health provider was found to have told members they were unable to receive benefits for mixed coverage and uncategorised item claims between May 2018 to August 2023, when they were actually entitled to those benefits.\n\nMore than 4100 claims were affected by behaviour the federal court ruled as false, misleading, deceptive, and unconscionable.\n\nREAD MORE: ﻿ Australia records highest number of Indigenous deaths in custody since 1979\n\nA Bupa health insurance sign. (AFR/Natalie Boog)\n\nThese claims were mostly for hospital treatments where two or more procedures were performed at the same time.\n\nSome were for claims where only part of the treatment was covered by a member's policy.\n\nMedical providers and hospitals also did not receive the money they were entitled to.\n\nThe ﻿Australian Competition and Consumer Commission﻿ (ACCC) began court action against the nation's second-largest private health insurer in June.\n\nToday, the ﻿federal court has ordered Bupa to pay $35 million and abide by a five-year injuction prohibting the provider from breaching the rules.\n\nBupa has paid back most of the affected customers $14.3 million relating to more than 4100 claims. ﻿\n\nREAD MORE: ﻿ Missing FIFO worker failed to board flight and hailed a cab to the beach\n\nClaims for hospital treatments were affected by Bupa's actions (Nine)\n\nACCC Deputy Chair Catriona Lowe said Bupa's actions were \"extremely serious\" as thousands of customers suffered financial harm, pain, suffering and emotional distress.\n\n\"Some of Bupa's members decided to cancel, delay or forego necessary treatment, resulting in potential medical risks or complications, because they were incorrectly told they were not entitled to health insurance benefits,\" she said.\n\n\"Private health insurance can be a significant expense for consumers, and people rightly expect to receive the level of coverage they pay for.\"\n\nBupa ﻿accepted the court decision and apologised to its customers.\n\n\"We remain deeply sorry for these errors and have apologised to our affected customers for the impact this has had on them and their families and have taken actions to ensure this doesn't occur again,\" the provider said in a statement. ﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/best-christmas-lights-australia-2025-displays-decorations-where-to-find-them/dc4afa62-2ee3-46dd-9329-90351a9dfd43",
    "title": "Painstaking detail hidden in Queensland family's Christmas display",
    "publish_date": "Wed, 10 Dec 2025 23:28:13 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Some ﻿ C﻿hristmas fans are ignoring rising electricity prices this festive season, with twinkling lights draped across trees, lawns and homes across the country.\n\nThe beloved tradition of looking at Christmas light﻿s on a warm summer's evening certainly won't be missed this year – thousands of households have already painstakingly hung their colourful decorations and are spreading cheer in their communities.\n\nHere, we round up some of the best lights in Australia and where to find them﻿. From Mudgee in NSW and High Wycombe in WA to Burleigh Waters in Queensland and Roxby Downs in SA, the joyful festivities can be seen far and wide.\n\nIf you've decorated for Christmas, send your photos to contact@nine.com.au for a chance to be featured in our story.\n\nMudgee, NSW﻿\n\nThis couple from regional NSW﻿ captured their festive lights from the sky – and their house is the brightest on the block.\n\n\"Each year my hubby goes above and beyond,\" homeowner Tash told nine.com.au.\n\n\"He puts the lights up, I pass him the beer.\"\n\nA Christmas light display seen from above in Mudgee. (Supplied)\n\nTash said her husband spends hours putting up their lights. (Supplied)\n\nHigh Wycombe, WA\n\nOne Perth family﻿ has used the ABC hit Bluey as the theme of their Australian-themed Christmas decorations.\n\nYou can find these lights on Palmer Crescent in the suburb of High Wycombe.﻿\n\nBluey is the main character of this household's Christmas decoration. (Supplied)\n\nThe front lawn is chock-full of twinkling lights and fun surprises. (Supplied)\n\nBaulkham Hills, NSW﻿\n\nThere appears to be a two-storey house hiding underneath the spectacular decorations at this property in Baulkham Hills in Sydney's north-west.﻿\n\nYou can enjoy these decorations o﻿n Goodin Road.\n\nChristmas lights in Baulkham Hills in Sydney (Supplied)\n\nJamboree Heights, Queensland\n\nIt might be nudging 30﻿-degrees most days in Queensland during December, but this Brisbane family is helping their neighbours enjoy a white Christmas.\n\nThe display here on Mistral Street in Jamboree Heights comes complete with a blow-up Rudolph and his sleigh.﻿\n\nChristmas lights in Jamboree Heights in Brisbane. (Supplied)\n\nFake snow can be seen on the lawn at this home. (Supplied)\n\nSt Albans, Victoria﻿\n\nThe local community on Brown Avenue in St Albans in Melbourne's west loves to dress their homes in festive decorations each year.﻿\n\n\"The display is designed to bring joy and holiday spirit to families across the area,\" homeowner Claudia told nine.com.au.\n\nChristmas lights in St Albans, Melbourne. (Supplied)\n\nNeighbours in this suburb enjoy putting the lights up every year. (Supplied)\n\nCroydon Park, SA\n\nThis home in Adelaide's north-west is so decked out with lights, figurines and stuffed animals, you can hardly see the lawn.\n\nPassersby surely stop and marvel at these lights every evening on Days Road in Croydon Park, South Australia.\n\nChristmas lights in Croydon Park, SA. (Supplied)\n\nThe front lawn is filled with Christmas ornaments and figurines. (Supplied)\n\nSandstone Point, Queensland﻿\n\nThe owners﻿ of this home in the coastal Queensland town of Sandstone Point built a tree on their driveway using 3000 cans of VB.\n\nTheir magical Christmas display is also complete with a waterfall display, a gingerbread area and a nativity scene, which you can witness at the home on Clark Terrace.\n\n\"Continue through to our walk-through garage, where a singing Santa performs alongside angels, gingerbread characters, Mrs Claus and many other Christmas favourites,\" homeowner Jodie said.\n\nChristmas lights in Sandstone Point, Queensland. (Supplied)\n\nA highlight of this display is the tall Christmas tree made from 3000 VB cans. (Supplied)\n\nMount Martha, Victoria﻿\n\nVictorian man Rod and his neighbour both pulled out all the stops to decorate their homes on Florence Street in Mount Martha this Christmas.\n\nThe homeowners are also taking donations for the Royal Children's Hospital in Melbourne from visitors enjoying their lights.\n\nChristmas lights in Mount Martha, Victoria. (Supplied)\n\nFlinders View, Queensland﻿\n\nThere is a magical Christmas wonderland on display at this home on Pearwood Street in Flinders View, Queensland.﻿\n\nChristmas lights at Flinders View. (Supplied)\n\nHoppers Crossing, Victoria﻿\n\n﻿This home on Wildflower Crescent in Hoppers Crossing, in Melbourne's south-west, has so many decorations that the owners can't park in their driveway during Christmas time.\n\nChristmas lights in Hoppers Crossing, Victoria. (Supplied)\n\nGeebung, Queensland﻿\n\nQueensland mum Katie said her 15-year-old son began installing Christmas lights at their home in Geebung in ﻿Brisbane's north around October.\n\n\"My son, aged 15, has done the entire design and installation himself,\" Katie said proudly.\n\n\"He has always loved Christmas lights and this year has done a fantastic job.\"\n\nChristmas lights in Geebung, Queensland. (Supplied)\n\nKatie's 15-year-old son began putting up the lights two months in advance. (Supplied)\n\nGowrie, ACT﻿\n\nCan﻿berra man James has been collecting Christmas lights for 12 years to create this masterpiece.\n\nThe display, located on Ruthven Street in Gowrie, helps raise money for multiple sclerosis (MS) and has so far netted over $125,000 in donations.﻿\n\nChristmas lights in Gowrie, ACT. (Supplied)\n\nGregory Hills, NSW﻿\n\nYou can find this cheery display, complete with a Spider-Man surprise on the driveway, in ﻿Gregory Hills in Sydney's south-west.\n\nChristmas lights in Gregory Hills. (Supplied)\n\nWest Hobart, Tasmania﻿\n\nChristmas light fans come from around the neighbourhood to witness this glorious home on Molle Street in West Hobart.\n\nChristmas lights in West Hobart, Tasmania. (Supplied)",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/december-christmas-weather-forecast-australia-2025-state-by-state/6adafbf2-746f-44a7-a1da-730498c3a498",
    "title": "One city set to swelter on Christmas Day",
    "publish_date": "Thu, 11 Dec 2025 01:00:00 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Australians are set to soak up sunny days this Christmas, according to the latest weather predictions.﻿\n\nAccuweather has released a detailed forecast for this month in each of Australia's capital cities﻿.\n\nHere's what's in store for the central hubs of each state and territory.\n\n﻿ READ MORE: Australia Post reveals deadline for mailing Christmas parcels\n\nDarwin is in for a sweltering Christmas day. (Getty Images/iStockphoto)\n\nNSW\n\nThere will be plenty of sun in Sydney this December, with some cloudy conditions and showers predicted across the month.\n\nChristmas Day should be dry and mostly sunny with a low of 21 degrees and a high of 27 degrees.\n\nQueensland﻿\n\nIt's going to be hot in Brisbane this December.\n\nExpect plenty of sun with a few summer storms thrown in around the middle and end of the month.\n\nUnfortunately, Christmas Day is predicted to be cloudy and humid with a low of 22 and high of 30.\n\nChristmas day is looking cloudy and humid in Brisbane. (Getty)\n\nVictoria﻿\n\nDecember will be warm but cloudy in Melbourne.\n\nSome rain and thunderstorms are predicted towards the middle of the month.\n\nChristmas Day is expected to be ﻿sunny with a high of 26 and a low of 16.\n\n﻿ACT\n\nCanberra will enjoy a balmy December.\n\nThe skies will be a mix of sun and cloud cover for most of the month, with a smattering of showers.\n\nDecember 25 will be warm with an expected high of 29 degrees.\n\nCanberra is expecting a warm Christmas day. (Getty)\n\nSouth Australia\n\nDecember is looking like a mixed bag in Adelaide.\n\nMost of the month will be cloudy, with patches of rain and even fog.\n\nChristmas Day is expected to be mostly sunny with a high of 27 degrees.\n\nWestern Australia\n\nPerth will experience a sticky summer based on current predictions for December.\n\nMost of the month will be sunny with a few isolated patches of cloud, though they should pass in time for Christmas.\n\nChristmas Day is expected to be sunny with some cloud cover and a high of 24 degrees.\n\nEarly predictions are showing Perth will be sunny in the lead-up to Christmas. (Getty)\n\nNorthern Territory\n\nDecember in Darwin will be sweltering with rain and storms throughout ﻿the month.\n\nDespite thi, Christmas Day is currently predicted to be one of the few sunny days, with December 25 slated for a high of 35 degrees.\n\nREAD MORE: When double demerits apply over Christmas and New Year in every state and territory\n\nTasmania﻿\n\nHobart will enjoy a more temperate introduction to summer, with plenty of sun and a smattering of rainfall through the month.\n\nChristmas Day is expected to be mostly cloudy with some showers and a predicted high of 21 degrees.﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-12/parliamentary-expenses-rules-review/106135370",
    "title": "Breaking: PM says he has asked independent watchdog for advice on politician perks",
    "publish_date": "Fri, 12 Dec 2025 01:40:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "The prime minister says he has asked an independent watchdog to provide advice on whether the taxpayer-funded perks available to politicians should change, amid a rolling expenses saga that has dominated debate for over a week.\n\nIt began with reports that Sports and Communications Minister Anika Wells had spent almost $100,000 on last-minute flights to give a speech in New York and has since expanded to include scrutiny over her use of family travel arrangements and taxpayer-funded drivers.\n\nShe referred her claims to the Independent Parliamentary Expenses Authority for review earlier this week, after a stream of questions over her spending distracted from the rollout of the social media ban for under-16s.\n\nMs Wells and Anthony Albanese have both repeatedly stressed that all her claims fell within the guidelines, while other politicians from across the spectrum have also had their use of entitlements questioned.\n\nCalls have been mounting for the prime minister to respond to the growing furore with action, and on Friday he would not explain when or how he requested the advice, beyond that he had asked \"the head of IPEA\".\n\n\"At least two members of parliament have referred themselves for the details of their audit, but in addition to that, I've said to IPEA, 'Please give us some advice,'\" he said.\n\n\" When that advice is received, we will make a decision in the usual way. \"\n\nAsked repeatedly about the timing of the request, Mr Albanese said he had done so publicly \"at multiple press conferences\".\n\n\"I reach out publicly all the time,\" he said.\n\nA day earlier, at a media conference alongside Ms Wells, the prime minister brushed aside questions on whether a review of the rules was needed, telling reporters that he did not want to \"influence that from the top\" and that he was \"not the finance minister\".\n\n\"The rules have been there since they were put in place by the former government,\" he said.\n\nThe expenses authority is responsible for monitoring compliance with the rules and can make recommendations when it audits politicians, but the guidelines themselves are set by regulation, administered by the finance minister and special minister of state.\n\nOpposition Leader Sussan Ley has repeatedly said she is open to \"looking at the rules\" and has written to Mr Albanese requesting a meeting to discuss how trust in the system can be strengthened, \"so community expectations are being met\".",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-12/boonah-high-agriculture-education-turnaround/105983794",
    "title": "How long does it take to fix an underperforming school?",
    "publish_date": "Fri, 12 Dec 2025 01:32:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "\"Five years,\" says Dan Marrone, the principal of a high school in Queensland's Scenic Rim, an hour south-west of Brisbane.\n\nBut parent Jo Martin, said the game-changing headmaster flipped her daughter's country high school in just two years.\n\n\"He's absolutely transformed Boonah State High, it's going from strength to strength, with people outside our catchment area wanting to attend our incredible state high school,\" Ms Martin said.\n\nDan Marrone has been a Queensland school principal for more than 20 years. (Supplied)\n\n\"Decision and policymakers need to sit up and take notice, as this model works, and our community's [now] absolutely thriving.\"\n\nFrom struggling school to stand-out success\n\nDan Marrone was appointed principal at Boonah in 2023.\n\n\"When I first got here it was not the school of choice, we're really proud of the fact that we're now the school of choice,\" he said.\n\n\" The level of behaviour and disengagement I experienced when I first got here was pretty high, we've reversed that completely. \"\n\nDespite 23 per cent of the local workforce being employed in agriculture, agricultural studies were a low priority at the school when Mr Marrone arrived.\n\nTo ensure the curriculum engaged all students, \"not just the third headed to university\", he hired two more agricultural studies teachers, added new agriculture subjects, and helped teachers develop close relationships with local farm businesses.\n\nBoonah's beautiful landscape and farmland located in the Scenic Rim rural region of Queensland. (ABC Landline: Cameron Lang)\n\n\"There's a whole other section of our kids there they want to be able to stay in the community; they want to have opportunities and pathways and employment conduits,\" he said.\n\nA model for rural education reform\n\nAidan Richters, the only agriculture teacher in 2023, now takes students on tours of rural businesses and regularly welcomes agricultural experts to the school.\n\n\"We're trying to take learning outside of the classroom and by bringing industry into the school our program is buzzing,\" he said.\n\nBoonah students regularly visit local rural enterprises like Kalfresh. (ABC Landline: Pip Courtney)\n\n\"Disengaged students are re-engaging with learning and changing their mind about leaving school.\"\n\nMr Richters revived interest in agriculture by starting a lunchtime Cattle Club in 2003.\n\nLocal studs donated cattle; an agricultural show team was formed, and the students' distinctive yellow competition shirts became highly sought after.\n\nThe club now has 60 members.\n\nYear 7 student Piper Wainwright with her competition scarf and shirt. (ABC Landline: Pip Courtney)\n\nYear seven student Piper Wainwright treasures her yellow shirt and scarf.\n\n\"When I first started high school all I wanted to do was to be in Cattle Club because you get to work with cattle, and you … can create a bond with them,\" Ms Wainwright said.\n\nOlivia Smith said Cattle Club has taught her discipline and perseverance.\n\n\"These lessons go far beyond the show ring, they're life skills that will continue to guide me in my future career which I hope will be in the stock agent industry,\" Ms Smith said.\n\nThe Boonah State High School Cattle Club proudly displaying their show ribbons. (Supplied)\n\nMr Marrone said the requirement for students in cattle judging competitions to explain how they reach their decisions has had a profound impact.\n\n\"We've got students for example that feel shy or embarrassed to do a year nine English oral presentation in front of their whole class but who'll stand up at Rockhampton Beef Week in front of a thousand people and speak for 10 minutes on the breeding characteristics of four heifers and not even think about it,\" he said.\n\nElders agronomist Brendan Magee teaching his students. (ABC Landline: Pip Courtney)\n\n\"It's those moments that bring a tear to your eye as an educator.\"\n\nCattle Club builds confidence and community\n\nThe Royal Queensland Show or Ekka is the Cattle Club's biggest competition.\n\nParent Elyse Payne attended this year's event to watch her son compete.\n\n\"We didn't know what our kids were missing out on, it's just unbelievable what it's done for this school,\" Ms Payne said.\n\nThe relationship with local farm businesses is paying off, with students taking up apprenticeships and full and part-time jobs.\n\nRob Heinrichsen, the founder of Kalfresh, a multi-million-dollar vegetable business, has hired several Boonah High students.\n\nDan Marrone and students visit Kalfresh where founder Rob Heinrichsen explains the business. (ABC Landline: Pip Courtney)\n\n\"We've seen a real integration with industry, so instead of the school kind of sitting there and never the twain shall meet, we're getting a lot more interaction,\" Mr Heinrichsen said.\n\nChallenging the system to keep students engaged\n\nAgriculture teacher Aidan Richters praised principal Marrone for giving the teachers at the school \"a licence to thrill\".\n\nPrincipal Marrone admits to being an educational \"disrupter\" but said it's absolutely necessary as traditional schooling only suits 40 per cent of students.\n\n\"When we talk about student disengagement or … youth crime or dropout rates or suspension rates, we're not talking about bad kids,\" Mr Marrone said.\n\n\"What we're talking about is a system that doesn't necessarily always cater to the broad spectrum of students coming through our doors,\" he said.\n\nStudents prepare meals in the kitchen for guests. (ABC Landline: Cameron Lang)\n\n\"If you look at our trade and industry program where their maths and English is contextualised to their broader learning, we've got students getting A's and B's in maths that prior to grade 11 had never passed before.\"\n\nAgriculture is embedded in the curriculum, culminating in the annual Paddock to Plate dinner.\n\nThe students raise the beef and grow the vegetables, herbs and eggs, and hospitality students plan and run the event.\n\nAt the dinner the principal told guests the school had been on a remarkable journey since 2023.\n\n\"We're setting a model, and the success of our young people relies on us pulling in a common direction to build the generation of the future,\" Mr Marrone said.\n\nSeveral Year 12 students who are about to leave school and with it Cattle Club told diners they'd miss it.\n\n\"I'd give anything for just one more show, because the lessons, the experiences and the people I've met along the way are truly priceless,\" Alexander Fordyce said.\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-12/hollywood-director-convicted-of-scamming-16-million-aud-netflix/106135428",
    "title": "Hollywood director convicted of scamming $16.5m from Netflix",
    "publish_date": "Fri, 12 Dec 2025 00:53:57 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "A Hollywood director has been convicted on charges that he scammed Netflix out of $US11 million ($16.5 million) for a show that never materialised.\n\nCarl Erik Rinsch, best known for directing the film 47 Ronin, instead used the cash for lavish purchases that included several Rolls-Royces, a Ferrari and about $US1 million in mattresses and luxury bedding, prosecutors said.\n\nRinsch was convicted of wire fraud, money laundering and other charges on Thursday, local time, according to court records and a spokesperson for federal prosecutors in New York.\n\nIn a statement, Rinsch's attorney, Benjamin Zeman, said he thought the verdict was wrong and \"could set a dangerous precedent for artists who become embroiled in contractual and creative disputes with their benefactors, in this case one of the largest media companies in the world, finding themselves indicted by the federal government for fraud\".\n\nHollywood director arrested for allegedly swindling Netflix out of $17 million Plus White Lotus star Jason Isaacs wades into prosthetic penis discourse, protesters interrupt Gal Gadot's walk of fame ceremony and more.\n\nProsecutors said Netflix had initially paid Rinsch about $US44 million for an unfinished sci-fi show called White Horse, then sent over another $US11 million after he said he needed additional funding to wrap up the production.\n\nBut instead of putting the money toward the show, Rinsch steered the cash to a personal account where he made a series of failed investments, losing around half of the $US11 million in a couple of months, according to prosecutors.\n\nHe then put the remaining funds into the cryptocurrency market, netting some profit, though Rinsch then deposited the money into his own bank account.\n\nThen came the lavish purchases, prosecutors said, with Mr Rinsch buying five Rolls-Royces and one Ferrari, along with $US652,000 on watches and clothes.\n\nHe also bought two mattresses for about $US638,000 and spent another $US295,000 on luxury bedding and linens.\n\nIn addition, he used some of the money to pay off about $US1.8 million in credit card bills, prosecutors said.\n\nRinsch, 48, never finished the show. His sentencing date is set for April.\n\nNetflix declined to comment.\n\nUS attorney Jay Clayton said in a statement to the Associated Press that Rinsch \"took $US11 million meant for a TV show and gambled it on speculative stock options and crypto transactions\".\n\n\"Today's conviction shows that when someone steals from investors, we will follow the money and hold them accountable.\"\n\nAP",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-12/push-for-cheaper-energy-prices-in-regional-nsw/106121430",
    "title": "Electricity price blowout between city and country a 'dire situation'",
    "publish_date": "Fri, 12 Dec 2025 00:44:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "The high price of electricity in regional areas has come under the spotlight, with local councils set to lobby the NSW government for a \"fairer deal\".\n\nThe minimum daily electricity tariff in metro NSW can be as low as $0.79 but in regional and rural NSW, the lowest daily charge is $1.57 – almost double the amount.\n\nNeville Kschenka says it is time to even out the price of electricity between regional and metro consumers. (ABC Riverina: Nicola Ceccato)\n\nMayor of Narrandera Shire Council in south-western NSW, Neville Kschenka, said it was not good enough.\n\n\"It's just not fair, and it's been brought to our attention by our own ratepayers and other councils,\" he said.\n\n\"We want fair pricing between the two regions.\"\n\nIn NSW, electricity retailers set their own prices and take into account the costs to generate electricity, distribute it through the networks, any environmental costs as well as their own retail costs and margins.\n\nWhile retailers set their own prices, the cost of their supply charges for a household helps to cover the price of network costs.\n\nThe supply charge is a daily fee to be connected to the network.\n\nThe networks provide the infrastructure for the transmission lines and there are three main networks that service NSW.\n\nAusgrid and Endeavour Energy provide electricity across the Sydney, Central Coast, Hunter Region, Newcastle, Blue Mountains, Southern Highlands and Illawarra areas.\n\nEssential Energy covers rural and regional NSW as well as a few coastal areas, comprising 95 per cent of the state's land.\n\nEssential Energy is owned by the state government and regulated by the Australian Energy Regulator (AER), which means most of its distribution services are subject to revenue and price controls determined by the AER.\n\nIn a statement, a spokesperson for the AER says higher costs on the Essential Energy network are due to customers using more energy, the fact it is a larger distribution zone with fewer people, and the network costs (poles and wires) per customer being higher.\n\nBut at a recent NSW local government conference, a motion to advocate for cheaper prices in the regions was passed.\n\nTaking the push to parliament\n\nThe Local Government NSW (LGNSW) body will advocate to the state government for Essential Energy to align rural supply charges with those applied to city and coastal consumers.\n\nThe Minister for Energy Penny Sharpe did not comment on the motion but said she was open to receiving correspondence from local councils.\n\nMeanwhile, high energy prices are taking a toll on the region's most vulnerable.\n\nGriffith's Linking Communities Network assists people in emergency situations to apply for a state government program for those going through financial hardship or a crisis such as loss of income, natural disasters or family violence.\n\nIt can cover up to $400 at a time but can only be applied twice a year.\n\n\"A young person who has to rent a property at perhaps $400 or $500 a week and then having their electricity on top of that plus their living allowances, their food and it just becomes unattainable for people to have rentals by themselves,\" CEO of Linking Communities Network Kirrilly Salvestro said.\n\nKirrilly Salvestro says the cost of electricity is hurting the community's most vulnerable people. (ABC Riverina: Nicola Ceccato)\n\n\"It's a dire situation, particularly for single parents, young people, those that are struggling to meet the needs of everyday life.\"\n\nIt was an issue, she said, they had seen progressively get worse.\n\n\"Even though the government has established a one-off payment for people, the electricity seems to be rising at a greater price than what the government is giving to households,\" she said.\n\nIt follows the federal government's announcement that the electricity bill subsidy would not be extended into next year.\n\nThe motion from the Local Government NSW conference is set to be discussed in the body's first board meeting today when it will establish policy positions from the conference and from there will begin raising the issue with Ms Sharpe.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-12/asbestos-wind-turbine-brake-pads-worksafe-cfmeu-vestas/106131948",
    "title": "Ship carrying asbestos-containing brake pads docked at Victorian port",
    "publish_date": "Thu, 11 Dec 2025 23:59:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "A cargo ship containing asbestos products intended for a Victorian wind farm is docked in the port of Geelong.\n\nRenewable energy company Vestas confirmed it placed the order for the wind turbine lift brake pads with Chinese supplier 3S Industry before it was discovered the product contained asbestos.\n\nIn November it was revealed three Australian renewable energy companies that together own more than 60 per cent of the country's wind turbines — Goldwind Australia, Vestas and Beijing Jingeng Energy International (Australia) — had confirmed the use of access lift brake pads that were supplied by 3S Industry and found to contain white asbestos.\n\nThe importation of asbestos and products containing asbestos has been illegal in Australia since 2003.\n\nVestas operates dozens of wind farms across Australia. (Supplied: Vestas Wind Systems A/S)\n\nCFMEU Victorian–Tasmanian health and safety directors Dr Gerry Ayres said the latest shipment of the impacted product should never have been allowed to dock.\n\n\"They continue to transport it again. It's illegal,\" Dr Ayres said.\n\n\" You are not allowed to import asbestos-containing material. You know that it contains asbestos, you cannot offload it. \"\n\n\"Not only are these companies breaking the law, but they're forcing workers to break the law because workers have to offload those containers which we know now contain asbestos-containing materials.\"\n\nGerry Ayres says workers must be protected against asbestos. (ABC News: Iskhandar Razak)\n\nWorkSafe continuing to monitor issue\n\nThe union said it was urging WorkSafe Victoria to use its full power to prevent asbestos products from entering Australian worksites.\n\n\"We're asking WorkSafe to enforce its own legislation … to protect the community and the workers,\" Dr Ayres said.\n\n\"They have the power to order [companies] to send them [wind turbine brake pads containing asbestos] back.\"\n\nWorkSafe said inspectors and technical experts were continuing to monitor the issue and make inquiries to determine what further action was required.\n\nIt said that process included working with Victorian duty holders to ensure they adequately controlled associated health and safety risks, engaging licensed asbestos removalists and carrying out safe removal and replacement programs where necessary.\n\nQuarantined upon arrival\n\nVestas said the shipment was quarantined as soon as it arrived in Australia.\n\nA Vestas spokesperson said it took immediate action to ensure worker safety at wind turbine sites as further investigations into the asbestos scare were carried out.\n\n\"In early November, Vestas was informed by a supplier of lifts that they had delivered brake pads as part of a hoist for wind turbine lifts that may contain asbestos,\" the spokesperson said.\n\n\"Vestas maintains a zero-tolerance policy on the use of asbestos in our purchase specification, and the supplier has taken responsibility for not adhering to our policy.\n\n\"We're working with the supplier and partners to remove any risk of exposure to asbestos.\"\n\n3S Industry brake lift pads exist in the majority of Australian wind turbines. (ABC Great Southern: Andrew Chounding)\n\nImports linked to renewables\n\nDr Ayres said the CFMEU would continue pressuring regulators to implement stricter border controls to prevent more asbestos imports linked to renewable energy projects.\n\n\"The workers are part of a community and we don't want to see people being potentially exposed,\" Dr Ayres said.\n\n\"I think the Australian Border Force have a role too, but that role almost becomes superfluous now we know that these components which are coming in contain asbestos.\n\n\" We can eliminate any potential exposure to workers by ensuring these components are sent back to where they came from. \"\n\nThe Australian Border Force has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-12/hanwha-austal-bid-approve-jim-chalmers/106134860",
    "title": "Treasurer approves Hanwha's double stake in Australian shipbuilder",
    "publish_date": "Thu, 11 Dec 2025 23:44:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "The treasurer has given the green light for the South Korean defence conglomerate Hanwha to take a larger stake in the Australian shipbuilder Austal, after months of protracted deliberations that saw the government consult national security agencies while walking a diplomatic tightrope with Japan.\n\nBut Jim Chalmers said there will be \"strict conditions\" on Hanwha's stake in the strategic shipbuilder, in a nod to the diplomatic and security sensitivities surrounding the bid.\n\nThe Foreign Investment Review Board (FIRB) spent more than 10 months scrutinising Hanwha's pitch to lift its stake in Austal from 9.9 per cent to 19.9 per cent after the Australian shipbuilder rejected an earlier takeover bid from the company.\n\nWhile the decision could help lift Australia's shipbuilding capacities and expertise, Japan — which has a sometimes-fraught relationship with South Korea — has reportedly raised concerns over the bid.\n\nAustal is set to play an important role in AUKUS and also to help build the Japanese Mogami frigates at the Henderson shipyard from the 2030s, raising the risk that Hanwha might be able to access technology owned by its Japanese rival Mitsubishi Heavy Industries.\n\nIn a statement, Mr Chalmers said the decision \"was not taken lightly and comes after extensive consultation and long and careful deliberation\".\n\n\"It follows a thorough and robust process that took account of all the relevant economic, national security and other national interest issues,\" he said.\n\nThe treasurer also said FIRB had reached the same conclusion, and that his decision was \"entirely consistent with FIRB's unequivocal advice not to object to the proposal, subject to conditions\".\n\nJapan raised concerns about bid\n\nUnder the move, Hanwha would remain a minority shareholder and would not be able to increase its shareholding above 19.9 per cent.\n\nLimits would also be placed on Hanwha's access to \"sensitive information\" and possible board appointments to Austal.\n\nEarlier this year, the Nightly reported that Japanese officials had twice written to the Department of Defence to raise concerns about the Hanwha bid.\n\nBut one diplomatic source, speaking on the condition of anonymity, said Australia had calmed Japan's nerves by reassuring Tokyo that sufficient protections had been put in place to protect Japanese intellectual property.\n\nMr Chalmers said Austal was a \"key pillar of our plan to boost local manufacturing and industry capabilities\".\n\n\"This decision and associated conditions will protect our sovereign interests in this capability and ensure the company can continue to grow, invest, and deliver continuous shipbuilding in Western Australia,\" he said.\n\n\"Australia welcomes foreign investment and operates a non-discriminatory foreign investment framework to ensure foreign investment is in our national interest.\"\n\nDecision provides 'clarity'\n\nIn a statement, Austal chief executive Paddy Gregg said the company \"respected\" the Treasurer's decision and that it provided \"clarity\" to the company.\n\nThe company also said it would \"closely review the opportunities and risks\" associated with any pitches from Hanwha for additional partnerships on shipbuilding opportunities.\n\n\"Relevant factors which would need to be assessed would include feedback from design partners, the efficient running of the board and its meetings, given discussion of sensitive national security topics\", as well as \"potential additional governance and security measures required of the company.\"\n\nHanwha has not responded to the decision.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-12/abc-radio-stations-in-perth-will-move-to-fm-in-2026/106121114",
    "title": "ABC Radio stations in Perth to move to FM in 2026",
    "publish_date": "Thu, 11 Dec 2025 23:33:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Almost 102 years after ABC radio first hit the airwaves, Perth listeners will experience a major improvement in audio quality when the network's three AM stations move to FM in 2026.\n\nThe long-awaited shift follows a decision by the Australian Communications and Media Authority (ACMA) to vary the Perth and Remote Western Australia radio licence area plans.\n\nABC managing director Hugh Marks said it was an exciting opportunity to improve the quality of services to Perth audiences.\n\n\" We have long been aware of the challenges of AM reception in Perth. With FM, audiences can enjoy richer sound and more reliable broadcasts, ensuring they stay connected to the programs they love. \"\n\nPrime Minister Anthony Albanese speaks at ABC Radio Perth in November. (ABC News: Andrew O'Connor)\n\nABC director of audio Ben Latimer said not only would the move to FM significantly improve sound quality, it would also lead to considerable savings.\n\n\"These new FM licences will deliver better quality audio and are significantly less expensive; providing better value to taxpayers as demand for AM declines in capital cities,\" Mr Latimer said.\n\n\"This change reinforces the ABC's ongoing commitment to our radio services and our ongoing desire to provide the best quality broadcasts for audiences across the country.\"\n\nThe switchover date and new frequencies for ABC Radio Perth, Radio National and News Radio will be announced in the new year.\n\nWhy is AM reception in Perth a problem?\n\nThe answer lies in how amplitude modulation (AM) frequencies are transmitted and the bane of all Perth gardeners — Perth's sandy soil.\n\nFederal Opposition Leader Sussan Ley at ABC Radio Perth Studios on Drive. (ABC News: Kenith Png)\n\nWhile we refer to radio being on the airwaves, AM transmission relies on ground waves.\n\n\"AM operates from what's called a site and each site is located somewhere where there's good propagation, where the signal will travel the best,\" Gavin Bowman, ABC's manager of transmission contracts explained.\n\n\"AM travels better along the ground, and so therefore you need a site with good sort of ground propagation aspects.\n\n\" AM really likes moist, wet soil to go further, and so often you'll have an AM tower in a swamp or next to a river or something like that, where the ground is wet. \"\n\nAM transmitters rely on good soil conductivity to carry signals along the ground. In areas like Perth, dry, sandy soil and electrical infrastructure weaken signals over distance. (ABC Transmission)\n\nPerth sits on the Swan coastal plain, which is notorious for its dry, sandy soil and going months without any rain.\n\nAM needs a paddock in the city\n\nSince 1939 the ABC Radio Perth AM transmitter has been located on a large bushland reserve in Hamersley, in Perth's northern suburbs, with an exclusion zone around the 180-metre-high mast.\n\nUnlike FM which needs a tower or mast on a hill line-of-sight propagation, AM requires a lot more land.\n\n\"The reason for that is because [with AM] the mast that you can see at the centre of the site is only one little part of the overall infrastructure that gets the signal out,\" Mr Bowman said.\n\n\"One of the main parts is that they plough extra wires into the dirt, which make the transmitter what they call electrically longer.\n\n\"You have these radial wires that lead out from the mast that direct the signal out along the ground in a much more efficient way than just a mast would on its own.\n\n\"Because of that requirement, you have to have a really large block of land, we're talking about acres and acres and acres.\"\n\nFM transmitters are mounted high on ridges or towers. They use line-of-sight propagation to deliver wider, clearer coverage with less power and little dependence on soil conditions and are ideal for high quality audio across concentrated metro areas. (ABC Transmission)\n\nNot only does AM use up a lot of land in capital cities, one AM mast can only deliver one or two services, so each radio station needs its own paddock.\n\n\"In the case of FM and TV, they can all share the same infrastructure, so one site on top of a hill can house a large number of services,\" he said.\n\n\"There's a large sharing capacity where you can defray those costs across multiple services, which you can't do in AM.\"\n\nFreeway drives a train through car listening\n\nAs if the sand and the land weren't enough, the 1990s expansion of the Perth railway network, to run north and south along the centre of the Mitchell and Kwinana freeways, created another headache for AM radio listeners.\n\nA Transperth train on the Joondalup line. The electrified lines have made listening to AM radio in the car on the freeway difficult. (ABC News: Eliza Laschon)\n\nThe electrified train lines cause interference that makes listening to AM radio in the car while driving on the freeway almost impossible.\n\n\"Whenever a train goes past and you've got your AM radio tuned in, that is significant impact to your quality of service,\" Mr Bowman said.\n\nFor many commuters, the interference has led to a permanent switch-off of AM stations when they are on the freeway.\n\n101 years on the AM band\n\nIt is the end of an era for ABC Radio Perth (first named 6WF, then later 720), which started broadcasting just over a century ago on June 4, 1924.\n\nIt was not founded by the ABC, but was a commercial station operated by Westralian Farmers Co-operative (now Wesfarmers) with the intention of lessening isolation for people in the bush.\n\nABC Radio Perth marks 100 years The state's first AM radio station was founded by what's now known as Wesfarmers to help ease isolation in the bush. A century later, it's still bringing the community together.\n\nAccording to Wesfarmers' official history, the station came about after John Thomson, head of the wheat department of the company, was travelling on a rough dirt track in the wheatbelt, on his way to Bruce Rock, when his car got two flat tyres and he was forced to wait four hours for a passer-by to come and help.\n\nIt was during those four lonely hours that he reflected on the isolation people in the country experienced and decided wireless telegraphy [radio], which was just emerging in Australia, was the perfect solution.\n\nOperating a radio station was far from the organisation's usual business, but Mr Thomson was able to persuade management that Wesfarmers should bid for the first radio license in Perth.\n\nAn ABC Radio Perth Mornings Spotlight forum. (ABC News: Emma Wynne)\n\nThe station was named 6WF, for Wesfarmers. Four years later, weary of running a radio station, Wesfarmers sold 6WF to the Commonwealth government, and eventually it became part the ABC local radio network.\n\nMr Latimer confirmed the move to FM in Perth would not have an impact on the ABC's regional radio services nor the ABC's commitment to emergency broadcasting.\n\n\"The ABC is in the fortunate position of having existing high-powered AM transmitters in areas adjacent to Perth to provide emergency broadcasting to all areas outside the metropolitan area currently covered by the Perth AM signal,\" he said.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-12/reddit-social-media-ban-under-16-court-challenge/106134994",
    "title": "Reddit challenges Australia's social media ban for under-16s",
    "publish_date": "Thu, 11 Dec 2025 23:13:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "Reddit has filed a High Court challenge alleging that Australia's social media restrictions are being applied to the company inaccurately.\n\nThe company is currently complying with the legislation but has said the new law \"has the unfortunate effect of forcing intrusive and potentially insecure verification processes on adults as well as minors\".\n\nThe day the snap streaks ended — for some teens, at least After a year of waiting, Australia's world-leading laws to block kids from accessing social media are officially enacted. But the teens they're meant to impact say not much has actually changed.\n\nReddit added the law was \"creating an illogical patchwork of which platforms are included and which aren't\".\n\nIn response to Reddit's legal challenge, the Albanese government said it was \"on the side of Australian parents and kids, not platforms\".\n\n\"We will stand firm to protect young Australians from experiencing harm on social media,\" a government spokesperson said.\n\n\"The matter is before the courts, so it is not appropriate to comment further.\"\n\nIn a statement, Reddit said the case was not an attempt to avoid compliance and it would continue to comply and engage with the government regulator.\n\n\"We believe there are more effective ways for the Australian government to accomplish our shared goal of protecting youth, and the SMMA law carries some serious privacy and political expression issues for everyone on the internet,\" Reddit said in the court filing.\n\n\" This law is applied to Reddit inaccurately, since we're a forum primarily for adults and we don't have the traditional social media features the government has taken issue with. \"\n\nReddit is one of 10 platforms included in Australia's world-first social media ban for children under 16.\n\nTo avoid Australia's new age limit laws, a platform must come under an exempt class, which includes messaging, email, voice or video calling, online games, health, education and professional development.\n\nReddit said \"this is also not an effort to retain young users for business reasons\".\n\nThe social media platform said it did not \"market or target advertising to children under 18\", saying that under-16s were \"not a substantial market segment for Reddit and we don't intend them to be\".\n\nBan is not 'reasonably appropriate and adapted'\n\nIn its filing, Reddit says the government's social media ban has not been well adapted to cater for all platforms affected.\n\nReddit say the social media ban is applied inaccurately. ( )\n\nThe company says the only obligation imposed on platforms relating to the restriction of access to under-16s is to \"take reasonable steps to prevent age-restricted users having accounts\".\n\nReddit argues the Amendment Act \"does not impose any obligation on providers to restrict access to content on the site that is accessible without an account\".\n\nIt says the memorandum provided by the government states the \"obligation would not affect user access to 'logged-out' versions of a social media platform\".\n\nReddit says it is one such platform where users can access content without an account.\n\nBanned: TikTok TikTok logo TikTok is used to create, share and discover short videos, owned by Chinese tech company ByteDance. Before the ban, the eSafety Commission said there were about 200,000 Australian users aged 13 to 15, among a total of almost 10 million Australian accounts. While TikTok has its own minimum age of 13, the regulator has found it's one of the most popular platforms for users aged between eight and 12 as well. The platform's Australia policy lead, Ella Woods-Joyce, said TikTok would comply with the ban, but warned it could have unintended consequences.\n\n\n\n\"Experts believe a ban will push younger people into darker corners of the internet where protections don't exist,\" Ms Woods-Joyce said. Banned: Instagram Instagram logo Instagram was the most used app among Australian teenagers aged 13 to 17 with more than a million monthly active users in this age cohort, according to the eSafety Commission. The platform is owned by Meta, which also owns Facebook, WhatsApp, Threads and Messenger. Instagram said its \"teen accounts\" were automatically applied to users aged 13 to 17, which came with built-in limits on who can contact them and filters on \"sensitive content\". Users in this age cohort also received notifications prompting them to leave the app after 60 minutes of use in one day. Despite these measures, Instagram is under Australia's social media ban for under-16s. Banned: Snapchat Snapchat logo Snapchat was also among the most popular apps for young people, with more than a million of its 8.3 million Australian users aged 17 or under. Snapchat is a messaging app that allows users to send images, videos and texts that are only available for a short period once they're opened. Users can also choose to share their location with friends on Snap Map. Snapchat sought to allow underage users to download and archive their data before their accounts were disabled. Banned: YouTube YouTube logo YouTube has been one of the most popular online platforms for young Australians, with more than 643,000 users aged 17 and under. The regulator found it was the top platform for users aged between eight and 12, with more than two-thirds of those surveyed picking it as their platform of choice. The Australian government was planning to exempt YouTube from its social media ban, but later backflipped on this decision. Rachel Lord from YouTube Australia and New Zealand says there's substantial evidence that YouTube is widely used in classrooms and supported by parents. \"YouTube is not a social media platform; it is a video streaming platform with a library of free, high-quality content, and TV screens are increasingly the most popular place to watch,\" she said. YouTube Kids, a filtered version of the platform that allows parents to create accounts for children under 12, is still allowed. Banned: Facebook The Facebook logo. While Snapchat, Instagram, TikTok and YouTube dominated for young social media users, Facebook still had an estimated 455,000 Australian users aged between 13 and 17. The platform is owned by Mark Zuckerberg's Meta and already has a minimum age of 13. Meta policy director Mia Garlick recently told a Senate hearing that the company would comply with the ban but was still solving \"numerous challenges\" to identify teenagers' accounts. Facebook's private messaging service Messenger is still allowed. Banned: Twitch Twitch logo. ( ) Streaming platform Twitch was added to the list of banned apps after the eSafety Commission found it has the sole or significant purpose of online social interaction. \"Twitch is a platform most commonly used for live streaming or posting content that enables users, including Australian children, to interact with others in relation to the content posted,\" a statement posted to the eSafety website said. Twitch is mainly used by gaming and eSport players to broadcast their gameplay with audio commentary, but it's also used to share and broadcast music, live sports, and food programs, according to the regulator. Banned: X X logo Formerly known as Twitter and owned by billionaire Elon Musk, X falls under the list of banned platforms for under-16s. While it wasn't among the most popular apps for young users, the eSafety Commission has concerns about the prevalence of \"online hate\" on the platform. In June 2023, the regulator said it had received more complaints about online hate on X in the past 12 months than any other platform, saying X had \"dropped the ball on tackling hate\". Banned: Reddit Reddit logo Messaging board Reddit, the seventh-most visited site in the world, is on the list of age-restricted platforms. The platform bans mature content until a user declares they are 18 or over, however, there was no age verification system in place, according to the eSafety Commission. The platform has said it would comply with the ban, but disagreed with the \"scope, effectiveness and privacy implications\" of the law. Banned: Kick Kick logo Along with Reddit, Kick was a late addition to the government's list of age-restricted platforms. Kick is an Australian competitor to video live streaming platform Twitch, where users can watch live video streams covering games, music and gambling. The eSafety Commission recently suggested Twitch, along with gaming site Roblox, could also soon fall under the ban. Banned: Threads Threads logo Threads is a microblogging platform similar to X, which requires users to have an Instagram account for access. As Instagram is banned for under 16s, Threads also falls under the list of banned platforms.\n\nReddit not 'social'\n\nIn one part of the court filing, Reddit references the Oxford and Macquarie Dictionary's definition of the word social.\n\nReddit argues that the government's new ban focuses on the word social and online social interaction, which is not the \"sole or a significant\" purpose of the platform.\n\n\"Reddit enables online interactions about the content that users post on the site. It facilitates knowledge sharing from one user to other users,\" the filing states.\n\n\"It is not a significant purpose of the site to enable interactions engaged in because of a particular user's relationship with or interest in another user as a person; indeed, in most cases, the identity of a user on Reddit is not even known to other users.\"\n\nThe platform goes on to say it does not import contact lists, and its upvote/downvote function is to allow users to indicate how helpful information is, not as a way to be social.\n\n\"In this way, Reddit is significantly different from other sites that allow for users to become 'friends' with one another, or to post photos about themselves, or to organise events,\" the company said.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-12/socceroos-popovich-smug-donovan-us-fifa-world-cup-draw/106134712",
    "title": "Popovic labelled 'smug' by US icon after reaction to World Cup draw",
    "publish_date": "Thu, 11 Dec 2025 22:58:03 +0000",
    "category": "sports",
    "authors": [],
    "text": "Tony Popovic has unwittingly become public enemy number one for USA soccer great Landon Donovan, who labelled the Socceroos coach \"smug\" and predicted Australia to crash out of the World Cup.\n\nThe Socceroos will play co-hosts the USA, Paraguay and a European play-off qualifier in group D in next year's finals, after dodging big guns Argentina, Spain, France and England in the draw.\n\nSpeaking immediately after the draw, Popovic said he was \"satisfied\" with Australia's group.\n\nLoading Instagram content\n\nThat comment seemingly drew the ire of former star striker Donovan.\n\n\"I watched the Aussie coach's interview after the draw and it was really interesting,\" Donovan said on Fox Sports.\n\n\"It was unique. Because most coaches say all the same stuff you're expecting like, 'Oh, it's a difficult draw, this is going to be so hard — and his first comment was: 'we're satisfied'.\n\n\"And I was like: 'Really? Are you?'\n\nLandon Donovan is arguably considered America's greatest ever men's player and played in three World Cups. (Getty Images: Victor Decolongon)\n\n\"And he just had this smugness about him and I'm like, 'Alright, I can't wait. I wish I was on the field — like, I wanna play these guys.'\n\n\"They're a solid team, they're hard to play against, this is not going to be some blowout, whatever, but it's a team I think we should beat.\"\n\nDonovan then doubled down in the segment, with fellow ex-USA players Cobi Jones and Brad Guzan.\n\nHe predicted the USA to top the group, yet-to-qualify Turkey to come second and Paraguay to finish third — with Australia fourth.\n\n\"Thanks for coming, Aussies and your smug coach — you can get back on the Qantas airplane and head back home, pal,\" he quipped.\n\nDonovan isn't the first US pundit to write off the Australians, or consider the group an easy one for the locals.\n\nOn the day of the draw, former US player Alexi Lalas said: \"If you believe in the soccer gods, you should be thanking them.\n\nSocceroos dodge a bullet in World Cup draw but it won't be easy to progress Nothing can be guaranteed in a World Cup, but the Socceroos' draw alongside the United States, Paraguay and a European qualifier gives a solid shot at advancing, with the Australians avoiding most of the big names.\n\n\"I don't want to say it's an easy group, but we also have to be realistic with what we got here.\"\n\nCBS pundit Mike Grellas described the Australia fixture as a \"lay-up\" while former international Charlie Davies called the group \"a dream scenario\".\n\nAt the time, Popovic was unsurprised by local pundits backing their team but made it clear the Socceroos believed they could get through the group stage and could head with a lot of optimism and confidence.\n\n\"Anyone that underestimates us, I think will get a rude shock when it comes to those group games,\" he said last Saturday.\n\nThe Socceroos suffered a 2-1 loss to the USA in a spiteful friendly in October.\n\nAAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-12/swan-river-matilda-bay-applecross-ferry-terminals-approved/106130810",
    "title": "Show of anger at public meeting fails to halt Swan River ferry terminals",
    "publish_date": "Thu, 11 Dec 2025 22:53:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "WA's peak planning body has approved a development application for a controversial ferry terminal and jetty at Matilda Bay in Perth's western suburbs, despite receiving hundreds of public submissions and mounting opposition.\n\nThe Western Australian Planning Commission (WAPC) approved the site, along with another terminal at Applecross in Perth's south, at a public meeting in Floreat lasting nearly five hours on Thursday afternoon and attended by about 100 interested parties.\n\nProtesters gathered outside the meeting in Floreat to voice their anger and concerns. (ABC News: Courtney Withers)\n\nThe Metronet project will connect services from Matilda Bay and Applecross to a floating pontoon at Elizabeth Quay, but criticism against the $29.9 million Matilda Bay site in particular has drawn mounting public backlash.\n\nThe decision comes after WA's environmental regulator last month decided not to conduct a formal assessment of the government's plan.\n\nAn artist's impression of the proposed Applecross ferry terminal. (Supplied: WA Planning Commission)\n\n'We have listened': premier\n\nThe Matilda Bay jetty will extend 140 metres into the bay to accommodate multiple electric ferries.\n\nIt forms part of the government's plans to expand ferry services on the Swan River in what's been dubbed \"an exciting new chapter in public transport for WA\".\n\nThe Matilda Bay jetty will extend 140 metres into the bay, as illustrated in this rendering. (Supplied: WA Planning Commission)\n\n\"We have listened to the community and significantly shifted the position of that particular landing platform [at Matilda Bay],\" Premier Roger Cook said on Thursday.\n\n\"But it's an important part of our network, and we understand that when you make these decisions — decisions that are in the interest of the broader community — sometimes some sectors of the community don't agree with it, but that's what government is about.\"\n\nThe proposal has been met with criticism from several sailing and recreation groups, including Royal Perth Yacht Club, Safety on Swan, and Sailability WA.\n\nCommunity divided over Perth ferry stop As the WA government attempts to create \"Metronet on the Swan\" using electric ferries, campaigners want the Matilda Bay terminal moved south.\n\nMany have raised safety concerns about the site's location in close proximity to a number of sailing, rowing, fishing and swimming activities.\n\nLocals worried about impact\n\nNedlands local Judi Wilson, who attended the meeting and a snap protest outside, said the Matilda Bay site posed environmental risks.\n\n\"I've investigated the wave wash, the sea grass beds, the whole environmental impact and the fact that in talking to people on the bay … they just love that space,\" she said.\n\nNedlands resident Judi Wilson is among those opposed to the Matilda Bay ferry terminal. (ABC News: Courtney Withers)\n\nNedlands Liberal MLA Jonathan Huston also joined protesters to call for the site to be moved to nearby Jojo's Jetty to mitigate impacts.\n\n\"Jojo's is 150 metres away from the Purple Cat bus, which does a turnaround in front of Steve's Hotel,\" he said.\n\n\"So if you're 150 metres away from the Purple Cat bus at Jojo's, you're connected to the bus network system.\"\n\nNedlands Liberal MLA Jonathan Huston says the proposed terminal should be moved. (ABC News: Courtney Withers)\n\nHis position was contrary to the premier's, who said the Jojo's site \"doesn't make sense from a public transport accessibility point of view\".\n\nThe WAPC received 1,884 submissions during recent public consultation about the Matilda Bay site, with a large portion completely against the proposal.\n\nSeveral members at the public meeting called out while Public Transport Authority (PTA) officials gave one of their addresses.\n\nDozens of people attended the WA Planning Commission meeting about the ferry terminals. (ABC News: Courtney Withers)\n\nOne woman was asked to leave after yelling, \"Will you arrest me?\" leading to the meeting being adjourned for 15 minutes.\n\nFacilitators told the group the WAPC held the meeting \"in good faith\" and mentioned several times \"it's not a public town hall meeting\".\n\nMatilda Bay 'best overall': PTA\n\nMany of the submissions read out raised concerns about the social and environmental impacts.\n\nFerries currently operate on the Swan River between Elizabeth Quay and South Perth. (ABC News: Keane Bourke)\n\nThe PTA told the meeting five sites were assessed along with Matilda Bay, including Jojo's Jetty, with Central Matilda Bay deemed \"the best overall\".\n\nA representative said ongoing engagement with local groups would continue but noted a risk assessment at Jojo's Jetty was deemed \"not acceptable\".\n\nCriticism of the planned $29.9 million Matilda Bay terminal has drawn mounting public backlash. (Supplied: WA Planning Commission)\n\nThey also pointed towards the EPA's non-referral but said environmental impacts would continue to be worked through.\n\nServices on stage one of the expanded ferry network plan, going to Matilda Bay and Applecross, are expected to begin by the end of 2027.\n\nThe terminal at Applecross has also been approved by the Western Australian Planning Commission. (Supplied: WA Planning Commission)",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-12/vic-west-gate-tunnel-ready-to-open/106134682",
    "title": "Melbourne's West Gate Tunnel 'ready to take cars from Sunday'",
    "publish_date": "Thu, 11 Dec 2025 22:33:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Melbourne's troubled West Gate Tunnel will finally be ready to welcome motorists on Sunday, according to sources.\n\nThe project, which is three years overdue, provides another major road link between the city's booming western suburbs and the CBD.\n\nWhile the government is refusing to officially say when it will open, multiple sources have told the ABC it will be ready to open this Sunday with a formal announcement expected later this afternoon.\n\nPremier Jacinta Allan repeatedly declined to confirm Sunday as the opening date when asked about the tunnel on ABC Radio Melbourne on Friday morning.\n\n\"We're working through the details and we'll confirm that date very soon,\" she said.\n\nThousands of Melburnians got their first look inside the tunnel last month. (ABC News: Leanne Wong)\n\nThe project was initially costed at $5.5 billion with just $400 million of taxpayer investment, but that has since blown out to $10.2 billion with the state chipping in $4.2 billion.\n\nMelburnians got their first look inside the tunnel last month when it opened to foot traffic for a \"discovery day\" that saw 50,000 people walk through the tunnel.\n\nThe event was held despite protests from the United Firefighters Union (UFU) which claimed the tunnel had not undergone adequate safety checks.\n\nThe government and Major Road Projects Victoria dismissed those concerns and said the tunnel had been sufficiently tested.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/politics/federal/ley-plans-to-slash-refugee-intake-in-coalition-migration-policy-20251211-p5nmxx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Libs consider slashing refugee intake in Coalition migration policy",
    "publish_date": "Fri, 12 Dec 2025 13:05:21 +1100",
    "category": "finance",
    "authors": [
      "Paul Sakkal"
    ],
    "text": "Senior MPs want the opposition to cut by thousands the number of refugees Australia brings into the country as she searches for ways to drive down the overall inflow of migrants, but others in the party have opposed the move because it would cast the party as heartless.\n\nShadow ministers working on the migration policy, which is expected to be made public next week, said one way to drive down refugee numbers from the current 20,000, say sources familiar with the plan but not permitted to talk about it publicly.\n\nOpposition Leader Sussan Ley and home affairs spokesman Jonno Duniam. Credit: Dominic Lorrimer\n\nThe party has not settled on the amount by which it would cut the humanitarian intake, but it could be by as many as 5000 or 10,000, sources said, which the opposition will contrast with the intention spelt out in Labor’s national platform to raise the number to 27,000 over time.\n\nThe Albanese government is unlikely to boost the number so high because the migration program as well as housing and settlement services are already stretched.",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-albanese-continues-to-shirk-responsibility-for-parliamentary-expenses-saga-illicit-tobacco-market-costing-taxpayers-11-8-billion-government-report-finds-20251212-p5nn23.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Albanese shirks responsibility for parliamentary expenses saga; Health minister meeting state counterparts over funding as ‘bed-block crisis’ plagues hospitals and aged care",
    "publish_date": "Fri, 12 Dec 2025 13:01:42 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "The Greens have criticised the government for opening new ocean acreage for oil and gas companies to bid for exploratory drilling rights off the coast of Victoria.\n\nYesterday, Resources Minister Madeleine King unveiled five areas that would be opened for bidding in the Otway Basin.\n\n“Exploration and new discoveries will play an important role in underpinning our energy needs and support Australian industry and households,” she said.\n\nThe areas indicated in red on the map show the new ocean acreage the government has released for oil and gas companies to make bids for exploratory fossil fuel drilling off the coast of Victoria. Credit: Department of Industry, Science and Resources\n\nThe releases won support from energy producers and major gas users across the manufacturing sector who say that unlocking greater supplies of the fossil fuel is needed to head off shortages and price spikes in Victoria and NSW, but they have angered conservation groups who fear the impact that more gas drilling will have on the marine environment, climate change and global warming.\n\nGreens spokesperson for healthy oceans Senator Peter Whish-Wilson said in a statement today:\n\n“Labor’s two-faced climate act is wearing thin. How on earth is ripping open new gas fields for fossil fuel companies to plunder, pollute and profit from in a time of climate emergency consistent with transitioning to a clean energy future?\n\n“Australia has decades of gas left in our proven reserves system. There is no need to put marine wildlife and livelihoods that depend on healthy oceans at risk by using destructive methods to search for new gas fields.”",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/neighbours-ends-again-not-with-a-bang-but-a-whimper-20251212-p5nn6g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Neighbours ends – again – not with a bang, but a whimper",
    "publish_date": "Fri, 12 Dec 2025 13:00:30 +1100",
    "category": "finance",
    "authors": [
      "Louise Rugendyke"
    ],
    "text": "It all ended with a small act of resistance. A quiet show of defiance by Susan Kennedy (Jackie Woodburne), keen to fight for the future of Ramsay Street, when all around her has changed.\n\n“I love Ramsay Street, I love our friends, I love our neighbours,” she said, while standing in the world’s most cursed cul-de-sac, flanked by the ever shifty Paul Robinson (Stefan Dennis) and her husband, Dr Karl (Alan Fletcher). “I don’t want to find a new perfect blend, I want to stay in this one.”\n\nSusan Kennedy (Jackie Woodburne) contemplates the end of Ramsay Street.\n\nCue the drone camera, swooping up over Erinsborough, and that was it. Done. Finished. After 9363 episodes, Neighbours was officially over. Not bulldozed by a freeway, but instead flattened by the streaming giant Amazon after its two-year-long resurrection.\n\nThe duelling visions of Ramsay Hills and Robinson Towers will remain a dream; we’ll never know if Paul’s city-living utopia, of “a latte by the Yarra” will ever be; or if Shane Robinson’s bucolic vision – complete with Kennedy Street – will eventuate.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/politics/federal/butler-flags-potential-travel-expense-reform-pending-wells-investigation-20251212-p5nn2p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "PM says he has asked for advice on expense rules",
    "publish_date": "Fri, 12 Dec 2025 12:59:51 +1100",
    "category": "sports",
    "authors": [
      "Brittany Busch"
    ],
    "text": "Prime Minister Anthony Albanese says he has asked Parliament’s expenses watchdog for advice on the expense rules as Opposition Leader Sussan Ley calls for Sport and Communications Minister Anika Wells to resign if the prime minister won’t declare she has abided by the ministerial code of conduct.\n\nIn a letter to Albanese, Ley demanded Wells be investigated by the prime ministerial department over her use of family travel entitlements, which Wells has used to fly her husband to successive premiere sporting events and their children to Thredbo for a ski trip.\n\nSports Minister Anika Wells and Prime Minister Anthony Albanese in Canberra on Thursday. Credit: Alex Ellinghausen\n\nLey said she also offered to sit down with Albanese to hash out bipartisan reforms to restore public trust in the entitlement system.\n\n“What Minister Anika Wells has done is clearly scandalous, and the whole country is reeling from all of the information that they’ve received about what she has done. She has not shown an ounce of contrition. She has not stepped up and said sorry, or she understands what struggling Australians are going through,” Ley told Sky News.",
    "source": "SMH",
    "cluster_id": 5
  },
  {
    "url": "https://www.smh.com.au/national/tiger-shark-caught-off-rainbow-bay-on-gold-coast-20251212-p5nn8h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tiger shark caught off Rainbow Bay on Gold Coast",
    "publish_date": "Fri, 12 Dec 2025 12:58:13 +1100",
    "category": "finance",
    "authors": [],
    "text": "Tiger shark caught off Rainbow Bay on Gold Coast\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/politics/queensland/teachers-union-takes-special-school-funding-fight-to-industrial-court-20251211-p5nmuh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Teachers union takes special school funding fight to industrial court",
    "publish_date": "Fri, 12 Dec 2025 12:50:17 +1100",
    "category": "finance",
    "authors": [
      "Matt Dennien"
    ],
    "text": "Queensland teachers have escalated a year-long fight with the education department over special school funding reductions, filing a formal dispute in the state’s industrial commission.\n\nThe Queensland Teachers’ Union lodged paperwork last week to have the Queensland Industrial Relations Commission mediate the matter the groups have been unable to resolve.\n\nIt comes as the Crisafulli government embarks on what it has called the largest special school investment in the state’s history, with six new schools to be built or opened from 2027.\n\nRed Hill Special School is one of 46 state special schools across Queensland – all of which are said to have been impacted by the changes. Credit: Red Hill Special School\n\nThe dispute stems from a new model for giving mainstream and special state schools extra teachers and teacher aides to support more than 106,000 students with disability, which was rolled out this year.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/culture/books/state-library-abandons-controversial-restructure-plan-20251210-p5nmm6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "State Library abandons controversial restructure plan",
    "publish_date": "Fri, 12 Dec 2025 12:42:16 +1100",
    "category": "finance",
    "authors": [
      "Kerrie O'Brien"
    ],
    "text": "State Library Victoria has abandoned a proposed restructure after an outcry against it from staff, their union and hundreds of Australia’s most prominent writers and academics.\n\nThe Age revealed in November that library employees had been told the proposed changes included cutting the number of reference librarians from 25 to 10, scrapping other key public-facing roles, introducing new digital roles at the expense of core business, and significantly reducing the number of computers available to the public.\n\nThe library claimed its proposal had been misrepresented in media reports.\n\nChristine Christian, outgoing chair of the State Library Victoria board. Credit: Susan Gordon-Brown\n\n“After careful consideration of the feedback that we received during the entire consultation process – since September – we’ve decided to withdraw the reorganisation proposal,” Christine Christian, outgoing chair of the library’s board, told The Age.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Simon Letch",
    "publish_date": "Fri, 12 Dec 2025 12:27:16 +1100",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Simon Letch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Fri, 12 Dec 2025 12:24:33 +1100",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/storm-star-admits-hes-in-the-sights-of-perth-bears-20251212-p5nn7g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Storm star admits he’s in the sights of Perth Bears",
    "publish_date": "Fri, 12 Dec 2025 12:20:29 +1100",
    "category": "sports",
    "authors": [],
    "text": "Whether his long-term future is in Perth or remaining in Melbourne, Nick Meaney’s short-term plans are to play in the centres rather than chase the Storm’s vacant fullback jersey.\n\nNick Meaney has been in talks to join the Perth Bears NRL side. Credit: Getty Images\n\nRyan Papenhuyzen’s shock off-season departure, walking away from his contract with a year to run, means the Storm will have at least one change to their first-choice backline in 2026.\n\nBut Meaney, who admitted he has been in talks with incoming NRL club Perth, is content to stay put in the centres, plumping for excitement machine Sua Fa’alogo to wear the No.1 jersey.\n\n“We’ve got Sua there and he’s a very handy football player,” the 28-year-old said on Friday.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/goodfood/brisbane-eating-out/you-need-to-eat-this-mortadella-pizza-sanger-that-s-as-big-as-your-face-20251210-p5nmic.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "You need to eat this mortadella pizza sanger that’s as big as your face",
    "publish_date": "Fri, 12 Dec 2025 12:19:06 +1100",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nEating outSandwich Watch You need to eat this mortadella pizza sanger that’s as big as your face It’s luscious, deeply satisfying and, at $17, crazy good value. Matt Shea December 12, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThe secret to a great sandwich? Just about any chef will tell you it’s the freshness of the bread. And as far as Tim Glasson is concerned, it doesn’t get much fresher than pizza dough freshly baked from the oven. Olli Italiano’s Panuozzo are huge, and therefore excellent value. Morgan Roberts “We stretch and bake the dough to order, so it literally can’t be more fresh,” Glasson says. “That’s a big part of the appeal of what we do.” But what does this have to do with sandwiches? Let us tell you.\n\nAdvertisement\n\nEver heard of panuozzo? Glasson is talking about panuozzo, a “pizza sandwich” that emerged in Naples in the 1980s. It takes pizza dough, bakes it and shapes it into a sandwich stuffed with fillings. Related Article These are the top 10 wine lists in south-east Queensland right now The traditional way (although we’re talking the ’80s here, so “tradition” is perhaps a relative term) to make panuozzo is to shape a typical Neapolitan pizza dough into an elongated roll, par-bake it, and then slice it open like a pita and stuff it full of ingredients, before giving it a second bake. The other way is more of a pizza wrap, where the cook stretches the dough, fills with hot ingredients, folds it for baking, and then reopens to add any cold ingredients before serving to the diner. This is what we’re talking about here, in East Brisbane, at Olli Italiano.\n\nAdvertisement\n\nOlli Italiano’s very Instagrammable lunch menu Olli Italiano is the product of Glasson and his partner, Anna Brobjer, who opened this cute as a button Italian restaurant in January. It sits on the corner of Lytton Road and Latrobe Street, an eye-catching bolthole presented in a smart white and scarlet paint job. Olli Italiano is a charming little restaurant in East Brisbane. Morgan Roberts Olli’s usual fare is keenly priced, homey pasta and pizza fronted by a menu of smaller plates such as meatballs, deep-fried lasagne and burrata. But Glasson and Brobjer wanted a way to make lunch more approachable for locals, hence the February-March (Glasson can’t remember exactly when) launch of a short menu of panuozzo. “We wanted something that people could come down and grab regularly, either in the restaurant or takeaway,” Glasson says. “And then we came across the idea off panuozzo and thought, ‘This is just perfect’.”\n\nAdvertisement\n\nOlli Italiano’s mortadella panuozzo There are six panuozzo on the menu. Glasson says the Diavola Dreams (tomato, fior di latte, rocket, nduja, hot salami, basil) and the Meatballs My Dear (pomodoro sauce, rocket, meatballs, shaved Parmesan, basil) are the bestsellers, but for us they play second (and third) fiddle to the first sanger on the list: the Mortadella Mi Bella. There’s a bunch of panuozzo on the lunch menu, but this mortadella number is the pick. Morgan Roberts Like so many great sandwiches, its beauty is in its simplicity. There’s mortadella supplied by Selecta Food Group that’s made by an Italian family in Melbourne, a fistful of springy rocket, gooey stracciatella from Byron Bay Mozzarella, and then a liberal sprinkle of pistachio, as much for texture as it is flavour. Simple, except it’s wrapped inside an almighty pizza base made with Italian 00 flour, filled with fior di latte and cooked fast at 350 degrees in the drop-door pizza oven out back, to produce a bubbly, crispy Neapolitan-ish crust. It’s then finished with a generous sprinkle of pecorino for a bit of seasoning. And that’s it.\n\nAdvertisement\n\nOlli Italiano co-owner Anna Brobjer. Morgan Roberts It makes for a luscious, deeply satisfying sandwich that’s as big as your face, yet easy to eat with one hand (after the chefs cut it in two, at least). I test this by demolishing it in the car on the way back to the office, rushing to address a deadline, conducting an interview on the way. There was hardly anything left for my coworkers upon my arrival. Sorry, gang. Where to get it The Mortadella Mi Bella is $17, making it crazy good value. You can get one daily 11.30am-3pm from Olli Italiano at 2/53 Lytton Road, East Brisbane.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Sandwich Watch\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/traveller/travel-news/port-guide-jakarta-indonesia-20251212-p5nn76.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Port Guide: Jakarta, Indonesia",
    "publish_date": "Fri, 12 Dec 2025 12:15:17 +1100",
    "category": "finance",
    "authors": [
      "Brian Johnston"
    ],
    "text": "This full-on, throbbing city isn’t for the fainthearted, but it does hide a softer historical core and dishes up great food.\n\nThe calmer Bogor and its Lake Gede – about an hour from Jakarta by fast train. iStock\n\nWho goes there Jakarta isn’t a major cruise destination, with Denpasar in Bali the busiest Indonesian cruise port. Even so, cruise lines such as AIDA, Azamara, Holland America Line, Oceania and Regent Seven Seas visit on South-East Asian cruises, world cruises or while relocating across Asia and towards Australia. Keep an eye on Malaysian company Star Cruises, which has previously offered short cruises from Jakarta on Star Voyager, formerly Pacific Explorer, which was operated by P&O Cruises Australia.\n\nSail on in Jakarta Bay is big and wide with nothing but a few minor islands as you sail in, although the size of passing container ships is astonishing. You’ll see Jakarta’s skyscrapers if the heat haze isn’t too fierce, but the waterfront is industrial, so you have no particular need to abandon the delights of a leisurely cruise breakfast.\n\nBerth rites Ships dock at Tanjung Priok, the industrial seaport 13 kilometres from downtown Jakarta or eight from Kota Tua. There are no notable facilities, and you’ll have to rely on your cruise-line shuttle to get into town, since there’s no convenient public transport and taxis aren’t allowed into the port. Leave yourself good time for the return as traffic after 3pm can be gridlocked.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/pm-reveals-rescue-deal-for-power-hungry-tomago-smelter-20251212-p5nn62.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "PM reveals rescue deal for power-hungry Tomago smelter",
    "publish_date": "Fri, 12 Dec 2025 12:15:01 +1100",
    "category": "finance",
    "authors": [
      "Nick Toscano",
      "Mike Foley"
    ],
    "text": "More than 1000 jobs at Australia’s biggest aluminium smelter have been secured, the Prime Minister has declared, announcing a deal with the owners that will ensure the plant operates beyond 2028.\n\nTomago’s owners had warned of imminent closure due to a doubling of energy costs when the current electricity contract expires in 2028.\n\nThe Tomago smelter has been facing an uncertain future with its power supply deal with AGL running out in 2028. Credit: Chris Elfes\n\nIt is understood the government has secured a deal, potentially worth billions of dollars, to supply power to the smelter via the Commonwealth-owned Snowy Hydro generation company.\n\n“All the workers here have a great Christmas and the knowledge that over coming months as a result of the decision that we have taken,” Albanese said at Tomago, near Newcastle, on Friday.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/highlights-from-the-2023-afcon-victoria-final-20251212-p5nn6i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Highlights from the 2023 AFCON Victoria final",
    "publish_date": "Fri, 12 Dec 2025 12:13:39 +1100",
    "category": "sports",
    "authors": [],
    "text": "Highlights from the 2023 AFCON Victoria final\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/after-a-tense-week-of-scrutiny-garbage-address-the-beach-ball-drama-at-palais-gig-20251212-p5nn5l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After a tense week of scrutiny, Garbage address the beach ball drama at Palais gig",
    "publish_date": "Fri, 12 Dec 2025 12:09:18 +1100",
    "category": "entertainment",
    "authors": [
      "Nadia Bailey"
    ],
    "text": "The incident went viral, as these things tend to, and for the last week, Manson has been the subject of intense scrutiny from the media. Her subsequent attempts to explain herself have not been particularly well-received. In the court of public opinion, Shirley Manson has been found guilty of d---head behaviour.\n\nOn the scale of one to truly egregious festival behaviour, this does not rate especially high – but for whatever reason, on this particular day, Garbage frontwoman Shirley Manson was incensed by it. She singled the man out . She called his actions disrespectful. She insulted his hat (“ridiculous”). She commented on the size of his penis (“small”).\n\nTo begin with, some backstory. On December 5, Garbage appeared at Good Things, the alternative music festival held annually in Melbourne, Sydney and Brisbane. Sometime during Garbage’s set, a festival-goer started tossing around an oversized, inflatable beach ball.\n\nAll of this is to say that the atmosphere going into the band’s headline show was slightly tense. Was Manson’s mood still sour? Would she – as Ryan Adams did a few months ago – write off her entire Australian fanbase? With the show at the Palais Theatre, one of the city’s few coastal live music venues, would the mere proximity to the beach trigger a stress response? And most urgently: would anyone try to smuggle in a beach ball?\n\nNo one tried to smuggle in a beach ball at Garbage’s Melbourne concert. Credit: Richard Clifford\n\nGarbage takes to the stage like a band that has something to prove. Manson performs with simmering, volatile energy, belting out songs from the recently released Let All That We Imagine Be the Light and hits from the band’s extensive back-catalogue (#1 Crush, Stupid Girl, Only Happy When It Rains) with equal aplomb.\n\nShe briefly addresses the media storm – saying that everything has context, that she has nothing but love for the true fans, and that she stands by her stance on beach balls – then moves on. What matters tonight is the music.\n\nOf course, the fans who attend headline shows are a different breed than those drawn to the festival circuit. They are here for this band, this music. No one is here to undermine a singer who has had to endure sexism, ageism, gruelling tour conditions, dwindling remuneration, increasing competition from AI-generated music and crippling, performance-induced injuries. The mood is generously supportive. There’s not a beach ball in sight.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/reddit-files-legal-challenge-to-teen-social-media-ban-midday-news-bulletin-12-december-2025/oiuz47f9s",
    "title": "Reddit files legal challenge to teen social media ban | Midday News Bulletin 12 December 2025",
    "publish_date": "Fri, 12 Dec 2025 01:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nReddit to challenge Australia's social media age ban in the High Court;\n\nThe United States to seize the oil from a confiscated Venezuelan tanker;\n\nSouth Africa beat India by 51 runs in the second T20 international.\n\nReddit has launched a legal challenge to Australia's world-leading ban on social media for under-16s.\n\n\n\n\n\nReddit is among 10 platforms included in the ban, which prescribes fines of $49.5 million if they fail to take reasonable steps to keep users under 16 off its site.\n\n\n\n\n\nBut the social media platform is asking the High Court to repeal the legislation, arguing it raises issues on privacy and political expression.\n\n\n\n\n\nThe platform also contends that the laws have created an illegal patchwork where some platforms are covered by the social media ban and others aren't.\n\n\n\n\n\n.\n\n\n\n\n\nFederal Health Minister Mark Butler is meeting his state and territory counterparts in Brisbane this afternoon, as the Albanese government tries to lock in a new five-year agreement for public hospital funding.\n\n\n\n\n\nThe nation's health ministers are pushing for a greater federal contribution to public hospitals, but Mark Butler says there won't be more money offered.\n\n\n\n\n\nThe states say the current offer is not enough, citing amongst other issues a report that has found up to one in 10 public hospital beds are being filled by patients needing accommodation in aged care and disability support.\n\n\n\n\n\nSouth Australian Health Minister Chris Picton says that's bad for patients and hospitals.\n\n\n\n\n\n\"The figures released today are stark. There are now over 3,000 Australians who are stuck in hospital waiting for federal aged care beds don't need to be in hospital. That's an absolute tragedy for those 3000 Australians that they're effectively homeless, stuck in our hospital system. It is also awful for other patients who need a hospital system for emergency care where there's both beds aren't available.\"\n\n\n\n\n\n.\n\n\n\n\n\nA tanker seized by US forces off the coast of Venezuela will be taken to a United States port so its cargo of oil can be confiscated.\n\n\n\n\n\nWhite House press secretary Karoline Leavitt says a US investigative team is currently onboard questioning the crew, as the US follows its forfeiture procedures.\n\n\n\n\n\nShe says the Justice Department obtained a warrant to take the tanker because they identified it as a vessel previously sanctioned for transporting Iranian oil on the black market.\n\n\n\n\n\n\"The Trump administration is executing on the President's sanction policies and the sanction policies of the United States and we're not going to stand by and watch sanctioned vessels sail the seas with black market oil, the proceeds of which will fuel narco-terrorism of rogue and illegitimate regimes around the world.\"\n\n\n\n\n\n.\n\n\n\n\n\nDozens of people have reportedly been killed in an airstrike on a hospital in Myanmar's western Rakhine state.\n\n\n\n\n\nRebel Arakan Army spokesman Khine Thu Kha says the hospital in the Mrauk U township was directly hit in the strike by Myanmar's ruling junta, completely destroying the facility and killing at least 30 people.\n\n\n\n\n\nUN human rights chief Volker Turk has said in a statement that such attacks may amount to a war crime.\n\n\n\n\n\nHe's calling for an investigation into what happened.\n\n\n\n\n\n.\n\n\n\n\n\nThe New South Wales government and opposition have finally struck a deal on changes to the state's workers compensation scheme, ending a months-long impasse.\n\n\n\n\n\nMore than 3.6 million workers in New South Wales are covered by the state-owned insurer, which services both the public and private sectors.\n\n\n\n\n\nTreasurer Daniel Mookhey had argued reform was necessary to keep the scheme sustainable, with psychological claims making up 12 per cent of workers' compensation claims and 38 per cent of the total cost.\n\n\n\n\n\nHe says the agreement means no-one will be worse off - and the government can do more to prevent injuries in the first place.\n\n\n\n\n\n\"Since this reform has begun we have passed the biggest shakeup to workplace health and safety laws in a generation. We've paired it with the biggest investment in workplace injury prevention for psychological injury in NSW history. And today we can confirm a compromise has been reached that will allow us to stabilise the workers compensation system as we get on with the job of making sure it remains fit for purpose.\"\n\n\n\n\n\n.\n\n\n\n\n\nFour men have been accused of orchestrating a daring heist in the ACT that netted an estimated $10 million worth of items.\n\n\n\n\n\nACT Police allege the four French nationals meticulously planned the daring robbery of the South Canberra home after arriving in the country on October 7, with one allegedly hiring a rental car that was seen numerous times in the area.\n\n\n\n\n\nDetective Assistant Inspector Mark Battye says the group allegedly stole items that included precious jewellery, rare watches, and luxury handbags.\n\n\n\n\n\nHe says it was a targeted and highly unusual raid.\n\n\n\n\n\n\"I've been doing this job for a long time. I've never seen a burglary of this magnitude occur here in Canberra. And the manner in which it occurred with people flying over from the other side of the world to do this targeted burglary is something like a movie. It's certainly something we don't see too often.\"\n\n\n\n\n\n.\n\n\n\n\n\nTo sport,\n\n\n\n\n\nSouth African opener Quinton de Kock has helped his team restore some pride in a 51-run win over India in the second T20 international.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 0
  },
  {
    "url": "https://www.sbs.com.au/news/article/fifa-world-cup-expensive-tickets/46lotkfap",
    "title": "'Extortionate': Why fans are calling for an 'immediate halt' to FIFA World Cup ticket sales",
    "publish_date": "Thu, 11 Dec 2025 21:58:18 +0000",
    "category": "sports",
    "authors": [],
    "text": "A football fans group is calling on FIFA to stop the sale of tickets for next year's World Cup due to the \"extortionate\" cost.\n\n\n\n\n\nAccording to Football Supporters Europe (FSE) — which represents fans across the continent — the tickets for the competition in the United States, Canada and Mexico, running between 11 June and 19 July, will cost almost five times more than the 2022 edition in Qatar.\n\n\n\n\n\n\"Football Supporters Europe is astonished by the extortionate ticket prices imposed by FIFA on the most dedicated supporters for next year's FIFA World Cup,\" the fan organisation said on Thursday.\n\n\n\nIt said that tickets allocated to national associations — typically distributed through official supporters' groups or loyalty programs to their most dedicated fans — were reaching \"astronomical\" levels.\n\n\n\n\n\n\"Based on the information currently available to FSE, if a supporter were to follow their team from the first match to the final... it would cost them a minimum of $6,900,\" the group said.\n\n\n\n\n\n\"We call on FIFA to immediately halt ticket sales, engage in a consultation with all impacted parties, and review ticket prices and category distribution until a solution that respects the tradition, universality, and cultural significance of the World Cup is found.\"\n\n\n\n\n\nFSE said World Cup organisers had promised much cheaper costs for the tournament, pointing to tickets priced from $21 in a bid document released in 2018.\n\n\n\n\n\n\"Where are these tickets now?\" it asked.\n\n\n\n\n\n\"The full way to the final, according to the same bid book, was supposed to cost $2,242 in the cheapest category. This promise is long gone.\"\n\n\n\nREAD MORE Who could the Socceroos play? What to know about the FIFA World Cup 2026 draw\n\nFor Australian viewers, the World Cup will kick off with the opening game between Mexico and South Africa in Mexico City on 12 June at 5am AEST.\n\n\n\n\n\nAustralia's Socceroos will face off on 14 June with the winners of a European playoff, followed by matches against the USA on 20 June and Paraguay on 25 June.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/time-magazine-architects-of-ai-person-of-the-year/9vdhlhfd2",
    "title": "Time magazine names 'Architects of AI' as Person of the Year. Here's who's pictured",
    "publish_date": "Thu, 11 Dec 2025 20:15:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "Time magazine has named the \"Architects of AI\" as its Person of the Year, highlighting the US tech titans whose work on artificial intelligence is transforming the world.\n\n\n\n\n\nNvidia's Jensen Huang, OpenAI's Sam Altman and xAI's Elon Musk are among the innovators who have \"grabbed the wheel of history, developing technology and making decisions that are reshaping the information landscape, the climate, and our livelihoods,\" Time wrote.\n\n\n\n\n\nOne of two covers of the magazine is a homage to the famous 1932 photograph of ironworkers casually eating lunch on a steel beam above New York City.\n\n\n\n\n\nIn the Time illustration, sitting astride the city are Meta's Mark Zuckerberg, AMD chief Lisa Su, Musk, Huang, Altman as well as Google's AI boss Demis Hassabis, Anthropic's Dario Amodei and Stanford professor Fei-Fei Li.\n\n\n\n\"Racing both beside and against each other, they placed multibillion-dollar bets on one of the biggest physical infrastructure projects of all time,\" the magazine said of the group overnight.\n\n\n\n\n\n\"They reoriented government policy, altered geopolitical rivalries, and brought robots into homes. AI emerged as arguably the most consequential tool in great-power competition since the advent of nuclear weapons.\"\n\n\n\n\n\nAlongside popular AI models such as ChatGPT and Claude, Time credited investors such SoftBank CEO Masayoshi Son, who has plunged billions of dollars into the technology.\n\n\n\n\n\nTime is among many media outlets partnering with AI firms to license content and develop new tools.\n\n\n\n\n\nIn June 2024 it signed a multi-year content deal with OpenAI that gave the ChatGPT maker access to its archived news content. In response to user queries, the chatbot cites and links back to the source on Time.com.\n\n\n\n\n\nTime's Person of the Year selection is an acknowledgement of the year's most influential figure.\n\n\n\n\n\nThe title last year went to US President Donald Trump. Others have included singer Taylor Swift and Ukrainian leader Volodymyr Zelenskyy.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 1
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/joyce-to-the-world-our-big-political-christmas-wrap-up/pdiauafkk",
    "title": "Joyce to the world: Our big Political Christmas wrap up",
    "publish_date": "Thu, 11 Dec 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/video/the-effects-of-australias-world-first-social-media-ban-are-being-closely-watched-around-the-world/p3xahq7k7",
    "title": "The effects of Australia's world first social media ban are being closely watched around the world",
    "publish_date": "Thu, 11 Dec 2025 08:38:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "The effects of Australia's world first social media ban are being closely watched around the world\n\nPublished 11 December 2025, 6:03 am\n\nThe eyes of the world are upon Australia as the outcomes of the social media ban begin coming to light. Already, some cracks have emerged with some under-16's saying they bypassed age verifications on banned platforms. Data on exactly how many accounts have been banned is still unclear.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/video/new-indigenous-protected-area-spanning-tiwi-islands-added-to-national-parks-and-reserves-system/ln7qwe06a",
    "title": "New Indigenous Protected Area spanning Tiwi Islands added to national parks and reserves system",
    "publish_date": "Thu, 11 Dec 2025 08:35:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "New Indigenous Protected Area spanning Tiwi Islands added to national parks and reserves system\n\nPublished 11 December 2025, 6:02 am\n\nIn a major milestone for Traditional Owners in Australia's Top End more than 700,000 hectares of land has been added to the national parks and reserves system. The new Indigenous Protected Area spanning across the Tiwi Islands is expected to not only help meet environmental commitments but also provide benefits to local communities through education and employment pathways.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/us-cuts-rates-as-australias-economy-loses-jobs/aspwx03e8",
    "title": "US cuts rates as Australia's economy loses jobs",
    "publish_date": "Thu, 11 Dec 2025 06:55:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "And you can find more On the Money podcasts by subscribing to On the Money\n\nhere\n\n, or wherever you get your podcasts.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/drc-the-thai-cambodia-border-wars-syria-a-year-after-assad-trump-finally-gets-his-peace-prize-sort-of/nppn7du3w",
    "title": "DRC & the Thai-Cambodia border wars, Syria a year after Assad & Trump finally gets his peace prize... sort of",
    "publish_date": "Thu, 11 Dec 2025 06:17:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/politics/federal/ley-plans-to-slash-refugee-intake-in-coalition-migration-policy-20251211-p5nmxx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Libs consider slashing refugee intake in Coalition migration policy",
    "publish_date": "Fri, 12 Dec 2025 13:05:21 +1100",
    "category": "finance",
    "authors": [
      "Paul Sakkal"
    ],
    "text": "Senior MPs want the opposition to cut by thousands the number of refugees Australia brings into the country as she searches for ways to drive down the overall inflow of migrants, but others in the party have opposed the move because it would cast the party as heartless.\n\nShadow ministers working on the migration policy, which is expected to be made public next week, said one way to drive down refugee numbers from the current 20,000, say sources familiar with the plan but not permitted to talk about it publicly.\n\nOpposition Leader Sussan Ley and home affairs spokesman Jonno Duniam. Credit: Dominic Lorrimer\n\nThe party has not settled on the amount by which it would cut the humanitarian intake, but it could be by as many as 5000 or 10,000, sources said, which the opposition will contrast with the intention spelt out in Labor’s national platform to raise the number to 27,000 over time.\n\nThe Albanese government is unlikely to boost the number so high because the migration program as well as housing and settlement services are already stretched.",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-albanese-continues-to-shirk-responsibility-for-parliamentary-expenses-saga-illicit-tobacco-market-costing-taxpayers-11-8-billion-government-report-finds-20251212-p5nn23.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Albanese shirks responsibility for parliamentary expenses saga; Health minister meeting state counterparts over funding as ‘bed-block crisis’ plagues hospitals and aged care",
    "publish_date": "Fri, 12 Dec 2025 13:01:42 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine",
      "Isabel Mcmillan"
    ],
    "text": "The Greens have criticised the government for opening new ocean acreage for oil and gas companies to bid for exploratory drilling rights off the coast of Victoria.\n\nYesterday, Resources Minister Madeleine King unveiled five areas that would be opened for bidding in the Otway Basin.\n\n“Exploration and new discoveries will play an important role in underpinning our energy needs and support Australian industry and households,” she said.\n\nThe areas indicated in red on the map show the new ocean acreage the government has released for oil and gas companies to make bids for exploratory fossil fuel drilling off the coast of Victoria. Credit: Department of Industry, Science and Resources\n\nThe releases won support from energy producers and major gas users across the manufacturing sector who say that unlocking greater supplies of the fossil fuel is needed to head off shortages and price spikes in Victoria and NSW, but they have angered conservation groups who fear the impact that more gas drilling will have on the marine environment, climate change and global warming.\n\nGreens spokesperson for healthy oceans Senator Peter Whish-Wilson said in a statement today:\n\n“Labor’s two-faced climate act is wearing thin. How on earth is ripping open new gas fields for fossil fuel companies to plunder, pollute and profit from in a time of climate emergency consistent with transitioning to a clean energy future?\n\n“Australia has decades of gas left in our proven reserves system. There is no need to put marine wildlife and livelihoods that depend on healthy oceans at risk by using destructive methods to search for new gas fields.”",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/neighbours-ends-again-not-with-a-bang-but-a-whimper-20251212-p5nn6g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Neighbours ends – again – not with a bang, but a whimper",
    "publish_date": "Fri, 12 Dec 2025 13:00:30 +1100",
    "category": "finance",
    "authors": [
      "Louise Rugendyke"
    ],
    "text": "It all ended with a small act of resistance. A quiet show of defiance by Susan Kennedy (Jackie Woodburne), keen to fight for the future of Ramsay Street, when all around her has changed.\n\n“I love Ramsay Street, I love our friends, I love our neighbours,” she said, while standing in the world’s most cursed cul-de-sac, flanked by the ever shifty Paul Robinson (Stefan Dennis) and her husband, Dr Karl (Alan Fletcher). “I don’t want to find a new perfect blend, I want to stay in this one.”\n\nSusan Kennedy (Jackie Woodburne) contemplates the end of Ramsay Street.\n\nCue the drone camera, swooping up over Erinsborough, and that was it. Done. Finished. After 9363 episodes, Neighbours was officially over. Not bulldozed by a freeway, but instead flattened by the streaming giant Amazon after its two-year-long resurrection.\n\nThe duelling visions of Ramsay Hills and Robinson Towers will remain a dream; we’ll never know if Paul’s city-living utopia, of “a latte by the Yarra” will ever be; or if Shane Robinson’s bucolic vision – complete with Kennedy Street – will eventuate.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/politics/federal/butler-flags-potential-travel-expense-reform-pending-wells-investigation-20251212-p5nn2p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "PM says he has asked for advice on expense rules",
    "publish_date": "Fri, 12 Dec 2025 12:59:51 +1100",
    "category": "sports",
    "authors": [
      "Brittany Busch"
    ],
    "text": "Prime Minister Anthony Albanese says he has asked Parliament’s expenses watchdog for advice on the expense rules as Opposition Leader Sussan Ley calls for Sport and Communications Minister Anika Wells to resign if the prime minister won’t declare she has abided by the ministerial code of conduct.\n\nIn a letter to Albanese, Ley demanded Wells be investigated by the prime ministerial department over her use of family travel entitlements, which Wells has used to fly her husband to successive premiere sporting events and their children to Thredbo for a ski trip.\n\nSports Minister Anika Wells and Prime Minister Anthony Albanese in Canberra on Thursday. Credit: Alex Ellinghausen\n\nLey said she also offered to sit down with Albanese to hash out bipartisan reforms to restore public trust in the entitlement system.\n\n“What Minister Anika Wells has done is clearly scandalous, and the whole country is reeling from all of the information that they’ve received about what she has done. She has not shown an ounce of contrition. She has not stepped up and said sorry, or she understands what struggling Australians are going through,” Ley told Sky News.",
    "source": "TheAge",
    "cluster_id": 5
  },
  {
    "url": "https://www.theage.com.au/national/tiger-shark-caught-off-rainbow-bay-on-gold-coast-20251212-p5nn8h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tiger shark caught off Rainbow Bay on Gold Coast",
    "publish_date": "Fri, 12 Dec 2025 12:58:13 +1100",
    "category": "finance",
    "authors": [],
    "text": "Tiger shark caught off Rainbow Bay on Gold Coast\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/politics/queensland/teachers-union-takes-special-school-funding-fight-to-industrial-court-20251211-p5nmuh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Teachers union takes special school funding fight to industrial court",
    "publish_date": "Fri, 12 Dec 2025 12:50:17 +1100",
    "category": "finance",
    "authors": [
      "Matt Dennien"
    ],
    "text": "Queensland teachers have escalated a year-long fight with the education department over special school funding reductions, filing a formal dispute in the state’s industrial commission.\n\nThe Queensland Teachers’ Union lodged paperwork last week to have the Queensland Industrial Relations Commission mediate the matter the groups have been unable to resolve.\n\nIt comes as the Crisafulli government embarks on what it has called the largest special school investment in the state’s history, with six new schools to be built or opened from 2027.\n\nRed Hill Special School is one of 46 state special schools across Queensland – all of which are said to have been impacted by the changes. Credit: Red Hill Special School\n\nThe dispute stems from a new model for giving mainstream and special state schools extra teachers and teacher aides to support more than 106,000 students with disability, which was rolled out this year.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/culture/books/state-library-abandons-controversial-restructure-plan-20251210-p5nmm6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "State Library abandons controversial restructure plan",
    "publish_date": "Fri, 12 Dec 2025 12:42:16 +1100",
    "category": "finance",
    "authors": [
      "Kerrie O'Brien"
    ],
    "text": "State Library Victoria has abandoned a proposed restructure after an outcry against it from staff, their union and hundreds of Australia’s most prominent writers and academics.\n\nThe Age revealed in November that library employees had been told the proposed changes included cutting the number of reference librarians from 25 to 10, scrapping other key public-facing roles, introducing new digital roles at the expense of core business, and significantly reducing the number of computers available to the public.\n\nThe library claimed its proposal had been misrepresented in media reports.\n\nChristine Christian, outgoing chair of the State Library Victoria board. Credit: Susan Gordon-Brown\n\n“After careful consideration of the feedback that we received during the entire consultation process – since September – we’ve decided to withdraw the reorganisation proposal,” Christine Christian, outgoing chair of the library’s board, told The Age.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Simon Letch",
    "publish_date": "Fri, 12 Dec 2025 12:27:16 +1100",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Simon Letch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Fri, 12 Dec 2025 12:24:33 +1100",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/storm-star-admits-hes-in-the-sights-of-perth-bears-20251212-p5nn7g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Storm star admits he’s in the sights of Perth Bears",
    "publish_date": "Fri, 12 Dec 2025 12:20:29 +1100",
    "category": "sports",
    "authors": [],
    "text": "Whether his long-term future is in Perth or remaining in Melbourne, Nick Meaney’s short-term plans are to play in the centres rather than chase the Storm’s vacant fullback jersey.\n\nNick Meaney has been in talks to join the Perth Bears NRL side. Credit: Getty Images\n\nRyan Papenhuyzen’s shock off-season departure, walking away from his contract with a year to run, means the Storm will have at least one change to their first-choice backline in 2026.\n\nBut Meaney, who admitted he has been in talks with incoming NRL club Perth, is content to stay put in the centres, plumping for excitement machine Sua Fa’alogo to wear the No.1 jersey.\n\n“We’ve got Sua there and he’s a very handy football player,” the 28-year-old said on Friday.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/goodfood/brisbane-eating-out/you-need-to-eat-this-mortadella-pizza-sanger-that-s-as-big-as-your-face-20251210-p5nmic.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "You need to eat this mortadella pizza sanger that’s as big as your face",
    "publish_date": "Fri, 12 Dec 2025 12:19:06 +1100",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nEating outSandwich Watch You need to eat this mortadella pizza sanger that’s as big as your face It’s luscious, deeply satisfying and, at $17, crazy good value. Matt Shea December 12, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThe secret to a great sandwich? Just about any chef will tell you it’s the freshness of the bread. And as far as Tim Glasson is concerned, it doesn’t get much fresher than pizza dough freshly baked from the oven. Olli Italiano’s Panuozzo are huge, and therefore excellent value. Morgan Roberts “We stretch and bake the dough to order, so it literally can’t be more fresh,” Glasson says. “That’s a big part of the appeal of what we do.” But what does this have to do with sandwiches? Let us tell you.\n\nAdvertisement\n\nEver heard of panuozzo? Glasson is talking about panuozzo, a “pizza sandwich” that emerged in Naples in the 1980s. It takes pizza dough, bakes it and shapes it into a sandwich stuffed with fillings. Related Article These are the top 10 wine lists in south-east Queensland right now The traditional way (although we’re talking the ’80s here, so “tradition” is perhaps a relative term) to make panuozzo is to shape a typical Neapolitan pizza dough into an elongated roll, par-bake it, and then slice it open like a pita and stuff it full of ingredients, before giving it a second bake. The other way is more of a pizza wrap, where the cook stretches the dough, fills with hot ingredients, folds it for baking, and then reopens to add any cold ingredients before serving to the diner. This is what we’re talking about here, in East Brisbane, at Olli Italiano.\n\nAdvertisement\n\nOlli Italiano’s very Instagrammable lunch menu Olli Italiano is the product of Glasson and his partner, Anna Brobjer, who opened this cute as a button Italian restaurant in January. It sits on the corner of Lytton Road and Latrobe Street, an eye-catching bolthole presented in a smart white and scarlet paint job. Olli Italiano is a charming little restaurant in East Brisbane. Morgan Roberts Olli’s usual fare is keenly priced, homey pasta and pizza fronted by a menu of smaller plates such as meatballs, deep-fried lasagne and burrata. But Glasson and Brobjer wanted a way to make lunch more approachable for locals, hence the February-March (Glasson can’t remember exactly when) launch of a short menu of panuozzo. “We wanted something that people could come down and grab regularly, either in the restaurant or takeaway,” Glasson says. “And then we came across the idea off panuozzo and thought, ‘This is just perfect’.”\n\nAdvertisement\n\nOlli Italiano’s mortadella panuozzo There are six panuozzo on the menu. Glasson says the Diavola Dreams (tomato, fior di latte, rocket, nduja, hot salami, basil) and the Meatballs My Dear (pomodoro sauce, rocket, meatballs, shaved Parmesan, basil) are the bestsellers, but for us they play second (and third) fiddle to the first sanger on the list: the Mortadella Mi Bella. There’s a bunch of panuozzo on the lunch menu, but this mortadella number is the pick. Morgan Roberts Like so many great sandwiches, its beauty is in its simplicity. There’s mortadella supplied by Selecta Food Group that’s made by an Italian family in Melbourne, a fistful of springy rocket, gooey stracciatella from Byron Bay Mozzarella, and then a liberal sprinkle of pistachio, as much for texture as it is flavour. Simple, except it’s wrapped inside an almighty pizza base made with Italian 00 flour, filled with fior di latte and cooked fast at 350 degrees in the drop-door pizza oven out back, to produce a bubbly, crispy Neapolitan-ish crust. It’s then finished with a generous sprinkle of pecorino for a bit of seasoning. And that’s it.\n\nAdvertisement\n\nOlli Italiano co-owner Anna Brobjer. Morgan Roberts It makes for a luscious, deeply satisfying sandwich that’s as big as your face, yet easy to eat with one hand (after the chefs cut it in two, at least). I test this by demolishing it in the car on the way back to the office, rushing to address a deadline, conducting an interview on the way. There was hardly anything left for my coworkers upon my arrival. Sorry, gang. Where to get it The Mortadella Mi Bella is $17, making it crazy good value. You can get one daily 11.30am-3pm from Olli Italiano at 2/53 Lytton Road, East Brisbane.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Sandwich Watch\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/traveller/travel-news/port-guide-jakarta-indonesia-20251212-p5nn76.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Port Guide: Jakarta, Indonesia",
    "publish_date": "Fri, 12 Dec 2025 12:15:17 +1100",
    "category": "finance",
    "authors": [
      "Brian Johnston"
    ],
    "text": "This full-on, throbbing city isn’t for the fainthearted, but it does hide a softer historical core and dishes up great food.\n\nThe calmer Bogor and its Lake Gede – about an hour from Jakarta by fast train. iStock\n\nWho goes there Jakarta isn’t a major cruise destination, with Denpasar in Bali the busiest Indonesian cruise port. Even so, cruise lines such as AIDA, Azamara, Holland America Line, Oceania and Regent Seven Seas visit on South-East Asian cruises, world cruises or while relocating across Asia and towards Australia. Keep an eye on Malaysian company Star Cruises, which has previously offered short cruises from Jakarta on Star Voyager, formerly Pacific Explorer, which was operated by P&O Cruises Australia.\n\nSail on in Jakarta Bay is big and wide with nothing but a few minor islands as you sail in, although the size of passing container ships is astonishing. You’ll see Jakarta’s skyscrapers if the heat haze isn’t too fierce, but the waterfront is industrial, so you have no particular need to abandon the delights of a leisurely cruise breakfast.\n\nBerth rites Ships dock at Tanjung Priok, the industrial seaport 13 kilometres from downtown Jakarta or eight from Kota Tua. There are no notable facilities, and you’ll have to rely on your cruise-line shuttle to get into town, since there’s no convenient public transport and taxis aren’t allowed into the port. Leave yourself good time for the return as traffic after 3pm can be gridlocked.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/pm-reveals-rescue-deal-for-power-hungry-tomago-smelter-20251212-p5nn62.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "PM reveals rescue deal for power-hungry Tomago smelter",
    "publish_date": "Fri, 12 Dec 2025 12:15:01 +1100",
    "category": "finance",
    "authors": [
      "Nick Toscano",
      "Mike Foley"
    ],
    "text": "More than 1000 jobs at Australia’s biggest aluminium smelter have been secured, the Prime Minister has declared, announcing a deal with the owners that will ensure the plant operates beyond 2028.\n\nTomago’s owners had warned of imminent closure due to a doubling of energy costs when the current electricity contract expires in 2028.\n\nThe Tomago smelter has been facing an uncertain future with its power supply deal with AGL running out in 2028. Credit: Chris Elfes\n\nIt is understood the government has secured a deal, potentially worth billions of dollars, to supply power to the smelter via the Commonwealth-owned Snowy Hydro generation company.\n\n“All the workers here have a great Christmas and the knowledge that over coming months as a result of the decision that we have taken,” Albanese said at Tomago, near Newcastle, on Friday.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/highlights-from-the-2023-afcon-victoria-final-20251212-p5nn6i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Highlights from the 2023 AFCON Victoria final",
    "publish_date": "Fri, 12 Dec 2025 12:13:39 +1100",
    "category": "sports",
    "authors": [],
    "text": "Highlights from the 2023 AFCON Victoria final\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/after-a-tense-week-of-scrutiny-garbage-address-the-beach-ball-drama-at-palais-gig-20251212-p5nn5l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After a tense week of scrutiny, Garbage address the beach ball drama at Palais gig",
    "publish_date": "Fri, 12 Dec 2025 12:09:18 +1100",
    "category": "entertainment",
    "authors": [
      "Nadia Bailey"
    ],
    "text": "The incident went viral, as these things tend to, and for the last week, Manson has been the subject of intense scrutiny from the media. Her subsequent attempts to explain herself have not been particularly well-received. In the court of public opinion, Shirley Manson has been found guilty of d---head behaviour.\n\nOn the scale of one to truly egregious festival behaviour, this does not rate especially high – but for whatever reason, on this particular day, Garbage frontwoman Shirley Manson was incensed by it. She singled the man out . She called his actions disrespectful. She insulted his hat (“ridiculous”). She commented on the size of his penis (“small”).\n\nTo begin with, some backstory. On December 5, Garbage appeared at Good Things, the alternative music festival held annually in Melbourne, Sydney and Brisbane. Sometime during Garbage’s set, a festival-goer started tossing around an oversized, inflatable beach ball.\n\nAll of this is to say that the atmosphere going into the band’s headline show was slightly tense. Was Manson’s mood still sour? Would she – as Ryan Adams did a few months ago – write off her entire Australian fanbase? With the show at the Palais Theatre, one of the city’s few coastal live music venues, would the mere proximity to the beach trigger a stress response? And most urgently: would anyone try to smuggle in a beach ball?\n\nNo one tried to smuggle in a beach ball at Garbage’s Melbourne concert. Credit: Richard Clifford\n\nGarbage takes to the stage like a band that has something to prove. Manson performs with simmering, volatile energy, belting out songs from the recently released Let All That We Imagine Be the Light and hits from the band’s extensive back-catalogue (#1 Crush, Stupid Girl, Only Happy When It Rains) with equal aplomb.\n\nShe briefly addresses the media storm – saying that everything has context, that she has nothing but love for the true fans, and that she stands by her stance on beach balls – then moves on. What matters tonight is the music.\n\nOf course, the fans who attend headline shows are a different breed than those drawn to the festival circuit. They are here for this band, this music. No one is here to undermine a singer who has had to endure sexism, ageism, gruelling tour conditions, dwindling remuneration, increasing competition from AI-generated music and crippling, performance-induced injuries. The mood is generously supportive. There’s not a beach ball in sight.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://au.finance.yahoo.com/news/major-smelters-future-secured-taxpayer-015249810.html",
    "title": "Major smelter's future secured after taxpayer bailout",
    "publish_date": "2025-12-12T01:52:49Z",
    "category": "finance",
    "authors": [
      "Jacob Shteyman",
      "Thu December At Pm",
      "Min Read"
    ],
    "text": "More than 1000 jobs at a troubled aluminium smelter have been secured after the federal government stepped in to keep it running with taxpayer support.\n\nRio Tinto, majority owner of the massive Tomago smelter near Newcastle, had for months been threatening to shut down the plant due to spiralling energy costs.\n\nBut on Friday, the government announced it had come to an agreement with the minerals giant to keep Tomago running after promising to use taxpayer funding to provide the smelter with cheaper power.\n\n\"It's important we as a nation continue to make things here, and the program that we've been working on to ensure that long term future, by giving security going forward,\" Prime Minister Anthony Albanese said as he announced the deal.\n\nThe Tomago smelter near Newcastle produces more than a third of Australia's aluminium. (Michael Gorton/AAP PHOTOS)\n\nThe full details of the arrangements are yet to be revealed but will also involve the NSW government providing support and will underwrite new renewable energy generation, storage and transmission projects.\n\nThe total cost was yet to be agreed to, Industry Minister Tim Ayres said.\n\nTomago produces more than a third of Australia's aluminium.\n\nElectricity makes up 40 per cent of operating costs at Tomago, which began production in 1983 and delivers up to 590,000 tonnes of aluminium a year.\n\nThe smelter is the single largest electricity user in the nation and consumes about 10 per cent of power supplies in NSW.\n\nThe Australian Workers' Union welcomed the announcement\n\n\"This is a pivotal moment for Australian manufacturing,\" AWU national secretary Paul Farrow said.\n\n\"For months we've been saying that Tomago isn't just another industrial site. It's the test case for whether Australia is serious about having a manufacturing future.\"\n\nThe announcement comes after a flurry of deals struck by the federal government to keep smelters running across the nation as rising energy costs threatened their sustainability.\n\nIn October, the federal and Queensland governments agreed on a $600 million joint support package for a copper smelter in Mt Isa.\n\nA few months prior, the Commonwealth, South Australian and Tasmanian governments stumped up $135 million in taxpayer funds to keep Nyrstar lead and zinc smelters operating, with part of the funding going to expand production into critical minerals such as antimony.\n\nRio Tinto has been contacted for comment.",
    "source": "Yahoo",
    "cluster_id": 25
  },
  {
    "url": "https://au.news.yahoo.com/major-higgins-bankruptcy-case-013820744.html",
    "title": "Major update on Higgins bankruptcy case",
    "publish_date": "2025-12-12T01:45:09Z",
    "category": "finance",
    "authors": [],
    "text": "A snap judgment hearing in Brittany Higgins’ bankruptcy proceeding has been called by the Federal Court.\n\nMs Higgins is being pursued by her former boss Linda Reynolds for hundreds of thousands of dollars after she was successfully sued for defamation, alongside her husband David Sharaz.\n\nThe pair made a series of social media posts that were critical of how Ms Reynolds handled Ms Higgins’ allegation that she was raped by a former colleague Bruce Lehrmann in her office at Parliament House, an allegation he continues to deny.\n\nBrittany Higgins is being pursued for hundreds of thousands of dollars in the Federal Court by former senator Linda Reynolds, who won a defamation case against her junior staffer. Picture: NewsWire / Sharon Smith\n\nJustice Paul Tottle ruled the posts were mostly defamatory of Ms Reynolds, awarding the former senator $341,000 plus legal costs thought to be in excess of $1m.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe also found Ms Higgins had been untruthful about Ms Reynolds being involved in a cover-up of her allegations, a finding that vindicated the former senator.\n\nBankruptcy proceedings were adjourned on Monday to allow Justice Michael Feutrill to consider whether Ms Higgins could be served a creditor’s petition by email rather than in person, which would set a precedent in the Federal Court.\n\nPERTH, AUSTRALIA – NewsWire Photos – SEPTEMBER 4, 2024: Senator Linda Reynolds arrives at the Supreme Court for a defamation trial against her former staffer Brittany Higgins in Perth Picture: NewsWire / Sharon Smith\n\nMs Reynolds is trying to recover the debt from her defamation win and have a trustee appointed to the case to find out what assets Ms Higgins owns and what money is held in the Brittany Higgins Protective Trust.\n\nThe trust that was created after Ms Higgins was awarded $2.4m in compensation by the Commonwealth in response to her allegations.\n\nMore to come.",
    "source": "Yahoo",
    "cluster_id": 33
  }
]