[
  {
    "url": "https://www.9news.com.au/national/third-places/33e306bb-1b43-4859-8d6c-7f4a1ec06510",
    "title": "What are third places, and are they disappearing or just changing?",
    "publish_date": "Wed, 24 Dec 2025 19:57:51 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Chances are you've been to a third place at least once in your life and didn't even realise.\n\nEssentially public lounge rooms, they are social environments separate from home (first place) and work (second place).\n\nAnd while many believe they're essential, some experts say they're becoming a lot more scarce. So what are they, and are they going anywhere? ﻿\n\nA third place could be anywhere from a coffee shop to a park. (Sydney Morning Herald)\n\nThe term \"third place\" was coined in the 1990s by ﻿sociologist Ray Oldenburg as work hours began to increase.﻿\n\nHe argued that as life became busier and more secluded, these places became vital for democracy, engagement and a sense of place amongst the broader community.﻿\n\nThe main criteria for a spot to be a third place are pretty simple: it needs to be a neutral area that is easily accessible to and comfortable for the public.\n\nIts main purpose is for people to gather and socialise, fostering a sense of community and conversation. ﻿\n\nREAD MORE: Three words this CEO swears will help you land a better job ﻿\n\nThe main purpose of third spaces are to foster a sense of community with strangers. (Getty)\n\nIn a traditional sense, a third space can be anywhere from a coffee shop to a park to a library.\n\n\"Shopping centres are considered third spaces,\" creative producer at youth arts organisation OutLoud Nicole Issa said.\n\n\"Even though some people might not like it to be, it's the truth.\"\n\nShe says third places are important for social connections, particularly amongst young adults.\n\nShe also thinks they're dying out.﻿\n\n\"One thing that I'm hearing a lot from young people is that there is a need for third spaces and there's a need for safe places for young people to go,\" she said.\n\n﻿\"I think it's been a gradual thing. The biggest, major event that has changed the way young people use third space was definitely COVID...\n\nMany believe that shopping centres are also considered third place. (JOE ARMAO)\n\n\"There was like strict legislation that came in that prevented people from going to social events or even meeting up with other people, which then, in turn, just changed people's patterns.\"\n\nHowever, unlike Issa, University of Melbourne Chair of Architecture and Urban Design Kim Dovey does not believe that third spaces are dying, but rather that they never existed in Australia to begin with.\n\n﻿\"The concept of the third place is an American thing,\" he said.\n\n\"It sort of came out of that kind of social capital literature.\n\n\"These places are important because they're where we establish what are often known as weak ties.\n\n\"You make new friends and acquaintances, and you get to know your neighbourhood and your neighbours a bit more and people you wouldn't normally run into.\n\n\"In so many parts of the world, it's just normal everyday life. It didn't really need a name.\"\n\nThe emergence of social media has allowed for the growth of digital third places. (Getty)\n\nIn his literature, Ray Oldenburg argued that a place outside of work and home is crucial for public wellbeing.\n\n\"What suburbia cries for are the means for people to gather easily, inexpensively, regularly, and pleasurably - a 'place on the corner',\" he said.\n\nWhile brick-and-mortar shopping centres filled that need for decades, the rise of online shopping has meant people are spending less time at physical stores.\n\nThe internet – particularly social media – is a double-edged sword here. While it's given rise to digital third places, it's limited the way that people interact in public.\n\n\"I hate having to get out of the way of people who are reading their phone as they walk down the street, they're not actually present in the street,\" Professor Kim Dovey said.\n\n\"Cities work by putting lots of people you don't know into the same space that you share, and you weave in and out of each other and on busy pedestrian sidewalks.\"\n\n\"And that's how cities work, so I think social media is a threat to that.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/christmas-trading-hours-2025-what-stores-are-open-during-holiday-period/18546031-384b-4039-9b0f-a2b3f1db26b5",
    "title": "What's shutting down and staying open from today until the new year",
    "publish_date": "Wed, 24 Dec 2025 21:23:37 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "The Christmas retail season is finally here, with one day of last-minute shopping before the big day.\n\nDepending on where you want to pick up your goods over the next few days though, you might be out of luck.﻿\n\nHere is who is and who isn't open on Christmas Day, Boxing Day and New Year's . ﻿\n\nREAD MORE: ﻿ What Christmas Day weather will be like in your city\n\nWestfield\n\nWestfield shopping centres will be closed on Christmas Day.\n\nFor the rest of the holiday period, they will be mostly open with varying trading hours.﻿\n\nChristmas Eve (December 24)﻿\n\nMost Westfield centres will be open until 5pm or 6pm the night before Christmas.\n\nChristmas Day﻿ (December 25)\n\nAll stores will be closed.\n\nBoxing Day (December 26)\n\nAcross the Public Holidays, stores will reopen, with some open until 9pm.\n\nNew Year's Eve (December 31)\n\nOpening hours vary by store, customers are ﻿being encouraged to check the Westfield website for trading hours.\n\nNew Year's Day ﻿(January 1)\n\nWestfield centres will open with reduced public holiday hours in all states, except South Australia, where they will be closed.\n\nWestfield shopping centres will be closed on Christmas Day. (iStock)\n\nColes\n\nAll Coles stores will be shut on Christmas Day and open on other days, with specific hours varying by store. Coles stores will be open on Christmas Eve.\n\nHere is the state and territory breakdown for Coles:\n\nChristmas Eve (December 24)\n\nAll Coles stores will be open on Christmas Eve.﻿\n\n﻿Christmas Day (December 25)\n\nAll Coles stores will be closed in all states and territories on Christmas Day.\n\nBoxing Day (December 26)\n\nAll Coles stores except some in South Australia will be open.\n\nIn South Australia, all metropolitan stores are closed, and all regional stores are open from 8pm to 8am.\n\nNew Year's Day (January 1)\n\nAll Coles stores will be open in all states and territories except for SA.\n\nIn South Australia, all metropolitan stores are closed, and all regional stores will be open.\n\nREAD MORE: When double demerits apply over Christmas and New Year in every state and territory\n\nAll Coles stores will be open on Christmas Eve.﻿ (Nine)\n\nWoolworths\n\nChristmas Eve (December 24)\n\nAll Woolworths stores will be open on Christmas Eve.﻿\n\nChristmas Day (December 25)\n\nAll Woolworths stores will be closed in all states and territories on Christmas Day.\n\nBoxing Day (December 26)﻿\n\nAll stores in New South Wales, Canberra, Victoria, Queensland, Western Australia, and Tasmania will be open.\n\nSome stores in South Australia and the Northern Territory will not be open.\n\nCustomers are ﻿being told to check the Woolworths website for local trading hours.\n\nNew Year's Eve (December 31)\n\nAll Woolworths stores will be open on New Year's Eve.﻿\n\nNew Year's Day (January 1)﻿\n\nAll stores in New South Wales, Canberra, Victoria, Queensland, Western Australia, except Northam, and Tasmania will be open.\n\nSome stores in South Australia and the Northern Territory will not be open.\n\nCustomers are ﻿being encouraged to check the Woolworths website for local trading hours.\n\nAll Woolworths stores will be open on New Year's Eve.﻿ (Getty)\n\nTarget\n\n﻿You﻿ can search for your local Target's trading hours over the holidays here.\n\nAll stores are closed on Christmas Day.\n\nKmart﻿\n\nYou﻿ can search for your local Kmart's trading hours over the holidays here.\n\nAll stores are closed on Christmas Day.\n\nBunnings﻿ Warehouse\n\nBunnings trading hours will vary across the country, with some extending and restricting trade in the days leading up to the Christmas period. ﻿\n\nChristmas Eve (December 24)\n\nAll Bunnings stores will be open on Christmas Eve, however, trading hours will vary. ﻿\n\nChristmas Day (December 25)\n\nAll Bunnings stores will be closed on Christmas Day.\n\nBoxing Day (December 26)\n\nTrading hours at Bunnings warehouses and small format stores will vary between Boxing Day and Friday, 2 January.\n\nBunnings Trade Centres and Frame and Truss facilities across the country will be closed from Thursday, 25 December, until Monday, 5 January.\n\nCustomers are ﻿being urged to check the Bunnings website for local trading hours.\n\nAll Bunnings stores will be closed on Christmas Day. (Getty)\n\nBig W\n\nBig W stores will only be closed on Christmas Day across all states and territories over the Christmas and New Year period.\n\nCustomers are encouraged to check the Big W website to check the opening hours of stores. ﻿\n\nBWS and Dan Murphy's\n\nBottle shops under these brands will be open as normal on Christmas Eve.\n\nChristmas Day (December 25)\n\nAlmost every store will be closed, except for some stores in Victoria and Tasmania.\n\nBoxing Day (December 26)\n\nBWS and Dan Murphy's will reopen on Boxing Day.\n\nNew Year's Eve (December 31) ﻿\n\nDan Murphy's will be open until 9pm nationwide, and BWS will be open under normal hours.\n\nNew Year's Day﻿ (January 1)\n\nAll stores will be open under slightly reduced hours.\n\nAldi﻿\n\n﻿Aldi will be closed on Christmas Day across all states and territories.\n\nStore hours will vary on Christmas Eve, Boxing Day and New Year's Day, so customers are being told to check their website for local trading hours.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/australian-bicycle-industry-facing-big-challenges/54456521-7133-44ec-962b-44252fc5037a",
    "title": "Bumpy road ahead for Australia's bicycle industry",
    "publish_date": "Tue, 23 Dec 2025 18:41:48 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Christmas couldn't come fast enough for the Australian bicycle industry, which has been buffeted by a post-pandemic slump.\n\nBike sales ballooned during the COVID-19 health emergency , with cycling one of the activities permitted during lockdowns.\n\nResearch by industry analysts IBISWorld shows bikes were then flying off the racks as Australians embraced the activity, spurring a jump in profits from 2020 to 2022.\n\nCycling remains popular in Australia, but the bike industry has recorded a slump in sales since the end of the pandemic. (Lydia Lynch)\n\nStock levels across Australia were soon strained and as the virus led to lockdowns and factory shutdowns in the key manufacturing hubs of China and Taiwan , they became exhausted.﻿\n\nBut then the brakes came on as the global economy kickstarted post-pandemic, with cost-of-living pressures making new bicycle purchases a low priority for households.\n\nOne bright spot has been continuing high demand for parts, accessories and repair services.\n\nBicycle Industries Australia chief executive Peter Bourke said retailers, manufacturers and importers were counting on ﻿the festive season this year.\n\n\"Christmas and the summer months have traditionally been our strongest periods ... the wrapped bicycle under the Christmas tree is still a popular present,\" he said.\n\nDemand for bicycles in Australia and other countries boomed during the pandemic but then quickly fell off. (AP)\n\nTraditional bike shops continue to hold advantages over online retailers, including expert fittings, personalised advice and a skilled repair service, but they face a shifting market. ﻿\n\nOne example, highlighted by the IBISWorld research released in 2025, was Pedal Group's 99 Bikes chain of stores across Australia.\n\nThe company expanded rapidly, increasing its number of physical stores to boost its market share.\n\nBut since the close of the pandemic, slumping demand caused the company to deal with oversupply issues, hampering its expansion.\n\nAnd Australian cycle companies are not alone in facing a post-COVID sales slump.\n\nRemember Peloton? ﻿The sports company turned out millions of exercise bikes and treadmills fitted with smart technology, fuelled by demand from fitness enthusiasts who were confined to home.\n\nSales of Peloton fitness bikes boomed during the pandemic, but then fell off after lockdowns lifted. (Supplied)\n\nSales boomed during lockdowns, but Peloton's fortunes began to fade as vaccinations increased, gyms reopened and rivals offered competitive products.\n\nOnce the darling of the US stock market during COVID, by February 2022, its share price had collapsed and a painful company restructure followed, including shedding 2800 workers.\n\nThe rising popularity of e-bikes is also another challenge to sales of conventional, or analogue, bicycles.\n\n﻿The technology is expanding the market by appealing to a wider range of consumers than conventional, or analogue, bikes, requiring less pedalling and easier hill-climbing.\n\nMany bike shops are now stocking e-bikes, but they've been competing with sales from private individuals and online suppliers, often spruiking powerful and illegally altered machines.\n\nE-bikes have provided both a threat and opportunity for conventional bike sales. (Jorens Seins/iStock)\n\nAustralian import regulations controls on e-bikes were relaxed in 2021, leading to a flood of such e-bikes capable of travelling at more than 50km/h.\n\nBut in December 2025, after a spate of deaths and serious injuries of e-bike riders, federal and state authorities agreed to reinstate a key import standard to define legal e-bikes.\n\nThis would include the motor cutting out at a maximum assisted speed of 25km/h. ﻿\n\nLooking ahead, the hope is a safer and better-regulated market will create a level playing field for established bike dealers.\n\nBourke says the industry is adapting to the heady changes, but the traditional local bicycle store selling everything, from children's bikes with trainer wheels, to mountain bikes, commuter machines and racing cycles is probably on its way out.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/queensland-news-us-private-equity-company-blackstone-buys-queenslands-hamilton-island/2b511cfa-07ae-4803-b8b0-b63f1c6a3414",
    "title": "US company buys Queensland's Hamilton Island",
    "publish_date": "Tue, 23 Dec 2025 06:54:24 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Hamilton Island is set to change hands as its owners offload the tropical paradise to a private equity company in the US.\n\nBlackstone has acquired the famous Queensland resort owned by the billionaire Oatley family for more than two decades.\n\nThe deal, which could see the US company become a major force in Australia 's hospitality sector, is now subject to regulatory approval.﻿\n\nREAD MORE: Enormous bull shark caught off Queensland coast\n\nHamilton Island is set to change hands. (Getty Images/iStockphoto)\n\nBlackstone has more than $1.2 trillion in assets globally and took over Crown Resorts for $8.9 billion several years ago.\n\nThe Oatley family ﻿acquired the popular tourist destination in 2003 after it won a bid for 100 per cent of the shares in Hamilton Island when it was a publicly-listed company.\n\nThe late Bob Oatley, a renowned Australian winemaker and patriarch of the family, wanted to establish Hamilton Island as a destination anyone on any income could enjoy.\n\nUS private equity company Blackstone has acquired the famous Queensland resort. (Getty Images/iStockphoto)\n\nThe Oatley family has spent more than $350 million on improvements to the island, which has won more than 50 awards in recent years.\n\nBlackstone chairman of Asia Pacific and head of Asia real estate Chris Heady told the Australian Financial Review the company wanted to build on the Oatley's investment in the island.\n\n\"Hospitality and leisure is a key investment theme at Blackstone globally including in the Asia Pacific region, where we've brought scale and operational expertise to invest in and build leading brands,\" Heady said.\n\n\"We are committed to investing in the long-term success of Hamilton Island, its people, and its local businesses and community.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-25/regional-woman-bakes-500-christmas-cakes-to-fundraise/106038170",
    "title": "Faye's great Christmas cake baking mission",
    "publish_date": "Thu, 25 Dec 2025 00:34:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Hordes of people flock to car parks to meet Faye Taylor, who waits ready to hand out one of 500 of her handmade Christmas cakes.\n\nA wide variety of different people slip in and out of their vehicles excited to see Faye, who stands beside a car boot overfilled with eskies and bags.\n\nThey contain cakes which have lovingly been hand wrapped with personalised notes attached.\n\nHundreds of cakes are delivered across Faye's Riverland community. (ABC Riverland: Shannon Pearce)\n\nMany share brief but animated conversations with Faye, who lives in South Australia's Riverland region.\n\nOne who has turned up to collect a parcel is Tanya McDonald, who doubled her order this year.\n\n\"They just taste bloody lovely,\" she said.\n\n\" This lady is a real treasure; there's not many around like her anymore. \"\n\nWhile the time and ingredients are donated by Faye, the funds raised by selling the cakes help children in need overseas.\n\nAll funds raised from the sale of cakes will continue to go to helping children overseas. (ABC Riverland: Shannon Pearce)\n\nIt is this need that drives her to carry out the monumental baking task, which started in September.\n\nNot just a cake\n\nFaye said she fitted baking around her day job and, although it was difficult at times, the cakes helped her out of some trying times.\n\nEvery cake is carefully wrapped in festive colours, ready to be opened by families in the region and further afield. (ABC Riverland: Shannon Pearce)\n\n\"At my lowest of lows this year, I thought, 'No, I'm not going do it'. [But then I thought], 'Yes, I'm going push on,' \" she said.\n\n\"It helps you get out of that mental fog because those people that I saw [overseas], have got nothing, literally nothing.\n\n\"But they're so happy, they're happier than the people here.\"\n\nBaking for hope\n\nFaye said her calling to bake was inspired by a missionary trip to Africa 28 years ago.\n\n\"I came back from Africa wanting to sell my house, because I just had so much and I felt embarrassed how much I had, after seeing what little they have,\" she said.\n\n\" I definitely think of them all the time. My heart, my heart is with them all the time. \"\n\nFaye's memories of her Missionary trip to Africa have stayed with her. (Supplied: Faye Taylor)\n\nFunds raised from selling the cakes go to Hope Village Orphanage in Indonesia as well as a ministry at Naivasha in Kenya.\n\nFaye said she visited the children at the Hope Village Orphanage in 2024 and was able to see where her donations go.\n\nShe said funds were directed to support children's needs, including meals, clothing, medical support, housing expenses and education.\n\nFaye was proud to see first-hand where her donations have been used while on a trip in 2024. (Supplied: Faye Taylor )\n\nThe helping hands\n\nGlenda Cass is just one of the many people who buy Faye's cakes.\n\nShe started buying at Christmas several years ago and it wasn't long before she offered to lend a hand.\n\n\"I've developed her ingredient labels according to SA Health regulations and I print them off every year for her as a donation,\" she said.\n\nFrom baking to wrapping, Faye has remained committed to the cake effort for almost 20 years. (ABC Riverland: Shannon Pearce)\n\nGlenda said her devotion to continuing to support Faye was driven by knowing the money was going to people who needed it and because it sparked memories of her grandmother's traditional Christmas cakes.\n\nShe said it was what Christmas was all about for people of faith.\n\nFaye's talents and passion for baking also includes making festive biscuits. (Supplied: Faye Taylor)\n\n\"It's part of her faith, it's part of what she believes,\" Glenda said.\n\n\"Her and her husband would give anybody in the community the shirt off their back to help them out and not question it.\n\n\" That to me is what a true Christian is about, but it's also what a community person is about. \"\n\nMinistry of cake\n\nAs the cakes are enjoyed at dinner tables in the Riverland and further afield today, Faye said she was pleased her job was done for another year.\n\nWith the cakes out for another year, Faye can take a break from the kitchen. (Supplied: Faye Taylor )\n\nBut she said it would not be long before she was pulling the apron back on.\n\n\"When God tells me to stop, I'll stop, but right now I'm open to keep going,\" she said.\n\n\"Every year by the time they are all cleared out, I think, 'Oh, now I've got my fridges back, now I've got my eskies back', but then it's sort of, 'Oh, it's time to start again.'\"",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-25/pope-leo-celebrates-christmas-as-people-return-to-bethlehem/106178358",
    "title": "Pope Leo criticises 'distorted economy' in first Christmas mass",
    "publish_date": "Thu, 25 Dec 2025 00:31:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Pope Leo XIV has led the first Christmas mass of his pontificate, greeting thousands of faithful in unusually informal style in St Peter's Square before the Christmas Eve service.\n\nDuring the mass, Leo said Christmas was a feast of \"faith, charity and hope\" and criticised a \"distorted economy\" that \"leads us to treat human beings as mere merchandise\".\n\nThe pontiff, who has made care for immigrants and the poor key themes of his early papacy, said Jesus's birth showed God's presence in every person as he led the world's 1.4 billion Catholics into Christmas.\n\n\"On Earth there is no room for God if there is no room for the human person. To refuse one is to refuse the other,\" Leo said during the solemn service.\n\nEarlier, he spoke in front of St Peter's Basilica to offer Christmas wishes and thank those who had come to follow the mass on outdoor screens, despite rainy weather.\n\n\"St Peter's is very large but unfortunately it is not large enough to receive all of you,\" he told the crowd of about 5,000.\n\nThe US-born pope has adopted a more discreet and moderate style to that of his charismatic predecessor Francis, who died on April 21.\n\nThe mass was attended by high-ranking Church figures, diplomats and about 6,000 faithful.\n\nPope Leo XIV's first Midnight Mass in St Peter's Basilica. (AP: Gregorio Borgia)\n\nLeo stuck to a very religious homily without any direct reference to current affairs.\n\nThe ceremony celebrates the birth of Jesus Christ and is one of the most important days in the Catholic Church calendar.\n\nThe service combines traditional music with symbolic gestures such as placing a statue of the baby Jesus in a cradle.\n\nThe 70-year-old pope decided to hold the mass at a later time than under the more elderly Francis, who would hold Christmas mass at around 7:30pm local time.\n\nIn another change, Leo will hold another mass on Christmas Day on Thursday, renewing a tradition started by the late pope John Paul II.\n\nPope Leo XIV will return to the basilica for Mass on Christmas Day followed by his traditional blessing from the loggia. (Reuters: Guglielmo Mangiapane)\n\nHe will then give his \"Urbi et Orbi\" blessing at midday local time from the balcony of the basilica — during which popes usually speak about conflicts around the world and call for peace.\n\nLeo on Tuesday called for a global truce around the world on Christmas Day, expressing \"great sadness\" that \"apparently Russia rejected a request\" for one in Ukraine.\n\n\"I am renewing my request to all people of good will to respect a day of peace — at least on the feast of the birth of our saviour,\" Leo told reporters at his residence in Castel Gandolfo near Rome.\n\nChristmas 2025 also marks the end of the Catholic Church's Jubilee Holy Year, which has brought millions of pilgrims to Rome.\n\nCardinal Pierbattista Pizzaballa arrives at the Church of the Nativity, in the West Bank city of Bethlehem, on Christmas Eve. (AP: Ariel Schalit)\n\nMeanwhile, thousands of people flocked to Bethlehem's Manger Square after two years of subdued celebrations because of the war in Gaza.\n\nChristmas festivities return to Bethlehem after two years For the first time in two years, Bethlehem has restarted its Christmas festivities to \"reignite the spirit that everybody needs\" while Palestinians continue to live under restrictions.\n\nBethlehem, where Christians believe Jesus was born, had cancelled Christmas celebrations during the war.\n\nBut on Wednesday, local time, a giant Christmas tree was back in Manger Square, temporarily replacing the wartime nativity scene of baby Jesus surrounded by rubble and barbed wire in a homage to Gaza's suffering.\n\nCardinal Pierbattista Pizzaballa, the top Catholic leader in the Holy Land, kicked off this year's celebrations during the traditional procession from Jerusalem to Bethlehem, calling for \"a Christmas full of light\".\n\nCardinal Pizzaballa said he came bearing greetings from Gaza's tiny Christian community, where he held a pre-Christmas Mass on Sunday.\n\nAFP/AP",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-25/the-science-and-art-behind-flow-state-sport-music-maths/106172880",
    "title": "In sport, music and even maths, finding 'the zone' is a beautiful thing",
    "publish_date": "Wed, 24 Dec 2025 20:24:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "There is a state of mind athletes talk about when they are totally absorbed in the moment and the actions of their sport.\n\nThey call it being in \"the zone\", a \"flow state\" or simply \"flow\".\n\nIn his seminal 1972 book on sports psychology, The Inner Game of Tennis, author W Timothy Gallwey championed quietening the analytical, critical inner voice to allow one's unconscious mind to take over.\n\nHe described how a non-judgemental approach to the game can lead to being in the zone.\n\n\"There is a feeling some call harmony, balance, poise, even peace, or contentment,\" Gallwey wrote.\n\nIn his book, Sacred Hoops, legendary Chicago Bulls basketball coach Phil Jackson espoused a similar philosophy.\n\n\"All of us have flashes of oneness,\" Jackson wrote.\n\n\"When we're completely immersed in the moment, inseparable from what we're doing.\"\n\nBeing in the zone or in flow is that intangible state of total absorption where things just happen often without conscious thought — when what was difficult seemingly becomes easy.\n\nYou see it in sport when a tennis player nails every shot, when a cricketer is seeing the ball like a balloon, when a footballer kicking at goal just can't miss or when a runner seemingly floats.\n\nAn athlete in that \"flow state\" is a sight to behold. (Getty Images: Shi Tang)\n\nIn that moment everything falls into place and performance levels often go to a new plane.\n\nBut it's not only sport — flow states can be experienced by anyone undertaking any task.\n\nYou may have experienced flow at work, meditating, or even going for a run.\n\nSportspeople covet flow, but it's an amorphous state — temporary and often fleeting — a gift bestowed by the gods that can arrive and then disappear like a wisp of smoke.\n\nFlow means different things to different people, let alone how they arrive in flow state or stay there.\n\nHere we find out what flow means to an international cricket captain, a record-breaking marathon runner, an ARIA award-nominated musician, a prize-winning mathematician, and a performance psychologist.\n\nWhat does flow state feel like?\n\nThe cricketer\n\nHeather Knight is one of the most decorated women to have played for the England cricket team.\n\nShe captained the side to the 2017 World Cup victory and was the first woman to score an international century in all three formats of the game.\n\nBoth Heather Knight's Test centuries came in the Ashes against Australia. (Getty Images: Harry Engels)\n\n\"I think it's something that you don't get into too often — that sort of that state where everything just feels like it's clicking,\" Knight said.\n\n\"It's just real clarity in your thinking and clarity in decision-making.\n\n\"You're not thinking too much but you're thinking a little bit; you're thinking the right things.\n\n\"For me, as a batter, like your decision-making is really sharp. You almost feel like you know what the bowler's going to bowl and you just feel quite invincible, really.\n\n\"You execute the skill exactly how you want to: You middle the ball, hit it where you want to and it just feels quite easy and effortless and quite light.\"\n\nThe musician\n\nTim Levinson is better known by his stage name, Urthboy.\n\nHe's a founding member of the hip hop group, The Herd, and an acclaimed solo performer, with seven albums to his name.\n\nHe ran a record label, Elefant Traks, and produced and managed other musicians.\n\n\"Flow state's just deep work,\" Urthboy said.\n\n\"It really is just getting into a place where you have clarity, you have focus, you have a sense of some kind of coherent goal even if it's not a tangible thing.\n\n\"It's just you're moving and intellectually something about the wiring and the connecting of ideas and themes.\n\n\"There's a sort of fluidity between the steps along the way, so, there's less blockage; there's no second guessing; there's less stopping to think.\"\n\nThe runner\n\nJessica Stenson broke the Australian women's marathon record in Valencia in December.\n\nDuring the race she described being in a flow state.\n\nStenson won a Commonwealth Games gold medal and two bronze medals and competed in two Olympic Games.\n\n\"It [flow] has a bit of an air of effortlessness about it,\" Stenson said.\n\n\"So, you're obviously doing something that consumes a lot of energy and it's a difficult task, but at the time it just feels like it's coming really naturally.\n\n\"I think it's a state where your mind is very absorbed in the moment, and you obviously feel sensations, but you're not really hanging on to them or judging them.\n\n\"You're just experiencing the feelings and feeling at peace.\"\n\nFinding a cadence is hugely important for any long-distance event. (AP: Isaac Parkin/PA)\n\nThe mathematician\n\nProfessor Geordie Williamson is the director of the Sydney Mathematical Research Institute.\n\nHe's won international mathematical prizes and in 2018 became the youngest living Fellow of the Royal Society.\n\n\"You enter this beautiful state that's very fleeting, very difficult to attain, where you don't have a sense of time,\" Williamson said.\n\n\"You feel a complete kind of freedom within the problem, and it's often at those moments that really beautiful things can happen.\n\n\"Calculations are really hard for a while and then at some point you get such an ease with them that it just all fits together.\n\n\"It feels right and you know you're going in the right direction.\n\n\"Often I've found what I would kind of identify as flow states not whilst working with a pen and paper — like whilst walking around — and you feel this like very beautiful freedom in your mind, like all the pieces can just assemble as they should.\n\n\"It's completely addictive.\"\n\nThe performance psychologist\n\nCaroline Anderson has worked for two decades as a performance psychologist.\n\nMost recently she was the lead psychologist with the Australian Olympic team in Paris.\n\n\"I would describe flow as just that real task absorption and process focus where we're not thinking about consequences,\" Anderson said.\n\n\"There's less self-referential processing or thinking going on in the brain.\n\n\"We stop thinking about the pressure. The pressure is there, it's just that we're not choosing to focus on it, cause we're directing our focus towards other things.\"\n\nHow often do you experience flow?\n\nHeather Knight\n\nKnight scored 157 against Australia in the 2013 Ashes in one of the finest knocks of her career and looks at the innings as a prime example.\n\n\"Maybe a session I think where I really got into that flow,\" Knight said.\n\n\"Once or twice a season potentially across the whole year. So, that's a lot of cricket games that probably you're not in that state.\n\n\"I was able to think really clearly, move really freely. It's just when your body moves exactly how you want it to, you play the shots, you time the ball, you hit the ball where you want to.\"\n\nUrthboy\n\nUrthboy says flow is about clarity and focus. (Facebook: Urthboy)\n\nUrthboy feels flow most powerfully on stage.\n\n\"When you're performing — maybe there's a forgiveness for making mistakes of course — but you don't want to be getting into a spot where you're thinking at all,\" Urthboy said.\n\n\"In the studio you can be slow moving to that zone or you can be clarified in your thinking.\n\n\"It took me a long time to understand that you're a vehicle to some extent with the way that ideas flow through.\n\n\"It's not really that you have all this control and you have all the answers. It's more that there are things that are floating in the air and you're capturing them and you're able to weave them into your process.\n\n\"You're working with it as opposed to having control of it.\"\n\nJessica Stenson\n\nStenson finished 12th in the Paris Olympic Games marathon. (Getty Images: Christian Petersen)\n\nStenson hit a flow state during her 2022 Commonwealth Games gold medal run but it can still elude at key moments.\n\nShe didn't find it much at the Paris Olympics, despite still being happy with her performance, and can feel it powerfully away from athletics.\n\n\"Maybe two or three times a year. I would say, you know, maybe in a race maybe there are the odd training sessions, but it's a pretty rare feeling,\" Stenson said.\n\n\"[In Valencia] I didn't feel exhaustion, it was a pace or an effort I'd practised so often in training, and it felt like I was moving really efficiently, so, it almost felt like I was like floating across the ground.\n\n\"I would say I feel flow state more when I'm doing art than I do when I'm running.\n\n\"I love painting and drawing and I've always thought when I'm painting and drawing time just flies and I just don't want to stop.\"\n\nGeordie Williamson\n\nWilliamson has found the flow state of mind in the past but has revealed it can be more difficult as time goes by.\n\n\"It takes a lot of time to get there. Often I'll spend many weeks or months grappling with a problem and then slowly you start to know its moving parts,\" Williamson said.\n\n\"I would say that in the past it was quite a regular feature in my life.\n\n\"I have small children, and small children definitely reduce the amount of time you spend in flow state — I can testify to that.\"\n\nCan you bring on flow deliberately or does it just happen naturally?\n\nHeather Knight has led England against all-time great Australian teams. (AAP: Dave Hunt)\n\nHeather Knight\n\n\"There's like little routines that I have to try and get me in the right mind state that I know I need to have to perform,\" Knight said.\n\n\"Like I'll scrape my guard three times and tap my foot before I take the ball, particularly early in in my innings, cause it sort of resets me after the last ball — it sort of prepares me.\n\n\"I might play a shot that I have to commit to — so, playing a reverse sweep actually helps me get into that zone.\"\n\nUrthboy\n\n\"There are all these different ways of which you open up the door and go through it,\" Urthboy said.\n\n\"A lot of it is time, giving time to something. In the studio definitely.\n\n\"On the stage, you don't have time — you've just got to be there.\n\n\"In the studio you can be slow moving to that zone or you can be clarified in your thinking.\n\n\"If you give time and availability to the idea, you have always a different pathway to how quickly you can get to that spot.\"\n\nJessica Stenson\n\n\"I think it's more of a 'ooh I'm here now,'\" Stenson said.\n\nStenson has won a Commonwealth Games gold medal and two bronzes. (Getty Images: Cameron Spencer)\n\n\"But I did try to be intentional [during the Valencia marathon], which I haven't done much in marathons before — to try and switch off my thinking a little.\n\n\"There's a blue line that you follow in a lot of marathons, and I remember just looking down at the blue line and listening to my feet and trying to remove any other thoughts and that I feel kind of prompted that state a little.\"\n\nGeordie Williamson\n\n\"You absolutely cannot bring it on deliberately,\" Williamson said.\n\n\"You can really want it badly and it doesn't happen, and then sometimes it'll happen out of nowhere, like, 'oh, great'.\n\n\"It's very, very unpredictable, I would say.\n\n\"You can try to encourage it, I think not being busy is critical.\n\n\"And also, like a really, really focused engagement with the problem. That very deliberate practise I think is a prerequisite.\n\n\"I also feel that kind of meditative aspects can also be helpful. Like paying attention to the wind on your face and that kind of thing can help bring it on.\"\n\nHow important is flow?\n\nAll athletes search for that \"zone\", but it's hard to find. (Getty Images: Matt King)\n\nHeather Knight\n\n\"I think certainly I've learned throughout my career that you don't have to be perfect to perform,\" Knight said.\n\n\"It's actually when you're not feeling like that and you you're able to put in performances and score runs, that's when you're at your most valuable.\n\n\"Certainly, it's something to strive to, and all the athletes are certainly searching for it, but yeah, it doesn't happen very often.\n\n\"But I think If you search for that perfection — that flow — all the time and expect to reach it all the time, you're setting yourself unrealistic targets.\"\n\nJess Stenson\n\n\"I think you don't want to go into a race expecting that you'll feel it, because then you open yourself up to feel disappointed or stressed that you're not there,\" Stenson said.\n\n\"I go into a race expecting it's going to feel really hard and so if it comes, it's very welcome.\n\n\"I think it's fun to acknowledge it while you're in it, but I know that there are so many ups and downs in a marathon and while you can be feeling brilliant one moment, you might not feel great the next.\"\n\nSometimes everything just clicks into place. (Getty Images: Nicolas Economou/NurPhoto)\n\nCaroline Anderson\n\n\"I really like the concept of flow. I think it's great to talk about as an interesting piece, I just don't think it's the be all and end all,\" Anderson said.\n\n\"For the majority of sports, it's not something that we want to have as a goal — it's something that can either happen or doesn't, and that's great either way.\n\n\"I believe there's a paradox where the more we want to be in flow and the more expectation that we have that we have to be in flow in order to perform well, probably the less likely we are to get in flow.\n\n\"And I think we can get a trap if we think that the only way to get high performance or a gold medal result is through flow.\"\n\nSome final words from performance psychologist, Caroline Anderson, on how she helps athletes create a mindset that could lead to flow state.\n\n\"I think one of the barriers that people have is normal nervousness, performance anxiety, anticipatory anxiety, pressure, whatever you want to call it leading into an event,\" Anderson said.\n\n\"When you have a good understanding of what your body's doing and why it's doing it — and this is a normal phenomenon — we can kind of stop battling it and we just work with what we have.\n\n\"I think learning how to be more present-moment focused in your training [is important].\n\n\"We're just not very good at this in our modern lives, right?\n\n\"And athletes describe this all the time — they're doing something, but their mind is somewhere else.\n\n\"So, the present moment focus, and then being really clear about task or process related cues.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"A basketballer knows how to shoot a basket without thinking about it. When they're at the club or when they're training, they can do it completely automatically.\n\n\"In a high pressure moment that automation doesn't exist, because our mind wants to go to the threat, it wants to go to the crowds, the consequence — what if I lose?\n\n\"We need to give our minds really clear process, technical related cues, even if it sounds simple.\n\n\"So, what's my body stance? What arm position do I want to have? What do I want to do with the release of the ball? It sounds simple, but we need to give our mind these anchor points because otherwise it's just going to go in different directions.\n\n\"And the more that we train those, the more likelihood we are to go into flow.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-25/christmas-travel-public-transport-vline-cost/106171426",
    "title": "Long public transport trips are now a go-to for holiday homecomings",
    "publish_date": "Wed, 24 Dec 2025 19:58:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "It is an 11-hour journey by train and bus from Melbourne to Broken Hill, but for Scarlet Kohane, whose family moved to the regional town a couple of years ago, it is the only affordable option.\n\n\"As a young person with a casual job, the thought of spending over $800 on a round-trip flight ... I just couldn't justify it,\" she said.\n\nHer one-way trip cost $64 — comprising an $11 train ticket from Melbourne to Mildura via Swan Hill, and a $53 ticket from Mildura to Broken Hill.\n\nScarlet Kohane is taking the 11-hour public transport journey from Melbourne to Broken Hill to see her family this Christmas. (ABC Shepparton: Ethan Seiderman)\n\nMs Kohane said the five-hour trip to Swan Hill on a packed train, followed by six hours on buses through Mildura to Broken Hill, was worth it.\n\n\"Saving [for the airfare] would take time and if I were to drive, petrol is costly too,\" she said.\n\nBut the journey is not without its challenges.\n\n\"It can get pretty cramped on the V/Line this time of year,\" Ms Kohane said.\n\n\"I used to catch the train to Castlemaine for family Christmas and sometimes I had to sit on the floor.\"\n\nNot meeting holiday demand\n\nMs Kohane’s journey is becoming increasingly common, as rising airfares and fuel costs push more Victorians onto regional rail.\n\nBut while demand for V/Line services has surged, capacity has largely remained unchanged, leaving passengers to deal with packed carriages and fully booked services.\n\nVictorian Nationals MP Annabelle Cleeland said the Albury line was strained on a normal weekday and demand exceeded supply during holiday periods.\n\n\"Even one extra return service on the busiest days would make a real difference,\" Ms Cleeland said.\n\nShe said trains offered a safer, affordable option for older people and those with a disability, and not everyone could, or should have to, drive.\n\n\"Improving rail is about providing a reliable alternative, not forcing people onto it,\" Ms Cleeland said.\n\nEuroa MP Annabelle Cleeland is pushing for increases to services on the Albury line to meet demand. (Supplied: Annabelle Cleeland)\n\nA Victorian government spokesperson said extra services were added to the Albury V/Line bus and train network last year.\n\n\"We've given Albury Line passengers more options to get where they need to go, with two weekend train services and more coach options added to the timetable,\" the spokesperson said.\n\n\"And with free weekend travel this summer, we continue to encourage passengers to plan ahead and make a reservation before travelling,\" the spokesperson said.\n\nPublic transport will be free today and on New Year’s Eve and extra services will be available to help regional travellers get to the Boxing Day Test cricket at the MCG.\n\nDaniel Bowen says Victorian commuters are welcoming an increased investment in public transport. (ABC News: Costa Haritos)\n\nA busy year for V/Line\n\nA record 26 million passengers boarded V/Line services last financial year, up from 24 million the year before.\n\nPublic Transport Users Association spokesperson Daniel Bowen said it made sense to keep investing in the system.\n\n\"Normally in Victoria the maximum fare you'll pay is $11 a day and that's not bad value for travelling long distances,\" he said.\n\nHe said more services were needed to reduce a high strain on the system especially on north-east Victorian services.\n\nPublic transport will free for children in Victoria from New Year's Day. (Ethan Seiderman)\n\nVictoria will offer free public transport for children under the age of 18 from the beginning of 2026.\n\nPaul Strickland, La Trobe University senior lecturer in sport, tourism, hospitality and events, said the fare incentives would help the hospitality industry and the environment.\n\nBut he warned such decisions were also conditioning children not to pay for public transport.\n\n\"If you're a seven-year-old and you're taking public transport, you're doing that for free for [over a decade] and then all of a sudden you have to pay, there's going to be an issue,\" Dr Strickland said.\n\n\"I don't know any model around the world where public transport is absolutely free.\"\n\nTransport Victoria announced last week it would increase the fare cap to $11.40 for both metropolitan and regional trains from January 1.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-25/sydney-to-hobart-she-peter-rodgers-memorial-race/106056430",
    "title": "'We push it to the max': She ready to add to Sydney to Hobart history",
    "publish_date": "Wed, 24 Dec 2025 19:44:07 +0000",
    "category": "sports",
    "authors": [],
    "text": "Philip Bell and Mark O'Dea have very different sailing origin stories, but they work very well on the water — and this year they are coming together again to race She in the Sydney to Hobart yacht race.\n\nThey and the rest of the crew will honour the boat that has more experience in the 628 nautical mile (1,163km) blue ocean classic than all but a handful of craft in the race's long history.\n\nThey will also mark a man that connects them both, a former owner and skipper of She who died a year ago.\n\nShe is a modified Olsen 40 boat — indeed it has been more modified than most, thanks to that former owner, the late Peter Rodgers.\n\nBell is the current skipper and the man who bought the boat from Rodgers more than a decade ago.\n\nA semi-retired civil engineer who ran his own business for many years, he acknowledges he didn't have the usual start to his sailing career.\n\n\"Most people take it up [early], they say it was at five years old or something,\" Bell says.\n\n\"I was 60 years old. I did a Yachtmasters course then.\n\n\"I reckoned you need to be rich or have lots of time on your hands [to do this].\n\n\"I started looking around for a boat and that's a pretty daunting task. Eventually I found a boat and [She] had actually done 17 Sydney to Hobarts and I said, 'Oh, that must be a fairly robust boat.'\"\n\nFirst stop Hobart, next up Osaka for Annette and Sophie For Annette Hesselmans and her daughter Sophie Snijders aboard Fika, the Sydney to Hobart's 628 nautical mile bluewater classic is just a qualifier for the Melbourne to Osaka marine marathon.\n\nBell says he never intended initially to do offshore racing. But then he sailed a couple of times with O'Dea, who had been second-in-command on She under Rodgers.\n\n\"As I started doing a little bit of racing just here locally and I realised that the ship, she had become a bit of a men's shed,\" he said.\n\n\"We've got a lot of people over 60 sailing, a lot of men over 60 [and] of the 10 people who are regulars with me, I would say six of them have been with me for 10 years.\n\n\"So it became sort of a little bit of a — cult's not the right word — but certainly a fellowship.\"\n\nAfter learning the ropes of offshore racing, Philip Bell's first Sydney to Hobart aboard She was in 2016. (Supplied: Richard Bennett Photography)\n\nBell's first Sydney to Hobart was in 2016. He built up his experience starting with local races on the Gold Coast, then more than a handful of races in North Queensland and the Whitsundays and northern NSW leading into 2016.\n\nSo what is life like sailing beyond the margins?\n\n\"Because we live such a comfortable life on land every now and then to be out on the edge actually gives you an incentive to, and it makes you, appreciate your comfortable bed at home and the nice things that we've got around us,\" Bell says.\n\n\"It's a reminder that being on the edge and not being necessarily totally in control of everything [that] nature's probably in control.\"\n\nThe skipper says there are a lot of fanatical people who love the race who take part over and over again, pointing to the instructor for his sea safety certificate who had taken part in 47 Sydney to Hobarts.\n\nPhilip Bell's first Sydney to Hobart with She in 2016 ended with an eighth-placed finish in her PHS division. (Supplied: Philip Bell)\n\n\"He's a great instructor because we've all faced serious issues at sea,\" Bell says.\n\n\"If you stay at sea long enough you'll experience the whole raft of experiences from beautiful sailing to being becalmed to being in a storm.\n\n\"And a lot of people say that racing is like 80 per cent boredom, 10 per cent joy and 10 per cent terror.\"\n\nIn 2023 She failed to make the finish due to the mainsail blowing out.\n\n\"We sailed for another half a day. And then when we looked at the forecast and we said 'this is not so smart',\" Bell says.\n\n\"Safety being the key, you've got eight people to worry about, we decided to turn around.\"\n\nSkipper Philip Bell had to pull She out of the race in 2023, receiving the inauspicious trophy for the first boat into Eden. (Supplied: Philip Bell)\n\nBell is quite clear about his number one concern during the race.\n\n\"Because we can't stop overnight at a motel we've got to continue the race until we get to the end. So therefore one of the biggest factors, especially in the 40-footers, is fatigue,\" he says.\n\nAfter the first few hours charging south down the coast with spinnaker up, the crew shift into \"four up, four down\" mode, with half on shift at any one time to allow them to have \"something left in the tank on day three\".\n\n\"I've got a stations list of what everyone has to do because not everyone's got exactly the same skills. So I have to know what each person is capable of and make the most of that,\" he says.\n\nPhilip Bell (second left, front row) and the full crew of eight on board She before the 2022 Sydney to Hobart. (Supplied: Philip Bell/Crew partner)\n\nIf there's one thing Bell sees as a barrier for sailors to completing the Hobart, it's a fairly obvious one.\n\n\"I don't get seasick. I don't think you could do this job if you got seasick,\" he says.\n\n\"I mean, I did have a 2IC in the 2017 Hobart who did get seasick, but somehow he coped.\n\n\"I dunno how he did it, but he coped and he'd get up every shift. He'd get up and spew his guts out and do what he had to do and he'd go back to sleep — the next shift the same.\"\n\nBell has seen plenty of different conditions in his time doing the Hobart — this year will be his sixth.\n\n\"The only surprise was in 2019 when the fires were on, those fires just created a massive micro-climate,\" he says.\n\n\"For example, we got becalmed off St Helen's and then we picked up wind and we got to Tasman Island.\n\n\"Then when we turned into Storm Bay, instead of it being freezing, that wind was so hot [and] blowing at about 35 knots (64.8km/h) that the stanchions, the stainless steel stanchions, people leaned up against them and they got burned.\n\n\"It was like 40 degrees and driven by the fires around Eden, across Bass Strait, and the northerly was just amazing.\"\n\nThe Sydney to Hobart went ahead in 2019 but fires created their own micro-climate for racers. (Getty Images: Alea/Andrea Francolini)\n\nWhat does Bell hope to get from this year's race?\n\n\"I'm 73, 74 next year and I know that I can't keep doing this for that much longer,\" he says.\n\n\"Whether this will be the last or the second to last, I don't know.\n\n\"But then if you stop then you're not going back, are you?\"\n\nThere is another driving force behind this year's race.\n\n\"Peter Rodgers, who was a good friend of mine, the previous owner, a real character in Sydney, he passed away in December last year,\" Bell says.\n\n\"And we promised [Rodger's wife] Pat that we would make some gesture with that. So we're having Peter Rodgers Memorial Race on our jerseys this year.\"\n\nThe Peter Rodgers Memorial Race\n\nAs the crew is gathered in Sydney to prepare for the race, Rodgers will be on most of their minds.\n\nSkipper Peter Rodgers (left) and second-in-command Mark O'Dea shared many Sydney to Hobarts together. (Supplied: Mark O'Dea)\n\nO'Dea was the 2IC for the former owner over many races and has been involved with the boat on and off for many years.\n\nHe says Rodgers, who died aged 86, was a personality but not a hands-on skipper.\n\n\"He tended to keep out of things a lot, decisions like what direction to go and what sails to put up. But he really, really enjoyed it [sailing and the race],\" O'Dea says.\n\n\"He put a lot of money into the boat and a lot of time, he was very dedicated.\n\n\"I think it was his escape. He was running a business, a big accountancy firm in the city, and I think that managerial task and all that responsibility, I think he needed some sort of escape from that, and sailing was it.\"\n\nOne story O'Dea remembers fondly involves the Iron Pot Lighthouse, a red and white landmark for sailors on the edge of the Derwent River that marks the start of the final section of the race.\n\nFor former She skipper Peter Rodgers, the Iron Pot Lighthouse was not just a landmark but a source of frustration. (Getty Images: Andrea Francolini)\n\n\"Every single time we went past this — and he [Rodgers] would say 'if I'm asleep when we get to the Iron Pot, wake me up' — he'd yell and scream at it,\" O'Dea says.\n\n\"He was an eccentric fella, and quite funny — he used to swear at this damn thing really loud, thank God there weren't any houses around.\n\n\"He'd say 'you've cost me thousands and thousands of dollars, you bloody thing, you make me come down here every year'.\n\n\"He'd have us all in stitches on the deck, but that is what that race is all about — memories of things like that. And then [after the outburst] he'd just go downstairs and have a sleep. Iron Pot abuse.\"\n\nWhereas Bell came to sailing late, O'Dea has been doing it nearly all his life.\n\nHis career involves the water too as he is a shipwright, or boat builder.\n\n\"I was lucky enough to be born near Middle Harbour [in Sydney] and that's what we did in the school holidays was boats, boats, boats,\" he says.\n\n\"It taught us all at an early age how to read the breeze and read the currents.\"\n\nMark O'Dea helped build a number of America's Cup boats for Australian sailing great Syd Fischer (left). (Getty Images: Stephen Dunn)\n\nO'Dea was a determined sailor, with lofty dreams. He remembers listening to broadcasts of the America's Cup on a crystal radio set in his room in the '60s.\n\nHe went on to help build five America's Cup boats, most with the great Syd Fischer, and was on the extended sailing list for Steak N'Kidney in the 1987 challenger series.\n\nHis first Sydney to Hobart was in 1984, one of the worst years in the race's history.\n\nAsked why people race in these big races over and over, he replies:\n\n\"Probably because you forget about all the bad things [about the race]. You've got 12 months to forget about it,\" O'Dea says.\n\n\"When I did my '84 race it took me four years to go back and do another one. The '84 race was a particularly hard race and it was the first time we actually lost someone in the race.\n\n\"We made it [home safely] but it was really, really tough.\"\n\nThis year, She will make her 23rd race trip to Hobart, placing it seventh in the all-time list behind Bacardi, which this year will race for the 32nd time.\n\n\"[She is] 43 foot long and it's 43 years old. It's older than my car, and I think that's old,\" O'Dea says.\n\n\"People say 'wow, the car's still running', but I tinker with it … and I work on it.\n\n\"I'm proud of the old car and I'm proud of this old yacht.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"And it's been very successful over the years, three times it's won overall PHS, division one and division two — 2009, 2012 and 2013.\n\n\"We rely on heavy weather and attrition compared to the lighter boats that don't last there that long when it's really, really rough.\n\n\"We cane it pretty hard out there … we push it to the max.\"\n\nForty three years on, She is still racing with the best of them in Queensland and in the Sydney to Hobart. (Supplied: Airlie Beach Race Week Committee)\n\nAsked what's bringing him back to this boat once again, O'Dea cites the memorial for Rodgers, but says there's much more that grabs him for this world-famous race.\n\n\"That is part of it [remembering Peter], but the rest of it is me just enjoying that boat, the way it sails. I can trust it,\" O'Dea says.\n\n\"I could be on a lighter boat, and if conditions are right you could outpace everybody.\n\n\"I could possibly get on a maxi boat if I really wanted to, but I prefer to be on a smaller boat with eight people that I can relate to.\n\n\"And we all learn off each other.\"\n\nThe 80th edition of the Sydney to Hobart yacht race will begin on Boxing Day at 1pm AEDT. You can follow day one of the race in ABC's live blog from midday AEDT.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-25/racist-vandalism-of-aussie-poster-in-adelaide/106177068",
    "title": "'Aussie' poster in Adelaide vandalised with 'white power' graffiti",
    "publish_date": "Wed, 24 Dec 2025 19:42:45 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "An Adelaide street artist's poster aimed at provoking thought about national identity has been vandalised with racist graffiti.\n\nThe artwork, which depicts late 19th century Muslim immigrant Monga Khan above the headline \"Aussie\", was found defaced on Wednesday morning with a spray-painted \"white power\" message.\n\nThe poster was displayed on the corner of Hackney Road and North Terrace on the outskirts of the Adelaide CBD.\n\nAn \"Aussie\" artwork poster by Peter Drew vandalised with \"white power\". (ABC News: Lincoln Rothall)\n\nArtist Peter Drew, who began displaying his \"Aussie\" artwork series around Adelaide and other capital cities in 2016, estimated that he replaces a poster \"once a month\" due to racist vandalism.\n\nHe hit back at the perpetrator on Wednesday.\n\n\"They call themselves 'patriots' but they are not patriotic,\" he said.\n\n\"They don't love Australia. They love a fantasy of an Australia that never really was.\n\n\"We are the real patriots. We love Australia for what it actually is and what it might yet become.\"\n\nDrew replaced the vandalised artwork on Wednesday afternoon with a new poster, which depicts protesters at a March for Australia rally tearing down a Monga Khan poster.\n\nThe vandalised poster has been replaced with a new artwork. (Supplied: Peter Drew)\n\nThis poster has the headline \"Aussie?\".\n\nHe added that \"as a rule\", he puts up three new posters for every one that is vandalised.\n\n'Not just any old thing that's been graffitied'\n\nDr Kaz Ross, independent researcher into far-right extremism in Australia, said public commentary like the slogan pictured \"has a very corrosive effect — and that's the intention of it\".\n\n\"The intention is to indicate to the target audience, 'You're not welcome here, this is our space,'\" she said.\n\n\"If you're not the target audience, you may not even feel it particularly deeply.\n\n\"But if you are the target audience, you know that there's someone basically expressing hate towards you … and the intention is to make you feel very, very uncomfortable on the streets in Australia.\"\n\nThe vandalised artwork depicts late 19th century Muslim immigrant Monga Khan. (ABC News: Lincoln Rothall)\n\nDr Ross said it was significant that the vandal had targeted one of Drew's posters, which feature people who applied for exemptions to the White Australia policy.\n\nShe said the images drew attention to the fact that \"White Australia was never just white Australia\".\n\n\"It's not just any old thing that's been graffitied here. It's quite a symbolic statement about who's an Australian and who's welcome in Australia,\" she said.\n\nWhat Is A Real Aussie? Street artist Peter Drew beings a new project asking What Is A Real Aussie?\n\n\"So it's important that we say 'Yes, actually these people on the posters contributed to the making of modern Australia and they are welcome as Australians.'\"\n\nDrew said graffiti also forced him recently to replace an \"Aussie\" poster that depicted a Jewish World War II veteran.\n\nShai Wittles, a member of the Jewish community in Adelaide, said tensions had escalated following the Bondi attack.\n\n\"What I'm seeing is, in the wake of this tragedy, I'm seeing white supremacists emboldened and I'm seeing a lot of people using Bondi as a justification for their white supremacy,\" they said.\n\n\"I think that these escalations are making everyone less safe.\"\n\nThey said the intent behind incidents such as the graffiti was to stoke division within the community.\n\nMinister says act doesn't represent SA\n\nMinister for Multicultural Affairs Zoe Bettison said the message was \"offensive and disappointing\".\n\nZoe Bettison calls on South Australians to \"stand together in the spirit of unity\".\n\n\"While acts like this can be hurtful and divisive, they do not reflect who we are as a community,\" she said in a statement.\n\n\"South Australia is an overwhelmingly harmonious and inclusive multicultural state.\n\n\"It's important we all take time to reflect on the recent events and be reminded of the values of kindness, respect and looking out for one another.\n\n\"South Australians reject hate and continue to stand together in the spirit of unity and goodwill.\"\n\nMonga Khan was a hawker and itinerant worker who arrived in Australia in 1895 shortly before the White Australia policy began.\n\nHe applied for an exemption to the policy's dictation test so he could be re-admitted into Australia without taking the test designed to keep him out.\n\nThe image depicted in the poster is from his application for the exemption.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-25/combating-loneliness-friendsmas-community-connection-christmas/106154516",
    "title": "Festive 'Friendsmas' celebrations combat loneliness, social isolation",
    "publish_date": "Wed, 24 Dec 2025 19:30:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Our screens are brimming with commercials of happy families celebrating Christmas, but for some Australians the festive season is actually the loneliest time of year.\n\nMission Australia has been fielding phone calls every single day in the lead-up to Christmas, from people who have nowhere to spend it.\n\nThe demand aligns with data showing the frequency of social contact, both in-person and online, has been declining in Australia for the past two decades.\n\nAnalysis from the Australian Institute of Health and Welfare found loneliness and social isolation were exacerbated since the COVID-19 pandemic.\n\n\"Social isolation and loneliness are among the many factors that can be detrimental to a person's wellbeing,\" it reported.\n\nCelebrating with mates\n\nDarwin is Australia's smallest capital city, with some of the country's most expensive airline fees, so it's not uncommon to be separated from loved ones in December.\n\nFor people in remote Australia who can't be with family these holidays, celebrating with your chosen family for a \"Friendsmas\" helps foster a sense of connection.\n\nThese Top End mates celebrated Friendsmas at Tiwi, in Darwin's northern suburbs. (ABC News: Dane Hirst)\n\nFor 26-year-old Dana McDonald, visits to family interstate can be few and far between, so she cherishes her Friendsmas celebrations in Darwin.\n\n\"You get to spend deliberate time with the people that you love deeply,\" she says.\n\n\" It definitely helps with a lot of the loneliness you feel at this time of year, living away from family and feeling maybe disconnected. \"\n\nDana says spending quality, intentional time with loved ones fosters a sense of social connection — the delicious Christmas ham is just an added bonus. (ABC News: Dane Hirst)\n\nDana says \"that's the beauty of\" a transient place like Darwin: \"You make friends for life\".\n\n\"That's what I've recognised since being up here in the last few years, is that it's not the amount of time, it's the quality of time,\" she says.\n\nGifts aren't essential at Friendsmas, it all depends on how your mates decide to celebrate. (ABC News: Dane Hirst)\n\nDana says \"it's not unusual to feel lonely this time of year\", so, after a long, hot 2025, she believes the best way to celebrate the silly season is with \"people that make you feel good, that fill your cup\".\n\nShane Butcher, 36, and his wife are among those special people — they're keen to make Friendsmas an annual tradition.\n\nShane says Friendsmas is all about spending quality time with good company. (ABC News: Dane Hirst)\n\n\"We're all here together because life gets a bit too busy and we can't catch up all the time, so it's just good to set aside a day, exchange a few presents, have a good Christmas lunch and just enjoy,\" he says.\n\nTheir celebration changes each festive season, from building gingerbread houses to playing video games and enjoying a movie, but the one constant every year is sharing \"those belly laughs\".\n\nShane says Darwin always has \"perfect weather, unless it's raining, and even then it's still pretty good\", so a dip in the pool is usually on the Friendsmas agenda. (ABC News: Dane Hirst)\n\nSharing a meal\n\nBut geography isn't the only factor contributing to isolation in the holidays.\n\nFrom Australia's smallest capital to its most populous, social connection remains just as vital.\n\nChristmas puts meaningful connections in the spotlight, but not everyone has family to celebrate with. (ABC News: Dane Hirst)\n\nIn Sydney's Marrickville, people gather weekly to share a meal at Addison Road Community Organisation.\n\nThe charity's chief executive, Rosanna Barbero, says attendees from all walks of life connect at their services.\n\nShe says December is the most important time of year for these events.\n\nAddison Road Community Organisation combats loneliness and food insecurity with regular meal services in Sydney. (ABC News: Zac Pitkethley)\n\n\"If you switch on the television, you're always being reminded that it's the festive, joyful period,\" she says.\n\n\"There's commercials about buying food and cooking for Christmas Day, and being surrounded by happy, smiling families that are singing carols.\n\n\" There are so many people that are not in that situation, so it's a constant reminder that you are alone. \"\n\nIn addition to social events, the charity also runs a community pantry that opens each afternoon.\n\nRosanna Barbero says many community members attend the services to connect with others and share a meal. (ABC News: Mridula Amin)\n\nRosanna says locals will gather outside in the hours before the pantry opens, to catch up with each other and those working behind the scenes.\n\nBarry Shuttleworth is part of the 800-strong army of volunteers and has been spreading the silly season joy dressed up in his daughter's \"Moo-ry Cow-ristmas\" costume.\n\nFor anyone battling loneliness today, he suggests seeking out the \"great feeling of joy and support\" that fills the air around these community events.\n\nBarry Shuttleworth is spreading joy this silly season. (Facebook: Addi Road Community Organisation)\n\nConnecting with community\n\nOver in Perth, Carley Smith has been working with more than 350 volunteers to deliver Mission Australia's 50th annual Christmas Lunch in the Park (CLIP).\n\nShe says it's an open invitation, with 1,650 three-course meals prepared ahead of the big day, and no guest is ever turned away.\n\nFor guests aged 14 and over, Mission Australia care packages will offer toiletries and non-perishable food items. (ABC News: Rick Rifici)\n\nIt's the biggest event of its kind in the country and Carley loves the rewarding sense of celebration and joy it delivers at a time when \"cost of living is obviously impacting everybody\".\n\nMission Australia has seen an uptick in the volume of people reaching out for support, and she says events like CLIP help families who can't afford lots of presents or a big Christmas Day lunch.\n\nSanta will be present at the community-funded event, with lots of children's presents ready to go. (ABC News: Rick Rifici)\n\nThe support sometimes comes full circle — Carley says a number of former guests now serve others at the event.\n\n\"One of the volunteers, her only positive memories of Christmas Day as a child, was when she attended CLIP,\" she says.\n\n\"That story just breaks my heart but it shows what a difference Christmas Lunch in the Park can make to a family.\"\n\nCarley says it's important to be kind to ourselves and others because \"sometimes, that Christmas period is a really tough time of year\".\n\nMission Australia's Carley Smith says it can be tough to maintain relationships with loved ones living far away, but sometimes a quick phone call is all it takes to spark a sense of connection. (ABC News: Rick Rifici)\n\nIf there's someone in your life struggling with loneliness, she suggests heeding the advice of a famous proverb: \"When you have more than you need, build a longer table, not a higher fence\".\n\n\"If you've got space for extras on Christmas Day, reach out to your friends that might be isolated, that might not have family close by, invite them over — you'll have a fun time,\" Carley says.\n\n\"If you are far from your family and friends, it's really tough to keep those relationships going but it's lovely to reach out.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-25/qld-second-hand-shopping-thrifting-consumption-apps/106173026",
    "title": "How second-hand shopping could be fuelling consumption",
    "publish_date": "Wed, 24 Dec 2025 19:25:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Second-hand shopping has long been promoted as part of the solution to Australia's waste problem, with many consumers choosing pre-loved items as a more sustainable alternative to traditional retail.\n\nAs consumers embrace thrifting and circular fashion, Australia's second-hand market is now predicted to reach about $1.5 billion by 2032, according to market research platform Credence Research.\n\nSeamless says 222,000 tons of clothing ended up in Australian landfill last year. (ABC News: Paul Robinson)\n\nBut despite this growth, the volume of clothing thrown to waste remains high. According to the clothing stewardship scheme Seamless Australia, more than 220,000 tonnes of clothing were sent to landfill in 2024, a decrease of 1 per cent from the previous year.\n\nIt has left some shoppers and sellers questioning whether the thrifting industry is successfully helping Australians reduce consumption.\n\nSecond-hand jewellery is popular at market stores. (ABC News: Mae Argent)\n\nSpending less does not always mean consuming less\n\nResearch released by the Australia Institute in 2024 found Australians buy more clothes per person than any other country, with an average of 56 items.\n\nAssociate professor in fashion at Queensland University of Technology, Tiziana Ferrero-Regis, said circularity — giving clothing a longer lifetime — is essential to helping reduce the production of textile waste.\n\nBut she said shoppers can fall into a problematic mindset when buying pre-loved clothing.\n\n\"Moral licensing, in a very short summary, is 'I buy second-hand clothing so I can buy more,'\" she said.\n\nTiziana Ferrero-Regis says second-hand shopping does not necessarily reduce consumption. (Supplied)\n\nDr Ferrero-Regis said for many shoppers, fashion resale apps do not necessarily slow consumption behaviour and the speed of purchases.\n\n\"Consumers of second-hand clothing now behave in the same way they buy fast fashion,\" she said.\n\nCost-conscious family embraces the spirit of 'Thriftmas' Rising expenses across the festive season have driven a family of five in Brisbane to set a rule to only purchase Christmas presents from second-hand stores — and they've been pleasantly surprised by the treasures they've uncovered.\n\n\"Second-hand clothing has the potential to reduce consumption, but it's not a given, it's not automatic.\n\n\"The problem is that online and social media resales can become addictive in the same ways as fast fashion.\n\n\"We see the same kind of behaviour [including] compulsive buying.\"\n\nApps driving growth in resale market\n\nThe rapid growth of online resale platforms like eBay and Depop is a key driver of the market's expansion, according to Credence Research.\n\nA Depop spokesperson said sign-ups in Australia have grown \"over 100 per cent year-on-year\" as more consumers look for second-hand items.\n\n\"Resale is becoming a mainstream way to shop,\" the spokesperson said.\n\nEsta Padillo sells second-hand clothes on Depop. (Supplied)\n\nEsta Padillo, who had been selling clothing on the platform for almost a decade, said the second-hand buying and selling experience had changed significantly over the years.\n\nShe said ultra-fast fashion drop-shippers had increasingly bought from sites like Shein and Temu, then resold the items at inflated \"vintage\" prices.\n\n\"Back in the day that didn't really happen, so I think that's the main change that's breaking my heart,\" Ms Padillo said.\n\n\"This is not what Depop is supposed to be at all.\"\n\nA clothing rack at a second-hand market. (ABC News: Mae Argent)\n\nAccording to Depop policy, drop-shipped catalogue items are not allowed on the app, and submitting misleading or untrue listings on Depop is against their Terms of Service.\n\nWhen asked about the sale of fast-fashion items on the app, a Depop spokesperson said the platform did not discriminate based on the type of items sold.\n\n\"Every second-hand purchase helps shift behaviour in ways that support a circular economy and reduce the environmental impact of new fashion,\" the spokesperson said.\n\n\"It is important to us that we showcase an alternative to new fast fashion that's kinder to people and the planet than buying new … we've taken steps to ban less sustainable sourcing practices.\"\n\nSome people buy clothes from sites like Shein and Temu, then resell the items at inflated \"vintage\" prices. (ABC News: Mae Argent)\n\nFast fashion brands surge on resale platforms\n\nFast fashion brands were increasingly turning up in physical second-hand stores, markets and op-shops.\n\nIsobel Dear founded a second-hand market in 2020 after noticing a lack of pre-loved fashion events, and said digital media had played a critical role in encouraging more people to embrace second-hand shopping.\n\n\"Social media and digital platforms have made circular fashion more accessible,\" she said.\n\nIsobel Dear founded a second-hand market in 2020. (ABC News: Mae Argent)\n\n\"I think that digitally just being able to spread the word through those platforms has definitely helped us form this niche community.\"\n\nMs Dear said she does not encourage \"those ultra-fast fashion brands that are really low quality\" being sold at her market, but sellers often donate items they have been unable to sell.\n\nShe said the store receives about five bins of donations each week, many of them fast-fashion items.\n\nIsobel Dear says digital media plays a critical role in encouraging more people to embrace second-hand shopping. (ABC News: Mae Argent)\n\nMs Dear said she was trying to support the shopping style and community the market had created, while also encouraging shoppers to avoid fast-fashion items and choose longer-lasting pieces.\n\n\"If we can keep those [good quality] pieces in rotation then hopefully those really low-quality items just eventually are not the preference,\" she said.\n\n\"We can still love fashion for what it does for our personalities, and our style, and the joy that we get from it … if we can just be a little more mindful with it.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-25/what-to-know-about-laboratory-grown-and-natural-diamonds/106167962",
    "title": "What you need to know before you buy lab-grown versus natural diamonds",
    "publish_date": "Wed, 24 Dec 2025 19:22:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "The slogan of \"a diamond is forever\" — linking diamonds to everlasting love and ultimate commitment — has been instilled for decades.\n\nDiamonds are generally considered a luxury asset that holds its value, but the emergence of laboratory-grown diamonds in the jewellery industry over recent years could challenge that belief.\n\nAre synthetic diamonds real diamonds, and what do you need to know before making a purchase?\n\nLet's break it down.\n\nAre laboratory-grown diamonds actually diamonds?\n\nYes, lab-grown diamonds, also known as synthetic diamonds or man-made diamonds, have identical chemical, physical and optical properties to their natural counterparts.\n\nDespite their near-identical appearance, trained gemologists and sophisticated equipment can still detect subtle differences.\n\nUncut natural diamonds in different colours. (Supplied: Geoscience Australia)\n\nNatural diamonds, or mined diamonds, are extremely rare compared to other minerals, according to Geoscience Australia.\n\nThey form at depths of 150 to 200 kilometres below the Earth's surface where high temperatures and pressures allow them to crystallise.\n\nThen the diamonds may be picked up by hot magma and transported upwards as the magma intrudes into the Earth's crust.\n\nNatural diamond rings and diamonds on a display tray with a 10-carat ring (left) worth $698,000. (ABC News: Yiying Li)\n\nMost natural diamonds are between 1 and 3 billion years old.\n\nAccording to Macquarie University, the two main methods for growing synthetic diamonds today are the high-pressure, high-temperature (HPHT) method and chemical vapour deposition (CVD).\n\nHPHT mimics Earth's conditions to create diamonds, while CVD grows them atom-by-atom in a vacuum chamber by exposing a diamond seed to carbon-rich gases.\n\nDe Beers employees work on belt presses for HPHT-synthesised diamonds in a laboratory. (Getty Images: Chris Ratcliffe/Bloomberg)\n\nHow do lab-grown diamonds compare to natural ones financially?\n\nFrom a quality perspective, synthetic diamonds benefit from highly controlled production environments, resulting in a consistently strong cut, colour and clarity, the Jewellers Association of Australia (JAA) has told the ABC.\n\n\"Yet one of their most significant drawbacks is their negligible resale value,\" a spokesperson from the JAA said.\n\n\"In circumstances where jewellery is later sold, such as after the breakdown of a marriage, the intrinsic worth of a synthetic diamond is effectively zero, leaving only the value of the precious metal.\n\n\"On the other hand, because synthetic diamonds are substantially cheaper than natural stones, the overall financial loss to consumers can be lower.\"\n\nThe spokesperson noted that many buyers preferred natural diamonds for their geological rarity and the long-standing heritage of mined gemstones.\n\nA bench jeweller crafts a natural diamond earring in a workshop. (ABC News: Yiying Li)\n\nIn general, lab-grown diamonds are 30-70 per cent cheaper than natural ones per carat.\n\nThe price of lab-grown diamonds was expected to drop further as production capacity increases, the JAA said.\n\nTherefore, synthetic diamonds should not be considered investment stones and must be marketed accordingly, and retailers' clear disclosure remains paramount, the association said.\n\nDo lab-grown diamonds have a future in Australia?\n\nExperts say yes, with younger consumers being the main driving force.\n\nMillennials and gen Z would drive virtually all luxury market growth going forward, said Marty Hurwitz, a co-founder of the Global Diamond Trade Organisation (GDTO).\n\nMarty Hurwitz says the market for lab-grown diamonds could reach as much as 70 per cent by the end of 2026. (Supplied)\n\n\"These buyers prize sustainability, transparency, and digital fluency — values that are already reshaping every corner of discretionary spending,\" Mr Hurwitz said.\n\n\"Our research estimates show the current retail market share between 50-60 per cent in favour of lab-grown diamonds in Australia.\"\n\nHe said it could reach as much as 70 per cent by the end of 2026.\n\nSynthetic diamonds were also increasingly used in watchmaking and other design applications, the JAA noted.\n\nThe association added that sustainability and responsible sourcing were also influencing purchasing decisions in younger Australians.\n\nA miner shows an estimated 5 to 7-carat diamond found near an Angolan village. (Getty Images: Olivier Polet/Corbis)\n\nHowever, the JAA said it was important to recognise that natural diamond mining supported local employment and communities in several developing nations.\n\nHistorically, so-called \"blood diamonds\" or \"conflict diamonds\" had been used to help fund armed conflicts, particularly in Africa.\n\nOver the past couple of decades however there has been a concerted international effort to reduce trade in stones of dubious origin.\n\nWhat do jewellers think?\n\nJustin Linney, the creative director of Linneys, a natural diamond jeweller, has criticised some lab-grown diamond retailers for leveraging \"market confusion\" and providing \"misleading information\".\n\n\"The growth in synthetic diamond factories has been driven largely by the misleading marketing term 'lab-grown diamonds', when in reality these are synthetic by definition,\" he said.\n\nIt should be a considered choice to buy natural or lab-grown diamond jewellery. (ABC News: Yiying Li)\n\n\"For some consumers who thought they were purchasing a more environmentally friendly option they are now shocked to see the factory and conditions where these stones are produced.\n\n\" And for consumers who purchased synthetic diamonds over the last few years as a cost-effective alternative, these stones have since lost considerable value. \"\n\nWhile defending natural diamonds, Mr Linney has acknowledged the impact of lab-grown diamonds, saying his business has certainly seen a drop in sales of $4,000-8,000 diamond rings, where buyers in that market might be opting for synthetics.\n\nDifferent lab-grown diamond rings ranged from one to three carats on display. (ABC News: Yiying Li)\n\nMyrtle Polymenopoulos, the retail operations manager for Austen & Blake in Australia and New Zealand, which sells both natural and lab-grown diamonds, said lab-grown diamonds were not replacing natural diamonds but expanding the market instead.\n\n\"Lab-grown diamonds are reshaping the world of jewellery,\" Ms Polymenopoulos said.\n\n\"They have made larger stones, distinctive settings or bespoke creations accessible without stretching a customer's spend.\n\n\" It should be a considered choice with consumers fully aware of the facts and, importantly, the origin of their diamond. \"\n\nShe added that it would come down to the customer's perspective and priorities when deciding which kind of diamond to buy.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-25/political-differences-pressure-australian-couples/106048876",
    "title": "This couple is on opposite sides of the political divide. Here's how they make it work",
    "publish_date": "Wed, 24 Dec 2025 18:53:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Erin Rolandsen signed up for online dating, she set a filter to only search for men who identify as left-wing.\n\nIt wasn't long before her future husband popped up in her messages.\n\nThey were deep into dating before she realised he hadn't nominated his political preferences on his profile.\n\nAnd some of his views were, in fact, quite different to her own.\n\n\"We'd had discussions about current affairs, and I always thought he had very good opinions,\" she said.\n\n\" But it wasn't until significantly later that I realised he actually really loved political leaders that I despised. \"\n\nErin Rolandsen met her husband through online dating. (Supplied: Erin Rolandsen)\n\nReeling from this revelation but \"in too deep\", Erin had an epiphany one day during her commute — to work through their differences, she imagined the two of them riding on a bus together.\n\n\"He's looking out the right side and telling me what he sees, and I'm looking out the left side and telling him what I see,\" she said.\n\n\"Understanding both perspectives helps us understand our landscape better.\n\n\"What matters is that we remind ourselves that we are on the same bus and headed in the same direction.\"\n\nPolitics impacting more relationships\n\nPolitical differences are increasingly impacting our relationships, according to the latest national data.\n\nRelationships Australia says the number of couples struggling because of differing values and beliefs — including political views — has almost doubled in just two years.\n\nMore Australian relationships are being impacted by political differences. (Unsplash: Priscilla Du Preez)\n\nIts 2024 national survey revealed roughly a quarter of Australians said this was a major stress for their relationship — and experts say anecdotally, it is only getting worse.\n\nThe service's national executive officer Nick Tebbey says people are becoming increasingly resolute and \"in tune\" with their beliefs, and this is causing more conflict.\n\n\"The online community has given us permission to quickly block a person or unfollow a person if we don't like what they're saying,\" he said.\n\n\" But you can't suddenly stop talking to your partner of 10 years. \"\n\n'That creates a splinter'\n\nBen has dated several women on the other side of the political divide.\n\nThe 21-year-old, who has asked to change his name for anonymity, describes himself as \"centre-right\".\n\nHe said while political differences can be challenging, they are also a blessing.\n\n\"But both people must be open minded to each other's points of view,\" he said.\n\n\"Most of the time you both want the same outcome and just disagree on the process to get there.\"\n\nMore Australian couples say they are struggling because of different values and beliefs. (Unsplash: Pat Ferranco)\n\nBen believes biased mainstream media outlets are contributing to increasing strain between couples — but he said online algorithms were the biggest culprit.\n\n\"You only see far right and far left content. And if that's all you see, then that's what most people who don't do their due diligence will just believe,\" he said.\n\n\" That creates a splinter in the relationship. \"\n\nOnline algorithms a major driver\n\nMr Tebbey agreed online algorithms were a major driver of this shift, creating an echo chamber that feeds consumers more of the same content.\n\n\"That leads to an inability to see something from a different perspective, because I've had so much confirmation that my perspective is the right perspective,\" he said.\n\nNick Tebbey says more Australian couples are struggling with political differences. (Supplied.)\n\nA growing number of Australians are also opting to get their news — often heavily biased commentary or disinformation — from social media.\n\n\"They're accepting what they're reading online, as true as fact, without necessarily understanding that there could be a whole lot of different opinion and sometimes ulterior motives behind it,\" he said.\n\nMr Tebbey said some couples were now refusing to discuss politics entirely because of their differences.\n\nOthers are continuing to talk about it, but swiftly spiralling into arguments or miscommunication.\n\nThese clashes can have a \"domino effect\", Mr Tebbey said, triggering fears about other issues such as roles in the household or how to raise children.\n\n'This doesn't have to be the end'\n\nMr Tebbey said in some cases, breaking up may be the best option — but it's not always the first response.\n\n\"This doesn't have to be the end of a relationship,\" he said.\n\nYoung men flocked right in the US election. Will it happen here? Young men across the world have been embracing right-wing politics, while young women have moved to the left. Will it happen in the Australian election too?\n\nHe advised couples to set ground rules around future political discussions to ensure they are open and respectful.\n\n\"For instance — we will hear each other out and try to see things from the other's perspective without immediately minimising or ridiculing the other person for the beliefs they have,\" Mr Tebbey said.\n\n\"That isn't easy, because we get built up in our own beliefs that we're right and everyone else must therefore be wrong.\"\n\nHe also recommended couples seek support and counselling.\n\n\"This is an issue that's affecting a lot of people,\" he said.\n\n\"You're not alone.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-25/christmas-songs-quiz-traditional-carols/106133808",
    "title": "Quiz: How well do you know traditional Christmas carols?",
    "publish_date": "Wed, 24 Dec 2025 18:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Do you know your Merry Gentlemen from your Three Kings? Test yourself on our quiz — and when you're done, try our modern Christmas songs quiz.\n\nLoading\n\nWhere to find all the ABC's quizzes\n\nWant to test yourself even further?\n\nTake a squiz at the ABC's New Quiz topic page and see if you're a whiz at our previous quizzes.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/does-china-have-a-robot-bubble-20251218-p5nos9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Does China have a robot bubble?",
    "publish_date": "Thu, 25 Dec 2025 13:00:00 +1100",
    "category": "finance",
    "authors": [
      "Meaghan Tobin",
      "Xinyun Wu"
    ],
    "text": "Robots made by Chinese startups have danced on television, staged boxing matches and run marathons. When one company debuted its most recent robot last month, people online in China thought it looked so much like a human that workers cut the robot’s leg open onstage to reveal its metal pistons.\n\nDespite the public fascination, concerns are growing that China’s robotics industry is moving too fast. The robots can mimic human movement and even complete basic tasks. But they are not skilled enough to handle many tasks now done by people. And with so many companies rushing into the industry, Beijing is warning of a bubble.\n\nA robot competes in a half-marathon in Beijing. Credit: Getty Images\n\nMore than 150 manufacturers are vying for a piece of the market, the Chinese government said last month, warning that the industry was at risk for a crowd of “highly repetitive products.”\n\n“China has an attack-first approach when it comes to the adoption of new technology,” said Lian Jye Su, a chief analyst at Omdia, a tech research firm. “But this generally leads to a large number of vendors fighting for small chunks of market.”",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/politics/federal/looking-for-a-christmas-day-movie-try-a-dingo-ate-my-christmas-spirit-20251223-p5npog.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Looking for a Christmas Day movie? Try A Dingo Ate My Christmas Spirit",
    "publish_date": "Thu, 25 Dec 2025 13:00:00 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "Actors are almost interchangeable. Oy to the World! features Canadian actor Brooke D’Orsay, who has appeared in 10 Christmas-themed movies since 2017 including Deck the Halls on Cherry Lane, Nostalgic Christmas and Christmas in Love. You can’t describe the plots as vanilla as that would be an offence to the vanilla bean. The plot of some Hallmark movies would cause offence to the vanilla bean. Credit: Good Weekend There’s almost always a “career-driven” female lead (normally from an evil metropolitan centre like New York) who, for some reason, has to return to an obscure country town. There, she’s likely to face off against a brooding hulk of a gent (with a chance he is a widower). They fight, they resolve, they fall in love. Snow falls and Christmas carols are sung.\n\nLoading So formulaic are these movies, as an experiment, I used AI to see if it could come up with a Hallmark-style Christmas movie but set in an Australian context and featuring a kangaroo. Here’s the plot to “A Dingo Ate My Christmas Spirit”: Chloe Peterson is “a highly successful, driven marketing executive from Sydney” who has a “perfectly un-Christmassy demeanour”. She’s told by her boss to take a digital detox. So Chloe ends up renting a place in a fictional small town north of Brisbane called “Jingle Bells Bay”. The rental is double booked, so she has to share with a chap called Liam O’Connell, who is described as a “ruggedly handsome, widowed wildlife park ranger” and his daughter Daisy. There’s a kangaroo called Rudolph (he has a medical condition that gives him a red nose) who causes all sorts of trouble around the town.\n\nChloe uses her big-city skills to save Liam’s wildlife sanctuary from closure. Her boss turns up on Christmas Eve to say she’s got a promotion but to get it she has to catch the plane about to leave for Sydney. You know what happens. There’s a spare seat on the direct flight from Jingle Bells Bay to Sydney. Die Hard … one of the great Christmas movies. But it wouldn’t fit with the AI-generated world of Hallmark. I varied my parameters (including a Hitchcock version, a horror, an action adventure, one set in the South Pole, an Agatha Christie version, one set in space) and they all pumped out variations of my dingo movie. That AI could generate a series of workable plots should not be a surprise. Creating 40 films with a Christmas theme every year invariably means they will look and feel the same. These aren’t destined to win an Oscar – they are the cheap stocking fillers of film.\n\nLoading But they work for Hallmark and its viewers. These movies are watched (and attract constant ratings on IMDB around 5.5 out of 10) by tens of millions. They make Hallmark, which makes most of these shows in Canada to take advantage of tax concessions and films them on a shoestring, hundreds of millions a year. They’re so popular that next year you can go on a Hallmark Christmas cruise from Florida to the Bahamas. Go onboard to meet some of your favourite Hallmark actors, and enjoy a “Silent Night disco” while swilling a bit of eggnog.\n\nHundreds of actors who would otherwise struggle to afford a gingerbread man make a living frolicking in Hallmark’s fake snow. There’s an entire cottage industry now built on these movies which also extends to social media, where people express their views on all aspects of the Christmas film offerings. You know you’ve reached peak pop culture importance when it crosses over into academia. A Canadian university doctoral student, Megan Lauzier, this year produced a thesis titled More Than Meets the Eye: Unpacking the Popularity of Hallmark Movies. Lauzier argues Hallmark’s social media strategy was a key element to the popularity of “its seemingly unremarkable movies”.\n\nSo predictable are Hallmark movies that Seth MacFarlane used his Family Guy series this year to release a parody with the title “Disney’s Hulu’s Family Guy’s Hallmark Channel’s Lifetime’s Familiar Holiday Movie”. IMDB now lists 503 Hallmark Christmas movies, with the overwhelming majority of them created since 2008. That’s the year after Netflix started its streaming service, a year after Twitter (now X) and a couple of years before Instagram. So formulaic are Hallmark movies that Family Guy this year released its own parody. Credit: Disney+ Pop culture has always been economically driven. But Hallmark and its Christmas movies are at an entirely new level, delivering economic opportunities in ways unimaginable a few years ago. The interaction of technology, tax concessions, streaming services with hours to fill, advertisers looking for specialist markets, real (and artificial) social media influencers is literally playing out on our televisions/handheld devices.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/lifestyle/catherine-princess-of-wales-and-princess-charlotte-perform-piano-duet-20251225-p5nq2h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Catherine, Princess of Wales, and Princess Charlotte perform piano duet",
    "publish_date": "Thu, 25 Dec 2025 12:47:19 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Catherine, Princess of Wales, and Princess Charlotte perform piano duet\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/sometimes-childlike-wonder-points-to-something-adults-don-t-allow-ourselves-to-see-20251225-p5nq1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sometimes, childlike wonder points to something adults don’t allow ourselves to see",
    "publish_date": "Thu, 25 Dec 2025 12:30:00 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "I got my son an Elf on the Shelf this year. Do I regret it? Absolutely. But it reminded me of something this holiday season, something too easy to forget in our modern age.\n\nFor an otherwise bright child, my son is convinced that the elf is real in the sense that he moves himself around the house at night and ends up in all sorts of compromising positions by morning. The elf can even help with various tasks during the wee morning hours.\n\nChildren have a wonderment about Elf on the Shelf that adults might learn from.\n\nMy son believes that the elf is, in a word, enchanted. I never knew this about my child before getting the elf. I wonder how many other things he believes to be enchanted, too.\n\nIt’s what so many of us crave at this time of year. The presents, the twinkly lights, the feasts, the songs, long afternoons with loved ones. The hope is that it will all add up to more than the sum of the parts. And maybe if the parts are big enough, we might well summon the Christmas spirit.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/national/car-with-hanukkah-sign-firebombed-on-christmas-morning-20251225-p5nq2d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Car with Hanukkah sign firebombed on Christmas morning",
    "publish_date": "Thu, 25 Dec 2025 11:59:53 +1100",
    "category": "finance",
    "authors": [],
    "text": "Car with Hanukkah sign firebombed on Christmas morning\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/express-speed-australia-choose-all-pace-attack-for-boxing-day-test-20251225-p5nq1j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Furry and green’: The MCG Grinch that cruelled spinner’s Boxing Day hopes",
    "publish_date": "Thu, 25 Dec 2025 11:54:07 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "Melbourne’s green MCG pitch is the Grinch who stole Boxing Day from Todd Murphy, while Cameron Green’s Test spot is on notice with a demotion to No.7 in the order as Australia seek to batter their way to 4-0 in the Ashes series.\n\nAs England’s players trained on the outfield in Santa hats passed to them after they got off the team bus on Christmas morning, Australia’s stand-in captain Steve Smith pointed to the surfaces increasingly prepared around the country as the reason why Murphy did not even make the 12.\n\nSpinner Todd Murphy (left) won’t be playing in the Boxing Day Test as an all-pace attack including Scott Boland (right) was given the green light. Credit: Getty Images\n\nJhye Richardson, Brendan Doggett and Michael Neser are competing for two pace spots alongside Mitchell Starc and Scott Boland, with a final call to be made on match morning.\n\nIf Murphy is also left out in Sydney, Australia will have picked a specialist spinner just twice in five Tests this summer, having done so for every match played in this country dating back to a WACA Ground game against India in January 2012. Smith described Adelaide Oval’s surface, which spun for Nathan Lyon before he tore a hamstring, as anomalous.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/hamilton-hill-fire-destroys-three-units-on-christmas-morning-20251225-p5nq29.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hamilton Hill fire destroys three units on Christmas morning",
    "publish_date": "Thu, 25 Dec 2025 11:13:48 +1100",
    "category": "finance",
    "authors": [
      "Heather Mcneill"
    ],
    "text": "Three households are spending their Christmas morning devastated after a fire ripped through a Hamilton Hill unit complex overnight.\n\nThe blaze started around 2.45am on Thursday on Erpingham Road, with three residential units severely damaged.\n\nThe damaged complex in Hamilton Hill. Credit: 9 News Perth\n\nFirefighters attended, with the roof structure of the building destroyed by the flames.\n\nTwo people were taken to Fiona Stanley Hospital to be treated for smoke inhalation, while others were treated at the scene.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/traveller/inspiration/cruising-is-booming-in-asia-and-that-s-good-news-for-australians-20251114-p5nfho.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cruising is booming in Asia and that’s good news for Australians",
    "publish_date": "Thu, 25 Dec 2025 10:25:00 +1100",
    "category": "finance",
    "authors": [
      "Brian Johnston"
    ],
    "text": "Advertisement\n\nInspirationCruises Cruising is booming in Asia and that’s good news for Australians Brian Johnston December 25, 2025 — 10:25am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nI’m glad to say that Asian cruising continues to trend, giving cruisers increasing choices over the next two years on all shapes and sizes of ships. If you’re a big-ship enthusiast, then Norwegian Cruise Line, in response to strong demand for Asian cruises, is sending four ships to Asia for a bumper 50-voyage season finishing in April 2027. Norwegian Jade makes its Asian debut in October 2026; guests can embark in Tokyo, Incheon, Hong Kong or Singapore. Norwegian Sky sailing past Mount Fuji in Japan. Princess Cruises will see its biggest Japan season ever in 2027, when Diamond Princess and Sapphire Princess sail 78 departures. Among the highlights are cherry-blossom voyages, a circumnavigation of Japan, and cruises that take in the Okinawa islands and Taiwan. Between November 2026 and March 2027, Diamond Princess will homeport in Singapore and offer 11 sailings to 28 ports across the region.\n\nAdvertisement\n\nAnd Carnival Cruise Line is sending two ships – Carnival Luminosa and Carnival Adventure – to Asia for the first time over the 2026-27 season. Although they sail only four itineraries, the move finally recognises Asia as a cruise destination in itself, rather than somewhere to pass through on repositioning cruises. Among the itineraries is Sydney-Singapore, Tokyo-Singapore and a roundtrip voyage from Singapore taking in ports in Thailand, Vietnam and Cambodia. Carnival ships will visit Hong Kong, Osaka, Fukuoka, Seogwipo (Jeju) and Keelung for the first time. Royal Caribbean’s Navigator of the Seas. After an even bigger ship? Royal Caribbean’s Navigator of the Seas will homeport for the first time in Singapore between October 2026 and February 2027 and sail three to 12-night cruises to destinations such as Penang, Phuket, Langkawi, Bangkok and Ho Chi Minh City before heading towards Japan on East Asia itineraries. If it’s a smaller, luxury experience you’re after, Seabourn too is rolling out new Asian voyages between December 2026 and April 2027. Its Japan voyages notably visit not just big-name ports but smaller ones such as Toba, Miyako, Sendai and Hitachinaka.\n\nAdvertisement\n\nSeabourn Encore will also sail a 12-day voyage from Hong Kong to Tokyo, and South-East Asian voyages between Singapore and Hong Kong or round-trip from Singapore. Related Article Cruises This latest cruise company slogan spotlights a cringeworthy tradition The news is just as good for those keen on expedition cruising. New Zealand company Heritage Expeditions is upping its Asian offerings, Lindblad Expeditions is offering diving expeditions in Indonesia from October 2026, and Aqua Expeditions has launched seven-night voyages in South Raja Ampat from December 2026. New Australian expedition company Pearl Expeditions will sail in Indonesia and Papua New Guinea from the end of this year. Coral Expeditions continues to operate throughout Indonesia and is increasing capacity in Papua New Guinea on new itineraries in October and November 2026. And finally, after a five-year pause, G Adventures is returning to Sri Lanka from next month with cruises by catamaran along the southern coast that mix UNESCO-listed port town Galle with remote beaches and fishing village Kudawella for swimming, snorkelling and surfing.\n\nSign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Cruises\n\nOcean cruises\n\nAsia Brian Johnston seemed destined to become a travel writer: he is an Irishman born in Nigeria and raised in Switzerland, who has lived in Britain and China and now calls Australia home.\n\nTraveller Guides",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/ben-stokes-leadership-is-fracturing-has-it-cracked-or-fully-shattered-20251224-p5npzw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ben Stokes’ leadership is fracturing. Has it cracked or fully shattered?",
    "publish_date": "Thu, 25 Dec 2025 09:50:00 +1100",
    "category": "sports",
    "authors": [
      "Malcolm Knox"
    ],
    "text": "The mystery box, the deciding half of the contest, was how England’s bowling would go against Australia’s batting (or, as it looked in the first innings in Perth, vice versa). England’s eschewal of spin was not a bad plan. Muttiah Muralitharan was ineffective on Australian pitches, as were Ravi Ashwin, Rangana Herath and Yasir Shah. Anil Kumble, Graeme Swann and Saqlain Mushtaq did passably well. Much has been made of Travis Head’s batting in Perth, but he had plenty of luck, and England’s bowling was awful. Credit: Getty Images Year after year we see that it takes a lifetime of patience and spin bowling smarts in Australian conditions to eke out success. Lacking the required talent, England sensibly opted for pace. The promise was that Jofra Archer, Mark Wood, Brydon Carse, Gus Atkinson, Josh Tongue, Matthew Potts and Stokes would batter Australia’s brittle top order with speed. They haven’t been good enough or fit enough, and Australia have winkled out winning totals by osmosis. Much has been made, rightly, of Travis Head’s second innings in Perth. He was also streaky and lucky. But England’s bowling was horrible, and if Head hadn’t played that winning knock it’s likely that Steve Smith and the middle order would have found 200 runs between them.\n\nArcher’s lines, as much as his fall in pace, were woeful. Wood was gone. Carse and Atkinson were either confused by poor instructions, tired due to their lack of practice, or too easily discouraged by the counter-attack from Head and Jake Weatherald. In Brisbane and Adelaide, England wilted in the heat and again bowled inconsistent lengths. Archer picked up some wickets through Australian inattention, and bowled fast at times, but the home batsmen were able to see him off, knowing he could not return for good spells. Jofra Archer’s performances have been mixed, at best. Credit: Getty Images They eventually managed it against Jasprit Bumrah last season, and Archer is no Bumrah. The other bowlers were pedestrian. When Alex Carey steadied his partners in Brisbane and Adelaide – those sequences of play where the Ashes were decided – England’s bowling did not challenge them consistently. Big Test series are usually won at the margins: dry spells of bowling, tail-end runs and basic fielding.\n\nAustralia’s bottom five partnerships contributed 219 runs in Brisbane and 186 in the first innings in Adelaide. In the field, for every screamer snatched by the Australians, there have been two catches dropped by England. Loading On the third afternoon in Adelaide, when the Ashes were there to be won or lost, Stokes did not bowl, and he gave Archer the ball belatedly and cautiously. He set fields that enabled Head and Carey to rotate the strike at their leisure. When Head was losing concentration, Carey calmed him down, but the task was made easier by England’s sloppy bowling and slackness in the field. What was in Stokes’ mind? He said his body was breaking after his defensive vigil with the bat, and evidently two and a half hours of batting had done Archer in. Yes, it was hot, but try telling Greg Matthews that. In the tied Test in Chennai in 1986, in 50-degree heat, Matthews batted for three hours across both innings and bowled 78 overs, some of them in a vest. Ravi Shastri bowled 61 overs and batted for four hours. The late Dean Jones’ feats have gone down in cricketing folklore and medical literature. Not to say they built them tougher in those days, but still, Stokes’ actions in Adelaide looked very much like a disappointed man throwing a tantrum, or a sulk, against his own teammates.\n\nWhen there is such a difference in outcricket (the basics of bowling and fielding) the one key factor separating Australia and England in these Ashes – the problem is nearly always leadership. Leadership can’t produce talent from nowhere, but it can set a productive frame of mind, keep spirits high, sustain concentration and control the controllables. Stokes’ brand of leadership has been top-down, bloody-minded and bullying. Whatever speeches he has given, the messages from his performances have been to challenge teammates to follow him and deride them as “weak” if they can’t; to stonewall and take no risks in preserving his own wicket, heaping pressure on the others; and to let his passions override his composure in the field, leading to self-evidently poor tactics, fields that don’t suit his bowlers and emotional decision-making. Ben Stokes’ actions in Adelaide looked very much like a disappointed man throwing a tantrum. Credit: Getty Images Stokes’ personal contributions with bat and ball have been strong, and he is capable of more highlights in Melbourne and Sydney. But runs and wickets are only part of the picture, and when time has passed and players produce their memoirs of this tour, don’t be surprised if there are stories of Stokes going a bit Colonel Kurtz from Apocalypse Now on his team in 2025. His batting, in the series, has been pure Kurtz: “Out there on his own, operating without any decent restraint”. This is not a criticism of the way he has batted per se, but it can only have been read, in his team, as a criticism of them and a withdrawal of the paternal blessings and encouragements he had heaped on them since 2022.\n\nIt is probably a burden of the past. Loading Stokes has been England’s best cricketer and dominant personality, but by now his warrior-exemplar model of captaincy appears to have trapped him. He’s trying to play that Headingley 2019 innings every time: block everything for three hours and demand that someone stays with him. The outrageous luck he received on the field at Headingley and in the 2019 World Cup final left him with a messianic status in English cricket. When he has lived up to it, he has had the attributes of a magical leader who requires from his team only the simple donation of their absolute faith. Whatever trouble they get in, Stokes will save them. It’s been called a cult of personality even by media who have knowingly aided and abetted it. When cults of personality collapse, they do so suddenly and in the most undignified manner.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/world/north-america/unwelcome-on-american-soil-us-bans-european-ideologues-accused-of-censorship-20251225-p5nq15.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Unwelcome on American soil’: US bans European ‘ideologues’ accused of censorship",
    "publish_date": "Thu, 25 Dec 2025 09:30:40 +1100",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "New York: The Trump administration has taken the extraordinary step of barring five European “ideologues” from entering the United States, accusing them of coercing American tech companies into censoring certain viewpoints.\n\nThe move sparked intense backlash from European leaders and could yet be expanded to ensnare Australians, with the eSafety Commissioner previously mentioned in the same vein as some of the sanctioned individuals.\n\nFormer European commissioner for digital markets Thierry Breton was among the five individuals banned by the United States for “censorship”. Credit: Bloomberg\n\nThose barred from the US include Thierry Breton, a former European Commissioner for Internal Markets and Digital Services, who is described as the “mastermind” of Europe’s Digital Services Act, which is loathed by the Trump administration.\n\nThe ban also applies to Imran Ahmed, a British Labour strategist who is now chief executive of the Centre for Countering Digital Hate, a group campaigning against disinformation online. Ahmed lives in Washington and faces immediate deportation, London’s Telegraph reported.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/business/markets/rich-like-bill-gates-meet-the-saudi-sisters-wielding-75-billion-in-a-man-s-world-20251217-p5nod3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rich like Bill Gates: Meet the Saudi sisters wielding $75 billion in a man’s world",
    "publish_date": "Thu, 25 Dec 2025 08:54:48 +1100",
    "category": "finance",
    "authors": [
      "Devon Pendleton",
      "Dinesh Nair",
      "Abeer Abu Omar",
      "Todd Gillespie"
    ],
    "text": "A US-based representative for the Olayan Group didn’t comment and directed all requests to a Saudi-based spokesperson, who didn’t respond to a detailed list of questions. Most global executives are reluctant to speak about the family for fear of offending the sisters, who are known to fiercely guard their privacy. This story is based on an analysis of the family’s investments, operating companies and filings of family-owned entities, as well as interviews with more than half a dozen people familiar with the group, who asked not to be named discussing information that isn’t public. Wall Street bosses Hutham and Lubna, both in their early seventies, were born in Saudi Arabia to Suliman Olayan. The patriarch was orphaned at a young age and started out working as a dispatcher for the predecessor company of Saudi Aramco, leveraging his fluent English. He mortgaged his house for $US8000 to win a pipeline contract, according to a profile in Time magazine, eventually launching the Olayan Group in 1947. From there, Suliman diversified aggressively, and the group went on to strike partnerships to sell Colgate toothpaste, Oreos and Coca-Cola in the kingdom. He bought US equities to use as credit with American banks and by 1980, his conglomerate brought in more than $US300 million in annual revenue, according to the Time profile.\n\nLoading His globalist bent created a uniquely bi-national empire that the daughters were immersed in early. Both studied in the US and were given significant jobs in the family business on their return. After Suliman’s death in 2002, his son Khaled was named chairman of Olayan Group, but Lubna and Hutham helped run much of the family’s vast operations. Lubna led the Mideast-focused division and Hutham took charge of Olayan America. The sisters married foreigners and took on prominent roles — Lubna was the first woman elected to the board of a public company in Saudi Arabia in 2004. Even then, women’s rights were severely limited in the kingdom. Only in 2018 were women finally given the right to drive. Low profile In an interview with NPR in 2018, Lubna recalled the difficulty finding a ladies room in factories and boardrooms because there were usually no women. She began approaching government officials and executives for help boosting the female workforce — all the while being reminded to tread carefully and attempting to avoid confrontation.\n\n“So, you negotiate, you deal, you do this, you take and give,” she said in the interview about those early efforts. Along the way, the sisters developed reputations for being steely negotiators. Their ascent was aided by an ability to keep a low profile and the duo ensured their business was seen as supportive of the government’s aims. The group is now officially headquartered in Liechtenstein, with offices around the world, including in Athens, where Lubna’s lawyer husband has deep ties. Over the years, the family has gained a reputation for running a stringently professional organisation that’s sophisticated in its dealmaking at a level not typically seen at family offices. The Olayans are deemed richer than Prince Alwaleed bin Talal, the royal known as Saudi Arabia’s Warren Buffett. Credit: AP “The family was very conscious of incorporating corporate governance frameworks into their business, and they did it with a high level of professionalism,” said Josiane Fahed-Sreih, director of the Institute of Family and Entrepreneurial Business at Lebanese American University.\n\nIn one sign of their influence, the Olayan family was untouched in 2017 when dozens of Saudi royals, former officials and businessmen, including Alwaleed, were detained at the Ritz-Carlton in Riyadh as the crown prince consolidated power and conducted an unprecedented national shakeup. Investing misstep Alwaleed, worth about $US17 billion these days, has made a comeback of sorts in recent years and his investment group has benefited from the kingdom’s construction frenzy. In the 1990s, the businessman was known for a flamboyant lifestyle, frequently pictured on a private yacht purchased from Donald Trump. The Olayans do things differently. “Normally we don’t seek the limelight…especially anything splashy,” Hutham said about the Olayan family in a speech to the Arab Bankers Association of North America in 2013. “We avoid excess, and we are pretty frugal.”\n\nEven so, there have been investing missteps. A longtime investor in Credit Suisse, they stuck by the bank even through its downturn, ultimately becoming one of the big losers in the turmoil that culminated with UBS Group’s discount purchase of the troubled lender. The losses were at a scale that could roil large financial firms, but one international executive recalls the collapse being treated as a relative non-event within the Olayan Group. The conglomerate continued to execute transactions and payments as normal during the period, the person said. Loading Saudi National Bank, the Swiss lender’s top shareholder, was among firms that lost money on its investment and its chairman resigned in the aftermath. Meanwhile, the Olayans’ profile has only grown in the years since. Key to that are their relationships on Wall Street and within the kingdom, particularly as Riyadh has started to intensify pressure on foreign firms to invest more locally and help diversify the economy.\n\nDespite recent fiscal pressures, Saudi Arabia remains a lucrative market for the titans of global finance: Riyadh ranks as one of the biggest issuers of debt in recent years, while the kingdom’s wealth fund has shown an appetite for blockbuster deals like the recent $US55 billion transaction to take Electronic Arts Inc private. Lubna has close connections to BlackRock co-founder Larry Fink, among others, and was recently named co-chair of the US-Saudi Business Council alongside Citi’s Fraser. Hutham sits on the board of Brookfield, which ranks as one of the biggest private equity investors in the Middle East. Davos in the Desert This year, during Saudi Arabia’s Future Investment Initiative conference, often called Davos in the Desert, Lubna hosted a party in Riyadh that had top global financial executives and officials mingling over canapés and rice and lamb, according to one attendee. Their links run broader than just finance. The US equity investments their father started to amass in the 1960s have grown to $US12.7 billion. These days, the portfolio includes stakes in Microsoft, Alphabet and Amazon. By comparison, Saudi Arabia’s $US1 trillion wealth fund owns just over $US19 billion in US stocks.\n\nThe group’s private equity portfolio forms another large chunk, and is estimated to run into the tens of billions of dollars, according to people familiar with the matter. Compounded annual growth rate for direct investments has exceeded 30 per cent over a 10-year period, according to its website. The firm’s real-estate holdings span more than 40 million square feet and 40,000 apartments under management. At home, the Olayans have backed the kingdom’s biggest efforts. When Saudi Aramco’s $US25 billion IPO struggled to attract international investors in 2019, the Olayan family was among those tapped locally by the administration of MBS — as the de facto ruler is called — to shore up demand. Lubna Olayan has successfully navigated the obstacles for women in the Saudi business world. “You negotiate, you deal, you do this, you take and give,” she says. Credit: Bloomberg At the same time, the sisters have managed a careful balancing act with their public comments. In 2018, as much of Wall Street avoided the kingdom’s FII conference after Saudi agents murdered columnist Jamal Khashoggi, Lubna used the start of a panel discussion to mourn his death, saying that the act ran counter to Saudi values. “We are very grateful that the terrible acts reported in recent weeks are alien to our culture and our DNA,” Lubna said in her address.\n\nThese days, Lubna is chair of the Olayan Group’s corporate board, according to a recent press release from the US-Saudi Business Council. Hutham chairs the shareholders’ board, the group’s website says. Day-to-day operations are mostly managed by the likes of Chief Executive Officer Hani Lazkani and Chief Operating Officer Samer Yaghnam, people familiar with the matter said, though the sisters remain the public face of the group and helm broad strategy with family members. Loading Multiple people described Lubna as frank and outgoing, with a reputation for being deeply involved with her investments. Like her father, she’s worldly and warm but also incisive, said James Zogby, president of the Arab American Institute and a friend of the late Suliman. “If you talk with her about current events, it’s not just, ‘This happened.’ She understands why things are moving the way they are.” Hutham, meanwhile, appears soft-spoken and grandmotherly in conversation, but her line of gentle questioning can elicit small details that can serve as fodder for the negotiating table, according to one international executive.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/world/doj-says-it-will-need-more-time-to-release-epstein-files-20251225-p5nq1k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "DOJ says it will need more time to release Epstein files",
    "publish_date": "Thu, 25 Dec 2025 08:19:45 +1100",
    "category": "finance",
    "authors": [],
    "text": "DOJ says it will need more time to release Epstein files\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-full-beauty-of-lake-st-clairs-depths-is-revealed/ow0spmuj1",
    "title": "The full beauty of Lake St Clair's depths is revealed",
    "publish_date": "Wed, 24 Dec 2025 20:30:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIn Tasmania's wilderness sits Australia's deepest lake: Lake St Clair.\n\n\n\n\n\nThousands visit every year but until now, the underwater landscape has remained somewhat of a mystery.\n\n\n\n\n\nHydrographic surveyor Augustin Déplante, from the CSIRO, recently led a team that mapped the lake bed for the first time.\n\n\n\n\n\n\"When I saw that the deepest lake in Australia had never been surveyed with the multi beam, I was very surprised. But I guess if it was easy to do it would have already been done.\"\n\n\n\n\n\nThe team used a multibeam sonar to map the lake bed over nine days.\n\n\n\n\n\n\"Basically, it's just as if we emptied the lake of its water, and we're walking around and we're mapping it out. So I think it's going to be quite fascinating.\"\n\n\n\n\n\nTheir work has revealed an underwater landscape that's never been seen before.\n\n\n\n\n\n\"We can see the input of fresh water basically coming into the lake from the mountains and it's carving through the lake floor so we have these waterfalls basically coming down into the lake and then reaching the cliffs, it's pretty incredible to look at and you can see the trees as well sometimes overhanging these areas, it's quite spectacular.\"\n\n\n\n\n\nMichael Croghan has been running a Lodge at the southern end of the lake for almost 20 years.\n\n\n\n\n\n\"Personally, I would describe the lake as my church. It is the most peaceful place on this planet. I may be biased, but so many other people are saying the same thing. Visually stunning, never the same two days in a row. The most phenomenal place to swim, because it's, as I said, it's the cleanest air and it's the cleanest water in the world.”\n\n\n\n\n\nHe keeps a special bottle of gin behind the bar that was lowered to the bottom of the lake a few years ago by a different team of researchers.\n\n\n\n\n\n“Just for giggles one night, I said to them, would you take a bottle of gin, put it on the bottom of the lake and take a photograph? And they're like, Yeah, sure. So I'm like, okay, great. So they did.”\n\n\n\n\n\nIt didn't go down to the deepest point - but it still surpassed 100 metres.\n\n\n\n\n\n“They did the best they could, but they brought the bottle back, and it just sits behind the bar. It's now been depth tested. I think that was about 120 metres.\"\n\n\n\n\n\nAugustin Déplante says the mapping shows the deepest point of Lake St Clair plunges to about 163 metres.\n\n\n\n\n\n\"It's about towards the south on the western side, just in the corner, basically, we can almost see the glacier would have really, like, you know, grinded through that corner.\"\n\n\n\n\n\nCloser to shore, a remotely-operated vessel known as the OTTER completed the mapping.\n\n\n\nIt was piloted by autonomous systems research engineer Dr Hui Sheng Lim.\n\n\n\n\n\n\"It can go really shallow into regions, like less than less than two metre, even less than a metre, as well. As long as there's no, like, hidden rocks or anything underneath the surface. So those are the areas where the big vessel won't be able to get to.\"\n\n\n\n\n\nThe Otter revealed areas close to shore with sharp drop-offs.\n\n\n\n\n\n“What we are trying to do, it's like mapping the shallow region so you can actually see how the contour changes on the shoreline. And you'll see how quick that actually dropped from the shoreline, like all the way down to 50 metres, like you can see a metre here, and then next moment you are in a 10 metre zone, and next moment you're already in, like, 30 metre, 50 metres deep.”\n\n\n\n\n\nOtter can also operate autonomously, following a precise, pre-planned path.\n\n\n\n\n\n\"One of the most useful features is we will be able to autonomously find gaps and find the best way to cover those missing gaps in our data sets.\"\n\n\n\n\n\nThe detailed data collected will be made public, providing an important resource it's hoped will fuel further study of Lake St Clair.\n\n\n\n\n\nIt will include what might be found in the depths.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/some-christmas-customs-you-mightve-never-heard-about/22zgxznkb",
    "title": "How Australia’s migrant communities put their own spin on Christmas",
    "publish_date": "Wed, 24 Dec 2025 18:34:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "For many, Christmas arrives with more than tinsel, pine trees and carols — it comes layered with accents, aromas and a dazzling array of traditions.\n\n\n\n\n\nBeneath the Australian summer sun, migrant communities bring their own spin to the season, turning the country into a tapestry of festive customs.\n\n\n\n\n\nThis tapestry is woven from Australia's rich multicultural makeup, and the multitude of Christmas traditions found across the globe.\n\n\n\n\n\nTo capture just a small slice of this diversity, foreign-born journalists across the SBS newsroom wrote about Christmas traditions in their countries of origin and, in some cases, how they've made the season their own in Australia.\n\n\n\nCarols with a desi twang\n\nFor many Indian Australians, Christmas is a lively blend of faith, music and food, infused with the sounds and flavours of home.\n\n\n\n\n\nTraditional carols are often reworked with Punjabi beats and rhythmic twang, transforming familiar hymns into upbeat performances that invite clapping and joy.\n\n\n\nREAD MORE Oh ho ho ho! Sikh Santa lights up Canadian streets with Bhangra moves\n\nAmong Malayalees in Australia, Christmas is celebrated even more widely than Diwali, the Indian festival of lights that marks the triumph of good over evil.\n\n\n\n\n\nThis shouldn't be too much of a surprise, given that around 67 per cent of Australian Malayalee — a cultural group hailing from the southern Indian state of Kerala — identify as Christian, according to the 2021 Census.\n\n\n\n\n\nThe season is marked by the setting up of cribs depicting the birth of Jesus and lively carol processions, in which community members move from house to house, spreading Christmas cheer.\n\n\n\nFood plays a central role in the festivities — breakfast often features appam (fermented rice pancakes) with rich duck stew, followed by festive spreads of biryani (mixed rice dish made with spices, meat or vegetables) and other cherished dishes shared with family and friends.\n\n\n\nTimorese traditions: Food, picnics and card games\n\nBeyond church services and festive feasts, card games have become a beloved Christmas tradition for Timorese families worldwide.\n\n\n\n\n\nGames such as poker, rummy, and the popular seven-card game bring generations together around tables and picnic mats, with larger families often setting up multiple playing areas.\n\n\n\n\n\nThe stakes are minimal, sometimes as little as 10 cents, keeping the focus on fun and connection rather than potential gambling earnings.\n\n\n\nWhether in living rooms or outdoors, the gentle shuffling of cards, mixed with laughter and storytelling, is a familiar soundtrack to the Christmas season in Timor-Leste.\n\n\n\n\n\nThis simple yet meaningful ritual has become a cultural cornerstone, uniting Timorese families at home and abroad during the year's most cherished holiday.\n\n\n\nThe Philippines' Mariah Carey and bottle cap tambourines\n\nIn the Philippines and for many Filipinos living around the globe, September signals the start of the Christmas season.\n\n\n\n\n\nAround that time, social media pages are flooded with images of a Filipino Christmas icon and messages like 'Are you ready?', 'It's that time of year, 'Nearly there,' and many other phrases reminding Filipinos that Christmas is just around the corner.\n\n\n\nThis iconic Filipino singer is Jose Mari Chan, whose song Christmas In Our Hearts is widely considered the Philippines' answer to Mariah Carey's All I Want for Christmas Is You.\n\n\n\n\n\nChristmas in Our Hearts, which was originally recorded with Chan's daughter, embodies the Filipino Christmas spirit, celebrating Catholic faith and family togetherness as the centre of all celebrations.\n\n\n\n\n\nChristmas for Filipinos also means a playlist of carols echoing through shopping malls and church walls, with both the old and the young singing them.\n\n\n\n\n\nApart from the traditional carols, you can also see children singing around the neighbourhood with their own makeshift instruments, such as old cans as drums and flattened bottle tops, collected and bunched up in wire, as substitutes for tambourines.\n\n\n\n\n\nA Filipino Christmas is an experience of not only music, faith and family, but also a table full of traditional ham, Filipino Christmas rice cakes like puto bongbong, bibingka, sikwate (hot chocolate) and queso de bola (cheese) on Christmas Eve, with leftovers for Christmas Day.\n\n\n\nUnder the mistletoe: Xmas romance in Japan\n\nWhile many have probably heard of the peculiar Japanese tradition of eating KFC on Christmas, this isn't the only unique way the holiday is marked in Japan.\n\n\n\n\n\nFor many young couples, Christmas is often a romantic day spent exchanging gifts over a fancy dinner.\n\n\n\n\n\nConsequently, for those without partners, it can be a challenging time of year.\n\n\n\n\n\nWhile it's difficult to pinpoint the origin of this trend, it appears to be the result of successful marketing campaigns, much like the KFC 'tradition'.\n\n\n\nIn the 1980s, Japan experienced an economic boom that fuelled people's appetite for spending. Marketers seized the opportunity and aggressively promoted upscale date and gift ideas to coincide with holidays like Christmas.\n\n\n\n\n\nAlthough many nowadays opt for more cost-efficient options, the custom is still very much alive.\n\n\n\nEach year in Japan, lovers fill the streets on Christmas Eve, walking arm in arm, while Christmas-themed love songs fill the air. Source: Getty / Ippei Naoi So, what should you do if you are single and alone in Japan during Christmas? Don't worry, we won't judge … at least not openly!\n\n\n\n\n\nJokes aside, whether you are single or not, Christmas time in Japan is truly magical, with cities decorated with winter illuminations.\n\n\n\n\n\nIt sure is a sight to behold!\n\n\n\nThe Polish 'Chrissie' carp\n\nFor Poles, Christmas Eve is the highlight of the festive season, with celebrations starting when the first star appears.\n\n\n\n\n\nTables glow with candles, and hay under the tablecloth recalls the nativity as well as poverty and simplicity. A free chair is left for the 'late traveller', and families break the opłatek or Christmas wafer, exchanging wishes of love and forgiveness.\n\n\n\n\n\nTradition calls for twelve meatless dishes, reflecting a time when meat was a rare luxury and serving as a symbol of wholeness and perfection, while also honouring the twelve apostles of Jesus.\n\n\n\n\n\nA Polish Christmas would also be incomplete without carp, something that surprises many in Australia, where it is considered an unpalatable invasive species.\n\n\n\n\n\nAt a Polish Christmas, it is served baked, fried, stuffed, stewed, or in jelly. The most traditional version, 'Jewish-style', is boiled with raisins and onions for a sweet-and-salty twist.\n\n\n\nA Polish Christmas table would be incomplete without carp at the centre. Source: Getty / Alex Bona / SOPA Images / LightRocket Carp arrived in Poland in the 12th century, brought by Czech Cistercians. It was just one of many freshwater fish enjoyed for centuries on the tables of nobility.\n\n\n\n\n\nBy the early 20th century, it had become a staple, especially in Jewish households.\n\n\n\n\n\nAt a modern Polish restaurant in Brunswick East — Melbourne's hip, inner-north suburb — chef Ola Gładysz says carp is surprisingly popular, even though it only appears on the menu for special occasions.\n\n\n\n\n\n\"I don't know any other restaurant that serves carp. This year we're expecting lots of Polish guests for Christmas Eve,\" she says.\n\n\n\n\n\nAustralians, however, often approach it with caution.\n\n\n\n\n\n\"People are a bit unsure because they've never tried it. I soak the carp in milk with onion for six hours to remove the muddy flavour, then dry it thoroughly, season it, and fry it in breadcrumbs. That crispy coating is our way of winning Aussies over,\" she says.\n\n\n\nChef Ola Gładysz says her carp dishes are surprisingly popular at the modern Polish restaurant where she works in Melbourne's hip, inner-north suburb of Brunswick East. Source: Supplied \"Most people who come for our Christmas events are Poles missing home. For them, carp is a taste of childhood,\" Gładysz says.\n\n\n\n\n\nIn the 1940s, a communist official famously declared: \"Carp on every Christmas Eve table in Poland.\" However, as World War Two had left the Baltic Sea fishing fleet in ruins, the government promoted fish farming in ponds, and workers often received carp as bonuses.\n\n\n\n\n\nThis gave rise to the tradition of bringing home live fish — a necessity in communist Poland, where shortages meant people had to secure their meals a few days in advance.\n\n\n\n\n\nToday, carp remains a Christmas fixture, served in a variety of ways.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/video/thousands-rush-for-last-minute-food-and-gifts-before-christmas-day/ssthz58no",
    "title": "Thousands rush for last minute food and gifts before Christmas Day",
    "publish_date": "Wed, 24 Dec 2025 09:24:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Thousands rush for last minute food and gifts before Christmas Day\n\nPublished 24 December 2025, 9:04 am\n\nFor some, it's unfortunately a necessary evil, others find it a thrill. The Christmas Eve race has been on today to get gifts and food, all in time for tomorrow. Thousands braved packed stores and markets, to tackle the last-minute shopping rush.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/a-seat-at-the-table-how-charities-are-fighting-christmas-loneliness/i4rv2o1cu",
    "title": "A seat at the table: How charities are fighting Christmas loneliness",
    "publish_date": "Wed, 24 Dec 2025 06:50:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFor those who celebrate, Christmas can be a special time to celebrate faith, engage in red-and-white festivities, or just share a meal and a gift or two with loved ones.\n\n\n\n\n\nBut for many vulnerable people around Australia, this holiday period can leave them feeling isolated and cut-off from the community.\n\n\n\n\n\nIn an effort to help counteract this, Wesley Mission are opening their doors to their church and conference centre in the heart of Sydney's CBD for a Christmas Day lunch for all.\n\n\n\n\n\nThe CEO, Reverend Stu Cameron, says they're sparing no expense in delivering a hearty Christmas meal.\n\n\n\n\n\n\"So we have some of our fabulous volunteers who are here today setting up for our Christmas day lunch. We'll have around 300 people packing out for a slap-up (meal/celebration) Christmas lunch: ham, turkey, prawn, salads, all the trimmings. That community of 300 people will be made up of people who own tech companies, people who are sleeping on the street. Some of our clients that we have the privilege of serving, all coming together around the table just to celebrate connection, celebrate the Christmas story, particularly for those who wouldn't otherwise have a place to go on Christmas Day; or can't afford to put food on the table.\"\n\n\n\n\n\nVolunteering manager, Christine Ireland, says the event is free for those who don't have the financial means.\n\n\n\n\n\n\"If you're financially struggling, and this year is tough for a lot of people, you can absolutely come. There's no expectation. If you're able, you can purchase a ticket. And then of course, if you're not able to come, but you are in a financial position, you can plate it forward and purchase a ticket for someone else.\"\n\n\n\n\n\nA couple of their young volunteers, Carter and Ved, couldn't be happier to be part of the preparations for the event.\n\n\n\n\n\nVOXIE 1: \"Yeah, I love it. I really like providing for other people that are less fortunate than I am. And I just really love helping out, especially with the atmosphere of everyone setting up the Christmas trees and all the decorations.\"\n\n\n\n\n\nVOXIE 2: \"I just really want to help the people who don't have a home and they can't celebrate Christmas. I just want to let them have at least one good lunch.\"\n\n\n\n\n\nWesley Mission's annual report for 2025 found that they helped 2,490 people across New South Wales who were experiencing - or at risk of homelessness.\n\n\n\n\n\nThey are also running a Christmas Appeal, calling on community members to donate to help provide emergency housing for survivors of domestic violence.\n\n\n\n\n\nChaplain Mark Coleman says Wesley Mission takes the Christmas message to be one of bringing community together and helping those who are doing it tough.\n\n\n\n\n\n\"So one of the beautiful things about this space is it's a space where all people can gather. People who are experiencing that financial difficulty, but also people who want to just share that joy of celebrating Christmas, sharing the love of Jesus here in this space. And it's a place where you don't have to be marked out as different. You can come and be a part of it and join in whoever you might be.\"\n\n\n\n\n\nThis sense of community can be one of the most beautiful aspects of this holiday season.\n\n\n\n\n\nBut Dr Michelle Lim, an associate professor at the University of Sydney and CEO of Ending Loneliness Together, says it's difficult for charity services to address the severity of the loneliness crisis - and how it can be worsened over the holiday season.\n\n\n\n\n\n\"So many Australians also do not have close family and friends around to share this festive season with. And in particular, many people as well who might say that they're single or perhaps that they're living away from their community - or they have family that lives overseas - often talk about how Christmas or holiday periods can be particularly isolating for them and therefore they might probably experience a higher rate of what we call episodic loneliness.\"\n\n\n\n\n\nDr Lim was the research lead on the 2023 State of the Nation Report into Social Connection in Australia, which found that almost one in three Australians who were surveyed reported problematic levels of loneliness; and one in six reported severe levels of loneliness.\n\n\n\n\n\nShe says it's an often stigmatised issue.\n\n\n\n\n\n\"We know things like loneliness in particular is highly stigmatised, even though it's highly prevalent and people don't want to talk about it. Australians who maybe have an existing health problem or disability or mobility issues might be particularly vulnerable during Christmas because as well, they might be seeing fewer people and there might be fewer services around.\"\n\n\n\n\n\nAnother charity group who are doing their best to offer a sense of community to those with disability over the Christmas period is Civic Disability Services.\n\n\n\n\n\nOperations Manager, Katy Williams, says the shutdown of other critical services means their support workers often have to go above and beyond to help their clients.\n\n\n\n\n\n\"One of the things we recognise is people's mental health can decline steadily over the holidays, especially with the closure of services that normally are accessible. In fact, I was just talking to a gentleman who is having wheelchair problems, but the service that's offering him a lend of a wheelchair and servicing his other one is closed for two weeks. We're always there to support our people to get the help they need. So there's always somebody within the team, even if it has nothing to do with us - like wheelchair repair, but we would be there to assist them during these shutdowns.\"\n\n\n\n\n\nCivic typically caters to over 800 people around New South Wales, offering supported accommodation, employment opportunities and NDIS services among other initiatives.\n\n\n\n\n\nBut CEO Annie Doyle says their support workers also work hard to make Christmas a special time of community for those living in their accommodation.\n\n\n\n\n\n\"So we have people with significant disability, intellectual disability predominantly. But a lot of them are now orphans because they've been in care for a long time. Christmas is quite challenging when you don't have family. And so a lot of what Civic does is around: we stand in effectively for those opportunities so that they feel like they are celebrating Christmas. It's not about the presents and the festivities itself, it's more about just sharing that time with other people, being special on the day.\"\n\n\n\n\n\nLeading up to Christmas, support workers have sung carols with clients, created Christmas cards and helped decorate their homes for the festivities.\n\n\n\n\n\nWhile workers will also offer Christmas meals on the day for those in supported accommodation, Ms Doyle says they also held a special group Christmas lunch so others could join in.\n\n\n\n\n\n\"We all got together, we had about 150 odd people there for the day. And we do all sorts of games. But what's most important is that we all sit down together and have a shared meal. We just love to have clients experience what it feels to be in a Christmas environment.\"\n\n\n\n\n\nMs Williams says she has taken time out of her own Christmas for her clients in the past - and its actions like that, which can remind people that they are not alone during this holiday period.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/us-economy-expands-more-than-expected-as-local-asx-santa-rally-hits-snag/rydb51jpd",
    "title": "US economy expands more than expected as local ASX Santa rally hits snag",
    "publish_date": "Wed, 24 Dec 2025 05:59:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/meet-the-people-helping-clear-santas-flight-path-for-smooth-sleighing/4t9kjm9h2",
    "title": "Meet the people helping clear Santa's flight path for smooth sleighing",
    "publish_date": "Wed, 24 Dec 2025 00:21:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nFor the past 70 years, staff at the North American Aerospace Defence Command – or NORAD - in Colorado Springs have had a very important task.\n\n\n\n\n\nNormally they're scanning the skies on matters of national security but at Christmas, the staff at Peterson Space Force Base turn their attention to Santa.\n\n\n\n\n\nNORAD spokeswoman Colonel Kelly Frushour says Santa is of course no threat.\n\n\n\n\n\nIt's just that the same combination of radar, satellites and jets that help NORAD carry out its mission throughout the year make it capable of tracking Santa.\n\n\n\n\n\n\"NORAD tracks Santa using the same capabilities that we use 24-7 to keep the avenues of approach to North America safe. It’s a combination of radars, satellites and fighter jets.\"\n\n\n\n\n\nCaptain Alex Werden is one of the NORAD program managers.\n\n\n\n\n\n\"We’re just happy that we’re able to track them every single year. And the pilots that get to see them, they’re lucky.\"\n\n\n\n\n\nBut that's not all.\n\n\n\n\n\nThe Colonel says there's also a hotline to answer callers' questions about Santa's mission - and Michelle Martin is one of the NORAD planners for the Christmas call centre.\n\n\n\n\n\n\"It’s kind of funny because I don’t think you ever really know who to expect on the other end of the line. Like I said, sometimes it could be a British pub and everybody’s going wild and there’s dozens of people in the background cracking up and having fun and asking us silly questions. And then all the way to a child maybe in hospital with their parent wondering if Santa’s still going to stop by because they’re in a hospital with their parents.\"\n\n\n\n\n\nColonel Frushour says it all began seven decades ago when - legend has it - one child called the combat operations centre.\n\n\n\n\n\n\"70 years ago one young child accidentally dialled the predecessor of NORAD, which was the Continental Air Defense Command. And the colonel who answered the phone heard a child asking him, ‘where is Santa Claus?’ And the Colonel realised, well, we track everything over North America, and so we absolutely can see where Santa Claus is. We normally just track threats. But he looked up where Santa was and reported it to the child, and then our tradition was born.\"\n\n\n\n\n\nFor the first time this year, Santa seekers can place a call through the program’s website, which organisers say will be easier for people outside North America.\n\n\n\n\n\nMichelle Martin says the website allows people to follow Santa’s journey in nine languages, including English and Japanese.\n\n\n\n\n\n\"There’s nothing more special than a child’s eyes lighting up or a child just feeling pure joy about something that they believe in, and it’s a do-good thing. And so I think just hearing little kids laugh and giggle and ask silly questions, it’s just, it’s fun. And so if we could bring that joy to them in some way, shape or form, then I think we did our job.\"\n\n\n\n\n\nWhile NORAD is based in North America and can follow Santa everywhere, it has helpers in Australia.\n\n\n\n\n\nAir Services Australia spokesperson Laura Willard has told Channel 9 they have the responsibility of tracking Santa in the local region.\n\n\n\n\n\n\"Air Services is Australia's official Santa flight management team... We'll be giving Santa his pre-departure clearance with the call sign RED-ONE. There'll be no delays, just smooth sleighing all the way... RED-ONE will be entering Australian airspace over Norfolk Island, zig-zagging across the country, and vacating around the Cocos Islands at sunrise.\"\n\n\n\n\n\nMeanwhile back in the United States, the NORAD hotline is already receiving plenty of calls.\n\n\n\n\n\nMichelle Martin says more than a thousand volunteers are manning the phones this Christmas Eve.\n\n\n\n\n\nAnd she says they plan to continue the tradition as long as possible.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/sunglasses-uv-protection-explainer/fvfb92y5i",
    "title": "Not all sunglasses protect you from eye damage. Here's how to spot the difference",
    "publish_date": "Wed, 24 Dec 2025 00:20:45 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "With summer well and truly here, you might be in the market for a new pair of sunglasses.\n\n\n\n\n\nWhile the style, colour, price, and level of comfort they offer are all key considerations when selecting your shades, there's one feature that experts say should be everyone's top priority.\n\n\n\n\n\nDr Ambhruni Padhye, an optometrist and Specsavers clinical services development consultant, told SBS News: \"The most important factor is ensuring that you've got adequate UV protection.\"\n\n\n\nHow can UV rays damage your eyes?\n\nOverexposure to harmful UV radiation can damage your eye health temporarily and in the long-term.\n\n\n\n\n\nShort-term problems can include excessive blinking, swelling, challenges looking at strong light, and photokeratitis, which is similar to a sunburn of the eye.\n\n\n\n\n\nAnita Dessaix, chair, Cancer Council Australia's Public Health Committee, told SBS News: \"Overtime, exposure to UV can potentially cause serious or permanent eye damage, including cataracts, cancer of the conjunctiva [membrane covering the white of the ey], skin cancer of the eyelids and around the eyes, solar keratopaty [cloudiness of the cornea], and pterygium [an overgrowth of the conjunctiva onto the cornea].\"\n\n\n\nHow to tell if your sunglasses offer good UV protection\n\nAll sunglasses sold in Australia must be tested and labelled in accordance with a mandatory standard.\n\n\n\n\n\nThey are classified into five categories — from 0 to 4 — based on the level of protection they provide against sun glare and UV.\n\n\n\n\n\nThe lens category number should be listed on the tag or sticker attached to the glasses, and is often printed on the inside of the frame, as well.\n\n\n\nSome or all of these symbols may be printed on the inside of your sunglasses frame. Source: SBS News / Amy Hall If you're buying sunglasses online, make sure to check the product description for the lens category number.\n\n\n\n\n\nDessaix said the Cancer Council recommends wearing close-fitting, wraparound sunglasses with a lens category of 2, 3 or 4 as they \"absorb 95 per cent of UV radiation\".\n\n\n\n\n\nThe category of sunglasses that best suits your needs can vary depending on when you plan to wear them, Padhye said.\n\n\n\nEach lens category offers different levels of eye protection against sun glare and UV radiation. Source: SBS News \"Category 2 is medium tint and recommended for everyday sun with good UV protection,\" Padhye said.\n\n\n\n\n\n\"Category 3 is more of a darker tint, which is ideal for brighter outdoor conditions with strong glare.\"\n\n\n\n\n\nWhile category 4 sunglasses are ideal for high-glare conditions like snow or water, they shouldn't be worn while driving at any time.\n\n\n\n\n\nThose with a lens category of 0 or 1 are generally considered fashion spectacles rather than sunglasses and offer little to no UV protection.\n\n\n\n\n\nPadhye suggested consulting an eye care professional if you're unsure whether the sunglasses you're looking to buy or already own offer adequate UV or sun glare protection.\n\n\n\nOther ways to protect your eyes from UV damage\n\nWearing sunglasses isn't the only way to shield your eyes from UV damage.\n\n\n\n\n\nWearing a wide-brimmed hat can add an extra layer of protection, helping to keep the sun off your eyes and face, Padhye said.\n\n\n\nWearing sunglasses is just one part of a sun safe routine. Source: SBS News \"Use sunscreen as well — just be careful because the skin around the eyes is delicate,\" Padhye said.\n\n\n\nSymptoms of eye sunburn\n\nIf your eyes are painful after being in the sun, you may have photokeratitis.\n\n\n\n\n\n\"This is from the cells that are in your cornea getting damaged,\" Padhye said.\n\n\n\n\n\n\"The eye can be quite red as well. Sometimes you can get blurry vision, and this can be temporary, but it can also cause a lot of tearing and watery eyes and almost like a gritty, irritated feeling.\"\n\n\n\nHow to treat eye sunburn\n\nIf you suspect you have photokeratitis, Padhye said you should stay indoors to minimise further exposure to UV radiation.\n\n\n\n\n\n\"If you do wear contact lenses, I would advise taking them out to avoid further irritation to the eyes,\" she said.\n\n\n\n\n\n\"You should also avoid itching. It can be hard, of course, to try not to rub your eyes, but this will definitely make them worse.\"\n\n\n\n\n\nLike the sunburn you may get on your face or body, photokeratitis can be treated at home.\n\n\n\n\"Some common treatments that can be applied for photokeratitis include using lubricating drops, pain relief medication, as well as placing a cold, damp cloth over your closed eyes to help soothe and cool the eyes,\" Padhye said.\n\n\n\n\n\nBut if you want to ensure you're getting the most appropriate treatment, she recommended seeing an optometrist.\n\n\n\n\n\n\"We do have all the technology to diagnose and treat, and if we do feel there needs further investigation, we can always refer to an eye specialist.\"\n\n\n\n\n\nDisclaimer: This article is for general information only and should not be relied on as a substitute for professional medical advice. Readers are advised to consult a qualified health professional for guidance specific to their situation.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/does-china-have-a-robot-bubble-20251218-p5nos9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Does China have a robot bubble?",
    "publish_date": "Thu, 25 Dec 2025 13:00:00 +1100",
    "category": "finance",
    "authors": [
      "Meaghan Tobin",
      "Xinyun Wu"
    ],
    "text": "Robots made by Chinese startups have danced on television, staged boxing matches and run marathons. When one company debuted its most recent robot last month, people online in China thought it looked so much like a human that workers cut the robot’s leg open onstage to reveal its metal pistons.\n\nDespite the public fascination, concerns are growing that China’s robotics industry is moving too fast. The robots can mimic human movement and even complete basic tasks. But they are not skilled enough to handle many tasks now done by people. And with so many companies rushing into the industry, Beijing is warning of a bubble.\n\nA robot competes in a half-marathon in Beijing. Credit: Getty Images\n\nMore than 150 manufacturers are vying for a piece of the market, the Chinese government said last month, warning that the industry was at risk for a crowd of “highly repetitive products.”\n\n“China has an attack-first approach when it comes to the adoption of new technology,” said Lian Jye Su, a chief analyst at Omdia, a tech research firm. “But this generally leads to a large number of vendors fighting for small chunks of market.”",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/politics/federal/looking-for-a-christmas-day-movie-try-a-dingo-ate-my-christmas-spirit-20251223-p5npog.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Looking for a Christmas Day movie? Try A Dingo Ate My Christmas Spirit",
    "publish_date": "Thu, 25 Dec 2025 13:00:00 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "Actors are almost interchangeable. Oy to the World! features Canadian actor Brooke D’Orsay, who has appeared in 10 Christmas-themed movies since 2017 including Deck the Halls on Cherry Lane, Nostalgic Christmas and Christmas in Love. You can’t describe the plots as vanilla as that would be an offence to the vanilla bean. The plot of some Hallmark movies would cause offence to the vanilla bean. Credit: Good Weekend There’s almost always a “career-driven” female lead (normally from an evil metropolitan centre like New York) who, for some reason, has to return to an obscure country town. There, she’s likely to face off against a brooding hulk of a gent (with a chance he is a widower). They fight, they resolve, they fall in love. Snow falls and Christmas carols are sung.\n\nLoading So formulaic are these movies, as an experiment, I used AI to see if it could come up with a Hallmark-style Christmas movie but set in an Australian context and featuring a kangaroo. Here’s the plot to “A Dingo Ate My Christmas Spirit”: Chloe Peterson is “a highly successful, driven marketing executive from Sydney” who has a “perfectly un-Christmassy demeanour”. She’s told by her boss to take a digital detox. So Chloe ends up renting a place in a fictional small town north of Brisbane called “Jingle Bells Bay”. The rental is double booked, so she has to share with a chap called Liam O’Connell, who is described as a “ruggedly handsome, widowed wildlife park ranger” and his daughter Daisy. There’s a kangaroo called Rudolph (he has a medical condition that gives him a red nose) who causes all sorts of trouble around the town.\n\nChloe uses her big-city skills to save Liam’s wildlife sanctuary from closure. Her boss turns up on Christmas Eve to say she’s got a promotion but to get it she has to catch the plane about to leave for Sydney. You know what happens. There’s a spare seat on the direct flight from Jingle Bells Bay to Sydney. Die Hard … one of the great Christmas movies. But it wouldn’t fit with the AI-generated world of Hallmark. I varied my parameters (including a Hitchcock version, a horror, an action adventure, one set in the South Pole, an Agatha Christie version, one set in space) and they all pumped out variations of my dingo movie. That AI could generate a series of workable plots should not be a surprise. Creating 40 films with a Christmas theme every year invariably means they will look and feel the same. These aren’t destined to win an Oscar – they are the cheap stocking fillers of film.\n\nLoading But they work for Hallmark and its viewers. These movies are watched (and attract constant ratings on IMDB around 5.5 out of 10) by tens of millions. They make Hallmark, which makes most of these shows in Canada to take advantage of tax concessions and films them on a shoestring, hundreds of millions a year. They’re so popular that next year you can go on a Hallmark Christmas cruise from Florida to the Bahamas. Go onboard to meet some of your favourite Hallmark actors, and enjoy a “Silent Night disco” while swilling a bit of eggnog.\n\nHundreds of actors who would otherwise struggle to afford a gingerbread man make a living frolicking in Hallmark’s fake snow. There’s an entire cottage industry now built on these movies which also extends to social media, where people express their views on all aspects of the Christmas film offerings. You know you’ve reached peak pop culture importance when it crosses over into academia. A Canadian university doctoral student, Megan Lauzier, this year produced a thesis titled More Than Meets the Eye: Unpacking the Popularity of Hallmark Movies. Lauzier argues Hallmark’s social media strategy was a key element to the popularity of “its seemingly unremarkable movies”.\n\nSo predictable are Hallmark movies that Seth MacFarlane used his Family Guy series this year to release a parody with the title “Disney’s Hulu’s Family Guy’s Hallmark Channel’s Lifetime’s Familiar Holiday Movie”. IMDB now lists 503 Hallmark Christmas movies, with the overwhelming majority of them created since 2008. That’s the year after Netflix started its streaming service, a year after Twitter (now X) and a couple of years before Instagram. So formulaic are Hallmark movies that Family Guy this year released its own parody. Credit: Disney+ Pop culture has always been economically driven. But Hallmark and its Christmas movies are at an entirely new level, delivering economic opportunities in ways unimaginable a few years ago. The interaction of technology, tax concessions, streaming services with hours to fill, advertisers looking for specialist markets, real (and artificial) social media influencers is literally playing out on our televisions/handheld devices.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/lifestyle/catherine-princess-of-wales-and-princess-charlotte-perform-piano-duet-20251225-p5nq2h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Catherine, Princess of Wales, and Princess Charlotte perform piano duet",
    "publish_date": "Thu, 25 Dec 2025 12:47:19 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Catherine, Princess of Wales, and Princess Charlotte perform piano duet\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/sometimes-childlike-wonder-points-to-something-adults-don-t-allow-ourselves-to-see-20251225-p5nq1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sometimes, childlike wonder points to something adults don’t allow ourselves to see",
    "publish_date": "Thu, 25 Dec 2025 12:30:00 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "I got my son an Elf on the Shelf this year. Do I regret it? Absolutely. But it reminded me of something this holiday season, something too easy to forget in our modern age.\n\nFor an otherwise bright child, my son is convinced that the elf is real in the sense that he moves himself around the house at night and ends up in all sorts of compromising positions by morning. The elf can even help with various tasks during the wee morning hours.\n\nChildren have a wonderment about Elf on the Shelf that adults might learn from.\n\nMy son believes that the elf is, in a word, enchanted. I never knew this about my child before getting the elf. I wonder how many other things he believes to be enchanted, too.\n\nIt’s what so many of us crave at this time of year. The presents, the twinkly lights, the feasts, the songs, long afternoons with loved ones. The hope is that it will all add up to more than the sum of the parts. And maybe if the parts are big enough, we might well summon the Christmas spirit.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/national/car-with-hanukkah-sign-firebombed-on-christmas-morning-20251225-p5nq2d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Car with Hanukkah sign firebombed on Christmas morning",
    "publish_date": "Thu, 25 Dec 2025 11:59:53 +1100",
    "category": "finance",
    "authors": [],
    "text": "Car with Hanukkah sign firebombed on Christmas morning\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/express-speed-australia-choose-all-pace-attack-for-boxing-day-test-20251225-p5nq1j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Furry and green’: The MCG Grinch that cruelled spinner’s Boxing Day hopes",
    "publish_date": "Thu, 25 Dec 2025 11:54:07 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "Melbourne’s green MCG pitch is the Grinch who stole Boxing Day from Todd Murphy, while Cameron Green’s Test spot is on notice with a demotion to No.7 in the order as Australia seek to batter their way to 4-0 in the Ashes series.\n\nAs England’s players trained on the outfield in Santa hats passed to them after they got off the team bus on Christmas morning, Australia’s stand-in captain Steve Smith pointed to the surfaces increasingly prepared around the country as the reason why Murphy did not even make the 12.\n\nSpinner Todd Murphy (left) won’t be playing in the Boxing Day Test as an all-pace attack including Scott Boland (right) was given the green light. Credit: Getty Images\n\nJhye Richardson, Brendan Doggett and Michael Neser are competing for two pace spots alongside Mitchell Starc and Scott Boland, with a final call to be made on match morning.\n\nIf Murphy is also left out in Sydney, Australia will have picked a specialist spinner just twice in five Tests this summer, having done so for every match played in this country dating back to a WACA Ground game against India in January 2012. Smith described Adelaide Oval’s surface, which spun for Nathan Lyon before he tore a hamstring, as anomalous.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/hamilton-hill-fire-destroys-three-units-on-christmas-morning-20251225-p5nq29.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hamilton Hill fire destroys three units on Christmas morning",
    "publish_date": "Thu, 25 Dec 2025 11:13:48 +1100",
    "category": "finance",
    "authors": [
      "Heather Mcneill"
    ],
    "text": "Three households are spending their Christmas morning devastated after a fire ripped through a Hamilton Hill unit complex overnight.\n\nThe blaze started around 2.45am on Thursday on Erpingham Road, with three residential units severely damaged.\n\nThe damaged complex in Hamilton Hill. Credit: 9 News Perth\n\nFirefighters attended, with the roof structure of the building destroyed by the flames.\n\nTwo people were taken to Fiona Stanley Hospital to be treated for smoke inhalation, while others were treated at the scene.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/traveller/inspiration/cruising-is-booming-in-asia-and-that-s-good-news-for-australians-20251114-p5nfho.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cruising is booming in Asia and that’s good news for Australians",
    "publish_date": "Thu, 25 Dec 2025 10:25:00 +1100",
    "category": "finance",
    "authors": [
      "Brian Johnston"
    ],
    "text": "Advertisement\n\nInspirationCruises Cruising is booming in Asia and that’s good news for Australians Brian Johnston December 25, 2025 — 10:25am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nI’m glad to say that Asian cruising continues to trend, giving cruisers increasing choices over the next two years on all shapes and sizes of ships. If you’re a big-ship enthusiast, then Norwegian Cruise Line, in response to strong demand for Asian cruises, is sending four ships to Asia for a bumper 50-voyage season finishing in April 2027. Norwegian Jade makes its Asian debut in October 2026; guests can embark in Tokyo, Incheon, Hong Kong or Singapore. Norwegian Sky sailing past Mount Fuji in Japan. Princess Cruises will see its biggest Japan season ever in 2027, when Diamond Princess and Sapphire Princess sail 78 departures. Among the highlights are cherry-blossom voyages, a circumnavigation of Japan, and cruises that take in the Okinawa islands and Taiwan. Between November 2026 and March 2027, Diamond Princess will homeport in Singapore and offer 11 sailings to 28 ports across the region.\n\nAdvertisement\n\nAnd Carnival Cruise Line is sending two ships – Carnival Luminosa and Carnival Adventure – to Asia for the first time over the 2026-27 season. Although they sail only four itineraries, the move finally recognises Asia as a cruise destination in itself, rather than somewhere to pass through on repositioning cruises. Among the itineraries is Sydney-Singapore, Tokyo-Singapore and a roundtrip voyage from Singapore taking in ports in Thailand, Vietnam and Cambodia. Carnival ships will visit Hong Kong, Osaka, Fukuoka, Seogwipo (Jeju) and Keelung for the first time. Royal Caribbean’s Navigator of the Seas. After an even bigger ship? Royal Caribbean’s Navigator of the Seas will homeport for the first time in Singapore between October 2026 and February 2027 and sail three to 12-night cruises to destinations such as Penang, Phuket, Langkawi, Bangkok and Ho Chi Minh City before heading towards Japan on East Asia itineraries. If it’s a smaller, luxury experience you’re after, Seabourn too is rolling out new Asian voyages between December 2026 and April 2027. Its Japan voyages notably visit not just big-name ports but smaller ones such as Toba, Miyako, Sendai and Hitachinaka.\n\nAdvertisement\n\nSeabourn Encore will also sail a 12-day voyage from Hong Kong to Tokyo, and South-East Asian voyages between Singapore and Hong Kong or round-trip from Singapore. Related Article Cruises This latest cruise company slogan spotlights a cringeworthy tradition The news is just as good for those keen on expedition cruising. New Zealand company Heritage Expeditions is upping its Asian offerings, Lindblad Expeditions is offering diving expeditions in Indonesia from October 2026, and Aqua Expeditions has launched seven-night voyages in South Raja Ampat from December 2026. New Australian expedition company Pearl Expeditions will sail in Indonesia and Papua New Guinea from the end of this year. Coral Expeditions continues to operate throughout Indonesia and is increasing capacity in Papua New Guinea on new itineraries in October and November 2026. And finally, after a five-year pause, G Adventures is returning to Sri Lanka from next month with cruises by catamaran along the southern coast that mix UNESCO-listed port town Galle with remote beaches and fishing village Kudawella for swimming, snorkelling and surfing.\n\nSign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Cruises\n\nOcean cruises\n\nAsia Brian Johnston seemed destined to become a travel writer: he is an Irishman born in Nigeria and raised in Switzerland, who has lived in Britain and China and now calls Australia home.\n\nTraveller Guides",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/ben-stokes-leadership-is-fracturing-has-it-cracked-or-fully-shattered-20251224-p5npzw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ben Stokes’ leadership is fracturing. Has it cracked or fully shattered?",
    "publish_date": "Thu, 25 Dec 2025 09:50:00 +1100",
    "category": "sports",
    "authors": [
      "Malcolm Knox"
    ],
    "text": "The mystery box, the deciding half of the contest, was how England’s bowling would go against Australia’s batting (or, as it looked in the first innings in Perth, vice versa). England’s eschewal of spin was not a bad plan. Muttiah Muralitharan was ineffective on Australian pitches, as were Ravi Ashwin, Rangana Herath and Yasir Shah. Anil Kumble, Graeme Swann and Saqlain Mushtaq did passably well. Much has been made of Travis Head’s batting in Perth, but he had plenty of luck, and England’s bowling was awful. Credit: Getty Images Year after year we see that it takes a lifetime of patience and spin bowling smarts in Australian conditions to eke out success. Lacking the required talent, England sensibly opted for pace. The promise was that Jofra Archer, Mark Wood, Brydon Carse, Gus Atkinson, Josh Tongue, Matthew Potts and Stokes would batter Australia’s brittle top order with speed. They haven’t been good enough or fit enough, and Australia have winkled out winning totals by osmosis. Much has been made, rightly, of Travis Head’s second innings in Perth. He was also streaky and lucky. But England’s bowling was horrible, and if Head hadn’t played that winning knock it’s likely that Steve Smith and the middle order would have found 200 runs between them.\n\nArcher’s lines, as much as his fall in pace, were woeful. Wood was gone. Carse and Atkinson were either confused by poor instructions, tired due to their lack of practice, or too easily discouraged by the counter-attack from Head and Jake Weatherald. In Brisbane and Adelaide, England wilted in the heat and again bowled inconsistent lengths. Archer picked up some wickets through Australian inattention, and bowled fast at times, but the home batsmen were able to see him off, knowing he could not return for good spells. Jofra Archer’s performances have been mixed, at best. Credit: Getty Images They eventually managed it against Jasprit Bumrah last season, and Archer is no Bumrah. The other bowlers were pedestrian. When Alex Carey steadied his partners in Brisbane and Adelaide – those sequences of play where the Ashes were decided – England’s bowling did not challenge them consistently. Big Test series are usually won at the margins: dry spells of bowling, tail-end runs and basic fielding.\n\nAustralia’s bottom five partnerships contributed 219 runs in Brisbane and 186 in the first innings in Adelaide. In the field, for every screamer snatched by the Australians, there have been two catches dropped by England. Loading On the third afternoon in Adelaide, when the Ashes were there to be won or lost, Stokes did not bowl, and he gave Archer the ball belatedly and cautiously. He set fields that enabled Head and Carey to rotate the strike at their leisure. When Head was losing concentration, Carey calmed him down, but the task was made easier by England’s sloppy bowling and slackness in the field. What was in Stokes’ mind? He said his body was breaking after his defensive vigil with the bat, and evidently two and a half hours of batting had done Archer in. Yes, it was hot, but try telling Greg Matthews that. In the tied Test in Chennai in 1986, in 50-degree heat, Matthews batted for three hours across both innings and bowled 78 overs, some of them in a vest. Ravi Shastri bowled 61 overs and batted for four hours. The late Dean Jones’ feats have gone down in cricketing folklore and medical literature. Not to say they built them tougher in those days, but still, Stokes’ actions in Adelaide looked very much like a disappointed man throwing a tantrum, or a sulk, against his own teammates.\n\nWhen there is such a difference in outcricket (the basics of bowling and fielding) the one key factor separating Australia and England in these Ashes – the problem is nearly always leadership. Leadership can’t produce talent from nowhere, but it can set a productive frame of mind, keep spirits high, sustain concentration and control the controllables. Stokes’ brand of leadership has been top-down, bloody-minded and bullying. Whatever speeches he has given, the messages from his performances have been to challenge teammates to follow him and deride them as “weak” if they can’t; to stonewall and take no risks in preserving his own wicket, heaping pressure on the others; and to let his passions override his composure in the field, leading to self-evidently poor tactics, fields that don’t suit his bowlers and emotional decision-making. Ben Stokes’ actions in Adelaide looked very much like a disappointed man throwing a tantrum. Credit: Getty Images Stokes’ personal contributions with bat and ball have been strong, and he is capable of more highlights in Melbourne and Sydney. But runs and wickets are only part of the picture, and when time has passed and players produce their memoirs of this tour, don’t be surprised if there are stories of Stokes going a bit Colonel Kurtz from Apocalypse Now on his team in 2025. His batting, in the series, has been pure Kurtz: “Out there on his own, operating without any decent restraint”. This is not a criticism of the way he has batted per se, but it can only have been read, in his team, as a criticism of them and a withdrawal of the paternal blessings and encouragements he had heaped on them since 2022.\n\nIt is probably a burden of the past. Loading Stokes has been England’s best cricketer and dominant personality, but by now his warrior-exemplar model of captaincy appears to have trapped him. He’s trying to play that Headingley 2019 innings every time: block everything for three hours and demand that someone stays with him. The outrageous luck he received on the field at Headingley and in the 2019 World Cup final left him with a messianic status in English cricket. When he has lived up to it, he has had the attributes of a magical leader who requires from his team only the simple donation of their absolute faith. Whatever trouble they get in, Stokes will save them. It’s been called a cult of personality even by media who have knowingly aided and abetted it. When cults of personality collapse, they do so suddenly and in the most undignified manner.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/world/north-america/unwelcome-on-american-soil-us-bans-european-ideologues-accused-of-censorship-20251225-p5nq15.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Unwelcome on American soil’: US bans European ‘ideologues’ accused of censorship",
    "publish_date": "Thu, 25 Dec 2025 09:30:40 +1100",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "New York: The Trump administration has taken the extraordinary step of barring five European “ideologues” from entering the United States, accusing them of coercing American tech companies into censoring certain viewpoints.\n\nThe move sparked intense backlash from European leaders and could yet be expanded to ensnare Australians, with the eSafety Commissioner previously mentioned in the same vein as some of the sanctioned individuals.\n\nFormer European commissioner for digital markets Thierry Breton was among the five individuals banned by the United States for “censorship”. Credit: Bloomberg\n\nThose barred from the US include Thierry Breton, a former European Commissioner for Internal Markets and Digital Services, who is described as the “mastermind” of Europe’s Digital Services Act, which is loathed by the Trump administration.\n\nThe ban also applies to Imran Ahmed, a British Labour strategist who is now chief executive of the Centre for Countering Digital Hate, a group campaigning against disinformation online. Ahmed lives in Washington and faces immediate deportation, London’s Telegraph reported.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/business/markets/rich-like-bill-gates-meet-the-saudi-sisters-wielding-75-billion-in-a-man-s-world-20251217-p5nod3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rich like Bill Gates: Meet the Saudi sisters wielding $75 billion in a man’s world",
    "publish_date": "Thu, 25 Dec 2025 08:54:48 +1100",
    "category": "finance",
    "authors": [
      "Devon Pendleton",
      "Dinesh Nair",
      "Abeer Abu Omar",
      "Todd Gillespie"
    ],
    "text": "A US-based representative for the Olayan Group didn’t comment and directed all requests to a Saudi-based spokesperson, who didn’t respond to a detailed list of questions. Most global executives are reluctant to speak about the family for fear of offending the sisters, who are known to fiercely guard their privacy. This story is based on an analysis of the family’s investments, operating companies and filings of family-owned entities, as well as interviews with more than half a dozen people familiar with the group, who asked not to be named discussing information that isn’t public. Wall Street bosses Hutham and Lubna, both in their early seventies, were born in Saudi Arabia to Suliman Olayan. The patriarch was orphaned at a young age and started out working as a dispatcher for the predecessor company of Saudi Aramco, leveraging his fluent English. He mortgaged his house for $US8000 to win a pipeline contract, according to a profile in Time magazine, eventually launching the Olayan Group in 1947. From there, Suliman diversified aggressively, and the group went on to strike partnerships to sell Colgate toothpaste, Oreos and Coca-Cola in the kingdom. He bought US equities to use as credit with American banks and by 1980, his conglomerate brought in more than $US300 million in annual revenue, according to the Time profile.\n\nLoading His globalist bent created a uniquely bi-national empire that the daughters were immersed in early. Both studied in the US and were given significant jobs in the family business on their return. After Suliman’s death in 2002, his son Khaled was named chairman of Olayan Group, but Lubna and Hutham helped run much of the family’s vast operations. Lubna led the Mideast-focused division and Hutham took charge of Olayan America. The sisters married foreigners and took on prominent roles — Lubna was the first woman elected to the board of a public company in Saudi Arabia in 2004. Even then, women’s rights were severely limited in the kingdom. Only in 2018 were women finally given the right to drive. Low profile In an interview with NPR in 2018, Lubna recalled the difficulty finding a ladies room in factories and boardrooms because there were usually no women. She began approaching government officials and executives for help boosting the female workforce — all the while being reminded to tread carefully and attempting to avoid confrontation.\n\n“So, you negotiate, you deal, you do this, you take and give,” she said in the interview about those early efforts. Along the way, the sisters developed reputations for being steely negotiators. Their ascent was aided by an ability to keep a low profile and the duo ensured their business was seen as supportive of the government’s aims. The group is now officially headquartered in Liechtenstein, with offices around the world, including in Athens, where Lubna’s lawyer husband has deep ties. Over the years, the family has gained a reputation for running a stringently professional organisation that’s sophisticated in its dealmaking at a level not typically seen at family offices. The Olayans are deemed richer than Prince Alwaleed bin Talal, the royal known as Saudi Arabia’s Warren Buffett. Credit: AP “The family was very conscious of incorporating corporate governance frameworks into their business, and they did it with a high level of professionalism,” said Josiane Fahed-Sreih, director of the Institute of Family and Entrepreneurial Business at Lebanese American University.\n\nIn one sign of their influence, the Olayan family was untouched in 2017 when dozens of Saudi royals, former officials and businessmen, including Alwaleed, were detained at the Ritz-Carlton in Riyadh as the crown prince consolidated power and conducted an unprecedented national shakeup. Investing misstep Alwaleed, worth about $US17 billion these days, has made a comeback of sorts in recent years and his investment group has benefited from the kingdom’s construction frenzy. In the 1990s, the businessman was known for a flamboyant lifestyle, frequently pictured on a private yacht purchased from Donald Trump. The Olayans do things differently. “Normally we don’t seek the limelight…especially anything splashy,” Hutham said about the Olayan family in a speech to the Arab Bankers Association of North America in 2013. “We avoid excess, and we are pretty frugal.”\n\nEven so, there have been investing missteps. A longtime investor in Credit Suisse, they stuck by the bank even through its downturn, ultimately becoming one of the big losers in the turmoil that culminated with UBS Group’s discount purchase of the troubled lender. The losses were at a scale that could roil large financial firms, but one international executive recalls the collapse being treated as a relative non-event within the Olayan Group. The conglomerate continued to execute transactions and payments as normal during the period, the person said. Loading Saudi National Bank, the Swiss lender’s top shareholder, was among firms that lost money on its investment and its chairman resigned in the aftermath. Meanwhile, the Olayans’ profile has only grown in the years since. Key to that are their relationships on Wall Street and within the kingdom, particularly as Riyadh has started to intensify pressure on foreign firms to invest more locally and help diversify the economy.\n\nDespite recent fiscal pressures, Saudi Arabia remains a lucrative market for the titans of global finance: Riyadh ranks as one of the biggest issuers of debt in recent years, while the kingdom’s wealth fund has shown an appetite for blockbuster deals like the recent $US55 billion transaction to take Electronic Arts Inc private. Lubna has close connections to BlackRock co-founder Larry Fink, among others, and was recently named co-chair of the US-Saudi Business Council alongside Citi’s Fraser. Hutham sits on the board of Brookfield, which ranks as one of the biggest private equity investors in the Middle East. Davos in the Desert This year, during Saudi Arabia’s Future Investment Initiative conference, often called Davos in the Desert, Lubna hosted a party in Riyadh that had top global financial executives and officials mingling over canapés and rice and lamb, according to one attendee. Their links run broader than just finance. The US equity investments their father started to amass in the 1960s have grown to $US12.7 billion. These days, the portfolio includes stakes in Microsoft, Alphabet and Amazon. By comparison, Saudi Arabia’s $US1 trillion wealth fund owns just over $US19 billion in US stocks.\n\nThe group’s private equity portfolio forms another large chunk, and is estimated to run into the tens of billions of dollars, according to people familiar with the matter. Compounded annual growth rate for direct investments has exceeded 30 per cent over a 10-year period, according to its website. The firm’s real-estate holdings span more than 40 million square feet and 40,000 apartments under management. At home, the Olayans have backed the kingdom’s biggest efforts. When Saudi Aramco’s $US25 billion IPO struggled to attract international investors in 2019, the Olayan family was among those tapped locally by the administration of MBS — as the de facto ruler is called — to shore up demand. Lubna Olayan has successfully navigated the obstacles for women in the Saudi business world. “You negotiate, you deal, you do this, you take and give,” she says. Credit: Bloomberg At the same time, the sisters have managed a careful balancing act with their public comments. In 2018, as much of Wall Street avoided the kingdom’s FII conference after Saudi agents murdered columnist Jamal Khashoggi, Lubna used the start of a panel discussion to mourn his death, saying that the act ran counter to Saudi values. “We are very grateful that the terrible acts reported in recent weeks are alien to our culture and our DNA,” Lubna said in her address.\n\nThese days, Lubna is chair of the Olayan Group’s corporate board, according to a recent press release from the US-Saudi Business Council. Hutham chairs the shareholders’ board, the group’s website says. Day-to-day operations are mostly managed by the likes of Chief Executive Officer Hani Lazkani and Chief Operating Officer Samer Yaghnam, people familiar with the matter said, though the sisters remain the public face of the group and helm broad strategy with family members. Loading Multiple people described Lubna as frank and outgoing, with a reputation for being deeply involved with her investments. Like her father, she’s worldly and warm but also incisive, said James Zogby, president of the Arab American Institute and a friend of the late Suliman. “If you talk with her about current events, it’s not just, ‘This happened.’ She understands why things are moving the way they are.” Hutham, meanwhile, appears soft-spoken and grandmotherly in conversation, but her line of gentle questioning can elicit small details that can serve as fodder for the negotiating table, according to one international executive.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/world/doj-says-it-will-need-more-time-to-release-epstein-files-20251225-p5nq1k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "DOJ says it will need more time to release Epstein files",
    "publish_date": "Thu, 25 Dec 2025 08:19:45 +1100",
    "category": "finance",
    "authors": [],
    "text": "DOJ says it will need more time to release Epstein files\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 26
  }
]