[
  {
    "url": "https://www.9news.com.au/national/health-news-australians-urged-to-take-precautions-with-flu-cases-on-the-rise/d07c3874-0c55-4399-a06f-f6e733eaab23",
    "title": "Leading health body's warning as flu cases rise across Australia",
    "publish_date": "Mon, 22 Dec 2025 00:43:57 +0000",
    "category": "lifestyle",
    "authors": [
      "Dec"
    ],
    "text": "Australians are being urged to take precautions over Christmas and New Year after an﻿ unseasonal rise in flu cases.\n\nHealth reporting shows more than 29,000 lab-confirmed cases of influenza have been recorded in Australia as of yesterday.\n\nAccording to the Royal Australian College of GPs (RACGP), this is four times the 6952 flu cases reported in December last year.\n\nAustralians are being urged to take precautions over Christmas and New Year. (Getty)\n\nAt least ﻿491,000 influenza cases have been recorded this year, which is a 34.5 per cent increase on cases last year.\n\nRACGP President Dr Michael Wright has urged Australians to take care over the holidays.\n\n\"We started this year with more lab-confirmed flu cases than in any January on record, that didn't come out of nowhere,\" he said.\n\n\"The number of flu cases doubled from December 2024 to January 2025.\n\n\"Unfortunately, gathering to celebrate Christmas, the new year, and sports and other activities can play a part in increasing case numbers.\n\n\"The holiday season can be a challenging time for mental health, no one should have to spend the holiday season alone, but everyone deserves to be safe and well over the holidays.\n\n\"Remembering that the flu and other respiratory infections can be deadly or put a loved one in hospital is part of how we can care for others this holiday season.\"\n\nAt least ﻿491,000 influenza cases have been recorded in Australia this year. (Getty)\n\nThe Australian Bureau of Statistics reports 1508 deaths associated with influenza in the year to November.\n\nWright encourages Australians to consider those who are unwell over the festive season.\n\n\"Patients, including seniors, children under five, who are pregnant, or who live with some chronic conditions are at higher risk of a severe infection,\" he said.\n\n\"You don't want a joyful celebration leading to spreading infection, hospitalisation, or even worse.\n\n\"If someone is unwell or isolating, think about ways they can be a part of celebrations.\n\n\"A family member who stays home or in another part of the house can join by video or phone call.\n\n\"We don't want to break another flu record next year.\n\n\"The best way to reduce the risk of a severe infection is to get a flu vaccination.\n\n\"With Queensland, New South Wales, South Australia, and Western Australia to introduce free needle-free flu vaccinations for young children next year, it'll be easier than ever to get a vaccination during your consult.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/jim-beam-pauses-production-at-main-distillery-as-bourbon-inventories-rise/3f93318e-e7c2-44d9-93d2-1cde6a809105",
    "title": "Jim Beam to pause production in the US as drinkers slow down on bourbon",
    "publish_date": "Mon, 22 Dec 2025 01:06:31 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "The trade fallout between the United States and Canada has also impacted whiskey and spirit makers. In March, Canadian officials\n\nbanned American spirits\n\nfrom stores, a rule that is still in place in some provinces.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/what-the-big-four-banks-think-will-happen-with-interest-rates-next-year/262761c1-f82b-4782-b631-dc2634b650d5",
    "title": "What the 'big four' banks think will happen with interest rates next year",
    "publish_date": "Mon, 22 Dec 2025 00:50:28 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "It's a thought which is likely to put dampener on Christmas and New Year: interest rates could rise again in 2026.\n\nOne bank predicts as many as two hikes in the new year﻿ in depressing news for Aussie mortgage holders.\n\nCBA and NAB are both now predicting a cash rate hike, potentially as early as February.\n\nREAD MORE: Major bank hikes fixed rates despite saying more RBA cuts on the way ﻿\n\nRBA governor Michelle Bullock at a press conference. (Renee Nowytarger)\n\nNAB also reckons it will go up in May too.﻿\n\nHowever, others banks a happier prediction, forecasting they'll stay on hold.\n\n﻿Westpac has updated its cash rate forecast, predicting the RBA will keep the cash rate on hold at 3.60 per cent for the foreseeable future.\n\nPreviously Westpac's economic team was predicting two further cash rate cuts in May and August next year, Canstar says.\n\nHowever, the bank is leaving the door open to this possibility in the first half of 2027.\n\nThe shift comes on the back of recent inflation surprises and the RBA's \"more hawkish tone,\" Canstar says\n\n﻿Westpac has updated its cash rate forecast, predicting the RBA will keep the cash rate on hold at 3.60 per cent for the foreseeable future. (Getty)\n\nANZ still expects the cash rate to remain unchanged in 2026.\n\nWhen it comes to savings, there's slightly better news﻿\n\nCanstar says 33 banks have hiked at least one term deposit rate so far this month.\n\nThis list includes CBA, NAB, ANZ and Westpac, which changed its term deposit special from 3.90 per cent for 11 months to 4.10 per cent for 12 months.\n\nThis compares to just 10 banks that cut at least one term deposit rate so far this month.\n\nREAD MORE: Man charged with trying to spark violent protest on Sydney beach\n\nREAD MORE: Where storms are set to strike on Christmas Day ﻿\n\nAs a result, out of the big four banks, ANZ has the highest term deposit rate of 4.25 per cent, although it's only for a term of eight months.\n\nSally Tindall, Canstar.com.au data insights director, said: \"Westpac's the last big bank to rule out the possibility of further cash rate cuts on the back of what has been a marked shift in tone from the RBA.\n\n\"The central bank has gone out of its way to put borrowers on notice that cash rate cuts are well and truly out the window, but also, hikes are now back on the table.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/bondi-shooting-memorial-to-be-cleared-after-national-day-of-mourning/35023698-6b5e-4304-8a89-e1942734ea7c",
    "title": "Bondi tributes to be cleared to make way for permanent vigil",
    "publish_date": "Sat, 20 Dec 2025 19:14:43 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Last night was no different – on the eve of the\n\nNational Day of Reflection\n\n, hundreds gathered, turning on their phone lights to shine brightness during the dark time.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/queensland-communitys-only-childcare-centre-set-to-close/702688eb-c9ae-4402-9633-bdca6800125b",
    "title": "Queensland community's plea as only childcare centre to close",
    "publish_date": "Sat, 20 Dec 2025 08:20:06 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "A regional Queensland community is calling for a lifeline with its only childcare centre set to close at the end of the year.\n\nYoung families in Quilpie are calling for an experienced operator to step in to prevent essential workers from leaving the region after the centre abruptly decided to close its doors on December 31.\n\nThe regional town, located 1000 kilometres west of Brisbane, has a population just shy of 1000 people.\n\nREAD MORE: Official Christmas Day forecast revealed\n\nYoung families in Quilpie are calling for an experienced operator to step in to prevent essential workers from leaving the region. (9News)\n\nMother-of-four and the local hospital's director of nursing Jenna Nunn is among those who are stranded with no daycare options.\n\n\"I've got a one-year-old, so I'm returning to work in January,\" Nunn said.\n\n\"It is so heartbreaking, it is just mind boggling that they've pulled out, what do we do now?\"\n\nCouncil and the community were caught off guard when privately-owned operator Mulga Mates only notified them this month.\n\n\"They were just highlighting that they were having staff retention issues,\" Quilpie Shire Council mayor Ben Hall said.\n\n\"It isn't a council-run facility, so we are at arm's length from it, so it came as a surprise to us.\"\n\nREAD MORE: Lifesavers hold silent vigil at Bondi Beach to honour victims of terror attack ﻿\n\nThe regional town, located 1000 kilometres west of Brisbane, has a population just shy of 1000 people. (9News)\n\nThe announcement has sparked fears the closure could trigger an exodus of essential workers from the regional town, a situation which Nunn said would be \"catastrophic\".﻿\n\n\"I was talking to one mum the other day, had to go back to work for three months and now she's had to stop working because there's no daycare options,\" she said.\n\nHall estimates that 42 per cent of the community's workforce is made up of working women.\n\n\"If we take 42 per cent of those people out of our workforce, it's going to be devastating,\" he said.\n\nMums in the community want a city lifeline if a new provider can't be sourced.\n\nThe Department of Education will explore introducing a state-delivered kindergarten program.\n\nREAD MORE: Cancer drug set to be added to Pharmaceutical Benefits Scheme ﻿\n\nMother-of-four and the local hospital's director of nursing Jenna Nunn is among those who are stranded with no daycare options. (9News)\n\nThe process to find a new childcare provider to take over the existing licence is underway.\n\n\"There have been a few providers contacted, to date we have no takers,\" Hall said.﻿\n\n\"We anticipate this may take upwards of 90 days to actually get resolved.\"\n\nThe small community is now sending out an urgent SOS.\n\n\"I'm begging someone to please come forward and help us out,\" Nunn said.\n\n﻿\"Please reach out to the council, we will roll out the red carpet to help in any way we can,\" Hall said.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/surfside-kidz-childcare-centre-approval-suspended-batemans-bay/106162988",
    "title": "NSW regulator closes Batemans Bay childcare days before Christmas",
    "publish_date": "Mon, 22 Dec 2025 01:44:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "A Batemans Bay childcare centre has been forced to shut its doors until March after the NSW regulator found there were serious concerns for children's health, safety and wellbeing.\n\nIn an email seen by the ABC, the NSW Early Learning Commission contacted families on December 17 to let them know that the service approval for Surfside Kidz had been immediately suspended as part of an ongoing investigation.\n\nOn its website, Surfside Kidz is described as a licensed 46-place early learning centre that is a \"welcoming and inclusive space\" for children aged six weeks to six years.\n\nIn the email, the regulator said there was no current evidence of specific incidents that had caused children direct harm, but that there were \"immediate concerns\" about the level of risk that children were exposed to.\n\nThese concerns include poor supervision and staffing, maintenance issues and poor cleanliness.\n\n\"Based on the evidence available to us, we consider our decision to be appropriate and proportionate,\" the regulator wrote.\n\nSurfside Kidz is one of five regional childcare centres operated by Kidz Childcare Group. (ABC South East NSW: Toby Hemmings)\n\nSurfside Kidz is one of five childcare centres listed as part of the Kidz Childcare Group, with other centres in Nowra, Singleton and Orange.\n\nIn May this year, Surfside Kidz was issued a compliance notice by the regulator due to failing to display prescribed information, failing to notify the regulator of certain circumstances and operating without a nominated supervisor.\n\nSurfside Kidz and Kidz Childcare Group did not respond to multiple requests for comment.\n\nChristmas cancelled at centre\n\nA local mother, who wished to remain anonymous, was getting ready for her three-year-old daughter's Christmas party at the childcare centre the next day when the email landed in her inbox.\n\n\"Santa was arranged to come, so that's why it felt so out of the blue,\" she said.\n\nChristmas decorations were left up outside the closed childcare centre. (ABC South East NSW: Toby Hemmings)\n\nThe seriousness of the email left her feeling shaken and like she was a \"terrible parent\".\n\n\"You get mum guilt at the best of times, but this felt like we'd put our children at risk without actually being informed by the centre,\" she said.\n\nNo response from management\n\nThe local mother said the lack of response from centre management, other than one \"very blunt message\", had left her feeling \"shocked and disgusted.\"\n\nParents and caregivers have been asked to find alternative care arrangements. (ABC South East NSW: Toby Hemmings)\n\n\"There's been no communication,\" she said.\n\nBecause her daughter only spends two days a week at Surfside Kidz, the mother has been able to arrange additional days at her daughter's other childcare provider.\n\n\"A lot of working parents wouldn't be in my position,\" she said.\n\nIn a statement, a spokesperson for the NSW Early Learning Commission said they understood the impact service closures had on families.\n\n\"However, the safety of children is paramount and we will not compromise on this,\" they said.\n\nWhile she would not be sending her daughter back to Surfside Kidz, the local mother still wanted an explanation from the centre.\n\n\"Just tell us what the issue is so we can sleep easy,\" she said.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/esther-perel-on-building-a-village/106144018",
    "title": "Building a village means showing up even when it feels hard, says Esther Perel",
    "publish_date": "Mon, 22 Dec 2025 00:53:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Many parents will agree with the saying \"it takes a village to raise a child\", and yet they're often doing it without one.\n\nThat's according to Esther Perel, psychotherapist, author and host of the podcast Where Should We Begin?\n\n\"It's not out of nowhere that we suddenly, all over the West, are talking about the loneliness epidemic,\" says Perel.\n\n\"People don't meet in person. People don't party. People don't host. People don't just work remote — they live remote.\n\n\"We are deeply aware of the de-socialisation that is taking place.\"\n\nAnd it's not just parents who are suffering without the support of a village, Perel says.\n\nData from the latest Household, Income and Labour Dynamics in Australia (HILDA) Survey indicate socialising rates have dropped over the past 20 years, and, more recently, have not returned to pre-COVID frequency.\n\n\"People are disconnected; people are gradually more and more socially atrophied.\"\n\nBut building and maintaining a village doesn't just happen. It takes effort. It means being courageous and vulnerable. It means showing up even when it feels hard or inconvenient, says Perel.\n\nABC podcast Ladies We Need to Talk spoke with Perel about finding connection in the modern age.\n\nThese are her words.\n\nHow we replaced our village with one romantic relationship\n\nI think [the loneliness epidemic] is in part, due to individualism. We left villages, we left communities, we moved to the cities.\n\nWhy motherhood isn't for me Although Coralie doesn't want children for herself, she says it's everyone's duty to help mothers who are \"expected to do it all\".\n\nWe became a lot more free and a lot more alone.\n\nWe began to bring one romantic relationship to the heart of our life. That romantic relationship became one person who was supposed to give us what once an entire village used to provide.\n\nOne person was going to give us the feeling of belonging, of community, of continuity, of identity.\n\nHe was going to be my best friend, my trusted confidant, my passionate lover, my intellectual equal, my co-parent, et cetera.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nAnd then we began to realise, 'Wow, this party of two, that is supposed to become like a welfare state of its own, is crumbling under the amount of expectations'.\n\nWe all know that overall health is determined, not just by our physical health or even our emotional health, but by our social health.\n\nMeaningful relationships are at the core of overall health.\n\nWhy strong connection takes accountability\n\nWhat is currently overly emphasised in relationships is, 'Does it suit me? How do I feel about it?'\n\nEsther Perel on nbuilding a village If you’re feeling isolated or just want to bolster your community, this episode offers practical way to find and maintain your village.\n\nit's very much determined by individuality.\n\nWhat is missing is accountability. Accountability is the things that I do for you. It doesn't matter if I feel like it, if I like it, if it suits me, if it does me any good.\n\nI'm just talking about duty and obligation to the wellbeing of others and that I am part of a larger network of connections.\n\nAnd as part of that network, and as part of receiving that sense of belonging, I do things for you.\n\nBelonging has never existed without responsibility to others.\n\nIt involves acceptance and being seen and being a part of. [It also means I] owe things to other people. Not just what do they do for me.\n\nIf I say 'I'll come', I come.\n\nAnd that's not just etiquette, that is part of the thread, of the knots [that form connection].\n\nI don't just flake on you because I don't think that it really matters.\n\nHow we can build and nurture our village in the modern world\n\nThe modern village is often chosen. That is the fundamental difference [between historically and today].\n\nThat's a physical choice [often based on proximity]. But it is also chosen in sharing activities, sharing hobbies.\n\nIt's also a parenting group. It's people who often meet together to go through certain phases of life.\n\nThat is where there is a commonality, and a shared experience and a shared reality.\n\nYou like biking, you like hiking, you like rock climbing, you like pottery, you like vinyl records?\n\nJust go find a group near you and join on the basis of something that you share.\n\nThere is an interaction, there's an activity that mandates interaction and trust and connection on the basis of the activity.\n\nBeing part of a village means showing up for others, too. (Pexels)\n\n[In the midst of a medical crisis in our family I knew I needed support] and I created a WhatsApp group.\n\nThat group became an entire sustainability system. It existed on four continents. It checked in every day.\n\nThere were the people who cooked, the people who did transportation, the people who took care of all kinds of things that we didn't have the time to take care of.\n\nI had written, and particularly my husband, he has written a ton about collective resilience, but we had actually never fully, fully lived it. And here it was.\n\nWhat we all understood is that giving is receiving.\n\nWhen you do for others, you actually also feel important. You feel that it matters. You feel relevant. You feel that you're part of something that isn't just you.\n\nUsing micro-interactions to combat loneliness Data from the latest HILDA survey indicate socialising rates have dropped over the past two decades, and, more recently, have not returned to pre-COVID frequency.\n\nNo shame in seeking help\n\nThere's nothing to be embarrassed about in saying I want a more robust group of people.\n\nIf I say to people, 'I want to go eat', and I admit I'm hungry, we don't think that that's vulnerable.\n\nBut to say, 'I think that I've spent too much time focused on my work, or I've been moving a lot from one city to another, and therefore there's too much disruption in my social fabric.'\n\nOr 'I've been taking care of my ailing mother for the last two years, and I really have lost connection and I want to bolster my circle', is a wonderful thing to do.\n\nIt is health incarnate.\n\nThe quality of your relationships will determine the quality of your lives.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/bondi-shooting-memorials/106169460",
    "title": "How our readers reflect on the Bondi terrorist attack",
    "publish_date": "Mon, 22 Dec 2025 00:45:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "Across Australia — and as far as London, Turkey and Vietnam — people lit candles and held a minute's silence at 6:47pm on Sunday to honour the victims of the Bondi attack, one week on.\n\nWe asked our readers how they had honoured the victims and got hundreds of responses, showing reflections were deeply personal.\n\nSome lit candles, others scattered flowers, prayed or sat peacefully in nature.\n\nPeople spoke of their sadness for the victims and their families, their compassion for the Jewish community and the need for world peace.\n\nHere are some of the reflections we were sent.\n\nCandles glow across the country\n\nKrista in Hobart said she was caught up in the terror attacks in London in 2005 and is in deep shock that such an attack occurred in Australia.\n\n\"I have lit a candle at 6:47 and stood for a minute with my head bowed, reminding myself to find moments in my life where I can show others care and support.\"\n\nKrista from Hobart lit a candle at 6:47pm. (Supplied)\n\nRobyn in Shepparton, Victoria, lit a candle, observed a minute's silence and shed a tear.\n\nRobyn lit a candle in Shepparton, Victoria. (Supplied)\n\nSeveral contributors expressed solidarity with Jewish friends and communities, noting fear and the need for security at synagogues and public events.\n\nSiera in Brisbane lit a candle with her children.\n\n\"My husband is Jewish and attending the event in Brisbane, but was worried about security, so did not want his family to come,\" she said.\n\nCindy from Geelong lit a menorah that she had made after she visited Israel some years ago.\n\nHeike, on the New South Wales coast, lit nine candles to represent a menorah and listened to the sounds of the ocean.\n\nHeike lit nine candles in Vincentia, New South Wales. (Supplied)\n\nSteve in Charleville lit a citronella candle under the outback Queensland skies.\n\nSteve lit a candle in Charleville, Western Queensland. (Supplied)\n\nOthers honour victims with flowers\n\nCathy from Melbourne created native flower images for her candles.\n\nShe said they were \"symbols that this attack was on the people at Bondi and all of us\".\n\nCathy in Melbourne used candles with native flower images to remember the victims. (Supplied)\n\nJen from Far North Queensland headed for the beach, along with a friend who was in Bondi last Sunday when the attack began.\n\n\"She ran away and thankfully was not hurt,\" she said.\n\n\"She got some flowers earlier today that she threw into the ocean. Now we are just sitting on the sand quietly.\"\n\nJen reflected on the Bondi attack on Holloways Beach, Far North Queesnland. (Supplied)\n\nPeople reflect around the world\n\nMany wrote to us from overseas.\n\nDiana from Sydney is living in London and has lit a candle each evening this week.\n\nDiana in London has been lighting a candle in her window every evening this week. (Supplied)\n\nSusan from Wollongong lit candles with her family while on holiday in Vietnam.\n\n\"My partner was getting a tattoo at 2:47pm, which was 6:47 AEST, and had to explain the situation to the tattooist, a sensitive and lovely man who offered his condolences,\" she said.\n\nJulie from Perth paused at 10:47am local time while on her family holiday in Turkey.\n\nCommunities come together\n\nReligious, sporting and local communities came together to remember the victims.\n\nJames, a Catholic priest from Camden in Sydney, held a vigil at the church attended by 250 people.\n\n\"We don't have a menorah, but we used our church candles to recreate its nine-stemmed light,\" he said.\n\n\"We lit candles for the 15 victims, read from the Hebrew Scriptures, sang songs, and wrote prayers or messages of hope to lay at the altar.\"\n\nSydney's Eastern Suburbs Baseball Club held a minute's silence for the Bondi victims.\n\nChantelle in Sydney captured the minute's silence at the Eastern Suburbs Baseball Club. (Supplied)\n\nA candle-lighting ceremony and a minute's silence was held in the small coastal town of Lennox Head, New South Wales.\n\nKiri captured the minute's silence held at Lennox Head, New South Wales. (Supplied)\n\nPeople ask for world peace\n\nSeveral respondents linked their grief over the Bondi attack with humanitarian concern for Palestinians and the people of Gaza, asking that the circle of compassion extend across communities.\n\n\"Every night since last Sunday, my young daughter and I have lit our candles to shine the light of peace,\" said Amelia from Queenscliff in Sydney.\n\n\" We have prayed for all people across the world to live in peace. \"\n\nClaire in Sydney went to the Bondi Pavilion to support the lighting of the Chanukah candles.\n\nClaire in Sydney went to the Bondi Pavilion to support the lighting of the Chanukah candles. (Supplied)\n\n\"We've put our arms around each other, all of us strangers and we have sung together and listened together,\" she said.\n\n\"This has truly inspired me to do more acts of kindness, even the most simple acts help to make the world better.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/government-confirms-gas-reservation-plans/106170082",
    "title": "Government announces domestic gas reservation scheme in bid to lower costs",
    "publish_date": "Mon, 22 Dec 2025 00:11:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Gas producers on Australia's east coast will have to reserve a portion for domestic use to shore up supply and put \"downward pressure\" on prices, the federal government has confirmed.\n\nEnergy Minister Chris Bowen on Monday announced there would be consultation with the gas industry on a plan to reserve between 15 and 25 per cent of gas extracted in Australia for local use.\n\nVictoria's gas shortage explained Is Victoria really on track to run out of gas?\n\nThe scheme would start operating in 2027, but apply to any new contracts entered into from today.\n\n\"Most Australians think that Australians should have first rights to what's under Australian soil … and Australians are right about that,\" Mr Bowen said.\n\n\"This is the way that the government can put the maximum downward pressure on gas by engineering a slight oversupply of Australian needs.\"\n\nFaced with a looming gas shortage, the government earlier this year commissioned a six-month review of the market, weighing competing demands from the gas sector, manufacturers, unions and key trading partners.\n\nAustralia is one of the world's biggest LNG exporters. (Supplied: Mike Mareen)\n\nAfter much deliberation about the best model for a reserve, Mr Bowen said cabinet had settled on a permit scheme, which would now be subject to a period of consultation.\n\n\"Under the preferred export model, exporters will need to meet domestic supply obligations first and supply Australian users,\" he said.\n\nMr Bowen said he had briefed his Malaysian, Singaporean, Taiwanese, Japanese and South Korean counterparts, who were among the biggest buyers of Australian gas, about the proposal.\n\n\"They have understood the policy framework, they've understood its perspective,\" he said.\n\nThe scheme will start operating in 2027. (Supplied: Senex Energy)\n\nAustralia is one of the world's biggest LNG exporters, but according to the Australian Competition and Consumer Commission, east coast gas supplies could fall well short of demand from 2028 \"despite there being sufficient reserves and resources for at least the next decade\".\n\nAt the same time, gas prices on the east coast have tripled, pushing up power prices and pushing energy intensive industries including aluminium smelters to the brink of closure and forcing the government to spend billions bailing them out.\n\nIt is not yet clear how far below the current $12 to $14 a gigajoule gas prices would fall under the proposed permit-based reservation scheme.\n\nThe Coalition said the policy was \"too little, too late\" and warned the 2027 start date would not address \"the very immediate possible shortfalls of gas\".\n\nIn a joint statement, the opposition's resources spokesperson Susan McDonald and industry spokesperson Alex Hawke said it was \"welcome\" that the government had \"accepted the reality that the gas market has broken\" but that there were not enough details and the government was ignoring \"the root cause\" by failing to unlock new gas supply.\n\nBowen: New gas supply needed 'in some instances'\n\nMr Bowen said the depletion of gas in the Bass Strait meant it was likely new sources would be required to meet Australia's needs.\n\n\"I think a lot of Australians haven't quite realised yet just how little of the Bass Strait gas is left,\" he said.\n\n\"That will mean that we need to ensure adequate supply, and that does mean new supply in some instances, and that's why we want to provide certainty to the industry.\"\n\nFears gas reservation plan will not lower prices as hoped A long-awaited scheme to force east coast energy giants to set aside gas for Australian use is being finalised in down-to-the-wire negotiations.\n\nMr Bowen said gas was \"an important support as we transition to renewables\".\n\n\"It's very easy on the one hand for the Liberals to say 'gas is the answer to all our problems' — that's wrong,\" he said.\n\n\"And the Greens to say … 'no new gas,' — that's also wrong.\n\n\"Gas is important to calibrate and support renewables.\"\n\nBut Australian Conservation Foundation energy policy adviser Annika Reynolds said Australia didn't \"need\" to open new gas projects.\n\n\"Australia does not have a gas supply problem, it has a gas export problem, with 80 per cent of our gas going to the export industry, which has been ripping off Australians for years,\" they said.\n\n\"It will be important that a reservation scheme redirects gas from existing export projects to the domestic market, not facilitates new climate-heating gas projects.\"\n\n'Certainty' for heavy industry and manufacturing workers\n\nTim Ayres says the scheme will boost economic resilience. (ABC News: Matt Roberts)\n\nIndustry Minister Tim Ayres said the reserve would \"deliver certainty\" for blue-collar workers in heavy industries where gas will be needed as a \"back up\" and \"stabilising force\" in the transition to electrical heating systems.\n\n\"[The reserve] is a very important piece of work for securing Australia's industrial future and our future economic resilience,\" he said.\n\nAustralian Workers Union national secretary Paul Farrow has \"strongly endorsed\" the reserve, calling it a \"historic victory\" for manufacturing workers.\n\n\"The best time to introduce an Australian gas reservation scheme was a decade ago. The next best time is now,\" he said.\n\nMr Farrow said there were still details to be finalised, including what measures would be put in place to guarantee gas would be available to industry \"from day one of the scheme\".\n\n\"The gas market won't be fixed until we solve the price problem once and for all,\" he said.\n\n\"But today's announcement puts us firmly on that path.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/pub-crash-capertee-sees-seven-injured/106169318",
    "title": "Driver charged after car hits patrons at NSW pub",
    "publish_date": "Sun, 21 Dec 2025 23:58:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "A man has been charged after seven people were injured when a car crashed into a pub on the New South Wales central tablelands.\n\nEmergency services were called to the Royal Hotel Capertee, north of Lithgow, about 5:20pm on Sunday after a vehicle smashed into a concrete pole before hitting several patrons in the courtyard.\n\nA 64-year-old man and a 71-year-old woman were treated at the scene for serious injuries before being flown to hospital.\n\nAnother female patron was treated for minor injuries before also being taken to hospital, while another four patrons were treated by paramedics at the scene.\n\nThe 30-year-old driver was not injured and has been charged with negligent driving and two counts of dangerous driving occasioning grievous bodily harm.\n\nHis licence was suspended, and he was refused bail to appear before court on Monday.\n\nNotorious road\n\nIt is the second time in the past two years that a car has crashed into the Royal Hotel Capertee pub.\n\nThe president of the Capertee and District Progress Association, Graeme Pike, said the adjacent road was \"notorious\" for being dangerous.\n\n\"Capertee is a small bit of road between the long bit of the Castlereagh Highway. People … either don't see the speed signs or don't care,\" he said.\n\n\"This is the second accident for the Capertee pub … where someone has missed the bend and gone straight through.\n\n\" It is a bad part of the road. \"\n\nMr Pike has called for safety improvements to be made.\n\n\"The road should be widened a little and a centre barrier put down … so cars don't run into oncoming traffic or buildings.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/thousands-gather-for-sunrise-on-winter-solstice-at-stonehenge/106169594",
    "title": "Thousands cheer as the sun rises on winter solstice at Stonehenge",
    "publish_date": "Sun, 21 Dec 2025 23:54:58 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Thousands of people have gathered at Stonehenge to cheer and dance as the sun rose over the prehistoric stone circle on winter solstice.\n\nThe crowds, many dressed as druids and pagans, gathered before dawn, waiting patiently in the dark and cold field in south-west England.\n\nMany people dressed as druids and pagans. (Reuters: Isabel Infantes)\n\nThousands gathered at Stonehenge to mark the winter solstice. (Reuters: Isabel Infantes)\n\nSome sang and beat drums, while others took time to reflect among the huge stone pillars.\n\nMany make the pilgrimage to the stone circle every summer and winter and consider it a spiritual experience.\n\nMany consider the pilgrimage a spiritual experience. (Reuters: Isabel Infantes)\n\nThe ancient monument, erected between 3,500 and 5,000 years ago, was built to align with the movement of the sun on the solstices.\n\nThese were key dates in the calendar for ancient farmers.\n\nA reveller in costume attends the winter solstice celebrations at Stonehenge. (Reuters: Isabel Infantes)\n\nCrowds gather at Stonehenge each year to celebrate the winter solstice sunrise. (AP: Anthony Upton)\n\nEnglish Heritage, the organisation that manages Stonehenge, said about 8,500 people celebrated on Saturday at the monument on Salisbury Plain, about 120 kilometres south-west of London.\n\nIt added that its live stream of the festivities drew more than 242,000 views from around the world.\n\nA woman drinks from a horn as revellers attend the winter solstice celebrations. (Reuters: Isabel Infantes)\n\nSunday is the shortest day of the year north of the equator, where the solstice marks the start of astronomical winter.\n\nIt is the opposite in the Southern Hemisphere, where it is the longest day of the year and summer will start.\n\nA person touches a stone at the Stonehenge stone circle. (Reuters: Isabel Infantes)\n\nMorris dancers perform as part of the winter solstice celebrations. (Reuters: Isabel Infantes)\n\nThe winter solstice is when the sun makes its shortest, lowest arc.\n\nBut many celebrate it as a time of renewal because after Sunday, the sun starts climbing again and days will get a little longer every day until late June.\n\nAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/unique-art-project-gets-big-canvas-on-wind-turbines/106157212",
    "title": "Unique art project gets big canvas on wind turbines",
    "publish_date": "Sun, 21 Dec 2025 23:00:22 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Indigenous artist Sara Riches this year embarked on the biggest project of her career, in a figurative and literal sense.\n\nThe Ngadju, Wongatha, Mirning and Esperance Noongar woman was given the challenge of interpreting wind-inspired artwork by more than 200 schoolchildren from across regional Western Australia.\n\nHer creations have been digitally enhanced and are being printed onto a unique canvas — the nacelles of seven large wind turbines to be installed at one of WA's biggest gold mines.\n\nThe wind farm is part of a $296 million renewable energy project for the St Ives mine near Kambalda, about 630 kilometres east of Perth, which also includes about 60,000 solar panels and large-scale battery storage.\n\nSara Riches speaks at the unveiling of the artwork at the WA Museum of the Goldfields in Kalgoorlie-Boulder. (ABC Goldfields: Jarrod Lucas)\n\nMs Riches, who grew up in Kalgoorlie-Boulder but now lives in Perth, said it was a unique challenge.\n\n\"This region is my home, so it's an amazing opportunity to be back on country and be a part of this project,\" she said.\n\n\"It was a really exciting opportunity to tell the story about wind energy, the flora and the fauna.\"\n\nLoading...\n\nOnce built, the wind turbines will stand 130 metres high, with each of the blades measuring 80 metres in length.\n\nSix of the designs are inspired by the students, while Ms Riches created her own individual artwork based on her Ngadju heritage — the same country on which the St Ives mine is located.\n\n\"With this project I was able to create it digitally at home, and then scale it up to a huge size to fit on a wind turbine,\" she said.\n\n\"I love all the colours and it will be a sight to see how amazing and how huge the canvas will be.\"\n\nFoundation works for a wind turbine at the St Ives gold mine. (Supplied: Gold Fields)\n\nEarlier this year, fellow Perth artist Anne Gee led creative workshops at six regional schools, from Yalgoo in WA's Midwest to Leonora in the northern Goldfields.\n\nThe schools selected for the sessions were on the 1,000-kilometre transport route for the wind turbine components, which were initially shipped to Geraldton Port.\n\nMs Gee said the workshops taught children about the use of renewable energy in the resources sector.\n\nYear 3 student India Gapes with artist Anne Gee during creative workshops at South Kalgoorlie Primary School. (ABC Goldfields: Jarrod Lucas)\n\n\"I think what really strikes me is that kids are very aware of looking after their planet,\" she said.\n\n\"We've worked with kids from kindergarten to year 12. They were very imaginative, coming up with lots of different ideas.\n\n\"It will certainly be an incredible geographic installation.\"\n\nSouth Kalgoorlie Primary School students Taylor Lola and Syanna Rogers with some of the artwork produced by their year 3 classmates. (ABC Goldfields: Jarrod Lucas)\n\nThe St Ives mine is owned by South Africa's Gold Fields, which in 2020 became the first resources company in Australia to commission large-scale wind turbines, at its Agnew gold mine in the northern Goldfields.\n\nGold Fields Australia vice-president Craig Bradshaw, who was previously general manager of the Agnew mine, said the mining industry needed to embrace renewable energy and show it could produce sustainably.\n\nHe said the project at St Ives was expected to generate more than 70 per cent of the mine's electricity from renewable sources.\n\n\"It's a gauntlet we're throwing down to the rest of the mining industry, particularly the gold industry,\" he said.\n\nThe wind turbines are set to be completed by mid-2026.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/jenny-croom-portrait-artist-of-the-year/106152930",
    "title": "Jenny thought this art competition was a scam — then she won the whole thing",
    "publish_date": "Sun, 21 Dec 2025 22:44:08 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "When Jenny Croom first saw an Instagram callout for ABC's Portrait Artist of the Year, she thought it was a scam.\n\n\"It just sounded too good to be true, and there's so much of this stuff around, you've got to be careful,\" the 77-year-old Melbourne artist says.\n\nStream Portrait Artist of the Year on ABC iview This captivating eight-part art competition series explores one of the most accessible and provocative forms of art — the portrait.\n\nIt was only after phoning the headquarters of production company Endemol Shine and grilling them directly that Jenny finally accepted the opportunity was real.\n\nBefore long, she found herself attending one of the heats of the competition, held at Sydney's lofty new art space, the White Bay Power Station.\n\nJenny had nurtured a passion for painting since childhood but was only able to properly devote herself to it later in life. She held her first official exhibition at the age of 70.\n\nNow, she was competing against more than 50 Australian artists — ranging from teenagers who had barely started their careers to professionals who had won the Archibald Prize — and the whole process was being filmed for a national audience.\n\nThen, after six heats, a semi-final and a grand final, Jenny Croom was declared Australia's Portrait Artist of the Year for 2025.\n\nJenny was \"shocked\" to be pronounced Portrait Artist of the Year. ( )\n\n'You never know how things will work'\n\nJenny loved art as a child, but painting got put on the backburner as she got older — until she returned to Australia in her late 20s after living and working in Munich, Germany, with her husband Gary.\n\nShe worked with Gary in his electronics business, but her \"heart wasn't in it\".\n\nJenny always loved art as a child. ( )\n\n\"At this point we were hoping to start a family, but it just wasn't happening,\" says Jenny.\n\n\"I really needed something else, so I began to paint again. I hadn't done it since school, but I think because I was hoping for something else which wasn't happening, I really threw myself into painting and I just loved it.\"\n\nAfter her years in Europe, Jenny was inspired by the striking beauty of Australia's nature and decided to try her hand at landscapes.\n\n\"The light just hit me; it was so bright. Everything was so colourful and so, so very different,\" she says.\n\n\"I kept seeing paint colours everywhere, you know, I'd look at trees and I'd be naming the paints I'd use to paint them.\"\n\nJenny sold some of her work and put a few pieces into shows.\n\n\"For any artist considering entering next year: have a go. It's enormous fun,\" says Jenny. ( )\n\n\"Then, as I'd relaxed away from the family side of things, suddenly I was pregnant,\" she says. \"So you never know how things will work, do you?\"\n\nShe had two daughters just 15 months apart, and her art once again took a back seat.\n\nBut Jenny would paint in the kitchen whenever she could and channelled her creativity into her family.\n\nDuring filming for Portrait Artist of the Year, one of Jenny's daughters told a story about a night sky painting her mother had made for her when she was a child and couldn't sleep. Jenny had whipped it up quickly in the kitchen, the stars dabbed on with white-out.\n\n\"Only about two weeks ago she showed me this little painting,\" says Jenny. \"She'd kept it all this time.\"\n\n'No other feeling like it'\n\nJenny didn't have high expectations for her stint on Portrait Artist of the Year.\n\n\"I think because of my age — I was the oldest person there — I just thought, 'Gosh, I'm lucky to be here'.\"\n\nShe'd had one solo exhibition in Melbourne before this, having switched to portraits after tackling landscapes and abstracts.\n\nActor and comedian Celia Pacquola cried when she saw Jenny's portrait of her. ( )\n\n\"I guess, like most people, when I see a painting that's beautifully rendered of the human face, I just think, 'Oh my goodness, how beautiful and how wonderful to be able to paint like that'.\"\n\nJenny launched into this new challenge with gusto, using a plastic box lid to mix paints, and her mum's old kitchen spatula as a palette knife.\n\nWhen she won a spot in the semifinal with her portrait of actor Celia Pacquola, she realised she hadn't brought enough canvases up with her to Sydney and had to go shopping.\n\n\"I thought I was OK,\" she says, \"but I didn't imagine winning!\"\n\nShe smashed through the semis with her cosmic rendering of Dr Karl, and then painted Denise Scott, alongside artists Dean Rankine and Jenna Pickering, in the grand final.\n\nThree artists, including Jenny, painted a portrait of actor Celia Pacquola in the first round. ( ) Three artists, including Jenny, painted a portrait of actor Celia Pacquola in the first round. (ABC iview) Dr Karl Kruszelnicki was the portrait subject for the semi-finals of Portrait Artist of the Year. ( ) Karl Kruszelnicki was the portrait subject for the semifinals. (ABC iview) The three finalists competed to paint the best portrait of actor and comedian Denise Scott. ( ) The three finalists competed to paint the best portrait of actor and comedian Denise Scott. (ABC iview) Jenny's portrait of chef and restaurateur Kylie Kwong is now hanging in the National Portrait Gallery of Australia. ( ) Jenny's portrait of chef and restaurateur Kylie Kwong is now hanging in the National Portrait Gallery of Australia. (ABC iview)\n\nAfter deliberation from the judges, Jenny's striking portrait was declared the winner.\n\n\"I was shocked, I really was,\" she says. \"There were so many very good artists there, and everyone got on so well together; Jenna and I used to do a little dance together and sing songs.\"\n\nThe prize for her success was a commission to paint one more portrait, this time of renowned chef and restaurateur Kylie Kwong. Jenny would have six weeks to complete this portrait; a luxury after the four-hour heats of the show.\n\n\"It started off scaring me to death,\" she admits. \"It took me a couple of days, but I got over the feeling of being overwhelmed.\"\n\nOnce complete, Jenny's painting was unveiled at its new home: on the walls of the National Portrait Gallery of Australia in Canberra.\n\n\"She's a very warm person: strong voice, strong movements, and she always uses her hands when she's talking,\" Jenny says of Kwong. ( )\n\n\"Oh my goodness, there's no other feeling like it in the world,\" says Jenny, whose voice is still filled with a joyful kind of disbelief.\n\nShe will hold a series of workshops at the National Portrait Gallery in 2026 and has a clutch of new artworks on the go. But for now, Jenny is basking in the joy of a job well done.\n\n\"I was just so relieved that Kylie liked it.\"\n\nWatch Portrait Artist of the Year free on ABC TV and ABC iview.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/victoria-teacher-housing-shortage/106155540",
    "title": "Calls for change to help Victorian teachers put a roof over their heads",
    "publish_date": "Sun, 21 Dec 2025 22:41:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Cooper Scott decided to become a teacher when he was 15.\n\n\"I came to it pretty quickly,\" he said. \"It just seemed like the perfect job for me.\"\n\nGetting his first job this year — teaching Humanities at Pakenham Secondary College — was a dream come true.\n\n\"I love to make sure when people leave the classroom that they've left with something new,\" Mr Scott explained.\n\nWhen he got the job, he started looking for a place to rent near the school with his partner, Ashlee — also a recent graduate.\n\nBut on her wage as an entry-level social worker, and Mr Scott's graduate teacher's salary of about $79,000 a year, their housing options were limited.\n\nCommute leaves energy levels and fuel tank depleted\n\nMr Scott said the lack of housing in their price range saw them pushed further and further away from the school.\n\n\"We applied for tonnes of houses, and sometimes they look at two students, or they look at a graduate and they say, 'I don't think they'll be able to pay … things like the bond,''' he said. \"We didn't have bond money lying around.\"\n\nThe young teacher commutes from Drouin to Pakenham. (ABC News: Kyle Harley)\n\nThe couple were eventually successful in getting a lease on a two-bedroom unit in Drouin, West Gippsland — a nearly 100 kilometre round trip from where Mr Scott works.\n\nHe said the commute, on top of the demands of teaching, left him feeling depleted.\n\n\" I guess it just makes me feel mentally exhausted. Even though it's an easy drive, it's still a long drive. \"\n\nMr Scott said the commute also put pressure on his budget.\n\n\"I'm a couple of days out of payday and it's like, 'Oh, God, how am I going to fill up the car?'\"\n\nCalls for urgent intervention to help education workers\n\nAustralia's housing crisis is an issue across the board, but there are calls for urgent intervention in housing, specifically for education workers.\n\nResearch commissioned by the Australian Education Union has found affordable housing is out of reach for the majority of Victorian teachers and education support staff.\n\nThe Housing Affordability and the Teacher Shortage Victorian report was compiled by the University of New South Wales (UNSW), Deakin University and the University of Sydney.\n\nAffordable housing is out of reach for most Victorian teachers and education support staff, a report has found. (Unsplash: Taylor Flowe)\n\nOne of the lead researchers, Scott Eacott from UNSW's School of Education, said the report found almost 4,400 Victorian teaching positions were located where a teacher with a median-salaried partner could not afford to rent a three-bedroom property.\n\nIt found 43 per cent of teaching positions were in a local government area (LGA) where single graduate teachers could not afford even a one-bedroom rental.\n\n\"It's very difficult, if not impossible, without some type of intergenerational wealth or a well-off housemate, for a graduate teacher to be able to get that entry-level property,\" Professor Eacott said.\n\nHe said even teachers at the top of pay scale would struggle; for a family on a single teacher's income, 74 per cent of LGAs had a median house price that was seriously, severely or impossibly unaffordable.\n\n\"It came up at a number of workshops that we ran a couple of years ago with teachers and school leaders. And they said it was a major factor in how they were able to staff their schools,\" he said.\n\nMelbourne most unaffordable for state's teachers\n\nProfessor Eacott said Melbourne was arguably the most unaffordable place for teachers in the state.\n\n\"The inner city is the most difficult to afford to be able to live close to and in many cases there's also the difficulties of commuting in a lot of these spaces,\" he said.\n\nPresident of the Australian Education Union's Victorian branch, Justin Mullaly, said workers at inner-city schools often had the longest commutes.\n\n\"There are many teachers travelling in excess of an hour and longer each day from outer suburbs into inner-city Melbourne, because that's where the school is that they work, but they simply can't afford to live in a closer local government area,\" Mr Mullaly said.\n\nAustralian Education Union's Victorian branch president Justin Mallaly says some teachers are driving more than a hour to work. (ABC News: Matthew Holmes)\n\n\"And that's the case whether they rent or whether they seek to buy.\"\n\nProfessor Eacott said teachers should not have to travel long distances to go to work.\n\nWhile many teachers were reluctant to speak publicly on the issue, the ABC has spoken to teachers who work in inner-city suburbs such as Brunswick or Richmond and live in the outer east — around an hour's commute each way by car, and longer by public transport.\n\nLong commutes exacerbate teacher shortage, says union boss\n\nMr Mullaly argued that long commutes had a negative impact on wellbeing and productivity and made teaching less attractive as a career.\n\n\"Any effort to attract and retain teachers is going to be seriously hindered if we can't have a situation where a teacher can reasonably afford a home in reasonable proximity to where they work,\" Mr Mullaly said.\n\nThe union wants urgent intervention in housing, specifically for teachers and education support workers.\n\nIt has called for initiatives such as a new housing division within the Department of Education, rental subsidies, stamp duty exemptions for homes close to workplaces, and increased wages.\n\nThe union has called for help for education staff when it comes to housing. (ABC News: Natasha Johnson)\n\n\"We want to attract the best people to become teachers. And part of that is making sure that our profession is one that people can reasonably get housing,\" Mr Mullaly said.\n\n\"It's unclear when it became OK that our profession was one where you couldn't reasonably afford to buy a house.\"\n\nThe research comes as the union negotiates a new enterprise agreement with the state government, with the current agreement set to expire at the end of this year.\n\nTeachers are calling for a 35 per cent pay rise, and are considering industrial action early next school year if that and other demands are not met.\n\nHigher wages not a cure-all\n\nProfessor Eacott warned that it will take more than higher wages to fix the housing problem.\n\n\"You can't pay-rise your way out of this issue,\" he said.\n\n\"We actually have to build the type of infrastructure so that we can make housing available to our teachers, as with other key workers, in the areas that they're needed most.\n\n\"And it's part of ensuring that the government, at whatever level … can actually deliver on their legislative requirement for high-quality education for all children and young people throughout a state.\"\n\nIn a statement, a Victorian government spokesperson told the ABC \"good faith negotiations for a new enterprise agreement are ongoing — and we look forward to an agreement being finalised\".\n\nIt said $158.7 million was allocated in the latest budget to attract and retain teachers.\n\nThe spokesperson also said the government had a portfolio of more than 200 homes available to teachers at reduced rent at more than 60 remote or hard to staff schools.\n\nThe union wants more.\n\n\"The government has a very clear responsibility when it comes to the provision of education for children and young people, that they should be able to attend their local government school,\" Mr Mullally said.\n\n\"Even today, there was close to 2,000 vacancies being advertised in our schools.\n\n\"That means we can't be sure that we're able to deliver our curriculum programme to our students in every classroom with a permanent, qualified teacher. That's alarming.\"\n\nProfessor Eacott says housing is a growing issue for teachers as more senior staff retire. (Source: supplied)\n\nProfessor Eacott said housing would become more of an issue as older teachers leave the workforce.\n\n\"As teachers begin to retire, where do we actually start to get these new graduates and lower pay teachers actually into these areas?\" he said.\n\n\"This is a potential issue that is going to hit very suddenly and very acutely with teachers not being able to afford and to work in some of the areas where there is the greatest demand.\"\n\nTeacher hopes his passion doesn't rule out other life goals\n\nFor Mr Scott, being a teacher is more than a job.\n\nBut he hopes it does not put his other goals, like buying a house and having a family, out of reach.\n\n\"I see it as something that I really want to be doing for nearly my entire life. I found my passion … and that's what's keeping me going.\"\n\nAdditional data reporting by Madi Chwasta.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/cherry-workers-claim-bonus-withheld/105486328",
    "title": "Pickers 'living in squalor' claim their end-of-season bonus was unfairly withheld",
    "publish_date": "Sun, 21 Dec 2025 22:04:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Seasonal workers at a prominent cherry orchard have accused their employer of exploitation, claiming they were unfairly denied an end-of-season bonus and exposed to squalid living conditions.\n\nThe workers, who want to remain anonymous to avoid being blacklisted, picked fruit for Hallmark Cherries in central NSW during the summer harvest in late 2024.\n\nThe ABC has seen 10 written complaints signed by individual workers, and has spoken directly with four of them.\n\nThey describe working 10 hours a day, seven days a week in hot and humid conditions, while paying the farm to stay at a campground with faulty facilities and periods without water.\n\nCherry pickers on a NSW farm complain about working conditions and unfair denial of discretionary bonuses. (ABC News: Jake Evans)\n\nMultiple workers said before taking the job they were promised a bonus if they worked from the first to the last day of the picking season, which can run for six to eight weeks.\n\nOne worker, Joe (not his real name), alleged the bonus was used as a carrot to incentivise the workforce.\n\n\"They hold it over your head the entire time,\" he said.\n\nAt the end of the season, Joe said 12 returning Australians received the bonus but he and about 50 other mostly foreign workers were denied their bonus.\n\n\"I worked every day, I never called in sick, I never complained,\" he said.\n\n\"I did the right thing and I don't know why they're doing this.\n\nHe said the company did not respect its workers.\n\n\"Any issue brought, it's met with this feeling that they don't give a shit,\" he said.\n\n\"I think they have this idea that it's foreign workers that don't have a general sense of their working rights, that they can keep getting away with stuff like this.\"\n\nJoe, who is an Australian citizen and an experienced picker, said he was expecting a bonus of about $2,000, and this experience had soured his desire to keep working in the sector.\n\nThe ABC has seen a worker's contract that stated they would be paid $15/lug (a 32L container for collecting cherries).\n\nThe contract also included a bonus of $1.20/lug paid at the end of the season, but it was paid at the employer's discretion.\n\nHallmark Cherries was investigated by both the Fair Work Ombudsman and SafeWork NSW following complaints, but no evidence of breaches was found in relation to working conditions or industrial legislation.\n\nBoth agencies said complaints about the payment of worker bonuses was outside their jurisdiction.\n\n'It was squalor'\n\nWorkers lived in a campsite at the Hallmark Orchard in 40C heat and torrential rain. (Supplied)\n\nThe workers have all raised concerns about the conditions of the campground where they stayed during the season.\n\nThey were each charged $80 a week to stay at a campsite on the property, which amounts to almost $5,000/week.\n\nWorkers complained about the cleanliness of the shower and the drop toilets.\n\n\"It was squalor,\" said one worker.\n\n\"A hundred pickers and no toilet flush; you can imagine.\"\n\nWorkers complained of unsanitary toilets at the Hallmark Cherries site. (Supplied)\n\nWorkers reported that for extended periods of time, the campsite had no water.\n\n\"Multiple people sent messages and went to the office to complain,\" Joe said.\n\n\" They did not do a single thing about it, leaving us without any water to drink or wash for over a week. \"\n\nAnother worker, Anna (not her real name), who was in Australia on a tourist visa, said in a statement that during her first two weeks at the farm, she only had four hot showers.\n\n\"Working in agriculture you get a lot of pesticides and it's crucial for hot showers to get rid of them,\" she said.\n\nWorkers say the showering facilities at the Hallmark Cherries site were broken for a week when they were working in extreme heat. (Supplied)\n\nShe said the conditions at the farm were the worst she had encountered.\n\n\"I requested for my water bottle to be filled up [while picking in the orchard] and was denied and told that they were not able to fill my water bottle up,\" she said.\n\n\"It's like there's a lack of humanity, you're just here to make money for us and pick our fruit, so we don't really care for your quality of life.\n\n\" I've been cherry picking for about four years and this is definitely one of the worst brands I've ever experienced in my life. \"\n\nWorkers were charged $80 per week for facilities they say were substandard, not maintained and often broken. (Supplied)\n\nFollowing the conclusion of the picking season, multiple workers contacted the company to complain about missing out on the discretionary end-of-season bonus.\n\nThe workers' contracts state that workers will forfeit the bonus if the company records more than $250 worth of damage to the equipment or property by an employee.\n\nSome pickers also reported the company had deducted money from their accommodation bonds, alleging workers had scrawled graffiti on the facilities.\n\nThe workers argued there was graffiti on the facilities when they arrived at the campground, or they were being \"punished\" for the mistakes of a few.\n\nSome workers said they were told they missed out on the bonus due to significant damage to fruits and trees, but they believed wild weather during the season caused the damage.\n\nOne said he was denied a bonus because other members of his team performed badly.\n\n\"I picked clean [but] there was a bunch of people in that team that were picking horribly.\"\n\nCompany's explanation\n\nThe pickers were employed through labour hire firm North Koepang Pty Ltd.\n\nThe sole director of the firm is Matt Burgess, who is also the accounts, sales and marketing manager at Hallmark Cherries.\n\nThe ABC contacted Hallmark Cherries and Matt Burgess for comment by email, text and phone, but they have not responded.\n\nThe ABC has, however, seen an explanation sent via social media to the workers by Mr Burgess about the decision to deny the discretionary bonus.\n\nMr Burgess said he had received information about a range of issues that was \"damning enough for professional pickers and new pickers in the Hallmark team\" but he didn't detail the behaviour.\n\nHe described it as an \"extremely difficult situation\" and asked for workers to come forward to provide information.\n\n\"We understand that everyone may believe they are entitled to the incentive, worked hard and stayed to the end of the season,\" Mr Burgess said.\n\n\"However, the discretionary picking incentive is assessed throughout the harvest season and a final decision is only made once everything has been taken into consideration.\"\n\nThe ABC has contacted the peak industry body, Cherries Australia, about the workers' allegations.\n\nChief executive Penny Meashams said in a statement that: \"Cherry Growers Australia have discussed the issues with Hallmark Cherries Ltd, who say they have fully complied with investigations about these complaints by the FWO and SafeWork NSW and consider the matter closed.\"\n\nHallmark investigation\n\nSafeWork NSW and the Fair Work Ombudsman both received complaints about working conditions at Hallmark Cherries and the failure to pay the bonus.\n\nThe workplace regulator visited the site in February 2025, after the 2024 cherry-picking season had concluded, and could not substantiate the allegations about working conditions at that time.\n\nIt did not investigate the bonus because that was not within the jurisdiction of SafeWork.\n\nThe Fair Work Ombudsman (FWO) started an investigation into North Koepang in July 2025, which included a request for records and a visit to the Hallmark site.\n\nThe ABC sought documents relating to that investigation and found there were 13 contacts to the FWO about Hallmark between 2019 and 2025, including 10 enquiries and two disputes that were referred for further investigation.\n\nA final investigation letter, released to the ABC under freedom of information laws, showed the FWO found no breaches of the Fair Work Act 2009 or the Horticulture Award 2020.\n\n\"North Koepang Pty Ltd appears to be meeting its obligations under Commonwealth workplace laws and the Horticulture Award 2020,\" it read.\n\nThe FWO found the company paid its workers the minimum wage, as required, but the bonus payment was outside of the jurisdiction of the FWO as bonuses are not mandated within the award.\n\n\"Such payments would be a contractual matter and may be pursued through a small claims process,\" the letter stated.\n\nIt costs a minimum of $295 to take a claim to the relevant court, and few backpackers or seasonal workers bother to make a claim as they are moving on to other jobs or heading back to their own countries.\n\nJoe, who lives in Australia and has been a seasonal worker for a number of years, took his concerns to a community legal centre but was told there was nothing they could do to help.\n\nIn relation to complaints about alleged non-payment of breaks, the FWO said that matter also fell outside their jurisdiction because of the nature of the contracts the workers signed.\n\nIn a letter to the FWO, North Koepang advised that its contracts were based on a 2005 agreement, which it described as a \"pre-reform certified agreement made by the Australian Industrial Relations Commission\".\n\n\"The agreement … overrides any awards which may cover employees in our workplace,\" the letter stated.\n\nUnder that agreement, casual employees are not paid for breaks, which they would be under modern awards.\n\nThe Fair Work Ombudsman will not be taking further action in relation to this matter.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/nikhil-chaudhary-bbl-half-century-six-out-of-the-ground/106169312",
    "title": "Cattery can't hold 'Canes star as six launched onto roof in BBL win",
    "publish_date": "Sun, 21 Dec 2025 21:30:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "Nikhil Chaudhary has launched a six onto the roof of Geelong's Kardinia Park as the Hobart Hurricanes powered to a cruisy victory over the Melbourne Renegades.\n\nChaudhary (79 off 38) and Chris Jordan (4-19) produced their best BBL games in the seven-wicket mauling of the Renegades.\n\nThe victory, completed with 37 balls to spare, took the defending champions to the top of the ladder.\n\nAfter winning the toss and restricting the Renegades to 9-145 in damp conditions, the Hurricanes cruised to 3-149 in just 13.5 overs as Chaudhary plundered his highest BBL score.\n\nIt featured seven fours and four sixes — one of which, off the bowling of Gurinder Sandhu, sailed onto the roof of the Reg Hickey Stand at square leg.\n\nBen McDermott (49 off 33) finished off the game with a six and scored 49 from 33, featuring two fours and four sixes.\n\nHe and Chaudhary put on 93 for the third wicket as the Hurricanes bounced back from last week's loss to the Melbourne Stars at the MCG.\n\nDespite the batting fireworks, Jordan was named player of the match after his stingy bowling helped restrict the Renegades to 9-145 from their 20 overs, remarkably starting with the first maiden of the BBL season.\n\nHe recorded his best figures from 56 BBL games, but fell just short of his first five-wicket haul in his 422nd T20 outing.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I'd be lying if I said I wasn't hunting the five,\" Jordan told Fox Sports.\n\nHobart shuffled its attack and Jordan bowled the first over, and started with nine straight dot balls, conceding only one boundary on the night.\n\n\"Somebody had to step and play a slightly different role. It was just nice, more importantly, as a team, to bounce back after the defeat a few days before,\" he said.\n\n\"You can lose games of cricket, but it was more some of our non-negotiables, like our efforts and attitudes in the field … it's nice to bounce back.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/dementia-friendly-town-of-ouyen-in-regional-victoria/105888288",
    "title": "When Helen's late mum became lost or forgetful, her community helped",
    "publish_date": "Sun, 21 Dec 2025 21:23:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "In the small Victorian town of Ouyen, Helen Healy's mum Kath spent years living independently with vascular dementia.\n\n\"It wasn't the kind [of dementia] that really changed her personality,\" Ms Healy said.\n\n\"She was always a really generous, funny and engaging kind of person.\"\n\nHelen said while they had considered other options, her mum, who passed in 2022, had insisted on remaining at her home in Ouyen for as long as she could.\n\nAt first, Ms Healy, who lived in Mildura, 100kms away, said she worried what would happen if her mum got lost or forgot things while on her own.\n\nBut she soon realised the Ouyen community was on hand to help.\n\n\"It wasn't just the paid professionals who supported her,\" Ms Healy said.\n\n\"I would get phoned from somebody who owned the local supermarket or somebody in the bakery shop or the chemist going, 'Your mum's been going down the street popping into each shop asking if we've got her car keys because she's put them down somewhere.'\n\n\"I just thought that level of care from the community itself was just exemplary and probably leading the way for a community becoming a dementia-friendly place.\"\n\nOuyen residents yarn bombed a prominent jacaranda tree in town, to raise awareness of dementia. (Supplied: Mallee Track Health and Community Service)\n\nOuyen leading the way\n\nOuyen, a Mallee town 440 kilometres north-west of Melbourne, has a population of about 1,100.\n\nIt is well known for its grain production and sheep farming, but also proudly labels itself as \"dementia friendly\".\n\nDementia Australia has been leading a push to reduce stigma and increase support for people living with the disease, through its Dementia-Friendly Communities initiative.\n\nThe program aims to make towns a \"place where people living with dementia, their families, community members and businesses create spaces that are respectful, supportive and empowering\".\n\nMallee Track Health and Community Service's Vanessa Morrish said a lot had changed in Ouyen since she began working with local dementia clients 18 years ago.\n\n\"I have personally noticed a lot of change with, not only awareness of the disease, but also people having a better understanding and [being] happy to have open conversations with people living with dementia and supporting the carers, something that was rarely seen before,\" she said.\n\nVanessa Morrish says the Ouyen community is proud to be considered \"dementia friendly\". (Picture: Mallee Track Health and Community Service)\n\nMs Morrish said becoming dementia friendly was a \"game changer\" for the small community, which had the power to make a \"big difference\" in the lives of others.\n\n\"With the growth of dementia in our communities, I think every town that should be on board to help those living with dementia feel safer and included,\" she said.\n\n\" It's something that is not going away. \"\n\nMallee Track Health and Community Service hosts educational events every year during Dementia Action Week, aiming to further challenge the stigma and inspire action from all corners of the community.\n\nDuring this year's events, Ouyen school students raised awareness by creating more than 40 purple wooden trees, which were each decorated by a local business, and community members knitted and crocheted a covering for a jacaranda tree on the main street.\n\nSchool students from Ouyen helped create wooden trees for dementia awareness. (Supplied: Mallee Track Health and Community Service)\n\nThe service also hosts regular intergenerational activities, helping children feel comfortable, and aware of those living with dementia, from an early age.\n\nMs Morrish said all the initiatives were about \"changing the way we think, speak and act\".\n\n\"It's about learning how to support someone who is struggling and discovering how we as a community can make a difference, not just for those living with dementia, but also for their carers and families.\"\n\n\"Early education and first-hand experiences is the key.\"\n\nMs Morrish said there had been an overwhelming response from the community and reiterated that any town could be like Ouyen.\n\n\" You don't need big money to create a dementia-friendly town, you just need big hearts. \"\n\nWhat makes a community dementia friendly?\n\nAccording to Dementia Australia, two-thirds of the estimated 433,300 Australians with dementia resided in communities that could better support their ability to live independently.\n\nTo improve support, Dementia Australia's three key factors are education, collaboration with people living with dementia and advocating for change.\n\nDementia Australia executive director of services, engagement and research Kaele Stokes said including people living with dementia in the community was one of the most important aspects of improving a town's status.\n\nKaele Stokes says being dementia friendly is about doing a range of things to increase inclusivity and awareness. (Supplied: Dementia Australia)\n\nDementia Australia also provides a checklist of community recommendations:\n\nRaise awareness: When people learn about dementia and hear the voices of people living with dementia, discrimination and stigma in the community can be reduced. Foster inclusion: Supporting people living with dementia to feel included and able to participate helps them stay as active as they can in the community. Encourage collaboration: When businesses, organisations and individuals collaborate with people living with dementia, everyone can work together to achieve change. Empower communities: Awareness, inclusion and true collaboration, supported by the Dementia-Friendly Communities program, gives communities the power to build dementia-friendly communities where everyone benefits.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-22/nt-direct-flights-between-darwin-and-china-recommence-guangzhou/106158228",
    "title": "Hopes new Darwin-to-China flights will bring down domestic airfares",
    "publish_date": "Sun, 21 Dec 2025 20:57:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Direct flights have resumed between the Northern Territory and China for the first time since the COVID-19 pandemic, with three weekly services from Darwin to the city of Guangzhou.\n\nThe China Southern Airlines flights began earlier this month and come at the end of a year in which the NT capital has also added new air routes to Singapore, Malaysia and Indonesia.\n\nBusiness and government officials are hailing the new routes as a win for trade and tourism ties between Asia and Australia, and a sign that the NT's economy is on the rebound.\n\nChina Southern Airlines will directly connect travellers heading over to Asia from the Top End. (ABC News: Matthew Garrick)\n\nRob Porter, the executive general manager of the Airport Development Group (ADG), said the new flights to Guangzhou would have the capacity for 52,000 passengers annually.\n\n\"Bookings are pretty solid to start off the new service, and the message is getting out there,\" he said.\n\n\"I think both cities have a wonderful opportunity for tourism.\n\n\"[Guangzhou] is an amazing city, 32 million people, some amazing sights to see.\"\n\nRob Porter is the executive general manager at the Airport Development Group in Darwin. (ABC News: Matthew Garrick)\n\nAsian Relations Minister Robyn Cahill said the NT government saw the new international routes as a \"great statement about the way in which our economy is moving\".\n\n\"We have to remember that [Guangzhou] is a departure point pretty much for the rest of the world, so it makes Darwin far more accessible across all destinations,\" she said.\n\nThe Indonesian ambassador to Australia, Dr Siswo Pramono, said the new international routes would be a win for both sides, to help develop regional trade in mining, cattle and tourism.\n\nDr Siswo Pramono is the Indonesian ambassador to Australia. (ABC News: Michael Franchi)\n\n\"We have 1.7 million Australians visiting Indonesia every year,\" he said.\n\n\"Many of them end up in Bali, but the rest also in other part of Indonesia — and this is good.\"\n\nNT government offers passenger subsidies\n\nThe NT government is subsidising the new route under the Territory Aviation Attraction Scheme, but the cost to taxpayers remains confidential due to commercial reasons.\n\nMs Cahill said while she couldn't reveal the exact figure paid to China Southern, she said the government believed the investment would pay dividends.\n\nRobyn Cahill is the territory's minister for trade, business and Asian relations. (ABC News: Michael Franchi)\n\n\"It's really important that we invest in these services to demonstrate to the proponents who want to come in here that we also believe in the viability of these services,\" she said.\n\n\"For every Chinese tourist that comes into the Northern Territory, for a very small investment we get around about a $3,000 return, so it's quite significant.\"\n\nPreviously, direct flights had operated between Darwin and the Chinese city of Shenzhen via Donghai Airlines, but ceased servicing the jurisdiction during the pandemic in 2020.\n\nPrior to the Donghai Airlines route folding, questions had been raised about its sustainability.\n\nThree flights will take passengers from Darwin the city of Guangzhou every week. (ABC News: Matthew Garrick)\n\nMs Cahill said she hoped the China Southern flights could be a longer-term prospect.\n\n\"We just have to use it,\" she said.\n\n\"People are asking for these opportunities … businesses are looking for the opportunity to expand their horizons.\n\n\"So it's here, it's on our doorstep, and now we just have to back it in.\"\n\nHopes for lower domestic airfares\n\nOver recent years, the NT has struggled with its domestic Australian routes, with residents facing exorbitant airfares, poor flight times and frequent unexpected scheduling changes.\n\nAirlines accused of price gouging in Darwin Sky-high airfares, poor flight times and unexpected scheduling changes have become standard in the NT capital of Darwin.\n\nMr Porter and Ms Cahill said they believed the new international flights could help put downward pressure on domestic flight costs and incentivise airlines to run at better times.\n\n\"Encouraging people to fly into Darwin, experience our beautiful territory, then perhaps fly on to other destinations like Sydney, Brisbane, Melbourne — it will absolutely boost the availability,\" Ms Cahill said.\n\nKate Heelan, chair of the Australian Indonesia Business Council NT, said the new international flights could also help better connect the jurisdiction to its neighbouring trading partners.\n\n\"Connectivity has always been an issue, particularly air connectivity,\" she said.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/green-bean-and-chickpea-salad-with-crispy-halloumi-and-tajin-dressing-20251222-p5nphn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Green bean and chickpea salad with crispy halloumi and Tajin dressing",
    "publish_date": "Mon, 22 Dec 2025 13:13:20 +1100",
    "category": "lifestyle",
    "authors": [
      "Jessica Brook"
    ],
    "text": "Step 1 Blanch the beans in salted boiling water for 3 minutes, or until they are just tender. Drain and refresh in cold water. Place the beans in a large bowl with chickpeas, cucumber and tomato, and gently toss.\n\nStep 2 Cut the halloumi into 5mm-thick slices. Heat 1½ tablespoons of olive oil in a large non-stick frying pan over medium heat. Fry the halloumi in a single layer for 2-3 minutes, turning once, until both sides are golden and crisp. Drain on a paper towel and set aside.\n\nStep 3 To make the dressing, combine the Tajin spice, pistachios, vinegar, honey and the remaining 1½ tablespoons of oil in a lidded jar and shake to combine.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/goodfood/vic-good-food-guide/flinders-general-store-20251222-p5npii.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Flinders General Store",
    "publish_date": "Mon, 22 Dec 2025 13:07:15 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nEncompassing a boutique grocer, wine store, cafe and an everyday supermarket, this is an essential stop for both residents and visitors to the Mornington Peninsula. Find ready-to-heat pies and lasagnes from Johnny Ripe, perfect for an easy holiday house dinner; pantry fillers (and great gifts) from local businesses such as Red Gum BBQ; fresh seafood, cheese, charcuterie, Tuerong Farm bread baked nearby, and essentials such as milk, eggs, butter, fruit and vegetables.\n\nHot food to-go includes pies, potato cakes and toasties, plus there are muffins baked in-house, which can be enjoyed in the cafe at one of a handful of tables. Coffee is by Blume, which roasts in Melbourne. Occasionally, the shop hosts wine tastings by local producers, too.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/seven-west-shareholders-overwhelmingly-back-southern-cross-takeover-20251222-p5npi7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Seven West shareholders overwhelmingly back Southern Cross takeover",
    "publish_date": "Mon, 22 Dec 2025 13:01:59 +1100",
    "category": "finance",
    "authors": [
      "Michael Philipps"
    ],
    "text": "Seven West Media shareholders have thrown their support behind the acquisition of the company by Southern Cross Media, backing the merger at a meeting on Monday.\n\nA total of 99.36 per cent of the votes cast by Seven West shareholders favoured the acquisition by way of a scheme of arrangement.\n\nSeven West Media chairman Kerry Stokes. Credit: Trevor Collens\n\nUnder the proposal, Seven West shareholders will receive 0.1552 Southern Cross shares for every SWM share they own. Prior to the vote, SWM directors unanimously recommended shareholders approve the merger.\n\nIf the scheme is implemented, existing Seven West shareholders will hold 49.9 per cent of the combined group and Southern Cross shareholders will own the remaining 50.1 per cent.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/goodfood/vic-good-food-guide/shoreham-general-store-20251222-p5npi8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Shoreham General Store",
    "publish_date": "Mon, 22 Dec 2025 12:59:10 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nThis general store - one of many across the peninsula - is where you’ll go to buy cereal and dishwashing liquid, but you can also pick up Mumma Made relishes crafted in nearby Dromana, and a great flat white. The weatherboard building has a verandah with outdoor seating and a cute sign out front that advertises “dog parking”. Inside, half the space is used as a cafe serving basics like bacon and egg rolls, chicken nuggets, salad rolls and pies.\n\nThe retail area is a showcase of local products, from Moonah Dunes honey to handmade chopping boards and furikake, the Japanese seasoning, from Southern Seagreens. Kids will love the bags of gum balls, licorice allsorts, and rosey apples.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/queensland/weather-warnings-for-christmas-revellers-planning-to-heading-outside-20251222-p5npfx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Weather warnings for Christmas revellers planning to head outside",
    "publish_date": "Mon, 22 Dec 2025 12:55:26 +1100",
    "category": "finance",
    "authors": [
      "Catherine Strohfeldt"
    ],
    "text": "Brisbane will suffer a one-two punch of heatwave and thunderstorm conditions before Christmas Day, with pub-goers, travellers and those heading to the beach urged to take care.\n\nStagnant water off Australia’s east coast and a band of thunderstorms working its way up from the southern states have concentrated hot, humid air over south-east Queensland, weather bureau forecaster Jonathan Howe said.\n\nIn Brisbane, heatwave conditions were expected to last until Boxing Day, with overnight minimums in the mid-to-low 20s, despite afternoon storms.\n\nThunderstorms are expected in Brisbane across Tuesday and Wednesday, but will not quell the heat for long. Credit: William Davis\n\n“We will see some afternoon thunderstorms from [Wednesday] – obviously, there will be some rainfall, but it will really only start clearing up from Boxing Day,” Howe said.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/goodfood/vic-good-food-guide/social-club-balnarring-20251222-p5npi5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Social Club Balnarring",
    "publish_date": "Mon, 22 Dec 2025 12:51:55 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nLocals flock here for craft beers and Pisco Sours under gum trees, but that’s not all. Latin American plates are supremely share-friendly whether anticuchos chicken skewers, chilli prawn tacos or smoked lamb ribs with lime-chilli glaze. A kids’ menu sticks with the theme. Beers on tap - mostly independent - include Social Club’s own brews, from pacific ale to mid-strength and a sparkling ale.\n\nThe venue even puts on the occasional live gig, with acts including Magic Dirt and Cosmic Psychos. Inside the vibe is cosy and old-school with fireplaces, seating nooks and tartan fabric. Outside, bars, fire pits and plenty of space to roam make it a hit with young and old.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/business/companies/red-metal-inks-jv-to-fast-track-copper-hunt-in-wa-20251222-p5nphw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Red Metal inks JV to fast-track copper hunt in WA",
    "publish_date": "Mon, 22 Dec 2025 12:45:00 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Red Metal Limited has strengthened its position in Western Australia’s emerging Madura copper province after striking a joint venture (JV) deal designed to fast-track drilling at its highly prospective Sharon Dam iron oxide copper-gold (IOCG) target.\n\nUnder the agreement, Artemis Resources can earn up to a 60 per cent interest in Red Metal’s Sharon Dam project by spending more than $5 million over three years, providing Red Metal with a clear pathway to advance the asset while limiting shareholder dilution.\n\nLocation of the Sharon Dam project- subject of the new Red Metal JV with Artemis.\n\nThe JV kicks off with an initial $400,000 drilling program, which will be jointly supported by a $220,000 grant from the Western Australian Government’s Exploration Incentive Scheme (EIS). The funding support materially lowers Red Metal’s upfront exploration costs and de-risks the first drill test of what the company believes is a standout IOCG target.\n\nImportantly, Artemis has the option to continue earning its interest by meeting the agreed expenditure milestones or withdraw from the agreement at any stage, leaving Red Metal with flexibility and retained exposure to exploration success.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/i-haven-t-seen-penny-wong-shed-a-single-tear-ley-slams-wong-20251222-p5nphz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'I haven’t seen Penny Wong shed a single tear’: Ley slams Wong",
    "publish_date": "Mon, 22 Dec 2025 12:36:24 +1100",
    "category": "finance",
    "authors": [],
    "text": "'I haven’t seen Penny Wong shed a single tear’: Ley slams Wong\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/business/companies/beetaloo-nt-flow-rates-deliver-basin-leading-gas-performance-20251222-p5nphg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Beetaloo NT flow rates deliver basin-leading gas performance",
    "publish_date": "Mon, 22 Dec 2025 12:07:13 +1100",
    "category": "finance",
    "authors": [
      "James Pearson"
    ],
    "text": "Beetaloo Energy has delivered another confidence-boosting result from its flagship Beetaloo Basin gas play, with its Carpentaria-5H well clocking up one of the strongest flow performances ever seen in the basin.\n\nWhile still in a 30-day clean-up period, the well has already posted standout gas rates, reinforcing the company’s strategy of prioritising long-term productivity as it prepares for pilot gas sales in 2026.\n\nBeetaloo Energy preparing for flow testing at the company’s Carpentaria 5-H gas well in the Northern Territory.\n\nCarpentaria-5H reached a peak gas rate of 11.2 terajoules (TJ) per day and averaged a basin-leading 7.1 TJ/day across the test period. The well finished the test flowing at 6.3 TJ/day, a result that management says highlights an impressively low decline rate at this early stage.\n\nNotably, the numbers were achieved while the well was still dewatering, with only about 23 per cent of the fracture stimulation fluid recovered so far, suggesting the best is still yet to come. Both Carpentaria-2H and Carpentaria-3H, two of Beetaloo’s previous wells, recorded material uplifts in gas flows once clean-up was complete, with post-clean-up flow rates jumping by up to 30 per cent.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/basketball/point-to-prove-as-wildcat-doolittle-torches-jackjumpers-20251222-p5npha.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Point to prove’ as Wildcat Doolittle torches JackJumpers",
    "publish_date": "Mon, 22 Dec 2025 12:00:44 +1100",
    "category": "sports",
    "authors": [],
    "text": "A fired-up Kristian Doolittle has burst back to life as Perth overpowered Tasmania on the road to stay in touch with the NBL’s top four.\n\nKristian Doolittle celebrates victory over the Jackjumpers in Hobart. Credit: Getty Images\n\nThe Wildcats had lost three of their last four and the import had scored just five, eight and four points in his past three outings.\n\nBut “playing pissed off and with a point to prove”, Doolittle exploded with 30 points and six rebounds in Sunday’s 94-85 win over the JackJumpers.\n\nHe found his range from deep in the first half before a fierce dunk and a pair of free throws from successive plays late in the fourth quarter took the heat out of the host’s comeback.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/politics/federal/historic-policy-domestic-gas-reservation-scheme-declared-20251222-p5npfg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘A long time coming’: Labor launches landmark bid to slash energy bills, plug gas shortfalls",
    "publish_date": "Mon, 22 Dec 2025 12:00:37 +1100",
    "category": "finance",
    "authors": [
      "Mike Foley",
      "Nick Toscano"
    ],
    "text": "Gas exporters will be forced to hold back supply for customers in the eastern states as the Albanese government launches an urgent push to drive down domestic energy bills and prevent shortfalls.\n\nThe reservation policy, announced on Monday, is the first of its kind on the eastern seaboard, and will apply to the operators of three giant liquefied natural gas (LNG) export terminals in Queensland.\n\nMost of the gas produced on the east coast is converted into LNG and exported. The federal government is developing a scheme to force producers to reserve some for the domestic market. Credit: Bloomberg\n\nThe government said its scheme would apply to new export contracts and force companies to reserve between 15 per cent and 25 per cent of this production for the east coast market.\n\n“Australian gas for Australian users as the first priority,” Energy Minister Chris Bowen said.",
    "source": "SMH",
    "cluster_id": 8
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/starc-fires-ashes-warning-as-broad-doubles-down-on-worst-australian-team-since-2010-11-claim-20251222-p5npea.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Starc fires Ashes warning as Broad doubles down on ‘worst Australian team since 2010-11’ claim",
    "publish_date": "Mon, 22 Dec 2025 12:00:00 +1100",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Mitchell Starc says Australia are intent on securing an Ashes whitewash, while former England quick Stuart Broad insists he does not regret his pre-series claim that this is the worst Australian side since 2010-11.\n\nAustralia’s cricketers celebrated long into the night in Adelaide on Sunday after sealing an unassailable 3-0 series lead ahead of the remaining Tests in Melbourne and Sydney.\n\nTravis Head posted on Instagram late on Sunday night a picture of him drinking alongside skipper Pat Cummins with the caption “Is it 2010 yet?” followed by three laughing emojis.\n\nThe post was a pointed reference to Broad’s pre-series comment that Australia were set to field their weakest Ashes team since England triumphed 3-1 in 2010-11.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/sbs-summer-reading-guide-best-books-diverse-authors/fldmezils",
    "title": "From 'unashamedly political' to 'really steamy': SBS' summer reading guide",
    "publish_date": "Sun, 21 Dec 2025 18:38:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "Long hot summer days are a prime time for Australians to escape into their books, and this year, 10 Australian authors have selected their favourite reads for SBS' summer reading guide.\n\n\n\n\n\nTheir choices span a wide range of genres, including steamy romances perfect for indulging in while sitting by a pool sipping cocktails, thought-provoking essays to discuss with family and friends, powerful memoirs to contemplate as a new year begins, and surreal explorations of family life.\n\n\n\n\n\nThe authors — Keshe Chow, Steve MinOn, Brooke Boney, John Safran, Saman Shad, Randa Abdel-Fattah, Kumi Taguchi, Jade Goodwin, Natalia Figueroa Barroso and Sisonke Msimang — are all from CALD backgrounds.\n\n\n\n\n\nThe novels they've chosen are ambitious, edgy, confronting, emotional and funny.\n\n\n\n\n\nWhether you’re looking for escapism, depth or joy, SBS' summer reading guide has you covered.\n\n\n\nSaman Shad is the author of The Sex Lives of Married Women. Source: SBS, Supplied\n\n'Really funny, hot sex'\n\nSydney author Saman Shad was born in Pakistan but grew up in Australia on a diet of 90s rom-coms, which she describes as \"all very white and heterosexual\". She never saw two brown characters falling in love — something she set out to change in her first novel The Matchmaker, which tells the story of a wealthy Pakistani bachelor who falls for a western Sydney 'matchmaker'. Her latest novel Sex Lives of Married Women is a cheeky exploration of sex and marriage from the perspective of three different women who soon become friends.\n\n\n\n\n\nFirst on Shad's list of recommendations is Love Unleashed (Melanie Saward), which follows an Aboriginal woman who leaves behind her life in Brisbane to pursue her dreams in New York City – a journey many Australians fantasise about. Shad says she loves that the book features an Aboriginal protagonist in a story that's not focused on trauma, highlighting \"the joy, the happiness and the fun — all the wonderful things\" that are part of having a diverse background.\n\n\n\n\n\nIt’s a refreshing point of difference that Shad also attributes to The Kiss Quotient (Helen Hoang). The protagonist is autistic and hires an escort to explore intimacy. \"It's a really fun and funny book.\" Shad says the characters have \"hot sex\" and the protagonist, who is a maths whiz, is a welcome contrast to female characters in many romances, who are often \"bumbling around\".\n\n\n\n\n\nThe Other Americans (Laila Lalami) is written by a Pultizer Prize finalist who has also been longlisted for the Booker Prize. It's about a Moroccan immigrant in California who is killed by a speeding car and the impact this has on those around him. Shad says it's perfect for those with short attention spans, as the chapters are really short and there are many different characters, so you don't get bored. But it also stayed with her for a long time. \"Sometimes you read a book and … the characters are inside of your body.\"\n\n\n\nBrooke Boney is the author of memoir All Of It. Source: SBS, Supplied\n\n'Bringing light to places many would prefer to stay dark'\n\nThis year, journalist and broadcaster Brooke Boney released her memoir All of It, which reflects on her life in the public eye and her Gamileroi identity. It's a vulnerable account that describes her feelings of responsibility in \"overcoming [her] circumstances\" and challenging racist perceptions around the work ethic of Black people.\n\n\n\n\n\nBoney is recommending Praiseworthy (Alexis Wright) as the perfect book to sit with over the summer break. \"Wright leans into the surreal and the mythic\" in her book, which is set in a small town living under the looming shadow of a cloud, which heralds ecological catastrophe. Its cast of characters includes a woman seeking repatriation for her Aboriginal-Chinese family to China. \"Sometimes hyperbole is the only honest way to describe the absurdity Indigenous people are forced to navigate.\"\n\n\n\n\n\nHer second choice All About Love (bell hooks) is a 1999 classic that Boney describes as \"honest, practical and deeply human\". The first volume in a trilogy, hooks (who spells her name uncapitalised) explores ideas of love and what it means. \"In a moment where so many of us feel unsure about how to engage with men and boys, and their attitudes and relationships with women, All About Love offers a starting point — a foundation, a manual, a straight-up recalibration of how we relate to each other.\"\n\n\n\n\n\nBlack Witness (Amy McQuire) is the winner of the 2025 Queensland Premier's Award for a work of state significance. It looks at the media's failures in reporting on Indigenous affairs. Boney says it lays bare why First Nations voices are ignored, deprioritised and dismissed, and the devastating consequences of that silence. \"McQuire brings light to places so many would prefer to stay dark and she does it with sharpness, courage and an unwavering sense of justice.\"\n\n\n\nSteve MinOn is the author of the book First Name Second Name. Source: SBS, Supplied\n\n'Humorous, snippy and unashamedly political'\n\nSteve MinOn is author of First Name Second Name, which was shortlisted in the people's choice category of the 2025 Queensland Literary Awards. MinOn has chosen ambitious books that play with form and explore themes of cultural detachment and identity. He praises the books for their creativity, humour and edginess, and for challenging stereotypes about migrant stories.\n\n\n\n\n\nThe two protagonists of Fierceland (Omar Musa) are the children of a palm oil magnate. They're attending school and university in Australia. \"They feel like imposters in their culture, and I found that really interesting because that really is an Australian story. [Many of us are] taken away from our culture, our heritage, and we set up life here in Australia, and then we have to reflect on who we are.\" But the story also features a mythical demon and draws on tropes from horror stories. MinOn says there's a lot of fun to be had. \"It's a way into a literary fiction landscape that doesn't seem literary or scholastic.\"\n\n\n\n\n\nHailstones Fell Without Rain (Natalia Figueroa Barroso) is told from the perspective of a young migrant family from Uruguay who are living in western Sydney. Shifting time and location, the protagonists try to make sense of their connections to Uruguay, their new home in Australia and each other. \"These themes of distancing and detachment, and identity through that lens, are just really interesting to me, probably because I also write from that same perspective,\" says MinOn. Figueroa Barroso is part of the western Sydney-based literacy movement Sweatshop and, like many of its writers, she doesn't use traditional literary fiction language, MinOn says. \"They write like the street and her voice in that book is incredible. It's very entertaining, quite humorous, snippy, a bit bitchy and also unashamedly political.\"\n\n\n\n\n\nGhost Cities (Siang Lu) won this year's Miles Franklin Literary Award, and the story is told from the perspective of a #BadChinese who gets a job in the Chinese consulate as a translator. But, he's using Google Translate to do his job. The character goes on a wild odyssey to China and this allows the book to provide an Australian perspective of the country. MinOn says the book is a feat of the imagination with beautiful descriptions. It's also absurdly funny. \"It draws you in with its humour, then hits you between the eyes with its bigger themes. It's so relevant at the moment, [when the world is grappling] with despotic rulers rising in political landscapes around the world. This book reminds us how absurd the whole idea is, and that the best way to deal with it is to make fun of it.\n\n\n\nRanda Abdel-Fattah is author of the book Discipline. Source: SBS, Supplied\n\n'A very powerful confrontation with people'\n\nFormer lawyer Randa Abdel-Fattah is the author of 12 books for children and young adults. Her first book for adults, Discipline, was published this year and looks at the experience of Palestinian Australians. Fattah says she chose powerful books that have sustained her, both on a spiritual and intellectual level, \"unveiling myths and lies about the world that we live in\".\n\n\n\n\n\nAs a person navigating the worlds of academia and literature, Abdel-Fattah says she was struck by Perfect Victims: And the Politics of Appeal (Mohammed El-Kurd), which asserts the freedom of Palestinians to tell their stories without fear. \"The liberation that came with this book was so beautiful and the validation that you can be angry, and you can lean into the very valid rage that you have, and not have to conform, and have your language policed.\"\n\n\n\n\n\nThe essays in Black Thoughts Matter (Chelsea Watego) spoke to Abdel-Fattah, who has Palestinian and Egyptian heritage, about what it means to be a settler of colour living on Aboriginal land. \"To be part of a movement of freedom that extends beyond just thinking about Palestine, but thinking about my responsibilities here [in Australia].\" It also resonated in its assertion of the right of Indigenous people to resist conventional ideas about what scholarly or academic work should be. \"To include personal stories and not have to subscribe to ideas that they're being biased or subjective.\"\n\n\n\n\n\nOne Day, Everyone Will Have Always Been Against This (Omar El Akkad) is a book of essays \"that holds the mirror up to self-idealised myths that the West tells itself\". Abdel-Fattah says it reinforces how the Gaza war has exposed the fault lines of liberal democracy — and ideas of academic freedom, freedom of speech, democracy and liberalism. \"[It's] a very powerful confrontation with people, the assumptions that people have made about the world that we live in, and the obscenity of it.\"\n\n\n\nKumi Taguchi is author of the memoir The Good Daughter. Source: SBS, Supplied\n\n'You'll fall in love with the characters'\n\nThe journalist and host of SBS' Insight program, Kumi Taguchi , has chosen three books that reflect a sense of stoicism. In her emotionally honest memoir The Good Daughter, she explores her struggles with finding a sense of place amid mixed feelings about her absent father and the Japanese heritage she inherited.\n\n\n\n\n\nWhat I Talk About When I Talk About Running (Haruki Murakami) is written by one of Taguchi's favourite authors, and she says the book is basically a memoir. \"It's [a short book], it's beautiful and it's very reflective. I love how he breaks the genre of an autobiography.\" It provides insight into Murakami's disciplined, simple life and his love of running. She says you'll enjoy this book \"if you like running, or even this idea of creativity or repetition [because] it's not really about running [and] it's not really about a Japanese author\".\n\n\n\n\n\nA Man Called Ove (Fredrik Backman) is a story written in a darkly humorous tone about a grumpy man who has lost his wife and has decided to kill himself. But the universe keeps intervening, and there's a softening of his character because of the \"madness\" of the neighbourhood he lives in. \"He finds himself having to step up and become something for others,\" Taguchi says. \"It's very clinical, very funny and very observant about quirks of human personality. You fall in love with the characters he writes about.\"\n\n\n\n\n\nTaguchi says she was fascinated with Russia from an early age, and Patriot: A Memoir (Alexei Navalny) provides insight into the country and the struggles of its people. It also gives shape to the early years of an extraordinary person and how growing up near Chernobyl shaped Navalny's sense of distrust of authorities. \"I'm quite fascinated with where people get strength from [and] I'm quite fascinated by people who really do have a deep sense of loyalty and place, because mine is sort of fractured.\"\n\n\n\nJohn Safran is the author of Squat, about his experiences squatting at rapper Kanye's LA mansion. Source: SBS, Supplied\n\n'For lovers of American pulp fiction'\n\nMelbourne writer and filmmaker John Safran has made a career out of being the jokester observer, inserting himself into strange and testing situations. His fourth book Squat saw him move into one of rapper Kanye West's LA mansions . It was part of a madcap quest by Safran to understand his Jewish identity, after West made antisemitic remarks. His book choices reflect his love of adventure stories, his questioning nature and outsider status.\n\n\n\n\n\nThe Real Cool Killers (Chester Himes) is a gritty 50s crime thriller that follows a pair of black detectives who patrol the streets of Harlem. Safran says these types of detective books were historically dismissed as low-brow literature but are appealing to readers who like adventure stories. \"If you love Breaking Bad and Better Call Saul, this [is a great hit] of American pulp [fiction].\" Safran also rates books by Jim Thompson and uses these detective novels to get into the right state of mind before writing his own non-fiction, \"if I'm about to go on an adventure with extremists or whatever\".\n\n\n\n\n\nWeasels in the Attic (Hiroko Oyamada) is a novel set in contemporary Japan that follows a couple struggling to conceive while observing those around them starting families. The book is quite short and is a surreal tale that explores the societal pressures around parenthood. \"There's literally a weasel in the attic and what does this mean? Is the guy imagining it?\" Safran says. \"I think it's a bit about the anxiety of being trapped in a relationship.\"\n\n\n\n\n\nWake in Fright (Kenneth Cook) — which inspired the classic 1971 film — captures the dark side of Australian drinking culture and what it feels like when you don't join in. As a young man, Safran says he didn't drink much and the book explores that experience well. \"It's like you don't grow up eating horse ... [but] everyone's eating horse and you've gotta do this.\" The outback horror story captures how drunken crowds can be overbearingly friendly and strangely menacing. Safran says events in the book often turn ugly when the protagonist just doesn't want to drink.\n\n\n\nKeshe Chow is the author of Chinese fantasy novel For No Mortal Creature. Source: SBS, Supplied\n\n'Compulsively readable romance'\n\nMelbourne author Keshe Chow is a Sunday Times bestselling author of fantasy — specifically Chinese fantasy — romance and speculative fiction. Her latest novel For No Mortal Creature is a gothic fantasy inspired by Wuthering Heights. Chow says she wanted to capture a summery vibe in her recommendations that people could enjoy while sipping cocktails on a beach. She has suggested two romance novels and one young adult novel that grapples with academic pressure and self-acceptance.\n\n\n\n\n\nLove Is A War Song (Danica Nava) is a \"compulsively readable\" romance that follows a Native American pop singer who gets cancelled after doing a photo shoot wearing a traditional headdress. She retreats to her grandmother's horse ranch to escape the online vitriol. For the first time, she experiences a more traditional life and grapples with questions about whether she's Indigenous enough and if she can really be part of a community she's had little connection with.\n\n\n\n\n\nI Am Not Jessica Chen (Ann Liang) is a beautiful journey of self-realisation and a young adult novel Chow recommends to everyone. It follows the experiences of Jenna after she fails to get into an Ivy League university. One morning she wakes up in her cousin's body — someone who is popular, pretty and has secured a place at Harvard. Over time, she realises that her cousin's life is not as perfect as it seemed. \"Even though [Liang's] whole cast is Asian, it's still got that element of 'I'm not good enough, I'm not pretty enough, I'm not smart enough' … and I think that is something that is just a universal experience of teens and even adults.\" The book also explores the heavy academic pressure that many young people feel.\n\n\n\n\n\nNot Safe For Work (Nisha J. Tuli) is written from the perspective of a woman of colour who's sent on a corporate development trip specifically because of her diverse heritage. She's accompanied by a white 'nepo baby' colleague, and initially there are many misunderstandings between them. But each learn about the different pressures they're grappling with and end up falling in love. Chow says the book is really fun and sexy. \"They go to Hawaii, there's lots of plot and it's really steamy.\" At the same time, it explores issues of feminism and racism.\n\n\n\nJade Goodwin is co-author of the Yarn Quest series. Source: SBS, Supplied\n\n'Magical, emotional worlds'\n\nFirst Nations illustrator Jade Goodwin has contributed to many children's books, including Ash Barty's Little Ash series and the Yarn Quest series, which she co-wrote. She says she is always drawn to books that celebrate culture and has selected a picture book, a young adult fantasy novel, and romance novel. \"Reading is my favourite escape and each of these books opened a door into a world I loved stepping into.\"\n\n\n\n\n\nMoonlight and Dust (Jasmin McGaughey) is a beautifully crafted young adult novel that follows 16-year-old Torres Strait Islander Zillah into a world of exclusive parties after her sister is injured in a mysterious accident. It weaves Torres Strait Islander culture into a magical, emotional world. \"I love its sense of wonder and its strong, heartfelt voice.\"\n\n\n\n\n\nGoodwin is also recommending Love Unleashed (Melanie Saward), which she describes as a \"warm, deeply grounded romance that celebrates Aboriginal culture, love and community\". She says it feels joyful, modern and full of heart.\n\n\n\n\n\nNayNay and the Mermaid (Tasma Walton) is a vibrant, imaginative picture book bursting with colour and magic. It follows a young girl as she embarks on an underwater adventure, and draws on the stories of the Boonwurrung people of coastal Melbourne. \"The storytelling and illustrations work together so beautifully, it's absolutely stunning.\"\n\n\n\nNatalia Figueroa Barroso is the author of Hailstones Fell Without Rain. Source: SBS, Supplied\n\n'A call to action'\n\nHailstones Fell Without Rain by Natalia Figueroa Barroso has been praised as a sharply funny debut novel that follows a young family in western Sydney. The Uruguayan Australian writer says she's chosen three memoirs that she hopes will be a call to action. They all deal with violence in different ways, whether that's through colonisation, genocide or sexual assault. \"We always end up not believing the victim, which is absurd.\"\n\n\n\n\n\nWe Will Be Jaguars: A Memoir of My People (Nemonte Nenquimo with Mitch Anderson) tells the story of the author's childhood in the Amazon rainforest in Ecuador. Figueroa Barroso says the book pulses with ancestral knowledge, like the healing properties of medicinal plants and the wisdom carried in moon cycles. Figueroa Barroso says Nenquimo carries the voice of her people and their fight to save the Amazon, their land, their language and life itself.\n\n\n\n\n\nDiary of a Young Doctor: Notes from the Genocide in Gaza (Ezzideen Shehab) is written by a doctor, but Figueroa Barroso says Shehab is also an incredibly talented writer who brings the horror of the Palestinian experience to life through intimate, unforgettable stories of the people he meets. She says it demands the world bear witness, but also reminds people that acts of care and hope persist.\n\n\n\n\n\nFigueroa Barroso's third choice Ring of Salt: Finding Home and Hope on the Wild Coast of Ireland (Betsy Cornwell) tells the story of a wealthy white woman from the United States who migrates to Ireland to put a sea between herself and a father who sexually abused her. \"When she sets foot in Ireland she becomes a migrant, she becomes working class ... so she starts experiencing what people of colour experience.\"\n\n\n\nSisonke Msimang is author of the 2017 memoir Always Another Country. Source: SBS, Supplied\n\n'A beautiful portrait of what money does'\n\nSisonke Msimang wrote about her journey from Africa to America, and her new home in Australia in her thoughtful 2017 memoir Always Another Country. She has chosen two non-fiction books and one \"really fun\" fiction option that all make for a great beach read. \"But of course it's me, so it's very much interested in race and conversations about place, belonging, identity and all those kinds of issues.\"\n\n\n\n\n\nBlack Convicts: How Slavery Shaped Australia (Santilla Chingaipe) was shortlisted for the 2025 Queensland Literary Awards and the Stella Prize. It looks at the contribution of African convicts who came to Australia on the First Fleet, including skills they had learned as slaves, such as sugar cane farming, which were passed on to white settlers. \"There's all these interesting facts about Australian history and how it is imbued with the histories and traces of African people but we just don't know it.\" Msimang says it's a book she keeps coming back to whenever she speaks with people about \"what Australia's history is and what this place means\".\n\n\n\n\n\nWhile many Australians have seen vision of the Gaza conflict unfold on TV and social media, Msimang says there's something powerful about reading about and visualising it for yourself. The Eyes of Gaza: A Diary of Resilience (Plestia Alaqad) is a collection of diary entries that detail Alaqad's experiences as the war begins. \"I do think there's something about the power of the written word ... you get to picture it yourself, and not through nameless, faceless [people] and rubble. It's one person, her story, and it's very intimate.\"\n\n\n\n\n\nEntitlement (Rumaan Alam) follows a beautiful young African-American woman who develops an intense relationship with a billionaire while working at a large philanthropic foundation. He begins taking her advice on investments and other matters. \"The power starts to get to her head ... so it's the story about how seductive it can be to be around people with a lot of money.\" The billionaire is an older white guy whose cultural capital is fading, but still has power. \"Race is all over it but in a very non-preachy, very funny, now-generation kind of way. It's just a beautiful portrait of what money does, in a time of Jeff Bezos and Elon Musk.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-birdwatching-is-keeping-young-australians-off-their-phones/5uzsqhxwr",
    "title": "'It started out as a joke': Why this NRL star is looking at the skies",
    "publish_date": "Sun, 21 Dec 2025 18:37:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "Meeting a three-time premiership-winning rugby league player to look at birds on the outskirts of Sydney wasn't exactly on my 2025 bucket list.\n\n\n\n\n\nYet, here I am, binoculars in hand, following 27-year-old Penrith Panthers hooker Mitch Kenny into Emu Heights, a leafy suburban haven in western Sydney.\n\n\n\n\n\n\"I like getting outside anyway and going on walks,\" he says. \"It's probably just an addition to that.\"\n\n\n\n\n\nAs we stroll down the tree-lined track — a hotspot, Kenny explains, for birders (bird watchers) eager to spot diverse habitats in a short walk — he stops frequently to point out our feathery companions.\n\n\n\n\n\n\"There's a little fairy wren bouncing around with one of his missus … they're so cute,\" he says.\n\n\n\nMitch Kenny bought his first pair of binoculars this year after birdwatching with his brother. Source: SBS News / Rania Yallop The hobby was \"stolen\" from his environmentalist sibling, who first introduced Kenny to the wilds of the Blue Mountains — tracking lizards and snakes, and eventually birds.\n\n\n\n\n\n\"It started out as a joke … but you can't joke [about] birdwatching. You're either going out looking for birds, or you're not,\" he says.\n\n\n\n\n\nIt was in the mountains that Kenny saw a peregrine falcon, his 'spark bird' — a birder's term for the first species that ignites a lifelong obsession.\n\n\n\n\n\n\"That was my first bird that I was really going out and looking for,\" Kenny says. \"That was like my first time feeling the rush of getting a good get.\"\n\n\n\n'A birdwatching boom'\n\nBirdwatching has long had a quietly devoted following in Australia.\n\n\n\n\n\nFor the inner west–based Sydney Bird Club, that interest became hard to ignore in February 2020, when the group recorded one of its largest turnouts in its five-year history.\n\n\n\n\n\nCo-founder Stephanie Chambers remembers the moment clearly. \"It felt to us like we were on the cusp of a birdwatching boom.\"\n\n\n\nSydney Bird Club's Stephanie Chambers says they have seen a boom in participants since the COVID-19 pandemic. Source: SBS News / Rania Yallop Initially set up as a \"club for everyone\" to break down barriers in birdwatching, the group has since welcomed an influx of younger members.\n\n\n\n\n\n\"There was a curiosity among people … and I think during the pandemic, it turned into a hardcore passion for a lot of people,\" they say.\n\n\n\n\n\nEnvironmentalist and host of the Death by Birding podcast, César Puechmarin, says birds were \"thrown into [people's] orbit\" during Australia's COVID-19 lockdowns , as many started noticing birds in their local environments while confined at home.\n\n\n\n\n\n\"You have a generation of people who grew up playing video games or playing games like Pokémon, and this hobby of bird watching fits perfectly,\" he tells SBS News.\n\n\n\n\n\n\"It's a never-ending hobby. You can't finish it. You can't complete it … There will always be more birds.\"\n\n\n\nEnvironmentalist and podcaster César Puechmarin says many people started noticing birds when they were confined in their homes during the COVID-19 lockdowns. Source: SBS News / Rania Yallop Chambers says birdwatching is also a \"form of resistance against technology and social media\" that allows participants to tap into a world untouched by screens.\n\n\n\n\n\n\"You're not only just watching birds, you're watching seasonal changes, you're observing migrations. And so I think it tunes you into something that you would be without if you didn't. So I think it strikes at the core of who we are as humans,\" they say.\n\n\n\n'Resistance against technology' grows online\n\nThe hobby, offering a screen-free escape, has found a new life online, where enthusiasts can share sightings, swap tips, and connect in ways the outdoors alone cannot.\n\n\n\n\n\n\"We were certainly worried in the digital age that people were just on their screens and not out in nature,\" says senior public relations manager at BirdLife Australia, Sean Dooley, who previously held the Australian record for the most birds seen in one year.\n\n\n\n\n\n\"[But] the naturegram has really taken over, because birds are so beautiful to look at … and that it has attracted a whole tribe of digital natives to it.\"\n\n\n\n\n\nAustralian creator Birding with Cob, who has gained over 190,000 followers on Instagram posting Pokémon-style bird videos, wants people to \"see every bird in the world\".\n\n\n\n\"I think that sometimes young men can be particularly loud in those environments,\" says Puechmarin, who has seen young birders of all genders accessing information and finding \"like-minded people\" online.\n\n\n\nFinding community\n\nThat online community has moved back into the real world for Kenny, who has been out on a number of \"bird dates\" since he started posting about birds online.\n\n\n\n\n\n\"You meet someone, you talk a bit of s--t, go for a walk and hopefully see a few birds. It's pretty fun,\" he says.\n\n\n\n\n\n\"I'm pretty keen to go out with someone who knows what they're looking for. And some people are pretty keen to meet a footy player. So everyone wins.\"\n\n\n\nDooley says this kind of knowledge transfer is important for newer birders who may not understand the etiquette and ethics of the hobby.\n\n\n\n\n\n\"I think when the community find each other, they do start to share of that type of advice. Like: 'Hey, dude, you shouldn't really be going up to that nest, you know, because that, that eagle will abandon the chicks if, if you come too close',\" he says.\n\n\n\nFrom birdwatching to environmental action\n\nKenny says he was always environmentally conscious, but taking up birding has made him appreciate the world around him in a different way.\n\n\n\n\n\n\"Once you get keen on birds, then you start learn which birds are under pressure and the role that you can play in that, and that's when I think you start to make changes in your own life and the way in that you interact with the world,\" he says.\n\n\n\n\n\nDooley says once people get to know what they're seeing, it's like \"giving a name to a character in the soap opera that you're watching\".\n\n\n\n\n\n\"You start to realise over time that these things that bring you such joy are in trouble.\n\n\n\n\n\n\"People are going to have to do something about it to save the things that bring them joy.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/over-half-a-million-people-displaced-in-cambodia-following-clashes-with-thailand/7wpxazg9j",
    "title": "Over half a million people displaced in Cambodia following clashes with Thailand",
    "publish_date": "Sun, 21 Dec 2025 08:39:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/pm-condemns-anti-immigration-rallies-in-sydney-and-melbourne/edg9si1p4",
    "title": "PM condemns anti-immigration rallies in Sydney and Melbourne",
    "publish_date": "Sun, 21 Dec 2025 08:39:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/rednote-welcomed-people-fleeing-tiktok-is-a-wave-of-under-16-refugees-possible/j4ca99snb",
    "title": "'Under-16 refugees': Will this platform see another new wave of users after the social media ban?",
    "publish_date": "Sun, 21 Dec 2025 04:44:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "In January this year, an unprecedented wave of 'TikTok refugees' migrated to the Chinese social media platform RedNote (Xiaohongshu in Mandarin), ahead of a potential United States ban on TikTok.\n\n\n\n\n\nLess than a year later, a similar label has emerged: 'under-16 refugees'.\n\n\n\n\n\nThe term surfaced after Australia's social media ban officially took effect on 10 December, making Australia the first country to prohibit children under the age of 16 from using certain social media platforms.\n\n\n\n\n\nThe ban applies to 10 platforms: Facebook, Instagram, Kick, Reddit, Snapchat, Threads, TikTok, Twitch, X and YouTube.\n\n\n\n\n\nPlatforms like RedNote and Douyin — the Chinese version of TikTok — are not included on the list.\n\n\n\n\n\nOther predominantly non-English platforms are not yet included in the ban, such as KakaoTalk, widely used among Korean communities, and Line, a popular messaging app in Japan and Taiwan.\n\n\n\nA post on RedNote calls for under-16 \"refugees\" to gather on the platform. Source: SBS News On RedNote, a user identifying themselves as an 'ABC' (Australian-born Chinese) posted a message reading \"under 16 Australian refugees incoming\", attracting hundreds of interactions within hours.\n\n\n\n\n\n\"Please don't post your photos. I don't want this app banned in Australia,\" one commenter wrote.\n\n\n\n\n\n\"They wouldn't have any reason to ban it,\" the original poster replied.\n\n\n\n'The government hasn't really stepped in'\n\nFifteen-year-old Sophie Shan studies at Mercedes College in Adelaide. Since Australia's social media ban came into effect, she has been unable to access Snapchat, Facebook or Instagram — but her RedNote account remains unaffected.\n\n\n\n\n\nShan was born in China and migrated to Australia with her parents at the age of eight.\n\n\n\n\n\n\"I use RedNote a lot to look things up. I also have the Chinese version of TikTok, Douyin, and I use that as well,\" she said.\n\n\n\n\n\n\"I think because it's mainly used by Chinese people, the government hasn't really stepped in to regulate it yet.\"\n\n\n\nFifteen-year-old Sophie Shan said that, despite Australia's under-16 social media ban, she can still access RedNote and Douyin. Source: Supplied Wenjia Tang, a postdoctoral researcher in digital culture at the University of Sydney, said the government's social media ban places bilingual teens and monolingual English-speaking users into different digital realms.\n\n\n\n\n\n\"The aim is not to understand how all cultural groups use social media. Instead, the focus [of the ban] is largely on the dominant group — English-speaking users — and how they are affected by social media,\" she said.\n\n\n\n\n\n\"That doesn't mean Chinese-language platforms are unimportant, nor does it mean the regulatory framework is inherently unequal. But for now, platforms used by minority communities or in other languages have not been included in the regulatory framework.\"\n\n\n\nCompared to TikTok's 10 million Australian users and Instagram's 19 million, as reported in government eSafety data, RedNote's market share remains relatively small.\n\n\n\n\n\nIn late 2024, The Conversation reported the platform had 218 million monthly active users globally, including around 700,000 in Australia.\n\n\n\n\n\nHowever, RedNote's profile in Australia is undeniably growing.\n\n\n\n\n\nIn the lead-up to this year's federal election, SBS Chinese reported on the growing number of political candidates turning to platforms like WeChat and RedNote to reach out to voters.\n\n\n\nWenjia Tang, a postdoctoral researcher in digital culture at the University of Sydney, believes young Australians may turn to RedNote when other social media apps are inaccessible. Source: Supplied Tang said RedNote could become an alternative option for under-16s who are unable to access the social media platforms they are familiar with.\n\n\n\n\n\n\"The 'TikTok refugee' phenomenon already demonstrated that users are willing to migrate,\" she said.\n\n\n\n\n\n\"While that migration was short-lived, it doesn't mean RedNote couldn't once again become the next destination — or a substitute — if other platforms are shut down.\"\n\n\n\n\n\nShe said RedNote's design is similar to Instagram and TikTok, with a strong focus on images and short-form video, so new users don't need to learn the platform from scratch.\n\n\n\n\n\n\"I think its youthful appeal, localisation and real-time content updates align well with the profiles and usage habits of teenage users,\" Tang said.\n\n\n\nBilingual teens more likely to migrate\n\nTang acknowledged that turning to RedNote would not be the first choice for most Australian teenagers, and even if some did make the switch, a large-scale migration was unlikely.\n\n\n\n\n\n\"Based on what we are currently observing, if young people still want to use social media, their first instinct is not to look for a new platform, but to find ways to circumvent the legal restrictions,\" she said.\n\n\n\n\n\nHowever, those who already have an interest in the platform or come from Chinese-language backgrounds are more likely to turn to RedNote or spend more time using it when previously available options are unavailable, Tang said.\n\n\n\nFourteen-year-old Ethan Guo, who lives in Brisbane, said Instagram and Discord were the social media platforms he used the most before the ban came into effect. Discord was not included in the ban.\n\n\n\n\n\nWhen asked whether he would consider switching to RedNote or other Chinese-language platforms that remain accessible, Guo answered without hesitation: \"No.\"\n\n\n\n\n\n\"I can't read Chinese and my Chinese is pretty bad. And I don't really use any of the Chinese social media,\" he said.\n\n\n\n\n\n\"I think the other large reason is the fact that almost none of my friends are on it. And trying to get them on it with me would be a pain. So I really just cannot be bothered.\"\n\n\n\nFourteen-year-old Ethan Guo said switching to apps like RedNote is unappealing due to language barriers. Source: Supplied Tang said the \"social\" aspect of social media is crucial — platforms feel safer and more welcoming when users are surrounded by familiar people.\n\n\n\n\n\n\"Young users don't see RedNote as their new TikTok or their new Instagram,\" she said. \"Because that would require a large-scale community migration, not just moving platforms, but also moving their social connections. Only then would it feel like the same kind of platform.\"\n\n\n\n\n\nShe said the absence of regulation does not guarantee long-term safety or stability.\n\n\n\n\n\n\"It shouldn't be assumed that just because RedNote is not currently regulated, it will always be a safe or transferable space. If a large-scale migration were to occur, it could become the next target of policy intervention,\" she said.\n\n\n\nPlatforms adapt to shifting user demographics\n\nIn response to language barriers faced by non-Chinese speakers like Guo, RedNote has also started adapting.\n\n\n\n\n\nFollowing the 'TikTok refugee' influx earlier this year, the platform rolled out significant system upgrades to attract overseas users.\n\n\n\n\n\nIt now offers real-time translation and allows users to set the interface language to English, Japanese, Korean, French and other languages.\n\n\n\n\n\nThe changes appear to have had some early impact, helping retain overseas users who initially downloaded the app out of curiosity.\n\n\n\n\n\nUnder a RedNote post reading \"Miss the time when TikTok refugees were here\", numerous US users replied: \"I'm still here.\"\n\n\n\n\n\n\"I'm just not a refugee anymore. I'm a permanent resident,\" one comment read.\n\n\n\n\n\nThis story was produced in collaboration with SBS Mandarin .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/uk-man-cycle-from-england-to-australia-for-father-legacy/whq9oboc5",
    "title": "Jamie followed his dad's 14,000km England-to-Australia bike ride — here's how it went",
    "publish_date": "Sun, 21 Dec 2025 00:38:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "Growing up in Manchester, United Kingdom, Jamie Hargreaves and his brother were captivated by stories of their father, Phil, who cycled more than 14,000 kilometres from England to Australia in 1984.\n\n\n\n\n\n\"He had the most amazing experiences on his journey, and he raised me and my brother on those stories and how we should have similar experiences,\" Hargreaves told SBS News.\n\n\n\n\n\nSo when Hargreaves turned 22 — the same age his father started the journey — he decided to follow in his footsteps, revisiting some of the places his dad had passed through.\n\n\n\n\n\nHe set off from Derby in England in May 2024, pedalling through Europe to Russia, before heading to Pakistan and Indonesia.\n\n\n\n\n\nAfter flying to Brisbane, he resumed his ride, ultimately completing the journey at a pub in The Rocks, Sydney, where he was greeted by a crowd of followers from his Instagram account, where he had been documenting the adventure.\n\n\n\n\"I actually can't believe it, it's been a mad old journey!\" Hargreaves wrote on his Instagram on Monday, with Sydney Opera House in the background.\n\n\n\n\n\n\"This trip has changed me [in] so many different ways.\"\n\n\n\nA 40-year father-son legacy\n\nRecalling the day when he told his dad about the cycling trip, Hargreaves said Phil wasn't surprised about his decision.\n\n\n\n\n\n\"I think he always sort of knew [about the trip], because I've always said since I was young that I was gonna cycle across the world as well,\" the younger Hargreaves said.\n\n\n\n\n\nHe described being raised in a \"pretty active\" family, and before the cycling journey, he was an active climber who frequently hiked with friends in Germany.\n\n\n\n\n\nThroughout the trip, Hargreaves tried to recreate photos Phil had taken 40 years earlier.\n\n\n\nJamie Hargreaves often recreates photos from his father's cycling trips taken 40 years ago. Source: Supplied / Jamie Hargreaves Hargreaves also rode a 45-year-old steel-framed bike that was the same model that his dad used back in the day.\n\n\n\n\n\nHe said that, ahead of his journey, Phil advised him to take every opportunity to hang out with locals when visiting other countries.\n\n\n\n\n\n\"If somebody invites you to stay and you've got like 20km left to cycle, it's going to be a nicer experience to stay with a local and sort of learn about their culture and their family and stuff,\" Hargreaves said, referencing his father's words.\n\n\n\nHospitality 'remained the same'\n\nOver the past year, the father-son duo often spoke on the phone as Hargreaves followed parts of his father's route, comparing what they had each seen along the way.\n\n\n\n\n\nBut Hargreaves couldn't fully replicate his father's journey, as some countries had become difficult to access.\n\n\n\n\n\n\"Iran, we couldn't get through, whereas my dad could go through,\" he said.\n\n\n\n\n\nAfter arriving in Türkiye, he adjusted his route, travelling to Russia via Georgia, then visiting Kazakhstan, Uzbekistan, and Afghanistan, before rejoining his father's path in Pakistan.\n\n\n\n\n\n\"So there are numerous countries which are harder to get into now, and some which are easier to get into, with the politics of it all, but that's changed dramatically,\" he said.\n\n\n\n\n\nHargreaves said compared to other countries, Australia had more rules on cycling, \"and you just sort of have to adapt with it\".\n\n\n\nThroughout the journey, Jamie Hargreaves (left) said he met many \"kind strangers\". Source: Supplied / Jamie Hargreaves Despite the changes and differences, Hargreaves said the kindness of strangers has \"remained the same\".\n\n\n\n\n\nHe encouraged people to travel and see the world through their eyes.\n\n\n\n\n\n\"When you actually get out there and go to these places that you're warned about, they're the most friendly places on Earth.\n\n\n\n\n\n\"And in actual fact, the world is a much kinder place than it seems to be.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-can-early-education-make-your-children-happy-adults/mmfxffw5a",
    "title": "INTERVIEW: Can early education make your children happy adults?",
    "publish_date": "Sat, 20 Dec 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/what-is-denmarks-not-so-secret-recipe-for-happiness/vpa6gxmjy",
    "title": "What is Denmark's not-so-secret recipe for happiness?",
    "publish_date": "Sat, 20 Dec 2025 20:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe festive season is known as a time to spread kindness and goodwill but in Denmark, learning and practising traits like compassion and empathy is a year-round craft.\n\n\n\n\n\nSince 1993, all Danish students aged six to 16 experience social-emotional learning through the school curriculum.\n\n\n\n\n\nJessica Joelle Alexander is a parenting expert and cultural researcher, with a specific expertise in the Danish parenting approach.\n\n\n\n\n\n“Danes believe that if you don't feel well, you don't learn well. And so they find it's really important that we dedicate time to make sure that the class as a unit is feeling good. And there's also a big belief that our wellbeing is very tied to our sense of belonging and how we get along with others.”\n\n\n\n\n\nThese classes are seen as important developmental building blocks - teaching children skills like emotional intelligence, building resilience, cooperation and active listening.\n\n\n\n\n\n“I think the biggest mind shift I've had is how much kids also need help with their relationships and when they get that help when they're younger, so they don't get into as much bullying, they don't get into as much girl drama - when they go into the work life, there's also more empathy for Moms, and there's more empathy for other situations that if we don't learn that early on, then we kind of grow up to be big kids.”\n\n\n\n\n\nDanish early childhood teacher, Nana Hammer, has grown up with this system.\n\n\n\n\n\n“We sat for maybe one and a half hours and discussed what was happening in the classroom, what were the dynamics, how did something made you feel? Was there anything you were struggling with? Do you find that there's any bullying?And it was actually a beautiful opportunity to touch base with your peers and again, be reminded that you're not the only one struggling with this. There are other people we might help each other.”\n\n\n\n\n\nNow teaching at a kindergarten in Sydney, she is passionate about passing these skills on.\n\n\n\n\n\n“I think something that's just really beneficial when you want to promote empathy within children is to look at it with a way bigger lens kind of, and really expand the term empathy. So being empathetic could be being polite. It could also be being aware of your surroundings.”\n\n\n\n\n\nSome researchers have linked this Danish method of learning empathy to higher levels of emotional resilience, social connectedness and even improved academic results.\n\n\n\n\n\nAccording to the World Happiness Report, Nordic countries once again lead the happiness rankings with Finland, Denmark, Iceland and Sweden sitting in the top four spots.\n\n\n\n\n\nAustralia is placed in 11th place, the United States in 24th, with social isolation one reason cited for declining wellbeing.\n\n\n\n\n\nThis is Jessica Joelle Alexander, again.\n\n\n\n\n\n“The Danish way is very much focused on a sense of happiness that comes from within. And that basically means that you feel good with who you are no matter what your accolades are.”\n\n\n\n\n\nIn Australia, ethics classes are run in hundreds of schools and are facilitated impartially by trained volunteers.\n\n\n\n\n\nFeyza Tuncay is a volunteer teacher with Primary Ethics, an ethics education provider.\n\n\n\n\n\n“They build skills in critical thinking, collaborative thinking, because they think for themselves, but they do it with other students, with their peers. They take away the notion that there are diverse opinions, there are diverse backgrounds. They learn how to have this respectful discussions or disagree respectfully.”\n\n\n\n\n\nUsing age-appropriate scenarios, students are encouraged to discuss their responses.\n\n\n\n\n\n“There are topics like empathy, fairness, we talk about is lying ever okay. We talk about boasting, bragging or sharing. With older ages we talk about jumping to conclusions, voting we talk about AI interacting with AI. So there is a wide range of topics.”\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/green-bean-and-chickpea-salad-with-crispy-halloumi-and-tajin-dressing-20251222-p5nphn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Green bean and chickpea salad with crispy halloumi and Tajin dressing",
    "publish_date": "Mon, 22 Dec 2025 13:13:20 +1100",
    "category": "lifestyle",
    "authors": [
      "Jessica Brook"
    ],
    "text": "Step 1 Blanch the beans in salted boiling water for 3 minutes, or until they are just tender. Drain and refresh in cold water. Place the beans in a large bowl with chickpeas, cucumber and tomato, and gently toss.\n\nStep 2 Cut the halloumi into 5mm-thick slices. Heat 1½ tablespoons of olive oil in a large non-stick frying pan over medium heat. Fry the halloumi in a single layer for 2-3 minutes, turning once, until both sides are golden and crisp. Drain on a paper towel and set aside.\n\nStep 3 To make the dressing, combine the Tajin spice, pistachios, vinegar, honey and the remaining 1½ tablespoons of oil in a lidded jar and shake to combine.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/goodfood/vic-good-food-guide/flinders-general-store-20251222-p5npii.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Flinders General Store",
    "publish_date": "Mon, 22 Dec 2025 13:07:15 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nEncompassing a boutique grocer, wine store, cafe and an everyday supermarket, this is an essential stop for both residents and visitors to the Mornington Peninsula. Find ready-to-heat pies and lasagnes from Johnny Ripe, perfect for an easy holiday house dinner; pantry fillers (and great gifts) from local businesses such as Red Gum BBQ; fresh seafood, cheese, charcuterie, Tuerong Farm bread baked nearby, and essentials such as milk, eggs, butter, fruit and vegetables.\n\nHot food to-go includes pies, potato cakes and toasties, plus there are muffins baked in-house, which can be enjoyed in the cafe at one of a handful of tables. Coffee is by Blume, which roasts in Melbourne. Occasionally, the shop hosts wine tastings by local producers, too.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/seven-west-shareholders-overwhelmingly-back-southern-cross-takeover-20251222-p5npi7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Seven West shareholders overwhelmingly back Southern Cross takeover",
    "publish_date": "Mon, 22 Dec 2025 13:01:59 +1100",
    "category": "finance",
    "authors": [
      "Michael Philipps"
    ],
    "text": "Seven West Media shareholders have thrown their support behind the acquisition of the company by Southern Cross Media, backing the merger at a meeting on Monday.\n\nA total of 99.36 per cent of the votes cast by Seven West shareholders favoured the acquisition by way of a scheme of arrangement.\n\nSeven West Media chairman Kerry Stokes. Credit: Trevor Collens\n\nUnder the proposal, Seven West shareholders will receive 0.1552 Southern Cross shares for every SWM share they own. Prior to the vote, SWM directors unanimously recommended shareholders approve the merger.\n\nIf the scheme is implemented, existing Seven West shareholders will hold 49.9 per cent of the combined group and Southern Cross shareholders will own the remaining 50.1 per cent.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/goodfood/vic-good-food-guide/shoreham-general-store-20251222-p5npi8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Shoreham General Store",
    "publish_date": "Mon, 22 Dec 2025 12:59:10 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nThis general store - one of many across the peninsula - is where you’ll go to buy cereal and dishwashing liquid, but you can also pick up Mumma Made relishes crafted in nearby Dromana, and a great flat white. The weatherboard building has a verandah with outdoor seating and a cute sign out front that advertises “dog parking”. Inside, half the space is used as a cafe serving basics like bacon and egg rolls, chicken nuggets, salad rolls and pies.\n\nThe retail area is a showcase of local products, from Moonah Dunes honey to handmade chopping boards and furikake, the Japanese seasoning, from Southern Seagreens. Kids will love the bags of gum balls, licorice allsorts, and rosey apples.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/queensland/weather-warnings-for-christmas-revellers-planning-to-heading-outside-20251222-p5npfx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Weather warnings for Christmas revellers planning to head outside",
    "publish_date": "Mon, 22 Dec 2025 12:55:26 +1100",
    "category": "finance",
    "authors": [
      "Catherine Strohfeldt"
    ],
    "text": "Brisbane will suffer a one-two punch of heatwave and thunderstorm conditions before Christmas Day, with pub-goers, travellers and those heading to the beach urged to take care.\n\nStagnant water off Australia’s east coast and a band of thunderstorms working its way up from the southern states have concentrated hot, humid air over south-east Queensland, weather bureau forecaster Jonathan Howe said.\n\nIn Brisbane, heatwave conditions were expected to last until Boxing Day, with overnight minimums in the mid-to-low 20s, despite afternoon storms.\n\nThunderstorms are expected in Brisbane across Tuesday and Wednesday, but will not quell the heat for long. Credit: William Davis\n\n“We will see some afternoon thunderstorms from [Wednesday] – obviously, there will be some rainfall, but it will really only start clearing up from Boxing Day,” Howe said.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/goodfood/vic-good-food-guide/social-club-balnarring-20251222-p5npi5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Social Club Balnarring",
    "publish_date": "Mon, 22 Dec 2025 12:51:55 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nLocals flock here for craft beers and Pisco Sours under gum trees, but that’s not all. Latin American plates are supremely share-friendly whether anticuchos chicken skewers, chilli prawn tacos or smoked lamb ribs with lime-chilli glaze. A kids’ menu sticks with the theme. Beers on tap - mostly independent - include Social Club’s own brews, from pacific ale to mid-strength and a sparkling ale.\n\nThe venue even puts on the occasional live gig, with acts including Magic Dirt and Cosmic Psychos. Inside the vibe is cosy and old-school with fireplaces, seating nooks and tartan fabric. Outside, bars, fire pits and plenty of space to roam make it a hit with young and old.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/business/companies/red-metal-inks-jv-to-fast-track-copper-hunt-in-wa-20251222-p5nphw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Red Metal inks JV to fast-track copper hunt in WA",
    "publish_date": "Mon, 22 Dec 2025 12:45:00 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Red Metal Limited has strengthened its position in Western Australia’s emerging Madura copper province after striking a joint venture (JV) deal designed to fast-track drilling at its highly prospective Sharon Dam iron oxide copper-gold (IOCG) target.\n\nUnder the agreement, Artemis Resources can earn up to a 60 per cent interest in Red Metal’s Sharon Dam project by spending more than $5 million over three years, providing Red Metal with a clear pathway to advance the asset while limiting shareholder dilution.\n\nLocation of the Sharon Dam project- subject of the new Red Metal JV with Artemis.\n\nThe JV kicks off with an initial $400,000 drilling program, which will be jointly supported by a $220,000 grant from the Western Australian Government’s Exploration Incentive Scheme (EIS). The funding support materially lowers Red Metal’s upfront exploration costs and de-risks the first drill test of what the company believes is a standout IOCG target.\n\nImportantly, Artemis has the option to continue earning its interest by meeting the agreed expenditure milestones or withdraw from the agreement at any stage, leaving Red Metal with flexibility and retained exposure to exploration success.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/i-haven-t-seen-penny-wong-shed-a-single-tear-ley-slams-wong-20251222-p5nphz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'I haven’t seen Penny Wong shed a single tear’: Ley slams Wong",
    "publish_date": "Mon, 22 Dec 2025 12:36:24 +1100",
    "category": "finance",
    "authors": [],
    "text": "'I haven’t seen Penny Wong shed a single tear’: Ley slams Wong\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/business/companies/beetaloo-nt-flow-rates-deliver-basin-leading-gas-performance-20251222-p5nphg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Beetaloo NT flow rates deliver basin-leading gas performance",
    "publish_date": "Mon, 22 Dec 2025 12:07:13 +1100",
    "category": "finance",
    "authors": [
      "James Pearson"
    ],
    "text": "Beetaloo Energy has delivered another confidence-boosting result from its flagship Beetaloo Basin gas play, with its Carpentaria-5H well clocking up one of the strongest flow performances ever seen in the basin.\n\nWhile still in a 30-day clean-up period, the well has already posted standout gas rates, reinforcing the company’s strategy of prioritising long-term productivity as it prepares for pilot gas sales in 2026.\n\nBeetaloo Energy preparing for flow testing at the company’s Carpentaria 5-H gas well in the Northern Territory.\n\nCarpentaria-5H reached a peak gas rate of 11.2 terajoules (TJ) per day and averaged a basin-leading 7.1 TJ/day across the test period. The well finished the test flowing at 6.3 TJ/day, a result that management says highlights an impressively low decline rate at this early stage.\n\nNotably, the numbers were achieved while the well was still dewatering, with only about 23 per cent of the fracture stimulation fluid recovered so far, suggesting the best is still yet to come. Both Carpentaria-2H and Carpentaria-3H, two of Beetaloo’s previous wells, recorded material uplifts in gas flows once clean-up was complete, with post-clean-up flow rates jumping by up to 30 per cent.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/basketball/point-to-prove-as-wildcat-doolittle-torches-jackjumpers-20251222-p5npha.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Point to prove’ as Wildcat Doolittle torches JackJumpers",
    "publish_date": "Mon, 22 Dec 2025 12:00:44 +1100",
    "category": "sports",
    "authors": [],
    "text": "A fired-up Kristian Doolittle has burst back to life as Perth overpowered Tasmania on the road to stay in touch with the NBL’s top four.\n\nKristian Doolittle celebrates victory over the Jackjumpers in Hobart. Credit: Getty Images\n\nThe Wildcats had lost three of their last four and the import had scored just five, eight and four points in his past three outings.\n\nBut “playing pissed off and with a point to prove”, Doolittle exploded with 30 points and six rebounds in Sunday’s 94-85 win over the JackJumpers.\n\nHe found his range from deep in the first half before a fierce dunk and a pair of free throws from successive plays late in the fourth quarter took the heat out of the host’s comeback.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/politics/federal/historic-policy-domestic-gas-reservation-scheme-declared-20251222-p5npfg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘A long time coming’: Labor launches landmark bid to slash energy bills, plug gas shortfalls",
    "publish_date": "Mon, 22 Dec 2025 12:00:37 +1100",
    "category": "finance",
    "authors": [
      "Mike Foley",
      "Nick Toscano"
    ],
    "text": "Gas exporters will be forced to hold back supply for customers in the eastern states as the Albanese government launches an urgent push to drive down domestic energy bills and prevent shortfalls.\n\nThe reservation policy, announced on Monday, is the first of its kind on the eastern seaboard, and will apply to the operators of three giant liquefied natural gas (LNG) export terminals in Queensland.\n\nMost of the gas produced on the east coast is converted into LNG and exported. The federal government is developing a scheme to force producers to reserve some for the domestic market. Credit: Bloomberg\n\nThe government said its scheme would apply to new export contracts and force companies to reserve between 15 per cent and 25 per cent of this production for the east coast market.\n\n“Australian gas for Australian users as the first priority,” Energy Minister Chris Bowen said.",
    "source": "TheAge",
    "cluster_id": 8
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/starc-fires-ashes-warning-as-broad-doubles-down-on-worst-australian-team-since-2010-11-claim-20251222-p5npea.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Starc fires Ashes warning as Broad doubles down on ‘worst Australian team since 2010-11’ claim",
    "publish_date": "Mon, 22 Dec 2025 12:00:00 +1100",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Mitchell Starc says Australia are intent on securing an Ashes whitewash, while former England quick Stuart Broad insists he does not regret his pre-series claim that this is the worst Australian side since 2010-11.\n\nAustralia’s cricketers celebrated long into the night in Adelaide on Sunday after sealing an unassailable 3-0 series lead ahead of the remaining Tests in Melbourne and Sydney.\n\nTravis Head posted on Instagram late on Sunday night a picture of him drinking alongside skipper Pat Cummins with the caption “Is it 2010 yet?” followed by three laughing emojis.\n\nThe post was a pointed reference to Broad’s pre-series comment that Australia were set to field their weakest Ashes team since England triumphed 3-1 in 2010-11.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://au.news.yahoo.com/afraid-labor-grilled-bondi-probe-224708615.html",
    "title": "‘Shameful’: MP unleashes over Bondi",
    "publish_date": "2025-12-22T01:57:38Z",
    "category": "finance",
    "authors": [],
    "text": "Jewish MP Julian Leeser has branded Anthony Albanese’s response to the Bondi terror attack as “shameful” as the Coalition outlines its plans for a royal commission.\n\nLabor has commissioned a review to assess whether Australia’s law enforcement and intelligence agencies are appropriately empowered instead of launching a federal royal commission to investigate the attack.\n\nThe government has consistently resisted calls for a Commonwealth investigation of that scale, citing the need for an urgent response to the crisis.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSpeaking to reporters at a Sydney press conference, Mr Leeser lashed the departmental review as emblematic of the Prime Minister’s failure to respond to the attack.\n\n“The Jewish community of this country cannot survive on the crumbs of this government and appalling Prime Minister, who is always late to the party and who wants the Jewish community to live in his in half measures,” Mr Leeser told reporters at a Sydney press conference.\n\nJulian Leeser has lambasted Labor’s approach to tackling anti-Semitism. Photo: Gaye Gerard /NewsWire\n\nThe Prime Minister’s decision to call a departmental review, instead of a royal commission, was the “most shameful act in the history of our nation, Mr Leeser said.\n\n“(Australia) stands humiliated by the failure of leadership of this man, by the failure of leadership, which has led to the extraordinary deaths in a terrorist act on the shores of Bondi in this great city of ours,” he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Leeser claimed Labor’s departmental review was “another attempt at deflecting and minimising” racial hatred towards Jewish people.\n\n“This departmental review can’t call witnesses, it can’t compel evidence in a public forum. It can’t allow the stories of the two years of anti-Semitic hate to be told and retold,” he said.\n\n“It cannot root out anti-Semitism where it’s wherever it’s to be found. It’s only a royal commission that can do this.”\n\n“We demand the Prime Minister bring the parliament back today to do what (NSW Premier) Chris Minns is doing, to listen to Sussan Ley, to extend the hand of bipartisanship.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“And for once in his life to take the real action that is needed to defeat the anti-Semitism that we are seeing and we have seen in this country for far too long.”\n\nCoalition outlines probe plan\n\nSpeaking at a press conference in Sydney, Sussan Ley announced the Coalition had put together a draft terms of reference for the federal probe.\n\n“The Prime Minister's refusal to call a Commonwealth royal commission and to offer an unqualified apology as Premier Minns has done is adding insult to the injury that the Jewish community is feeling and our nation is feeling,” she said.\n\nMs Ley claimed Mr Albanese had “failed to respond appropriately to this terrible attack” and proposed a “good faith offer” to work with Labor to establish a royal commission before Christmas.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe proposed investigation would include at least three commissioners, including someone of Jewish faith, another with intelligence agency experience, and either a current or former Supreme Court judge.\n\nSussan Ley has urged Labor to immediately recall parliament to pass urgent legislation following the Bondi massacre. Picture: NewsWire / Nikki Short\n\nThe Coalition intends for an interim recommendation to be handed down no later than June 23, 2026.\n\n“It would look at things such as online, the media, arts, cultural and education sectors that led to the Bondi attack,” shadow Attorney-General Andrew Wallace said.\n\n“It would look at the conduct of ministers departments across all levels of government with respect to responding to the rise of anti-Semitism and the Bondi terrorist attack.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“It would examine the roles of radical Islam, far left and far right, neo-Nazi extremism, as would it look at anti-Israel and anti-Zionist attitudes into elevating anti-Semitic environment in Australia.\n\n“The commission would examine whether the Commonwealth and state law enforcement and intelligence agencies co-operated sufficiently together.”\n\nLabor MPs break ranks, call for federal probe\n\nTwo Western Sydney Labor MPs have broken ranks to joins calls for a royal commission led by the Commonwealth into the Bondi massacre.\n\nMacarthur MP Mike Freelander told the Australian Financial Review those in his electorate wanted all levels of government to “work together try and get some answers about the event that happened at Bondi”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“That has changed us forever. We need to bury the dead, we then need to look at how to rationally approach all the issues, across all levels of government,” he said.\n\nMr Freelander believed there “certainly” needed to be an inquiry at the national level.\n\nMike Freelander said a federal probe was necessary to understand the circumstances of the Bondi attack. Picture: NewsWire / Martin Ollman\n\nEd Husic reiterated calls for a Commonwealth-led royal commission. Picture: NewsWire / Martin Ollman\n\nFormer Albanese cabinet minister Ed Husic agreed with Mr Freelander, telling the same masthead a federal inquiry was needed to understand “how this happened [and] what we can do to root out extremism whichever form it comes in”.\n\n“I’ve previously said I don’t care if it’s Islamist or far-right extremism, anything that presents a threat to Australians must be confronted,” the Chifley MP said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I’d be concerned that federal agencies might feel that they wouldn’t have the ability to participate fully in a state-based inquiry.\n\n“Let’s remove the uncertainty and have a proper and thorough look at this.”\n\n‘Afraid’: Wong grilled on Labor’s hesitations\n\nForeign Minister Penny Wong has denied Labor’s opposition to a royal commission is rooted in fears of what the investigation could uncover as pressure mounts to launch a federal probe into anti-Semitism.\n\nOn Sunday, Anthony Albanese announced the Department of Prime Minister and Cabinet would investigate Australia’s intelligence and law enforcement agencies.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Prime Minister has not pushed for a federal royal commission despite NSW Premier Chris Minns publicly backing a state investigation.\n\nSpeaking to the ABC, Senator Wong was asked whether the government was “afraid” of pursuing a federal investigation.\n\n“I think that’s imputing intentions which are not there,” she said.\n\n“I think the focus that we have at the moment is to make sure that our agencies have the powers to keep people safe. And that’s why the Prime Minister and the National Security Committee have focused on a review which ensures we get that information quickly, which is by April.”\n\nForeign Minister Penny Wong says the federal government will co-operate with the state royal commission. Picture: NewsWire / Martin Ollman\n\nShe confirmed the federal government would co-operate with the state probe but pivoted to the government’s planned review of counter-terrorism agencies.\n\n\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“We have to make sure that our national security arrangements are fit for purpose and are able to keep people safe. And we need to learn from any mistakes, if there were any, made in the context of these attacks in a context where we see ISIS and extremist ideology in our country,” she said.\n\n“Now, this is the same organisation that the United States has just engaged in bombing raids on.\n\n“We all saw ISIS’s perverse ideology and violent acts in the early part of the last decade. They’ve killed hundreds of thousands of people around the world, most of them Muslim, and now we have ISIS-inspired terrorism in our country.\n\n“So our focus is what do we have to do to keep Australians safe? And a review that reports by April gives government and the country the assurance that we are doing that.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n‘Not good enough’: Spender\n\nIndependent MP Allegra Spender has joined calls for a federal probe into anti-Semitism, saying Labor’s prospective review of national security agencies is “not good enough”.\n\nThe Wentworth MP – whose electorate includes Bondi – told the ABC that she welcomed the inquiry into intelligence agencies however urged a stronger investigation into all levels of government.\n\n“I welcome a review, but frankly, this is not good enough,” she said.\n\n“We need a federal and state collective royal commission or that sort of inquiry to get to the heart of what happened last week and what we can learn from it.\n\nAllegra Spender says Labor’s prospective review of national security agencies is ‘not good enough’. Picture: NewsWire / Martin Ollman\n\n“We have 15 Australians who have died. We owe to them, and to the Jewish community who were targeted simply because of their religion, to leave no stone unturned to understand what happened and what collectively we (can) do to give us the best chance that this can never happen again.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMs Spender went as far as to say the intelligence review was “inadequate”, agreeing with harsh criticisms lobbied at the government by former treasurer Josh Frydenberg.\n\nThe review’s “narrow scope” and focus on securing the safety of Australians “in the future” needed to be bolstered by a retrospective look at what had gone wrong, she said.\n\n“If we look at the past honestly, then we have a chance of moving forward,” she said.\n\n“But we can’t just say, ‘oh, let’s look to the future’. We actually have to look at the past as well.”\n\n‘Australia needs answers’: Sloane\n\nState Opposition Leader Kellie Sloane has echoed calls from her federal counterparts for a federal royal commission after NSW Premier Chris Minns publicly endorsed a state probe into the anti-Semitic terror attack.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMs Sloane – who is the member for neighbouring electorate Vaucluse – told the ABC she would like to see an investigation into the Bondi attack led by the Commonwealth.\n\n“NSW can’t go it alone in this. Terrorism doesn’t know borders, so, yes, I support a royal commission,” she said.\n\nKellie Sloane has worked with state premier Chris Minns to fast-track legislation in the wake of the attack. Picture: NewsWire / Tom Parrish\n\n“We need to understand exactly what happened – not just on the day, not just in the weeks and months leading up to it, but the broader build-up – what has contributed (to it).\n\n“Australia needs answers on what was the root cause of this terrible attack and what we can do to ensure that we never see this on our beaches, on our cities and our soil again.”\n\nThe swift, bipartisan effort by Mr Minns and Ms Sloane to recall parliament and fast-track state legislation in the wake of the attacks has been commended by the Jewish community.\n\nIt has placed immense pressure on their federal counterparts, especially Mr Albanese, to take stronger action on anti-Semitism.",
    "source": "Yahoo",
    "cluster_id": 35
  },
  {
    "url": "https://au.news.yahoo.com/aussie-ditches-christmas-shift-after-15-million-lotto-win-015354168.html",
    "title": "Aussie ditches Christmas shift after $1.5 million Lotto win",
    "publish_date": "2025-12-22T01:53:54Z",
    "category": "finance",
    "authors": [],
    "text": "It's the Christmas wish many of us want to come true — become a millionaire and ditch work. But for one lucky Aussie, that's exactly what he can do now after scoring a $1.5 million Lotto prize over the weekend.\n\nThe Townsville man admitted he will happily ditch his Christmas shift now that he's a newly appointed millionaire.\n\n\"I was supposed to work right through to Christmas, but now I won't be!\" he told The Lott officials, explaining he now plans to quit his job.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe admitted that he was close to blocking the lottery official's number after they kept calling.\n\n\"I thought it was some sort of prank call... That's a great little surprise, especially with Christmas this week.\n\n\"My wife is screaming in the background!\" he said.\n\nThe couple revealed they plan to pay off their mortgage\n\n\"We're so excited!\"\n\nThe Queenslander was one of four division one winners of the Saturday Lotto draw, with the three others based in Western Australia.\n\nThe winning numbers in Saturday Lotto draw 4635 were 8, 32, 31, 19, 43 and 41, while the supplementary numbers were 14 and 6.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAussies urged to check their lottery tickets this Christmas\n\nWith Christmas around the corner, Aussies are being urged to check their lottery tickets as $115 million in winnings remains unclaimed.\n\nLottery officials say there could be an extra present waiting for unsuspecting ticket holders, with 13 unclaimed major prizes up for grabs.\n\nSeven of the tickets are from New South Wales, four from Queensland and two from the ACT.\n\n\"Whether it's tucked in a drawer, stuck on the fridge or hidden in your wallet, that forgotten lottery ticket could hold the ultimate Christmas surprise — a major win!\" Matt Hart from The Lott said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn June, a Victorian man found a $2.1 million winning ticket tucked away in a card he had received for Christmas last year.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 36
  }
]