[
    {
        "url": "https://www.9news.com.au/national/polar-blast-brings-snow-just-in-time-for-the-opening-of-ski-season/224f574b-5fa3-4df9-b40b-4050c7d0a4a5",
        "title": "Polar blast brings snow, just in time for the opening of ski season",
        "publish_date": "Tue, 03 Jun 2025 23:55:17 +0000",
        "category": "sports",
        "authors": [
            "Jun"
        ],
        "text": "Two cold fronts surging across south-eastern Australia are expected to serve up daily dustings of snow in the Australian Alps over the next week.\n\nThe polar blast has arrived just as the 2025 ski season gets underway this King's Birthday long weekend.\n\nA weak cold front sliding across south-eastern Australia will deliver some light snow to the high mountains in NSW, Tasmania and Victoria, Weatherzone reports .\n\nModelled 850 hPa temperature and mean sea level pressure (MSLP) showing cold air being driven over southeastern Australia on Sunday, June 8, 2025. (Weatherzone)\n\nThe Bureau of Meteorology is forecasting a small chance of snow on Wednesday in Victoria's ski fields at Mt Hotham and Mt Buller, with a maximum temperature of -1°C. In NSW, there is also a slight chance of snow falling at Perisher and Thredbo.\n\nFrom Wednesday night and into Thursday morning, the mercury is expected to plummet, with minimum temperatures forecast to reach -5 to -7°C in the Victorian and NSW Alps.\n\nThe snow falls are expected to begin in earnest over the weekend, when two cold fronts are set to sweep across south-eastern Australia, Weatherzone said.\n\nDaily snow falls in the NSW and Victorian alps are predicted from the weekend to early next week. (Weatherzone)\n\nSnow is expected to fall in the mountains each day from Saturday to at least Tuesday.\n\nThe cold front will move over Victoria on Tuesday morning. The huge field of speckled cloud to the south of this front reveals a large cold air mass surging towards southeastern Australia.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/gdp-figures-australia-march-quarter/a0fdf1a8-cd01-4574-97d7-1e589ea50ee2",
        "title": "Australian economy struggles along to start the year, soft new data reveals",
        "publish_date": "Wed, 04 Jun 2025 01:41:24 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "Australia's economy ﻿could only manage slight growth in the first quarter of the year as households squirrelled away more of their income in savings and extreme weather hit exports and tourism.\n\nNew data from the ABS released this morning showed GDP rose 0.2 per cent in the March quarter, down from 0.6 per cent in December, and was up 1.3 per cent over the last 12 months.﻿\n\nThat's in line with forecasts, which had been recently pared back – analysts had been expecting a rise of between 0.1 and 0.3 per cent for the quarter, and around 1.2-1.4 per cent for the year.﻿\n\nShoppers in Pitt Street Mall for the Boxing Day sales. Population, economy, demographics, people, Australia, generic (Kate Geraghty)\n\nHowever, after its first rise in seven quarters in December, per capita GDP went backwards once again, falling 0.2 per cent for the quarter and 0.4 per cent for the year.\n\n\"Economic growth was soft in the March quarter,\" ABS head of national accounts Katherine Keenan said.\n\n\"Public spending recorded the largest detraction from growth since the September quarter 2017.\n\n\"Extreme weather events reduced domestic final demand and exports. Weather impacts were particularly evident in mining, tourism and shipping.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/rams-financial-group-sued-by-asic-over-misconduct-preparing-home-loans/726fc65b-2928-4c00-9bf1-8edb9bcc1445",
        "title": "Fake pay slips among 'systematic misconduct' by home loans giant",
        "publish_date": "Wed, 04 Jun 2025 01:09:23 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "T﻿he corporate watchdog ASIC has sued RAMS Home Loans, accusing it of \"systemic misconduct\" in arranging home loans.\n\nWestpac's mortgage broking subsidiary allegedly breached its obligations under credit laws and engaged in widespread unlicensed conduct between June 2019 and April 2023.\n\nAllegations brought by ASIC include that RAMS staff forwarded fake pay slips in mortgage applications, and changed customers' expenses and debts in order to meet loan serviceability provisions.\n\nMortgage brokers at RAMS Financial Group are accused of widespread misconduct over a four-year period. (Australian Financial Review)\n\n\"This is a systemic organisational governance failure by RAMS who did not adequately supervise its franchise network,\" ASIC deputy chair Sarah Court said.\n\n\"RAMS allowed years of unlawful conduct to occur across its franchises, creating the opportunity for loans to be provided to customers who otherwise may not have qualified for those loans, and thereby increasing commissions earned by RAMS franchisees.\"\n\nLast August, Westpac announced it was closing the RAMS brand to new home loan applicants and absorb its existing loans into the wider business.\n\nRAMS has admitted liability for the contraventions and remediated customers impacted by the misconduct.\n\nASIC is seeking financial penalties and declarations against RAMS.﻿\n\nThe date for the first case hearing is yet to be scheduled.\n\nIn an ASX statement before trading today, Westpac said it will continue to cooperate with ASIC to resolve the proceedings as speedily as possible.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/reddy-express-customer-wrongly-charged-over-14k-for-petrol-tank-after-technical-error/3d612950-dbce-42ee-9555-c7b0e6aaf55a",
        "title": "Customer wrongly charged over $14k for petrol tank after 'technical error'",
        "publish_date": "Wed, 04 Jun 2025 00:13:24 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "A Reddy Express customer has flagged a nationwide issue after he was mistakenly charged over $14,000 for a tank of petrol. ﻿\n\nMotorist Steve filled up his tank at a Reddy Express on Saturday, May 31st, paying $106 for the petrol.\n\nHe wrote to 2GB after his wife noticed over 130 additional charges of the same $106 transaction on their bank statement, totalling $14,200 in charges.\n\nHe wrote to 2GB after his wife noticed over 130 additional charges of the same $106 transaction on their bank statement, totalling $14,200 in charges. (Wikimedia Commons)\n\n\"I called Reddy Express, they gave me a number to call ﻿after 9 am, then I was told it was a nationwide problem,\" he told 2GB host Ben Fordham.\n\n\"I called the number basically, it's just an automated message, and it says they're aware of the issue, they said you'd be refunded the money in 2 to ﻿7 days.\n\n\"I called my bank, Westpac, but they had not been made aware of it...some people may have been charged and they're not aware of it﻿.\"\n\nAnother caller named Angelo said the same thing happened to his daughter, who had bought a $6 drink from a Reddy Express on Saturday. ﻿\n\n\"She spent $6, basically it charged her 104 times for that transaction,\" Angelo said.\n\n\"The problem with my daughter's [situation] is she's going overseas in about a week...she doesn't want to wait seven days﻿ for a refund.\"\n\nAnother caller named Angelo said the same thing happened to his daughter, who had bought a $6 drink from a Reddy Express on Saturday. ﻿ (CrispyPork/iStock)\n\nReddy Express released a statement today, citing a technical issue following the public complaints.\n\n﻿\"On Saturday (31/5) a technical issue led to intermittent EFTPOS errors affecting some guests paying by credit or debit card at Reddy Express stores,\" a spokesperson for the company said.\n\n\"In some cases, this resulted in guests being charged more than once for their transaction.\n\n\"We are aware of the issue and are reversing any duplicate transactions as quickly as possible.\n\n\"The majority of those reversals were processed yesterday with the final few being processed today.\n\n\"As we are aware of the issue and taking action to rectify it, there is no action required by our guests.\n\n\"If guests wish to confirm this with us, please contact our customer service office contactus-retail@vivaenergy.com.au or call 1800 656-055.\n\n\"For those customers who alert our customer service assistants that they are experiencing financial stress, we have in place a system to fast-track refunds.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/ray-dalio-us-billionaire-sounds-warning-on-economy/b3e8e322-4a48-4505-961a-ec8d5729a84e",
        "title": "Billionaire sounds alarm on US economy's 'death spiral'",
        "publish_date": "Tue, 03 Jun 2025 23:44:36 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "The US is at a low risk of an imminent debt crisis – but high risk in the long term, billionaire investor Ray Dalio writes in a new book.\n\nThe US government debt situation is \"nearing the point of no return\" and approaching a \"death spiral\" that could threaten the stability of the world's largest economy, he writes in the book, How Countries Go Broke: The Big Cycle , published today.\n\nSome economists and investors have been sounding the alarm about the deficit for years. But this year, Wall Street has begun to heed caution as US President Donald Trump's tariffs and tax bill agenda have stoked volatility in the bond market, which is the usually quiet bedrock of the US and global economies.\n\nRay Dalio, founder of Bridgewater Associates, speaks during an event on May 22 at the Paley Centre for Media in New York. (The Paley Centre for Media via CNN)\n\nInvestors are increasingly concerned about the potential for Trump's \"big, beautiful\" tax bill to put pressure on the federal debt burden at a time when there is uncertainty about the outlook for the economy and the appeal of US assets.\n\nIn May, the rate the US government has to pay investors for a 30-year loan spiked to its highest level since 2023.\n\nThat's because investors either sold or refused to buy bonds and demanded higher compensation in exchange for what looked like a riskier loan to the US government.\n\nDalio is the latest billionaire to sound the alarm over the US debt and deficit, with worries that the vast government debt will crowd out spending on essential services to leave a hollowed-out economy that can't work for its citizens and which spooks global investors.\n\nREAD MORE: Ukraine tips the scales with explosive strike on crucial link ﻿\n\nTrump's tariffs and tax bill have been widely criticised. (AP)\n\nThere is a \"very low imminent risk\" of a US government debt crisis, but a \"very high long-term risk,\" Dalio writes in the book.\n\n\"Even though this progression has happened many times in history, most policy makers and investors think their current circumstances and monetary system won't change,\" Dalio writes.\n\n\"The change is unthinkable – and then it happens suddenly.\"\n\nA higher deficit means the Treasury might need to sell more bonds to finance its spending and interest payments.\n\nA debt \"death spiral\" describes when a government needs to issue more bonds to raise money to pay its existing debts, but faces less demand and has to pay investors more and more interest for them to bite.\n\nThere has been turmoil on Wall Street. (AP)\n\n\"A spiral of rising interest rates leading to worsening credit risk, leading to less demand for the debt, leading to higher interest rates is a classic debt 'death spiral',\" Dalio writes.\n\nThe higher interest rates investors demand to loan the government money leave less money for running a country, increase interest rates for consumers and businesses and generally leave a country with fewer options to raise cash.\n\n\"To me, that suggests that US policy makers should be more, not less, conservative in dealing with the government's finances because the worst thing possible would be to have its finances in bad shape during difficult times,\" Dalio writes.\n\nTurmoil in the bond market\n\nTrump's tax bill is set to raise the deficit because it slashes tax revenues without enough cuts to spending to balance things out.\n\nThe current US deficit is on unsustainable path and is \"more than the market can bear,\" Dalio said at an event on May 22 in New York ahead of the book's release.\n\nHe said that he anticipates it will be roughly three years before the US is in a \"critical situation\".\n\n\"I think we should be afraid of the bond market,\" Dalio said.\n\n\"I can tell you that this is very, very serious.\"\n\nTax cuts can be a boon for Wall Street, and the stock market cheered Trump's tax cuts during his first term.\n\nBut what makes this time different is adding to the deficit while the federal debt burden has ballooned: the ratio of federal debt to gross domestic product, or the total value of goods and services produced in the economy, soared from 104 per cent in 2017 to 123 per cent in 2024, according to the Treasury Department.\n\n\"We're now talking about deficits and a national debt-to-GDP ratio that are really going to be unprecedented, except for recent recessionary times,\" Alan Auerbach, a professor of economics at UC Berkeley, previously told CNN.\n\nDalio's book comes out days after JPMorgan Chase chief executive Jamie Dimon said on Friday at the Reagan National Economic Forum that a \"crack\" in the bond market \"is going to happen\".\n\n\"The US long bond is already near its highest levels since the (2008 financial crisis),\" Ajay Rajadhyaksha, an analyst at Barclays, said in a recent note.\n\n\"As markets absorb the details of the new tax bill, and realise that deficits are likely to keep rising for the foreseeable future, the risk is that longer yields keep rising as well.\"\n\nNor have Democrats and Republicans shown they can work together on the problem, Dalio said at the May 22 event.\n\n\"It's like being on a boat that's headed for rocks,\" he said, \"and they agree that they should turn, but they can't agree on how to turn.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/anz-warns-investment-scams-on-the-rise-after-interest-rate-cuts/c5894ce9-0841-4481-8d41-703eb41fc34a",
        "title": "'Incredibly hard': Scammers 'thriving' off interest rate cuts",
        "publish_date": "Tue, 03 Jun 2025 22:41:07 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "Australians have been warned about a surge in investment scams as the Reserve Bank of Australia continues to lower interest rates.\n\nANZ head of customer protection Shaq Johnson said interest rate cuts provided scammers with a chance to \"thrive\".\n\n\"People, when rates are falling, understandably, they look for a better deal,\" he told Today .\n\nPeople have been warned about falling prey to a surge in deposit scams after interest rate cuts. (Getty Images/iStockphoto)\n\n\"And that's why we see a lot of scammers posing as financial institutions, tricking people into transferring money into fraudulent term deposit accounts.\"\n\nJohnson said recent data showed a 70 per cent increase in deposit-related scams, up from the last quarter of 2024.\n\n\"And that's why we're urging people to be extremely vigilant when they are interacting with people online, trying to invest or finding better deals or interest rates, because once money moves out of their accounts, it's incredibly hard to recover,\" Johnson said.\n\nANZ head of customer protection Shaq Johnson. (Today)\n\nScammers use a \"broad range\" of tactics, including unsolicited offers of attractive interest rates on deposits.\n\nVictims have also been taken in by fake websites online while looking for a better deal.\n\nJohnson said scammers often avoided making offers that sounded too good to be true, opting instead for \"just a few basis points higher than what's been offered\".\n\n﻿\n\n\"And what we see is the individuals who are trying to find these ... better deals, they will fill their information and they will receive a call from a financial advisor or somebody claiming to be from a bank, and then they will send them some paperwork,\" he said.\n\n\"They appear very legitimate.\"\n\nHe said it was getting harder for people to decipher a scam, with crooks making use of dark web data and AI to personalise their approach to a victim.\n\nCan you pick the Black Friday scam text message? View Gallery\n\n\"You just need to close to pay close attention,\" Johnson said.\n\n\"If it's an offer too good to be true, do your research. Stop and think. If you think that you're speaking to your bank, you need to pay close attention to what you've been asked to do.\n\n\"You know, moving money out of your accounts, it's not something that the bank will ask you to do.\"\n\nJohnson urged people to stay up to date with scam information on bank websites and the ACCC's Scamwatch page .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/how-a-queensland-couples-embryo-got-lost-in-the-post-for-four-days/fad00c19-69f5-43c6-931d-4d6fc59e6cbe",
        "title": "How a Queensland couple's embryo got lost in the post for four days",
        "publish_date": "Tue, 03 Jun 2025 19:08:47 +0000",
        "category": "lifestyle",
        "authors": [
            "Jun"
        ],
        "text": "Exclusive: Today, Saran Kaur's son, Ari, is a bright and bubbly three-and-a-half-year-old who is full of personality.\n\n\"He is gorgeous - my blue-eyed, beautiful baby. He is very happy, healthy and intelligent,\" Kaur said.\n\nWhile the Brisbane mother and lawyer marvels at how well her child's conception and birth via IVF turned out, Kaur says she cannot forget one traumatic incident that happened in between, which still haunts her.\n\nAri is a healthy and happy boy, but he was almost never born due to a mix-up in the mail. (Supplied: Saran Kaur)\n\nFor four stressful days, Kaur thought her hopes of having a third child were destroyed when her final six embryos were inexplicably lost in the post.\n\nIt was four-and-a-half years ago, in November 2020, and Kaur had arranged for her embryos to be flown from Melbourne to Brisbane.\n\nThe embryos were being transferred from the clinic where she completed the IVF treatments for her first two children, Melbourne IVF, to closer to home at Monash IVF in Brisbane.\n\nAfter six months of paperwork delays, the day finally arrived when the embryos were to be transported interstate - November 23.\n\nThat morning, Kaur said Melbourne IVF notified her that the embryos had been picked up via a third-party courier organised by Monash IVF.\n\nThe embryos were due to arrive at the Brisbane clinic later the same day, Kaur said, adding that she was told she would get a call when the journey was complete.\n\nKaur said she was on alert, but not overly concerned when she did not hear from Monash IVF on the first day.\n\n\"I didn't call them that day. I thought, 'Oh, maybe they're busy. I'll call them tomorrow',\" she said.\n\nSaran Kaur's son, Ari, was born a year after the postal mix-up. (Supplied: Saran Kaur)\n\nWhen Kaur rang Monash IVF the next morning, she was alarmed when staff could not tell her where the embryos were.\n\n\"They said, 'We don't know where they are. They should have arrived. They might be in the lab'. They were just very vague,\" Kaur said.\n\nWhen she did not get a call back from the lab staff, Kaur said she tried to escalate her case with a more senior staff member at Monash IVF that same afternoon.\n\nHowever, the staff member could not provide any more answers about where the embryos were.\n\n\"No-one knew where they were. I was shaking. I don't know what to do, because they could have been left anywhere - in a storage shed at the airport, or in someone's van.\"\n\nFor two more agonising days, Kaur said she was left in the dark.\n\nKaur said what frustrated and angered her the most was that Monash IVF did not seem to be very concerned at all.\n\nThey should have been treating her embryos like the potential people they were, not just a package, she said.\n\n\"You can imagine my anxiety, and nobody was listening to me,\" she said.\n\nFinally, on November 26 - day four - Kaur said she got a call from Melbourne IVF.\n\n\"They told me that my embryos had been returned there and asked what was happening,\" Kaur said.\n\nKaur said she felt relief to hear that the embryos had been found, but that relief was almost immediately replaced with anxiety over whether the embryos were okay.\n\nA scientist at Melbourne IVF then explained that the Cryoguard indicator on the cannister containing the embryos was green, indicating they had been kept at a suitable temperature and were therefore still viable.\n\nThe embryos were flown interstate in a temperature-controlled cannister. (iStock)\n\nEven so, a niggling anxiety would follow Kaur throughout her pregnancy.\n\n\"All the time I was pregnant with my son, it was still in the back of my mind, I was wondering, what happens if they were damaged, what if my son has a disability or something?\" Kaur said.\n\n\"How sure were they that they were still viable? I didn't know, until I had my son and I could see that he was healthy - you lose your trust.\"\n\nAfter the mix-up in the post, Kaur decided to keep her embryos with Melbourne IVF, and completed her IVF journey there.\n\nShe lodged a complaint with Monash IVF, which investigated the incident.\n\nIn a legal letter sent to Kaur via the clinic's lawyers, seen by 9news.com.au , Monash IVF blamed Melbourne IVF and the third-party couriers they engaged for the confusion.\n\nThe cannister containing the embryos was incorrectly packaged by Melbourne IVF, the letter said.\n\nThe embryos were then held by the courier company at its sorting facility, before being returned to Melbourne IVF three days later.\n\n\"The courier company failed to advise our client of this and it was not until November 26 that our client was notified that the delivery of the embryos had not been successful.\n\nMonash IVF had \"no control over the circumstances\", the letter stated.\n\nA spokesperson for Monash IVF told 9news.com.au : \"We understand and acknowledge the patient's concerns about what occurred. Monash IVF takes the utmost care with the transport of cryopreserved material, however, in this instance, at no time was Monash IVF in possession of the patient's embryos.\n\n\"We are pleased to learn that the patient has been successful in her IVF journey and wish her and her family all the best for the future.\"\n\nA spokesperson for Melbourne IVF denied the embryos were incorrectly packaged.\n\n\"Melbourne IVF followed best practice protocols for the safe preparation, labelling, and packaging of this embryo transfer, which was arranged by Monash IVF using their chosen third-party courier,\" the spokesperson said.\n\n\"The embryos were returned to Melbourne IVF after the courier failed to complete the delivery.\n\n\"We recognise the emotional toll this experience had on the patient and are pleased we were able to continue her care and support a successful outcome at Melbourne IVF.\"\n\nKaur said Monash IVF should have kept her updated throughout the transportation process.\n\nWhen news broke last month about an IVF mix-up that saw a Brisbane woman give birth to someone else's baby after the wrong embryo was transferred - also involving a Monash IVF clinic in Brisbane - Kaur said it resurfaced a lot of unpleasant memories about her own experience.\n\n\"When I read about that case, I got a flashback. I was thinking, 'Oh my God, that poor woman',\" Kaur said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/thailand-elephant-convenience-store-snacks-plai-biang-lek/20ef9a16-75b5-4a35-ba6f-c473111b0ec1",
        "title": "Hungry elephant raids local convenience store in Thailand",
        "publish_date": "Tue, 03 Jun 2025 13:32:15 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "A﻿ hungry elephant has helped itself to snacks, raiding a convenience store in Thailand .\n\nPlai Biang Lek from the Khao Yai National Park caused a stir on Monday afternoon in the Pak Chong district of the Nakhon Ratchasima region, about three hours north-east of Bangkok.\n\nThe incident captured on camera by shocked onlookers amd the store's CCTV went viral on social media.\n\nA﻿ hungry elephant has helped itself to snacks, raiding a convenience store in Thailand on Monday afternoon. (9News)\n\nThe startled store owner was serving a customer when the unexpected guest arrived about 3pm (6pm AEST)﻿, prompting them to both flee the store, according to The Bangkok Post .﻿\n\nAfter 10 minutes of rummaging, the elephant made his way back towards the forest leaving a slew of food and groceries across the store.\n\nIt's understood that ﻿Plai Biang Lek opted for sweet treats over salty foods - something that's highly unusual for wild elephants - nibbling on a sweet Thai crispy snack and eggs before casually leaving the shop.\n\nPlai Biang Lek from the Khao Yai National Park caused a stir in the Pak Chong district of the Nakhon Ratchasima region, located about three hours northeast of Bangkok. (9News)\n\nThe incident captured on camera by shocked onlookers as well as the store's CCTV, going viral on social media. (9News)\n\nThe owner estimated the damage bill would be around 1000 baht ($47.50) but was thankful no-one was hurt in the incident.\n\nIt's not the first time the 23-year-old elephant has made his way off the forest tracks in search of food.\n\nPark rangers said he's previously raided a porridge vendor's stall in the same area, according to Khaosod English .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/e-scooter-hurting-two-children-a-week-sunshine-coast-call-for-better-regulation/21785608-6988-409b-a746-2c581789720b",
        "title": "E-scooter accidents sending two children to hospital every week",
        "publish_date": "Tue, 03 Jun 2025 14:01:00 +0000",
        "category": "lifestyle",
        "authors": [
            "Jun"
        ],
        "text": "One Queensland hospital sees about two children a week injured in e-scooter accidents, prompting public health experts to call for an urgent overhaul of safety regulations.\n\nA report published today in the Australian and New Zealand Journal of Public Health revealed that on the Sunshine Coast alone, in 2023 and 2024, 176 children aged five to 15 needed hospital treatment after an e-scooter accident.\n\nOne in 10 of those injuries were life-threatening﻿ or potentially life-threatening, while 37 per cent of those patients suffered a fracture.\n\nE-scooter use sent two children a week to the hospital in one regional city. (Nine)\n\nCouncil's huge move after CBD bans e-scooters View Gallery\n\nQueensland legislation allows children 12 to 15 to ride e-scooters if they are supervised by an adult.\n\nSpeeds are curtailed to 25km/h on roads and 12km/h on pedestrian walkways. Helmets are mandatory and riders doubling up is forbidden.\n\nHowever, 42 per cent of cases analysed in the study were children or teens who weren't wearing a helmet at the time of their accident, 36 per cent involved speeds greater than 25km/h and 12 per cent involved doubling.\n\nScooters have been widely embraced by under-age children. (Getty)\n\nCollisions with cars were seen in 13 per cent of the presentations and 8 per cent involved other e-scooters or mobility devices.\n\nMost patients (71 per cent) were male and the median age was 14 but ranged from five to 15.\n\nLead author Dr Matthew Clanfield, who worked at the Sunshine Coast University Hospital during the study period, says that he was concerned to see the frequency and range of injuries being caused by e-scooter use amongst paediatric patients.\n\n\"While working at the hospital we would see a child or teen attend the emergency department with e-scooter injury every few days,\" he said.\n\nHealth experts say better regulation and enforcement are key. (iStock)\n\n\"The types of injuries ranged from minor fractures and injuries, through to traumatic brain injuries requiring a craniotomy.\n\n'\"A lot of the parents attending were extremely upset to see their child hospitalised and weren't aware how risky e-scooters can be or the legal requirement for supervision under 16.\"\n\nThe release of the research follows an announcement from the Queensland Government that it will hold a public enquiry into e-scooters and other mobility devices.\n\nQueensland and ACT are currently the only two states that allow e-scooter use under 16 years of age. Clanfield is calling for a minimum age of 16 to be imposed in Queensland until safety measures are improved.\n\nPublic Health Association of Australia chief executive, Adjunct Professor Terry Slevin, said e-scooters were a public health and safety concern across Australia.\n\nClear skies and crystal water hide this island's dangerous secret View Gallery\n\n\"We understand that e-scooters can be a fun and convenient way to travel, but unfortunately the way they are being used now, particularly by teens and children at high speeds, are proving a genuine public health risk and injury prevention issue,\" Slevin said.\n\n\"This study provides data in one region and in one hospital, but this is an issue in every town and city where they have landed across Australia, including in busier areas.\n\n\"This study found almost 180 kids were hospitalised in one regional area, at one hospital. Multiply that finding across Queensland and Australia and we are looking at thousands of preventable injuries, as well as lives lost. It is the tip of the iceberg.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/technology/veo-3-google-tool-reveals-most-realistic-ai-videos-yet/5c41fdb3-e9fa-4416-b73b-b4d4aa909444",
        "title": "Google's new AI shocks the internet with its most realistic videos yet",
        "publish_date": "Tue, 03 Jun 2025 04:45:54 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "AI and its future use were the topic of\n\nthe\n\nAustralian Financial Review\n\n's AI summit\n\nheld today, with Google Australia and New Zealand managing director Melanie Silva saying the technology will be critical to lift Australia's productivity.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/march-quarter-gdp-2025-australia/105374368",
        "title": "Breaking: Australia's economic growth slows more than expected",
        "publish_date": "Wed, 04 Jun 2025 01:37:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's economy grew by 0.2 per cent in the March quarter, and 1.3 per cent through the year, according to the Australian Bureau of Statistics (ABS).\n\nIt means economic growth slowed in the first three months of the year, from 0.6 per cent at the end of 2024, and missed expectations.\n\n\"Public spending recorded the largest detraction from growth since the September quarter 2017,\" said ABS head of national accounts Katherine Keenan.\n\n\"Extreme weather events reduced domestic final demand and exports. Weather impacts were particularly evident in mining, tourism and shipping,\" she said.\n\nThe RBA didn't want to cut rates too late, governor Bullock says Photo shows A woman with short brown hair and glasses looks down slightly. The RBA was too slow to lift rates, and it didn't want to make the same mistake when cutting them, the central bank's governor has told a parliamentary committee.\n\nIn its latest economic statement, the Reserve Bank forecast annual GDP growth of 1.8 per cent by the end of the June quarter, picking up to 2.1 per cent by the end of this year — a downgrade to its previous forecasts after the Trump administration's shock tariff announcement in April.\n\nIt means the economy will have to grow noticeably in the June quarter to meet that annual target.\n\nData show government spending did not grow in the March quarter.\n\nCommonwealth spending on social benefits to households remained low, and state and local governments spent less on social benefits to households for energy bill relief. That was offset by more commonwealth spending on defence.\n\nGDP per person fell 0.2 per cent in the quarter, following a 0.1 per cent rise in the December 2024 quarter, the ABS said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/nt-pac-dismisses-darwin-waterfront-corporation-allegations/105372318",
        "title": "Claims of made-up NT public job cleared by parliamentary committee",
        "publish_date": "Wed, 04 Jun 2025 01:11:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Darwin Waterfront Corporation (DWC) has been cleared of wrongdoing by a Northern Territory parliamentary committee after the Territory Labor leader raised misuse of public money allegations.\n\nOpposition Leader Selena Uibo referred the \"serious\" allegations to the Public Accounts Committee last month.\n\nThe allegations included the creation of a made-up unadvertised role that would see DWC's deputy chief executive, Sam Burke, receive a temporary $60,000 higher duties salary increase.\n\nThe higher duties allowance allegedly continued for up to six years, long after the temporary role ended.\n\nMs Uibo used parliamentary privilege last month to air the claims, which were made in a series of news reports by the NT Independent.\n\nMisuse of public money claims referred for NT probe Photo shows A close-up of an Aboriginal woman wearing a yellow blazer \"Serious\" misuse of public money allegations at the Darwin Waterfront Corporation have been referred to a parliamentary committee.\n\nMs Uibo also referred allegations of funds being moved between two public bodies, the DWC and AustralAsia Railway Corporation (AARC).\n\nMr Burke, who is married to NT Chief Minister Lia Finocchiaro, is the AARC chief executive and was appointed the DWC general manager in 2016.\n\nHe was then appointed DWC's deputy chief executive in 2020, at the same salary level, in a four-year contract that was renewed in late 2023.\n\nChair of the railway corporation is Alastair Shields, who is also DWC's chief executive.\n\nIt was alleged that Sam Burke was given a made-up part-time job at the Darwin Waterfront Corporation. (ABC News: Tiffany Parker)\n\nThe AARC is a separate statutory body that manages the railway between Darwin and Tarcoola in South Australia, which is co-located with the DWC.\n\nThe DWC told the committee Mr Burke was paid a $42,000 salary for higher duties between the two organisations, for five separate stints between 2018 and 2020.\n\n\"Because none of the periods of higher duties exceeded six months, they were not required by NT [public service] guidelines to be advertised,\" the DWC submission read.\n\nThe DWC is a statutory authority that controls the Darwin Waterfront, one of the Top End's most popular recreational facilities. (ABC News: Michael Franchi)\n\nDWC chair Patrick Bellot said Mr Burke's salary was cost-shared with the AARC and DWC.\n\n\"These are long-standing, audited, cost-sharing arrangements dating back to 2006 that are entirely consistent with NT government practice,\" Mr Bellot said.\n\n\"The auditor-general has never raised any concern regarding these transactions in our unqualified annual audit reports.\"\n\nMr Bellot said both organisations had their own separate annual audits.\n\nAlastair Shields said DWC and the AARC had long shared corporate services and staff. (ABC News: Pete Garnish)\n\nMr Shields told the committee the two organisations had become \"enmeshed\" due to the sharing of resources and staff since the DWC's establishment in 2006.\n\n\"We've shared board members, staff, office accommodation, resources from the very beginning,\" he said.\n\nMarie-Clare Boothby criticised Selena Uibo for referring the allegations to the Public Accounts Committee. (ABC News: Pete Garnish)\n\nPrior to the committee's hearing, Tourism and Hospitality Minister Marie-Clare Boothby, who has responsibility over the DWC, said the allegations would be \"put to bed\" by the process.\n\nAfterwards, she issued a statement welcoming the committee's unanimous dismissal of the allegations.\n\n\"I am drawing the line in the sand on this matter,\" she said.\n\nThe five-member Public Accounts Committee has a government majority of three members.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/matildas-australia-football-cortnee-vine-joe-montemurro/105374542",
        "title": "World Cup hero 'on the radar' for Matildas recall",
        "publish_date": "Wed, 04 Jun 2025 00:55:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "New Matildas coach Joe Montemurro has hinted Women's World Cup hero Cortnee Vine may be in line for a recall to the national squad.\n\nVine shows nerves of steel Photo shows Cortnee Vine kicks the winning penalty against France at the Women's World Cup. Coming off the bench in the 104th minute of the Matildas' Women's World Cup quarterfinal against France, the 25-year-old had little idea she was about to write her name into Australian sporting folklore.\n\nWinger Vine catapulted to stardom when she scored the winning spot-kick in the Matildas' epic penalty shootout win over France at the 2023 World Cup.\n\nBack then, Vine was also lighting up A-League Women with Sydney FC.\n\nBut between taking a mental health break, injuries and a difficult start to life in the NWSL with North Carolina Courage, the 27-year-old has not played for the Matildas since the Paris Olympics.\n\nMontemurro plans to reach out to Vine, along with other players in the wider Matildas selection frame.\n\n\"Cortnee's definitely on the radar,\" he said.\n\n\"We'll get to the heart of getting her back in the fray and hopefully we can build her into the Asian Cup also.\"\n\nMontemurro watched on in Canberra on Monday night as an array of other attackers made their own cases ahead of the Asian Cup.\n\nAs the leader of the prolific Matildas 'brand', Montemurro might be Australia's most important coach Photo shows Joe Montemurro holds a football and wears a scarf Joe Montemurro correctly called the Matildas 'one of the best brands in the world' at his unveiling and begins his tenure as coach at one of the most crucial junctures in Australian football.\n\nAmy Sayer scored a well-taken brace in the 4-1 win over Argentina.\n\nKahli Johnson notched a goal and an assist across her first two matches, while A-League Women Golden Boot winner Holly McNamara is also highly rated.\n\n\"It's interesting that everyone's talking about the next cycle and the aging squad,\" Montemurro said.\n\nMontemurro has been helped by Tom Sermanni testing and developing players during his stint as interim coach.\n\n\"It's actually made my job a little bit easier in terms of profiling players and understanding what level some of the players are at and then thinking about how we can marry the two,\" he said.\n\nMontemurro will be in charge of the Matildas for their upcoming friendlies against Slovenia and Panama in Perth.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/ellie-morris-photography-perenjori/105371112",
        "title": "Farmhand's camera captures rural Australian stories",
        "publish_date": "Wed, 04 Jun 2025 00:51:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "On a farm in Western Australia's remote north-eastern Wheatbelt, Ellie Morris sits in a tractor with her dog Marley on her knee and a camera at her feet.\n\nWhile the 24-year-old's main source of income is from her work as a farmhand in Perenjori, 341 kilometres north-east of Perth, her passion is capturing the world around her with her camera.\n\nMs Morris wants to show the beauty of rural life in ways people may not have seen before. (Supplied: Ellie Morris)\n\nHaving received her first camera as a gift for her sixth birthday, Ms Morris has built up plenty of experience.\n\n\"Basically, while I'm driving tractors, I'm flying drones and taking photos of what I'm doing,\" she said.\n\n\"I'm a pretty visual person, and I'm not great with words. I don't always have a lot to say. So with my photos, I can say a lot more.\"\n\nThough Ms Morris has not had formal photography training, the amount of time she has spent on the farm with her camera has helped her strengthen her creative muscle.\n\nEllie Morris has been taking photos since she was six years old. (ABC Midwest & Wheatbelt: Anna Cox)\n\nShe believes her photos carry a simple message.\n\n\"There is so much beauty in the life and what we do out here,\" she said.\n\n\"Showing people who don't live here what it's like — it's not always beautiful. There are two sides to it, and I capture that.\"\n\nHaving amassed a following of more than 11,000 people on social media has led to offers of paid work.\n\nComments from followers praise Ms Morris's ability to make something typically unglamorous, like dust, look like art.\n\nMs Morris says it's easy to find the beauty in rural life. (Supplied: Ellie Morris)\n\nSheep yards, storm clouds, crops, horses, and her Jack Russell, Marley, are some of Ms Morris's favourite things to photograph.\n\nShe points to Marley and laughs.\n\n\"When I bought her, I was told she was half border collie,\" she said.\n\nEllie Morris uses her Jack Russell, Marley, as a subject for her photography. (ABC Midwest & Wheatbelt: Anna Cox)\n\nMarley, dusty sheep flocks, and storm cloud photos have drawn an international following, garnering a strong following from American horse and cattle ranchers.\n\nThe balance between farming and photography is a simple one for Ms Morris. The camera stays on her at all times.\n\n\"People don't realise how much time you spend on your computer for photography,\" she said.\n\n\"That can get really boring. I do some of that stuff when I'm sitting in the tractor.\"\n\nShe is now selling prints of her photos to customers on a domestic and international scale.\n\nFarm owner Jason King with his sheep. (Supplied: Ellie Morris)\n\nTaking random, 'pretty special' photos\n\nMs Morris has been working on Jason King's farm for the past five years.\n\nHe refers to her as the \"farm celebrity\" and praises her eye for photography.\n\n\"She'll pull up at random times, times you wouldn't take a photo yourself, and take a photo that's pretty special,\" Mr King said.\n\nMs Morris has spent her entire life on farms, including being homeschooled on one.\n\nShe made her first trip to the Perth CBD last year and wants to continue her travels.\n\nWhen asked if he was worried about losing his farmhand to full-time photography, Mr King said: \"She's very good.\"\n\n\"You guys keep turning up, so hopefully, for her sake, it takes off.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/no-confidence-motion-in-tasmanian-premier-jeremy-rockliff/105374022",
        "title": "Live: Tasmanian premier faces no-confidence motion",
        "publish_date": "Wed, 04 Jun 2025 00:03:00 +0000",
        "category": "finance",
        "authors": [
            "James Dunlevie"
        ],
        "text": "The Greens have moved an amendment to the no-confidence motion in Premier Jeremy Rockliff, to insert that the state's budget problems are \"compounded\" by the proposed Macquarie Point stadium, reports Adam Holmes:\n\nLabor is supportive of a stadium however, so the amendment is unlikely to succeed — but it will at least add a bit of time to the length of the debate.\n\nAlso, if the amendment fails, the Greens will still fall back on the main no-confidence motion anyway.\n\nAnd for those wondering how long this will take, the answer is: get comfortable.\n\nLeaders get 30 minutes each to speak, and we've already had Premier Jeremy Rockliff and Labor leader Dean Winter, while Greens leader Rosalie Woodruff remains on her feet.\n\nEveryone else gets 20 minutes each.\n\nWe can expect independents Craig Garland, Kristie Johnston and David O'Byrne, Andrew Jenner from the Jacqui Lambie Network, and maybe both former JLN members Miriam Beswick and Rebekah Pentland.\n\nMore government MPs might speak — Treasurer Guy Barnett, former deputy premier Michael Ferguson might like to have his say, and other ministers like Roger Jaensch, Madeleine Ogilvie and others.\n\nOther Labor MPs are sure to want to sink the boot in too.\n\nAnd now a bonus round! They can now speak on the Greens' stadium amendment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/blog-erin-patterson-trial-wednesday-june-4/105374160",
        "title": "Live: Erin Patterson describes planning 'special' beef Wellington meal",
        "publish_date": "Tue, 03 Jun 2025 23:37:24 +0000",
        "category": "finance",
        "authors": [
            "Judd Boaz",
            "Joseph Dunstan"
        ],
        "text": "Mr Mandy then asks Erin how she felt about Simon's rejection of her invitation to the lunch on July 29.\n\nShe confirms she was \"a bit hurt\", then Mr Mandy reads a text she sent back to him where she outlined her disappointment and spoke about how much effort had gone into preparation for the lunch.\n\n\"Why did you send Simon that message?\" Mr Mandy asks.\n\n\"I was hurt he didn't want to come but I was also really anxious and stressed about this upcoming procedure that I was going to have, and I just wanted to know that it would be sorted and I wouldn't have to worry about whether I would have help with the kids or not, so I just wanted him to come so I could talk to him about that,\" she says.\n\nWhen asked about the exaggerations in the message, Erin says they were made because she really wanted him to attend the lunch.\n\n\"I shouldn't have done any of that, but that's what I was thinking at the time,\" she says.\n\nErin says she wanted Simon to feel \"a little bit bad about cancelling at the last minute after he would've known that I would've done a lot of preparation\".\n\nErin admits she'd not really done the \"many hours\" of preparation she had told Simon had gone into the lunch.\n\n\"No, it wasn't true,\" she says.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/central-coast-lifesaver-col-laing-retires-from-active-patrols/105365010",
        "title": "Lifesaver who founded club at dangerous NSW beach hangs up cap at 82",
        "publish_date": "Tue, 03 Jun 2025 23:05:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "Col Laing became a surf lifesaver at 16 in 1958 because that was what his mates did.\n\n\"There weren't all the sports that are around now,\" he said.\n\n\"[It was] lifesaving in the summer and rugby league in the winter.\"\n\nMr Laing never anticipated he would still be on patrol in his 80s, nor did he expect to build a club from the ground up.\n\nBut fast forward 67 years and that is the legacy he leaves, as he officially retires from active patrols at 82.\n\nCol, with son Scott, says surf lifesaving has helped keep him young. (Supplied: Col Laing)\n\nAfter spending almost 20 years at The Entrance Surf Life Saving Club, the champion surf lifesaver saw a need for patrols at nearby North Entrance Beach, where calls for help were becoming more regular by the mid-1970s.\n\n\"They'd throw a reel in the boot of a car and we'd come over the bridge [to North Entrance] and normally we were too late to do much,\" he said.\n\n\"Everyone was screaming out for a club to be formed over here, so we decided we'd form a club.\"\n\nCol Laing (right) competed in hundreds of surf lifesaving tournaments over 67 years. (Supplied: Col Laing)\n\nMr Laing said the improvement in surf lifesaving over the years had helped him and others save countless lives.\n\n\"There was none of the equipment that we've got now … we only had the rescue boat and the reel and we used the surf boat,\" he said.\n\n\"The old Holger Nielsen method was about 5 per cent effective, I reckon.\"\n\nNamed for the Danish sportsman who invented it, the Holger Nielsen method is a historical technique used on drowning victims, in which the patient is laid on their front while the rescuer presses their back and lifts their elbows to assist breathing.\n\n\"There's been a big improvement over those years, and it was needed too,\" Mr Laing said.\n\n\"They've got helicopters out there, they've got drones flying around, defibs … you name it, they've got it.\"\n\nAge no barrier\n\nThe summer of 2024–25 was officially Mr Laing's last on active patrol duty.\n\nWith a smile on his face, he recalls the surprise from others on the beach as he entered the water to help a swimmer in distress that season, not realising at the time it would be his last rescue.\n\n\"The younger members on patrol were looking to me, so I just got out there on the board,\" Mr Laing said.\n\nCol Laing (middle) with his family at a presentation night, where he was honoured for his 67 years of service. (Supplied: Col Laing)\n\nHe believed his commitment to surf lifesaving could be the key to the fountain of youth.\n\n\"I think any sport, but particularly with surf lifesaving, the swimming is good because all the body parts are worked … there's no pressure on it,\" Mr Laing said.\n\n\"That, and the sense of community.\n\n\" I've competed all my life, so I know people all around Australia. \"\n\nCol Laing credits his health and fitness to time in the water. (ABC Central Coast: Sarah Foster)\n\nA lasting legacy\n\nMr Laing taught North Entrance Surf Life Saving Club deputy president Kate Broadhurst as a nipper in the 1990s and now her children are learning from him.\n\nMs Broadhurst found it hard to put into words just what he meant to the club.\n\n\"Col was responsible not only for keeping the club going but [ensuring] we were a really prominent, competitive club,\" she said.\n\nKate Broadhurst was trained by Col Laing as a junior lifesaver. (ABC Central Coast: Sarah Forster)\n\n\" North Entrance is sometimes a dangerous and challenging beach and whether we liked it or not, we were out there and that built confidence in us as competitors and lifesavers. \"\n\nMr Laing has won hundreds of medals over almost seven decades on the beach, from branch to national championships and then masters titles in ski and board rescue events, and most of them have been donated to the club.\n\n\"We've been giving out the 'Col Laing Nipper of the Week' [award] using his medals for three of four seasons now,\" Ms Broadhurst said.\n\n\"Each week, one of the kids gets a medal … Col presents it.\"\n\nCol Laing organised the first patrol for North Entrance Surf Life Saving Club, initially out of a tent. (Supplied: Col Laing)\n\nMr Laing said he loved to see the look on the kids' faces as they were given a medal.\n\n\"It's not the champions that get it, it's the ones that are putting the effort in to try to get better,\" he said.\n\nWhile no longer actively patrolling, Mr Laing will continue to support the club in other roles, focusing on junior development.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/aflw-clubs-and-players-wanted-double-headers/105373232",
        "title": "'We advocated really hard': Why AFLW clubs wanted double-headers",
        "publish_date": "Tue, 03 Jun 2025 22:55:19 +0000",
        "category": "sports",
        "authors": [],
        "text": "GWS was surprised this year's AFLW fixture would feature no double-headers after being one of the \"strong advocates\" for the initiative.\n\nThere will be a two-round crossover between the end of the men's home-and-away season and the AFLW.\n\nThe men's finals will then continue through the women's season.\n\nAFLW announces season schedule Photo shows A Gold Coast AFLW player sprints to gather the ball and run clear, as a West Coast defender chases her. The AFL players' association says it is disappointed the league did not heed its request for any double-headers featuring men's and women's games.\n\nThe Giants particularly thought it would work for their round-24 men's home match at the Sydney Showground against St Kilda.\n\nHowever, their women's team were scheduled to play in Melbourne that weekend against Collingwood instead.\n\nGWS's executive general manager of AFLW and football operations, Alison Zell, said while she understood double-headers might not work for all clubs, it would have been feasible from the Giants' perspective and helped grow their fanbase.\n\n\"We're a young club with a new audience, a new fan base, and we want to be able to build that across our men's and women's program,\" Zell told ABC Sport.\n\n\"We think we've got this great prospect and a unique proposition to be able to bring new fans in by showcasing the men's and women's games together.\n\n\"That's why we're really disappointed to not get the opportunity to do that this season.\"\n\nThe Giants feel double-headers would have appealed to their fan base. (Getty: Quinn Rooney)\n\nThe week prior, the Giants' AFL and VFL teams play in the Gold Coast, while the women's team open their season the same day in Canberra.\n\n\"We've now got three teams across two different states on the one day,\" Zell said, as clubs share staff and resources across the programs.\n\n\"So from a board level, from an executive level, people have to choose — or potentially choose — which game they can attend. And what you don't want is people who represent the club, or who work for the club, having to choose which program they work on or they'd rather be at.\"\n\nJust over a month before the new fixture release, AFLW general manager Emma Moore said a key strategy of the league was aiming to foster a \"one club, two teams\" approach.\n\n\"While we're working through the fixture, one of the things we're focusing on is optimising what we can do in terms of the crossover of the women's and men's competition, and clearly double-headers are part of that conversation,\" Moore said at the season opener announcement.\n\nDemons players enjoy time with fans at Princes Park. (Getty: Kelly Defina)\n\nMoore added they wanted to help drive current fans of the men's competition to the women's games.\n\nHowever, when the women's fixture came out, in lieu of double-headers, flexible timing was built into the crossover period to ensure a club's men's and women's sides would not play at the exact same time.\n\nCategory-one venues Adelaide Oval\n\nDocklands\n\nMCG\n\nPerth Stadium Category-two venues York Park\n\nBellerive Oval\n\nGabba\n\nManuka Oval\n\nCarrara\n\nKardinia Park\n\nSydney Showground\n\nSCG\n\nAFLPA interim chief executive Ben Smith said the union provided the AFL with a submission based on player feedback that included a desire for more \"category-one venues and the opportunity to play some double-headers\".\n\nLast season, Richmond star Grace Egan told The Age: \"I don't think I've talked to a girl that hasn't loved it (the idea of a double-header).\"\n\nPlayers have also consistently advocated for some marquee games to be played at larger stadiums after the league moved away from their use to prioritise suburban grounds.\n\nThe benefits include they are weather protected, particularly out of the wind, have better surfaces free from hard and soft patches, and greater amenities for fans, such as public transport access.\n\nMoreover, these grounds also have camera cabling in much better positions, which can elevate the broadcast quality.\n\nEssendon and Hawthorn's inaugural 2022 clash at Docklands attracted 12,092 spectators, yet just 3,778 when the clubs played each other in Frankston the following year.\n\nIn the same vein, the first Showdown in 2022 between the Crows and Power attracted over 20,000 spectators at Adelaide Oval. Yet last year's Showdown housed just 5,194 at a sold-out Alberton Oval.\n\nAdelaide and Port Adelaide's inaugural showdown attracted over 20,000 people to Adelaide Oval. (Getty: Sarah Reed/AFL Photos)\n\nLast year, AFL executive general manager of football Laura Kane told The Sydney Morning Herald that for future AFLW matches to be played at Docklands Stadium, games would need to attract 20,000 supporters to justify using the venue.\n\nClubs like GWS feel double-headers provide a chance to try and reach that target.\n\n\"We know that there's a lot of complexities that come with this. We know it's a really hard prospect to put the fixtures together [and] the AFL haven't ruled out double-headers into the future,\" Zell said.\n\n\"We just think it was a missed opportunity, particularly in our market, to do it this year, to really capitalise on the fact that we're coming back into the men's season.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/sa-child-protection-laws-pass-parliament/105374004",
        "title": "New child protection laws pass SA parliament after late-night sitting",
        "publish_date": "Tue, 03 Jun 2025 22:45:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "The South Australian government has passed new child protection laws after securing enough support from the state's crossbench.\n\nGreens MLC Robert Simms and independent MLC Frank Pangallo on Tuesday signalled their support for the government's Children and Young People (Safety and Support) Bill, which proposes several reforms to the state's child protection and family support systems.\n\nThe bill passed with amendments in the upper house on Tuesday night, which secured the passage of the legislation through parliament.\n\nThe legislative amendments passed after support from (left) Robert Simms and Frank Pangallo. (ABC News: Justin Hewitson)\n\nChild Protection Minister Katrine Hildyard said the legislation \"elevates the voices of children in decisions about their lives\" and \"puts maximum effort into reunifying children with their families where that's safe and right\".\n\n\"It enshrines the safety principle which ensures the safety of the child must always be the priority in determining whether or not to remove a child or young person from their family,\" she told the ABC on Wednesday morning.\n\nSA's child protection laws under debate Photo shows A school class photo featuring more than 20 students with one child left out. The left out child is symbolized by a silhouette As South Australia's parliament considers new child protection laws, advocates are questioning whether the state has become \"over-zealous\" in protecting children from harm.\n\n\"The safety-first approach provides utter clarity to the social workers trusted to make really difficult, heart-breaking decisions.\"\n\nThe minister said the law allows children and young people to have \"more of a say\" about decisions relating to their lives.\n\n\"Of course there's always a need to consider a child's safety around decisions that are made,\" she said.\n\nOne of the amendments Ms Hildyard said upon listening to community feedback was making sure young people were able see their siblings \"when it's safe for them to do so\".\n\nAccording to the government, the new laws \"empowers\" Aboriginal families to lead decision-making about their children, and expands the family group conferencing program.\n\n\"It speaks to a need to delegate authority to Aboriginal families and Aboriginal community-controlled organisations,\" Ms Hildyard said.\n\nRobert Simms says Greens have secured amendments that \"strengthen the reunification principle\". (ABC News: Che Chorley)\n\nMr Simms said the Greens have secured some amendments that \"strengthen the reunification principle\" and the importance of keeping families together where possible.\n\n\"While the bill wasn't perfect, it contained a number of provisions that will advance the best interests of children in our state. In particular, I secured some improvements to the bill that will keep families together where possible and further strengthen the best interests principle,\" he said.\n\nThe bill has previously faced criticisms from stakeholders in the sector, including from SA's Guardian for Children and Young People, Shona Reid, who said the reforms do not comply with United Nations conventions.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/asic-sues-westpac-rams-allegations-home-loan-misconduct/105374058",
        "title": "RAMS sued over allegations of dodgy home loans",
        "publish_date": "Tue, 03 Jun 2025 22:20:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Corporate regulator ASIC has sued RAMS, alleging it engaged in systemic misconduct when arranging home loans.\n\nThe Westpac-owned brand is facing the court action for failing to properly supervise staff who worked for its franchises, resulting in misconduct including submitting fake pay slips as part of mortgage applications, and altering customers' debts and expenses so they would meet loan serviceability requirements.\n\nHome loans based on dodgy documentation or exaggerated claims are known as \"liar loans\".\n\nASIC has accused RAMS of breaching its obligations under credit laws and engaging in \"widespread unlicensed conduct\" between June 2019 and April 2023.\n\nIn one instance, ASIC said \"a RAMS franchise employee was found to be involved in manufacturing a fake contract of sale for a home\".\n\nWestpac announced in August 2024 it would shut the RAMS brand to new home loan applications and absorb its existing loans into the broader group.\n\n\"This is a systemic organisational governance failure by RAMS who did not adequately supervise its franchise network,\" ASIC deputy chair Sarah Court said.\n\n\"RAMS allowed years of unlawful conduct to occur across its franchises, creating the opportunity for loans to be provided to customers who otherwise may not have qualified for those loans, and thereby increasing commissions earned by RAMS franchisees.\"\n\nWestpac closed RAMS to new home loan applications in August 2024 but retained the existing business. (Reuters: Tim Wimborne)\n\nThe regulator has also alleged that RAMS dealt with unlicensed referrers. The use of referrers to bring in home loan business was highlighted during the banking royal commission, with NAB's since-scrapped \"Introducer\" program coming under fire.\n\nASIC is seeking penalties from the proceedings.\n\nRAMS operated as a standalone business within Westpac, run by independent franchisees that wrote RAMS-branded home loans backed by Westpac.\n\nRAMS has admitted liability for the contraventions and remediated customers who were negatively affected by the misconduct.\n\nIn a statement, Westpac said RAMS would \"continue to work cooperatively with ASIC to resolve the proceedings as quickly as possible\".\n\nThe major bank expects that existing money set aside will be enough to cover any financial hit as a result of the proceedings.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/rules-on-isolating-with-covid-flu-work-social/105370556",
        "title": "Should you still isolate when you are sick with COVID or influenza?",
        "publish_date": "Tue, 03 Jun 2025 22:06:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "I don't know about you, but the times of having to quarantine due to COVID-19 feel like a distant memory.\n\nBut around this time each year, we're reminded that the virus is still active, as are many other serious respiratory illnesses during \"flu season\".\n\nThere have been more than 65,000 cases of COVID-19 so far this year nationwide, more than 81,000 Influenza cases and 50,000 cases of Respiratory Syncytial Virus (RSV), according to the Australian Respiratory Surveillance Report.\n\nThe World Health Organization (WHO) has also designated a new strain known as NB.1.8.1, which is now the dominant variant in China and Hong Kong, as a \"variant under monitoring\".\n\nSo, what has changed when it comes to quarantine rules? And do you still have to isolate if you or a family member has a respiratory illness?\n\nWhat are the rules for isolating?\n\nAdvanced epidemiologist Anne Maree Baldwin says we're in a different situation now than five years ago when COVID-19 first arrived in Australia.\n\n\"We had a new virus in a population without immunity, which was expected to have devastating impacts,\" says the public health expert from the Sunshine Coast/Kabi Kabi lands.\n\n\"But now all or almost all of the population has some immunity to COVID through vaccination and having the disease.\"\n\nWe are no longer required by law to quarantine or isolate when we have COVID-19.\n\nBut Ms Baldwin says it is recommended.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\n\"Stay home and away from others when you have symptoms, irrespective of whether it's COVID or another respiratory illness,\" she says.\n\n\"If you must go out, we ask people to wear a mask, avoid indoor or crowded situations, and keep away from others as best you can.\"\n\nDr Libby Sander says some employees feel obligated to go back to work when they're still sick.\n\nDr Libby Sander is an associate professor of organisational behaviour at Bond University on the Gold Coast/Kombumerri.\n\nShe says there has been a culture shift since the pandemic back to a place where some employees feel obligated to go back to work even if they're unwell.\n\n\"I'm often hearing [about instances] where people are being expected to go to work when they're sick because of staff shortages or they just feel obliged to go in because of the workload.\n\n\"If you are sick, you shouldn't go to work, no-one wants you to make them sick.\"\n\nShould I go to work if I was exposed to COVID or the flu but am not unwell?\n\nYou can be infectious with respiratory illness from up to 48 hours before your symptoms start.\n\nSo, if you've had a loved one or housemate at home who's been unwell, should you go to work?\n\nWhat you need to know about vaccinating your child against COVID this winter Photo shows A person inserts a needle into a dose of Pfizer vaccine. The US has recently dropped the COVID vaccine recommendation for healthy children and pregnant women. Here's what the Australian Technical Advisory Group on Immunisation says.\n\nMs Baldwin says it comes down to organisational policy.\n\n\"Just communicating first and foremost, so everyone's aware,\" she says.\n\n\"In general, quarantine isn't needed if exposed to COVID, we just ask that you stay away from others if you develop symptoms.\"\n\nShe says it's particularly important to avoid people more likely to get severely sick, including immunocompromised people, older people, infants, and pregnant women.\n\nDr Sander says working from home arrangements can provide people with security and flexibility.\n\n\"If you're not really unwell you can keep working, you're not worrying about infecting other people … so I think flexibility is really important.\"\n\nShould I get tested if I've been exposed to sickness?\n\nIn general, you don't automatically need to take a rapid antigen test (RAT) after being around someone who's been sick.\n\nBut it is recommended if you start developing symptoms or are planning on visiting a high-risk setting like aged care facilities, disability care, hospitals, or other healthcare settings.\n\nMs Baldwin says testing is important for people who are either very sick or need antiviral medicine.\n\nA Rapid Antigen Test (RAT) designed to test for both COVID-19 as well as influenza virus A and B. (ABC News: Abbey Haberecht)\n\n\"We have the RAT tests and they're widely available now in supermarkets and pharmacies, often for about $10,\" she says.\n\n\"Some can test for four viruses, Influenza strains A and B, COVID and RSV.\n\n\"The RATs are helpful for a quick result, which is important when the COVID and influenza antiviral should be started in a day or two of symptom onset.\"\n\nA diagnosis for whooping cough requires a PCR test (polymerase chain reaction) from a GP to receive the necessary antibiotics.\n\nChief medical officer at Healthdirect Australia, Nirvana Luckraj, says if you have tested positive for respiratory illness, \"you should stay at home until all of your acute symptoms have gone\".\n\nShe says acute symptoms include sneezing, coughing and a sore throat.\n\n\"If you still have acute symptoms like a cough after seven days, you may still be infectious. You should continue to wear a mask and physically distance whenever possible.\"\n\nHow can I prevent myself from getting sick?\n\nOur experts say it's important to prepare yourself each year.\n\n\"We see COVID waves and whooping cough at any time of the year and most RSV is actually at this time of year,\" Ms Baldwin says.\n\n\"So being prepared is important and the best way to do that is vaccinate.\"\n\nInfluenza vaccine — is free for certain groups, including children aged 6 months to less than 5 years, pregnant women, people aged 65 years and over, Aboriginal and Torres Strait Islander people aged 6 months and over, and people with specific medical conditions.\n\n— is free for certain groups, including children aged 6 months to less than 5 years, pregnant women, people aged 65 years and over, Aboriginal and Torres Strait Islander people aged 6 months and over, and people with specific medical conditions. COVID-19 vaccine — is free to all people in Australia, including those without a Medicare card.\n\n— is free to all people in Australia, including those without a Medicare card. The RSV vaccine — is free for pregnant women and infants.\n\n— is free for pregnant women and infants. Whooping cough vaccine — is free: through the national immunisation program for children aged 2 months, 4 months, 6 months, 18 months and 4 years; adolescents aged 12-13 years through school-based vaccination programs; and pregnant women (ideally between 20-32 weeks).\n\nYou can get both the COVID and influenza vaccines at the same appointment — the Australian Department of Health advises that it is safe to do this and doctors and pharmacists will now allow this.\n\nThis is general information only. For personal advice, you should see a qualified medical practitioner.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-06-04/tomato-brown-rugose-virus-strategy-change-queensland/105369702",
        "title": "Farmers urge gardeners to check tomato plants as virus plans scrapped",
        "publish_date": "Tue, 03 Jun 2025 22:02:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Queensland farmers are urging home gardeners planting tomatoes, chillies and capsicums to be vigilant over fears a highly contagious virus will spread.\n\nThe state is continuing to restrict the movement of seeds, plants and fruit, as well as machinery, equipment and packaging from areas affected by tomato brown rugose fruit virus (ToBRFV).\n\nFirst detected in South Australia last year, it has since been found on a farm in Victoria, but experts and industry have abandoned eradication efforts and will instead move to a management strategy.\n\nFarmers, fearing hundreds of millions of dollars in losses, are pleading with industry and home gardeners alike to hold the line.\n\nMovements limited\n\nThe virus is not harmful to humans, but causes brown or yellow spots to appear on leaves, fruit and stems of tomatoes, capsicums and chillies.\n\nThe infected fruit can ripen irregularly or be deformed.\n\nIt can reduce crop yields by 70 per cent, and there is no treatment or commercially available varieties of tomato that are resistant to the disease.\n\nActing Victorian chief plant health officer Stephen Dibley said efforts to rid Australia of the virus had failed.\n\n\"The biology of the virus makes it very hard to eradicate,\" Dr Dibley said.\n\n\" We found it in contained environments, which is why we undertook the eradication initially, but it has proved a challenge to actually remove all traces of the virus. \"\n\nTesting times for tomatoes Photo shows A man wearing a green jacket and hat holding tomatoes. Tomato growers placed into quarantine after the discovery of the tomato brown rugose virus say authorities should have been better prepared for the arrival of the virus.\n\nQueensland remains free of the virus, but Dr Dibley said there could be undetected cases.\n\n\"We have no evidence of it being elsewhere, but there are still just questions about the most recent detections,\" he said.\n\n\"We're still trying to understand where these new detections have come from.\"\n\nAs well as tomatoes, Queensland grows 66 per cent of the national capsicum crop and 90 per cent of the chilli crop.\n\nBiosecurity Queensland chief plant health manager Michael Reid said the movement control order was extended for three months on March 16.\n\nMichael Reid says movement controls for tomatoes remain in place. (Supplied)\n\n\"What's really important from a Queensland perspective is making sure that we protect those industries for as long as possible,\" he said.\n\nOnce it expired, Mr Reid said a team of experts would revisit the order to assess the risk to Queenslanders and production systems.\n\n\"We will be taking a risk-based approach to our regulation, making sure that we protect our industries,\" he said.\n\n'Wake-up call' to growers\n\nIn significant growing areas like Bundaberg, farmers are conducting voluntary in-field testing for peace of mind that their crops are virus-free.\n\nOver the past 10 months, farmer group Bundaberg Fruit and Vegetable Growers has held almost weekly biosecurity meetings to monitor where locals are sourcing their seedlings from.\n\nChief executive Bree Watson said the National Management Group's decision would change how farmers managed and monitored the virus.\n\nBree Watson says home gardeners play an important role in biosecurity. (ABC News: Johanna Marie)\n\n\"It shifts the responsibility for monitoring and containing it more onto industry and individual businesses than it does on government departments,\" Ms Watson said.\n\nShe urged home gardeners to take part in the biosecurity effort and learn what to look for in their own vegetable patches.\n\n\"It can be found in backyard gardens and a lot of people don't realise the huge risk that it can have to our commercial producers, which may be just down the road from them,\" she said.\n\n\"They should be checking their plants regularly for anything that's showing signs of disease.\"\n\nChillies are also susceptible to the disease. (ABC Rural: Marty McCarthy)\n\nMs Watson said it was especially important for home gardeners to make sure their seeds and seedlings came from reputable suppliers.\n\nDespite being far from the southern border, north Queensland's tomato-growing region around Bowen, south of Townsville, was on high alert.\n\n\"This tomato virus is a little humdinger,\" Bowen-Gumlu Growers Association president Carl Walker said.\n\n\"We've got hundreds of millions of dollars a year just in tomatoes alone in this region … it could seriously destroy the tomato industry across Australia if it's allowed to spread.\n\nCarl Walker says the virus would be devastating for Queensland farmers. (ABC Rural: Tom Major)\n\n\"It's a wake-up call for all growers to be very vigilant with their biosecurity because it can destroy our industry just, bang, like that.\n\n\"If we do get it, God help us … it's hundreds of millions of dollars' worth of production and thousands of jobs, which is not what our economy needs.\"\n\nExports remain blocked\n\nWhile the state has yet to contend with an outbreak, the virus is already causing losses.\n\nNew Zealand suspended imports from all Australian states apart from Queensland when the virus was detected in South Australia.\n\nTomato and capsicum seeds from Australia must also be tested before they arrive.\n\nCapsicums and chillies are also included in Queensland's movement control order. (ABC Rural: Andrew Chounding)\n\nIn 2023, Australia sent more than 530,000 kilograms of tomatoes to New Zealand.\n\nWhile exports account for only a small portion of sales compared to the $500 million domestic market, Ms Watson said it was a vital avenue for growers who had access to it.\n\n\"We need to make sure they've got a few options on the table of different customers that they can sell to,\" she said.\n\nIn a statement, New Zealand's Ministry for Primary Industries said: \"We are closely monitoring the situation in Australia and if there is any significant change in distribution, or which crops it (ToBRFV) is affecting, we will review the current import rules.\"\n\n\"Although Australia has announced they will no longer be pursuing eradication, all of the controls that have been in place to limit spread of the virus remain.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/french-open-sabalenka-swiatek-musetti-alcaraz/105373844",
        "title": "Sabalenka wants 'equal treatment' over scheduling of French Open women's matches",
        "publish_date": "Tue, 03 Jun 2025 21:42:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "Aryna Sabalenka is the top-ranked player in women's tennis.\n\nYet even that status did not spare her from competing in front of empty seats at Roland-Garros.\n\nThe three-time major singles champion faced China's Zheng Qinwen in the first quarterfinal match on Tuesday, beginning at 11am (local time) on Court Philippe-Chatrier.\n\nWhen play began, large sections of the 15,000-seat stadium were still unoccupied.\n\nIt is a common sight in the early hours at the French Open, when many ticket holders opt for lunch or arrive later in the day.\n\n\"It was a big match and probably would make more sense to put us a little bit later just so more people could watch it,\" Sabalenka said after her 7-6 (7/3), 6-3 win.\n\n\"I definitely think that would make more sense to kind of like move our match for a little bit later.\"\n\nAryna Sabalenka played in front of a sparse crowd in her quarterfinal against Zheng Qinwen. (Getty Images: Robert Prange)\n\nBut scheduling more night sessions for women is proving a tough issue to resolve for French Open tournament director Amélie Mauresmo.\n\nSince the introduction of night sessions in 2021, only four women's singles matches have been featured in that marquee time slot.\n\nSerena Williams played in the first night match at Roland-Garros, but pandemic restrictions meant the stands were empty.\n\nNo women's matches have been scheduled for the evening session this year, which Sabalenka said needed to be changed.\n\nAsked about her views on the fact that women have not played a single night match this year, the Belarusian said they deserved \"equal treatment.\"\n\n\"There was a lot of … great battles, a lot of great matches which would be cool to see as night sessions,\" Sabalenka said.\n\n\"Just more people in the stands watching these incredible battles. And just to show ourselves to more people. I definitely agree that we deserve to be put on a bigger stage. Like better timing, more people watching.\"\n\nSabalenka plays defending champion and fifth seed Iga Świątek in the semifinals.\n\nŚwiątek, chasing a fifth French Open title, defeated 13th seed Elina Svitolina of Ukraine 6-1, 7-5.\n\nMusetti's ball abuse labelled 'comical'\n\nAmerican Francis Tiafoe said tennis rules lacked consistency after Lorenzo Musetti escaped punishment for kicking a ball that struck a line official in his quarterfinal victory.\n\nThe incident occurred in the second set of their match when Musetti was given balls to serve.\n\nThe Italian kicked one with his left leg and inadvertently hit a line judge, who barely flinched even though she was hit on her upper body.\n\nLorenzo Musetti avoided further punishment after kicking a ball during his quarterfinal with Frances Tiafoe. (Getty Images: Adam Pretty)\n\nMusetti apologised and was immediately given a warning for unsportsmanlike conduct by the chair umpire.\n\nBut he was not defaulted and the incident drew comparisons to another involving Novak Djokovic at the 2020 US Open.\n\nA petulant swipe at the ball after having his serve broken brought an end to Djokovic's campaign in New York five years ago after he struck a line judge in the throat.\n\n\"Obviously he [Musetti] did that and nothing happened,\" Tiafoe told reporters after his 6-2, 4-6, 7-5, 6-2 defeat.\n\n\"I think that's comical, but it is what it is. Nothing happened, so there's nothing really to talk about.\n\n\"Obviously, it's not consistent, so it is what it is.\"\n\nMusetti said it was an \"unlucky coincidence\".\n\n\"I immediately went to the line umpire, and I of course said sorry, I apologised to everyone,\" Musetti said.\n\n\"It was right to have a warning, but I think the umpire saw that there was no intention about that, and that's why probably just let me continue my game.\"\n\nMusetti will next face defending champion Carlos Alcaraz, who advanced to the semifinals via a 6-0, 6-1, 6-4 victory over 12th seed Tommy Paul.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-04/ipl-final-royal-challengers-bengaluru-defeat-punjab-kings/105373920",
        "title": "Indian legend in tears as Bengaluru finally break IPL hoodoo",
        "publish_date": "Tue, 03 Jun 2025 21:40:59 +0000",
        "category": "sports",
        "authors": [],
        "text": "Royal Challengers Bengaluru have earned their first Indian Premier League title by beating Ricky Ponting's Punjab Kings by six runs overnight.\n\nBengaluru finished runners-up in 2009, 2011 and 2016, but finally won at the Narendra Modi Stadium — thanks largely to Krunal Pandya's sensational spell of 2-17 in four overs.\n\nVirat Kohli shed tears as Bengaluru clinched victory to conclude the 18th season of the world's most popular T20 tournament.\n\n\"This win is as much for the fans as it is for the team. It has been 18 long years,\" said Kohli, who has been associated with Bengaluru since the inaugural edition in 2008.\n\n\"I have given my youth, my prime. I gave it everything I have — I never thought this day would come. I was overcome with emotion as soon as the last ball was bowled.\"\n\nKohli top-scored for Bengaluru with 43 runs off 35 balls to help put up 9-190 in 20 overs. Punjab pacers Arshdeep Singh (3-40) and Kyle Jamieson (3-48) shared six wickets between them.\n\nPunjab's reply stuttered after a good start and, despite a consolation half-century from Shashank Singh, it fell short and finished with 7-184 (20 overs).\n\nPut into bat, Bengaluru lost Phil Salt for 16 runs. It slowed down Kohli, who only hit three fours in an uncharacteristic knock. The Indian batting star finished with 700 runs in 16 matches this season — third in the highest run-scorers' list.\n\nKohli put on vital partnerships with Mayank Agarwal (24) and skipper Rajat Patidar (26) as their cameos kept the scorecard ticking along.\n\nAzmatullah Omarzai got the vital wicket and sent Kohli back to the sheds, while Jamieson picked up his second by trapping Patidar lbw.\n\nJitesh Sharma then provided the acceleration — hitting two sixes and two fours to score 24 off 10 balls, while Liam Livingstone also hit two sixes in 25 off 15 balls.\n\nFrom 4-131 in 14.5 overs, it was just enough to push Bengaluru past 190.\n\nVirat Kohli kisses the IPL trophy as the team celebrates its drought-breaking victory.\n\nIn reply, Punjab started well as Priyansh Arya (24) and Prabhsimran Singh (26) put on 43 off 30 balls.\n\nPhil Salt took a smart catch hopping across the boundary to send back Arya and then Pandya struck after the powerplay.\n\nFirst he sent back Prabhsimran, who was crawling despite a dropped catch earlier on.\n\nThe turning point came in the 10th over as Shreyas Iyer was caught behind for one off Romario Shepherd.\n\nAustralia's Josh Inglis scored 39 off 23 balls, including four sixes, but he holed out off Pandya in the 13th over in another body blow for the Kings' chase.\n\nFellow Australian Josh Hazlewood struggled, taking 1-54 from his four overs, but he defended the 29 needed from his final over.\n\nShashank Singh stayed put, scoring 61 not out off 30 balls, including six sixes but it only reduced the margin of victory.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/it-gave-me-hope-how-a-single-ai-session-put-kelly-on-a-path-to-eating-disorder-recovery-20250526-p5m280.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It gave me hope’: How a single AI session put Kelly on a path to eating disorder recovery",
        "publish_date": "Wed, 04 Jun 2025 12:02:56 +1000",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "“We know that if you leave people waiting for treatment, they are less likely to take up the opportunity of treatment when it’s presented to them, and also that their symptoms can deteriorate,” she says. There is no official data in Australia on the length or number of people on waitlists, but a 2020 report from The Butterfly Foundation identified waiting times as a key issue for respondents. Helplines, such as the Butterfly Foundation’s free national helpline, have long helped fill this gap for eating disorder patients. But Sharp says the prospect of calling someone can be daunting for some patients. “Some people really love helplines. But there are other people who would never choose to use a helpline. It’s about giving them an option for engaging with treatment that we know is evidence-based and effective,” she says. ESSI provided one 30-minute session to 60 patients around Australia on waitlists for eating disorder treatment. The chatbot is not designed to replace treatment for patients, but to provide interim support while they wait for care. The information discussed by the patient with the chatbot is then passed on to the patient’s clinician.\n\nWhile one half-hour session may not seem like much, Sharp says it can still have a powerful effect. “Single Session Interventions are considered a newer innovation, particularly in mental health care, showing that even a small dose of therapy can be very beneficial and start to change some of those unhelpful thoughts and behaviours,” she says. A screenshot from the Eating Disorder Electronic Single-Session Intervention chatbot developed by Professor Gemma Sharp. Credit: Courtesy of Professor Gemma Sharp Sharp’s team recorded participants’ experiences at four points – before using the chatbot, after 72 hours, after one month and after three months. The results of the randomised controlled trial were published late last month in the Journal of Medical Internet Research. Almost 100 per cent of patients who used the chatbot went on to start treatment, and had significantly improved outcomes like reduced eating disorder symptoms, depression and anxiety at one and three months.\n\nThe trial’s 12-month results, which are yet to be published, followed a similar trajectory according to Sharp. For Kelly, her experience with ESSI almost two years ago, helped her feel seen for the first time, and set her on the path to recovery. “It was me almost like talking to myself and figuring stuff out by myself, but with some tools, and there wasn’t any judgment,” she says. The chatbot also helped lead her to an autism diagnosis, which she says is connected to some of her sensory food issues and ARFID diagnosis. When she was finally able to see her clinician, they had all the information they needed to treat her. “To be finally validated, I think that was the biggest thing for me... it was being able to see my own words reflected back to me, and then to go into a session and actually be heard and seen for who I am,” she says.\n\nProfessor Gemma Sharpe. Credit: Ben Searcy While the study was relatively small, it joins a growing body of international research on the potential uses of artificial intelligence in supporting eating disorder diagnosis, treatment and recovery. Loading Dr Sarah Barakat, a postdoctoral research associate at the InsideOut Institute for Eating Disorders, who was not involved in the study, says Sharp’s findings are in line with her own research into digital interventions. “There is a real role for these technologies, and they can be really helpful, particularly in a space like eating disorders where there’s quite a lot of shame and ambivalence around seeking help,” she says.\n\nWhile she emphasises that chatbots like ESSI need to be integrated with human-led care, such technologies can help eliminate certain biases clinicians may hold in the pre-screening stage. “It is a problem in the healthcare system that clinicians don’t receive enough training around how to screen and treat eating disorders.” “And that means that particularly for people who struggle with binge-eating disorders, who might be in normal or larger bodies, thinking to screen those people for an eating disorder is quite uncommon.” Then there are ethical concerns that can arise from using AI in healthcare. In 2023, a chatbot promoted by the United States’ National Eating Disorders Association sparked concern about the use of AI when it offered dieting advice to a patient.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/victoria/erin-patterson-trial-live-mushroom-cook-returns-to-witness-box-for-a-third-day-to-give-evidence-on-fatal-beef-wellington-lunch-20250603-p5m4mw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Erin Patterson murder trial LIVE: How childhood memories inspired the centrepiece dish; Inside Patterson’s kitchen on the day of the deadly mushroom meal",
        "publish_date": "Wed, 04 Jun 2025 12:02:40 +1000",
        "category": "finance",
        "authors": [
            "Marta Pascual Juanola",
            "Erin Pearson"
        ],
        "text": "Erin Patterson said she started preparing the meal on Friday, the day before the beef Wellington lunch, by salting the meat steaks to try to get some juices out of them. Sometimes, she said, she’d Google cooking tips as she wouldn’t “stuff it up”.\n\nOn Saturday, she started on the mushroom duxelles (a French culinary term for a mushroom-style mince). She wanted to get to it quite early, since it would take a while.\n\n“I fired the garlic and chopped shallots,” she said.\n\nPatterson said she chopped up two little tubs of mushrooms from Woolworths before cooking them down on low heat for about 45 minutes. “I cooked that for a very long time,” she said. “You’ve got to get almost all of the water out.”\n\nPatterson said that as she was cooking the duxelles down, she tasted it a few times, but it tasted a bit bland, so she decided to add the mushrooms she had bought from the grocer in Melbourne to the mixture she still had in her pantry.\n\n“I roughly poured water over them to get the crispness out of them. I chopped them up and sprinkled them over the duxelles and pushed them in,” she said.\n\nPatterson said that at that time, she believed the container just had the mushrooms she had bought from Melbourne.\n\n“Now I think that there was a possibility that there were foraged ones in there as well,” she said.\n\nAfter making the duxelles in the pan, Patterson used an egg flip to transfer it to an oven tray to put it in the fridge for a little while, and fried the steaks on each side and let them rest.\n\n“I then started the process of putting the Wellingtons together,” she said.\n\nPatterson said that after frying the steaks and letting them cool, she used the egg flip to lift some of the duxelles.\n\nShe then wrapped each one in filo pastry and then beef pastry. “I made six,” she said.\n\n“At the appropriate time, I put them in the oven.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/snow-dump-forecast-for-slopes-as-cold-snap-to-hit-victoria-20250604-p5m4qt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Snow dump forecast for slopes as cold snap to hit Victoria",
        "publish_date": "Wed, 04 Jun 2025 12:02:18 +1000",
        "category": "sports",
        "authors": [
            "Alexander Darling"
        ],
        "text": "Victoria’s ski slopes will officially open this weekend for the start of snow season, but the Bureau of Meteorology says the conditions won’t necessarily be ideal for skiing.\n\nSnow will be possible over alpine areas on Wednesday, but bureau community information officer Patch Clapp said snowfall would really kick off from Friday.\n\nA jogger runs with her dog at Carlton’s Princes Park on the first day of winter. Credit: Chris Hopkins\n\n“Over the course of Friday to Tuesday, at least 20 to 30 centimetres of snow should accumulate at the alpine resorts for the first weekend of the snow season, with snow possible generally every day from Friday to Tuesday,” he said.\n\n“Weather conditions over the weekend will not be great for snow sports. Successive cold fronts and a low-pressure system will lead to a wet and windy long weekend.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-footy-kiss-that-said-everything-about-an-afl-warrior-20250604-p5m4u8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The footy kiss that said everything about an AFL warrior",
        "publish_date": "Wed, 04 Jun 2025 12:00:49 +1000",
        "category": "sports",
        "authors": [
            "Bob Murphy"
        ],
        "text": "On Sundays, I’ve started running laps of a footy oval across town. The first time was three weeks ago and I’ve returned every Sunday since. It’s become a ritual of sorts, somewhere between a meditation and purge.\n\nLast Sunday, at the completion of this physical prayer, I crouched down, knees pointed outward, elbows on my knees and eyes looking straight down, my heaving breath the only sound. I was reminded of an old footy myth.\n\nI’d heard that the great Stephen Kernahan believed that there was a single stretch (very similar to this crouch position I was in) that took care of everything a footballer needed. Groin, lower back, quadriceps and calves. Frozen in position, I was reminded of my pure love for such things in footy.\n\nWas the story true? Doesn’t matter, I live for these little pieces of footy folklore.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/kristy-thought-this-virus-was-mild-then-her-baby-ended-up-in-hospital-20250602-p5m483.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kristy thought this virus was mild. Then her baby ended up in hospital",
        "publish_date": "Wed, 04 Jun 2025 12:00:08 +1000",
        "category": "lifestyle",
        "authors": [
            "Angus Thomson"
        ],
        "text": "Thousands of babies are heading into winter without full protection against RSV despite mounting evidence that free immunisations have led to fewer children ending up in hospital with the common but occasionally severe illness.\n\nOnly 15 per cent of babies under eight months had received an RSV immunisation, data from the Australian Immunisation Registry shows. In NSW and Victoria, the coverage rates are significantly lower.\n\nKristy Gatt with son Blake, who was hospitalised with RSV after missing the window for free immunisation. Credit: Wolter Peeters\n\nWomen between 28 and 38 weeks pregnant and newborn babies are now eligible for free respiratory syncytial virus (RSV) immunisations after the rollout of federal and state government schemes earlier this year.\n\nAll states and territories now offer nirsevimab, an injection containing ready-made antibodies to fight RSV, to eligible babies born this year.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-s-stupid-obsession-will-unleash-pain-on-america-20250604-p5m4rz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s stupid obsession will unleash pain on America",
        "publish_date": "Wed, 04 Jun 2025 11:59:24 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Canada, which achieved GDP growth of 1.5 per cent last year, is expected to post growth of only 1 per cent this year and something similar in 2026. Mexico, after also growing its economy 1.5 per ent last year, is expected to slow to 0.4 per cent growth this year before recovering somewhat to a growth rate of 1.1 per cent in 2026. Australia, which had GDP growth of 1.1 per cent last year, has forecast growth of 1.8 per cent this year and 2.2 per cent in 2026. Xi Jinping has led a sophisticated response from China to Trump’s tariffs. Credit: AP The prime target of the US assault on global trade, China, is expected to be affected negatively, but to a significantly lesser extent than the US. Its economy grew 5 per cent last year, is expected to slow to 4.7 per cent growth this year and 4.3 per cent in 2026. In other words, China is expected to lose about 70 basis points of growth over two years, but the US 130 basis points.\n\nLoading There is uncertainty surrounding what the eventual outcome on tariffs might be, but it is near-certain that the current settings are only a baseline case and that, with Trump determined to implement his tariffs one way or another, the likely outcome will be more damaging to global trade and growth - and to the US and other economies - than the OECD numbers suggest. There’s also uncertainty relating to retaliatory measures by those countries hit by Trump’s tariffs. The European Union, which responded to the steel and aluminium tariffs (where the 50 per cent rate cuts in today) with retaliatory tariffs of its own, has a long and lengthening list of prospective US targets for more tariffs if Trump imposes reciprocal tariffs on top of the baseline 10 per cent duties. China and the US agreed to a pause in their trade confrontation that left the US reducing its tariffs on imports from China from 145 per cent to 30 per cent and China its retaliatory tariffs from 125 per cent to 10 per cent.\n\nMore threatening than China’s tariffs, however, are its controls over exports of rare earths and rare earth magnets, where it dominates the global supply chains. It has effectively shut down almost all exports of the strategic metals, which are essential for the manufacturing of automobiles, aeroplanes, semiconductors, robots, wind turbines and a host of other advanced manufactures, including military hardware. That, if it continues, will be highly disruptive to global supply chains and highly damaging to advanced economies, most particularly the US economy. Last month a Ford plant in the US had to cease operations because of a shortage of rare earth magnets. That’s a small preview of what might be to come for US manufacturers if their administration continues its ill-conceived crusade against global trade.\n\nChina’s asymmetric response to the Trump tariffs reflects the sophistication of its response. Employing its near-monopoly over rare earths does minimal damage to China’s economy but could bring US advanced manufacturing to a standstill. It would take years, probably decades, for the US to develop sufficient alternative sources of supply to eliminate its dependence on China for those specialised metals. The OECD’s forecasts are likely to prove conservative. Other economies being threatened with punitive reciprocal tariffs unless they reduce trade barriers, remake their tax systems and succumb to Trump’s directives on their social policies will no doubt be looking for asymmetrical responses of their own. The EU, for instance, is eyeing off the big US tech and social media companies. In normal circumstances, the abrupt slowdown in US growth depicted by the OECD would produce a response from the Federal Reserve Board.\n\nConfronted by such a rapid and significant loss of economic momentum, the Fed would cut interest rates and, if the outlook were deemed significantly dire, restart its quantitative easing program, buying bonds and other securities to suppress market interest rates and pump liquidity and credit into the financial system. Loading The OECD, however, is forecasting a US inflation rate that will rise from its current level of around 2.3 per cent to 3.9 per cent by the end of this year, before falling back next year as the economy slows. If that were to transpire, the Fed won’t be cutting US rates this year and might well be raising them. Having been burned by the surge in post-pandemic inflation, which it thought was transient, it won’t risk making the same mistake again, which may well exacerbate the extent of the US slowdown. The OECD’s forecasts underscore that this remarkably stupid trade war, initiated by a president who doesn’t understand trade and whose policymaking appears uninformed by any serious analysis of the consequences, will do significant damage to the global economy for no near-term economic gain but plenty of economic pain for the economy that has initiated it.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/post-and-boast-video-showing-car-chase-20250604-p5m4vj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Post-and-boast video showing car chase",
        "publish_date": "Wed, 04 Jun 2025 11:52:17 +1000",
        "category": "finance",
        "authors": [],
        "text": "Post-and-boast video showing car chase\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/i-view-things-differently-now-the-socceroos-next-big-thing-is-back-and-even-better-than-before-20250531-p5m3r7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I view things differently now’: The Socceroos’ next big thing is back, and even better than before",
        "publish_date": "Wed, 04 Jun 2025 11:44:17 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "“I don’t take things for granted. Even a single training session, I grab it with both hands. I have worked on many muscle groups which I didn’t really think were so important. I worked on and understood how my body works even better than before. I made new friends, and I started watching basketball twice a week, watching the EuroLeague. So it was actually good fun. “If I had to decide, I would not get injured, but getting injured, at least I made it worthwhile. You’ve got to take it on the chin, focus on yourself, become a better athlete – which I think I’ve become.” Alessandro Circati. Credit: Getty Images When Circati began on his road to recovery, the staff at the rehab centre he attended in Bologna asked him: what’s your goal? His answer was twofold: make it back onto the pitch before the end of the Serie A season, and be fit for the Socceroos’ crucial June window to help them clinch World Cup qualification. That was doubly important because Thursday night’s clash with Japan – in which a win would seal a spot at the 2026 World Cup for Australia – is at Optus Stadium in Perth, his hometown. Though he wasn’t born there, that’s where he grew up; his father Gianfranco moved to Perth in 1998 to play for the Glory in the old National Soccer League, and while he only spent a season with them, he loved it so much he migrated permanently eight years later.\n\nCircati has ticked both boxes. At club level, his return was initially being handled with caution, with the 22-year-old an unused substitute for six games once he was deemed fit enough to make a match-day squad – until a string of results below them on the Serie A table put Parma at heightened relegation risk, forcing them to break glass in case of emergency for their final two fixtures, and bring in a player who has been dubbed “the wall of Parma” by Italian media. ‘My dream was to play in Serie A, but I don’t feel like I’ve done it yet.’ Alessandro Circati “That’s when things started to change,” Circati said. “The coach came up to me, and he goes, ‘How much are you able to play?’”\n\nBoth games were pivotal, and Circati was pivotal in them. Against Napoli, he drew a foul deep in stoppage time from Giovanni Simeone which saw a penalty awarded against Parma in the same passage of play overturned. It finished 0-0, meaning the eventual Italian champions had to wait to be crowned. “It’s also worse when they celebrate in your home stadium, so that’s what we didn’t want,” Circati said. “It felt good to deny them.” Alessandro Circati celebrates Parma’s safety after a 3-2 comeback win away to Atalanta. Credit: Getty Images In Parma’s final game, away to Atalanta, was more “hectic”, in his words. Stung by two counter-attacking goals despite largely controlling the game, Parma were 2-0 down at half-time, and needed a draw from the match to confirm their safety in the top league. “We went into the change rooms at half-time … we looked at ourselves in the eyes, and we said we’re gonna come back,” he said.\n\n“Two goals, very doable. We went out, we took it goal by goal. We weren’t too worked up. The first one led to the second, and then the second led to the third, and then there you go. It’s probably the best comeback I’ve actually been a part of in my life in football. I’ve never come back from 2-0 down and won 3-2. Big satisfaction.” His deployment was a vote of major confidence from manager Cristian Chivu, who replaced Fabio Pecchia – the coach who oversaw Circati’s first-team integration as they won Serie B last season – in February. “When the coach changed, obviously, it gives you a bit of self-doubt,” Circati said. “He doesn’t know who you are, I’m out until the back end of the season … but hats off to Chivu because he knew who I was, he watched previous games, and he welcomed me with two arms open.” Pecchia had handed Circati a start in Parma’s first four games of the season, before he went down with the ACL – the highlight of which was a 2-1 win at home over another Italian giant, AC Milan. That’s the team his family supports. “I had my uncle in the grandstand with an AC Milan scarf on,” he said. “I flipped him off. When the final whistle blew, it was one of my happiest moments to this day. Huge sense of relief, where we can belong – we belong in that league.”\n\nThe Socceroos also changed coach during Circati’s injury lay-off, but to one he was familiar with: Tony Popovic (and his assistant Hayden Foxe) was at Perth Glory when he was a youth player before he departed for Italy. Popovic’s initial plan was to leave him out for this squad – Circati would have checked into camp anyway and watched the Japan game from the stands on his off-season trip home – but given how good he looked for Parma, it was a no-brainer to bring him in and stiffen up his back three, which is weakened in the absence of Harry Souttar and Hayden Matthews through injury. Alessandro Circati. Credit: SMH There is huge transfer interest in Circati from Juventus and Napoli, as well as clubs in the English Premier League, but he is happy at Parma, and happier still that he is such a big part of their plans. “It’s better to be wanted than unwanted,” he said.\n\n“Obviously, it’s great hearing big clubs want you, and that Parma aren’t really willing to sell you, the president doesn’t want to sell. It’s a good situation, you feel like you’re wanted. This season coming, I can almost say I’ll be 100 per cent playing at Parma because I just think that’s the right decision to do at this point, just to be able to play a whole season. Loading “My dream was to play in Serie A, but I don’t feel like I’ve done it yet. I want to play a whole season, lots of games, enjoy it. For me, it was even a bigger motivator to stay up.” But that’s for next season. Top of his footballing bucket list right now is to help the Socceroos get to the 2026 World Cup, and then play a big role in it. “It’s that simple,” he said. “It’s a big ambition, a big dream, but that is my goal.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-canavan-says-no-way-in-hell-nationals-will-back-labor-s-super-tax-musk-labels-trump-s-tax-spending-bill-a-disgusting-abomination-20250604-p5m4qd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Economy grows by 0.2 per cent; Tasmania debates no-confidence motion of Rockliff; Ley urges US to grant Australia an exemption to Trump’s metal tariffs",
        "publish_date": "Wed, 04 Jun 2025 11:43:52 +1000",
        "category": "finance",
        "authors": [
            "Cindy Yin",
            "Alexander Darling"
        ],
        "text": "The Australian economy rose 0.2 per cent in the March quarter, according to new figures released by the Australian Bureau of Statistics on Wednesday.\n\nThat’s the slowest pace since the three months to June last year - and below consensus expectations for 0.3 per cent growth.\n\nTreasurer Jim Chalmers. Credit: AAP\n\nAt the same time, the amount of income Australians have been saving compared to spending has increased from 3.9 per cent to 5.2.\n\nIn the past 12 months, the growth has been 1.3 per cent.\n\n“The private sector recovery we have planned and prepared for is gradually taking hold,” said treasurer Jim Chalmers in a statement.\n\nExtreme weather events dampened demand and weighed down exports, although household spending - which accounts for more than half of the country’s economic growth - continued to grow at 0.4 per cent.\n\nThis was driven by an uptick in spending on essentials including utilities during the warmer than average summer and food as Queensland households stockpiled in preparation for Ex-Tropical Cyclone Alfred.\n\nHowever, data yesterday revealed government spending and net trade - other key components of GDP - also slipped, detracting from economic growth. ’\n\nHousehold spending on discretionary items was also relatively slow following a stronger than usual retail sale period during the Christmas season.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/put-back-in-their-place-cummins-and-australia-brace-themselves-for-lord-s-return-20250604-p5m4sh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Put back in their place’: Cummins and Australia brace themselves for Lord’s return",
        "publish_date": "Wed, 04 Jun 2025 11:43:41 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Test captain Pat Cummins and Cricket Australia boss Todd Greenberg are confident Australia’s players won’t face a repeat of the ugly scenes that marred their last Test Match at Lord’s, as the team prepares for its return to the iconic venue.\n\nThe World Test Championship final against South Africa, which starts next Wednesday, will mark Australia’s first red-ball match at Lord’s since the infamous 2023 Ashes clash when Alex Carey’s stumping of Jonny Bairstow on the final day triggered outrage from some MCC members.\n\nThree Marylebone Cricket Club members were sanctioned – one banned for life and two others suspended – after Usman Khawaja and several teammates were verbally abused in the Long Room as they walked from the field. Temper also flared in the stands.\n\nDespite the ugly scenes on that day, Greenberg, who will attend the match in London, said the team felt no unease about returning.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/fonua-blake-backs-origin-eligibility-rules-even-though-they-cost-him-20250603-p5m4e3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fonua-Blake backs Origin eligibility rules, even though they cost him",
        "publish_date": "Wed, 04 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "Cronulla enforcer Addin Fonua-Blake admits he is “jealous” of players chosen for State of Origin but has unselfishly declared the rules that have rendered him ineligible for interstate rugby league should remain as they are.\n\nFonua-Blake was born in Sydney and played his junior football with Mascot Jets but effectively ruled himself out of Origin contention in 2017, when he accepted a position in New Zealand’s World Cup squad.\n\nHe made a lone Test appearance for the Kiwis at that tournament, coming off the bench in a 74-6 demolition of Scotland, and has since switched his allegiance to Tonga, whom he captained at the Pacific Championships last year.\n\nIf not for his brief association with New Zealand – a tier-one nation – Fonua-Blake would in all likelihood have represented the NSW Blues and quite possibly established himself as an Origin regular.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/two-chinese-citizens-accused-of-smuggling-a-dangerous-fungus-into-the-us-20250604-p5m4v9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Two Chinese citizens accused of smuggling a dangerous fungus into the US",
        "publish_date": "Wed, 04 Jun 2025 11:30:08 +1000",
        "category": "finance",
        "authors": [],
        "text": "Two Chinese citizens accused of smuggling a dangerous fungus into the US\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-as-wall-street-moves-higher-a-slips-20250604-p5m4py.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX a sea of green after Wall Street gets jobs boost",
        "publish_date": "Wed, 04 Jun 2025 11:27:12 +1000",
        "category": "finance",
        "authors": [
            "Staff Reporters"
        ],
        "text": "The Australian sharemarket has opened higher after a solid lead from Wall Street, with gains across the board.\n\nThe S&P/ASX200 added 52.20 points, or 0.6 per cent, to 8518.90 as of 10.59am AEST, with all 11 industry sectors in the green, led by materials and energy stocks.\n\nThe Australian dollar retreated overnight. It was 0.1 per cent lower at 64.54 US cents at 11am.\n\nWall Street gained across the board, setting the scene for the local sharemarket. Credit: AP\n\nMining stocks were stronger, with BHP adding 1.1 per cent, Fortescue rising 1 per cent and Rio Tinto up 0.4 per cent, rebounding from their wobbles on Tuesday. Energy stocks moved higher once again as oil prices strengthened by more than 1 per cent overnight. Woodside Energy jumped 2.6 per cent, Ampol gained 1.3 per cent and Santos rose 1.1 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/natural-short-sleeper-or-sleep-deprived-why-some-people-need-less-shuteye-than-others/5rcdh9pbs",
        "title": "Natural short sleeper or sleep deprived? Why some people need less shut-eye than others",
        "publish_date": "Tue, 3 Jun 2025 20:01:58 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Have you ever noticed how some people bounce out of bed after just a few hours of sleep, while others can barely function without a solid eight hours?\n\n\n\n\n\nTake Margaret Thatcher, for example. The former British prime minister was known for sleeping just four hours a night.\n\n\n\n\n\nShe worked late, rose early, and seemed to thrive on little sleep.\n\n\n\n\n\nBut for most of us, that kind of sleep schedule would be disastrous.\n\n\n\n\n\nWe'd be groggy, unfocused, and reaching for sugary snacks and caffeinated drinks by mid-morning.\n\n\n\n\n\nSo why do some people seem to need less sleep than others?\n\n\n\nIt's a question that has fascinated scientists for years. Here's what we know.\n\n\n\nNatural short sleepers\n\nThere is a small group of people who don't need much sleep. We call them natural short sleepers.\n\n\n\n\n\nThey can function perfectly well on just four to six hours of sleep each night, often for their entire lives.\n\n\n\n\n\nGenerally, they don't feel tired, they don't nap, and they don't suffer the usual negative consequences of sleep deprivation.\n\n\n\n\n\nScientists call this the natural short sleep phenotype — a biological trait that allows people to get all the benefits of sleep in less time.\n\n\n\nIn 2010, researchers discovered genetic mutations that help explain this phenomenon.\n\n\n\n\n\nNatural short sleepers carry rare variants in certain genes, which seem to make their sleep more efficient.\n\n\n\n\n\nMore recently, a 2025 study assessed a woman in her 70s with one of these rare mutations.\n\n\n\n\n\nDespite sleeping just six hours a night for most of her life, she remained physically healthy, mentally sharp, and led a full, active life.\n\n\n\n\n\nHer body, it seems, was simply wired to need less sleep.\n\n\n\n\n\nWe're still learning about how common these genetic mutations are and why they occur.\n\n\n\nNot everyone who sleeps less is a natural short sleeper\n\nBut here's the catch: most people who think they're natural short sleepers aren't.\n\n\n\n\n\nThey're just chronically sleep-deprived.\n\n\n\n\n\nOften, their short sleep is due to long work hours, social commitments, or a belief sleeping less is a sign of strength or productivity.\n\n\n\nFor the average person, it's not sustainable to only get a few hours sleep a night. Source: Getty / Carol Yepes In today's hustle culture, it's common to hear people boast about getting by on only a few hours of sleep.\n\n\n\n\n\nBut for the average person, that's not sustainable.\n\n\n\n\n\nThe effects of short sleep build up over time, creating what’s known as a 'sleep debt'.\n\n\n\n\n\nThis can lead to poor concentration, mood swings, micro-sleeps (brief lapses into sleep), reduced performance and even long-term health risks.\n\n\n\n\n\nFor example, short sleep has been linked to an increased risk of obesity, diabetes, high blood pressure and cardiovascular disease (heart disease and stroke).\n\n\n\nThe weekend catch-up dilemma\n\nTo make up for lost sleep during the week, many people try to 'catch up' on weekends.\n\n\n\n\n\nThis can help repay some of the sleep debt that has accumulated in the short term.\n\n\n\n\n\nResearch suggests getting one to two extra hours of sleep on the weekend or taking naps when possible may help reduce the negative effects of short sleep.\n\n\n\n\n\nHowever, it's not a perfect fix. Weekend catch-up sleep and naps may not fully resolve sleep debt. The topic remains one of ongoing scientific debate.\n\n\n\n\n\nA recent large study suggested weekend catch-up sleep may not offset the cardiovascular risks associated with chronic short sleep.\n\n\n\nREAD MORE Is it harmful to look at your phone first thing in the morning?\n\nWhat's more, large swings in sleep timing can disrupt your body's internal clock, and sleeping in too much on weekends may make it harder to fall asleep on Sunday night, which can mean starting the working week less rested.\n\n\n\n\n\nIncreasing evidence indicates repeated cycles of irregular sleep may have an important influence on general health and the risk of early death, potentially even more so than how long we sleep for.\n\n\n\n\n\nUltimately, while moderate catch-up sleep might offer some benefits, it's no substitute for consistent, high-quality sleep throughout the week.\n\n\n\n\n\nThat said, maintaining such regularity can be particularly challenging for people with non-traditional schedules, such as shift workers.\n\n\n\nSo, was Thatcher a true natural short sleeper?\n\nIt's hard to say. Some reports suggest she napped during the day in the back of a car between meetings. That could mean she was simply sleep-deprived and compensating for an accumulated sleep debt when she could.\n\n\n\nSeparate from whether someone is a natural short sleeper, there are a range of other reasons people may need more or less sleep than others.\n\n\n\n\n\nFactors such as age and underlying health conditions can significantly influence sleep requirements.\n\n\n\n\n\nFor example, older adults often experience changes in their circadian rhythms and are more likely to suffer from fragmented sleep due to conditions such as arthritis or cardiovascular disease.\n\n\n\n\n\nSleep needs vary from person to person, and while a lucky few can thrive on less, most of us need seven to nine hours of sleep a night to feel and function at our best.\n\n\n\n\n\nIf you're regularly skimping on sleep and relying on weekends to catch up, it might be time to rethink your routine. After all, sleep isn't a luxury — it's a biological necessity.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tourette-syndrome-mental-health-study/swdkftljm",
        "title": "Living with Tourette syndrome 'profoundly' affected Max's mental health. They're not alone",
        "publish_date": "Tue, 3 Jun 2025 19:51:11 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "This article contains references to suicide and self-harm.\n\n\n\n\n\nAt the age of seven, Max was diagnosed with Tourette syndrome , a lifelong neurological condition characterised by repetitive, involuntary movements and sounds known as tics.\n\n\n\n\n\nMax experienced bullying at school, leading them to drop out before the end of Year 10.\n\n\n\n\n\n\"Pretty much overnight, my tics went from, I was able to hide them, to not being able to hide them. It was full-blown swearing, punching out,\" Max said.\n\n\n\n\n\nMax said they have multiple self-injurious tics, including one where they repeatedly hit their eye. They dislocated and broke their elbow last year.\n\n\n\n\n\nNow 18, Max wishes to work or volunteer at an animal shelter, but isn't able to as employers believe their tics will frighten animals.\n\n\n\nLISTEN TO Measuring the hidden burden of Tourette Syndrome and tic disorders on Australia SBS News 31/05/2025 06:26 Play\n\nMelissa Licari, a senior research fellow at The Kids Research Institute Australia, said such experiences have severely affected Max's mental health.\n\n\n\n\n\n\"Tourette's took more than just the control of Max's body. It has profoundly impacted mental health,\" Licari said. \"Max's mum has lost count of the number of suicide attempts.\"\n\n\n\n\n\nVicky, Max's mother, said Max's mental health has deteriorated significantly over the last couple of years.\n\n\n\n\n\n\"I don't believe that they want to die. They just don't want to live like this,\" she said, in a video posted by The Kids Research Institute Australia this week.\n\n\n\nMax (left) was diagnosed with Tourette syndrome when they were seven years old. Source: Supplied In Australia, one in every 100 school-aged children lives with Tourette syndrome.\n\n\n\n\n\nLicari said Max's story reflects the ongoing challenges that young Australians living with the condition have been facing, including long waits for diagnosis, limited access to effective treatment, stigma and discrimination, and limited understanding and support in schools and workplaces.\n\n\n\n\n\n\"This sadly results in severe mental health issues. These challenges aren't new and they've been ignored for far too long,\" Licari said.\n\n\n\n\n\nLicari is a co-author of Impact for Tourette, Australia's first survey of its kind in Australia, looking at the mental health of people living with Tourette syndrome.\n\n\n\n\n\nIt interviewed more than 200 persons and caregivers, finding that almost half of the children with tics showed signs of depression, and nearly half of the caregivers said their child had expressed suicidal thoughts. One in 10 has attempted to take their own life.\n\n\n\n\n\nMore than 70 per cent of adults had thought about ending their lives. One in four adults had attempted suicide — five times higher than the national average.\n\n\n\nMelissa Licari said Australians living with Tourette syndrome face ongoing challenges, including long waits for diagnosis, limited access to treatment, stigma and discrimination. Source: Supplied The report includes seven key recommendations, including funding to develop a National Clinical Guideline for the diagnosis and treatment of tic disorders.\n\n\n\n\n\nAmanda Maxwell is a clinical psychologist and clinical research manager at the UNSW Tic Clinic.\n\n\n\n\n\nShe said a lack of psychological services has pushed people to seek medication to treat tic-related disorders.\n\n\n\n\n\n\"Medication can be very helpful, but of the sample that we surveyed, 50 per cent said that it did not control their tics or minimally controlled their tics. And there are obvious side effects as well with some of the medications,\" she said.\n\n\n\nVicky said she believed a diagnosis had limited impact.\n\n\n\n\n\n\"It's like, 'Well, your child's got Tourette's. We'll try this medication', and the medication doesn't particularly work. And it's like, what now? 'Oh, well, there's nothing else. That's it',\" she said.\n\n\n\n\n\nMaxwell said more than 80 per cent of those with Tourette syndrome who were surveyed said they experienced tics daily.\n\n\n\n\n\n\"About 50 per cent of the children reported that they didn't have tic-free periods of more than five to 10 minutes in a day,\" she said.\n\n\n\nSignificant financial toll\n\nWith those symptoms, many living with the condition are unlikely to be able to work.\n\n\n\n\n\nBut according to Maxwell, they're also struggling to get NDIS applications approved.\n\n\n\n\n\n\"The financial burden is great. It's not just because some adults are unable to work, but there is also a significant cost of accessing healthcare for these young people. One in 20 had NDIS funding. Three out of four had their applications denied,\" she said.\n\n\n\nMaxwell said in her experience, young people were denied NDIS support because tic disorders were not considered a 'permanent' disability.\n\n\n\n\n\n\"Yet even adults we work with — that clearly have tics that have persisted into adulthood and that experiencing significant functional impairment — are also being told that their disability is not a permanent disability and denied funding,\" she said.\n\n\n\n\n\nProfessor Valsamma Eapen is scientia professor and chair of child psychiatry at UNSW Sydney.\n\n\n\n\n\nShe said while a comprehensive care plan is required to look after people living with tics, sometimes, even health professionals don't have much awareness of what's needed to support their patients.\n\n\n\n\"GPs are usually the first stop, but it could also be paediatrics in neurology, psychology, and some will go to the eye specialist if the fast tic is blinking or screwing of the eye, or ENT specialist when they have a vocal tic like grunting or throat-clearing and so on. But often it's not picked up as tics or Tourette,\" Eapen said.\n\n\n\n\n\n\"No-one believes me,\" Max said. \"No doctors, no nurses, no psychiatrists. No-one.\"\n\n\n\n\n\nThe survey found one in four people waited more than two years for a diagnosis, and one-third were not offered any services or support after diagnosis. Only 40 per cent said their experience with treatment was positive.\n\n\n\n\n\nThe report also found there is a shortage of psychologists with the expertise to offer treatment for tic disorders.\n\n\n\nValsamma Eapen says it's critical that a national guideline be established for tics and Tourette syndrome, so there can be a standardised approach to early identification, assessment, and appropriate support. Source: Supplied Eapen said more understanding is critical, and there were several unhelpful views about tics and Tourette syndrome.\n\n\n\n\n\nThose included the assumption that people would \"grow out of\" it. Another is the understanding of Tourette solely as \"the swearing syndrome where people blurt out obscenities\", leading to some people not being believed about having the syndrome.\n\n\n\n\n\n\"Neither is a helpful approach because the majority would fall somewhere in between,\" Eapen said.\n\n\n\n'Indeed a human rights issue'\n\nEapen said more training for professionals was needed, urging the government to launch a national guideline on Tourette syndrome.\n\n\n\n\n\n\"A national guideline will provide uniform minimum standards and a consistent approach that's agreed upon by all consumer stakeholders and professionals as to the framework, to awareness, early identification, comprehensive assessment, and also matching supports.\n\n\n\n\n\n\"That should also include accommodations at school and for disability supports, where it is applicable. It is indeed a human rights issue for the 55,000 Australians who are living with Tourette's.\"\n\n\n\n\n\nFor now, Vicky said she has hope Max will \"remember who they were and what brought them joy\".\n\n\n\n\n\nReaders seeking crisis support can ring Lifeline on 13 11 14 or text 0477 13 11 14, the Suicide Call Back Service on 1300 659 467 and Kids Helpline on 1800 55 1800 (for young people aged up to 25). More information and support with mental health is available at beyondblue.org.au and on 1300 22 4636.\n\n\n\n\n\nEmbrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/minimum-wage-rise-will-deliver-first-above-inflation-increase-in-years/aq71luxk7",
        "title": "Minimum wage rise will deliver first above-inflation increase in years",
        "publish_date": "Tue, 3 Jun 2025 10:31:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Minimum wage rise will deliver first above-inflation increase in years\n\nPublished 3 June 2025, 8:22 am\n\nMillions of Australian workers will pocket an above-inflation wage increase within weeks. The Fair Work decision is intended to correct a decline in real wages among the lowest paid, but employers are questioning whether it will be sustainable.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/controversy-and-compromise-the-fallout-from-senator-dorinda-coxs-defection-from-the-greens-to-labor/fc4dyl95d",
        "title": "Controversy and compromise: the fallout from Senator Dorinda Cox's defection from the Greens to Labor",
        "publish_date": "Tue, 3 Jun 2025 07:53:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAs federal cabinet meets in Perth, the fallout from Western Australian senator Dorinda Cox's shock defection from the Greens to the Labor Party continues.\n\n\n\n\n\nGreens leader Larissa Waters says she was left stunned by the decision.\n\n\n\n\n\n\"Dorinda called about an hour before her press conference with the Prime Minister and we had a very calm and measured conversation about it. I did genuinely wish her all the best, there's no animosity there, it is obviously disappointing to lose a Greens senator.\"\n\n\n\n\n\nThe Greens still hold the balance of power in the Senate, but Ms Cox says she wasn't able to achieve the progress she desires with the party.\n\n\n\n\n\n\"I've reached a conclusion after deep and careful reflection that My values and priorities are more aligned with Labor than the Greens. I am in public life to make real change, and deliver lasting and tangible outcomes for Australians. I've worked hard to make Australia fairer and much more reconciled. But recently, I've lost confidence in the capacity for the Greens to be able to assist me in being able to progress this.\"\n\n\n\n\n\nHowever, just last week, Ms Cox condemned Labor's extension of Western Australia's controversial North-West Shelf gas project.\n\n\n\n\n\nIt's been labelled by the Greens as a carbon bomb, and Ms Cox raised concerns ancient Indigenous heritage would be destroyed.\n\n\n\n\n\nPrime Minister Anthony Albanese says joining the Labor Party will mean making some compromises for Ms Cox.\n\n\n\n\n\n\"Dorinda Cox understands that being a member of the Labor Party means that she will support positions that are made by the Labor Party.\"\n\n\n\n\n\nIt's a lesson that was learned the hard way for fellow West Australian Senator Fatima Payman, who left Labor's ranks last year after speaking out on Gaza.\n\n\n\n\n\nGreens staffers suggest Ms Cox left voluntarily before she was pushed out, amid internal investigations into bullying.\n\n\n\n\n\nThey're claims the senator has denied, and Mr Albanese says he's confident any issues have been managed.\n\n\n\n\n\n\"No, that got dealt with by the mechanism that my government established. We support safe workplaces. We established a mechanism in the parliament which is at arm’s length of government, and that's important.\"\n\n\n\n\n\nThe Greens have now been left with no Indigenous members among their federal ranks, after Lidia Thorpe left in 2023.\n\n\n\n\n\nMs Cox says she lost faith her party could help her make real change on issues, including reconciliation.\n\n\n\n\n\nHowever, Ms Waters says she's unconvinced Labor will do better on this front- having backed down on truth and treaty.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/minimum-wage-rise-impact-and-petrol-prices-climb-on-weak-aussie-dollar/dnwfrqnih",
        "title": "Minimum wage rise impact, and petrol prices climb on weak Aussie dollar",
        "publish_date": "Tue, 3 Jun 2025 07:46:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/morally-wrong-these-billionaires-wealth-could-buy-over-680-000-homes/7nqpsuw24",
        "title": "'Morally wrong': These billionaires' wealth could buy over 680,000 homes",
        "publish_date": "Tue, 3 Jun 2025 05:51:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "With Australia's housing crisis worsening, owning a house is increasingly getting out of reach for the ordinary Australian. But with their soaring wealth, the country's billionaires can comfortably own hundreds of thousands of houses.\n\n\n\n\n\nThe Australian Financial Review's Rich List, released last week, reveals the total wealth of Australia's richest 200 people has surged by 160 per cent over the past decade, reaching $667.8 billion in 2025.\n\n\n\n\n\nTopping the list for the sixth year in a row was mining magnate Gina Rinehart, with an estimated net worth of $38.1 billion.\n\n\n\n\n\nIn stark contrast, the median personal income stands at just $55,062 a year, according to data from the Australian Bureau of Statistics (ABS).\n\n\n\nREAD MORE Why you might need to move out of capital cities for a rental bargain\n\nAnti-poverty organisation Oxfam says property has been the most frequent source of wealth accumulation for Australia's wealthiest.\n\n\n\n\n\nThe group told SBS News the wealth of the entire Rich List could buy over 680,000 average Australian homes, based on ABS's mean dwelling price of $976,800.\n\n\n\n\n\nAnd that divide is growing.\n\n\n\n\n\nAccording to Oxfam Australia's analysis of the Rich List, the number of Australian billionaires has more than doubled over the past decade — rising from 74 in 2015 to 161 in 2025.\n\n\n\n\n\nOver that same period, billionaire wealth has grown on average by more than $137 million a day — or $95,000 every minute.\n\n\n\n\n\nThe average Rich Lister has over 116,000 times the wealth of an Australian in the bottom 50 per cent.\n\n\n\nOver the last 10 years, billionaire wealth has grown on average by $95,000 every minute — more than the median Australian taxpayer earns each year. Source: SBS News\n\n'Morally wrong, economically and socially dangerous'\n\nOxfam is renewing calls for tax reform to address what it describes as \"rampant inequality\" and ensure the ultra-wealthy contribute their fair share.\n\n\n\n\n\n\"Any billionaire is a sign that our economic system isn't working properly,\" Oxfam Australia acting chief Chrisanta Muli told SBS News.\n\n\n\n\n\n\"This level of inequality is not just morally wrong — it's economically and socially dangerous. While millions of Australians are struggling to make ends meet, the country’s richest continue to amass eye-watering fortunes, often without lifting a finger.\n\n\n\n\n\n\"Millions of households struggle to put food on the table while the super-rich live in excess.\"\n\n\n\nOxfam's analysis found the average wealth of someone in the bottom 50 per cent of the population has flatlined at around $28,000 over the past decade, offering little chance of home ownership or long-term financial security.\n\n\n\n\n\nIt said on the other hand, Australia's largest property developer, Harry Triguboff who is the second-richest Australian on the AFR Rich List, has seen his personal wealth more than double — from $13.7 billion in 2016 to $29.7 billion in 2025.\n\n\n\n\n\nAccording to Oxfam, that amount could buy more than 30,000 average Australian homes.\n\n\n\n\n\nRetail, investments and mining/resources were behind property as the most frequent source of wealth accumulation for Australia's richest in the past decade.\n\n\n\nThe rise of housing unaffordability — and billionaire wealth\n\nOxfam points out that the boom in personal wealth has coincided with a worsening housing crisis.\n\n\n\n\n\nAccording to Anglicare Australia's 2025 Rental Affordability Snapshot:\n\n\n\nOnly 0.7 per cent of rental listings are affordable for someone earning a full-time minimum wage.\n\nJust 12.8 per cent rental properties are affordable for a family of four on two minimum wage incomes.\n\nFor people on JobSeeker, the Disability Support Pension, or the Age Pension, affordable rentals are virtually nonexistent.\n\n\"It is scandalous and unjust that property continues to be one of the biggest drivers of wealth across the decade while over 99 per cent of rentals are unaffordable for people earning a full-time minimum wage,\" Muli said.\n\n\n\nThe Anglicare Snapshot surveyed 51,238 rental listings across Australia, revealing that just 0.7 per cent of rentals were affordable for someone earning a full-time minimum wage. Source: SBS News Meanwhile, the 2024 PropTrack Housing Affordability Report found housing affordability to be at a record low — with a typical household earning a combined income of $112,000 a year, able to afford just 14 per cent of all homes sold across the country.\n\n\n\n\n\nTheir analysis showed that you now need to be a high-income household, classified as earning $213,000 a year, to be able to afford to buy half the homes sold in Australia over that year.\n\n\n\nOxfam calls to tax the rich\n\nThe organisation is calling on the federal government to conduct a comprehensive review of the tax system to better address wealth accumulation by the super-rich and close what it sees as a failure of the progressive tax system.\n\n\n\n\n\nThey're proposing a wealth tax targeting the richest one per cent, which is believed could raise tens of billions of dollars annually and contribute to healthcare, affordable housing and action on climate change.\n\n\n\n\n\n\"Billionaires pay an effective tax rate of around 0.3 per cent of their wealth globally. Because billionaires grow their wealth through assets, not incomes, the income tax system is failing to properly tax them,\" Muli said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/six-million-dollar-guitar-features-in-new-kurt-cobain-exhibition/jw3pa7du2",
        "title": "Six million-dollar guitar features in new Kurt Cobain exhibition",
        "publish_date": "Tue, 3 Jun 2025 03:33:20 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n(Nirvana plays 'Where did you sleep last night')\n\n\n\n\n\nAn iconic performance from a band that defined a generation.\n\n\n\n\n\nNirvana's MTV Unplugged performance in November of 1993 captured the band at the height of their powers, just five months before iconic singer-songwriter Kurt Cobain took his own life.\n\n\n\n\n\nKurt's Martin D-18E Electro-Acoustic guitar, used during the famous moment, is now the centrepiece for a new exhibition at London's Royal College of Music.\n\n\n\n\n\nOnly 302 of this model were ever made, and the singer-songwriter bought his second-hand from a guitar shop in Los Angeles.\n\n\n\n\n\nMoments before playing the song 'Where did you sleep last night', first popularised by legendary blues player Lead Belly, Cobain joked about wanting to purchase the musician's guitar.\n\n\n\n\n\n\"Oh yeah, this guy representing the Lead Belly estate wants to sell me Lead Belly's guitar for $500,000.\"\n\n\n\n\n\nLeading rock journalist Alan di Perna says there's some irony to this comment now given the current value of the very guitar Cobain was playing that evening.\n\n\n\n\n\n\"It's the most expensive guitar ever sold at auction: $6.1 million. It's significant because Kurt owned it. Kurt played it. It's the last guitar he ever played. It was used in the final phase of his career. It was used for the Unplugged program, which was taped 5 months or so before Kurt Cobain passed away. So for fans it's an iconic object.\"\n\n\n\n\n\nKurt Cobain and his band Nirvana pioneered the grunge movement of the late 80s and early 90s, combining introspective verses with clean sounds, and rocky, distorted choruses.\n\n\n\n\n\nNirvana produced three studio albums: Bleached, Nevermind and In Utero.\n\n\n\n\n\nCobain is often considered one of the key voices of his generation.\n\n\n\n\n\n\"He's very influential for songs that sum up the anxieties of Generation X, his generation. He once commented that 'I'm just like my fans'. He comes from a broken home, a somewhat impoverished background, and all of this is reflected in his songwriting.\"\n\n\n\n\n\nThe green mohair cardigan Kurt Cobain wore for the 1993 MTV performance is also on display.\n\n\n\n\n\nAfter Unplugged cemented them as one of the top musical acts of their time, the band came to a sudden and tragic end, when in April 1994, Cobain died by suicide.\n\n\n\n\n\nDespite being active for just a few short years of fame, Nirvana has continued to inspire an army of loyal fans.\n\n\n\n\n\n\"The big part of Kurt Cobain's enduring popularity is of course his tragic early death, there's no getting around that. And he's sort of one of the great martyrs of rock and roll, one of the great martyrs to fame. I think people identify with that. He's also a member of the so-called '27 club', rock stars who died at age 27: Jim Morrison, Jimi Hendrix, Janis Joplin, I believe. There's something about that age and it tends to make people immortal in the memory of the public.\"\n\n\n\n\n\nThis is the first time the Royal College of Music in London has hosted an exhibition on rock, normally sticking to more classical genres.\n\n\n\n\n\nOne fan will also walk away with a piece of Nirvana memorabilia as the college are raffling a guitar pick once used by Kurt Cobain, for five British pounds a ticket.\n\n\n\n\n\nFor the students that attend this institution, curator Gabriele Rossi Rognoni believes there is something to learn from the late musician.\n\n\n\n\n\n\"We saw space to develop a story that was not only about an instrument but about a person with a complex background and with something that is quite significant today, which is as musicians and as public figures, you are under a lot of pressure. And this pressure can play out in different ways in life. And having the possibility to open this discussion clearly and working with someone who had had such an incredible public success but at the same time such a complex personal experience.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/workers-on-minimum-wage-receive-pay-boost-in-annual-review/7n9loii6i",
        "title": "Australia's lowest-paid workers just got a pay rise. Here's how much wages will increase",
        "publish_date": "Tue, 3 Jun 2025 00:12:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's lowest-paid workers have been handed a 3.5 per cent increase by the Fair Work Commission (FWC).\n\n\n\n\n\nThe change will impact one in five Australian workers on an award wage from 1 July.\n\n\n\n\n\nThe commission's panel delivered the decision in Sydney on Tuesday morning after assessing submissions from the government and other stakeholders as part of the annual review process.\n\n\n\nFair Work Commission president Adam Hatcher noted the workforce reliant on these wages was \"disproportionately female\" and largely consisted of casual and part-time employees.\n\n\n\n\n\n\"We are concerned that if this opportunity is not taken in this annual wage review, the loss in the real value of wages, which has occurred, will become permanently embedded in the modern awards system,\" he said.\n\n\n\n\n\n\"And the national minimum wage and a reduction of living standards for the lowest paid in the community will thereby be entrenched.\"\n\n\n\n\n\nThe national minimum wage will increase from $24.10 to $24.94 per hour or from $915.90 to $947.95 per 38-hour week.\n\n\n\nREAD MORE The sectors that have seen real growth in women's wages\n\nUnions had been calling for a 4.5 per cent increase, while the Australian Chamber of Commerce and Industry suggested a wage increase no greater than 2.5 per cent.\n\n\n\n\n\nThey argued a higher figure would be at the expense of small to medium businesses.\n\n\n\nUnions welcome pay rise amid concerns for small businesses\n\nAustralian Council of Trade Unions national secretary Sally McManus said the pay packet boost, 1 per cent higher than inflation, would help lower-paid workers \"catch up\".\n\n\n\n\n\n\"It makes an enormous difference in terms of people's ability to pay for the basics,\" McManus said, welcoming the announcement.\n\n\n\n\n\nIn response to concerns from small businesses, McManus argues the damage would be greater if workers didn't have disposable income to spend.\n\n\n\nACTU secretary Sally McManus welcomed the wage increase after calling for a 4.5 per cent boost. Source: AAP / James Ross \"The very worst thing for small businesses is if workers' wages go backwards, it means they have to cut back,\" she said.\n\n\n\n\n\n\"It might be the coffee, it might be the sandwich, it might be a beer... You can't cut out your rent, can't cut out your bills.\"\n\n\n\n\n\nLuke Achterstraat, CEO of the Council of Small Business Organisations Australia, said business owners would wear the brunt of the wage increases.\n\n\n\n\n\n\"Today’s decision of a 3.5 per cent increase — which is above the current rate of inflation — will have ramifications for our small business engine room, many of whom are struggling to make a profit on already razor-thin margins,\" he said in a statement.\n\n\n\n\n\n\"Many owners will need to personally absorb these higher costs, unable to pass on any further price rises to consumers.\"\n\n\n\nLabor backed an increase above inflation , which was 2.4 per cent at the end of March.\n\n\n\n\n\nPrime Minister Anthony Albanese reassured Australians that the wage rise shouldn't drive up prices.\n\n\n\n\n\n\"No, what it will make sure is that people won't fall behind when it comes to cost of living,\" he told reporters.\n\n\n\n\n\nIn 2024, the FWC increased award wages by 3.75 per cent, just below annual inflation at 3.8 per cent.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/economic-growth-slows-to-start-the-year-20250604-p5m4vt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Economic growth slows to start the year",
        "publish_date": "Wed, 04 Jun 2025 12:05:22 +1000",
        "category": "finance",
        "authors": [],
        "text": "Economic growth slows to start the year\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/man-arrested-after-allegedly-breaking-into-restricted-grounds-of-windsor-castle-20250604-p5m4vu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Man arrested after allegedly breaking into \"restricted grounds\" of Windsor Castle",
        "publish_date": "Wed, 04 Jun 2025 12:05:22 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Man arrested after allegedly breaking into \"restricted grounds\" of Windsor Castle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/it-gave-me-hope-how-a-single-ai-session-put-kelly-on-a-path-to-eating-disorder-recovery-20250526-p5m280.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It gave me hope’: How a single AI session put Kelly on a path to eating disorder recovery",
        "publish_date": "Wed, 04 Jun 2025 12:02:56 +1000",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "“We know that if you leave people waiting for treatment, they are less likely to take up the opportunity of treatment when it’s presented to them, and also that their symptoms can deteriorate,” she says. There is no official data in Australia on the length or number of people on waitlists, but a 2020 report from The Butterfly Foundation identified waiting times as a key issue for respondents. Helplines, such as the Butterfly Foundation’s free national helpline, have long helped fill this gap for eating disorder patients. But Sharp says the prospect of calling someone can be daunting for some patients. “Some people really love helplines. But there are other people who would never choose to use a helpline. It’s about giving them an option for engaging with treatment that we know is evidence-based and effective,” she says. ESSI provided one 30-minute session to 60 patients around Australia on waitlists for eating disorder treatment. The chatbot is not designed to replace treatment for patients, but to provide interim support while they wait for care. The information discussed by the patient with the chatbot is then passed on to the patient’s clinician.\n\nWhile one half-hour session may not seem like much, Sharp says it can still have a powerful effect. “Single Session Interventions are considered a newer innovation, particularly in mental health care, showing that even a small dose of therapy can be very beneficial and start to change some of those unhelpful thoughts and behaviours,” she says. A screenshot from the Eating Disorder Electronic Single-Session Intervention chatbot developed by Professor Gemma Sharp. Credit: Courtesy of Professor Gemma Sharp Sharp’s team recorded participants’ experiences at four points – before using the chatbot, after 72 hours, after one month and after three months. The results of the randomised controlled trial were published late last month in the Journal of Medical Internet Research. Almost 100 per cent of patients who used the chatbot went on to start treatment, and had significantly improved outcomes like reduced eating disorder symptoms, depression and anxiety at one and three months.\n\nThe trial’s 12-month results, which are yet to be published, followed a similar trajectory according to Sharp. For Kelly, her experience with ESSI almost two years ago, helped her feel seen for the first time, and set her on the path to recovery. “It was me almost like talking to myself and figuring stuff out by myself, but with some tools, and there wasn’t any judgment,” she says. The chatbot also helped lead her to an autism diagnosis, which she says is connected to some of her sensory food issues and ARFID diagnosis. When she was finally able to see her clinician, they had all the information they needed to treat her. “To be finally validated, I think that was the biggest thing for me... it was being able to see my own words reflected back to me, and then to go into a session and actually be heard and seen for who I am,” she says.\n\nProfessor Gemma Sharpe. Credit: Ben Searcy While the study was relatively small, it joins a growing body of international research on the potential uses of artificial intelligence in supporting eating disorder diagnosis, treatment and recovery. Loading Dr Sarah Barakat, a postdoctoral research associate at the InsideOut Institute for Eating Disorders, who was not involved in the study, says Sharp’s findings are in line with her own research into digital interventions. “There is a real role for these technologies, and they can be really helpful, particularly in a space like eating disorders where there’s quite a lot of shame and ambivalence around seeking help,” she says.\n\nWhile she emphasises that chatbots like ESSI need to be integrated with human-led care, such technologies can help eliminate certain biases clinicians may hold in the pre-screening stage. “It is a problem in the healthcare system that clinicians don’t receive enough training around how to screen and treat eating disorders.” “And that means that particularly for people who struggle with binge-eating disorders, who might be in normal or larger bodies, thinking to screen those people for an eating disorder is quite uncommon.” Then there are ethical concerns that can arise from using AI in healthcare. In 2023, a chatbot promoted by the United States’ National Eating Disorders Association sparked concern about the use of AI when it offered dieting advice to a patient.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/victoria/erin-patterson-trial-live-mushroom-cook-returns-to-witness-box-for-a-third-day-to-give-evidence-on-fatal-beef-wellington-lunch-20250603-p5m4mw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Erin Patterson murder trial LIVE: How childhood memories inspired the centrepiece dish; Inside Patterson’s kitchen on the day of the deadly mushroom meal",
        "publish_date": "Wed, 04 Jun 2025 12:02:40 +1000",
        "category": "finance",
        "authors": [
            "Marta Pascual Juanola",
            "Erin Pearson"
        ],
        "text": "Erin Patterson said she started preparing the meal on Friday, the day before the beef Wellington lunch, by salting the meat steaks to try to get some juices out of them. Sometimes, she said, she’d Google cooking tips as she wouldn’t “stuff it up”.\n\nOn Saturday, she started on the mushroom duxelles (a French culinary term for a mushroom-style mince). She wanted to get to it quite early, since it would take a while.\n\n“I fired the garlic and chopped shallots,” she said.\n\nPatterson said she chopped up two little tubs of mushrooms from Woolworths before cooking them down on low heat for about 45 minutes. “I cooked that for a very long time,” she said. “You’ve got to get almost all of the water out.”\n\nPatterson said that as she was cooking the duxelles down, she tasted it a few times, but it tasted a bit bland, so she decided to add the mushrooms she had bought from the grocer in Melbourne to the mixture she still had in her pantry.\n\n“I roughly poured water over them to get the crispness out of them. I chopped them up and sprinkled them over the duxelles and pushed them in,” she said.\n\nPatterson said that at that time, she believed the container just had the mushrooms she had bought from Melbourne.\n\n“Now I think that there was a possibility that there were foraged ones in there as well,” she said.\n\nAfter making the duxelles in the pan, Patterson used an egg flip to transfer it to an oven tray to put it in the fridge for a little while, and fried the steaks on each side and let them rest.\n\n“I then started the process of putting the Wellingtons together,” she said.\n\nPatterson said that after frying the steaks and letting them cool, she used the egg flip to lift some of the duxelles.\n\nShe then wrapped each one in filo pastry and then beef pastry. “I made six,” she said.\n\n“At the appropriate time, I put them in the oven.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/snow-dump-forecast-for-slopes-as-cold-snap-to-hit-victoria-20250604-p5m4qt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Snow dump forecast for slopes as cold snap to hit Victoria",
        "publish_date": "Wed, 04 Jun 2025 12:02:18 +1000",
        "category": "sports",
        "authors": [
            "Alexander Darling"
        ],
        "text": "Victoria’s ski slopes will officially open this weekend for the start of snow season, but the Bureau of Meteorology says the conditions won’t necessarily be ideal for skiing.\n\nSnow will be possible over alpine areas on Wednesday, but bureau community information officer Patch Clapp said snowfall would really kick off from Friday.\n\nA jogger runs with her dog at Carlton’s Princes Park on the first day of winter. Credit: Chris Hopkins\n\n“Over the course of Friday to Tuesday, at least 20 to 30 centimetres of snow should accumulate at the alpine resorts for the first weekend of the snow season, with snow possible generally every day from Friday to Tuesday,” he said.\n\n“Weather conditions over the weekend will not be great for snow sports. Successive cold fronts and a low-pressure system will lead to a wet and windy long weekend.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-footy-kiss-that-said-everything-about-an-afl-warrior-20250604-p5m4u8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The footy kiss that said everything about an AFL warrior",
        "publish_date": "Wed, 04 Jun 2025 12:00:49 +1000",
        "category": "sports",
        "authors": [
            "Bob Murphy"
        ],
        "text": "On Sundays, I’ve started running laps of a footy oval across town. The first time was three weeks ago and I’ve returned every Sunday since. It’s become a ritual of sorts, somewhere between a meditation and purge.\n\nLast Sunday, at the completion of this physical prayer, I crouched down, knees pointed outward, elbows on my knees and eyes looking straight down, my heaving breath the only sound. I was reminded of an old footy myth.\n\nI’d heard that the great Stephen Kernahan believed that there was a single stretch (very similar to this crouch position I was in) that took care of everything a footballer needed. Groin, lower back, quadriceps and calves. Frozen in position, I was reminded of my pure love for such things in footy.\n\nWas the story true? Doesn’t matter, I live for these little pieces of footy folklore.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/kristy-thought-this-virus-was-mild-then-her-baby-ended-up-in-hospital-20250602-p5m483.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kristy thought this virus was mild. Then her baby ended up in hospital",
        "publish_date": "Wed, 04 Jun 2025 12:00:08 +1000",
        "category": "lifestyle",
        "authors": [
            "Angus Thomson"
        ],
        "text": "Thousands of babies are heading into winter without full protection against RSV despite mounting evidence that free immunisations have led to fewer children ending up in hospital with the common but occasionally severe illness.\n\nOnly 15 per cent of babies under eight months had received an RSV immunisation, data from the Australian Immunisation Registry shows. In NSW and Victoria, the coverage rates are significantly lower.\n\nKristy Gatt with son Blake, who was hospitalised with RSV after missing the window for free immunisation. Credit: Wolter Peeters\n\nWomen between 28 and 38 weeks pregnant and newborn babies are now eligible for free respiratory syncytial virus (RSV) immunisations after the rollout of federal and state government schemes earlier this year.\n\nAll states and territories now offer nirsevimab, an injection containing ready-made antibodies to fight RSV, to eligible babies born this year.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-s-stupid-obsession-will-unleash-pain-on-america-20250604-p5m4rz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s stupid obsession will unleash pain on America",
        "publish_date": "Wed, 04 Jun 2025 11:59:24 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Canada, which achieved GDP growth of 1.5 per cent last year, is expected to post growth of only 1 per cent this year and something similar in 2026. Mexico, after also growing its economy 1.5 per ent last year, is expected to slow to 0.4 per cent growth this year before recovering somewhat to a growth rate of 1.1 per cent in 2026. Australia, which had GDP growth of 1.1 per cent last year, has forecast growth of 1.8 per cent this year and 2.2 per cent in 2026. Xi Jinping has led a sophisticated response from China to Trump’s tariffs. Credit: AP The prime target of the US assault on global trade, China, is expected to be affected negatively, but to a significantly lesser extent than the US. Its economy grew 5 per cent last year, is expected to slow to 4.7 per cent growth this year and 4.3 per cent in 2026. In other words, China is expected to lose about 70 basis points of growth over two years, but the US 130 basis points.\n\nLoading There is uncertainty surrounding what the eventual outcome on tariffs might be, but it is near-certain that the current settings are only a baseline case and that, with Trump determined to implement his tariffs one way or another, the likely outcome will be more damaging to global trade and growth - and to the US and other economies - than the OECD numbers suggest. There’s also uncertainty relating to retaliatory measures by those countries hit by Trump’s tariffs. The European Union, which responded to the steel and aluminium tariffs (where the 50 per cent rate cuts in today) with retaliatory tariffs of its own, has a long and lengthening list of prospective US targets for more tariffs if Trump imposes reciprocal tariffs on top of the baseline 10 per cent duties. China and the US agreed to a pause in their trade confrontation that left the US reducing its tariffs on imports from China from 145 per cent to 30 per cent and China its retaliatory tariffs from 125 per cent to 10 per cent.\n\nMore threatening than China’s tariffs, however, are its controls over exports of rare earths and rare earth magnets, where it dominates the global supply chains. It has effectively shut down almost all exports of the strategic metals, which are essential for the manufacturing of automobiles, aeroplanes, semiconductors, robots, wind turbines and a host of other advanced manufactures, including military hardware. That, if it continues, will be highly disruptive to global supply chains and highly damaging to advanced economies, most particularly the US economy. Last month a Ford plant in the US had to cease operations because of a shortage of rare earth magnets. That’s a small preview of what might be to come for US manufacturers if their administration continues its ill-conceived crusade against global trade.\n\nChina’s asymmetric response to the Trump tariffs reflects the sophistication of its response. Employing its near-monopoly over rare earths does minimal damage to China’s economy but could bring US advanced manufacturing to a standstill. It would take years, probably decades, for the US to develop sufficient alternative sources of supply to eliminate its dependence on China for those specialised metals. The OECD’s forecasts are likely to prove conservative. Other economies being threatened with punitive reciprocal tariffs unless they reduce trade barriers, remake their tax systems and succumb to Trump’s directives on their social policies will no doubt be looking for asymmetrical responses of their own. The EU, for instance, is eyeing off the big US tech and social media companies. In normal circumstances, the abrupt slowdown in US growth depicted by the OECD would produce a response from the Federal Reserve Board.\n\nConfronted by such a rapid and significant loss of economic momentum, the Fed would cut interest rates and, if the outlook were deemed significantly dire, restart its quantitative easing program, buying bonds and other securities to suppress market interest rates and pump liquidity and credit into the financial system. Loading The OECD, however, is forecasting a US inflation rate that will rise from its current level of around 2.3 per cent to 3.9 per cent by the end of this year, before falling back next year as the economy slows. If that were to transpire, the Fed won’t be cutting US rates this year and might well be raising them. Having been burned by the surge in post-pandemic inflation, which it thought was transient, it won’t risk making the same mistake again, which may well exacerbate the extent of the US slowdown. The OECD’s forecasts underscore that this remarkably stupid trade war, initiated by a president who doesn’t understand trade and whose policymaking appears uninformed by any serious analysis of the consequences, will do significant damage to the global economy for no near-term economic gain but plenty of economic pain for the economy that has initiated it.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/post-and-boast-video-showing-car-chase-20250604-p5m4vj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Post-and-boast video showing car chase",
        "publish_date": "Wed, 04 Jun 2025 11:52:17 +1000",
        "category": "finance",
        "authors": [],
        "text": "Post-and-boast video showing car chase\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/i-view-things-differently-now-the-socceroos-next-big-thing-is-back-and-even-better-than-before-20250531-p5m3r7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I view things differently now’: The Socceroos’ next big thing is back, and even better than before",
        "publish_date": "Wed, 04 Jun 2025 11:44:17 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "“I don’t take things for granted. Even a single training session, I grab it with both hands. I have worked on many muscle groups which I didn’t really think were so important. I worked on and understood how my body works even better than before. I made new friends, and I started watching basketball twice a week, watching the EuroLeague. So it was actually good fun. “If I had to decide, I would not get injured, but getting injured, at least I made it worthwhile. You’ve got to take it on the chin, focus on yourself, become a better athlete – which I think I’ve become.” Alessandro Circati. Credit: Getty Images When Circati began on his road to recovery, the staff at the rehab centre he attended in Bologna asked him: what’s your goal? His answer was twofold: make it back onto the pitch before the end of the Serie A season, and be fit for the Socceroos’ crucial June window to help them clinch World Cup qualification. That was doubly important because Thursday night’s clash with Japan – in which a win would seal a spot at the 2026 World Cup for Australia – is at Optus Stadium in Perth, his hometown. Though he wasn’t born there, that’s where he grew up; his father Gianfranco moved to Perth in 1998 to play for the Glory in the old National Soccer League, and while he only spent a season with them, he loved it so much he migrated permanently eight years later.\n\nCircati has ticked both boxes. At club level, his return was initially being handled with caution, with the 22-year-old an unused substitute for six games once he was deemed fit enough to make a match-day squad – until a string of results below them on the Serie A table put Parma at heightened relegation risk, forcing them to break glass in case of emergency for their final two fixtures, and bring in a player who has been dubbed “the wall of Parma” by Italian media. ‘My dream was to play in Serie A, but I don’t feel like I’ve done it yet.’ Alessandro Circati “That’s when things started to change,” Circati said. “The coach came up to me, and he goes, ‘How much are you able to play?’”\n\nBoth games were pivotal, and Circati was pivotal in them. Against Napoli, he drew a foul deep in stoppage time from Giovanni Simeone which saw a penalty awarded against Parma in the same passage of play overturned. It finished 0-0, meaning the eventual Italian champions had to wait to be crowned. “It’s also worse when they celebrate in your home stadium, so that’s what we didn’t want,” Circati said. “It felt good to deny them.” Alessandro Circati celebrates Parma’s safety after a 3-2 comeback win away to Atalanta. Credit: Getty Images In Parma’s final game, away to Atalanta, was more “hectic”, in his words. Stung by two counter-attacking goals despite largely controlling the game, Parma were 2-0 down at half-time, and needed a draw from the match to confirm their safety in the top league. “We went into the change rooms at half-time … we looked at ourselves in the eyes, and we said we’re gonna come back,” he said.\n\n“Two goals, very doable. We went out, we took it goal by goal. We weren’t too worked up. The first one led to the second, and then the second led to the third, and then there you go. It’s probably the best comeback I’ve actually been a part of in my life in football. I’ve never come back from 2-0 down and won 3-2. Big satisfaction.” His deployment was a vote of major confidence from manager Cristian Chivu, who replaced Fabio Pecchia – the coach who oversaw Circati’s first-team integration as they won Serie B last season – in February. “When the coach changed, obviously, it gives you a bit of self-doubt,” Circati said. “He doesn’t know who you are, I’m out until the back end of the season … but hats off to Chivu because he knew who I was, he watched previous games, and he welcomed me with two arms open.” Pecchia had handed Circati a start in Parma’s first four games of the season, before he went down with the ACL – the highlight of which was a 2-1 win at home over another Italian giant, AC Milan. That’s the team his family supports. “I had my uncle in the grandstand with an AC Milan scarf on,” he said. “I flipped him off. When the final whistle blew, it was one of my happiest moments to this day. Huge sense of relief, where we can belong – we belong in that league.”\n\nThe Socceroos also changed coach during Circati’s injury lay-off, but to one he was familiar with: Tony Popovic (and his assistant Hayden Foxe) was at Perth Glory when he was a youth player before he departed for Italy. Popovic’s initial plan was to leave him out for this squad – Circati would have checked into camp anyway and watched the Japan game from the stands on his off-season trip home – but given how good he looked for Parma, it was a no-brainer to bring him in and stiffen up his back three, which is weakened in the absence of Harry Souttar and Hayden Matthews through injury. Alessandro Circati. Credit: SMH There is huge transfer interest in Circati from Juventus and Napoli, as well as clubs in the English Premier League, but he is happy at Parma, and happier still that he is such a big part of their plans. “It’s better to be wanted than unwanted,” he said.\n\n“Obviously, it’s great hearing big clubs want you, and that Parma aren’t really willing to sell you, the president doesn’t want to sell. It’s a good situation, you feel like you’re wanted. This season coming, I can almost say I’ll be 100 per cent playing at Parma because I just think that’s the right decision to do at this point, just to be able to play a whole season. Loading “My dream was to play in Serie A, but I don’t feel like I’ve done it yet. I want to play a whole season, lots of games, enjoy it. For me, it was even a bigger motivator to stay up.” But that’s for next season. Top of his footballing bucket list right now is to help the Socceroos get to the 2026 World Cup, and then play a big role in it. “It’s that simple,” he said. “It’s a big ambition, a big dream, but that is my goal.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-canavan-says-no-way-in-hell-nationals-will-back-labor-s-super-tax-musk-labels-trump-s-tax-spending-bill-a-disgusting-abomination-20250604-p5m4qd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Economy grows by 0.2 per cent; Tasmania debates no-confidence motion of Rockliff; Ley urges US to grant Australia an exemption to Trump’s metal tariffs",
        "publish_date": "Wed, 04 Jun 2025 11:43:52 +1000",
        "category": "finance",
        "authors": [
            "Cindy Yin",
            "Alexander Darling"
        ],
        "text": "The Australian economy rose 0.2 per cent in the March quarter, according to new figures released by the Australian Bureau of Statistics on Wednesday.\n\nThat’s the slowest pace since the three months to June last year - and below consensus expectations for 0.3 per cent growth.\n\nTreasurer Jim Chalmers. Credit: AAP\n\nAt the same time, the amount of income Australians have been saving compared to spending has increased from 3.9 per cent to 5.2.\n\nIn the past 12 months, the growth has been 1.3 per cent.\n\n“The private sector recovery we have planned and prepared for is gradually taking hold,” said treasurer Jim Chalmers in a statement.\n\nExtreme weather events dampened demand and weighed down exports, although household spending - which accounts for more than half of the country’s economic growth - continued to grow at 0.4 per cent.\n\nThis was driven by an uptick in spending on essentials including utilities during the warmer than average summer and food as Queensland households stockpiled in preparation for Ex-Tropical Cyclone Alfred.\n\nHowever, data yesterday revealed government spending and net trade - other key components of GDP - also slipped, detracting from economic growth. ’\n\nHousehold spending on discretionary items was also relatively slow following a stronger than usual retail sale period during the Christmas season.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/put-back-in-their-place-cummins-and-australia-brace-themselves-for-lord-s-return-20250604-p5m4sh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Put back in their place’: Cummins and Australia brace themselves for Lord’s return",
        "publish_date": "Wed, 04 Jun 2025 11:43:41 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Test captain Pat Cummins and Cricket Australia boss Todd Greenberg are confident Australia’s players won’t face a repeat of the ugly scenes that marred their last Test Match at Lord’s, as the team prepares for its return to the iconic venue.\n\nThe World Test Championship final against South Africa, which starts next Wednesday, will mark Australia’s first red-ball match at Lord’s since the infamous 2023 Ashes clash when Alex Carey’s stumping of Jonny Bairstow on the final day triggered outrage from some MCC members.\n\nThree Marylebone Cricket Club members were sanctioned – one banned for life and two others suspended – after Usman Khawaja and several teammates were verbally abused in the Long Room as they walked from the field. Temper also flared in the stands.\n\nDespite the ugly scenes on that day, Greenberg, who will attend the match in London, said the team felt no unease about returning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/fonua-blake-backs-origin-eligibility-rules-even-though-they-cost-him-20250603-p5m4e3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fonua-Blake backs Origin eligibility rules, even though they cost him",
        "publish_date": "Wed, 04 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "Cronulla enforcer Addin Fonua-Blake admits he is “jealous” of players chosen for State of Origin but has unselfishly declared the rules that have rendered him ineligible for interstate rugby league should remain as they are.\n\nFonua-Blake was born in Sydney and played his junior football with Mascot Jets but effectively ruled himself out of Origin contention in 2017, when he accepted a position in New Zealand’s World Cup squad.\n\nHe made a lone Test appearance for the Kiwis at that tournament, coming off the bench in a 74-6 demolition of Scotland, and has since switched his allegiance to Tonga, whom he captained at the Pacific Championships last year.\n\nIf not for his brief association with New Zealand – a tier-one nation – Fonua-Blake would in all likelihood have represented the NSW Blues and quite possibly established himself as an Origin regular.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/two-chinese-citizens-accused-of-smuggling-a-dangerous-fungus-into-the-us-20250604-p5m4v9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Two Chinese citizens accused of smuggling a dangerous fungus into the US",
        "publish_date": "Wed, 04 Jun 2025 11:30:08 +1000",
        "category": "finance",
        "authors": [],
        "text": "Two Chinese citizens accused of smuggling a dangerous fungus into the US\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/qantas-passenger-hits-out-over-hidden-travel-frustration-for-thousands-of-aussies-so-common-013837206.html",
        "title": "Qantas passenger hits out over hidden travel frustration for thousands of Aussies: 'So common'",
        "publish_date": "2025-06-04T01:38:37Z",
        "category": "finance",
        "authors": [],
        "text": "Zoe is calling for industry-wide reforms to improve how airlines handle mobility aids, after her wheelchair was damaged three times on recent flights.\n\nThe Qantas passenger said it's far from the first time this has happened when flying. Source: Getty\n\nAn Australian disability advocate is calling for better, disability-led policies and systemic reforms to ensure disabled travellers are respected, and their mobility aids are properly handled, after her wheelchair was damaged for a third time by Qantas.\n\nMelbourne woman Zoe Simmons, who lives with fibromyalgia, said she recently embarked on a round-trip to Tokyo from Melbourne with the national carrier, and when she was given back her wheelchair in Australia, it had sustained substantial damages.\n\nShe said it was handed back with warped metal, broken parts, and scratches that impacted its safety and usability. Zoe said that in 2021, a similar, though more severe incident occurred with Qantas, and again last year, though she didn't report the latter issue — the steering controller had broken off — over fears of being \"laughed off\".\n\nZoe's wheelchair was left with several structural damages after a recent flight from Tokyo to Melbourne. Source: Supplied/Zoe Simmons\n\nFollowing her recent trip to Japan, Qantas did arrange for Zoe to get her wheelchair repaired through one of its partnered repair services, but she feels it’s unfair that disabled passengers have to accept this as the norm — that they’re expected to handle repairs themselves whenever their mobility aids are damaged during travel.\n\nADVERTISEMENT\n\nZoe said she, and hundreds of thousands around the country, remain deeply frustrated at the energy it takes disabled passengers to continually advocate for repairs and recognition, often met with indifference or excuses from airline staff. \"I just hate that it’s so common, like what are they doing to our wheelchairs that causes metal to warp and break,\" Zoe told Yahoo News Australia.\n\n\"There are chunks out of the arm rests, the arm rests are very warped and are weirdly sitting now, they're also loose, the foot guard has chunks out of it, my wheel cover and my cup holder are also damaged, not to mention the scratches, and so on.\n\n\"Last time I flew with them, they broke my wheelchair controller off. And it was just laughed off! I didn’t have the energy to fight for such a small thing then.\"\n\nDisability advocate Zoe Simmons is pushing for sweeping change in how Australian airlines handle disability support. Source: Supplied.\n\nMelbourne woman demands nationwide reform in airline treatment of mobility aids\n\nZoe said that after discovering damage to her wheelchair, she had to explain her story to several airport staff who mostly responded with dismissive sympathy. When a manager eventually spoke with her, Zoe raised the issue of how the burden always falls on disabled people to advocate for themselves—something the manager denied, citing policies and procedures, without acknowledging how exhausting that constant advocacy is.\n\nADVERTISEMENT\n\nShe criticised the way airlines treat wheelchairs like baggage instead of essential mobility aids, and called for stronger policies, better staff training, and public reporting on wheelchair damage. \"Imagine if non-disabled people expected their legs to be broken every time they flew, if chunks came off,\" she said.\n\n\"What if your bones were warped? They need to stop treating wheelchairs like baggage and start respecting them for what they are.\"\n\nZoe highlighted that in the US, some 30 wheelchairs are damaged daily during flights, according to the US Department of Transportation, which began requiring airlines to report wheelchair and scooter damage in December, 2018.\n\nSince then, monthly reports have consistently shown that an average of around 25–30 mobility devices are damaged each day across US domestic flights. But Australia lacks transparent recording or reporting of such incidents.\n\nADVERTISEMENT\n\n\"It’s just frustrating to have sat in the Disability Royal Commission several years ago, and we're talking about this. While things are improving, they aren’t improving fast enough,\" she said. \"We need disability-led policy and procedural reforms, and to ensure everyone has access to repairs, not just people who can be the squeaky wheel.\"\n\nIn a letter given to Zoe by Qantas, seen by Yahoo, a representative asked her to take her \"damaged bag\" to an authorised repairer. \"If this is not convenient, please forward a quote for the repair with this letter to your nearest Qantas office for review,\" it said.\n\nQantas responds to allegations\n\nSpeaking to Yahoo on Wednesday, a Qantas spokesperson \"sincerely apologised\" for the ordeal.\n\n\"We sincerely apologise to Ms Simmons for the damage caused to her wheelchair. We know how critically important mobility aids are, and we are investigating how this damage occurred,\" they said.\n\nADVERTISEMENT\n\n\"We are working closely with Ms Simmons to ensure the repairs are facilitated as soon as possible.\"\n\nAfter Yahoo's enquiries, Zoe said Qantas reached out to her again. She said their designated repairer doesn't service her type of wheelchair. \"I then gave them the details of a repairer I know will work, but see all the hoops and onus and exhaustion here, when this stuff happens every day,\" she said\n\n\"I’m not mad for myself — I am mad for every disabled person who experiences this, in whatever way that might look like,\" she said. \"I am not that angry about my chair. What I’m angry about is that this is what we are expected to put up with — and much, much worse — every time we fly.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/calls-for-road-rule-change-after-devastating-accident-involving-caravan-i-lost-everything-231629869.html",
        "title": "Calls for road rule change after devastating accident involving caravan: 'I lost everything'",
        "publish_date": "2025-06-03T23:16:29Z",
        "category": "finance",
        "authors": [],
        "text": "There are calls for certain drivers to be banned from getting behind the wheel of larger vehicles and for restrictions on towing caravans and boats.\n\nThe heartbroken loved ones of a young Australian bystander who was struck down in an unimaginable \"freak\" five-car crash accident last year are pushing for urgent changes to road laws to prevent others from suffering a similar fate.\n\nZach Wilson, 27, from Little Mountain on the Sunshine Coast, happened to be working on the side of the road when a ute towing a caravan allegedly veered into oncoming traffic, striking five other vehicles in Mooloolaba on October 4. The driver of the ute was believed to have suffered an epileptic fit behind the wheel, resulting in him completely losing control.\n\nOne of the vehicles hit a parked car as a result of the impact, which was then pushed onto Zach. He was pinned beneath the vehicle for some time before being transferred to hospital, where he later died from brain injuries. Zach, a council garden worker, had recently become engaged to his partner Lucy, who is spearheading the calls for change.\n\nZach Wilson died after a driver towing a caravan suffered a medical episode behind the wheel and crashed into five other vehicles, one of which struck him. Source: ACA\n\nHeartbroken family's plea after unimaginable tragedy\n\nLucy, along with her mother Jodie and Zach's mother Mary, believe Queensland's road rules should be updated to limit the weight that drivers with medical conditions can operate. Currently, drivers are required to inform authorities if they have a medical condition, though there are no specific regulations governing what types of vehicles they are allowed to drive or tow.\n\nADVERTISEMENT\n\nThe family believe that if the driver of the ute had been in a smaller vehicle, he would not have ploughed through four cars and then hit a fifth vehicle with such force. Because he allegedly had four tonnes of weight behind him, he was effectively a \"battering ram\", they said.\n\nThey have launched a petition to push for more restrictions on drivers with known medical conditions, including limiting vehicle types, restrictions on towing and a ban on bull bars.\n\n\"Immediate action is crucial to prevent further tragedies and ensure that the privilege of driving comes with the responsibility to protect others on the road,\" the petition says.\n\nZachary David Wilson, 27, was due to marry his fiancée Lucy. Source: Facebook\n\nEight months on, Lucy is still struggling to come to grips with the unfathomable tragedy. \"I will love him for the rest of my life, but I will never get to love him again,\" she told A Current Affair in an interview aired overnight, adding that the couple were due to move in together, and now be on their honeymoon.\n\nADVERTISEMENT\n\n\"I wanted to live my life with Zach, and I won't get to ... I've lost everything.\"\n\nLucy said that if the laws had been different at the time of the accident, Zach might still be alive.\n\n\"If [the ute owner] was driving a smaller car, he would have hit the first car, and that would have been the end of it,\" she said. \"It wouldn't have gone on for 200 metres and hit Zach. If he were in a smaller car, he would still be alive.\"\n\nThe tragedy of the accident weighs heavy on Mary every day.\n\n\"It's my absolute worst nightmare. I'm just trying to survive each day, I'm actually living in hell,\" she said. \"Our lives will never be the same ever again, and so much has been lost.\"\n\nZach, a council gardener, is being remembered as a beloved son and incredible human being who left a family struggling to cope with the loss. Source: Facebook\n\nThe family are urging the Queensland government to limit drivers with medical conditions to only be allowed to operate smaller, lower-powered vehicles like sedans; ban bull bars due to their heightened risk in crashes, and restrict the towing of heavy loads such as caravans and boats.\n\nADVERTISEMENT\n\nIn addition, they are calling for the introduction of accountability measures to ensure drivers with known medical conditions are held responsible if those conditions contribute to an incident.\n\nAt the time of writing, the petition has more than 1,200 signatures.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]