[
  {
    "url": "https://www.9news.com.au/national/china-tariffs-australian-beef-caught-by-new-restrictions-on-imports/d9bece5c-0459-4aab-9da4-62462c5720c8",
    "title": "Aussie cattle farmers dealt blow as China slaps cap on beef imports",
    "publish_date": "Thu, 01 Jan 2026 14:29:22 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "Australian cattle farmers have been dealt a blow after China announced it would cap beef imports to better protect its own producers.\n\nCOVID-era trade ruptures with China had been seemingly repaired in recent years, but 2026 brings fresh frustrations for the beef industry.\n\n\"So we have a billion dollars worth of beef that will need to go to other markets,\" Cattle Australia chair Garry Edwards said.\n\nPrime Minister Anthony Albanese said the government was in talks with China over the new tariffs.﻿ (Nine)\n\nFrom yesterday, China is slapping limits on beef imports from overseas. Anything exceeding the cap will be hit with a 55 per cent tax rate, with the aim by China to protect its own domestic productions.\n\n\"The large volume of beef that's been redirected from the American market into China has gone in there at very low prices, and that's had a direct impact on Chinese beef producers,\" Edwards said.\n\nPrime Minister Anthony Albanese said the government was in talks with China over the new tariffs.﻿\n\n\"This is something that wasn't Australia being singled out. This is a general position that China has put,\" Albanese said.\n\nOpposition Leader Sussan Ley said the Albanese government should have been able to stop the tariffs impacting Australian farmers.\n\n\"Australia should not be included in any of these arrangements when it comes to restrictions,\" she said.\n\nNationals leader David Littleproud called on Albanese and Trade Minister Don Farrell to \"make urgent representations to their counterparts in Beijing\".\n\nCattle Australia chair Garry Edwards. (Nine)\n\nThe unexpected upside for Australian consumers is the possibility that more beef not being sold offshore will result in a surplus that needs to be sold domestically, which could cause prices to be cut.\n\n\"We may see a reduction in domestic beef prices as a result, because you'll see more high-quality beef available within the domestic market,\" Edwards said.\n\nDespite the government's talks with China, Albanese says other countries may just get more Australian beef.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/finance/interest-rates-forecast-predictions-2026-explained/7ca471ef-5078-457d-801d-7db7bb1b0e91",
    "title": "Hike or hold: What's going to happen to interest rates in 2026?",
    "publish_date": "Thu, 01 Jan 2026 05:04:40 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "Twelve months ago, mortgage holders were looking forward to a new year that promised to be full of interest rate cuts.\n\nThe outlook now, though, is considerably bleaker.\n\nThis is what we know about what interest rates might do in 2026.\n\nMichele Bullock and the RBA will be weighing up whether to hold or hike the cash rate early in 2026. (Louie Douvis/AFR)\n\nWill interest rates rise in 2026?\n\nIt's possible, and some banks think we'll get a hike as soon as February 3.\n\n\"With what we know at the moment, I don't think there are interest rate cuts on the horizon for the foreseeable future,\" RBA Governor Michele Bullock said after the central bank's final rates decision of the year on December 9 .\n\n\"The question is, is it just an extended hold from here, or is it a possibility of a rate rise?\n\n\"They are the two things the board will be looking closely at coming into the new year.\"\n\nThose hawkish comments have led a range of economists to tip a rate hike in 2026.\n\nCommonwealth Bank head of Australian economics Belinda Allen says the first meeting of the year will be a live one, and both CBA and NAB are predicting a 25-basis-point increase on the first meeting of the year.\n\nNAB has forecast even more pain, pencilling in a further cut in May.\n\nThe market is more pessimistic.\n\n﻿ The market has been pricing in around a 27 per cent chance of a hike in February (that figure has been both slightly higher and lower throughout late December, but was at zero at the start of the month), and an end-year cash rate of about 4 per cent.\n\nNot everyone agrees with that, though.\n\nThe other half of the big four banks, Westpac and ANZ, are predicting a year of holds, as are some economists.\n\n\"We expect to see the cash rate remain at 3.6 per cent in 2026, with the swing back to rate hikes more a story for 2027,\" AMP chief economist Shane Oliver wrote.\n\n\"But we concede that the risks look like they are now a bit more to the upside on rates in 2026.\n\n\"However, our assessment is that the swing in the money market from expecting 2 or 3 more cuts after the August RBA meeting to now expecting nearly two hikes (in 2026) is premature and a bit too extreme.\"\n\nMortgage holders appear to have little hope for a rate cut in the near future. (Joe Armao/The Age)\n\nWhy aren't interest rates expected to come down?\n\nCasual observers – particularly those with a mortgage – might be wondering why we're suddenly talking about the prospect of rate hikes, not cuts.\n\nAfter all, it was only a few months ago that economists were talking about the cash rate settling around 3.1 per cent.\n\nThe reason for the turnaround is an unexpected surge in inflation.\n\nHaving fallen back into the central bank's target band of 2-3 per cent, the consumer price index (CPI) jumped to 3.2 per cent in the September quarter and again to 3.8 per cent in October, with underlying inflation not too far behind.\n\n﻿ The data-driven RBA will get two new batches of inflation figures before its February decision – for November on January 7 and December on the 28th.\n\nIf inflation cools off, so too will the chance of a rate hike.\n\nBut if it comes in hot once again, then mortgage holders will have every right to feel nervous about the first rates decision of the year.\n\n\"If trimmed mean inflation in the December quarter does not fall back as we expect (and comes in around 0.9 per cent quarter-on-quarter or more), then a hike as early as February is possible,\" Oliver said.\n\n\"December quarter CPI inflation is the key to what happens early next year on rates.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/success-tips-from-australias-top-entrepreneurs-jane-lu-jim-penman-sophia-begg-exclusive/2ba88137-92db-40b1-971e-a53e5deb86d7",
    "title": "The morning habit an influencer, Olympian, and executive all swear by",
    "publish_date": "Wed, 31 Dec 2025 20:37:46 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "Exclusive: Morning workouts, 5am alarms, ﻿and time spent with the kids.\n\nThese are the morning routines some of Australia's most successful people swear by, from 21-year-old influencers turned brand founders, to former Olympians, and high-powered executives.\n\nNine.com.au sat down with seven of the country's sharpest entrepreneurs, founders and CEOs to ask how they start their days to set themselves up for success.\n\nHere's what each of them said.﻿\n\nSophia Begg is one of Australia's most recognisable young influencers and co-founder of fashion brand All For Mimi. (Instagram/@allformimi)\n\nSophia Begg, influencer and co-founder of fashion brand All For Mimi\n\n\"I love to start the day with a morning walk with my partner before making my Tropeaka matcha to enjoy a quiet moment before the chaos!\"\n\nMichael Schneider, Bunnings managing director﻿\n\n\"Retailers tend to be morning people - trading performance, inventory availability and the like tend to form our habits early.\n\n\"When I'm travelling, early starts are also good for exploring a city or taking in some exercise.\n\n\"At home, it varies depending on the day.\n\n\"Sometimes an early workout is great and occasionally a bit more sleep before coffee and a light breakfast can work a treat.\"\n\n﻿Bunnings managing director Michael Schneider got into the retail sector when his career plans fizzled out. (Supplied)\n\nJane Lu, founder of fashion retailer Showpo\n\n\"﻿I live by my calendar - if it's not in there, it's not happening.\n\n\"It's the only way to stay on top of a busy day and make sure I'm spending time on what actually matters, not just what's loudest.\"\n\nGrant Hackett OAM, ﻿Olympian and chief executive of Generation Development Group\n\n\"I always wake up at the same time, normally 5.15am every morning.\n\nThe only time I don't do that is on the weekends, that's where I get my extra bit of recovery.\n\n\"I noticed that in my swimming career, when my sleep periods were different it just made me flat, so consistency of wake-up time is really important.\n\n\"I have a series of drinks that I have, probably just because of my previous career.\n\n\"I've got a longevity mix, creatine, glutamine, amino acids ... and I have that pre-made the night before so I don't have to think about it in the morning, because I'm not a morning person.\n\n\"Even though everyone thinks I should be because my former career, I hate early mornings, so I have to make it as easy as possible.\n\n\"I've also got a protein shake that's already set up, I have a water bottle, I'm really quite strict on all of that stuff.\n\n\"I'll usually do a 45-minute workout in the morning and then the last thing I do after getting ready is always have breakfast with the kids.\n\n\"I'm not the person who tries to get to the office at 7am and get everything done, because I have really young kids and I always try to have breakfast with them.\n\n\"That's my time at the table with them on weekdays and I feel quite sad when I don't get that time before I leave for work.\"\n\nGrant Hackett was just 20 when he won his first gold medal at the Sydney Olympics. Then he swapped the pool for finance. (Dallas Kilponen)\n\nJim Penman, founder of Jim's Group\n\n\"First I run for half an hour in the treadmill, I do weightlifting and have a cold shower.\n\n\"The other thing I do first thing in the morning is drive my son to school.\n\n\"He's 16 and I've got a busy life I suppose you could say, but I think you should never neglect your family.\n\n\"The time that I spend with Aaron, driving him to school and picking him up is incredibly important.\n\n\"He's a great kid, he's got a very lively mind. We discuss all kinds of different things ... but it's also time to bond with him and hopefully have a bit of an influence.﻿\"\n\nTherese Frangie, chief executive of Oporto\n\n\"With a morning routine. I am a big believer in managing your cognitive load and eliminating decision fatigue.\n\n\"I have a morning routine that is posted on my wardrobe that I've been following for years now; I no longer look at it, I just go into autopilot.\n\n\"I kick off the day at 5am, as this gives me 'me time' as well as allows plenty of time to set myself up for a good day, between parenting and work.\n\n\"By starting my day in this way I am setting myself up for success because I am reliving my brain from making even micro-decisions before the day really starts.\"\n\nTherese Frangie graduated high school with no university offers; now she's the chief executive of restaurant giant Oporto. (Supplied)\n\nDoug Jones, chief executive of Metcash\n\n\"I like to go for a run or a ride or do some exercise, and then I get stuck into it.\n\n\"I'm of South African heritage, so I check my WhatsApp from family and friends because the time difference. And sometimes, if it's Monday, I catch up on a little bit of sports news.\n\n\"But I'm not one for cold plunges and meditations. I like to just get into the day.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/sam-kerr-wedding-kristie-mewis-private-ceremony-perth-new-years-eve/3dcc8a30-a23f-487c-98d3-7ef9cfec26a5",
    "title": "Sam Kerr and Kristie Mewis marry in private ceremony in Perth",
    "publish_date": "Wed, 31 Dec 2025 10:18:54 +0000",
    "category": "sports",
    "authors": [
      "Dec"
    ],
    "text": "Australian football legend Sam Kerr has wed fellow sports star Kristie Mewis in a private ceremony in Western Australia.\n\nThey exchanged vows in Kerr's hometown of Perth on New Year's Eve, capping off a gigantic year for the pair who welcomed their first child, son Jagger, in May.\n\nMewis walked down the aisle dressed in white, with a long-flowing veil, as guests watched in the evening sun.\n\nSam Kerr in black tuxedo and baby bottle in hand. (Nine)\n\nKristie Mewis walked down the aisle dressed in white, with a long-flowing veil (Nine)\n\nKerr, in a black tuxedo, was seen arriving at the ceremony with a baby bottle in hand.\n\nJagger was carried down the aisle by his Matildas mum, something Mewis admitted ahead of the event would leave her in tears.\n\n\"That's going to be gut-wrenching for me. I will sob when that happens,\" Mewis said days ago.\n\nThe wedding was held at a private home with about 120 guests.\n\nThe Australian icon and US footballer began dating in 2021, revealing their relationship publicly during the Tokyo Olympics, when Mewis comforted Kerr on the field.\n\nThey got engaged in 2023 after weeks of speculation.\n\nSam Kerr and Kristie Mewis were engaged in 2023. (Instagram/@samanthakerr20)\n\nSam Kerr and her son Jagger. (Instagram/ @samanthakerr20)\n\nThey jointly announced the news on Instagram, with photos of Kerr down on one knee and the simple caption: \"September 1st, 2023\".\n\nThe pair welcomed Jagger Mewis-Kerr in May, telling fans via Instagram, \"Our little man is here\".\n\nIn the day before their nuptials, Mewis did most of the social media sharing. The day before the wedding she posted a series of photos of her and Kerr in white outfits perfect for a wedding, with the caption \"tomorrow\" and emojis of a smiling face with tears in its eyes and a red love heart.\n\nKerr shared a photo of the couple in the gym the day before the big day, the Australian sporting icon quipping: \"Last day I ever have to hear about the wedding shred.\"\n\nThe couple are expected to delay their honeymoon due to football commitments.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/how-to-save-money-on-groceries-cheapskates-club-cath-pantry-tips-meal-planning/c47f6860-7e1d-43d3-b4e0-0b5311240dfd",
    "title": "Cath restocks her pantry once a year. She's already planned her meals for 2026",
    "publish_date": "Tue, 30 Dec 2025 19:28:31 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Cath Armstrong is not a fan of grocery shopping, so the Victorian mum uses a method that allows her to do it as little as possible.\n\nEach year between December 27 and 30, the founder of the popular Cheapskates Club dedicates a few days to a yearly shop to save her \"time, grey hairs, frustration and stress\".\n\n\"I loathe grocery shopping,\" Armstrong said.\n\nThe bulk of Cath Armstrong's grocery shopping for the entire year is done in just three days. (Polly Hanning/Nine/Cheapskates Club)\n\n﻿\"People wander up and down, they park their trolleys, they stop in the middle of the aisles, it nearly sends me spare.\"\n\nArmstrong switched from a weekly shop to a monthly shop years ago to avoid the chore but had to rethink her approach when life became busier with work and family.\n\n\"I stretched it out to three months, then I thought, 'Well, I can do this for six months',\" she said.\n\n\"When I hit shopping once every six months, it was just bliss.\n\n\"It took a full day but then it was just one day and for six months I didn't have to go back.\n\n\"Then I thought 'I'm going to try this for a whole year'.\"\n\nArmstrong, pictured on A Current Affair in 2015, has shared her money-saving tips with Australians for decades. (A Current Affair)\n\nArmstrong now does a yearly pantry re-stock and smaller fresh food shops every few weeks.\n\nThe annual shop costs about $1200 and consists of enough staples for her family for the year.\n\n\"All I simply did was look back over what I'd been buying and multiplied everything so it equaled a year's worth,\" she said.\n\nArmstrong finds her calculations are \"pretty accurate\", which helps her avoid food waste.\n\nDuring the yearly shop, she buys mostly generic brands from Aldi, Coles and Woolworths.\n\n\"It doesn't take up a lot of space, I've got one shelf unit in my laundry and that's about it,\" she said.\n\nREAD MORE: Cash boost for more than a million Australians\n\nArmstrong's grocery shopping method allows her to cut down on trips to the supermarket. (A Current Affair)\n\nArmstrong also comes up with an annual meal plan, which follows a similar pattern every week.\n\nDuring a typical week, the family will have a roast dinner on Sunday, meat and vegetables on Monday, pasta on Tuesday, meat and vegetables on Wednesday, homemade pizza on Thursday, fish on Friday and Mexican food on Saturday.\n\nShe then shares dinner ideas with thousands of Cheapskates Club followers to help them slash their grocery bills and navigate meal times with ease.\n\nFood is one of the biggest household expenses for Australian families but making small changes to the way you shop can have a big impact on your budget in the new year.\n\nBut Armstrong emphasises people don't necessarily need to go shopping once a year to reap the benefits.\n\n\"I try to tell people just because I do something doesn't mean it's right for you,\" she said.\n\n\"Pick the things that work for you and keep doing them.\"\n\nAustralian grocery shopping habits have changed\n\nWhen you enter a supermarket, every product is competing for your hard-earned cash.\n\n﻿From the essentials to the treats on the end-of-aisle displays, shop layouts are designed to get you to spend more, according to University of Sydney retail expert Lisa Asher.\n\n\"All of these key ingredients that we would normally buy, they're all so far apart that you have to cross the store often,\" Asher said.\n\n\"That causes you to go down the back aisle or go down the front aisle.\n\n\"You're seeing these end displays, which prompt impulse purchases.\n\n\"They're designed to make you buy and they're very effective.﻿\"\n\nSupermarket layouts are designed to maximise customer spend. (Getty)\n\nAnother factor that contributes to impulse spending is the current economic climate.﻿\n\n\"The use of promotions has become more prevalent and people, through the cost-of-living crisis, have become more deal-prone,\" Asher said.\n\n\"We've shifted from everyday low pricing, although there are everyday low products, but you've really got to look for them.\n\n\"This shift to half price, it hasn't always been like this.\"\n\nGrocery shopping habits have also changed in Australia, which has increased the likelihood of impulse buying.\n\n\"It used to be that people might do one big shop a week or once a fortnight,\" Asher said.\n\n\"The more frequently people are going now, the more there's temptation.\"\n\nSimple ways to save\n\nArmstrong has shared her money-saving tips with thousands of Australians for decades to help them live \"debt-free, cashed up and laughing\".\n\nFor Australians who want to reset their budgets in the new year, she offers a few simple suggestions to kick-start the journey.\n\nHer first tip is to take a look at your utility bills and see if there is a better deal.\n\n\"Don't be afraid to swap, it's really easy, it's painless,\" she said.\n\nHer second tip is to adjust your grocery shopping habits as necessary.﻿\n\n\"If you shop weekly, think about moving to fortnightly or monthly,\" Armstrong said.\n\n\"If you don't try it, you'll never know.\"\n\nHer third tip is to write a shopping list, take it to the supermarket and stick to it.\n\n\"If you've forgotten something, add it to the list for next time and make do,\" she said.\n\n\"The less money you spend in the shops, the more money you're going to keep in your purse.\"\n\nThe information provided on this website is general in nature only and does not constitute personal financial advice. The information has been prepared without taking into account your personal objectives, financial situation or needs. Before acting on any information on this website you should consider the appropriateness of the information having regard to your objectives, financial situation and needs.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/china-smog-cleanup-affects-global-warming-australian-rain-heat/106177394",
    "title": "China's anti-pollution crusade linked to Australian bushfires",
    "publish_date": "Fri, 02 Jan 2026 00:59:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "Just weeks before the 2008 Beijing Olympics, Chinese authorities restricted half of all private cars from the city's roads, alternating daily bans for number plates ending in even and odd numbers.\n\nThe radical move was just one of a suite of measures aiming to curb the city's choking smog, alongside factory closures and halts on construction.\n\nOver decades of intensive development, residents had become accustomed to smog that not only caused untold respiratory and health problems but was also threatening to derail the Games.\n\nA view from the ABC's office in Beijing on the eve of the 2008 Olympics opening ceremony. (ABC)\n\nEven after the haze cleared, complaints by athletes and visiting media clouded the Games' legacy, spurring a renewed campaign of pollution reduction in China.\n\nAs China's economy kept growing after 2008, its emissions of aerosols — small particles in the air, distinct from greenhouse gases — peaked and then dropped rapidly.\n\nAerosols can include particles emitted by burning fossil fuels, others by volcanic eruptions or bushfires — even airborne sea salt is considered an aerosol.\n\nWhen enough of them are concentrated in one place, haze can become visible, and weather conditions, including temperature and rainfall, may be impacted.\n\nLikewise, when emissions are reduced, that can cause a significant change, too.\n\nSuch has been the success of China's air-cleaning effort since the 2010s that researchers have now linked it to changes in weather far beyond its borders, including in Australia.\n\nResearchers have also tied it to global temperature rises as the aerosols' masking effect on global warming is diminished.\n\nReflecting heat, changing rain\n\nUnlike greenhouse gases, which trap heat in the atmosphere, most aerosols reflect sunlight away from Earth and produce a cooling effect.\n\nCSIRO scientist Melita Keywood likened their effect to the colour of a roof over a home.\n\n\"[Sulphate aerosols] are like a white roof that reflects light, but a black roof absorbs heat,\" she said.\n\n\"In some countries where it's cold, you might want to have a black roof, but in Australia you probably want to have a white roof.\"\n\nDark roofs linked to hotter homes Research has found dark-roofed homes are as much as 10 degrees warmer than homes with light-coloured roofs.\n\nMany aerosols also interact with water vapour in the air, affecting clouds and rainfall both positively and negatively.\n\nLate in 2025, a team of Chinese researchers published a paper linking Australia's hot and dry weather in the 2010s to China's aerosol reductions.\n\nThey found weather systems were impacted thousands of kilometres across the Pacific, reducing moisture across large parts of Australia and significantly raising the risk of bushfires in all states and territories.\n\nDespite Australia's relatively high rainfall since 2020, Nanjing University of Information Science and Technology professor Yang Yang, who was among the study's authors, said changes in China have continued to impact Australian weather.\n\n\"The marked increase in Australian rainfall after 2020 does not invalidate conclusions about the influence of Chinese aerosols on Australia's climate,\" he said.\n\n\"Rather, it indicates that during this later period, large-scale climate variability exerted a stronger influence.\"\n\nMultiple climate scientists said more work was needed to properly understand the effect of China's emission reduction on Australian weather.\n\n\"[2019] came at the end of a three-year drought, so you've got to be really careful in drawing too many conclusions from that,\" University of Southern Queensland's Tim Cowan said.\n\nNonetheless, some researchers have argued the effect of China's clean-up has been felt even further afield.\n\nFrom China across the globe\n\nLast year, a team of mostly European climate scientists labelled East Asian aerosol reductions as the biggest reason for the acceleration of global warming since 2010.\n\nOne of them, Finnish Meteorological Institute researcher Joonas Merikanto, said China's changes had disrupted continental weather patterns, spreading the impact.\n\n\"It affects the local circulation patterns over the Pacific and, for example, influences the monsoon precipitation over the Asian region,\" he said.\n\nJoonas Merikanto says China's pollution clean-up has accelerated global warming since 2013. (Supplied: Joonas Merikanto)\n\nScientists frequently liken the impact of removing pollution to \"unmasking\" or \"revealing\" warming that had already been caused by greenhouse gas emissions.\n\nDecades before China's emissions peaked, Europe's effort to cut pollution demonstrated this effect.\n\n\"[Europe] was heavily polluted in the 80s,\" Leipzig University professor of theoretical meteorology Johannes Quaas said.\n\n\" I grew up in an industrial area. I know the smell of sulphuric acid in the air from playing as a child outside when I shouldn't. \"\n\nClimate scientist Karsten Haustein estimated that most central European countries have experienced almost 3 degrees Celsius of warming since pre-industrial times, exacerbated when the cooling effect of that pollution was removed.\n\n\"Probably a bit more than a degree of extra warming was essentially just hidden by the aerosols,\" he said.\n\nHazy understanding\n\nIn 2024, Tim Cowan was among a group of researchers who found Asian aerosol emissions had increased Australia's monsoon rainfall in the decades before China's historic clean-up.\n\n\"Observations show a significant increase in Australian summer monsoon rainfall since the mid-twentieth century,\" the researchers wrote in a paper published in The Journal of Climate.\n\n\" Our results suggest that Asian anthropogenic aerosol emissions played a key role in the observed increase in Australian summer monsoon rainfall from 1930 to 2014. \"\n\nIn 2024, researchers found Asia's aerosol emissions had strengthened Australia's monsoon rains in preceding decades. (Supplied: James Cobain)\n\nThis aligns with Professor Yang's assertion that China's reduction of its aerosol emissions had the opposite effect on Australian rainfall from 2013.\n\nHowever, there are relatively few papers besides these to compare the results.\n\nDr Cowan said Australia was probably not pulling its weight in aerosol research.\n\n\"I can only name a handful of people that have looked at aerosols since the time I finished my PhD [in 2015],\" he said.\n\nDr Keywood agreed Australia had not placed as much research attention on aerosols as other countries and said they would become more important as the climate warms.\n\n\"It's something that's kind of always been in the hard basket because it's quite [computationally] intensive,\" she said.\n\nThis is particularly true when studying rainfall, one of the most closely watched weather statistics in Australia.\n\nKnowing how Australian rain might be affected by Chinese aerosols is made harder by the different effects of the particles and complex weather systems transporting them across the Pacific.\n\n\"One of the key things you need to produce rain is a cloud condensation nuclei particle, and it turns out that the things that are really good at that are like sulphate,\" Ms Keywood said.\n\n\"But [other aerosols] like black carbon don't like water.\"\n\nBlack carbon is emitted by industrial processes, agricultural burning and diesel engines. (ABC)\n\nMore changes coming\n\nWhile scientists unpack the consequences of China's dramatic smog reversal, more of Australia's Asian neighbours are seeking to emulate its success.\n\nIn India and Bangladesh, air pollution is a persistent and deadly problem linked to millions of excess deaths each year and increasingly acidic rainfall.\n\nClimate experts agree it is imperative to reduce the pollution, but acknowledge it will likely increase heating and extreme weather in the South Asian region.\n\n\"From the temperature point of view, there will definitely be a local increase,\" Dr Haustein said.\n\n\" If we remove the [aerosols it] means more flooding in Bangladesh, and in India, maybe issues with the pre-monsoon, which is really important for agriculture. \"\n\nKarsten Haustein says emissions from Asian countries like China and Indonesia affect Australian weather differently. (Supplied: Swen Reichhold)\n\nHowever, when asked how this might affect the Pacific and Australia, Dr Haustein was hesitant to make such clear predictions.\n\n\"Disentangling the remote effects [of aerosols], not only the regional effects … it's crazy difficult,\" he said.\n\nOnly 2,000 kilometres from Australia, Indonesia's capital Jakarta, now recognised by the UN as the world's largest city, also ranks among the most polluted metro areas.\n\n\"I think the issue now for Australia is we feel like we're fairly far removed from the problem [of aerosol pollution],\" Dr Cowan said.\n\n\"I think our understanding of the role aerosols play in driving our climate I think it's fairly rudimentary.\"",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/china-beef-import-tariffs-australian-trade-industry-economy/106192982",
    "title": "Is China trying to start a trade war with Australia?",
    "publish_date": "Fri, 02 Jan 2026 00:59:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "In some of the darkest days in the political relationship between Australia and China, trade became a tool to inflict pain.\n\nThe early 2020s trade war saw China slap higher tariffs on Australian wine and barley, impose biosecurity measures against beef and timber and ban lobsters and even some coal.\n\nIt took four long years for the trade relationship to be resolved, and even longer for the political friendship to be rekindled.\n\nBut the devastating consequences from that time still cast a long shadow of lingering fear within trade circles.\n\nSo, it's no wonder panic is rippling across the industry since Beijing slapped huge new tariffs on Aussie beef this week.\n\nAustralian beef, seen on shelves in the US, was exported at record levels this year. (Supplied: Dalene Wray)\n\nFears of larger trade crackdown\n\nQuestions were immediately raised about whether this was a result of political breakdown between the two countries, despite the relationship appearing healthy and thriving.\n\nAnd the bigger fear is whether this could be the start of a larger trade crackdown by Beijing.\n\nThe answer, as with most issues in China, is rarely simple.\n\nChina's Ministry of Finance and Commerce announced that from the start of 2026, several countries, including Australia, would be impacted by new beef import tariffs.\n\nThe trade measures included a new 55 per cent fee on beef imports that exceeded an annual quota. A quota that has been exceeded by a large margin in the past.\n\nChina's commerce ministry on Wednesday explained the tariffs, also impacting Brazil and the United States, were designed to protect the burgeoning domestic cattle industry from oversupply.\n\nIn other words — China wants more of its people to eat its own beef, and not the prized stuff from overseas.\n\nLoading\n\nAustralian industry 'disappointed'\n\nThe announcement sent a wave of anger through Australia's beef industry, which said it was \"extremely disappointed\", and suggested Australian leaders needed to go in to fight against Beijing.\n\nBut if you've looked at China's domestic economy recently, the move shouldn't come as much of a surprise.\n\nChina's domestic economy is in deep trouble, plagued by a real-estate crisis, local government debt, and a slowdown in manufacturing and infrastructure investment.\n\nChina's consumers are also saving more and spending less.\n\nTo combat its sluggish financial sector, Beijing has been focusing on stimulating local industries — including beef — to boost local capacity and demand.\n\nBut as local production has climbed, so too has the importation of more treasured foreign beef, resulting in an oversupply and driving down local prices.\n\nThis week's announcement is Beijing's attempt to address that, by using trade policy to reach its very public goals of boosting domestic economic growth.\n\nChina is facing extra pressure right now to improve its local fortunes, as it stares down threats from major overseas partners, like the European Union, which is threatening its own tariffs after a surge in Chinese imports.\n\nLoading...\n\nA crucial domestic market\n\nWith China's export market under threat, its domestic market becomes more important than ever.\n\nAustralia's beef export industry says it is no threat to China's local production, but China clearly disagrees.\n\nIn fact, in the last year, Australian imports of beef have surged into Beijing in levels not seen since before the COVID-19 pandemic, mostly filling a gap left by US beef after Donald Trump unleashed a tit-for-tat tariff war.\n\nThe new quota set by China for Australian beef in 2026 is almost exactly the same as the quota for 2025, which Australia exceeded by about 100,000 tonnes.\n\nThat is about a third of Australia's beef export total to China in the last year.\n\nBut in several successive years before 2025, Australia's beef export capacity was always well below threshold levels.\n\nIt's likely Beijing's new measures are aimed at trying to rein in an Australian surge and managing local growth, rather than a direct target on Australia.\n\nPrime Minister Anthony Albanese doesn't seem too concerned about the change and isn't likely to take this as a political fracture in his relationship with China's leader Xi Jinping.\n\nAnd although there's no overt political undertone to these new tariffs, there is still one important message: global trade is increasingly delicate, especially as Beijing sets its sights on becoming the largest and most powerful economy in the world.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/weekly-news-quiz-january-2/106194248",
    "title": "Weekly news quiz: Ravenous ladybirds, a grumpy seal and a unique home",
    "publish_date": "Fri, 02 Jan 2026 00:54:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "As we start the new year, take some time out to explore some of the other stories you might have missed this holiday period.\n\nLoading\n\nWhere to find all the ABC's quizzes\n\nWant to test yourself even further?\n\nTake a squiz at the ABC's New Quiz topic page and see if you're a whiz at our previous quizzes.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/clark-mp-helen-burnet-quits-tasmanian-greens/106194134",
    "title": "Helen Burnet quits Tasmanian Greens to sit on crossbench",
    "publish_date": "Thu, 01 Jan 2026 23:53:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Clark MP Helen Burnet has quit the Tasmanian Greens to sit in state parliament's lower house as an independent, saying it is necessary to be as \"effective as possible\" in her role.\n\nMs Burnet, who has been a member of parliament for less than two years, said \"this is not a decision that has been made in haste\".\n\n\"I know this will be disappointing for some and perhaps not unexpected for others,\" she said.\n\n\"I resign from the Greens with the clear intention of being more effective, accountable and heard on matters that are important to our state and the community of Clark.\"\n\nHer departure from the Greens leaves them with four MPs in Tasmania's lower house, and one upper house member.\n\nMs Burnet (far right) was first elected to the Tasmanian parliament as part of the Greens contingent in the 2024 state election. (ABC News: Jonny McNee)\n\nGreens leader Rosalie Woodruff and the rest of the party were notified by Ms Burnet this morning.\n\nDr Woodruff has not commented on Ms Burnet's departure\n\nMs Burnet thanked Greens party members and volunteers, acknowledging the decision \"would not sit well with many of you\".\n\n\"While I will make my voice heard in a different way, my beliefs and values remain the same,\" she said.\n\nLoading...\n\nBurnet 'frustrated' by airtime for constituent issues\n\nMs Burnet said quitting the Greens was necessary to be able to \"amplify\" the concerns of her electorate, including about the cost of living, public transport, the stadium and water quality.\n\nAsked why she could not advocate for those concerns within the party, she said she had been raising her concerns with Dr Woodruff since before last year's state election.\n\n\"I've been frustrated about not being able to get my voice heard on those matters,\" she said.\n\nMs Burnet says her intention is to become \"more effective, accountable and heard on matters that are important to our state\". (ABC News: Ebony ten Broeke)\n\nPressed on what she had wanted the Greens to do to keep her on side, she said there were issues she wanted to bring to the parliament with a \"much louder\" voice.\n\nMs Burnet said she would not be doing any deals with the government, and that she had told the premier she would be applying the same scrutiny as she had previously.\n\nFormer deputy mayor turned state politician\n\nAt the 2025 state election she was the fifth member to win a seat in Clark, re-elected with 0.56 quotas on first preferences.\n\nPreviously, she was Hobart's Deputy Mayor for seven years, and spent 19 years serving on the council.\n\nShe grew up in the South Australian town of Hahndorf and moved to Tasmania in 1994. She has a background as an allied health worker.\n\nShe remains the deputy speaker of the lower house.\n\nFederally, two senators have quit the Greens in recent years — with Dorinda Cox moving to Labor following last year's election, and Lidia Thorpe sitting as an independent since 2023.\n\nLast year, South Australian MLC Tammy Franks left the Greens to sit in the state's upper house as an independent.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/qld-lachie-neale-steps-down-as-brisbane-lions-co-captain/106194176",
    "title": "Lachie Neale steps down as Brisbane Lions co-captain",
    "publish_date": "Thu, 01 Jan 2026 23:34:50 +0000",
    "category": "sports",
    "authors": [],
    "text": "Brisbane Lions dual-premiership-winning co-captain Lachie Neale has stepped down from his leadership position, following a \"challenging personal period\", the club has revealed.\n\nHis teammates were informed on Friday morning of the decision, as the club prepares for a tilt at a third straight AFL title in 2026.\n\nThe 32-year-old's decision to step down follows weeks spent in the headlines over a rumoured marriage split with his wife, Julie.\n\nThe two-time Brownlow Medal winner addressed the media on Friday.\n\nLachie Neale celebrates with wife Jules after the 2025 Grand Final. (AAP: Joel Carrett)\n\n\"I understand interest in my personal life, but these are personal matters,\" he said.\n\n\"I can confirm that Jules and I have separated. I have let my family down and I apologise for my actions, which have hurt those closest to me.\n\n\"I accept that this is a consequence of my actions, and I need to rebuild the trust with Jules.\"\n\nIn an earlier statement, the Brisbane Lions said Neale had \"determined this was the best move for him and the club following a challenging personal period\".\n\nLachie Neale and wife Julie at the 2023 Brownlow Medal event at The Gabba. (Getty Images: Albert Perez)\n\nThe midfielder, who has played 294 games for the Lions and Fremantle Dockers, has been Brisbane's co-captain for the past three seasons, alongside Harris Andrews, after the pair took over from Dayne Zorko.\n\nNeale said it was \"time for the club to move forward with a fresh start\".\n\nBrisbane Lions football boss Danny Daly acknowledged Neale's decision to step down.\n\n\"Being a captain of the Brisbane Lions comes with a high level of expectation and commitment to uphold our club values and lead by example,\" Daly said in a statement.\n\n\"We thank Lachie for his contribution as a leader of our club for the past three seasons during a highly successful period and look forward to Lachie remaining an important part of our club in the future.\"\n\nLachie Neale was the sub in the Brisbane Lions' Grand Final win over Geelong. (Getty Images/AFL Photos: Robert Cianflone)\n\nNeale produced a miracle comeback from injury to help the Lions win last year's Grand Final against the Geelong Cats.\n\nHe was initially ruled out for the rest of the 2025 season after suffering a calf injury in the club's qualifying loss to the Cats, but then proved his fitness in just a few weeks to be named as the sub in the premiership victory.\n\nHe starred for Brisbane in the clash, despite playing just half of the match, gathering 17 disposals, seven clearances, and kicking a crucial goal on the stroke of three-quarter time.\n\nNeale joined the club as a prized recruit in 2019, being traded from the Fremantle Dockers after spending seven seasons in Western Australia.\n\nHe is off contract at the end of this season and will become a free agent.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/usman-khawaja-retirement-cricket-career-legacy-analysis/106092620",
    "title": "Khawaja's on-field brilliance pales in comparison to his true impact",
    "publish_date": "Thu, 01 Jan 2026 23:01:02 +0000",
    "category": "sports",
    "authors": [],
    "text": "The signs were evident early on in Usman Khawaja's career that he would do things his own way.\n\nKhawaja made his international debut for Australia in the 2011 New Year's Test against England in Sydney — during an Ashes series that was otherwise quite forgettable from an Australian perspective.\n\nComing in to the Australian side to replace injured skipper Ricky Ponting, Khawaja became the first Australian Test debutant to bat at number three since Justin Langer 18 years prior and quickly made an impression.\n\nKhawaja replaced the injured Ricky Ponting (right) when he made his debut in the final Test of the 2010-11 Ashes. (Getty Images: Hamish Blair)\n\nFacing up to towering English paceman Chris Tremlett, Khawaja neatly flicked the first ball of his Test career off his hips for two before sending his second ball screaming to the boundary via a full-blooded pull shot.\n\nThe first eight balls of Khawaja's Test career yielded 15 runs. The fluency and audacity of the young Khawaja was a far cry from the dogged veteran fighter he would become later in his career.\n\nThat New Year's Test — which England won by an innings and 83 runs — has gone down in infamy if you're Australian, and in folklore if you're English. Before last month's Boxing Day Test, it was England's most recent Test win Down Under.\n\n'My greatest blessings': Khawaja's emotional retirement message Australia batter Usman Khawaja will retire after the fifth and final Ashes Test at the SCG, which starts on Sunday.\n\nIn Australia's side on that occasion, alongside Khawaja, were fellow youngsters Steve Smith and Phillip Hughes. The trio should have formed the backbone of a strong Australian batting line-up for the decade and a half that followed but would play just one further Test together before Hughes's tragic death in November 2014.\n\nKhawaja will retire having played 88 Tests for Australia, yet it feels as if he could've easily played 20 more.\n\nSmith is currently at 122 Tests and counting, while David Warner — who made his Test debut shortly after Khawaja — retired having played 112. Nathan Lyon — who also debuted in 2011 — currently has 141 Test appearances.\n\nKhawaja's numbers in the one-day format also suggest he should have logged far more than 40 ODI appearances for his country — with the last of those coming in the 2019 World Cup.\n\nLike many a prodigious young Australian cricketer, Khawaja was axed from the Test team early on and faced a constant uphill battle to become a regular fixture in the side during the first half of his career.\n\nSince his debut at the start of 2011, Khawaja endured through four separate calendar years where he didn't play a single Test for Australia — two of those came in 2020 and 2021 as Australia trialled a conveyor belt of openers alongside Warner.\n\nKhawaja (left) and Warner became a prolific opening partnership from 2022. (Getty Images: Ryan Pierse)\n\nCould Khawaja have played more throughout that period? His Shield numbers from the seasons he wasn't selected aren't all that favourable, and Khawaja would likely argue that being ignored for those two years led to what came afterwards.\n\nOnce Khawaja was reinstated for the New Year's Test in 2022 against England, he did not leave any room for doubts over whether he belonged at the top level, becoming one of the most prolific Test openers in the world.\n\nFor someone who has been in and out of Australia's Test side since making his debut, Khawaja's career numbers are gaudier than you think.\n\nKhawaja will have a chance at the SCG to add to his 16 Test centuries for Australia. (AP Photo: Eranga Jayawardena)\n\nHis 6,206 Test runs are more than the career marks of Adam Gilchrist, Ian Chappell and Bill Lawry, with a chance to surpass Michael Hussey if he scores just 30 next week. He also has more Test centuries (16) than Damien Martyn, Michael Slater and Dean Jones.\n\nImportantly, Khawaja's game has travelled well throughout his Test career, with seven of his Test tons coming outside of Australia in India, England, Sri Lanka, Pakistan, New Zealand and the UAE. For comparison's sake, Warner scored just six — three in South Africa, two in Bangladesh and one in Dubai.\n\nKhawaja's overall average outside of Australia is 40.18 and his 48.05 average as an opener, where he played half his Tests, are both figures comparable to some of the great top-order players in Test history.\n\nYet it's likely that all those numbers will pale in comparison to what his true generational impact has been as Australia's first Muslim Test cricketer.\n\nDespite Australia being a proudly multicultural nation, its men's cricket team has historically been one devoid of diversity.\n\nIt was only in last year's Perth Test that two Indigenous players — Brendan Doggett and Scott Boland — represented Australia's men's side in a Test match for the first time, a record fellow Indigenous paceman Jason Gillespie suggested the country shouldn't be proud of.\n\nThe Pakistan-born Khawaja has importantly understood his platform as a trailblazer in the Australian men's cricket team.\n\nLoading Instagram content\n\nHe has not been shy about speaking openly about the struggles he faced as a person of colour coming through the ranks, and the systemic issues surrounding cricket's pathways programs that have held back others like him.\n\nKhawaja is proudly and unapologetically Muslim and has explained how his faith has helped his career. His presence has raised awareness of Islam within the Australian team. Khawaja's teammates often celebrate series wins with non-alcoholic champagne out of respect for his faith.\n\nHow Usman Khawaja is changing the face of Australian cricket Trailblazer Usman Khawaja talks about racism in cricket and urges Cricket Australia to diversify for the sake of the game.\n\nThe Test team hasn't traditionally been a place where centuries have been followed by celebrations borrowed from LeBron James, yet Khawaja has slowly changed those rigid norms too.\n\nKhawaja has been more than happy to break ground as someone of a South Asian background in a predominantly white space. His ability to deal with all that comes with the territory makes it easier for the next Usman Khawaja coming through the ranks in future generations.\n\n\"Never let anyone convince you that you can't, because if they do convince you, then you never will,\" he said while announcing his retirement at the SCG.\n\n\"I'm a proud Muslim coloured boy from Pakistan who was told that he would never play for the Australian cricket team. Look at me now. And you can do the same.\"\n\nThe impact of Khawaja's career is already evident with players of South Asian descent such as Harjas Singh, Harkirat Bajwa, Yash Deshmukh and Aryan Sharma having recently represented Australia at the Under-19 level.\n\nPlayers such as Australian Under-19 star Harjas Singh (pictured) have Khawaja to look towards for representation in the Test team. (Getty Images: Alex Davidson/ICC)\n\nPlayers such as Jason and Tanveer Sangha, Gurinder Sandhu and Nivethan Radhakrishnan being regulars at the domestic level suggest Australian cricket's diversity problem is slowly improving, and Khawaja is largely to thank.\n\nYet, a lack of diversity hasn't dissipated Khawaja's love for Australian cricket one bit.\n\nKhawaja is a fighter through and through. It is embodied in the way he has worked himself back into the team on multiple occasions and in the number of times he has dug in to win or save a Test match for his country in the face of adversity.\n\nKhawaja's spirit and never-say-die attitude is as Australian as it gets.\n\nAlongside Australian men's captain Pat Cummins, Khawaja is the prototypical modern-day athlete who is completely unafraid to touch on political and societal issues, showing his successors the importance of being a role model both on and off the field.\n\nIt is fitting that just as it looked like the end of Khawaja's career would be decided for him earlier this summer, he fought his way back in once again — riding a bit of luck in the process — to write his own fairytale ending.\n\nIf you've followed Khawaja's career over the last 15 years, then you'll know he'll have had it no other way.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/truck-driver-shortage-puts-squeeze-on-australias-supply-chain/106125908",
    "title": "Truck driver shortage puts squeeze on Australia's supply chain",
    "publish_date": "Thu, 01 Jan 2026 22:19:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's transport industry is warning of a truck driver shortage crisis as its workforce shrinks.\n\nThe national road transport association, NatRoad, said the problem stems from a number of factors, including an aging workforce.\n\nAccording to NatRoad there is currently a shortfall of around 28,000 truck drivers across Australia, which is forecast to increase to 78,000 unfilled positions by 2029.\n\nThat would be a 26 per cent drop on the current national truckie workforce of 189,900 drivers.\n\nAnd this comes as the Australian Logistics Council projected the current 223 billion tonne kilometres of road freight volumes will grow by around 56 per cent between 2018 and 2040.\n\nNatRoad said less than 5.4 per cent of the current driver workforce were aged 25 years or younger, while 47 per cent were 55 years or older.\n\nMr Hannifey has been an active member of the industry on a number of issues including road safety. (ABC News: Jerry Rickard)\n\nRoad safety and transport advocate Rod Hannifey said the issue has been building for several years, as the industry has struggled to bring new drivers through to bolster its ranks.\n\n\"Drivers often came up through families — you'd take your kids with you, they'd fall in love with the trucks and eventually join the industry,\" he said.\n\n\"That can't happen now because of insurance and restrictions.\n\n\"Kids can't come in the cab, so they never get exposed to it, and once they choose another job, we don't get them back.\"\n\nMr Hannifey also identified the fines and penalties truck drivers faced as a deterrent.\n\nMr Hannifey said truck drivers are being squeezed by strong penalties and undesirable work conditions. (ABC New England: Lara Webster)\n\n\"We understand the need to operate safely and legally, but the framework we work under is designed by people who don't have to live by it,\" he said.\n\n\"Penalties can be extreme, for things like driving 10 minutes longer than scheduled because you need a shower, toilet, or a decent meal.\n\n\"Drivers constantly worry about what they'll get pinged for next.\n\n\"It scares people out of the industry.\"\n\nA growing problem\n\nNatRoad chief executive Warren Clark said unless the current trajectory was changed, there would be a sizeable shortfall of drivers before 2030.\n\n\"With the growth in freight tasks and what's required of transport, estimates suggest there will be more than 78,000 unfilled positions by 2029,\" he said.\n\nMr Clark said the organisation is looking into the best way to bring younger drivers into the industry. (Supplied: NatRoad)\n\nBut, Mr Clark said the shortage had an impact beyond the driver's cabin.\n\n\"Everything that appears on your table or in your house has, at some point, travelled on a truck.\"\n\nMr Clark said resolving the issue would involve creating stronger career pathways.\n\n\"If you're entering any industry, you need to know where you start, how you get trained, and what your progression looks like,\" he said.\n\n\"Training needs to be consistent across the country, because we're competing with industries that already have those systems in place.\"\n\nAlmost 80 per cent of Australia's freight is shifted through trucks according to aggregate data. (Supplied: Australia Post)\n\nThe other area of significant improvement was the recruitment of women, who make up only 6.4 per cent of drivers.\n\n\"We also need to address why women aren't entering the industry, \" Mr Clark said.\n\n\"There aren't enough facilities or rest stops — and that's not just an issue for women, it affects all road users.\n\n\"What we need is strong leadership from the top, real commitment, and genuine action, and that has to come from the highest levels of government.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/usman-khawaja-to-retire-after-scg-ashes-test/106193812",
    "title": "'My greatest blessings': Khawaja's emotional retirement message",
    "publish_date": "Thu, 01 Jan 2026 21:22:22 +0000",
    "category": "sports",
    "authors": [],
    "text": "Usman Khawaja has revealed the fifth and final Test of the Ashes series at the Sydney Cricket Ground will be the last of his career.\n\nKhawaja will retire from international cricket after 88 Tests with likely two more innings to add to his 16 Test centuries and 6,206 Test runs when the series finale starts on Sunday.\n\nThe 39-year-old's final Test will provide some nice symmetry with his first, which also came against England at the SCG in the final game of the 2010/11 Ashes.\n\nOf the 22 players from that game, only teammate Steve Smith is still active in international cricket.\n\nKhawaja did it all his own way and retires as an Australian great Australia had never seen a cricketer like Usman Khawaja and, thanks to his work on and off the field, he'll be followed by plenty more.\n\n\"God, through cricket, has given me far more than I could have imagined,\" Khawaja said in a press conference at the SCG on Friday morning.\n\n\"He's given me memories I'll carry forever, friendships that go well beyond the game, and lessons that shaped me, who I am, off the field.\"\n\nKhawaja paid tribute to his parents, Tarek and Fauzia, for how hard they worked in taking them from Islamabad to Sydney and backing him on his cricket journey.\n\n\"The early mornings, the long drives, the belief when the results weren't there,\" he said.\n\n\"Mum, you knew plenty of those, when I used to become disappointed or sad, you always consoled me and I'll never forget that. Dad, you always said that I would play for Australia one day, even though sometimes I didn't believe it myself.\n\n\"You taught me values before ambition, you taught me to be humble, always respectful, and treat everyone as equals, no matter what. I hope I repaid the sacrifice in leaving everything behind in Pakistan to come to Australia to give us kids a better life.\"\n\nKhawaja hopes to have inspired kids who 'feel they don't belong'\n\nLoading...\n\nBrothers Nauman and Arsalan were thanked for their time training in the nets.\n\n\"You always instilled that my journey would be tougher than the other kids,\" Khawaja said.\n\n\"And that if I wanted to make it, I would have to work harder than everyone else, score more runs than the rest, and make sure I don't give them any excuse not to pick me.\n\n\"I'll never forget those words, and you were 100 per cent right.\"\n\nHe also paid a special tribute to wife Rachel and daughters Aisha and Ayla.\n\nUsman Khawaja with wife Rachel and daughters Aisha and Ayla at Lord's in 2023. (Getty: Ryan Pierse)\n\n\"This journey has asked more of you than it's ever asked of me, particularly since you read everything that goes on in the press,\" he said to his wife.\n\n\"The missed moments, the long stretches apart, the pressures that come with this life, and taking care of the kids on your own — you carried our family so I could chase my dream, and I'll always be grateful for that.\n\n\"I know how you always remind me that all my international centuries came after I met you. You truly are one of my greatest blessings in life … and I thank Allah every day that I got to share this journey with you.\"\n\nHe and his family have received numerous death threats over the years, with Rachel revealing on Instagram it had \"gotten worse\" since the terrorist attack in Bondi.\n\nKhawaja has not been shy about speaking on controversial topics in recent years, including the Israel-Gaza conflict, but said he hoped to have inspired more kids who look like him.\n\n\"Particularly those who feel that they are different, those who feel they don't belong, or those others [say] will never make it,\" Khawaja said.\n\nKhawaja went to Parliament House in August to talk about gambling reform and Gaza. (ABC News: Callum Flinn)\n\n\"I felt all these things growing up and [while] trying to be an Australian cricketer. But seeing is believing, and I'm here to tell you that you can do whatever you want, you've just got to keep trying.\n\n\"Never let anyone convince you that you can't, because if they do convince you, then you never will.\n\n\"I'm a proud Muslim coloured boy from Pakistan who was told that he would never play for the Australian cricket team. Look at me now. And you can do the same.\"\n\nCalls to retire felt like 'attacks'\n\nUsman Khawaja's form has dipped in recent years, but he remains one of Australia's greatest opening batters. (Getty: Cameron Spencer)\n\nComing into his final game, Khawaja averages 43.39 overall but a remarkable 48.05 as an opener, where he played half his Tests.\n\nThat number puts him in the same league as the likes of Matthew Hayden (50.73), Justin Langer (48.22), Bill Lawry (47.15) and former teammate David Warner (45.08).\n\nCricket Australia chief executive Todd Greenberg said he was \"one of our most stylish and resilient batters\" for 15 years, while also lauding him for his eponymous foundation, which aims to help young Australians from disadvantaged background through cricket and educational support.\n\n\"On behalf of Australian cricket I would like to thank and congratulate Usman for all he has achieved,\" Greenberg said.\n\n\"Usman has been one of Australia's most reliable opening batters and testament to his success was him being named ICC Test cricketer of the year the same season that Australia won the World Test Championship.\"\n\nThe vast majority of Khawaja's time as a Test opener came after he was recalled to the team in 2022, having been dropped for Marnus Labuschagne during the 2019 Ashes in England.\n\nA weight of Sheffield Shield runs for Queensland saw Khawaja return at number four for the penultimate Test of the 2021/22 Ashes, and he scored remarkable twin tons in another momentous performance at the SCG.\n\nHe replaced Marcus Harris for the following Test and was locked into one of two opening positions for the next three-and-a-half years.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nKhawaja scored centuries in India, England, Sri Lanka, the UAE and Pakistan, his country of birth, when Australia toured the nation for the first time in 24 years for three Tests in March 2022.\n\nThe past couple of years have been leaner for the former Sydneysider, with a historic double century in Galle in January his only century from his past 49 Test innings, averaging just 33.8 in that time.\n\nIn that time, Khawaja said some of the calls to retire felt like \"attacks\" from former players and the media, and said coach Andrew McDonald had asked him to stick around when he made clear he was willing to step aside during the 2024/25 summer.\n\n\"I felt people were coming for me, saying I was selfish for staying on, but I wasn't staying on for myself,\" he said.\n\n\"Andrew McDonald, not begged, but said: 'No, we want you to stay. We need you for Sri Lanka. I want you to stay on.' And so I did. It was never totally about me.\"\n\nStill, poor form and his age led to speculation of an impending retirement leading into the series and that was only fuelled when Khawaja was unable to open in either innings of the first Test of this summer's Ashes series due to back spasms, and missed the second Test due to the injury.\n\nHis international career looked over after being initially omitted from the squad for the third game in Adelaide before Smith's gameday withdrawal gave him a reprieve.\n\nPushed into the middle order for the first time in almost three years, Khawaja's 82 and 40 were enough to squeeze Josh Inglis out for the Boxing Day Test and set up his Sydney finale.\n\n\"As I walk off for the last time, I do so with gratitude and peace, or as we say 'salam,'\" he said.\n\n\"Grateful for the journey, the people, the lessons. Thank you for letting me live my dream and for sharing it with me.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/are-modular-homes-the-key-to-solving-the-acts-housing-crisis/106170130",
    "title": "Are modular homes the key to solving the ACT's housing crisis?",
    "publish_date": "Thu, 01 Jan 2026 21:18:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Modular and prefabricated homes could be used for public housing in Canberra to help \"scale up\" the local home manufacturing industry.\n\nIt's just one method the ACT government is considering to meet its target of enabling 30,000 new homes in the territory by 2030.\n\nThe Master Builders Association has labelled the target \"a pipe dream\", but Planning Minister Chris Steel says they're doing all they can to achieve the goal, despite falling about 100 dwellings short of its first-year target of 4,200 new homes.\n\nThat's why modular and prefabricated housing and components are increasingly viewed as potential solutions to Australia's housing crisis.\n\nThey're built off-site in factories and then transported to their final location for assembly, and are often a cheaper and quicker housing option.\n\nBut those in the industry warn there needs to be substantial changes in planning, regulation and finance rules to make modular and prefabricated housing an affordable, scalable solution.\n\nManufactured houses 'the future of building'\n\nGeoff McGinley first looked into tiny homes to avoid the mortgage trap. (ABC News: Joel Wilson)\n\nGeoff McGinley's modular housing business began as a project to design and build his own home.\n\n\"I'd done 28 years in the Navy, and I was ready for the next dream, for the next passion to follow, and I needed an affordable housing solution,\" Mr McGinley said.\n\n\"I didn't want to get locked into the mortgage trap that I see, and so I thought, 'I'll go for a tiny house'.\"\n\nThough tiny houses are comparatively affordable and quick to move and set up, Mr McGinley wasn't happy with the size of the structures on offer.\n\n\"Tiny houses are, well, tiny, so … I went and found a really high-quality manufactured house,\" Mr McGinley said.\n\n\" And manufactured houses really are, I think, the future of building in Australia. \"\n\nThe biggest constraint Adapt Homes faces is the planning process, Geoff McGinley says. (ABC News: Joel Wilson)\n\nMr McGinley constructed what he says is like \"an extra-large tiny house on wheels\".\n\n\"I took this National Construction Code modular house, and we put it onto a commercial truck trailer … it legally meets the definition of a caravan,\" he explained.\n\n\"Having delivered my house and moved in, I sort of turned to my builder and said, 'Hey, we can't stop at one'.\n\n\"There is this housing crisis in Australia, and there's a lack of options.\n\n\"People are looking for different ways to solve their housing solutions, and they're getting locked into a smaller range.\n\n\"We wanted to give people options so that they had a housing solution when traditional ways of doing this didn't work.\"\n\nMr McGinley's company, Adapt Homes, now offers several moveable tiny houses, which range in size from 14 to 40 square metres, and can be joined together or stacked, like toy bricks, to make larger buildings.\n\nManufactured mostly in China, Mr McGinley argues the supply of these types of homes — which, once built, can be set up on a property in a matter of hours — could be easily scaled up to provide 1,000 a month.\n\n\"The biggest constraint is not our ability to manufacture the homes,\" Mr McGinley said.\n\n\"The biggest constraint is the planning process.\n\n\"Obviously, we want to ensure that these homes are fit for purpose and suit the environment.\n\n\"But our planning processes take a long time — a really, really long time — they can take three to four times the duration to build a house.\"\n\nMr McGinley said these factory-made homes could be used to provide crisis accommodation quickly and give more options to people for whom owning a home is currently out of reach.\n\n\"We see young families or old families, we see people escaping a crisis, we see people who are just trying to live life their way,\" he said.\n\n\" Let's accept that there is a path for long-term habitation in a tiny house on wheels. And let's see this as both an option, but also as our sort of go-to. Let's fix something. \"\n\nHigh demand for prefabricated options\n\nAndrew Copley says there needs to be a change in regulation regarding modular housing. (ABC News: Callum Flinn)\n\nAJC Modular chief executive Andrew Copley agrees that changes to regulation are needed in order to meet the housing demand in both the ACT and nationally.\n\nHis company's factory in Queanbeyan uses Australian-made structurally-insulated panels to build modular granny flats and homes.\n\nThe panels are an insulated foam core sandwiched between two structural facings — in AJC's case, gyprock.\n\n\"We use structurally insulated panels for a few reasons,\" Mr Copley said.\n\n\"The cost: because we can make them a lot quicker, they go together like Lego pieces; and the sustainability aspect — they're highly efficient for energy efficiency ratings.\"\n\nPrefab panels stacked up inside the modular housing factory in Queanbeyan. (ABC News: Callum Flinn)\n\nHe also said the panels are cut to size — so they involve minimal wastage.\n\n\"And even if we do have wastage, we've got specialised recycling bins here to make the best use of that waste, whereas at a [traditional house] job site, it just all gets dumped into one generic waste bin,\" he said.\n\nAn artist's impression of a modular home. (Supplied: AJC Modular )\n\nMr Copley said his company had seen so much demand that they're now setting up a second factory in Brisbane.\n\nBut he argues that design approval and certification processes stand in the way of building the number of homes needed to meet government housing targets.\n\n\"From the time it takes me to start a job and complete it, it's about 12 to 14 weeks,\" he said.\n\n\"However, getting it to that point where we're actually allowed to start it is the biggest hurdle.\n\n\"It doesn't matter what state it is; it's just a massive red tape on this product where it shouldn't be.\n\n\"These are all preset designs. They're pre-engineered. Everything is built exactly the same way every single time.\n\n\"But yet we still have these massive hurdles and massive roadblocks to get the product through.\"\n\nAn artist's impression of a modular home. (Supplied: AJC Modular )\n\nMr Copley thinks Australia could learn from the American industry.\n\n\"In America, they'll come and inspect your factory, they'll look over your building methods, they'll look at your engineered drawings,\" he said.\n\n\"And as long as you meet those set criteria and you tick all the boxes — like your setbacks are within the requirements, the house size is within the requirements — it's an automatic approval.\n\n\" We should have the same here. It's concerning that we're not at that stage yet. \"\n\nCalls for more investment and less red tape\n\nThe ACT is ahead of achieving the national housing target to build 1.2 million homes over 5 years, but still fell about 100 dwellings short of its first-year target of 4,200 new homes.\n\nAnna Neelagama is sceptical the territory will be able to build 30,000 homes by 2030. (ABC News: Callum Flinn)\n\nMaster Builders ACT chief executive Anna Neelagama is sceptical the target will be met in the territory.\n\n\"Master Builders ACT has labelled the 30,000 target a pipe dream,\" she said.\n\n\"Our data indicates we will need to build a whopping 4,700 homes each calendar year in order to make up that shortfall and achieve that goal by 2030.\n\n\"The industry is suffering from a stranglehold of red tape and regulation, and what we've said to the ACT government is that we need to give builders time and money back in order to get on with the job of building houses.\"\n\nAmong the things the industry group are asking for to meet the target is a faster planning system; investment in critical construction trades; and a hold on implementing changes from the National Construction Code 2022 (NCC 2022) — the primary framework of minimum standards for new buildings and building work, which is reviewed every three years.\n\nBut the peak body has welcomed the proposed Missing Middle changes to the ACT's planning system, and argues the inclusion of modern methods of construction — like the use of modular and prefabricated materials or buildings in their entirety — is necessary if demand for housing is to be met.\n\n\"They can reduce build times by up to 50 per cent, and they can also reduce the cost of a home end-to-end by about 20 per cent,\" Ms Neelagama said.\n\nHowever, she warned that modular housing \"absolutely\" should be built by a licensed builder, and raised several questions around compliance.\n\n\"In Australia, building a house is very highly regulated,\" Ms Neelagama said.\n\n\"The homeowner is represented by an independent certifier, and it's very heavily governed here in the ACT by the Construction Occupations Registrar.\n\n\"Modern methods of construction are obviously far less site-based, and there aren't those checks and balances available yet, in order to deliver the quality consumer outcomes.\n\n\"So, at what point do the certification and quality checks occur? Is it in the factory? Is it on site? Who are the people responsible for putting it all together?\n\n\"These questions remain unanswered by the ACT government.\"\n\nChris Steel says greater uptake of modular housing will require \"a whole change in thinking\". (ABC News: Matt Roberts)\n\nACT government using prefabricated homes for public housing\n\nPlanning Minister Chris Steel said the government was indeed seeking answers on how to bring more modular and prefabricated homes into Canberra.\n\n\"The Commonwealth has put some money on the table to accelerate modern methods of construction, and so we'll work with them and try to use that funding to try and demonstrate this type of housing in the ACT through public housing,\" he said.\n\n\"Then that might enable the private sector to get on board.\"\n\nHowever, Mr Steel argued that the challenges of modular housing need to be met at multiple levels of government, and within industry.\n\n\"It requires a whole change in thinking,\" Mr Steel said.\n\n\"There is an opportunity through modern methods of construction to gain efficiencies and scale up production of new homes, and there is a considerable national effort that's required to support that at every different level.\n\n\"We're working with the Commonwealth on that, but we'll need to work with industry.\n\n\"We also need to look at [how] the planning and building system [support] this type of development when it is built on site, so they can gain the necessary approvals — potentially part of that in the factory, but then certainly once it's transported out on site and put in place.\"\n\nMr Steel said the government had been talking with banks and financial institutions about what they need to do to restructure loans to support this type of housing.\n\nHowever, he said one of the fundamental problems is the cost of transporting modular housing, which can be quite high if coming from interstate.\n\n\"But if we've got local suppliers, then there may be the opportunity through procurement standards that the ACT government might set for public housing, for example, to try and scale up the industry through government procurement,\" he said.\n\n\" That might also entice the private sector and mums and dads who want to build this housing … if we can show some great examples of it being used in public housing in the ACT. \"\n\nOne of the biggest costs for modular housing is transporting the structures into place. (ABC News: Joel Wilson)\n\nMissing middle focus remains\n\nMr Steel said the government's focus on providing housing for the missing middle remained sharp.\n\nMissing middle housing refers to terraces, townhouses, duplexes and low-rise apartment buildings, and the government wants them in areas currently zoned for standalone houses.\n\n\"One of the commitments that we made at the election was to deliver a pattern book for housing in the ACT,\" he said.\n\n\"This Canberra housing pattern book would be a set of pre-approved designs, which could then have an accelerated pathway through the planning system.\n\n\" We want to focus on missing middle housing and provide the opportunity for prefabricated or modular housing as part of the pattern book in Canberra. \"\n\nDespite the pessimism in the industry and concerns about delays in implementing the proposed missing middle changes, Mr Steel remains optimistic the government's housing target can be met through a combination of planning changes and land release.\n\n\"We're on track to meet the national housing target, and we are at the moment putting in place all of the regulatory changes, the zoning changes, to enable the 30,000 homes,\" Mr Steel said.\n\n\"We're confident at this stage that we've already pretty much met the target in year one, and we've got the future reforms currently before the Assembly, and more to come next year that will enable us to reach the target.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/piiij-art-therapy-childhood-trauma/106096230",
    "title": "How 'hyper detailed' self-portraits helped Piiij rediscover her body",
    "publish_date": "Thu, 01 Jan 2026 20:50:28 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "From a young age, artist Piiij Goodrem preferred to push painful experiences and feelings away from sight rather than confront them.\n\n\"I was brought up in a way that really indicated to me that the best way to deal with something is to sweep it away, not bring it up,\" she says.\n\n\"Appearances mattered.\"\n\nNow in her 30s, Piiij wants to speak up.\n\nOrchids wrap around Piiij's body in her self-portrait, 'Holding'. (ABC News: Felicity James)\n\n\"I was assaulted quite young and there were several instances throughout my teen years,\" she says.\n\n\" I wasn't heard or supported in the ways that I needed to be, which meant that I just bottled everything up and I didn't talk about anything. \"\n\n'Holding' is a self-portrait about holding yourself gently and accountable. (ABC News: Felicity James)\n\nAfter encouragement from her sister, Piiij sought help from a psychologist in her 20s.\n\nShe credits therapy with helping her open up, but finding the right person was initially emotionally and financially draining.\n\n\"It just felt very hard and scary and wrong,\" she says.\n\n\"I would be full-blown sobbing, a convulsing body cry, if I tried to talk about anything when I first started.\"\n\nLoading Instagram content\n\nUltimately, it was creating self-portraits that helped Piiij rediscover her body and her boundaries.\n\n\"It was very much a series that was about looking through my history and my trauma and trying to find safety and a home within my body,\" she says.\n\nPiiij said it was an important part of her healing to be honest in the self-portraits.\n\n\"It's very hyper detailed and I’ve put a lot of stretch marks and cellulite and all this texture within my body in all these images,\" she says.\n\n'Mind your tongue' and \"Umbilical climb' are among Piiij Goodrem's self-portraits.\n\nIn one of Piiij's digital drawings, 'Holding', orchids and their roots wrap around her back.\n\n\"It's like they’re growing out of my back like wings,\" she says.\n\n\"It was about learning to hold myself gently and be kind, because I’m really bad at that.\"\n\n'Grounded' is another self-portrait about growth and healing after trauma. (ABC News: Felicity James)\n\nThis intense focus on art, inspired by the natural world of tropical Darwin, also helped Piiij overcome a dependence on alcohol.\n\n\"[I was] a full-blown alcoholic, couple of bottles of wine a night, any night of the week, let alone if I was being social and then it was even more,\" Piiij says.\n\n\"It was just really about avoiding all of the noise in my head and to just hold it together and be normal.\"\n\nPiiij Goodrem creates art in her home studio in Darwin. (ABC News: Felicity James)\n\nNow after being sober for four years, Piiij reflects on how \"getting lost\" while working on a painting for a few hours helped her process uncomfortable thoughts.\n\n\"I'd realise that I hadn’t been thinking about drinking,\" she says.\n\n\" The most valuable thing for me has been making art and having an outlet that brings light instead of pulling me back into the darkness. \"\n\nPeople who experience trauma during their childhood can feel isolated and unable to share their experiences, which can harm recovery.\n\nPiiij Goodrem's art includes earrings and magnets inspired by her garden. (ABC News: Felicity James)\n\nFor a long time Piiij — and those around her — feared she would not make it to her 30s.\n\n\"Maybe only about three or four years ago, I hit the point where I was like: 'Actually I think I do want to live',\" she says.\n\n\" I do want to give it a real hot shot and not just be existing, I would like to hit a point where I'm thriving. \"\n\nPiiij Goodrem says friends encouraged her to pursue selling her art. (ABC News: Felicity James)\n\nShe has now turned her artistic escape into a side business.\n\n\"Find something that's constructive, that is nourishing and gives you that dopamine and feeling of contentment but isn't leading to any kind of self-destruction,\" Piiij says.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/retrospective-ceramic-artist-pippin-drysdale-agwa/106158010",
    "title": "The unstoppable creativity of ceramicist Pippin Drysdale",
    "publish_date": "Thu, 01 Jan 2026 20:40:12 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "At 82, artist Pippin Drysdale brims with energy and humour.\n\nThe renowned Western Australian ceramic artist's major retrospective, Infinite Terrain, opened in December at the Art Gallery of Western Australia (AGWA), and its creation is due, in part, to a spirited encounter with Colin Walker, AGWA's director.\n\nThe two met at a private gallery opening several years ago but Drysdale had no idea who he was.\n\n\"He said 'oh do you go to the art gallery much?' and I said 'no, they don't give a rat's arse about me',\" she says.\n\n\"And then he wrote me a note saying 'oh, we'll have to change that' or something. Colin's never let me live that down.\"\n\nPippin Drysdale grew herbs and made paper flowers before turning to ceramics. (ABC News: Emma Wynne)\n\nThe subsequent exhibition has involved a mammoth effort by curator Isobel Wise, tracking down work from a prolific 40 years and bringing them together to tell the story of Drysdale's creative arc.\n\n\"Isobel has done an amazing job,\" she says.\n\n\"I was battling with her in the beginning and somehow, it's like the taming of the shrew — I'm not easy.\n\n\" She has pushed on and for me to have that privilege of suddenly feeling that my whole journey has come together; it's creating for me a wonderful sense of how much I've done. \"\n\nOne of Pippin Drysdale's early pieces, Irregular slab form, 1985. (ABC News: Emma Wynne)\n\n'I just fell on my feet'\n\nDrysdale is the first to admit hers is has not been the career of a struggling artist.\n\nShe was born in Melbourne in 1943 and grew up in Perth, and, as a child she always loved art.\n\nShe had several enterprises before turning to ceramics, including growing herbs and making and selling paper flowers in Melbourne before the urge to go into pottery seized her in 1981.\n\nShe and a friend enrolled in a three-year diploma at what was then Perth Tech.\n\n\"Anyhow, well off we went on this three-year madness,\" she says of her TAFE course, which was followed by a decision to go to the US to study at Anderson Ranch, an arts centre in Colorado, which she funded by selling off work she'd made at Fremantle Arts Centre.\n\n\"I filled the car up, took them all down to the Freo arts centre to flog them came home with $5,500 cash and threw it on the floor and said 'I'm going to America'.\n\nA piece from Drysdale's Eastern Goldfields series III, made in 1998. (ABC News: Emma Wynne)\n\n\"I went by Hawaii, had a wonderful little affair there then rushed off to America and then ended up in the Anderson Ranch with all such a diversity of cultures and we had the most amazing lecturers.\n\n\" I just fell on my feet everywhere I went, and then I finally came home from this amazing journey after nearly a year. \"\n\nAfter settling back into the cottage in Fremantle her father bought her, where she still lives and works, she went to Curtin University to complete a degree in Fine Arts.\n\n\"I then started at Curtin, had three extraordinary years there, and the rest is history,\" she says.\n\nA piece from Pippin Drysdale's 2017 Pilbara series III - Ominous clouds. (ABC News: Emma Wynne)\n\nInspired by travel\n\nIn the years after her studies, Drysdale embarked on a series of journeys that shaped her work. These included, in the early nineties, spending months in Italy at the Grazia Maioliche di Deruta factory before going onto the Siberian city of Tomsk for a residency at the university.\n\nShe recalled a hair-raising series of events involving a stolen handbag, a missing passport and arriving in the previously closed city shortly after Russia opened up to the outside world, along with visits to Moscow and Saint Petersburg.\n\nA piece from Pippin Drysdale's Russian series - OTT, 1993. (ABC News: Emma Wynne)\n\n\"It was like living in a Fellini movie — it was crazy stuff and we were the first English-speaking people to arrive in Tomsk and Tomsk had only been opened one week,\" she says.\n\n\"They'd send a bus and take us out to a dacha [summer house] where they'd make great big vats of wonderful chamomile tea where we sweated like crazy then they'd come in and whip you with birch leaves.\"\n\nThe result of everything she saw in Europe was what she came to call her OTT (over the top) series, using blacks and white and lustres of silver and gold in her work.\n\nShe then had another change of style in the late 1990s, with trips to remote parts of Western Australia and the Northern Territory.\n\n\" I was just blown away. I felt so humble at the age of 50 to go out and walk in gorges and camp in the Bungles and even took helicopters. \"\n\nThe result has been multiple series of work deeply infused with the landscapes she sees in her travels.\n\nDrysdale doesn't take photographs or sketches on her trips.\n\n\"I'm lousy, I just seem to absorb everything visually and emotionally really.\n\n\"I'm not one for writing, I think after Curtin University, having to have a stupid book and write down what you're thinking and doing, which I hated.\n\n\" I just experience it and then whatever comes, comes. \"\n\nThree pieces from Pippin Drysdale's 2006 series, Tanami traces series V. (ABC News: Emma Wynne)\n\nA pivotal collaboration\n\nSince 1992, Drysdale has worked with fellow potter Warrick Palmateer, who throws the exquisite porcelain vessels which are her canvas.\n\n\"He has been a pivotal part of my practice. I'm sure I would never have existed if I hadn't had Warrick in my life,\" she said.\n\nIt was Palmateer who sparked a major shift in Drysdale's work in 2016, encouraging her to look at the Karlu Karlu/The Devil's Marbles, a series of large, precariously balanced granite boulders in the Northern Territory, south of Tennant Creek.\n\nTwo sets from Drysdale's Breakaway series IV - Elephant Rocks (front) and Wolf Creek Crater (back), made in 2025. (ABC News: Emma Wynne)\n\nThat signalled a shift from symmetrical, open vessels to more organic, closed pieces that reflect the natural formations.\n\n\"Warrick was the one that said, 'let's look at the Devil's Marbles' and that was a big influence on me,\" she said.\n\n\" As much as I love the pure form, I was ready to create something more sculptural, and he was amazing. \"\n\nIt took a year of experimentation to produce the smooth, asymmetrical boulder forms without cracking.\n\nIt set Drysdale off on a new creative roll.\n\nThe resulting series now form superb landscapes in AGWA's first floor gallery, set on wide plinths that allow visitors to see the work without it being behind glass.\n\nWorks from Drysdale's 2024 Breakaway series III - The patterning of light: Swift parrot installation, a response to the plight of the critically endangered parrot. (ABC News: Emma Wynne)\n\nNever in the safe zone\n\nDrysdale's work is now sought after all around the world, including by a friend she refers to as Stoker Devonshire (real name Peregrine Cavendish, 12th Duke of Devonshire, who resides at Chatsworth House), who has amassed a substantial collection of Drysdale's work.\n\n\"He's been such a catalyst. They did become wonderful friends (and) I've been to stay there many times over the years,\" she said.\n\nAt 82, Drysdale has no plans to slow down. The backyard studio she has worked in for forty years is stocked with pure white porcelain vessels ready for the painstaking work of glazing, etching and sanding.\n\nAfter a short break in December, she will be back in the studio, preparing work for another show.\n\n\"I'll start working in January, I've got a lot of blanks down there that I need to work on.\"\n\nPippin Drysdale's Fremantle studio with pieces reading for etching and glazing. (ABC News: Emma Wynne)\n\nEach piece involves hours and days of work.\n\n\"There's so many parts to it and you can never rest on your laurel. You have a little run where it's fabulous then the kiln starts playing up and you just aren't getting the glazes to fuse.\n\n\" You're never in the safe zone, I can tell you, it's always a drama. \"\n\n\n\nBut she's under no illusions about how extraordinary her career has been.\n\n\"I have been born under a lucky star,\" she says.\n\n\"I've been so loved and somehow one door opens another shuts, and I've just had the most amazing journey of a lifetime really.\"\n\nPippin Drysdale: Infinite Terrain is at the Art Gallery of Western Australia until April 6, 2026.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/damien-martyn-meningitis-health-update-adam-gilchrist/106193746",
    "title": "Gilchrist says 'encouraging signs' as Damien Martyn treated for meningitis",
    "publish_date": "Thu, 01 Jan 2026 20:13:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Adam Gilchrist has provided a brief update on the wellbeing of former teammate Damien Martyn after it was revealed Martyn had been hospitalised with meningitis.\n\nNews came through on Wednesday that Martyn — a veteran of 67 Tests, 208 ODIs and four T20s — was in an induced coma in a Queensland hospital.\n\nMeningitis is an infection and swelling, or inflammation, of the membranes around the brain and spinal cord.\n\nAfter emerging as a prodigiously talented teenager, Martyn made his international debuts shortly after his 21st birthday.\n\nFormer cricketer Martyn in induced coma Former Australian Test and limited overs batsman Damien Martyn is in a Queensland hospital in an induced coma after falling ill this week.\n\nGilchrist played alongside him at under-17 level, as well as with Western Australia and Australia, and said Martyn's family, including partner Amanda, greatly appreciated people's concern.\n\nGilchrist said he would leave any of the finer details to medical experts, but said there were \"encouraging signs\".\n\n\"Thank you everyone for the heartfelt love and wishes and care for Damien as he goes through a challenging time,\" he said on Fox's broadcast of Thursday's Big Bash League game between the Perth Scorchers and Sydney Sixers.\n\n\"He's still in hospital. There'll be more details coming out as they come to hand but certainly in the last 24 hours some positive signs are the indications coming out of the various tests he's having.\"\n\nGilchrist said Martyn was a \"great friend … a fine player and a terrific fella\".\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHe said people from all around the world had reached out to show their love, which was fitting considering Martyn's brilliance with the bat away from home, where he scored nine of his 13 Test centuries.\n\n\"A lot of his best cricket work was done overseas, which is often the greatest challenge, out of your own comfort zone,\" Gilchrist said.\n\n\"The respect with which opposition teams speak about him, his talent and his quality, that's where it rings true.\n\n\"Sometimes the Australian cricket audience might not fully appreciate Marto because a lot of his work was done in the late hours in Australia when everyone was asleep and we were playing on foreign shores.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/great-regional-festivals-in-australia/105752036",
    "title": "Add these must-do regional festivals to your 2026 calendar",
    "publish_date": "Thu, 01 Jan 2026 19:59:19 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Welcome to January, where you peel off the plastic on your new calendar and plan for your best year yet.\n\nLuckily, regional Australia is bursting at the seams with festivals and events for a memorable 2026.\n\nWhether it's music, food, rodeos or the Running of the Sheep, don't miss all the fun these regional gems have to offer (conveniently listed below in chronological order).\n\nParkes Elvis Festival\n\nThe Elvis Festival attracts tourists from around the world. (ABC Central West: Brigitte Murphy)\n\nWhere: Parkes, central western New South Wales\n\nWhen: January 7 to 11, 2026\n\nWhat: Celebrate all things Elvis Presley at this mega festival that attracts more than 25,000 fans. A jam-packed itinerary features a long list of performances, muscle cars and lookalikes on every corner. It's the 33rd year of the event, set in January to coincide with Presley's birthday.\n\nTunarama\n\nTime to start practising your tuna toss. (Supplied: Fran Solly)\n\nWhere: Port Lincoln, South Australia\n\nWhen: January 16 to 18, 2026\n\nWhat: Ever wondered how far you can toss a tuna? Wonder no more and head to Tunarama, where competitors sign up to hammer throw a 10kg rubber fish. The festival also features a street parade, seafood, cooking demonstrations and fireworks to cap off the celebrations.\n\nNational Penny Farthing Championships\n\nLoading...\n\nWhere: Evandale, Tasmania\n\nWhen: February 21 to 22, 2026\n\nWhat: A historical penny farthing bike race is quite a sight to behold, and hundreds of spectators line the streets of Evandale every year to watch. But that's not where the fun stops. Food trucks and entertainment surround the race circuit, offering something for the whole family.\n\nCheck out the Penny Farthing Races on Back Roads.\n\nHarvey Harvest Festival\n\nMulticultural performances are on display at the Harvey Harvest Festival. (ABC: Back Roads)\n\nWhere: Harvey, Western Australia\n\nWhen: March 6 to 8, 2026\n\nWhat: Celebrating its migrant communities and proud agriculture traditions, the Harvey Harvest Festival boasts a three-day program filled with live music, art, food and cultural experiences. Its main attraction — the WA Grape Stomping Championships — attracts competitors from around the globe, with anyone from amateurs to professionals getting their feet wet.\n\nCheck out the Harvey Harvest on Back Roads.\n\nThe Clunes Booktown Festival\n\nImmerse yourself in literature in the Goldfields town of Clunes. (Supplied: David Jones Photography)\n\nWhere: Clunes, central Victoria\n\nWhen: March 20 to 21, 2026\n\nWhat: The main street of this small town of less than 2,000 people is flooded with literary fans from all over the world. The historic buildings of this gold rush town serve as a temporary home to authors from around the country, hosting writers' talks, entertainment and rare finds.\n\nCheck out the Clunes Booktown Festival on Back Roads.\n\nChillOut Festival\n\nCelebrate pride in the regions. (Supplied)\n\nWhere: Daylesford, Victoria\n\nWhen: March 26 to 29, 2026\n\nWhat: This annual event has been bringing the rural LGBTQIA+ community together for 25 years, making it the longest-running queer pride event in regional Australia. From bush dances to parades and performances with special guests, the event draws a large and colourful crowd.\n\nParrtjima\n\nWitness Alice Springs illuminate at Paartjima. (Supplied: Parrtjima)\n\nWhere: Alice Springs, Northern Territory\n\nWhen: April 10 to 19, 2026\n\nWhat: This free, 10-night event illuminates the world's oldest living culture with expansive light installations and interactive experiences. The 2026 theme for Paartjima is Language, with installations exploring the stories and beauty of Language, from ancient to contemporary.\n\nDirt n Dust Festival\n\nGet around the rodeo in Julia Creek. (ABC: Tony Hill )\n\nWhere: Julia Creek, north-west Queensland\n\nWhen: April 17 to 19, 2026\n\nWhat: If live music and real-life cowboys are more your style, add the Dirt n Dust Festival to your calendar. The two-day rodeo event features buck jumps, bronc rides and all the live music to keep your energy high.\n\nCheck out the Dirt N Dust Festival on Back Roads.\n\nThe Great Wheelbarrow Race\n\nLoading...\n\nWhere: Mareeba to Chillagoe, Far North Queensland\n\nWhen: May 8 to 10, 2026\n\nWhat: This charity relay sees teams push a wheelbarrow a total distance of 140km over three days. It's a community event aimed at honouring Far North Queensland miners, who would travel around the region in the late 1800s to look for work, using wheelbarrows to carry their possessions.\n\nCheck out the Great Wheelbarrow Race on Back Roads.\n\nGoomeri Pumpkin Festival\n\nRoll up your sleeves for the pumpkin toss.\n\nWhere: Goomeri, south-east Queensland\n\nWhen: May 30 to 31, 2026\n\nWhat: Compete in the Great Australian Pumpkin Roll or have your own Cinderella moment at this festival revolving around the winter staple. Get the whole family involved with the pageant featuring decorated pumpkins of all shapes and sizes.\n\nDark Mofo\n\nEmbrace your dark side at Dark Mofo. (Supplied: Dark Mofo)\n\nWhere: Hobart, Tasmania\n\nWhen: June 11 to 22, 2026\n\nWhat: The annual winter Dark Mofo Festival celebrates dark and ancient pagan rituals. The famous nude winter solstice swim is a key part of the program, accompanied by art installations, music and food, ending with the burning of the Ogoh-Ogoh effigy.\n\nBeer Can Regatta\n\nIt's time to start designing your entry. (ABC News: Roxanne Fitzgerald)\n\nWhere: Darwin, Northern Territory\n\nWhen: June 28, 2026\n\nWhat: Put your tinnies to good use by constructing a makeshift raft at the annual Darwin Lions Beer Can Regatta. The rules are simple: design a vessel from cans, plastic bottles or milk cartons, and make sure it floats. For those wanting to stay dry on land, enjoy a full day of beach festivities, with thong throwing and sand castle-making competitions.\n\nGoldfields Gothic: Festival of Dark Ideas\n\nEnter the fashion show at Goldfields Gothic. (Supplied: Goldfields Gothic: Festival of Dark Ideas)\n\nWhere: Maldon, central Victoria\n\nWhen: July 21 to August 2, 2026\n\nWhat: Embrace your dark side at this festival based around the gothic history of the central Victorian goldfields. This family-friendly event has everything from haunting storytelling about bushrangers and ghosts, to gothic tai chi.\n\nHenley on Todd Regatta\n\nA regatta on sand? We're intrigued. (ABC Alice Springs: Xavier Martin)\n\nWhere: Alice Springs, Northern Territory\n\nWhen: August 15, 2026\n\nWhat: It's a boating regatta in the middle of the outback, with no water in sight. Henley on Todd sees participants race their 'boats' on the dry riverbed of the Todd River in the most creative ways. The main event aside, there's also a street parade and children's activities.\n\nShinju Matsuri Festival\n\nThe Shinju Matsuri Festival celebrates Broome's diverse cultures. (ABC Kimberley: Dunja Karagic)\n\nWhere: Broome, far north Western Australia\n\nWhen: August 22 to September 6, 2026\n\nWhat: Shinju Matsuri means Festival of the Pearl in Japanese and celebrates Broome's multicultural pearling history. Experience sunset dinners, lantern ceremonies and cultural performances right by Broome's picturesque seaside.\n\nCementa Festival\n\nGet artsy at Cementa Festival. (ABC Central West: Toby Hemmings)\n\nWhere: Kandos, mid-western New South Wales\n\nWhen: September 17 to 20, 2026\n\nWhat: In a town famous for making cement, contemporary art and culture come alive at the Cementa Festival. This biennial arts festival features immersive art exhibitions, performances and workshops for all.\n\nCheck out Cementa Festival on Back Roads.\n\nDeni Ute Muster\n\nYou'll want to find a mate with a ute for this regional event. (ABC Riverina: Shannon Corvo)\n\nWhere: Deniliquin, south-west New South Wales\n\nWhen: October 2 to 3, 2026\n\nWhat: The humble utility vehicle is at the centre of this regional festival that celebrates all things ute culture. It offers a mix of activities and entertainment, featuring big country music stars and precision driving competitions.\n\nBoorowa Irish Woolfest\n\nLoading...\n\nWhere: Boorowa, south-west New South Wales\n\nWhen: October 2 to 4, 2026\n\nWhat: The Running of the Sheep is the signature event for the Boorowa Irish Woolfest, where a large flock runs straight down the main street. But that's not the only entertainment: the spring long weekend is jam-packed with Irish accent competitions, a street parade and a Guinness pie-eating competition, all celebrating the town's Merino wool trade, and its connection with the town of Clonoulty in Tipperary, Ireland.\n\nCheck out Boorowa Irish Woolfest on Back Roads.\n\nWynyard Tulip Festival\n\nTulip time comes but once a year. (ABC Northern Tasmania: Rick Eaves)\n\nWhere: Wynyard, north-west Tasmania\n\nWhen: Date TBC, spring 2026\n\nWhat: Catch a shuttle bus to the Table Cape Tulip Farm, which opens its gates each year during this festival so the public can enjoy the tulips in full bloom. Afterwards, enjoy food stalls and carnival rides by the water.\n\nBay to Birdwood\n\nWitness vintage cars of all shapes and sizes. (ABC News: Isabel Dayman)\n\nWhere: West Beach to Birdwood, South Australia\n\nWhen: October 18, 2026\n\nWhat: Pull up for a parade of historic vehicles in the Adelaide Hills, organised by the National Motor Museum to reflect Australia's social history. Catch the action along the 67-kilometre route, or enjoy the Finish Festival in Birdwood and get up close and personal with the cars.\n\nGrafton Jacaranda Festival\n\nThis wholesome festival centres around a flower. (ABC Open contributor intuit_photography)\n\nWhere: Grafton, northern New South Wales\n\nWhen: Dates TBC, spring 2026.\n\nWhat: Become immersed in a sea of purple as thousands of jacarandas bloom in Grafton. This 10-day festival celebrates the bright, flowering trees with garden parties, park lunches and a parade.\n\nMannalargenna Day\n\nConnect with the world's longest continuous living culture. (ABC)\n\nWhere: North-east Tasmania\n\nWhen: December 5, 2026\n\nWhat: Held each year to honour the memory of Indigenous leader and warrior Mannalargenna, the day combines live music, cultural experiences, dances and food. It features yarning circles, crafting and spear-throwing competitions for attendees to connect with culture.\n\nCheck out Mannalargenna Day on Back Roads.\n\nMulletfest\n\nLoading...\n\nWhere: Kurri Kurri, northern New South Wales\n\nWhen: December 2026\n\nWhat: It's business at the front and party at the back at Mulletfest, the annual festival celebrating the best mullet haircut. Originating in Kurri Kurri, the festivities went nationwide in 2025, with heats held across the country. Participants aren't just judged on their hair, though; overall presentation and stage presence also play a part. The grand final is held in Kurri Kurri each December, but there could be a heat to check out closer to home.\n\nCheck out Mulletfest on Back Roads.\n\nStream Back Roads free on ABC iview.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-02/nsw-inquiry-examines-reforms-to-allow-second-homes-on-rural-land/106174822",
    "title": "This crowded house sits on a huge property, but a second home is not allowed",
    "publish_date": "Thu, 01 Jan 2026 19:31:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Pamela Misius's 40,000 square metre property is among the largest in New South Wales, but the number of homes she has been allowed to build on it is one.\n\nMs Misius's daughter, son-in-law and their four children live with her in the Yarramundi home on the western outskirts of Greater Sydney.\n\n\"Haley and Phil [Walton] moved back to help me with my [late] husband when he had dementia,\" the 77-year-old said.\n\n\"Then they stayed on because I couldn't see [myself] living here on my own with just the upkeep of the property.\"\n\nPamela Misius's property is 40,000 square metres in semi-rural Yarramundi, west of Sydney. (ABC News)\n\nAs the growing family crowded the home, they decided to try to build a second house on the same land, just a few metres away.\n\n\"We could look after Pam as she got older, and in turn she could help us look after the kids,\" Mr Walton said.\n\nBut any plan would require the approval of Hawkesbury City Council.\n\nThe first application for a second home was shot down in January 2019, according to council documents.\n\nThen an application for a renovation was rejected in November 2021.\n\nMr Walton, a 40-year-old stonemason who owns a construction company, decided to carry out an illegal renovation of the home, before fighting the council in the Land and Environment Court.\n\n\"There is no merit or jurisdictional reason not to grant development consent,\" Commissioner Elizabeth Espinosa ruled.\n\nBut the process cost time, energy and money.\n\n\"We've spent $200,000 fighting this,\" Mr Walton said.\n\nPhil Walton is among the seven people who live in the Yarramundi house. (ABC News: Tony Ibrahim )\n\nA proposal to cut councils out of the picture\n\nThe days when a council decides if a second home or a granny flat is built on the state's largest properties could be numbered.\n\nA NSW parliamentary inquiry is investigating if it is worthwhile overriding council authority by creating a new provision under the state government's planning laws.\n\nThis blanket rule would only apply to properties larger than 20,200 square metres — the inquiry posits there's more than 240,000 in the state — that are zoned for rural (RU1 to RU6) or environmental (C3 and C4) use.\n\nJohn Ruddick is heading the public inquiry looking into the issue of secondary dwellings on rural land. (Supplied)\n\nThe change would make it easier for families to live next door, easing the cost of housing, aged care and child care, said John Ruddick, chair of the Select Committee on Rural Housing and Second Dwelling Reform.\n\n\"It's not gonna cost the government anything, and it's going to help with the housing crisis,\" the Libertarian Party member said.\n\n\" We have a lot of vacant space, but what we have is excessive red tape which is constraining property development. \"\n\nMulti-generational housing could be a solution to housing shortage Communal living was once common in regional Australia.\n\nThe parliamentary committee was formed with unanimous support in the Legislative Council, but the government is not bound to adopt its findings.\n\n\"The broad legislative reforms to secondary dwellings … have merit, but steps must be taken to ensure additional dwellings minimise adverse impacts,\" the NSW government stated in a submission.\n\nImpact on housing affordability\n\nBuilding a second home on an existing lot would remove one significant expense: the cost of land.\n\nMr Ruddick said the areas where most second dwellings would be built include the Hawkesbury, Orange, Bega and Port Macquarie, but there could be a boom in the Mid North Coast, Shoalhaven, Snowy Monaro and Tamworth.\n\n\"It used to be standard practice to leave home when you're a late teenager, early 20s,\" he said.\n\n\"It's now almost becoming a standard practice to delay that 10 years.\"\n\nNicole Gurran disagrees that building a second home will help housing affordability. (ABC News: Matt Roberts)\n\nBut a leading academic does not believe the policy is ambitious enough to result in a meaningful number of extra houses.\n\n\"This is not a measure that's going to address housing affordability,\" Nicole Gurran said, professor of Urban and Regional Planning at the University of Sydney\n\n\" It's talking about simply making it easier to do something that you can already do. \"\n\nShe believes councils should keep their decision-making powers.\n\n\"It's almost impossible to have a blanket policy for developing on rural land. We'll have to deal with exceptions as they arise, which they will.\"\n\nRate reform will be needed, councils say\n\nCouncils believe it is critical that the plans of new buildings are individually assessed against their surroundings.\n\n\"There is broad agreement that any reforms need to allow councils to carefully tailor requirements to the local conditions,\" Local Government NSW (LGNSW) said in its submission.\n\nThe group advocating for councils says rates will need to be reformed if second homes are going to be built on large properties. (ABC News)\n\nThe group lists a variety of reasons, including some that boil down to funding and resources.\n\n\"These potentially thousands of additional properties will be unratable,\" the advocacy group said.\n\n\"Any additional rural secondary dwelling reform must occur in concert with rate reform that reflects the true cost of servicing properties with multiple dwellings, particularly in rural and farmland areas, and would help councils maintain financial viability.\"\n\nThis is because rates are calculated on the value of land, and not the buildings on them.\n\nPhilip Walton said he would be happy to pay 50 per cent more in rates if he could have a second home on the property.\n\nFrom farms to residential communities\n\nLGNSW warns the building of homes on farmland could lead to the zoning being changed in the future from agricultural to residential use.\n\nProfessor Gurran said the concern is credible.\n\n\"You want to avoid cutting up that rural land, you know, by stealth or in an unplanned way,\" she said.\n\n\"Once you change a land used from being primarily agricultural and shift it towards being more residential, then the future of that land starts to get locked in place.\"\n\nThere are concerns that building second homes on farmland could see them changed in the future to residential. (ABC News)\n\nBut the NSW Farmers Association claims the lack of housing is limiting agricultural productivity.\n\n\"Farmers struggle to house workers, families face difficulties planning for succession and essential workers like teachers, nurses and police find they have nowhere to live in our communities,\" vice-president Rebecca Reardon told the inquiry.\n\nShe said some farmers are told they can build a second home, but only if an existing structure is knocked down and replaced, preventing it from being used for another purpose.\n\n\"If we do not have accommodation, very simply put, we cannot get workers.\n\n\"We want to be able to say we might need a second dwelling, even a third dwelling.\"\n\nThe inquiry's report is due in February next year.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/national/nsw/woman-dead-after-being-knocked-into-water-at-sydney-beach-20260101-p5nr0m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Huge search resumes at Coogee for popular local bartender",
    "publish_date": "Fri, 02 Jan 2026 13:12:17 +1100",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo",
      "Ben Cubby",
      "Jack Gramenz"
    ],
    "text": "A large number of rescue teams have converged on Coogee Beach to try to find the Nepalese national swept out to sea on New Year’s morning with colleagues praising the missing man as a “top guy”.\n\nTwo helicopters, several boats, a drone and surf lifesavers are assisting divers to scour nearby waters for Sushan Khadka, a student and bartender at the Coogee Pavilion in his 20s, who arrived in Australia about four years ago from Nepal.\n\nThe search sontinues for a swimmer missing after being swept out to sea at Coogee on New Year’s morning. Credit: Sitthixay Ditthavong\n\nSurf Life Saving NSW chief executive Steven Pearce said the “significant show of force” at Coogee was focused on finding Khadka alive, and that the large-scale operation would continue into Friday afternoon.\n\nInvestigators dropped green dye marker at the southern end of Coogee about 10am, as several divers tracked the currents while lifesavers on jet-skis crisscrossed the ocean.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/business/markets/australian-sharemarket-set-to-open-lower-20260101-p5nr38.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX dips on first day of trading; miners and info tech firms fall",
    "publish_date": "Fri, 02 Jan 2026 12:53:18 +1100",
    "category": "finance",
    "authors": [
      "Millie Muroi"
    ],
    "text": "Miners and tech companies have weighed on investors in the first session of the new year with the Australian sharemarket posting a lacklustre performance.\n\nThe S&P/ASX 200 index was down 3.3 points, or 0.04 per cent, to 8711 points about midday (AEDT), with five of the 11 industrial sectors trading in the green.\n\nThe Australian sharemarket is expected to open lower in its first day of trade for 2026. Credit: Louie Douvis\n\nThe Australian dollar was stronger, fetching about US66.90¢.\n\nThe S&P/ASX 200 closed down 2.8 points at 8714.30 on Wednesday as the market finished trade early for New Year’s Eve. It remained closed on New Year’s Day.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/property/news/sydney-and-melbourne-house-values-dip-on-rate-fears-20251231-p5nqwe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney and Melbourne house values dip on rate fears",
    "publish_date": "Fri, 02 Jan 2026 12:42:13 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "House values in Sydney and Melbourne fell in December amid signs the combination of increasingly unaffordable homes and the prospect of a new year interest rate rise have hit the nation’s two largest property markets.\n\nFigures compiled by property data firm Cotality show house values fell by 0.3 per cent in Sydney and 0.1 per cent in Melbourne last month. It was the first time since January last year that value in the two cities had fallen.\n\nHouse values eased for the first time in a year in Sydney and Melbourne. Credit: Dion Georgopoulos\n\nSydney’s median house value, despite last month’s easing, still stands at almost $1.6 million while in Melbourne the figure is $981,165.\n\nWhile the two largest markets eased, values lifted in every other capital, led by a 2.1 per cent jump in Darwin, where the median house value is now $697,251. Values lifted by 1.9 per cent in Perth (to $983,068) and Adelaide ($960,051) while there was a 1.5 per cent increase in Brisbane ($1,131,329).",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/afl/neale-quits-lions-captaincy-20260102-p5nr8u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Neale quits Lions captaincy",
    "publish_date": "Fri, 02 Jan 2026 12:24:17 +1100",
    "category": "finance",
    "authors": [],
    "text": "Neale quits Lions captaincy\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/world/chaotic-scenes-as-fire-rips-through-bar-in-swiss-ski-resort-20260102-p5nr88.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chaotic scenes as fire rips through bar in Swiss ski resort",
    "publish_date": "Fri, 02 Jan 2026 12:16:44 +1100",
    "category": "finance",
    "authors": [],
    "text": "Chaotic scenes as fire rips through bar in Swiss ski resort\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/basketball/why-simmons-hasnt-reached-his-potential-20260102-p5nr8d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Simmons hasn't reached his potential?",
    "publish_date": "Fri, 02 Jan 2026 12:08:02 +1100",
    "category": "finance",
    "authors": [],
    "text": "Why Simmons hasn't reached his potential?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/two-more-teenagers-charged-after-st-kilda-pier-attack-20260102-p5nr8c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Two more teenagers charged after St Kilda Pier attack",
    "publish_date": "Fri, 02 Jan 2026 12:07:48 +1100",
    "category": "finance",
    "authors": [],
    "text": "Two more teenagers charged after St Kilda Pier attack\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/khawaja-was-dropped-eight-times-he-explains-how-he-kept-coming-back-20260102-p5nr6l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Khawaja was dropped eight times. He explains how he kept coming back",
    "publish_date": "Fri, 02 Jan 2026 12:04:51 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "But he was dropped and recalled so many times that Khawaja was left to conclude that he did not fit the mould. There were axings in 2011 (twice), 2013 (plus a homework suspension in India), 2016, 2017 (twice), 2019 and then finally, for a day in Adelaide this series. As often happens, recalls came as a result of others’ misfortune - Travis Head’s positive COVID Test in 2022, for example, when Khawaja marked his return with back-to-back hundreds at the SCG. Khawaja embraces his father, Tariq. Credit: Getty Images “I’ve broken down so many barriers, I’ve had to fight so many battles,” he says. “I got dropped a lot early on because I was different, I didn’t really fit into the mould, the 50/50 calls went against me. I’ve no doubt of that. “I don’t say this with any prejudice because I loved my journey, I’m very grateful for where I am right now, but if my name was John Smith I would’ve got away with a bit more if I’m totally honest. But I wasn’t and I was trying to break that down.”\n\nLoading As a committed Muslim, Khawaja looks upon his subsequent recall to finish the series as somewhat providential. It had arrived after he made his peace with God that if Perth was to prove his final Test match, he was grateful nonetheless. “It has to be, right? I know people don’t believe in God, but I believe God does everything, the good and the bad,” Khawaja says. “I pray five times a day every day and have a very close connection with God personally, and for me it wasn’t like ‘please God let me play again, let me finish my career like this’, it was, ‘thank you for everything you’ve given me, I’m very grateful and happy to go out now’. “I wasn’t expecting to play again and once I didn’t play in Adelaide I thought it’s going to be hard for me to play unless something goes awry, which it did. But the odds of that happening are low, batsmen don’t miss a lot of Test matches. So I was very comfortable. I was in my gratitude state, which I have been for a long time, saying thank you for all the Test matches I’ve played, been able to do a lot of great stuff both inside and outside of cricket. “I was really just happy to help the team out if they needed me. I never wanted to be a guy who left a series halfway through. No offence to anyone who has, everyone has the right to leave whenever they want, but I tried to avoid that because I knew if something happened to one of the batsmen the series was still alive. So I said I’m happy to be 12th man until the end of the series if that’s the case and I’ll just retire in Sydney.”\n\nOver these past few weeks there has been much said about “farewell” matches or series, and whether Khawaja deserves one. It has rankled him, especially given that internal discussions have been more about getting him to play one more India tour in 2027 rather than pushing him to the exit. There is something poetic about how Khawaja will finish his Test career having played two distinct halves. Forty-four Tests between 2011 and 2019 when he was in and out of the side, then another 44 Tests over the past four years where he has been a trusted and ever-present member of the team. Khawaja announces his retirement. Credit: Dominic Lorrimer “It really annoyed me that everyone was talking about the farewell tour,” he says. “I didn’t care about that. It wasn’t a case of finishing at the SCG, it was a case of finishing the series and if that’s the last one it’s the last one. To be honest it’s been more so that Andrew McDonald has kept pushing me, too. I could’ve left last summer. Even this year when I haven’t had a great year by my standards, I was still wanted. “This whole period was always a bonus for me, and I think it’s helped me to play. It took a little bit of stress and pressure off me. I was never holding on, I was always ready to go. Whenever I felt like it was time to go, I was ready to go. Even right until the very end when I spoke to Andrew, he was laughing and going ‘how can we get you to India, what do we need to do?’\n\n“So it was nice to think if I said I was staying on this wasn’t my last match. Pretty positive I would’ve played the next series and gone to South Africa. You obviously need to score runs to be in the team, but it wasn’t a case that I was getting dropped. I’m happy and content that I was still in the team and I’ve left on my own terms rather than being pushed out.” Providence or not, there will also be something entirely fitting about Khawaja’s final Test match taking place at the SCG. The SCG and the suburbs around it were where Khawaja spent his first few summers in Australia between 1991 and 1995, sparking the love of cricket that still burns brightly whenever he speaks about it. “The SCG was 10 minutes down the road. I was in absolute awe of the NSW guys. I used to watch Richard Chee Quee when I was younger, not knowing I’d get to play with him one day in grade cricket,” Khawaja says. “He helped me a lot through those early years of grade cricket and learning how to play with men, when I was just coming in as a 16-year-old, learning the art and getting absolutely nailed by everyone, especially as a little brown kid trying to play a very white game in Sydney.“\n\nMoney was tight in the Khawaja household. To get a glimpse of international cricket up close, the family would wait until the closing overs of a match, when attendants would open the public gates for early departures, to sneak in for the end of day/night games. Khawaja remains conscious of the cost of playing the game for immigrant and working-class families. “We couldn’t afford tickets. My Mum said tickets were about $30 each back then, and that was way too much for us. So we’d wait right until the end of a one-dayer, they’d open the gates and I’d get to see the last five overs or so. We’d run in and watch the last little bit of cricket and that’s all I got. Back then if the game wasn’t sold out on TV they wouldn’t even show it, so I’d be 10 minutes away from the SCG listening to it on the radio. I’ve never lost those memories. “I watched my first game of cricket in the old Doug Walters Stand, it was disgusting, but luckily with my skin colour I could get away with it in the sun. But we were watching Dean Jones and Mark Waugh batting and my brother would go ‘watch these guys, they’re the best runners between the wickets ever’ and the aura of the Australian team. “Then to be able to play there, debut there for NSW, debut there for Australia, make my comeback there, in 2022 and hopefully finish there, So much emotion goes into that ground for me, because I grew up literally next to it. It’s a very special place.”\n\nKhawaja celebrating the first of two centuries on his return to the Test side at the SCG in 2022 against England. Credit: Getty Images Khawaja will finish in esteemed company among Australian top order players. He’s currently 29 runs short of the runs tallied by Mike Hussey, and has more hundreds than the likes of Doug Walters, Ian Chappell or Bill Lawry. But his defining achievement, more than any runs, centuries or victories, will be in showing it is possible for a south Asian Australian to play the game at the highest level for a long time. In his own, wise-cracking way, Khawaja is to Australian cricket what Jim Brown was to American football or Jackie Robinson to baseball: pathfinders. “There was a wide narrative among the multicultural community that we can’t represent Australia in cricket, they don’t pick our kind,” he says. “All those narratives that we’re lazy, we’re selfish, we don’t care about the team, we don’t mingle well. All these false racial stereotypes I had to try to break down throughout my career, even up until now. “The journey’s been so much tougher but I’m so grateful I got to do it because I’ve been able to show people of all backgrounds, it doesn’t matter what ethnicity, what colour or what faith you have, you can play for Australia. You might have to be a little more resilient than the guy next to you, you have to go in there with an open mind and understand that.\n\n“Your journey might not be as easy, but hopefully now I’ve done this journey and been very successful, hopefully the next person will have an easier journey. Then the next person after that will have an easier journey. Then hopefully at some point they’ll have the same journey. That’s the ultimate goal. Seeing is believing, and they’ve seen it now.” This is not to say that the job is done. Far from it. In the weeks and months after his final Test match, Khawaja will play plenty of golf, spend plenty more time with his young and growing family, and do the odd bit of commentary. But he will also work assiduously at trying to keep that pathway open. Loading “I didn’t like the Australian cricket team growing up because I didn’t see myself in the team,” Khawaja says. “I supported the Windies or Pakistan, pretty much anyone but Australia, until the age of 13 when Gilly and Brett Lee won me over with the way they played the game. I decided ‘I love these guys’. They didn’t seem like that older generation.”",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/planning-a-wedding-in-2026-here-is-what-s-trending-for-the-year-ahead-20260102-p5nr62.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Planning a wedding in 2026? Here is what’s trending for the year ahead",
    "publish_date": "Fri, 02 Jan 2026 11:54:54 +1100",
    "category": "lifestyle",
    "authors": [
      "Ivy Manners"
    ],
    "text": "Unconventional Venues Loni Peterson, the owner of LP Creative Events in Denver, says wedding venues will continue to be more surprising with spaces such as historic ruins, caves and airport hangars. “Couples want their special day to stand out among the noise and one way they can do that is by hosting their guests at a ‘non wedding’ venue,” she says. “We are also having couples holding their events in open fields, fairgrounds and ski and snowboard trails.” Prime Minister Anthony Albanese and Jodie Haydon were among those who married at non wedding venues in 2025 when they tied the knot at The Lodge. They also wrote their own vows. Credit: Mike Bowers\n\nMultiple Celebrations Xin Huang, a wedding planner and the owner of Le Petite Privé in New York, says she is seeing many couples host celebrations spread out over months – whether with a cultural ceremony or a reception months before or after the legal marriage, or separate receptions months apart. Couples are also celebrating across cities or countries that have meaning to them or where their loved ones live. “This is a beautiful way to parade your love and share what is important to you in the different settings and cultures that speak to you,” Huang says. Projected Videos “With draping and white colour schemes being two huge decor trends in 2025, there has been a natural progression with the use of projection,” says Jessica Ralph, the owner and executive planner of Parties A La Carte in Tampa Bay, Florida.\n\nLoading “Draped, sheer white overlay creates an effective backdrop for projection and an elevated, romantic setting.” (Videos can be displayed on a blank wall, with rear projection used to ensure a seamless set-up.) Some couples are also using a mix of photos from their relationship, while others are focusing on engagement session images, says Masha Sakhno, the founder of Masha Sakhno Photo in Honolulu. In addition to sharing their love story, couples are also displaying images of family members. “It’s a great way to add sentiment and nostalgia to the celebration,” she says. Memorable Entertainment Wedding attendees can expect to be entertained more. Couples are welcoming guests with musicians and dancers, blending DJs with live bands (or saxophones), and introducing unexpected performances during cocktail hour. Many are also adding activities that engage other senses, such as coffee stations, gelato carts or custom fragrance bars.\n\nLoading “Couples are seeking those surprise-and-delight moments that make guests feel part of something personal and alive,” says Fallon Carter, an event planner and the founder of Fallon Carter Events in Washington, DC. Love Notes Pinterest’s 2026 trends predictions anticipate a resurgence in personalised notes and letters. Peterson says more of her clients were incorporating notes to their guests in their reception decor. “I’m seeing them find unique ways to connect with each guest,” she says, “whether thanking them for travelling to celebrate their marriage, including an inside joke or introducing them to the person sitting next to them at their table.” Heidi Moore, a stationer and the owner of Idieh Design, based in Phoenix, has also noticed that many of her clients are choosing to leave individualised notes.\n\n“Some craft one message per couple, while others write a unique note for each person,” she says. Sometimes handwriting is replaced with handwritten-style fonts to save time. Dessert Cocktails Couples will be incorporating signature dessert cocktails during the cake cutting to elevate the moment, says Koby Morris, the owner of Southern Standard, an events bar services company based in New Braunfels, Texas. Decadent, fruity mocktails and espresso martinis are favourites that will be also trending in 2026. Curated Food There is an increasing focus on food as part of the overall design, rather than simply sustenance, says Alice Wilkes, a wedding planner and the founder of Alice Wilkes Design in London.\n\n“Planners are seeing a growing interest in the presentation of food itself, with beautifully styled dishes, canapes and drinks becoming an extension of the event’s aesthetic and storytelling,” she says. “Couples are embracing elevated dessert rooms, tasting stations and interactive chef-led moments.” It’s no longer a case of chicken or beef at weddings with more emphasis on presentation and curated menus. Deborah Miller, the founder of Deborah Miller Catering & Events in New York, is seeing more couples opt for cocktail-style wedding receptions, with food stations, passed canapes and small plates over more traditional plated dinners. “This allows for a lot more culinary creativity,” Miller says.\n\nBold Colours and Stripes Pinterest’s 2026 trends report also predicts that vivid colours and stripes will inspire decor choices, which event planners forecast will influence weddings. “We’re seeing couples choosing to make a statement with saturated colours,” says Dawn Crothers, the president and creative director of Something Vintage Rentals, based in Temple Hills, Maryland. “Hues like red, teal, burgundy and deep green will be strong for 2026.” “Full-colour tablescapes, mixed-hue glassware, layered colourful florals and vivid linens will be popular for creating immersive, theatrical environments,” says Sarah Farsh, an owner and the creative director of Olympic Valley Stables, an event venue in Olympic Valley, California, and an owner of Tahoe Engaged, a wedding vendor directory. Bridal Party Outfit Changes Second looks are no longer just for the bride and groom. Patricia Voto, a New York-based designer and the founder of One Of, recently created three looks for a mother of the bride, who changed from ceremony to reception to after-party.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/usman-khawaja-retires-with-a-bang-20260102-p5nr80.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Usman Khawaja retires with a bang",
    "publish_date": "Fri, 02 Jan 2026 11:45:10 +1100",
    "category": "finance",
    "authors": [],
    "text": "Usman Khawaja retires with a bang\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/world/the-epstein-files-what-we-know-so-far-20251231-p5nqxg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Epstein files: What we know so far",
    "publish_date": "Fri, 02 Jan 2026 11:39:34 +1100",
    "category": "finance",
    "authors": [],
    "text": "The Epstein files: What we know so far\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/politics/federal/gold-coffee-and-donald-trump-australia-s-rollercoaster-economic-year-in-10-charts-20251228-p5nqds.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gold, coffee and Donald Trump: Australia’s rollercoaster economic year in 10 charts",
    "publish_date": "Fri, 02 Jan 2026 11:30:00 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "Platinum, used in high-end jewellery, benefited from the lift in gold. At half the price of its shiny precious metal counterpart, platinum is relatively cheap for jewellers. It is also a metal important to vehicle production, both internal combustion and electric. Throw in the Trump turmoil and a global shortage (due to a fall in the world’s largest producer nation, South Africa) and you set the stage for one of the most unexpected increases in value for a precious metal this year. But crypto became even more cryptic\n\nDonald Trump’s election was a very different story for another, much more volatile, investment class. Backers of cryptocurrencies believed the new president would drive prices up. There was speculation that Bitcoin – then trading at about $US100,000 – would move through the $US150,000 mark. But Bitcoin finishes the year around the $US87,000 mark, having tumbled from its October peak of $US124,700. It’s not just Bitcoin that has suffered as investors have shunned more colourful investment opportunities due to concerns over American inflation. By some estimates, more than $US1 trillion in value was wiped from cryptocurrencies through the final three months of 2025.\n\nThe inopportune trade surplus with the United States Australia produces very little platinum. But it is one of the world’s biggest gold producers. The big lift in gold prices did something that had not happened since Harry Truman was in the White House – deliver Australia a trade surplus with the United States. In January, February, March and then in July, gold was a key factor in Australia selling more goods and services to the US than buying them.\n\nWith Donald Trump attacking any nation that ran a trade surplus with the US (the penguins and seals of Heard and McDonald Islands at one point faced an American tariff hit), it could not have come at a worse time. It hasn’t been helped by the drop-off in American tourism to Australia. There were almost 100,000 fewer visitors from the US over the past 12 months compared with the same period ahead of COVID. American tourists aren’t getting as much value for their greenback, either. A big global story has been the drop in the value of the United States dollar. The Australian dollar appreciated by 8 per cent against its US counterpart.\n\nThat might make it more enticing for prospective Australian tourists to check out Trump’s America – as long as they’re ready to hand over all their social media history. The taxman cometh Even Jim Chalmers could not believe the position Peter Dutton took ahead of the 2025 election. The Coalition went to voters opposed to Labor’s modest personal income tax cuts that start flowing from July 1 this year. Loading The tax cuts, which will be delivered over two years, were the one big surprise out of Chalmers’ March budget. Even more surprising was the Coalition’s opposition.\n\nThe budget is increasingly reliant on personal income tax collections. A combination of bracket creep, a strong jobs market and a tax system that gives more concessions to wealth and assets (particularly those held by older Australians) means the tax burden on ordinary workers is growing. The mid-year budget update revealed that of all income taxes collected by the government – personal, company, superannuation, petroleum and fringe benefits – the share coming from workers is on track to hit 69 per cent by 2028-29. Cost-of-living crisis? Try 1692 per cent inflation The re-emergence of inflation pressures, both in Australia and around the world, caught pundits and central banks off guard.\n\nDomestically, trying to track accurately price pressures across the economy was made more difficult by government energy subsidies. Headline inflation, which had peaked at 7.8 per cent in late 2022, tumbled to 1.9 per cent by the middle of this year. But then came the end of various state and federal electricity subsidies. While the federal government’s $75-a-quarter subsidy finally ended with the calendar year, the biggest impact occurred in Brisbane where the former Miles government’s $1000 came to an end in June. That led to electricity inflation in Brisbane jumping by a mind-boggling 1692.5 per cent in July. A year earlier, it had been minus 93 per cent. By year’s end, Brisbane’s overall inflation rate was a nation-leading 5.2 per cent.\n\nWhile electricity prices have been upended by government action, coffee prices have soared due to international factors. A global supply shortage due to poor weather in key growing areas has meant that anyone with a coffee (or chocolate) addiction has had to pay through the nose for their daily caffeine hit. The single largest weekly purchase by Australian households is the fuel for their cars. During 2025, Peter Dutton spent much of the election campaign visiting service stations and promising that a Coalition government would halve the fuel excise for 12 months. But petrol prices were relatively stable. Even as Dutton was manhandling bowsers everywhere he went, petrol was actually cheaper than it had been a year earlier.\n\nThe Uncertainty Index If you were confused by the economic events of the year, spare a thought for the Reserve Bank. It started the year with its first interest rate cut since the start of the COVID pandemic amid signs that inflation was easing. Despite three rate cuts, the bank finished the year with financial markets tipping it would start lifting interest rates in February.\n\nLoading In a sign of the economic rollercoaster faced by the bank, following Trump’s “liberation day” tariffs, it actually discussed a half percentage point rate cut to offset a global downturn. Every three months, the bank issues its “statement on monetary policy”, which contains key forecasts as well as a general discussion of the economy’s outlook. It was in the May iteration of that statement that the bank’s confusion – shared by the rest of the world – became clear. That one statement used the term “uncertain” on 132 occasions.\n\nNever before had the bank been so unsure of the future. A growing population – but more slowly One of the most politically charged debates of the year has been population growth or, more specifically, net overseas migration. Australia has increasingly relied on migrants to grow the population, fill specialised and non-skilled jobs while international students had become the cash cows of the nation’s universities. But the post-COVID surge in migration, on top of a lift in house prices (which picked up as soon as the Reserve Bank started cutting interest rates), combined to give the debate over immigration a sharp political edge through 2025.\n\nSince the international border was reopened in early 2022, net overseas migration has added almost 1.5 million residents to the country. Some of the surge was due to the two-year closure of the international border. In particular, students who had not been able to get into the country flooded back (and provided much-needed staff to the nation’s cafes and restaurants). That pushed net overseas migration to a record 555,000 in late 2023. It has eased since then, so much so that the government’s own budget estimates for the 2024-25 overestimated net overseas migration by 30,000.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/usman-khawaja-announces-retirement-from-international-cricket/0cgqnrsy1",
    "title": "Usman Khawaja announces retirement from international cricket",
    "publish_date": "Thu, 1 Jan 2026 21:30:39 +0000",
    "category": "sports",
    "authors": [],
    "text": "Veteran Australian cricketer Usman Khawaja has announced his retirement from international cricket.\n\n\n\n\n\n\"God, through cricket, has given me far more than I ever imagined,\" he told reporters at a press conference at the Sydney Cricket Ground (SCG) on Friday morning.\n\n\n\n\n\n\"He's given me memories I'll carry forever, friendships that go well beyond the game, and lessons that shaped me, who I am off the field.\"\n\n\n\n\n\nKhawaja said the fifth Ashes Test of the series at the SCG — where he made his debut in 2011 — will be his last.\n\n\n\n\n\nHis announcement followed months of speculation about his future. He was unable to open in the first Ashes Test in Perth in November due to back spasms and then missed the Brisbane Test last month with the injury.\n\n\n\nDuring the press conference at which he announced his retirement, Usman Khawaja also told reporters that he'd been subjected to double standards after speaking about political issues in recent years. Source: AAP / Robbie Stephenson / PA Wire At age 39, he will become Australia's oldest Test player in 40 years at the SCG on Sunday.\n\n\n\n\n\nHe will finish with 88 Tests to his name, having already risen to be Australia's 15th greatest run-scorer in history with 6,206.\n\n\n\nKhawaja criticises double standards in cricket\n\nOn-field accomplishments aside, Khawaja has been widely regarded as a trailblazer in Australian sport.\n\n\n\n\n\nThe first Muslim to play Test cricket for Australia, he's been a prominent advocate for inclusion and representation, speaking openly about faith, racism and belonging at the elite level.\n\n\n\n\n\nKhawaja has also used his profile to advocate for humanitarian causes, and he has been a vocal supporter of the people of Gaza during Israel's post-October-7 military campaign in the enclave.\n\n\n\nLISTEN TO Aid agencies in Gaza condemn Israel's suspension of their licences to operate SBS News 03:07 English\n\nHe used Friday's announcement as a chance to highlight issues that still exist within the game, beginning with coverage of his back spasms this year.\n\n\n\n\n\nKhawaja was heavily criticised in some quarters for playing golf in the lead up to the Perth Test, before the spasms forced him from the field and then ruled him out of Brisbane.\n\n\n\n\n\n\"I could have copped it for two days, but I copped it for five days straight,\" Khawaja said.\n\n\n\n\n\n\"It wasn't even about my performances, it was about something very personal. It was about my preparation.\n\n\n\n\n\n\"The way that everyone came at me about my preparation was quite personal in terms of things like 'he's not committed to the team, he was only worried about himself, he played this golf comp the day before, he's selfish, he doesn't train hard enough, he's lazy'.\n\n\n\n\n\n\"These are the same racial stereotypes that I've grown up with my whole life.\"\n\n\n\nKhawaja said the comments from former players and those in the media were at odds with the way other injuries were spoken about.\n\n\n\n\n\n\"I can give you countless number of guys who have played golf the day before a match and have been injured, but you guys haven't said a thing.\n\n\n\n\n\n\"I can give you even more examples of guys who have had 15 schooners the night before a game and have then been injured, but no-one said a word because they were just being Aussie larrikins, they were just being lads.\n\n\n\n\n\n\"But when I get injured, everyone went at my credibility and who I am as a person.\n\n\n\n\n\nKhawaja believed part of that commentary came down to the fact he had been outspoken on political issues in recent years, and the most notably the plight of Palestinians.\n\n\n\n\"I kind of know why I get nailed a lot of the time, particularly over the last two years,\" he said.\n\n\n\n\n\n\"I understand that I've talked about certain issues outside cricket which leaves me exposed and a lot of people don't like that.\n\n\n\n\n\n\"I still find it hard when I say that everyone deserves freedom and that Palestinians deserve freedom and equal rights, and why that's a big issue.\n\n\n\n\n\n\"But I get it because I put myself out there.\n\n\n\n\n\n\"Even when we get to Australian politics and we get all these right-wing politicians that are anti-immigration and (fuel) Islamophobia and I speak up against them, I know that people don't love that.\n\n\n\n\n\n\"But I feel like I have to because where these guys are trying to divide and create hate and trying to create animosity in the Australian community, I'm doing the exact opposite.\"\n\n\n\nSCG fitting location for Khawaja's farewell\n\nHis decision to walk away also means the Sydney Test will also turn into something of a farewell party, with the series decided and Australia 3-1 up.\n\n\n\n\n\nSydney will be a fitting location for his final Test, given so much of his career has been based around the city he moved to as a four-year-old from Islamabad, Pakistan.\n\n\n\n\n\nHis 2011 debut against England, in which he scored 37 runs, offered Australian fans hope at the end of the worst home summer this century.\n\n\n\nUsman Khawaja with his wife Rachel and children Aisha and Ayla at the Sydney Cricket Ground, where Khawaja will soon play his final Test match. Source: AAP / Dan Himbrechts And it was at the SCG where he revived his career as a 35-year-old, scoring twin centuries against England when Travis Head missed a Test in 2022 during the COVID-19 pandemic.\n\n\n\n\n\nThat Test prompted one of the great late-career revivals, hitting seven centuries in his first two years back in the side as part of a dominant opening partnership with childhood friend David Warner.\n\n\n\n\n\n— With additional reporting from the Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 9
  },
  {
    "url": "https://www.sbs.com.au/news/article/dakar-rally-2026-sbs-what-to-know/pn56fkgu4",
    "title": "Dakar Rally 2026 nears as Aussie champ Daniel Sanders eyes 'back-to-back' wins",
    "publish_date": "Thu, 1 Jan 2026 18:32:46 +0000",
    "category": "sports",
    "authors": [],
    "text": "The countdown is on for the \"world's toughest motor race\", and last year's Dakar Rally champion, Australian Daniel Sanders, is returning to defend his title in the bikes.\n\n\n\n\n\n\"We're gonna go, try and go back-to-back,\" the 31-year-old motorcyclist told SBS French.\n\n\n\n\n\n\"We've had a really great '25 year ... winning four out of five races, and winning the Dakar, then the world championships. So, pretty proud and, you know, almost a perfect season.\"\n\n\n\n\n\nThe Red Bull KTM Racing Factory rider's record-breaking year secured him the World Rally-Raid Championship title in September after a winning streak on the international circuit.\n\n\n\nREAD MORE Dakar Rally 2026: Your questions answered\n\nNow, he's hoping to continue his dominance as he heads back to Saudi Arabia for the 2026 Dakar Rally.\n\n\n\n\n\nThe Dakar Rally, an annual rally raid, is famous for its rough terrain and off-road endurance, with competitors in various categories including cars, bikes, trucks and quads racing across sand, rocks, gravel and tarmac.\n\n\n\n\n\nDrivers must navigate unpredictable obstacles at speed on a gruelling, days-long journey of almost 8,000km, broken into 13 stages and one rest day.\n\n\n\nOne year, the unforgiving desert competition resulted in Sanders getting four stitches to his lip from a crash as he powered over a dune. On another occasion, a bee slipped under his helmet and stung him on the lip.\n\n\n\n\n\nOver 600 drivers and teams will take part in the 2026 race, including Australians Toby Price and David Brock.\n\n\n\n\n\nSBS On Demand will have hour-long highlights of each stage available earlier each morning for the duration of the Dakar Rally, before SBS replay the program at 5pm (AEDT).\n\n\n\nREAD MORE How to watch Dakar Rally 2026 exclusive and free on SBS\n\nOn Demand will also house a special Dakar Rally hub for the 2026 edition, complete with extended highlights, must-see moments, interviews and more.\n\n\n\n\n\nThe competition starts with a prologue on Sunday, with Stage 1 kicking off on Monday.\n\n\n\n\n\nWatch daily extended highlights from the 2026 edition of the Dakar Rally each morning via our hub in SBS On Demand — plus a daily 15-minute mini recap and more from January 4-18 (AEDT).\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/video/global-celebrations-mark-the-start-of-2026/urfb8wy8n",
    "title": "Global celebrations mark the start of 2026",
    "publish_date": "Thu, 1 Jan 2026 08:21:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Global celebrations mark the start of 2026\n\nPublished 1 January 2026, 5:58 am\n\nFrom Tonga to Times Square. The world has been celebrating the start of a new year. With fireworks, light shows, ancient traditions and state-sanctioned fun, millions turned out to ring in 2026 in style.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/government-disappointed-with-chinas-new-beef-import-tariffs/qnack33o9",
    "title": "Government 'disappointed' with China's new beef import tariffs",
    "publish_date": "Thu, 1 Jan 2026 06:53:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Trade Minister Don Farrell has said the government is \"disappointed\" with China's decision to impose new beef import tariffs, with one industry group warning the move could damage trade worth over $1 billion between the two countries.\n\n\n\n\n\nChina announced it would impose additional 55 percent tariffs on some beef imports from countries including Brazil, Australia and the United States that exceed a certain quantity for the next three years.\n\n\n\n\n\nThe country also said it would suspend part of a free trade agreement with Australia covering beef.\n\n\n\n\n\n\"We are disappointed by this decision,\" Farrell said in a statement.\n\n\n\n\n\n\"We have made it clear to China that Australian beef is not a risk to their beef sector, and that we expect our status as a valued free trade agreement partner to be respected.\"\n\n\n\n\n\n\"Our beef is world-class and high in demand, and we will continue to advocate for and support our beef industry.\"\n\n\n\nChina's beef import market\n\nChina is Australia's second-most lucrative beef export market, behind the United States.\n\n\n\n\n\nUnder the new rules, Australia faces a quota of around 200,000 tons for 2026.\n\n\n\n\n\nThe tariffs follow China's beef price trending downwards in recent years, with analysts blaming oversupply and a lack of demand as the world's second-largest economy has slowed.\n\n\n\nREAD MORE China responds to Australian criticism of military drills, Taiwan still on high alert\n\nAt the same time, Chinese beef imports from countries such as Brazil, Argentina and Australia have surged.\n\n\n\n\n\nInvestigators found that beef imports had damaged China's domestic industry, Beijing said.\n\n\n\nIndustry group warns of hit on $1 billion sector\n\nThe Australian Meat Industry Council said in a statement the new restrictions had the \"potential to reduce Australian beef exports to China by about one-third compared to the last twelve months — trade worth over A$1 billion\".\n\n\n\n\n\nThe council's executive officer Tim Ryan warned the tariffs would have a \"severe impact\" on trade flows to China and \"restrict the ability for Chinese consumers to access safe and reliable Australian beef\".\n\n\n\n\n\nThe relationship between the two countries has improved in recent years with Beijing lifting a slew of bans on Australia's most lucrative export commodities.\n\n\n\nTensions began in 2018 when Canberra excluded telecommunications giant Huawei from its 5G network on security grounds and later passed laws on foreign interference.\n\n\n\n\n\nThen in 2020, Australia called for an international investigation into the origins of COVID-19 — an action China saw as politically motivated.\n\n\n\n\n\nAustralia has spent much of the past few years trying to insulate the vital trade relationship with China — its biggest trade partner — from geopolitical headwinds.\n\n\n\n\n\nAustralia is part of a loose US-led alliance that has aggressively pushed back against China's bid for influence in the Pacific region.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 0
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/should-artificial-intelligence-be-used-in-job-recruitment/qcbd4zrqq",
    "title": "Should artificial intelligence be used in job recruitment?",
    "publish_date": "Wed, 31 Dec 2025 20:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nFor more than a decade, Melbourne-based social enterprise, Sisterworks, has been helping migrant and refugee women enter the workforce.\n\n\n\n\n\n\"If you're in a real interview, you're looking at the person ,you're looking at their eyes.\"\n\n\n\n\n\nTraining courses focus on customer service, hospitality and people skills, as well as networking, resume writing and interviewing to ensure the women are 'job ready'.\n\n\n\n\n\nBut Ifrin Fittock, Sisterworks CEO, says late last year, a group of nine graduates found themselves in a situation neither they or their teachers had prepared for.\n\n\n\n\n\n\"We actually got caught on surprise when towards the end of last year we sent about nine sisters to an interview and they didn't make it, they didn't pass the interview. Upon investigation, we found out that they're actually not being interviewed face to face, but actually being interviewed by videos slash AI interviews and because they've never been exposed to it before, I think they just failed because they don't know what to do.\"\n\n\n\n\n\nTheir experience is not unique, with job seekers increasingly sharing their own experiences with so-called \"robo\" interviews on social media.\n\n\n\n\n\nMAN: \"Hello.\"\n\n\n\nROBOT: \"Hi, thank you so much for joining the interview today. I'm so excited to talk to you and get to know more about you.\"\n\n\n\n\n\n\"Robo\" interviews are when a candidate is interviewed by an AI system rather than a human.\n\n\n\n\n\nFittock says this style of interview can add extra barriers for migrant and refugee applicants.\n\n\n\n\n\n\"The challenges with these AI recruitment or AI interview for some of our sisters is really, first of all, English is not their first language, but also the level of digital literacy that they may or may not have because they need to actually navigate through, apart from answering questions, they also need to navigate that click of a button and pay attention to the timer and all that pressure really mounting up, especially when you see the ticking clock running in front of you. So it's all really quite confronting.\"\n\n\n\n\n\nIn 2024, 43 percent of organisations use AI \"moderately\" in their recruitment, while 19 per cent use the technology \"extensively\" when hiring new staff.\n\n\n\n\n\nThat's according to The Australian Responsible AI report, which details how Australian businesses are tracking when it comes to AI practices.\n\n\n\n\n\nAs employers increasingly embrace AI, video interview training is now part of the Sisterworks job course.\n\n\n\n\n\nFatemeh Hazrati - orginally from Iran - is among those currently taking part in the program.\n\n\n\n\n\n\"AI has real big effect on our life nowadays. All of us have to learn it, [and] [We] just need to adapt ourself for new things and accept challenges to learn new things.\"\n\n\n\n\n\nAI in recruitment is often touted for its ability to save both time and money.\n\n\n\n\n\nBut there are mounting concerns around its potential to discriminate.\n\n\n\n\n\nDoctor Natalie Sheard is from the Melbourne Law School at the University of Melbourne.\n\n\n\n\n\nShe led a study published earlier this month [[May 14]] that suggests AI hiring systems are creating new barriers to employment.\n\n\n\n\n\n\"So it could be older applicants, women, people who speak English as a second language, job seekers with disabilities. In my research I heard of systems not being accessible to job seekers with disabilities. I heard of CV screening systems using things like gaps in employment history to screen candidates out and having a gap in your employment history is a well-known proxy for gender as women tend to have time out of the workforce to care for family.\"\n\n\n\n\n\nShe also explains how those with English as a second language can be disadvantaged in video interviews.\n\n\n\n\n\n\"Another concern is that the way these systems tend to operate is the AI doesn't assess the video. What happens is the audio from your video is transcribed and then AI is used to evaluate your answer and it's well established that those transcription services perform poorly for people who speak English as a second language or have accents.\"\n\n\n\n\n\nMonash University's Professor Andreas Leibbrandt has also researched the role of AI in recruitment.\n\n\n\n\n\nHe says there are benefits to the technology, and if deployed correctly, a system can be less bias than a human.\n\n\n\n\n\nIn one study, conducted in the US, he found women and non-anglo candidates are more likely to apply for a job if they know AI tools are being used.\n\n\n\n\n\n\"It's not that both women or ethnic minorities feel there's no bias in the AI algorithm, but they feel that this bias is less so than when they're faced with a human recruiter.\"\n\n\n\n\n\nBut he's concerned by a lack of transparency, regulation and potential bias built into algorithms.\n\n\n\n\n\n\"These AI algorithm are fed with training data sets or data sets from corporations. But their training data in itself may be biased. It may come from an organisation where there was, for instance, bias against women.\"\n\n\n\n\n\nThe issue around data sets and algorithms also emerged in Doctor Sheard's research.\n\n\n\n\n\n\"So one example there is a lot of these systems are built overseas, so they might've been trained on data on populations that aren't comparable to the Australian population. And therefore again, the system won't perform as well for particular demographic groups that we have in Australia. For example, refugees, migrant women, first Nations, Australians.\"\n\n\n\n\n\nThere are growing calls for the Australian government to better regulate the use of AI in recruitment.\n\n\n\n\n\nCatherine Hunter is the CEO of Diversity Council Australia - the independent not-for-profit peak body leading diversity and inclusion in the workplace.\n\n\n\n\n\n\"With such high adoption rates and the rapid acceleration of the technology, we're just concerned that people aren't putting in place the proper considerations around ethical use.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/national/nsw/woman-dead-after-being-knocked-into-water-at-sydney-beach-20260101-p5nr0m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Huge search resumes at Coogee for popular local bartender",
    "publish_date": "Fri, 02 Jan 2026 13:12:17 +1100",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo",
      "Ben Cubby",
      "Jack Gramenz"
    ],
    "text": "A large number of rescue teams have converged on Coogee Beach to try to find the Nepalese national swept out to sea on New Year’s morning with colleagues praising the missing man as a “top guy”.\n\nTwo helicopters, several boats, a drone and surf lifesavers are assisting divers to scour nearby waters for Sushan Khadka, a student and bartender at the Coogee Pavilion in his 20s, who arrived in Australia about four years ago from Nepal.\n\nThe search sontinues for a swimmer missing after being swept out to sea at Coogee on New Year’s morning. Credit: Sitthixay Ditthavong\n\nSurf Life Saving NSW chief executive Steven Pearce said the “significant show of force” at Coogee was focused on finding Khadka alive, and that the large-scale operation would continue into Friday afternoon.\n\nInvestigators dropped green dye marker at the southern end of Coogee about 10am, as several divers tracked the currents while lifesavers on jet-skis crisscrossed the ocean.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/business/markets/australian-sharemarket-set-to-open-lower-20260101-p5nr38.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX dips on first day of trading; miners and info tech firms fall",
    "publish_date": "Fri, 02 Jan 2026 12:53:18 +1100",
    "category": "finance",
    "authors": [
      "Millie Muroi"
    ],
    "text": "Miners and tech companies have weighed on investors in the first session of the new year with the Australian sharemarket posting a lacklustre performance.\n\nThe S&P/ASX 200 index was down 3.3 points, or 0.04 per cent, to 8711 points about midday (AEDT), with five of the 11 industrial sectors trading in the green.\n\nThe Australian sharemarket is expected to open lower in its first day of trade for 2026. Credit: Louie Douvis\n\nThe Australian dollar was stronger, fetching about US66.90¢.\n\nThe S&P/ASX 200 closed down 2.8 points at 8714.30 on Wednesday as the market finished trade early for New Year’s Eve. It remained closed on New Year’s Day.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/property/news/sydney-and-melbourne-house-values-dip-on-rate-fears-20251231-p5nqwe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney and Melbourne house values dip on rate fears",
    "publish_date": "Fri, 02 Jan 2026 12:42:13 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "House values in Sydney and Melbourne fell in December amid signs the combination of increasingly unaffordable homes and the prospect of a new year interest rate rise have hit the nation’s two largest property markets.\n\nFigures compiled by property data firm Cotality show house values fell by 0.3 per cent in Sydney and 0.1 per cent in Melbourne last month. It was the first time since January last year that value in the two cities had fallen.\n\nHouse values eased for the first time in a year in Sydney and Melbourne. Credit: Dion Georgopoulos\n\nSydney’s median house value, despite last month’s easing, still stands at almost $1.6 million while in Melbourne the figure is $981,165.\n\nWhile the two largest markets eased, values lifted in every other capital, led by a 2.1 per cent jump in Darwin, where the median house value is now $697,251. Values lifted by 1.9 per cent in Perth (to $983,068) and Adelaide ($960,051) while there was a 1.5 per cent increase in Brisbane ($1,131,329).",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/afl/neale-quits-lions-captaincy-20260102-p5nr8u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Neale quits Lions captaincy",
    "publish_date": "Fri, 02 Jan 2026 12:24:17 +1100",
    "category": "finance",
    "authors": [],
    "text": "Neale quits Lions captaincy\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/world/chaotic-scenes-as-fire-rips-through-bar-in-swiss-ski-resort-20260102-p5nr88.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chaotic scenes as fire rips through bar in Swiss ski resort",
    "publish_date": "Fri, 02 Jan 2026 12:16:44 +1100",
    "category": "finance",
    "authors": [],
    "text": "Chaotic scenes as fire rips through bar in Swiss ski resort\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/basketball/why-simmons-hasnt-reached-his-potential-20260102-p5nr8d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Simmons hasn't reached his potential?",
    "publish_date": "Fri, 02 Jan 2026 12:08:02 +1100",
    "category": "finance",
    "authors": [],
    "text": "Why Simmons hasn't reached his potential?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/two-more-teenagers-charged-after-st-kilda-pier-attack-20260102-p5nr8c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Two more teenagers charged after St Kilda Pier attack",
    "publish_date": "Fri, 02 Jan 2026 12:07:48 +1100",
    "category": "finance",
    "authors": [],
    "text": "Two more teenagers charged after St Kilda Pier attack\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/khawaja-was-dropped-eight-times-he-explains-how-he-kept-coming-back-20260102-p5nr6l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Khawaja was dropped eight times. He explains how he kept coming back",
    "publish_date": "Fri, 02 Jan 2026 12:04:51 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "But he was dropped and recalled so many times that Khawaja was left to conclude that he did not fit the mould. There were axings in 2011 (twice), 2013 (plus a homework suspension in India), 2016, 2017 (twice), 2019 and then finally, for a day in Adelaide this series. As often happens, recalls came as a result of others’ misfortune - Travis Head’s positive COVID Test in 2022, for example, when Khawaja marked his return with back-to-back hundreds at the SCG. Khawaja embraces his father, Tariq. Credit: Getty Images “I’ve broken down so many barriers, I’ve had to fight so many battles,” he says. “I got dropped a lot early on because I was different, I didn’t really fit into the mould, the 50/50 calls went against me. I’ve no doubt of that. “I don’t say this with any prejudice because I loved my journey, I’m very grateful for where I am right now, but if my name was John Smith I would’ve got away with a bit more if I’m totally honest. But I wasn’t and I was trying to break that down.”\n\nLoading As a committed Muslim, Khawaja looks upon his subsequent recall to finish the series as somewhat providential. It had arrived after he made his peace with God that if Perth was to prove his final Test match, he was grateful nonetheless. “It has to be, right? I know people don’t believe in God, but I believe God does everything, the good and the bad,” Khawaja says. “I pray five times a day every day and have a very close connection with God personally, and for me it wasn’t like ‘please God let me play again, let me finish my career like this’, it was, ‘thank you for everything you’ve given me, I’m very grateful and happy to go out now’. “I wasn’t expecting to play again and once I didn’t play in Adelaide I thought it’s going to be hard for me to play unless something goes awry, which it did. But the odds of that happening are low, batsmen don’t miss a lot of Test matches. So I was very comfortable. I was in my gratitude state, which I have been for a long time, saying thank you for all the Test matches I’ve played, been able to do a lot of great stuff both inside and outside of cricket. “I was really just happy to help the team out if they needed me. I never wanted to be a guy who left a series halfway through. No offence to anyone who has, everyone has the right to leave whenever they want, but I tried to avoid that because I knew if something happened to one of the batsmen the series was still alive. So I said I’m happy to be 12th man until the end of the series if that’s the case and I’ll just retire in Sydney.”\n\nOver these past few weeks there has been much said about “farewell” matches or series, and whether Khawaja deserves one. It has rankled him, especially given that internal discussions have been more about getting him to play one more India tour in 2027 rather than pushing him to the exit. There is something poetic about how Khawaja will finish his Test career having played two distinct halves. Forty-four Tests between 2011 and 2019 when he was in and out of the side, then another 44 Tests over the past four years where he has been a trusted and ever-present member of the team. Khawaja announces his retirement. Credit: Dominic Lorrimer “It really annoyed me that everyone was talking about the farewell tour,” he says. “I didn’t care about that. It wasn’t a case of finishing at the SCG, it was a case of finishing the series and if that’s the last one it’s the last one. To be honest it’s been more so that Andrew McDonald has kept pushing me, too. I could’ve left last summer. Even this year when I haven’t had a great year by my standards, I was still wanted. “This whole period was always a bonus for me, and I think it’s helped me to play. It took a little bit of stress and pressure off me. I was never holding on, I was always ready to go. Whenever I felt like it was time to go, I was ready to go. Even right until the very end when I spoke to Andrew, he was laughing and going ‘how can we get you to India, what do we need to do?’\n\n“So it was nice to think if I said I was staying on this wasn’t my last match. Pretty positive I would’ve played the next series and gone to South Africa. You obviously need to score runs to be in the team, but it wasn’t a case that I was getting dropped. I’m happy and content that I was still in the team and I’ve left on my own terms rather than being pushed out.” Providence or not, there will also be something entirely fitting about Khawaja’s final Test match taking place at the SCG. The SCG and the suburbs around it were where Khawaja spent his first few summers in Australia between 1991 and 1995, sparking the love of cricket that still burns brightly whenever he speaks about it. “The SCG was 10 minutes down the road. I was in absolute awe of the NSW guys. I used to watch Richard Chee Quee when I was younger, not knowing I’d get to play with him one day in grade cricket,” Khawaja says. “He helped me a lot through those early years of grade cricket and learning how to play with men, when I was just coming in as a 16-year-old, learning the art and getting absolutely nailed by everyone, especially as a little brown kid trying to play a very white game in Sydney.“\n\nMoney was tight in the Khawaja household. To get a glimpse of international cricket up close, the family would wait until the closing overs of a match, when attendants would open the public gates for early departures, to sneak in for the end of day/night games. Khawaja remains conscious of the cost of playing the game for immigrant and working-class families. “We couldn’t afford tickets. My Mum said tickets were about $30 each back then, and that was way too much for us. So we’d wait right until the end of a one-dayer, they’d open the gates and I’d get to see the last five overs or so. We’d run in and watch the last little bit of cricket and that’s all I got. Back then if the game wasn’t sold out on TV they wouldn’t even show it, so I’d be 10 minutes away from the SCG listening to it on the radio. I’ve never lost those memories. “I watched my first game of cricket in the old Doug Walters Stand, it was disgusting, but luckily with my skin colour I could get away with it in the sun. But we were watching Dean Jones and Mark Waugh batting and my brother would go ‘watch these guys, they’re the best runners between the wickets ever’ and the aura of the Australian team. “Then to be able to play there, debut there for NSW, debut there for Australia, make my comeback there, in 2022 and hopefully finish there, So much emotion goes into that ground for me, because I grew up literally next to it. It’s a very special place.”\n\nKhawaja celebrating the first of two centuries on his return to the Test side at the SCG in 2022 against England. Credit: Getty Images Khawaja will finish in esteemed company among Australian top order players. He’s currently 29 runs short of the runs tallied by Mike Hussey, and has more hundreds than the likes of Doug Walters, Ian Chappell or Bill Lawry. But his defining achievement, more than any runs, centuries or victories, will be in showing it is possible for a south Asian Australian to play the game at the highest level for a long time. In his own, wise-cracking way, Khawaja is to Australian cricket what Jim Brown was to American football or Jackie Robinson to baseball: pathfinders. “There was a wide narrative among the multicultural community that we can’t represent Australia in cricket, they don’t pick our kind,” he says. “All those narratives that we’re lazy, we’re selfish, we don’t care about the team, we don’t mingle well. All these false racial stereotypes I had to try to break down throughout my career, even up until now. “The journey’s been so much tougher but I’m so grateful I got to do it because I’ve been able to show people of all backgrounds, it doesn’t matter what ethnicity, what colour or what faith you have, you can play for Australia. You might have to be a little more resilient than the guy next to you, you have to go in there with an open mind and understand that.\n\n“Your journey might not be as easy, but hopefully now I’ve done this journey and been very successful, hopefully the next person will have an easier journey. Then the next person after that will have an easier journey. Then hopefully at some point they’ll have the same journey. That’s the ultimate goal. Seeing is believing, and they’ve seen it now.” This is not to say that the job is done. Far from it. In the weeks and months after his final Test match, Khawaja will play plenty of golf, spend plenty more time with his young and growing family, and do the odd bit of commentary. But he will also work assiduously at trying to keep that pathway open. Loading “I didn’t like the Australian cricket team growing up because I didn’t see myself in the team,” Khawaja says. “I supported the Windies or Pakistan, pretty much anyone but Australia, until the age of 13 when Gilly and Brett Lee won me over with the way they played the game. I decided ‘I love these guys’. They didn’t seem like that older generation.”",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/planning-a-wedding-in-2026-here-is-what-s-trending-for-the-year-ahead-20260102-p5nr62.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Planning a wedding in 2026? Here is what’s trending for the year ahead",
    "publish_date": "Fri, 02 Jan 2026 11:54:54 +1100",
    "category": "lifestyle",
    "authors": [
      "Ivy Manners"
    ],
    "text": "Unconventional Venues Loni Peterson, the owner of LP Creative Events in Denver, says wedding venues will continue to be more surprising with spaces such as historic ruins, caves and airport hangars. “Couples want their special day to stand out among the noise and one way they can do that is by hosting their guests at a ‘non wedding’ venue,” she says. “We are also having couples holding their events in open fields, fairgrounds and ski and snowboard trails.” Prime Minister Anthony Albanese and Jodie Haydon were among those who married at non wedding venues in 2025 when they tied the knot at The Lodge. They also wrote their own vows. Credit: Mike Bowers\n\nMultiple Celebrations Xin Huang, a wedding planner and the owner of Le Petite Privé in New York, says she is seeing many couples host celebrations spread out over months – whether with a cultural ceremony or a reception months before or after the legal marriage, or separate receptions months apart. Couples are also celebrating across cities or countries that have meaning to them or where their loved ones live. “This is a beautiful way to parade your love and share what is important to you in the different settings and cultures that speak to you,” Huang says. Projected Videos “With draping and white colour schemes being two huge decor trends in 2025, there has been a natural progression with the use of projection,” says Jessica Ralph, the owner and executive planner of Parties A La Carte in Tampa Bay, Florida.\n\nLoading “Draped, sheer white overlay creates an effective backdrop for projection and an elevated, romantic setting.” (Videos can be displayed on a blank wall, with rear projection used to ensure a seamless set-up.) Some couples are also using a mix of photos from their relationship, while others are focusing on engagement session images, says Masha Sakhno, the founder of Masha Sakhno Photo in Honolulu. In addition to sharing their love story, couples are also displaying images of family members. “It’s a great way to add sentiment and nostalgia to the celebration,” she says. Memorable Entertainment Wedding attendees can expect to be entertained more. Couples are welcoming guests with musicians and dancers, blending DJs with live bands (or saxophones), and introducing unexpected performances during cocktail hour. Many are also adding activities that engage other senses, such as coffee stations, gelato carts or custom fragrance bars.\n\nLoading “Couples are seeking those surprise-and-delight moments that make guests feel part of something personal and alive,” says Fallon Carter, an event planner and the founder of Fallon Carter Events in Washington, DC. Love Notes Pinterest’s 2026 trends predictions anticipate a resurgence in personalised notes and letters. Peterson says more of her clients were incorporating notes to their guests in their reception decor. “I’m seeing them find unique ways to connect with each guest,” she says, “whether thanking them for travelling to celebrate their marriage, including an inside joke or introducing them to the person sitting next to them at their table.” Heidi Moore, a stationer and the owner of Idieh Design, based in Phoenix, has also noticed that many of her clients are choosing to leave individualised notes.\n\n“Some craft one message per couple, while others write a unique note for each person,” she says. Sometimes handwriting is replaced with handwritten-style fonts to save time. Dessert Cocktails Couples will be incorporating signature dessert cocktails during the cake cutting to elevate the moment, says Koby Morris, the owner of Southern Standard, an events bar services company based in New Braunfels, Texas. Decadent, fruity mocktails and espresso martinis are favourites that will be also trending in 2026. Curated Food There is an increasing focus on food as part of the overall design, rather than simply sustenance, says Alice Wilkes, a wedding planner and the founder of Alice Wilkes Design in London.\n\n“Planners are seeing a growing interest in the presentation of food itself, with beautifully styled dishes, canapes and drinks becoming an extension of the event’s aesthetic and storytelling,” she says. “Couples are embracing elevated dessert rooms, tasting stations and interactive chef-led moments.” It’s no longer a case of chicken or beef at weddings with more emphasis on presentation and curated menus. Deborah Miller, the founder of Deborah Miller Catering & Events in New York, is seeing more couples opt for cocktail-style wedding receptions, with food stations, passed canapes and small plates over more traditional plated dinners. “This allows for a lot more culinary creativity,” Miller says.\n\nBold Colours and Stripes Pinterest’s 2026 trends report also predicts that vivid colours and stripes will inspire decor choices, which event planners forecast will influence weddings. “We’re seeing couples choosing to make a statement with saturated colours,” says Dawn Crothers, the president and creative director of Something Vintage Rentals, based in Temple Hills, Maryland. “Hues like red, teal, burgundy and deep green will be strong for 2026.” “Full-colour tablescapes, mixed-hue glassware, layered colourful florals and vivid linens will be popular for creating immersive, theatrical environments,” says Sarah Farsh, an owner and the creative director of Olympic Valley Stables, an event venue in Olympic Valley, California, and an owner of Tahoe Engaged, a wedding vendor directory. Bridal Party Outfit Changes Second looks are no longer just for the bride and groom. Patricia Voto, a New York-based designer and the founder of One Of, recently created three looks for a mother of the bride, who changed from ceremony to reception to after-party.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/usman-khawaja-retires-with-a-bang-20260102-p5nr80.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Usman Khawaja retires with a bang",
    "publish_date": "Fri, 02 Jan 2026 11:45:10 +1100",
    "category": "finance",
    "authors": [],
    "text": "Usman Khawaja retires with a bang\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/world/the-epstein-files-what-we-know-so-far-20251231-p5nqxg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Epstein files: What we know so far",
    "publish_date": "Fri, 02 Jan 2026 11:39:34 +1100",
    "category": "finance",
    "authors": [],
    "text": "The Epstein files: What we know so far\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/politics/federal/gold-coffee-and-donald-trump-australia-s-rollercoaster-economic-year-in-10-charts-20251228-p5nqds.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gold, coffee and Donald Trump: Australia’s rollercoaster economic year in 10 charts",
    "publish_date": "Fri, 02 Jan 2026 11:30:00 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "Platinum, used in high-end jewellery, benefited from the lift in gold. At half the price of its shiny precious metal counterpart, platinum is relatively cheap for jewellers. It is also a metal important to vehicle production, both internal combustion and electric. Throw in the Trump turmoil and a global shortage (due to a fall in the world’s largest producer nation, South Africa) and you set the stage for one of the most unexpected increases in value for a precious metal this year. But crypto became even more cryptic\n\nDonald Trump’s election was a very different story for another, much more volatile, investment class. Backers of cryptocurrencies believed the new president would drive prices up. There was speculation that Bitcoin – then trading at about $US100,000 – would move through the $US150,000 mark. But Bitcoin finishes the year around the $US87,000 mark, having tumbled from its October peak of $US124,700. It’s not just Bitcoin that has suffered as investors have shunned more colourful investment opportunities due to concerns over American inflation. By some estimates, more than $US1 trillion in value was wiped from cryptocurrencies through the final three months of 2025.\n\nThe inopportune trade surplus with the United States Australia produces very little platinum. But it is one of the world’s biggest gold producers. The big lift in gold prices did something that had not happened since Harry Truman was in the White House – deliver Australia a trade surplus with the United States. In January, February, March and then in July, gold was a key factor in Australia selling more goods and services to the US than buying them.\n\nWith Donald Trump attacking any nation that ran a trade surplus with the US (the penguins and seals of Heard and McDonald Islands at one point faced an American tariff hit), it could not have come at a worse time. It hasn’t been helped by the drop-off in American tourism to Australia. There were almost 100,000 fewer visitors from the US over the past 12 months compared with the same period ahead of COVID. American tourists aren’t getting as much value for their greenback, either. A big global story has been the drop in the value of the United States dollar. The Australian dollar appreciated by 8 per cent against its US counterpart.\n\nThat might make it more enticing for prospective Australian tourists to check out Trump’s America – as long as they’re ready to hand over all their social media history. The taxman cometh Even Jim Chalmers could not believe the position Peter Dutton took ahead of the 2025 election. The Coalition went to voters opposed to Labor’s modest personal income tax cuts that start flowing from July 1 this year. Loading The tax cuts, which will be delivered over two years, were the one big surprise out of Chalmers’ March budget. Even more surprising was the Coalition’s opposition.\n\nThe budget is increasingly reliant on personal income tax collections. A combination of bracket creep, a strong jobs market and a tax system that gives more concessions to wealth and assets (particularly those held by older Australians) means the tax burden on ordinary workers is growing. The mid-year budget update revealed that of all income taxes collected by the government – personal, company, superannuation, petroleum and fringe benefits – the share coming from workers is on track to hit 69 per cent by 2028-29. Cost-of-living crisis? Try 1692 per cent inflation The re-emergence of inflation pressures, both in Australia and around the world, caught pundits and central banks off guard.\n\nDomestically, trying to track accurately price pressures across the economy was made more difficult by government energy subsidies. Headline inflation, which had peaked at 7.8 per cent in late 2022, tumbled to 1.9 per cent by the middle of this year. But then came the end of various state and federal electricity subsidies. While the federal government’s $75-a-quarter subsidy finally ended with the calendar year, the biggest impact occurred in Brisbane where the former Miles government’s $1000 came to an end in June. That led to electricity inflation in Brisbane jumping by a mind-boggling 1692.5 per cent in July. A year earlier, it had been minus 93 per cent. By year’s end, Brisbane’s overall inflation rate was a nation-leading 5.2 per cent.\n\nWhile electricity prices have been upended by government action, coffee prices have soared due to international factors. A global supply shortage due to poor weather in key growing areas has meant that anyone with a coffee (or chocolate) addiction has had to pay through the nose for their daily caffeine hit. The single largest weekly purchase by Australian households is the fuel for their cars. During 2025, Peter Dutton spent much of the election campaign visiting service stations and promising that a Coalition government would halve the fuel excise for 12 months. But petrol prices were relatively stable. Even as Dutton was manhandling bowsers everywhere he went, petrol was actually cheaper than it had been a year earlier.\n\nThe Uncertainty Index If you were confused by the economic events of the year, spare a thought for the Reserve Bank. It started the year with its first interest rate cut since the start of the COVID pandemic amid signs that inflation was easing. Despite three rate cuts, the bank finished the year with financial markets tipping it would start lifting interest rates in February.\n\nLoading In a sign of the economic rollercoaster faced by the bank, following Trump’s “liberation day” tariffs, it actually discussed a half percentage point rate cut to offset a global downturn. Every three months, the bank issues its “statement on monetary policy”, which contains key forecasts as well as a general discussion of the economy’s outlook. It was in the May iteration of that statement that the bank’s confusion – shared by the rest of the world – became clear. That one statement used the term “uncertain” on 132 occasions.\n\nNever before had the bank been so unsure of the future. A growing population – but more slowly One of the most politically charged debates of the year has been population growth or, more specifically, net overseas migration. Australia has increasingly relied on migrants to grow the population, fill specialised and non-skilled jobs while international students had become the cash cows of the nation’s universities. But the post-COVID surge in migration, on top of a lift in house prices (which picked up as soon as the Reserve Bank started cutting interest rates), combined to give the debate over immigration a sharp political edge through 2025.\n\nSince the international border was reopened in early 2022, net overseas migration has added almost 1.5 million residents to the country. Some of the surge was due to the two-year closure of the international border. In particular, students who had not been able to get into the country flooded back (and provided much-needed staff to the nation’s cafes and restaurants). That pushed net overseas migration to a record 555,000 in late 2023. It has eased since then, so much so that the government’s own budget estimates for the 2024-25 overestimated net overseas migration by 30,000.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://au.news.yahoo.com/frustrated-mp-quits-greens-local-015652890.html",
    "title": "Frustrated MP quits Greens to 'have local voices heard'",
    "publish_date": "2026-01-02T01:56:52Z",
    "category": "finance",
    "authors": [],
    "text": "A Greens MP says she can no longer be effective within the party and will instead sit as an independent in a state parliament's lower house.\n\nHelen Burnet, who represents the electorate of Clark in Tasmanian parliament, told reporters on Friday she would move the cross bench as an independent.\n\n\"This is not a decision that has been made in haste,\" she said.\n\n\"I have represented the Greens in local government and in state parliament for more than 20 years.\"\n\nThe Greens are left with five MPs in Tasmanian parliament after Helen Burnet's departure. (Ethan James/AAP PHOTOS)\n\nMs Burnet hopes the move will allow her to amplify voices in her electorate on issues such as the divisive stadium build at Hobart's Macquarie Point, living costs, public transport and water quality.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"I've been frustrated about not being able to get my voice heard on those matters,\" she said.\n\nHer departure from the Greens leaves the party with five MPs in Tasmania's state parliament.\n\n\"I feel this is the right decision for this point in time, and I know we have a very strong cross bench, and my scrutiny, and my criticism of the government will not change,\" she said.\n\n\"It's been a very difficult decision, but I feel that I must do this in order to have the best voice of my constituents on those important issues raised in parliament.\"\n\nThe Macquarie Point stadium plan is one issue on which Helen Burnet hopes to amplify local voices. (HANDOUT/TASMANIAN GOVERNMENT)\n\nMs Burnet has been a member of parliament for less than two years, but has been part of the Greens for nearly 20 years.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nShe previously served as deputy lord mayor of Hobart City Council and is a registered podiatrist who spent most of her career in the public health system.\n\nPremier Jeremy Rockliff, Speaker Jacquie Petrusma and her parliamentary colleagues were told the news on Friday morning.\n\nThe Tasmanian Greens are yet to comment on Ms Burnet's resignation.",
    "source": "Yahoo",
    "cluster_id": 7
  },
  {
    "url": "https://au.news.yahoo.com/unviable-big-call-1bn-china-233607096.html",
    "title": "‘Unviable’: Big call on $1bn China trade threat",
    "publish_date": "2026-01-02T01:34:51Z",
    "category": "finance",
    "authors": [],
    "text": "Nationals leader David Littleproud has blasted China’s decision to slap huge tariffs on beef imports, branding the move a “kick in the guts” for Australian producers.\n\nFrom January 1, overseas importers will face a 55 per cent tariff for beef imports to China that exceed quota levels, the Chinese Ministry of Commerce announced on Thursday.\n\nIn 2026, this threshold will be 2.7 million metric tonnes, with the “safeguard measures” applying for at least three years and the quota levels increasing annually.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe changes are designed to address increasing import levels that have “seriously” damaged China’s domestic industry, according to the Chinese government.\n\nThe move is projected to cause more than $1bn in losses to Australian industry, AMIC said. Picture: NewsWire / Nikki Short\n\nAs of 2024, Australia accounted for about 8 per cent of China’s overall beef imports.\n\nAsked about the impact on Australian cattle farmers, Mr Littleproud was scathing of the decision.\n\n“You’re going to lose a billion dollars off your bottom line because of an arbitrary decision by China, because their economy’s tanking,” he told 2GB on Friday.\n\n“And the reality is, it’s not Australia that causing any grief to their local production.\n\n“It’s in fact the significant imports from South America, and this is where the Albanese government need to step up.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Industry has done a great job in articulating that to the Chinese authorities, that we’re not a threat. We’re less than 10 per cent of their total beef imports.”\n\nAnthony Albanese and Trade Minister Don Farrell “need to make sure that they’re in there and get a carve out” for Australia, Mr Littleproud said, because the current circumstances would make it “unviable”.\n\nNationals leader David Littleproud has urged the federal government to take swift action. Picture: NewsWire / Martin Ollman\n\nAgriculture Minister Julie Collins has revealed the Australian government has already made “made representations at the highest senior ministerial levels” to its Chinese counterparts over the tariffs.\n\nSpeaking to the ABC, Ms Collins reiterated Australia had not been singled out by China, but that the changes were to apply to all of China’s overseas imports.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“What they’ve done is for all of their importers, they’ve done an average,” she told the ABC.\n\n“What they’ve done is they’ve said, ‘This is your average of what you’re allowed to send into China and then, (anything) over that there will be a tariff applied’.”\n\nAgriculture Minister Julie Collins said Australia had lobbied the Chinese government over the tariffs. Picture: NewsWire / Martin Ollman\n\nMs Collins said the government did have “serious concerns about the way” the tariffs were being applied but added “we have not been singled out yet”.\n\nAustralia’s argument to China was that its exports were not a threat to China’s domestic industry, and Australian beef was a high-quality product desired by the Chinese market, she said.\n\n‘Severe impact’: AMIC to lobby government\n\nA peak body has claimed the move could affect more than $1bn in trade between the two countries.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOn Thursday, the Australian Meat Industry Council (AMIC) criticised the move, saying it was “extremely disappointed” with the announcement.\n\nThe changes would have the potential to reduce Australian beef exports to China by about one-third compared with the past year, which accounted for trade worth more than $A1bn, it said.\n\n“This decision appears to reward other countries who have surged the volume of beef exported to the Chinese market in recent years,” AMIC chief executive Tim Ryan said.\n\n“This decision will have a severe impact on trade flows to China over the duration of the measures’ enforcement, disrupt the longstanding relationships fostered under the China-Australia Free Trade Agreement, and restrict the ability for Chinese consumers to access safe and reliable Australian beef.”\n\nAustralian beef imports to China have been hit with a 55 per cent tariff. Picture: NewsWire / Nikki Sho\n\nAlong with Meat & Livestock Australia (MLA), AMIC complied with the Chinese government’s year-long investigation preceding the changes, the peak body said, including providing formal evidence at in-person hearings in China and hosting Chinese investigators in Australia.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nDuring this period, AMIC and MLA “repeatedly stressed” Australia’s position as a trusted and reliable source of beef for China and their role in meeting the country’s domestic consumer demand, Mr Ryan said.\n\n“Imports of Australian beef are not a cause of damage to the domestic beef industry in China,” he said.\n\nAMIC plans to lobby the Australian and Chinese government to consider the consequences of the measures.\n\n“We will make strong representations on our members’ behalf to the Australian and Chinese governments regarding the severe and unnecessary impact of these new measures,” Mr Ryan said.\n\n“Regardless of our disappointment with these safeguard measures, AMIC will continue to work constructively with our Chinese counterparts to mutually improve our respective industries for long-term prosperity.”\n\nAnthony Albanese has downplayed the impact of the Chinese tariffs. Picture: NewsWire / Martin Ollman\n\n‘Australia not singled out’: PM\n\nThe Prime Minister has confirmed Australian officials are communicating with their Chinese counterparts regarding the move.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Albanese emphasised Australia was not being targeted by China’s policy, and the move had been a broad one.\n\n“This is something that wasn’t Australia being singled out,” he told reporters on Thursday.\n\n“This is a general position that China has put.\n\n“We are advocating, as we always do, for Australian industry.”\n\nPressed on the potential impacts of the announcement, Mr Albanese declined to go into specifics, instead pointing to his belief that Australian beef was “the best in the world”.\n\n“We compete in the world very well, and our products are in great demand right around the world, we expect that will continue to be so,” he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“The Australian beef industry has never been stronger than it is today as we enter 2026.”\n\nSussan Ley was part of the cabinet that secured the China-Australia Free Trade agreement, she said. Picture: NewsWire / Martin Ollman\n\n‘Worrying’: Ley on trade threat\n\nSussan Ley has described the new tariffs as “worrying”, and urged Mr Albanese to take strong action to protect Australian producers.\n\n“Australian beef is the best beef in the world and our trade with China is important,” the Opposition Leader told reporters on Thursday.\n\n“Now to see that hesitation and threat that we have had reports of today is worrying.\n\n“So what the Prime Minister needs to do is leverage the very good relationship that he tells us he has with President Xi, and make sure he makes contact, and makes it very clear that Australia should not be included in any of these arrangements when it comes to restrictions on the trade of beef to China, or additional tariffs that may be placed on that trade.”\n\nIn terms of Mr Albanese advocating the interests of Australian beef producers, Ms Ley added local industry should “expect no less” of the prime minister.",
    "source": "Yahoo",
    "cluster_id": 0
  }
]