[
    {
        "url": "https://www.9news.com.au/national/sydney-airport-set-to-introduce-fixed-taxi-fare-rides-to-the-cbd/4e59835c-2bd4-41dc-9b11-d38a6bd760a2",
        "title": "Sydney Airport set to introduce fixed taxi fare rides to the CBD",
        "publish_date": "Fri, 12 Sep 2025 23:03:31 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Sydney will soon follow Paris and New York by introducing fixed-fare taxi trips from the airport to the CBD.\n\nLocals and visitors will pay a﻿ flat fee of $60 from Sydney Airport under a 12-month trial which will begin on November 3.\n\nTaxi ﻿drivers will not be allowed to pass on any additonal tolls or surcharges on top of that price.\n\nREAD MORE: Sydney airport avoids delays despite disruption\n\nSydney will soon follow Paris and New York by introducing fixed-fare taxi trips from the airport to the CBD. (9News)\n\nU﻿p to 5000 taxis queue up at the international and domestic terminals at Sydney Airport each day.\n\nThe trial was recommended by the NSW Point to Point Commission in response to frequent complaints taxi drivers are taking advantage of first-time arrivals to Sydney.\n\nAccording to the commission, hotel concierges have raised concerns their guests have paid fares of more than $150 for the ﻿13-kilometre trip to the CBD.\n\nREAD MORE: ﻿ Married at First Sight star Lachlan Rofe dies suddenly aged 47\n\nU﻿p to 5000 taxis queue up at the international and domestic terminals at Sydney Airport each day. (9News)\n\nThe Point to Point commissioner has issued more than 1100 fines to taxi drivers since the introduction of the Taxi Fare Hotline in November 2022.\n\nThe practice of overcharging and refusing to use meters has even led to drivers touting for business inside the arrivals hall at the airport.\n\nAccording to the commission, a Sydney taxi driver was fined $2000 for refusing to use the meter and charging an overseas family with a $188.76 fare from the international terminal to a hotel in the CBD.\n\nThe NSW taxi industry and the operators of Sydney Airport have supported calls for a flat fare structure.\n\nNSW Taxi Council CEO Nick Abraham said members of the association believed set fares would provide certainty and confidence for passengers.\n\n\"Pending the success of the trial, we would like to see the set fares extended to other locations across Sydney, as well as reciprocated for trips coming back to the airport,\" Abraham said.\n\nSydney Airport CEO Scott Charlton said the fixed fare trial puts Sydney on par with cities like New York and Paris.\n\n\"More than 40 million people pass through Sydney Airport every year,\" Charlton said.\n\n\"For many, their first experience of Australia is when they get into a taxi.\n\n\"Knowing how much they will pay to get to the city is a positive step.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/ebola-vaccine-reaches-the-epicenter-of-congos-outbreak-as-officials-race-to-contain-the-disease/1d971a19-3b9c-4d2e-a163-4d286f1ff754",
        "title": "Ebola vaccine reaches the epicentre of Congo's outbreak as officials race to contain the disease",
        "publish_date": "Fri, 12 Sep 2025 22:56:43 +0000",
        "category": "lifestyle",
        "authors": [
            "Sep"
        ],
        "text": "Limited access and scarce funds are the key challenges facing health officials trying to respond to the latest Ebola outbreak in southern Congo, the World Health Organisation said Friday.\n\nIt is the first Ebola outbreak in 18 years in Kasai province, a remote part of Congo with poor road networks, which is more than 1000 kilometres from the nation’s capital of Kinshasa.\n\nA United Nations peacekeeping helicopter was used to help deliver 400 vaccine doses on Friday to the outbreak's epicenter, in the locality of Bulape, Patrick Otim, WHO's program area manager, said at a briefing in Geneva.\n\nAn additional 1,500 doses will be sent from the capital of Kinshasa. (AP)\n\nAn additional 1500 doses will be sent from the capital of Kinshasa, he said.\n\n“We have struggled in the last seven days with access, but are collaborating with MONUSCO (U.N. peacekeeping mission in Congo) now,” Otim said.\n\nWhile the WHO and Congolese authorities have “ramped up efforts to have a full-scale response” on the ground, “we need to be able to pay for the operations,” he added.\n\nSince the outbreak was confirmed on September 4, the number of suspected cases has increased from 28 to 68, Africa’s top health agency said Thursday. The Africa Centers for Disease Control and Prevention has so far reported 16 deaths.\n\nOtim said the most recent confirmed case was located 70 kilomeres from the current epicenter, though it's still in the same province.\n\n“Our worry is if we get cases in the other health zone, we need to expand, and it will be resource-intensive,” he said.\n\nWHO’s projected cost for the current outbreak over the next three months is $US20 million ($30.1 million), while Congo’s national response plan is estimated at $US78 million ($117.4 million), said Otim.\n\nA major concern for health officials has been the impact of recent US funding cuts. The US had supported the response to Congo’s past Ebola outbreaks, including in 2021 when the US Agency for International Development provided up to $US11.5 million ($17.3 million) to support efforts across Africa.\n\nHealth workers to be prioritised in vaccination\n\nAt least four health workers are among the confirmed cases, according to Mathias Mossoko, Congo's Ebola response coordinator in Bulape.\n\n“For now, our priority is to vaccinate health care workers. Given the number of cases and deaths among health care providers, protecting these front-line workers is essential to ensure the population receives adequate care,” he said.\n\nAt least 94 per cent of the suspected cases’ contacts — more than 600 people — have been traced, with only one so far confirmed to be infected, Mossoko said, adding that there's minimal risk of the disease spreading to other provinces.\n\n“At this stage, it is not yet appropriate to declare a public health emergency,” he said.\n\nMedical charity Doctors Without Borders said its team is assisting in the response and worked with the WHO to establish an Ebola treatment center at the Bulape hospital.\n\n“We helped reinforce triage protocols, supplied essential medicines and personal protective equipment, and conducted training in infection prevention and control and symptomatic care,” said Brice de le Vingne, the group’s emergency coordinator.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/humpback-whale-rescued-from-entanglement-off-brunswick-heads-new-south-wales-news/fd13addd-48c2-4bf3-a2d2-73e65952db8e",
        "title": "Humpback whale rescued from fishing line off NSW coast",
        "publish_date": "Fri, 12 Sep 2025 10:25:52 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A humpback whale has been freed from fishing line and ropes off South Golden Beach, north of Brunswick Heads.\n\nThe rescue operation, conducted in high winds and rough seas, involved multiple organisations.\n\nThe whale's plight was initially reported by a member of the public to ORRCA, the NSW whale rescue organisation.\n\nThe whale was tangled in ropes and fishing line. (Nine)\n\nThe Sea World Foundation and Marine Rescue Brunswick Heads were called in to assist.\n\nInitial efforts to lasso the entangled rope proved unsuccessful, leading the team to deploy a large buoy to allow closer access for cutting the lines.\n\nThe whale appeared to cooperate during the rescue, remaining relatively still as the team worked.\n\nRescue organisations worked to free the whale in high winds and rough seas. (Nine)\n\nAfter several attempts, the fishing line and rope were completely removed, allowing the whale to swim freely.\n\n\"Yeah that final cut, all the gear comes off, it's always a great feeling, even more so today,\" Sea World Foundation skipper Andy Mulville said.\n\nHumpback migration season typically concludes by early November.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/kim-jong-un-daughter-north-korean-heir-kim-ju-ae/c996dfde-ade2-424f-8a95-6601ee9de5cc",
        "title": "We don't know her name or age. But she's about to become a major dictator",
        "publish_date": "Fri, 12 Sep 2025 04:04:28 +0000",
        "category": "sports",
        "authors": [
            "Sep"
        ],
        "text": "Likely in her early teens and bearing a close resemblance to her mother, the daughter of North Korean leader Kim Jong Un is increasingly viewed as his likely heir.\n\nThe girl, believed to be named Kim Ju Ae , was in the spotlight again as she accompanied her father on his high-profile China trip, his own first visit to a major gathering of world leaders and her first known trip abroad.\n\nVideo and images carried by North Korean state media showed her right behind her father and ahead of Foreign Minister Choe Son Hui as they got off a train in Beijing, clapping as officials at the North Korean Embassy in Beijing bowed to her father, and standing near him as he was seated with senior officials in a meeting room inside his train.\n\nLikely in her early teens and bearing a close resemblance to her mother, the daughter of North Korea leader Kim Jong Un is increasingly viewed as his likely heir. (AP)\n\nSouth Korea’s spy agency said on September 11 that it assesses that the trip solidified her status as her father’s likely heir.\n\nShe is believed to be 12 or 13 years old. Not much else is known about her, but her repeated appearances at high-profile events with her father have prompted speculation that she’s being groomed as North Korea’s next leader.\n\nChina trip analysed intensively\n\nIn a closed-door briefing for politicians, the South Korean National Intelligence Service said Kim Jong Un was believed to have brought his daughter to China to help her acquire overseas experience and cement her status as his likely heir, according to Park Sunwon, who attended the meeting.\n\nThe spy agency cited coverage of her appearances in China in the country's main state TV station and newspaper, which target the ordinary citizens, according to lawmaker Lee Seong Kweun, who was also present at the meeting.\n\nREAD MORE: Former Virgin boss gets astonishing golden handshake ﻿\n\nNorth Korean state media outlets have never published her name, referring to her as Kim Jong Un's “respected” or “most beloved” child. (AP)\n\nHer name and age are unconfirmed\n\nNorth Korean state media outlets have never published her name, referring to her as Kim Jong Un's “respected” or “most beloved” child.\n\nThe belief that she is named Ju Ae is based on an account by former NBA champion Dennis Rodman, in which he recalled holding Kim Jong Un’s baby daughter during a trip to Pyongyang in 2013.\n\nHer exact age is unconfirmed but South Korean intelligence officials believe she was born in 2013.\n\nIn 2023, South Korea's spy agency told politicians it assessed Kim Jong Un and his wife Ri Sol Ju also have an older son and a younger third child whose gender is unknown.\n\nREAD MORE: Australia heading for another La Nina spell ﻿\n\nHer exact age is unconfirmed but South Korean intelligence officials believe she was born in 2013. (AP)\n\nShe’s being increasingly showcased in her father’s events\n\nKim Jong Un allowed his daughter to be seen in public for the first time during a test launch of an intercontinental ballistic missile in November 2022.\n\nPhotos in state media showed Kim Ju Ae wearing a white coat and red shoes as she watched a soaring missile from a distance and walked hand-in-hand with her father.\n\nHer carefully crafted appearances have included missile tests, military parades, and the launch of a naval destroyer in April.\n\nKim Jong Un has recently expanded his daughter’s public appearances beyond military events to include some of his most ambitious economic projects and cultural events, including the opening of a beach resort in June.\n\nHer carefully crafted appearances have included missile tests, military parades, and the launch of a naval destroyer in April. (AP)\n\nSome question her chances to take over a male-dominated system\n\nSouth Korea’s National Intelligence Service issued a careful assessment last year that it views Kim Ju Ae as her father’s likely successor, citing a comprehensive analysis of her public activities and the state protocols provided to her.\n\nHowever, some outside experts disagree with that assessment, citing Kim Jong Un’s relatively young age and the extremely male-dominated nature of North Korea’s power hierarchy.\n\nIn its recent briefing at parliament, the National Intelligence Service assessed that Kim has no major health issues and that he conducted official schedules in China smoothly.\n\nSince its foundation in 1948, North Korea has been successively ruled by male members of the Kim family — Kim's father, Kim Jong Il, and grandfather, Kim Il Sung.\n\nKim Jong Un inherited power in late 2011 upon his father's death.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australian-weather-update-la-nina-more-likely-as-forecasters-switch-to-new-calculations/d4775612-9f48-465e-90eb-6f2e5dbdf96f",
        "title": "Australia heading for another La Nina spell",
        "publish_date": "Fri, 12 Sep 2025 02:04:00 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Large parts of Australia are now more likely to end the year with ﻿a moisture-laden La Nina weather pattern after forecasters changed their modelling.\n\nClimate change and the rapid warming of oceans has forced the Bureau of Meteorology to revise its analysis for the two major weather patterns: El Nino and La Nina.\n\nThe former brings warmer conditions while La Nina leads to increased cloud and rain.\n\nThe rainfall outlook for October to December 2025. (Bureau of Meteorology)\n\n﻿Both weather patterns are influenced by sea temperatures in the tropical Pacific Ocean.\n\n﻿But the bureau has now overhauled the way it calculates how unusually warm or cool the ocean is, reports Weatherzone .\n\nThe bureau's forecasters now use a new method, called the relative Niño index, for their analysis, to take into account the rapidly rising sea temperatures.\n\nIt says without the shake-up, El Nino may seem more frequent and La Nina may appear less common.\n\nAside from weather forecasting afficionados, most Australians will be more interested in what it means for our approaching summer weather.\n\n﻿The answer is La Nina is more likely based on the relative index, which is in line with current seasonal outlooks.\n\nThey forecast above average over large areas of Australia's north and east during the last three months of this year.﻿\n\nDaytime temperatures may also dip across these regions during late spring into early summe﻿r because of the increased cloud cover.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/bank-layoffs-anz-westpac-cba-nab-job-cuts-affect-australian-customers/ebea9a2d-05fe-4ec9-81d9-6b84ff5a430c",
        "title": "Banks keep cutting jobs - and everyday Aussies are going to pay",
        "publish_date": "Thu, 11 Sep 2025 19:35:01 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Thousands of jobs across two of Australia's big four banks have been slashed this week, following a concerning trend of redundancies across the sector.﻿\n\nNow, experts are warning that everyday Australian customers will pay the price.\n\nSeveral banks have announced mass job cuts over the last 12 months ﻿in a bid to boost earnings, combat operating costs, manage workforce changes and embrace digitisation.\n\nREAD MORE: ﻿ FBI releases photos of person of interest in Kirk assassination\n\nAll of the big four banks have announced job cuts in the last 12 months. (AAP Image/Joel Carrett)\n\nBank of Queensland (BOQ) axed 400 roles late last year, then announced plans to shut ﻿14 branches across Australia less than six months later.\n\nWestpac has reportedly cut around 1000 jobs already and is considering axing more than 1500 more positions.\n\nJuly saw Bendigo Bank announce 10 branch closures across three states and Commonwealth Bank (CBA) ﻿cut 45 call centre jobs after rolling out an AI chatbot to deal with customer inquiries.﻿\n\nNow ANZ has announced it's cutting 3500 full-time roles and 1000 contractor jobs, while NAB shed 410 jobs and moved 127 more overseas.\n\nREAD MORE: ﻿ Married at First Sight star Lachlan Rofe dies suddenly aged 47\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\n\"I think we should be concerned,\" Today money expert Joel Gibson told 9news.com.au.\n\n\"If you've found it difficult already to get good customer service from your bank, imagine what it will be like without hundreds or thousands of the humans who currently work at the bank.\"\n\nCBA's AI chatbot rollout sparked concern among customers, who worry it won't be as effective as speaking to a real person.\n\nBut ﻿Gibson predicted that Aussies will have to increasingly rely on chatbots, AI agents and digital banking tools if banks keep culling human workers.\n\n\"And yet I don't expect we'll see the lower cost base passed onto us in the form of lower fees,\" he said.\n\nToday money expert Joel Gibson said everyday Aussies should be 'concerned' by the cuts. (Today Extra)\n\nFinance Sector Union (FSU) national president Wendy Streets said AI is changing the banking industry landscape in some \"concerning\" ways.\n\nBut she and innovation and technology expert from The University of Queensland Dr Evan Shellshear agreed that AI alone isn't to blame for mass layoffs.\n\n\"Out of all the banks, only CBA has explicitly stated that AI was used as a justification and it's not clear whether AI was a scapegoat here or not,\" Shellshear said.\n\n\"So I don't think AI is the major driving factor.﻿\"\n\n﻿While some tasks within the banking sector could be automated using AI tools, other skills – like communication, collaboration, creativity and management – can't be.\n\nThat's why some banks have chosen to send jobs offshore, but ﻿Streets warned it could raise data privacy concerns.\n\nREAD MORE: ﻿ South Australian premier discusses key issues with King Charles in London\n\n\"Customers need to be asking their bank where their data actually sits,\" she said.\n\n\"Where does it go, if it's going offshore?\n\n\"We believe customers should be made aware of that, and should have a choice about whether their data actually goes offshore.\n\n\"We have privacy legislation in Australia, but lots of the countries where our banks set up other centres, they don't have the same level of privacy legislation.\"\n\n﻿Thought must also be given to the thousands of Australians who have been put out of jobs by some of the most profitable businesses in the country.\n\nBanking was already a competitive industry and layoffs across multiple banks will only make it harder for recently unemployed staff to find new roles in the cost-of-living crisis.\n\nNAB shed 410 jobs and moved 127 more overseas this week. (Reuters)\n\nInstead of cutting jobs to cut costs, Streets wants to see Australian banks invest in their employees.\n\nThat means ﻿upskilling existing staff to work alongside AI tools and helping them adapt to industry changes rather than sending their roles offshore.\n\n\"Our big four banks are in the top 10 of the ASX, they are globally successful companies that make in excess of $30 billion in profit year in and year out,\" Streets said.\n\n\"There is no excuse for them to put good, experienced workers on the unemployment line. It's just not good enough.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-13/nsw-sydney-airport-to-cap-taxi-fees-in-fare-crackdown/105769768",
        "title": "Sydney Airport to cap taxi fares in crackdown on overcharging",
        "publish_date": "Sat, 13 Sep 2025 01:13:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "A $60 flat rate will now apply to any taxi trip from Sydney Airport to the CBD in a bid to crack down on fare price gouging.\n\nFrom November 3, Sydney will join the likes of major cities including Paris and New York as it begins a 12-month trial of a flat fare structure.\n\nMinister for Transport John Graham said there was an influx of complaints that travellers arriving in Sydney were being \"ripped off\" for a fare to the city.\n\n\"This measure will crack down on that, it will mean that people travelling from the airport and into the CBD will have certainty,\" he said.\n\n\"They'll know they're going to be charged $60 for that fare, there won't be unwelcome additions.\n\nTravellers outside of Sydney Airport's domestic terminal. (Barrie Cassidy: Twitter)\n\n\"That's a really welcome step, we know it will mean people will have a smoother, better experience as they arrive in Sydney for the first time or as they come back home having been away.\"\n\nPoint to Point Transport Commissioner Anthony Wing said the move was about instilling trust and confidence in the state's taxi system.\n\n\"We know that the vast majority of the state's 15,000 taxi drivers do a great job,\" he said.\n\n\"But unfortunately, we also know there are some who are out there ripping people off.\n\n\"Particularly, they tend to target the airport because they know there are people coming here that don't know how much they should be paying or how the system works.\"\n\n\"This trial will help us stop overcharging before it happens, and will complement the work of my on-street inspectors in helping make sure every ride is a safe ride in NSW.\"\n\nTaxis charging over $150 for fares\n\nAccording to the commissioner, hotel concierges had reported guests were being charged more than $150 for the 13-kilometre trip.\n\nEarlier in the year, a cab driver was fined $2,000 for charging an overseas family $188.76 for a trip from the international terminal to the CBD.\n\nNSW Taxi Council chief executive Nick Abrahim welcomed the trial and said he hoped it would be embraced by the broader transport industry.\n\n\"This is such an important measure, particularly giving passengers certainty and confidence when using taxis,\" he said.\n\n\"Pending the outcomes of this trial, we would love to see the set fares measure extended to other parts of Sydney, but also reciprocated to those trips coming back to the airport.\"\n\nIn the lead-up to the trial, signage will be installed around the airport and inside cabs to inform passengers about pricing fees and meter refusal.\n\nRoad tolls and Sydney Airport access fees will not be added to the set fare or passed on to the customer.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-13/afl-suns-lions-damien-hardwick-alastair-lynch/105769862",
        "title": "Lions legend praises Suns coach Hardwick ahead of historic finals clash",
        "publish_date": "Sat, 13 Sep 2025 00:17:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "Brisbane Lions great Alastair Lynch has hailed the impact of Damien Hardwick at the Gold Coast Suns as they look to continue their run in the finals.\n\nThe Suns will face the Lions at a sold-out Gabba in a sudden-death semifinal on Saturday night.\n\nIt will be the first Q-clash contested in a finals series.\n\nAfter reaching the finals for the first time this season, the Suns showed they were not overawed by the bigger stage when they defeated Fremantle by a point in Perth last weekend.\n\nLynch said Hardwick deserved praise for instilling self-belief in the Suns, who entered the AFL in 2011.\n\nPatient Gold Coast Suns fans rewarded Photo shows David Swallow shouts to celebrate a goal in an AFL elimination final. Elated Gold Coast fans say \"15 years of struggle\" are finally paying for the club, as the Suns look towards a QClash match against Brisbane this weekend.\n\nHe likened Hardwick's presence to Leigh Matthews's role as Lions coach when the club reached the finals in his first season in charge.\n\nThe Lions made the preliminary finals in 1999, two years before winning the first of three consecutive premierships.\n\n\"Damien Hardwick would make them (Suns players) believe,\" Lynch said.\n\n\"It was exactly the same when we had Leigh Matthews in our first finals.\n\n\"He says something and you're convinced, so they'd have enormous belief, the Suns.\"\n\nThe Suns beat the Lions in the most recent Q-clash.\n\nPlaying on the Gold Coast, the Suns thrashed the defending premiers by 66 points in round 20.\n\n\"They'll (Suns) come up the road thinking they've had their first final, first win, and now they face their biggest rivals,\" Lynch said.\n\n\"They should come up confident, especially because six weeks ago they rolled them.\"\n\nThe Lions fell to Geelong in a 38-point defeat in their qualifying final at the MCG.\n\nThe winner of Saturday night's encounter will play Collingwood in a preliminary final at the MCG next weekend.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-13/tyre-recycling-facility-hopes-process-more-mining-waste/105642522",
        "title": "Recyclers say mining tyre disposal regulations 'not good enough'",
        "publish_date": "Fri, 12 Sep 2025 23:58:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "A new facility in the heart of Western Australia's iron ore mining industry has come up with a simple solution to the environmental disaster of oversized tyre waste.\n\nTyres are critical assets on mine sites.\n\nSome of them are so huge they weigh more than an entire 4WD vehicle and cost up to $60,000 each.\n\nTyres are a critical, expensive asset on mine sites. (ABC News: Michelle Stanley)\n\nTheir scale makes recycling difficult and costly, with almost 95 per cent of mining tyres eventually buried in the ground.\n\nThe practice of burying old mining tyres is not against national environmental regulation.\n\nThere are hopes that changes to environmental regulations across the country will pressure miners to recycle more.\n\nA simple solution\n\nAlmost half, 49 per cent, of all mining tyres in Australia are in Western Australia's Pilbara, according to a report by Tyre Stewardship Australia.\n\nPilbara is ranked as the largest mining precinct in the country in terms of earth displacement, meaning companies rely on open-cut mining vehicles.\n\nThe Port Hedland recycling facility is the first of its kind. (ABC Pilbara: Kimberley Putland)\n\nThat was why Tyrecycle opened the first dedicated off-road mining tyre recycling facility in Port Hedland, 1,630 kilometres north of Perth, at the heart of the region.\n\nOld, worn-out mining tyres are sent to the facility where they are processed using a specialist \"T-rex\" machine imported from Italy.\n\nThe tyres are broken down into smaller chunks of rubber. (ABC Pilbara: Georgia Hargreaves)\n\nThe smaller chunks of rubber are sent to Perth for further processing, eventually given a second life as things like road base, playgrounds or surfaces of athletics tracks.\n\nTyrecycle's head of mining, trading and strategic development, Ashley Battilana, said it was challenging to dispose of mining tyres because of their weight and size.\n\nAshley Battilana hopes mining companies will recycle more tyres. (ABC Pilbara: Kimberley Putland)\n\n\"Up until now most mining tyres are being buried on site in pit burial methods, which is completely legal,\" she said.\n\n\"They're completely licensed to do it.\n\n\"But now with this new facility, the option is there and we're here to support the mining companies on this journey.\"\n\nWorn conveyer belts made from rubber are difficult to recycle because they are long and heavy. (ABC Pilbara: Kimberley Putland)\n\nThe facility, which has been open since the end of 2024, has prevented 1,500 tonnes from being buried.\n\nMr Battilana said with a growing interest from miners in the region, there was plenty of room for expansion.\n\n\"What we would like to have over the next three years is putting in another plant here so we can double our capacity,\" he said.\n\nBurying tyres 'no longer good enough'\n\nThere have been limited alternatives for tyre disposal which made economic sense for businesses.\n\nTyre Stewardship Australia, a group that promotes the development of markets for used tyres, released a report that found less than 5 per cent of old mining tyres in Australia were recycled.\n\nIt said more than 100,000 tonnes of mining tyre waste was buried in the ground each year.\n\nLina Goodman says there should be fewer tyres buried in Australia. (Supplied)\n\nCEO Lina Goodman said burying mining tyres was \"no longer good enough\".\n\n\"The frustrating part around mining tyres being buried in a pit — it's out of sight, out of mind,\" she said.\n\n\"We've got infrastructure and recyclers who have invested to meet the needs to create products and it's just not being met by the other parties.\"\n\nMs Goodman said federal government intervention was needed to encourage the industry to adopt alternatives.\n\n\"Governments need to change their permissions for mining companies and remove it so that [tyres] are no longer allowed to be buried,\" she said.\n\nThe oversized tyres (in tonnes) generated in each region annually by mining and agriculture. (Supplied: Tyre Stewardship Australia)\n\nA Department of Climate Change, Energy, the Environment and Water spokesperson said it supported the Port Hedland facility through its Recycling Modernisation Fund.\n\nThe spokesperson said the government would continue to work with states and territories on effective options to improve tyre recycling rates.\n\nEnvironment Minister Murray Watt's office said the government was committed to doubling its circularity for end-of-life tyres by 2035.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-13/abc-quote-quiz-sept-13/105765946",
        "title": "Can you match what they said to the news? Time to tackle the ABC's Quote Quiz",
        "publish_date": "Fri, 12 Sep 2025 23:00:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "They said it, we published it. Can you decipher it?\n\nLoading\n\nWhere to find all the ABC's quizzes\n\nWant to test yourself even further?\n\nTake a squiz at the ABC's New Quiz topic page and see if you're a whiz at our previous quizzes.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-13/rugby-world-cup-australia-wallaroos-canada/105769754",
        "title": "Wallaroos primed for 'do-or-die' World Cup clash with Canada",
        "publish_date": "Fri, 12 Sep 2025 22:45:07 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Wallaroos have been urged to be bold in their sudden-death Rugby World Cup quarterfinal with Canada.\n\nAustralia is the underdog in the last-eight clash against world number two Canada in Bristol on Sunday morning AEST.\n\nBut coach Jo Yapp, who could be overseeing her final match in charge of the Wallaroos, is determined her squad makes the most of their opportunity at causing a tournament upset.\n\n\"From our perspective, the message is, 'Don't come off the field thinking about ifs, buts and maybes,'\" said Yapp, who will step down from her role at the conclusion of the Wallaroos's campaign.\n\n\"We get one shot at this, so we've got to be brave, and we've got to go at them both in attack and defence.\"\n\nDefeated Wallaroos still battle into World Cup quarters Photo shows A group of Australian women's rugby union players embrace on the pitch after a match. The Wallaroos end the group stage of the Women's Rugby World Cup with a loss to England, but the Australians are through to the quarterfinals ahead of the United States.\n\nIn their final group match, the Wallaroos threw everything at tournament favourites England in Brighton.\n\nThey even led the hosts for more than 30 minutes until they were ground down ruthlessly in the second half and ended up losing 47-7.\n\nBut the performance gave the Wallaroos reason to believe they can defeat Canada.\n\n\"There's been a huge confidence boost amongst the group,\" said captain Siokapesi Palu, who described the quarterfinal as a \"do-or-die game\".\n\n\"You can see week in, week out that we continue to get better, but just being able to produce a performance like that against England in that first 30 minutes probably surprised most of us, and probably was good for us.\n\n\"Because now we've instilled a bit of belief within ourselves that we can do things right as long as we execute it the best we can.\"\n\nPalu said the pressure might have switched to the Canadians, who were pushed hard in their last group match by Scotland, before prevailing 40-19.\n\n\"The odds are against us this game, and the pressure then gets bounced back on Canada,\" she said.\n\n\"It's up to them (Canada) to perform to what people are expecting of them.\n\n\"But if that allows us to take that pressure off ourselves and play a little bit more freestyle rugby, which we're really good at, hopefully that puts belief in us that we can execute what we need.\"\n\nThe winner of the quarterfinal will face either defending champions New Zealand or South Africa in the semis.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-13/tasmanian-artist-work-acquired-by-victoria-and-albert-museum/105644792",
        "title": "Fire, paint and 'slight anarchy': Artist blown on to the world stage with international acquisition",
        "publish_date": "Fri, 12 Sep 2025 22:32:53 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "It's a humble setting — a shed at the fringes of an industrial Tasmanian suburb — but inside those concrete walls, spinning in thousand-degree heat, history is in motion.\n\nIn this Launceston studio, Anne Clifton is creating glass art of international calibre.\n\nIn June, her piece Vetrograph Rubinda was acquired by London's Victoria and Albert Museum — the world's biggest decorative arts and design collection.\n\nIt is possibly the first Tasmanian craft item collected by Victoria and Albert Museum in about 100 years. (Supplied: Peter Bowles)\n\nPossibly the first Tasmanian craft item collected by the institution in about 100 years, the feat had Clifton \"leaping out\" of her skin.\n\n\"I'm like, 'no, I'm not good enough, it's not good enough', but that's the imposter syndrome sinking in,\" she says.\n\n\" After about 10 minutes I got over myself and I remembered that it's the work, it's not me. \"\n\nClifton's journey in glass began nearly three decades ago. (Supplied: Glass Manifesto)\n\nThe vase-like piece draws on Clifton's roots in ceramics, \"subverting\" the structured nature of glassmaking.\n\nWorking inside out and upside down, she layers interior colours with multiple panes of clear glass, using chips and powders to give it a ceramic-like veneer, then draws on the surface.\n\n\"Vetri is Latin for glass, and graph is Greek for drawing with, or drawing on … and I've mashed them together, in a very rude fashion,\" she says.\n\nClifton layers interior colours with multiple panes of clear glass. (Supplied: Glass Manifesto)\n\n\"I'm drawing with fire … I'm splashing paint around with these big shards of glass.\n\n\"I'm getting everything I want and it's giving me everything I want — it's kind of magic.\n\n\" [It's] slight anarchy in a very controlled environment. \"\n\nThe colours are inspired by myrtle trees Clifton passes on her walk to the studio — which from a distance appear brown, but up-close reveal the pink of new buds.\n\nThe blue is akin \"to the sky coming through the branches\".\n\nDifferent, unusual\n\nThe V&A has one of the world's most comprehensive glass collections, hosting works from the Italian renaissance, the Middle-East, 17th to 20th century Europe, and contemporary art glass.\n\nClifton's artistic aesthetic, deeply rooted in ceramics, merges with her unconventional approach to glassmaking. (ABC News)\n\nSenior curator of ceramics and glass Reino Liefkes was struck by Clifton's \"incredible technical mastery\", her \"intense\" colours, and the beauty.\n\n\"The aesthetics are different really from any glass that we do have,\" he says.\n\n\"We're not after just something beautiful … it has to be something that has not been done really before.\n\n\"What we try to do is really to show how the art and the practice sort of evolves … so we're looking out for things that are new and make significant changes to the [existing] body.\"\n\nPartners in creativity\n\nIt's also somewhat of a love story.\n\nClifton's journey in glass began nearly three decades ago, when \"an attractive young English glassblower\" named Peter Bowles entered her orbit.\n\n\"And I really got interested in glass blowing,\" she says.\n\nClifton's journey in glass began nearly three decades ago, when Peter Bowles entered her orbit. (Facebook: Glass Manifesto)\n\nThe couple has worked together ever since, pushing one another to stretch their artistic boundaries.\n\nIn fact, stuck in a creative rut and going through great change, Bowles encouraged Clifton to bring in her \"first love\" — ceramics.\n\n\"He's still a source of fascination,\" Clifton says.\n\nBowles encouraged Clifton to bring in her \"first love\" — ceramics. (ABC News)\n\n\"We've got this fantastic knowledge about what needs to happen, so it's like choreography, it's like dancing, there's a beauty in movement.\n\n\" You can't blow glass by yourself, it's very humbling. \"\n\nReminding the world what Tassie can do\n\nUniversity of Tasmania (UTAS) art lecturer Karen Hall says the acquisition is monumental, especially given the medium's historical baggage.\n\nLoading...\n\n\"If we think about the labels, art and craft, they have very different histories and they have different weight and significance,\" she says.\n\n\"You're kind of working against a history in which glass art may not be taken as seriously as other mediums, or it's siloed into specific collections that don't have the kind of reach that the V&A does.\"\n\nKaren Hall says it could be some time before the significance of the museum acquiring the piece is fully realised. (ABC News: Jonny McNee)\n\nBut she says it could be some time before the significance is fully realised.\n\n\"When museums acquire objects for their collections, they aren't just doing it for the present moment, they're doing it to write the future history of a discipline, of how creativity evolves,\" she says.\n\n\" And so I think the full significance of this will be understood in another 10 or 20 or 50 or 100 years' time. \"\n\nHall says the acquisition is monumental. (ABC News)\n\nMere blocks away, in a studio tucked at the back of a university building, a local legacy is already beginning to take form.\n\nAmy Collins, a UTAS honours student who works in sculpture, glass and ceramics, says it makes her feel like international success is achievable.\n\nHall says when museums acquire objects, they're doing it to write the future history of a discipline. (ABC News: Jonny McNee)\n\n\"Being somewhere regional, or in the small state that Tasmania is, it can feel like it is out of reach to get access to the art world which is primarily recognised as being in New York, London, Berlin,\" Collins says.\n\n\" So, seeing someone from really just up the road from where I'm studying be recognised on the world stage is just really great. \"\n\nLaunceston-based ceramics and textiles artist Sharon O'Donnell has taken classes with Clifton, and is inspired by the way her former teacher has diversified and flourished.\n\nSharon O'Donnell has taken classes with Clifton (ABC News: Jonny McNee)\n\n\"I think that this acquisition is a step in the right direction for celebrating women artists and especially in the glass world,\" O'Donnell says.\n\n\"Any acquisition is amazing and any sort of recognition celebrating what we do is enough of a legacy to just keep us going.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-13/black-diamond-cup-oldest-trophy-still-in-use/105757792",
        "title": "Two teams to battle it out for the oldest trophy in Australian sport",
        "publish_date": "Fri, 12 Sep 2025 22:05:08 +0000",
        "category": "sports",
        "authors": [],
        "text": "In the middle of rugby league heartland, a trophy for a rival football code has survived to become the oldest piece of sporting silverware still contested annually in Australia.\n\nA local tobacco company donated the Black Diamond Cup to the Newcastle Australian Rules Football competition in 1887.\n\nNewcastle City and Terrigal-Avoca will battle this weekend to hold it aloft.\n\nNewcastle Museum head of exhibitions and cultural collections David Hampton said a lot of other sporting trophies were replicas or had been retired and replaced.\n\n\"This is the only one that we are aware of that has this sort of continuous history,\" he said.\n\nThe Black Diamond Cup is carefully prepared for the winning team each year. (Supplied)\n\nNSW Australian Football Heritage Association president Ian Granland said the code was brought to the Hunter by Victorian miners looking for work.\n\n\"When the gold kind of fell over in Bendigo and Ballarat, there were miners there who wanted to continue in that type of work and they moved to areas like the Hunter region,\" he said.\n\n\"A lot of these blokes played Aussie rules and they continued on and the standard was quite high at the time.\"\n\nThe trophy was first won by Wallsend in 1888-89, but the competition soon fell over.\n\nThe Black Diamond was not seen again for decades.\n\nWhen the Newcastle Football League was resurrected in 1948, the Rushton family from Wallsend dusted off the cup that had been gathering dust in their garage.\n\nMuseum piece up for grabs\n\nThe trophy bounced around between teams across the Hunter until 1998, when it became an exhibit at the Newcastle Museum.\n\n\"As part of that relationship and the fact that it is Australia's oldest sporting trophy contested for today, we let it go out … every year for the grand final,\" Mr Hampton said.\n\nTerrigal Avoca Panthers will take on the Newcastle City Blues for the Black Diamond Cup. (Supplied: Terrigal Avoca Panthers)\n\n\"This is kind of above and beyond what museums would normally do with their collections,\" he said.\n\n\"We [usually] like to keep our collection objects as stable as possible; we like to keep them in the one place.\"\n\nThe winner of the grand final has the honour of celebrating with the cup before it is returned to the museum.\n\n\"They hold it up in the air, there's a couple of photos taken, it's put down [and] the person with the white gloves grabs it,\" Mr Granland said.\n\n\"It doesn't stay in their possession for too long.\"\n\nThe Newcastle City Blues have won the Black Diamond Cup 10 times since 2000. (Supplied)\n\nLuke Rankin won five Black Diamonds with Warners Bay before the trophy was put under lock and key.\n\n\"We certainly had a lot of drinks out of it over that period and then it would probably stay at someone's house for a month or two and they might even drink their coffee out of it,\" he said.\n\n\"We used it quite a bit at impromptu celebrations over the course of the year and had plenty of beer out of it.\n\n\"There's certainly a few dents in it, I'm sure Warners Bay contributed to those and it did get dropped a few times.\"\n\nLuke Rankin captained Warners Bay to victory in 1993. (Supplied: Luke Rankin)\n\nThe competition's two biggest rivals, Newcastle City and the Terrigal Avoca Panthers will be vying for the Black Diamond Cup for the ninth time in this year's grand final.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-13/big-thief-double-infinity-adrianne-lenker-new-album-interview/105754728",
        "title": "How Big Thief turned loss into laughter on their new album",
        "publish_date": "Fri, 12 Sep 2025 22:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Greek philosopher Heraclitus told us 2,500 years ago that change was a constant. Yet humans still tend to find flux deeply uncomfortable.\n\nRevered Brooklyn indie rock band Big Thief understand change — its challenges and its benefits — intimately.\n\nTheir ever-evolving take on folk-inflected indie rock demands comfort with shifting sounds and moods. Each member's restless creative nature means they are always eager to make art beyond the band they share.\n\nBig Thief wanted an \"ecstatic feeling\" to run through their sixth album, Double Infinity. (Supplied: 4AD/Remote Control)\n\nWhile change is constant in their lives and their creative work, Big Thief remains a kind of grounding force that drives everything they do.\n\n\"Every time we go off and do our own solo things and do other projects, it feeds back into our band,\" frontwoman Adrianne Lenker tells Double J's Karen Leng.\n\n\"We take all the things that we learn, and we inevitably just grow and get better as musicians from each project. I think that always ends up coming back and filling up the Big Thief cup.\"\n\nEven by their standards, the past couple of years have been especially disruptive. Founding bassist Max Oleartchik left the band last year for interpersonal reasons.\n\nLoading Instagram content\n\n\"Our love for each other is infinite, and we are so grateful for all we have shared these many years together since the beginning of our journey as a band,\" the group wrote on social media.\n\n\"We wouldn't be who we are without Max. This separation marks the end of an era, and the beginning of a new one for Big Thief.\"\n\nThat new era meant the core trio — Lenker, drummer James Krivchenia, guitarist Buck Meek — had to reimagine what their next statement would sound like without Oleartchik's significant musical contributions.\n\n\"It was a big emotional split for the band, and we needed a lot of time to regroup as the three of us and sort of ground down,\" Krivchenia tells Double J.\n\n\"We did a lot of writing and a lot of talking, and just kept growing this pile [of songs], trying to find what the centre of gravity for the next record was going to be.\n\n\"Slowly there started to be this conglomeration of songs, where it's like, 'This feels kind of like the core.'\"\n\nKey elements: collaboration, drones, laughter\n\nThat core became Double Infinity, a lean collection of nine songs that contrasts the sprawling ambition of 2022's Dragon New Warm Mountain I Believe In You.\n\nThough the band has formally shrunk to three members, the album thrives on collaboration.\n\nDouble Infinity is Big Thief's first album as a trio. (Supplied: Genesis Baez)\n\nA large cast of musicians joined the trio at New York's legendary Power Station studios, working over three weeks to bring their songs to life.\n\nThe ensemble gathered each afternoon and played late into the night, chasing a kind of transcendent jubilance they felt was embedded in the material.\n\n\"I feel like all these songs really lend themselves to the arrangements that we were envisioning, in terms of having this bigger band,\" Lenker says.\n\n\"We wanted this ecstatic feeling and this high frequency, like some momentum on the album.\"\n\nLoading Instagram content\n\nThey also wanted a drone element to subtly thread through the record — a sonic undercurrent that supported the arrangements without drawing attention.\n\n\"I think the through line and what connects a lot of these songs is either an element of trance or drone,\" Lenker says.\n\n\"Maybe it's happening underneath it all, and you don't even notice it, but that is happening on the whole album. If a song didn't lend itself to that, it didn't make the cut.\n\n\" So many of the songs that we had to cut, we loved just as much, but they just didn't fit this vibe, with all these musicians and what we were going for. \"\n\nSome of that drone comes courtesy of ambient and new age pioneer Laraaji, who entered the band's orbit in a fittingly mystical way.\n\n\"Adrianne got his business card when they were jamming together during a lunar eclipse on a mountain at a music festival,\" Krivchenia says.\n\n\"We had all been fans of his work for a while. We've been to some of his laughter workshops at festivals and been fans of his records and seen him play a lot.\"\n\nBig Thief invited a lot of friends to play with them on Double Infinity. (Supplied: Genesis Báez)\n\nWhen the idea of building a larger band emerged, Laraaji's name came up — and it made sense.\n\n\"When we were thinking about it, building this big band, we were like, 'We need a droner.' Once Laraaji's name got thrown into this circle, we're just like, 'Of course.'\"\n\nHis musicality matched the band's vision, and his presence brought something deeper.\n\n\"I've only really heard him play alone, so I was curious what he would be like with other people,\" Krivchenia says.\n\n\"But also, knowing him a little bit through being in his laughter workshops and seeing him play live, he seems like a really interesting presence that we could probably learn a lot from in the studio for three weeks. Sign me up for that.\"\n\nLoading Instagram content\n\nLaughter meditation is one of Laraaji's trademarks. While he did not lead any sessions during recording, Big Thief had already felt their power.\n\n\"I did take one of his laughter workshops in Kerrville, at the Kerrville Folk Festival, and it was awesome,\" Lenker says.\n\n\"He teaches you to laugh from all the different parts of your body,\" Krivchenia says. \"You're learning these techniques, sort of a schematic experience of laughter. Also, people are just bursting out into real laughter because it's also contagious. It's a very beautiful thing, you're learning about your body, but you're also just cracking up.\"\n\nLoading...\n\nBig Thief's music runs the emotional gamut — any fan who has not shed a tear or stifled a chuckle is probably not paying attention. That \"ecstatic feeling\" they were chasing notably found its way into the third single, Los Angeles, which opens with a patchwork of laughter, preserving the joy of the session.\n\n\"That was a real moment of us bursting out laughing,\" Lenker recalls.\n\n\"It was kind of like a domino effect where everyone just started laughing and then we were like kicking into the song. We all lost our headphones during that take, and it didn't even matter.\"\n\nHow Big Thief help us remember that life is full of both pain and beauty Photo shows Four members of Big Thief stand close together. One member has his arm around Adrianne Lenker's sternum. \"I always feel like I write about the simplest yet most perplexing things.\"\n\nIt was emblematic of the spirit that ran through the Double Infinity sessions: fun, open-hearted and deeply present.\n\n\"There was just this spirit,\" Lenker says. \"I feel like everyone left their stuff at the door and everyone just was there to be very present and put their best foot forward. To open their hearts to the music.\n\n\"It made for quite a joyous experience. I just felt like everyone was right there, like we were having a musical conversation, and no one was really analysing it.\"\n\nChange — like the sky, like the leaves, like a butterfly\n\nBig Thief made some big changes on the road to Double Infinity, but change has always been part of their story.\n\n\"It's kind of hard to have any perspective,\" Krivchenia says. \"It all feels like this churning, changing thing.\n\n\"I feel like everything we've ever done, every tour, every year that goes by, you're always like, 'Whoa, we're different', or, 'We're levelling up', or there's some emotional breakthrough in a talk we had.\n\n\"There's all these little points along the way where, like, 'that was actually really big', but was kind of hard to feel in the moment.\n\n\"I hope every record sort of feels like a new chapter in some way. I don't want to be retreading unless that's the goal.\"\n\nDouble Infinity is out now.\n\nHear Karen Leng on Double J lunch, weekdays from midday or any time on the ABC listen app.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-13/50-years-tourism-promotion-tropical-north-queensland-cairns/105728438",
        "title": "Crocs, planes and a Hollywood hit (well, almost) put Cairns on the map",
        "publish_date": "Fri, 12 Sep 2025 21:55:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Bill Cummings was a budding bean counter working to turn Cairns from a tropical backwater into the nation's favourite holiday destination when a big-shot Hollywood director jetted into town.\n\nFor a few days in 1975, he thought he'd struck gold.\n\nHe drove around with Francis Ford Coppola, art director Angelo P Graham and an entourage who were scouting Far North Queensland's rivers and forests as potential locations to film Apocalypse Now.\n\nCoppola, fresh from The Godfather and its sequel, had already taken a reconnaissance mission to the Philippines, where a stomach bug struck the Hollywood contingent.\n\nMr Cummings recalls the crew imagining a Vietnamese village set at Russell Heads and boats plying the North Johnstone River near Innisfail.\n\nFrancis Ford Coppola (right) and actor Martin Sheen on the set of Apocalypse Now. (Supplied)\n\nApocalypse Now and its big budget appeared set to turbocharge the Cairns economy.\n\nBut Coppola needed lots of helicopters to bring his vision to life — something the regime of Philippine dictator Ferdinand Marcos and his wife Imelda were willing to make happen.\n\nThe Australian government was not.\n\n\"I did get on the telephone to try to find out if there were any helicopters in Australia that we could rustle up but there weren't,\" Mr Cummings said.\n\nSo it was back to the Philippines for the Hollywood contingent, and back to the drawing board for Mr Cummings.\n\nGlass-bottom boats take tourists to the Great Barrier Reef near Green Island in 1965. (Supplied: Bill Cummings/Tourism Tropical North Queensland)\n\nCroc takes centre stage\n\nIn the mid-70s, Cairns was a difficult place to reach, even for domestic travellers, so Mr Cummings and co knew they had to think outside the square if they were to attract tourism dollars.\n\nTravel to Cairns typically meant a days-long drive up the coast on the Bruce Highway, which wasn't fully sealed until 1973.\n\n\"Before that, it was called the crystal highway because of all the broken windscreens along the side of the road,\" Mr Cummings said.\n\nThey'd been touring shopping centres to convince Melburnians and Sydneysiders to take holidays in Cairns, thinking pictures of rainforests and palm-fringed beaches would do the trick.\n\nThe late Gary Zillfleisch dazzled crowds with saltwater crocodile displays in the 1970s. (Supplied: Facebook/Hartley's Crocodile Adventures)\n\nTheir sophisticated carousel projector was \"almost like a movie\" but it was upstaged every time by the live 1.5-metre saltwater croc they took along for the ride.\n\n\"We were cheeky enough to take the croc into one of the major newspapers in Melbourne, and one of the staff there decided the best thing to do was take it into the editor's office,\" Mr Cummings said.\n\n\" They plonked it just inside the door to watch the expression on the young journos coming in as they were confronted by a crocodile. \"\n\nAirport rivalry in the north\n\nSugarcane was the lifeblood of Far North Queensland, and businessman George Chapman was \"more or less obsessed with getting Cairns into a bigger place\".\n\nThe ambitious upstarts worked to pitch the deep north to holiday-makers as an idyllic destination, but they also had to convince politicians that Cairns's future lay in tourism.\n\nReef boat staff model their uniforms in 1979. (Supplied: Quicksilver Cruises)\n\nThe city's domestic air passenger numbers grew fourfold in the decade to 1979, overtaking Townsville, which had tens of thousands more residents.\n\nBut a parliamentary committee report at the end of that year made a shock recommendation that Townsville's airport should be upgraded to become the main international gateway to North Queensland.\n\nFor the denizens of Cairns, that went down like a bad mango.\n\n\"We knew [tourists] wanted to come here,\" Mr Chapman said.\n\n\"Things like hospitals, everything, went to Townsville — we felt anyway — so we had to really get organised.\n\n\" But the one thing they couldn't duplicate was tourism. \"\n\nAn invasion … of tourists\n\nEven when Cairns began \"rocketing ahead\" with its promotion, Mr Chapman was always thinking bigger.\n\nForeigners wanting to visit the Great Barrier Reef or Daintree Rainforest had to first fly to Sydney or Melbourne and then travel north.\n\n\"It became clear to me that we really needed direct flights from overseas, and that was a big debate,\" the inaugural chairman of what is now Tourism Tropical North Queensland said.\n\nA postcard from the 1960s used to promote Green Island, off the coast of Cairns. (Supplied: Quicksilver Group)\n\nIn 1979, the first groups of Japanese tourists flew directly to Far North Queensland via Port Moresby on an Air Niugini flight.\n\nJapan was by then Australia's largest trading partner, but memories of World War II and fears of a Japanese invasion lingered.\n\nMr Cummings, the tourism board's first CEO, feared there would be a public backlash as former wartime enemies began arriving in the north for holidays.\n\n\"But there wasn't,\" he said.\n\n\" We got to know the Japanese people as very polite and very good tourists. \"\n\nThe mostly older clientele spoke little English, so \"people would sit down, gesturing and writing on paper and that sort of thing\", Mr Cummings said.\n\nBill Cummings (right) with a visiting Japanese reporter from Kyushu Television in 1980. (Supplied: Tourism Tropical North Queensland)\n\n\"My only problem was, at one stage, I was negotiating with Air Niugini in Japan [with] a fellow [about] the same age as me.\n\n\"His father had been killed in New Guinea and my father had been fairly involved in the fighting up there.\n\n\"I was relieved to find out he'd been killed by an American bomber, rather than by Australian infantry.\"\n\nBig in Japan\n\nThe Far North became so in vogue with the Japanese travelling class, it would never be the same again.\n\n\"It amazed everyone what happened after the airport got upgraded and the Japanese started investing, building hotels, in the '80s,\" Mr Chapman said.\n\nThe Cairns marina pictured in 1987. (Supplied: Quicksilver Group)\n\nIn the early days, most investment in tourism came from locals, including sugarcane growers, who saw the potential and built hotels.\n\nThen, money started coming in from overseas.\n\nOne of the biggest players was the Daikyo Corporation, a Japanese property juggernaut whose holdings included resorts on Green and Fitzroy islands.\n\nThe first Great Barrier Reef branded booking office in China opened in Guangzhou in 2007. (Supplied: Quicksilver Group)\n\nBy 1998, a research paper described Far North Queensland as having one of the most international economies in Australia, with more than a quarter of its trade coming from overseas.\n\nWhile the number of Japanese visitors to Cairns has never returned to the peak levels of the mid-1990s and early 2000s, it dropped off just as travel from China began to boom.\n\nHowever, the Chinese market has been crunched by the COVID-19 pandemic and loss of direct flights.\n\n\"It's coming back a bit, but some of the reef operators are getting about 20 per cent of the Chinese [visitors] they were,\" Mr Chapman said.\n\n\"Skyrail is probably getting 60 per cent.\"\n\nDifferent markets, same pitch\n\nThe international tourism sector in Cairns is facing more competition from Southeast Asia and its tropical resorts.\n\nQueen Elizabeth II (left) visited Green Island with Prince Phillip (centre) in 1970. (Supplied: Tourism Tropical North Queensland.)\n\nTourism Tropical North Queensland turns 50 this week, laying claim to being the oldest surviving regional tourism board in the nation.\n\nCurrent CEO Mark Olsen is optimistic about attracting more visitors from Japan, and says there is also emerging interest in Cairns from farther afield.\n\n\"There are about as many Indian travellers as Chinese travellers [coming to Cairns] off what was a very small base just two years ago,\" he said.\n\nAnd while promotions have come a long way in half a century from crocodiles in shopping centres, Cairns's pitch to the world is much the same.\n\n\"What we're selling is the natural environment, the Barrier Reef and the rainforest, and that hasn't changed,\" Mr Chapman said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-13/communities-worry-tourists-wont-return-if-algal-bloom-continues/105754016",
        "title": "SA coastal businesses concerned about algal bloom impact on summer tourism",
        "publish_date": "Fri, 12 Sep 2025 21:54:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "In a coastal tourism town, it is not unusual for the cooler months to be a quiet time of year.\n\nBut as spring starts to warm up South Australia's Yorke Peninsula, there is deep concern in the community about what will happen if a dip in visitors continues into summer.\n\nCome the warmer months, Ardrossan should be stacked with keen recreational fishers casting a line, and beach houses full of families and friends ready to enjoy the popular Yorke Peninsula.\n\nLocal business owners are worried about the impact on the town if that does not happen this summer, with the beachside community one of many impacted by the ongoing toxic algal bloom.\n\nColleen Kluske says there has been about a 20 per cent drop in foot traffic over winter. (ABC News: Stephen Opie)\n\nAt the town's newsagency, owner Colleen Kluske said foot traffic was down by about 20 per cent during the winter months.\n\n\"We can handle that,\" she said.\n\n\"If that continues through spring and through summer, and onto next year, 20 per cent down over our peak season is a lot to be down.\n\n\"It may be 50 per cent down if the caravan parks and holiday houses aren't being used, it's going to be more than 20 per cent down.\"\n\n'Are they going to come back?'\n\nThe Yorke Peninsula is a holiday destination that some South Australian families have been visiting for generations.\n\nSome in Ardrossan are worried that the impact of the algal bloom could continue to be felt even once it dissipates.\n\n\"If people start going elsewhere, are they going to come back when the crabs and the fish do come back?\" Ms Kluske said.\n\nIt is a concern echoed by Helly Easther-Smith, who is the owner of Country Getaways Holiday Rental.\n\nHelly Easther-Smith worries that if visitors don't travel to the Yorke Peninsula this year, they may not return. (ABC News: Stephen Opie)\n\nMany of the holiday homes she manages sit along coastlines of the Yorke Peninsula ravaged by the ongoing bloom.\n\nShe is especially worried when it comes to those generational holiday-makers.\n\n\"You know, mum and dad brought their kids here as young children, now those young children are bringing their kids here,\" she said.\n\n\"If they cancel, they might find another destination and continue in that new destination.\n\n\"That does concern me, that we potentially lose those visitors that have been coming here for years and years and years.\"\n\nMs Easther-Smith said that would have a devastating effect on the tourism towns.\n\n\"There's a lot of businesses out there that are pretty reliant on tourism, and if those tourists are not coming, they will close,\" she said.\n\nThe toxic algal bloom has impacted several communities along the Yorke Peninsula. (ABC News: Stephen Opie)\n\n'The view is always beautiful'\n\nIn addition to grants for eligible businesses affected by the bloom, the South Australian government has recently introduced travel vouchers, in a bid to encourage people to visit impacted communities.\n\nMs Easther-Smith said it was crucial people continued to support the region.\n\n\"If we don't support our local businesses, they'll have no option but to shut up shop,\" she said.\n\n\" When things do come good, there'll be nothing here, because everybody has moved on. \"\n\nMs Kluske has installed a simple sign to remind people to do just that.\n\nColleen Kluske has put up a sign encouraging people to keep supporting impacted communities. (ABC News: Stephen Opie)\n\n\"We're hoping that it will jog people's memories, just to continue to support the Yorke's,\" she said.\n\n\"Because we do need it.\"\n\nShe wants people to know there is more to the region than a dip in the ocean or casting a line.\n\n\"Hopefully [the travel vouchers] will bring people back here, just to come read books, just sit on the beach and enjoy a glass of wine watching the sunset,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-13/keio-yoshida-pride-and-prejudices-queer-lives-and-the-law/105658412",
        "title": "Keio Yoshida's new book fights for more considered recognition of queer lives",
        "publish_date": "Fri, 12 Sep 2025 21:51:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "The voice in Keio Yoshida's books comes to life when I chat with them, long-distance from their home in Madrid.\n\nArticulate, passionate and considered, Yoshida — an author and international human rights lawyer — is known particularly for their role in the historic Rosanna Flamer-Caldera v Sri Lanka case, the first to call for the decriminalisation in that country of same-sex intimacy between women.\n\nOn the phone, we commiserate about the heatwave sweeping Europe and Asia. I sense acutely how their practice as both a lawyer and a writer is reflected in the act of communing across (and bringing together) disparate times and places.\n\nPride and Prejudices, their new and first individually authored book, depicts different struggles for queer rights with a scope that is at once panoramic and intensely personal.\n\nIn a style typical of creative non-fiction, in which an author is present in the story they're telling, Yoshida intersperses references to case law with their personal experience.\n\nMichael Kirby has described Yoshida's book as one that will \"galvanise\" readers. (Supplied)\n\nThe evolving narrative stretches from Oscar Wilde's persecution to contemporary battles for child care, reproductive rights and trans existence. It includes the author's memories of coming \"fully out of the closet\" at 23 to starting a family and becoming pregnant just before the pandemic, in the midst of adopting a masc/genderqueer identity that left them wondering: \"Could I manage nine months in drag?\"\n\nYoshida is impelled to fight for a more considered recognition of queer lives, and Pride and Prejudices imagines how the law can tell queer stories differently.\n\nIt critiques states, families and communities that disseminate damaging narratives about queer lives as wrong, invalid or dangerous.\n\nA person's identity, Yoshida argues, is never just a question of individual personhood. It includes a person's community, children, battles for housing, bodily autonomy, freedom of movement and health care.\n\nFor Yoshida, describing and making sense of queer experience is a matter not only of safety and survival, but of flourishing, too.\n\nFor many, sharing queer stories is an act \"of joy\", they say.\n\nKate Rowe's powerful queer memoir Photo shows Person with flowing fair hair and wide smile stands at beach with arm leaning against brightly coloured block sculpture. From pain to pride, queer trailblazer Kate Rowe shares her survival tips.\n\nYoshida's latest book emerged after a conversation with Jennifer Robinson, the Australian lawyer with whom they wrote How Many More Women?\n\nThat book investigated how laws around issues like defamation and sexual violence can silence women.\n\nRobinson asked what Yoshida was going to do next.\n\n\"Top surgery,\" they recall answering.\n\n\"It felt like the tide seemed to be turning and trans rights were starting to be curtailed, so I was worried. [Robinson] was saying, you know, you should write about this, you should talk about your journey.\"\n\nThe idea appealed to Yoshida, who thought sharing their story might help other trans folk.\n\n\"I felt, in so many points of my life, I've had to research the law and find things where, if I were straight, everything would have been obvious,\" they say.\n\nPower in stories\n\nGrowing up in Northern Ireland, Yoshida struggled with coming out, a process that began in their mid-teens.\n\n\"Ireland's story is a very hopeful one of change, of the criminalisation of homosexuality until the 90s — then suddenly, in 2015, you've got self-identification for trans people and gay marriage coming in with a referendum.\n\n\" The message really is that we need to continue to fight for our legal rights. Because if we don't, they're for somebody else to take away. \"\n\n\"I still read judgements and I can't perceive the human in what they're talking about,\" Yoshida says.\n\nAs an example, they mention the US Supreme Court's upholding of a Tennessee judgement banning gender-affirming care. Wading through pages of legal minutiae and technical argument, they recall reading only one of the justices \"asking questions about the plaintiffs, about the individuals involved\".\n\nQueer family Photo shows A line-drawing cartoon of two smiling adults with two young kids, all have brightly coloured hair and clothes. Our journey to becoming a family was anything but ordinary.\n\nYoshida recounts their attempt to raise a child with their partner in Spain and learning that queer couples have to be married for both to be on the birth certificate and to be recognised as parents — a rule that does not apply to heterosexual couples.\n\nThey recall suggesting to their partner they marry, before following that thought up with the question: \"Should we challenge this in court?\"\n\nYoshida believes the biggest challenge currently facing the law in many jurisdictions surrounds questions of family, queer parenting and trans rights. They cite discrepancies in how parenthood is recognised in different countries' jurisdictions, and who the law is willing to recognise as a \"mum\", \"dad\" or \"parent\" when one or more parents are genderqueer or intersex.\n\nThey argue queer parents carry the burden of potentially losing custody of a child on the basis of their sexual or gender identity.\n\n\"I think the concept of family is being or has been co-opted by a conservative right-wing narrative, which continues to insist that the idea of family is a heterosexual couple with children, and that's the only safe, normative form of family,\" they say.\n\n\"We know that's not reality.\"\n\nABC Radio National's Top 100 Books of the 21st Century Top 100 Books is Radio National's new annual countdown where we hand over the reins to you to vote for your favourite books, and then we celebrate the Top 100 in a big weekend broadcast!\n\nAlongside all of the history the book takes in, Pride and Prejudices paints a picture of Yoshida's long personal history: the power and struggle of coming out, fearing for their future life, wondering what joy might be possible — or even thinkable — while asserting their trans identity and continuing to push back against laws that personally affect them.\n\nThroughout the book, Yoshida cites songs and films, including those by directors Pedro Almodovar and Gregg Araki; they are references to \"a part of our growing up, a part of our coming out, a part of being queer\".\n\nFor all the legal victories throughout the book, the battles are long and, in the case of international human rights law, the judgements are not binding upon the country concerned.\n\nSo how does Yoshida maintain hope? By coming back to thinking across time and space.\n\n\"Legal change is not the end of the road,\" they say.\n\n\" We have to continue to tell stories. \"\n\nPride and Prejudices is out now, published by Scribe.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-13/hunters-hill-council-battle-sydney-marina-expansion-kellys-bush/105752296",
        "title": "Sydney locals say harbour marina plans 'a disaster waiting to happen'",
        "publish_date": "Fri, 12 Sep 2025 21:24:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "A battle against a multi-million-dollar marina expansion in an affluent Sydney suburb is playing out in court, as locals push back against what they claim is a move to privatise the city's waterways.\n\nHunter's Hill Council has moved to crowd fund legal costs over a rejected development proposal to increase Woolwich Marina from 45 to 79 berths.\n\nThe proceedings were launched by Michael Fountain Architects in the Land and Environment Court after an amended proposal was knocked back by council and the Sydney North Planning Panel.\n\nSave Our Shores spokesperson Beverley Bennett (right) fears the development could lead to the privatisation of her community's waterways. (ABC News: Marcus Stimson)\n\nCouncil said its legal fees had reached $378,000 as of July 11, prompting it to ask the community for donations to help cover costs.\n\nThe heritage-listed site at the centre of the stoush is Kelly's Bush Park, close to where the boats are berthed and nearby Cockatoo Island and ferry corridor.\n\nWhile opponents argue the development will impact their harbour views, they say there's more to the story than \"NIMBYism\" — otherwise known as Not In My Back Yard.\n\nResidents believe the extension will detract from the historical significance of the world's first Green Bans movement, where 13 women fought to protect the last parcel of natural bushland on the lower Parramatta River, known as Kelly's Bush.\n\nA combination of trade unionism and environmentalism, the movement sought to defend public open spaces and guard against socially undesirable development.\n\nThe 1971 campaign not only successfully lobbied to preserve the parklands from development, but sparked further bans that would come into effect at heritage sites in The Rocks, Darlinghurst and Glebe, as well as Aboriginal community housing in Redfern.\n\nThe second battle for Kelly's Bush\n\nBeverley Bennett is the spokesperson for the Save Our Shores group of locals from Woolwich and Hunter's Hill, which she says is dedicated to protecting the precinct's waterways and ensuring green public spaces are accessible to all.\n\nShe said the development sought to build a parking section of \"very large boats\" in front of Kelly's Bush and Cockatoo Island, a move that would \"fly in the face\" of the Green Bans legacy.\n\nRallying behind the residents are groups Friends of Kelly's Bush and The Hunters Hill Trust, both parties in the Land and Environmental Court challenge, along with Hunters Hill Sailing Club.\n\nABC News coverage of the original 1971 battle to save Kelly's Bush. (ABC Education)\n\nFriends of Kelly's Bush secretary Maureen Flowers said locals were led to believe a state heritage listing would save the parklands for future generations.\n\n\"We feel the irony of this development seeks to exploit a public amenity for private gain,\" she said.\n\n\"So it's completely at odds with the social significance of the original fight and potentially undermines that historical campaign.\n\n\"[It] begs the question, if we can't permanently protect this incredible historic site for public use, what other natural parkland or foreshore access could be also be under threat?\"\n\nMicheal Fountain Architects declined to comment due to legal proceedings.\n\nWoolwich Marina was also unable to comment.\n\nThe parklands at Kelly's Bush are heritage listed. (ABC News: Fletcher Yeung)\n\n'A disaster waiting to happen'\n\nAn amended proposal by Michael Fountain Architects revised a ban on large party boats and reduced the size of boats allowed to moor in the space from 35 metres to 25 metres.\n\nThe overall area of waterway occupied by the marina berths was also slashed by 20 per cent, from 23,560 square metres to 18,560 square metres.\n\nFormer president and life member of Hunters Hill Sailing Club, Chris Stannage said from a safety perspective, the expansion \"would be like putting a bus station in the middle of a children's playground\".\n\nA push against the Woolwich Marina expansion has landed in the Land and Environmental Court. (ABC News: Fletcher Yeung)\n\nMr Stannage, who has been sailing for over 40 years, is concerned about the safety implications for sailors and other waterway users, particularly students who attend sailing programs.\n\n\"It's the wrong facility in the wrong spot, the Cockatoo Island channel is already one of the narrowest parts of the Greater Sydney Basin waterways,\" he said.\n\nMr Stannage said unlike Sydney Harbour and Gladesville Bridge, there would be no speed limit in place.\n\nHe said reducing the boundary to 20,000 square metres mixed with an increase in traffic was also \"a disaster waiting to happen\".\n\nHe said the club's volunteers worked hard to ensure safety on the waterway and resources would be stretched thin.\n\n\" There comes a tipping point where the community's responsibility [becomes] too great to operate. \"\n\nA 'small but mighty' council\n\nIn a statement, Hunter's Hill Council said all funds raised for legal fees would go directly into its current defence and any potential appeal.\n\n\"As this is a current legal matter before the Land and Environment Court, we are unable to comment any further at this time,\" a council spokesperson said.\n\nSpeaking independently, former mayor and councillor Ross Williams said he had worked closely with the community during litigation.\n\nAdd to your watchlist Photo shows Mystery Road Origin ABC iview with young detective Jay Swan in the bush. The critically acclaimed Mystery Road: Origin returns as Detective Jay Swan (Mark Coles Smith) and Mary (Tuuli Narkle) uncover dark secrets in a haunted timber town, where the past threatens to tear them apart.\n\nCr Williams, who moved the original motion against the proposal, said Hunter's Hill Council was a \"small but mighty council\".\n\n\"Three quarters of Hunters Hill is a conservation area and that precinct is a very important part of the Woolwich and Hunters Hill municipality,\" he said.\n\nHe argued letting the development go ahead would be akin to \"changing the politics of the world\" because the site was the start of a first-of-its-kind movement.\n\n\"I just can't accept that being a reasonable outcome for modern society, that a few people can dominate what is basically a very important public asset — public should take priority over private interests.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/drunk-raccoon-saved-with-cpr-20250913-p5muq6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Drunk raccoon saved with CPR",
        "publish_date": "Sat, 13 Sep 2025 10:00:59 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Drunk raccoon saved with CPR\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-afl-is-its-own-beast-that-ll-make-finding-goyder-s-replacement-fascinating-20250911-p5mub4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The AFL is its own beast. That’ll make finding Goyder’s replacement fascinating",
        "publish_date": "Sat, 13 Sep 2025 09:33:00 +1000",
        "category": "finance",
        "authors": [
            "Darren Kane"
        ],
        "text": "Which is at the same time a blessing and a problem, rendering things all rather interesting. And proceedings could get vituperative before too long. Goyder has this past week foreshadowed that he won’t seek re-election to the AFL’s board of directors at its next annual general meeting. His impending exit can be attributed to a chairman finally deciphering the tea leaves conveying the message that his number might be up. His tenure has been anything but a straight path. Also, Goyder commenced as AFL Commission chair in 2017; these roles don’t materialise regularly. AFL Commission chairman Richard Goyder at this year’s hall of fame function. Credit: Getty It’s plain that the process of choosing Goyder’s replacement is as Byzantine as the plot of the 2025 Oscar-nominated movie, Conclave. It’s a process that is also not entirely codified. Nature abhors a vacuum, and the pole that one must shimmy up to claim power is lathered in grease. How Goyder is succeeded, well, that’s a murky process. Say what you want, but it’s kind of mind-blowing that a billion-dollar company of such social standing in Australia as the AFL is, has no orderly succession plan in place.\n\nIt’s reported that the candidates vying to fill the void do, or might include former AFL lawyer and Collingwood president, Jeff Browne; plaintiff-centric compo lawyer and former Western Bulldogs president Peter Gordon, and another certain former Collingwood chieftain and early dinnertime game show host Edward Joseph McGuire, AM. Assuming the accuracy of the registers maintained by the Australian Securities and Investments Commission, neither Browne nor McGuire has served as a director of the AFL; Gordon, however, did, between 1990 and 1993. Bringing any person in from outside the current cohort of AFL directors is a task mightily more difficult than it sounds. We’re talking about a very particular type of billion-dollar business here. The sheer magnification of omnipresent public scrutiny, applied to decision-making, is manifest. Most corporate executives and professional directors would be chewed up and spat out sideways. Each potential candidate I’ve named has done astonishing things professionally, and in some cases, other eyebrow-raising things that astonish. Browne has probably forgotten more about the intersection of sport, law, and business just in the last week than I’ll ever know. If he’s lost to the process through wicked political jiggery-pokery, the process is poorer and weaker for it.\n\nOn paper, any sport’s governing body would be fortunate to have him as a director. But these things aren’t ever a contest of achievements and excellence. It was Mario Puzo’s Don Lucchese who put it best: “money is a gun; politics is knowing when to pull the trigger”. For a company of its standing in Australian society, the process of the AFL selecting a chairperson is remarkably unsophisticated. The AFL’s constitution isn’t a complex document. Essentially, it works this way: clause 60 of the AFL’s constitution mandates the company must have between six and nine directors, although clause 75 then says the company in general meeting may increase (or reduce) that number. Presently, and by my count, the AFL has 10 directors. Former Collingwood president Eddie McGuire after the Magpies’ finals win over Adelaide. Credit: AFL Photos At each AGM, two longest-serving directors – together with anyone else who hasn’t faced the voters in three years – are compelled to retire from office. But there’s no constitutional limit on the number of times a person can be re-elected. Clause 64 mandates that new, non-executive commissioners are elected by the “Appointees”, themselves being the voting representatives of each of the AFL’s 18 clubs. If the total number of retiring directors offering themselves for re-election, and any new nominees not already directors, exceeds the number of vacant positions (being two), an election takes place. In secret.\n\nWhich conjures the adage that the only voters who’ll tell you the truth about who they voted for are the ones who’ll admit they voted for the other bloke. Sections 67(h) and (i) provide that the highest-polling candidates, in a first-past-the-post election, are declared elected, provided they also receive a majority of votes from the voting representatives of the 18 voting club representatives in attendance. Loading For all the talk about subcommittees vetting candidates and making recommendations to the AFL Commission, that’s all convenient wallpapering in reality because pursuant to clause 70, any three clubs could band together and nominate anyone they wish to be elected. The AFL doesn’t have an independence-rooted governing system or anything approaching it. Given that the clubs’ Appointees also control the voting on candidates to elect as directors, the clubs wield enormous power. If it’s true, the next AFL chair must come from the new directors to be elected – whether because none of the current directors want the job, or because the current cohort each know none of their own are up to it – the clubs hold four clean aces.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/i-d-feel-like-i-couldn-t-survive-for-these-sydneysiders-having-a-garden-is-a-primal-need-20250827-p5mq6k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I’d feel like I couldn’t survive’: For these Sydneysiders, having a garden is a primal need",
        "publish_date": "Sat, 13 Sep 2025 09:30:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Julie Power"
        ],
        "text": "Asked what she would do without the community garden at Poet’s Corner near her home in Sydney’s Redfern, Paula Le said she’d spend more time alone, stuck in a small unit without enough light to support a pot plant.\n\nFor Jan Chamberlain of Strathfield, who volunteers at community gardens across Sydney, not being able to garden would be an emotional loss, considering the memories she has of her Aunty Rose floating frangipanis in water and her mother planting trees.\n\nPaula Le (left) and Phil Pettitt from the community greening program with volunteer Jan Chamberlain. Paula and Jan both use the community garden within their complexes. Credit: Janie Barrett\n\nPhil Pettitt manages the Royal Botanic Garden of Sydney’s community greening project, which includes those at 600 Homes NSW properties, and calls it a primal need. “If I couldn’t garden, I’d feel like I couldn’t survive,” Pettitt said. “I feel like if the world ended tomorrow, I can grow some food and support my family.”\n\nA new study by the RBGS’s Pettitt, with housing and health experts from Swinburne University of Technology, found 94 per cent of Australians older than 50 say that having somewhere to garden is “extremely important”, and good for their mental and physical health.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/this-sydney-institution-is-riding-the-wave-of-a-gen-z-fuelled-revival-20250827-p5mqd8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This Sydney institution is riding the wave of a Gen Z-fuelled revival",
        "publish_date": "Sat, 13 Sep 2025 09:00:00 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Orrell shoots on film for fun and because it looks “cute”. She brings her film camera on nights out, to take photos of her friends and on holidays, like on her recent trip to Europe. “It captures the moment, you can’t be like ‘I look ugly’ and re-take it… The photo is what it is,” says Orrell, who has been on a break from Instagram because of the pressure to capture and share a ‘perfect’ moment. “I look back through my parents’ pictures, and it’s all about the memory and not about performing. When I get to 60, I can look back at my film photos and reminisce,” says Orrell. In August, photography company Eastman Kodak reported its quarterly filings, including significant debt, which led to news headlines that the company might be facing closure. Kodak called these media reports misleading and released a statement to clarify that “Kodak has no plans to cease operations” and is “confident it will repay, extend, or refinance its debt.”\n\nIn November 2024, the iconic 133-year-old camera company had to temporarily pause its film production to make upgrades to its New York factory to keep up with the motion picture and still image film demands. “It’s funny talking about what’s going to happen in the future. We don’t know. Pentax is the only manufacturer who have produced a film camera in 20 years,” says Vlahadamis. Japanese camera manufacturer Pentax launched the Pentax 17 last year, the first new film camera from a major brand since the 2000s. “It’s a camera that shouldn’t exist today. They have almost sold out globally. But as a major manufacturer, Pentax has gone out on a limb,” says Vlahadamis. The stores street view; The well-stocked film fridge. Credit: Abby Seaman\n\nChristopher Tiffany getting a single-use camera ready for processing. Credit: Abby Seaman In August, FujiFilm Australia took a similar risk and re-launched QuickSnap, a 35mm single-use camera targeted at Gen-Z customers. FujiFilm Australia’s general manager Mary Georgievski says the product relaunch comes at a time of culture shift and taps into the younger generations’ craving for nostalgia. “Gen Z are a lot about mental health, slowing things down, realising what we had in the past was great. While they’re highly connected digitally, Gen Z is driving a renewed appreciation for analog, choosing film not in place of digital, but alongside it,” says Georgievski. Film photography is experiencing a wave of revival at the same time as compact digital cameras. Both trends are trying to tell the same story – perhaps the instant gratification of a smartphone camera is no longer satisfying for young people.\n\nDenis Hasagic was originally saving up to buy a digital camera when he was actively searching for a hobby. Denis Hasagic, 25, was originally saving up for a digital camera when he found his love of film photography. Credit: Abby Seaman Instead, the 25-year-old Sydney Super8 regular picked up his dad’s old Pentax MZ-50 and started shooting film. Only four out of 37 photos turned out, but Hasagic was already hooked. “I saved up all this money for a digital camera and then got a film camera for much cheaper and spent the extra money on film and development,” says Hasagic who bought a Pentax P30. Although saving his money was short-lived.\n\nLoading “Around the new year, I counted up how much I spent last year and it was about three or four grand. So probably double that.” Hasagic loves that shooting on film forces a sort of mindfulness that makes you slow down and go with the flow. “There’s also the surprise element. When you get the scans back and the photo you thought was going to be really good turns out bad, but the photo you took accidentally is really amazing,” says Hasagic. Professional photographer Julia Sarantis, 29, says that mistakes are to be expected when working with film.\n\nJulia Sarantis outside of Sydney Super8 wearing a tie that previous owner Christopher Tiffany gifted her. Credit: Abby Seaman “Even though it’s heartbreaking, there are so many rolls [of film] that just didn’t turn out ... but it’s magic when it happens,” she says. Sarantis accidentally discovered her love of film photography when taking a required university elective. “As soon as I got in the dark room and saw the magic of the development, I got hooked,” says Sarantis. “I’ve always had an interest in old technology. But I think in a larger, cultural way it’s a deviation from immediacy of digital technology,” says Sarantis.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/as-bombs-rained-down-nikita-fled-his-home-now-he-s-written-a-grand-interstellar-adventure-20250828-p5mqon.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "As bombs rained down, Nikita fled his home. Now he’s written a grand interstellar adventure",
        "publish_date": "Sat, 13 Sep 2025 09:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Carolyn Webb"
        ],
        "text": "On the surface, it’s a humble picture book about space travel, but it’s had far-out benefits for the Ukrainian refugee children who created it.\n\nIt’s not just that the book is now in the collections of the State Library of Victoria and the children’s local Bentleigh Library in Melbourne’s south-east.\n\nNikita Rozmosh, 9 (left), and Petro Lazoriv, 13, with the book they worked on, The Big Space Adventure. Credit: Chris Hopkins\n\nIt’s also that while writing and illustrating the book, one night a week for six weeks, the children and their parents connected with people in the same situation — those who survived the brutal Russian invasion of Ukraine.\n\nThe bilingual book, called The Big Space Adventure, is among 250 titles that have been published in Australia by not-for-profit organisation Kids’ Own Publishing.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/bellamy-walks-out-after-calling-out-hip-drop-20250913-p5mupw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bellamy walks out after calling out hip drop",
        "publish_date": "Sat, 13 Sep 2025 08:50:42 +1000",
        "category": "finance",
        "authors": [],
        "text": "Bellamy walks out after calling out hip drop\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/former-health-minister-greg-hunt-an-adviser-to-exclusive-brethren-linked-firm-20250911-p5mu6j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Former health minister Greg Hunt an adviser to Exclusive Brethren-linked firm",
        "publish_date": "Sat, 13 Sep 2025 08:10:33 +1000",
        "category": "finance",
        "authors": [
            "Michael Bachelard"
        ],
        "text": "He had “never met or engaged with any of the firms or individuals you raise while in office”, the spokesman said. Under the ministerial code of conduct, former ministers are not permitted to lobby within 18 months of leaving their position, and Hunt’s advisory role explicitly ruled out lobbying. “There is therefore no conflict of any form nor could there be,” his spokesman said. The spokesman said Hunt had not, to his knowledge, met, been lobbied by or received any campaign donations from Brethren individuals or entities as an MP, and had not referred any approach from Westlab for a COVID-19 contract to his department.\n\nThis masthead reported in July that Hunt also chairs a “telehealth sector working group”, which is fully funded by medicinal cannabis giant Montu. Hunt said he was engaged as the independent chair of the group one day a month, with administrative support for the telehealth group being provided by Montu. Greg Hunt, in 2019 when he was federal health minister, at the opening of a Sunshine Coast cannabis farm. Credit: AAP A statement from Westlab said its dealings over the COVID-19 contracts were through nominated procurement panels and departmental officials, and “as we understand, were completely in line with compliance measures required from all potential providers in an emergency situation”. Westlab’s financial report, lodged in 2022, shows its revenue increased by 926 per cent due to the pandemic between 2021 and 2022, from $52 million to $534 million. Soon after the pandemic ended, Westlab’s co-owner and director, the Ballarat-based Brethren man, Gavin Grace, bought a luxury $14 million holiday home north-west of Sydney.\n\nLoading A statement from Grace, sent via a defamation lawyer, confirmed Hunt had “worked with us since early 2023 in a clearly defined role of one day per month. His focus is on global healthcare and life sciences trends, providing strategic insights, participating and speaking at events”. “Mr Hunt has made it very clear, and we were assured of this, that he had no involvement whatsoever in procurement decisions during the pandemic,” Grace’s statement said. “There is no conflict of interest here, real or perceived ... his contribution to Connected Global is solely about future innovation, not past government processes.” Grace added that Hunt was “eminently qualified for this role with our company ... and Connected Global is fortunate to benefit from his expertise”.\n\nUnder the Morrison government’s ministerial code of conduct, former ministers undertook not to lobby the government for 18 months, and not to take personal advantage of information they had access to as minister. This masthead is not suggesting Hunt has engaged in any wrongdoing, or breached the ministerial code. Gavin Grace is the Ballarat-based director of medical supply company Westlab. Credit: Westlab During the pandemic, Gavin Grace posted to LinkedIn announcing, “Help is on its way!’, with a picture of an Airbus full of personal protective equipment (PPE) arriving in Australia from Malaysia. “Thanks for all involved in co-ordinating this effort in the fight,” Grace wrote, tagging Hunt – then health minister – along with a number of Westlab staff members.\n\nGrace’s company, Connected Global, hopes to make money from the nexus between Australia’s post-pandemic desire for home-grown manufacture and supply of medical products, and the purpose-built “life sciences” facilities required to do so. Hunt has been providing advice to the company, including producing a “white paper” on the future of healthcare, identifying “megatrends” in the sector. Greg Hunt at an event in July 2025. Hunt features prominently in Connected Global’s marketing. On its website, under the heading “Australia’s biomedical boom”, Hunt is quoted as saying, “research is the single best way to advance health and medical care”, and setting out how government money is available to fund medical innovations. At the recent PharmOut conference, Hunt was billed as being from the “University of Melbourne and Connected”.\n\nIn the UK, documents have revealed a Brethren company, Unispace – controlled by Gareth Hales, the son of Brethren leader Bruce Hales, and a British Brethren man – won contracts ultimately worth $1.2 billion after directly lobbying the then cabinet secretary, Michael Gove. Gove appears to have put them on the then-Tory government’s so-called “VIP Lane” for procurement. COVID-19 contracts in Britain, including those fast-tracked in the VIP lane, are now subject to a special inquiry. In Australia, the Australian National Audit Office in 2021 found the government had received approaches from more than 4000 companies to supply the National Medical Stockpile. Pitches for contracts included “direct approaches to Health ... referrals from other Australian government entities, ministers’ offices and ... approaches to market”. Hunt’s spokesman said the Labor member for Ballarat, Catherine King, had written to him in late 2021 after meeting with Westlab. “Any such letter from the Labor member for Ballarat … would have been sent to the department under standard procedures,” Hunt said.\n\nThe audit office concluded that procurement processes during the pandemic had been “largely consistent with the proper use and management of public resources,” though there had been “inconsistent due diligence checks of suppliers”. It found the “appropriate delegate gave the approval [for contracts] in all instances”. The statement from Westlab said that, during the pandemic, “at no point did Westlab, its directors, staff, or shareholders approach Greg Hunt or any government minister”, and any such inference was “categorically false”. During the pandemic in Australia, Westlab worked directly in partnership with a company called Sante, run by Gareth Hales. Sante and Westlab supplied PPE and RATs to the government, some of which were co-branded. Hales campaigned prominently for the Liberal Party in the recent federal election campaign, and was pictured handing out leaflets in the seat of Bennelong. This masthead reported this month that some Liberal Party campaigners were deeply concerned about the party’s relationship with the church. Former minister Linda Reynolds has asked for its role in this year’s election to be examined in the party’s review of its disastrous loss.\n\nLoading Bruce Hales, the leader of the Brethren church – described by Prime Minister Anthony Albanese in May as a cult – was Westlab’s “independent auditor” in 2022, according to company accounts. Westlab, in its statement, claimed a senior registered auditor from Hales’ firm, “not Mr Bruce Hales himself” conducted the audit. The audit was “performed in accordance with ASIC and other regulatory standards”, Westlab said. However, Hales is registered as an individual auditor with ASIC and it appears he personally signed the 2022 accounts. Hales runs the church, of which Grace is a member, under extremely strict rules and can excommunicate wayward members, cutting them off from their families, their businesses and all their friends.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria-s-cbd-set-for-four-separate-protests-this-weekend-20250913-p5mupr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victoria s CBD set for four separate protests this weekend",
        "publish_date": "Sat, 13 Sep 2025 08:01:56 +1000",
        "category": "finance",
        "authors": [],
        "text": "Victoria s CBD set for four separate protests this weekend\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/sydney-airport-set-to-introduce-fixed-taxi-fare-rides-to-the-cbd-20250913-p5mupq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney Airport set to introduce fixed taxi fare rides to the CBD",
        "publish_date": "Sat, 13 Sep 2025 07:56:46 +1000",
        "category": "finance",
        "authors": [],
        "text": "Sydney Airport set to introduce fixed taxi fare rides to the CBD\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/ciraldo-livid-after-costly-calls-20250913-p5mupk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ciraldo livid after costly calls",
        "publish_date": "Sat, 13 Sep 2025 06:36:22 +1000",
        "category": "finance",
        "authors": [],
        "text": "Ciraldo livid after costly calls\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/movies/i-m-about-to-get-married-here-s-what-the-movies-have-taught-me-about-being-a-bride-20250901-p5mrf0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I’m about to get married. Here’s what the movies have taught me about being a bride",
        "publish_date": "Sat, 13 Sep 2025 05:30:00 +1000",
        "category": "finance",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Ever since hearing the priest utter “mawage” in The Princess Bride, I’ve been a sucker for wedding movies – from gushy romcoms such as Mamma Mia! and The Proposal to wacky matrimonial adventures like Palm Springs and Corpse Bride. But very soon, I’ll go from watching other brides to walking down the aisle myself. Since planning my own wedding, I can’t watch these movies the same way. Everything that was once funny – say, a soiled wedding dress or a sabotaging maid of honour – suddenly fills me with sheer horror. In contrast, the once-boring happy endings have me itching to, as Beyoncé would say, put a ring on it. From Father of the Bride to Bridesmaids, wedding movies tell a very different story when you’re about to walk down the aisle yourself. Credit: Compiled by Matt Davidson. So, here are nine wedding films I’ve watched ahead of getting hitched, and what they’ve taught me about being a bride. Father of the Bride (1991) A remake of the 1950 classic, this Steve Martin caper has always been one of my favourites. But watching it as a bride-to-be is an entirely different (and emotional) kettle of fish. Martin plays an overprotective father who learns his 22-year-old daughter got engaged during a semester abroad in Rome. While attempting to come to terms with “losing his little girl”, he subconsciously tries to sabotage the wedding, only to eventually realise he has to let her go.\n\nAdvertisement\n\nI’m my father’s youngest daughter, so this hits home hard. As exciting as the big day is for the couple, it can be incredibly emotional for the parents, who probably still see you as an 11-year-old laughing along to The Princess Bride. I’ll be sure to hug my dad extra tight on my wedding day. Muriel’s Wedding (1994) This Aussie classic is the perfect cautionary tale for any bride-to-be. Muriel (Toni Collette) is desperate to be “somebody” and believes a spectacular wedding will do just the trick. But when she eventually has her so-called perfect wedding with a South African swimmer in need of an Australian passport, she quickly realises a big bash wedding can’t truly change her life. A great wedding does not a perfect life make. Muriel learned that the hard way. Credit: Alamy Stock Photo I now know how easy it is to obsess over every tiny wedding detail, and to believe the smallest hitch means you’ve failed as a bride. But, ultimately, who cares if the cake is slightly lopsided, or one of your guests makes an embarrassing impromptu speech? A wedding doesn’t define your worth. Thanks for taking one for the team, Muriel.\n\nAdvertisement\n\nMy Best Friend’s Wedding (1997) While I once loved watching Julia Roberts’ attempt to steal her best friend from his fiancée just days before his wedding, it has since become my nightmare. Roberts plays a food critic who realises she still has feelings for her best friend/ex-partner when he announces his engagement to someone else. So, she proceeds to try to split the couple up in various sneaky, cruel ways. Now, there won’t be any exes at my wedding, but I can’t help but wonder if I’ve ever wronged somebody on the guest list – someone who has been waiting for the perfect time to strike. The one thing from this film that I’d accept with open arms, however, is the scene in which the family randomly bursts into I Say a Little Prayer at the dinner table. I’ll take any excuse to turn my life into a musical. The Wedding Singer (1998)\n\nAdvertisement\n\nAh, the mullets. So many mullets. Adam Sandler plays a wedding singer who is suddenly ditched by his fiancée, turning him into a cynical marriage-hater. That is, until he meets a wedding waitress (Drew Barrymore) who essentially teaches him to love again. The only hitch? She’s engaged to someone else. Beyond the horrific hairstyles (thankfully my fiancé simply wouldn’t have time to grow a mullet even if he wanted to now), this film legitimately steered me away from hiring a singer on the off chance they’re having a rough day and decide to take it out on my guests. This movie also makes it clear working in the wedding industry can be a tough and thankless gig, especially if you’re heartbroken and constantly surrounded by love. There will be nothing but respect for the staff at my wedding. My Big Fat Greek Wedding (2002) My family may not be Greek, but they are loud. So, watching this film offers a glimpse into how my fiancé may be feeling knowing he’s entering into this crazy crew. Power to him.\n\nAdvertisement\n\nLoading Jokes aside, this movie is a beautiful snapshot of two families and cultures coming together through marriage despite their differences. I grew up watching it for the hilarious interactions between the Greek aunties, but now I watch it as a reminder that a wedding doesn’t only unite the bride and groom, but also the families themselves. It’s also the reason we’ve added lamb to our menu. 27 Dresses (2008) I’ve probably seen this movie as many times as Katherine Heigl’s character has been a bridesmaid. Jane is a chronic people-pleaser who has been a bridesmaid 27 times – the classic “always a bridesmaid, never a bride”. She becomes the subject of columnist Kevin’s next story once he finds out she’s kept all 27 of her horrendously ugly bridesmaids dresses.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/athletics/torrie-lewis-was-the-face-of-australian-athletics-before-gout-but-she-can-t-imagine-how-he-feels-20250904-p5mshm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Torrie Lewis was the face of Australian athletics before Gout. But she can’t imagine how he feels",
        "publish_date": "Sat, 13 Sep 2025 05:30:00 +1000",
        "category": "sports",
        "authors": [
            "Michael Gleeson"
        ],
        "text": "Twelve months ago, you would have walked into a pharmacy and there she was. Long, curly brown hair, a smile of perfect teeth beaming out at you from the shelves of deodorants and razors.\n\nBefore the Paris Olympics, Torrie Lewis was the face of the Australian athletics team, and one of the faces of the Games.\n\nTorrie Lewis at the Paris Olympics. Credit: Eddie Jim\n\nThis year, Australia’s fastest woman has gladly passed that baton to Australia’s fastest boy, well, nearly man, Gout Gout.\n\nLewis was the big name in Aussie athletics before the public had heard of Gout Gout.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/paradigm-shift-over-2-million-households-to-get-internet-speed-boost-this-weekend/yun6p6kua",
        "title": "'Paradigm shift': Over 2 million homes to get internet speed boost starting this weekend",
        "publish_date": "Sat, 13 Sep 2025 00:11:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than 2.7 million households and businesses will unlock a free broadband speed boost in the coming days in a move experts are calling one of the biggest changes to the industry in years.\n\n\n\n\n\nBut not all homes will be eligible to receive faster downloads and many more may miss out on their full benefit due to outdated equipment.\n\n\n\n\n\nNBN Co will launch its internet upgrade program, Accelerate Great, starting on Sunday for homes connected to the network using fibre-to-the-premises and hybrid fibre coaxial (HFC) technology.\n\n\n\n\n\nThe free upgrade program will boost download and upload speeds for customers on three broadband plans, affecting about 2.77 million users.\n\n\n\nCustomers on 100 megabits per second plans will see their download speeds raised to 500mbps, 250mbps plans will lift to 750mbps downloads, while upload speeds will double to 100mbps on the fastest plans.\n\n\n\n\n\nNBN Co will also launch a two gigabit per second download plan as part of the program, chief executive Ellie Sweeney said, in a bid to boost Australia's internet use.\n\n\n\n\n\n\"We take great pride in delivering a reliable, high-speed and high-capacity network to Australians and it is our investment in the network that is enabling us to Accelerate Great, as we say,\" she said.\n\n\n\n\n\nMost Australian households are connected to 50mbps broadband plans, however, and would have to upgrade to receive the additional speed.\n\n\n\nThe speed boosts will be delivered to eligible customers automatically, Vodafone fixed line products general manager Andy O'Connor said, and will be a significant change for broadband users.\n\n\n\n\n\n\"I call it a paradigm shift,\" he said.\n\n\n\n\n\n\"It is genuinely the biggest change in the market we've ever seen.\"\n\n\n\n\n\nMore than half of the company's internet users would be able to receive the speed boosts, he said, although some could be short-changed if they failed to check connection options or check their hardware.\n\n\n\n\n\nNBN users who could not access higher speeds should ask if they were eligible for a free fibre-to-the-premises upgrade, O'Connor said, while those expecting a speed boost should check that their modem could deliver it.\n\n\n\n\"Not everybody's home modem is capable of going at that speed right now,\" he said.\n\n\n\n\n\n\"Some older models are only capable of going to about 200 or maybe 250 megabits per second.\"\n\n\n\n\n\nWhile the speed updates will begin on Sunday, upgrades could take several days to take effect.\n\n\n\n\n\nAustralia currently ranks 63rd in the world for fixed broadband speeds, according to the Speedtest Global Index, with an average download of 92mbps.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-you-missed-from-the-pacific-islands-forum/87abvie53",
        "title": "PM's wardrobe malfunction and SUV diplomacy: What you missed from the Pacific summit",
        "publish_date": "Fri, 12 Sep 2025 21:40:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Regional security and climate change loomed as major themes as Prime Minister Anthony Albanese embarked on a colourful and at times chaotic visit through Vanuatu and Solomon Islands.\n\n\n\n\n\nThe centrepiece was the Pacific Islands Forum (PIF) leaders' meeting in Honiara. The summit's communique will outline the key outcomes of the forum’s discussions but is yet to be released.\n\n\n\n\n\nBut while Albanese has been keen to highlight a blossoming relationship with the Pacific family, not all has gone to plan.\n\n\n\nA Vanuatu eruption\n\nThe first stop on Albanese's Pacific trip was Vanuatu, where it was widely expected a long-awaited $500 million pact would be signed with leader Jotham Napat.\n\n\n\n\n\nThe Nakamal Agreement, which would have seen Australia provide an additional $50 million in aid per year to the nation for the next decade, was meant to have been finalised and settled well before the prime minister boarded his RAAF jet.\n\n\n\nIt was widely expected that Australia would sign a long-awaited $500 million pact with Vanuatu leader Jotham Napat (centre) at the Pacific Islands Forum. Source: AFP / Department of Foreign Affairs and Trade Last month, Australian ministers trekked to the summit of an active volcano with their Vanuatu counterparts to mark the \"finalisation\" of the deal — a stratospheric spectacle to celebrate the end of negotiations.\n\n\n\n\n\nPerhaps the smoke rising in the background was an omen, because in the days before this visit, it became clear support within Vanuatu's coalition government was far from solidified, and on Tuesday before leaving, Albanese admitted on breakfast radio the deal was unlikely to happen.\n\n\n\n\n\nAt Friday's joint press conference in Port Vila, instead of a signing, Napat revealed the reason for the collapse in support: fears the pact's wording would limit Vanuatu's ability to sign infrastructure deals with partners like China.\n\n\n\n\n\nPacific analyst Tess Newton Cain said: \"Their [Vanuatu's] main driver is to ensure that they have available to them the resources that they need to guarantee human security in Vanuatu.\"\n\n\n\n\n\n\"That means working with a wide range of partners.\"\n\n\n\n\n\nThe Nakamal Agreement was to replace a previous security deal Vanuatu never formally ratified over concerns the terms agreed with Australia would impinge on its status as a non-aligned nation.\n\n\n\n\n\nAlbanese remains optimistic the agreement can be resurrected, and after sipping some cava with Napat to the tunes of King Stingray's live vocals, gave his counterpart a lift to Honiara the following morning.\n\n\n\nForeign Minister Penny Wong was pressed about whether Vanuatu's ties to China were cause for concern.\n\n\n\n\n\nShe told the Today Show: \"You might be able to speak for Vanuatu, I don't choose to,\" before a fire alarm rang out in her office, forcing the interview to be abandoned as \"evacuate now\" warnings drowned out her words. Auspicious timing indeed.\n\n\n\n4WD diplomacy\n\nSolomon Islands' hosting of the PIF in the bustling, muggy capital of Honiara has further fuelled the contest for influence in the Pacific region.\n\n\n\n\n\nAnd among the new displays of calculated charity from international partners were rival fleets of vehicles.\n\n\n\n\n\nAustralia promised a fleet, including Ford Rangers and Toyota Hiluxes, to be liveried in the colours of Solomon Islands police, but it was China's high-end Great Wall Motor SUVs that would ferry the leaders from venue to venue.\n\n\n\n\n\nThe duelling announcements, made within hours of each other, dominated Australian coverage in the lead-up to the event, with stories of Pacific power plays retopped with an angle reflecting the Antipodean fondness for four-wheel drives.\n\n\n\nSolomon Islands' hosting of the Pacific Islands Forum in the bustling capital of Honiara has further fuelled the contest for influence in the Pacific region. Source: AAP / Poppy Johnston And so considerable eyebrows were raised when Albanese stepped off the plane on the Honiara tarmac and hopped into an awaiting Chinese-supplied vehicle.\n\n\n\n\n\nAsked if he was disappointed not to be picked up by an Australian-supplied Hilux, Albanese responded glibly: \"It's a car. You know, cars get you from A to B.\"\n\n\n\n\n\nAcross Honiara, international aid partners have plastered their logos on various projects, ranging from billboards to bus stops.\n\n\n\n\n\nWhile Australia has long been the largest partner for development, China has its own expensive contributions, including the national stadium, which hosted the PIF opening ceremony and the media centre.\n\n\n\n\n\nSolomon Islands Prime Minister Jeremiah Manele addressed the increased strategic interest in the region directly in his opening address to the summit.\n\n\n\nSolomon Islands Prime Minister Jeremiah Manele did not invite PIF partner nations, including China, the US and Taiwan, to this year's meeting. Source: AAP / Ben McKay \"The world around us is changing fast, competition from powerful interests is intensifying,\" Manele said.\n\n\n\n\n\n\"The Pacific must never be seen as an arena for others.\"\n\n\n\n\n\nManale opted not to invite PIF partner nations, including China, the US, and Taiwan, to this summit in an attempt to avoid those tensions that could upend the forum's agenda.\n\n\n\n\n\nThose partners have, on the whole, respected the decision, and the move was criticised by Australia as well as independent Solomon Islands MP Peter Kenilorea Jr.\n\n\n\n\n\nA long-time China sceptic, he views infrastructure as \"front line\" of the strategic contest across the region.\n\n\n\n\n\n\"While Australia has been very helpful throughout our history … in perhaps a softer policy support capacity, I think the infrastructure space is where the real issues are now decided,\" he said.\n\n\n\n'Big dog' Australia's climate record questioned\n\nWhen leaders attend these summits, weeks of preparation go into planning the schedule, keeping up with customs, and drafting announcements.\n\n\n\n\n\nBut often things don't stick to the plan.\n\n\n\n\n\nWednesday's program witnessed several changes, delaying the sign-off on the Pacific Resilience Facility — a fund to help the region cover the costs of climate change.\n\n\n\n\n\nDelegates wept as the ceremony started — acknowledging the existential threat that this will go some way to addressing, and years of frustration over struggles to gain international support for mitigation and recovery.\n\n\n\n\n\nAustralia contributed an opening $100 million, but Albanese initially made a striking impression when he entered.\n\n\n\n\n\nUnlike the dapper blue dress of other leaders, he was adorned in a pink-patterned shirt.\n\n\n\n\n\nAfter a few minutes the wardrobe malfunction was identified and while speeches were still ongoing, Albanese, in full view of the cameras, walked out of the room for a frantic shirt change before walking back in a matching garb.\n\n\n\nThe pink shirt was never seen again.\n\n\n\n\n\nThe wardrobe malfunction greatly amused New Zealand Prime Minister Christopher Luxon, teasing Albanese the following morning about wearing the right shirt to the family photo.\n\n\n\n\n\nAsked by New Zealand media if the faux pas was a sign of Australia \"being the big dog and thinking they can wing it\", Luxon drily replied: \"I think he just forgot the instructions to be honest.\"\n\n\n\n\n\n\"You've got to reiterate quite a lot to the Australians what they need to be doing in the rules sometimes,\" he said.\n\n\n\n\n\nWhile Albanese often speaks fondly about the closeness of the government to the \"Pacific family\", a coordination cock-up at a major climate event only served to highlight some of the dissonance felt by other nations around Australia's track record on emissions.\n\n\n\n\n\nWhile the region is on board with a bid for a Pacific COP Climate Summit, Vanuatu's climate minister Ralph Regenvanu said Australia would need to match its climate ambitions in line with its island neighbours if it were to be a good host, as a decision on 2035 climate targets fast approaches.\n\n\n\n\n\n\"We also want Australia to start to talk seriously about addressing its fossil fuel production pipeline,\" he said.\n\n\n\n\n\nRegenvanu argues the July International Court of Justice ruling finding nations have a legal obligation to prevent climate impacts means Australia's view that it can meet its Paris commitments by completing a domestic transition, while still exporting fossil fuels like coal and gas, is \"now untenable\".\n\n\n\nOn Thursday, Albanese maintained gas is an important part of the transition and the domestic economy, while also talking up his government's climate record, describing the region's support for the COP bid as a show of trust in Australia's \"leadership\".\n\n\n\n\n\nAn impasse over the hosting rights remains — with Türkiye also jostling for the event, with the hope a resolution can be worked out with President Recep Tayip Erdoğan on the sidelines at the upcoming United Nations General Assembly.\n\n\n\n\n\nPalau will host next year's PIF before COP31, and President Surangel Whipps Jr said it would be \"an act of good faith if others would clear the way\" to allow the Pacific a global climate platform.\n\n\n\n\n\n\"The coming weeks are make or break, which is why we agreed to work very closely with Prime Minister Albanese.\n\n\n\n\n\n\"We don't want this major international opportunity to pass us by.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-supermarket-sweep-how-making-wise-choices-could-save-you-money/h0onz3s69",
        "title": "INTERVIEW: Supermarket sweep: How making wise choices could save you money",
        "publish_date": "Fri, 12 Sep 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-three-years-after-the-death-of-mahsa-amini-in-iran-whats-changed/gn6snvk02",
        "title": "INTERVIEW: Three years after the death of Mahsa Amini in Iran, what's changed?",
        "publish_date": "Fri, 12 Sep 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nIt has been about three years since the death in custody of Mahsa Jina Amini, which sparked a nationwide movement in Iran.\n\n\n\n\n\nWhile things have changed for Iranian women in different ways since then, experts say the government's crackdown still persists in new forms.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australias-emerging-golden-age-and-the-run-that-inspired-us-all/qtxwgdtgj",
        "title": "Bruce McAvaney on Australia's emerging athletics 'golden age' and the run that inspired us all",
        "publish_date": "Fri, 12 Sep 2025 20:41:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "Legendary sports commentator Bruce McAvaney says \"it's no illusion\" that Australian athletics is at the beginning of a \"golden age\" of development and success in the sport.\n\n\n\n\n\nSpeaking ahead of his role commentating SBS' coverage of the World Athletics Championships in Tokyo, McAvaney said he believes Australian athletics is in the best shape it's ever been, with several serious medal contenders among the country's 80-odd member team.\n\n\n\n\n\nMcAvaney said the event, running from 13-21 September and broadcast on SBS, is potentially the third most significant global sporting event behind the Olympics and the FIFA World Cup, with athletes from 198 countries participating.\n\n\n\n\n\n\"It doesn’t get bigger than this,\" he said.\n\n\n\n\n\n\"A diverse group of Australians from all sorts of backgrounds, come together … with 197 other countries. There are very few global opportunities like this.\"\n\n\n\nMcAvaney says Australian athletics competitors have been building impressive momentum that he believes will lead to victories in this year's championships and continue through to the Brisbane Olympics in 2032.\n\n\n\n\n\n\"I think we’re at the beginning of a golden age, and at the Brisbane Olympics, in seven years time, that’s not going to go away.\n\n\n\n\n\n\"And this really all began in Tokyo four years ago, where you could see the writing on the wall so I believe this group are representing a team that is in a period the whole country is going to be very excited right now and going forward.\"\n\n\n\nAustralian runner Jessica Hull won the silver medal in the Women's 1500m final at the 2024 Paris Olympic Games. Source: AAP / Dean Lewins At the Paris Olympics in 2024, Australia's athletics team won seven medals, the most at an Olympic Games since 1956, and the year before won six at the World Championships, also a record high.\n\n\n\n\n\nMcAvaney says momentum on and off-track makes him believe in the emergence of a golden age.\n\n\n\n\n\n\"It’s not manufactured, it’s very real, it’s not an illusion what’s happening out there in terms of the depth of talent in our country\".\n\n\n\n\n\nOff the track he says Australia is being considered a more serious player in global athletics, with events like the Sydney marathon gaining a huge global following as one of five major marathons.\n\n\n\n\n\nHowever, two major medal hopes have become late scratchings — Olympic pole vault champion Nina Kennedy and racewalker Jemima Montag, who won bronze in the 20km in Paris, have pulled out of the championships through injury, threatening Australia's overall medal tally hopes.\n\n\n\nPressure on young stars\n\nNearly a quarter of Australia's team are 21 or younger, another reason why McAvaney predicts they will shine at a home Olympics.\n\n\n\n\n\nThe highest-profile young Australian athlete is undoubtedly Gout Gout, who at just 17-years-old and running 100 metres in under 10 seconds, is being compared to sprinting great Usain Bolt.\n\n\n\n\n\nSpeaking about the Australian teenager while in Tokyo for the competition, Bolt said even though Gout is talented, it's never going to be \"just easy\" for him to win.\n\n\n\n\"He's very talented, with the times he's running now and he's really been doing well,\" Bolt said.\n\n\n\n\n\n\"That's something that you love to see because you want athletes to do well. The more athletes do well, the bigger the sport is, and I'm always a supporter of track and field getting bigger and doing bigger things.\n\n\n\n\n\n\"So if he continues on this track he's going to be good, but it's all about getting everything right.\"\n\n\n\n\n\nGout will compete in the men's 200m heats on Wednesday 17 September.\n\n\n\n\n\nMcAvaney said Gout is \"so interesting\" given he's about to start his year 12 studies while dealing with global fame and pressure to perform.\n\n\n\nBruce McAvaney hugs Gout Gout as he celebrates winning his Under 20s 200m final at the Queensland Athletics Championships in Brisbane in March. It was the first time Gout had run below 20 seconds for the 200m. Source: AAP / Jono Searle \"There’s a lot of expectation on him and noone really knows how he’s going to perform.\n\n\n\n\n\n\"But we do know he’s a rare talent and we haven’t seen anything like him in Australia. I think he will run particularly well.\"\n\n\n\n\n\nMcAvaney said he thinks middle-distance runner Peter Bol is another athlete who could perform well, given he's running faster now than he was when he placed 4th in the 800m at the 2020 Tokyo Olympics.\n\n\n\n\n\nThe master commentator flagged distance runner Jess Hull and discus star Matt Denny as other standouts, as well as high jumper Nicola Olyslagers, who won silver in Paris, as Australia's best medal hope.\n\n\n\n\n\n\"She’s the Diamond League champion and the world indoor champ, at the moment I think it’s a 50-50 bet between her and [Ukrainian Olympic champion Yaroslava] Mahuchikh, she’ll be on the podium and she’s a great competitor,\" McAvaney said.\n\n\n\nREAD MORE How to watch 2025 World Athletics Championships LIVE on SBS\n\nThe 'one lap' that inspired the whole world\n\nThis year marks the 25-year anniversary of the Sydney Olympic Games — and for many Australians, Cathy Freeman's gold medal win in the 400 metres is among their favourite sporting memories of all time.\n\n\n\n\n\nAsked about role models in athletics, McAvaney said the Indigenous runner is one of the greats.\n\n\n\n\n\n\"I think Cathy’s legacy is even stronger right now than it was 25 years ago,\" he said.\n\n\n\n\n\n\"That’s how pure and rich that whole performance was from the lighting of the cauldron to winning that gold medal. She carried the nation on her back. The pressure was unbelievable. It would have diminished so many people but she actually took it on and soared.\"\n\n\n\nCathy Freeman's gold medal-winning 400m run at the 2000 Sydney Olympics. Credit: Dean Lewins McAvaney said the \"one lap run of hers\" laid down a benchmark for others to follow.\n\n\n\n\n\n\"Great performances are fleeting. What Cathy did is forever.\"\n\n\n\n\n\nBruce McAvaney will lead the expert commentary along with former world indoor 800m champion Tamsyn Manou to call the track events, while renowned SBS commentator David Basheer will bring audiences all the action in the field.\n\n\n\n\n\nEvery session from the nine-day event will be broadcast live and free across SBS VICELAND, including the World Athletics Championships 2025 Hub via SBS On Demand, which will also feature full replays, mini recaps and Aussie Focus clips for every session.\n\n\n\n\n\nMorning sessions will run from 8am to 1.30pm AEST on September 13–15 and 20–21, while evening sessions will be from 8pm to 11.30pm AEST each night of the championships.\n\n\n\n\n\nHere's the full schedule for SBS's broadcast of the World Athletics Championships.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/robodebt-class-action-compensation-whats-next-for-victims/yturl57q3",
        "title": "$548.5 million: The price the government is willing to pay 'to avoid a public trial' of robodebt",
        "publish_date": "Fri, 12 Sep 2025 20:36:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "\"Are we good enough?\"\n\n\n\n\n\nThis question has stayed with Felicity Button since the day she discovered $11,571 had been withdrawn from her bank account.\n\n\n\n\n\nIt was 2017, and Button had just taken her baby daughter to a doctor's appointment. She says she had recently been paid, and knew she could afford the appointment, medication and petrol to return home.\n\n\n\n\n\n\"I went to go and pay for my appointment, and my card declined,\" she says.\n\n\n\n\n\nButton contacted Centrelink and found out that a debt collector had withdrawn the money, claiming she owed a historical robodebt.\n\n\n\nFelicity Button (pictured) was one of the lead applicants in the robodebt class action and appears in SBS's docu-drama The People vs Robodebt. Source: SBS News / Simon Morris Several years prior, Button had received income support from Centrelink — Youth Allowance and Austudy — while studying for her nursing degree and working several jobs. However, that support ended in 2015.\n\n\n\n\n\nShe recalls receiving a letter in September 2016, alleging she owed a debt, which she subsequently queried with Centrelink. She says the service \"couldn't really give [her] any answers\". After nearly a year of correspondence, she was moved onto a payment plan of $20 per week. Then the money was unexpectedly withdrawn from her account in September 2017.\n\n\n\n\n\nWhile driving home, she recalls feeling powerless and saying: \"I may as well run my car off the road.\"\n\n\n\n\n\nBetween 2015 and 2019, the debt recovery scheme set up by the then Coalition government relied on an automated assessment of tax office and welfare payment data to calculate average earnings and issue debt notices to welfare recipients. The process often failed to accurately reflect earnings, with many recipients pursued for debts they did not owe, including Button.\n\n\n\n\n\nThe scheme raised $1.76 billion from around 526,000 recipients through approximately 794,000 debt recovery transactions.\n\n\n\n\n\nA royal commission into the scheme, which ran between 2022 and 2023, described robodebt as a \"crude and cruel mechanism\" that was \"neither fair nor legal\" and \"made many people feel like criminals\".\n\n\n\n\"In essence, people were traumatised on the off-chance they might owe money. It was a costly failure of public administration, in both human and economic terms,\" the commission wrote in its final report in 2023.\n\n\n\n\n\nVictims suffered severe impacts from being falsely accused of owing debts, the report found. In some circumstances, the despair robodebt caused led to recipients taking their own lives .\n\n\n\n\n\nButton, now a mother of two, appears in SBS' upcoming docu-drama series The People vs Robodebt. She has been one of the lead applicants in a years-long class action lawsuit brought against the federal government over the botched debt recovery scheme, including a landmark appeal settled last week . Her money was returned; however, the ordeal has had a lasting impact.\n\n\n\n\"I think mothers inherently always question ourselves on whether or not we're doing a good enough job … and are we good enough? That's unfortunately ingrained in being a woman and a mother, for the most part,\" Button says.\n\n\n\n\n\n\"But this brings it to a much deeper level … It makes you think, all it takes is one thing to completely derail your life.\"\n\n\n\n\n\nShe's one of many robodebt victims who have fought for compensation and are now seeking accountability.\n\n\n\n'Financial vindication' or 'accountability avoided'?\n\nButton first joined the legal fight against robodebt in 2019.\n\n\n\n\n\nLaunched by Gordon Legal, the initial class action was settled in 2020, with the federal government agreeing to repay wrongfully raised debts and accrued interest — amounting to a settlement of $1.8 billion. (The majority of this cleared the $1.76 billion in unlawful deductions).\n\n\n\n\n\nLast week, it announced that an appeal led by the firm had been settled for a further $548.5 million , including $475 million in compensation for victims.\n\n\n\nGordon Legal says the appeal was launched following the release of the royal commission's report in 2023, which uncovered new evidence of misfeasance — the wrongful use of legal authority — by senior public servants who designed and ran the scheme.\n\n\n\n\n\nThe appeal argued that the new evidence should be considered to allow victims to seek further compensation.\n\n\n\n\n\n\"The allegations were that very senior public servants knew that the scheme they were implementing was unlawful,\" Gordon Legal partner Andrew Grech says.\n\n\n\n\n\n\"If we were able to establish that in court, as we believed we would be able to … that would have meant group members who suffered distress or further financial loss, or in some tragic cases, had loved ones who took their own lives, would have been able to seek financial damages compensation for the distress that they suffered,\" he says.\n\n\n\nThat was very significant because many group members felt the original class action didn't really answer some of those questions, and didn't make the public servants involved truly accountable for what had occurred.\n\nGrech hopes victims feel a \"sense of finality\" and that their concerns \"have been listened to\".\n\n\n\n\n\nAttorney-General Michelle Rowland said the settlement shows the Albanese government's \"ongoing commitment to addressing the harms caused to hundreds of thousands of vulnerable Australians by the former Liberal government's disastrous robodebt scheme\".\n\n\n\n\n\n\"Settling this claim is the just and fair thing to do,\" she said.\n\n\n\n\n\nThe agreement includes up to $60 million in administration costs and up to $13.5 million to cover the applicants' legal costs, with the remaining $475 million for compensation.\n\n\n\n\n\nIf approved by the Federal Court, the government said this would be the largest class action settlement in Australian history. According to Gordon Legal, it would deliver more than $2.4 billion in financial redress for victims.\n\n\n\nAttorney-General Michelle Rowland said settling the claim is the \"just and fair thing to do\". Source: AAP / Lukas Coch For Button, the settlement brought some relief.\n\n\n\n\n\n\"[It] was really reflective of the financial penalty that the government has to now pay for such an egregious act, which is sad, because we're looking at it from a financial penalty point of view … but there's no compensation to the families that lost people,\" she says.\n\n\n\n\n\n\"You can give them all the money in the world; it's not going to bring the person back.\"\n\n\n\n\n\nAustralian Council of Social Service chief executive Cassandra Goldie welcomed the settlement but said it does not \"deliver full justice\" for victims.\n\n\n\n\n\n\"Ten years on from when robodebt commenced, no-one responsible for its design, implementation and continuation has been publicly held accountable in a way that delivers justice for its victims and their families,\" she said in a statement.\n\n\n\nAustralian Council of Social Service chief executive Cassandra Goldie said the settlement does not \"deliver full justice\" for robodebt victims. Source: AAP / Mick Tsikas Christopher Rudge is a lecturer at Sydney Law School, researching welfare law. Beyond the settlement being \"a day of financial vindication\" for victims, he also believes it's \"a day of accountability avoided for those who designed the scheme\".\n\n\n\n\n\n\"This isn't just a payout; it's the price the government was willing to pay to avoid a public trial based on the royal commission's evidence of misfeasance in public office,\" he says.\n\n\n\nThe settlement ensures the central legal claim of the litigants will never be tested in court.\n\nWhile the Commonwealth may have been able to successfully defend the claim, Rudge argues: \"We still would have been able to better scrutinise the standards we expect of public servants in Australia.\"\n\n\n\n\n\nGrech says that in any litigation process, \"the answers are never complete\".\n\n\n\n\n\n\"What we think we've been able to do is to shine a light on what was unlawful conduct and to ensure that people harmed by it get some sense of closure and some redress for the harm that was caused to them,\" he says.\n\n\n\nWhat happens now?\n\nIt could take up to six months for the Federal Court to approve the settlement, Grech says. A minimum of $475 million would then be available to distribute among members who choose to participate; however, the specifics of how that will be allocated to individuals have yet to be determined.\n\n\n\n\n\nWith up to 471,000 members in total, Grech expects there to be tens of thousands of people who would opt to receive a fixed payment or individualised assessment. To put that in perspective: if 471,000 registered, the average compensation amount for each person would be $1,008.\n\n\n\n\n\nRudge says the settlement's billing as the largest of its kind in Australia is \"a reflection of the size of the cohort rather than the generosity of the payments to victims\".\n\n\n\n\n\nMeanwhile, an investigation into six referrals from the royal commission is being led by the National Anti-Corruption Commission (NACC), based on an announcement made by an independent decision maker for the NACC in February. The referrals were contained in a sealed chapter, recommending individuals for civil action or criminal prosecution.\n\n\n\nThis reversed an earlier decision by the NACC not to commence a corruption investigation against the six individuals.\n\n\n\n\n\n\"If any of those six referred individuals committed a breach of public trust, then we should expect that private hearings will be held — or could have already been held — and we await any findings emanating from those hearings,\" Rudge says.\n\n\n\n\n\n\"The powers of the NACC are primarily referral-based. It doesn't have the power to prosecute, lay charges or convict in its own right.\"\n\n\n\nWhile Button is relieved with the class action win, she wants to see individuals held to account.\n\n\n\n\n\n\"I just want to see criminal charges laid on the people that orchestrated, designed and constructed the scheme,\" she says.\n\n\n\n\n\n\"And I want to see further mental health support for people who lost more than money can recoup.\n\n\n\nAnother scheme: Addressing a historical debt calculation\n\nRobodebt is not the only instance of unlawful debt calculations by government agencies.\n\n\n\n\n\nOn 27 August, the government announced it would be rolling out \"resolution payments\" for those potentially impacted by a historical debt calculation method known as income apportionment.\n\n\n\n\n\nThe practice was used by Centrelink between 1991 and 2020 to calculate debts for recipients where it was unclear when income was earned. It involved averaging income evenly across two or more fortnightly payment blocks.\n\n\n\n\n\nThe Commonwealth Ombudsman found the method was unlawful in 2023, but said this arose from agencies \"genuinely holding an incorrect understanding\" of the law.\n\n\n\n\n\nThe government estimates that around 5.5 million debts — previously or currently held by around three million people and worth around $4.4 billion — may be affected. The vast majority have already been repaid.\n\n\n\n\n\nA bill introduced to parliament seeks to address income apportionment by validating its use for past calculations, and setting up a resolution scheme for those with potentially affected debts.\n\n\n\nSocial Services Minister Tanya Plibersek introduced a bill to Parliament on 4 September, seeking to address income apportionment by validating its use for past calculations and establishing a resolution scheme for those with potentially affected debts. Source: AAP / Lukas Coch This follows the Federal Court's approval of a method for the government to recalculate debts owed in July.\n\n\n\n\n\n\"Nevertheless, the government instead said, rather than go back and recalculate all these unlawful debts, we will put forward legislation that validates those past unlawfully calculated debts, and we will pay a $600 resolution payment to anyone identified as affected,\" Rudge says.\n\n\n\n\n\nIntroducing the bill to parliament on 4 September, Social Services Minister Tanya Plibersek said reopening debts and recalculating them \"would cause distress and protracted uncertainty for the people affected\", and divert critical government resources away from frontline services.\n\n\n\n\n\n\"This was not robodebt,\" she stressed.\n\n\n\n\n\nRudge says the government has been clear in distinguishing income apportionment from robodebt. However, while they are distinct methods of calculating debts, he argues there is overlap.\n\n\n\n\n\n\"A single debt could be affected by both,\" he says.\n\n\n\nAutomatic cancellation of job seeker payments 'unlawful'\n\nMeanwhile, the Commonwealth Ombudsman has been investigating the cancellation of job seeker payments by a government department under an automated system.\n\n\n\n\n\nThe Targeted Compliance Framework (TCF) was set up in 2018 to ensure job seekers complete specific activities, called mutual obligation requirements, in order to continue receiving payments. This process is managed by the Department of Employment and Workplace Relations (DEWR) and Services Australia.\n\n\n\n\n\nNew laws were introduced in April 2022 that required consideration of a job seeker's circumstances before deciding to cancel a payment.\n\n\n\n\n\nHowever, the ombudsman found 964 people had their income support automatically cancelled between April 2022 and last July, when the DEWR secretary paused cancellations.\n\n\n\n\n\n\"A further 45 job seekers received automated cancellations after the secretary's decision to pause cancellations, when they should not have,\" ombudsman Iain Anderson said in a report, published on 6 August.\n\n\n\nLISTEN TO Ombudsman scolds government agencies over automatic cancellation of welfare payments SBS News 01:30 English\n\nThe ombudsman said agencies' cancellation of income support was not lawful and did not ensure processes and computer systems were complying with amended legislation.\n\n\n\n\n\nHe cited conclusions from the robodebt royal commission about the use of automated processes, and the \"serious impact\" these can have on vulnerable people.\n\n\n\n\n\nThe report recommended the department not resume cancellations until errors are rectified and cancellations are compliant with the law.\n\n\n\n\n\nSeparately, the government commissioned an independent assurance review into the IT system that underpins the framework. Undertaken by Deloitte and released on 14 August, it found a \"critical lack of traceability\" linking legislation, operational policy and \"automatic compliance logic\" embedded within the system.\n\n\n\n\n\nIn a statement to SBS News, a DEWR spokesperson confirmed it has accepted all recommendations from the ombudsman's report, noting it and Deloitte's review made \"a number of important findings and recommendations, including areas for urgent action and longer-term improvements\".\n\n\n\nThe department is taking immediate steps to address the urgent actions identified.\n\nThe spokesperson confirmed all payment reductions and cancellations remain paused.\n\n\n\nThe Australian Financial Review also reported that the Deloitte report includes a number of fabricated references, including to academic works. Rudge, who discovered the errors, suspects these were generated by artificial intelligence.\n\n\n\n\n\nThe DEWR spokesperson said Deloitte has confirmed some footnotes and references in its final report were incorrect.\n\n\n\n\n\n\"The department has requested that Deloitte provide a corrected version of the statement of assurance and final report as soon as possible,\" the spokesperson said.\n\n\n\n\n\nSBS News understands Deloitte is managing the matter.\n\n\n\nIn Rudge's view, the TCF has a \"broad policy commonality\" with other scandals.\n\n\n\n\n\n\"It's a framework designed to ensure that welfare recipients are never permitted to receive an entitlement that is in any way suspected of being an overpayment,\" he says.\n\n\n\n\n\n\"When a policy initiative is pursued relentlessly, internal decision-making becomes siloed and overly goal-oriented, and decisions are made in an unexamined way that is contrary to law. That is what has happened here, just as in the other schemes, although in a very different way.\"\n\n\n\nCould robodebt happen again?\n\nRudge points to a growing risk of technological error, particularly with the rise of AI interacting with complex legislation.\n\n\n\n\n\n\"I think all of the variables combine to become the ingredients of another scandal,\" he says.\n\n\n\n\n\n\"If we're not careful and if there isn't a paradigm shift … we could see it [robodebt] happening again.\"\n\n\n\nREAD MORE Meet the regional mums taking on the government's automated debt recovery scheme\n\nRudge argues a change in policy approach is needed, one that focuses on the entitlement of welfare recipients to support.\n\n\n\n\n\n\"The principle should be that rather than assume there is fraud in every area of the system, it should be the working assumption that people are entitled to the welfare that they are receiving, and there should be a much higher threshold for investigating fraud,\" he says.\n\n\n\n\n\nButton hopes the robodebt settlement is a \"wake-up call to the government to say 'we're not going to tolerate this'\".\n\n\n\n\n\nShe says her fight was never about the money.\n\n\n\n\n\n\"More importantly, the future looks a bit brighter for my kids.\"\n\n\n\n\n\nAll three episodes of The People vs Robodebt will premiere on 24 September on SBS on Demand. Episodes will air weekly on SBS.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/extension-of-wa-gas-project-greenlit-by-australian-government/1efvkc08r",
        "title": "Extension of WA gas project greenlit by Australian government",
        "publish_date": "Fri, 12 Sep 2025 09:33:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/islamophobia-register-australia-welcomes-special-envoys-report/aiiigp66g",
        "title": "Islamophobia Register Australia welcomes Special Envoy's report",
        "publish_date": "Fri, 12 Sep 2025 09:33:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/former-virgin-ceos-50m-payday-is-a-us-rate-cut-locked-in/l8f9hkzjz",
        "title": "Former Virgin CEO’s $50m payday; & is a US rate cut locked in?",
        "publish_date": "Fri, 12 Sep 2025 07:58:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/your-guide-to-2025-world-athletics-championships/p7wrafboj",
        "title": "A 5-minute guide to the World Athletics Championships – and how to watch from Australia",
        "publish_date": "Fri, 12 Sep 2025 04:32:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia is fielding its largest-ever athletics team at the World Championships in Tokyo, where more than 2,000 athletes from around 200 nations will compete for glory across track, field, and road events.\n\n\n\n\n\nThe nine-day showcase, kicking off on Saturday and running until Sunday 21 September, doubles as a proving ground for rising stars and seasoned competitors vying for a spot at the 2028 Los Angeles Olympics.\n\n\n\n\n\nAmong the new generation leading the charge is teenage sprinter Gout Gout, who has captured worldwide attention at just 17 years old, alongside fellow standouts distance runner Jess Hull and discus star Matt Denny.\n\n\n\n\n\nNearly a quarter of the team are 21 or under, underscoring the depth of young talent emerging on the world stage.\n\n\n\n\n\nHere's everything you need to know about the 2025 World Athletics Championships.\n\n\n\nWhen and where are the 2025 World Athletics Championships?\n\nThe championships are taking place from 13 to 21 September in Tokyo, Japan.\n\n\n\n\n\nThe majority of events will be held at the Japan National Stadium, while road events, including the marathon and race walks, will take place on specially designed courses throughout the city.\n\n\n\n\n\nThis is the second time Tokyo has hosted the championships and the third time they're being held in Japan. Tokyo first hosted the event in 1991 while they were held in Osaka in 2007.\n\n\n\n\n\nThe championships were first held in Helsinki, Finland in 1983, and since 1991, have been held every two years, with the most recent edition staged in Budapest, Hungary in August 2023.\n\n\n\n\n\nFormer big stars of the championships include Olympic great sprinters Usain Bolt and Jackie Joyner-Kersee, as well as pole vault legend Sergey Bubka.\n\n\n\nWhat events are on the program?\n\nMore than 2,000 athletes from some 200 countries will compete for 147 medals across 49 events in Tokyo, with a total prize pool exceeding $13 million and bonuses of $155,000 awarded for each world record.\n\n\n\nThe championships feature a full range of track and field action, including 12 track events and eight field events, alongside the marathon and race walks over 20km and 35km for both men and women.\n\n\n\n\n\nMulti-discipline contests include the men's decathlon and women's heptathlon, and the program also features the mixed 4x400m relay.\n\n\n\nWho's in Australia's team?\n\nMore than 80 Australian athletes are in Tokyo , its largest team ever for a global championship.\n\n\n\n\n\nThe team blends established stars with rising talent, including high jumper Nicola Olyslagers who won silver at the 2020 Tokyo and 2024 Paris Olympics, middle-distance star Jess Hull, who won silver in the 1,500m at the Paris Games, discus ace Matt Denny, who won bronze in Paris, and long jumper Liam Adcock, who is Oceania champion.\n\n\n\n\n\nPole vaulter Kurtis Marschall, who won bronze at the 2023 World Athletics Championships, will also be competing.\n\n\n\n\n\nEmerging sprint sensation Gout Gout will make his senior debut in the men's 200 metres, part of a young cohort that Australian Athletics chief executive Simon Hollingsworth said represents both current promise and potential for the lead-up to the 2028 Summer Olympics.\n\n\n\nREAD MORE Australian sprint superstar Gout Gout breaks his own national 200m record\n\n\"You look across the cohort and it's exciting for what they'll do right now in Tokyo, but also what that potential represents over the period leading into LA and then beyond,\" Hollingsworth said.\n\n\n\n\n\nSome top athletes, however, will be missing in Tokyo, including reigning Olympic and world championships pole vault champion Nina Kennedy, race walker Jemima Montag, who won bronze in Paris, and sprinter Lachlan Kennedy, all of whom have been sidelined by injury.\n\n\n\n\n\nAustralia ranks 13th on the all-time World Athletics Championships medal table, having claimed 15 gold medals — 10 of which were won by individual athletes — and a total of 45 medals.\n\n\n\nHow can I watch the championships from Australia?\n\nStarting Saturday, every session from the nine-day event will be broadcast live and free across SBS VICELAND , including the World Athletics Championships 2025 Hub via SBS On Demand , which will also feature full replays, mini recaps and Aussie Focus clips for every session.\n\n\n\n\n\nMorning sessions will run from 8am to 1.30pm AEST on September 13–15 and 20–21, while evening sessions will be from 8pm to 11.30pm AEST each night of the championships.\n\n\n\nREAD MORE McAvaney takes the lead for SBS’ coverage of the 2025 World Athletics Championships\n\nSBS director of Sport Ken Shipp said the World Athletics Championships in Tokyo is an \"unmissable viewing\" experience for Australian fans.\n\n\n\n\n\n\"We've broadcast ten editions of the World Athletics Championships since 2001, and this one shapes as a spectacular opportunity for Australia,\" he said.\n\n\n\n\n\nBruce McAvaney is leading the expert commentary along with former world indoor 800m champion Tamsyn Manou to call the track events, while renowned SBS commentator David Basheer is bringing audiences all the action in the field.\n\n\n\n\n\nHere's the full schedule for SBS's broadcast of the World Athletics Championships.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/drunk-raccoon-saved-with-cpr-20250913-p5muq6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Drunk raccoon saved with CPR",
        "publish_date": "Sat, 13 Sep 2025 10:00:59 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Drunk raccoon saved with CPR\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-afl-is-its-own-beast-that-ll-make-finding-goyder-s-replacement-fascinating-20250911-p5mub4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The AFL is its own beast. That’ll make finding Goyder’s replacement fascinating",
        "publish_date": "Sat, 13 Sep 2025 09:33:00 +1000",
        "category": "finance",
        "authors": [
            "Darren Kane"
        ],
        "text": "Which is at the same time a blessing and a problem, rendering things all rather interesting. And proceedings could get vituperative before too long. Goyder has this past week foreshadowed that he won’t seek re-election to the AFL’s board of directors at its next annual general meeting. His impending exit can be attributed to a chairman finally deciphering the tea leaves conveying the message that his number might be up. His tenure has been anything but a straight path. Also, Goyder commenced as AFL Commission chair in 2017; these roles don’t materialise regularly. AFL Commission chairman Richard Goyder at this year’s hall of fame function. Credit: Getty It’s plain that the process of choosing Goyder’s replacement is as Byzantine as the plot of the 2025 Oscar-nominated movie, Conclave. It’s a process that is also not entirely codified. Nature abhors a vacuum, and the pole that one must shimmy up to claim power is lathered in grease. How Goyder is succeeded, well, that’s a murky process. Say what you want, but it’s kind of mind-blowing that a billion-dollar company of such social standing in Australia as the AFL is, has no orderly succession plan in place.\n\nIt’s reported that the candidates vying to fill the void do, or might include former AFL lawyer and Collingwood president, Jeff Browne; plaintiff-centric compo lawyer and former Western Bulldogs president Peter Gordon, and another certain former Collingwood chieftain and early dinnertime game show host Edward Joseph McGuire, AM. Assuming the accuracy of the registers maintained by the Australian Securities and Investments Commission, neither Browne nor McGuire has served as a director of the AFL; Gordon, however, did, between 1990 and 1993. Bringing any person in from outside the current cohort of AFL directors is a task mightily more difficult than it sounds. We’re talking about a very particular type of billion-dollar business here. The sheer magnification of omnipresent public scrutiny, applied to decision-making, is manifest. Most corporate executives and professional directors would be chewed up and spat out sideways. Each potential candidate I’ve named has done astonishing things professionally, and in some cases, other eyebrow-raising things that astonish. Browne has probably forgotten more about the intersection of sport, law, and business just in the last week than I’ll ever know. If he’s lost to the process through wicked political jiggery-pokery, the process is poorer and weaker for it.\n\nOn paper, any sport’s governing body would be fortunate to have him as a director. But these things aren’t ever a contest of achievements and excellence. It was Mario Puzo’s Don Lucchese who put it best: “money is a gun; politics is knowing when to pull the trigger”. For a company of its standing in Australian society, the process of the AFL selecting a chairperson is remarkably unsophisticated. The AFL’s constitution isn’t a complex document. Essentially, it works this way: clause 60 of the AFL’s constitution mandates the company must have between six and nine directors, although clause 75 then says the company in general meeting may increase (or reduce) that number. Presently, and by my count, the AFL has 10 directors. Former Collingwood president Eddie McGuire after the Magpies’ finals win over Adelaide. Credit: AFL Photos At each AGM, two longest-serving directors – together with anyone else who hasn’t faced the voters in three years – are compelled to retire from office. But there’s no constitutional limit on the number of times a person can be re-elected. Clause 64 mandates that new, non-executive commissioners are elected by the “Appointees”, themselves being the voting representatives of each of the AFL’s 18 clubs. If the total number of retiring directors offering themselves for re-election, and any new nominees not already directors, exceeds the number of vacant positions (being two), an election takes place. In secret.\n\nWhich conjures the adage that the only voters who’ll tell you the truth about who they voted for are the ones who’ll admit they voted for the other bloke. Sections 67(h) and (i) provide that the highest-polling candidates, in a first-past-the-post election, are declared elected, provided they also receive a majority of votes from the voting representatives of the 18 voting club representatives in attendance. Loading For all the talk about subcommittees vetting candidates and making recommendations to the AFL Commission, that’s all convenient wallpapering in reality because pursuant to clause 70, any three clubs could band together and nominate anyone they wish to be elected. The AFL doesn’t have an independence-rooted governing system or anything approaching it. Given that the clubs’ Appointees also control the voting on candidates to elect as directors, the clubs wield enormous power. If it’s true, the next AFL chair must come from the new directors to be elected – whether because none of the current directors want the job, or because the current cohort each know none of their own are up to it – the clubs hold four clean aces.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/i-d-feel-like-i-couldn-t-survive-for-these-sydneysiders-having-a-garden-is-a-primal-need-20250827-p5mq6k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I’d feel like I couldn’t survive’: For these Sydneysiders, having a garden is a primal need",
        "publish_date": "Sat, 13 Sep 2025 09:30:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Julie Power"
        ],
        "text": "Asked what she would do without the community garden at Poet’s Corner near her home in Sydney’s Redfern, Paula Le said she’d spend more time alone, stuck in a small unit without enough light to support a pot plant.\n\nFor Jan Chamberlain of Strathfield, who volunteers at community gardens across Sydney, not being able to garden would be an emotional loss, considering the memories she has of her Aunty Rose floating frangipanis in water and her mother planting trees.\n\nPaula Le (left) and Phil Pettitt from the community greening program with volunteer Jan Chamberlain. Paula and Jan both use the community garden within their complexes. Credit: Janie Barrett\n\nPhil Pettitt manages the Royal Botanic Garden of Sydney’s community greening project, which includes those at 600 Homes NSW properties, and calls it a primal need. “If I couldn’t garden, I’d feel like I couldn’t survive,” Pettitt said. “I feel like if the world ended tomorrow, I can grow some food and support my family.”\n\nA new study by the RBGS’s Pettitt, with housing and health experts from Swinburne University of Technology, found 94 per cent of Australians older than 50 say that having somewhere to garden is “extremely important”, and good for their mental and physical health.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/this-sydney-institution-is-riding-the-wave-of-a-gen-z-fuelled-revival-20250827-p5mqd8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This Sydney institution is riding the wave of a Gen Z-fuelled revival",
        "publish_date": "Sat, 13 Sep 2025 09:00:00 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Orrell shoots on film for fun and because it looks “cute”. She brings her film camera on nights out, to take photos of her friends and on holidays, like on her recent trip to Europe. “It captures the moment, you can’t be like ‘I look ugly’ and re-take it… The photo is what it is,” says Orrell, who has been on a break from Instagram because of the pressure to capture and share a ‘perfect’ moment. “I look back through my parents’ pictures, and it’s all about the memory and not about performing. When I get to 60, I can look back at my film photos and reminisce,” says Orrell. In August, photography company Eastman Kodak reported its quarterly filings, including significant debt, which led to news headlines that the company might be facing closure. Kodak called these media reports misleading and released a statement to clarify that “Kodak has no plans to cease operations” and is “confident it will repay, extend, or refinance its debt.”\n\nIn November 2024, the iconic 133-year-old camera company had to temporarily pause its film production to make upgrades to its New York factory to keep up with the motion picture and still image film demands. “It’s funny talking about what’s going to happen in the future. We don’t know. Pentax is the only manufacturer who have produced a film camera in 20 years,” says Vlahadamis. Japanese camera manufacturer Pentax launched the Pentax 17 last year, the first new film camera from a major brand since the 2000s. “It’s a camera that shouldn’t exist today. They have almost sold out globally. But as a major manufacturer, Pentax has gone out on a limb,” says Vlahadamis. The stores street view; The well-stocked film fridge. Credit: Abby Seaman\n\nChristopher Tiffany getting a single-use camera ready for processing. Credit: Abby Seaman In August, FujiFilm Australia took a similar risk and re-launched QuickSnap, a 35mm single-use camera targeted at Gen-Z customers. FujiFilm Australia’s general manager Mary Georgievski says the product relaunch comes at a time of culture shift and taps into the younger generations’ craving for nostalgia. “Gen Z are a lot about mental health, slowing things down, realising what we had in the past was great. While they’re highly connected digitally, Gen Z is driving a renewed appreciation for analog, choosing film not in place of digital, but alongside it,” says Georgievski. Film photography is experiencing a wave of revival at the same time as compact digital cameras. Both trends are trying to tell the same story – perhaps the instant gratification of a smartphone camera is no longer satisfying for young people.\n\nDenis Hasagic was originally saving up to buy a digital camera when he was actively searching for a hobby. Denis Hasagic, 25, was originally saving up for a digital camera when he found his love of film photography. Credit: Abby Seaman Instead, the 25-year-old Sydney Super8 regular picked up his dad’s old Pentax MZ-50 and started shooting film. Only four out of 37 photos turned out, but Hasagic was already hooked. “I saved up all this money for a digital camera and then got a film camera for much cheaper and spent the extra money on film and development,” says Hasagic who bought a Pentax P30. Although saving his money was short-lived.\n\nLoading “Around the new year, I counted up how much I spent last year and it was about three or four grand. So probably double that.” Hasagic loves that shooting on film forces a sort of mindfulness that makes you slow down and go with the flow. “There’s also the surprise element. When you get the scans back and the photo you thought was going to be really good turns out bad, but the photo you took accidentally is really amazing,” says Hasagic. Professional photographer Julia Sarantis, 29, says that mistakes are to be expected when working with film.\n\nJulia Sarantis outside of Sydney Super8 wearing a tie that previous owner Christopher Tiffany gifted her. Credit: Abby Seaman “Even though it’s heartbreaking, there are so many rolls [of film] that just didn’t turn out ... but it’s magic when it happens,” she says. Sarantis accidentally discovered her love of film photography when taking a required university elective. “As soon as I got in the dark room and saw the magic of the development, I got hooked,” says Sarantis. “I’ve always had an interest in old technology. But I think in a larger, cultural way it’s a deviation from immediacy of digital technology,” says Sarantis.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/as-bombs-rained-down-nikita-fled-his-home-now-he-s-written-a-grand-interstellar-adventure-20250828-p5mqon.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "As bombs rained down, Nikita fled his home. Now he’s written a grand interstellar adventure",
        "publish_date": "Sat, 13 Sep 2025 09:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Carolyn Webb"
        ],
        "text": "On the surface, it’s a humble picture book about space travel, but it’s had far-out benefits for the Ukrainian refugee children who created it.\n\nIt’s not just that the book is now in the collections of the State Library of Victoria and the children’s local Bentleigh Library in Melbourne’s south-east.\n\nNikita Rozmosh, 9 (left), and Petro Lazoriv, 13, with the book they worked on, The Big Space Adventure. Credit: Chris Hopkins\n\nIt’s also that while writing and illustrating the book, one night a week for six weeks, the children and their parents connected with people in the same situation — those who survived the brutal Russian invasion of Ukraine.\n\nThe bilingual book, called The Big Space Adventure, is among 250 titles that have been published in Australia by not-for-profit organisation Kids’ Own Publishing.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/bellamy-walks-out-after-calling-out-hip-drop-20250913-p5mupw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bellamy walks out after calling out hip drop",
        "publish_date": "Sat, 13 Sep 2025 08:50:42 +1000",
        "category": "finance",
        "authors": [],
        "text": "Bellamy walks out after calling out hip drop\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/former-health-minister-greg-hunt-an-adviser-to-exclusive-brethren-linked-firm-20250911-p5mu6j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Former health minister Greg Hunt an adviser to Exclusive Brethren-linked firm",
        "publish_date": "Sat, 13 Sep 2025 08:10:33 +1000",
        "category": "finance",
        "authors": [
            "Michael Bachelard"
        ],
        "text": "He had “never met or engaged with any of the firms or individuals you raise while in office”, the spokesman said. Under the ministerial code of conduct, former ministers are not permitted to lobby within 18 months of leaving their position, and Hunt’s advisory role explicitly ruled out lobbying. “There is therefore no conflict of any form nor could there be,” his spokesman said. The spokesman said Hunt had not, to his knowledge, met, been lobbied by or received any campaign donations from Brethren individuals or entities as an MP, and had not referred any approach from Westlab for a COVID-19 contract to his department.\n\nThis masthead reported in July that Hunt also chairs a “telehealth sector working group”, which is fully funded by medicinal cannabis giant Montu. Hunt said he was engaged as the independent chair of the group one day a month, with administrative support for the telehealth group being provided by Montu. Greg Hunt, in 2019 when he was federal health minister, at the opening of a Sunshine Coast cannabis farm. Credit: AAP A statement from Westlab said its dealings over the COVID-19 contracts were through nominated procurement panels and departmental officials, and “as we understand, were completely in line with compliance measures required from all potential providers in an emergency situation”. Westlab’s financial report, lodged in 2022, shows its revenue increased by 926 per cent due to the pandemic between 2021 and 2022, from $52 million to $534 million. Soon after the pandemic ended, Westlab’s co-owner and director, the Ballarat-based Brethren man, Gavin Grace, bought a luxury $14 million holiday home north-west of Sydney.\n\nLoading A statement from Grace, sent via a defamation lawyer, confirmed Hunt had “worked with us since early 2023 in a clearly defined role of one day per month. His focus is on global healthcare and life sciences trends, providing strategic insights, participating and speaking at events”. “Mr Hunt has made it very clear, and we were assured of this, that he had no involvement whatsoever in procurement decisions during the pandemic,” Grace’s statement said. “There is no conflict of interest here, real or perceived ... his contribution to Connected Global is solely about future innovation, not past government processes.” Grace added that Hunt was “eminently qualified for this role with our company ... and Connected Global is fortunate to benefit from his expertise”.\n\nUnder the Morrison government’s ministerial code of conduct, former ministers undertook not to lobby the government for 18 months, and not to take personal advantage of information they had access to as minister. This masthead is not suggesting Hunt has engaged in any wrongdoing, or breached the ministerial code. Gavin Grace is the Ballarat-based director of medical supply company Westlab. Credit: Westlab During the pandemic, Gavin Grace posted to LinkedIn announcing, “Help is on its way!’, with a picture of an Airbus full of personal protective equipment (PPE) arriving in Australia from Malaysia. “Thanks for all involved in co-ordinating this effort in the fight,” Grace wrote, tagging Hunt – then health minister – along with a number of Westlab staff members.\n\nGrace’s company, Connected Global, hopes to make money from the nexus between Australia’s post-pandemic desire for home-grown manufacture and supply of medical products, and the purpose-built “life sciences” facilities required to do so. Hunt has been providing advice to the company, including producing a “white paper” on the future of healthcare, identifying “megatrends” in the sector. Greg Hunt at an event in July 2025. Hunt features prominently in Connected Global’s marketing. On its website, under the heading “Australia’s biomedical boom”, Hunt is quoted as saying, “research is the single best way to advance health and medical care”, and setting out how government money is available to fund medical innovations. At the recent PharmOut conference, Hunt was billed as being from the “University of Melbourne and Connected”.\n\nIn the UK, documents have revealed a Brethren company, Unispace – controlled by Gareth Hales, the son of Brethren leader Bruce Hales, and a British Brethren man – won contracts ultimately worth $1.2 billion after directly lobbying the then cabinet secretary, Michael Gove. Gove appears to have put them on the then-Tory government’s so-called “VIP Lane” for procurement. COVID-19 contracts in Britain, including those fast-tracked in the VIP lane, are now subject to a special inquiry. In Australia, the Australian National Audit Office in 2021 found the government had received approaches from more than 4000 companies to supply the National Medical Stockpile. Pitches for contracts included “direct approaches to Health ... referrals from other Australian government entities, ministers’ offices and ... approaches to market”. Hunt’s spokesman said the Labor member for Ballarat, Catherine King, had written to him in late 2021 after meeting with Westlab. “Any such letter from the Labor member for Ballarat … would have been sent to the department under standard procedures,” Hunt said.\n\nThe audit office concluded that procurement processes during the pandemic had been “largely consistent with the proper use and management of public resources,” though there had been “inconsistent due diligence checks of suppliers”. It found the “appropriate delegate gave the approval [for contracts] in all instances”. The statement from Westlab said that, during the pandemic, “at no point did Westlab, its directors, staff, or shareholders approach Greg Hunt or any government minister”, and any such inference was “categorically false”. During the pandemic in Australia, Westlab worked directly in partnership with a company called Sante, run by Gareth Hales. Sante and Westlab supplied PPE and RATs to the government, some of which were co-branded. Hales campaigned prominently for the Liberal Party in the recent federal election campaign, and was pictured handing out leaflets in the seat of Bennelong. This masthead reported this month that some Liberal Party campaigners were deeply concerned about the party’s relationship with the church. Former minister Linda Reynolds has asked for its role in this year’s election to be examined in the party’s review of its disastrous loss.\n\nLoading Bruce Hales, the leader of the Brethren church – described by Prime Minister Anthony Albanese in May as a cult – was Westlab’s “independent auditor” in 2022, according to company accounts. Westlab, in its statement, claimed a senior registered auditor from Hales’ firm, “not Mr Bruce Hales himself” conducted the audit. The audit was “performed in accordance with ASIC and other regulatory standards”, Westlab said. However, Hales is registered as an individual auditor with ASIC and it appears he personally signed the 2022 accounts. Hales runs the church, of which Grace is a member, under extremely strict rules and can excommunicate wayward members, cutting them off from their families, their businesses and all their friends.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria-s-cbd-set-for-four-separate-protests-this-weekend-20250913-p5mupr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victoria s CBD set for four separate protests this weekend",
        "publish_date": "Sat, 13 Sep 2025 08:01:56 +1000",
        "category": "finance",
        "authors": [],
        "text": "Victoria s CBD set for four separate protests this weekend\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/sydney-airport-set-to-introduce-fixed-taxi-fare-rides-to-the-cbd-20250913-p5mupq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney Airport set to introduce fixed taxi fare rides to the CBD",
        "publish_date": "Sat, 13 Sep 2025 07:56:46 +1000",
        "category": "finance",
        "authors": [],
        "text": "Sydney Airport set to introduce fixed taxi fare rides to the CBD\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/ciraldo-livid-after-costly-calls-20250913-p5mupk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ciraldo livid after costly calls",
        "publish_date": "Sat, 13 Sep 2025 06:36:22 +1000",
        "category": "finance",
        "authors": [],
        "text": "Ciraldo livid after costly calls\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/movies/i-m-about-to-get-married-here-s-what-the-movies-have-taught-me-about-being-a-bride-20250901-p5mrf0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I’m about to get married. Here’s what the movies have taught me about being a bride",
        "publish_date": "Sat, 13 Sep 2025 05:30:00 +1000",
        "category": "finance",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Ever since hearing the priest utter “mawage” in The Princess Bride, I’ve been a sucker for wedding movies – from gushy romcoms such as Mamma Mia! and The Proposal to wacky matrimonial adventures like Palm Springs and Corpse Bride. But very soon, I’ll go from watching other brides to walking down the aisle myself. Since planning my own wedding, I can’t watch these movies the same way. Everything that was once funny – say, a soiled wedding dress or a sabotaging maid of honour – suddenly fills me with sheer horror. In contrast, the once-boring happy endings have me itching to, as Beyoncé would say, put a ring on it. From Father of the Bride to Bridesmaids, wedding movies tell a very different story when you’re about to walk down the aisle yourself. Credit: Compiled by Matt Davidson. So, here are nine wedding films I’ve watched ahead of getting hitched, and what they’ve taught me about being a bride. Father of the Bride (1991) A remake of the 1950 classic, this Steve Martin caper has always been one of my favourites. But watching it as a bride-to-be is an entirely different (and emotional) kettle of fish. Martin plays an overprotective father who learns his 22-year-old daughter got engaged during a semester abroad in Rome. While attempting to come to terms with “losing his little girl”, he subconsciously tries to sabotage the wedding, only to eventually realise he has to let her go.\n\nAdvertisement\n\nI’m my father’s youngest daughter, so this hits home hard. As exciting as the big day is for the couple, it can be incredibly emotional for the parents, who probably still see you as an 11-year-old laughing along to The Princess Bride. I’ll be sure to hug my dad extra tight on my wedding day. Muriel’s Wedding (1994) This Aussie classic is the perfect cautionary tale for any bride-to-be. Muriel (Toni Collette) is desperate to be “somebody” and believes a spectacular wedding will do just the trick. But when she eventually has her so-called perfect wedding with a South African swimmer in need of an Australian passport, she quickly realises a big bash wedding can’t truly change her life. A great wedding does not a perfect life make. Muriel learned that the hard way. Credit: Alamy Stock Photo I now know how easy it is to obsess over every tiny wedding detail, and to believe the smallest hitch means you’ve failed as a bride. But, ultimately, who cares if the cake is slightly lopsided, or one of your guests makes an embarrassing impromptu speech? A wedding doesn’t define your worth. Thanks for taking one for the team, Muriel.\n\nAdvertisement\n\nMy Best Friend’s Wedding (1997) While I once loved watching Julia Roberts’ attempt to steal her best friend from his fiancée just days before his wedding, it has since become my nightmare. Roberts plays a food critic who realises she still has feelings for her best friend/ex-partner when he announces his engagement to someone else. So, she proceeds to try to split the couple up in various sneaky, cruel ways. Now, there won’t be any exes at my wedding, but I can’t help but wonder if I’ve ever wronged somebody on the guest list – someone who has been waiting for the perfect time to strike. The one thing from this film that I’d accept with open arms, however, is the scene in which the family randomly bursts into I Say a Little Prayer at the dinner table. I’ll take any excuse to turn my life into a musical. The Wedding Singer (1998)\n\nAdvertisement\n\nAh, the mullets. So many mullets. Adam Sandler plays a wedding singer who is suddenly ditched by his fiancée, turning him into a cynical marriage-hater. That is, until he meets a wedding waitress (Drew Barrymore) who essentially teaches him to love again. The only hitch? She’s engaged to someone else. Beyond the horrific hairstyles (thankfully my fiancé simply wouldn’t have time to grow a mullet even if he wanted to now), this film legitimately steered me away from hiring a singer on the off chance they’re having a rough day and decide to take it out on my guests. This movie also makes it clear working in the wedding industry can be a tough and thankless gig, especially if you’re heartbroken and constantly surrounded by love. There will be nothing but respect for the staff at my wedding. My Big Fat Greek Wedding (2002) My family may not be Greek, but they are loud. So, watching this film offers a glimpse into how my fiancé may be feeling knowing he’s entering into this crazy crew. Power to him.\n\nAdvertisement\n\nLoading Jokes aside, this movie is a beautiful snapshot of two families and cultures coming together through marriage despite their differences. I grew up watching it for the hilarious interactions between the Greek aunties, but now I watch it as a reminder that a wedding doesn’t only unite the bride and groom, but also the families themselves. It’s also the reason we’ve added lamb to our menu. 27 Dresses (2008) I’ve probably seen this movie as many times as Katherine Heigl’s character has been a bridesmaid. Jane is a chronic people-pleaser who has been a bridesmaid 27 times – the classic “always a bridesmaid, never a bride”. She becomes the subject of columnist Kevin’s next story once he finds out she’s kept all 27 of her horrendously ugly bridesmaids dresses.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/athletics/torrie-lewis-was-the-face-of-australian-athletics-before-gout-but-she-can-t-imagine-how-he-feels-20250904-p5mshm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Torrie Lewis was the face of Australian athletics before Gout. But she can’t imagine how he feels",
        "publish_date": "Sat, 13 Sep 2025 05:30:00 +1000",
        "category": "sports",
        "authors": [
            "Michael Gleeson"
        ],
        "text": "Twelve months ago, you would have walked into a pharmacy and there she was. Long, curly brown hair, a smile of perfect teeth beaming out at you from the shelves of deodorants and razors.\n\nBefore the Paris Olympics, Torrie Lewis was the face of the Australian athletics team, and one of the faces of the Games.\n\nTorrie Lewis at the Paris Olympics. Credit: Eddie Jim\n\nThis year, Australia’s fastest woman has gladly passed that baton to Australia’s fastest boy, well, nearly man, Gout Gout.\n\nLewis was the big name in Aussie athletics before the public had heard of Gout Gout.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/terror-groups-affiliates-slapped-sanctions-002154741.html",
        "title": "Terror groups and affiliates slapped with sanctions",
        "publish_date": "2025-09-13T00:21:54Z",
        "category": "finance",
        "authors": [],
        "text": "A trio of extremist organisations, including Hamas, along with other entities and individuals have been relisted for counter-terrorism financing sanctions.\n\nPalestinian groups Hamas and Palestinian Islamic Jihad, and Lebanese group Hezbollah, along with 30 other entities and 10 individuals, have been relisted by the federal government for sanctions.\n\nThe listings expire every three years and are being renewed ahead of their expiry in 2025.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHamas has been listed since 2001.\n\n\"We are also imposing new counter-terrorism financing sanctions on three persons and one entity linked to Hamas, to reflect changes in the leadership of the terrorist organisation,\" Foreign Minister Penny Wong said.\n\nAustralia is working to help isolate Hamas and end its grip on Gaza, Penny Wong says. (Lukas Coch/AAP PHOTOS)\n\nThe counter-terrorism listings target Izz al-Din al-Haddad, Hamas' leader and military commander since May 2025.\n\nA member of Hamas' Politburo and a senior financial facilitator are also listed as well as a currency exchange used to facilitate the transfer of funds and cryptocurrency to Hamas.\n\nSenator Wong said the government remained unequivocal in its condemnation of Hamas and continued to call for the immediate, unconditional and dignified release of the hostages it took during the horrific October 7, 2023 terrorist attacks.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"We continue to work with the international community to isolate Hamas and end its grip on Gaza,\" she said.\n\n\"We have made clear that there can be no role for Hamas in a Palestinian state.\"\n\nA listing for counter-terrorism financing sanctions makes it a criminal offence to use or deal with a listed person or entity's assets or to make an asset available to them.\n\nPalestinian group Hamas and its new leader are among those facing financing sanctions. (James Ross/AAP PHOTOS)\n\nCounter-terrorism financing sanctions disrupt the ability of terrorist organisations to raise funds, making it harder for terrorists to fund operations and recruit.\n\nPenalties for breaching an Australian sanctions law include up to 10 years' imprisonment and/or heavy fines.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe relistings follow online far-right extremist group Terrorgram's designation as a terror organisation in June after it was hit with counter-terrorism financing sanctions in February, as part of the federal government's crackdown on anti-Semitism.\n\nTerrorgram provides instructions to its members online through the chat platform Telegram on how to conduct terrorist attacks and has been responsible for inspiring events in the United States, Europe and Asia.\n\nThe neo-Nazi and white supremacist group was linked to a plot to kill NSW Labor MP Tim Crakanthorp in 2024.\n\nSenator Wong said it was the first time Australia had imposed counter-terrorism financing sanctions on an entirely online entity.",
        "source": "Yahoo"
    }
]