[
    {
        "url": "https://www.9news.com.au/world/thailand-cannabis-crackdown-tourists-warned-australia-smartraveller/0dbd898b-bdfb-4a9a-8cae-517ac1031b21",
        "title": "Aussies warned over holiday hotspot's tough new drug laws",
        "publish_date": "Thu, 26 Jun 2025 22:56:12 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "It will take effect when it is published in the\n\nRoyal Gazette\n\n, although it was unclear when that would happen.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/deep-sleep-helps-problem-solving-eureka-moments-study-finds/234ffdd1-d678-4329-bb8f-4e774dd181df",
        "title": "'Sleeping on it' really does help solve problems, study finds",
        "publish_date": "Thu, 26 Jun 2025 20:27:42 +0000",
        "category": "lifestyle",
        "authors": [
            "Jun"
        ],
        "text": "\"Sleeping on it\" really does help people solve problems, a new study has found.\n\nIt's long been theorised that sleep can help bring on \"eureka\" moments of insight or realisation, but now a group of scientists have put it to the test.\n\nParticipants in a study, published in PLOS Biology , were asked to track a series of dots across a screen.\n\nDeeper sleep has been linked to problem-solving breakthroughs. (Getty)\n\nThey were all given instructions that involved responding to the dots on a keyboard, but were not told about a trick that could make the task easier.\n\nAfter four sets of trials, all the participants took a 20-minute nap, while scientists tracked their slee﻿p patterns.\n\nAfter their nap, the subjects were tested again, and 70.6 per cent of them were able to figure out the unmentioned \"trick\" that made their task easier.\n\nA study showed \"aha\" moments were linked to deeper sleep. (Getty Images/iStockphoto)\n\nThe study found that 85.7 per cent of those who had achiev﻿ed the first deeper sleep phase – or N2 sleep – had their \"aha\" moment, compared to 55.5 per cent of those who stayed away, and 63.6 per cent of those who dropped into lighter, N1 sleep.\n\nIn a group given the same task, but who did not get a chance to nap, only 49.6 per cent had a \"breakthrough\" moment.﻿\n\n\"It's really intriguing that a short period of sleep can help humans make connections they didn't see before,\" study co-author Nicholas Schuck said.\n\n\"The next big question is why this happens.\"\n\nFellow co-author Anika Löwe said it was good to establish solid data around what had been a subjective, if widely known, experience.\n\n\"What really struck me when telling people in my environment - particularly creatives - about these findings was how much they resonated with people,\" Löwe said.\n\n\"Many of them could relate to our results with a personal experience of having a (creative) breakthrough after a nap.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/matildas-joe-montemurro-debut-vs-slovenia-in-perth/105468078",
        "title": "Montemurro unconcerned by error-riddled Matildas in coaching debut",
        "publish_date": "Fri, 27 Jun 2025 01:19:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "Matildas coach Joe Montemurro has given his first match in charge a tick of approval after watching his side escape with a 3-0 win over Slovenia in Perth.\n\nThe understrength Matildas struggled to adapt to Montemurro's possession-heavy game style, with error after error allowing Slovenia to unleash 20 shots on goal during Thursday night's match.\n\nFan favourite scores first Matildas goal Photo shows GettyImages-2222251599 Joe Montemurro makes a winning start to his tenure as Matildas coach, with Holly McNamara among the goal-scorers in the 3-0 victory over Slovenia in Perth.\n\nThe Matildas also created plenty of chances, with Emily Gielnik's third-minute strike getting the hosts off to a flyer, before Holly McNamara and Hayley Raso scored in the dying minutes to seal the win.\n\nMontemurro only had a few days with the squad before his first match.\n\nHe is still missing the likes of Sam Kerr, Mary Fowler, Steph Catley, Caitlin Foord, Katrina Gorry, Cortnee Vine and Clare Wheeler.\n\nImplementing a new game plan — especially one as pressure-filled as possession-based football — is going to take time.\n\nThe former Arsenal, Juventus and Lyon coach was happy with what he saw in Perth.\n\nMontemurro said the errors committed were all part of the process in teaching the players how to handle pressure when on the ball.\n\n\"It was an entertaining game. It could have been 6-5, or 7-6 or something,\" he said.\n\n\"But for me, it was a very important test, because a team that will play player-on-player in that manner, we have to learn to be better under these circumstances, because a lot of teams will do this now in modern football.\n\nJoe Montemurro is unfazed by the errors made by the Matildas in his debut as coach. (AAP: Richard Wainwright)\n\n\"When you want to play a game where you're breaking lines and preparing to break lines and you're playing under pressure, you are going to make mistakes.\"\n\nThe Matildas will face Slovenia again in Perth on Sunday.\n\nThey play Panama in two matches — one in Bunbury (July 5) and the second in Perth (July 8).\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/brody-mihocek-collingwood-emotional-maturity-fuels-afl-career/105467894",
        "title": "'It's OK to cry': How Mihocek's emotional maturity fuels his AFL career",
        "publish_date": "Fri, 27 Jun 2025 01:13:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "The last movie that made premiership player Brody Mihocek cry was the Pixar animation Coco.\n\nWhen it was suggested that would make a good headline, he told ABC Sport: \"Do it, it's OK to cry.\"\n\n\"A lot of kids' animation, kids' movies would make me cry more than anything else.\n\n\"The night before a game, instead of watching footy, I put a movie on. A really good movie can put me in a good mood for a good game, weird enough.\"\n\nIt is a headspace a long way from where he was 10 years ago, toiling away in the VFL.\n\nBack then, he was losing his love of footy, overlooked in multiple drafts, working 40 hours a week and doing extras around that, all to try and get noticed by an AFL club.\n\nBrody Mihocek was drafted at age 25 and is now a premiership player and five-time club leading goal kicker. (Getty: Robert Cianflone)\n\nIt was not until he was 25 that he was picked up by Collingwood in the 2018 rookie draft after four years in the VFL.\n\nThis Saturday, he will run out against West Coast for his 150th game, as a five-time leading goal kicker at the Magpies, a father and premiership forward.\n\n\"I would have loved to have been picked up at 18, and I believe I should have, but it wasn't meant to be,\" he said.\n\nWhen he was not taken as a teenager right away, his managers told him he needed to get out of Tasmania and move to Victoria.\n\n\"I just couldn't afford to be out on my own, so I had to stay in Tassie. I made the call to just stay locally, work a job, save money, to get over here,\" Mihocek said.\n\n\"I needed to work different jobs. I was working in Cotton On. I was the first male ever to work in Cotton On in Burnie. I was a plumber, labourer.\n\nAs soon as he finished the season and bought a car, he got the boat over to Melbourne.\n\n\"(All) with the goal of making the AFL - and you get so consumed in doing that, you lose the fun of football,\" he said.\n\nCollingwood has tabled a one-year contract extension for Brody Mihocek but the Magpie wants to play on. (Getty: AFL Photos/Russell Freeman)\n\nMihocek rediscovered his love for the game at Port Melbourne when his mentality shifted towards trying to enjoy where he was at, instead of having the outcome of \"will it happen?\"\n\n\"It was more just, if it happens, good, if not, I'm happy with where I'm at,\" he said.\n\nYet Mihocek was still putting in extras, doing laps of Melbourne Rectangular Stadium at 5am and getting gym sessions in before work.\n\n\"I love the grind of all that and working hard, but it does take a toll,\" he said.\n\n\" I didn't know if it was all going to be worth it, but it has been in the end. \"\n\nHe kicked four goals on debut against Fremantle in round 11 of the 2018 season and never fell out of the side outside of injuries.\n\nHe admits his initial one-year contract was \"nerve-wracking\".\n\n\"You could be out just as fast as you got in,\" he said.\n\nBrody Mihocek with son Arthur and Scott Pendlebury after a Collingwood win. (Getty: AFL Photos/Michael Willson)\n\nCollingwood have currently tabled a one-year contract extension to Mihocek, which would take him through to the end of 2026.\n\n\"It's a tricky one. You want more as you get older and I know it's a business as well,\" Mihocek said.\n\n\"I haven't been in this position [before], so all you can do is go out there and try and play footy and keep it at the back of your mind.\n\n\"You'd love to sign right away, but these things take time.\"\n\nMihocek is one of many mature-age recruits to have made a significant impact across the AFL in recent years.\n\nMost notably, Tom Stewart was plucked from Geelong's VFL system at age 23, then went on to become a five-time All Australian, premiership player and two-time club champion.\n\nFollowing him, Shaun Mannagh and Lawson Humphries are making waves at the Cats this year.\n\nCallum Wilkie won St Kilda's best and fairest after being runner-up twice and Sam Durham is now one of Essendon's best, as is Jai Newcombe at Hawthorn.\n\nBrody Mihocek was drafted as a defender but moved straight into Collingwood's forward line. (Getty: AFL Photos/Josh Chadwick)\n\nWhile much preferring to have been picked up as a teenager, Mihocek says there is something in entering the AFL system with a bit more life development under your belt.\n\n\"Coming in at 24 was good for my development because I had moved out of home, I worked a full-time job,\" he said.\n\n\"And it was just more being treated like an adult and I knew life outside football.\"\n\nMihocek was lucky, though, too.\n\nThe year he debuted, he played in a grand final (which Collingwood lost to West Coast) and has only missed out on finals twice in his seven-year career.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Even under Bucks [Nathan Buckley], it was a special team and we had fun,\" Mihocek said.\n\n\"And now under Fly [Craig McRae] it's even more fun.\n\n\"I believe what I've done is quite special and a lot of other blokes in the team would say the same.\n\n\"To get to 150 games and to do what I've done, I think I should be very proud.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/prospectors-flock-to-goldfields-after-large-nugget-unearthed/105409842",
        "title": "Gold rush in WA after nugget worth a home deposit unearthed",
        "publish_date": "Fri, 27 Jun 2025 00:46:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Veteran prospector Chris MacGregor had one thought when he heard about a chunk of gold that weighed nearly a kilogram being found near a historical West Australian gold mine town recently — \"you lucky people\".\n\nThe 895-gram nugget found by prospectors near Sandstone, 513 kilometres north of Kalgoorlie, is worth about $165,000.\n\n\"I'm sure they put in the hours, which is what it's all about, and good luck to them,\" Mr MacGregor said.\n\nChris MacGregor has been prospecting on and off for more than 40 years after picking up his first piece of gold at the age of 11. (ABC Goldfields: Katrina Tap)\n\nThe Perth resident is one of many visitors making the most of a booming prospecting season in the region.\n\nAmalgamated Prospectors and Leaseholders Association of WA president James Allison said the discovery of the large nugget showed \"the big gold\" was \"still out there\".\n\nJames Allison says even small finds can bring big returns. (ABC Goldfields: Jarrod Lucas)\n\n\"With the technology now, there's a lot of people going over old ground and still finding gold — that's why all the caravan parks … they're all full,\" he said.\n\n\"It's just the allure. If you find an ounce of gold – that's about the size of a 10-cent piece – that's worth $5,000.\"\n\nUntapped market\n\nGold was first found in the region by prospectors Arthur Bayley and William Ford in 1892.\n\nMarcus Falconer says big gold finds help to attract tourists to the region. (Supplied)\n\nAustralia's Golden Outback chief executive Marcus Falconer said finds such as the Sandstone nugget were \"important\" in keeping the mystique of the Goldfields alive.\n\n\"People decide to – like back in the gold rush days – come to seek these things out,\" he said.\n\nCity of Kalgoorlie-Boulder Mayor Glenn Wilson said the current record high gold prices had certainly excited people.\n\n\"There's gold fever getting around at the moment,\" he said.\n\n\" It's great to see that people are making the most of what is a very buoyant gold price. \"\n\nChris MacGregor says the key to successful prospecting is putting in the time. (ABC Goldfields: Katrina Tap)\n\nProspectors have been flocking to the region for 130 years but Cr Wilson said gold tourism was a largely untapped market.\n\n\"Prospectors might spend … up to three or four months out on the land looking for that elusive nugget,\" he said.\n\n\"I think there's a massive opportunity … to harness and to further understand what that prospecting community does deliver.\"\n\nGreg and Liz Watson thought the pandemic would ruin their business but say demand has skyrocketed since. (ABC Goldfields: Macey Turner)\n\nGuides booked out\n\nGreg and Liz Watson own a company that operates guided prospecting camps about 60 kilometres north of Leonora.\n\nMs Watson said the demand for their tours was insatiable this season.\n\n\"We've had to expand the amount of people we have on the tours,\" she said.\n\n\" This year I'm turning away six to 10 people a day, at least. \"\n\nGreg and Liz Watson's tour clients come from near and far to have a go at prospecting. (ABC Goldfields: Macey Turner)\n\nDespite the obvious demand, the pair said running a gold tourism business involved more than just teaching people how to find the shiny stuff.\n\n\"They have to be cut out for it, because you're dealing with so many people,\" Mr Watson said.\n\n\"Anyone coming into it needs to really have a serious look at it.\n\n\"You need to have full insurance, you need to be accredited in some way.\"\n\nVicky Smith says she loves being in the outback. (ABC Goldfields: Macey Turner)\n\nGold not the only goal\n\nVicky Smith went on her first tour with the Watsons in 2023 and said she enjoyed the isolation and open landscape more than the idea of finding gold.\n\nSo when Greg and Liz Watson needed an assistant she traded in her child protection job for a six-month stint in the red dirt.\n\n\"It's lovely to be out here,\" she said.\n\n\" This is just a completely different world. \"\n\nChris MacGregor says the gold in his hand is the fruit of four years of prospecting. (ABC Golddfields: Katrina Tap)\n\nDespite an almost lifelong commitment to combing through the scrub in WA's gold country, Mr MacGregor and his detector – affectionately dubbed the \"Wailing Wand\" – are yet to hit the jackpot.\n\n\"It's a very rare thing to come by — you've got to put in the time,\" he said.\n\nMr MacGregor said finding gold was only part of the joy of prospecting.\n\nHe said he would keep sleeping in his swag under the stars for as long as he was able.\n\n\"Don't do it for the gold — come for everything else that's out there,\" Mr MacGregor said.\n\n\" If you get some gold, it's a bonus. \"\n\nProspectors often search by themselves in isolated locations without phone reception. (ABC Goldfields: Macey Turner)\n\nSafety the priority\n\nMr Allison said tourists hoping to strike it lucky were welcome in the region, but stressed that safety should be the number one priority.\n\n\"We've seen many, many cases over the years of prospectors getting lost and perishing, and they're found within 50 metres of their vehicle,\" he said.\n\nLast year the bodies of a father and son were found after they went missing while prospecting in the Murchison region.\n\nPersonal locator beacons are a vital piece of prospecting equipment. (ABC Goldfields: Macey Turner)\n\nThe body of Vietnam veteran William Wadsworth was also found last year, months after he went missing while prospecting near Norseman.\n\nMr Allison said water, food, shelter and a personal locator beacon were indispensable for prospectors, who should also let people know of their plans.\n\n\"It doesn't matter if you're overprepared,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/lorde-making-new-album-virgin-femininity-gender-identit/105462950",
        "title": "'I was trying to make an album that didn't lie': Lorde on her raw new record",
        "publish_date": "Thu, 26 Jun 2025 22:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Lorde seems to have emerged into her final form.\n\nWe first met the New Zealand sensation at the tender age of 16 when she she exploded into the Zeitgeist with 'Royals'. From there, we've seen her explore her identity through each release like a different set of clothes in her wardrobe.\n\nShe's been the dark pop girlie, the up-all-night club kid, and the barefoot free spirit.\n\nNow, ahead of her fourth album, Virgin, she has once again emerged from the proverbial chrysalis. But instead of debuting a flashy new look, she's stripped everything back — clean, vulnerable, exposed, virginal.\n\n\"I was really trying to make an album that didn't lie in the instrumentation, in the language, in the feeling,\" Lorde told triple j Mornings' Lucy Smith.\n\n\"I've made work in the past that were sort of dramatising it as the point and pumping up the saturation on the colours and that's so sick. But I really felt with this one that there was something very… plain and true that needed to come, something pure.\"\n\nLorde's Virgin covers themes of womanhood, intimacy and gender fluidity. (triple j)\n\nLorde's taking it back to her roots in every sense of the word. She's physically returned to a version of herself she hasn't experienced for more than a decade.\n\nShe's lyrically displayed her thoughts and feelings without a mask. And she's spiritually reached back into the line of women that came before her, who made her who she is today.\n\n\"I really thought about my mum [when] making this album,\" she said.\n\n\"I thought a lot about what comes before us, as women, the lineage that reaches up above us and shapes us. I understood my mum a lot more through making this album.\"\n\nThere's an abruptness to Virgin, where Lorde lays it all out on the table for the world to see. Launching this new era with an X-ray of herself was merely the beginning of this up-front energy, which she credits to wanting to honour her teenage self.\n\nLoading Instagram content\n\n\"When I think about being a teenager, I think of a crudeness, a sort of lack of refinement,\" she said.\n\n\"I think of these big swings of emotion, these sort of big surges, and I think of this toughness and 'my way'-ness. And also, this deep vulnerability.\n\n\"You're on the precipice of great change. You're leaving something behind, you're gaining something else. Just as I came into myself and my body in this new way.\"\n\nLorde's newness of herself comes down to the personal decision of stopping birth control; the IUD we see in the X-ray scan.\n\n\"The little yellow pill I took every morning for thousands of mornings since I was 15, I stopped taking it five days ago. Gonna see how it goes,\" Lorde wrote in her September 2023 newsletter.\n\nRight as the 28-year-old teeters on another of life's precipices — her Saturn return — she made the decision to change herself at a cellular level, allowing her body to revert to its rawest form.\n\nAnd with that change come significant shifts in hormones, her understanding of herself, her identity. It's this exact renewal that she opens Virgin with, singing on the first track, 'Hammer':\n\n\"There's a heat in the pavement, my mercury's raising Don't know if it's love or if it's ovulation When you're holding a hammer, everything looks like a nail\"\n\nLoading Spotify content\n\n\"For me, ovulating for the first time in 10 years kind of felt like how that opening synth sounds,\" she said.\n\n\"Very raw. Something very kind of pure and crazy pumping through your system. There was also something kind of macho in a way, just the strength, the physical strength in my body was completely different.\n\n\"I lift weights, and it was crazy when I would ovulate — it's sort of more chill now — but when I was first coming off birth control, I would be able to lift significantly more.\"\n\nWriting in such an up-front manner is a big shift for Lorde, considering 2021's Solar Power was \"cloaked in metaphor and imagery\", as she told Smith, and the ecstasy-soaked energy of her much-loved 2017 release, Melodrama.\n\nLorde's Solar Power is a mellow detour from an artist that once defined a decade Photo shows The alternate cover to Lorde's 2021 album Solar Power Inspired by Mother Nature and willingly out-of-touch with pop trends, Lorde's third album won't define an era. But that's the point.\n\nOn Virgin, she was determined to turn the harsh fluorescent lights on to pick herself apart wholly.\n\nInspired by reading the works of plain-writing women (in a 2023 newsletter, she noted reading Sheila Heti, Renata Adler, Olga Tokarczuk and Molly Giles), Lorde wanted to be as courageous as these women are with their words.\n\nNo sugar-coating, no crypticism, just seeing \"the body in its grotesque beauty\".\n\nOne artist Lorde drew inspiration from while creating Virgin was British artist Tracey Emin, specifically her 1995 work, Everyone I Have Ever Slept With 1963 — 1995 (which was destroyed in a warehouse fire in 2004).\n\nThe exterior of Everyone I Have Ever Slept With 1963-1995, also known as The Tent. (Supplied: Saatchi Gallery)\n\n\"It’s this beautiful, kind of intimate work,\" says Lorde. (Supplied: Saatchi Gallery)\n\nThis piece was the background on Lorde's laptop while she built the album — it's influence perhaps most evident on third track 'Shapeshifter' — as a reminder of the kind of unflinching art she wanted to create.\n\n\"Her works are just this unsparing femininity,\" Lorde says.\n\n\"It was such a game-changer in the art world. That work really struck me. It's this kind of pop-tent that's embroidered with the names of everyone she's ever slept with, whether it was hooked up or just shared a bed with.\"\n\nEmbracing her own gender fluidity\n\nThe overarching theme of Virgin is Lorde's deep exploration of her gender and femininity. In the process of stripping herself back, Lorde discovered:\n\n\"I was beginning to understand that my gender was more expansive than I had thought.\"\n\nIn the album's second single, 'Man Of The Year', we meet Lorde at this realisation point, sparked by feeling out of place at the GQ Man Of The Year awards.\n\n\"I wore this basic hot-girl outfit, my hair really looked like a girl, and I felt all wrong all night,\" she told Smith.\n\n\"This is a night where I'm a man, like I'm supposed to be with them. I really felt this wrongness.\n\n\" I'm a woman, but there's masculinity within that. Deep masculinity. \"\n\nLoading TikTok content\n\nWritten at a time when she was going to the gym, gaining strength, and broadening out in her arms and shoulders, Lorde challenges both her and our understanding of modern femininity with Virgin.\n\nWhile she credits her mother and grandmother as being \"the blueprint\" for her, she also pushes the envelope to explore what it means to be an unafraid, unapologetic woman in 2025.\n\n\"I think a lot of women have this conditioning to want to look… to want to be the smallest possible version of themselves,\" she said.\n\n\"It took me a second to be like, 'What if we didn't do that? What would surrendering to becoming whatever size you're supposed to become do to your life? What would that feel like, if you could be brave and let that happen?'\n\n\"It's very cute\" Lorde reflects on her breakthrough hit 'Royals' The pop royalty also tells us she's back home in NZ working on \"bits and pieces\" of new music.\n\n\"The answer is that amazing stuff happens. I couldn't be more of an advocate of letting yourself become yourself, all the way, come what may. You truly have to surrender to it. You don't know what that's gonna look like, but it's gonna be good.\"\n\nAs Lorde reflects on her maternal lineage, she's also forging ahead with her own divine feminine — one who's confident to reveal her whole self. Unadulterated, unfiltered, unflinching.\n\n\"My mum's such an incredible woman,\" she said.\n\n\"She really is like the blueprint for who I am. And her pain is my pain, and her peace is my peace and her grandmother's and all this.\n\n\"So I really had that sense of us all being together.\"\n\nVirgin is out now.\n\nHear Lucy Smith hosting Mornings on triple j from 9am Monday to Friday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/nrl-selwyn-cobbo-brisbane-broncos-dolphins/105467872",
        "title": "Out-of-favour Bronco Cobbo signs with Dolphins",
        "publish_date": "Fri, 27 Jun 2025 00:35:05 +0000",
        "category": "sports",
        "authors": [],
        "text": "Selwyn Cobbo has signed a one-year deal with the Dolphins after the star back fell out of favour at the Brisbane Broncos.\n\nCobbo had slid down the pecking order under coach Michael Maguire at the Broncos this season.\n\nHe was dropped from the NRL side after a big loss to Manly in May and is in the final season of a deal worth an estimated $625,000 annually.\n\nPanthers Origin star avoids sanction after epic win over Bulldogs Photo shows Four Panthers NRL players stand together during a break in play. Brian To'o is in the clear, despite being placed on report for a high shot in the Panthers' tense 8-6 defeat of the ladder-leading Bulldogs.\n\nThe 23-year-old will join the Broncos' cross-town rivals next season.\n\nCobbo is set to link up with the Redcliffe-based club in November.\n\nDolphins chief executive Terry Reader poured cold water on the prospect while addressing reporters on Thursday, before announcing the deal on Friday morning.\n\n\"The Dolphins have always said we are about continuing to build a roster that will make us one of the top teams in the NRL,\" Reader said.\n\n\"Selwyn is an accomplished player who has done some amazing things at both Origin and NRL level already.\n\n\"But we believe he has untapped potential to go to even greater heights in our game and are excited about what he can do in a Dolphins jersey.\"\n\nCobbo, a six-time Queensland State of Origin representative, made his Test debut in 2023.\n\nHe first appeared in the NRL in 2021 and has scored 48 tries in 80 appearances for the Broncos.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/five-horror-drs-decisions-west-indies-fuming-australia/105467408",
        "title": "'Flabbergasted': The decisions that went against the West Indies",
        "publish_date": "Fri, 27 Jun 2025 00:23:59 +0000",
        "category": "sports",
        "authors": [],
        "text": "There may have been silence in the commentary box, but what was not being said may as well have been screamed at maximum volume.\n\nAnother hugely contentious decision had gone against the West Indies.\n\nYou could almost hear veteran commentator Ian Bishop carefully selecting what he was going to say.\n\n\"There are not many fans of [third umpire] Adrian Holdstock in the West Indies at the moment,\" former West Indies player Carlos Brathwaite said, in the end, as Shai Hope trudged off after being given out caught behind.\n\n\"Flabbergasted.\"\n\nFlabbergasted, incredulous, furious: take your pick, most West Indian fans could have selected any one of those emotions to describe what they were feeling at that time.\n\n\"It's unfortunate, it really is unfortunate,\" Samuel Badree said, somewhat more diplomatically on ESPN.\n\n\"It feels as though everything has gone against the West Indians.\"\n\nIn less enlightened times, such a feeling would have likely resulted in something of a siege at the Kensington Oval — it was only 1999 that an ODI between Australia and the West Indies was delayed by hundreds of bottles being thrown onto the field after a controversial run-out, after all.\n\nCricket is a serious business in these parts.\n\nThere was none of that on day two of the first Test in Barbados, thankfully, but there were plenty of aggrieved supporters nonetheless.\n\nThe West Indies were, undoubtedly, on the end of some very poor decisions.\n\n\"I felt like the third umpire had some really tough decisions to make,\" former Australian player Greg Blewett said on ESPN.\n\n\"A lot of them weren't really clear decisions; it was down to a bit of interpretations.\n\n\"I think Australia got on the right end of the decisions.\n\n\" It was a tough day for the third umpire. \"\n\nNot just a tough day, though.\n\nHere is a rundown of the events that sparked the controversy.\n\n1. Travis Head's day one reprieve\n\nTravis Head led Australia's recovery before lunch. (AP Photo: Ricardo Mazalan)\n\nAs Travis Head rescued Australia on day one, he under-edged the superb Shamar Joseph behind to Shai Hope.\n\nHope dived forward and caught the ball but did not seem totally clear as to whether he had managed to pouch the ball before it touched the ground.\n\nThe matter was sent upstairs to third umpire Holdstock, who said there was \"no clear evidence\" that the ball had been caught.\n\nThat despite footage appearing to show a thin sliver of leather under the ball as it landed.\n\nIt was a tough break for the West Indies and Shamar Joseph, who missed out on a five-wicket haul as a result.\n\n\"The thing for me was, the pictures look out, but there was a statement made from the third umpire that it was not conclusive,\" Carlos Brathwaite said.\n\n2. Roston Chase gets lucky\n\nHazlewood was upset he did not get the decision in the first over of the second day's play. (AP: Ricardo Mazalan)\n\nIn the first over of day two, Josh Hazlewood trapped Roston Chase in front.\n\nThere was a big appeal and, belatedly, Pat Cummins reviewed the decision.\n\nUpstairs, we went to see if the ball brushed the pad before hitting the inside edge of the West Indian captain's bat.\n\nInitially, a small spike suggested that the ball did brush the pad first and Australia's fielders started celebrating.\n\nThat celebration turned to confusion soon after as Holdstock said on-field umpire Richard Kettleborough could stay with his on-field decision of not out.\n\nLater, reserve umpire Gregory Brathwaite could be seen explaining something to the Australian reserve fielders, suggesting it was a narrow decision.\n\n3. Roston Chase's luck runs out\n\nChase's review was unsuccesful despite appearing to edge the ball onto his pad. (AP: Ricardo Mazalan)\n\nIf he was lucky earlier, Chase was very unlucky later on day two.\n\nPat Cummins appealed for an LBW and, as soon as Kettleborough raised his finger, Chase instantly reviewed, looking at his inside edge.\n\nThe replay showed that yes, Chase got an inside edge onto his pad, a very clear deviation.\n\nThe technology, namely ultraedge, did not quite match up, but surely that would not matter — there was a visible deflection off the bat.\n\nRight? Right?\n\n\"There is a clear gap between bat and ball,\" said Holdstock. Uh oh…\n\n\"You can see with the naked eye … that there was a clear deflection,\" Brathwaite said.\n\n\"So, albeit that the technology might have left you wondering, the naked eye shows you that there was a deflection.\"\n\n4. Shai has his hopes of a half century dashed\n\nHope's dismissal was the second big umpiring decision to go against the West Indies on day two. (AP: Ricardo Mazalan)\n\nThings then went from bad to worse.\n\nShai Hope, West Indies' last real chance of success, was caught spectacularly by Alex Carey off an inside edge from Beau Webster.\n\nIt was a remarkable catch but umpire Kettleborough instantly wanted to have a closer look to see if the ball had been grounded.\n\nHope had, by this time, started walking off, convinced that Carey had pulled off a worldy.\n\nAnd he had been diving to his left and pouching the ball in his left glove. However, sadly for him, the ball clearly touched the ground as Carey landed — the footage even showed it moving closer into the glove's palm as he landed.\n\nSo not out? Yeah, about that…\n\nThe catch was confirmed by Holdstock and the West Indian supporters were fuming.\n\n\"It looked brilliant,\" Brathwaite said. \"Alex Carey, tip your hat. But when you look at it zoomed in, you can't tell me that that was out and the first one [Head on day one] was not.\"\n\n5. Green's lucky reprieve\n\nSo, all things considered, it has not been a great day for the third umpire so far.\n\nBut his day was not done.\n\nWindies thrive on Hope as he and Chase lead recovery against Australia Photo shows Roston Chase plays a shot Amidst DRS calamities and yet more dropped chances in the slips, Shai Hope springs eternal, the West Indies fighting hard to earn a first Test win against Australia on home soil in 22 years.\n\nCameron Green was trapped in front by Justin Greaves, the West Indies appealing vociferously as they kept the Aussies under the cosh.\n\nUmpire Nitin Menon gave Green not out but Chase opted to send it upstairs.\n\nThere was a big edge from Green, but was there a brushing of ball on pad before it got to the bat?\n\nNot clear enough for third umpire Holdstock and the tightest call of the lot was given not out.\n\n\"You can't tell me that Roston Chase is out, and this is not out,\" Brathwaite said.\n\n\"You can see the bat brushing the back pad so for the ball to hit the bat, it has to brush the back pad.\n\n\"Regardless of if they're all bad decisions or some right, there was a lack of consistency and I'm sure that a lot of West Indies fans, players and myself, felt aggrieved during the course of play.\"\n\nWhat did Australia say?\n\n\"We can only ask the question,\" Mitch Starc said by way of response on ESPN.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\n\"There were a few there, one went against us but a couple against the West Indies. I guess that's what we've got the technology for and then the questions can be asked of that and not the players.\"\n\nBishop added that he did not want to criticise the umpires, but that he hoped some good could come from the decisions.\n\n\"Officiating is low-hanging fruit,\" Bishop said.\n\n\"What needs to happen here, when I put my emotions aside, the umpires perhaps need, and they probably do have a meeting after the day's play, they will review these decisions and I think we may get better interpretations … you have to get that going forward.\n\n\"I think they would probably have learned a few things [by] looking at that.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/nsw-westmead-hospital-interventional-radiologists-resign/105467494",
        "title": "Group of radiologists collectively resign from troubled Sydney hospital",
        "publish_date": "Fri, 27 Jun 2025 00:13:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "The entire group of interventional radiologists at the troubled Westmead Hospital have resigned after lengthy negotiations with hospital executives failed to reach a resolution.\n\nInterventional radiologists are critical doctors who perform a broad range of procedures and are essential for major and trauma surgeries.\n\nThe group have now collectively resigned and Westmead Hospital is faced with the prospect of having no interventional radiology services from July 8 unless it can come to an agreement.\n\nOne doctor, who spoke to the ABC on the condition of anonymity because they are not authorised to speak publicly, said without interventional radiologists the hospital would struggle to run a range of essential services, like trauma surgeries and high-end obstetric care.\n\nAnother doctor who spoke to the ABC said the team of 10 interventional radiologists tendered their resignations around two weeks ago after raising concerns for over four years.\n\nThe ABC was told the decision for the doctors to tender their resignations was not made lightly.\n\n\"This is not just radiology,\" the doctor said.\n\n\" This is emblematic of what exists at the hospital. It's a big problem hiding in plain sight. \"\n\nThe interventional radiologists had been negotiating over what they argue is outdated equipment in their department and pay which they say does not reflect their expertise or the stress of their job.\n\nIt is understood the unit has two dedicated angiography machines, which are designed to take pictures of blood vessels, but both are over 15 years old. One of them has broken down.\n\nWestern Sydney Local Health District (WSLHD) has been contacted for comment.\n\nOn Thursday, Western Sydney Local Health District chief executive Graeme Loy stepped down. (Four Corners: Nick Wiggins)\n\nHealth district chief executive Graeme Loy on Thursday stepped down from his role, hours before a scheduled meeting that was to hold a vote of confidence relating to allegations of poor patient safety and delayed cancer diagnoses at Westmead Hospital.\n\nThe week prior, head of the gastroenterology department Jacob George, who had raised concerns with management, was dismissed, with one senior doctor saying it was retaliation for speaking out.\n\n\"For many years we have been struggling to have our concerns listened to, and the executive has been aware,\" the doctor, who also spoke on the condition of anonymity, told the ABC.\n\nMinns concerned about 'changes' at Westmead\n\nSenior staff also said they raised concerns for years about clinical wait times for routine scans that could detect preventable cancers. Some patients had waited up to three years.\n\nThe ABC understands wait time impacted screenings in departments including cardio, renal, dermatology and gastroenterology.\n\n\"It's a major risk and it's something we shouldn't be letting people down on,\" one of the anonymous doctors said, adding that delays could mean hundreds of patients who have cancer could receive late diagnoses or remain in the dark about their disease.\n\nNSW Premier Chris Minns said he was concerned about \"changes\" at Westmead and expected \"better outcomes\".\n\n\"We'll await the review but [Health Minister] Ryan Parks' track history when it comes to these frontline health issues is to take on what is said by senior doctors, senior nurses … and make decisions to strengthen it,\" he said.\n\nThe premier said while he would not rule anything out, an inquiry into wait times would be the slower option.\n\n\"We are doing an investigation … but ultimately your taxpayer, your average citizen would expect a better service,\" he said.\n\n\"The shortest distance between A and B, between where we're at today and an improved service is the one we'll take, and if that can be done internally that's what we'll do.\"\n\nDemand to meet health minister\n\nA letter sent to hospital staff by Westmead Medical Staff Council deputy chair Jenny King said this was a particular concern \"for those patients with a positive faecal occult blood screen\".\n\nOvernight, a delegation of about 200 doctors passed a motion to demand the opportunity to meet with Mr Park about their concerns.\n\n\"The issue of failure to provide care for those patients at high-risk malignancy has long been documented,\" Dr King wrote.\n\nNSW president of the Australian Medical Association, Kathryn Austin, said the issues were symptomatic of a lack of investment in staffing at public hospitals.\n\n\"It's a sad state of affairs that it's come to this point and the clinical concerns haven't been addressed,\" Dr Austin said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/golf-minjee-lee-min-woo-detroit-pga-tur/105467658",
        "title": "Major winner Minjee Lee inspires brother Min Woo at Detroit PGA Tour event",
        "publish_date": "Thu, 26 Jun 2025 23:55:09 +0000",
        "category": "sports",
        "authors": [],
        "text": "Min Woo Lee has lauded his major-winning sister Minjee after returning to form with a first-round 63 at the PGA Tour event in Detroit.\n\nLee had equalled what was the course record at the Detroit Golf Club, making a fantastic start in a bid to lift a second PGA Tour title this year.\n\nHe finished the day in a three-way tie for third on 9-under-par, one shot off the pace, after American Kevin Roy and South African sensation Aldrich Potgieter both bettered Lee's scores with 10-under 62s.\n\nLee received a surprise pep talk from older sister Minjee following her third major championship success in the Women's PGA in Texas earlier in the week.\n\n\"Normally, she doesn't check up on me, but it was actually quite nice to get a call from her,\" Lee said.\n\n\"I was like, 'Did you butt dial me? What's going on?'.\n\n\"She's like, 'No, I just wanted to check in'. I was like, 'Oh, OK'. She's awesome.\n\nMinjee Lee wins third career major with PGA Championship triumph Photo shows GettyImages-2221552635 Australian Minjee Lee wins the third golf major of her career, claiming the Women's PGA Championship by three shots in Texas\n\n\"I think she had a bit of a night on Sunday with a few of her friends.\n\n\"I think they all had a week off this week, so it's good to see her in a nice mental space and happy on the course.\n\n\"She was going through a tough patch the last couple of years, so it's nice to see her have her swagger back.\n\n\"I don't think she learns that much off me. I try to learn off her. She's just a beast when she's playing good.\"\n\nLee, starting on the back nine, opened with a birdie and a bogey on Friday AEST, before beginning a spectacular run that featured nine birdies over the next 16 holes.\n\nHis three straight birdies to finish the round left him tied for third with US pair Mark Hubbard and Max Greyserman.\n\nLee has struggled since his victory in the Houston Open in March, missing the cut at both the PGA Championship and US Open.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/anna-wintour-defining-tenure-as-us-vogue-editor-ends/103886380",
        "title": "How Anna Wintour redefined fashion over almost 40 years",
        "publish_date": "Thu, 26 Jun 2025 23:51:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "As US Vogue editor-in-chief, Dame Anna Wintour forever changed the fashion industry. But her enigmatic leadership saw her influence stretch beyond the magazine's pages.\n\nFor years, Dame Anna Wintour was an impenetrable force.\n\nIn the front row of any fashion show that mattered, Wintour watched the runway, her eyes shielded from nervous designers whose livelihoods depended on what she printed.\n\nShe transcended the realm of fashion to become an icon in her own right – thanks in part to a helping hand from Hollywood.\n\n\"Across more than three decades' worth of issues of Vogue and its spinoffs, she has defined not only fashion but also beauty standards, telling millions of people what to buy, how to look, and who to care about,\" wrote fashion journalist Amy Odell in Anna: The Biography.\n\nBut even Odell, who interviewed hundreds of people about Wintour, was taken aback at the complexity of her subject.\n\n\"People couldn't agree on many things about her, including whether she's an introvert or an extrovert, ruthless or just very demanding,\" Odell said on reflection.\n\n\"I couldn't get a consensus.\"\n\nNow, as she steps down as editor of US Vogue after almost 40 years in the role, one thing seems clear: her legacy is as astonishing as her rise.\n\nLike father, like daughter\n\nJournalism was omnipresent in Wintour's upbringing.\n\nHer father, Charles, was the editor of the British newspaper The Evening Standard.\n\nCharles Wintour was the editor of the Evening Standard for over a decade. ( )\n\nThe Evening Standard office on election night in 1959. ( )\n\nWintour's mother, Eleanor \"Nonie\" Baker, was also a reporter for a brief period.\n\nTwo of their five children would go on to work in media – Anna at Vogue, with her younger brother Patrick becoming The Guardian's diplomatic editor.\n\nEven her stepmother, Audrey Slaughter, was a pioneering magazine editor.\n\nAs a respected newspaper editor, her father's leadership style earned him the nickname \"Chilly Charlie\".\n\n\"He came from quite a Victorian upbringing, I'm not sure his mother ever spoke to him,\" Wintour recalled in the landmark documentary The September Issue.\n\n\"He was also very private and very, in some ways, inscrutable.\"\n\nIt was her father who decided his daughter should work in fashion.\n\n\"I can't remember what form it was I had to fill out. Maybe it was an admissions thing. At the bottom it said 'career objectives' and I said 'What shall I do? How shall I fill this out?'\n\nAnna Wintour. ( )\n\n\"And he said, 'Well, you write that you want to be the editor of Vogue, of course.'\"\n\nWintour came of age in the 60s amid miniskirts, the pill and Beatle-mania.\n\n\"Growing up in London in the 60s, you'd have to be walking around with Irving Penn's sack over your head not to know something extraordinary was happening in fashion,\" she once said.\n\nPredictably, she worked in a clothing boutique and enrolled in fashion classes.\n\nUnpredictably, she quickly dropped out.\n\nJerry Oppenheimer, who authored the unauthorised biography Front Row, wrote that Wintour's attitude at the time was: \"You either know fashion or you don't.\"\n\nIt was in the 70s when she would get her foot in the door, becoming one of the first editorial assistants of Harper's & Queen.\n\nA young Anna attends a Yves Saint Laurent show in 1972. ( )\n\nBut London was never the end goal.\n\nAfter moving to New York City, she became a junior fashion editor at Harper's Bazaar in 1975 – but was fired nine months later.\n\nShe scored a job at Viva before the publication went bust only years later, then became the fashion editor for a new magazine called Savvy.\n\nBy the early 80s, she became the fashion editor at New York magazine.\n\nBut Condé Nast came calling, and two years later she joined the media giant as Vogue's first creative director.\n\n'Nuclear Wintour'\n\nWhen Wintour joined Vogue, Grace Mirabella had been editor-in-chief for 12 years.\n\nShe loved the colour beige, and incorporated it in both her wardrobe and office decor.\n\nGrace Mirabella at the Yves Saint Laurent couture show in 1974. ( )\n\nGrace Mirabella at Paris Fashion Week in 1972. ( )\n\nGrace Mirabella sitting front row alongside Countess Consuelo Crespi. ( )\n\nBut Wintour's arrival wasn't the first time these two titans had met.\n\nBack when Wintour was making her mark at New York magazine, one of Mirabella's fashion editors, Polly Mellen, organised a meeting between the pair.\n\nVogue was doing the numbers, but could Wintour give it some extra spice?\n\nThe meeting came to an abrupt end when Mirabella asked her what job she would like at Vogue, to which Wintour replied: \"Yours.\"\n\nThe newly established role of creative director came with a layer of vagueness, which Wintour used to her advantage.\n\nShe was second in command, tasked with \"enriching the looks of the pages\".\n\nIn her memoir, Mirabella wrote that Wintour would \"go behind my back and redo layouts, bringing new art, circumvent me and my fashion editors\".\n\nShe described Wintour's tenure under her as \"a very bizarre three years during which Anna created a kind of office within the office, working with Alex Liberman, with fashion editor Polly Mellen, with Jade Hobson, and against me\".\n\nAnna Wintour and Condé Nast owner SI Newhouse party in 1990. ( )\n\nTwo years after joining Conde Nast, Wintour took over British Vogue when Beatrix Miller retired in 1985.\n\nAs editor she replaced multiple staff members and exerted more control than any of her predecessors.\n\nLike her father, she earned a frosty nickname – \"Nuclear Wintour\".\n\nYears later, she would address the label in a rare interview with 60 Minutes.\n\n\"If I'm such a bitch then they must really be a glutton for punishment, because they're still here,\" she said.\n\n\"If one comes across as sometimes being cold or brusque, it's simply because I'm striving for the best.\"\n\nIn 1987, Wintour returned to New York City with the task of revitalising Home & Garden in a bid to compete with rival publication Architectural Digest.\n\nShe reportedly cancelled $2 million worth of shoots in her first week, and made the publication nearly unrecognisable to readers after shortening the title to HG.\n\nSubscriptions declined. Advertisers pulled out.\n\nWhile some would be shown the door, gossip columnists proclaimed Wintour had \"failed upwards\".\n\nBecause try as she might to ignore the constant swirl of rumours, Mirabella's own demise was hurtling towards her.\n\nBy the late 80s, Mirabella was perceived as \"out of step with the times\" as the younger, fresher Elle magazine gained ground.\n\nIn 1988, Conde Nast owner Si Newhouse sensationally ousted Mirabella.\n\nInstantly, Wintour was the editor of Vogue.\n\nThe winds of change\n\nWintour's first Vogue cover made history for one clear reason – the model was wearing jeans.\n\nNovember 1988 marked Anna Wintour's first issue as Vogue editor. ( )\n\nHer debut featured model Michaela Bercu walking in the New York City sunlight, her eyes nearly closed as the wind fanned her blonde hair around her smiling face.\n\n\"It was so unlike the studied and elegant close-ups that were typical of Vogue's covers back then, with tons of makeup and major jewelry. This one broke all the rules,\" she reflected in Vogue in 2012.\n\nThe cover was so different from previous issues that the magazine's printers called asking if there had been a mistake.\n\n\"I had just looked at that picture and sensed the winds of change. And you can't ask for more from a cover image than that,\" she wrote.\n\nOne of Grace Mirabella's last Vogue issues from 1988. ( )\n\nWhile supermodels such as Cindy Crawford, Linda Evangelista and Christy Turlington regularly graced the cover of Vogue, Wintour ushered in an era of celebrity worship.\n\n\"Anna saw the celebrity thing coming way before everybody else jumped on that bandwagon,\" Vogue's then creative director Grace Coddington said in The September Issue.\n\n\"And, you know, whilst I hated it, I'm afraid I have to admit she was right.\"\n\nAs Vogue editor, Wintour earned a reputation for being as inscrutable as her father – or perhaps more.\n\n\"I think she enjoys not being completely approachable,\" Coddington said.\n\n\"Just her office is very intimidating. You have to walk about a mile into the office before you get to her desk. And I'm sure it's intentional.\"\n\nGrace Coddington and Anna Wintour attend Calvin Klein's 1997 ready-to-wear show. ( )\n\nGrace Coddington and Anna Wintour view a Marc Jacobs collection in 1994. ( )\n\nLike Coddington, André Leon Talley worked alongside Wintour for decades as the magazine's editor-at-large.\n\n\"She is not a person who is going to show you her emotions – ever,\" he said in The September Issue.\n\n\"She's like a doctor, she's looking at your work. It's like a medical analysis. Some of us can't cope with that. We need to be loved.\"\n\nAnna Wintour and Andre Leon Talley in 1996. ( )\n\nWintour has previously admitted she was not academically successful, revealing perhaps she spent \"a lot of my career trying to make up for that\".\n\nBut she is certain about one piece of advice she learnt from her father.\n\n\"People respond well to someone who is sure of what they want.\"\n\n'Sheer brute force'\n\nAt Vogue, Coddington and Talley each had complicated relationships with Wintour.\n\n\"I know when to stop pushing her. She doesn't know when to stop pushing me,\" Coddington said.\n\nIn his memoir, published two years before his death, Talley detailed the breakdown of their relationship after Wintour retired him as the Met Gala's live stream correspondent and instead bestowed the role to a YouTuber.\n\n\"I have huge psychological scars from my relationship with this towering woman who can sit by the queen of England, on the front row of a fashion show, in her dark glasses and perfect Louise Brooks clipped coiffure, framing her Mona Lisa mystery face. Who is she?\" he wrote.\n\nQueen Elizabeth II joined Anna Wintour at Richard Quinn's 2018 show in London. ( )\n\n\"What drives Anna is a sense of her own ability to survive as a powerbroker, with sheer brute force, and to sustain an extraordinary level of success.\"\n\nPraise from Wintour wasn't entirely unattainable – but it was concise.\n\nHer seal of approval on the final copy of Vogue articles was a Post-It stuck to the bottom of a printout simply reading \"AWOK\" – Anna Wintour OK.\n\n\"Whisper the phrase, 'You've been Awok'd' into the ear of an unsuspecting Vogue staffer, and he or she is likely to breathe a heavy sigh of relief, or maybe even bust out a happy dance, with hands raised in the air,\" Vogue writer Chioma Nnadi revealed in 2017.\n\nAWOK or not, one of Wintour's former assistants turned her experience into a novel, with Laura Weisberger writing The Devil Wears Prada in 2003.\n\nThe novel, which follows a young woman hired as the assistant to a demeaning and demanding fashion editor – became a best seller and inspired the film of the same name.\n\nWhen the elevator doors slid open to reveal Meryl Streep as the frosty editor, complete with dark sunglasses and pursed lips, it solidified Wintour's icon status in the pantheon of pop culture.\n\nThe first Monday in May\n\nThe Met Gala as we know it today wasn't always the biggest night on the fashion calendar, nor did it garner more attention and cultural significance than the Academy Awards.\n\nIn its first incarnation, the Met Gala was a simple midnight supper for New York's elite held in a bid to raise money for the Metropolitan Museum of Art's struggling Costume Institute.\n\nThe event started in the 40s with socialite Eleanor Lambert as its driving force.\n\nDiana Vreeland and Yves Saint Laurent at the 1983 Met Gala. ( )\n\nCher and designer Bob Mackie in 1985. ( )\n\nDiana Vreeland's 10th Met Gala in 1981. ( )\n\nBut it was brought to life in spectacular fashion in the 70s by then-Vogue editor Diana Vreeland.\n\nThe Met Gala gauntlet was then passed to Wintour in 1995, seven years into her tenure.\n\nUS media have reported she will remain as editorial director at Vogue and global chief content officer at Conde Nast.\n\nIt's unknown yet how this news could affect her legacy at the Met Gala.\n\nZendaya attends the Met Gala in 2024. ( )\n\nUnder Wintour, the Met Gala embraced celebrity culture more than ever before.\n\nAndre Leon Talley described the event as \"the Super Bowl of social fashion events\" through the way it brings together the biggest names from sport, politics, business and social media.\n\nWhile tickets once cost $50, brands now fork out hundreds of thousands of dollars to book a single table.\n\nUndoubtedly, Wintour transformed the Met Gala as a money-making machine for the Costume Institute, Vogue and the industries it feeds.\n\nIn her role at the helm of the Met Gala, Wintour has raised over $US250 million for the Costume Institute.\n\n\"It just grew over the years. I can't pretend there was a grand plan or a grand strategy,\" she once said.\n\nOver the course of her record tenure, Wintour came under fire for what featured in the pages of Vogue and what didn't.\n\n\"Nobody was wearing fur until she put it on the cover in the early 1990s\", Vogue's Tom Florio once said.\n\n\"She ignited the entire industry.\"\n\nWintour was frequently targeted by animal rights groups for making fur fashionable and said she had \"lost count\" of the amount of times she had been physically attacked by activists.\n\nAfter a tofu pie was lobbed her way outside a Chanel show in Paris in 2005, she was asked what she would do following the incident and reportedly replied: \"Wear more fur.\"\n\nAnna Wintour at New York Fashion Week in 2012. ( )\n\nWintour's remarks around weight also caused controversy on more than one occasion.\n\nAndre Leon Talley revealed on the Oprah Winfrey Show that Wintour had demanded he lose weight.\n\n\"Most of the Vogue girls are so thin, tremendously thin, because Miss Anna don't like fat people,\" he said.\n\nIn The September Issue, after Coddington asks the documentary's camera operator to be involved in one of the glossy spreads, Wintour told him he they would need to photoshop his stomach.\n\nBut it was in the summer of 2020 when Conde Nast faced a reckoning.\n\nAfter George Floyd's death at the hands of police sparked nation-wide unrest and protests, she apologised to staff for \"publishing images or stories that have been hurtful or intolerant\".\n\nIn the company wide memo, Wintour admitted there were too few employees of colour and took full responsibility for mistakes made.\n\n\"I want to say plainly that I know Vogue has not found enough ways to elevate and give space to black editors, writers, photographers, designers and other creators.\"\n\nWhen her father, Charles, retired from newspaper publishing, she asked why he was leaving.\n\n\"He was obviously so passionate about what he was doing, and he said 'Well, I get too angry,'\" she said.\n\n\"So I think when I find myself getting really, really angry that it might be time to stop.\"\n\nAnna Wintour is seen, outside Gucci, during Paris Fashion Week Womenswear Spring/Summer 2019, on September 24, 2018 in Paris, France. ( )\n\nWintour's replacement is yet to be announced.\n\nYet she is likely the last of her kind.\n\nAnna Wintour is seen, outside Gucci, during Paris Fashion Week Womenswear Spring/Summer 2019, on September 24, 2018 in Paris, France. ( )\n\nWhile issues will still be printed and newsstands will still be stocked, digital content has disrupted traditional media.\n\nAnd it is unlikely we will ever see another singular gatekeeper of fashion with as much global influence as Anna Wintour.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/faith-kipyegon-misses-4-minute-mile/105467300",
        "title": "Kipyegon falls short in bid for first sub-four-minute mile",
        "publish_date": "Thu, 26 Jun 2025 23:39:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Kenya's Faith Kipyegon has fallen short in her attempt to become the first woman to run a mile in under four minutes.\n\nKipyegon clocked 4:06.42 in a Nike \"Breaking4\" project, a time quicker than her 2023 world record (4:07.64).\n\nBut her effort, run at Stade Charléty in Paris, will not be ratified, given the circumstances in which the record attempt was held.\n\nThe three-time Olympic gold medallist was assisted by innovative kit, super-spikes and a group of mostly male pacers, who blocked the wind on the track where she set her 1,500m world record last year.\n\nDressed in a black one-pieced suit with arm warmers, the diminutive Kenyan was swamped by her group of pacers, who were all world-class athletes themselves.\n\nIn a pre-designed plan, a group of five men ran in a line in front of her as \"the shield\", with American double Olympic bronze medallist Grant Fisher on her shoulder.\n\nShe was about on course at halfway but began to slip behind the coloured pacing lights inside the track and drifted on the final lap as she tied up over the last 200m.\n\nThose male pacers meant — just as with compatriot Eliud Kipchoge's sub-two-hour marathon run with \"in and out\" pacers in 2019 — the new mark will not be recognised as a world record.\n\nKipyegon, however, was her usual upbeat self at the finish.\n\n\"I'm tired but I feel good and I tried,\" said Kipyegon, as she thanked the crowd of around 1,000 spectators who had given her enthusiastic support.\n\n\"That is why I was coming here — to try to be the first woman to run under four minutes.\n\n\"It's only a matter of time but I think it will come our way. If it's not me, it will be someone else.\n\n\"I know one day, one time, a woman will run under four. I will not lose hope.\n\n\"I will still go for it and if there's not something like this, a special one, I think in a normal Diamond League (meet), or anything, I will still go for it and I hope I will get it one day.\"\n\nGreat Britain's Roger Bannister was the first man to run the mile under four minutes in1954.\n\nCompatriot Diane Leather was the first woman to break five minutes in the same year.\n\nThe current men's world record is 3:43.13, set by Hicham El Guerrouj in 1999.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/national-gallery-of-australia-collection-jenny-kee-linda-jackson/105465384",
        "title": "Jenny Kee and Linda Jackson bring 'iconically Australian' style to gallery",
        "publish_date": "Thu, 26 Jun 2025 23:36:18 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "When Princess Diana turned up to a polo game wearing a navy jumper with a koala on the front in the 1980s, it made headlines around the world.\n\nThe jumper became instantly iconic — as did the artist behind it.\n\nFashion designer Jenny Kee's career was given the royal treatment and international recognition ensued.\n\nAt a time when wardrobes are filled with the ever-churning trends of fast fashion, Kee's work has stood the test of time — so it's only fitting that some of her pieces are forming a new gallery exhibition, alongside those of her former artistic partner Linda Jackson.\n\nThe National Gallery of Australia's Know My Name: Kee, Jackson and Delaunay exhibition showcases the work of Jenny Kee and Linda Jackson. (Supplied: National Gallery of Australia)\n\nWith no 'basic tees' in sight, 80 works by the pair, including bold hand-knitted garments, silks and scarves, have taken centre stage at the National Gallery of Australia (NGA).\n\n\"I didn't want my art to be on the wall, I wanted my art to be on the body,\" Kee said.\n\n\"I just hope that people will be completely inspired by nature when they walk away ... [inspired] by art.\"\n\nThe koala jumper was also profiled in the 2025 series, Creative Types with Virginia Trioli. (ABC News)\n\n'Iconically Australian' artists celebrated\n\nThough Kee's famous koala jumper isn't part of the collection, the works on display are clearly inspired by Australian flora and fauna.\n\nSome of the pair's works have been on display in the gallery since March, drawing in fans and young admirers.\n\n\"We've had people coming in with their old Jenny Kee knits and their Linda Jackson scarves and having their photos taken in front of the works,\" Simeran Maxwell, NGA associate curator of Australian art, said.\n\n\" They instantly recognise these artists' work, they're so iconically Australian. \"\n\nThe National Gallery of Australia has acquired the personal fashion collections of designers Linda Jackson and Jenny Kee. (ABC News: Emily Anderson)\n\nThe pair began collaborating in the 1970s when Jackson started selling her work in Kee's Flamingo Park Frock Salon in Sydney's Strand Arcade.\n\nTheir artistic partnership ended a little over a decade later, and they both went on to create successful individual projects.\n\nFor Jackson, that looked like Bush Couture Studio in Kings Cross, filled with hand printed textiles with opal designs inspired by her travels through parts of South-East Asia and Europe.\n\nKee continued to run Flamingo Park until 1995, and her name is synonymous with bright Australiana knits and bold nature-inspired garments.\n\nDesigners Jenny Kee and Linda Jackson revolutionised Australian fashion in the 70s, creating bold and colourful clothes inspired by the Australian landscape. (Supplied: Living Arts Space)\n\nAcquisition includes early designs, personal pieces\n\nThe NGA's acquisition includes many previously unseen works from Kee and Jackson's early careers, and is one of the largest collections of its kind.\n\n\"To know that now there is the collection going back to these early days and when we first met … it's amazing and very very special,\" Jackson said.\n\nBoth Kee and Jackson donated some items to the acquisition from their personal collection.\n\nDesigner Linda Jackson at the National Gallery of Australia's new exhibition. (ABC News: Emily Anderson)\n\n\"Mine were often packed in boxes with tissue because some of them weren't suitable to be hanging on coat hangers and stuff,\" Jackson said.\n\n\"Everything was looked after with a knowledge that possibility, as time went on, something like this could happen.\"\n\nWorks by French multidisciplinary artist also displayed\n\nKee and Jackson's personal collections are on display as part of the first instalment of the gallery's Know My Name: Kee, Jackson and Delaunay exhibition.\n\nAlongside their vibrant designs, the exhibition also highlights works by French artist Sonia Delaunay, who was an inspiration to both artists.\n\nDelaunay was the co-founder of an art movement known as Orphism, which used intense colours and abstract forms.\n\n\"It took us back to those times and how important this inspiration is,\" Jackson said.\n\n\"Clearly you can see how earlier women inspired us.\"\n\nSimeran Maxwell describes the works by Kee and Jackson as \"so iconically Australian\". (ABC News: Emily Anderson)\n\nRarely seen Kee and Jackson works will be revealed in a second instalment, due to go on display from November 2025 until July 2026.\n\n\"These are not going to go into storage and we will forget about them,\" Ms Maxwell said.\n\n\"These will be constantly in use.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/eyre-peninsula-jetties-uncertain-future-council-costs-tumby-bay/105464510",
        "title": "Coastal erosion costs cause uncertain future for beloved SA jetties",
        "publish_date": "Thu, 26 Jun 2025 23:27:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "A year after Tumby Bay residents celebrated the town's reopened jetty with a freezing early morning winter solstice swim, the jetty's future is as uncertain as ever.\n\nToday marks the day the District Council of Tumby Bay officially hand back responsibility of Tumby Bay and Port Neill's jetties to the state government.\n\nThe council made the decision to terminate the lease of their town's jetty a year earlier than anticipated.\n\nTumby Bay Jetty reopened over a year after being closed in October 2022 following storm damage. (ABC Eyre Peninsula: Tim McGlone)\n\n\"The spending and works required to maintain the jetty is not in the sustainable financial capacity of our ratepayers — you the community,\" Mayor Geoff Churchett wrote in a letter to residents on June 5.\n\nIt marks a tough week for jetties in South Australia, with king tides, rain and strong winds destroying the Robe, Kingston and Normanville jetties in the state's south-east on Tuesday.\n\nIn Tumby Bay, an estimated $4.7 million of funding is required to repair the jetty, which was built in 1874 and rebuilt in 1999.\n\nIn February, the state government offered $2.4 million to fix the jetty in a 50-50 funding deal with the council, under the SA Jetties Renewal Program, which the council rejected due to financial constraints.\n\nPort Neill Jetty was built in 1912. (ABC Eyre Peninsula: Jodie Hamilton)\n\nThe decision drew the ire of state Transport Minister Tom Koutsantonis.\n\n\"The state government has advised the Tumby Bay Council that this jetty remains the responsibility of council unless or until it returns it in an appropriate condition,\" he said.\n\n\" The council cannot continue to abrogate its responsibilities in this matter. \"\n\nThe state government has contacted council requesting a report on previous works on the jetty, due by Monday.\n\nA false winter dawn\n\nThe Tumby Bay community has seen this episode before.\n\nThe Port Neill jetty was built in 1912, while Tumby Bay's jetty was built in 1874, and re-built in 1999. The community banded together in 1972 to save a section of the jetty.\n\nAbout 400 people gathered at the jetty to protest against its closure in February 2024, before the Tumby Bay Progress Association raised $75,000, which went towards repairs.\n\nLiz Hill and Dion LeBrun at the Tumby Bay Jetty after last year's winter solstice swim. (ABC Eyre Peninsula: Amelia Costigan )\n\n\"There's a lot of apprehension and a lot of unknown and I supposed that's what scares everybody — the unknown,\" says local Dion LeBrun, who is a part of the Progress Association that raised funds to help the re-opening last winter.\n\n\"We're all concerned about what the next steps are going to be.\"\n\nLocal governments struggling\n\nTumby Bay is not the only council struggling in this space.\n\nLocal governments from around the country converged on Canberra this week for the National General Assembly of Local Government.\n\nThe impact of coastal erosion means much-loved and historic jetties around SA are becoming more expensive than ever to fix — a topic expected to feature in many of conversations in Canberra this week.\n\n\"Jetties are a hot topic for us as a state and we'll continue to keep that advocacy piece going,\" said Jo-Anne Quigley, Mayor of the District Council of Lower Eyre Peninsula, which leases several jetties, including one still in commercial operation at Coffin Bay.\n\n\"We all know the social impacts of jetties for our communities and for visitors and tourism, so we feel it's a really important conversation.\n\n\"We understand and accept the leases are from a state perspective, but the federal government needs to step up and give some more money to the states so we can keep our jetties renewed and in the condition that they need to be in.\"\n\nPort Neill jetty was built in 1912. (ABC Eyre Peninsula: Jodie Hamilton)\n\nLocal resident Robert Randall moved to Tumby Bay in 2017 to be closer to his children and grandchildren.\n\nHe is a spokesperson for the For the People group, and is critical of the council's decision to reject the funding offer.\n\n\"My position all along is that the community would have been better off matching the $2.4 million that the government put up, and then we would have had a new jetty for 15 years, which is what the minister advised it would cost,\" he said.\n\n\"My latest concern now is that this week we've lost three or four jetties in SA, so have we lost any opportunity of getting that $2.4 million from the government? I don't know.\"\n\nRobert Randall, at Tumby Bay Jetty, is unhappy with the council's decision. (ABC Eyre Peninsula: Tim McGlone)\n\nMayor Churchett echoed the sentiments of constituents and state government in saying the future was uncertain.\n\n\"We don't know at this stage what's going to happen,\" he said.\n\n\"We just want to sit down and talk see if there's a way we can resolve this that's going to suit us all — the state government, local government and the people.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/west-indies-vs-australia-shai-hope-roston-chase/105466586",
        "title": "Windies thrive on Hope as he and Chase lead recovery against Australia",
        "publish_date": "Thu, 26 Jun 2025 22:47:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "Hope springs eternal.\n\nIt's what keeps sports fans coming back — sometimes against their better judgement — believing that better days may be just around the corner.\n\nHope that this West Indies team will be the one that converts their Gabba win to a first home Test win over the Aussies in 22 years.\n\nPerhaps it's what dragged Shai Hope, the West Indies' white ball skipper, back to the Test team after a four-and-a-half year absence.\n\n\"Shai Hope is a class player,\" Roston Chase, who has also been out of the team, missing his side's last 13 matches including the tour of Australia, told cricinfo before this Test got underway.\n\n\"I'm just looking for him to lead by example as a senior player and someone that I can lean on in pressure situations and to help me lead the troops in being a competitive Test team.\"\n\nHow prophetic that statement would turn out to be.\n\nThe two Bajan batters came to the crease with the West Indies really starting to feel the pressure.\n\nBrandon King had played well to reach 26, surviving a poor dropped catch from Alex Carey behind the stumps before inexplicably leaving one from Josh Hazlewood that cleaned up his off stump.\n\nHaving been 4-57 overnight, King's wicket left the hosts 5-72, still more than 100 runs behind Australia's first innings score and under pressure.\n\nAnd yet, by the time both had been removed by bafflingly poor DRS decisions from third umpire Adrian Holdstock, they had led the Windies towards parity, just 18 runs shy with two wickets remaining.\n\nMuch could, and should, be made of the errors from Holdstock in giving the West Indies' two key batters out in the manner that he did.\n\nThe clear deviation off Chase's bat before Cummins's delivery crashed into his pads was obvious to seemingly everyone but the South African umpire, and while Carey's catch to dismiss Hope off the bowling of Beau Webster may have been spectacular, it clearly ended with the ball making significant contact with the ground as he completed the catch.\n\nCummins controversially dismissed King on day two. (AP: Ricardo Mazalan)\n\nDarren Sammy, West Indies coach, was visibly upset by the decision, throwing his hands in the air and turning away in disgust from the pavilion.\n\nThat all being said, Chase could have been out for 1 had Holdstock recognised that Hazlewood's delivery in the very first over of the day had brushed the pad before hitting his bat.\n\nBut coupled with the hugely questionable decision not to award Hope a catch on day one to dismiss Head, the West Indians will justifiably feel like they have had the worst of the calls.\n\n\"It's unfortunate, it really is unfortunate … it feels as though everything has gone against the West Indians,\" former West Indies player Samuel Badree said on ESPN.\n\n\"You just have to hope you get the rub of the green in the second innings.\"\n\nWebster dismissed Hope despite the ball appearing to touch the ground while Carey completed the catch. (AP: Ricardo Mazalan)\n\nThe controversy upset what was a superb fightback from the West Indies.\n\nThe twin innings of the West Indies' two skippers still carried huge importance to set up not only a compelling Test, but a competitive series.\n\nTheir partnership may have only been 67, but in a low-scoring Test it gave the hosts a much-needed leg up.\n\nHope instantly brought intensity and willingness to the crease, two sumptuous fours off Cummins a delight to watch, while Chase maintained a measured, level head to hold his side together.\n\nDespite not playing a Test since November 2021, Hope averages 50.9 in first class cricket at the Kensington Oval, while Chase averages 43.2. Clearly, both enjoy playing in Barbados.\n\nShai Hope helped the West Indies rebuild after day one's chaos. (AP Photo: Ricardo Mazalan)\n\nBetween them, they have scored nine 50s and nine tons on this ground in red ball matches.\n\nA flattening pitch aided the two locals, of that there is no doubt, as was the fortune that befell Chase early in the day when a close LBW call was denied off Hazlewood — although the Windies were made to pay for that in double later on.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nThen there was the desperately tough chance shelled by Sam Konstas at short leg, a second reprieve when he had but 4 runs to his name.\n\nBut, the successful chase gave the West Indies hope, backing up the bowlers' efforts.\n\nAnd Shamar Joseph continued that positivity with the ball, even as John Campbell and Justin Greaves shelled two more regulation chances in the slip cordon off his bowling — the fourth and fifth drops he has endured during this Test.\n\nJoseph grinned his way back to his mark, perhaps a gurning mask of his frustration, while coach Darren Sammy positively exploded in the box as the porous slip cordon again threatened to derail their batters efforts.\n\nBut he still came in, a marathon seven-over spell being rewarded with Konstas's wicket as the top four failed again, Australia reduced to 4-65 and the hope that Travis Head can ride his form to the rescue of his country yet again.\n\nAustralia's close of play lead, just 82 runs with six wickets remaining, sets up a thrilling third day.\n\nThere was plenty of hope that this series would be competitive. Looks like we've got our wish.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-27/asx-markets-business-news-live-updates/105467412",
        "title": "Live: Miners pull ASX higher as US 'revenge tax' to be dropped",
        "publish_date": "Thu, 26 Jun 2025 22:29:54 +0000",
        "category": "finance",
        "authors": [
            "Michael Janda",
            "Daniel Ziffer",
            "Stephanie Chalmers"
        ],
        "text": "When doctors are earning such high salaries, it’s hard to accept pay rises sought through industrial action. In SA they are citing the pay scales of interstate colleagues. It seems that this profession has become a money making one instead of being a service oriented profession. Teachers and Nurses on the other hand paid much lower wages, while also being of equal importance to the society. - Celosia\n\nIt's an interesting question.\n\nMany surgeons would argue that their high pay now is fair compensation for the many years of unpaid studies and relatively low-paid training roles and long hours they work in order to get to where they are.\n\nTeachers and nurses don't have to spend nearly as long at uni and in work placements before being fully qualified.\n\nOn the other hand, teachers and nurses don't get to decide how many new entrants are permitted to join their profession each year, which is a closed-shop privilege the medical specialties have retained.\n\n\"The Royal Australasian College of Surgeons (RACS) is the only body in Australia which is eligible to grant Fellowship in nine surgical specialties. Whilst training courses and exams are conducted by RACS, the administration and management of the training programs is conducted by the responsible specialist societies such as the General Surgeons Australia, Australian Orthopaedic Association, and the Neurosurgical Society of Australasia,\" Sydney University notes in its advice for prospective medical students. \"Applications for the training program are competitive and places are limited, so you may need to apply multiple times before gaining admission.\"\n\nWhile law societies in Australia perform a similar role admitting new practitioners, to my knowledge, they do not set a limit on how many graduates who have completed their degrees and practical legal training can be admitted as solicitors in any given year.\n\nIn other words, if you pass your degree, complete your PLT and meet the character test, you're in. I studied law in NSW, and I have never heard of anyone being knocked back from admission because of any sort of quota.\n\nOn the other hand, in medical specialties, you can pass your degree, successfully undertake residencies in your chosen field and still be rejected from the final stage of training to become a surgeon because there are not enough places available.\n\nThe surgeons would argue that this is because there is a limited pool of people who can conduct the necessary specialist training and supervision.\n\nBut there is also an argument that the supply of specialists may be being artificially constrained, which would reduce patient choice, increase waiting times and prop up the fees that can be charged.\n\nIt is certainly an area worth further investigation, and I'd love to hear from people involved in the medical specialties to see what their take is — drop me an email: janda.michael@abc.net.au",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/12-times-anna-wintour-created-a-cultural-moment-through-the-cover-of-vogue-20250627-p5maqm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "12 times Anna Wintour created a cultural moment through the cover of Vogue",
        "publish_date": "Fri, 27 Jun 2025 12:07:30 +1000",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size From Kim Kardashian to Melania Trump, we look back at Anna Wintour’s most iconic, memorable and controversial cover moments throughout her 37-year tenure. November 1988 Wintour’s first cover for Vogue, in November 1988, was a departure from the hyper-produced, editorialised images that were typical of the magazine’s covers at the time. Shot by Peter Lindbergh and styled by Carlyne Cerf de Dudzeele, model Michaela Bercu wears a haute couture Christian Lacroix jacket with a beaded cross and stonewashed Guess jeans. While it may be common today, the styling of high fashion with off-the-rack denim was rare at the time. As Wintour recounted to Vogue in 2012, so revolutionary was the image that the magazine’s printers even called up to check if there had been a mistake. “I had just looked at that picture and sensed the winds of change,” she said. May 1989\n\nAdvertisement\n\nThroughout her tenure at Vogue, Wintour became known for putting celebrities front and centre on the cover – a risky move at a time when high fashion editorials featuring models was the norm. The May 1989 cover of the magazine, featuring a young Madonna at home, was an early sign of Wintour’s propensity to be at the forefront of change. September 1989 In September 1989, Wintour put a young Naomi Campbell on the cover, dressed in an orange sequin Anne Klein suit and shot by Patrick Demarchelier. It was a first for both parties – Wintour’s first September issue and Campbell’s first American Vogue cover. In 2020, Wintour appeared on an episode of the supermodel’s TV show, No Filter with Naomi, and revealed her decision to put a black model on the magazine’s cover was called into question by some board members (Beverly Johnson was the first black model to appear on the cover of US Vogue in 1974).\n\nAdvertisement\n\n“I just thought, ‘this is a fantastic girl, this is the model of the moment, this is a great image’. And we made history together, so thank you,” said Wintour. November 2001 In 2001, a then 19-year-old Britney Spears was at the height of her fame. So it was only fitting she graced the cover of the November issue. Shot by Herb Ritts, rosy-cheeked and smiling against the star-spangled banner, the cover came months after Spears’ infamous performance at the MTV Video Music Awards, in which she appeared scantily clad on stage with a real snake. This was a different side to Britney: the all-American girl next door. “I don’t want to be considered a role model,” the pop star told Vogue. “I do this because it’s fun, and when I go on stage, I’m expressing myself and I can’t please everyone.”\n\nAdvertisement\n\nFebruary 2005 Back in 2005, Melania Trump appeared on the cover of Vogue in a lavish custom-made Christian Dior wedding gown. “Melanie Knauss, the next Mrs. Trump, is a smashing 34-year-old Slovenian who handles her position (and the Donald) with panache,” wrote Sally Singer in the accompanying story. Notably, the former model has not appeared on the cover of US Vogue since, despite Wintour and the Trumps previously being friendly. Jill Biden and Michelle Obama both appeared on the magazine’s cover three times each during their tenures as first ladies. April 2008\n\nAdvertisement\n\nWintour’s April 2008 cover of Vogue, featuring basketball player LeBron James and supermodel Gisèle Bündchen, is considered one of her most controversial for its resemblance to an old King Kong poster and 1917 World War I recruitment poster that perpetuated the racist stereotype of a black man running off with a white woman. Vogue spokesman Patrick O’Connell said at the time the magazine “sought to celebrate two superstars at the top of their game” for the magazine’s annual issue devoted to size and shape. “We think Lebron James and Gisele Bundchen look beautiful together and we are honored to have them on the cover,” he said. James said told an Ohio newspaper at the time that he was pleased with the cover, saying he was “just showing a little emotion”. “Everything my name is on is going to be criticised in a good way or bad way,” James said. “Who cares what anyone says?”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/five-damning-moments-from-carlton-s-night-of-carnage-20250627-p5maqo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Five damning moments from Carlton’s night of carnage",
        "publish_date": "Fri, 27 Jun 2025 12:00:30 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Jacob Weitering is one of the league’s best one-on-one defenders, but he wasn’t at his best a week after hurting his ankle against North Melbourne. Weitering was seen in discussions with the club’s medical staff about his ankle just minutes before the opening bounce. That lack of confidence may have impacted his ability to body up, reinforced when he could not go with Mitch Georgiades in a crucial marking contest. David King, a dual North Melbourne premiership player, said Weitering had to be stronger. “Body on body, Weitering is the bigger body, he [Georgiades] just loses him. He [Weitering] has got to be stronger than that to deny Georgiades the clear run and jump at the ball,” King said on Fox Footy. Seven’s expert commentator Kane Cornes added: “Well, he’d be frustrated by that, Michael Voss, because you should be able to defend that. Weitering just wasn’t physical enough.” It wasn’t a good sign for the Blues when their premier defender was beaten so easily. Weitering was later switched off Georgiades.\n\nAcres misses a regulation shot Second term The Blues needed to regroup in the second term, and had a golden opportunity early when Blake Acres marked a chipped kick from Patrick Cripps. Acres has booted some big goals for the Blues but, on this occasion, botched a regulation shot from 40m on a slight angle. Acres wasn’t the only Blue guilty of making … a blue in front of goal. How on earth did Curnow’s shot for goal from the right pocket end up out on the full in the left pocket with just over a minute remaining in the game?\n\nMotlop caught ‘plodding’ Third term Late in the third term, with the Blues trailing by 10 goals, small forward Jesse Motlop fails to man up on Joe Richards, and even points to nearby teammate Orazio Fantasia to take the Power runner. Richards, meanwhile, pushes forward from the defensive 50 metre line, where he started on Motlop, to the wing to mark, the Power soon celebrating another goal to Willie Rioli. Riewoldt, in commentary, takes aim at Motlop.\n\n“Just look at Jesse Motlop here. You talk about the little things here. Joe Richards runs past him, that there is not trying. Just trying to hand it off to someone else to do your job, plodding through, Richards runs past him and puts 50m on him,” Riewoldt said. “This ball goes to the other end. You wonder why Carlton’s backs are under pressure. It’s efforts like these that are frustrating Michael Voss.” McGovern goes for goal instead of looking for a teammate Final term\n\nCharlie Curnow finds McGovern in the right forward pocket. Instead of centring the ball, McGovern opts for a tough check side shot at goal, the ball finishing out on the full in the opposite pocket. Loading “He had players on, 30m from goal, for the chip pass, and he put himself before the team. He could have chipped it, I think, to [Zac] Williams unopposed 30 metres from goal,” King said on Fox. Cornes, on Seven, could not believe that McGovern had missed the goal. “Harder not to score a goal than a score a goal there. When Curnow took possession of that ball, they had two players - Docherty and McGovern - almost running into an open goal. The Curnow kick was poor. But you can’t be an AFL footballer missing that shot under no pressure by 20 metres out on the full,” Cornes said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/around-the-clubs-nrl-round-17-20250622-p5m9bt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Luai out of Manly clash on Friday; Cobbo to join Dolphins",
        "publish_date": "Fri, 27 Jun 2025 11:55:56 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko",
            "Michael Chammas",
            "Christian Nicolussi",
            "Dan Walsh",
            "Robert Dillon"
        ],
        "text": "Broncos officials were hopeful the 23-year-old would accept a deal worth about $300,000 - about half of his current contract - to remain at Red Hill. However, Cobbo will be on the move in 2026 and intends to officially inform his teammates of the decision in the coming days. The Dragons had expressed interest, although they have decided to now pull out of the race for his signature. Instead, they will turn their attention to premiership-winning Penrith forward Luke Garner, who is also a target for Parramatta. Cowboys coach Todd Payten had also publicly expressed his interest in Cobbo, if he was prepared to go at the right price. Broncos winger Selwyn Cobbo will leave the club at the end of 2025. Credit: NRL Photos\n\n“I think Selwyn Cobbo would help any club he is going to,” Payten said. “He carries the ball strongly, he can find the tryline and break a game open. He has proven that over time. “There’s no doubt we could help him get to where he wants to get to, but if we get to that point, it’s down to him. “I don’t doubt our club would be a good fit.” Cobbo won’t leave the Broncos before the June 30 deadline.\n\nDragons withdraw from Cobbo race, eye premiership-winning back-rower St George Illawarra have withdrawn from the pursuit of out-of-favour Broncos star Selwyn Cobbo. Sources with knowledge of the situation talking on the condition of anonymity said the Dragons did not want to be used as leverage in a bidding war and on Thursday decided to end conversations with his management. The Dragons hosted Cobbo at the club’s Wollongong base last week and were willing to make him an offer for the next 18 months if he left Brisbane.\n\nHowever, the Broncos have shown no appetite to release the Queensland centre before June 30 and the Dragons have concluded it would be best to look elsewhere to bolster their roster. The Dragons, meanwhile, have joined Parramatta in the hunt for premiership-winning Penrith forward Luke Garner. Garner is contracted with the Panthers for 2026 but has been given permission to test the market. The Eels have already expressed interest in the former Tigers back-rower. Selwyn Cobbo. Credit: NRL Photos Garner is on a deal worth around $350,000 for next year and the Dragons are in the market for an experienced forward to compliment some of the young talent at their disposal.\n\nWhile they have allowed Garner to test the market, the Panthers have not guaranteed Garner a release for next year. The Dragons’ interest in Garner comes the day after it was revealed long-serving lock Jack de Belin would leave the club at the end of the season to join the Eels. Horror injury set to sideline Knights star for rest of season They’ve scored fewer points than any team in the NRL this year, and now the Newcastle Knights’ attacking options have been further depleted by a horror injury that is expected to prematurely end the season of leading tryscorer Fletcher Sharpe.\n\nSharpe suffered a lacerated kidney and ruptured spleen during Newcastle’s 26-20 win against the Dolphins in Perth on Saturday, and was taken to hospital later that night when the club’s medical staff became concerned about his condition. After undergoing a surgical procedure and spending four days in hospital, the 21-year-old Prime Minister’s XIII representative flew home on Wednesday and now faces an indefinite period of convalescence. Knights coach Adam O’Brien admitted to being “shocked” when the extent of Sharpe’s injuries were confirmed, “because Fletcher doesn’t say much and he’s tough as nails”. Sharpe pain: Fletcher Sharpe suffered the injury in his side’s win over the Dolphins at the weekend. Credit: Getty Images O’Brien said the utility back, who was set to be called up to train with the NSW Origin squad next week as a development player, was receiving the best possible medical care, but his prognosis was unclear.\n\n“He’s got to go through a process now where he’ll meet with specialists in a couple of weeks,” O’Brien said. “But I think we’re a long way away from knowing when he’ll be actually participating in contact sport or even [able to] lift anything heavy, I’d imagine. So it’s a pretty significant injury and something that we won’t take lightly.” Asked if it would be a bonus to get Sharpe back this season, O’Brien replied: “Well, I’d look at it that way, yeah. I’d actually be surprised if we do see him back this season. But I’m not the expert there. I’ll leave that up to the guys that are a lot smarter than me.” Asked if there was any concern that the injury could potentially be career-threatening, O’Brien said the initial information was that Sharpe would make a complete recovery. Loading “I believe that life will go on as normal for him, and footy and that’s all intact,” he said. “It’s just the immediate part of it, I think he can’t participate in. But from what I can gather, everything will go back to normal over time.”\n\nThe Knights have scored 39 tries in 15 games this season – seven fewer than the second-worst attacking team, Parramatta, who have played only 14 times. Sharpe has been their leading contributor with 11 tries, taking his career tally to 22 in 26 NRL games. O’Brien was confident the return of winger Dominic Young from Sydney Roosters, and former NSW Origin representatives Bradman Best and Jacob Saifiti from injuries, would help boost his team’s firepower in Sharpe’s absence. Jackson Hastings has been named to replace Sharpe at five-eighth when the Knights host Canberra on Friday night. Ray Dib, Marcus Bai appointed to PNG board\n\nFormer Bulldogs powerbroker Ray Dib has been appointed the chairman of an inaugural Papua New Guinea board that also includes former Storm star Marcus Bai. Seven directors were unveiled at an announcement at Santos National Stadium in Port Moresby that was attended by PNG Prime Minister James Marape, Minister for Pacific Island Affairs Pat Conroy, NRL CEO Andrew Abdo and ARLC chairman Peter V’landys, who was making his first visit to the nation. The first board of the PNG franchise will comprise: Ray Dib (Chairman), Lorna McPherson, Richard Pegum, Stan Joyce, Wapu Sonk, Ian Tarutia and Marcus Bai. Dib was the chairman of Canterbury for eight seasons before he was ousted at the ballot box by a ticket led by Lynne Anderson at the start of 2018. The Bulldogs made the 2012 grand final under Dib’s tenure, but the decision to re-sign coach Des Hasler which ended in an ugly payout dispute ultimately cost him his position.\n\nConroy declared the PNG franchise would eventually “make the Panthers the minnows of the NRL”, while Marape said a competition will be conducted to determine the team name. “The importance of this franchise goes well beyond winning games of football, it is about nation building and bringing our two countries closer together,” V’landys said. Ray Dib was chairman of the Bulldogs for almost a decade. Credit: Fairfax “The new NRL club will provide a pathway for young people in PNG to follow their dreams and it will help transform societal and economic outcomes. This is an important moment for the NRL as PNG is set up to become a nursery of talent in the region for the entire competition, not to mention the millions of fans that will now follow a new team entering the competition. “Today’s announcement is a major milestone and sets the franchise on a path to great success both on and off the field. This club will act as beacon of hope and opportunity across PNG and offer opportunity to young people hoping for a better future.\n\n“Rugby league is the number one sport in the Pacific, and this new club will solidify rugby league’s role as the unifying language of the region.” Dib aside, the most prominent director for league fans is Bai. The former Storm winger scored 70 tries in 144 NRL games and also featured in the club’s 1999 grand final win over St George Illawarra. “The Albanese Government is proud to stand shoulder to shoulder with PNG in supporting this once-in-a-generation opportunity,” Conroy said. Tigers star Bula set to miss next month Michael Chammas\n\nStar fullback Jahream Bula is set to miss the next month with a hamstring injury, dealing Wests Tigers a blow. Bula suffered the injury in the last play of the game against the Raiders last week and is set to face an extended period on the sidelines. Bula pulled up sore after attempting to chase a Jarome Luai grubber in the final seconds of the game. The news of Bula’s hamstring injury is expected to shift Heath Mason back into the No.1 jersey, opening the door for Latu Fainu to join Jarome Luai in the halves.\n\nBroncos extend Karapani as Dragons circle Cobbo Michael Chammas The Broncos are set to extend the contract of winger Josiah Karapani for a further two seasons, placing an even greater cloud over the future of Selwyn Cobbo. The Dragons have expressed an interest in luring Cobbo to the club before the June 30 transfer deadline after meeting with him in Wollongong last week. The Broncos are not keen to let Cobbo go immediately but it is becoming increasingly unlikely he will be at the club beyond the end of this season.\n\nThe Dragons are willing to offer Cobbo an 18-month contract. They haven’t made him an offer as yet and want to make sure he is willing to leave Brisbane before tabling him a deal believed to be worth around $600,000 for next year. The Dragons have also held internal conversations about the future of out-of-sorts winger Tyrell Sloan and are expected to give him permission to explore options at rival clubs despite having another year to run on his deal worth around $500,000. Rooster out for six weeks after cannonball tackle referees missed Dan Walsh Siua Wong will miss up to six weeks after being the victim of a cannonball tackle that was missed by match-day officials, yet punished by the match review committee with one of the most serious charges of this season.\n\nScans have confirmed that Wong, who has played every game in the Roosters back-row this season, will miss 4-6 weeks with a MCL tear in his knee after being hit by Karl Lawton on Sunday. Lawton was not punished on the field in the Roosters 42-8 thrashing of the Cowboys, despite Wong’s injury pausing the game and allowing referee Ashley Klein and Bunker official Chris Butler to review the incident. The MRC issued Lawton with a grade 3 dangerous contact charge on Monday, the highest possible grading before a player is referred directly to the judiciary. Lawton is now facing a 2-3 week ban for the third man in contact on Wong depending on his plea to the charge.\n\nManly prop Tof Sipley is the only player to have received a higher grade charge for his hip drop tackle on Dragons winger Mat Feagai earlier this year. Sipley served a four-match suspension for the tackle that fractured Feagai’s leg. Scans have cleared Roosters five-eighth Sandon Smith of any damage after he left the field early with a knee injury on Sunday. The off-contract No.6 is expected to be fit for the Tricolours round 18 clash against Wests Tigers after their third and final bye of the season this weekend. Elsewhere, Parramatta’s Will Penisini is facing a three-game ban with an early guilty plea to a dangerous throw on Titans forward Beau Fermor. Eels teammate Ryley Smith is facing a 2-3 game ban for his own spear tackle on Phil Sami earlier in the match.\n\nRadley to take month off, Knights playmaker hospitalised by lacerated kidney Dan Walsh Victor Radley is set to take a month off from his latest head knock while Knights livewire Fletcher Sharpe has been hospitalised with a lacerated kidney suffered in Saturday’s last-gasp upset of the Dolphins. Radley met with a concussion specialist on Friday after his fifth HIA of the season continued a worrying history of head knocks for the Roosters enforcer.\n\nRadley came off following what appeared reasonably innocuous head contact while tackling Newcastle’s Fletcher Hunt in round 14, though actually passed his subsequent HIA. Roosters medical staff made the call to rule Radley out of the Knights game in any case. Radley has only failed one HIA this year - when he was knocked out against Brisbane in round one - but has had several concerning concussion incidents over the years, including a 2022 collision that left him convulsing on the turf against Melbourne. Along with the Roosters round 16 clash against North Queensland and the subsequent bye, Radley is likely to be stood down on July 6 when the Roosters host Wests Tigers. Victor Radley will miss a month of play for the Roosters. Credit: Getty Images\n\nNo return date has been set for Radley at this point but the 27-year-old has been in good spirits at Roosters HQ this week. “He’s gone through some really good testing with some specialists and he’s on a really clear plan over the next few weeks,” Robinson said. “He’ll follow the plans of the doctors and he’ll be back when he’s ready to be back.” Loading Sharpe, meanwhile, has remained in a Perth hospital receiving treatment for a kidney laceration while his teammates travelled home on Sunday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/how-far-can-penrith-go-the-game-by-game-breakdown-should-terrify-nrl-rivals-20250623-p5m9ki.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How far can Penrith go? The game-by-game breakdown should terrify NRL rivals",
        "publish_date": "Fri, 27 Jun 2025 11:55:09 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Billie Eder"
        ],
        "text": "Sixth place - 19 points, seven wins, one draw, seven losses, two byes, +3 points differential\n\nGames against top 8: four.\n\nGames against top 4: four.\n\nWins to make top eight: five from nine games.\n\nPredicted finish: fifth. Round 18: bye Round 19: Eels at Commbank Stadium A danger game with their Origin players facing a four-day turnaround into the local derby, with Parramatta playing far better of late than their lowly position on the ladder suggests. The Eels offload-centric game under Brad Arthur troubled Penrith’s defence in years past but their style under Jason Ryles - playing with more width and a real emphasis on Dylan Walker’s ball-playing - is still evolving. No Mitchell Moses to guide Parramatta should tip this one Penrith’s way.\n\nLast five clashes: Panthers lead 3-2 Round 20: Rabbitohs at Commbank Stadium Souths as well are a stronger than a 16th placed side, particularly when Latrell Mitchell is firing and their backline stars are returning from injury. The real worry for Penrith is the five-day turnaround from their Sunday July 13 game while the Rabbitohs will come off a bye. For the Panthers Origin quintet, this could be a third game in the space of 11 days unless Ivan Cleary rests them.\n\nLast five clashes: Panthers lead 3-2 Round 21: Wests Tigers at Commbank Stadium Four-time premiership-winner Jarome Luai looms once more against his old teammates as the Tigers begin an all-too familiar slide down the ladder, despite undoubtedly improving in 2025. As plucky as the Tigers have been, and they often aim up against Penrith, the Panthers will be warm favourites for this clash.\n\nLast five clashes: Panthers lead 4-1\n\n\n\nNathan Cleary and Jarome Luai after their recent clash at Commbank Stadium. Credit: Getty Images Round 22: Titans at Cbus Super Stadium, Gold Coast Penrith haven’t lost to the Titans since the 2019 car crash campaign that triggered the greatest premiership run of the modern era. And if you’ve seen the Gold Coast go around this season, it won’t be happening in 2025 either.\n\nLast five clashes: Panthers lead 5-0 Round 23: Knights at McDonald Jones Stadium, Newcastle A potential banana peel of sorts, even with Newcastle’s 14.6 points per game this season making for the worst attack of the NRL by some margin. The Knights knocked off Penrith in May when they were without their Origin stars and have regularly dragged the competition heavyweights into a defensive dogfight in recent years.\n\nLast five clashes: Panthers lead 4-1\n\nRound 24: Storm at Commbank Stadium The finals effectively start early for Penrith, with Melbourne the first of three genuine title contenders in as many weeks. The Storm have been erratic throughout 2025 but used the corresponding clash last season to make a statement - beating the premiers in front of a sold-out Panthers Stadium by targeting Brian To’o under the high ball and managing to harness his yardage game.\n\nLast five clashes: Storm leads 3-2 Ricky Stuart’s Raiders loom as a genuine threat to Penrith. Credit: Getty Images Round 25: Raiders at Commbank Stadium Canberra’s ability to win as front-runners, from behind, playing fast and free or grinding the opposition into error has shades of Penrith about it, of course with only half a season worth of evidence behind it. Three weeks out from the finals this looms as a fine litmus test for both sides, particularly the Raiders young playmakers Ethan Strange and Kaeo Weekes who are yet to experience semi-finals pressure.\n\nLast five clashes: Panthers lead 4-1\n\nRound 26: Bulldogs at Accor Stadium Penrith have shown Canterbury what it takes to win the games that matter most, this will be a fascinating watch to see just how much Cameron Ciraldo’s side has learned by this point in the year. Just as compelling, how the Dogs juggling of their playmakers and Lachlan Galvin’s introduction to the side plays out. If this match wasn’t scheduled for Thursday night you’d expect another 50-60,000 Bulldogs fans turning out.\n\nLast five clashes: Penrith lead 5-0 Round 27: Dragons at WIN Stadium, Wollongong By all rights, Penrith will be tuning up for yet another finals tilt with every other side on edge. We’ve seen worse final round hit-outs than a Saturday afternoon in Wollongong. The Dragons will be staring down another early Mad Monday and given the way rugby league goes, an increasingly bright spotlight on Shane Flanagan as he comes off-contract in 2026. Last five clashes: Panthers lead 4-1\n\nAnd once the fun and games of a 27-round season is done, it’s a whole new competition. Just how far Penrith can go - as we’ve mapped out further below - depends of course on how the rest of the NRL finishes up. First place - 28 points, 11 wins, three losses, three byes, +96 points differential\n\nGames against top 8: six.\n\nGames against top 4: two.\n\nWins to make top eight: two from 11 games.\n\nPredicted finish: second. Are we seeing just a bit of a tail-off from the Dogs after three months sitting in first place? It wouldn’t be the worst thing for Canterbury to be taking stock at this point, with a first-choice playmaking spine needing to settle. A final month of games against the Roosters, Storm, Panthers and Sharks is a tough one going into the post-season. Second place - 26 points, 12 wins, three losses, one bye, +100 points differential\n\nGames against top 8: one.\n\nGames against top 4: none.\n\nWins to make top eight: one from nine games.\n\nPredicted finish: first.\n\nA couple of byes after the heaviest travel toll of any NRL side and just one game against a top-eight side (Penrith in round 25) makes for a rails run home. Canberra have done exceptionally well to have a top-four berth all but sewn up. Ricky Stuart’s biggest task now is keeping his young side healthy and focused as the inevitable hype grows around them. Third place - 24 points, nine wins, four losses, three byes, +172 points differential\n\nGames against top 8: seven.\n\nGames against top 4: none.\n\nWins to make top eight: four wins from 11 games.\n\nPredicted finish: third. Like the Bulldogs, Melbourne’s last month of the season will be a true test of where they’re at come finals time. Provided their Origin stars come through the next few weeks unscathed, the inconsistency of their campaign should get worked out for yet another premiership tilt. Fourth place - 24 points, ten wins, four losses, two byes, +25 points differential\n\nGames against top 8: two.\n\nGames against top 4: one.\n\nWins to make top eight: three wins from 10 games.\n\nPredicted finish: fourth.\n\nSitting in a similar boat to Canberra having punched well above their weight over the first half of the season. After Saturday’s mouth-watering clash with Brisbane, Canterbury in round 23 looms as their only opponent that will be anywhere near grand final day. Cruising, though can’t afford to lose any more veterans with Mitch Barnett (ACL) gone for the season and Dallin Watene-Zelezniak (ankle) also out for at least the next month. Fifth place - 18 points, seven wins, seven losses, two byes, +50 points differential Games against top 8: four.\n\nGames against top 4: four.\n\nWins to make top eight: six wins from 10 games.\n\nPredicted finish: sixth. For all the criticism and focus on the Broncos – so much of it self-inflicted – Michael Maguire has them sitting fifth midway through his first year. If they can get some consistency in their game, they’ll hit the finals in good shape – big clashes against the Warriors, Bulldogs and Storm (twice) will test their mettle.\n\nSixth place - 18 points, eight wins, seven losses, one bye, +20 points differential\n\nGames against top 8: three.\n\nGames against top 4: two.\n\nWins to make top eight: five from nine games.\n\nPredicted finish: eighth. Sliding, and sliding fast with defence and application worryingly missing of late. The next few weeks against the Storm, Dolphins and Roosters could dig the Sharks into a serious hole if they can’t emerge with at least one win. Life does get easier from there, though. Seventh place - 18 points, seven wins, seven losses, two byes, +16 points differential\n\nGames against top 8: four.\n\nGames against top 4: three.\n\nWins to make top eight: six from 10 games.\n\nPredicted finish: seventh.\n\nStarting to put together a fine campaign, with five wins from their last seven games (losses to Canterbury and Canberra could and should have been Roosters wins, too). Need to bank victories against the Tigers and Dragons in early July before a run of top-eight clashes, but well-placed to play finals. Ninth place - 16 points, seven wins, eight losses, one bye, +140 points differential Games against top 8: five.\n\nGames against top 4: two.\n\nWins to make top eight: six from nine games.\n\nPredicted finish: tenth. Have found their mojo in attack but need to keep winning after a dreadful start to the year. Can largely control their own destiny in the next three weeks - victories over Cronulla, South Sydney and North Queensland would come with the added value of hobbling rivals sitting alongside them on the ladder. Injuries up front are a worry, though.\n\nTenth place – 16 points, six wins, eight losses, two byes, +22 points differential\n\nGames against top 8: five.\n\nGames against top 4: four.\n\nWins to make top eight: seven from 10 games.\n\nPredicted finish: ninth. Manly have been the biggest disappointment of 2025 so far, with all the drama around Daly Cherry-Evans’ future derailing their season. Shifting Tom Trbojevic into the centres and Lehi Hopoate to fullback needs to spark the Sea Eagles immediately, because back-to-back games against Melbourne and Canterbury coming up could end their campaign early. Eleventh place: five wins, eight losses, three byes, -59 points differential\n\nGames against top 8: seven.\n\nGames against top 4: four.\n\nWins to make top eight: eight from 11 games.\n\nPredicted finish: 14th.\n\nThe Dragons will once again miss the finals in 2025. With all three byes out of the way, two games against Canberra, roster conjecture and doubts around the halves as always, a slide down the ladder looms. Twelfth place: Five wins, one draw, eight losses, two byes, -140 points differential Games against top 8: four.\n\nGames against top 4: two.\n\nWins to make top eight: seven from 10 games.\n\nPredicted finish: 11th. The Cowboys have been one of the biggest under-performers in 2025, but they have a soft run home that could help them crack the finals. On the basis of a defence that has leaked 100 points in the past two games, North Queensland are in deep trouble. But if they can jag an upset over Melbourne or Canterbury in coming weeks, the chance to build momentum is there.\n\nThirteenth place: Six wins, nine losses, one bye, -63 points differential\n\nGames against top 8: seven.\n\nGames against top 4: four.\n\nWins to make top eight: seven from nine games.\n\nPredicted finish: 15th. Newcastle won’t be scraping into the finals this year. Their attack still offers far too little and the next five weeks (Canberra twice, Melbourne, Warriors and Penrith) is the toughest run in the NRL. Fletcher Sharpe joining a slew of injured forwards on the sidelines is all sorts of bad news. Fourteenth place: five wins, nine losses, two byes, -66 points differential\n\nGames against top 8: five.\n\nGames against top 4: three.\n\nWins for top eight: eight wins from 10 games.\n\nPredicted finish: 13th.\n\nThe Tigers have improved this season, but Lachlan Galvin’s exit rocked the club and more scrutiny is coming their way as Tallyn Da Silva prepares to leave early, too. Add the injury to Jahream Bula and the club, while likely avoid the wooden spoon, won’t be getting near finals this year. Fifteenth place: five wins, nine losses, two byes, -89 points differential Games against top 8: six.\n\nGames against top 4: three.\n\nWins to make top eight: eight from 10 games.\n\nPredicted finish: 16th. The Eels did well to beat the Titans last week, but Mitchell Moses’ latest Origin-inflicted injury cruelled any hope of a run up the ladder while a tough finish to the year against NRL heavyweights will not do justice to the improvements during Jason Ryles’ first year in charge.\n\nSixteenth place: six wins, nine losses, one bye, -89 points differential\n\nGames against top 8: 4.\n\nGames against top 4: 0.\n\nWins to make top eight: seven from nine games.\n\nPredicted finish: 12th. The Rabbitohs have an easier run home compared to some, but it still includes games against the Panthers, Sharks and Broncos. Seven wins for a finals run is too big an ask from a team that’s been so injury-plagued this year, though at full strength they’ll keep every rival nervous. 17th place: four wins, 10 losses, two byes, -138 points differential\n\nGames against top 8: five.\n\nGames against top 4: two.\n\nWins to make top eight: nine from 10 games.\n\nPredicted finish: 17th.\n\nWith five top-eight teams left to face this season and the worst points differential in the competition, the Titans will do well to avoid the wooden spoon as their defensive frailties put Des Hasler’s tenure under extreme pressure. The finals run: Could Penrith actually pinch a premiership? A fifth or sixth-placed finish would give the Panthers a home semi-final (not quite the silver bullet it was when they were playing out of Penrith Park) but there won’t be a precious week off regardless given the top four is all but settled already. Here’s how we see their finals run playing out.\n\nWeek one: Elimination final against Cronulla at Commbank Stadium Whoever Penrith line up against in week one, be it the Sharks, Broncos, Roosters, Sea Eagles or Dolphins, as long as the Panthers and Cleary are fit, we’re seeing too much big-game experience and momentum with the premiers. A date with one of the top-four teams looms. Week two: Semi-final against the Warriors at Mount Smart Stadium And this, for us at least, is the end of the line. No matter which way the top four shakes out, it’s a daunting home ground advantage to whichever finals week one loser Penrith draw. The Raiders in Canberra, Storm in Melbourne, Warriors across the ditch or Bulldogs in front of a likely 80,000-strong sell-out is all sorts of awesome for rugby league. Penrith knocked off the Warriors at home, but can they do it again come finals time? Credit: Getty Images",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/38-balls-of-torture-konstas-is-stuck-in-two-minds-20250627-p5mase.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Thirty-eight balls of torture: Konstas is stuck in two minds",
        "publish_date": "Fri, 27 Jun 2025 11:54:07 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Barbados: Form in the cricket nets is a bit like investment advice: past performance is not necessarily a reliable indicator of future returns.\n\nBut in the case of Sam Konstas, there was a moment on Sunday in Barbados that hinted the teenage sensation might not be in ideal touch ahead of the first Test against the West Indies.\n\nPart-timer Marnus Labuschagne found Konstas’ outside edge with a medium pace outswinger at Australia’s first net session since a surprise defeat to South Africa in the World Test Championship final.\n\nWere his feet not moving properly? Was his balance slightly off? Were his hands not in the right position?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/middle-east/israel-iran-ceasefire-live-updates-trump-officials-to-give-classified-briefing-to-us-congress-iran-s-supreme-leader-says-strikes-on-us-base-a-slap-to-america-s-face-20250626-p5mam3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Israel-Iran ceasefire LIVE updates: Trump officials give classified briefing to US Congress over Iranian nuclear site bombings; Iran’s supreme leader says strikes on US base a ‘slap to America’s face’",
        "publish_date": "Fri, 27 Jun 2025 11:52:20 +1000",
        "category": "finance",
        "authors": [
            "Penry Buckley"
        ],
        "text": "Oil headed for its biggest weekly decline in two years after the ceasefire between Israel and Iran, with focus shifting from the conflict in the Middle East to US trade negotiations.\n\nBrent was steady near $US68 ($104) a barrel, down almost 12 per cent for the week, while West Texas Intermediate traded above $US65. With the fragile truce holding, investors are turning their attention to progress on US-China trade talks. US Commerce Secretary Howard Lutnick said an understanding was reached last month.\n\nFire and smoke rise into the sky after an Israeli attack on the Shahran oil depot in Tehran last week. Credit: Getty Images\n\nOil has swung in a range of about $15 a barrel this week after prices spiked following US bombing of Iranian nuclear sites, before President Donald Trump declared a ceasefire between Israel and Iran. The truce eased concerns about supply disruptions from a region that pumps about a third of the world’s crude.\n\nThe trade understanding with China flagged by Lutnick comes ahead of July 9 deadline for the US to decide whether to impose global tariffs on its major trading partners. The commerce secretary added that the White House had imminent plans to reach agreements with 10 major trading partners.\n\nBloomberg",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/afl-agent-turned-soccer-boss-legal-and-tax-troubles-threaten-western-united-rescue-deal-20250623-p5m9la.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL agent turned soccer boss’ legal and tax troubles threaten Western United rescue deal",
        "publish_date": "Fri, 27 Jun 2025 11:51:09 +1000",
        "category": "finance",
        "authors": [
            "Sarah Danckert"
        ],
        "text": "Sourasis is also separately defending a lawsuit brought against him in the Federal Court by longtime co-investor George Koulouris. Koulouris alleges he is owed several million dollars in repayments for loans and investments in more than 10 businesses overseen by Sourasis, including Western United. Western Melbourne Group chairman Jason Sourasis at the club’s Ironbark Fields complex in Tarniet. Credit: Jason South He also claims in court documents that Sourasis engaged in misleading and deceptive conduct in their dealings, allegations that Sourasis denies. Sourasis’ personal financial troubles come just seven weeks after Western United trumpeted a rescue deal from US investment house KAM Sports worth $100 million.\n\nIn the months leading up to that deal, troubles at the club had been widely reported, including that it had been struggling to pay its staff as it headed into the A-League finals after finishing the season third on the ladder. Loading The KAM bailout includes a commitment from the billionaire family behind KAM Sports, the Kaminskis, to build a stadium in Tarneit and a new sporting hub for the fringe suburbs as part of a public-private partnership with the local council. The deal – which will cover the club’s tax debts, claims from other creditors and player wages– still requires regulatory approval from the league’s governing body and Wyndham City Council, and is subject to a range of requirements from KAM Sports. In the weeks since the deal was announced, the club has again been late paying wages to players in its men’s and women’s teams.\n\nOn June 20, the players’ union, Professional Footballers Australia, lodged fresh breach notices on behalf of several players. The notices allow players to void their contracts, become free agents and seek sanctions against the club if their wages are not met within 14 days. The club is also subject to a ban from FIFA in signing any new players due to its financial issues. As the deal inches towards completion, Sourasis has been keen to keep a lid on his legal and financial challenges. WMG Group plans to develop the vacant land around its stadium in Tarneit, west of Melbourne. Credit: Jason South In May, he sought to extend interim suppression orders over documents in the Federal Court case brought against him by Kouroulis, citing the risk to the deal from adverse publicity. Sourasis told the court in an affidavit that he believed a suppression order was necessary because “the investor [KAM Sports] might become concerned by adverse publicity and [that] might prejudice the investor’s willingness to complete the deal with WMG Group and Sayers Road”.\n\nHe added: “Although the investor has now executed transaction documents, I still hold such a concern because any adverse publicity might either constitute a ‘material adverse change’ or might otherwise cause the investor to exercise rescission rights under a condition precedent that the investor might otherwise have waived”. Loading However, Justice Sarah Derrington refused Sourasis’ request to keep the case under wraps until after mediation had been completed, noting that the deal had been publicly announced and Sourasis had told the court the Kaminskis were aware of the lawsuit. The financial and legal battles of Sourasis and Western United highlight the difficulties in starting a new sporting franchise (and a major public-private partnership) at a time when distributions from sporting codes for broadcast rights have been slashed, club running costs have increased, and crowd numbers are below expectations. Sourasis was for many years one of the unofficial bigwigs of Melbourne, overseeing the city’s biggest AFL player agent group – Strategic Management Australia AFL – with business partner Liam Pickering.\n\nThe pair’s business relationship soured in 2014 after Pickering poached the firm’s top clients to set up his own sports representation agency, igniting a fiery legal battle. In the past decade, Sourasis has remodelled himself as a soccer kingpin, securing the licence for an A-League team based in Melbourne’s outer western suburbs in late 2018. Steve Horvat in late 2018 following the announcement that Western United had picked up one of the new licences offered under the league’s expansion. Credit: Eddie Jim A key plank of Sourasis’ plans for Western United is the development of the stadium and surrounding sporting complex in Tarneit. The ambitious plan has been re-cut several times to bring in new investors, some of whom hope to be paid out by the KAM Sports deal. While the cash injection is expected to provide a boost to Sourasis’ plans, it might not be able to immediately stave off all of his financial strains.\n\nThe ATO’s director penalty notice to Sourasis includes $1.5 million in unpaid taxes owed by four companies not apparently related to the club, which would likely not be covered by the KAM Sports deal. Loading Court documents show Sourasis is also planning to use some of KAM Sports’ money to pay back loans he allegedly owes to Koulouris for the Tarneit project and the A-League club. However, Koulouris’ claim – which is yet to be tested in court – includes requests for repayment from a range of other unrelated developments. Sourasis is defending the action and has argued Koulouris is wrong about how much he is owed. Sourasis was sent a list of detailed questions about the club’s business issues, as well as his own.\n\nIn a statement he said: “We are looking forward to closing out the transaction with KAM Sports and adding both expertise and capital to the Western Melbourne Group. All outstanding creditors, including the ATO, are aware of the last remaining steps for approval, and all our obligations will be met once the deal completes. Loading “We’re excited about the future, and the injection of capital will help us accelerate the delivery of our vision to build a city underpinned by sports health and wellness in Melbourne’s west.” He added that he had interests in many businesses unrelated to Western Melbourne Group and Western United. “We are in negotiations with the ATO in relation to a couple of businesses that ceased trading during the pandemic and we expect to reach an amicable outcome shortly,” Sourasis said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/from-the-queen-to-trump-anna-wintour-s-career-in-pictures-20250627-p5marr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From the Queen to Trump: Anna Wintour’s career in pictures",
        "publish_date": "Fri, 27 Jun 2025 11:50:41 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "7/14\n\nMichelle Obama and Anna Wintour at the grand opening of the Costume Centre at the Metropolitan Museum of Art (2014). Obama appeared on the cover of Vogue three times. Credit:Getty Images",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/perth-eating-out/run-by-a-former-rockpool-chef-this-swan-valley-restaurant-has-all-the-makings-of-perth-s-next-big-destination-diner-20250627-p5masn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Run by a former Rockpool chef, this Swan Valley restaurant has all the makings of Perth’s next big destination diner",
        "publish_date": "Fri, 27 Jun 2025 11:40:54 +1000",
        "category": "finance",
        "authors": [
            "Max Veenhuyzen"
        ],
        "text": "Advertisement\n\nReview Eating outPerth Run by a former Rockpool chef, this Swan Valley restaurant has all the makings of Perth’s next big destination diner Thoughtfully sourced ingredients treated with a gentle, confident touch beat at the heart of this thrilling wine country lunch. Max Veenhuyzen June 27, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 5 Ginveristy gin-cured fish with fermented tomato and finger lime. Supplied 2 / 5 Walpole venison shoulder and leg with a tomato and rosemary jus. Supplied 3 / 5 Seared Shark Bay scallops with courgette and lime. Supplied 4 / 5 Venison tasting plate with potatoes fondant and gem lettuce. Supplied 5 / 5 Berkshire pork proscuitto with grilled figs. Supplied Previous Slide Next Slide Good Food hat 15.5 / 20 How we score Australian$$$$ Justin Hughes is, at heart, a boy from the country. He grew up on a farm in the Avon Valley where parents Tony and Gayle ran sheep. Orphaned lambs became family pets. As a teenager, Justin and his mates swapped eskies filled with meat from happy animals raised entirely on the properties where they were born. Of course, even the happiest of country kids starts daydreaming about city adventures. For Justin, those dreams entailed enrolling at uni, dropping out of uni and starting a cooking apprenticeship under dad who ran catering at the WACA. Justin clearly enjoyed the change. So much so that he moved to the biggest city of them all to sharpen his skills at Sydney fine diners including Becasse and Rockpool while Neil Perry’s flagship was transitioning to Eleven Bridge. Health issues, alas, forced Justin to not just come home, but to take a break from high-performing kitchens.\n\nAdvertisement\n\nOscar’s in the Valley is an airy dining room rich in circa-2000s Country Style charm. Naturally, your minds should have already fast-forwarded to the part where Justin recovers and starts (re)cooking his food and rediscovering his groove, a la John Favreau’s 2014 comedy-drama Chef. While Justin’s change isn’t quite as drastic as fine dining runaway Carl Casper buying a food truck, his current workplace sits a few notches below Eleven Bridge and its gueridon service and three-hat sizzle. But as we all know, good eating is no longer limited to places with double-dressed tables. So onto Oscar’s in the Valley: an airy dining room rich in circa-2000s Country Style charm. It’s a place where guests can coo at vines, olive trees and the original copper still that kick-started the legend of Limeburners. Prior to becoming the Swan Valley tasting room for Limeburners and its gin offshoot Ginversity, this address housed popular wedding venue Carilley Estate. It was around this time last year that Oscar’s signed on to the lease at this spacious Herne Hill sharehouse. Should circumstances require, Oscar’s can accommodate the multigenerational group chasing lunch – some ace grass-fed beef perhaps, or line-caught snapper from Exmouth – before that next winery, brewery or distillery visit. But to get the full measure of a place poised to be Perth’s next big destination restaurant, a dine-and-dash won’t suffice. Instead, opt into one of the tasting menus, clear the rest of the afternoon, study the ripper drinks lists rich in local treasures. Then let this masterclass in provenance unfold. While the make-up of lunch is dictated by party size, the number of courses chosen and what’s in the kitchen’s larder and veggie crisper, every table gets the tangy spelt and wholemeal sourdough: thick, decidedly unfluffy and dense like mudcake. It’s ace with the accompanying house ricotta yet has the chops to also perform solo.\n\nAdvertisement\n\nJuniper-spiked mascarpone (also house-made) and crushed hazelnuts offer soft and crunchy counterpoints to roasted broccoli stem and scraps of fried Tuscan kale: a streetwise ode to autumnal flavours. Squeaky runner beans are grilled hard and gently sharpened by the haunting brightness of preserved lemon. This is farmhouse cooking not (just) by dint of location, but because of the menu’s tangible appreciation for farming, farmers and fidelity to ingredients. Chefs are fond of “letting the product speak for itself” and leaving what’s in their shopping baskets well enough alone. While some dishes at Oscar’s demonstrate such hands-off thinking – check out that rosy pickled veg made using vinegars from local growers Baba & Didas! – good cooking isn’t (just) about doing the least to an ingredient: it’s about doing the right thing to it. Sometimes that means smoking wings, cheeks and other fishy offcuts, then dousing everything in a heady sauce of smoked fish bones: a nod to the Basque signature, pil pil. Justin calls this dish “smoked WA whitefish”. I call it one of the finest things I’ve eaten this year. Related Article Into Africa: meet the cooks and restaurants flying the flags for African cuisine in Perth But sometimes the right way to treat something is to let it be. Berkshire pigs plus salt and patience equals fantastic prosciutto. A tiny cool room has been set aside for dry-ageing and hanging purposes: not in a showy, 4126-day ribeye sort of way, but to give meat the time – typically a couple of weeks – to begin developing flavours and naturally tenderise. In this case, such meats include richly flavoured Gwamby Grazing lamb, Walpole venison and other whole animals butchered in-house.\n\nAdvertisement\n\nThe twin pleasures of the venison duo – loin plus a roulade of peppery shoulder meat – suggests the relationship between Oscar’s and its meat wrangler Bully Butcher is a win for all. My hunch was confirmed by the lamb tasting plate and its many ovine glories, from the crispness of skin-on lamb belly to the funk-free richness of the fat crowning slices of tender lamb leg. Forming genuine connections to people and places doesn’t just get you good meat: it helps you maximise the resources at hand. Fallen gum trees from the property fire the grill. Fat from dry-aged animals is rendered to help produce all-time potatoes fondant. Late-summer tomatoes brought in by locals, once fermented, become the perfect finishing touch for Spanish mackerel cured in a salt mix modelled on Ginversity’s native gin. Related Article 14.5 / 20 Review Small wonder: Willetton’s Little Gan’s rethinks the suburban, family-run Asian restaurant Does it read like I’m frothing on Oscar’s? Good, because I am. While Oscar’s is firing after its first year in Herne Hill – previously, it was based in Guildford before building issues forced it to relocate – what’s really exciting is that this feels like an operation on the ascent. Easy-going service led by restaurant manager Daniel Adam and Justin’s parents feels perfect for the setting; second-generation vigneron Tom Daniel of nearby Chouette Wine in Millendon is helping rehabilitate the property’s vines; plus Justin just moved his young family into the farm next to Oscar’s, which he’ll also be slowly resurrecting. “There’s so much room for us to grow,” says Justin as he excitedly talks about the existing orchard, arable land and potential of his new six-hectare home.\n\nAdvertisement\n\nPart of his excitement, I think, comes down to the prospect of creating a place that proudly reflects its Swan Valley address. The other part? Well, at the end of the day, Justin Hughes is a boy from the country: a boy and chef, I might add, that diners should be tracking very, very closely. The low-down Atmosphere: a Swan Valley farmhouse restaurant posed to be WA’s next big destination diner. Go-to dishes: smoked whitefish. Drinks: world-class whiskies – occasionally at justifiably world-class prices – backed by thoughtfully chosen WA wines with a heavy focus on Swan Valley producers. Cost: about $160 for two people. Good Food reviews are booked anonymously and paid independently. A restaurant can’t pay for a review or inclusion in the Good Food Guide.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/about-schmidt-facing-the-challenge-of-the-lions-20250625-p5maaq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "About Schmidt: Facing the challenge of the Lions",
        "publish_date": "Fri, 27 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size For a few precious minutes, and with a frenzy of organised chaos swirling around him, Joe Schmidt sits down and sits still. The scene is the bowels of a cavernous studio building in Eveleigh, where a freshly-gathered Wallabies squad are busy trying on Test jerseys, white dress shirts and suit pants, picking through boxes of shoes and boots, posing for headshots and filming “content” for a variety of hungry stakeholders. There are only a few hours allocated before the whole circus must move on to training, so there are complex spreadsheets of players’ names, duties and locations taped up on concrete pylons. Massive bodies hustle between stations like a Tokyo pedestrian crossing. For a self-confessed planning obsessive, it’s hard to know if Schmidt is in his happy place, or mildly terrified. Or a bit of both. Every day of the next five weeks will feel a little like this for Schmidt and the Wallabies, as the much-anticipated British and Irish Lions tour hurtles around the country. Though the lead-in time is longer than any in modern sport, with tours to Australia only held every 12 years, once the show is underway, preparation timelines are measured in minutes. One of Schmidt’s stations on the pylon sheet is an interview to spruik ResMed, who are the official ‘sleep sponsor’ of the Lions tour. Schmidt laughs at the irony: he barely gets any sleep.\n\nAdvertisement\n\n“I need some sleep advice alright - it wouldn’t be something that is a strength of mine,” Schmidt says. “But I certainly feel like I have plenty of energy anyway with what’s coming up, and the good group of men that we have.” In truth, Schmidt has been preparing at this pace for weeks, and at a similarly frantic tempo since he took on the Wallabies job in January last year. With the Wallabies, and Australian rugby, at one of their lowest ebbs in the wake of the 2023 Rugby World Cup, Schmidt signed up and began planning backwards from August 2, 2025. That’s the date of the Wallabies’ third Test against the British and Irish Lions in Sydney. And it was, initially, the end of his contract, though that would be pushed back several times. It was a mammoth job with a perilously short runway, so it was assumed some of Schmidt’s motivation was the rare chance to coach against the British and Irish Lions. One of the final boxes to tick on a distinguished coaching CV. Wallabies head coach Joe Schmidt signs autographs for school children. Credit: Getty Images for ARU\n\nAdvertisement\n\nNot so, says the 59-year-old Kiwi. “It was seriously just the opportunity to try to elevate the footprint of the Wallabies,” Schmidt says. “Having coached against the Wallabies a number of times, both with the Irish and the All Blacks, the Wallabies is a massive brand in the international game and it was probably tarnished a little bit in the performances at the World Cup, so it was just to try to help. “I don’t have a magic formula or anything, I’m very ordinary, but I work hard and when (RA high performance boss) Peter Horne asked me if I’d try to help, I just felt that the Lions, because it’s such a big occasion, it really gives us an opportunity to become a little bit more visible here in Australia.” Schmidt senses progress on that front. Where once only Irish people in “County Coogee” would stop him in the street, now people with broad Aussie accents are keen to yarn about the rise of the Wallabies over the past year, and their chances against the Lions. That energises him, too. Unlike many in the game, Schmidt never really dreamed about being part of a Lions series.\n\nAdvertisement\n\nIt was not on a coaching bucket list, and while he often spoke with Lions coaches when coaching Ireland about players and endorsed their cases for selection, Schmidt never took up approaches to be involved with the Lions set-up. “It was never something that I’d aspired to be involved in, but they always excited me,” Schmidt said. “The one thing I do remember as a kid, I must have been really young, but there was a Lions test, I think it was the fourth Test in 1971, and the All Blacks had to win it to draw the series. “The Lions had legends like JPR Williams, Barry John and Carwyn James, and the All Blacks had Colin Meads and Brian Lochore, Sid Going - these guys I grew up admiring. I just remember a dog ran on the field and a guy tripped over it. That’s what you remember when you’re a kid, I suppose.” Lions’ star Barry John streaks away in the fourth Test in 1971, from New Zealanders Wayne Cottrell, Ian Kirkpatrick and Sid Going. Credit: Fairfax But fast-forward 54 years and, somehow, Schmidt has found himself about to lead Australia into battle with the famous Lions touring side. Since taking on the Wallabies job last year, Schmidt has been happy to admit it’s all a bit daunting. The very best of four nations against a team who missed the Rugby World Cup finals. At no.8 in the world, the current Wallabies are the lowest-ranked host nation of a Lions tour in the professional era - by some distance. Five of the previous seven hosts were reigning world champions.\n\nAdvertisement\n\nBut there is also level of familiarity about the Lions that has helped Schmidt eventually get off to sleep. The Lions coach is Andy Farrell, who was Schmidt’s defence coach at Ireland, and there are multiple assistants and Lions players who were once part of his Dublin life, too. The Lions’ patterns of play will likely have some of his fingerprints on them. Schmidt and Farrell are good mates and have even made a pact, of sorts, to try and keep the upcoming series on friendly terms, too. Schmidt cites the toxicity of the Lions’ last tours of South Africa and New Zealand, which became soured by feuds about refereeing criticism and off-field controversies. Coach Andy Farrell at Lions training in Dublin. Credit: Getty Images Then-Lions coach Warren Gatland said last year: “In South Africa (in 2021), it was almost a win at all costs, the ends justifies the means. It didn’t feel like it was about rugby. It was almost like things off the field were trying to upset players or the team, and it was deemed acceptable.” Schmidt says: “I would know a lot of these players coming over, and would have massive respect for the people they are, as well as the players they are. And I think my ideal around this was, having been at the 2017 games and seeing how edgy it was, and then the Springbok tour last time, where it probably didn’t do a massive amount for promoting the game in a really positive light.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/this-serial-pest-called-a-woman-a-fat-dumb-blonde-he-says-he-was-being-picked-on-20250604-p5m4z1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This serial pest called a woman a ‘fat dumb blonde’. He says he was being picked on",
        "publish_date": "Fri, 27 Jun 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jordan Baker"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Andrew Thaler knew he was wrong to call a fellow Snowy Monaro councillor a fat liar, and for publicly arguing that if a non-binary council employee couldn’t work out their gender – “know whether it’s a boy or girl”, as he put it – they wouldn’t be able to do their job, his barrister, the former Labor MP Adam Searle, told a tribunal this week. Thaler himself was less emphatic about his regret. “It’s hard to express remorse for telling the truth,” he said under cross-examination, arguing his “robust” language was self-defence. He argued he was not speaking as a councillor, but he was merely quoting himself from a pre-election article in this masthead when he described fellow councillor Tanya Higgins as a “fat dumb blonde, it’s physically obvious”. Thaler also doubled down on his view that the staff member was a DEI (diversity, equity and inclusion) hire, invoking a Trumpian term. He also said his use of the pronoun “it” did not necessarily dehumanise them, but rather highlighted their internal conflict. In fact, Thaler said, he was the one being picked on. He told the NSW Civil and Administrative Tribunal (NCAT), as it considered his appeal against a three-month suspension, that some of his fellow councillors had been hostile ever since his election last year, when they tried and failed to uphold a longstanding ban on his presence in council chambers (which arose from the risk council felt his behaviour posed to its staff; his election to the council in September automatically overturned the ban). Andrew Thaler is attempting to overturn his three-month suspension for councillor misconduct. Credit: Alex Ellinghausen But he thinks they dislike him “because I’m a man”, he told the tribunal. “It’s because I have five kids. It’s because I’ve been married for 19 years … those are the things that [people are hostile about] at that council.” The drawn-out saga over Thaler’s behaviour has gripped the Snowy Monaro region, where he was known as a serial pest before being elected to public office with little more than 100 first preference votes. His behaviour while a councillor has prompted the minister to issue a performance improvement order to the council, that says the drama is interfering with the operations of local government. His comments about the councillor and staffer in March earned him a three-month suspension, the maximum, from the Office of Local Government (OLG). But the Snowy’s controversy is the pointy end of a bigger issue. Councillors are behaving badly across the state, yet the NSW system for holding them accountable is broken. This has been openly acknowledged across the sector for at least 10 years, but there has been no reform.\n\nAdvertisement\n\nA government discussion paper last year laid out the problem. Council debates are “too often personal slanging matches”, it said. Frivolous complaints clog the system, leaving little capacity for it to deal with serious issues. The system for handling misconduct should not be so unwieldy and ineffective that it inhibits “the operation and function of local democracy”. Councils manage their own complaints (which can lead to politicisation), but can refer them to the OLG if they think it’s warranted. In the financial year to June 2024, Bathurst clocked up the most complaints with 38 (none were upheld), followed by Lismore with 24 (none were upheld) and Sutherland with 23 (again, none were upheld). Of a total of 381 complaints, only 45 were found to constitute a breach. They cost almost $1.5 million to investigate. There were also concerns from the sector that penalties for councillor misconduct, when upheld, are too light. The maximum suspension the OLG can hand out is three months, while NCAT can issue a disqualification of up to five years. A 2022 report found the sector was concerned that the sanctions, and the OCG and NCAT’s reluctance to invoke strong ones, was an ineffective deterrent to poor conduct. That earlier report, commissioned by the Coalition government, raised myriad problems with the system, ranging from conflicts of interest, partisan behaviour, incompetence, and the lack of appropriate penalties when misconduct was found. “Key stakeholders in the sector have lost confidence in the current arrangements,” it found, and called for an overhaul. A road map for change went to cabinet in February 2023, just before the election. But when Labor won, the new local government minister, Ron Hoenig, jettisoned that plan and began his own review.\n\nAdvertisement\n\nAnother discussion paper was released in September last year. There’s not enough dignity in local government, it said, and proposed letting the OLG issue fines to councillors, suggested a privileges committee of experienced mayors examine allegations of misbehaviour, and said bans should be solely imposed by tribunals such as NCAT (they often end up there on appeal, anyway). It also proposes councillors have to rid themselves of real estate and development business activity and contracts. A spokeswoman for Hoenig said the Labor government felt the Coalition’s solution would add more bureaucracy and complexity “to an already broken system”. A new code of conduct, mechanisms to “surcharge” councillors for frivolous complaints and a new meeting code would be released “soon”, she said. Councillor Tanya Higgins (right, pictured with neighbour Bronnie Taylor) was targeted by Andrew Thaler in his social media posts. Credit: Alex Ellinghausen The behaviour problem is putting people – particularly women – off running for local government. A Victorian survey found 61 per cent of female local councillor respondents had experienced threatening or intimidating behaviour from fellow councillors, while another study found half of women left council after the first term. Women have been among Thaler’s most frequent targets; he has called female elected officials dumb, fat, a pig, deliberately childless, a horrendous excuse for a human, and has told a state MP – and, on a separate occasion, this reporter – to go “suck a dick”. Licia Heath from Women for Election said women were increasingly leaving councils due to bullying and harassment. “We will shortly have a crisis of representation in local government,” she said. That will affect other levels, as state and federal MPs often cut their teeth in council.\n\nAdvertisement\n\n“I’m getting increasingly concerned that there will be a pipeline issue of talented women in our state and federal parliaments, unless relevant ministers insist now on a similar review as the Kate Jenkins Set the Standard to be conducted at the local government level,” Heath said referring to a report by the former sex discrimination commissioner. Thaler is right that there are people in the area who don’t like him. Before he was elected, he’d been banned from council chambers because his behaviour was considered a workplace health and safety risk. He’d also been banned from a few businesses. He was the subject of 19 complaints over a two-month period last year, the performance improvement order said; complainants alleged his behaviour left staff and fellow councillors feeling unsafe, anxious and in one case, physically sick (Thaler said he was never given a chance to respond, and those complaints have not been investigated). Loading He told the tribunal that the council had sought legal advice about what to do with him, which said it could not ban him but they could “discipline me out of council”. In his appeal against his suspension on Tuesday, Thaler’s barrister, Searle, argued the decision made by the Planning Department deputy secretary responsible for local government was invalid because he had not conducted a proper investigation first. He also said a three-month suspension was too harsh. “We would say the applicant would say not much weight should be given to those incidences, they occur in the context of Councillor Thaler raising significant matters of public interest,” he said. Thaler insisted he was telling the truth when he used the word liar, despite not being able to produce evidence, but admitted he should not have referred to the councillor’s size.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/hotels-banquets-and-cheap-travel-beijing-woos-taiwan-s-youth-20250613-p5m79c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hotels, banquets and cheap travel: Beijing woos Taiwan’s youth",
        "publish_date": "Fri, 27 Jun 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Lisa Visentin",
            "Daniel Ceng"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Sitting in a cafe in southern Taiwan, tourism graduate Richard Huang makes a frank admission. Some of his friends have questioned whether he is a tool of the Chinese Communist Party, helping to spread Beijing’s worldview through his social media. On his Instagram account, Huang spruiks the Beijing-subsidised trips he has taken to places like Xinjiang, a province in China’s north-west, and offers to help set up his followers on similar exchange programs targeted at Taiwanese youth. Chinese influencer Yaya (Liu Zhenya) was forced to leave Taiwan after authorities deemed her online comments in support of Chinese military drills a threat to Taiwan’s national security. Credit: Anadolu via Getty Images “My friends have asked me: “Hey, aren’t you worried you are being brainwashed?,” says Huang, a pseudonym that he requested to speak openly about his experience. “My response is: as long as you are resilient in your own mind, you won’t be compromised by the influence coming from these trips.” As part of an eight-day tour to Xinjiang, Huang and about 30 other Taiwanese students and graduates were put up in 4-star hotels and treated to nightly banquets. By day, their itinerary included visits to museums and cultural activities, such as musical performances by Uyghur groups, an ethnic Muslim minority in Xinjiang. The activities were peppered with speeches from Chinese officials about Taiwan and China being “one big family”. At one event, the group sang Tomorrow Will be Better, a Taiwanese pop song from the 1980s that has since been appropriated by Chinese state media to promote a message of unification between the democratic self-governing island and the mainland. China claims Taiwan as part of its territory, even though the CCP has never controlled the island.\n\nAdvertisement\n\nThe propaganda, Huang says, is the price participants pay for a cheap trip. He paid 20,000 Taiwanese dollars ($1043), about a 50 per cent discount, he says, with the rest subsidised by the Chinese government. Richard Huang, who requested his identity be concealed with a pseudonym, promotes Beijing funded trips to Taiwanese youth. Credit: Daniel Ceng But there was another subtle quid pro quo. During the tour, Chinese officials suggested the participants share their experience on social media and tell their friends that Xinjiang was not the terrible place portrayed by Taiwanese media. When he arrived back in Taiwan, Huang did just that. “The magnificent scenes covered by a blanket of snow, the heaps of food I had, and the diversity of ethnic cultures and traditions I experienced – the list never ends, and the beauty of Xinjiang is beyond what photos and words can describe,” Huang posted on Instagram. He implored his friends to go and see for themselves. Huang made no mention of the reports, including those by the United Nations, of the brutal repression and human rights violations of the Uyghur population by Chinese authorities, claims which the Chinese government denies. Instead, he observed that the different ethnic groups got along with “great friendliness and tolerance”. United Front campaign\n\nAdvertisement\n\nState-sponsored travel programs are hardly a new tool in Beijing’s soft-power efforts to shape opinions in Taiwan in line with its foremost goal – to bring the island under the control of the Chinese government. But under President Lai Ching-te, the Taiwanese government has become increasingly concerned that Beijing is intensifying its propaganda, with study tours, tourism, cultural exchanges and social media influencers all spreading pro-Beijing messages to Taiwan’s youth. These activities are widely suspected by Taiwanese authorities and Chinese analysts to be part of the operations of the United Front Work Department – the CCP’s core influence arm that uses diaspora communities to promote Beijing’s agenda overseas. A sign displays slogans “China’s ethnicities, one family” and “Forever follow the party” in Aksu, Xinjiang. Credit: AP China’s Foreign Ministry was contacted for comment. Dr Nathan Attrill, a China specialist at the Australian Strategic Policy Institute, has tracked United Front activity relating to Taiwan. He identified 67 events in 2024 that sought to cultivate Taiwanese Youth and influencers, more than double the next most targeted group of businesses and entrepreneurs. “The main themes of these sorts of events are always to emphasise a shared culture, or a shared heritage between the peoples of China and Taiwan, thereby establishing some sort of justification for why China claims to have sovereignty over Taiwan,” Attrill says.\n\nAdvertisement\n\nBeijing doesn’t try hard to hide the United Front’s involvement in these tours. The exchanges are often given effusive coverage in Chinese state media, which routinely notes the attendance of United Front officials or their associated organisations at the events. Trips to Xinjiang, a top destination for such cultural tours, serve the dual purpose of presenting a tightly orchestrated, sanitised image of the region while promoting the Chinese government’s unification agenda, says Raymond Sung, vice president of the Prospect Foundation, a government-backed institute in Taipei. ‘I do not support the idea of being fully controlled by China ... The only thing that I want to do is to foster cultural exchanges between the two sides.’ Richard Huang “By being a participant, you’re actually sponsoring or being part of that [Chinese government propaganda],” Sung says. These kinds of exchanges, experts say, are also designed to cleave at the deep political polarisation in Taiwan. Lai’s pro-independence-leaning Democratic People’s Party is reviled by Beijing as a separatist force, and bitterly opposed by Taiwan’s main opposition party, the Kuomintang, which favours closer ties with the mainland. Beijing’s Taiwan Affairs Office has accused Lai’s government of inciting anti-China sentiment by “exaggerating the so-called united front threat” and “using all means to intimidate and suppress groups and individuals on the island who support and participate in cross-strait exchanges”. For now, Beijing’s charm offensive to win the hearts and minds of Taiwan’s younger generations doesn’t appear to be paying off.\n\nAdvertisement\n\nPolling consistently shows that a clear majority of people in Taiwan identify themselves as being solely Taiwanese. This rose to as high as 83 per cent for 18-34 year-olds, compared with 15 per cent who identified as being Taiwanese-Chinese and 1 per cent who considered themselves to be solely Chinese, according to a Pew Research survey in 2024. Tensions between propaganda and free speech Nonetheless, the Lai government this year has pursued a crackdown on China’s united front and espionage efforts, including tighter regulation of cross-strait exchanges and new disclosure requirements for all public servants travelling to China on such trips. In February, Taiwan banned academic exchanges with three Chinese universities, citing concerns over political influence, and in March, authorities expelled three Chinese influencers for promoting “unification by force” narratives on their social media accounts. The authorities have since revealed they are investigating 20 Taiwanese celebrities for amplifying CCP messaging. Building on the themes of this campaign, Lai embarked this week on a 10-stop speech tour across Taiwan under the banner of “uniting the country” in the face of China’s pressure. In his first speech on Sunday, he declared “of course Taiwan is a country” and called for its future to be decided by its 23 million citizens, infuriating Chinese authorities, which slammed his speech as “deliberately inciting provocations”. The expulsion of the Chinese influencers has fed into a broiling debate about free speech, and the curbs Taiwan is willing to put on its own democracy to counter the tactics of its authoritarian neighbour. Taiwan’s President Lai Ching-te has made countering on Chinese state influence a key priority of his government, but some measures have sparked about debate about free speech concerns. Credit: Daniel Ceng\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/luxury-sydney-apartment-sells-for-141-55m-setting-national-home-price-record-20250624-p5m9v7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Luxury Sydney apartment sells for $141.55m, setting national home price record",
        "publish_date": "Fri, 27 Jun 2025 11:17:43 +1000",
        "category": "finance",
        "authors": [
            "Tawar Razaghi",
            "Kristy Johnson"
        ],
        "text": "Multimillionaire Yan Zhang has paid $141.55 million in cash for Australia’s most expensive home, a penthouse overlooking Sydney Harbour.\n\nZhang bought the top three floors of Lendlease’s One Sydney Harbour development at Barangaroo South.\n\nAn artist’s impression of the $141 million penthouse sold atop Lendlease’s Residences One tower at One Sydney Harbour. Credit: Supplied\n\nThe off-the-plan sale, inked in 2019, is an amalgamation of the two-storey penthouse of the Renzo Piano-designed building, which is for himself, and a sub-penthouse directly below, for friends and family to stay in. The home settled with no mortgage on title.\n\nThe sale tops all of Australia’s previous confirmed house and apartment records, including Atlassian co-founder Scott Farquhar’s $130 million sale of the Point Piper mansion Elaine, which settled to a consortium of developers last week who are planning to carve it up and sell it off in four lots.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/not-my-friend-kim-williams-lashes-austen-tayshus-amid-fresh-scandal-20250627-p5mar2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Not my friend’: Kim Williams lashes Austen Tayshus amid fresh scandal",
        "publish_date": "Fri, 27 Jun 2025 11:12:06 +1000",
        "category": "finance",
        "authors": [
            "Calum Jaspan"
        ],
        "text": "Kim Williams has lashed Austen Tayshus after it emerged the once-prominent comedian continues to invoke the ABC chair’s name in heated messages, this time to a former staffer at the broadcaster.\n\nMore correspondence was revealed by 2GB on Friday morning, two months after Media Watch exposed the comedian’s use of Williams’ name to pressure ABC staff to give him air time. This time, Tayshus, real name Sandy Gutman, refers to himself as “mate of Kim Williams” in a message to former Radio Sydney host Josh Szeps.\n\nComedian Austen Tayshus (left) and ABC chair Kim Williams. Credit: AP, Alex Ellinghausen\n\nThe message, which was sent on Facebook Messenger to Szeps, appears to be in relation to an opinion piece written by Szeps in The Sydney Morning Herald. Gutman, who is Jewish, called Szeps’ a “half-Jew” for critiquing Israel over its military campaign in Gaza.\n\n“What you did is dangerous to others. You can sleep well. Just shut up and keep these opinions to yourself at this dangerous moment,” Gutman wrote.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/celebrity/australian-collector-buys-princess-diana-s-caring-dress-for-520-000-20250627-p5maq7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian collector buys Princess Diana’s ‘caring dress’ for $520,000",
        "publish_date": "Fri, 27 Jun 2025 10:54:47 +1000",
        "category": "finance",
        "authors": [
            "Nick Newling"
        ],
        "text": "An Australian collector of Princess Diana memorabilia has purchased the iconic “caring dress” at auction for US$520,000 (approximately AU$794,000), 37 years after the purchaser met the princess wearing the dress.\n\nRenae Plant – who manages an archive of 2700 Diana pieces as well as the virtual Princess Diana Museum – fell to the floor crying after placing the final US$400,000 bid (plus US$120,000 in fees) for the Bellville Sassoon dress designed for then-prince Charles and Diana’s 1988 tour of Australia to mark the bicentenary.\n\nThe floral day dress was expected to sell for between US$200,000 and US$300,000 according to pre-auction documents. It received its nickname after Diana wore it repeatedly to visit hospitals across the world, including in Nigeria, Brazil and Spain, says designer David Sassoon.\n\nOn the website for The Princess Diana Museum, Plant says she met the royal couple as a teenager during their 1983 and 1988 tours, and shook hands with the princess while she was wearing the dress at St Andrew’s Cathedral in Sydney.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/anna-wintour-to-step-down-us-vogue-editor-in-chief/8eux49giy",
        "title": "Anna Wintour to step down as US Vogue editor-in-chief",
        "publish_date": "Fri, 27 Jun 2025 00:34:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "Anna Wintour has stepped down as editor of US Vogue after 37 years, during which she was often hailed as the single most influential figure in the fashion world.\n\n\n\n\n\nShe will no longer run day-to-day editing of the fashion bible, but magazine group owner Condé Nast was quick to deny suggestions of retirement.\n\n\n\n\n\nShe will continue to hold senior roles at the group and remain Vogue's global editorial director.\n\n\n\nWho is Anna Wintour?\n\nWintour became editor-in-chief of US Vogue in 1988 and transformed it into a powerhouse that set trends, and could often make or break designers, celebrities and brands.\n\n\n\n\n\nKnown to some as \"Nuclear Wintour\" for her decisive leadership, such as axing work without discussion, she was also a fixture in the front row at catwalk shows with her unchanging bob haircut and sunglasses.\n\n\n\nREAD MORE 2025 Met Gala: Nicole Kidman and Sarah Snook among stars arriving in New York\n\nFor many years, she has also run the Met Gala, an extravagant Manhattan charity event that attracts an A-list of stars from across fashion, film, politics and sports.\n\n\n\n\n\nJoe Biden awarded her the Presidential Medal of Freedom, the top US honour, before leaving office in January.\n\n\n\n\n\nWintour was made a British dame in 2017 and in February this year became a companion of honour — an elite recognition.\n\n\n\nIs Anna Wintour retiring?\n\nWintour is not expected to retire, but will continue as Condé Nast's chief content officer. She will continue to oversee publications including Vogue, Wired, Vanity Fair, GQ, Condé Nast Traveler and Glamour.\n\n\n\n\n\nWintour announced at a staff meeting in New York that US Vogue would seek a new head of editorial content.\n\n\n\n\n\nIn remarks reported by the New York Times, she called it a \"pivotal decision\" but stressed she would not be moving out of her office.\n\n\n\n\n\n\"I'll be turning all my attention to global leadership and working with our team of brilliant editors around the world.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/national-hiv-crisis-declared-in-papua-new-guinea/3s5f4dm4x",
        "title": "National HIV crisis declared in Papua New Guinea",
        "publish_date": "Thu, 26 Jun 2025 22:30:09 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "As transmission rates soar, Papua New Guinea has declared a national HIV crisis to try and galvanise action to prevent the spread of the virus.\n\n\n\n\n\nUNAIDS and the World Health Organization estimate the Pacific nation recorded 11,000 new cases last year alone.\n\n\n\n\n\nThat's equivalent to 30 new positive tests a day, including seven newborns, who can be prevented from contracting HIV through antiretroviral therapy.\n\n\n\n\n\nPNG health minister Elias Kapavore said the trend was \"deeply concerning\" when declaring the national crisis at a press conference.\n\n\n\nEmergency response activated\n\nThe declaration activates a national emergency response plan, enabling cross-sector coordination and investment in HIV services.\n\n\n\n\n\nAdding to the anguish at the figures is the advancement of treatment and prevention options for HIV.\n\n\n\n\n\nMost crucial is improving testing rates, so that more of the estimated 120,000 in Papua New Guinea with HIV can seek treatment.\n\n\n\n\n\nActing PNG health secretary Ken Wai said testing every pregnant woman can allow them to know their status and then access medication that prevents transmitting the virus to their child.\n\n\n\n\n\n\"We must scale up access to HIV testing and treatment, particularly for groups most at risk. These priority initiatives should be offered at health facilities nationwide, and will require community leadership and support,\" he said.\n\n\n\n'A disease of inequality'\n\nKapavore called HIV a \"disease of inequality\" and said it was \"time for all of us to step up\".\n\n\n\n\n\n\"I personally commit to raising this issue with my fellow ministers and parliamentarians and ensuring the urgent allocation of resources to protect our people — especially the next generation of Papua New Guineans,\" he said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/inside-the-trillions-australians-own/wnut1s7kv",
        "title": "Inside the $17.3tn Australians own: Here's where the most money is held",
        "publish_date": "Thu, 26 Jun 2025 19:39:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Household wealth grew 0.8 per cent in the March quarter, new data by the Australian Bureau of Statistics (ABS) has found, meaning Australians now own a total of $17.3 trillion in assets.\n\n\n\n\n\nThat increase was largely driven by the value of residential land and dwellings — up 1.2 per cent, or $125.3 billion.\n\n\n\n\n\nFebruary's interest rate cut — the first since November 2020 — wasn't just a win for those paying off mortgages; property owners in general have seen their value of their assets increase.\n\n\n\n\n\n\"We've seen that rate cut in Australia start in February, and the housing market has started to anticipate that. Even though the month of January was a bit soft, house prices are ticking up again,\" AMP chief economist Shane Oliver said.\n\n\n\n\n\n\"That, of course, is benefiting those Australians who have house and land. It's not so good for those Australians trying to get into it.\"\n\n\n\nWhere did wealth fall?\n\nThe ABS data showed superannuation assets fell 0.4 per cent, or $16.4 billion, in the March quarter, something experts attributed to market uncertainty.\n\n\n\n\n\n\"Household superannuation balances fell for the first time since the September quarter 2022 as global uncertainty weighed on share prices,\" ABS head of finance statistics Mish Tan said.\n\n\n\nThe total value of Australian land and dwellings was calculated to be $11.6 trillion (tn), far outweighing other non-financial assets at only 0.9 trillion. Source: SBS News That fall continued into the early part of April with United States President Donald Trump's Liberation Day tariff announcements.\n\n\n\n\n\n\"April turned out okay for the share market and then saw a rebound as Trump backed away and went onto a pause for the tariffs. But the damage was done through the March quarter as share markets fell in response to the tariffs,\" Oliver said.\n\n\n\n\n\n\"A typical super fund would see about 60 or 70 per cent of its assets invested in shares. When shares take a tumble, that of course affects super fund returns.\"\n\n\n\nREAD MORE How can trillions just disappear? What you may not know about the stock market\n\nWealth among the wealthiest growing 'much faster'\n\nWhile Australia might be getting richer, that wealth isn't distributed equally.\n\n\n\n\n\nAccording to 2024 statistics from the Australian Council of Social Service (ACOSS) and UNSW, the wealthiest 10 per cent of households in Australia own 44 per cent of all wealth, with an average of $5.2 million per household.\n\n\n\n\n\nThe average wealth of the richest 10 per cent of households was also growing \"much faster\" than the wealth of the lowest 60 per cent, ACOSS and UNSW found.\n\n\n\n\n\nWith the majority of Australia's wealth in land and dwellings, it's not surprising that wealth inequality manifests itself in housing — where a generational wealth divide has become more pronounced in recent decades.\n\n\n\nThe most recent ABS Census found 66 per cent of Australian households owned their own home — a figure that has remained roughly the same since the 1970s.\n\n\n\n\n\nHowever, home-ownership rates among younger Australians have declined dramatically in that period.\n\n\n\n\n\nAccording to the Australian Institute of Health and Welfare, the home ownership rate of 30–to-34-year-olds decreased from 64 per cent in 1971 to 50 per cent in 2021.\n\n\n\n\n\nIn that same span of time, the rates of home ownership among Australians aged 25–29 declined from 50 per cent to 36 per cent.\n\n\n\nHousing prices set to continue rising\n\nOliver said he suspects wealth increases will continue.\n\n\n\n\n\n\"Right now, it looks like interest rates are heading lower, which will probably push up house prices and land prices further. So, I suspect that the housing component of residential wealth will see further gains through the remainder of the year,\" he said.\n\n\n\n\"For the share market, it's probably going to be a bit of a volatile ride ... The noise around tariffs and the Middle East has led to a bit of roughness, but overall the trend has been up.\"\n\n\n\n\n\n\"Interest rates coming down will probably also support shares and therefore support superannuation returns.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/could-3d-printed-homes-solve-the-housing-crisis/en0u77kj4",
        "title": "Could 3D-printed homes solve the housing crisis",
        "publish_date": "Thu, 26 Jun 2025 10:18:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/thailand-will-recriminalise-recreational-cannabis-market/kdt647hrv",
        "title": "Thailand to recriminalise recreational cannabis market",
        "publish_date": "Thu, 26 Jun 2025 09:34:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Three years after decriminalisation, Thailand is tightening control of cannabis by banning sales of the plant to those without prescriptions.\n\n\n\n\n\nThailand became the first country in Asia to decriminalise cannabis in 2022, a move that boosted Thailand's tourism and farming industries and spawned thousands of shops.\n\n\n\n\n\nBut the country has faced public backlash over allegations that under-regulation has made the drug available to children and caused addiction.\n\n\n\n\n\nHealth Minister Somsak Thepsutin has signed an order that bans shops from selling cannabis to customers without a prescription. It also seeks to reclassify cannabis buds as a controlled herb.\n\n\n\nREAD MORE Why Thailand is outlawing cannabis only two years after legalising it\n\nThe ruling Pheu Thai Party previously promised to criminalise the drug again, but faced strong resistance from its former partner in the coalition government, the Bhumjaithai Party, which supported the decriminalisation. Bhumjaithai quit the coalition last week over a leaked phone call between Prime Minister Paetongtarn Shinawatra and former Cambodian leader Hun Sen.\n\n\n\n\n\nOfficials last month revealed that cannabis smuggling cases involving tourists had soared in recent months.\n\n\n\n\n\nPhanurat Lukboon, secretary-general of the Office of the Narcotics Control Board, said a study by his agency last year found the number of people addicted to cannabis had spiked significantly after it was decriminalised.\n\n\n\nREAD MORE Automatic licence bans for cannabis-using drivers to be dropped in Victoria\n\nA government spokesperson Jirayu Houngsab said the Health Ministry had been ordered to tighten control on sales of cannabis because \"many shops opened to sell cannabis both for recreational and medical purposes, allowing easy access for children and general people, which contradicts the government's purpose to crack down on drugs.\"\n\n\n\n\n\nA group of cannabis advocates said the change in regulations was politically motivated.\n\n\n\n\n\nThe group said they will rally at the Health Ministry next month to oppose the change and the attempt to make it a criminal offence again to consume or sell cannabis.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australia-remains-firm-on-defence-spending-targets-despite-us-pressure/96mqs7sat",
        "title": "Australia remains firm on defence spending targets despite US pressure",
        "publish_date": "Thu, 26 Jun 2025 08:54:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nNATO countries have fallen in line with a request from the United States to increase defence spending.\n\n\n\n\n\nIt's a request Australia is familiar with, having been delivered earlier this year by US Defence Secretary Pete Hegseth to Defence Minister Richard Marles.\n\n\n\n\n\nBut Mr Marles rebuffed the request then, and says events at the NATO conference in the Netherlands haven't changed the government’s mind.\n\n\n\n\n\nHe says this government has already lifted defence spending sufficiently.\n\n\n\n\n\n\"Obviously, a very significant decision has been made here in relation to European defence spending and that is fundamentally a matter for NATO. We've gone through our own process of assessing our strategic landscape, assessing the threats that exist there, and the kind of defence force we need to build in order to meet those threats, to meet the strategic moment, and then to resource that. And what that has seen is the biggest peace time increase in Australian defence spending that we have seen in our history. Now, that is a story which is understood here.\"\n\n\n\n\n\nThe increase Mr Marles is speaking of involves Australia lifting its defence spending from two per cent of gross domestic product to 2.3 per cent by the 2033-2034 financial year.\n\n\n\n\n\nThe US has requested that commitment be lifted to 3.5 per cent.\n\n\n\n\n\nSome experts in Australia are calling for a lift to three per cent.\n\n\n\n\n\nThe opposition's defence spokesman, Angus Taylor, hasn't named a number, but says defence spending is still insufficient under this government.\n\n\n\n\n\n\"Well, there's a lot of areas in the Defence Strategic Review that are clearly underfunded. Our drone and counter-drone technologies, as the Leader of the Opposition, Sussan Ley, laid out yesterday. Making sure that the Henderson sub facility is properly-funded. The hardening of our northern facilities at a time like this incredibly important. Making sure we've got domestic missile manufacturing capability, as the government said they will do, but there's no sign of making progress on this. All of these are areas that have to be properly funded, alongside AUKUS- the submarines- and frigates. There is no shortage of things that need to be properly executed and properly funded, and they are not being right now under this government.\"\n\n\n\n\n\nMatthew Sussex is from the Strategic and Defence Studies Centre at the Australian National University in Canberra.\n\n\n\n\n\nHe says the events at the conference in The Hague will put further pressure on the government's stance-with one caveat.\n\n\n\n\n\n\"This also does increase the pressure on Australia to increase its defence spending. Whether it does or not is something, I think, is still a bit of an open question. And certainly I think there's no harm in waiting until what the American review into the AUKUS program actually says-the 30-day review that is due to report soon.\"\n\n\n\n\n\nElsewhere at the NATO meeting, US President Donald Trump didn't show up to a joint meeting of Indo-Pacific partners who were present.\n\n\n\n\n\nMr Marles says that didn't affect the quality of that meeting.\n\n\n\n\n\n\"No, it was a really important meeting with the Secretary-General. And we re-affirmed in the meeting how important the two theatres are to each other. The point is made is that in Japan, in Korea, and in New Zealand, we have three countries which are deeply important in terms of Australia's strategic interests. In respect of all of them, we are really at a high point of our bilateral relationship, and we are working increasingly as a team. But we all see how significantly what is playing out in Europe is influencing the Indo-Pacific.\"\n\n\n\n\n\nBut Mr Trump not showing up does play into the narrative that the government can't get a meeting with Mr Trump, especially after Prime Minister Anthony Albanese's meeting with him on the side of the G-7 conference in Canada was cancelled.\n\n\n\n\n\nMore than five months into Mr Trump's second term as U-S President, no Australian minister has yet met with him face-to-face.\n\n\n\n\n\nWhether that hurts the government on a domestic political level is a matter in and of itself, but it's something the opposition is nevertheless keen to exploit.\n\n\n\n\n\nMr Taylor says an Australian Prime Minister must invest time in building a personal rapport with whoever the President of the US happens to be at any given time.\n\n\n\n\n\n\"Right now it seems that the Prime Minister is better able to get a meeting with the President of China than the President of the United States. The United States has fought with us in every major war, and that alliance is incredibly important to this country, regardless of who is leading the United States. That alliance really matters. The Prime Minister needs to get serious about the personal relationship that is necessary to nurture that alliance.\"\n\n\n\n\n\nThere were some things proposed at the NATO meeting that Australia has agreed to.\n\n\n\n\n\nAustralia will deploy a surveillance aircraft and 100 defence personnel to Poland for three months, ending in November, in order to provide visibility for key supply routes into Ukraine.\n\n\n\n\n\nOn that front, the government has also slapped sanctions on a further 37 individuals and seven financial entities linked to key Russian industries, as well as it what it calls promulgators of Russian propaganda.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/us-dollar-weakness-the-talk-of-traders-how-your-super-compares/sqgq9lago",
        "title": "US dollar weakness the talk of traders & how your super compares",
        "publish_date": "Thu, 26 Jun 2025 08:06:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-26-june-2025/xogde32ug",
        "title": "SBS News In Easy English 26 June 2025",
        "publish_date": "Thu, 26 Jun 2025 04:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWelcome to SBS News In Easy English. I'm Catriona Stirrat.\n\n\n\n\n\nLeaders of the member states of the North Atlantic Treaty organisation, known as NATO, have agreed to increase defence spending to 5% of their countries' Gross Domestic Product by 2035.\n\n\n\n\n\nThe move follows months of pressure from US President Donald Trump.\n\n\n\n\n\n\"I've been asking them to go up to five per cent for a number of years - and they're going up to five per cent.\"\n\n\n\n\n\nThe US president described the decision, taken at a two-day NATO summit in The Hague, as a \"big win for Europe and Western civilisation\".\n\n\n\n\n\nIn a joint statement, members said they were united against \"profound\" security challenges, in particular the long-term threat posed by Russia.\n\n\n\n\n\nNATO secretary General Mark Rutte said the decision had been a hard one, but was urgently necessary.\n\n\n\n\n\n\"Countries have to find the money. It's not easy. These are political decisions. I totally recognise that. But at the same time there is absolute conviction, with my colleagues at the table tha, given this threat from the Russians, that given the international security situation, there is no alternative. We've got to do this.\"\n\n\n\n\n\n—\n\n\n\n\n\nTwo of Australia's big four banks are predicting a cut in interest rates when the Reserve Bank next meets following better-than-expected inflation numbers.\n\n\n\n\n\nHeadline inflation for May fell to 2.1 per cent from 2.4 per cent the previous month, defying predictions of inflation remaining steady.\n\n\n\n\n\nThe Reserve Bank hands down its next cash rate decision on July 8th, when the Commonwealth Bank and NAB believe the next cut will be announced.\n\n\n\n\n\nWestpac and ANZ predict a lowering of the cash rate in August.\n\n\n\n\n\nHarry Murphy Cruise from Oxford Economics told the SBS On the Money Podcast this is signalling a change in priorities\n\n\n\n\n\n\"Really I think the economy is moving into a slightly different phase from one where we're focussed on taming inflation to something where we're really trying to support growth.\"\n\n\n\n\n\n—\n\n\n\n\n\nA woman will face court today accused of hacking her university's database in an attempt to save on parking.\n\n\n\n\n\nPolice allege the 27 year old is behind a series of cyber attacks on Western Sydney University beginning in 2021, which began with an attempt to secure unauthorised discounts for parking on campus.\n\n\n\n\n\nShe's accused of escalating her hacking activity to make alterations to her academic results, as well as threats to sell other students' confidential data on the dark web.\n\n\n\n\n\nIt is believed that hundreds of staff and students were affected in the series of alleged hacks involving unauthorised access, data exfiltration, system compromises and unauthorised use of the institution's infrastructure.\n\n\n\n\n\n—\n\n\n\n\n\nIn cricket...\n\n\n\n\n\nThe opening day of Australia's First Test against the West Indies has ended in controversy, after star batter Usman Khawaja refused an interview with local broadcaster SEN Radio, in protest over the network's treatment of cricket journalist Peter Lalor.\n\n\n\n\n\nLalor was dropped from SEN's coverage of Australia's Sri Lanka tour in February after posting articles about Israeli airstrikes in Gaza on social media.\n\n\n\n\n\nKhawaja, at the time, publicly supported the veteran journalist online.\n\n\n\n\n\nThe furor comes after Khawaja scored 47 runs on a disastrous first day for the Aussies in Barbados, who finished all out for 180.\n\n\n\n\n\nTop-order batter Sam Konstas was bowled out for three, as was Cameron Green, at the hands of Shamar Joseph...the West Indies seam bowler taking four wickets for 46.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/12-times-anna-wintour-created-a-cultural-moment-through-the-cover-of-vogue-20250627-p5maqm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "12 times Anna Wintour created a cultural moment through the cover of Vogue",
        "publish_date": "Fri, 27 Jun 2025 12:07:30 +1000",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size From Kim Kardashian to Melania Trump, we look back at Anna Wintour’s most iconic, memorable and controversial cover moments throughout her 37-year tenure. November 1988 Wintour’s first cover for Vogue, in November 1988, was a departure from the hyper-produced, editorialised images that were typical of the magazine’s covers at the time. Shot by Peter Lindbergh and styled by Carlyne Cerf de Dudzeele, model Michaela Bercu wears a haute couture Christian Lacroix jacket with a beaded cross and stonewashed Guess jeans. While it may be common today, the styling of high fashion with off-the-rack denim was rare at the time. As Wintour recounted to Vogue in 2012, so revolutionary was the image that the magazine’s printers even called up to check if there had been a mistake. “I had just looked at that picture and sensed the winds of change,” she said. May 1989\n\nAdvertisement\n\nThroughout her tenure at Vogue, Wintour became known for putting celebrities front and centre on the cover – a risky move at a time when high fashion editorials featuring models was the norm. The May 1989 cover of the magazine, featuring a young Madonna at home, was an early sign of Wintour’s propensity to be at the forefront of change. September 1989 In September 1989, Wintour put a young Naomi Campbell on the cover, dressed in an orange sequin Anne Klein suit and shot by Patrick Demarchelier. It was a first for both parties – Wintour’s first September issue and Campbell’s first American Vogue cover. In 2020, Wintour appeared on an episode of the supermodel’s TV show, No Filter with Naomi, and revealed her decision to put a black model on the magazine’s cover was called into question by some board members (Beverly Johnson was the first black model to appear on the cover of US Vogue in 1974).\n\nAdvertisement\n\n“I just thought, ‘this is a fantastic girl, this is the model of the moment, this is a great image’. And we made history together, so thank you,” said Wintour. November 2001 In 2001, a then 19-year-old Britney Spears was at the height of her fame. So it was only fitting she graced the cover of the November issue. Shot by Herb Ritts, rosy-cheeked and smiling against the star-spangled banner, the cover came months after Spears’ infamous performance at the MTV Video Music Awards, in which she appeared scantily clad on stage with a real snake. This was a different side to Britney: the all-American girl next door. “I don’t want to be considered a role model,” the pop star told Vogue. “I do this because it’s fun, and when I go on stage, I’m expressing myself and I can’t please everyone.”\n\nAdvertisement\n\nFebruary 2005 Back in 2005, Melania Trump appeared on the cover of Vogue in a lavish custom-made Christian Dior wedding gown. “Melanie Knauss, the next Mrs. Trump, is a smashing 34-year-old Slovenian who handles her position (and the Donald) with panache,” wrote Sally Singer in the accompanying story. Notably, the former model has not appeared on the cover of US Vogue since, despite Wintour and the Trumps previously being friendly. Jill Biden and Michelle Obama both appeared on the magazine’s cover three times each during their tenures as first ladies. April 2008\n\nAdvertisement\n\nWintour’s April 2008 cover of Vogue, featuring basketball player LeBron James and supermodel Gisèle Bündchen, is considered one of her most controversial for its resemblance to an old King Kong poster and 1917 World War I recruitment poster that perpetuated the racist stereotype of a black man running off with a white woman. Vogue spokesman Patrick O’Connell said at the time the magazine “sought to celebrate two superstars at the top of their game” for the magazine’s annual issue devoted to size and shape. “We think Lebron James and Gisele Bundchen look beautiful together and we are honored to have them on the cover,” he said. James said told an Ohio newspaper at the time that he was pleased with the cover, saying he was “just showing a little emotion”. “Everything my name is on is going to be criticised in a good way or bad way,” James said. “Who cares what anyone says?”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/five-damning-moments-from-carlton-s-night-of-carnage-20250627-p5maqo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Five damning moments from Carlton’s night of carnage",
        "publish_date": "Fri, 27 Jun 2025 12:00:30 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Jacob Weitering is one of the league’s best one-on-one defenders, but he wasn’t at his best a week after hurting his ankle against North Melbourne. Weitering was seen in discussions with the club’s medical staff about his ankle just minutes before the opening bounce. That lack of confidence may have impacted his ability to body up, reinforced when he could not go with Mitch Georgiades in a crucial marking contest. David King, a dual North Melbourne premiership player, said Weitering had to be stronger. “Body on body, Weitering is the bigger body, he [Georgiades] just loses him. He [Weitering] has got to be stronger than that to deny Georgiades the clear run and jump at the ball,” King said on Fox Footy. Seven’s expert commentator Kane Cornes added: “Well, he’d be frustrated by that, Michael Voss, because you should be able to defend that. Weitering just wasn’t physical enough.” It wasn’t a good sign for the Blues when their premier defender was beaten so easily. Weitering was later switched off Georgiades.\n\nAcres misses a regulation shot Second term The Blues needed to regroup in the second term, and had a golden opportunity early when Blake Acres marked a chipped kick from Patrick Cripps. Acres has booted some big goals for the Blues but, on this occasion, botched a regulation shot from 40m on a slight angle. Acres wasn’t the only Blue guilty of making … a blue in front of goal. How on earth did Curnow’s shot for goal from the right pocket end up out on the full in the left pocket with just over a minute remaining in the game?\n\nMotlop caught ‘plodding’ Third term Late in the third term, with the Blues trailing by 10 goals, small forward Jesse Motlop fails to man up on Joe Richards, and even points to nearby teammate Orazio Fantasia to take the Power runner. Richards, meanwhile, pushes forward from the defensive 50 metre line, where he started on Motlop, to the wing to mark, the Power soon celebrating another goal to Willie Rioli. Riewoldt, in commentary, takes aim at Motlop.\n\n“Just look at Jesse Motlop here. You talk about the little things here. Joe Richards runs past him, that there is not trying. Just trying to hand it off to someone else to do your job, plodding through, Richards runs past him and puts 50m on him,” Riewoldt said. “This ball goes to the other end. You wonder why Carlton’s backs are under pressure. It’s efforts like these that are frustrating Michael Voss.” McGovern goes for goal instead of looking for a teammate Final term\n\nCharlie Curnow finds McGovern in the right forward pocket. Instead of centring the ball, McGovern opts for a tough check side shot at goal, the ball finishing out on the full in the opposite pocket. Loading “He had players on, 30m from goal, for the chip pass, and he put himself before the team. He could have chipped it, I think, to [Zac] Williams unopposed 30 metres from goal,” King said on Fox. Cornes, on Seven, could not believe that McGovern had missed the goal. “Harder not to score a goal than a score a goal there. When Curnow took possession of that ball, they had two players - Docherty and McGovern - almost running into an open goal. The Curnow kick was poor. But you can’t be an AFL footballer missing that shot under no pressure by 20 metres out on the full,” Cornes said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/around-the-clubs-nrl-round-17-20250622-p5m9bt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Luai out of Manly clash on Friday; Cobbo to join Dolphins",
        "publish_date": "Fri, 27 Jun 2025 11:55:56 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko",
            "Michael Chammas",
            "Christian Nicolussi",
            "Dan Walsh",
            "Robert Dillon"
        ],
        "text": "Broncos officials were hopeful the 23-year-old would accept a deal worth about $300,000 - about half of his current contract - to remain at Red Hill. However, Cobbo will be on the move in 2026 and intends to officially inform his teammates of the decision in the coming days. The Dragons had expressed interest, although they have decided to now pull out of the race for his signature. Instead, they will turn their attention to premiership-winning Penrith forward Luke Garner, who is also a target for Parramatta. Cowboys coach Todd Payten had also publicly expressed his interest in Cobbo, if he was prepared to go at the right price. Broncos winger Selwyn Cobbo will leave the club at the end of 2025. Credit: NRL Photos\n\n“I think Selwyn Cobbo would help any club he is going to,” Payten said. “He carries the ball strongly, he can find the tryline and break a game open. He has proven that over time. “There’s no doubt we could help him get to where he wants to get to, but if we get to that point, it’s down to him. “I don’t doubt our club would be a good fit.” Cobbo won’t leave the Broncos before the June 30 deadline.\n\nDragons withdraw from Cobbo race, eye premiership-winning back-rower St George Illawarra have withdrawn from the pursuit of out-of-favour Broncos star Selwyn Cobbo. Sources with knowledge of the situation talking on the condition of anonymity said the Dragons did not want to be used as leverage in a bidding war and on Thursday decided to end conversations with his management. The Dragons hosted Cobbo at the club’s Wollongong base last week and were willing to make him an offer for the next 18 months if he left Brisbane.\n\nHowever, the Broncos have shown no appetite to release the Queensland centre before June 30 and the Dragons have concluded it would be best to look elsewhere to bolster their roster. The Dragons, meanwhile, have joined Parramatta in the hunt for premiership-winning Penrith forward Luke Garner. Garner is contracted with the Panthers for 2026 but has been given permission to test the market. The Eels have already expressed interest in the former Tigers back-rower. Selwyn Cobbo. Credit: NRL Photos Garner is on a deal worth around $350,000 for next year and the Dragons are in the market for an experienced forward to compliment some of the young talent at their disposal.\n\nWhile they have allowed Garner to test the market, the Panthers have not guaranteed Garner a release for next year. The Dragons’ interest in Garner comes the day after it was revealed long-serving lock Jack de Belin would leave the club at the end of the season to join the Eels. Horror injury set to sideline Knights star for rest of season They’ve scored fewer points than any team in the NRL this year, and now the Newcastle Knights’ attacking options have been further depleted by a horror injury that is expected to prematurely end the season of leading tryscorer Fletcher Sharpe.\n\nSharpe suffered a lacerated kidney and ruptured spleen during Newcastle’s 26-20 win against the Dolphins in Perth on Saturday, and was taken to hospital later that night when the club’s medical staff became concerned about his condition. After undergoing a surgical procedure and spending four days in hospital, the 21-year-old Prime Minister’s XIII representative flew home on Wednesday and now faces an indefinite period of convalescence. Knights coach Adam O’Brien admitted to being “shocked” when the extent of Sharpe’s injuries were confirmed, “because Fletcher doesn’t say much and he’s tough as nails”. Sharpe pain: Fletcher Sharpe suffered the injury in his side’s win over the Dolphins at the weekend. Credit: Getty Images O’Brien said the utility back, who was set to be called up to train with the NSW Origin squad next week as a development player, was receiving the best possible medical care, but his prognosis was unclear.\n\n“He’s got to go through a process now where he’ll meet with specialists in a couple of weeks,” O’Brien said. “But I think we’re a long way away from knowing when he’ll be actually participating in contact sport or even [able to] lift anything heavy, I’d imagine. So it’s a pretty significant injury and something that we won’t take lightly.” Asked if it would be a bonus to get Sharpe back this season, O’Brien replied: “Well, I’d look at it that way, yeah. I’d actually be surprised if we do see him back this season. But I’m not the expert there. I’ll leave that up to the guys that are a lot smarter than me.” Asked if there was any concern that the injury could potentially be career-threatening, O’Brien said the initial information was that Sharpe would make a complete recovery. Loading “I believe that life will go on as normal for him, and footy and that’s all intact,” he said. “It’s just the immediate part of it, I think he can’t participate in. But from what I can gather, everything will go back to normal over time.”\n\nThe Knights have scored 39 tries in 15 games this season – seven fewer than the second-worst attacking team, Parramatta, who have played only 14 times. Sharpe has been their leading contributor with 11 tries, taking his career tally to 22 in 26 NRL games. O’Brien was confident the return of winger Dominic Young from Sydney Roosters, and former NSW Origin representatives Bradman Best and Jacob Saifiti from injuries, would help boost his team’s firepower in Sharpe’s absence. Jackson Hastings has been named to replace Sharpe at five-eighth when the Knights host Canberra on Friday night. Ray Dib, Marcus Bai appointed to PNG board\n\nFormer Bulldogs powerbroker Ray Dib has been appointed the chairman of an inaugural Papua New Guinea board that also includes former Storm star Marcus Bai. Seven directors were unveiled at an announcement at Santos National Stadium in Port Moresby that was attended by PNG Prime Minister James Marape, Minister for Pacific Island Affairs Pat Conroy, NRL CEO Andrew Abdo and ARLC chairman Peter V’landys, who was making his first visit to the nation. The first board of the PNG franchise will comprise: Ray Dib (Chairman), Lorna McPherson, Richard Pegum, Stan Joyce, Wapu Sonk, Ian Tarutia and Marcus Bai. Dib was the chairman of Canterbury for eight seasons before he was ousted at the ballot box by a ticket led by Lynne Anderson at the start of 2018. The Bulldogs made the 2012 grand final under Dib’s tenure, but the decision to re-sign coach Des Hasler which ended in an ugly payout dispute ultimately cost him his position.\n\nConroy declared the PNG franchise would eventually “make the Panthers the minnows of the NRL”, while Marape said a competition will be conducted to determine the team name. “The importance of this franchise goes well beyond winning games of football, it is about nation building and bringing our two countries closer together,” V’landys said. Ray Dib was chairman of the Bulldogs for almost a decade. Credit: Fairfax “The new NRL club will provide a pathway for young people in PNG to follow their dreams and it will help transform societal and economic outcomes. This is an important moment for the NRL as PNG is set up to become a nursery of talent in the region for the entire competition, not to mention the millions of fans that will now follow a new team entering the competition. “Today’s announcement is a major milestone and sets the franchise on a path to great success both on and off the field. This club will act as beacon of hope and opportunity across PNG and offer opportunity to young people hoping for a better future.\n\n“Rugby league is the number one sport in the Pacific, and this new club will solidify rugby league’s role as the unifying language of the region.” Dib aside, the most prominent director for league fans is Bai. The former Storm winger scored 70 tries in 144 NRL games and also featured in the club’s 1999 grand final win over St George Illawarra. “The Albanese Government is proud to stand shoulder to shoulder with PNG in supporting this once-in-a-generation opportunity,” Conroy said. Tigers star Bula set to miss next month Michael Chammas\n\nStar fullback Jahream Bula is set to miss the next month with a hamstring injury, dealing Wests Tigers a blow. Bula suffered the injury in the last play of the game against the Raiders last week and is set to face an extended period on the sidelines. Bula pulled up sore after attempting to chase a Jarome Luai grubber in the final seconds of the game. The news of Bula’s hamstring injury is expected to shift Heath Mason back into the No.1 jersey, opening the door for Latu Fainu to join Jarome Luai in the halves.\n\nBroncos extend Karapani as Dragons circle Cobbo Michael Chammas The Broncos are set to extend the contract of winger Josiah Karapani for a further two seasons, placing an even greater cloud over the future of Selwyn Cobbo. The Dragons have expressed an interest in luring Cobbo to the club before the June 30 transfer deadline after meeting with him in Wollongong last week. The Broncos are not keen to let Cobbo go immediately but it is becoming increasingly unlikely he will be at the club beyond the end of this season.\n\nThe Dragons are willing to offer Cobbo an 18-month contract. They haven’t made him an offer as yet and want to make sure he is willing to leave Brisbane before tabling him a deal believed to be worth around $600,000 for next year. The Dragons have also held internal conversations about the future of out-of-sorts winger Tyrell Sloan and are expected to give him permission to explore options at rival clubs despite having another year to run on his deal worth around $500,000. Rooster out for six weeks after cannonball tackle referees missed Dan Walsh Siua Wong will miss up to six weeks after being the victim of a cannonball tackle that was missed by match-day officials, yet punished by the match review committee with one of the most serious charges of this season.\n\nScans have confirmed that Wong, who has played every game in the Roosters back-row this season, will miss 4-6 weeks with a MCL tear in his knee after being hit by Karl Lawton on Sunday. Lawton was not punished on the field in the Roosters 42-8 thrashing of the Cowboys, despite Wong’s injury pausing the game and allowing referee Ashley Klein and Bunker official Chris Butler to review the incident. The MRC issued Lawton with a grade 3 dangerous contact charge on Monday, the highest possible grading before a player is referred directly to the judiciary. Lawton is now facing a 2-3 week ban for the third man in contact on Wong depending on his plea to the charge.\n\nManly prop Tof Sipley is the only player to have received a higher grade charge for his hip drop tackle on Dragons winger Mat Feagai earlier this year. Sipley served a four-match suspension for the tackle that fractured Feagai’s leg. Scans have cleared Roosters five-eighth Sandon Smith of any damage after he left the field early with a knee injury on Sunday. The off-contract No.6 is expected to be fit for the Tricolours round 18 clash against Wests Tigers after their third and final bye of the season this weekend. Elsewhere, Parramatta’s Will Penisini is facing a three-game ban with an early guilty plea to a dangerous throw on Titans forward Beau Fermor. Eels teammate Ryley Smith is facing a 2-3 game ban for his own spear tackle on Phil Sami earlier in the match.\n\nRadley to take month off, Knights playmaker hospitalised by lacerated kidney Dan Walsh Victor Radley is set to take a month off from his latest head knock while Knights livewire Fletcher Sharpe has been hospitalised with a lacerated kidney suffered in Saturday’s last-gasp upset of the Dolphins. Radley met with a concussion specialist on Friday after his fifth HIA of the season continued a worrying history of head knocks for the Roosters enforcer.\n\nRadley came off following what appeared reasonably innocuous head contact while tackling Newcastle’s Fletcher Hunt in round 14, though actually passed his subsequent HIA. Roosters medical staff made the call to rule Radley out of the Knights game in any case. Radley has only failed one HIA this year - when he was knocked out against Brisbane in round one - but has had several concerning concussion incidents over the years, including a 2022 collision that left him convulsing on the turf against Melbourne. Along with the Roosters round 16 clash against North Queensland and the subsequent bye, Radley is likely to be stood down on July 6 when the Roosters host Wests Tigers. Victor Radley will miss a month of play for the Roosters. Credit: Getty Images\n\nNo return date has been set for Radley at this point but the 27-year-old has been in good spirits at Roosters HQ this week. “He’s gone through some really good testing with some specialists and he’s on a really clear plan over the next few weeks,” Robinson said. “He’ll follow the plans of the doctors and he’ll be back when he’s ready to be back.” Loading Sharpe, meanwhile, has remained in a Perth hospital receiving treatment for a kidney laceration while his teammates travelled home on Sunday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/how-far-can-penrith-go-the-game-by-game-breakdown-should-terrify-nrl-rivals-20250623-p5m9ki.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How far can Penrith go? The game-by-game breakdown should terrify NRL rivals",
        "publish_date": "Fri, 27 Jun 2025 11:55:09 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Billie Eder"
        ],
        "text": "Sixth place - 19 points, seven wins, one draw, seven losses, two byes, +3 points differential\n\nGames against top 8: four.\n\nGames against top 4: four.\n\nWins to make top eight: five from nine games.\n\nPredicted finish: fifth. Round 18: bye Round 19: Eels at Commbank Stadium A danger game with their Origin players facing a four-day turnaround into the local derby, with Parramatta playing far better of late than their lowly position on the ladder suggests. The Eels offload-centric game under Brad Arthur troubled Penrith’s defence in years past but their style under Jason Ryles - playing with more width and a real emphasis on Dylan Walker’s ball-playing - is still evolving. No Mitchell Moses to guide Parramatta should tip this one Penrith’s way.\n\nLast five clashes: Panthers lead 3-2 Round 20: Rabbitohs at Commbank Stadium Souths as well are a stronger than a 16th placed side, particularly when Latrell Mitchell is firing and their backline stars are returning from injury. The real worry for Penrith is the five-day turnaround from their Sunday July 13 game while the Rabbitohs will come off a bye. For the Panthers Origin quintet, this could be a third game in the space of 11 days unless Ivan Cleary rests them.\n\nLast five clashes: Panthers lead 3-2 Round 21: Wests Tigers at Commbank Stadium Four-time premiership-winner Jarome Luai looms once more against his old teammates as the Tigers begin an all-too familiar slide down the ladder, despite undoubtedly improving in 2025. As plucky as the Tigers have been, and they often aim up against Penrith, the Panthers will be warm favourites for this clash.\n\nLast five clashes: Panthers lead 4-1\n\n\n\nNathan Cleary and Jarome Luai after their recent clash at Commbank Stadium. Credit: Getty Images Round 22: Titans at Cbus Super Stadium, Gold Coast Penrith haven’t lost to the Titans since the 2019 car crash campaign that triggered the greatest premiership run of the modern era. And if you’ve seen the Gold Coast go around this season, it won’t be happening in 2025 either.\n\nLast five clashes: Panthers lead 5-0 Round 23: Knights at McDonald Jones Stadium, Newcastle A potential banana peel of sorts, even with Newcastle’s 14.6 points per game this season making for the worst attack of the NRL by some margin. The Knights knocked off Penrith in May when they were without their Origin stars and have regularly dragged the competition heavyweights into a defensive dogfight in recent years.\n\nLast five clashes: Panthers lead 4-1\n\nRound 24: Storm at Commbank Stadium The finals effectively start early for Penrith, with Melbourne the first of three genuine title contenders in as many weeks. The Storm have been erratic throughout 2025 but used the corresponding clash last season to make a statement - beating the premiers in front of a sold-out Panthers Stadium by targeting Brian To’o under the high ball and managing to harness his yardage game.\n\nLast five clashes: Storm leads 3-2 Ricky Stuart’s Raiders loom as a genuine threat to Penrith. Credit: Getty Images Round 25: Raiders at Commbank Stadium Canberra’s ability to win as front-runners, from behind, playing fast and free or grinding the opposition into error has shades of Penrith about it, of course with only half a season worth of evidence behind it. Three weeks out from the finals this looms as a fine litmus test for both sides, particularly the Raiders young playmakers Ethan Strange and Kaeo Weekes who are yet to experience semi-finals pressure.\n\nLast five clashes: Panthers lead 4-1\n\nRound 26: Bulldogs at Accor Stadium Penrith have shown Canterbury what it takes to win the games that matter most, this will be a fascinating watch to see just how much Cameron Ciraldo’s side has learned by this point in the year. Just as compelling, how the Dogs juggling of their playmakers and Lachlan Galvin’s introduction to the side plays out. If this match wasn’t scheduled for Thursday night you’d expect another 50-60,000 Bulldogs fans turning out.\n\nLast five clashes: Penrith lead 5-0 Round 27: Dragons at WIN Stadium, Wollongong By all rights, Penrith will be tuning up for yet another finals tilt with every other side on edge. We’ve seen worse final round hit-outs than a Saturday afternoon in Wollongong. The Dragons will be staring down another early Mad Monday and given the way rugby league goes, an increasingly bright spotlight on Shane Flanagan as he comes off-contract in 2026. Last five clashes: Panthers lead 4-1\n\nAnd once the fun and games of a 27-round season is done, it’s a whole new competition. Just how far Penrith can go - as we’ve mapped out further below - depends of course on how the rest of the NRL finishes up. First place - 28 points, 11 wins, three losses, three byes, +96 points differential\n\nGames against top 8: six.\n\nGames against top 4: two.\n\nWins to make top eight: two from 11 games.\n\nPredicted finish: second. Are we seeing just a bit of a tail-off from the Dogs after three months sitting in first place? It wouldn’t be the worst thing for Canterbury to be taking stock at this point, with a first-choice playmaking spine needing to settle. A final month of games against the Roosters, Storm, Panthers and Sharks is a tough one going into the post-season. Second place - 26 points, 12 wins, three losses, one bye, +100 points differential\n\nGames against top 8: one.\n\nGames against top 4: none.\n\nWins to make top eight: one from nine games.\n\nPredicted finish: first.\n\nA couple of byes after the heaviest travel toll of any NRL side and just one game against a top-eight side (Penrith in round 25) makes for a rails run home. Canberra have done exceptionally well to have a top-four berth all but sewn up. Ricky Stuart’s biggest task now is keeping his young side healthy and focused as the inevitable hype grows around them. Third place - 24 points, nine wins, four losses, three byes, +172 points differential\n\nGames against top 8: seven.\n\nGames against top 4: none.\n\nWins to make top eight: four wins from 11 games.\n\nPredicted finish: third. Like the Bulldogs, Melbourne’s last month of the season will be a true test of where they’re at come finals time. Provided their Origin stars come through the next few weeks unscathed, the inconsistency of their campaign should get worked out for yet another premiership tilt. Fourth place - 24 points, ten wins, four losses, two byes, +25 points differential\n\nGames against top 8: two.\n\nGames against top 4: one.\n\nWins to make top eight: three wins from 10 games.\n\nPredicted finish: fourth.\n\nSitting in a similar boat to Canberra having punched well above their weight over the first half of the season. After Saturday’s mouth-watering clash with Brisbane, Canterbury in round 23 looms as their only opponent that will be anywhere near grand final day. Cruising, though can’t afford to lose any more veterans with Mitch Barnett (ACL) gone for the season and Dallin Watene-Zelezniak (ankle) also out for at least the next month. Fifth place - 18 points, seven wins, seven losses, two byes, +50 points differential Games against top 8: four.\n\nGames against top 4: four.\n\nWins to make top eight: six wins from 10 games.\n\nPredicted finish: sixth. For all the criticism and focus on the Broncos – so much of it self-inflicted – Michael Maguire has them sitting fifth midway through his first year. If they can get some consistency in their game, they’ll hit the finals in good shape – big clashes against the Warriors, Bulldogs and Storm (twice) will test their mettle.\n\nSixth place - 18 points, eight wins, seven losses, one bye, +20 points differential\n\nGames against top 8: three.\n\nGames against top 4: two.\n\nWins to make top eight: five from nine games.\n\nPredicted finish: eighth. Sliding, and sliding fast with defence and application worryingly missing of late. The next few weeks against the Storm, Dolphins and Roosters could dig the Sharks into a serious hole if they can’t emerge with at least one win. Life does get easier from there, though. Seventh place - 18 points, seven wins, seven losses, two byes, +16 points differential\n\nGames against top 8: four.\n\nGames against top 4: three.\n\nWins to make top eight: six from 10 games.\n\nPredicted finish: seventh.\n\nStarting to put together a fine campaign, with five wins from their last seven games (losses to Canterbury and Canberra could and should have been Roosters wins, too). Need to bank victories against the Tigers and Dragons in early July before a run of top-eight clashes, but well-placed to play finals. Ninth place - 16 points, seven wins, eight losses, one bye, +140 points differential Games against top 8: five.\n\nGames against top 4: two.\n\nWins to make top eight: six from nine games.\n\nPredicted finish: tenth. Have found their mojo in attack but need to keep winning after a dreadful start to the year. Can largely control their own destiny in the next three weeks - victories over Cronulla, South Sydney and North Queensland would come with the added value of hobbling rivals sitting alongside them on the ladder. Injuries up front are a worry, though.\n\nTenth place – 16 points, six wins, eight losses, two byes, +22 points differential\n\nGames against top 8: five.\n\nGames against top 4: four.\n\nWins to make top eight: seven from 10 games.\n\nPredicted finish: ninth. Manly have been the biggest disappointment of 2025 so far, with all the drama around Daly Cherry-Evans’ future derailing their season. Shifting Tom Trbojevic into the centres and Lehi Hopoate to fullback needs to spark the Sea Eagles immediately, because back-to-back games against Melbourne and Canterbury coming up could end their campaign early. Eleventh place: five wins, eight losses, three byes, -59 points differential\n\nGames against top 8: seven.\n\nGames against top 4: four.\n\nWins to make top eight: eight from 11 games.\n\nPredicted finish: 14th.\n\nThe Dragons will once again miss the finals in 2025. With all three byes out of the way, two games against Canberra, roster conjecture and doubts around the halves as always, a slide down the ladder looms. Twelfth place: Five wins, one draw, eight losses, two byes, -140 points differential Games against top 8: four.\n\nGames against top 4: two.\n\nWins to make top eight: seven from 10 games.\n\nPredicted finish: 11th. The Cowboys have been one of the biggest under-performers in 2025, but they have a soft run home that could help them crack the finals. On the basis of a defence that has leaked 100 points in the past two games, North Queensland are in deep trouble. But if they can jag an upset over Melbourne or Canterbury in coming weeks, the chance to build momentum is there.\n\nThirteenth place: Six wins, nine losses, one bye, -63 points differential\n\nGames against top 8: seven.\n\nGames against top 4: four.\n\nWins to make top eight: seven from nine games.\n\nPredicted finish: 15th. Newcastle won’t be scraping into the finals this year. Their attack still offers far too little and the next five weeks (Canberra twice, Melbourne, Warriors and Penrith) is the toughest run in the NRL. Fletcher Sharpe joining a slew of injured forwards on the sidelines is all sorts of bad news. Fourteenth place: five wins, nine losses, two byes, -66 points differential\n\nGames against top 8: five.\n\nGames against top 4: three.\n\nWins for top eight: eight wins from 10 games.\n\nPredicted finish: 13th.\n\nThe Tigers have improved this season, but Lachlan Galvin’s exit rocked the club and more scrutiny is coming their way as Tallyn Da Silva prepares to leave early, too. Add the injury to Jahream Bula and the club, while likely avoid the wooden spoon, won’t be getting near finals this year. Fifteenth place: five wins, nine losses, two byes, -89 points differential Games against top 8: six.\n\nGames against top 4: three.\n\nWins to make top eight: eight from 10 games.\n\nPredicted finish: 16th. The Eels did well to beat the Titans last week, but Mitchell Moses’ latest Origin-inflicted injury cruelled any hope of a run up the ladder while a tough finish to the year against NRL heavyweights will not do justice to the improvements during Jason Ryles’ first year in charge.\n\nSixteenth place: six wins, nine losses, one bye, -89 points differential\n\nGames against top 8: 4.\n\nGames against top 4: 0.\n\nWins to make top eight: seven from nine games.\n\nPredicted finish: 12th. The Rabbitohs have an easier run home compared to some, but it still includes games against the Panthers, Sharks and Broncos. Seven wins for a finals run is too big an ask from a team that’s been so injury-plagued this year, though at full strength they’ll keep every rival nervous. 17th place: four wins, 10 losses, two byes, -138 points differential\n\nGames against top 8: five.\n\nGames against top 4: two.\n\nWins to make top eight: nine from 10 games.\n\nPredicted finish: 17th.\n\nWith five top-eight teams left to face this season and the worst points differential in the competition, the Titans will do well to avoid the wooden spoon as their defensive frailties put Des Hasler’s tenure under extreme pressure. The finals run: Could Penrith actually pinch a premiership? A fifth or sixth-placed finish would give the Panthers a home semi-final (not quite the silver bullet it was when they were playing out of Penrith Park) but there won’t be a precious week off regardless given the top four is all but settled already. Here’s how we see their finals run playing out.\n\nWeek one: Elimination final against Cronulla at Commbank Stadium Whoever Penrith line up against in week one, be it the Sharks, Broncos, Roosters, Sea Eagles or Dolphins, as long as the Panthers and Cleary are fit, we’re seeing too much big-game experience and momentum with the premiers. A date with one of the top-four teams looms. Week two: Semi-final against the Warriors at Mount Smart Stadium And this, for us at least, is the end of the line. No matter which way the top four shakes out, it’s a daunting home ground advantage to whichever finals week one loser Penrith draw. The Raiders in Canberra, Storm in Melbourne, Warriors across the ditch or Bulldogs in front of a likely 80,000-strong sell-out is all sorts of awesome for rugby league. Penrith knocked off the Warriors at home, but can they do it again come finals time? Credit: Getty Images",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/38-balls-of-torture-konstas-is-stuck-in-two-minds-20250627-p5mase.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Thirty-eight balls of torture: Konstas is stuck in two minds",
        "publish_date": "Fri, 27 Jun 2025 11:54:07 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Barbados: Form in the cricket nets is a bit like investment advice: past performance is not necessarily a reliable indicator of future returns.\n\nBut in the case of Sam Konstas, there was a moment on Sunday in Barbados that hinted the teenage sensation might not be in ideal touch ahead of the first Test against the West Indies.\n\nPart-timer Marnus Labuschagne found Konstas’ outside edge with a medium pace outswinger at Australia’s first net session since a surprise defeat to South Africa in the World Test Championship final.\n\nWere his feet not moving properly? Was his balance slightly off? Were his hands not in the right position?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/middle-east/israel-iran-ceasefire-live-updates-trump-officials-to-give-classified-briefing-to-us-congress-iran-s-supreme-leader-says-strikes-on-us-base-a-slap-to-america-s-face-20250626-p5mam3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Israel-Iran ceasefire LIVE updates: Trump officials give classified briefing to US Congress over Iranian nuclear site bombings; Iran’s supreme leader says strikes on US base a ‘slap to America’s face’",
        "publish_date": "Fri, 27 Jun 2025 11:52:20 +1000",
        "category": "finance",
        "authors": [
            "Penry Buckley"
        ],
        "text": "Oil headed for its biggest weekly decline in two years after the ceasefire between Israel and Iran, with focus shifting from the conflict in the Middle East to US trade negotiations.\n\nBrent was steady near $US68 ($104) a barrel, down almost 12 per cent for the week, while West Texas Intermediate traded above $US65. With the fragile truce holding, investors are turning their attention to progress on US-China trade talks. US Commerce Secretary Howard Lutnick said an understanding was reached last month.\n\nFire and smoke rise into the sky after an Israeli attack on the Shahran oil depot in Tehran last week. Credit: Getty Images\n\nOil has swung in a range of about $15 a barrel this week after prices spiked following US bombing of Iranian nuclear sites, before President Donald Trump declared a ceasefire between Israel and Iran. The truce eased concerns about supply disruptions from a region that pumps about a third of the world’s crude.\n\nThe trade understanding with China flagged by Lutnick comes ahead of July 9 deadline for the US to decide whether to impose global tariffs on its major trading partners. The commerce secretary added that the White House had imminent plans to reach agreements with 10 major trading partners.\n\nBloomberg",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/afl-agent-turned-soccer-boss-legal-and-tax-troubles-threaten-western-united-rescue-deal-20250623-p5m9la.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL agent turned soccer boss’ legal and tax troubles threaten Western United rescue deal",
        "publish_date": "Fri, 27 Jun 2025 11:51:09 +1000",
        "category": "finance",
        "authors": [
            "Sarah Danckert"
        ],
        "text": "Sourasis is also separately defending a lawsuit brought against him in the Federal Court by longtime co-investor George Koulouris. Koulouris alleges he is owed several million dollars in repayments for loans and investments in more than 10 businesses overseen by Sourasis, including Western United. Western Melbourne Group chairman Jason Sourasis at the club’s Ironbark Fields complex in Tarniet. Credit: Jason South He also claims in court documents that Sourasis engaged in misleading and deceptive conduct in their dealings, allegations that Sourasis denies. Sourasis’ personal financial troubles come just seven weeks after Western United trumpeted a rescue deal from US investment house KAM Sports worth $100 million.\n\nIn the months leading up to that deal, troubles at the club had been widely reported, including that it had been struggling to pay its staff as it headed into the A-League finals after finishing the season third on the ladder. Loading The KAM bailout includes a commitment from the billionaire family behind KAM Sports, the Kaminskis, to build a stadium in Tarneit and a new sporting hub for the fringe suburbs as part of a public-private partnership with the local council. The deal – which will cover the club’s tax debts, claims from other creditors and player wages– still requires regulatory approval from the league’s governing body and Wyndham City Council, and is subject to a range of requirements from KAM Sports. In the weeks since the deal was announced, the club has again been late paying wages to players in its men’s and women’s teams.\n\nOn June 20, the players’ union, Professional Footballers Australia, lodged fresh breach notices on behalf of several players. The notices allow players to void their contracts, become free agents and seek sanctions against the club if their wages are not met within 14 days. The club is also subject to a ban from FIFA in signing any new players due to its financial issues. As the deal inches towards completion, Sourasis has been keen to keep a lid on his legal and financial challenges. WMG Group plans to develop the vacant land around its stadium in Tarneit, west of Melbourne. Credit: Jason South In May, he sought to extend interim suppression orders over documents in the Federal Court case brought against him by Kouroulis, citing the risk to the deal from adverse publicity. Sourasis told the court in an affidavit that he believed a suppression order was necessary because “the investor [KAM Sports] might become concerned by adverse publicity and [that] might prejudice the investor’s willingness to complete the deal with WMG Group and Sayers Road”.\n\nHe added: “Although the investor has now executed transaction documents, I still hold such a concern because any adverse publicity might either constitute a ‘material adverse change’ or might otherwise cause the investor to exercise rescission rights under a condition precedent that the investor might otherwise have waived”. Loading However, Justice Sarah Derrington refused Sourasis’ request to keep the case under wraps until after mediation had been completed, noting that the deal had been publicly announced and Sourasis had told the court the Kaminskis were aware of the lawsuit. The financial and legal battles of Sourasis and Western United highlight the difficulties in starting a new sporting franchise (and a major public-private partnership) at a time when distributions from sporting codes for broadcast rights have been slashed, club running costs have increased, and crowd numbers are below expectations. Sourasis was for many years one of the unofficial bigwigs of Melbourne, overseeing the city’s biggest AFL player agent group – Strategic Management Australia AFL – with business partner Liam Pickering.\n\nThe pair’s business relationship soured in 2014 after Pickering poached the firm’s top clients to set up his own sports representation agency, igniting a fiery legal battle. In the past decade, Sourasis has remodelled himself as a soccer kingpin, securing the licence for an A-League team based in Melbourne’s outer western suburbs in late 2018. Steve Horvat in late 2018 following the announcement that Western United had picked up one of the new licences offered under the league’s expansion. Credit: Eddie Jim A key plank of Sourasis’ plans for Western United is the development of the stadium and surrounding sporting complex in Tarneit. The ambitious plan has been re-cut several times to bring in new investors, some of whom hope to be paid out by the KAM Sports deal. While the cash injection is expected to provide a boost to Sourasis’ plans, it might not be able to immediately stave off all of his financial strains.\n\nThe ATO’s director penalty notice to Sourasis includes $1.5 million in unpaid taxes owed by four companies not apparently related to the club, which would likely not be covered by the KAM Sports deal. Loading Court documents show Sourasis is also planning to use some of KAM Sports’ money to pay back loans he allegedly owes to Koulouris for the Tarneit project and the A-League club. However, Koulouris’ claim – which is yet to be tested in court – includes requests for repayment from a range of other unrelated developments. Sourasis is defending the action and has argued Koulouris is wrong about how much he is owed. Sourasis was sent a list of detailed questions about the club’s business issues, as well as his own.\n\nIn a statement he said: “We are looking forward to closing out the transaction with KAM Sports and adding both expertise and capital to the Western Melbourne Group. All outstanding creditors, including the ATO, are aware of the last remaining steps for approval, and all our obligations will be met once the deal completes. Loading “We’re excited about the future, and the injection of capital will help us accelerate the delivery of our vision to build a city underpinned by sports health and wellness in Melbourne’s west.” He added that he had interests in many businesses unrelated to Western Melbourne Group and Western United. “We are in negotiations with the ATO in relation to a couple of businesses that ceased trading during the pandemic and we expect to reach an amicable outcome shortly,” Sourasis said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/from-the-queen-to-trump-anna-wintour-s-career-in-pictures-20250627-p5marr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From the Queen to Trump: Anna Wintour’s career in pictures",
        "publish_date": "Fri, 27 Jun 2025 11:50:41 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "7/14\n\nMichelle Obama and Anna Wintour at the grand opening of the Costume Centre at the Metropolitan Museum of Art (2014). Obama appeared on the cover of Vogue three times. Credit:Getty Images",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/perth-eating-out/run-by-a-former-rockpool-chef-this-swan-valley-restaurant-has-all-the-makings-of-perth-s-next-big-destination-diner-20250627-p5masn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Run by a former Rockpool chef, this Swan Valley restaurant has all the makings of Perth’s next big destination diner",
        "publish_date": "Fri, 27 Jun 2025 11:40:54 +1000",
        "category": "finance",
        "authors": [
            "Max Veenhuyzen"
        ],
        "text": "Advertisement\n\nReview Eating outPerth Run by a former Rockpool chef, this Swan Valley restaurant has all the makings of Perth’s next big destination diner Thoughtfully sourced ingredients treated with a gentle, confident touch beat at the heart of this thrilling wine country lunch. Max Veenhuyzen June 27, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 5 Ginveristy gin-cured fish with fermented tomato and finger lime. Supplied 2 / 5 Walpole venison shoulder and leg with a tomato and rosemary jus. Supplied 3 / 5 Seared Shark Bay scallops with courgette and lime. Supplied 4 / 5 Venison tasting plate with potatoes fondant and gem lettuce. Supplied 5 / 5 Berkshire pork proscuitto with grilled figs. Supplied Previous Slide Next Slide Good Food hat 15.5 / 20 How we score Australian$$$$ Justin Hughes is, at heart, a boy from the country. He grew up on a farm in the Avon Valley where parents Tony and Gayle ran sheep. Orphaned lambs became family pets. As a teenager, Justin and his mates swapped eskies filled with meat from happy animals raised entirely on the properties where they were born. Of course, even the happiest of country kids starts daydreaming about city adventures. For Justin, those dreams entailed enrolling at uni, dropping out of uni and starting a cooking apprenticeship under dad who ran catering at the WACA. Justin clearly enjoyed the change. So much so that he moved to the biggest city of them all to sharpen his skills at Sydney fine diners including Becasse and Rockpool while Neil Perry’s flagship was transitioning to Eleven Bridge. Health issues, alas, forced Justin to not just come home, but to take a break from high-performing kitchens.\n\nAdvertisement\n\nOscar’s in the Valley is an airy dining room rich in circa-2000s Country Style charm. Naturally, your minds should have already fast-forwarded to the part where Justin recovers and starts (re)cooking his food and rediscovering his groove, a la John Favreau’s 2014 comedy-drama Chef. While Justin’s change isn’t quite as drastic as fine dining runaway Carl Casper buying a food truck, his current workplace sits a few notches below Eleven Bridge and its gueridon service and three-hat sizzle. But as we all know, good eating is no longer limited to places with double-dressed tables. So onto Oscar’s in the Valley: an airy dining room rich in circa-2000s Country Style charm. It’s a place where guests can coo at vines, olive trees and the original copper still that kick-started the legend of Limeburners. Prior to becoming the Swan Valley tasting room for Limeburners and its gin offshoot Ginversity, this address housed popular wedding venue Carilley Estate. It was around this time last year that Oscar’s signed on to the lease at this spacious Herne Hill sharehouse. Should circumstances require, Oscar’s can accommodate the multigenerational group chasing lunch – some ace grass-fed beef perhaps, or line-caught snapper from Exmouth – before that next winery, brewery or distillery visit. But to get the full measure of a place poised to be Perth’s next big destination restaurant, a dine-and-dash won’t suffice. Instead, opt into one of the tasting menus, clear the rest of the afternoon, study the ripper drinks lists rich in local treasures. Then let this masterclass in provenance unfold. While the make-up of lunch is dictated by party size, the number of courses chosen and what’s in the kitchen’s larder and veggie crisper, every table gets the tangy spelt and wholemeal sourdough: thick, decidedly unfluffy and dense like mudcake. It’s ace with the accompanying house ricotta yet has the chops to also perform solo.\n\nAdvertisement\n\nJuniper-spiked mascarpone (also house-made) and crushed hazelnuts offer soft and crunchy counterpoints to roasted broccoli stem and scraps of fried Tuscan kale: a streetwise ode to autumnal flavours. Squeaky runner beans are grilled hard and gently sharpened by the haunting brightness of preserved lemon. This is farmhouse cooking not (just) by dint of location, but because of the menu’s tangible appreciation for farming, farmers and fidelity to ingredients. Chefs are fond of “letting the product speak for itself” and leaving what’s in their shopping baskets well enough alone. While some dishes at Oscar’s demonstrate such hands-off thinking – check out that rosy pickled veg made using vinegars from local growers Baba & Didas! – good cooking isn’t (just) about doing the least to an ingredient: it’s about doing the right thing to it. Sometimes that means smoking wings, cheeks and other fishy offcuts, then dousing everything in a heady sauce of smoked fish bones: a nod to the Basque signature, pil pil. Justin calls this dish “smoked WA whitefish”. I call it one of the finest things I’ve eaten this year. Related Article Into Africa: meet the cooks and restaurants flying the flags for African cuisine in Perth But sometimes the right way to treat something is to let it be. Berkshire pigs plus salt and patience equals fantastic prosciutto. A tiny cool room has been set aside for dry-ageing and hanging purposes: not in a showy, 4126-day ribeye sort of way, but to give meat the time – typically a couple of weeks – to begin developing flavours and naturally tenderise. In this case, such meats include richly flavoured Gwamby Grazing lamb, Walpole venison and other whole animals butchered in-house.\n\nAdvertisement\n\nThe twin pleasures of the venison duo – loin plus a roulade of peppery shoulder meat – suggests the relationship between Oscar’s and its meat wrangler Bully Butcher is a win for all. My hunch was confirmed by the lamb tasting plate and its many ovine glories, from the crispness of skin-on lamb belly to the funk-free richness of the fat crowning slices of tender lamb leg. Forming genuine connections to people and places doesn’t just get you good meat: it helps you maximise the resources at hand. Fallen gum trees from the property fire the grill. Fat from dry-aged animals is rendered to help produce all-time potatoes fondant. Late-summer tomatoes brought in by locals, once fermented, become the perfect finishing touch for Spanish mackerel cured in a salt mix modelled on Ginversity’s native gin. Related Article 14.5 / 20 Review Small wonder: Willetton’s Little Gan’s rethinks the suburban, family-run Asian restaurant Does it read like I’m frothing on Oscar’s? Good, because I am. While Oscar’s is firing after its first year in Herne Hill – previously, it was based in Guildford before building issues forced it to relocate – what’s really exciting is that this feels like an operation on the ascent. Easy-going service led by restaurant manager Daniel Adam and Justin’s parents feels perfect for the setting; second-generation vigneron Tom Daniel of nearby Chouette Wine in Millendon is helping rehabilitate the property’s vines; plus Justin just moved his young family into the farm next to Oscar’s, which he’ll also be slowly resurrecting. “There’s so much room for us to grow,” says Justin as he excitedly talks about the existing orchard, arable land and potential of his new six-hectare home.\n\nAdvertisement\n\nPart of his excitement, I think, comes down to the prospect of creating a place that proudly reflects its Swan Valley address. The other part? Well, at the end of the day, Justin Hughes is a boy from the country: a boy and chef, I might add, that diners should be tracking very, very closely. The low-down Atmosphere: a Swan Valley farmhouse restaurant posed to be WA’s next big destination diner. Go-to dishes: smoked whitefish. Drinks: world-class whiskies – occasionally at justifiably world-class prices – backed by thoughtfully chosen WA wines with a heavy focus on Swan Valley producers. Cost: about $160 for two people. Good Food reviews are booked anonymously and paid independently. A restaurant can’t pay for a review or inclusion in the Good Food Guide.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/about-schmidt-facing-the-challenge-of-the-lions-20250625-p5maaq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "About Schmidt: Facing the challenge of the Lions",
        "publish_date": "Fri, 27 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size For a few precious minutes, and with a frenzy of organised chaos swirling around him, Joe Schmidt sits down and sits still. The scene is the bowels of a cavernous studio building in Eveleigh, where a freshly-gathered Wallabies squad are busy trying on Test jerseys, white dress shirts and suit pants, picking through boxes of shoes and boots, posing for headshots and filming “content” for a variety of hungry stakeholders. There are only a few hours allocated before the whole circus must move on to training, so there are complex spreadsheets of players’ names, duties and locations taped up on concrete pylons. Massive bodies hustle between stations like a Tokyo pedestrian crossing. For a self-confessed planning obsessive, it’s hard to know if Schmidt is in his happy place, or mildly terrified. Or a bit of both. Every day of the next five weeks will feel a little like this for Schmidt and the Wallabies, as the much-anticipated British and Irish Lions tour hurtles around the country. Though the lead-in time is longer than any in modern sport, with tours to Australia only held every 12 years, once the show is underway, preparation timelines are measured in minutes. One of Schmidt’s stations on the pylon sheet is an interview to spruik ResMed, who are the official ‘sleep sponsor’ of the Lions tour. Schmidt laughs at the irony: he barely gets any sleep.\n\nAdvertisement\n\n“I need some sleep advice alright - it wouldn’t be something that is a strength of mine,” Schmidt says. “But I certainly feel like I have plenty of energy anyway with what’s coming up, and the good group of men that we have.” In truth, Schmidt has been preparing at this pace for weeks, and at a similarly frantic tempo since he took on the Wallabies job in January last year. With the Wallabies, and Australian rugby, at one of their lowest ebbs in the wake of the 2023 Rugby World Cup, Schmidt signed up and began planning backwards from August 2, 2025. That’s the date of the Wallabies’ third Test against the British and Irish Lions in Sydney. And it was, initially, the end of his contract, though that would be pushed back several times. It was a mammoth job with a perilously short runway, so it was assumed some of Schmidt’s motivation was the rare chance to coach against the British and Irish Lions. One of the final boxes to tick on a distinguished coaching CV. Wallabies head coach Joe Schmidt signs autographs for school children. Credit: Getty Images for ARU\n\nAdvertisement\n\nNot so, says the 59-year-old Kiwi. “It was seriously just the opportunity to try to elevate the footprint of the Wallabies,” Schmidt says. “Having coached against the Wallabies a number of times, both with the Irish and the All Blacks, the Wallabies is a massive brand in the international game and it was probably tarnished a little bit in the performances at the World Cup, so it was just to try to help. “I don’t have a magic formula or anything, I’m very ordinary, but I work hard and when (RA high performance boss) Peter Horne asked me if I’d try to help, I just felt that the Lions, because it’s such a big occasion, it really gives us an opportunity to become a little bit more visible here in Australia.” Schmidt senses progress on that front. Where once only Irish people in “County Coogee” would stop him in the street, now people with broad Aussie accents are keen to yarn about the rise of the Wallabies over the past year, and their chances against the Lions. That energises him, too. Unlike many in the game, Schmidt never really dreamed about being part of a Lions series.\n\nAdvertisement\n\nIt was not on a coaching bucket list, and while he often spoke with Lions coaches when coaching Ireland about players and endorsed their cases for selection, Schmidt never took up approaches to be involved with the Lions set-up. “It was never something that I’d aspired to be involved in, but they always excited me,” Schmidt said. “The one thing I do remember as a kid, I must have been really young, but there was a Lions test, I think it was the fourth Test in 1971, and the All Blacks had to win it to draw the series. “The Lions had legends like JPR Williams, Barry John and Carwyn James, and the All Blacks had Colin Meads and Brian Lochore, Sid Going - these guys I grew up admiring. I just remember a dog ran on the field and a guy tripped over it. That’s what you remember when you’re a kid, I suppose.” Lions’ star Barry John streaks away in the fourth Test in 1971, from New Zealanders Wayne Cottrell, Ian Kirkpatrick and Sid Going. Credit: Fairfax But fast-forward 54 years and, somehow, Schmidt has found himself about to lead Australia into battle with the famous Lions touring side. Since taking on the Wallabies job last year, Schmidt has been happy to admit it’s all a bit daunting. The very best of four nations against a team who missed the Rugby World Cup finals. At no.8 in the world, the current Wallabies are the lowest-ranked host nation of a Lions tour in the professional era - by some distance. Five of the previous seven hosts were reigning world champions.\n\nAdvertisement\n\nBut there is also level of familiarity about the Lions that has helped Schmidt eventually get off to sleep. The Lions coach is Andy Farrell, who was Schmidt’s defence coach at Ireland, and there are multiple assistants and Lions players who were once part of his Dublin life, too. The Lions’ patterns of play will likely have some of his fingerprints on them. Schmidt and Farrell are good mates and have even made a pact, of sorts, to try and keep the upcoming series on friendly terms, too. Schmidt cites the toxicity of the Lions’ last tours of South Africa and New Zealand, which became soured by feuds about refereeing criticism and off-field controversies. Coach Andy Farrell at Lions training in Dublin. Credit: Getty Images Then-Lions coach Warren Gatland said last year: “In South Africa (in 2021), it was almost a win at all costs, the ends justifies the means. It didn’t feel like it was about rugby. It was almost like things off the field were trying to upset players or the team, and it was deemed acceptable.” Schmidt says: “I would know a lot of these players coming over, and would have massive respect for the people they are, as well as the players they are. And I think my ideal around this was, having been at the 2017 games and seeing how edgy it was, and then the Springbok tour last time, where it probably didn’t do a massive amount for promoting the game in a really positive light.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/this-serial-pest-called-a-woman-a-fat-dumb-blonde-he-says-he-was-being-picked-on-20250604-p5m4z1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This serial pest called a woman a ‘fat dumb blonde’. He says he was being picked on",
        "publish_date": "Fri, 27 Jun 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jordan Baker"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Andrew Thaler knew he was wrong to call a fellow Snowy Monaro councillor a fat liar, and for publicly arguing that if a non-binary council employee couldn’t work out their gender – “know whether it’s a boy or girl”, as he put it – they wouldn’t be able to do their job, his barrister, the former Labor MP Adam Searle, told a tribunal this week. Thaler himself was less emphatic about his regret. “It’s hard to express remorse for telling the truth,” he said under cross-examination, arguing his “robust” language was self-defence. He argued he was not speaking as a councillor, but he was merely quoting himself from a pre-election article in this masthead when he described fellow councillor Tanya Higgins as a “fat dumb blonde, it’s physically obvious”. Thaler also doubled down on his view that the staff member was a DEI (diversity, equity and inclusion) hire, invoking a Trumpian term. He also said his use of the pronoun “it” did not necessarily dehumanise them, but rather highlighted their internal conflict. In fact, Thaler said, he was the one being picked on. He told the NSW Civil and Administrative Tribunal (NCAT), as it considered his appeal against a three-month suspension, that some of his fellow councillors had been hostile ever since his election last year, when they tried and failed to uphold a longstanding ban on his presence in council chambers (which arose from the risk council felt his behaviour posed to its staff; his election to the council in September automatically overturned the ban). Andrew Thaler is attempting to overturn his three-month suspension for councillor misconduct. Credit: Alex Ellinghausen But he thinks they dislike him “because I’m a man”, he told the tribunal. “It’s because I have five kids. It’s because I’ve been married for 19 years … those are the things that [people are hostile about] at that council.” The drawn-out saga over Thaler’s behaviour has gripped the Snowy Monaro region, where he was known as a serial pest before being elected to public office with little more than 100 first preference votes. His behaviour while a councillor has prompted the minister to issue a performance improvement order to the council, that says the drama is interfering with the operations of local government. His comments about the councillor and staffer in March earned him a three-month suspension, the maximum, from the Office of Local Government (OLG). But the Snowy’s controversy is the pointy end of a bigger issue. Councillors are behaving badly across the state, yet the NSW system for holding them accountable is broken. This has been openly acknowledged across the sector for at least 10 years, but there has been no reform.\n\nAdvertisement\n\nA government discussion paper last year laid out the problem. Council debates are “too often personal slanging matches”, it said. Frivolous complaints clog the system, leaving little capacity for it to deal with serious issues. The system for handling misconduct should not be so unwieldy and ineffective that it inhibits “the operation and function of local democracy”. Councils manage their own complaints (which can lead to politicisation), but can refer them to the OLG if they think it’s warranted. In the financial year to June 2024, Bathurst clocked up the most complaints with 38 (none were upheld), followed by Lismore with 24 (none were upheld) and Sutherland with 23 (again, none were upheld). Of a total of 381 complaints, only 45 were found to constitute a breach. They cost almost $1.5 million to investigate. There were also concerns from the sector that penalties for councillor misconduct, when upheld, are too light. The maximum suspension the OLG can hand out is three months, while NCAT can issue a disqualification of up to five years. A 2022 report found the sector was concerned that the sanctions, and the OCG and NCAT’s reluctance to invoke strong ones, was an ineffective deterrent to poor conduct. That earlier report, commissioned by the Coalition government, raised myriad problems with the system, ranging from conflicts of interest, partisan behaviour, incompetence, and the lack of appropriate penalties when misconduct was found. “Key stakeholders in the sector have lost confidence in the current arrangements,” it found, and called for an overhaul. A road map for change went to cabinet in February 2023, just before the election. But when Labor won, the new local government minister, Ron Hoenig, jettisoned that plan and began his own review.\n\nAdvertisement\n\nAnother discussion paper was released in September last year. There’s not enough dignity in local government, it said, and proposed letting the OLG issue fines to councillors, suggested a privileges committee of experienced mayors examine allegations of misbehaviour, and said bans should be solely imposed by tribunals such as NCAT (they often end up there on appeal, anyway). It also proposes councillors have to rid themselves of real estate and development business activity and contracts. A spokeswoman for Hoenig said the Labor government felt the Coalition’s solution would add more bureaucracy and complexity “to an already broken system”. A new code of conduct, mechanisms to “surcharge” councillors for frivolous complaints and a new meeting code would be released “soon”, she said. Councillor Tanya Higgins (right, pictured with neighbour Bronnie Taylor) was targeted by Andrew Thaler in his social media posts. Credit: Alex Ellinghausen The behaviour problem is putting people – particularly women – off running for local government. A Victorian survey found 61 per cent of female local councillor respondents had experienced threatening or intimidating behaviour from fellow councillors, while another study found half of women left council after the first term. Women have been among Thaler’s most frequent targets; he has called female elected officials dumb, fat, a pig, deliberately childless, a horrendous excuse for a human, and has told a state MP – and, on a separate occasion, this reporter – to go “suck a dick”. Licia Heath from Women for Election said women were increasingly leaving councils due to bullying and harassment. “We will shortly have a crisis of representation in local government,” she said. That will affect other levels, as state and federal MPs often cut their teeth in council.\n\nAdvertisement\n\n“I’m getting increasingly concerned that there will be a pipeline issue of talented women in our state and federal parliaments, unless relevant ministers insist now on a similar review as the Kate Jenkins Set the Standard to be conducted at the local government level,” Heath said referring to a report by the former sex discrimination commissioner. Thaler is right that there are people in the area who don’t like him. Before he was elected, he’d been banned from council chambers because his behaviour was considered a workplace health and safety risk. He’d also been banned from a few businesses. He was the subject of 19 complaints over a two-month period last year, the performance improvement order said; complainants alleged his behaviour left staff and fellow councillors feeling unsafe, anxious and in one case, physically sick (Thaler said he was never given a chance to respond, and those complaints have not been investigated). Loading He told the tribunal that the council had sought legal advice about what to do with him, which said it could not ban him but they could “discipline me out of council”. In his appeal against his suspension on Tuesday, Thaler’s barrister, Searle, argued the decision made by the Planning Department deputy secretary responsible for local government was invalid because he had not conducted a proper investigation first. He also said a three-month suspension was too harsh. “We would say the applicant would say not much weight should be given to those incidences, they occur in the context of Councillor Thaler raising significant matters of public interest,” he said. Thaler insisted he was telling the truth when he used the word liar, despite not being able to produce evidence, but admitted he should not have referred to the councillor’s size.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/hotels-banquets-and-cheap-travel-beijing-woos-taiwan-s-youth-20250613-p5m79c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hotels, banquets and cheap travel: Beijing woos Taiwan’s youth",
        "publish_date": "Fri, 27 Jun 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Lisa Visentin",
            "Daniel Ceng"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Sitting in a cafe in southern Taiwan, tourism graduate Richard Huang makes a frank admission. Some of his friends have questioned whether he is a tool of the Chinese Communist Party, helping to spread Beijing’s worldview through his social media. On his Instagram account, Huang spruiks the Beijing-subsidised trips he has taken to places like Xinjiang, a province in China’s north-west, and offers to help set up his followers on similar exchange programs targeted at Taiwanese youth. Chinese influencer Yaya (Liu Zhenya) was forced to leave Taiwan after authorities deemed her online comments in support of Chinese military drills a threat to Taiwan’s national security. Credit: Anadolu via Getty Images “My friends have asked me: “Hey, aren’t you worried you are being brainwashed?,” says Huang, a pseudonym that he requested to speak openly about his experience. “My response is: as long as you are resilient in your own mind, you won’t be compromised by the influence coming from these trips.” As part of an eight-day tour to Xinjiang, Huang and about 30 other Taiwanese students and graduates were put up in 4-star hotels and treated to nightly banquets. By day, their itinerary included visits to museums and cultural activities, such as musical performances by Uyghur groups, an ethnic Muslim minority in Xinjiang. The activities were peppered with speeches from Chinese officials about Taiwan and China being “one big family”. At one event, the group sang Tomorrow Will be Better, a Taiwanese pop song from the 1980s that has since been appropriated by Chinese state media to promote a message of unification between the democratic self-governing island and the mainland. China claims Taiwan as part of its territory, even though the CCP has never controlled the island.\n\nAdvertisement\n\nThe propaganda, Huang says, is the price participants pay for a cheap trip. He paid 20,000 Taiwanese dollars ($1043), about a 50 per cent discount, he says, with the rest subsidised by the Chinese government. Richard Huang, who requested his identity be concealed with a pseudonym, promotes Beijing funded trips to Taiwanese youth. Credit: Daniel Ceng But there was another subtle quid pro quo. During the tour, Chinese officials suggested the participants share their experience on social media and tell their friends that Xinjiang was not the terrible place portrayed by Taiwanese media. When he arrived back in Taiwan, Huang did just that. “The magnificent scenes covered by a blanket of snow, the heaps of food I had, and the diversity of ethnic cultures and traditions I experienced – the list never ends, and the beauty of Xinjiang is beyond what photos and words can describe,” Huang posted on Instagram. He implored his friends to go and see for themselves. Huang made no mention of the reports, including those by the United Nations, of the brutal repression and human rights violations of the Uyghur population by Chinese authorities, claims which the Chinese government denies. Instead, he observed that the different ethnic groups got along with “great friendliness and tolerance”. United Front campaign\n\nAdvertisement\n\nState-sponsored travel programs are hardly a new tool in Beijing’s soft-power efforts to shape opinions in Taiwan in line with its foremost goal – to bring the island under the control of the Chinese government. But under President Lai Ching-te, the Taiwanese government has become increasingly concerned that Beijing is intensifying its propaganda, with study tours, tourism, cultural exchanges and social media influencers all spreading pro-Beijing messages to Taiwan’s youth. These activities are widely suspected by Taiwanese authorities and Chinese analysts to be part of the operations of the United Front Work Department – the CCP’s core influence arm that uses diaspora communities to promote Beijing’s agenda overseas. A sign displays slogans “China’s ethnicities, one family” and “Forever follow the party” in Aksu, Xinjiang. Credit: AP China’s Foreign Ministry was contacted for comment. Dr Nathan Attrill, a China specialist at the Australian Strategic Policy Institute, has tracked United Front activity relating to Taiwan. He identified 67 events in 2024 that sought to cultivate Taiwanese Youth and influencers, more than double the next most targeted group of businesses and entrepreneurs. “The main themes of these sorts of events are always to emphasise a shared culture, or a shared heritage between the peoples of China and Taiwan, thereby establishing some sort of justification for why China claims to have sovereignty over Taiwan,” Attrill says.\n\nAdvertisement\n\nBeijing doesn’t try hard to hide the United Front’s involvement in these tours. The exchanges are often given effusive coverage in Chinese state media, which routinely notes the attendance of United Front officials or their associated organisations at the events. Trips to Xinjiang, a top destination for such cultural tours, serve the dual purpose of presenting a tightly orchestrated, sanitised image of the region while promoting the Chinese government’s unification agenda, says Raymond Sung, vice president of the Prospect Foundation, a government-backed institute in Taipei. ‘I do not support the idea of being fully controlled by China ... The only thing that I want to do is to foster cultural exchanges between the two sides.’ Richard Huang “By being a participant, you’re actually sponsoring or being part of that [Chinese government propaganda],” Sung says. These kinds of exchanges, experts say, are also designed to cleave at the deep political polarisation in Taiwan. Lai’s pro-independence-leaning Democratic People’s Party is reviled by Beijing as a separatist force, and bitterly opposed by Taiwan’s main opposition party, the Kuomintang, which favours closer ties with the mainland. Beijing’s Taiwan Affairs Office has accused Lai’s government of inciting anti-China sentiment by “exaggerating the so-called united front threat” and “using all means to intimidate and suppress groups and individuals on the island who support and participate in cross-strait exchanges”. For now, Beijing’s charm offensive to win the hearts and minds of Taiwan’s younger generations doesn’t appear to be paying off.\n\nAdvertisement\n\nPolling consistently shows that a clear majority of people in Taiwan identify themselves as being solely Taiwanese. This rose to as high as 83 per cent for 18-34 year-olds, compared with 15 per cent who identified as being Taiwanese-Chinese and 1 per cent who considered themselves to be solely Chinese, according to a Pew Research survey in 2024. Tensions between propaganda and free speech Nonetheless, the Lai government this year has pursued a crackdown on China’s united front and espionage efforts, including tighter regulation of cross-strait exchanges and new disclosure requirements for all public servants travelling to China on such trips. In February, Taiwan banned academic exchanges with three Chinese universities, citing concerns over political influence, and in March, authorities expelled three Chinese influencers for promoting “unification by force” narratives on their social media accounts. The authorities have since revealed they are investigating 20 Taiwanese celebrities for amplifying CCP messaging. Building on the themes of this campaign, Lai embarked this week on a 10-stop speech tour across Taiwan under the banner of “uniting the country” in the face of China’s pressure. In his first speech on Sunday, he declared “of course Taiwan is a country” and called for its future to be decided by its 23 million citizens, infuriating Chinese authorities, which slammed his speech as “deliberately inciting provocations”. The expulsion of the Chinese influencers has fed into a broiling debate about free speech, and the curbs Taiwan is willing to put on its own democracy to counter the tactics of its authoritarian neighbour. Taiwan’s President Lai Ching-te has made countering on Chinese state influence a key priority of his government, but some measures have sparked about debate about free speech concerns. Credit: Daniel Ceng\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/luxury-sydney-apartment-sells-for-141-55m-setting-national-home-price-record-20250624-p5m9v7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Luxury Sydney apartment sells for $141.55m, setting national home price record",
        "publish_date": "Fri, 27 Jun 2025 11:17:43 +1000",
        "category": "finance",
        "authors": [
            "Tawar Razaghi",
            "Kristy Johnson"
        ],
        "text": "Multimillionaire Yan Zhang has paid $141.55 million in cash for Australia’s most expensive home, a penthouse overlooking Sydney Harbour.\n\nZhang bought the top three floors of Lendlease’s One Sydney Harbour development at Barangaroo South.\n\nAn artist’s impression of the $141 million penthouse sold atop Lendlease’s Residences One tower at One Sydney Harbour. Credit: Supplied\n\nThe off-the-plan sale, inked in 2019, is an amalgamation of the two-storey penthouse of the Renzo Piano-designed building, which is for himself, and a sub-penthouse directly below, for friends and family to stay in. The home settled with no mortgage on title.\n\nThe sale tops all of Australia’s previous confirmed house and apartment records, including Atlassian co-founder Scott Farquhar’s $130 million sale of the Point Piper mansion Elaine, which settled to a consortium of developers last week who are planning to carve it up and sell it off in four lots.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/not-my-friend-kim-williams-lashes-austen-tayshus-amid-fresh-scandal-20250627-p5mar2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Not my friend’: Kim Williams lashes Austen Tayshus amid fresh scandal",
        "publish_date": "Fri, 27 Jun 2025 11:12:06 +1000",
        "category": "finance",
        "authors": [
            "Calum Jaspan"
        ],
        "text": "Kim Williams has lashed Austen Tayshus after it emerged the once-prominent comedian continues to invoke the ABC chair’s name in heated messages, this time to a former staffer at the broadcaster.\n\nMore correspondence was revealed by 2GB on Friday morning, two months after Media Watch exposed the comedian’s use of Williams’ name to pressure ABC staff to give him air time. This time, Tayshus, real name Sandy Gutman, refers to himself as “mate of Kim Williams” in a message to former Radio Sydney host Josh Szeps.\n\nComedian Austen Tayshus (left) and ABC chair Kim Williams. Credit: AP, Alex Ellinghausen\n\nThe message, which was sent on Facebook Messenger to Szeps, appears to be in relation to an opinion piece written by Szeps in The Sydney Morning Herald. Gutman, who is Jewish, called Szeps’ a “half-Jew” for critiquing Israel over its military campaign in Gaza.\n\n“What you did is dangerous to others. You can sleep well. Just shut up and keep these opinions to yourself at this dangerous moment,” Gutman wrote.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/celebrity/australian-collector-buys-princess-diana-s-caring-dress-for-520-000-20250627-p5maq7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian collector buys Princess Diana’s ‘caring dress’ for $520,000",
        "publish_date": "Fri, 27 Jun 2025 10:54:47 +1000",
        "category": "finance",
        "authors": [
            "Nick Newling"
        ],
        "text": "An Australian collector of Princess Diana memorabilia has purchased the iconic “caring dress” at auction for US$520,000 (approximately AU$794,000), 37 years after the purchaser met the princess wearing the dress.\n\nRenae Plant – who manages an archive of 2700 Diana pieces as well as the virtual Princess Diana Museum – fell to the floor crying after placing the final US$400,000 bid (plus US$120,000 in fees) for the Bellville Sassoon dress designed for then-prince Charles and Diana’s 1988 tour of Australia to mark the bicentenary.\n\nThe floral day dress was expected to sell for between US$200,000 and US$300,000 according to pre-auction documents. It received its nickname after Diana wore it repeatedly to visit hospitals across the world, including in Nigeria, Brazil and Spain, says designer David Sassoon.\n\nOn the website for The Princess Diana Museum, Plant says she met the royal couple as a teenager during their 1983 and 1988 tours, and shook hands with the princess while she was wearing the dress at St Andrew’s Cathedral in Sydney.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/controversial-road-rule-change-set-to-impact-over-a-million-aussies-from-july-230756181.html",
        "title": "Controversial road rule change set to impact over a million Aussies from July",
        "publish_date": "2025-06-26T23:07:56Z",
        "category": "finance",
        "authors": [],
        "text": "E-scooters have become increasingly popular in Australia, but their rapid rise has sparked concerns. In SA, they'll be legally allowed in more public spaces from ever from July 13.\n\nE-scooters are controversial when used incorrectly, but in SA, they'll soon be allowed to be legally ridden under strict criteria. Source: Getty/Facebook\n\nThey're a controversial mode of transport, but from next month, private e-scooters and other electronic mobility devices will be allowed on public roads and even footpaths in one state.\n\nThe major road rule change is set to be formally rolled out in South Australia from July 13, impacting the state's 1.8 million residents. It is aimed at easing traffic congestion and providing commuters with more travel options.\n\nAnnouncing the plan, the state's Transport Minister Tom Koutsantonis said e-scooters, e-skateboards, e-bikes and other e-mobility devices can now be legally used for people over the age of 16, provided they travel at a maximum of 10 kilometres per hour on footpaths, beaches and shared pathways.\n\nFrom July 13, e-scooters, bikes and other e-mobility devices will be allowed on roads and even footpaths, under certain guidelines. Source: ABC\n\nWhat road rules are changing in South Australia?\n\nE-scooters will be permitted on the state's roads with speed limits of 60 kilometres per hour or less, but, they are only allowed to do so in the bike lanes with speeds of 25kph or less.\n\nADVERTISEMENT\n\n\"The state government has taken its time because we want to get this right,\" Koutsantonis told media.\n\n\"The reason we've taken our time is because this is new technology, and I believe it's going to be embraced. This is a great way of people being able to access carbon-free transport, it's being embraced by young people ... it is a cost-effective way of travelling.\"\n\nHelmets must be worn and drivers must be cautious of regular road rules, though no licence or registration will be needed for e-devices at this stage.\n\nElectric mobile devices have become increasingly popular in Australia in recent years, but their rapid rise has sparked controversy in many regions due to safety, regulatory, and urban planning concerns.\n\nADVERTISEMENT\n\nOne of the biggest points of contention is their use on footpaths and roads. In many states, rules differ—some allow e-scooters on bike lanes or roads, while others limit them to specific trial zones. This patchwork of laws has created confusion among users, pedestrians, and law enforcement alike.\n\nMany say their use is underregulated, with accountability in the event of accidents frequently cited as a major concern, particularly due to the fact that the devices are often ridden without helmets, at night, or by inexperienced users, increasing risk.\n\nClutter caused by e-scooters and bikes, which are often left lying on footpaths, in parks, or across driveways, is also another issue regularly raised.\n\nThough advocates argue that e-devices reduce car dependence and carbon emissions, create a more pedestrian-friendly environment, and reduce traffic levels in big cities.\n\nADVERTISEMENT\n\nBicycle NSW CEO Peter McLean argued there are several key benefits of e-bikes, emphasising their role in sustainable and efficient transport.\n\nSpeaking to Yahoo, he earlier praised the devices for reducing carbon emissions, as they offer a cleaner alternative to cars, particularly for short commutes. He said e-bikes are also more energy-efficient than traditional motor vehicles, contributing to greener cities and reduced traffic congestion.\n\nSA isn’t the first state to introduce these laws — public use has already been legalised in Queensland, New South Wales, the ACT, and Tasmania.\n\n\"It's going to take a bit of time as well to educate the public about the roll-out of these e-scooters, so the government's beginning an awareness campaign to let people know what the rules are,\" Koutsantonis said. \"We'll be conducting a review 12 months from now just so we can tweak this if we need to.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/calls-for-urgent-action-to-tackle-growing-caravan-crash-rates-on-aussie-roads-074531998.html",
        "title": "Calls for urgent action to tackle growing caravan crash rates on Aussie roads",
        "publish_date": "2025-06-26T07:45:31Z",
        "category": "finance",
        "authors": [],
        "text": "There are renewed calls for authorities to provide specialised training for drivers towing caravans as more and more vehicles hit Australian roads. It follows an increase in accidents involving caravans, as experts argue a focus on safe towing education can reduce the road fatality rate.\n\nThis week, Queensland released its Transport and Main Roads Budget for the upcoming year, and while industry experts praised its focus on safe driving initiatives, they are calling for subsidising towing courses for drivers to help make roads safer.\n\n\"There's a lot involved in the application of connecting the recreational vehicle to the car, that's one thing, but then there's actually how to tow and manoeuvre safely on the road and respond to certain conditions,\" Jason Plant from Caravan and Trade Industries Association Queensland (CTIAQ) told Yahoo News.\n\n\"We think a stand-alone, subsidised towing course would be of great benefit to road safety in general.\"\n\nADVERTISEMENT\n\nMost private caravan towing courses in Queensland cost about $500 and many new van drivers take to the road without taking a course. Research carried out by CTIAQ found 80 per cent of RV owners in the state believe their driving behaviour would change for the better if they had proper access to education.\n\n\"There's no doubt that with more knowledge and more training from industry experts, it will improve people's confidence,\" Plant said, adding the government-led education program VanSafe — which takes a more general approach to caravanning — has already resulted in 60 per cent of the over 1,300 participants changing their towing behaviour.\n\nThe CTIAQ hopes to build on the promising results coming from the VANSafe program, which was launched in 2023 with help from the Queensland government. CTIAQ is seeking an investment of $1.98 million over four years from the state government to support VANSafe in providing towing-specific courses, and has requested $3 million of federal funding.\n\nFrequent caravan accidents as national road fatality rate rises\n\nYahoo News has reported on countless incidents of dangerous road conditions caused by drivers incorrectly towing their caravan to their vehicle, or making mistakes with weight distribution. A caravan was spotted on the road violently swaying near Adelaide after the driver appeared to unsafely loaded bikes onto the back of the van. In April, Yahoo reported on a Victorian couple who were 50km from home when their tethered caravan spun around in the middle of the road, narrowly missing a 57-tonne truck travelling behind it.\n\nADVERTISEMENT\n\nThere have been 136 fatalities on Queensland roads in 2025 up to June 22. This is up 25 per cent on the 109 road fatalities for the same time of the year in 2020, according to the state's Department of Transport and Main Roads. Last year was reported to be the deadliest year on Australian roads since 2012, and this year is forecast to be even worse.\n\nThere has been an increase in the number of caravan accidents in Aussie roads. Source: TikTok & Facebook/Maree Borland\n\nContinued calls for caravanners to access towing training\n\nIt's not the first time experts have called for specialised training for caravanners, with some even suggesting mandatory licences should be required before getting behind the wheel.\n\nADVERTISEMENT\n\nNatalie Watson-Brown, whose research at Queensland University of Technology focuses on road safety and education, welcomed the idea of additional licensing when speaking to Yahoo News last year.\n\n\"People that tow caravans often drive in diverse, complex environments including unsealed roads, narrow roads and high-speed roads, then to low-speed congested roads,\" she said \"So if some of these factors are contributing to their crashes, then that needs to be important in their training and then in their testing before they get their licence\".\n\nThis sentiment was echoed by RAC claims manager Glen Walker, who previously told Yahoo News \"it is crucial caravan owners prioritise learning how to safely maintain, load and tow their vans\".\n\n\"It's also critical to keep the caravan balanced, with the correct weight on the tow-hitch, by distributing weight evenly when packing,\" he added.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-man-called-out-for-little-known-rubbish-bin-mistake-most-of-us-make-071554460.html",
        "title": "Aussie man called out for little-known rubbish bin mistake most of us make",
        "publish_date": "2025-06-26T07:15:54Z",
        "category": "finance",
        "authors": [],
        "text": "Every week, 'waste educators' in one Aussie city inspect more than 1,000 bins at random. Is it educational or intrusive? Vote in our poll.\n\nA new program launched last month in the ACT will see more bins being inspected than ever before. Source: Facebook/Robert Hamling, Getty Images\n\nA Canberra resident was surprised to find a note attached to his recycling bin, informing him of a little-known mistake he was making with his rubbish. The bright yellow tag informed him that his bin had been inspected, as part of a new program rolled out last month across the ACT.\n\nThe slip highlighted two types of items that had been incorrectly thrown away — soft plastics and receipts. Receipts are one of the most commonly misunderstood items when it comes to recycling.\n\nDespite their paper appearance, most receipts are coated in chemicals that make them unsuitable for recycling. Also high on the list of frequent mistakes are disposable coffee cups and used paper towels — items many Aussies assume are recyclable but, in most cases, belong in the general waste bin.\n\nHow do the bin inspection programs work?\n\nThe programs were introduced in 2017 beginning with the green waste and FOGO bins. In May, the program was extended to include recycling bins and aims to educate residents on what can and can’t be put in those bins.\n\nADVERTISEMENT\n\nEach week, streets are selected at random to have their bins inspected by 'waste educators' from the ACT Government or Envirocom Australia.\n\n“They aim to inspect approximately 600 recycling bins and 500 green waste and FOGO bins across various suburbs each week,” an ACT Government spokesperson told Yahoo News.\n\nThe Canberra resident found the note on his bin, informing him that he shouldn't be putting soft plastics and receipts into the recycling. Source: Facebook/Robert Hamling\n\n“The bin inspections are conducted on the morning of bin collection when all bins are presented on the kerbside.”\n\nThe program is purely for educational purposes, with officials insisting no fines or penalties will be imposed, and bins will still be collected as normal — unless hazardous material is discovered.\n\nThe spokesperson said correct disposal can:\n\nreduce contamination\n\nimprove resource recovery\n\nprotect our recycling and composting systems.\n\nIs someone going through my rubbish?\n\nYes, the inspectors do open the bins to look at the items inside, but they will only “observe material on or near the top,” the spokesperson said.\n\nADVERTISEMENT\n\n“They may move a few items from the top surface so they can provide accurate feedback.”\n\nThe inspectors will only ever look at bins already on the kerb for collection, and carry a letter of authorisation from the government if any resident is unsure of what they are doing.\n\nAnd it’s not just the inspectors that can raise issues with bins.\n\nRubbish trucks in the ACT are fitted with cameras that allow drivers to monitor the waste being emptied from the bins. The drivers can also place a tag on a bin if they spot a hazardous item or large amounts of contamination.\n\nIn rare cases, drivers may refuse to empty the bin of the load is deemed dangerous or overly contaminated.\n\nOne final reason for a bin tag is if the bin is damaged or broken. This tag will prompt residents to book a repair or arrange a replacement.\n\nThe program was designed to educate residents to create better waste habits. Source: ACT Government\n\nWhile some Aussies find bin tags to be a welcome bit of education, others find it too intrusive.\n\nADVERTISEMENT\n\nEssendon mum Kali told Yahoo last year that she felt the note on her bin was \"shaming her\" for making a mistake.\n\nShe had put reusable shopping bags into her recycling bin, and noticed many bins in the street were tagged.\n\n\"It's just a bizarre thing to do,\" she said. \"I thought it was funny that I got bin shamed. I'm sure we're all guilty of [recycling incorrectly], it's an easy mistake.\n\n\"Our whole street was embarrassed about it,\" she added, saying \"other neighbours were more offended\" than she was.\n\nKali felt the bin tags were 'shaming' her and her neighbours. Source: Kali/Supplied\n\nCommon recycling mistakes Aussies are making\n\nA 2024 survey from Veolia found Aussies are unsure which bin to use about 40 per cent of them time, and 77 per cent of residents still don't know which bin disposable coffee cups should go in (it's the red one).\n\nADVERTISEMENT\n\nOther items leaving residents stumped are bamboo and wood cutlery, which 63 per cent assumed were recyclable, and biodegradable plastic bags, which 58 per cent of people were putting in the wrong bin. Both of these should also go in the general waste bin and then to landfill.\n\nAny residents who are unsure of what can and can't be recycled can download the Recycle Mate app, which allows you to search for any product and it will tell you which bin it belongs in. There is also the option to put in your address and local council to make sure the information is right for your area.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]