[
    {
        "url": "https://www.9news.com.au/national/matthew-haylett-leaves-hospital-recovery-teenager-broke-neck-dive-mullaloo-beach-gone-wrong/7d2cf90f-c388-450e-9981-7387d8301067",
        "title": "Teen defies the odds to walk out of hospital six months after breaking his neck",
        "publish_date": "Fri, 03 Oct 2025 13:55:00 +0000",
        "category": "sports",
        "authors": [
            "Oct"
        ],
        "text": "A teenager has walked out of hospital just six months on from breaking his neck, after he unknowingly struck a sandbank while diving into water at Mullaloo Beach .\n\nAfter learning to walk again, Matthew Haylett now has his sights set on playing football once again .\n\nBut today, it was an emotional farewell to those who helped him get back on his feet as the 18-year-old left Fiona Stanley Hospital after five months.\n\nREAD MORE: Former Italian restaurant owner jailed\n\nTeenager Matthew Haylett has walked out of hospital just six months on from breaking his neck, after he unknowingly struck a sandbank while diving into water at Mullaloo beach. (9News)\n\n\"It's really overwhelming the fact he survived it, let alone he's walking again, it's just unreal - and just look at that love,\" mother Megan Larson told 9News.\n\nThe teenager broke his neck diving into water at Mullaloo beach in March and hitting a sandbank.\n\nHis mate saved his life by pulling him onto shore.\n\nHaylett spent a month at Royal Perth Hospital after spinal surgery and was told he may never walk again after being paralysed from the neck down.\n\nHaylett spent a month at Royal Perth Hospital after spinal surgery and was told he may never walk again after being paralysed from the neck down. (9News)\n\n\"That was strange,\" the 18-year-old recalled.\n\n\"First couple of days it's just like your head's floating then slowly you get some feeling back and I could move my arm.\n\n\"It took a couple weeks to get a twitch in my leg.\"\n\nHe was eventually transferred to Fiona Stanley Hospital for rehabilitation, which included a dozen gym sessions per week.\n\nHis recovery progressed quickly, leaving staff stunned.\n\n\"He came in with a C5-6 injury, so it's quite high, he was in a collar and not doing much in bed, so no-one expected him to be as great as he is today,\" clinical nurse Monique Carbone told 9News.\n\nSix weeks after the accident, Haylett had an inspirational visit from Thomas Davison, who had suffered the same fate (9News)\n\nSix weeks after the accident, Haylett had an inspirational visit from Thomas Davison, who had suffered the same fate after plunging into a sandbank at Mandurah Town Beach in 2023.\n\nTwo years on from his own accident, Davison gave Haylett some hope with the 17-year-old defying the odds and learning to drive.\n\n\"I had one goal for myself and that was just to get out of that wheelchair. I've succeeded [with] that now,\" Davison told 9News earlier this year.\n\nEven though Haylett's now been discharged, he still has a lot of recovery ahead of him.\n\nHe'll complete eight weeks of rehabilitation at home as well as regular appointments at Fiona Stanley Hospital.\n\nThe Western Power apprentice now looking forward to getting back to work, driving his car and hopefully playing sport. (9News)\n\nThe Western Power apprentice is looking forward to getting back to work, driving his car and hopefully playing sport.\n\nHis advice for those recovering from serious injuries is to really put in the effort.\n\n\"You get what you put into it,\" he said.\n\n\"All the physio and staff are here to help, just try and do as much as you can. Everyone's different so you don't know how it's going to end up but just make the best of it.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/october-long-weekend-2025-trading-hours-whats-open-closed-state-by-state-explainer/74ddecf0-2629-4ccf-b4bb-bc56b07dafbb",
        "title": "What will and won't be open on the public holiday",
        "publish_date": "Fri, 03 Oct 2025 02:24:24 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Millions of Australians will have some time off this weekend as they celebrate one of two public holidays.\n\nFor Aussies in South Australia, New South Wales and the Australian Capital Territory, it will be their Labour Day.\n\nQueensland residents will have a public holiday on the same day to commemorate the King's Birthday.\n\nSo what will be the trading hours for Australia's biggest retailers this long weekend?\n\nHere's a quick state-by-state guide. ﻿\n\nColes\n\nStores across NSW, ACT and QLD will be open as normal.\n\n﻿In SA, all stores will be closed except for﻿ Port Lincoln, Port Pirie, Berri, Port Augusta, Mount Barker, Adelaide Rundle Place, Whyalla, Murray Bridge Green, Mount Gambier and Victor Harbor.\n\nFull trading hours can be found on their website .\n\nAldi\n\nStore hours will vary for different stores and states.\n\nFull trading hours for each store can be found on their website﻿\n\nREAD MORE: When October long weekend double demerits apply for motorists\n\nAldi recommends that customers check their local stores trading hours on their website (Nine)\n\nWoolworths\n\nAll stores except for some in South Australia and the Northern Territory will be open.\n\n﻿Full trading hours can be found on their website .\n\nLiquorland\n\nStores in states celebrating the public holidays will trade with reduced trading hours.﻿\n\nIn Queensland,﻿ some stores will be closed for the public holiday.\n\nFull trading hours can be found on their website .\n\nREAD MORE: How to maximise public holidays and make the most of your annual leave in 2025\n\nSome stores in Queensland will be closed for the public holiday. (Jon W / Event Photos Australia)\n\nDan Murphy's and BWS\n\n﻿Dan Murphy's stores nationwide will mostly open from 10am to 7pm.\n\nBWS stores will mostly open from 9am and close between 7pm and 8pm.\n\nFull trading hours can be found on their website﻿ .\n\nBunnings﻿\n\nAll Bunnings stores will be open on the October long weekend.\n\nMost stores in states where there is a public holiday will be open from 7am to 7pm.﻿\n\n﻿Shoppers are advised to use the Bunnings website or app to check their local store's trading hours, as opening times will vary.\n\nBunnings stores statewide will remain open on the public holidays. (Supplied)",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/heartbroken-mum-calls-for-vaccines-to-be-funded-after-teens-sudden-death/aa8c87ce-300c-4336-b9b0-5154129f699a",
        "title": "Heartbroken mum calls for vaccines to be funded after teen's sudden death",
        "publish_date": "Fri, 03 Oct 2025 10:40:45 +0000",
        "category": "lifestyle",
        "authors": [
            "Oct"
        ],
        "text": "A devastated mother is calling for the meningococcal B vaccine to be made available to all children and teenagers, after her 16-year-old son died suddenly last week.\n\nMelbourne mum Norliah Syer-Peterson said her son Levi fell ill with what appeared to be gastro-like symptoms on Tuesday, September 23, before his condition deteriorated rapidly.\n\nLevi, who was a Year 10 student at St Francis Xavier College in Beaconsfield, appeared perfectly happy and healthy in the morning, his mother told 9news.com.au.\n\nREAD MORE: Shots fired at suburban home while occupants slept\n\nLevi had just turned 16 and gotten his learner driver's licence. (Supplied: Norliah Syer-Peterson)\n\n\"I had dropped him off to do some work with my brother, who is a removalist,\" Syer-Peterson said.\n\n\"We were joking around, and we were talking about how we were going to have a mum and son fun day during the holidays.\"\n\nHowever, when Levi came home that afternoon, he complained of having a stiff neck.\n\n\"He was in the truck, and he said he fell asleep, and that's not unusual to get a stiff neck if you're lying weirdly in a truck,\" Syer-Peterson said.\n\nLevi's mother said she gave him some water and ran him a bath.\n\n\"He refused to eat, and he eats like 10,000 meals a day, so that was strange,\" she added.\n\nLevi told his mother that he felt nauseous, so she gave him a bucket and he went to bed.\n\nHours later, the family was woken at around 1.30am by a loud banging sound.\n\nLevi was vomiting in the bathroom.\n\n\"He was delirious, and the deliriousness was concerning,\" Syer-Peterson said\n\n\"He was just mumbling stuff and talking about a person he doesn't even know.\"\n\nNorliah Syer-Peterson, pictured with her son Levi. (Supplied: Norliah Syer-Peterson)\n\nNow alarmed, Syer-Peterson called triple zero and, when paramedics arrived, they immediately administered antibiotics.\n\n\"They said, 'It looks like he's got an infection.' But then he started complaining about having a sore leg, and they were trying to get fluids into him,\" his mother said, adding Levi had a temperature of 41 degrees.\n\n\"He said, 'Am I going to die', and we all said, 'No, no, no.'\"\n\nThe paramedics rushed him to the intensive care unit at Monash Children's Hospital.\n\n\"He went straight into the ICU unit. There were probably 40 professionals in there working on him, doctors, nurses, people monitoring him.\n\n\"It was full on, like something out of a nightmare movie.\"\n\nLevi developed purple spots all over his skin, and then his heart stopped.\n\nThe much-loved teen died at around 7.30am last Wednesday, less than 24 hours after he first fell ill.\n\nSyer-Peterson said her son's sudden death had left the family reeling.\n\n\"He was just the most gentle, kind, loving, sweet, beautiful boy,\" she said of her son.\n\n\"He used to pray a lot for people. He loved basketball, and he played netball with one of his girlfriends.\"\n\nLevi, pictured with his mother Norliah Syer-Peterson and older brother Zac. (Supplied: Norliah Syer-Peterson)\n\nLevi had just gotten his learner driver's licence and had been busy making plans for the year ahead, his mother said.\n\n\"He had braces on that he was going to get off later this year. He was doing his deb next year, in March,\" she said.\n\nTests have confirmed Levi died of sepsis caused by meningococcal B bacteria.\n\nLike most Year 10 students in Victoria, Levi received a free meningococcal vaccine at school, which covers strains A, C, W and Y.\n\nHowever, meningococcal B requires a separate vaccine, which is only included in the National Immunisation Program for at-risk groups, such as Aboriginal and Torres Strait Islander infants.\n\nAfter lobbying by medical experts and advocates, some Australian states - Queensland, South Australia and the Northern Territory - have chosen to fund their own meningococcal B vaccination programs to make the vaccines free for all children and teens.\n\nHowever, Victoria, NSW, the ACT and Tasmania are yet to do so.\n\nSyer-Peterson said she was now making it her mission to lobby for meningococcal B vaccines to be made available free of charge.\n\n\"I would say that it is ridiculous that this is not funded. People, normal Australians, can't afford to pay for it,\" she said, adding that it never even occurred to her to get Levi the extra vaccination.\n\nThe Australian Technical Group on Immunisation (ATAGI), which advises the health minister on the National Immunisation Program, recommended the meningococcal B vaccine be given to infants, young children and adolescents in 2014.\n\nA Department of Health spokesperson told 9news.com.au the inclusion of any vaccine on the federal program was contingent on a positive recommendation from the Pharmaceutical Benefits Advisory Committee (PBAC), based on an assessment of clinical and cost-effectiveness.\n\n\"To date, the PBAC has not received an application from pharmaceutical companies seeking expanded eligibility for meningococcal B vaccine,\" the spokesperson said.\n\nThere have been 13 cases of meningococcal B in Victoria so far this year.\n\nA spokesperson for Victoria's Health Department said: \"The Chief Health Officer monitors the prevalence of meningococcal cases in Victoria, which informs their independent health advice on vaccination settings.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/wild-weather/australia-weather-tropical-cyclone-names-released-for-new-storm-season/a109abaa-2c56-4810-8479-b525f18e8b97",
        "title": "Names for the next tropical cyclones over Australia are a mixed bunch",
        "publish_date": "Fri, 03 Oct 2025 02:28:57 +0000",
        "category": "sports",
        "authors": [
            "Oct"
        ],
        "text": "A punk rock icon and a fermented Japanese rice have helped inspire the names of the next tropical cyclones in Australia﻿.\n\nT﻿he Bureau of Meteorology has released the new names ahead of next month's start of the storm season, which runs until late April, reports weather forecasting site Weatherzone .\n\nThe next six months has the potential for nine to 11 tropical cyclones, which is about average for Australia.\n\nCyclone Errol impacted Western Australia earlier this year.. (Weatherzone)\n\nA handful of those can be expected to reach severe level, categorised by meteorologists as level three or stronger.﻿\n\nThe first new tropical cyclone will be known as Fina, while the remainder include Iggy, synonymous with legendary rocker Iggy Pop, and Koji, a rice grain used to make Miso.\n\nThey run in alphabetical order and alternate between male and female. The 11 new names are: Fina, Grant, Hayley, Iggy, Jenna, Koji, Launa, Mitchell, Narelle, Oran and Peta.\n\nAustralia's tropical cyclones have been named by the bureau since the mid 1960s.\n\nInitially, the cyclones were only given female names – with the first official names being Audrey and Bessie in 1964.\n\nDuring the past 62 years of wild weather, some of the most destructive cyclones in Australian history have been named Tracy, Larry, Olivia, Debbie and Alfred.﻿\n\nEarlier this year, the bureau decided to change the name of a major tropical cyclone off northern Queensland from Anthony to Alfred.\n\nThe move was made to avoid confusion with Prime Minister Anthony Albanese ahead of May's federal election.\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/alaskan-climbing-star-dies-in-fall-from-yosemites-el-capitan/e394c15f-f919-4b86-9fb3-07051b4bb894",
        "title": "US climbing star dies in fall from Yosemite's El Capitan",
        "publish_date": "Thu, 02 Oct 2025 23:42:28 +0000",
        "category": "sports",
        "authors": [
            "Oct"
        ],
        "text": "A popular Alaskan climber has fallen to his death from Yosemite National Park's El Capitan, marking the third death in the US park this summer.\n\nBalin Miller, 23, died in a climbing accident on Wednesday, his mother Jeanine Girard-Moorman confirmed.\n\n“He’s been climbing since he was a young boy,” she said.\n\nBalin Miller sits atop Mount Hunter on May 14, 2025 after summiting via the French Connection route solo. (Balin Miller)\n\n“His heart and soul was truly to just climb.\n\n“He loved to climb and it was never about money and fame.”\n\nThe death comes on the first day of the federal government shutdown, which left national parks “generally” open, with limited operations and closed visitors centers, according to the National Park Service.\n\nThe park service did not respond to an email requesting comment, and it's unclear what staff remains at Yosemite during the shutdown.\n\nEl Capitan is one of the most striking features of Yosemite National Park, an enormous sheer granite rock face of approximately 915 metres that entices big-wall rock climbers from all over the world.\n\nAlex Honnold completed the first free solo climb of El Capitan in 2017 for the documentary Free Solo .\n\nThe famed El Capitan rock face. (Adobe Stock)\n\nMany posted tributes to Miller on social media, saying they had watched him climb on a TikTok livestream for two days before his death and referring him to “orange tent guy\" because of his distinctive camp setup.\n\nEarlier this year, an 18-year-old from Texas died in the park while free-soloing, or climbing without a rope, on a different formation. In August, a 29-year-old woman died after being struck in the head by a large tree branch while hiking.\n\nWhile it's still unclear exactly what happened, his older brother, Dylan Miller, said Balin was lead rope soloing — a way to climb alone while still protected by a rope — on a 730-metre route named Sea of Dreams.\n\nHe had already finished the climb and was hauling up his last bit of gear when he likely rappelled off the end of his rope, Dylan said.\n\nMiller was an accomplished alpinist who had already gained international attention for claiming the first solo ascent of Mount McKinley's Slovak Direct, a technically difficult route that took him 56 hours to complete, he posted on his Instagram in June.\n\nHe grew up climbing in Alaska with his brother and their father, who was also a climber.\n\nWhile Dylan took a little more time to fall in love with the sport, it stuck with his younger sibling instantly.\n\n“He said he felt most alive when he was climbing,” Dylan Miller said.\n\n“I’m his bigger brother but he was my mentor.”\n\nThis year, Balin Miller had also spent weeks solo climbing in Patagonia and the Canadian Rockies, ticking off a notoriously difficult ice climb called Reality Bath, which had been unrepeated for 37 years, according to Climbing magazine.\n\n\"He’s had probably one of the most impressive last six months of climbing of anyone that I can think of,” Clint Helander, an Alaska alpinist, told the Anchorage Daily News .\n\nBut this most recent trip to Yosemite wasn't supposed to be hard climbing.\n\nMiller had just arrived two weeks early to climb and enjoy the park's beauty and solitude before the rest of his family, who planned to meet up there.\n\nMore than just a climber, he loved animals and was fun, kind and full of life, his mother said.\n\nHe often climbed with a stripe of glitter freckles across his cheekbones, describing it in a Climbing magazine interview like “a warrior putting makeup on before going into battle”.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/excavators-find-1-million-in-gold-coins-from-spanish-shipwreck-along-floridas-treasure-coast/91d9b715-e4ad-41ec-9d86-b4ad1bc9edcc",
        "title": "Excavators find $1.5 million in gold coins from Spanish shipwreck",
        "publish_date": "Thu, 02 Oct 2025 21:45:49 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Hidden beneath the turquoise waters off a stretch of Florida known as the “Treasure Coast,” a team of divers from a shipwreck salvage company have uncovered exactly that — a load of long-lost Spanish treasure they estimate is worth US$1 million (A$1.5 million).\n\nMore than 1,000 silver and gold coins thought to be minted in the Spanish colonies of Bolivia, Mexico and Peru were uncovered this summer off Florida's Atlantic coast, 1715 Fleet – Queens Jewels LLC announced this week.\n\nIt's not the first time the site has yielded a trove of, well, treasure.\n\nIn this undated photo provided by shipwreck salvage company 1715 Fleet- Queens Jewels, LLC, diver Levin Shavers shows coins uncovered from a Spanish shipwreck off the Atlantic coast of Florida. (LLC via AP)\n\nCenturies ago, a fleet of Spanish ships laden with gold, silver and jewels taken from the New World was sailing back to Spain when a hurricane wrecked the flotilla on July 31, 1715, spilling the treasures into the sea, according to the 1715 Fleet Society.\n\nOver the years, millions of dollars in gold coins from the 1715 Fleet have been found by salvagers and treasure hunters in a coastal area stretching from Melbourne to Fort Pierce.\n\nDates and mint marks are still visible on some of the recently recovered coins, the salvage company said, a benefit for historians and collectors hoping to glean more from the lost treasure.\n\n“This discovery is not only about the treasure itself, but the stories it tells,” Sal Guttuso, director of operations for the salvage company said in a statement.\n\n“Each coin is a piece of history, a tangible link to the people who lived, worked, and sailed during the Golden Age of the Spanish Empire. Finding 1,000 of them in a single recovery is both rare and extraordinary.”\n\nGuttuso's team employs dive crews and a fleet of boats and uses underwater metal detection-devices, plus hand-fanning of sand or sand suction to comb the sea floor, according to a public notice for a federal permit application the company filed.\n\nLast year, Florida officials announced they had recovered dozens of gold coins stolen by salvagers from the wreck. The suspect was identified as a family member of the team contracted by 1715 Fleet – Queens Jewels LLC to work the site.\n\nDivers find 100 bottles of 'royal' champagne on shipwreck View Gallery\n\nUnder Florida law, any “treasure trove” or other historic artifacts “abandoned” on state-owned lands or in state waters belong to the state, though excavators can be permitted to carry out “recovery services.”\n\nThe law requires that roughly 20 percent of the recovered archaeological materials be retained by the state for research collections or public display.\n\nGuttuso told The Associated Press his team develops a detailed inventory of all the artifacts collected each season to be reviewed by the state.\n\nFlorida officials select up to 20 percent of the items to keep for the public, in a negotiation process that is ultimately approved by a federal court. Remaining artifacts are split equally among the salvage company's owners and its subcontractors, Guttuso said.\n\n\"We want to do it right,\" Guttuso said.\n\n“And it benefits the people of Florida. They end up in the museums,” he said of the treasures.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/rainstick-cairns-biotech-startup-seed-treatment-canola/105844476",
        "title": "Could thunderstorms hold the key to stronger crops?",
        "publish_date": "Sat, 04 Oct 2025 00:47:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "A Cairns biotech startup is combining traditional Indigenous knowledge of \"rainmaking\" and modern science to optimise plant and fungi growth.\n\nThe company Rainstick is using electrical fields to treat seeds to improve germination and productivity.\n\nIts technique is based on a tradition of the Maiawali people of central west Queensland, who used a chuggera or a lightning stick to direct thunderstorm activity.\n\nRiverine Plains is trialling Rainstick’s seed treatment on canola crops in regional Victoria. (ABC Landline)\n\nDarryl Lyons is co-founder and \"chief rainmaker\".\n\n\"Chief rainmaker sounds like a really cool title,\" he said.\n\n\" But really, it's about figuring out how we can scale this technology globally to make a difference in agriculture. \"\n\nHis business partner Mic Black is the \"chief thunderstorm creator\".\n\n\"We take seeds and we apply an electric field similar to what happens during a thunderstorm … those seeds get shipped out to the producer for them to grow,\" he said.\n\nThe process is designed to be seamless for farmers, as it does not require changes to existing planting and growing processes.\n\nTesting the tech on canola crops\n\nRainstick has been experimenting with small-scale indoor crops but is also collaborating with Riverine Plains, a farming systems group with more than 450 members conducting trials on broadacre crops such as canola.\n\nChief executive Pip Grant said low crop establishment rates were a significant problem for Australian farmers.\n\nThe CSIRO and the Grains Research and Development Corporation have found it costs the canola industry more than $100 million a year.\n\nPip Grant says low canola establishment rates are a costly issue for farmers. (ABC Landline)\n\nIf the seed treatment is successful, it could boost productivity and cut those costs.\n\n\"We're really working with the Rainstick team on the broadacre,\" Ms Grant said.\n\n\" How do we actually translate this technology from mushrooms, bok choy, our indoor sort of crops, to what that looks like once we bring it out into broadacre crops? \"\n\nThe initial visual assessments of the canola trials are promising.\n\n\"It has actually been quite wild to see the difference in some of the treated … canola plants versus the control,\" Ms Grant said.\n\nThe next step is to harvest the plots and analyse the data to confirm any potential yield and economic benefits.\n\nThe science behind the storm\n\nThe Rainstick team is also working with scientists from James Cook University (JCU) and the University of Queensland to fine-tune their seed treatment technology.\n\n\"We work with a couple of basic elements to our formula,\" Mr Black said.\n\n\"We have our frequency, our waveform and the duration of that treatment.\n\n\"You can't [apply] brute force [to] something like this.\"\n\nJCU researcher Joost Nelis is assisting with the scientific evaluation of the technology's effect on plants.\n\nJoost Nelis studies how bioelectrical treatments affect plant growth. (ABC Landline)\n\nDr Nelis is measuring changes in key molecules within the plants to understand how the treatment influences their biological processes.\n\nHe said his research, which focused on how different metabolic pathways were activated in the process, had already observed some differences.\n\n\"One of the things we observed so far is that there's really an increase in leaf mass after the treatment,\" he said.\n\nMr Black made it clear the technology was not genetic modification, nor a chemical treatment.\n\nMic Black with seedlings in the company’s indoor crop trials. (ABC Landline)\n\nInstead, the bio-electrical signals influence how genes react without altering the plant's DNA.\n\nThe goal is to give seedlings a stronger, more vigorous start that can potentially last throughout the entire growth cycle.\n\nA vision for a sustainable future\n\nThe potential applications of Rainstick's technology extend beyond traditional farming.\n\nMr Lyons is passionate about its use in reforestation projects.\n\n\"We've got to reforest mine [sites], we've got to reforest areas globally to help with climate variation,\" he said.\n\nEarly trial results show visible differences between treated and untreated canola plants. (ABC Landline)\n\nThe team is trailing the technology on native species such as grevilleas and Darwin stringybarks, both of which have poor establishment rates.\n\nFor Mr Lyons, a Maiawali man, this work is not just a business, it is a personal journey.\n\n\"Unfortunately, my great-grandmother was the only survivor from the Maiawali people,\" he said.\n\n\"I've kind of been lucky over the last 15 years to go back out in the country and connect to that heritage.\"\n\nHe believes that traditional knowledge could have a global impact by providing new scientific solutions.\n\nRainstick plans to continue in-field trials in collaboration with farmers and scientists.\n\nMs Grant said they were still in the early stages, but the partnership was crucial to determine the price points for a farm to receive a return on their investment in the technology.\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/perth-royal-show-vendors-say-crowds-lower-2025/105849896",
        "title": "Vendors concerned by low crowds, price crunch at Perth Royal Show",
        "publish_date": "Sat, 04 Oct 2025 00:11:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Perth Royal Show vendors say they are considering not returning next year, as the cost of operating ratchets up while business falls.\n\nOfficial attendance figures for this year's show are yet to be released, but many vendors have said this year has felt much quieter than previous shows.\n\nGame vendor Kirsty said there was no longer the deluge of customers at stalls she was used to.\n\nCrowds at the show are said to be thinner than in previous years. (ABC News: Kenith Png)\n\n\"We're having big breaks in between customers, which normally we'd have like big flows of customers, so it has definitely changed this year,\" she said.\n\n\" It is worse, definitely worse. \"\n\nKirsty said she believed the solution was to lower the prices of activities and merchandise at the show.\n\n\"[We need to] drop prices. But, the cost of living, we can't. There's nothing we can do unless the state government does something about it,\" she said.\n\nEntry to the Royal Show for anyone over 16 was $50 this year.\n\nLast year, after government funding halved the admission price, it was just $22 for adults and children were free.\n\nSome vendors have said the crowds have felt smaller at this year's show. (ABC News: Cason Ho )\n\nSome vendors and attendees attributed what seemed like smaller crowds this year to the higher entry prices.\n\n\"Last year we were struggling to line up for the show rides, and today hasn't been too bad,\" mother Rhiannon said.\n\nRhiannon says the kids were loving the Perth Royal Show. (ABC News: Cason Ho )\n\n\"It's an expensive day out but the kids are loving it, so that's the main thing.\"\n\nDouble blow\n\nMerchandise vendor Roberto Vago said stall operators were being hit with a double whammy, managing lower foot-traffic while also paying more to set up shop.\n\n\"I've been doing this for nearly 15 years now — I can definitely say that price went double than what we used to pay,\" Mr Vago said.\n\nHe said the price hike for his store's lot, from last year, is the biggest he's ever experienced.\n\nRoberto Vago says he paid much morre for his stall this year. (ABC News: Cason Ho )\n\n\"It was $4000 [last year], and this year we pay more than $10,000, and that's pretty much for the same location,\" he said.\n\nMr Vago said many vendors had to put up prices on food and merchandise to survive.\n\nThe ABC understands a group of vendors are putting together a petition to the Royal Agricultural Society of WA [RASWA] to lobby for better conditions and costs.\n\nThe RASWA said it would have a full tally of attendance figures after the Royal Show's last day on Saturday, and would reveal them early next week.\n\nIt said it had seen a \"steady increase in after-5pm entries each day\", and had received \"positive feedback from vendors and operators\".\n\nAfter the government halved the price of attending the show for adults last year, this year's return to full price has been felt keenly. (ABC News: Cason Ho )\n\n\"This year's Perth Royal Show has focused strongly on enhancing the patron experience, guided by feedback that 87 per cent of visitors believe agriculture should remain at the heart of the show,\" a spokesperson said.\n\n\"Patrons also told us they wanted more agricultural education and a greater variety of food, and the response has been overwhelmingly positive.\"\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/big-lost-band-at-pambulas-wanderer-music-festival-community/105839362",
        "title": "Community invited to join 'magnificent' pop-up rock supergroup",
        "publish_date": "Fri, 03 Oct 2025 23:59:56 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "They may not be the headline act at this year's Wanderer Festival, but without a doubt, they are the most ambitious.\n\nThe Big Lost Band is a pop-up, all-ages rock'n'roll supergroup with more than 130 members at last count.\n\nThis year, the band has 12 drum kits, 40 guitars and basses, a choir and a horn and strings section.\n\nThey have just four, two-hour rehearsals to prepare for two shows at the festival on the New South Wales far south coast that are \"too joyous and magnificent to ignore,\" according to festival artistic director and self-described band wrangler, Ian Pidd.\n\nThere are 25 musicians in this year's brass and string section. (ABC South East NSW: Adriane Reardon)\n\nThe band particularly encourages people who have lost touch with their instruments or have just discovered their instruments.\n\n\"The reason it works is that a whole lot of people do a whole lot of work, and then they just hang on by their fingernails and get it done,\" he said.\n\n\" It's a combination of fear and trust and joy. \"\n\nFour rehearsals before showtime\n\nAt the start of each rehearsal, the band breaks into sections — drums led by Chris Jones, guitars led by Dean Gray, and brass, strings and keyboards led by Nick and Sarah Keeling — while Ian Pidd leads the choir.\n\nChris Jones leads the drum section. (ABC South East NSW: Adriane Reardon)\n\nWith the woodwind and brass instruments all set to different key signatures to match the guitars and choir, many of the budding musicians are playing notes they've never played before.\n\nRobbie O'Neill is realising a dream she has had since she was a teenager to play saxophone.\n\nShe started having lessons four months before she joined the Big Lost Band.\n\n\"I'd only learnt maybe eight notes,\" she said.\n\n\"But the two saxophonists who can play are very helpful.\"\n\nRobbie O'Neill is realising a dream she has had since she was a teenager to learn saxophone. (ABC South East NSW: Adriane Reardon)\n\nRobbie's not sure if she'll be show-ready in four rehearsals, but she has a fallback plan just in case.\n\n\"If I can't play, I just won't blow\", she laughs.\n\nThis year, the band's set list includes Peter Gabriel's Sledgehammer and Radiohead's Creep.\n\nNick Keeling wrote the arrangements for and leads the brass and string sections. (ABC South East NSW: Adriane Reardon)\n\n\"We went with a Mexican-inspired, mariachi arrangement for Creep\", Nick Keeling said.\n\n\" The horn section brings a response to the melody, in a totally different genre to the song. But it fits together like a puzzle. \"\n\nBumble Parsons picked up the baritone horn a few months ago after playing the tuba in an orchestra as a kid.\n\nHe plays in the Big Lost Band with his daughter Juniper, while the rest of the family sings in the choir.\n\nBumble Parsons and his daughter Juniper on baritone horn. (ABC South East NSW: Vanessa Milton)\n\nHe said it was a \"special feeling\" getting together to make music with friends and strangers.\n\n\"When the horns are blasting, it's good. It's good,\" Parsons said.\n\nWith each rehearsal, more and more earplugs fill more and more ears as the volume goes off the dial.\n\nWhen the full band comes together, Nick Keeling said the usually \"obnoxiously loud\" horns are fighting to be heard over the electric guitars and basses.\n\n\"There's a reason rock bands don't have 30 guitars,\" he said.\n\n\"They might have three; three is a lot.\"\n\nBut he's ready to roll with it.\n\n\" Thirty guitars has to be better than three. It's 27 better. \"\n\nForty guitar and bass players have joined this year's Big Lost Band. (ABC South East NSW: Adriane Reardon)\n\nFor Mr Keeling, the \"barely controlled chaos\" always seems to come together by show time.\n\nAnd ultimately, it is all about the spectacle.\n\n\" You've seen choirs that are quite large, and marching bands that are gigantic. But where has anyone ever seen a rock band this big? \"\n\nAs they prepare for their third Wanderer Festival, Ian Pidd said the band was \"consolidating within the imagination of the community\".\n\nHe is particularly pleased to see parents who brought their kids to play in the band at previous festivals are now picking up an instrument themselves.\n\n\"Once you make a sound together, it's very addictive,\" he said.\n\n\" It's a big, gorgeous, glorious musical thing. \"\n\nThe Big Lost Band choir bring the full gamut of emotions to the set list. (ABC South East NSW: Adriane Reardon)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/burswood-park-racetrack-land-deal-under-microscope/105850520",
        "title": "There's one thing that could sink WA Labor's racetrack, and its not angry residents",
        "publish_date": "Fri, 03 Oct 2025 23:15:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "WA's premier may be planning victory laps around his controversial election-promised Burswood Park racetrack, but his government is being coy about one crucial element that could sink the whole thing.\n\nAn element that could add to the project's $217 million price tag — and one that appears vital to its success.\n\nThe element in question? The land needed to build it.\n\nAnd given the scrutiny it's under to keep the budget at bay, the government will be praying any potential deal to grab the land doesn't cost a penny.\n\nA social media ad promoting the Burswood street circuit during the WA election campaign. (ABC News: Gian De Poloni)\n\nThe project — officially known as the Perth Entertainment and Sporting Precinct — and colloquially coined by the Opposition as \"Rita's Racetrack\" — has its fair share of critics.\n\nAside from noise worries from nearby apartment residents, the track has even split opinion within the Labor Party.\n\nSunbaking tourists will either love or loathe it, with the proposed track's southern leg doglegging some 50 metres from the edge of the Crown Towers swimming pool.\n\n\"You could be high-fiving Garth Tander from a sun-bed by the looks of things here,\" quipped Opposition Leader Basil Zempilas, one of the most vocal opponents of the project.\n\nThe racetrack butts up against the northern portion of the Crown Towers. (ABC News: Andrew O'Connor)\n\nThat led an unidentified state government spokesperson to have a swipe: \"Basil Zempilas will say and do anything and stands for nothing.\"\n\n\"He is now arguing you can't have a vehicle within a kilometre of the Crown pool when we have hundreds of buses go past that very same pool every week.\"\n\nWhether buses breach the peace as much as V8 Supercars is a question for the consultants.\n\nBut the much more existential problem? It's not the government's land to use in the first place.\n\nHow did we get here?\n\nA large portion of vacant land closest to the casino — which used to be a golf course — was sold by former Premier Colin Barnett to Crown in 2013 so it could keep expanding its resort.\n\nThe land was valued at $95 million — but Mr Barnett sold it for $60 million.\n\nThere was a caveat though — Crown would have to build on it and open its new development by September 2028.\n\nIf not, the government was entitled to buy it back at the original purchase price.\n\nBut Crown has yet to progress any work on the vacant site, and in 2020 was looking to drop that caveat altogether and keep the land.\n\nIt is still unresolved to this day, despite the plan for the racetrack being far progressed.\n\nThe government appears to be banking on that 'use it or lose it' clause to be able to get what it wants — and needs.\n\nCrown licence woes\n\nIn the meantime, Crown had problems of its own, ending with the publication of the Perth Casino Royal Commission in March 2022 which found it was unsuitable to hold a casino licence.\n\nThe next year, then-Environment Minister Reece Whitby signed an agreement allowing the state to take control of casino land bordering Perth Stadium that would also be needed for the racetrack precinct.\n\nThe site of proposed Perth's Burswood Park multi-use community hub and racetrack. (ABC News: Glyn Jones)\n\nThe rest is unclear.\n\nHow much, if anything, was paid? Had the government resolved to build the racetrack back then?\n\nMr Whitby was asked about that 2023 arrangement on Friday.\n\n\"Look, I don't know the details of that, it's not a portfolio responsibility of mine … it certainty wasn't at the time,\" Mr Whitby said on Friday.\n\nWA government minister Reece Whitby. (ABC News: Courtney Withers)\n\n\"I'm not part of the current negotiations, I'll have to get back to you on that.\"\n\nLand swap or sale?\n\nCrown itself is on the record in support of the project.\n\nStanding alongside the Racing and Gaming Minister in July welcoming the government's decision to allow Crown to keep its casino licence, then-Crown Resorts chair John Van Der Wielen said the racetrack was a \"really exciting possibility\".\n\n\"We're clearly supportive of any further developments on the peninsula,\" he said.\n\nCrown Resorts chair John Van Der Wielen (right) was asked about the racetrack at a press conference in July. (ABC News: Nicolas Perpitch)\n\nBut what about the land issue? Would he consider a swap?\n\nAfter all, the government controls several prized pieces of riverfront land adjacent to the Burswood site.\n\n\"I think it's too early days to speculate on anything like that but we're supportive of ongoing development,\" Mr Van Der Wielen said.\n\nTreasurer Rita Saffioti is on the record saying the government is \"very confident we will not be buying any land.\"\n\nPolitical risk\n\nIt's risky for the government to be banking on acquiring land without paying anything for it, but politically it's even riskier.\n\nIt's got an Opposition ready to pounce on anything racetrack related using its \"axe the track\" slogan at any opportunity.\n\nBasil Zempilas has become one of the most vocal opponents of the project. (ABC News: Keana Naughton)\n\n\"For months now we've been asking in parliament will you need to acquire any land from Crown Casino to be able to complete this racetrack — acquire, purchase, land swap — we were told no by the state government,\" Opposition Leader Basil Zempilas said on Thursday.\n\n\"I'm not sure how that's going to be possible.\"\n\nThe Save Burswood Park Alliance rally on the steps of Parliament. (ABC News: Keana Naughton)\n\nIt's understood despite the published maps of the racetrack, the designs are still being finalised, meaning it's still unclear just how essential this piece of land is.\n\nIf it is, the government will need to negotiate a deal — or worse, concede the project's cost will blow out, and it won't want to do that.\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/custom-quad-tandem-bike-baffles-bike-mechanics-on-charity-ride/105832102",
        "title": "Heads turn during Australia's first transcontinental quad tandem bike ride",
        "publish_date": "Fri, 03 Oct 2025 23:12:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "An eye-catching bright red bike with two wheels, four seats, eight pedals and 80 spokes is making its way across Australia.\n\nTeachers Louise Ginn, Sonia Allum, Rachel Beaden and Anna Linbeck are covering more than 4,000 kilometres from Perth to Sydney, riding for suicide prevention charity Gotcha-4-Life.\n\nTheir choice of transportation, Ruby, is a rare sight in Australia, as only a few dozen of these specific quad tandem bikes have been released worldwide.\n\nAnd its many notable features have so far left numerous bike mechanics scratching their heads.\n\nThe quad tandem bike is custom designed by a Canadian company. (Supplied: Ride4Life)\n\nSpecs and origin\n\nRuby was custom made by an Oregon-based company in the United States for a charity bike ride in Canada in 2023.\n\nIt was one of five quad tandem bikes used in a race from Keremeos to Nelson in British Columbia.\n\nThe bike was purchased second-hand earlier this year, and it took more than six months to get it from Vancouver to Australia.\n\nThe teachers are riding for a suicide prevention charity. (ABC News: Wade Stephens)\n\n\"It was quite the journey. Over 200 emails liaising with people around the world that were offering us quotes of how to get it here,\" Ms Linbeck said.\n\n\"The original quote was $35,000 to bring it here. But through connections, buying it second-hand … it was approximately $14,000 in the end.\"\n\nThe bike is 3.8 metres long, weighs 33 kilograms and has 22 gears, which are controlled by the rider in the rear seat.\n\nRuby also sports unique 40-spoke wheels to distribute the weight of the bike.\n\nThe quad tandem bike took six months to arrive from Canada. (ABC News: Wade Stephens)\n\nRiding challenges\n\nA bike as long and as heavy as Ruby comes with its challenges.\n\n\"For me at the front, the hardest part that I'm finding is definitely when turning corners. You can't turn corners very easily, there's a very wide turning circle,\" Ms Ginn said.\n\n\"And the side winds, they're the most challenging, just trying to keep the bike upright in those side winds.\n\n\"I've had my full body locked in to just keep the bike from being knocked over.\"\n\nThe team rode past the post office in Meckering, Western Australia. (Supplied: Ride4Life)\n\nCustomising the bike to suit each rider was also a time-consuming process.\n\n\"The handlebars are actually attached to the person in front of you,\" Ms Ginn said.\n\n\"A slight change in that then affects the rider in front with their seated position, so that's been a little bit of fun and games.\n\n\"It's one good reason why we don't change positions, because you'd be forever changing that.\n\n\"Once you find that sweet spot, you want to stick with it.\"\n\nThe quad tandem bike weighs almost 35 kilograms. (ABC News: Wade Stephens)\n\nMaintenance challenges\n\nDuring the lengthy journey, the chain of the bike has loosened, and some chain ring teeth have snapped off under the pressure of four people pedalling at once.\n\nHowever, the back tyre has proved to be the biggest issue.\n\nThe quad tandem bike has caught the eye of many passersby. (ABC News: Wade Stephens)\n\n\"We've got on our third back wheel already,\" Ms Ginn said.\n\n\"We've had a lot of issues and sadly, we broke off one of the spokes from the base of the hub.\n\n\"We were unable to source a 40-spoke wheel, but we managed.\n\n\"The best case was a 36-spoke mountain bike wheel that was actually built for us in Adelaide.\"\n\nRaising eyebrows\n\nDuring the journey, the women have raised the eyebrows of not only onlookers, but bike shop mechanics who have been called upon to assist.\n\n\"First of all was Port Augusta, the bike mechanic there, you should have seen his raised eyebrows,\" Ms Ginn said.\n\n\"He was speechless … he could not fathom it. And he's like, 'I don't even think I'm going to be able to get it in my workshop. I'm going to have to put it in the backyard to work on it'.\n\nThe riders showed the quad tandem bike to students at Gol Gol Primary School. (ABC News: Wade Stephens)\n\n\"And then [in] Adelaide, once again, they all almost stopped their tools as the bike was walked through.\n\n\"They were just kind of blown away. And everyone that's quite bike mechanical, they're totally fascinated.\n\n\"They could spend days just looking and trying to comprehend how on Earth this thing actually works and was built.\n\n\"It takes a bit for them to get their head around.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/cameron-munster-family-nrl-grand-final-melbourne-storm-broncos/105830578",
        "title": "Father's memory inspires Melbourne Storm star Cameron Munster to win",
        "publish_date": "Fri, 03 Oct 2025 22:53:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "Cameron Munster's late father always called his son before big games, encouraging him to back himself and not give away \"stupid penalties\".\n\nThe Melbourne Storm star stands just one game away from NRL grand final glory once again, but this time it will be different.\n\nThe Rockhampton and central Queensland product lost his father, Steven Munster, at age 58, during this year's State of Origin series, where he courageously led Queensland to a famous victory.\n\nHe hopes to do the same for the Melbourne Storm on Sunday night in the NRL grand final against the Brisbane Broncos in Sydney.\n\nThe late Steven Munster, wife, Debbie, and son Cameron after Melbourne's 2017 grand final win. (Supplied: Danielle Kersnovske)\n\nAnd while his dad is no longer there to cheer for him, his proud mum, Debbie, and younger sister, Danielle Kersnovske, will be cheering him, along with adoring wife, Bianca, and their three children.\n\n\"We're just proud of him to achieve what he's done in his career, but especially this year, with what we've gone through,\" Ms Munster said.\n\n\"I'll be very nervous [in the crowd], but I'll sit there and continue to chew my nails that I don't have any of and I get myself into such a state it puts my blood pressure through the roof.\"\n\nWhile Ms Munster will be in the 80,000-strong crowd cheering on her son, his sister will be nervously pacing around the lounge room of her home in Sarina in north Queensland.\n\n\"I hope we put 40 [points] on them,\" Ms Kersnovske joked.\n\n\"Dad will be whipping him home [up in heaven] if he makes a line break, I can tell you that and they'll probably be able to hear me cheering from Sydney.\"\n\nA tearful Queensland coach Billy Slater hugs skipper Cameron Munster after this year's Origin decider. (Getty Images: Cameron Spencer)\n\nMs Kersnovske said the closely bonded Munster siblings missed their dad's phone calls before and after games.\n\n\"It was a tough one actually, last Friday night when they [Melbourne] got up over the Sharks,\" she said.\n\n\"You sit there waiting for him [dad] to call to boast about it, but he didn't.\"\n\nShe said their dad, a former champion sportsman in his own right and keen horse racing enthusiast, always had a few tips for her older brother.\n\n\"He'd be telling Cameron to back himself, hold the ball, do what he does best and for God's sake, tackle,\" Ms Kersnovske said.\n\n\"And no stupid penalties,\" Mrs Munster quickly chimed in.\n\nThe close-knit Munster family during happier times. (Supplied: Danielle Kersnovske)\n\nBackyard footy dreams\n\nCentral Queensland is a renowned breeding ground for rugby league talent and on Sunday, six players from the area — Cameron Munster, Harry Grant, Jack Howarth (Melbourne Storms), and Ben Hunt, Kobe Hetherington and Tamika Upton (Brisbane Broncos) — will feature on grand final day.\n\nThe Munster siblings are naturally gifted in numerous sports and some of their fondest memories are playing footy in the backyard.\n\nIt is this carefree approach that Munster has adopted throughout his 235-game NRL career.\n\nCameron Munster wants to honour his late father, Steven, with a premiership trophy on Sunday night. (AAP: Joel Carrett)\n\n\"I know it sounds silly, but we all put this emphasis and pressure on the grand final, which it is, it's high stakes,\" he said.\n\n\" But the more you think about it during the week, the more you play the game in your head and you forget why you play the game. \"\n\nFrom causing chaos in the backyard to playing on the game's biggest stage, the Storm superstar has not forgetten his humble beginnings.\n\n\"I think sometimes we delve right into it and think, 'Oh, it's a pressure game'. Sometimes, I just feel like I'm playing in the backyard,\" he said.\n\nMelbourne Storm players celebrate following their preliminary final win over Cronulla. (AAP: Joel Carrett)\n\nAs the Storm chase their first premiership since 2020 after losing last year's decider to Penrith, Munster said Melbourne were motivated not to go through the pain of defeat again.\n\n\"We've got to ice our moments, and that's what you play this game for, is to be in those big moments,\" he said.\n\n\"We always want to win grand finals. I think the boys had a little bit of a taste of how it was last year and what they felt and I'm sure a lot of the guys in the team that felt that feeling last year won't want to go through it again.\"\n\nCameron Munster passes the ball during last year's grand final against Penrith. (Getty Images: Cameron Spencer)\n\nBut mum, Debbie Munster, has hedged her bets on a good omen ahead of the decider.\n\n\"I do remember when Queensland won a State of Origin before Storm then won the grand final [in 2017 and 2020], so I'm hoping that'll be the case this year.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/kerr-on-bench-as-chelsea-held-to-draw-by-manchester-united/105851796",
        "title": "Kerr stuck on the bench again as Chelsea held by Manchester United",
        "publish_date": "Fri, 03 Oct 2025 22:31:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sam Kerr's carefully managed return to action has meant the Australia skipper has again been consigned to just a bit part for Chelsea as they lost their perfect Women's Super League record in a 1-1 draw at Manchester United.\n\nSubstitute Kerr was brought on in the 77th minute on Friday evening (local time), the fourth consecutive match she has come off the bench late since returning.\n\nThough she only got a few touches during her 17 minutes, her busy presence helped give Chelsea some belated impetus in an even contest.\n\nIn total, Kerr has been on the pitch for 91 minutes in the four matches since her return, scoring just the one goal that she eked out in stoppage time of her first game back against Aston Villa.\n\nChelsea coach Sonia Bompastor was happy with her contribution, and that of her other substitutes brought on late as Chelsea tried urgently to mark the start of their title defence with a fifth straight win.\n\nInstead, they had to settle for their first dropped points of the campaign, as they now lead the table on 13 points, ahead of United on 11.\n\n\"I wouldn't say it was satisfying, but it's a tough place to come,\" Bompastor said.\n\n\"We tried to find the winner in the last 30 minutes, and I think the players that came in did well, they brought energy and opportunities. But 1-1 was maybe a fair result.\"\n\nUnited were thankful for a blistering goal from Anna Sandberg as they came from one down to earn their deserved point against the side that won the last six WSL titles.\n\nChelsea had gone ahead with a beautifully worked opener in the ninth minute when Catarina Macario's inspired back-heel set up Dutchwoman Wieke Kaptein to slot home into the corner.\n\nSwedish defender Sandberg then equalised 11 minutes later, latching onto a ball from Ella Toone and hammering a thunderous first-time finish from outside the box past the world's top keeper, Hannah Hampton, her first goal for the club since signing 14 months ago.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/queanbeyan-roos-queanbeyan-blues-fold-mid-season-rugby-league/105849216",
        "title": "The footy club with a $600,000 female change room but no women's team",
        "publish_date": "Fri, 03 Oct 2025 22:29:36 +0000",
        "category": "sports",
        "authors": [],
        "text": "When local footy club, the Queanbeyan Blues, opened its new $600,000 dedicated female change room, there was a ribbon-cutting and a host of politicians present.\n\nThe government-funded project was designed to get more women and girls to participate in rugby league in the New South Wales town.\n\nBut just weeks earlier, the club's women's team had folded due to a player shortage.\n\nAt the town's rival club, the Queanbeyan Kangaroos, the women's side had suffered the same fate.\n\n\"I was actually pretty gutted,\" Roos player Chenice Jordan said.\n\n\"We really did want to play.\n\n\" Some of us did go to other clubs and some of us decided to not play or play union [instead] — it was really sad. \"\n\nQueanbeyan Kangaroos player Chenice Jordan. (ABC News: Lily Nothling)\n\nRoos player Kate Warren saw the writing on the wall, especially as the already small playing group was struck down by injury.\n\nDespite that, the side's collapse just a few rounds into the competition was a \"tough pill to swallow\".\n\n\"Just like the boys, we're getting off work and we come here to be part of this culture and the club and put ourselves out there,\" Ms Warren said.\n\n\"For a lot of these women, they're mums … so it's an outlet, it's being part of something bigger than yourself.\"\n\nAt the men's first-grade level, the clubs thrived, with the two sides facing off in the grand final last month.\n\nThe number of females signing up to play the sport has increased by more than 17 per cent in the Canberra region. (ABC News: Lily Nothling)\n\nRecord participation\n\nCanberra Region Rugby League general manager Mark Vergano said while it was disappointing to see the demise of the two women's teams, the remaining clubs were \"very strong\".\n\nLoading...\n\n\"Even though it was difficult from a competition perspective, we're still very confident about the growth arc that we've got in female participation,\" Mr Vergano said.\n\nThis year, more than 2,000 women and girls in the Canberra region signed up to play rugby league across all local clubs and age groups.\n\nIt is an annual increase of more than 17 per cent.\n\n\"Culturally, across the board, we want to make sure that rugby league is seen as a sport for all and it's an inclusive sport,\" Mr Vergano said.\n\n\"All our clubs, I think, embrace that. Some clubs are better at fostering that earlier than others.\"\n\nRetaining female players beyond junior levels remains a challenge, as work, study, pregnancies and injuries get in the way.\n\n'As important as the men'\n\nQueanbeyan Blues representative Rebecca Maher said there needed to be a stronger focus on pathways for the region's strongest players.\n\n\"We do tend to lose a lot of them to [the NSWRL Women's Premiership] or the Queensland comp,\" Ms Maher said.\n\n\"If we could somehow make a viable pathway … giving those girls an option to be able to stay local, play for their junior clubs and then reach the ultimate goal [of the NRLW] if that's what they choose, would help to build our comp immensely.\"\n\nBoth Queanbeyan clubs are hopeful about reviving their women's teams next year.\n\nIt is hoped that more female players will take up the sport in the coming years. (ABC News: Lily Nothling)\n\nKate Warren is optimistic about the future.\n\n\"Our junior club is working really hard to develop our under-17s girls, so hopefully in the next two years that's looking more positive,\" she said.\n\n\"With any kind of change in an institution, it's years before you see the effect of that.\"\n\nChenice Jordan is counting on it.\n\n\"Everyone makes it a big deal about the men's comp, but I feel like the women's comp is very much as important as the men's,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/seasonal-worker-housing-overcrowded-dangerous-overpriced/105848798",
        "title": "Rodents, fire risks and overcrowding in seasonal worker housing: report",
        "publish_date": "Fri, 03 Oct 2025 22:10:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Imagine moving across the world to work in a new country with no choice but to live in accommodation that is crammed, dangerous and plagued by mice.\n\nThat is the experience for many seasonal and migrant workers in regional Australia, according to a new report by the Australian Housing and Urban Research Institute.\n\nThe study surveyed workers across Western Australia, Victoria and New South Wales and found low standards of housing across the three states.\n\n'Bayview Heights' in Coral Bay houses seasonal workers. (Supplied: Tod Jones)\n\nManaging director Michael Fotheringham said some workers were housed in \"disused shearing sheds\" that were crammed, lacked privacy and posed risks.\n\n\"There are safety and health implications for overcrowded accommodation for people working in quite labour-intensive ways,\" he said.\n\nWorker dongas in Coral Bay, a popular tourist destination 11 hours north of Perth, had \"intermittent mouse plagues\" and were often \"in extremely close confines, which pose a dangerous fire risk\".\n\nSleeping quarters for workers from the Pacific Labour Migration scheme in NSW showing the absence of storage space. (Supplied: Denise Laverty.)\n\nConditions impact health\n\nMr Fotheringham said the \"intrusive\" conditions could affect workers' mental and physical health.\n\n\"[Being] crowded into that set-up is probably not the sort of standard that most Australians would want to be offering as a hospitality to people who are doing important roles as part of our economy,\" he said.\n\nDr Michael Fotheringham says overseas workers are vulnerable. (ABC News: Billy Cooper)\n\nMr Fotheringham said \"precarious\" visa requirements made it difficult for vulnerable seasonal workers to find better housing or raise concerns.\n\n\"If the accommodation that they're provided as part of their employment is not appropriate, safe or sufficient, their options are really only to either put up with it, or head back to their country of origin,\" he said.\n\n\"And for many, this is part of the economic sustainability of their families; they're sending money back to their families.\"\n\nA Coral Bay employer says finding housing for workers is challenging. (Supplied: Tod Jones)\n\nMr Fotheringham said it was beholden on Australian employers to provide migrant and seasonal workers with safe and appropriate accommodation.\n\n\"It's not the way we should be representing ourselves to the world,\" he said.\n\nWorkers won't stay\n\nThe report references harrowing examples of migrant and seasonal worker housing in the idyllic coastal community of Coral Bay, 1,100km north of Perth.\n\nOne worker told researchers: \"Most of these caravans and stuff, if there's a fire, [the residents] are not getting out\".\n\nLocal business owner Mark Young knows the challenges of housing a seasonal workforce with limited options all too well.\n\nHe said his staff stayed in a variety of dwellings, from dongas, camper trailers, vans and community housing.\n\nMr Young said many moved on after a short period of time.\n\n\"The accommodation isn't enough for them to stay here for a long period of time,\" he said.\n\nIn the south of the state, Newton Orchard director Nicole Giblett has invested heavily in accommodation at her apple orchard in Manjimup, 300 kilometres south of Perth.\n\nShe employs more than 30 overseas workers who are housed on site.\n\nNicole Giblett says better accommodation for staff is worth the investment. (Supplied: Nicole Giblett)\n\n\"Accommodation is very difficult in this region ... [but] we're really happy with what we've been able to offer our guys because they deserve every bit of it, because they're amazing workers,\" she said.\n\nWhat can be done?\n\nMr Fotheringham said a solution could be found in the conditions of working holiday visas and the Pacific Labour Mobility scheme.\n\n\"We need to think about the restrictions that are attached to visas for those workers that have employer-provided housing that tie them to that employer,\" he said\n\n\"If they're employed by an organisation and the housing that is provided is not appropriate, they have literally no choices to address that.\n\n\"We need to give people the opportunity to move around that.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/purpose-men-only-clubs-melbourne-savage-club-neurotic/105830554",
        "title": "A men's club so exclusive it almost blew up over the prospect of female guests",
        "publish_date": "Fri, 03 Oct 2025 22:00:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "The last time I had cause to write about the 131-year-old, men-only Melbourne establishment, the Savage Club, I was taking photos with my little Nokia of a comatose former ACTU official, Greg Sword, as he was being gingerly inserted into the back of an ambulance.\n\nSword had spent a very, very long Friday afternoon at the Savage Club, which sits like Gringotts on Bank Place, in the Harry Potter corner of the city. After many hours at the club, Sword and his lunch companion, former beer mogul and one-time Liberal prime ministerial hopeful, John Elliott, went on drinking at Syracuse, the bar across the road, but Elliott had volubly abandoned Sword, after he had locked himself in a women's toilet and could not be coaxed out by the staff.\n\nWomen now permitted in the bar at the Tasmanian Club — but they must be with a man Photo shows A sandstone building. The 163-year-old Tasmanian Club has, after much fuss, voted to overturn a rule excluding women from the bar — but before you ladies begin queuing up for a peek inside, please note — you'll still need to be accompanied by a gentleman.\n\nI was there at the time, watching and recording all of it in my little notebook, as Elliott had moved unsteadily from table to table at which any attractive young woman was seated, until he finally gave up and Sword made his dash for the loos.\n\nAsked by the hapless maître d' to please intervene, Elliott had barked, \"He's not my problem!\" and stomped out the door.\n\nAlthough it's entirely possible that the man who hoped to Fosterise the world really yelled: \"Pig's arse!\"\n\nIn the end, an ambulance was called.\n\nWhen I rang Sword the next day to inquire after his welfare, he told me he had been on medication which he had mixed with alcohol. He was mercifully feeling better.\n\nIt's a story that's followed me for years, and yet that incident has remained my sole peek inside the door of a club so exclusive that this week it almost blew up over the mere idea of letting a woman like me sit at a table for an Elliott/Sword-style long lunch. With presumably a lot less booze.\n\nCan you spot the fallacy?\n\nBarely three months into a six-month trial, the majority members of the exclusive Savage Club have voted to end immediately a proposal to allow women to lunch in the main dining room on Tuesdays and Wednesdays. Tuesdays and Wednesdays only.\n\nNow, don't think for a second that this idea was a feminist takeover: in the grand tradition of Melbourne's men's clubs — all founded when the city was drowning in gold — I am happy to report that steely, capitalist principles alone informed the idea of the trial: the Savage Club needed the money.\n\nKarens 'badly done by' Photo shows A composite image of three women recorded on video which has been posted on social media. One of Australia's top linguistics experts believes the pop culture term has evolved into one with derogatory and offensive connotations.\n\nThe then club president had bemoaned to members that lunch attendances were falling, as business groups and members wanting to dine with their wives had to seek alternative city restaurants. A club info sheet sniffed that the places these members and their presumably inconveniently gendered partners had been chased to were \"probably nowhere near as good as the Savage Club\", so something had to be done to get them back (someone send that guy a Melbourne Good Food Guide, stat).\n\nSo, a trial commenced, on those days only.\n\nIt did not go well.\n\nA faction of men angry at the invasion called for an extraordinary meeting in an email that was just as extraordinary. For the kids playing along at home, see if you can spot the fallacy:\n\n\"The loud and boisterous bohemian behaviour that the club is famous for will now have to be tempered for fear of upsetting a 'Karen' at the other end of the dining room. \"Our wives no longer will have the comfort of knowing we are at a male-only venue, so long hours spent at the club will no longer be viewed as favourable on the home front.\"\n\nCan you see it? On the one hand, men will become neutered and constrained by the mere presence of women but, at the same time, they might become wild and be plausibly accused by their wives of poor behaviour if said women were there at all.\n\nSuch alluring women would, of course, only be there in the company of their male partners and therefore preoccupied with their own marriage, but let's put that to one side.\n\nThese clubs are the weirdest anomaly\n\nWomen in the dining room — or \"ducks on the pond\", as the immoveable Australian tradition would have it — had become intolerable. And here the trial ends.\n\nOne assumes the Savage Club will now have to hire Melbourne luminary chef, Andrew McConnell, to keep the wandering palates of male members (and their wives) firmly at Bank Place.\n\nFor the women who were part of the trial, never has the Groucho Marx dictate been more meaningful: writer Jen Vuk was one of them. If they wanted to have her as a member, she didn't want to join. Writing in The Age, Vuk believed she'd dodged a bullet — or a chewy braised kidney: \"You can keep the nostalgia, exclusivity, taxidermy and misogyny,\" she sniffed.\n\nThese clubs, which still exist right around the country, are the weirdest anomaly. They sit jostled up against the Australia they firmly shut their doors against: the ramen bars and hookah joints and dumpling cafes and nightclubs and restaurants and shops owned and run by the generations of migrated Australians not represented in their membership. The clubs' purpose in a modern Australia seems almost neurotic.\n\nSign up for Weekend Reads in your inbox Photo shows Virginia Trioli in a stylish suit on a set with lighting behind her Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\nI've only set foot in one of them, I think. I can't remember who invited me to lunch, but I vividly recall weak sunlight filtering through heavy Victorian windows that didn't seem to have been cracked open since Edward the Seventh was tupping Lily Langtree. Old men were nodding off over their cauliflower soup, and I could smell the dust. I perched on the edge of my chair with buttocks clenched: there wasn't a surface I wanted to touch.\n\nI was part of an original group of Melburnians who were invited by Myer scion and arts patron, Carillo Gantner, to be foundation members of a rival club to the untouchable establishment, but I couldn't muster the enthusiasm.\n\nAnd the former state shadow treasurer, Louise Staley, once spotted me lurking in the foyer of the Lyceum Club, waiting for the architect, Kerstin Thompson, who had completed a beautiful redevelopment of the 113-year-old women-only club. She asked if I wanted to become a member: it was useful to have a place in town you could sit and make some calls, ease off your shoes and pull out your laptop, she said.\n\nThe Lyceum was founded next door to the Melbourne Club as a place for the excluded wives to go while the members were at lunch. Standing in the club's lovely tree-top level lounge, you look down over the grand rear garden of the Melbourne Club — a clever way to keep an eye on the goings-on back there. No thank you, I said. Groucho knows why.\n\nThis weekend, my admirable colleagues are the greatest defenders of our great democracy, at a time when this institution has never seemed more fragile. Here is the brilliant Julia Baird introducing you to this year's Boyer Lectures, which focuses on Australia's \"future in a changing world\"; and the wonderful Annabel Crabb has taken over the national sausage sizzle with her new social history program, Annabel Crabb's Civic Duty — everything you always needed to know about our political process.\n\nHave a safe and happy weekend. This is the vibe those of us fleeing our desk jobs need this weekend, courtesy of the power and beauty of Sydney singer-songwriter Madeleine Powers and Rageflower. Go well.\n\nVirginia Trioli is presenter of Creative Types and a former co-host of ABC News Breakfast and Mornings on ABC Radio Melbourne.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/10-best-albums-of-september-olivia-dean-geese-nine-inch-nails/105843906",
        "title": "Taylor Swift's new album isn't the only one you should hear this weekend",
        "publish_date": "Fri, 03 Oct 2025 22:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Yes, we know — Taylor Swift just dropped a new album.\n\nBut in the weeks before The Life of a Showgirl took over the conversation, some of the best records of 2025 arrived far more quietly, and they deserve your attention.\n\nIf you're all-in on Taylor right now, no judgement. But if there's room in your rotation for more than one artist, we've got a handful of incredible albums you might've missed — and they're absolutely worth discovering.\n\nOlivia Dean — The Art of Loving\n\nAlready a hit with young audiences at Laneway Festival, Olivia Dean headlines venues on Australia's east coast next month. (Supplied: Universal Music Australia)\n\nSpotify | YouTube | Apple Music\n\nThe UK artist's self-assured second album fulfils what her 2023 debut album Messy promised: Olivia Dean is something special.\n\nThe Art of Loving has all the hooky pleasures of commercial pop but few of the cliches, couching the 26-year-old's effortlessly airy, understated voice in classy arrangements and songwriting with a vintage flair.\n\nCuts like Nice To Each Other and Man I Need are instant earworms whose meaningful sentiments makes them even more addictive. Namely, overcoming relationship angst with pleas toward tenderness, honesty, and self-worth.\n\n\"I can't tell if you need me or want me all that much\" Dean frets between vintage horns on Close Up, then takes pride in letting go on the soulful ballad Let Alone The One You Love.\n\nThe string-laden Loud sounds genuinely crestfallen, but then the flirty So Easy (To Fall In Love) glides over a Burt Bacharach trumpet, shimmying guitar and luxurious piano as Dean proclaims to be the \"perfect mix of Saturday night and the rest of your life\".\n\nNo song overstays its welcome, and despite their breezy execution, each makes a memorable impression with charming performances and convincing emotional stakes.\n\nFor fans of: RAYE, Norah Jones, Jorja Smith\n\nAl Newstead\n\nWednesday — Bleeds\n\nNorth Carolina indie rock band Wednesday soar to new heights on their sixth album. (Supplied: Dead Oceans)\n\nSpotify | YouTube | Apple Music\n\nOn their sixth album Bleeds, Wednesday sharpen the edges of their chaotic creative impulses, offering a thrilling blend of scorched noise and dusty twang that feels occasionally volatile and often comforting.\n\nIt's a step forward from their 2023 breakthrough Rat Saw God, dialling down the abrasiveness just enough to let their songwriting shine through.\n\nThe guitars are a patchwork of textures — twangy, searing, sometimes sweet — jammy without indulgence, familiar without falling into imitation.\n\nBut Karly Hartzman is Bleeds's emotional core. Her voice is impassioned and unpretentious, her lyrics full of strange, vivid snapshots of everyday horror and humour.\n\nOn Phish Pepsi, she sings: \"We watched a Phish concert and Human Centipede, two things I now wish I had never seen\", a simple line illustrative of her funny, bleak, relatable worldview.\n\nSix albums deep, Wednesday are making the best music of their career — and they're still in their 20s. Bleeds is proof that their creative fire is only getting brighter.\n\nFor fans of: Pavement, MJ Lenderman, Veruca Salt\n\nDan Condon\n\nMel Blue — nomorejacketsplease\n\nMel Blue began life as a six-piece, then reduced to a duo, and now consists of Oscar Sharah, Luke Gerber and Jacob Siles. (Supplied: Nettwerk Music Group)\n\nSpotify | YouTube | Apple Music\n\nSydney trio Mel Blue thought relocating to London would skyrocket their career. The reality was different.\n\nInstead of gigging across Europe and DJing iconic British clubs until the early hours, they got day jobs as teachers while struggling with the isolation of adapting to a new lifestyle. But their personal loss became their music's gain.\n\nAbsorbing the vibrant sounds of London's underground dance music, nomorejacketspleaserattles with lively jungle breaks and garage beats. From the soulful samples bouncing through $ame Thing to the '90s club energy of Diamonds, these songs excel at putting fresh spins on nostalgic sounds.\n\nThe candy-coated Secret Crush sounds like an undiscovered R&B bop in fast forward. Addictive standout None Of That tweaks the vocals of collaborator Sycco over lush drum'n'bass and wonky synths.\n\nMel Blue also skilfully merge animated tempos with contemplative songwriting and autumnal atmosphere.\n\nA pitch-shifted vocal laments broken trust and heartache over a shuffling pulse and warm synths on the tender Be That To You, while Same As I thrives in misty melancholy.\n\nThe wide-ranging styles and textures hang together as a subtle narrative encompassing friendship, growth, and reinvention. \"A rumination on finding hope through distance and change,\" as the band put it.\n\nIf Britain doesn't start paying attention to Mel Blue, then Australia absolutely should.\n\nFor fans of: Mall Grab, Fred Again.., Piri & Tommy\n\nAl Newstead\n\nAyesha Madon — The Unanticipated Prequel\n\nThe Unanticipated Prequel is the debut EP from Ayesha Madon, who many will recognise from Netflix series Heartbreak High. (Supplied: Future Classic)\n\nSpotify | YouTube | Apple Music\n\nThe idea that Australia's recent chart struggles come down to a lack of talent just doesn't stack up.\n\nOn her debut EP, Sydney's Ayesha Madon serves up six tracks of world-class, effervescent pop — songs that should already be stuck in every Australian's head.\n\nThe sleek and bubbly sound of Eulogy is at odds with its dark lyric, as Madon outlines the flaws people might bring up at her funeral, and brushes off the good things they might say as lies.\n\nBlame Me dives into the ache of unrequited love, pairing frustration and vulnerability with sleek production from the ever-reliable Japanese Wallpaper.\n\nThe EP's two new tracks — bubbly raver Supervision and the bizarre-yet-sassy Jonestown — stand tall alongside the earlier singles, showing the breadth of Madon's stylistic range while retaining a consistent voice that helps these six songs make sense together.\n\nThese songs prove Madon can hold her own alongside the best pop artists in the world. So, what's it going to take for the mainstream gatekeepers to get behind her?\n\nFor fans of: Sabrina Carpenter, Remi Wolf, BENEE\n\nDan Condon\n\nGeese — Getting Killed\n\nGetting Killed follows 2023 cult hit 3D Country, and frontman Cameron Winter's raved-about debut solo album Heavy Metal. (Supplied: Partisan Records)\n\nSpotify | YouTube | Apple Music\n\nWhen an album begins with the alarming refrain of \"THERE'S A BOMB IN MY CAR!\" against a shambolic groove and muddied trumpet, you know you're dealing with something radical.\n\nDon't let the cacophony deter you, the fourth album from Geese is the thrilling sound of rock music being deconstructed and reassembled into fascinating new possibilities.\n\nReinvention is central to these four New York City 20-somethings, who've been playing, writing and absorbing the guitar-band canon since before they could legally drink.\n\nGetting Killed was recorded with Kenneth Blume (formerly known as hip hop producer Kenny Beats) in 10 days.\n\nThat spontaneity supercharges a record that tramples all over its varied inspirations — everything from Rolling Stones, Television and Velvet Underground to Van Morrison — to forge strange, intoxicating songs.\n\nRubbery rhythms meet a sampled Ukranian choir on the title track; Cobra and Au Pays du Cocaine rewire their idiosyncrasies into swooning, sentimental moments.\n\nThe craggy grooves of Bow Down and 100 Horses buttress frontman Cameron Winter's mercurial melodies, while his shamanic presence powers the deceptively cathartic Taxes and epic closer Long Island City Here I Come.\n\n\"You were there the day the music died,\" Winter hollers as the latter unravels. \"And I'll be there the day it dies again.\"\n\nIn an era ruled by algorithmic trends and AI slop, it's invigorating to hear a group that refuses to rely on the formulaic. Geese sideline convention for creative freedom on an album unlike any you'll hear this year.\n\nFor fans of: Television, Car Seat Headrest, Black Country, New Road\n\nAl Newstead\n\nNine Inch Nails — TRON: Ares\n\nTRON: Ares features collaborations with Scottish producer Hudson Mohawke and Boyz Noise. (Supplied: Universal Music Australia)\n\nSpotify | YouTube | Apple Music\n\nIn the past decade, Trent Reznor is typically busier with his award-hoovering film score work alongside Atticus Ross than with Nine Inch Nails — the influential industrial rock group he founded in the late 80s.\n\nIt's a welcome surprise then, that the score to Disney's Tron \"threequel\" doubles as NIN's first album in half a decade, and the star attraction is four Reznor-fronted songs.\n\nAs Alive As You Need To Be and Shadow Over Me operate in his familiar wheelhouse of digital dystopia, but whose vocoders and vintage synths nod to Daft Punk's Tron: Legacy (the best thing about that 2010 film) and original Tron composer Wendy Carlos.\n\nThen there's the brooding trip hop of I Know You Can Feel It, and the uncharacteristically sensitive Who Wants To Live Forever? where twinkling keys meet the tender vocals of Spanish singer Judeline.\n\nThe remaining instrumentals steep Reznor and Ross's reliable soundtrack signatures — frosty piano, elegant atmospherics, scorched-earth intensity — in analogue throbs, drones and buzzes befitting of a sleek, neon-lit sci-fi universe.\n\nIt isn't groundbreaking but TRON: Ares is dependable proof Reznor and Ross haven't run out of ways to sound majestically menacing.\n\nFor fans of: HEALTH, Drab Majesty, Perturbator\n\nAl Newstead\n\nBig Thief — Double Infinity\n\nThe widely lauded Big Thief contended with a personnel change in the lead up to their sixth album Double Infinity. (Supplied: 4AD/Remote Control)\n\nSpotify | YouTube | Apple Music\n\nSome records you feel in your bones. There's a looseness and warmth to Big Thief's sixth album, born from the band's decision to record with a community of friends and collaborators. While the songs are great, the vibes are even better.\n\nIt hasn't been an easy road. The loss of bassist Max Oleartchik marked a major shift for the New York group, and the weight of expectation after a decade of critical acclaim must have loomed large.\n\nYet rather than retreat, Big Thief have leaned into change, and emerged with a record that feels freer, more open, and, at times, quietly joyful.\n\nAdrianne Lenker's songwriting remains the emotional core. Her reflections on love, life, and the strange beauty of existence are often delivered with a gentle touch here.\n\nThere's less devastation, more light, and it never feels forced. Lenker's joy is subtle, grounded, and deeply human.\n\nFrom the chatter and chuckles that usher in album highlight Los Angeles to the communal harmonies that ripple through the album, Double Infinity radiates a subtle but infectious communal joy.\n\nThe emotional weight is still there, it just won't leave you quite as devastated as some of the band's best work.\n\nIt's too soon to say where this sits in Big Thief's remarkable catalogue — their albums always take time to fully reveal themselves.\n\nBut one thing's clear: Double Infinity reaffirms their place among the most vital and visionary bands of our time.\n\nFor fans of: boygenius, Faye Webster, John Prine\n\nDan Condon\n\nParcels — LOVED\n\nA true globetrotting act, Parcels recorded their new album in studios across Berlin, Byron Bay, Sydney, and Mexico. (Supplied: Because Music)\n\nSpotify | YouTube | Apple Music\n\nIf you've been hankering for a follow-up to Daft Punk's Random Access Memories, you clearly haven't discovered Parcels.\n\nThe Australian quintet has been pulling at the same sonic threads — chic disco-pop, pristine jazz-funk, and soulful soft rock — since forming in 2014.\n\nTheir throwback sound (and wardrobe) even caught the attention of Daft Punk, who produced their breakout 2017 single Overnight.\n\nThey're now on their third album, and after the sprawling double album Day/Night, LOVED goes back to basics.\n\nIt wastes no time rolling out feel-good funk on tunes like Tobeloved, Yougotmefeeling and Leaveyourlove (the title stylisation is a hangover from when Parcels recorded songs onto a computer with a broken spacebar).\n\nLeaves is another example of the ensemble's flawless multi-part vocal harmonies and airtight grooves that exhibit both instrumental mastery and contagious immediacy.\n\nThe shiny surfaces might be too polished for some, and the lyrical fixation on love occasionally knocks on the door of cliché, but Parcels aren't a glorified wedding band.\n\nIfyoucall and Summerinlove grapple with the break-up blues, while the slowed-down, loose indie rock of Safeandsound conveys comfort in uncertainty.\n\nLOVED isn't a huge creative leap forward but for Parcels novices, it's the perfect introduction.\n\nFor fans of: Jungle, L'Impératrice, LEISURE\n\nAl Newstead\n\nAcopia — Blush Response\n\nBlush Response is the dreamy and nostalgic new album from Melbourne trio Acopia. (Supplied: Scenic Route)\n\nSpotify | YouTube | Apple Music\n\nIf you know you know. Melbourne's Acopia have quietly carved out a space in the global underground in recent years, blending the familiar sounds and textures of dreamy pop and moody trip hop to create something truly their own.\n\nOn Blush Response, their third album, they reach a new creative peak.\n\nYou may find yourself feeling nostalgic while listening, as the group weave these familiar shades into beautiful, hazy, understated pop songs.\n\nKate Durman's soft, expressive, magnetic voice is the album's anchor.\n\nHer melodies glide through a collage of breakbeats, synths, and guitar lines, delivering hooks that feel both effortless and deeply felt.\n\nAt their core, these are deceptively simple pop songs — but each one is rich with emotional nuance and sonic detail.\n\nBlush Response doesn't reinvent the genre, but it doesn't need to. Acopia know exactly what they're doing, and they do it with rare precision.\n\nFor fans of: The Cure, Slowdive, Massive Attack\n\nDan Condon\n\nCut Copy — Moments\n\nCut Copy’s sophisticated synth-pop was always more intimate than 2000s contemporaries like The Presets and Midnight Juggernauts. (Supplied: Cutters Records)\n\nSpotify | YouTube | Apple Music\n\nPioneers of Australia's mid-to-late 2000s indie-electro wave, Cut Copy's seventh album laces their formative synth-driven sound with a significantly mellower sense of artisanal atmosphere.\n\nBuilding upon 2020's more ambient Freeze, Melt, these are tracks that leisurely build their expansive, euphoric grooves before layering in deceptively complex textures and intriguing sounds.\n\nA children's choir livens up When This Is Over, and Belong To You brings together LA singer-songwriter Kate Bollinger and pedal steel guitar from 'Evil' Graham Lee (former member of The Triffids) over a lite-funk strut.\n\nThe outwardly clubbier moments are more selective, meaning they hit harder when they do emerge, especially on returning listens.\n\nOne of the best is found in the title track — a seven-minute slow-burn subtle trap hi-hats, warm bass, and cavernous drips that evolves into a hypnotic guitar-and-vocoder assisted coda.\n\nGravity is another, mutating around Dan Whitford's mantra-like vocals into feathery keyboard squiggles and a psychedelic stretch, complete with trippy spoken-word excerpts.\n\nAging Millennials will find Moments perfectly pitched to their pace, its pulses never racing too hard or attempting to recapture some bloghouse heyday.\n\nSure, you can imagine youthful versions of cuts like More Alive or Still See Love, their stuttering synths and gentle thud amped up into something you'd smash an alcopop to at a Kings Cross venue back in the day (while sporting a V-neck and shutter shades perhaps?)\n\nThe older, wiser Cut Copy is less in-your-face but their ingenuity and skill for crafting satisfying, trance-inducing listening experiences has only become more refined.\n\nFor fans of: Hot Chip, Caribou, Washed Out\n\nAl Newstead\n\nHear the best new music and lots of your favourites from the past on Double J. Here's how to listen.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/aflw-carlton-blues-round-eight-analysis/105848936",
        "title": "The style shift that has Carlton knocking on door of AFLW top four",
        "publish_date": "Fri, 03 Oct 2025 21:27:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "Carlton was always meant to take the premiership points over Collingwood in the AFLW season opener.\n\nBut it was the way the Blues did it that piqued the footy world's interest.\n\nThen, in round two, the Blues pushed 2024 preliminary finalist Hawthorn until the dying minutes, amid difficult conditions in Frankston.\n\nMaybe they were the real deal?\n\nAnd by round three, the Blues knocked off perennial contender and 2024 grand finalist, the Brisbane Lions, in hostile territory.\n\nIn the space of three weeks, Carlton established itself as a force to be reckoned with this year.\n\nNow, with another month of evidence, it is a genuine top-four contender following a disappointing 2024 campaign in which it finished 14th and won just four matches.\n\nSitting fifth on the ladder at the beginning of round eight, the Blues are a side that finally has the personnel to execute the style coach Mathew Buck has been working toward since landing the role in 2023.\n\nThe stop\n\nDefensively, Carlton has tightened the screws this season.\n\nConceding two goals fewer per match compared to last year, it is not the amount of ball coming in that it has adjusted — the club is actually conceding more inside 50s — rather, its stopping ability has improved significantly.\n\nCarlton's tightening defence 2024 2025 Avg points against 48.4 36.4 Avg inside 50s against 35.8 37.0 Avg marks inside 50 against 6.8 7.3 Avg shots on goal against 15.2 12.6 Avg shot efficiency against (%) 42.4 34.0\n\nNotably, Carlton is rebounding 84.2 per cent of its opponents' forward entries this year, compared to just 78.7 per cent last season.\n\nHarriet Cordner is the north star of the Blues' backline, backing up her All-Australian squad selection last year with a career-best season.\n\nShe is the steady head under pressure, combining her stopping and intercepting skills with rebound back out of the line.\n\nCordner is well supported this year, however, with improved duo Ciara Fitzgerald and Maddie Hendrie.\n\nAs the last line of defence, Fitzgerald and Hendrie are generally assigned specific roles — lock down the opposition's deepest forward targets — and then offload to a multitude of rebounding options.\n\nWhat Carlton has been able to trust this year is its defenders' capacity to win, or equal one-on-one contests. No longer are pure numbers required down back to cope with what opposition forwards throw their way.\n\nThe spread\n\nLast year, the Blues were all too often caught getting numbers back to combat teams' attacking games and then starved of options higher up the field once the ball was won.\n\nIt meant they generally got stuck in a vicious, exhausting cycle of fighting to win the ball back deep, desperately kicking long to clear the space, only for it to be a turnover and become an immediate issue once again.\n\nThat has all changed in 2025.\n\nCarlton's spread and structure when coming back out of the defensive half has become the key stylistic shift, but it is built on the solid wall established behind the play.\n\nIn the past, Carlton was at its best with this sort of aggressive, running game. Most notably, at its peak in 2019 and 2020, it was the likes of Chloe Dalton and Brooke Walker dashing out of defence and getting the ball moving at speed.\n\nPoppy Scholz is enjoying a superb debut season with the Blues. (Getty Images/AFL Photos: Adam Trafford)\n\nNow, the elite kick of first-year defender Poppy Scholz is often a starting point, while the dash of winger Dayna Finn and half forward Erone Fitzpatrick keeps the transition going up the field.\n\nRepeat efforts and gut running have become the brand of Irish duo Finn and Fitzpatrick, often catching out their direct opponents.\n\nScholz is a new addition, Finn is one of the league's biggest improvers this season, and Fitzpatrick made a successful return from an ACL injury that kept her on the sidelines over 2024.\n\nThe trio have been the building blocks of Carlton's aggressive, and fast transition game that has caught teams out repeatedly.\n\nThe score\n\nNot only are the Blues conceding two fewer goals per game this year, but they are also kicking three more of their own.\n\nTheir two leading goal-kickers — Tara Bohanna and Sophie McKay — are new additions to the club this year.\n\nAn increasingly potent attack 2024 2025 Avg points for 24.2 43.3 Avg inside 50s 28.0 33.1 Avg marks inside 50 3.8 6.3 Avg shot efficiency (%) 32.8 42.2 Avg goal accuracy (%) 34.7 43.9\n\nSo, not only is the run and carry further up the field affording Carlton more looks inside 50, but those on the receiving end of those entries are more damaging with ball in hand.\n\nLed by Bohanna and McKay, who have each kicked eight goals over the opening seven rounds of the season, the Blues are enjoying a wider spread of attacking options.\n\nThey averaged three goalkickers per game last year, but this year that average has grown to 4.7 as players like Breann Harrington, Fitzpatrick, Finn, and Keeley Sherar hit the scoreboard.\n\nThese three pieces — the stop, the spread, and the score — have been things Carlton has been building to since its program overhaul in early 2023. Now, finally, the personnel are matching the intent, and it's made the Blues a must-watch.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-04/qld-air-new-zealand-denies-assistance-dog-flight-twice/105840284",
        "title": "Settlement reached after woman not allowed to fly with assistance dog",
        "publish_date": "Fri, 03 Oct 2025 21:25:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "A woman with post-traumatic stress disorder who was twice refused permission to fly on Air New Zealand with her assistance dog has settled a discrimination complaint on confidential terms.\n\nLisa Robinson, a former paramedic, said her dog Lilly alerted her to elevating anxiety levels, allowing her to \"face the world in ways I might not manage on my own\".\n\n\"Without Lilly, my life is much narrower and harder,\" the Brisbane resident said.\n\nLilly is recognised as an assistance animal by public transport operators in Australia. (Supplied: Lisa Robinson)\n\nIn 2022 and 2024, Ms Robinson attempted to book Air New Zealand flights between Brisbane and Christchurch.\n\nOn both occasions, Ms Robinson said she was told her Bichon Poodle could only travel in the plane's cargo.\n\nThis was despite her providing evidence Lilly was trained and recognised as an assistance animal by public transport operators in Australia.\n\n\"We were declined because we weren't one of the recognised types of assistance dog that Air New Zealand would recognise,\" Ms Robinson said.\n\nMs Robinson provided proof that her dog Lilly was certified as an assistance animal, but was denied by the airline twice. (Supplied: Lisa Robinson)\n\nFollowing the first incident, she made a discrimination complaint to the Queensland Human Rights Commission.\n\n\"I wanted to fly home to New Zealand to visit friends and catch up,\" she said.\n\nHer assistance dog had previously flown by her side on other airlines in Australia.\n\n\"We're not an inexperienced team,\" Ms Robinson said.\n\nThe Justice and Equity Centre helped Ms Robinson with her complaint and with conciliation with the airline.\n\nMs Balakrishnan said blocking access for assistance animals could be disability discrimination. (ABC News: Chris Taylor)\n\nSheetal Balakrishnan, a senior solicitor at the centre, said Air New Zealand’s stance essentially treated Lilly as a pet.\n\n\"Assistance dogs are not pets. They're working animals that are highly trained to support a range of people with disability,\" she said.\n\nMs Balakrishnan said businesses had to provide their services in an accessible way, and assistance animals had the right to access public spaces.\n\n“That means if a business refuses access to an assistance animal, it could be disability discrimination,” she said.\n\n'Committed to listening, learning and improving'\n\nMs Robinson and Air New Zealand settled the complaint on confidential terms in August.\n\nLilly has attended a first aid course in her assistance animal duties. (Supplied: Lisa Robinson)\n\nThe airline has changed its policy this year to allow assistance dogs to travel in the cabin on flights between Australia and New Zealand.\n\nAir New Zealand's Chief Operating Officer Alex Marren said the updated policy came following a two-year review.\n\nShe said throughout the review process, the airline had engaged closely with customers, advocacy groups, training organisations, government agencies, Australian state bodies, and other airlines.\n\n\"Taking the time to listen and prepare in this way has been essential to shaping a policy that supports those who rely on assistance dogs and is safe for all customers and staff,\" she said.\n\nAir New Zealand confirmed that after a two-year review, new pathways had been implemented to allow assistance animals to travel on board. (Supplied: Michael Wilden)\n\nMs Marren said the new policy had opened an approval pathway for assistance dogs accredited by an Australian State or Territory, but without accreditation by either Assistance Dogs International or the International Guide Dogs Federation.\n\nShe said it also allowed customers to supply the airline with additional training information.\n\n\"Provided the required safety requirements are met, we will welcome these certified service dogs on routes between New Zealand and Australia where a service dog is eligible for NZ MPI (Ministry for Primary Industries) entry requirements,\" she said.\n\nMs Marren said the airline's website was currently being updated to reflect the changes.\n\nQantas sued over service dog Photo shows A young white woman sitting with her service dog in a park. The dog is a border collie and they are both smiling A Sydney woman is taking Qantas to the Federal Court after the airline refused to allow her assistance dog on a flight.\n\nShe said the airline \"deeply cared about making air travel accessible for everyone\".\n\n\"We remain committed to listening, learning, and improving so that all our customers feel supported when they travel with us,\" she said.\n\nInconsistent rules across airlines\n\nPeople with Disability Australia's acting CEO Megan Spindler-Smith said there was a lot of uncertainty about rules for passengers with assistance dogs when boarding, leading to a \"high level\" of refusal and discrimination from airlines.\n\nMx Spindler-Smith said there were inconsistent rules and requirements between airlines, and between Australian states and territories.\n\n\"That's because there isn't a national standard,\" they said.\n\nMx Spindler-Smith said being able to travel by air was essential for people with disability to be independent.\n\nMx Spindler-Smith said without a national standard, there was room for discrimination from airlines. (ABC News: Jessica Horner)\n\n\"For those that have assistance animals, these animals make it possible for people to actually travel, engage in work and social lives for the first time in a long time,\" they said.\n\nIn a statement, a federal transport department spokesperson said the Australian government was committed to delivering greater protections for passengers flying with a disability.\n\n\"We are developing new Aviation Disability Standards that will specifically address the rights and needs of people with disability when travelling by air,\" the spokesperson said.\n\nLilly has accompanied Ms Robinson to countless events as an assistance animal. (Supplied: Lisa Robinson)\n\nThey said the standards were being co-designed with the disability sector and people with lived experience.\n\nThe spokesperson said the new standards were also being developed alongside broader national reforms aimed at removing discrimination, including a review of the Disability Discrimination Act 1992 and the development of National Principles for Assistance Animals.\n\nNeed to be 'more inclusive'\n\nUnder Air New Zealand's new policy, Lilly can fly in the cabin.\n\nMs Robinson said she was pleased the airline had changed its requirements.\n\n\"Lilly is a Kiwi, I'm a Kiwi, and it would have been a really sad thing to not have been able to fly on the Kiwi flag,\" she said.\n\nBut Ms Robinson said there was still more work to be done in the aviation space.\n\nMs Robinson hopes to see more work done to prevent discrimination. (Supplied: Lisa Robinson)\n\n\"Lilly and I can fly on nearly every airline carrier in Australia, and we can fly on several overseas carriers,\" she said.\n\n\"There's just a small number of carriers that still need to make those changes to be more inclusive.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/christian-petracca-chooses-gold-coast-now-it-s-time-to-make-the-trade-20251003-p5mzrz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Maybe a few more 16-disposal games might get you there’: McRae’s cheeky Daicos Brownlow quip",
        "publish_date": "Sat, 04 Oct 2025 10:52:38 +1000",
        "category": "sports",
        "authors": [],
        "text": "On a special night for Cameron at Crown Palladium, he also took home the Darren Millane Award as the Pies’ best clubman. McRae spoke about his big man’s impact. “Darcy has played a pivotal role in our side this year, and it’s fantastic to see him get the recognition he deserves tonight,” he said. “Stepping into a leadership role ahead of the season, Darcy has not only set high standards for himself, but he is constantly supporting and mentoring his teammates to ensure everyone in our program is committed to growing and improving.“\n\n– Russell Bennett and Scott Spits E.W. COPELAND TROPHY TOP 10 1. Darcy Cameron 328 votes\n\n2. Nick Daicos 315\n\n3. Isaac Quaynor 303\n\n4. Jamie Elliott 298\n\n5. Harry Perryman 292\n\n6. Josh Daicos 288\n\n7. Steele Sidebottom 265\n\n8. Scott Pendlebury 253\n\n9. Ned Long 238\n\n10. Jack Crisp 228\n\nMarshall hollers for Geelong Peter Ryan St Kilda ruckman Rowan Marshall has formally requested a trade to Geelong just hours after the Saints landed free agent Blues ruckman Tom De Koning on the first day of the free agency period. Marshall has been on the Cats’ radar for some time as they look to bolster their ruck stocks following their grand final loss to the Brisbane Lions. Rowan Marshall, here celebrating a goal against the Cats in 2024, has requested a trade to Geelong. Credit: Getty Images\n\nThe 29-year-old still has two years to run on his contract, but his position has been in doubt at the Saints since they made their huge play to recruit De Koning. The Cats have pick No.18 in the national draft which may be enough to secure Marshall who finished sixth in the Saints’ best-and-fairest this year. Teammates De Koning and Jack Silvagni joined St Kilda from Carlton as free agents on Friday morning, with the Blues gaining a top-10 pick in next month’s national draft for losing De Koning, and another at the end of the first round for losing Silvagni. The duo were among the first players to officially exercise their rights when the free agency window opened, according to the AFL. The Blues did not match St Kilda’s monster eight-year contract offer to restricted free agent De Koning and will receive pick No.9 as compensation.\n\nIn a statement, Carlton list boss Nick Austin said: “Multiple first-round selections is a great position for us to be in ahead of November’s draft, and we will look to maximise these assets accordingly in line with our overall list management strategy.” Meanwhile, De Koning, in a Saints statement announcing his arrival at the club, said he was “absolutely pumped” to be joining Ross Lyon’s side. “From the outside you can see how tight this playing group is,” he said. “There’s a real determination to get the best out of themselves and each other, and I want to contribute to that. “Players like Nasiah Wanganeen-Milera, Marcus Windhager, Mitch Owens and a whole group of emerging players are showing what can be achieved when you’re aligned and hungry for success.”\n\nSilvagni declared his intention to join the Saints last month. Loading Austin said the compensation pick they would get for losing Silvagni was welcome. At this stage, it equates to pick No.19, but that number is expected to blow out as clubs insert themselves higher in the draft order by exercising their rights to select players in their academies or father-son selections. Silvagni spoke on Friday, through a St Kilda statement, of his excitement at joining his new club. “I’m incredibly excited to be joining St Kilda and starting this new chapter,” he said.\n\n“The Saints have a strong mix of established talent and exciting young players, and I feel I can add to that with my experience, versatility and drive to compete. “As a young father, this decision is also about building the next stage of my life with my wife Grace and our son Charlie. The opportunity to grow both on and off the field in a stable and supportive environment was really important in making this choice.” He also paid tribute to Carlton. “Carlton will always be part of me. It’s where I grew up, where my AFL career began, and it’s deeply connected to my family and our history in the game,” Silvagni said. “I’ll always be grateful for the experiences I had there and the people who supported me. But now I’m looking forward with full focus on the Saints, and doing everything I can to help us push forward.”\n\nThe Saints also released a statement on Friday addressing the playing future of skipper Jack Steele, who told the club in his exit interview that he planned to step down from the captaincy. The 29-year-old hard-nosed midfielder has played 185 games for the Saints since making the switch from GWS in 2016, but could now be looking for his third football home. “The club called Jack in today for a follow-up discussion about his playing future and to discuss his openness to explore other opportunities,” the Saints said in their statement. “Jack advised the club he wants to stay but is prepared to consider opportunities if presented to him.” Elsewhere, James Worpel, who was also a restricted free agent, has left Hawthorn for Geelong on a four-year deal. The Hawks received an end-of-second-round pick as compensation. Melbourne premiership player Charlie Spargo (North Melbourne) and GWS defender Jacob Wehr (Port Adelaide) are set to find new clubs as unrestricted free agents.\n\nBack-to-back premiers Brisbane are set to strengthen their list with the addition of Essendon ruckman Sam Draper and West Coast forward Oscar Allen. Collingwood forward Brody Mihocek is weighing interest from Melbourne, while Gold Coast midfielder Brayden Fiorini has a choice between Essendon, Port Adelaide and the Suns. The free agency period runs until October 10. The trade period overlaps, running from October 6-15. Petracca wants a Gold Coast sea change Melbourne premiership midfielder Christian Petracca wants to be traded to the Gold Coast Suns.\n\nThe 29-year-old Norm Smith medallist met with the Gold Coast on Thursday after both the Demons and Petracca decided he should explore his options during the trade period. Melbourne midfielders Christian Petracca and Clayton Oliver are both seeking new clubs for 2026, with Petracca keen to land at Gold Coast. Credit: Getty Images A competition source with knowledge of the situation, who preferred to remain anonymous, said Petracca had decided he wanted to join the Suns. Petracca also met with Adelaide on Monday in a hastily arranged catch-up after it only became clear late last week Melbourne wanted to release the champion midfielder who still has four years remaining on his contract.\n\nPetracca was impressed with the pitches presented by both clubs but decided on the Suns after being shown around the Gold Coast facilities on Thursday. The Crows had already baulked at adding an extra season to his current deal, which expires at the end of 2029, and it was clear that a trade between them and Melbourne was going to be difficult. The Suns have more options to do the trade, even with the Demons aiming to clear his contract from their books. Loading The two clubs will now need to make a trade. The Demons’ interest in Suns Sam Flanders and Bailey Humphrey could help them execute a deal. The Suns are open to trading Flanders, who also has interest from St Kilda and Essendon, but not Humphrey, who is contracted until 2028. A photo surfaced online on Friday showing new Demons coach Steven King and club great Nathan Jones flanking Humphrey in Melbourne. Carlton and Collingwood have also been linked to Humphrey.\n\nPetracca has been a champion at Melbourne after being pick No.2 in the 2014 national draft. He had a knee reconstruction before he played his first match but was the key player during the Demons’ surge to a drought-breaking flag in 2021, when he was best on ground in the grand final. He has won two club best-and-fairest awards and is a four time All-Australian. However, he became disillusioned with the club at the end of 2024 after he suffered horrific injuries during the King’s Birthday clash that year. Petracca is regarded as one of the most dedicated and professional players in the game, however he has needed to continually work on his commitment to team aspects as his frustration on field can spill over at times.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/so-long-starbucks-as-americans-tastes-finally-catch-up-to-australia-20250929-p5myop.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "So long, Starbucks, as Americans’ tastes finally catch up to Australia",
        "publish_date": "Sat, 04 Oct 2025 09:55:00 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "What in the World, a free weekly newsletter from our foreign correspondents, is sent every Thursday. Below is an excerpt. Sign up to get the whole newsletter delivered to your inbox.\n\nSydney: Hello from – well, Sydney, actually, where I’m having my first decent coffee in months, on a quick trip home.\n\nBack in Washington, DC, where I now live, the US government isn’t the only thing to have shut down this week. On Saturday, the Starbucks on my street in Dupont Circle closed.\n\nStarbucks shuttered hundreds of stores across the US on the weekend. Credit: Bloomberg\n\nIt was one of hundreds of Starbucks locations that shuttered across the United States last weekend, including nine in the District of Columbia alone, according to USA Today, and more in the surrounding metropolitan area, as part of a $US1 billion ($1.5 billion) restructure.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/hope-fades-for-boys-trapped-in-collapsed-indonesian-boarding-school-20251003-p5mzzz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A shake, a scream, and the wail of ambulances: How a school day turned to tragedy",
        "publish_date": "Sat, 04 Oct 2025 09:54:24 +1000",
        "category": "finance",
        "authors": [
            "Zach Hope",
            "Karuni Rompies"
        ],
        "text": "Singapore/Sidoarjo: Patima was pottering at home in the Indonesian town of Sidoarjo on Monday when at about 3pm she felt a “big shake”.\n\nIt was not an earthquake, for she is familiar with these. Something sounded like it had crashed, she said.\n\nRelatives gather outside the school on Wednesday. Credit: AP\n\nThen, from next door, came a scream on repeat – “The boarding house has collapsed!” In the distance, the wails of ambulances.\n\nThe boarding house is Al Khoziny, an Islamic school in Sidoarjo, about 20 kilometres south of central Surabaya. It is one of the oldest and most respected of its kind in East Java.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/this-is-a-doll-but-she-s-not-made-for-child-s-play-20250901-p5mrjd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This is a doll. But she’s not made for child’s play",
        "publish_date": "Sat, 04 Oct 2025 09:35:43 +1000",
        "category": "finance",
        "authors": [
            "Tim Elliott"
        ],
        "text": "This story is part of the October 4 edition of Good Weekend. See all 14 stories .\n\nEver longed for a baby – without the dirty nappies? Ever dreamt of cradling a newborn – without the broken sleep? Ever pined for a child of your own – without the cost of actually raising one? Well, reborn dolls are for you. Mesmerising, intriguing and for some, deeply creepy, “reborns” are hyper-realistic dolls, painstakingly handcrafted to resemble flesh-and-blood babies, complete with fat rolls, inscrutable expressions and silky hair. They are dolls, but this isn’t child’s play, unless you are David Cronenberg. Dolls like this from Aussie Reborn Supplies are hyper-realistic but come without the realities of bringing up baby. Credit: Annette Kravchenko Lifelike porcelain dolls date back to the 1800s and were regarded as both toys and art, but the “reborn” phenomenon is thought to have first surfaced in the mid-1990s. An article in The New York Times, in 2005, described the market as something of “a secret society”. More recently, in Brazil, a TikTok clip of a woman taking her “newborn baby” to hospital during a “medical emergency” got more than 16 million views and sparked proposals to ban people with such dolls from seeking public healthcare. A cursory search on the internet brings up countless “birthing” videos, where people receiving a new reborn ceremonially unbox the doll, some wrapped in their own silicone “wombs”. There are also reborns with disabilities: I even came across a TikTok clip featuring terrifyingly realistic conjoined twin reborns, complete with a fused skull. Watching the creator wrap the infants’ head in bubble wrap, prior to posting, was pure PTSD. “These twins are heavy!” she says. “I think they weigh, like, nine pounds!”\n\nReborns are popular in Australia, too. “There are many reasons people want a reborn doll,” says Annette Kravchenko, owner of Aussie Reborn Supplies in Queensland. “There are young children who want a lifelike baby of their own, older women who miss being a mum, and women who can’t have kids.” Some people with anxiety, including older women with dementia, find cuddling a “baby” comforting. “Some women have nurturing instincts that they can’t otherwise satisfy,” says Kravchenko. Reborns are often used in therapy to overcome grief or the trauma associated with abuse. “We’ve had women come to us who’ve been told to get a reborn doll by their psychologists,” Kravchenko continues. There are even memorial reborns. “Mothers who’ve lost their babies send us a photo of their deceased child and we make a doll based on that. Same weight, same look. We’ve even made stillborn dolls.” Some clients fill their reborn with the ashes of their late baby. “It can be like visiting the grave for them.” Loading Kravchenko, 50, has been making reborns for 25 years. “It starts with a vinyl or silicone doll,” she says. “We paint them with 20 layers, so it gets that fine, translucent look.” The dolls are then customised, with individually rooted hair (premium mohair or alpaca), ultra-fine painted veins, glass or acrylic eyes in any colour or shape. Tiny scratches can be applied, together with milia, the small, pearly-white bumps that often appear on a newborn’s nose. Glass bead weights can be inserted into the doll according to its “age”, together with breather boxes and heartbeats. A high-end reborn can take between six weeks to make and cost anywhere between a couple of hundred dollars to upwards of $6000. Virtually any facial expression can be reproduced, including crying babies. Not surprisingly, Kravchenko says “sleeping newborns” are the most popular.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/too-successful-too-sexual-too-talented-of-course-split-was-nicole-s-fault-20251003-p5mztw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Too successful. Too sexual. Too talented. Of course split was Nicole’s fault",
        "publish_date": "Sat, 04 Oct 2025 09:30:00 +1000",
        "category": "finance",
        "authors": [
            "Julia Baird"
        ],
        "text": "It took micro-seconds before Nicole Kidman, the ginger-haired starlet from Longueville, was blamed for the break-up of her marriage to Keith Urban. One sexist trope after the other was trotted out before we were sure of what had happened, before she’d even filed for divorce, before the pair’s publicity managers could even subtly background journalists.\n\nNicole Kidman has filed for divorce from Keith Urban, her husband for the past 19 years. Credit: Dionne Gain\n\nShe had worked too hard. She was too sexual. Her ambition was too much. She kissed younger men in her movies. She travelled. An “intense work schedule put strain on marriage”.\n\nWhat could any of us possibly know about the end of this 19-year union, which has produced two daughters and seemed, in public at least, to be intimate and loving? We can sure guess, though, and oh, how we all love to leap about between suspicion, suggestion and projection when a famous person separates from a partner.\n\nThe theories which are quickest to emerge are the most revealing about what we consider to be acceptable behaviour of men and women, or the kind of behaviour that might repel or expel a spouse. Of course, Kidman’s success, which has been enduring and extraordinary, would be the first possible contributing factor to be dragged under our collective microscope.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/nrl-grand-final-gives-us-no-one-to-love-or-hate-and-that-s-not-very-rugby-league-20251003-p5mzuj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NRL grand final gives us no one to love or hate. And that’s not very rugby league",
        "publish_date": "Sat, 04 Oct 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "First, though, good on Melbourne and Brisbane for swamping Sydney’s hotels with much-needed business. The streets are flowing with XXXX and Melbourne Bitter. Happy holiday faces have arrived for a long weekend to shove it up the big smoke and then go home again, satisfied that Brisbane and Melbourne are so much better. Like much about this grand final, the result is win-win, or, from another perspective, lose-lose. It’s not that the Storm or the Broncos are objects of differentiated hatred. If only they were. I know plenty of Sydney league fans who hate the Storm, but they also hate the Broncos. It’s not the Storm or the Broncos; it’s the Storm and the Broncos. Whatever feelings exist for them come from the same place – the spleen, maybe the gall bladder. They’re both creations of News Corp to disrupt the old Sydney order – rich kids born on third base.\n\nBoth were built on greenfield sites, and both have prospered without the burden of ancestral feuds and ancestral toilet facilities. Will Warbrick and the Storm celebrate a try in their preliminary final win over the Sharks, and a berth in yet another grand final. Credit: Getty Images The biggest challenges for Brisbane and Melbourne have been nouveau-riche challenges: warding off hubris and keeping a lid on the sheer glee of being the only teams in big cities. The clubs are like irritating cousins you only see at Christmas, and nowadays, because they’ve done better in life than the rest of the family, Christmas is always at their place. In Queensland. Although Broncos-Storm is Queensland versus Queensland, that’s not the thing that pairs them in rugby league emotions. Neutrals would like to see the Cowboys, Dolphins or Titans in the grand final.\n\nWe’re not anti-Queensland; we’re anti-success. The feeling is pure envy, the core and honourable driving force of rugby league for 117 years. Brisbane celebrate their preliminary final escape against Penrith. Credit: Getty Images Is it hatred, or just … meh? Hatred would add interest. But many of us would have to reach too deep into our spleen or gall bladder to find more than indifference towards the Storm and the Broncos. They’re both really good to watch, part of a generation that has lifted rugby league to unprecedented popularity. Reece Walsh and Cameron Munster are rugby league geniuses. Payne Haas is what you’d get if you could breed Greg Inglis with Glenn Lazarus. Adam Reynolds, Ezra Mam and Ben Hunt versus Jahrome Hughes, Ryan Papenhuyzen and Harry Grant.\n\nWhat’s not to love? Or, from a different perspective, what’s not to hate? And this is the problem: if you love/hate Walsh, you also almost certainly love/hate Munster. Coaches are (too) often the dominant personalities in rugby league, but Craig Bellamy and Michael Maguire are related through the same Canberra family, winners with a gift for creating siege mentalities. Melbourne coach Craig Bellamy is an angry man. What’s not to love? Credit: Getty Images Bellamy. After all these years, who has the stamina to hate him? Watching him chew off his lips before making an explosive dash for the back of the coaching box as if he had business in the conveniences, somewhere, we stopped laughing at him and started laughing with him. No, that’s not right – he’s not laughing. But he’s a lovable old ball of angst, who has moved from rugby league’s arch antagonist to its national treasure. He is easily the best coach in any sporting code in Australia, but he doesn’t look like he enjoys a minute of it. How can you not like that?\n\nAs for Maguire, his emotional ambition is also to feel some sweet relief from the pain. His last three years with New Zealand, NSW and Brisbane have proved one thesis beyond doubt: the results at Wests Tigers when he was there were not the coach’s fault. In fact, the Tigers would have been, and have been, worse without Maguire. If a coach’s ability is a quotient of results divided by available talent minus club politics, Maguire belongs up with Wayne Bennett, Ivan Cleary, Ricky Stuart and Des Hasler in the sub-Bellamy class of today’s successful rugby league coaches. Loading After such an exciting season, Melbourne v Brisbane doesn’t offer much emotional investment for the neutral, but it does promise a rugby league exhibition. And here’s the moral of the story. In a code that constantly outdoes itself and becomes more entertaining each year, there’s nothing to expect and nothing to barrack for on Sunday except a great game. And no stress.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw7-bournemouth-vs-fulham-20251004-p5n00u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW7: Bournemouth vs Fulham",
        "publish_date": "Sat, 04 Oct 2025 09:06:41 +1000",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW7: Bournemouth vs Fulham\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/swift-reveals-engagement-details-and-most-personal-song-from-new-album-20251003-p5mzu4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Swift reveals engagement details and most personal song from new album",
        "publish_date": "Sat, 04 Oct 2025 09:03:12 +1000",
        "category": "sports",
        "authors": [
            "Michael Idato"
        ],
        "text": "Accustomed as she is to breaking the internet, with new album drops and engagement announcements, Taylor Swift’s appearance on The Graham Norton Show set social media alight as the 35-year-old pop star showed off her sparkling engagement ring.\n\nAsked about the “new bit of finger jewellery” given to her by fiance American footballer Travis Kelce, Swift described it as “the hardware upgrade”. The ring came with a price tag reported to be between US$700,000 and US$1 million.\n\nSwift confirmed her engagement to the Kansas City Chiefs tight end five weeks ago after two years of dating, with an Instagram post carrying the caption: “Your English teacher and your gym teacher are getting married.” The post was liked 37.5 million times.\n\nLoading\n\n“He really crushed it when it came to surprising me,” Swift told Norton. “We had filmed a podcast episode [for Kelce’s podcast New Heights] and we filmed the podcast for about three or four hours, meanwhile behind his house he was having the back garden turned into this,” she said, gesturing to the image, overflowing with flowers.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/uk-comedy-icon-dame-patricia-routledge-dies-aged-96-20251004-p5n00r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "UK Comedy icon Dame Patricia Routledge dies aged 96",
        "publish_date": "Sat, 04 Oct 2025 08:20:05 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "UK Comedy icon Dame Patricia Routledge dies aged 96\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/left-the-reno-too-late-the-micro-updates-to-refresh-your-home-before-christmas-20251003-p5mzud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Left the reno too late? The micro updates to refresh your home before Christmas",
        "publish_date": "Sat, 04 Oct 2025 08:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Robyn Willis"
        ],
        "text": "“You can change the tapware and update chrome tapware to brass,” she says. “There are certain finishes that are quite dated. You could swap it out for something in a beautiful bronze finish. Even going from a chrome finish to a brushed nickel will update the bathroom.” Loading If your bathroom tiles are dated or you don’t like them, Reynolds says there are products such as microcement, a latex polymer and stone mix, that can be applied over tiles to give a concrete finish. “It has a beautiful plaster finish,” she says. Interior designer Michelle Viret says for an even more dramatic result in the bathroom, a bold wallpaper can have a transformative effect, although if you are unfamiliar with wallpapering, it’s a job best left to professionals.\n\n“If you have tiling on a couple of walls, wallpaper can have a massive impact,” she says. “But you will need vinyl-backed wallpaper to withstand water in the room.” Go bold with wallpaper in the bathroom, such as this custom-designed vinyl-backed paper, suited to wet areas. Credit: Michelle Viret Design In soft traffic areas like bedrooms, Reynolds says replacing worn carpets can be done while you’re at work. “Old carpets are pretty awful and it’s really nice [to upgrade] if you have kids playing on the floor,” she says. Time to DIY In truth, tracking down any trades at this time of year may be a struggle. Interior designer Andrew Waller says trades such as joiners and even upholsterers have generally closed their books for the year by now. Instead, he says, it might be worth brushing up on your DIY skills and pulling out the tools.\n\nIf you’re in the market for fittings or fixtures such as lights, shelving or even furniture, he says it pays to stay close to home. Loading “Local manufacturers are your friend if time is short,” he says. “They might be more expensive, but you don’t have to worry about shipping. Some suppliers want to do their shipping all in one go, which can slow down deliveries.” Aside from shopping your way to a beautiful home before Christmas, perhaps the most accessible task is to pull out the brushes and the drop sheets and update your chosen rooms with a fresh coat of paint. “Some people like to refresh a space per season; that’s something that will give a space an instant lift,” Waller says.\n\nIf you’re handy with the tools, Reynolds says you can update the kitchen with a new splashback and new cupboard doors. “One thing that is super easy is changing the kitchen cupboard cabinet door fronts,” she says. “You can replace handles and cabinet door fronts and the kitchen looks new. A refresher of your door fronts and some really beautiful handles can have a huge impact.” If the kitchen splashback looks tired and you don’t have the time or the skills to replace it, Reynolds says for an instant lift, you can adhere a piece of mirror, cut exactly to size by a glazier, over the existing tiles. Made-to-measure window coverings can screen an unsightly view or manage heat penetration. They are also within the DIY realm. Credit: Tuiss Blinds Online Window coverings such as made-to-measure roman blinds or sheer floor-to-ceiling curtains can still be ordered for delivery before Christmas and are suitable for DIY installation. They can also screen an unsightly view or offer some protection from summer heat penetrating the house.\n\n“Curtains add a softness that is stunning and a relief from the harshness of glass,” she says. “Because it is summer, you can leave the door open and let the curtain billow. It can transform a room, and it’s a really easy change to make.” Do the odd jobs Pressure wash the exterior, fix or replace broken skirting boards, oil the deck. In short, it’s time to tackle all those tasks you’ve been putting off over the winter. When in doubt, Reynolds says, it’s worth assessing your home as guests might do, starting with the front door. “The sight line from the door instantly sets the tone of the space in the first three seconds – and you never get them back,” she says. “Add some greenery to the space with plants to create softness. “The key to the micro-renovation is to make it easy, fun and achievable. And make it realistic. It’s pre-Christmas, so don’t add any more stress.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/dashcam-footage-shows-the-horrifying-moment-chopper-crashes-in-sydney-s-south-west-20251004-p5n00o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dashcam footage shows the horrifying moment chopper crashes in Sydney’s south-west",
        "publish_date": "Sat, 04 Oct 2025 07:30:24 +1000",
        "category": "finance",
        "authors": [],
        "text": "Dashcam footage shows the horrifying moment chopper crashes in Sydney’s south-west\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/sean-combs-sentenced-to-four-years-and-two-months-20251004-p5n00n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sean Combs sentenced to four years and two months",
        "publish_date": "Sat, 04 Oct 2025 07:29:31 +1000",
        "category": "finance",
        "authors": [],
        "text": "Sean Combs sentenced to four years and two months\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/two-bodies-found-in-victoria-s-high-country-20251004-p5n00m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Two bodies found in Victoria’s high country",
        "publish_date": "Sat, 04 Oct 2025 07:28:58 +1000",
        "category": "finance",
        "authors": [],
        "text": "Two bodies found in Victoria’s high country\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/celebrity/diddy-jailed-for-four-years-fined-757-000-for-sex-charges-20251003-p5mzty.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Diddy jailed for four years, fined $757,000 for sex charges",
        "publish_date": "Sat, 04 Oct 2025 07:14:01 +1000",
        "category": "finance",
        "authors": [
            "Michael Idato"
        ],
        "text": "Hip-hop star Sean “Diddy” Combs has been sentenced to four years and two months in prison. Combs was also fined US$500,000 ($757,000) and will be subject to five years of supervised release when his sentence is served.\n\nThe sentence was handed down in New York after an eleventh hour plea for leniency from Combs’s defence attorney Nicole Westmoreland. “Mr Combs is not larger than life, he’s just a human being,” Westmoreland said. “He’s just a man and he’s made some mistakes. He has flaws like we all do. Your honour, he gets it, plain and simple.”\n\nAn impression of Sean “Diddy” Combs in court during his trial in July. Credit: Elizabeth Williams via AP\n\nDespite that, Judge Arun Subramanian said the court had to consider all of Combs’s history. “A history of good works can’t wash away the record in this case, which shows that you abused the power and control over the lives of women who you professed to love,” he said.\n\nIn sentencing Combs to 50 months in prison, Subramanian said he was inclined to give Combs a “meaningful” sentence, but that the 11-year sentence sought by the prosecution was “not reasonable”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/what-every-aussie-needs-to-know-before-visiting-the-usa-20251004-p5n00i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What every Aussie needs to know before visiting the USA",
        "publish_date": "Sat, 04 Oct 2025 07:08:48 +1000",
        "category": "finance",
        "authors": [],
        "text": "What every Aussie needs to know before visiting the USA\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/ski-tzar-grollo-goes-off-piste-in-east-melbourne-20251001-p5mzdk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ski tzar Grollo goes off-piste in East Melbourne",
        "publish_date": "Sat, 04 Oct 2025 06:00:00 +1000",
        "category": "finance",
        "authors": [
            "Nicole Lindsay"
        ],
        "text": "Early last year, the Grollos bought Hotham Airport, near Dinner Plain, for $6.7 million and have since lodged plans to build a worker accommodation hub on the airport land. The company has also taken over Bogong Village, between Mount Beauty and Falls Creek, to redevelop another worker accommodation project. However, they are not in the running to buy the Allen Government’s 99-year operating leases for Mount Baw Baw and Lake Mountain. In the Melbourne CBD, the Grollos own half a block of King Street down the hill from the twin-tower Rialto office, which Rino (and his brother Bruno) built in the 1980s. They jointly own the Rialto with GIC, Singapore’s sovereign wealth fund. GIC bought out the Kuwaiti-controlled St Martins Properties for $644 million in 2020. Whac-A-Mole on Flinders Lane No sooner had the owner of blue chip office tower 101 Collins Street dusted off one Flinders Lane building and ensured its money-making views were protected, when another building started flaunting its height potential.\n\nA three-level property at 101’s back door, on the corner of AC/DC Lane, is up for sale just six weeks after its neighbour at No.107-109 sold for $14.8 million – with restricted height limits. The owners of 103-105 Flinders Lane are likely to make about $15 million for the three-storey, 1186-square-metre warehouse which they bought for all of £67,000 in 1956. 103 Flinders Lane is on the corner of AC/DC lane. The Commonwealth Super Fund, which owns 101 Collins Street, had originally bought No.107-109 for $15 million in 2015 to stop a 43-level tower obscuring the views of top law firms and investment banks. The fund ensured the longevity of those views by limiting development heights on the building. Now it’s back to square one in the game of Whac-A-Mole that it plays to keep the neighbourhood in check.\n\nThe fresh threat is on a 332-square-metre piece of land with a ground floor café, upstairs office and a basement nightclub leased to Bar Bambi. That basement space, which opens onto the lane, was the original site of the Cherry Bar (since relocated to Little Collins Street) and the motivation for renaming Corporation Lane as AC/DC Lane 21 years ago. Cushman & Wakefield’s Oliver Hay, Daniel Wolman and Leon Ma have the listing, with Alexander Robertson & Co.’s Kristian Peatling and Warwick Bramich. Artist’s impression of a potential tower added to 103 Flinders Lane. Speaking of AC/DC, next month the City of Melbourne will be throwing a party to celebrate 50 years since the band played Long Way to the Top on the back of a flat-bed truck through Melbourne’s streets. There will be a lighting installation in the lane and a big gig at Federation Square.\n\nNew permits The old Exploration Hotel, which featured in last week’s column, could be getting a new neighbour at its rear. The razed site at 9-11 Exploration Lane received a permit this week for an eight-storey office building rising about 31 metres. The 170-square-metre site, owned by retirement village developer Knowles Group, had been earmarked for a 130-room hotel in a joint venture with the late Jonathan Hallinan. In 2018, the group tried to sell the land, with a permit for a 34-storey hotel, for about $50 million, but there were no takers. The Knowles Group paid $2.15 million for the land in 2010.\n\nWash-up from Lion’s collapse The Lion Property Group collapse is washing its way through the market with a block of flats in South Yarra selling for $6.1 million – 25 per cent less than what it fetched in 2023. Records show Drake Developments’ Colin Drake settled 1-17 Adams Street, South Yarra last month, just as the $130 million Lion Ponzi scheme totally unravelled. Drake said he was planning to build six townhouses on the 774-square-metre site. They will replace the 14 vacant 1950s-era flats near the corner of Toorak Road facing Fawkner Park. 1-17 Adams Street, South Yarra.\n\nThe new plan will also replace the costly four-level seven-unit design, which Lion acquired in 2023. Fitzroys’ Lewis Waddell, Ben Liu and David Bourke handled the deal. South Melbourne auction Former Carlton & United Breweries boss Peter Filipovic and his investment partners Dave and Merv Shannon are offloading a property which came as part of their $20 million Bells Hotel purchase. The 155 -square-metre shed around the corner at 52-54 Tope Street is going to auction next week and is likely to fetch about $1.7 million.\n\nThe single-storey warehouse had been used as extra function space for the pub. Stonebridge agents Dylan Kilner and Max Warren have the listing, but declined to comment on the property. 268 Park Street, South Melbourne. Up for auction on the same day is the freehold of the Park Street Pasta & Wine at 268 Park Street on the corner of Perrins Street. Park Street Pasta & Wine has recently renewed its five-year lease, which comes with two five-year options and returns $95,000 a year in rent. That puts its likely price at more than $1.8 million. Stonebridge’s Nic Hage, Ian Lam and Kilner are handling enquiries, but declined to comment. Records show the property last changed hands in 2016 for $1.78 million. The vendor at that time was the late nightclub owner Darren “Razzle” Thornburgh, who died shortly after in Barmah, Victoria.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-everyone-loves-a-ghost-train-but-why-do-we-love-being-scared/u32c8730l",
        "title": "INTERVIEW: Everyone loves a ghost train: but why do we love being scared?",
        "publish_date": "Fri, 3 Oct 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-could-a-first-nations-voice-help-tackle-stubborn-public-health-challenges/9o1r5o95q",
        "title": "INTERVIEW: Could a First Nations voice help tackle stubborn public health challenges?",
        "publish_date": "Fri, 3 Oct 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/yoga-study-older-people-falls/s4gqz30zo",
        "title": "700 Australians were recruited for a yoga study. What researchers found surprised them",
        "publish_date": "Fri, 3 Oct 2025 20:55:12 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When Margaret Kirkwood broke her hip falling up the stairs of her home in Sydney, she could have become a statistic: falls are the leading cause of hospitalisation and injury deaths in Australia.\n\n\n\n\n\nInstead, the 83-year-old made a remarkable recovery. The day following her surgery, she was standing. Less than two weeks later, she was walking with the aid of a single crutch.\n\n\n\n\n\n\"The doctor said, 'You're a textbook case'. Your body is in fantastic condition,\" she said.\n\n\n\n\n\nKirkwood credited her recovery to her yoga practice.\n\n\n\n\n\nFor the past 25 years, she has attended Iyengar Yoga classes twice a week.\n\n\n\nKirkwood said it taught her about her body and has given her strength, which she notices while moving about the house and doing chores.\n\n\n\n\n\n\"If I weren't strong, I would have had a really bad fall,\" she said.\n\n\n\n\n\nHowever, a surprising new study from The University of Sydney has found that Iyengar yoga — a distinct form of yoga that uses props and is popular among older people — should not be recommended as a fall prevention measure.\n\n\n\n\n\nIn the biggest clinical trial investigating the effects of yoga on falls, researchers found that while yoga improved self-confidence and mobility, older people who practised yoga experienced a significantly higher incidence of falls.\n\n\n\nAn unexpected result\n\nThe study recruited 700 people over the age of 60 and invited them to participate in two yoga classes each week for a year.\n\n\n\n\n\nHalf of the cohort did Iyengar yoga, while the other half did seated breathing and stretching. Researchers then tracked the number of falls experienced by both groups over the course of that year.\n\n\n\nThere were limitations to the study, including the COVID-19 pandemic, which forced the classes online. Source: Supplied / Sue-Ellen Kohler Anne Tiedemann, lead researcher and professor of physical activity and health at The University of Sydney, said the results were \"the opposite of what we expected\".\n\n\n\n\n\n\"We have a lot of evidence that exercise, challenges, and balance can prevent falls ... We also know that older people like to do yoga, so we thought it's important to know whether it also prevents falls,\" Tiedemann said.\n\n\n\n\n\nThe yoga cohort reported 33 per cent higher rates of falls than the non-yoga-based group, with 276 falls compared to 164. However, there was only a slight increase in the rate of injury, with only 15 per cent of the yoga group and 13 per cent of the non-yoga group experiencing cuts, grazes, dislocations, sprains, fractures, or brain injury as a result of the fall.\n\n\n\n\n\n\"It's a combination of the environment, your behaviour, and your physiology which determines if you fall or not,\" Tiedemann explained.\n\n\n\n\n\n\"In our study, we identified that people who did the yoga-based exercise showed an improvement in their balance confidence ... So we think what has happened is that people have felt more confident in their abilities, and there was also an indication that they moved about more.\"\n\n\n\n\n\nTiedemann pointed out that the trial had limitations. Initially, the classes were held face-to-face, but when COVID-19 emerged, they transitioned online.\n\n\n\n\n\n\"People might not have pushed themselves as far as they would if they had an instructor in the room,\" Tiedemann said.\n\n\n\nYoga can't 'prevent falls forever'\n\nJean Leow runs Yoga Ink, teaching Iyengar to seniors in Sydney's south and in aged care facilities across the city.\n\n\n\n\n\n\"I love working with seniors. When they come to a class, they really take it on and I'm surprised by how well they adapt,\" she said.\n\n\n\nJean Leow teaches Iyengar classes customised for the needs of her senior students. Source: Supplied / Jean Leow Leow said that while she appreciated the study looked at the effects of yoga over a whole year, rather than just a few weeks, she stressed it's up to the instructor to ensure the classes are tailored to the needs and abilities of each student if they want to see the benefits.\n\n\n\n\n\n\"I can't emphasise enough the amount of customisation we as teachers have to be accountable for,\" she said.\n\n\n\n\n\nSue-ellen Kohler, who has been a yoga instructor for 30 years and teaches at Black Lotus in Sydney's inner-west, expressed concern that having the classes online may have influenced the results.\n\n\n\n\n\n\"The teacher needs to actually look at how the body is working and how the body is using its muscles. Online, you don't get any of that. They're just going to be making shapes,\" she said.\n\n\n\n\n\nLeow also said it's important to recognise the purpose of yoga isn't to \"prevent falls forever\".\n\n\n\n\n\n\"The aim is to help the older person understand what to do when they do fall, and how to correct themselves so they can arrest it and rebalance. That means they may still fall, but they're not going to hurt themselves in the process,\" she said.\n\n\n\n\n\n\"For my own students, some of them are avid travellers, some are gardeners. How do they recover from the things they love doing and protect their bodies enough to sustain their lifestyle?\"\n\n\n\nPreventing falls\n\nEvery day, 14 Australians aged 65 and over will die from a fall, according to the Falls, Balance and Injury Research Centre at Neuroscience Research Australia. A further 364 people will be hospitalised due to a fall each day.\n\n\n\nIn June, the Australian Commission on Safety and Quality in Health Care updated its falls guidelines for the first time since 2009. It emphasised the benefits of exercise for older people, recommending that two to three hours of exercise per week is crucial in preventing falls. It stated that the primary targets should be balance, mobility, and strength.\n\n\n\n\n\nTiedemann said for people whose main aim is fall prevention, there is evidence to show that activities like Tai Chi and classes that focus on functional balance training can be effective.\n\n\n\n\n\n\"I would not be promoting this type of yoga program for falls as the outcome, but it did have other benefits. People were more active and more likely to reach the goals they set,\" she said.\n\n\n\n\n\nShe pointed out that some of the participants in the study enjoyed yoga so much they continued after the program ended.\n\n\n\n\n\nKirkwood, who is still recovering from her fall, believes yoga is still \"perfect\" for her.\n\n\n\n\n\n\"I wouldn't be like this without Iyengar. I've got a really good teacher.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/andrew-hastie-quits-liberal-front-bench-over-immigration-row/ykj28wrv4",
        "title": "Andrew Hastie quits Liberal front bench over immigration row",
        "publish_date": "Fri, 3 Oct 2025 09:28:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Outspoken MP and Liberal leadership aspirant Andrew Hastie has quit the opposition front bench in a move that will likely further destabilise Sussan Ley's control over the beleaguered party.\n\n\n\n\n\nThe Western Australian MP said he resigned from shadow cabinet after Ley made it clear he would not lead the coalition's response to immigration matters despite his role as opposition home affairs spokesman.\n\n\n\n\n\n\"On this basis, I made the decision that I was not able to continue in this role and remain silent on immigration,\" Hastie said in a statement on Friday evening.\n\n\n\n\n\n\"It is a well-established standard in the Westminster system that, if a member of the shadow cabinet is unwilling to live by the convention of solidarity, they must depart to the backbench.\n\n\n\n\"Therefore, out of respect for Sussan's leadership, I am resigning from the frontbench.\"\n\n\n\n\n\nBut in a statement released shortly after Hastie's, the opposition leader appeared to contradict his version of events.\n\n\n\n\n\nHe told her in a phone call that he \"would be unable to comply\" with the \"longstanding and well-understood requirement\" of shadow cabinet solidarity and would therefore be resigning his position, Ley said.\n\n\n\nLey said Hastie told her he could not comply with shadow cabinet solidarity, but did not raise any policy matters. Source: AAP / Lukas Coch \"Mr Hastie did not raise any matters relating to policy on this call,\" she said.\n\n\n\n\n\nVictorian senator James Paterson will serve as acting opposition spokesman for home affairs ahead of formal changes to shadow cabinet.\n\n\n\n\n\n\"It is disappointing that this crucial opposition portfolio has been left vacant today,\" Ley said.\n\n\n\n\n\nHastie's exit comes after he publicly pushed for net-zero emissions goals to be dropped and migration to be curbed, as well as touting himself as a future leadership aspirant.\n\n\n\n\n\nAmong a series of social media posts linking immigration to housing shortages, Hastie said: \"We're starting to feel like strangers in our own home.\"\n\n\n\n\n\nLiberals have privately expressed frustration at being forced to talk about themselves rather than attack Labor or build voter support, fearing they're losing more momentum after a dire May election result.\n\n\n\n\n\nHastie said Ley deserved the opportunity to lead \"unencumbered by interventions from shadow cabinet colleagues\" as the coalition built out its policy platform for the next election.\n\n\n\nLISTEN TO Andrew Hastie denies bid for Liberals leadership SBS News 01:02 English\n\n\"I am grateful for the opportunity to have served as the shadow home affairs minister and I wish Sussan and the shadow cabinet every success in this term,\" he said.\n\n\n\n\n\nHastie previously threatened to resign from the opposition frontbench if the emissions policy was retained, although he did not make the same stand under former leader Peter Dutton.\n\n\n\n\n\nThe 43-year-old has garnered support from Senator Jacinta Nampijinpa Price, who was removed from the shadow ministry for failing to back Ley's leadership and not apologising for comments singling out the Indian community.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/oil-prices-tumble-to-4-month-low-as-asx-edges-closer-to-record-high/ee4eoyhss",
        "title": "Oil prices tumble to 4 month low as ASX edges closer to record high",
        "publish_date": "Fri, 3 Oct 2025 07:30:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/everything-you-need-to-know-about-the-2025-nrl-and-nrlw-grand-finals/fdj88sefp",
        "title": "Everything you need to know about the 2025 NRL and NRLW grand finals",
        "publish_date": "Fri, 3 Oct 2025 07:06:15 +0000",
        "category": "sports",
        "authors": [],
        "text": "It's set to be a big weekend for rugby league fans, with the NRL and NRLW grand finals set to take place on Sunday.\n\n\n\n\n\nThe NRL grand final will see teams from two states face off, with the Melbourne Storm and Brisbane Broncos battling it out for the win.\n\n\n\n\n\nIn the NRL women's premiership, the Broncos will face off against the Sydney Roosters.\n\n\n\n\n\nHere's everything you need to know.\n\n\n\nWhat time is the NRL grand final 2025?\n\nBoth games will be played on Sunday 5 October.\n\n\n\n\n\nThe women's grand final will start at 4pm AEDT.\n\n\n\n\n\nLater that evening at 7.30pm AEDT, the men's grand final will kick off.\n\n\n\n\n\nUpcoming On Demand Koori Knockout 2025 series • sport series • sport\n\n\n\n\n\nKeep in mind that NSW will be in daylight saving time on Sunday , so timings might be slightly different depending on where you are in the country.\n\n\n\nHow to watch the NRL grand final\n\nThe NRL and NRLW grand finals will be broadcast live on Channel 9 and 9Now.\n\n\n\nWhat time is the pre-game entertainment?\n\nIt'll be a busy day on Sunday, with festivities kicking off in Sydney's Stadium Australia at 1pm and extending long into the night.\n\n\n\n\n\nTeddy Swims will headline the NRL grand final entertainment, which will start at 6.30pm, an hour before the men's match starts.\n\n\n\n\n\nHere's the runsheet of the day, all in AEDT:\n\n\n\n\n\n- 1:00pm — Gates open at Stadium Australia\n\n\n\n- 1:20pm — State Championship kick-off\n\n\n\n- 3:20pm — NRLW grand final pre-game show\n\n\n\n- 4:00pm — NRLW premiership grand final kick-off\n\n\n\n- 6:30pm — NRL grand final pre-game entertainment\n\n\n\n- 7:30pm — NRL premiership grand final kick-off\n\n\n\nWho's in the NRL and NRLW grand finals?\n\nThe NRL men's grand final will see the Brisbane Broncos and Melbourne Storm face off against each other.\n\n\n\n\n\nIt'll be the first time the teams have been in a grand final together since 2006, when the Broncos won 15-8.\n\n\n\n\n\nThis season, each team won one game against each other, making it a pretty even playing field.\n\n\n\nStorm came second in the minor premiership this year, while the Broncos finished fourth.\n\n\n\n\n\nIn the women's competition, it'll be the Sydney Roosters and the Brisbane Broncos fighting for the NRLW title.\n\n\n\n\n\nThey finished first and second respectively this season, with the Roosters unbeaten in their 11 matches.\n\n\n\n\n\nThe Broncos' only loss this season was to the Roosters.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/footy-culture-and-so-much-more-welcome-to-the-koori-knockout/ardx4qeqz",
        "title": "Footy, culture, and so much more: welcome to the Koori knockout",
        "publish_date": "Fri, 3 Oct 2025 04:32:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe contribution of Indigenous people to Australian life is seen through sport perhaps more prominently than in any other field.\n\n\n\n\n\nAnd, within sport, Indigenous Australians are particularly prominent through rugby league.\n\n\n\n\n\nIt makes a gathering of Indigenous Australians based around rugby league particularly poignant, significant, and looked forward to.\n\n\n\n\n\nWelcome to the Koori knockout.\n\n\n\n\n\nThe idea of gathering the best Indigenous rugby league talent from around New South Wales first came in the 1960s, during a meeting of six young Indigenous men at the Clifton Hotel in the inner-Sydney suburb of Redfern.\n\n\n\n\n\nThe first tournament was held in Redfern in 1971 on the New South Wales Labour Day long weekend in October, featuring seven teams.\n\n\n\n\n\nMore than half a century later, 170 junior and senior teams, both men's and women's, will compete this weekend in Tamworth, in north-western New South Wales.\n\n\n\n\n\nIt's community-run, community-led.... and now thought to be the largest annual gathering- sporting or otherwise- of Aboriginal people in Australia.\n\n\n\n\n\nAnd just how special it is, is not lost on the participants.\n\n\n\n\n\nRonald Griffiths is the coach of the New Zealand Warriors women's team in the National Rugby League.\n\n\n\n\n\nHe's coaching the Newcastle Yowies in this year's knockout.\n\n\n\n\n\nHe says the tournament is a pathway to success for Indigenous folk- both in sport, and in broader life.\n\n\n\n\n\n\"It's a really important time of the year for our people. And we spoke about the founding members previously. And I think the boys alluded to the fact that when this started...there's been so many who've been able to leverage this and go on to great things- run their own businesses... people that have gone on to play NRL. And you look at it now- 170 teams participating this weekend.\"\n\n\n\nSouth Sydney Rabbitohs playmaker Cody Walker is one of the many who've gone on to make it in the N-R-L, even playing State of Origin for New South Wales.\n\n\n\n\n\nHe says one of the proudest achievements of his career still is being a winner at the Koori knockout.\n\n\n\n\n\n\"Yeah I am- 2011 in Bathurst, which was a huge highlight of my career. And... gunning for another over the next couple of years, which will hopefully happen.\"\n\n\n\n\n\nHe won't be playing this year, but many NRL stars will be there, turning out for community teams.\n\n\n\n\n\nThose who currently have the right to call themselves men's champions are the Walgett Aboriginal Connection, whilst the Redfern All Blacks are the senior women's champs.\n\n\n\n\n\nWalgett is led by former NRL player... now prominent boxing promoter... George Rose.\n\n\n\n\n\nThey've copped a tough draw in Group C of the men's competition.\n\n\n\n\n\nNot that Rose minds.\n\n\n\n\n\n\"I think it must be the tough draw that works in our favour, so I think it's the best thing we could have had. If you want to win the knockout, you've got to play the best teams anyway. I think we enjoy tough games, we enjoy hard games. So I'm excited to be here, I'm excited to be a part of the 53rd knockout.\"\n\n\n\n\n\nWalgett won in 2023 as well, making this year their attempt at a hat-trick of titles.\n\n\n\n\n\nThat's obviously an aim... but, as thousands gather to celebrate sport, identity, and culture... he knows what's truly important.\n\n\n\n\n\n\"We'll give it our best crack. We'll give it a red-hot crack. But it's going to be tough. The target on our back is as big as it can possibly get. Nobody wants to see us win it three in a row. We'd love to do it. Nobody wants to see it. So, every team that we play, doesn't matter who it is, it's going to be a hard game. Everyone's going to be gunning for us. But we love it. We play hard. We shake hands after it. If we win, we win. If we don't... thanks for coming to Tamworth.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/christian-petracca-chooses-gold-coast-now-it-s-time-to-make-the-trade-20251003-p5mzrz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Maybe a few more 16-disposal games might get you there’: McRae’s cheeky Daicos Brownlow quip",
        "publish_date": "Sat, 04 Oct 2025 10:52:38 +1000",
        "category": "sports",
        "authors": [],
        "text": "On a special night for Cameron at Crown Palladium, he also took home the Darren Millane Award as the Pies’ best clubman. McRae spoke about his big man’s impact. “Darcy has played a pivotal role in our side this year, and it’s fantastic to see him get the recognition he deserves tonight,” he said. “Stepping into a leadership role ahead of the season, Darcy has not only set high standards for himself, but he is constantly supporting and mentoring his teammates to ensure everyone in our program is committed to growing and improving.“\n\n– Russell Bennett and Scott Spits E.W. COPELAND TROPHY TOP 10 1. Darcy Cameron 328 votes\n\n2. Nick Daicos 315\n\n3. Isaac Quaynor 303\n\n4. Jamie Elliott 298\n\n5. Harry Perryman 292\n\n6. Josh Daicos 288\n\n7. Steele Sidebottom 265\n\n8. Scott Pendlebury 253\n\n9. Ned Long 238\n\n10. Jack Crisp 228\n\nMarshall hollers for Geelong Peter Ryan St Kilda ruckman Rowan Marshall has formally requested a trade to Geelong just hours after the Saints landed free agent Blues ruckman Tom De Koning on the first day of the free agency period. Marshall has been on the Cats’ radar for some time as they look to bolster their ruck stocks following their grand final loss to the Brisbane Lions. Rowan Marshall, here celebrating a goal against the Cats in 2024, has requested a trade to Geelong. Credit: Getty Images\n\nThe 29-year-old still has two years to run on his contract, but his position has been in doubt at the Saints since they made their huge play to recruit De Koning. The Cats have pick No.18 in the national draft which may be enough to secure Marshall who finished sixth in the Saints’ best-and-fairest this year. Teammates De Koning and Jack Silvagni joined St Kilda from Carlton as free agents on Friday morning, with the Blues gaining a top-10 pick in next month’s national draft for losing De Koning, and another at the end of the first round for losing Silvagni. The duo were among the first players to officially exercise their rights when the free agency window opened, according to the AFL. The Blues did not match St Kilda’s monster eight-year contract offer to restricted free agent De Koning and will receive pick No.9 as compensation.\n\nIn a statement, Carlton list boss Nick Austin said: “Multiple first-round selections is a great position for us to be in ahead of November’s draft, and we will look to maximise these assets accordingly in line with our overall list management strategy.” Meanwhile, De Koning, in a Saints statement announcing his arrival at the club, said he was “absolutely pumped” to be joining Ross Lyon’s side. “From the outside you can see how tight this playing group is,” he said. “There’s a real determination to get the best out of themselves and each other, and I want to contribute to that. “Players like Nasiah Wanganeen-Milera, Marcus Windhager, Mitch Owens and a whole group of emerging players are showing what can be achieved when you’re aligned and hungry for success.”\n\nSilvagni declared his intention to join the Saints last month. Loading Austin said the compensation pick they would get for losing Silvagni was welcome. At this stage, it equates to pick No.19, but that number is expected to blow out as clubs insert themselves higher in the draft order by exercising their rights to select players in their academies or father-son selections. Silvagni spoke on Friday, through a St Kilda statement, of his excitement at joining his new club. “I’m incredibly excited to be joining St Kilda and starting this new chapter,” he said.\n\n“The Saints have a strong mix of established talent and exciting young players, and I feel I can add to that with my experience, versatility and drive to compete. “As a young father, this decision is also about building the next stage of my life with my wife Grace and our son Charlie. The opportunity to grow both on and off the field in a stable and supportive environment was really important in making this choice.” He also paid tribute to Carlton. “Carlton will always be part of me. It’s where I grew up, where my AFL career began, and it’s deeply connected to my family and our history in the game,” Silvagni said. “I’ll always be grateful for the experiences I had there and the people who supported me. But now I’m looking forward with full focus on the Saints, and doing everything I can to help us push forward.”\n\nThe Saints also released a statement on Friday addressing the playing future of skipper Jack Steele, who told the club in his exit interview that he planned to step down from the captaincy. The 29-year-old hard-nosed midfielder has played 185 games for the Saints since making the switch from GWS in 2016, but could now be looking for his third football home. “The club called Jack in today for a follow-up discussion about his playing future and to discuss his openness to explore other opportunities,” the Saints said in their statement. “Jack advised the club he wants to stay but is prepared to consider opportunities if presented to him.” Elsewhere, James Worpel, who was also a restricted free agent, has left Hawthorn for Geelong on a four-year deal. The Hawks received an end-of-second-round pick as compensation. Melbourne premiership player Charlie Spargo (North Melbourne) and GWS defender Jacob Wehr (Port Adelaide) are set to find new clubs as unrestricted free agents.\n\nBack-to-back premiers Brisbane are set to strengthen their list with the addition of Essendon ruckman Sam Draper and West Coast forward Oscar Allen. Collingwood forward Brody Mihocek is weighing interest from Melbourne, while Gold Coast midfielder Brayden Fiorini has a choice between Essendon, Port Adelaide and the Suns. The free agency period runs until October 10. The trade period overlaps, running from October 6-15. Petracca wants a Gold Coast sea change Melbourne premiership midfielder Christian Petracca wants to be traded to the Gold Coast Suns.\n\nThe 29-year-old Norm Smith medallist met with the Gold Coast on Thursday after both the Demons and Petracca decided he should explore his options during the trade period. Melbourne midfielders Christian Petracca and Clayton Oliver are both seeking new clubs for 2026, with Petracca keen to land at Gold Coast. Credit: Getty Images A competition source with knowledge of the situation, who preferred to remain anonymous, said Petracca had decided he wanted to join the Suns. Petracca also met with Adelaide on Monday in a hastily arranged catch-up after it only became clear late last week Melbourne wanted to release the champion midfielder who still has four years remaining on his contract.\n\nPetracca was impressed with the pitches presented by both clubs but decided on the Suns after being shown around the Gold Coast facilities on Thursday. The Crows had already baulked at adding an extra season to his current deal, which expires at the end of 2029, and it was clear that a trade between them and Melbourne was going to be difficult. The Suns have more options to do the trade, even with the Demons aiming to clear his contract from their books. Loading The two clubs will now need to make a trade. The Demons’ interest in Suns Sam Flanders and Bailey Humphrey could help them execute a deal. The Suns are open to trading Flanders, who also has interest from St Kilda and Essendon, but not Humphrey, who is contracted until 2028. A photo surfaced online on Friday showing new Demons coach Steven King and club great Nathan Jones flanking Humphrey in Melbourne. Carlton and Collingwood have also been linked to Humphrey.\n\nPetracca has been a champion at Melbourne after being pick No.2 in the 2014 national draft. He had a knee reconstruction before he played his first match but was the key player during the Demons’ surge to a drought-breaking flag in 2021, when he was best on ground in the grand final. He has won two club best-and-fairest awards and is a four time All-Australian. However, he became disillusioned with the club at the end of 2024 after he suffered horrific injuries during the King’s Birthday clash that year. Petracca is regarded as one of the most dedicated and professional players in the game, however he has needed to continually work on his commitment to team aspects as his frustration on field can spill over at times.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/so-long-starbucks-as-americans-tastes-finally-catch-up-to-australia-20250929-p5myop.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "So long, Starbucks, as Americans’ tastes finally catch up to Australia",
        "publish_date": "Sat, 04 Oct 2025 09:55:00 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "What in the World, a free weekly newsletter from our foreign correspondents, is sent every Thursday. Below is an excerpt. Sign up to get the whole newsletter delivered to your inbox.\n\nSydney: Hello from – well, Sydney, actually, where I’m having my first decent coffee in months, on a quick trip home.\n\nBack in Washington, DC, where I now live, the US government isn’t the only thing to have shut down this week. On Saturday, the Starbucks on my street in Dupont Circle closed.\n\nStarbucks shuttered hundreds of stores across the US on the weekend. Credit: Bloomberg\n\nIt was one of hundreds of Starbucks locations that shuttered across the United States last weekend, including nine in the District of Columbia alone, according to USA Today, and more in the surrounding metropolitan area, as part of a $US1 billion ($1.5 billion) restructure.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/hope-fades-for-boys-trapped-in-collapsed-indonesian-boarding-school-20251003-p5mzzz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A shake, a scream, and the wail of ambulances: How a school day turned to tragedy",
        "publish_date": "Sat, 04 Oct 2025 09:54:24 +1000",
        "category": "finance",
        "authors": [
            "Zach Hope",
            "Karuni Rompies"
        ],
        "text": "Singapore/Sidoarjo: Patima was pottering at home in the Indonesian town of Sidoarjo on Monday when at about 3pm she felt a “big shake”.\n\nIt was not an earthquake, for she is familiar with these. Something sounded like it had crashed, she said.\n\nRelatives gather outside the school on Wednesday. Credit: AP\n\nThen, from next door, came a scream on repeat – “The boarding house has collapsed!” In the distance, the wails of ambulances.\n\nThe boarding house is Al Khoziny, an Islamic school in Sidoarjo, about 20 kilometres south of central Surabaya. It is one of the oldest and most respected of its kind in East Java.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/this-is-a-doll-but-she-s-not-made-for-child-s-play-20250901-p5mrjd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This is a doll. But she’s not made for child’s play",
        "publish_date": "Sat, 04 Oct 2025 09:35:43 +1000",
        "category": "finance",
        "authors": [
            "Tim Elliott"
        ],
        "text": "This story is part of the October 4 edition of Good Weekend. See all 14 stories .\n\nEver longed for a baby – without the dirty nappies? Ever dreamt of cradling a newborn – without the broken sleep? Ever pined for a child of your own – without the cost of actually raising one? Well, reborn dolls are for you. Mesmerising, intriguing and for some, deeply creepy, “reborns” are hyper-realistic dolls, painstakingly handcrafted to resemble flesh-and-blood babies, complete with fat rolls, inscrutable expressions and silky hair. They are dolls, but this isn’t child’s play, unless you are David Cronenberg. Dolls like this from Aussie Reborn Supplies are hyper-realistic but come without the realities of bringing up baby. Credit: Annette Kravchenko Lifelike porcelain dolls date back to the 1800s and were regarded as both toys and art, but the “reborn” phenomenon is thought to have first surfaced in the mid-1990s. An article in The New York Times, in 2005, described the market as something of “a secret society”. More recently, in Brazil, a TikTok clip of a woman taking her “newborn baby” to hospital during a “medical emergency” got more than 16 million views and sparked proposals to ban people with such dolls from seeking public healthcare. A cursory search on the internet brings up countless “birthing” videos, where people receiving a new reborn ceremonially unbox the doll, some wrapped in their own silicone “wombs”. There are also reborns with disabilities: I even came across a TikTok clip featuring terrifyingly realistic conjoined twin reborns, complete with a fused skull. Watching the creator wrap the infants’ head in bubble wrap, prior to posting, was pure PTSD. “These twins are heavy!” she says. “I think they weigh, like, nine pounds!”\n\nReborns are popular in Australia, too. “There are many reasons people want a reborn doll,” says Annette Kravchenko, owner of Aussie Reborn Supplies in Queensland. “There are young children who want a lifelike baby of their own, older women who miss being a mum, and women who can’t have kids.” Some people with anxiety, including older women with dementia, find cuddling a “baby” comforting. “Some women have nurturing instincts that they can’t otherwise satisfy,” says Kravchenko. Reborns are often used in therapy to overcome grief or the trauma associated with abuse. “We’ve had women come to us who’ve been told to get a reborn doll by their psychologists,” Kravchenko continues. There are even memorial reborns. “Mothers who’ve lost their babies send us a photo of their deceased child and we make a doll based on that. Same weight, same look. We’ve even made stillborn dolls.” Some clients fill their reborn with the ashes of their late baby. “It can be like visiting the grave for them.” Loading Kravchenko, 50, has been making reborns for 25 years. “It starts with a vinyl or silicone doll,” she says. “We paint them with 20 layers, so it gets that fine, translucent look.” The dolls are then customised, with individually rooted hair (premium mohair or alpaca), ultra-fine painted veins, glass or acrylic eyes in any colour or shape. Tiny scratches can be applied, together with milia, the small, pearly-white bumps that often appear on a newborn’s nose. Glass bead weights can be inserted into the doll according to its “age”, together with breather boxes and heartbeats. A high-end reborn can take between six weeks to make and cost anywhere between a couple of hundred dollars to upwards of $6000. Virtually any facial expression can be reproduced, including crying babies. Not surprisingly, Kravchenko says “sleeping newborns” are the most popular.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/too-successful-too-sexual-too-talented-of-course-split-was-nicole-s-fault-20251003-p5mztw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Too successful. Too sexual. Too talented. Of course split was Nicole’s fault",
        "publish_date": "Sat, 04 Oct 2025 09:30:00 +1000",
        "category": "finance",
        "authors": [
            "Julia Baird"
        ],
        "text": "It took micro-seconds before Nicole Kidman, the ginger-haired starlet from Longueville, was blamed for the break-up of her marriage to Keith Urban. One sexist trope after the other was trotted out before we were sure of what had happened, before she’d even filed for divorce, before the pair’s publicity managers could even subtly background journalists.\n\nNicole Kidman has filed for divorce from Keith Urban, her husband for the past 19 years. Credit: Dionne Gain\n\nShe had worked too hard. She was too sexual. Her ambition was too much. She kissed younger men in her movies. She travelled. An “intense work schedule put strain on marriage”.\n\nWhat could any of us possibly know about the end of this 19-year union, which has produced two daughters and seemed, in public at least, to be intimate and loving? We can sure guess, though, and oh, how we all love to leap about between suspicion, suggestion and projection when a famous person separates from a partner.\n\nThe theories which are quickest to emerge are the most revealing about what we consider to be acceptable behaviour of men and women, or the kind of behaviour that might repel or expel a spouse. Of course, Kidman’s success, which has been enduring and extraordinary, would be the first possible contributing factor to be dragged under our collective microscope.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/nrl-grand-final-gives-us-no-one-to-love-or-hate-and-that-s-not-very-rugby-league-20251003-p5mzuj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NRL grand final gives us no one to love or hate. And that’s not very rugby league",
        "publish_date": "Sat, 04 Oct 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "First, though, good on Melbourne and Brisbane for swamping Sydney’s hotels with much-needed business. The streets are flowing with XXXX and Melbourne Bitter. Happy holiday faces have arrived for a long weekend to shove it up the big smoke and then go home again, satisfied that Brisbane and Melbourne are so much better. Like much about this grand final, the result is win-win, or, from another perspective, lose-lose. It’s not that the Storm or the Broncos are objects of differentiated hatred. If only they were. I know plenty of Sydney league fans who hate the Storm, but they also hate the Broncos. It’s not the Storm or the Broncos; it’s the Storm and the Broncos. Whatever feelings exist for them come from the same place – the spleen, maybe the gall bladder. They’re both creations of News Corp to disrupt the old Sydney order – rich kids born on third base.\n\nBoth were built on greenfield sites, and both have prospered without the burden of ancestral feuds and ancestral toilet facilities. Will Warbrick and the Storm celebrate a try in their preliminary final win over the Sharks, and a berth in yet another grand final. Credit: Getty Images The biggest challenges for Brisbane and Melbourne have been nouveau-riche challenges: warding off hubris and keeping a lid on the sheer glee of being the only teams in big cities. The clubs are like irritating cousins you only see at Christmas, and nowadays, because they’ve done better in life than the rest of the family, Christmas is always at their place. In Queensland. Although Broncos-Storm is Queensland versus Queensland, that’s not the thing that pairs them in rugby league emotions. Neutrals would like to see the Cowboys, Dolphins or Titans in the grand final.\n\nWe’re not anti-Queensland; we’re anti-success. The feeling is pure envy, the core and honourable driving force of rugby league for 117 years. Brisbane celebrate their preliminary final escape against Penrith. Credit: Getty Images Is it hatred, or just … meh? Hatred would add interest. But many of us would have to reach too deep into our spleen or gall bladder to find more than indifference towards the Storm and the Broncos. They’re both really good to watch, part of a generation that has lifted rugby league to unprecedented popularity. Reece Walsh and Cameron Munster are rugby league geniuses. Payne Haas is what you’d get if you could breed Greg Inglis with Glenn Lazarus. Adam Reynolds, Ezra Mam and Ben Hunt versus Jahrome Hughes, Ryan Papenhuyzen and Harry Grant.\n\nWhat’s not to love? Or, from a different perspective, what’s not to hate? And this is the problem: if you love/hate Walsh, you also almost certainly love/hate Munster. Coaches are (too) often the dominant personalities in rugby league, but Craig Bellamy and Michael Maguire are related through the same Canberra family, winners with a gift for creating siege mentalities. Melbourne coach Craig Bellamy is an angry man. What’s not to love? Credit: Getty Images Bellamy. After all these years, who has the stamina to hate him? Watching him chew off his lips before making an explosive dash for the back of the coaching box as if he had business in the conveniences, somewhere, we stopped laughing at him and started laughing with him. No, that’s not right – he’s not laughing. But he’s a lovable old ball of angst, who has moved from rugby league’s arch antagonist to its national treasure. He is easily the best coach in any sporting code in Australia, but he doesn’t look like he enjoys a minute of it. How can you not like that?\n\nAs for Maguire, his emotional ambition is also to feel some sweet relief from the pain. His last three years with New Zealand, NSW and Brisbane have proved one thesis beyond doubt: the results at Wests Tigers when he was there were not the coach’s fault. In fact, the Tigers would have been, and have been, worse without Maguire. If a coach’s ability is a quotient of results divided by available talent minus club politics, Maguire belongs up with Wayne Bennett, Ivan Cleary, Ricky Stuart and Des Hasler in the sub-Bellamy class of today’s successful rugby league coaches. Loading After such an exciting season, Melbourne v Brisbane doesn’t offer much emotional investment for the neutral, but it does promise a rugby league exhibition. And here’s the moral of the story. In a code that constantly outdoes itself and becomes more entertaining each year, there’s nothing to expect and nothing to barrack for on Sunday except a great game. And no stress.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw7-bournemouth-vs-fulham-20251004-p5n00u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW7: Bournemouth vs Fulham",
        "publish_date": "Sat, 04 Oct 2025 09:06:41 +1000",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW7: Bournemouth vs Fulham\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/swift-reveals-engagement-details-and-most-personal-song-from-new-album-20251003-p5mzu4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Swift reveals engagement details and most personal song from new album",
        "publish_date": "Sat, 04 Oct 2025 09:03:12 +1000",
        "category": "sports",
        "authors": [
            "Michael Idato"
        ],
        "text": "Accustomed as she is to breaking the internet, with new album drops and engagement announcements, Taylor Swift’s appearance on The Graham Norton Show set social media alight as the 35-year-old pop star showed off her sparkling engagement ring.\n\nAsked about the “new bit of finger jewellery” given to her by fiance American footballer Travis Kelce, Swift described it as “the hardware upgrade”. The ring came with a price tag reported to be between US$700,000 and US$1 million.\n\nSwift confirmed her engagement to the Kansas City Chiefs tight end five weeks ago after two years of dating, with an Instagram post carrying the caption: “Your English teacher and your gym teacher are getting married.” The post was liked 37.5 million times.\n\nLoading\n\n“He really crushed it when it came to surprising me,” Swift told Norton. “We had filmed a podcast episode [for Kelce’s podcast New Heights] and we filmed the podcast for about three or four hours, meanwhile behind his house he was having the back garden turned into this,” she said, gesturing to the image, overflowing with flowers.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/uk-comedy-icon-dame-patricia-routledge-dies-aged-96-20251004-p5n00r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "UK Comedy icon Dame Patricia Routledge dies aged 96",
        "publish_date": "Sat, 04 Oct 2025 08:20:05 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "UK Comedy icon Dame Patricia Routledge dies aged 96\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/left-the-reno-too-late-the-micro-updates-to-refresh-your-home-before-christmas-20251003-p5mzud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Left the reno too late? The micro updates to refresh your home before Christmas",
        "publish_date": "Sat, 04 Oct 2025 08:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Robyn Willis"
        ],
        "text": "“You can change the tapware and update chrome tapware to brass,” she says. “There are certain finishes that are quite dated. You could swap it out for something in a beautiful bronze finish. Even going from a chrome finish to a brushed nickel will update the bathroom.” Loading If your bathroom tiles are dated or you don’t like them, Reynolds says there are products such as microcement, a latex polymer and stone mix, that can be applied over tiles to give a concrete finish. “It has a beautiful plaster finish,” she says. Interior designer Michelle Viret says for an even more dramatic result in the bathroom, a bold wallpaper can have a transformative effect, although if you are unfamiliar with wallpapering, it’s a job best left to professionals.\n\n“If you have tiling on a couple of walls, wallpaper can have a massive impact,” she says. “But you will need vinyl-backed wallpaper to withstand water in the room.” Go bold with wallpaper in the bathroom, such as this custom-designed vinyl-backed paper, suited to wet areas. Credit: Michelle Viret Design In soft traffic areas like bedrooms, Reynolds says replacing worn carpets can be done while you’re at work. “Old carpets are pretty awful and it’s really nice [to upgrade] if you have kids playing on the floor,” she says. Time to DIY In truth, tracking down any trades at this time of year may be a struggle. Interior designer Andrew Waller says trades such as joiners and even upholsterers have generally closed their books for the year by now. Instead, he says, it might be worth brushing up on your DIY skills and pulling out the tools.\n\nIf you’re in the market for fittings or fixtures such as lights, shelving or even furniture, he says it pays to stay close to home. Loading “Local manufacturers are your friend if time is short,” he says. “They might be more expensive, but you don’t have to worry about shipping. Some suppliers want to do their shipping all in one go, which can slow down deliveries.” Aside from shopping your way to a beautiful home before Christmas, perhaps the most accessible task is to pull out the brushes and the drop sheets and update your chosen rooms with a fresh coat of paint. “Some people like to refresh a space per season; that’s something that will give a space an instant lift,” Waller says.\n\nIf you’re handy with the tools, Reynolds says you can update the kitchen with a new splashback and new cupboard doors. “One thing that is super easy is changing the kitchen cupboard cabinet door fronts,” she says. “You can replace handles and cabinet door fronts and the kitchen looks new. A refresher of your door fronts and some really beautiful handles can have a huge impact.” If the kitchen splashback looks tired and you don’t have the time or the skills to replace it, Reynolds says for an instant lift, you can adhere a piece of mirror, cut exactly to size by a glazier, over the existing tiles. Made-to-measure window coverings can screen an unsightly view or manage heat penetration. They are also within the DIY realm. Credit: Tuiss Blinds Online Window coverings such as made-to-measure roman blinds or sheer floor-to-ceiling curtains can still be ordered for delivery before Christmas and are suitable for DIY installation. They can also screen an unsightly view or offer some protection from summer heat penetrating the house.\n\n“Curtains add a softness that is stunning and a relief from the harshness of glass,” she says. “Because it is summer, you can leave the door open and let the curtain billow. It can transform a room, and it’s a really easy change to make.” Do the odd jobs Pressure wash the exterior, fix or replace broken skirting boards, oil the deck. In short, it’s time to tackle all those tasks you’ve been putting off over the winter. When in doubt, Reynolds says, it’s worth assessing your home as guests might do, starting with the front door. “The sight line from the door instantly sets the tone of the space in the first three seconds – and you never get them back,” she says. “Add some greenery to the space with plants to create softness. “The key to the micro-renovation is to make it easy, fun and achievable. And make it realistic. It’s pre-Christmas, so don’t add any more stress.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/dashcam-footage-shows-the-horrifying-moment-chopper-crashes-in-sydney-s-south-west-20251004-p5n00o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dashcam footage shows the horrifying moment chopper crashes in Sydney’s south-west",
        "publish_date": "Sat, 04 Oct 2025 07:30:24 +1000",
        "category": "finance",
        "authors": [],
        "text": "Dashcam footage shows the horrifying moment chopper crashes in Sydney’s south-west\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/sean-combs-sentenced-to-four-years-and-two-months-20251004-p5n00n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sean Combs sentenced to four years and two months",
        "publish_date": "Sat, 04 Oct 2025 07:29:31 +1000",
        "category": "finance",
        "authors": [],
        "text": "Sean Combs sentenced to four years and two months\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/two-bodies-found-in-victoria-s-high-country-20251004-p5n00m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Two bodies found in Victoria’s high country",
        "publish_date": "Sat, 04 Oct 2025 07:28:58 +1000",
        "category": "finance",
        "authors": [],
        "text": "Two bodies found in Victoria’s high country\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/celebrity/diddy-jailed-for-four-years-fined-757-000-for-sex-charges-20251003-p5mzty.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Diddy jailed for four years, fined $757,000 for sex charges",
        "publish_date": "Sat, 04 Oct 2025 07:14:01 +1000",
        "category": "finance",
        "authors": [
            "Michael Idato"
        ],
        "text": "Hip-hop star Sean “Diddy” Combs has been sentenced to four years and two months in prison. Combs was also fined US$500,000 ($757,000) and will be subject to five years of supervised release when his sentence is served.\n\nThe sentence was handed down in New York after an eleventh hour plea for leniency from Combs’s defence attorney Nicole Westmoreland. “Mr Combs is not larger than life, he’s just a human being,” Westmoreland said. “He’s just a man and he’s made some mistakes. He has flaws like we all do. Your honour, he gets it, plain and simple.”\n\nAn impression of Sean “Diddy” Combs in court during his trial in July. Credit: Elizabeth Williams via AP\n\nDespite that, Judge Arun Subramanian said the court had to consider all of Combs’s history. “A history of good works can’t wash away the record in this case, which shows that you abused the power and control over the lives of women who you professed to love,” he said.\n\nIn sentencing Combs to 50 months in prison, Subramanian said he was inclined to give Combs a “meaningful” sentence, but that the 11-year sentence sought by the prosecution was “not reasonable”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/what-every-aussie-needs-to-know-before-visiting-the-usa-20251004-p5n00i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What every Aussie needs to know before visiting the USA",
        "publish_date": "Sat, 04 Oct 2025 07:08:48 +1000",
        "category": "finance",
        "authors": [],
        "text": "What every Aussie needs to know before visiting the USA\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/ski-tzar-grollo-goes-off-piste-in-east-melbourne-20251001-p5mzdk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ski tzar Grollo goes off-piste in East Melbourne",
        "publish_date": "Sat, 04 Oct 2025 06:00:00 +1000",
        "category": "finance",
        "authors": [
            "Nicole Lindsay"
        ],
        "text": "Early last year, the Grollos bought Hotham Airport, near Dinner Plain, for $6.7 million and have since lodged plans to build a worker accommodation hub on the airport land. The company has also taken over Bogong Village, between Mount Beauty and Falls Creek, to redevelop another worker accommodation project. However, they are not in the running to buy the Allen Government’s 99-year operating leases for Mount Baw Baw and Lake Mountain. In the Melbourne CBD, the Grollos own half a block of King Street down the hill from the twin-tower Rialto office, which Rino (and his brother Bruno) built in the 1980s. They jointly own the Rialto with GIC, Singapore’s sovereign wealth fund. GIC bought out the Kuwaiti-controlled St Martins Properties for $644 million in 2020. Whac-A-Mole on Flinders Lane No sooner had the owner of blue chip office tower 101 Collins Street dusted off one Flinders Lane building and ensured its money-making views were protected, when another building started flaunting its height potential.\n\nA three-level property at 101’s back door, on the corner of AC/DC Lane, is up for sale just six weeks after its neighbour at No.107-109 sold for $14.8 million – with restricted height limits. The owners of 103-105 Flinders Lane are likely to make about $15 million for the three-storey, 1186-square-metre warehouse which they bought for all of £67,000 in 1956. 103 Flinders Lane is on the corner of AC/DC lane. The Commonwealth Super Fund, which owns 101 Collins Street, had originally bought No.107-109 for $15 million in 2015 to stop a 43-level tower obscuring the views of top law firms and investment banks. The fund ensured the longevity of those views by limiting development heights on the building. Now it’s back to square one in the game of Whac-A-Mole that it plays to keep the neighbourhood in check.\n\nThe fresh threat is on a 332-square-metre piece of land with a ground floor café, upstairs office and a basement nightclub leased to Bar Bambi. That basement space, which opens onto the lane, was the original site of the Cherry Bar (since relocated to Little Collins Street) and the motivation for renaming Corporation Lane as AC/DC Lane 21 years ago. Cushman & Wakefield’s Oliver Hay, Daniel Wolman and Leon Ma have the listing, with Alexander Robertson & Co.’s Kristian Peatling and Warwick Bramich. Artist’s impression of a potential tower added to 103 Flinders Lane. Speaking of AC/DC, next month the City of Melbourne will be throwing a party to celebrate 50 years since the band played Long Way to the Top on the back of a flat-bed truck through Melbourne’s streets. There will be a lighting installation in the lane and a big gig at Federation Square.\n\nNew permits The old Exploration Hotel, which featured in last week’s column, could be getting a new neighbour at its rear. The razed site at 9-11 Exploration Lane received a permit this week for an eight-storey office building rising about 31 metres. The 170-square-metre site, owned by retirement village developer Knowles Group, had been earmarked for a 130-room hotel in a joint venture with the late Jonathan Hallinan. In 2018, the group tried to sell the land, with a permit for a 34-storey hotel, for about $50 million, but there were no takers. The Knowles Group paid $2.15 million for the land in 2010.\n\nWash-up from Lion’s collapse The Lion Property Group collapse is washing its way through the market with a block of flats in South Yarra selling for $6.1 million – 25 per cent less than what it fetched in 2023. Records show Drake Developments’ Colin Drake settled 1-17 Adams Street, South Yarra last month, just as the $130 million Lion Ponzi scheme totally unravelled. Drake said he was planning to build six townhouses on the 774-square-metre site. They will replace the 14 vacant 1950s-era flats near the corner of Toorak Road facing Fawkner Park. 1-17 Adams Street, South Yarra.\n\nThe new plan will also replace the costly four-level seven-unit design, which Lion acquired in 2023. Fitzroys’ Lewis Waddell, Ben Liu and David Bourke handled the deal. South Melbourne auction Former Carlton & United Breweries boss Peter Filipovic and his investment partners Dave and Merv Shannon are offloading a property which came as part of their $20 million Bells Hotel purchase. The 155 -square-metre shed around the corner at 52-54 Tope Street is going to auction next week and is likely to fetch about $1.7 million.\n\nThe single-storey warehouse had been used as extra function space for the pub. Stonebridge agents Dylan Kilner and Max Warren have the listing, but declined to comment on the property. 268 Park Street, South Melbourne. Up for auction on the same day is the freehold of the Park Street Pasta & Wine at 268 Park Street on the corner of Perrins Street. Park Street Pasta & Wine has recently renewed its five-year lease, which comes with two five-year options and returns $95,000 a year in rent. That puts its likely price at more than $1.8 million. Stonebridge’s Nic Hage, Ian Lam and Kilner are handling enquiries, but declined to comment. Records show the property last changed hands in 2016 for $1.78 million. The vendor at that time was the late nightclub owner Darren “Razzle” Thornburgh, who died shortly after in Barmah, Victoria.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/single-vote-reshaped-sydney-region-000613106.html",
        "title": "Single vote that reshaped Sydney region",
        "publish_date": "2025-10-04T00:10:50Z",
        "category": "finance",
        "authors": [],
        "text": "The future of one of Sydney’s most sought-after regions was set on a new course this week after councillors narrowly voted to approve a controversial plan paving the way for up to 30,000 new homes in the next 15 years despite fierce opposition.\n\nEight of the 15 councillors on the Inner West Council voted on Tuesday after a much-interrupted debate in the council chambers to approve the Our Fairer Future plan, a sweeping proposal to rezone swathes of bustling inner-city LGA.\n\nIn places, the plan could allow for new residential apartment buildings up to 20 storeys, with the final proposal passed with multiple amendments focused on affordable housing requirements, carparks and church-owned sites.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMayor Darcy Byrne said that, with the adoption of the plan, the council would “reverse the exodus of young people, renters, and essential workers from the Inner West” and, in decades to come, give their grandchildren “homes to live in”.\n\n“For far too long, local governments have put off action,” he said.\n\n“That has only worsened the situation for many thousands of young people in this city. As of last night, we have adopted an ambitious plan that will see the delivery of between 20,000 and 30,000 homes over the next 15 years.”\n\nMayor Darcy Byrne said council would ‘reverse the exodus of young people’. Picture: NewsWire / Max Mason-Hubers\n\nThe Greens voted against the plan having led opposition to it.\n\nAfter the vote, Greens councillor Izabella Antoniou said the council had “a once-in-a-lifetime opportunity with the rezoning before us to raise millions for affordable, rent-controlled homes here in the Inner West – but Labor has blown it”.\n\nWhy has it been controversial?\n\nPassage of the Our Fairer Future plan had been far from a sure thing.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Byrne was on multiple occasions on Tuesday night forced to call proceedings to order following interruptions from largely oppositional voices in the audience who had gathered within the council chambers for the historic vote.\n\nThe proposal has faced stiff opposition from what Ms Antoniou said was a “broad church” of residents, ranging from the Greens and NSW Socialists, to local and Sydney-based activists groups and long-term residents.\n\nMs Antoniou said the council had “one chance” to ensure the windfall the rezoning would give to developers would improve housing access and infrastructure in the Inner West and joined the seven councillors who voted against the plan.\n\nThe Greens had argued the proposal would not positively affect housing affordability and had campaigned for the number of affordable homes developers would be mandated to allocate to be 30 per cent – ultimately, it was set at 3 per cent.\n\nWhat has changed?\n\nThe plan passed on Tuesday differed from the public proposal.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhile the first and second stages of the proposal, as had been presented to council, had gone on public exhibition, the final motion that was passed included amendments that largely centred on the hot-button issue of affordable homes.\n\nThe plan will enable up to 30,000 new homes over 15 years. Picture: NewsWire / Max Mason-Hubers\n\nMany of the changes were done in the image of the City of Sydney’s proposed Affordable Housing Contributions Program, which sets the requirement for developers at 2 per cent before moving to 3 per cent after just three years.\n\nDevelopers would also be asked to set aside 20 per cent of all additional proposed floor space beyond the baseline provisions for affordable housing in upzoned LGA areas, and, council carparks could be redeveloped for up to 351 affordable homes.\n\nOne of the most striking amendments, though, is what Mr Byrne said was an Australia-first proposal to allow church and faith groups to redevelop their own land for residential provided 30 per cent is set aside for affordable housing.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAbout 5000 less homes will go into Marrickville, Ashfield, and Dulwich under the amendments and instead will be transferred into the Parramatta Rd corridor – an almost 8000 home plan between council and the NSW state government.\n\nWhat happens next?\n\nMr Byrne said he had come to an agreement with the NSW government last year in which the council would pursue their own planning controls instead of the transport and density-oriented projects of the Minns government.\n\n“I fully expect that the Premier and the Planning Minister will uphold their end of the bargain, that they will repeal the TOD (transport-oriented development) and the other rezonings that were imposed over the top of our community,” he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“And, that they will implement, as fast as possible, our Fairer Future.”\n\nThe plan will need to be rubber-stamped by the Department of Planning.\n\nGreens councillor Izabella Antoniou said the council had ‘a once in a lifetime opportunity … But Labor has blown it’. Picture: NewsWire / Max Mason-Hubers\n\nAs for the opponents of the plan, they remain largely undeterred.\n\nRachel Evans is part of Action For Public Housing, itself part of the umbrella Better Future Coalition, and said while those civil society groups were yet to meet after the vote, a rally through impacted areas was being planned.\n\n“We are not just going to walk away after such a narrow vote but also after such a dreadful plan has been passed, so the campaign will continue,” she said.\n\n“We’re calling on residents not to sell to the developers. Everyone’s being bullied into selling.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“No one is walking away from this fight.”\n\nShe said organisers were planning to leaflet and doorknock affected areas of the inner west, place corflutes calling for the plan to be scrapped, urge councillors to rescind it, and present their own architecturally designed plan for social housing.\n\n“We’re going to stop them in whatever way we can and provide a people’s development plan, which includes public housing and genuinely affordable housing, which is community housing, proper council and community housing at 25 per cent of your income on rent,” Ms Evans said.",
        "source": "Yahoo"
    }
]