[
    {
        "url": "https://www.9news.com.au/national/nort-non-alcoholic-beer-brewery-owner-jaz-bold-idea-paid-off-big-time/6b147ee3-d9a2-4b86-96bd-a1514fb26fdd",
        "title": "Brewery owner Jaz had a risky idea. It has paid off big time",
        "publish_date": "Sat, 17 Jan 2026 22:01:17 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "The co-founder of one of Australia's most popular breweries has struck gold with a secondary endeavour: non-alcoholic beer.\n\nJaz Wearin and her husband Grant began Modus Operandi in 2014 on Sydney's Northern Beaches with just $7 and a dream.\n\nJust six years later, the pair noticed the booming zero per cent market in Australia was crying out for more competition.\n\nJaz Wearin founded Nort in 2020. (Supplied)\n\nThey boldly entered the non-alcoholic craft beer category during the COVID-19 pandemic with the launch of Nort.\n\nAt this point, zero per cent beer was still a largely unexplored market.﻿\n\nNow, a few years later, Nort has opened its own brewery to bump out its non-alcoholic beverages.﻿\n\n\"Since we launched in 2020, the response has been incredible,\" Wearon told nine.com.au.\n\n\"In the early years, demand grew explosively, so much so that we built our own 10 million-litre brewery to keep pace.\"\n\nThere has been a generational shift in alcohol consumption in Australia since Nort launched.\n\nNon-alcoholic beer now accounts for 10 per cent of beer sales in Australia.\n\nThe national non-alcohol category is also expected to deliver double-digit growth by 2028, with a prediction of around 300 million litres sold that year compared to 150 million in 2024.\n\nWearon said Australians had been desperate for ways to stay sober and remain social.\n\n\"It really comes down to choice and balance, people want to enjoy social occasions without the downsides of alcohol all the time,\" she said of Nort's success.\n\n\"That might be for health, sleep, fitness, work performance, family commitments, or just wanting a clearer head the next day.\n\n\"Our slogan, 'Enjoy More', really captures that: it's not about giving up, it's about enjoying more of life without having to compromise the social experience.\"\n\nNon-alcoholic beer now accounts for 10 per cent of beer sales in Australia. (Supplied)\n\nWhile the Australian market is still small, Wearon is confident it will be a huge 2026 for brands in this category.\n\nNort is competing against the likes of Heaps Normal , Hahn, Asahi and ﻿Carlton for space on the non-alcoholic shelf.\n\nBut the home-grown brand is the little engine that could: the sales have proven this.﻿\n\n﻿Wearon said January sales are typically several times higher than other months as New Year's resolutions kick in.\n\n\"It's very predictable now,\" she said of the January sales bump.\n\n\"In fact, this year we had higher demand than we forecasted, and we were literally brewing Nort up until Christmas Eve to keep up.\n\n\"Christmas and the 'silly season' brings a lot of social occasions, so people use non-alcoholic beer as a way to enjoy the moments without the downside of overindulging.\n\n\"Then in January, we see that behaviour really kick in, people deliberately choose to cut back or reset after the holidays.\"\n\nWearin said Australians are looking for ways to stay sober and remain social. (Supplied)\n\nBut sales are no longer tied to big \"sober\" movements like Dry July, she said.\n\nIn fact, non-alcoholic sales now mirror traditional beer sales.\n\n\"﻿What we're seeing now is that non-alc beer is mirroring the broader beer cycle, where growth isn't just tied to Dry January or Feb Fast anymore,\" she added.\n\n\"It's becoming ingrained in people's behaviours around the key drinking occasions like footy finals, Christmas, summer holidays, and Easter too.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/elmore-victoria-crash-boy-fighting-for-life/be84840f-6b09-4adf-8007-a57639f646a5",
        "title": "Boy, 17, critically injured after car rolls near Bendigo",
        "publish_date": "Sat, 17 Jan 2026 22:56:33 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "were called to the scene on Elmore-Raywood Road in Elmore just after 2.30am, with a car reportedly leaving the road and rolling.\n\nThree people were in the car at the time, including another 17-year-old boy and a 19-year-old boy.\n\nThree people were in the car at the time, including another 17-year-old boy and a 19-year-old boy.\n\nThey both suffered serious injuries and were taken to hospital alongside the first boy.\n\nThey both suffered serious injuries and were taken to hospital alongside the first boy.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/adelaide-airport-sixhour-delay-for-qantaslink-passengers-after-plane-turns-back-to-adelaide-twice/15ad59eb-a6a3-47f6-a389-5880e8a674f7",
        "title": "Flight turns back twice, passenger misses best mates' wedding in QantasLink nightmare",
        "publish_date": "Sat, 17 Jan 2026 10:00:48 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "A QantasLink flight bound for the South Australian city of Port Lincoln was forced to turn around twice this morning, resulting in a six-hour delay for passengers.\n\nThe plane took off from Adelaide Airport at 7.55am but was forced to return to the tarmac almost an hour later after the aircraft hit a bird.\n\nThe flight was on the ground for an hour before the plane was given the all-clear to return to the skies, but a technical issue mid-flight forced the aircraft to turn back a second time.\n\nA QantasLink flight bound for Port Lincoln was forced to turn around twice this morning. (9News)\n\n\"It reminded me of a Seinfeld episode,\" passenger Barry Stribler said.\n\n\"The second time the pilot actually came out and as we were all walking out, each individual person he apologised and said he was sorry.\n\n\"We got told that they had three other planes here so I don't understand why they wouldn't just change planes.\"﻿\n\nEventually passengers did change planes as engineers worked on the first aircraft.\n\nThe flight eventually took off just before 2pm after six hours of waiting, two delays and two different planes.\n\nREAD MORE: British band Pulp backflips on Adelaide festival withdrawal\n\nThe plane took off from Adelaide Airport at 7.55am today but was forced to return to the tarmac almost an hour later. (9News)\n\nImogen Evans was heading to her best friend's wedding when she was caught up in the delay.\n\n\"I'm devastated to miss the ceremony, they're two of my best friends,\" Evans said.\n\nHowever she said there was a silver lining to the journey.\n\n\"The camaraderie on the plane has been so lovely, we've met a girl who's going to drop us straight to the wedding,\" she said.\n\nA Qantas spokesperson apologised for the delay and acknowledged the frustration.\n\n\"However safety is always our first priority,\" the spokesperson said.\n\n\"We appreciate the patience and understanding from our customers.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/satellite-images-show-how-firebesieged-towns-looked-before-and-after-deadly-victorian-blazes/8e9b7800-3b01-4147-aed0-e12b631a84eb",
        "title": "How fire-hit towns looked before and after deadly Victorian blazes",
        "publish_date": "Fri, 16 Jan 2026 20:00:56 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "More than 1000 structures across Victoria have been damaged or destroyed by the fires,\n\nincluding 290 homes\n\nwhich have been reduced to ash and rubble.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-18/kununurra-aboriginal-short-stay-accommodation-axed/106228666",
        "title": "Government dumps plans for Kimberley short stay accommodation",
        "publish_date": "Sun, 18 Jan 2026 01:15:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Elizabeth Waina sits on the pavement, a debit card and a scrunched-up letter in her hand, waiting for the bank to open.\n\nShe has travelled more than 500 kilometres from her hometown of Kalumburu, Western Australia's northernmost settlement, to Kununurra, the East Kimberley's main regional hub.\n\nRemote residents like Elizabeth Waina travel to Kununurra to access services including banking. (ABC Kimberley: Giulia Bertoglio)\n\nMs Waina is one of many residents of remote Aboriginal communities who make similar trips into town each year to access services.\n\nWithout suitable accommodation, many end up sleeping rough or staying with relatives in overcrowded houses.\n\nPlans abandoned\n\nThe WA government had previously pledged $20 million to provide short-stay accommodation for residents of outlying communities travelling into Kununurra.\n\nBut the Cook government has since dumped the project, citing land limitations and a lack of suitable existing facilities.\n\nAboriginal short stay accommodation facilities, like this one in Derby, have been built across the state. (ABC News: Natalie Jones)\n\nHousing and Works Minister John Carey said the funds had been reallocated to social housing in Kununurra and Wyndham, and would help deliver 32 homes over the next two years.\n\n\"I acknowledge there will be many people in the community disappointed by the decision to reallocate funding for the project,\" Mr Carey said.\n\n\"But our government is ensuring every dollar will be spent in the Kununurra and Wyndham communities.\"\n\nExposed to risks\n\nChermaine Dodd travelled to Kununurra from the Northern Territory for family reasons, but her stay has had its challenges.\n\n\"I'm struggling, I'm homeless, and I need somewhere to stay,\" she said.\n\nMs Dodd said an Aboriginal short-stay facility would help her and other visitors.\n\n\"I would feel safe as long as they provide us with a bed, with food, and as long as we do the right thing,\" she said.\n\nChermaine Dodd says overcrowding can create tension between family members. (ABC Kimberley: Giulia Bertoglio)\n\nMs Dodd said many visitors from remote communities ended up staying with relatives, even if they do not have room to accommodate them.\n\n\"It's overcrowded. It creates a bit of tension and family disputes, arguing,\" she said.\n\nEdreena Unghango is visiting Kununurra from Kalumburu and staying with a relative.\n\nBut she said overcrowding was a real issue for some family and friends who had \"somebody else sleeping on their bed, taking up their space\" and resorted to going to the sober-up shelter.\n\nEdreena Unghango says many people from remote communities have no choice but sleeping rough when visiting. (ABC Kimberley: Giulia Bertoglio)\n\nWhile she has a bed in a safe home, Ms Unghango said she was worried for her younger relatives who slept rough when in town to access services or attend funerals.\n\n\"Sometimes you see families on the streets with babies,\" she said.\n\n\" I feel unsafe for my siblings, my baby sister, my baby brother. I like to ring up over time to make sure they are OK. \"\n\n'Sorely needed'\n\nShire of Wyndham-East Kimberley chief executive officer Vernon Lawrence said they would keep advocating for the facility to be built.\n\nHe said while there was a need for more social housing in Kununurra, an Aboriginal short stay was \"sorely needed\", with a lack of temporary accommodation exacerbating the town's social issues.\n\nVernon Lawrence said a short stay accommodation facility in Kununurra was \"sorely needed\". (ABC Kimberley: Giulia Bertoglio)\n\n\"Going through the COVID years and the increase in construction costs, there's no way a facility like that could be built for $20 million at this point,\" he said.\n\n\"It's an obvious, partial solution that can be implemented that hasn't been implemented.\"\n\nMr Lawrence said he hoped the government would ultimately find long-term funding to revive the project.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-18/iranian-in-kalgoorlie-fears-for-her-country/106231884",
        "title": "Sahar is worried sick, but hopes the day she can return to Iran is coming",
        "publish_date": "Sat, 17 Jan 2026 23:59:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sahar Agheli Goki believed that if she studied hard, she could have a good life in Iran.\n\nBut two years ago, her belief changed.\n\n\"When I graduated from university and started working, I realised as much as I try and work hard, I have nothing,\" Ms Goki said.\n\n\"So, I decided to leave Iran.\"\n\nMs Goki lives with her husband in Kalgoorlie, 600 kilometres from Perth, where she is studying a PhD in metallurgy.\n\nHer new home, nestled at the end of a quiet, dusty street in the outback gold-mining city, is a stark contrast to what is unfolding in Iran.\n\nDemonstrations broke out across Iran on December 28 over dire economic circumstances, but the protests quickly turned towards the country's clerical rulers and grew in number and size.\n\nOn January 8, the country descended into a communication blackout, and deadly demonstrations ensued.\n\nFor Ms Goki, the decision to leave has become bittersweet.\n\nMs Goki and her husband have been unable to contact family in Iran. (Supplied)\n\nHer messages and calls to loved ones have gone unread.\n\n\"It's like they are not online. I also called them, and I can't reach them,\" Ms Goki said.\n\nShe does not know if her friends in Tehran are still alive and constantly worries about them.\n\nBeing on the other side of the world, Ms Goki said she could not help but feel ashamed that she was alive.\n\nBut she does not want to lose hope for her home country.\n\n\"I said to myself, 'That's enough — I'm not scared of this regime anymore,'\" Ms Goki said.\n\n\"I want to do everything for this country. We have a long history, we had a big empire, so we don't deserve this.\"\n\nInternet connectivity has been partially restored in Iran, but is operating around two per cent of ordinary levels, according to internet traffic monitoring services.\n\nMs Goki said on Sunday she had still not heard from her loved ones.\n\nA time before the revolution\n\nMs Goki was born a decade after the 1979 revolution.\n\nGrowing up, she said her parents used to speak about how different life was in Iran before the start of the regime.\n\n\"My mother used to tell me about her school days under the Shah when children wore beautiful uniforms freely — that contrast made me sad and confused at a young age,\" Ms Goki said.\n\nMs Goki says she and her husband would consider returning to Iran if the situation improves. (Supplied)\n\nThe deepening economic crisis in Iran has become an enduring challenge for those living there.\n\n\"Every day, the price of the shop is twice [more expensive] — nobody can live like that.\"\n\nBut Ms Goki said it was deeper than just an economic issue.\n\n\"It's not like here — you can speak and have every opinion.\n\n\"They tell you what to wear, how to think, you can't even change religion because they don't let you.\"\n\nMany Australians would find it difficult to imagine the situation, she said.\n\n\"When I came here and saw people wear whatever they want, I realised it's nothing,\" Ms Goki said.\n\n\"Just basic human rights.\"\n\nMs Goki says her husband, Farshid, has been a big source of support. (ABC Goldfields: Katrina Tap)\n\nDespite being so far away, she is proud to be an Iranian.\n\n\"We have very beautiful architecture and so many different places with so many different characteristics,\" Ms Goki said.\n\n\"From north to south of Iran, you can experience spring and summer, and it's a beautiful country.\"\n\nWhile there was always worry, Ms Goki held hope that now could be the time things changed.\n\nMs Goki is among Iranian nationals calling on countries to intervene.\n\n\"We can't do anything with bare hands,\" she said.\n\n\"We need people from outside to help.\"\n\nWhile the lack of connectivity continues to limit access to developments in the country, there have been no new protests reported.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-18/vic-letterbox-man-s-colourful-hobby/106169390",
        "title": "Australian artist's 'magic' letter box restoration project",
        "publish_date": "Sat, 17 Jan 2026 23:33:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mick Slocum's on a quest to resurrect a bit of Victorian history.\n\nNearly 200 bits, in fact.\n\nThe 76-year-old former Bushwackers band member is two years into his passion project, for which he travels the state refurbishing colonial-era postboxes — known as pillar boxes.\n\nIt's a job he believes is best done in period costume: often a tartan three-piece suit and a straw boater hat.\n\nAnd it all started on an impulse.\n\n\"I was going through an anti-graffiti campaign,\" Mr Slocum said at a pillar box restoration in Albert Park.\n\n\"I bought some solvent and went and cleaned off the graffiti [from a pillar box].\n\n\"Then I stood back and … I thought goodness me, I think I'll just keep going.\"\n\nDepending on their condition, Mick Slocum can spend weeks restoring historic pillar boxes. (ABC News: Scott Jewell)\n\nScrapers, some paint, and a passion for history\n\nMr Slocum's creative whim sprouted a personal campaign to restore every pillar box in the state.\n\nAfter hearing about his first refurb, Australia Post offered Mick payment for every completed pillar. A supplier also provides paint.\n\nWithout any modern tools, he's scratched, scraped and painted pillars throughout Melbourne and across regional Victoria.\n\nEach refurb takes between a couple of days and several weeks.\n\nIt's a task undertaken in the heat and cold, and along roads busy or quiet — and one that reliably draws curious onlookers, as well as offers to help.\n\n\"The gentleman whose [Albert Park] house I'm working out the front of came out and greeted me like a long-lost brother,\" Mr Slocum said.\n\n\"That's actually the best part — meeting the people.\"\n\nMick Slocum's restorations bring vibrant colour to Victorian streetscapes. (Supplied: Mick Slocum)\n\nSecrets hidden beneath the surface\n\nPillar boxes were introduced in Australia in the 1850s.\n\nMany were produced in several different styles at foundries in Melbourne.\n\nPillar boxes were key to communication in a time before the telephone and, along roads where cars and trams now zip by, horse-mounted postmen would have stopped multiple times a day to empty each one.\n\n\"The juxtaposition of what [an area] used to be like and what it is now is just extraordinary,\" Mr Slocum said.\n\n\"I'm kind of bringing that back in a way — that's the magic of it.\"\n\nWhen the pillars were decommissioned, starting in the 1960s, they were sealed shut and were slathered with a bland, red coat of paint.\n\nIt's this dull coating Mick first shaves away before sanding and eventually returning the pillars back to their original colours — usually bright red, gold, and green.\n\nThe strips that come away with every scrape of Mick's knife can hint at a pillar's secret past: often revealing layers of colours which have been hidden for decades.\n\nAnd some discoveries beneath the topcoat can be breathtaking.\n\nMick's fascinating finds in the past year include a delicate golden crown painted on a pillar box in Collingwood, which he believed was likely added ahead of Queen Elizabeth's visit in 1954.\n\nIn Jolimont, Mick uncovered a notice for collection times — which he estimated dated from the 1920s.\n\n\"But it could have even been from the 1800s,\" Mr Slocum said.\n\nScraping away the thick top coat on the pillars can reveal hidden secrets. (Supplied: Mick Slocum)\n\nBoxes on the decline\n\nThere are about 180 pillar boxes in Victoria, but there were once thousands.\n\nAnd it's not just the historic boxes that have disappeared from street corners.\n\nWith the rise of the internet and telephones, sending a letter has largely become a thing of the past and the number of modern post boxes has declined as well.\n\nAustralia Post has removed some receiving boxes in recent years.\n\nIn May 2025, Mick received a National Trust conservation award for his work in Ballarat — where he's refurbished 16 pillar boxes.\n\n\"He's provided a real highlight of the joy that heritage can spark in people's lives,\" said Sam Westbrook, executive manager of conservation and advocacy at National Trust.\n\n70 down, 100 to go\n\nMick's nearly halfway to his target and has about 100 pillar box restorations to go.\n\nBut his unshakable passion for the colourful and creative means he already has his sights on his next project — once he's signed off on the final pillar box.\n\n\"In the CBD on every street corner there's an electricity box from the 1920s and 1930s,\" he said.\n\n\"So far I've restored two, and there are about 50 to go.\"\n\nMick Slocum scrapes, scratches and paints pillar boxes across Victoria (ABC News: Scott Jewell)\n\nFor now, he's focused on the main task — a project taken one pillar at a time.\n\n\"I always hope that one day I'll find a key that opens one of the boxes, and it'll be full of mail from the 1890s,\" Mr Slocum said with wide eyes and an eager smile.\n\n\"You just never know.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-18/australian-open-2026-live-updates-sabalenka-alcaraz-berrettini/106238282",
        "title": "Live: Local wildcard nabs first win of Aus Open as thousands of fans stuck outside",
        "publish_date": "Sat, 17 Jan 2026 23:22:43 +0000",
        "category": "sports",
        "authors": [
            "Jon Healy",
            "Chris De Silva"
        ],
        "text": "Local wildcard Talia Gibson has become the first winner on day one of the Australian Open, while top seeds Carlos Alcaraz and Aryna Sabalenka are the main attractions tonight.\n\nEarlier, luckless Italian star Matteo Berrettini has withdrawn from his first-round Australian Open clash with Alex de Minaur on the eve of the tournament.\n\nFollow all the latest from Melbourne Park in our live blog below.\n\nKey Events We have our first seed knocked out 17 minutes ago Lines still long outside Melbourne Park 39 minutes ago Local wildcard Talia Gibson is the first winner of the 2026 Australian Open 1 hours ago Show all key events Australians in action on day one of the Aus Open J By Jon Healy Here are all the local hopes taking to the court on day one of the Australian Open (all times AEDT). Live: Corentin Moutet (32) vs Tristan Schoolkate on Kia Arena Coming up: Frances Tiafoe (29) vs Jason Kubler (Q) from 5pm on John Cain Arena\n\nfrom 5pm on John Cain Arena Carlos Alcaraz (1) vs Adam Walton last on Rod Laver Arena Completed: Talia Gibson (WC) def Anna Blinkova 6-1, 6-3 Feder. Alcaraz. Sakkari. J By Jon Healy Greece's Maria Sakkari is through to the second round after beating Frenchwoman Leolia Jeanjean 6-4, 6-2 in an hour and 19 minutes on Margaret Court Arena. And the comprehensive victory gave us an early contender for shot of the tournament, with Sakkari ripping a forehand return winner around the net post at full stretch. \"I could never imagine that I could actually hit that kind of return. \"You see when Roger [Federer] hits it, Carlos [Alcaraz] and then myself. I'm pretty sure it's gonna [be] one of the best shots of the tournament.\" Zverev receives a warm reception as he enters RLA C By Chris De Silva Pretty kind reception for Alexander Zverev as he walks onto Rod Laver Arena behind Gabriel Diallo. The crowd is shuffling through the aisles at the moment, but there are a lot of empty seats in here as these two prepare to warm up. We have our first seed knocked out J By Jon Healy (Getty) Ukraine's Dayana Yastremska is the first singles seed to be knocked out of the main draw, the 26th seed going down in straight sets to Romania's Elena-Gabriela Ruse. Yastremska reached the semifinals here two years ago as a qualifier, but was outclassed by Ruse, who is ranked 76th in the world. Up next on RLA: Alexander Zverev opens his AO account C By Chris De Silva Last year's runner-up in the men's singles, Alexander Zverev, is up next at Rod Laver Arena. Zverev was well beaten by Jannik Sinner in last year's final and then received a less than ideal reception as he spoke after the match. It'll be interesting to see how the German is received this time around. Zverev is up against Canada's Gabriel Diallo first up. Jasmine Paolini coasts through to the second round on RLA J By Jon Healy (Getty) Aside from letting a couple of match points slip, barely a moment of trouble for Italian seventh seed Jasmine Paolini as she sweeps Belarusian Aliaksandra Sasnovich in 69 minutes. \"Before the match I was a little bit nervous to be honest, but then I stepped on court and felt good from the first ball,\" she says on Rod Laver Arena. Paolini said she will relax and enjoy the rest of her Sunday now. (Supplied: Stan) Men's third seed Alex Zverev is next up on centre court, taking on Canada's Gabriel Diallo. Live: Another Australian on court J By Jon Healy Tristan Schoolkate has held serve to start his tournament on Kia Arena. The world number 97 is up against 34th-ranked Frenchman Corentin Moutet. Lines still long outside Melbourne Park J By Jon Healy (ABC Sport: Anthony Furci) It's hot and sunny outside the ground today and the sell-out crowd is slowly making its way through the gates. But it looks like thousands of people are stuck outside and battling to get inside, almost two hours after the scheduled start of play. (ABC Sport: Anthony Furci) Stay sun safe out there, folks. The moment Talia Gibson booked her place in the second round J By Jon Healy Local wildcard Talia Gibson is the first winner of the 2026 Australian Open J By Jon Healy (Getty) Australian wildcard Talia Gibson is through to the second round of her home slam for the second straight year with a decisive 6-1, 6-3 victory over Russian Anna Blinkova in just 76 minutes. Gibson was fearless and finished the match by ripping a 43rd winner across the court (Blinkova only had five). It's a phenomenal victory for Gibson, who is ranked 119th, 57 spots below Blinkova. Gibson gets emotional as she thanks the fans on Kia Arena for getting behind her. \"I couldn't believe the number of people that were in here today. It just means a lot. Thank you so much.\" Live: Upset watch on John Cain Arena J By Jon Healy What is happening with Flavio Cobolli on JCA? Trainers have been with him at every change of ends - Stanchez (Getty) Italian 20th seed Flavio Cobolli has just dropped the first-set tiebreak 7-1 to qualifier Arthur Fery and immediately left the court for a toilet break. The Italian has been struggling a little physically and certainly looked out of sorts. It's also been a weird match with a video review for a net touch and a let played after an underarm serve because the ballkid was moving behind Cobolli. Live: Talia Gibson tightening up a little J By Jon Healy Australian wildcard Talia Gibson could be the first winner at this Australian Open, but the 21-year-old is showing some nerves as her match against Anna Blinkova rolls on. The match is just over an hour old and she leads Blinkova 6-1, 4-3 thanks largely to a 33-5 advantage in winners, but she's just been broken for the first time and the unforced errors are mounting now too (20-12). Gibson missed a chance to go up 5-1 on Blinkova's serve and has started missing a few more serves and she's getting a little rushed as Blinkova finds her rhythm. Huge lines at Melbourne Park J By Jon Healy It would be great if we could actually watch the games, we’ve been stood in line in the burning sun for 40 minutes now 😔 - Claire Shepley Oh Claire, I hope you've got your sunscreen on. (ABC Sport: Anthony Furci) The lines are massive outside the precinct with ground passes sold out for day one. Hopefully you can get in soon and enjoy the tennis. Live: Talia Gibson takes the opening set J By Jon Healy It's taken just 31 minutes for West Australian wildcard Talia Gibson to become the first player to win a set in the main draw at the Australian Open. She's just demolished world number 62 Anna Blinkova with gutsy groundstrokes and nerveless play, ripping 13 winners to 2 and winning 88 per cent of her first-serve points (albeit only landing it 40 per cent of the time). When is Alex Eala playing? J By Jon Healy You able to also report on Alex Eala? - Rey Hi Rey, We will report on Alex Eala, but the 20-year-old from the Philippines isn't playing until Monday. She starts her campaign against American Alycia Parks in the second match on court six tomorrow. Live: Clutch from Talia Gibson J By Jon Healy (Getty) If Talia Gibson is nervous about playing at her home grand slam for just the third time, she isn't showing it. The 21-year-old is crushing her groundstrokes and nailing serves on big points, saving two break points in her second service game, then breaking again to extend her first-set lead over Anna Blinkova to 4-1. The 27-year-old Russian is not only ranked 62nd as opposed to Gibson's 119, she has also played almost twice as many singles matches on tour. Action about to kick off on the main courts J By Jon Healy The first players of the main draw are set to start on the big arenas in just a minute. First up on Rod Laver Arena we have seventh seed Jasmine Paolini and Belarusian qualifier Aliaksandra Sasnovich: While on Margaret Court Arena it's Greek former world number three Maria Sakkari against Leolia Jeanjean, the 101st-ranked Frenchwoman who is coming off successive losses against Belinda Bencic and Paolini at the United Cup: Live: Talia Gibson opens her Open with a break J By Jon Healy Australian wildcard Talia Gibson has broken in the first game of the tournament, punishing some poor serving from Anna Blinkova. Gibson is ranked 119th in the world, 57 spots lower than Blinkova, but is making the early running on Kia Arena Day groundpasses already sold out for day one C By Chris De Silva (Getty) Talk about anticipation for this Australian Open being at fever pitch already! Play has barely begun at Melbourne Park and groundpasses for the day session have already been exhausted. Huge rankings leap for Aussie women J By Jon Healy Kim Birrell (left) and Taylah Preston (right). (Getty/AP) On the eve of the Australian Open, two Australian women have had enormous rankings boosts thanks to their semifinal runs. Kim Birrell has leapt 31 places to 76th in the world rankings after her run in Adelaide, while Taylah Preston jumped 43 places to 161 thanks to her Hobart tournament that ended at the second least hurdle. Those are the biggest jumps by any players in the top 289 on the WTA rankings. Show more posts",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-18/torres-strait-islanders-commemorate-1936-maritime-strike/106185202",
        "title": "How trailblazing strikers jumped out of windows to oppose government control",
        "publish_date": "Sat, 17 Jan 2026 22:57:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "A whistle rings out. Evening is falling, and it's time for the people of the Torres Strait to abide by their night-time curfew.\n\nIt was almost a century ago that the call of the \"bu\", or trumpet shell, controlled the lives of those across the islands of the Torres Strait.\n\nOnce used by chiefs to call men to battle, the bu, as it was known, became a tool of oppression.\n\nThe pearling industry dominated the Torres Strait economy in 1936. (State Library of Queensland)\n\nThat was, until January 1936, when Torres Strait Islanders decided they had had enough of the discrimination they suffered working on pearling boats.\n\nThey went on strike.\n\nThis week, Governor-General Sam Mostyn attended a ceremony on Thursday Island commemorating the 90th anniversary of the strike.\n\nMs Mostyn said the story \"has not really manifested itself in a way that others have historically for Australia\".\n\nNed David (right) and Torres Strait mayors led a parade on Thursday Island commemorating the maritime strike. (Supplied: Duncan Bain)\n\n\"It shouldn't have taken 90 years to really reflect on this and to learn from what happened in the 1930s and think about how that did shape other things across the country,\" she said.\n\n\"We know a lot about the Wave Hill Walk-Off and the Gurindji people, we know about the Mabo decision and native title, but the thing that has struck me is this story has so much extraordinary background to it.\n\n\"I think what we saw [on Thursday Island this week] was the pride in what happened in the 1930s.\n\n\"There are many family members, descendants of those strikers, who knew how tough it was to live at that time.\"\n\nOppression and control\n\nBack then, the Queensland Government Protector controlled the lives of Torres Strait Islanders, dictating where they could go, how they worked and how they got paid.\n\nFor most, that work was in the pearling industry.\n\n\"A chap by the name of J.D. McLean took up post here in the late [19]20s and started putting some of these new, really restrictive suppressive laws in place,\" said Ned David, chairman of the Torres Strait Islander land and sea council known as Gur A Baradharaw Kod.\n\nNed David reflects on the legacy of the maritime strike. (ABC Far North: Brendan Mounter)\n\nThe Torres Strait supplied much of the global demand for pearls, and the industry employed most of the archipelago's workforce.\n\nWhile some Islanders worked on so-called \"master's boats\", owned by European or Japanese pearlers, many were employed on \"company\" boats controlled by the Queensland Government Protector.\n\nThe company's boat system was restrictive and paid lower wages.\n\nIn many cases, they did not receive cash but credit that could be spent only at designated government stores.\n\nMcLean wanted to boost production on the company boats, but his oppressive approach sparked a revolt with ramifications far beyond pearling.\n\nMichael O'Shane is a long-serving member of the Maritime Union of Australia. (ABC Far North: Brendan Mounter)\n\nMichael O'Shane, whose grandmother used to dive for trochus shells around Masig Island, has heard family stories about the \"invasive, exploitative\" regime of the protector days.\n\n\"They were only paid with flour, sugar and tobacco and stuff like that,\" he said.\n\n\"[Torres Strait Islanders] built the luggers, they owned and operated the luggers, but it was at the protector's discretion on the administration of it, the working of it, the crewing of it, how they were paid.\"\n\nTorres Strait Islanders' money and movement were strictly controlled by a Queensland Government Protector. (State Library of Queensland)\n\nMore than just money\n\nBy January 1936, the Torres Strait Islanders had enough.\n\nWhen McLean went around trying to sign up workers for the company boats, Torres Strait Islanders refused, jumping out of meeting hall windows in protest.\n\nThe strike made headlines in the Cairns and Brisbane dailies, and after nine months, McLean was removed from his post and replaced by another protector.\n\nThe nightly curfew was scrapped, and Torres Strait Islander pearlers were given more pay, control of their own boats and more freedom to travel between islands without the need for permission.\n\n\"You can only imagine back then, with limited means of communication — there was nothing like a telephone or anything — how people were able to organise themselves to basically synchronise the strike to take place at almost the same time across the entire region,\" Mr David said.\n\n\"It's very interesting to know that our people came together, sat down and said 'we're not going to take this anymore,'\" Mr O'Shane said.\n\nPearl racks off Friday Island are one of the remaining signs of a once-massive industry that boomed across the Torres Strait. (Nikolai Beilharz: ABC Rural)\n\n\"We stand on those shoulders today.\"\n\nMr O'Shane, a maritime worker and unionist, said the actions of his ancestors resonated with the broader Australian value of a fair go.\n\n\"It exposed the situation to the world, what was happening to the First Nations people of his country,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-18/agnes-water-surfing-culture/106078546",
        "title": "Tourists triple the population of this coastal town, and some never leave",
        "publish_date": "Sat, 17 Jan 2026 21:59:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's the picturesque kind of place travellers visit once and decide to stay.\n\nAngus Darling was tripping around the country in a caravan with his wife and children when he made a stop at Agnes Water, a coastal town in central Queensland.\n\n\"It does suck people in,\" Mr Darling said.\n\n\"But it's not until you live here and you start connecting with people and it really does draw you into that Agnes bubble,\" he said.\n\nAngus Darling decided to settle in Agnes Water with his family after travelling around Australia. (ABC News: Nandini Dhir)\n\nPart of the town's \"bubble\" are ex-professional surfer Zane Harrison, who runs a local surf school, and board maker Bruce Palmer.\n\nAgnes Water is known to have some of the most northerly point breaks on Australia's east coast, with \"secret\" secluded beaches part of its allure.\n\nDespite having smaller or inconsistent waves at times, the coastal town is loved by surfers. (Supplied: Surfs Up Eastern Suburbs)\n\nMr Darling has lived in the town since 2021, working remotely for his employer in Sydney.\n\nIt didn't take him long to be elected president of the Tide n Turn Boardriders Club—a position he has held for two years now.\n\nIt is one of the oldest boardriding clubs in the country, having turned 60 last year.\n\n\"[The club] really started as a group of mates coming down to hang out and camp, and they used to get waves … but it was more just about that connection,\" Mr Darling said.\n\nThe surf community in Agnes Water has grown, particularly with the influx of young families in the area. (ABC News: Nandini Dhir)\n\nAn avid surfer himself, Mr Darling said the club had seen a surge in memberships from young families who moved to the region around the pandemic.\n\nPaul White has lived in the town for the past 25 years and has helped foster the community's love of surfing.\n\nPaul White says the surf in Agnes Water is not \"consistent\". (ABC News: Nandini Dhir)\n\n\"There's surf right along the coastline to where the Great Barrier Reef chops [the swell] off … so there's all these little magical beaches,\" he said.\n\nMr White is the director of the local longboard classic surf competition, an event he said has grown as more families chose Agnes and the nearby town of Seventeen Seventy as their homes.\n\nThe Agnes Water Longboard Classic competition kicks off in March. (Supplied: Surfs Up Eastern Suburbs)\n\nHe said while the waves were not always consistent, surfers here have a better chance out on the water.\n\n\"You go out surfing for the day, and you get 30 to 40 waves in your session here at Agnes Water, and you feel really great because you've done what surfing's about,\" Mr White said.\n\n\"[But] down south, they're populated, it's hard to get waves.\"\n\nA competitor at the Agnes Water Longboard Classic. (Supplied: Surfs Up Eastern Suburbs)\n\nSmall town, small surf\n\nWith a population of less than 3,000 people, Agnes Water has become a laid-back tourism destination.\n\nAmber Rodgers says the gentle waves at Agnes Water and 1770 make the beaches appealing to beginner surfers. (ABC News: Jasmine Hines)\n\nPresident of Discovery Coast Tourism and Commerce, Amber Rodgers, said the town's population roughly tripled during peak holiday periods.\n\n\"Essentially for us, domestic visitors are really our number one bread and butter, all year-round, and from all parts of the country,\" Ms Rodgers said.\n\n\"We see caravaners from Adelaide and Victoria, we see a lot of local people from just within our 400 [kilometre] radius close to here, and they often love to visit more than once a year.\"\n\nThe Agnes Water main beach is loved by locals, tourists and pooches. (ABC News: Jasmine Hines)\n\nMs Rodgers said the region had an average of 300 days of sunshine, and the main beach offered beginners excellent conditions for learning to surf.\n\nAccording to the most recent census data, from 2016 to 2021, the Agnes Water and Seventeen Seventy area grew in population by about 25 per cent.\n\nSecret spots and camaraderie\n\nDespite its popularity, locals said visitors don't generally come for the waves, which can be irregular or small.\n\nAmber Walker got involved with the local surf club before becoming an instructor herself. (ABC News: Nandini Dhir)\n\nSurf instructor Amber Walker moved with her family to Agnes Water and has been a member of the boardriders club for about a decade.\n\n\"The waves definitely don't attract people because they're not consistent, but it's more so the small town and the community that you only get in small country towns,\" she said.\n\n\"It's the friendship, it's the camaraderie, all those things.\"\n\nThe town is known for its sense of community and love of the outdoors. (ABC News: Jasmine Hines)\n\nShe joined the club for social reasons and later became an instructor at a local surf school.\n\nAyla Klicker, 17, moved to the town with her family a decade ago.\n\nShe had surf lessons with Ms Walker for about a year.\n\nAyla Klicker says the secret surf spots at Agnes Water will \"have to stay secret\". (ABC News: Nandini Dhir)\n\nMs Klicker said she used to be apprehensive about getting into the water but felt welcomed by other surfers.\n\n\"I used to be super scared going out because there weren't that many girls that surf … but recently there's been a lot more girls getting into it,\" Ms Klicker said.\n\nShe said she had built her confidence and had discovered several secret spots.\n\n\"We've got some secret spots, and you'll never see anyone at them, so they'll have to stay secret … but it's super fun if you look for them,\" Ms Klicker said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-18/teenagers-building-bike-jumps-learn-leadership/106231348",
        "title": "Work with kids, instead of destroying their bike jumps, authorities told",
        "publish_date": "Sat, 17 Jan 2026 21:56:47 +0000",
        "category": "sports",
        "authors": [],
        "text": "In a patch of private bushland outside Launceston, 16-year-old Zeke Woolcock meticulously crafts piles of dirt into jumps and berms.\n\nUsing only handheld tools, he and his mates have moved tonnes of dirt in recent months, spending their free time and the boundless energy teenagers possess.\n\nBut this is the second time Zeke has transformed a landscape into a biking playground, and he admits that, not knowing any better, the first time around, he did the wrong thing.\n\nHis first jumps were built on public land, where any development needs assessment for safety, conservation and heritage reasons, and one day he woke up to a text from a mate saying they had been destroyed.\n\nFellow bike enthusiast Robert Potter follows Zeke over the bike jumps he built. (ABC News: Morgan Timms)\n\nAuthorities destroying bike jumps built illegally by kids is not a new thing, but research indicates that those authorities should instead seek to work with young people on building trails.\n\nAnd that is what a Launceston-based professional trail builder wants to do.\n\nTeenager built 'pride and joy' in the wrong place\n\nLike many kids, Zeke fell in love with riding bikes at a young age and quickly progressed to higher and higher skill levels, now capable of technical tricks over large jumps at speed.\n\nHe started building jumps a few years ago near his home in a Launceston suburb and then progressed to bushland near the city's stadium.\n\nHe said he and his mates put in months of work, often at night after TAFE and school, over winter, building the jumps.\n\n\"We found a really good convenient location with good dirt that was right next to the Silverdome,\" he said.\n\n\"I'd probably done four of five months of work. Quite a few long nights in the dark … just building and building and building.\"\n\nZeke and his mates built their first lot of jumps on public land near Prospect in northern Tasmania. (ABC News: Morgan Timms)\n\nBut that's where he ran into trouble, because that \"good dirt\" was in the Kate Reed Nature Recreation Area, which is public land managed by the Parks and Wildlife Service.\n\nThe PWS subsequently destroyed the jumps.\n\n\"I saw my pride and joy being taken down,\" Zeke said.\n\nZeke estimates he and his mates spent five months building the jumps that were ultimately destroyed. (ABC News: Morgan Timms)\n\nThere are mountain bike tracks in the reserve, but they have been officially sanctioned by the PWS and conform to safety and conservation requirements.\n\nNeighbour dobs children into council over bike jumps Brisbane City Council has destroyed \"incredibly dangerous\" bike jumps at Bulimba's Johnston Park which it said could get it sued if a child injured themselves.\n\nZeke said he should have been \"more responsible\".\n\n\"The first few days I was quite upset … but I did realise in the end it was the wrong thing to be doing.\"\n\nIn a statement, the PWS said it removed \"illegal jumps\" from the area in July 2025.\n\n\"These jumps were unsafe for general public use and not built to standard,\" a spokesperson said.\n\n\"Without the required assessments, developments can impact threatened species, communities and Aboriginal heritage.\n\n\" Inappropriate construction may also cause erosion and safety issues. \"\n\nTasmania's parks service says the jumps were \"unsafe for general public use and not built to standard\". (Supplied: Tasmania Parks and Wildlife Service)\n\nTrail builder built career out of teenage hobby\n\nRobert Potter builds mountain bike trails for a living, and knows all too well how much young people like to build jumps in the bush.\n\n\"This happens all around the world,\" he said.\n\n\" Thirty years ago I was doing exactly the same thing and the jumps would be flattened, and we would build them again. \"\n\nMr Potter has been building bike jumps since he was a kid and now does it for a living. (ABC News: Morgan Timms)\n\nHe believes the best way to overcome the problem is to involve young people in building and maintaining officially sanctioned trails.\n\n\"We really do need to find a way to harness the enthusiasm and ability of the riders who want to contribute to maintaining these public assets,\" he said.\n\n\"Often, the best we can do is to replicate what the kids are building for themselves.\n\n\" But that doesn't satisfy the need they have to actually do the building and all the good things that come from that. \"\n\nMr Potter says officials will often replicate the bike jumps built by young people. (ABC News: Morgan Timms)\n\nTeamwork, leadership dug out of the dirt\n\nTasmanian course praised after hosting national championships Australia's best mountain bike riders battle for the national championship in north-east Tasmania.\n\nUniversity of Melbourne researcher David Camilleri has been looking at those \"good things\".\n\nDr Camilleri said when young people worked together to build jumps in the bush, it could foster leadership, teach problem solving and create a sense of community.\n\n\"It's just young people wanting to create a space for themselves,\" he said.\n\n\" And they do it using shovels and digging these jumps and going there and riding together and building these same social connections. \"\n\nDr Camilleri collaborates with local councils and community groups to promote BMX as a tool for mental health and wellbeing. (Supplied: David Camilleri)\n\nZeke said those were exactly the types of things he felt he learned while building his jumps with his mates.\n\n\"I've found it has really helped me become a leader.\"\n\nMr Potter said it was that type of environment that led him to the career he has today.\n\n\"We developed a community around the jumps that we had,\" he said.\n\nBut there may be positive outcomes that can be disrupted when jumps are destroyed.\n\n\"The demolition of jumps can also erode trust in governments and institutions,\" Dr Camilleri said.\n\nThe first lot of bike jumps Zeke built were destroyed. (ABC News: Morgan Timms)\n\nThe researcher suggests, as Mr Potter has done, that authorities should engage and consult with young people about approved tracks, and explain why unsanctioned tracks may be unsafe.\n\nThe Parks and Wildlife Service said it sought to consult with the builder of the illegal jumps removed last year, but no communication was received.\n\n\"PWS and the Launceston Mountain Bike Club continue to work together to ensure appropriate approval processes are adhered to and that tracks in the area are at an appropriate safe standard for public users,\" it said.\n\n\" Young people and all members of the public are encouraged to liaise and work with PWS and the Launceston Mountain Bike Club on any proposed future developments. \"\n\nState's mountain bike tracks not always accessible\n\nZeke is still working on his jumps on private land near Kate Reed, and has had some positive feedback on his efforts.\n\nBut even without that, he said he would still want to find ways to continue building jumps with his mates.\n\n\" Even if I had nowhere to build, I would still find a way to do it. \"\n\nZeke says building bike jumps with his mates helped him \"become a leader\". (ABC News: Morgan Timms)\n\nHe said that even though Tasmania has a lot of well-built, approved bike riding trails in places like Derby and Maydena, he's not often able to travel.\n\n\"People can go to other parts of the state and get some amazing mountain bike trails, but I didn't really have that option,\" he said.\n\n\" So instead of going over to bike parks, I decided I'd bring the bike parks to me. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-18/brain-cancer-abbey-barrett-family-campaigning-for-funding/106231668",
        "title": "None in family history, yet 'cancer still found us in the worst way'",
        "publish_date": "Sat, 17 Jan 2026 21:20:37 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "At the end of every day the Barrett family puts a colourful sticker on the lounge room wall.\n\nIt is a symbol they have survived another day without their precious daughter and sister Abbey who died of brain cancer 18 months ago.\n\nShe was 11.\n\nJustine says that since losing Abbey the family \"talk a lot about her\" as a means of coping. (ABC News: Maren Preuss)\n\nMother Justine, father Rick and sisters Willow and Tasmin try to honour Abbey in little ways every day.\n\nHer teddy is at the dinner table where she used to sit and a vegetable patch has been replaced with a flower garden.\n\n\"None of it feels like enough but we're very open, we talk a lot about her,\" Justine said.\n\n\" The grief is brutal. \"\n\nAbbey Barrett in hospital during treatment. (Supplied: Barrett family)\n\nIf you or anyone you know needs grief support: Griefline: Phone support for all Australians Monday to Friday and 24/7 online forums. Call 1300 845 745 from 8:00am to 8:00pm AEDT\n\nfrom 8:00am to 8:00pm AEDT Lifeline: 24-hour support for all Australians on 13 11 14\n\nAbbey was the youngest of the girls, all close in age, and a \"cool human\" according to Justine.\n\n\"She was joy on two legs. She was like a puppy, she just brought that energy and joy,\" she said.\n\nWhen Abbey was 10, her parents noticed she was tired and had developed hand tremors.\n\nShe had a blood test and everything was normal.\n\nBut when she started having trouble with her vision, an MRI revealed she had a brain tumour the size of a fist wrapped around her brain stem.\n\nThe family felt a shock \"almost like an earthquake\".\n\nJustine says they decided \"when you die you go to a park that's full of loaded fruit trees and puppies\". (ABC News: Maren Preuss)\n\n\"We have no family history of cancer. Yet cancer still found us in the worst way,\" Justine said.\n\n\"We went from having Lego and books on the kitchen table to medications and cancer brochures. It was incredibly surreal,\" she said.\n\nAbbey had two brain surgeries, chemotherapy and radiation.\n\nWhile the Barretts were supported by medical professionals, navigating her care was difficult, with them needing to make calls on when to take her to hospital or when to manage her symptoms at home.\n\nAbbey's mother Justine said her daughter knew she was dying. (Supplied: Barrett family)\n\n\" These decisions were one of the hardest parts because the consequences of making the wrong decision were literally life and death. \"\n\n'She died at home, in our bed, in my arms'\n\nJustine said Abbey knew she was dying.\n\n\"I had to have conversations with her about what that meant,\" Justine recalled.\n\n\" We decided that when you die you go to a park that's full of loaded fruit trees and puppies. \"\n\nJustine says her other daughters struggle with the weight of the grief of losing Abbey. (ABC News: Maren Preuss)\n\nAbbey died a year after her diagnosis.\n\n\"She died at home, in our bed, in my arms. We tried to make her death as gentle and easy as possible,\" Justine said.\n\nBut Abbey's death was far from easy.\n\n\"Why don't we have voluntary assisted dying for children? The last ten hours of Abbey's life were agony to witness,\" Justine said.\n\nAt the same time, Abbey's parents needed to consider how their other two girls were coping.\n\nThey wanted to normalise the death and grieving as much as they could.\n\n\"After she died we drew pictures and wrote messages on her stomach and arms as a way of sending her body off with love,\" Justine recalled.\n\nShe said her daughters struggle with the weight of the grief of losing their sister Abbey.\n\n\"They've had some pretty big challenges since,\" Justine said.\n\n\"I am really proud of them, it's been a really big journey.\"\n\nAbbey's sisters and the many photos of Abbey in their home. (ABC News: Maren Preuss)\n\nOlder sister Willow said she felt helpless watching Abbey suffer through brain cancer.\n\n\"I don't think I can put into words how hard it was,\" she said.\n\n\"My mental health journey has been very bumpy since so I am having to do part-time at school.\"\n\nJustine has chosen to share her family's story, hoping it will send message to the Australian government.\n\n\"Put some funding towards brain cancer, because we're failing our children,\" she said.\n\n\" Our job as adults, at the very least, is to raise our children to become adults themselves and we're failing that. \"\n\nAbbey Barrett died a year after her diagnosis. (Supplied: Barrett family)\n\nThe 'horrible' statistics\n\nBrain cancer, often described as \"rare\", accounts for about 2 per cent of all cancers.\n\nTo put that figure into perspective, more Australians die of brain cancer than the number of people killed in road accidents every year.\n\nRemembering Charlie and others gone far too soon because of brain cancer The memory of Charlie, symbolised by shoes and his story, will be just one of many taken to Canberra to \"raise awareness of the horrific effects and unimproved life expectancy from brain tumours\".\n\nIn 2023, Australia saw 1,579 people die from brain cancer, compared with 1,254 road crash deaths that same year.\n\nIt's the disease that kills more Australian children under 14 than any other.\n\nBrain cancer's five-year survival rates have only improved marginally in the last three decades, from 19 per cent (1990-1994) to 23 per cent (2015-2019).\n\n\"That flat, virtually flat curve and low survivability is a horrible statistic,\" said Craig Cardinal from Brain Tumour Alliance Australia.\n\n\" It's hard not to be heartbroken by that. \"\n\nBrain cancer victims are remembered at Parliament House, Canberra, as part of 2025 Head to the Hill event. (ABC News: Andy Cunningham)\n\nIn recent years the shoes of Australians who have lost their lives to the disease have been placed on the lawns outside Parliament House in Canberra.\n\nIt's a call for action and funding.\n\nRenowned doctor's cancer battle 'getting closer' to the end Former Australian of the Year Richard Scolyer made the comments next to the prime minister after a position at Chris O'Brien Lifehouse was named after him.\n\nDr Rosemary Harrup is a medical oncologist and researcher at the Menzies Institute for Medical Research in Tasmania.\n\nShe said while there is a range of different brain cancers, the most aggressive is glioblastoma.\n\n\"About a quarter of these people are alive at two years [after diagnosis]. These are devastating figures,\" Dr Harrup said.\n\nNew techniques to cross the blood-brain barrier offering hope\n\nWhile brain cancer is complex and difficult to treat, surgical techniques to remove tumours have improved in recent years.\n\n\"Unfortunately there's always going to be residual cells from which the cancer will regrow,\" Dr Harrup said.\n\nProfessor Rosemary Harrup is one of those working to solve the blood-brain barrier puzzle. (ABC News: Maren Preuss)\n\nTreatments span radiotherapy, chemotherapy and immunotherapy — but there are challenges.\n\nThe brain is protected by an intricate network of blood vessels, which work to protect it from foreign materials.\n\n\"That's called the blood-brain barrier, and so most treatments need to be able to cross that to be effective,\" Dr Harrup said.\n\nShe said an international study using ultrasound to open the blood-brain barrier for short periods, combined with chemotherapy, is proving promising.\n\n\"It's almost like science fiction and can allow the drug just in that short window of opportunity to cross into the brain.\"\n\nResearchers at the Menzies Institute are using flies to help develop brain cancer treatments for humans. (ABC News: Maren Preuss)\n\nWorking out which part of the puzzle is broken\n\nAssociate Professor Phillippa Taberlay and her team at the Menzies Institute are working on finding solutions at the DNA level, looking at a type of childhood cancer called medulloblastoma.\n\n\"It's a type of cancer which has a very high rate of epigenetic dysregulation, which means the way genes are expressed have been altered,\" Dr Taberlay said.\n\n\" We are looking at how DNA inside of the cell is folded or modified with little chemical tags. \"\n\nDr Phillippa Taberlay says discoveries about brain cancer are applied to other cancers. (ABC News: Maren Preuss)\n\nShe said understanding which chemical tags aren't behaving as they should will help determine where the fault in the body is.\n\n\"If we can discover which proteins or parts of the puzzle are broken we will be able to use really sophisticated genetic tools or new pharmacology to treat brain cancers,\" she said.\n\nDr Taberlay believes any discoveries about brain cancer could be applied to other cancers.\n\nAbbey is remembered by her family as being \"like a puppy … she just brought that energy and joy\". (ABC News: Maren Preuss)\n\nBrain cancer missing out on funding\n\nClinical trials of new treatments can offer hope to cancer patients, but Dr Harrup said funding for them is limited.\n\n\"It is unfortunate that if you live in a major capital city and you have brain cancer you are much more likely to be able to enrol in a clinical trial than if you live in country Victoria or Tasmania,\" she said.\n\nBrain cancer's survival rates have changed little over the past 30 years and is the cancer that kills the most children in Australia. (ABC News: Andy Cunningham)\n\nBrain Tumour Alliance Australia has been mapping the burden and economic cost of brain cancer in Australia, which in 2025 was $850 million.\n\nIf trends continue the mapping estimates the cost at $3.2 billion by 2050.\n\nIt's hoped the mapping will unite the brain cancer community and fundraising efforts, and make research and funding a government priority.\n\nJustine leafs through a scrapbook for Abbey, her tattoo tribute visible on her wrist. (ABC News: Maren Preuss)\n\nThe alliance is asking the federal government for $200 million over 10 years for brain cancer research and trials, and up to $10 million to improve clinical care for patients, including funding for specialised nurses.\n\n\"The burdens and impacts are disproportionately high, the complexity of the disease is disproportionately high, but our funding and policy approach to address that complexity is mismatched,\" Mr Cardinal said.\n\nCraig Cardinal is one of those heading the campaign to lobby for more money to fight the disease. (ABC News: Mark Moore)\n\nThe Alliance said direct research funding for brain cancer has consistently lagged behind other cancers.\n\nIt states that from 2003 to 2020 brain cancer received $111.6 million in total project funding — well below breast cancer ($431.6 million) and leukaemia ($234.7 million).\n\nIn 2017 the Australian Brain Cancer Mission invested $126 million over 10 years for brain cancer research, $50 million came from government, while $76 million was from philanthropic organisations.\n\n\"I'm certainly committed to doing more … as that mission comes to an end. We've already started discussions with the Brain Cancer Alliance about what that looks like,\" said federal Health Minister Mark Butler.\n\nMark Butler says the government is \"working as hard as we can\" to get cancer drugs on the PBS \"as quickly as possible\". (ABC News: Rebecca Trigger)\n\n\"In the meantime whenever there are new treatments, particularly for children with brain cancer, we're working as hard as we can to get those medicines available to families on the PBS as quickly as possible.\n\n\" This is a stubborn area of cancer where I think every country, including ours, wants to see improvement. \"\n\nDr Harrup said \"talking about a cure is important because that's what we strive for and that's what our mission is.\"\n\n\"For those patients we can't cure right here and now, improving quality of life and quantity of life are both very, very meaningful goals,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-18/breakdancing-stars-descend-brisbane-olympics-2032-bid/106237298",
        "title": "Breakdancing stars in Brisbane to bid for Olympics inclusion",
        "publish_date": "Sat, 17 Jan 2026 21:18:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "Inside the prestigious Brisbane City Hall in the countdown to the 2032 Olympic Games, thumping music shakes the walls where almost 200 breakdancers from across 33 countries have gathered to compete.\n\nThis weekend's World Dancesport Federation competition is part of the bid to secure the sport's presence at the 2032 Brisbane Olympic and Paralympic Games.\n\nBenmx has been breaking since his family moved to Queensland in 2015. (Supplied)\n\nAmongst the talented competitors is a group of Australian athletes determined to define their own Olympic image, emerging from the shadow cast by Raygun at the last Games.\n\n\"It was just that small snippet: there's so much more to breaking,\" said Benji Cogdell-Baird, acclaimed on an international stage as Benmx.\n\nThe 18-year-old has been breaking since his family moved to Queensland from South Australia when he was seven.\n\nBenmx says breaking gave him an outlet when his brother was ill. (Supplied)\n\n\"When we moved up here, my brother had a cardiac arrest. At the time, it was very stressful for my parents having to manage all of that,\" he said.\n\n\"They put me in the sport to take my mind off all the things that were happening.\n\n\"They put me in the sport to take my mind off all the things that were happening,\" Benmx says. (Supplied)\n\n\"It was explosive and powerful. I just ended up falling in love with it straight away.\"\n\nThe Gold Coast teenager said he wanted more Australians to feel that passion for a sport that was not \"too exposed\" on home soil.\n\nBenmx was born in South Australia but now calls the Gold Coast home. (ABC News: Lucy Loram)\n\n\"I'd like to show the world that it's such an entertaining sport and it's like none other. When was the last time you saw [someone] spinning on their head?\"\n\nThe teenager wants more Australians to feel the passion. (Supplied)\n\n'Individual personalities and flavours'\n\nThe words 'Australian breakdancer' became tied to one notable performer in 2024, when Raygun hopped around the Olympic stage in green and gold. She failed to score any points in her three bouts in Paris.\n\nThe routines made international headlines, but general secretary of DanceSport Australia Luke Brown said it was time for other Olympic and non-Olympic breakers to take over the spotlight.\n\n\"Paris 2024 was an amazing success for breaking. Raygun represented Australia, and she went forward and bought what she thought was her best performance,\" he said.\n\nLuke Brown says breaking deserves its place in the Olympics. (ABC News: Lucy Loram)\n\n\" But we're moving forward in a way that showcases all of our athletes and their own individual personalities and flavours. \"\n\nProfessional breaker J-Attack, otherwise known as Jeff Dunne, had a taste of the Olympic limelight at the Paris Games.\n\n\"Just being able to represent Australia at one of the highest sporting areas is such an honour and such a privilege,\" he said.\n\nLoading Instagram content\n\nWith five billion people watching the Paris Olympics two years ago, Mr Dunne said he was hopeful that breaking could reach similar audiences from Brisbane in six years' time.\n\n\"I'd like Australia to understand the difference between watching breaking and seeing it live,\" he said.\n\n\"It also allows competitors to travel across the world to meet new people that share the same experience as you, who have put in all that hard work and discipline.\"\n\n17-year-old Guo Pu from China, who is ranked number one in world youth under the stage name B-Girl Royal, said the lively art form was active across the world, including in Australia.\n\n\"I don't think there is a big difference in communities because we are altogether dancing for our love of this sport and art form,\" she said.\n\n\"We hope to invite more people to experience and appreciate breaking.\"\n\nMr Brown said fresh talent were accepting that invitation, within the scope of World DanceSport Federation competitions.\n\n\"We're seeing an increase of participation across the country, we're not seeing a decrease,\" he said.\n\n\"We're seeing an increase of registrations worldwide and in Australia as well.\"\n\nJeff 'J-Attack' Dunne represented Australia in the 2024 Olympics for breaking. (Reuters: Angelika Warmuth)\n\nOlympic prospects\n\nBreaking was one of many sports vying to be selected by the international Olympic and Paralympic committees for the 2032 program.\n\nWhy Raygun hit a nerve There's an elite club of Olympic losers who we love to celebrate. A year on from Raygun's infamous performance, Australian Story investigates why she isn't one of them.\n\n\"We are focused on designing a sport programme that reflects the values of the Olympic and Paralympic Movements, is operationally viable, and supports Brisbane 2032's commercial, sustainable and engagement and experience objectives,\" said a Brisbane 2032 spokesperson.\n\nWith the sport not featuring in the 2028 Los Angeles Games, its fate in Brisbane will be decided by the committees later this year.\n\nPresident of the World DanceSport Federation, Shawn Tay, said the weekend's competition in Brisbane was a positive sign that Australia had an appetite for global breakdancing performances.\n\n\"This is perhaps the most important event before the Olympic Games Committee makes its decision to include new sports in Brisbane 2032,\" Mr Tay said.\n\n\"Many of our top athletes are here, including many young world champions, to showcase what they do best in breaking.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-18/womens-tour-down-under-crashes-australian-team-day-one/106241648",
        "title": "Crashes thwart Australian team on day one of women's Tour Down Under",
        "publish_date": "Sat, 17 Jan 2026 21:11:13 +0000",
        "category": "sports",
        "authors": [],
        "text": "Crash carnage has put the Australian Liv Jayco AlUla team on the back foot at the women's Tour Down Under.\n\nWhile they are at least one rider down heading into Sunday's second stage, New Zealander Ally Wollaston and her FDJ United-Suez teammates will try to retain the race leader's ochre jersey.\n\nItalian Alessia Vigilia, who left FDJ at the end of last season, is also off to a great start at Uno-X Mobility thanks to her 100km solo break, which was caught only within 300m of the finish on Saturday at Willunga.\n\nLiv AlUla Jayco came into the Santos Tour on the back of an outstanding campaign at the Australian road cycling championships in Perth.\n\nRuby Roseman-Gannon won the criterium and first-year WorldTour rider Mackenzie Coupland capitalised on great team riding to clinch the women's elite road race.\n\nIt was in stark contrast to the Jayco AlUla men, who botched the finish to their elite road race.\n\nBut Liv AlUla Jayco lost some crucial horsepower during the week when Amber Pate crashed in training. She did not start stage one because of her injuries.\n\nThen inside the last couple of kilometres on Saturday, a crash took out Roseman-Gannon and several teammates.\n\nGeorgia Baker was left with a bloodied knee and has been withdrawn from the second stage.\n\n\"All the riders have been through their fair share of crashes in their careers, so when you walk away like this … it can be a lot worse,\" team manager Jess Allen said.\n\n\"It's not what you want, but we also have two days ahead and two new opportunities to turn things around.\"\n\nThe Tour will continue on Sunday with the 130.7km stage from suburban Norwood to Paracombe in the Adelaide Hills.\n\nWollaston probably will not retain the overall lead given the climbing involved on Sunday, but she is determined to make opponents work for it.\n\n\"I will try and do it justice — it would be rude not to,\" she said.\n\n\"You have to respect a jersey like this in the WorldTour. We'll do everything tomorrow as a team to keep this jersey in the team.\"\n\nDespite being overtaken so close to the finish, Vigilia was also upbeat about her form and settling into her new team.\n\n\"It's really nice to feel that we work well. It's hard to arrive here and adapt to the jet lag and heat,\" she said.\n\n\"So this is a good sign that we are prepared and we will show it again.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-18/forgotten-songs-from-2005-hottest-100-bloodhound-gang/106146344",
        "title": "Do you remember these seven songs from the Hottest 100 of 2005?",
        "publish_date": "Sat, 17 Jan 2026 21:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Every year, Double J counts down the Hottest 100 from 20 years ago.\n\nIt's a chance for some of us to reminisce about simpler times, and for younger music fans to discover songs that might have slipped through the cracks.\n\nIt's not that these tracks aren't great — far from it — but with thousands of tunes released every year, even the best can fade from memory.\n\nThese 10 really struck us when looking at the full list from the 2005 Hottest 100, and we want to share them with you.\n\nWe're not saying your memory's shot. We just want to bring these gems back into your life.\n\nSo, settle in and get ready to revisit some of the highlights from a truly great year in music.\n\nThe Bloodhound Gang — Foxtrot Uniform Charlie Kilo (#24)\n\nThe title, Foxtrot Uniform Charlie Kilo, sues the NATO phonetic alphabet to communicate the song's subject matter. (Supplied: Geffen Records)\n\nYouTube | Spotify | Apple Music\n\nSix years after cracking the Hottest 100 top 10 with The Bad Touch — whose words were deeply etched into the minds of every 2000s schoolyard kid — The Bloodhound Gang returned to the countdown with Foxtrot Uniform Charlie Kilo in 2005.\n\nThough it capitalises on the same sexual innuendo schtick, can you dig up a single line from the memory bank? I sure as heck can't.\n\nThe track's generic alt-rock and music video — featuring bikini models with power tools and Bam Margera driving a banana car through a tunnel — have not aged well. But the song's various slang for intercourse (\"Marinate the nether rod in the squish mitten… Batter dip the cranny ax in the gut locker\") can still elicit a chuckle or two.\n\nAl Newstead\n\nArchitecture in Helsinki — It'5! (#56)\n\nIt'5! was a highlight of Architecture In Helsinki's dazzling second album (Inertia Music)\n\nYouTube | Spotify | Apple Music\n\nThey ended up reaching far greater heights, including two spots in the Hottest 100 top 20 in following years, but It'5! gave Architecture In Helsinki their first ever spot in the Hottest 100.\n\nThe song was a highlight of In Case We Die, the second album from the Melbourne pop experimentalists, and sounded like nothing else in the countdown.\n\nThis nonlinear blast of chamber pop jumps around a lot, packing chorus vocals, brass sections, nursery rhyme chanting, and lots of handclaps into a tight two-minute package.\n\nYou might still have Escapee or Heart It Races on your playlists — now it's time to get reacquainted with It'5! — a sugar hit you won't regret.\n\nDan Condon\n\nThe Bravery — An Honest Mistake (#48)\n\nAn Honest Mistake would be the first and last time The Bravery made the Hottest 100. (Supplied: Island/UMG)\n\nYouTube | Spotify | Apple Music\n\nI can still recall this tune's chorus — heck, even this NYC band's solid self-titled album and its cover! But I imagine for most folks, An Honest Mistake would simply trigger reactions of 'oh yeah, those guys…'\n\nSpringing up in the wake of The Killers's breakthrough debut album Hot Fuss, The Bravery hewed so closely to the same new wave inspired indie rock sound that Killers frontman Brandon Flowers accused them of ripping him off.\n\n\"They're signed because we're a band,\" Flowers told MTV at the time. \"I can see The Strokes play [and] it's real, and I haven't gotten that from The Bravery. I think people will see through them.\"\n\nHis trash-talking sparked a feudal back-and-forth with The Bravery's Morrissey-but-make-it-punk singer Sam Endicott. It's safe to say The Killers won the war.\n\nThe Bravery stopped releasing records by the end of the 2010s. Though they did play a one-off reunion show in 2021 alongside, strangely, Tame Impala, with a set featuring, stranger still, covers of Fugazi, Descendents and Black Flag.\n\nAl Newstead\n\nLittle Birdy — Six Months In A Leaky Boat (#96)\n\nSix Months In A Leaky Boat was also the b-side of Little Birdy's Come On Come On single.\n\nYouTube | Spotify | Apple Music\n\nWe were still a little way off from the dominance of Like A Versions, but one particular set of covers proved very popular in the 2005 countdown.\n\nWe know you haven't forgotten Little Birdy. The band are Hottest 100 royalty and the mid 2000s was when they were really at the height of their powers.\n\nSome people may, however, have forgotten She Will Have Her Way, a tribute to Neil and Tim Finn that had a bit of an impact of the Hottest 100 of 2005.\n\nLittle Birdy gave us a faithful take on the Split Enz classic, retaining its energy and idiosyncrasies while putting their own sonic stamp on things.\n\nKaty Steele is outstanding out the front, the perfect voice to nail those incredibly high notes while her band deftly navigate the tricky arrangement.\n\nWith Split Enz reforming for shows in 2026, there's no better time to reacquaint yourself with this version. And it's part of the newly reformed band's setlist\n\nDan Condon\n\nEmiliana Torrini — Sunny Road (#44)\n\nmilana Torrini's fourth album, Fisherman's Woman managed to crack the ARIA top 100. (Supplied: Rough Trade)\n\nYouTube | Spotify | Apple Music\n\nPersonally, this was a case of a pleasurable refresher, largely because my mother was a fan (shout out Trish)!\n\nFramed as a letter to a lost lover, Sunny Road is a whimsical slice of folk where guitar and keys swirl around Torrini's soft voice yet staunch lyrics. 'I never married, never had those kids / I loved too many, now heaven's closed it gates,\" she sings. \"Some things don't change, my middle name's still 'risk'\".\n\nIt remains the Icelandic singer-songwriter's most popular song (alongside Jungle Drum) but turns out she's got a fascinating wrap sheet.\n\nA member of Reykjavík electronic collective GusGus before going solo, Torrini won an Ivor Novello Award for co-writing Kylie Minogue's slinky 2003 hit Slow. That was a year after she sang Gollum's Song for movie blockbuster The Lord of the Rings: The Towers.\n\nHer fourth album Fisherwoman's Woman, from which Sunny Road is lifted, was produced by Dan Carey — the esteemed UK producer best known for manning records for Fontaines D.C., Wet Leg, Black Midi, Squid and others. The more you know!\n\nAl Newstead\n\nScissor Sisters — Filthy/Gorgeous (#83)\n\nThe eponymous Scissor Sisters album cracked the top 10 in the Australian ARIA Album Charts. (Supplied: Polydor)\n\nYouTube | Spotify | Apple Music\n\nThere was a time it was difficult to escape these glam rock revivalists. Singles like the Elton John-adjacent hoedown Take Your Mama, for instance, or the discoteque rework of Pink Floyd's Comfortably Numb that caught everyone's attention to begin with.\n\nHowever, Filthy/Gorgeous is a deeper cut from the group's debut album that might've slipped you by. It might not be as memorable, but it's got all the Scissor Sister hallmarks — the Bee Gees falsetto of Jake Shears, irreverent pop lyricism, and throbbing disco groove (that recalls, of all things, Super Mario Bros.)\n\nAl Newstead\n\nThe Butterfly Effect — Phoenix (#33)\n\nPhoenix never made a Butterfly Effect album but its their second-highest ever charting in the Hottest 100. (Supplied: The Butterfly Effect) ]\n\nYouTube | Spotify | Apple Music\n\nProg-leaning Australian hard rock was really having a moment in 2005, as evidenced by several Hottest 100 entries. Perth had Karnivool. Byron Bay had J Award nominees COG. And Brisbane? They had The Butterfly Effect.\n\nNow, I can remember triple j spinning their Deftones-esque 2001 song The Cell. And even 2003 debut album Begins Here. But apologies, it's a complete blur after that. Phoenix was a B-side and later live fan fave that missed out making the tracklist for the band's next album (Imago, 2006).\n\nIt holds up okay in 2025, even if the rap-rock backing grunts feel very time-and-place. Despite The Butterfly Effect remaining active, Phoenix hasn't appeared in a setlist since 2018 — so much for a 'rising from the ashes' rebirth.\n\nAl Newstead\n\nHear the Hottest 100 of 2005 replayed on Double J on Sunday 25 January.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-18/bree-walker-silver-monobob-josie-baff-adam-lambert-altenberg/106241622",
        "title": "James triumphs as Aussie barely misses bobsled history in Milan-Cortina build-up",
        "publish_date": "Sat, 17 Jan 2026 20:37:32 +0000",
        "category": "sports",
        "authors": [],
        "text": "Bree Walker has just missed out on making history in Germany as she came close to becoming the first Australian ever to win a Crystal Globe as the season's top bobsledder.\n\nMeanwhile in Switzerland, Scotty James reigned supreme at a favourite venue to win the last World Cup halfpipe event before the Olympics, where he'll be seeking an elusive gold medal.\n\nOn a big day for Australian Olympic hopes, James sent a clear message to Olympic rivals as he won the Laax Open for a third consecutive time and fifth time in total, while young countryman Valentino Guseli was third.\n\nThe 31-year-old James scored 98.75 points for his spectacular second run to claim victory ahead of Kiwi surprise packet Campbell Melville Ives (91.00) and Calgary World Cup winner Guseli (80.25) — the first Oceania podium sweep in FIS history.\n\nScotty James came out on top in his last event before the Milan-Cortina Games. (FIS Snowboard: David Tributsch)\n\nThe thumping win was a big boost for four-time Olympian James, who will be aiming to better the bronze medal he won in Pyeongchang 2018 and silver in Beijing in 2022 at next months Milan-Cortina Olympics.\n\nHe has kept a low profile in recent weeks as rivals shared World Cup wins.\n\n\"I've been working on some things and this year is a tough year. It's an amazing competition,\" said James.\n\n\"We had two Aussies and a Kiwi on the podium which is unbelievable. The Japanese are riding amazing so you've got to put your best foot forward this year to get a sniff of the podium … I'm pumped.\n\nOn a day when the country's winter sports stars continued to look good with the Milan-Cortina Olympics just round the corner, snowboard cross riders Josie Baff and Adam Lambert also both won medals in China to shoot to the top of the World Cup standings.\n\nIn Germany, 33-year-old Walker took silver behind Kaillie Humphries in the final World Cup monobob race of the season in Altenberg to wrap up second place for the season.\n\nIt was just not quite enough to secure her the overall World Cup triumph, as German Laura Nolte took the seasonal crown by just 17 points.\n\nIn the last race before the Olympic showdown in Cortina next month, Walker had to overturn a 27-point deficit on double world monobob champ Nolte to take the Crystal Globe.\n\nShe defeated the German, who finished third, 0.06 seconds behind the Aussie after their two runs, but fell just short of leapfrogging Nolte in the final standings.\n\nBree Walker (left) came close but couldn't quite run down Laura Nolte (middle) in the last event. (Getty Images: Robert Michael)\n\nHumphries, America's reigning Olympic champ, won in a combined 1minute 58.97 seconds for the two runs, 0.13 seconds ahead of Walker (1:59.10) and 0.19 quicker than Nolte.\n\nThe great news for Walker, though, is that she is in fine shape to attack for historic gold at the Winter Games after the best World Cup season ever by an Australian sledder, in which she won three races in Lillehammer, Sigulda and St Moritz.\n\nMeanwhile, at the Chinese winter resort of Dongbeiya, Baff took silver in the women's final and Lambert bronze in the men's event.\n\nThe pals from Jindabyne in the NSW Snowy Mountains have now moved into top place in their World Cup standings, earning them the coveted yellow leader's bibs.\n\n\"It absolutely does feel like an honour,\" said Lambert. \"Obviously, just two races into the season anything can happen, but for now I will savour the feeling and to do it at the same time as Josie, who was my neighbour for most of my childhood, is a special privilege.\"\n\nBehind Britain's Charlotte Bankes in the big final, Baff grabbed silver in a blanket finish between the other three riders to take the 16th World Cup podium place of her career.\n\nIn the men's final, 28-year-old Lambert was able to earn an eighth World Cup podium as he finished behind Austrian Jakob Dusek and Canada's Eliot Grondin.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/australian-open-live-2026-aussie-walton-faces-alcaraz-hurdle-sabalenka-zverev-in-action-20260118-p5nut7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open LIVE 2026: Aussie Gibson triumphs; Walton faces Alcaraz hurdle; Sabalenka, Zverev in action",
        "publish_date": "Sun, 18 Jan 2026 13:23:42 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly",
            "Roy Ward"
        ],
        "text": "It’s people as far as the eye can see at the Olympic Boulevard gate, with thousands of fans waiting to enter Melbourne Park for the first day of matches.\n\nAttendees seem slightly confused about which direction they should walk to join the back of the queue.\n\nTennis fans face a long wait to get in. Credit: Chris Hopkins\n\nAll ticketholders — regardless of whether they have a ground pass or a stadium pass — are in a single queue that’s ten people wide, and reaches well past John Cain Arena and towards AAMI Park.\n\nThere’s also the express entry line, but it isn’t much better.\n\nThat queue stretches around a corner and continues to run parallel with the Yarra.\n\nBoth lines would be at least a few hundred metres long. One couple about halfway along the queue said they’d been waiting more than 45 minutes.\n\n“It’s not good enough… considering the price of the ticket,” they said.“[Tennis Australia] will probably need to have a crisis management meeting after this … they can’t do this for 14 days.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/australian-open-highlights-aliaksandra-sasnovich-v-jasmine-paolini-20260118-p5nuvx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open Highlights: Aliaksandra Sasnovich v Jasmine Paolini",
        "publish_date": "Sun, 18 Jan 2026 13:16:08 +1100",
        "category": "finance",
        "authors": [],
        "text": "Australian Open Highlights: Aliaksandra Sasnovich v Jasmine Paolini\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/video-games/playstation-xbox-wars-out-netflix-amazon-in-the-state-of-blockbuster-games-in-2026-20251212-p5nna4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "PlayStation, Xbox wars out, Netflix, Amazon in: The state of blockbuster games in 2026",
        "publish_date": "Sun, 18 Jan 2026 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Tim Biggs"
        ],
        "text": "Sony’s once-celebrated stable of owned studios has stalled somewhat recently, as the company flailed while attempting to pivot to live service online games following Fortnite’s success. Its latest hardware releases, including PS5 Pro, PS Portal and PS VR2, seemed to come and go without major support or marketing. But the PS5 is so entrenched and competition from Xbox so non-existent that these events haven’t been the disaster they might have been in a console war era. A remake of Halo, the game that made Microsoft’s original console a hit, is coming in 2026 to Xbox, PC and PlayStation. After 25 years in the console business, Xbox enters 2026 in an unprecedented state. Its collection of owned studios are the strongest it’s ever been, with an incredible slate of recent and upcoming releases. But that has largely come as a result of an outrageous level of investment from Microsoft. As a result, the tech giant is now no longer content with the Xbox being a console contender; it wants a return on its billions, and it knows that there’s more money in being the world’s biggest game publisher than in owning one platform. All of Microsoft’s games go to PC on day one, almost all of them go to PS5 and/or Switch, and they’re all available on the Game Pass subscription for Xbox, PC or streaming from the cloud. The result is that PC or PlayStation gamers can now enjoy Xbox games without needing to buy an Xbox. The big Halo, Gears, Forza and Fable releases due this year will be available on all platforms, even smart TVs. That’s a net positive for many people, but it does also mean the erasure of a characteristic Xbox culture, and some commentators have warned that an overbearing Microsoft could be destructive for the brand or even the industry. The company is expected to reveal new consoles this year which are essentially Windows PCs, paving the way for Sony games to appear on Xbox as well.\n\nAs for Nintendo, it continues to chart an entirely separate path. Its expansion has not involved putting its properties and games onto other platforms, but turning them into broader entertainment franchises. The power of the Switch 2 means more blockbuster games, including Resident Evil Requiem, will come to Nintendo’s system in 2026. This year we’re due a second Super Mario animated movie, and will likely get the first glimpse of 2027’s The Legend of Zelda live action film, as the company also continues to expand into toys, lifestyle tech and real-world experiences. On the game side, there’s a significant crossover in libraries between the Switch and PS5, but the devices are so distinct that they hardly compete. Last year’s launch of the Switch 2 was successful, but this year Nintendo will need to furnish plenty of its own games to keep interest up. With the increase in power allowing for more blockbuster games on the platform, Nintendo could offer an alternative to the PS5 or PC for players who want their games on the go and don’t mind a visual downgrade. As the oldest continuous console platform-holder, Nintendo also continues to mine its history for its retro game subscription, which this year will include the failed 1995 VR accessory Virtual Boy.\n\nJames Bond will return in 007: First Light, scheduled for May. The 15 biggest games coming in 2026 Though it would be a miracle for none of them to be delayed to a later year, here are the 15 games from the biggest publishers and franchises currently slated for 2016. 007: First Light – A cinematic James Bond origin story from IO Interactive, the creators of the Hitman series, featuring sneaking, shooting and driving.\n\nControl Resonant – Sequel to 2019’s surreal psychological masterpiece Control, from Alan Wake’s Remedy Entertainment.\n\nThe Duskbloods – A multiplayer action game from Elden Ring developer FromSoftware, exclusively for Switch 2.\n\nFable – A long-gestating and serially delayed reboot for Xbox’s iconic fantasy RPG, from Playground Games, which promises sardonic British humour and player choice.\n\nFire Emblem: Fortunes Weave – Nintendo’s anime-inspired and relationship-centred battle tactics series enters the 4K era with a gladiatorial vibe.\n\nForza Horizon 6 – Microsoft’s celebrated open-world racing series, also from Playground, heads to the Japanese countryside.\n\nGears of War: E-Day – A prequel for the original cover-based shooter, from Microsoft’s The Coalition, marks the return of much-loved duo Dom and Marcus. After several delays, GTA 6 is now slated for November 19.\n\nGrand Theft Auto VI – Rockstar’s follow-up to the highest-grossing entertainment product ever is set in a fictionalised Florida.\n\nMarvel’s Wolverine – From Insomniac, creators of the recent Spider-man games, this adventure promises to be much more brutal and gory.\n\nMarathon – The first game from Bungie (Halo, Destiny) under Sony ownership, this online extraction shooter is a reimagining of the developer’s 90s sci-fi franchise.\n\nResident Evil Requiem – The ninth main entry in Capcom’s zombie franchise series features two heroes and blends the horror of RE2 with the action of RE4.\n\nSaros – Sony’s arcade shooter experts Housemarque follow up 2021’s Returnal with another offbeat rinse-and-repeat game, heavy on story to unpack and colour-coded bullets to dodge.\n\nStar Wars Galactic Racer – A surprise revival of the N64 racing franchise, from a team made up of former Need for Speed and Burnout developers.\n\nTomb Raider: Legacy of Atlantis – his reimagining of the 1996 original is also the first game from Crystal Dynamics as part of a commercial deal with Amazon.\n\nYoshi and the Mysterious Book – Nintendo platformer with an illustrated visual style, where Yoshi has to suss out various creatures and lifeforms. Valve is expanding its PC-based hardware in 2026 following the success of the Steam Deck (bottom left). This year it will launch a VR headset, a controller and a console. Rise and rise of the popular platforms While console gaming is still big business, it hasn’t really grown in terms of player numbers or revenue during this hardware generation. Instead, much of the expansion has come from gaming on PC and mobile; casual players already have those devices for productivity purposes so can play without an additional console, while new phone and PC hardware is making high-end play more accessible too. Valve, the company behind PC game marketplace Steam, has had great success with its Steam Deck handheld which matches the flexibility of PC with the streamlining of a console. In 2026, it will release the Steam Machine, a similar but more powerful device designed to be used in the loungeroom or at a desk. It’s not impossible that it will go head-to-head with the new Xbox in terms of price and capability.\n\nOn the mobile side, Apple continues to push processing power to the point that new blockbuster games can run on iPhones, while popular online and live service games work on any device. Accessory makers including Backbone and Razer make controllers designed to turn any phone into a game console when players are on the go. Loading There’s also potential for the popular platforms to power a switch from local processing to streaming, which would allow any internet-connected device to play any game. Xbox is the current leader in this area after Google abandoned its Stadia platform in 2023, but Sony operates its own streaming system in certain regions (not Australia). Late last year, Netflix activated a streaming game element on its service, allowing subscribers to play party games using their TV and smartphones. Nvidia, the richest company in the world, also runs GeForce now, a service that lets players stream games using the company’s latest graphics hardware.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/as-coastal-erosion-bites-here-s-why-there-are-some-rays-of-hope-20251229-p5nql7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "As coastal erosion bites, here’s why there are some rays of hope",
        "publish_date": "Sun, 18 Jan 2026 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Benjamin Preiss"
        ],
        "text": "Port Fairy residents knew they had a serious problem when discarded household goods began emerging from the dunes.\n\nIn 2012, rubbish started appearing on the beach as coastal erosion ate into the dunes and exposed an old tip site buried long ago.\n\nDamage caused by coastal erosion at Port Fairy. Credit: Joe Armao\n\nPort Fairy resident Nick Abbott remembers old fridges and appliances, pieces of tin and lengths of wire turning up on the beach.\n\n“The concern was that we were seeing the tip of the iceberg and soon the beach could be littered with unsightly rubbish,” he said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/how-trump-s-first-year-ushered-in-the-law-of-the-jungle-20260116-p5nuh0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump 2.0 is all about power. His biggest move may be just days away",
        "publish_date": "Sun, 18 Jan 2026 12:51:36 +1100",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Advertisement\n\nAdvertisement\n\nWhile it may seem now that Trump is throwing his weight around the world relatively unimpeded, Bremmer reminds us of another acronym ascribed to Trump: TACO (Trump Always Chickens Out). “Trump tries FAFO everywhere, he just fails a lot. It wasn’t like he wasn’t trying FAFO with the Russians in the beginning, he just failed because Putin says no.” Those countries seen as weak tend to get the FAFO treatment, while strong ones eventually get TACO. Mexico and Venezuela are in the FAFO basket. So is Ukraine, which Trump likes to describe as “brave”, while Denmark might be about to find out where it stands. Trump and Chinese President Xi Jinping in October. Credit: Getty Images Where this approach has come unstuck is China, which, through its sheer economic size and stranglehold over the world’s supply of critical minerals, has forced Trump to backtrack on tariffs and into an uneasy truce. That has also involved Trump playing down concerns about the future of Taiwan and reportedly urging Japanese Prime Minister Sanae Takaichi to tone down her rhetoric on the subject. “Most countries that find themselves really vulnerable [to the US], they’re trying to defend first – not get into a fight, say all the right things to Trump – and hedge second,” said Bremmer. “China hasn’t navigated anything. China basically said, ‘We’re not even returning your phone call until you back off’, and Trump was surprised, but ultimately, he backed off.” Still, one of the administration’s top priorities is to weaken Beijing’s dominance in that regard. Scott Bessent, Trump’s Treasury secretary, says the goal is not for the US and its allies to decouple from China but to de-risk their economies from reliance on China’s rare earths. Australia, which signed a critical minerals co-operation agreement with the US in October, is potentially a major partner in that effort.\n\nAdvertisement\n\n‘This doesn’t strike me as a sea change’ Some critics within the MAGA movement – most notably former congresswoman Marjorie Taylor Greene, who had a spectacular falling out with the president – see Trump’s first 12 months of foreign policy intervention as antithetical to the “America First” agenda. Since December, the president and his team have made a deliberate effort to get him talking about the economy and the cost of living, including at several rallies around the US. Bremmer says that while it may seem right now that Trump is becoming more intent on military intervention around the world, his approach is not markedly different from his first term. “This doesn’t strike me as a sea change. It’s not a sudden break in Trump policy, either from last year or from his first administration. He’s used military force in his first administration. It was never about regime change. It was never about extended American confrontations that the US would have to pay for both financially, as well as in blood. That continues to be true,” Bremmer said at the Foreign Policy event. Venezuelan President Nicolás Maduro is escorted to the courthouse in Manhattan after his capture at the start of this month. Credit: Bloomberg In Venezuela, for example, Trump removed Maduro – regarded by the US and many nations as an illegitimate dictator – but is now working with Maduro’s deputy, Delcy Rodríguez, and has shown little interest in regime change or democratic elections. Trump’s main interest in Venezuela is to secure its oil – the largest proven reserves in the world – for the US. Bremmer notes Trump’s main objective is financial. He wants to compel countries and companies to invest money in the US, he wants greater control of – and even government equity stakes in – key companies and industries, and he wants to make more money for himself, his family and his friends. “All of those things are ramped up significantly from [his] first term. But again, the seeds were there, and they’ve now grown.”\n\nAdvertisement\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/australian-open-highlights-talia-gibson-v-anna-blinkova-20260118-p5nuvq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open Highlights: Talia Gibson v Anna Blinkova",
        "publish_date": "Sun, 18 Jan 2026 12:51:03 +1100",
        "category": "sports",
        "authors": [],
        "text": "Australian Open Highlights: Talia Gibson v Anna Blinkova\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/banking-and-finance/trump-s-crackdown-won-t-solve-credit-cards-many-problems-20260115-p5nugh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s crackdown won’t solve credit cards’ many problems",
        "publish_date": "Sun, 18 Jan 2026 12:49:46 +1100",
        "category": "finance",
        "authors": [
            "Clancy Yeates"
        ],
        "text": "Loading The stubbornly high cost of credit card debt has long attracted attention from politicians – Australian banks faced a Senate inquiry on the topic in 2015 and the corporate cop has also scrutinised the industry. In response, banks maintain high rates simply reflect the cost of providing the product. For one, credit card debt is unsecured, unlike a home loan. This is riskier for a bank because it means that if you don’t pay back the loan, there’s no asset the bank can sell. Rates are also particularly high on the cards that come with perks – such as the ability to earn frequent flyer points – as opposed to dedicated “low rate” cards, which in Australia at least, are in some cases under 10 per cent.\n\nIt’s also likely rates are so high because banks know full well that many of their customers never pay any interest – they simply pay back the full bill every month, taking advantage of the interest-free days. So, those who do pay interest subsidise the many who don’t. Would capping interest rates save consumers money? In the short-term, no doubt it would. One US study has claimed US customers could save about $100 billion a year under a 10 per cent rate cap. But the US banks are arguing what bankers nearly always say when their business model is threatened: that they will lend less money as a result. They would say that of course, but there is some truth to it: squeezing the revenue banks make from cards would surely have an impact. Credit card interest rates are stubbornly high, including in Australia. Credit: Jessica Shapiro\n\nIn the US, where cards are widely used to finance spending, big cuts in credit card lending could have significant economic consequences – partly because about 80 per cent of American adults have a credit card. There’s also a risk that a cap simply drives people to other forms of unregulated credit, which can cause other problems for consumers. But if capping rates might not be practical, what would be a better way to deal with the problems caused by credit cards? On this front, Australia provides a useful example of policies that have helped to encourage people to use credit card debt more sensibly, and pay less interest as a result. Indeed, over the past decade and a half, the total value of credit card balances that are accruing interest has plunged from about $35 billion to $19.7 billion, Canstar says, while the number of credit card accounts has also fallen. The Australian Securities and Investments Commission (ASIC) has said that by late 2022, the total credit card interest paid by consumers had dropped by more than 40 per cent in the previous five years. Card debt remained a problem for many, especially younger people, ASIC said, but consumers have generally cut their balances that are accruing interest.\n\nLoading The main reasons for this are probably tighter regulation; the support households received in COVID-19 (some of which helped pay down debt); competition from buy now, pay later (BNPL) disruptors; and households being more savvy in how they use their cards. A series of credit card reforms also commenced late last decade, including a ban on unsolicited credit increase offers, the right to request a credit limit reduction and card cancellation online, and tougher responsible lending assessments. Banks have also helped to encourage people to use their cards more sensibly, such as some lenders sending SMS reminders to encourage people to pay off more than the minimum amount. Payments expert Lance Blockley says there are some big differences between Australia’s credit card market and that of the US.\n\nHe points out that regulation of lending money in Australia is tighter to due to responsible lending laws, and in the US the card issuers are more generous with the perks they offer customers to encourage them to spend on cards (such as frequent flyer points to reward spending.) The reason it’s easier to get frequent flyer points in the US is once again its lighter approach to regulation – over the years the Reserve Bank of Australia has cracked down on the fees that fund many of the frequent flyer points in Australia. What’s more, in the US, it’s common for lenders to use “risk based pricing,” which means less creditworthy people are charged higher interest rates because they are riskier to banks and card issuers. All of these factors make credit card interest rates a sensitive topic in the US – but Blockley says Trump’s “rate cap” is unlikely to come into force, and if it does, it won’t necessarily solve the problem. “If it did get up, it would likely cut a source of credit to people who need it,“ Blockley says. “If you suddenly starve a segment of the American public of credit, you’re likely to see either a drop in retail sales and/or them searching for credit elsewhere.” Australia’s experience suggests tighter regulation of credit cards – without the need for a rate cap – has helped to nudge people towards more sensible forms of borrowing on plastic.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/kiwis-incredulous-at-being-blamed-for-sailgp-crash-as-sweden-takes-lead-20260118-p5nuvg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kiwis incredulous at being blamed for SailGP crash as Sweden takes lead",
        "publish_date": "Sun, 18 Jan 2026 12:16:45 +1100",
        "category": "sports",
        "authors": [
            "Jasper Bruce"
        ],
        "text": "Skipper Peter Burling is incredulous umpires have blamed New Zealand for the horror crash that ended the Kiwis’ Perth SailGP within two minutes of the starting gun being fired.\n\nNew Zealand’s transom, part of the boat’s stern, was ripped off and left floating in Fremantle Harbour when they collided with Switzerland in the first of Saturday’s fleet races.\n\nSweden SailGP Team in action during day one of SailGP Perth. Credit: Matt Jelonek/Getty Images\n\nAustralia were first past the finish line in that race but are fourth on the event standings after four races, with newest boat Sweden finishing as the day’s best performers.\n\nThe USA and France are tied atop the standings with Sweden, who won two fleet races on a bumpy first day of the high-speed league’s new season.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/brit-blows-up-over-rivals-suspect-act-20260118-p5nuvd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brit blows up over rival's suspect act",
        "publish_date": "Sun, 18 Jan 2026 12:10:22 +1100",
        "category": "finance",
        "authors": [],
        "text": "Brit blows up over rival's suspect act\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/fremantle-gets-a-taste-of-the-gospel-according-to-nick-cave-20260118-p5nuuy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fremantle gets a taste of the gospel, according to Nick Cave",
        "publish_date": "Sun, 18 Jan 2026 11:50:20 +1100",
        "category": "entertainment",
        "authors": [
            "Brendan Foster"
        ],
        "text": "“I look like I’m dressed as a Mormon,” Nick Cave joked to the thousands of fans gathered at Fremantle Park on Saturday night after catching a glimpse of himself on the big screens.\n\nDecked out in a charcoal-black suit, white shirt, and tie, Cave resembles an evangelical tent-revival preacher trying to whip his congregation into a religious fervour during the opening song Frogs from his latest album, Wild God.\n\nNick Cave and the Bad Seeds perform at Fremantle Park on Saturday night. Credit: Brendan Foster\n\nThe song features an elegant arrangement and a transcendental, meditative flow that has characterised much of Cave’s work of late.\n\nThe 68-year-old slowly prowls the stage, touching his congregation’s hands, as the startling, tender, hymn-like tunes Wild God and Song of the Lake unfold.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/gibson-on-fire-with-second-break-20260118-p5nuv3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gibson on fire with second break",
        "publish_date": "Sun, 18 Jan 2026 11:38:41 +1100",
        "category": "finance",
        "authors": [],
        "text": "Gibson on fire with second break\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/game-of-thrones-prequesl-a-knight-of-the-seven-kingdoms-explained-20260114-p5nu3g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The new Game of Thrones prequel is great. But what should you know before watching?",
        "publish_date": "Sun, 18 Jan 2026 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "Benji Wilson"
        ],
        "text": "The reviews are in. The much-anticipated Game of Thrones prequel, A Knight of the Seven Kingdoms, is being praised as a total success – “a fresh take” on Westeros that will “satisfy old fans who’d grown restless”.\n\nThankfully, for those of us who tuned out of the Game of Thrones universe, the series works as a standalone show telling a straight-line story of a likeable nobody who comes in to town with his buddy, wanting nothing more than to prove himself. But if you’re feeling reluctant about diving back in, here’s everything you might want to know first.\n\nPeter Claffey stars in new Game of Thrones prequel, A Knight of the Seven Kingdoms Credit: HBO Max\n\nHow does this show fit in to the Game of Thrones universe?\n\nSame universe, different time. A KOTSK is set in Westeros, the swords-and-sorcery quasi-medieval fantasy land that is the setting for both Game of Thrones and House of the Dragon. We’re roughly 100 years after the events of House of the Dragon and 100 years before Game of Thrones.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/woodbridges-passionate-defence-of-de-minaur-20260118-p5nuv0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woodbridge's passionate defence of de Minaur",
        "publish_date": "Sun, 18 Jan 2026 11:14:27 +1100",
        "category": "finance",
        "authors": [],
        "text": "Woodbridge's passionate defence of de Minaur\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/dark-and-disturbing-this-is-a-turandot-for-our-times-20260117-p5nus5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dark and disturbing: This is a Turandot for our times",
        "publish_date": "Sun, 18 Jan 2026 11:11:56 +1100",
        "category": "entertainment",
        "authors": [
            "Katie Lawrence",
            "Chantal Nguyen",
            "Peter Mccallum"
        ],
        "text": "As Calaf, Kim sang with gorgeous, richly tanned velvety colours and stentorian strength that he seemed able to push to the limits without cracking the beautifully burnished finish. He leavened the soaring lines of Nessun Dorma with phrases of quieter nuance to give classic shape to this most famous of moments and, more broadly, created a rounded character, which avoided pushing Calaf’s forceful dominance too far into wearying and overbearing self-centredness. Nash was every bit his equal as Turandot, matching his tone in the riddle scene with vivid dramatic colours and riveting, almost frightening, intensity, which she transformed to a softer glow in the final scene. Leva captured both simplicity and depth as Liu singing with light charm in Act 1 and allowing more full-blooded passion into the sound in Act 3. Her most memorable note was the high B flat in her first aria, which emerged like a quiet truth in a mist of melancholy. Richard Anderson was a poignant Timur giving well-shaped lines unvarnished eloquence. As the three Ps, Gabbedy, Longmuir and Petruccelli provided sarcastic comic counterpoint, sustaining Puccini’s slightly overlong scene in Act II strongly, with well-articulated vocal lines and witty deflection, as though responsible for the running of the machinery of a surveillance state. In fading respectable skivvy and slacks Gregory Brown sang the Emperor’s role with frail clarity like one keen to return to his retirement village, while Shane Lowrencev made the Speaker’s role into a mindless vehicle of autocratic edicts. Placed on a revolving stage with static symbolic movements, the Opera Australia Chorus sang with vivid openness, subtlety and power to bind together these fragments of the excesses of human passion.\n\nDANCE\n\nEXXY\n\nSydney Opera House, Drama Theatre\n\nJanuary 15\n\nUntil January 18\n\nReviewed by KATIE LAWRENCE\n\n★★★★★ Think of something in the world that makes you question the future of humanity. I’ll wait.\n\n(Actually, I won’t — we’d be here all night.) Whatever came to mind, Dan Daw’s Exxy is the antidote. Exxy is a dance-theatre love letter to the best of us: to survival, to tenderness, and to a tiny boy with cerebral palsy and his ballsy Nan, belting out The Power of Love into the red dust of the outback. It is hilarious, ferocious, devastating – and somehow also an incredible night out.\n\nDan Daw is resplendent in a tank top and kilt. Credit: Neil Bennett The action unfolds against corrugated iron, framed by deck chairs and the vast Australian landscape. The cast of four (Daw, Tiiu Mortley, Joseph Brown and Sofia Valdiri) are stunning. Monologues and movement land like gut-punches, then pull you in for a hug. From the jump, Exxy commits hard to inclusion. Participation isn’t just welcome; it’s actively directed via flashing overhead captions. Don’t panic. I have never enjoyed being gently bossed around by a show more, including the singalong (no spoilers, but it goes off). The costumes and sets (by Kat Heath) are Mad Max survival chic: industrial greys, bodies braced for impact. It’s battle gear with a forehead kiss. Daw is resplendent in a tank top and kilt, tattoos on full display. His solos are breathtaking in their intelligence and clarity; the definition of a dancer working with his body. Guy Connelly’s soundtrack ranges from lilting melodies to techno thuds, matching the movement. The stage is carpeted in saltbush and light. Daw’s metaphor is clear: saltbush doesn’t just survive; it bursts through concrete.\n\nExxy is packed with camp, gleeful absurdity. Credit: Neil Bennett Exxy doesn’t sugarcoat. It tells stories of sexual rejection and casual cruelty: doors slammed in faces; turning up for a hookup only to be asked to leave after undressing; encounters with people who need someone else kneeling in order to feel tall. Don’t be misled into thinking Exxy is solemn. It is packed with camp, gleeful absurdity – performers on all fours, drooling onto the stage; a “who’s better at cerebral palsy” battle that ends in applause; a group marathon where the destination is unclear but the vibe is unadulterated “I got you.” Exxy is 90 minutes in a room full of people who vocally have your back. Like saltbush, Exxy doesn’t ask for permission to take up space. It insists on participation, demands tenderness – and turns the theatre into an intimate, raucous, glorious celebration of being alive.\n\nDANCE\n\nSave the Last Dance for Me\n\nPalm Grove, Sydney Town Hall, & Leichhardt Town Hall\n\nJanuary 15\n\nUntil January 23\n\nReviewed by CHANTAL NGUYEN\n\n★★★★½ In Save the Last Dance for Me, a white dance floor is marked out with masking tape in a diamond pattern. A slow, electro-swing beat begins (Aurora Bauzà and Pere Jou’s soundscape), and two men pace onto the dance floor (Gianmaria Borzillo and Giovanfrancesco Giannini). They both have neat, toned physiques; upright posture; slick fashionable clothes; and impassive facial expressions. Stylistically, they are clearly European contemporary dance artists. Gianmaria Borzillo and Giovanfrancesco Giannini. Credit: Stephen Wilson Barker But the dance itself has more earthy roots. It is the polka chinata, a folk dance from Bologna, Italy when early-1900s social norms prohibited men from dancing with unmarried women. So the men danced with each other, exerting to attract female attention with the polka chinata’s rapid complexity.\n\nBorzillo and Giannini slowly grasp each other in a ballroom embrace, their bodies gently lifting like two lungs inhaling. A pause like a wave cresting, then they begin gliding down each arm of the diamond, their feet moving in a swift, syncopated pattering step. The travelling step becomes hypnotic in its speed and liquid intricacy. One false move and the dance would meet the kind of tangled end you see in cycling race pile-ups. Loading But Borzillo and Giannini never misstep, their bodies moving with such smooth, disciplined synchrony that it is like watching one entity rather than two (interestingly, the two male bodies are far more visually uniform than ballroom dancing’s usual male-female pairing). There are dizzying spins and a remarkable scooching turn, where Borzillo and Giannini grasp each other’s biceps, crouch down, and begin to whirl. When the choreographer, Venice Golden Lion-winner Alessandro Sciarroni, first learnt about the polka chinata, you could count on one hand the number of couples who still knew how to dance it. He sent Borzillo and Giannini to Bologna to learn the dying artform. That effort led to this extraordinary piece, a rediscovery of a folk dance form, beatified and resurrected in a modern, fine arts setting.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/i-m-a-casual-tennis-fan-what-have-i-missed-20260117-p5nuqv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I’m a casual tennis fan. What have I missed?",
        "publish_date": "Sun, 18 Jan 2026 10:56:42 +1100",
        "category": "sports",
        "authors": [
            "Scott Spits"
        ],
        "text": "So you like tennis, but don’t stay up all night watching it during the year unless there’s an Aussie on a roll at Wimbledon. But now it’s Australian Open time, and you can’t get enough of it. Let us bring you up to speed.\n\nWho is the men’s No.1, and what is ‘Sincaraz’?\n\nCarlos Alcaraz (world No.1) and Jannik Sinner (No.2) are dominating the men’s game. And they took their stranglehold to a new level in 2025 – thanks, in part, to a ridiculously good Roland Garros final won by Alcaraz that lasted five hours and 29 minutes.\n\nSome of the top seeds at the 2026 Australian Open. Credit: Getty, AP, The Age\n\nBetween them, Alcaraz and Sinner have won the past eight grand slams and nine of the past 10, hence the so-called ‘Sincaraz’ rivalry - bromance, even - between them.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/evacuations-on-sydneys-northern-beaches-amid-flash-flooding-concerns-midday-news-bulletin-18-january-2026/weavw8g56",
        "title": "Evacuations on Sydney's northern beaches amid flash flooding concerns | Midday News Bulletin 18 January 2026",
        "publish_date": "Sun, 18 Jan 2026 01:21:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n\n\nTRANSCRIPT\n\n\n\nFlash flooding and a landslide force evacuations on Sydney's Northern Beaches.\n\nPalestinians in Gaza voice concern as the U-S unveils a temporary 'Board of Peace'.\n\nIn snowboarding, Scotty James surges into Olympic contention after a dominant win at the final World Cup halfpipe event.\n\nAn evacuation order has been issued for some residents in Sydney's Northern Beaches after a woman died in wild summer storms on the state's south coast.\n\n\n\n\n\nThe evacuation orders for the Northern Beaches and surrounds have been issued amid rapidly rising floodwaters and a landslide at Great Mackerel Beach that damaged three houses.\n\n\n\n\n\nMeanwhile, at least 750 volunteers are on the ground responding to more than 1400 call-outs, with the State Emergency Service conducting 20 flood rescues.\n\n\n\n\n\n.\n\n\n\n\n\nPalestinians in Gaza have expressed concern after the White House announced a 'Board of Peace' to oversee the enclave's temporary governance.\n\n\n\n\n\nThe board includes U-S Secretary of State Marco Rubio, President Trump's special envoy Steve Witkoff, former U-K Prime Minister Tony Blair, and Trump's son-in-law Jared Kushner.\n\n\n\n\n\nForeign Minister Gideon Saar is expected to raise his concerns with Secretary of State Rubio directly, with Israel saying it was not consulted and that the plan runs counter to its policy.\n\n\n\n\n\nMeanwhile, Khan Younis resident, Mohieb Dahlan, says that the board's success depends entirely on Israel's cooperation.\n\n\n\n\n\n\"As for the peace board under the administration of (US President Donald) Trump, it depends on the Israelis, who are the occupying enemy, for it to succeed or fail. If they are keen to make it succeed, they will make it succeed, and if they are not interested in making it succeed, it will fail. It is in the hands of the Israelis in terms of the border crossing, the aid, and the reconstruction, it is all in the hands of the occupation, the Israeli occupation.\"\n\n\n\n\n\n.\n\n\n\n\n\nEuropean Council President Antonio Costa says the European Union is coordinating a response to new US tariffs targeting several European countries.\n\n\n\n\n\nPresident Donald Trump has announced 10 per cent tariffs from 1 February, rising to 25 per cent in June, until a deal is reached for what he has called the complete and total purchase of Greenland.\n\n\n\n\n\nMr Trump argues Greenland is critical for global security and the effectiveness of the U-S Golden Dome defence system.\n\n\n\n\n\nThe tariffs target Denmark, Norway, Sweden, France, Germany, the U-K, the Netherlands, and Finland, which President Costa says the EU will vigorously defend.\n\n\n\n\n\n\"The European Union will always be very firm in the defense of international law, wherever it may be, and of course starting in the territory of the member states of the European Union. Right now I am coordinating a joint response from the member states of the European Union on this issue.\"\n\n\n\n\n\n.\n\n\n\n\n\nThe world's first legally binding agreement to protect marine life in international waters has taken effect.\n\n\n\n\n\nAfter nearly two decades of negotiations, the High Seas Treaty will govern nearly half the planet’s surface - the vast ocean areas beyond any country’s control.\n\n\n\n\n\n83 countries have now ratified the treaty, including China and Japan.\n\n\n\n\n\nThe United States, United Kingdom and Australia have signed but not ratified the treaty, meaning they can participate as an observer but won't have voting rights.\n\n\n\n\n\nAdvocates say the broad support must now turn into rapid implementation, but Megan Randles, from Greenpeace's Ocean Campaign, says it's a landmark moment.\n\n\n\n\n\n\"The treaty is a sign that in a divided world, protecting nature and protecting our global commons can still triumph over political rivalries.\"\n\n\n\n\n\n.\n\n\n\n\n\nThe Australian Tax Office is cracking down on holiday-home owners claiming tax deductions for properties mainly used for personal use.\n\n\n\n\n\nThe ATO says that from 1 July, deductions for interest, rates, and upkeep may only be allowed if the home is mainly rented and available during peak periods.\n\n\n\n\n\nThe agency will cross-check rental platforms, bank records, and property listings to ensure claims match actual income.\n\n\n\n\n\n.\n\n\n\n\n\nTo sport now, Australian snowboarder Scotty James has delivered a masterclass on the halfpipe, claiming victory at the final World Cup event before next month's Winter Olympics in Milano Cortina.\n\n\n\n\n\nHere is the moment where he claimed his fifth career win at the Laax Open in Switzerland.\n\n\n\n\n\n\"Once again, I can't keep up with Scotty James as he lands one of the best runs of the night. He goes into first place - 98.75 with the two NBDs. He'll knock Campbell Melville Ives off the top step. Highest score of the night.\"\n\n\n\n\n\nThe 31-year-old four-time Olympian's emphatic win boosts his bid for Olympic gold, having previously taken bronze in Pyeongchang 2018 and silver in Beijing 2022.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-to-make-a-career-change-in-2026-thats-actually-worth-it/chep8z8d5",
        "title": "Risks, rewards: How to make a career change in 2026 that pays off",
        "publish_date": "Sat, 17 Jan 2026 23:57:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "As the new year settles in, it's not unusual to take stock of your life — including whether it's finally time to make a change at work.\n\n\n\n\n\nThe idea of switching careers can be exciting and daunting, often at the same time. It usually comes with a familiar set of questions: How do you make it work financially, how do you know what career to move into, and do you actually hate your job — or just your boss?\n\n\n\n\n\nIf you're thinking about changing careers, experts say it's worth slowing down before making any big decisions.\n\n\n\n\n\nJane Jackson, a career coach and author of Navigating Career Crossroads, says interest in meaningful, values-led work surged after the pandemic, but the current economic climate has made many people more cautious.\n\n\n\n\n\n\"2025 was the tightest job market I've experienced in all my years of coaching,\" Jackson said.\n\n\n\n\n\n\"There was a little bit of fear about making a change in case they couldn't land the roles that they desired.\"\n\n\n\nBecause of a thinner job market and higher levels of redundancy, Jackson says career changes in 2026 need to be more strategic and targeted.\n\n\n\n\n\nData released by the Australian Bureau of Statistics this week show in November 2025, Australia's total job vacancies were 326,700.\n\n\n\n\n\nThis represented a decrease of 0.2 per cent from August 2025, while over the 12 months to November 2025, there were 17,800 fewer job vacancies — a fall of 5.2 per cent.\n\n\n\nThink sideways first, not from scratch\n\nBefore making any big decisions, Jackson says it's important to slow down and identify what's actually driving your dissatisfaction at work.\n\n\n\n\n\nIs it your manager? The company culture? The pay? Or something else entirely?\n\n\n\n\n\n\"What is it that you don't like about your job? You really have to assess that,\" she said.\n\n\n\n\n\n\"It might not be the job at all — it might be the manager, the culture, or the way you're treated.\n\n\n\n\n\n\"People lump it all into one, which is a mistake.\"\n\n\n\nREAD MORE Michelle left her career and marriage and started saying 'yes'. It changed her life\n\nIn some cases, those problems can be solved without leaving your role. In others, a change in employer, industry or position may be enough — without needing to retrain or start again from scratch.\n\n\n\n\n\nBefore leaping into a dramatic career pivot, Jackson encourages smaller, \"lilypad\" moves, such as moving laterally into adjacent industries or similar roles.\n\n\n\n\n\n\"In order to get from A to Z, you're going to be making some detours,\" she says.\n\n\n\n\n\n\"Careers are not linear — it's very much like a matrix.\"\n\n\n\nExplore, talk to people, experiment\n\nJackson similarly encourages career changers to identify skills where they have both high competence and high enjoyment, and to leverage those transferable skills to move into tangentially related roles or industries.\n\n\n\n\n\nPart of that process might involve investigative work, such as looking up people on LinkedIn who already have the career you want and examining how they got there.\n\n\n\n\n\n\"Very few careers are linear,\" Jackson says. \"There are so many other roles that people don't even know exist.\"\n\n\n\n\n\n\"When you start to see people's career journeys, you realise they've leveraged transferable skills to get their foot in the door.\n\n\n\n\n\n\"Have a look at how other people got there — you'll see common threads.\"\n\n\n\nLISTEN TO How a literacy and numeracy program is helping adults open up career options SBS News 05:01 English\n\nKate Richardson, a career coach, says exploration doesn't have to involve quitting your job or making a major financial commitment straight away.\n\n\n\n\n\n\"Exploring really comes down to two things: expanding your connections and finding ways to experiment,\" she says.\n\n\n\n\n\nThat might include short courses, side projects, volunteering, contract work or informal conversations with people already working in the field.\n\n\n\n\n\n\"Anything that gives you more hands-on or tangible experience of a pathway without necessarily making a big commitment.\"\n\n\n\nIdentify your values\n\nValues alignment plays a major role in long-term career satisfaction, Jackson says, and she encourages anyone considering a change to get clear on what they need from work.\n\n\n\n\n\n\"You've got to make values-based decisions, because otherwise it doesn't feel right,\" she says.\n\n\n\n\n\nOne way to do that is by identifying your top five values and ranking them in order of importance. This can help clarify whether the issue is your role, your workplace, or whether a larger shift is needed.\n\n\n\n\n\n\"If your values are being compromised, then you'll know whether staying is acceptable or not,\" Jackson says.\n\n\n\nBut keep the market in mind\n\nRichardson says it's also important to balance values-driven work with an understanding of current market realities.\n\n\n\n\n\n\"It's got to encompass all of that — values, strengths, lifestyle and what's happening in the market,\" she says.\n\n\n\n\n\n\"You do have to cast an eye across the market and understand the changes that are going on.\n\n\n\n\n\n\"There are trends that impact employability or opportunity, and it's important to know that.\"\n\n\n\nJob ads for nursing and construction roles saw the most growth year-on-year, according to December data from SEEK. Source: SBS News LinkedIn's Jobs on the Rise 2026 report identified the 15 fastest-growing jobs in Australia, with many roles incorporating Artificial Intelligence (AI) standing out. AI engineer ranked first, followed by chief risk officer, mechanical engineer, director of artificial intelligence and organisational development manager.\n\n\n\n\n\nMeanwhile, a December report from job site Seek identified strong year-on-year growth in job ads for nursing roles — particularly theatre, recovery and high-acuity nursing — alongside ongoing demand for general practitioners, aged and disability support workers, and management roles in construction.\n\n\n\nAcknowledge fear, but don't let it make the decision\n\nTaking the leap into a career change is difficult at the best of times, and financial logistics can make it even harder.\n\n\n\n\n\nRichardson says concerns about money, study and risk are often what stop people from moving forward — but those fears don't always reflect reality.\n\n\n\n\n\n\"No matter your age, your brain will always kick in with all the reasons why it's not going to work,\" she says. \"That's just your brain kicking into risk management mode.\"\n\n\n\n\n\nShe says the exploration process can help people separate genuine practical constraints from assumptions that haven't yet been tested — whether that's researching salary progression, understanding long-term opportunities, or mapping out what a short-term step back might realistically look like.\n\n\n\nRichardson says many people delay career change not because they lack options, but because they feel pressure to have a clear answer before they begin.\n\n\n\n\n\n\"As long as it feels fuzzy and you're lacking confidence, it's very easy to stick with the status quo,\" Richardson says.\n\n\n\n\n\nRather than trying to land on a perfect end goal, she encourages people to focus on identifying possibilities.\n\n\n\n\n\n\"One of the best ways to get started is to forget the answer just for a minute and instead think about a few possibilities,\" she says.\n\n\n\n\n\n\"When you let go of the answer and you identify possibilities, you can take small steps to actively explore those possibilities further.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australias-most-liveable-city-is-now-the-cheapest-to-rent-houses/dt08u2lcm",
        "title": "Australia's 'most liveable' city is now the cheapest to rent houses",
        "publish_date": "Sat, 17 Jan 2026 20:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/can-you-transfer-nobel-peace-prize-trump-machado/rrrtzhji6",
        "title": "Trump has been gifted a Nobel Peace Prize. Can they actually be given away?",
        "publish_date": "Sat, 17 Jan 2026 00:57:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "Donald Trump is in physical possession of a Nobel Peace Prize medal, gifted to him by last year's winner, Venezuelan opposition leader María Corina Machado.\n\n\n\n\n\nBut according to the Norwegian Nobel Committee, no matter what happens to the 18-carat gold medal, the prize itself \"remains inseparably linked to the person or organisation designated as the laureate\".\n\n\n\n\n\nThe organisation issued a statement making its position clear on Saturday, after Machado gave her award to the United States president during a meeting at the White House this week.\n\n\n\n\n\nThe committee noted that laureates receive a gold medal, a diploma and prize money.\n\n\n\n\n\n\"It is and remains the original laureate who is recorded in history as the recipient of the prize,\" the statement said.\n\n\n\n\"Even if the medal or diploma later comes into someone else’s possession, this does not alter who was awarded the Nobel Peace Prize.\"\n\n\n\n\n\nThe prize cannot be shared with others, transferred, or revoked, the committee said.\n\n\n\n\n\n\"The decision is final and applies for all time.\"\n\n\n\nHas this happened before?\n\nThere are no restrictions on what a Nobel laureate can do with the medal, diploma or prize money. They are free to keep them, give them away, sell or donate them if they wish.\n\n\n\n\n\nA number of Nobel laureates have opted to sell or give away their medals.\n\n\n\n\n\nNane Annan, widow of 2001 peace prize laureate Kofi Annan, donated the medal and diploma to the United Nations Office in Geneva, where they are permanently on display.\n\n\n\nREAD MORE Could Donald Trump win the 2025 Nobel Peace Prize?\n\nIn 2022, Russian journalist Dmitry Muratov sold his peace prize medal for US$103.5 million ($154.8 million) and donated the entire sum to a UNICEF fund for Ukrainian refugee children.\n\n\n\n\n\nNorwegian author Knut Hamsun, who won the Nobel Prize in Literature in 1920, gifted his medal to Germany's propaganda minister Joseph Goebbels, a prominent Nazi, as a gesture of thanks after they met in 1943.\n\n\n\n\n\nThat medal's current whereabouts are unknown, the Nobel Committee noted.\n\n\n\nOthers have also sold their medals, loaned or donated them to museums.\n\n\n\nWhy did Machado give her medal to Trump?\n\nTrump has made no secret of his desire to win the prize. Foreign leaders seeking to curry favour with him have previously put him up for it and hailed his peacemaking efforts.\n\n\n\n\n\nA White House spokesperson complained in October that Trump was snubbed for the 2025 award because the Nobel Committee prioritised \"politics over peace\".\n\n\n\n\n\nAt the time, the Trump administration was prominently spearheading an effort to broker peace in Gaza.\n\n\n\nMachado dedicated her award to Trump after it was announced , saying Venezuela was counting on Trump and other key allies to achieve freedom and democracy. She thanked him for his \"decisive support of our cause\".\n\n\n\n\n\nEarlier this month, the US carried out a lightning strike in Caracas , kidnapping Venezuelan president Nicolás Maduro to face drug trafficking charges in New York in a move widely seen as illegal by international law experts.\n\n\n\n\n\nMachado presented her prize to Trump at the White House during their first face-to-face meeting on Thursday.\n\n\n\n\"María presented me with her Nobel Peace Prize for the work I have done. Such a wonderful gesture of mutual respect. Thank you María!\" Trump wrote on social media after the meeting.\n\n\n\n\n\nIt was widely interpreted as an effort to gain influence as the future of Machado's country — currently led on an interim basis by Maduro's former deputy Delcy Rodriguez — hangs in the balance .\n\n\n\n\n\nTrump has previously dismissed suggestions that Machado could be installed as Venezuela's leader, saying she does not have enough support among its people.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/meet-two-australians-who-are-obsessed-with-pigeons/n772z7tkf",
        "title": "She's a 'crazy pigeon lady'. He wants to revive a dying sport. This bird is their obsession",
        "publish_date": "Fri, 16 Jan 2026 23:57:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "They might have a reputation as \"rats with wings\", but to some, the humble pigeon is an \"athlete of the sky\". That's how Stevan Gazzola sees them, at least.\n\n\n\n\n\nHe keeps around 2,000 racing pigeons in his backyard, an hour outside Melbourne, and has been racing them for more than 30 years.\n\n\n\n\n\n\"I started when I was 16 and I've been racing for 30 years now on and off. This year, we won the overall championship,\" Gazzola tells SBS News. \"It's in the blood.\"\n\n\n\n\n\nEven so, his Italian family were baffled when he first got into the sport.\n\n\n\n\n\n\"My uncle got into me that I was chasing the wrong type of birds,\" he says. \"It's just grown. I'm too far in — I even bought acreage just for pigeons.\"\n\n\n\nThe 'dying' world of pigeon racing\n\nHoping to reinvigorate a sport he says is quietly disappearing, Gazzola launched the Meadow One Loft Race four years ago.\n\n\n\n\n\nEach year, hundreds of pigeons are entered from across Australia — owners pay $350 per bird — and Gazzola takes them in, vaccinates, feeds, trains, and eventually releases them up to 400km away to race home.\n\n\n\nStevan Gazzola has been racing pigeons for most of his life. But he's worried the sport is dying. Source: SBS News \"People from all over Australia send me their baby pigeons,\" he says. \"We pick them up from the airport, then we vaccinate them, look after them, train them, let them go.\"\n\n\n\n\n\nTraining builds gradually: short flights around the block first, then 10km, then 50km, then 100 km, and so on. He's seen top birds fly 1,000km in eight hours.\n\n\n\n\n\nThe final race offers $75,000 to the winner, with around $250,000 paid out overall. But overseas, it's a different story.\n\n\n\n\n\n\"They're racing for a million dollars,\" he says. \"I can send pigeons to Thailand — it's a $1,000 per pigeon to enter — and they're racing for $2.5 million in prize money.\"\n\n\n\n\n\nStill, he says it isn't a money-making sport, with the small coin he might win at local races going straight back to the pigeons. \"You don't do this to get rich,\" he says.\n\n\n\nA sport running out of time\n\nBut Melbourne's pigeon racing scene is dying.\n\n\n\n\n\nMembership at Gazzola's local club has dropped from around 300 to about 90.\n\n\n\n\n\nRacers are ageing. Many are on pensions. Keeping birds requires space, money, time, and physical labour — all of which are increasingly scarce.\n\n\n\nStevan Gazzola says there's a science to breeding pigeons — especially if you want them to be racers. Source: SBS News \"They're just dying off. There's no young people joining,\" he says. \"You put in all the hard work and try to keep it going, but as the guys are getting older. They either die or they give up because they can't do it anymore.\"\n\n\n\n\n\nSome owners send their pigeons to Gazzola, who becomes a kind of foster carer — feeding, housing and training birds on behalf of people who can't.\n\n\n\n\n\nStill, he has noticed a small resurgence in young migrant communities. \"A lot of young Filipinos and Afghans are getting into it here,\" he says.\n\n\n\n\n\n\"Forty years ago, there was nothing to do. You either played footy or cricket — or raced pigeons.\n\n\n\n\n\n\"But it is a dying sport. Who wants to sit in their backyard and clean pigeon shit these days?\"\n\n\n\nEnter: The 'crazy pigeon lady'\n\nIn Melbourne's CBD, the scene couldn't be more different.\n\n\n\n\n\nTahlia — known as 'Frill' to her 300,000+ social media followers — can often be found outside Victoria's State Library, enveloped by a cloud of pigeons.\n\n\n\n\n\nThe 26-year-old — and her rainbow coloured hair — started posting videos of herself and pigeons in January and within months, her content went viral.\n\n\n\n26-year-old Frill finds and treats 'stringfoot' pigeons in the hope of changing people's perception of the humble bird. Source: Supplied / Instagram / Frill_underscore \"I'm the crazy pigeon lady,\" she jokes. \"It's great that everyone is tuning in for the pigeons, but if I'm honest, the hair probably had a lot to do with it.\"\n\n\n\n\n\nIn her messenger bag are the tools of the trade: bird seed, sanitiser, nail scissors, and a sock she calls \"pigeon jail\".\n\n\n\n\n\nHer mission: find and treat 'stringfoot' pigeons, whose toes have been strangled by string, thread, or human hair — leading to a painful condition that can cut off circulation and sometimes lead to the loss of toes, or even the entire foot.\n\n\n\n\n\nTo help a pigeon, she gently lures it close with seed before pouncing on it and slipping it into the sock so it can't fly away. Then, she trims the string away from its feet — a task that can take up to twenty minutes.\n\n\n\n\n\n\"This is likely a thread from a piece of clothing, that's pretty common,\" she says as she destrings one. \"A lot of the time, human hair and pet hair can get stuck around their feet, too.\"\n\n\n\nShe learnt these skills from Melbourne rescue groups filled with \"pigeon enthusiasts\". While she started with stringfoot cases, she now also takes sick or injured pigeons home to rehabilitate, carrying a small box with her whenever she heads out \"just in case\".\n\n\n\n\n\n\"Stringfoot is a small symptom of a bigger issue,\" she says. \"Humans cause man-made problems that affect all the animals around them.\n\n\n\n\n\n\"Even [a person's] hair can do this to them.\"\n\n\n\n\n\nMost days, a small crowd gathers to watch her feed the birds. Children ask to hold seeds. Teenagers hover, half-curious, half-mocking.\n\n\n\n\n\n\"You'll usually get a flock of people who want to join in,\" she says. \"Others will make fun of me … I get a lot of people who will do drive-by insults.\n\n\n\n\n\n\"But a lot of people are genuinely curious … I have had people who thought I was torturing a pigeon or kidnapping it!\"\n\n\n\n\n\nFrill's favourite bird is Dovey, a gentle white pigeon who perches on her shoulder and Chicken Boy, who somehow always attracts another bird to sit on him.\n\n\n\n\n\nShe's also outspoken about racing: \"I think pigeon racing is outdated.\"\n\n\n\n\n\n\"Most pigeon racers lose part of their loft every year. They'll die, or they get lost and join other flocks. It's very common that they collapse from exhaustion … there's no benefit for the animal.\"\n\n\n\nThe Animal Justice Party's Georgie Purcell says the humble pigeon — or 'rock dove' — is a misunderstood, intelligent animal. Source: AAP / Diego Fedele The RSPCA says pigeon racing poses \"many welfare risks\", including susceptibility to predation, high physical demands on their bodies, and some birds veering off course and not returning home.\n\n\n\n\n\nAnimal Justice Party MP Georgie Purcell also condemns pigeon racing and says our perception of the bird needs to change.\n\n\n\n\n\n\"I am vehemently against this toxic so-called sport,\" Purcell tells SBS News.\n\n\n\n\n\nBut Gazzola says while he understands views that racing can be cruel, bird welfare is foundational to his operation.\n\n\n\n\n\n\"Our pigeons are bred for endurance and are conditioned gradually with structured training, vet supervision, and careful monitoring,\" he says.\n\n\n\n\n\n\"When the sport is run responsibly with proper health checks, controlled training, safe race routes, and strong oversight, the birds compete in a way that aligns with their natural instincts to fly, navigate, and return home.\"\n\n\n\nAn underrated bird\n\nPurcell is one of many who are on Team Pigeon — including actress Sarah Paulson, who recently staunchly defended the bird and called for \"pigeon hate\" to be stopped.\n\n\n\n\n\n\"Pigeons are the best example of victims of mankind,\" Purcell says.\n\n\n\n\n\n\"They are an animal that humans used and domesticated for a purpose and then immediately discarded them when they were deemed to be no longer useful.\n\n\n\n\n\n\"Now, we treat them as if they're a nuisance or something that must be eradicated.\"\n\n\n\n\n\nShe says people often underestimate the humble pigeon.\n\n\n\n\n\n\"As highly sociable animals, pigeons mate for life, and they are a true representation of equal caring responsibilities, with both female and male pigeons working together to raise their young,\" Purcell said.\n\n\n\nGeorgie Purcell says pigeons are the \"best example of victims of mankind\", formerly domesticated, then left to their own. Source: Getty / Alwin Sun Pigeons can count as well as primates, a 2011 study suggested , with a task showing they have the capacity to count from one to nine. However, they're not quick learners. While monkeys could learn the skill in a couple of months, it took the dear pigeon a year to be trained.\n\n\n\nRats with wings?\n\nDespite their differences, both Gazzola and Frill want people to rethink the humble pigeon.\n\n\n\n\n\n\"When you mention pigeons, people say they're rats with wings,\" Gazzola says. \"They think of what we do here as the average street pigeon that's pecking at chips in the city and is a nuisance.\"\n\n\n\n\n\nBut he says his birds are \"probably kept better than how some people live\".\n\n\n\n\n\n\"They're climate-controlled, heated, the food is spotless — we source the best vitamins from all over the world — there's no stone left unturned that they don't get,\" he says.\n\n\n\n\n\n\"They're athletes of the sky.\"\n\n\n\n\n\nFrill agrees that pigeons deserve care — but wants it to extend to all of them.\n\n\n\n\n\n\"A lot of people say they're rats with wings — I also like rats, so that's not an insult to me — but it is meant in a derogatory way to say they're dirty and take up space on the street,\" she says.\n\n\n\n\n\nShe wants to break that stigma: \"They have their own life and they feel and they have very complex social lives.\"\n\n\n\n\n\nShe also hopes her content will make people think more deeply.\n\n\n\n\n\n\"I want people to appreciate every animal — even little street pigeons that people might not care about.\n\n\n\n\n\n\"I want people to think more about the world around them and other animals and how we impact them.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-loneliness-the-hidden-health-danger/ybxi8kezv",
        "title": "INTERVIEW: Loneliness - the hidden health danger",
        "publish_date": "Fri, 16 Jan 2026 20:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/asian-inspired-coffees-gain-ground-in-australia/1f9qudw0z",
        "title": "Asian-Inspired coffees gain ground in Australia",
        "publish_date": "Fri, 16 Jan 2026 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Produced in collaboration with SBS Chinese\n\n\n\n\n\nListen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFrom crema latte to pistachio matcha and soybean powders, new coffee flavours are bubbling up. In Melbourne, often described as Australia’s coffee capital, Asian-inspired trends are catching on. Cafe manager Jay Lee explains.\n\n\n\n\n\n“Australian people like more balanced acidity and less sweetness drinks. Korean or Asian customers want something more sweeter and more creamer.”\n\n\n\n\n\nWhile sales of classic coffees like flat whites and long blacks remain strong, many customers are sampling Asian-inspired blends derived from dessert making and tea brewing.\n\n\n\n\n\n“The first thing I think of is infusion — like teas I think of the mixture of coffee and tea, and flavours I haven’t tried before.”\n\n\n\n\n\nAt Cru+ café in Melbourne’s East, Jay Lee says producing exotic creations takes time, technique and precision.\n\n\n\n\n\n“Asian-style drinks usually involve more steps: syrup, powders, creams, and clear layer. Keeping everything consistent is harder than making classic Aussie order.”\n\n\n\n\n\nOnline survey platform, Pureprofile is researching our taste for fancy drinks. Australia’s senior client development director, Kate Richards explains.\n\n\n\n\n\n“Consumers want drinks that suit their mood, their energy levels, their diet, and their personal taste. And that flexibility beautifully extends to Asian inspired fusion flavours like matcha and pistachio. It's turning into beverage theatre. More than a caffeine boost, these drinks deliver texture, taste, and shareability. Presentation has become as important as flavour with dessert style lattes doubling as visually arresting performances.”\n\n\n\n\n\nPureprofile’s Social Insights tool found that Asian-inspired food and drink now accounts for 28 per cent of online share. Ms Richards says it’s part of a broader pattern.\n\n\n\n\n\n“Trends like Instagram-worthy lattes are exploding in popularity right now. For example, TikTok views of pistachio matcha lattes more than doubled in eight months. Asian inspiration is everywhere, not only in food and beverages, but in categories like fashion, beauty, travel, and tech.”\n\n\n\n\n\nA changing demographic may be driving the trend – with more than 17 per cent of people in Australia claiming Asian heritage. Among popular choices - hojicha latte — a creamy Japanese tea drink made from roasted green tea, or Earl Grey iced latte with salted cream. In the summer heat, many customers are looking for a cooler style, like grapefruit cold brew layered over sparkling water.\n\n\n\n\n\n“I think this has a bit of grapefruit in it, from what I can see and taste. I think it might have cold brew.”\n\n\n\n\n\nO ther drinks are inspired by Korean flavours, including the Kinako latte — a caffeine-free Japanese and Korean drink made from roasted soybean powder. Cru+ manager Jay Lee says broadening the café’s range is good for business.\n\n\n\n\n\n“It’s given the customers something they can’t experience before ‘inspired by the Japan, Japanese.”\n\n\n\n\n\nOf the 400 coffees sold each day —server Phillip Sim says demand for Asian styles is rising steadily.\n\n\n\n\n\n“We try to create something special, something new. And that’s why it’s getting popular and popular.”\n\n\n\n\n\nHowever, when it comes to a daily cup, not everyone is convinced. Café owner Sam Wang.\n\n\n\n\n\n““Long black, latte, cappuccino and flat white, these four different type of coffees are still our best-sellers.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-did-australias-most-liveable-city-become-the-most-affordable-to-rent-a-house/hw9jrpncd",
        "title": "How did Australia's 'most liveable' capital city become the most affordable for renting a house?",
        "publish_date": "Fri, 16 Jan 2026 19:32:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "While housing continues to become less affordable in most Australian cities and regions, Melbourne has thrown up some data quirks that experts have linked to state government policies, with houses now cheaper to rent there than they were 12 months ago.\n\n\n\n\n\nOn average, the cost of renting a house or unit increased across Australia's combined capitals in the year leading up to December 2025, according to a new Domain report.\n\n\n\n\n\nMelbourne, consistently ranked the most liveable city in the nation , is now the cheapest capital city to rent a house in at an average of $580 per week, as asking prices hit the \"affordability ceiling\".\n\n\n\n\n\nThe cost of renting a house in Melbourne fell by 1.7 per cent over the year, the only drop of any property type in any Australian city, according to the report.\n\n\n\n\n\nThe fall in value will have mixed results for renters, landlords and investors in Victoria, while the country grapples with a national shortage of new properties and low vacancy rates.\n\n\n\nWhat's caused values to fall?\n\nThe cost of renting a house in Melbourne fell $10 per week in the 12 months to December 2025, saving tenants $520 per year.\n\n\n\n\n\nYet units became more expensive in the city, rising from an average of $550 per week in December 2024 to $580 a year later — on par with house rents.\n\n\n\n\n\nMelbourne unit prices are cheaper on average per week than Sydney ($750), Brisbane and Perth (both $650), Darwin ($598) and on par with Canberra. Only Hobart and Adelaide have cheaper unit prices at $480 and $525 a week respectively.\n\n\n\nSource: SBS News Domain's chief of research and economics, Nicola Powell, told SBS News that housing supply has been stronger in Melbourne compared to other cities.\n\n\n\n\n\n\"I think supply choice has been much better for tenants,\" she said.\n\n\n\n\n\n\"And what that means from an asking rent perspective is landlords are having to be much more realistic on the price point they place on their home.\"\n\n\n\n\n\nMelbourne had the highest vacancy rate of any capital in December at 1.6 per cent.\n\n\n\nMore first home buyers, fewer investors\n\nFederal and state government policies have also made a difference.\n\n\n\n\n\nThe new national first-home buyers scheme — which allows all first-home buyers to put down a deposit of 5 per cent — has reduced demand for rentals as tenants look to purchase their first property, Powell explained.\n\n\n\nState taxation changes affecting Victorians who own, or are looking to buy, investment properties have led to an increase in the fees investment property owners pay.\n\n\n\n\n\nPowell said these changes have led to people offloading investment properties in the last couple of years and choosing to invest in other states.\n\n\n\n\n\nThe proportion of investment in Victoria is one of the lowest in the country.\n\n\n\n\n\n\"It's sitting at just under 34 per cent of loans being financed to investors,\" Powell said.\n\n\n\n\n\n\"NSW sits at 46 per cent. So you can see there's a vast difference in participation rates from investors.\"\n\n\n\nProperty Council research shows that investors are currently looking away from Melbourne due to its \"harsh tax settings\", and instead choosing states with less punitive property charges.\n\n\n\n\n\nAndrew Lowcock, Victorian deputy executive director of the Property Council, told SBS News that Melbourne's liveability has traditionally been underpinned by strong private investment in housing, infrastructure and amenity.\n\n\n\n\n\nHe said for rents to stay low, investors need to be kept onside.\n\n\n\n\n\n\"With that pipeline of investment dropping away, it is becoming harder to deliver the homes that current and future Victorians need,\" Lowcock said.\n\n\n\n\n\n\"If Victoria wants to stay competitive, we need to do more to encourage investment and create the conditions that encourage more homes to be built.\"\n\n\n\nNational data\n\nPowell predicted that the cost of renting in Melbourne would remain stable due to the \"affordability ceiling\" — the maximum a population can pay — being reached.\n\n\n\n\n\n\"We're certainly not seeing any indication that we're going to see rent suddenly start to accelerate,\" she said.\n\n\n\n\n\nAccording to Domain's December rental report, the most expensive houses per week in Australia are found in Sydney at $800.\n\n\n\n\n\nThis was followed by Darwin, Canberra and Perth, where renting a house cost $700 per week on average.\n\n\n\nSource: SBS News The cost of renting a unit has increased across the board since December 2024.\n\n\n\n\n\nSydney has the highest average weekly unit rent at $750, followed by Brisbane and Perth at $650 respectively.\n\n\n\n\n\n\"Overall competition for rentals is still quite strong, but I think affordability is increasingly capping how far and how fast rents can rise,\" Powell said.\n\n\n\n\n\n\"We have to remember that Australia is still operating in a landlord's market, which means vacancy rates are below two per cent across every single capital city.\"\n\n\n\nHow can cities be both liveable and affordable?\n\nWhen grading Australian cities on metrics like health care, education, and infrastructure, Melbourne comes in first place, according to the Economist Intelligence Unit's 2025 Global Liveability Index.\n\n\n\n\n\nIn 2025, Melbourne was ranked the fourth most liveable city in the world, followed by Sydney in sixth place and Adelaide in ninth.\n\n\n\nREAD MORE Michaela lives eight hours from her young daughter — the rental crisis is now separating families\n\nKate Raynor, an urban planning expert with the University of Melbourne's Life Course Centre, explained why Melbourne ranks so highly.\n\n\n\n\n\n\"Melbourne does public spaces and public transport connectivity and safety in the public realm really well,\" she told SBS News.\n\n\n\n\n\n\"There is less air pollution and historically has been quite affordable.\"\n\n\n\n\n\nShe explained that Melbourne has a diversity of housing types and densities, which helps improve affordability as it's easier for people to move up and down the property ladder.\n\n\n\n\n\nOn top of its varied housing stock, Victoria approves more new homes than other Australian states, Raynor said.\n\n\n\n\n\nAccording to 2025 Australian Bureau of Statistics data, Victoria accounted for 5,215 new home approvals in November out of the 18,406 reported nationwide. NSW followed with 4,848, while Queensland approved 4,558.\n\n\n\nDoes Melbourne offer lessons for other cities?\n\nCost of living presents challenges to liveability, Raynor said, which can make balancing a desirable area and cost-effectiveness difficult for governments.\n\n\n\n\n\n\"You want to be building amenities and infrastructure, but at the same time not drive people out with escalating prices,\" she said.\n\n\n\nShe said all cities, not just Melbourne, need to invest in more social housing and medium-density housing to continue thriving and keep renting affordable.\n\n\n\n\n\n\"Invest in social housing, because that is where the need is greatest, that's where the housing stress is greatest, and that is the most obvious and direct route from someone who is at risk of homelessness or severe housing stress into housing stability,\" she said.\n\n\n\n\n\nWith any new housing also comes the need for transport infrastructure, she added, so that people aren't \"locked in\" to outer and developing suburbs.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/from-americas-cup-glory-to-foiling-futures-fremantle-opens-sailgps-high-speed-next-chapter/wru9osew7",
        "title": "From America’s Cup glory to foiling futures, Fremantle opens SailGP’s high-speed next chapter",
        "publish_date": "Fri, 16 Jan 2026 08:55:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/as-bushfire-affected-residents-in-victoria-begin-to-put-their-lives-back-together-multicultural-groups-lend-a-hand/bfe6plx29",
        "title": "As bushfire affected residents in Victoria begin to put their lives back together, multicultural groups lend a hand",
        "publish_date": "Fri, 16 Jan 2026 08:55:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "As bushfire affected residents in Victoria begin to put their lives back together, multicultural groups lend a hand\n\nPublished 16 January 2026, 5:25 am\n\nIn tough times, community generosity goes a long way. And that's been on display in the wake of Victoria's recent bushfire devastation. Including from one group that's travelled hundreds of kilometres to show victims they aren't alone.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/australian-open-live-2026-aussie-walton-faces-alcaraz-hurdle-sabalenka-zverev-in-action-20260118-p5nut7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open LIVE 2026: Aussie Gibson triumphs; Walton faces Alcaraz hurdle; Sabalenka, Zverev in action",
        "publish_date": "Sun, 18 Jan 2026 13:23:42 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly",
            "Roy Ward"
        ],
        "text": "It’s people as far as the eye can see at the Olympic Boulevard gate, with thousands of fans waiting to enter Melbourne Park for the first day of matches.\n\nAttendees seem slightly confused about which direction they should walk to join the back of the queue.\n\nTennis fans face a long wait to get in. Credit: Chris Hopkins\n\nAll ticketholders — regardless of whether they have a ground pass or a stadium pass — are in a single queue that’s ten people wide, and reaches well past John Cain Arena and towards AAMI Park.\n\nThere’s also the express entry line, but it isn’t much better.\n\nThat queue stretches around a corner and continues to run parallel with the Yarra.\n\nBoth lines would be at least a few hundred metres long. One couple about halfway along the queue said they’d been waiting more than 45 minutes.\n\n“It’s not good enough… considering the price of the ticket,” they said.“[Tennis Australia] will probably need to have a crisis management meeting after this … they can’t do this for 14 days.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/australian-open-highlights-aliaksandra-sasnovich-v-jasmine-paolini-20260118-p5nuvx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open Highlights: Aliaksandra Sasnovich v Jasmine Paolini",
        "publish_date": "Sun, 18 Jan 2026 13:16:08 +1100",
        "category": "finance",
        "authors": [],
        "text": "Australian Open Highlights: Aliaksandra Sasnovich v Jasmine Paolini\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/technology/video-games/playstation-xbox-wars-out-netflix-amazon-in-the-state-of-blockbuster-games-in-2026-20251212-p5nna4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "PlayStation, Xbox wars out, Netflix, Amazon in: The state of blockbuster games in 2026",
        "publish_date": "Sun, 18 Jan 2026 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Tim Biggs"
        ],
        "text": "Advertisement\n\nTechnologyVideo games PlayStation, Xbox wars out, Netflix, Amazon in: The state of blockbuster games in 2026 Tim Biggs January 18, 2026 — 1:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nVideo games are a unique, converged art form that has evolved over the past 50 years to take in a huge diversity of visual, audio, technical and design disciplines. Today games of all sizes – from multimillion-dollar productions made by thousands, to experiments created by a single person – are enjoyed by billions of people around the world. As commercial products, they also generate more revenue than the film, music, and television industries combined. The money has attracted tech giants and huge global corporations into the space, and while there are undeniable growing pains – ballooning costs, 10-year development cycles, unsafe working environments – gaming’s popularity continues to increase. In 2026, another side effect of this expansion will be felt most keenly: the erosion of the walls that used to keep individual consoles (PlayStation, Xbox, Nintendo) and platforms apart. Several franchises owned by Microsoft or Sony will be playable across all platforms this year. Returning in 2026: Marathon, Halo, GTA, Tomb Raider, Resident Evil.\n\nAdvertisement\n\nThe consoles wars are over, for now The idea of a console war, where players are split by their allegiance to certain platforms, was essentially left behind in the 90s. But the culture has persisted in some sense, since many players don’t have the time, funds or inclination to support multiple platforms, meaning they miss out on games that are exclusive to certain consoles. But in 2026, the battle appears to be over. Sony, Nintendo and Microsoft now offer three totally different propositions, and could hardly be said to compete at all. Marvel’s Wolverine is a major PlayStation 5 exclusive slated for this year. Sony’s PlayStation still largely follows the path that served it well through the PS2, PS3 and PS4 generations. The PS5 is the de facto mainstream home console, hosting games from all major third-party publishers and thousands of indies as well as marquee releases from Sony’s own studios. The company has begun publishing its own games on PC and including them in its PlayStation Plus subscription, albeit not right away, and is even experimenting with publishing on Xbox and Switch.\n\nAdvertisement\n\nSony’s once-celebrated stable of owned studios has stalled somewhat recently, as the company flailed while attempting to pivot to live service online games following Fortnite’s success. Its latest hardware releases, including PS5 Pro, PS Portal and PS VR2, seemed to come and go without major support or marketing. But the PS5 is so entrenched and competition from Xbox so non-existent that these events haven’t been the disaster they might have been in a console war era. A remake of Halo, the game that made Microsoft’s original console a hit, is coming in 2026 to Xbox, PC and PlayStation. After 25 years in the console business, Xbox enters 2026 in an unprecedented state. Its collection of owned studios are the strongest it’s ever been, with an incredible slate of recent and upcoming releases. But that has largely come as a result of an outrageous level of investment from Microsoft. As a result, the tech giant is now no longer content with the Xbox being a console contender; it wants a return on its billions, and it knows that there’s more money in being the world’s biggest game publisher than in owning one platform. All of Microsoft’s games go to PC on day one, almost all of them go to PS5 and/or Switch, and they’re all available on the Game Pass subscription for Xbox, PC or streaming from the cloud. The result is that PC or PlayStation gamers can now enjoy Xbox games without needing to buy an Xbox. The big Halo, Gears, Forza and Fable releases due this year will be available on all platforms, even smart TVs. That’s a net positive for many people, but it does also mean the erasure of a characteristic Xbox culture, and some commentators have warned that an overbearing Microsoft could be destructive for the brand or even the industry. The company is expected to reveal new consoles this year which are essentially Windows PCs, paving the way for Sony games to appear on Xbox as well.\n\nAdvertisement\n\nAs for Nintendo, it continues to chart an entirely separate path. Its expansion has not involved putting its properties and games onto other platforms, but turning them into broader entertainment franchises. The power of the Switch 2 means more blockbuster games, including Resident Evil Requiem, will come to Nintendo’s system in 2026. This year we’re due a second Super Mario animated movie, and will likely get the first glimpse of 2027’s The Legend of Zelda live action film, as the company also continues to expand into toys, lifestyle tech and real-world experiences. On the game side, there’s a significant crossover in libraries between the Switch and PS5, but the devices are so distinct that they hardly compete. Last year’s launch of the Switch 2 was successful, but this year Nintendo will need to furnish plenty of its own games to keep interest up. With the increase in power allowing for more blockbuster games on the platform, Nintendo could offer an alternative to the PS5 or PC for players who want their games on the go and don’t mind a visual downgrade. As the oldest continuous console platform-holder, Nintendo also continues to mine its history for its retro game subscription, which this year will include the failed 1995 VR accessory Virtual Boy.\n\nAdvertisement\n\nJames Bond will return in 007: First Light, scheduled for May. The 15 biggest games coming in 2026 Though it would be a miracle for none of them to be delayed to a later year, here are the 15 games from the biggest publishers and franchises currently slated for 2016. 007: First Light – A cinematic James Bond origin story from IO Interactive, the creators of the Hitman series, featuring sneaking, shooting and driving.\n\nControl Resonant – Sequel to 2019’s surreal psychological masterpiece Control, from Alan Wake’s Remedy Entertainment.\n\nThe Duskbloods – A multiplayer action game from Elden Ring developer FromSoftware, exclusively for Switch 2.\n\nFable – A long-gestating and serially delayed reboot for Xbox’s iconic fantasy RPG, from Playground Games, which promises sardonic British humour and player choice.\n\nFire Emblem: Fortunes Weave – Nintendo’s anime-inspired and relationship-centred battle tactics series enters the 4K era with a gladiatorial vibe.\n\nForza Horizon 6 – Microsoft’s celebrated open-world racing series, also from Playground, heads to the Japanese countryside.\n\nGears of War: E-Day – A prequel for the original cover-based shooter, from Microsoft’s The Coalition, marks the return of much-loved duo Dom and Marcus. After several delays, GTA 6 is now slated for November 19.\n\nAdvertisement\n\nGrand Theft Auto VI – Rockstar’s follow-up to the highest-grossing entertainment product ever is set in a fictionalised Florida.\n\nMarvel’s Wolverine – From Insomniac, creators of the recent Spider-man games, this adventure promises to be much more brutal and gory.\n\nMarathon – The first game from Bungie (Halo, Destiny) under Sony ownership, this online extraction shooter is a reimagining of the developer’s 90s sci-fi franchise.\n\nResident Evil Requiem – The ninth main entry in Capcom’s zombie franchise series features two heroes and blends the horror of RE2 with the action of RE4.\n\nSaros – Sony’s arcade shooter experts Housemarque follow up 2021’s Returnal with another offbeat rinse-and-repeat game, heavy on story to unpack and colour-coded bullets to dodge.\n\nStar Wars Galactic Racer – A surprise revival of the N64 racing franchise, from a team made up of former Need for Speed and Burnout developers.\n\nTomb Raider: Legacy of Atlantis – his reimagining of the 1996 original is also the first game from Crystal Dynamics as part of a commercial deal with Amazon.\n\nYoshi and the Mysterious Book – Nintendo platformer with an illustrated visual style, where Yoshi has to suss out various creatures and lifeforms. Valve is expanding its PC-based hardware in 2026 following the success of the Steam Deck (bottom left). This year it will launch a VR headset, a controller and a console. Rise and rise of the popular platforms While console gaming is still big business, it hasn’t really grown in terms of player numbers or revenue during this hardware generation. Instead, much of the expansion has come from gaming on PC and mobile; casual players already have those devices for productivity purposes so can play without an additional console, while new phone and PC hardware is making high-end play more accessible too. Valve, the company behind PC game marketplace Steam, has had great success with its Steam Deck handheld which matches the flexibility of PC with the streamlining of a console. In 2026, it will release the Steam Machine, a similar but more powerful device designed to be used in the loungeroom or at a desk. It’s not impossible that it will go head-to-head with the new Xbox in terms of price and capability.\n\nAdvertisement\n\nOn the mobile side, Apple continues to push processing power to the point that new blockbuster games can run on iPhones, while popular online and live service games work on any device. Accessory makers including Backbone and Razer make controllers designed to turn any phone into a game console when players are on the go. Editor's pick Review\n\nVideo games The best video games of 2025, from Ghost of Yotei to Hades 2 There’s also potential for the popular platforms to power a switch from local processing to streaming, which would allow any internet-connected device to play any game. Xbox is the current leader in this area after Google abandoned its Stadia platform in 2023, but Sony operates its own streaming system in certain regions (not Australia). Late last year, Netflix activated a streaming game element on its service, allowing subscribers to play party games using their TV and smartphones. Nvidia, the richest company in the world, also runs GeForce now, a service that lets players stream games using the company’s latest graphics hardware.\n\nAdvertisement\n\nAs the console wars disappear, the new frontier looks likely to be a fight for content across all entertainment media, with Netflix, Amazon, Microsoft, Apple, Meta and others spending billions to acquire game content for their own streaming apps. Get news and reviews on technology, gadgets and gaming in our Technology newsletter every Friday. Sign up here.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/as-coastal-erosion-bites-here-s-why-there-are-some-rays-of-hope-20251229-p5nql7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "As coastal erosion bites, here’s why there are some rays of hope",
        "publish_date": "Sun, 18 Jan 2026 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Benjamin Preiss"
        ],
        "text": "Advertisement\n\nNationalVictoriaVanishing coast As coastal erosion bites, here’s why there are some rays of hope Benjamin Preiss January 18, 2026 — 1:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nPort Fairy residents knew they had a serious problem when discarded household goods began emerging from the dunes. In 2012, rubbish started appearing on the beach as coastal erosion ate into the dunes and exposed an old tip site buried long ago. Damage caused by coastal erosion at Port Fairy. Joe Armao Port Fairy resident Nick Abbott remembers old fridges and appliances, pieces of tin and lengths of wire turning up on the beach. “The concern was that we were seeing the tip of the iceberg and soon the beach could be littered with unsightly rubbish,” he said.\n\nAdvertisement\n\nThe following year, Abbott joined other Port Fairy residents in measuring the impact of erosion on local beaches, using posts, rope and laser levels. In 2018, they began using drones, hoping to better understand the problem. With the power of Southern Ocean waves and strong winds battering the shoreline, Port Fairy, in Victoria’s south-west, remains highly susceptible to coastal erosion, a challenge that is accelerating with climate change. Deakin University’s Blake Allan at Port Fairy, where erosion has hit beach areas hard. Nicole Cleary While Port Fairy is among the areas hardest hit by sea level rise, new research focusing on a stretch of beach in bayside Melbourne is providing a ray of hope. It shows human intervention can help to stabilise beaches in the face of coastal erosion, particularly when those efforts are in concert with the natural marine environment. At another Port Fairy beach known as the night soil site, erosion uncovered waste including old toilet cans, some of which rolled down the dunes. But vegetation matting has since been installed to stabilise and promote vegetation growth.\n\nAdvertisement\n\nDeakin University national coastal drone program scientific lead Blake Allan said the matting had helped protect the old night soil site. But erosion has continued to eat away at the dunes near the former tip site. A rock wall installed in front of the former tip has protected some of the dune but deflected energy from the waves, resulting in aggressive erosion on either side of the wall. Allan has also been monitoring the effects of coastal erosion at Port Fairy and providing the data to policymakers. “You can’t rely on memories. And we don’t want decisions to be based on one event, because those knee-jerk reactions are really just Band-Aids,” he said. Coastal erosion expert David Kennedy in Sandringham. Joe Armao Recently published research by University of Melbourne coastal geomorphologist David Kennedy found strategies for managing erosion at Sandringham on Port Phillip Bay had been largely successful in the past 20 years.\n\nAdvertisement\n\nThe peer-reviewed research, published in the Frontiers in Earth Science journal, examined the impact of human-made structures at Sandringham going back more than 140 years. Initially, sea walls were built to stop the cliff eroding. Kennedy said there was wild fluctuation in erosion in the following decades at Sandringham until the 1990s, when a program of sand replenishment began and the rate of erosion then slowed. In the 2000s, the installation of structures known as rock groynes, which extend into the water perpendicular to the shore, helped further stabilise the beach. Sandringham beach from the air. Joe Armao “What we want to do with the groynes is keep the sand on that beach for longer, because over time it’s moving from south to north. That’s where the sand is all going. It’s all ending up in South Melbourne over decades,” he said.\n\nAdvertisement\n\nKennedy described the movement of sand as a natural phenomenon, but protecting beaches and human-built structures behind them was part of the response to sea-level rise and climate change. “We tend not to view landforms as dynamic systems. But I like to think of them like dogs’ tails – they’re constantly wagging.” Related Article Analysis\n\nClimate crisis Climate whiplash: We can no longer pretend this isn’t a crisis He said the more recent human interventions at Sandringham showed it was possible to save beaches by working with nature rather than building hard structures that risked exacerbating erosion. Locations like Port Fairy, which are exposed to the raw power of the open ocean, would require a different management strategy to Sandringham, Kennedy said. Loch Sport in East Gippsland, Inverloch on the Bass Coast and Silverleaves in Phillip Island are other locations where coastal erosion is posing a serious challenge to communities and the authorities that manage those natural areas.\n\nAdvertisement\n\n“It’s a human-modified world we’ve created,” Kennedy said. “We’ve got to work with what nature’s throwing at us to maintain the bits we love. If we don’t, we’re just going to have sea walls all the way along and no beaches.” Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/australian-open-highlights-talia-gibson-v-anna-blinkova-20260118-p5nuvq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open Highlights: Talia Gibson v Anna Blinkova",
        "publish_date": "Sun, 18 Jan 2026 12:51:03 +1100",
        "category": "sports",
        "authors": [],
        "text": "Australian Open Highlights: Talia Gibson v Anna Blinkova\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/banking-and-finance/trump-s-crackdown-won-t-solve-credit-cards-many-problems-20260115-p5nugh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s crackdown won’t solve credit cards’ many problems",
        "publish_date": "Sun, 18 Jan 2026 12:49:46 +1100",
        "category": "finance",
        "authors": [
            "Clancy Yeates"
        ],
        "text": "Advertisement\n\nJanuary 18, 2026 — 12:49pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nSome of the biggest banks in the world are preparing for battle in the US, all thanks to a social media post from Donald Trump calling for a 10 per cent cap on credit card interest rates. In case you missed it, Trump spooked investors in big US banks last week after he vowed he’d no longer let Americans be “ripped off” by credit card interest rates of 20 to 30 per cent. But the most interesting thing about this fight is not really Trump’s proposal (which may be hard to enforce), nor the worried response from banks, both of which are predictable enough. More surprising is that this is an idea that crosses the notoriously divided US political spectrum. President Donald Trump said he’d no longer allow Americans to be “ripped off” on their credit card, spooking investors in US banks. AP Indeed, Trump’s only the latest politician to venture into this space: progressive US politicians including Democrat Elizabeth Warren and independent Bernie Sanders have also backed capping on credit card interest rates.\n\nAdvertisement\n\nThe fact Trump and some of his political foes support such blunt intervention is partly a sign of rising populism, but it also reflects the fact credit card interest rates are very high – often close to 20 per cent. That’s not only the case in the US, it’s equally true in Australia, where Canstar says the average rate on a balance accruing interest is 18.5 per cent. There are also specific features of credit cards that can get people into debt traps – such as the ability to only pay off a tiny amount each month, and to rack up large amounts of interest at a very high rate. In short, plenty of people struggle with credit card debt, and it certainly doesn’t help that the interest rates are sky-high. So, why are credit card interest rates so high? And given credit cards can get people into difficulty, why not just cap the interest rates, as Trump and some of his opponents want?\n\nAdvertisement\n\nRelated Article Opinion\n\nRBA Michele Bullock is standing her ground against Trump. Here’s why it matters Millie Muroi Economics Writer The stubbornly high cost of credit card debt has long attracted attention from politicians – Australian banks faced a Senate inquiry on the topic in 2015 and the corporate cop has also scrutinised the industry. In response, banks maintain high rates simply reflect the cost of providing the product. For one, credit card debt is unsecured, unlike a home loan. This is riskier for a bank because it means that if you don’t pay back the loan, there’s no asset the bank can sell. Rates are also particularly high on the cards that come with perks – such as the ability to earn frequent flyer points – as opposed to dedicated “low rate” cards, which in Australia at least, are in some cases under 10 per cent.\n\nAdvertisement\n\nIt’s also likely rates are so high because banks know full well that many of their customers never pay any interest – they simply pay back the full bill every month, taking advantage of the interest-free days. So, those who do pay interest subsidise the many who don’t. Would capping interest rates save consumers money? In the short-term, no doubt it would. One US study has claimed US customers could save about $100 billion a year under a 10 per cent rate cap. But the US banks are arguing what bankers nearly always say when their business model is threatened: that they will lend less money as a result. They would say that of course, but there is some truth to it: squeezing the revenue banks make from cards would surely have an impact. Credit card interest rates are stubbornly high, including in Australia. Jessica Shapiro\n\nAdvertisement\n\nIn the US, where cards are widely used to finance spending, big cuts in credit card lending could have significant economic consequences – partly because about 80 per cent of American adults have a credit card. There’s also a risk that a cap simply drives people to other forms of unregulated credit, which can cause other problems for consumers. But if capping rates might not be practical, what would be a better way to deal with the problems caused by credit cards? On this front, Australia provides a useful example of policies that have helped to encourage people to use credit card debt more sensibly, and pay less interest as a result. Indeed, over the past decade and a half, the total value of credit card balances that are accruing interest has plunged from about $35 billion to $19.7 billion, Canstar says, while the number of credit card accounts has also fallen. The Australian Securities and Investments Commission (ASIC) has said that by late 2022, the total credit card interest paid by consumers had dropped by more than 40 per cent in the previous five years. Card debt remained a problem for many, especially younger people, ASIC said, but consumers have generally cut their balances that are accruing interest.\n\nAdvertisement\n\nRelated Article Opinion\n\nInvesting Australia’s big but unloved companies will test investors’ mettle Elizabeth Knight Business columnist The main reasons for this are probably tighter regulation; the support households received in COVID-19 (some of which helped pay down debt); competition from buy now, pay later (BNPL) disruptors; and households being more savvy in how they use their cards. A series of credit card reforms also commenced late last decade, including a ban on unsolicited credit increase offers, the right to request a credit limit reduction and card cancellation online, and tougher responsible lending assessments. Banks have also helped to encourage people to use their cards more sensibly, such as some lenders sending SMS reminders to encourage people to pay off more than the minimum amount. Payments expert Lance Blockley says there are some big differences between Australia’s credit card market and that of the US.\n\nAdvertisement\n\nHe points out that regulation of lending money in Australia is tighter to due to responsible lending laws, and in the US the card issuers are more generous with the perks they offer customers to encourage them to spend on cards (such as frequent flyer points to reward spending.) The reason it’s easier to get frequent flyer points in the US is once again its lighter approach to regulation – over the years the Reserve Bank of Australia has cracked down on the fees that fund many of the frequent flyer points in Australia. What’s more, in the US, it’s common for lenders to use “risk based pricing,” which means less creditworthy people are charged higher interest rates because they are riskier to banks and card issuers. All of these factors make credit card interest rates a sensitive topic in the US – but Blockley says Trump’s “rate cap” is unlikely to come into force, and if it does, it won’t necessarily solve the problem. “If it did get up, it would likely cut a source of credit to people who need it,“ Blockley says. “If you suddenly starve a segment of the American public of credit, you’re likely to see either a drop in retail sales and/or them searching for credit elsewhere.” Australia’s experience suggests tighter regulation of credit cards – without the need for a rate cap – has helped to nudge people towards more sensible forms of borrowing on plastic.\n\nAdvertisement\n\nConsumers are paying far less in credit card interest than they were in the past, and that’s a good thing for households. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/kiwis-incredulous-at-being-blamed-for-sailgp-crash-as-sweden-takes-lead-20260118-p5nuvg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kiwis incredulous at being blamed for SailGP crash as Sweden takes lead",
        "publish_date": "Sun, 18 Jan 2026 12:16:45 +1100",
        "category": "sports",
        "authors": [
            "Jasper Bruce"
        ],
        "text": "Advertisement\n\nNationalWAWA sport Kiwis incredulous at being blamed for SailGP crash as Sweden takes lead Jasper Bruce January 18, 2026 — 12:16pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nSkipper Peter Burling is incredulous umpires have blamed New Zealand for the horror crash that ended the Kiwis’ Perth SailGP within two minutes of the starting gun being fired. New Zealand’s transom, part of the boat’s stern, was ripped off and left floating in Fremantle Harbour when they collided with Switzerland in the first of Saturday’s fleet races. Sweden SailGP Team in action during day one of SailGP Perth. Matt Jelonek/Getty Images Australia were first past the finish line in that race but are fourth on the event standings after four races, with newest boat Sweden finishing as the day’s best performers. The USA and France are tied atop the standings with Sweden, who won two fleet races on a bumpy first day of the high-speed league’s new season.\n\nAdvertisement\n\nIt was a shocking start to the campaign for heavyweights New Zealand, deemed by umpires to have failed to give way to Switzerland en route to the second mark in the first fleet race. The Kiwis had been travelling at about 60km/h at the time of impact, with both boats grinding to a halt before a stunned crowd on the Fremantle shoreline. Leadership board after SailGP day one Sweden - 31 points USA - 31 points France - 31 points Australia - 24 points Great Britain - 24 points Brazil - 18 points Canada - 17 points Italy - 16 points Denmark - 15 points Germany - 13 points Switzerland - 0 points Spain* - 0 points New Zealand - -8 points *Withdrew with hull damage prior to the event Switzerland is expected to resume racing on Sunday’s second day of the Perth regatta. New Zealand are unable to take further part given significant damage to their boat. The Kiwis have also received eight penalty points on the season leaderboard, but Burling indicated his boat would challenge the league’s findings.\n\nAdvertisement\n\nThe Olympic gold medallist felt his boat did not have time to avoid the Swiss boat so could not be blamed by umpires for the crash. “I’m still blown away, to be honest, that the umpires think we’re at fault,” Burling said. “Initially, we had right of way with them as the windward boat, but then they’ve jibed onto starboard and gained right of way. “We did everything we could to avoid the incident, I don’t think they (Switzerland) could say the same.” Burling felt SailGP had now set the standard for the rest of the Perth regatta and the 12 that follow this season.\n\nAdvertisement\n\n“I think it’s a super dangerous precedent for SailGP to set if that’s the ruling,” he said. Related Article Perth Injury thwarts Iain Jensen’s Aussie SailGP homecoming “Everyone’s obviously pretty shaken-up. It felt like we did a really good job through the build-up. “To have an incident like that happen in the first race of the season is definitely not ideal.” Fighting to recover from grand-final heartbreak last season, Australia had a mixed day, winning the first fleet race on the back of a hot start.\n\nAdvertisement\n\nEighth, ninth and second-placed finishes followed, but skipper Tom Slingsby was mostly pleased after Australia lost star signing Iain Jensen to injury this week. The Olympic gold medallist is in a knee brace after falling during practice on Thursday and was replaced by veteran Glenn Ashby. “I don’t think there’s any other team in the fleet who could lose their wing trimmer a day before and be sitting fourth overall, especially in such tough conditions,” Slingsby said. The three boats that perform best across the weekend’s fleet races will advance to the event final on Sunday afternoon. AAP AAP’s reporter travelled to Perth as a guest of SailGP.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: WA sport\n\nPerth\n\nFremantle",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/trump-announces-escalating-tariffs-on-european-nations-until-us-buys-greenland-20260118-p5nuta.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Blackmail’: Europe lashes out at Trump over latest move to get Greenland",
        "publish_date": "Sun, 18 Jan 2026 12:16:42 +1100",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Advertisement\n\nWorldNorth AmericaTrump diplomacy ‘Blackmail’: Europe lashes out at Trump over latest move to get Greenland Michael Koziol Updated January 18, 2026 — 12:16pm ,first published January 18, 2026 — 5:00am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWashington: US President Donald Trump has announced escalating tariffs on eight European nations until Greenland is sold to the US, in a major escalation of his long-running attempts to acquire the Arctic territory from Denmark. In a 434-word social media post, Trump said a 10 per cent tariff would be imposed on any goods sent to the US from Denmark, the United Kingdom, France, Germany, the Netherlands and the Scandinavian countries of Norway, Sweden and Finland, starting February 1. A poll last year found 85 per cent of Greenlanders opposed becoming part of the United States. Getty Images The tariff would increase to 25 per cent on June 1 and would be payable until a deal was struck for the “complete and total purchase of Greenland” by the US. Trump’s threat provides for two weeks of negotiations – one of his favourite timeframes when trying to win concessions from other countries – before the additional tariffs begin.\n\nAdvertisement\n\nThe US president was aggrieved by several European nations – the eight he singled out for new tariffs – sending small numbers of troops to Greenland last week in solidarity and to begin a larger permanent military presence on the world’s largest non-continental island. The European effort involving joint military exercises is called Operation Arctic Endurance. French President Emmanuel Macron has pledged to dispatch further land, air and sea assets to Greenland in the coming days. French President Emmanuel Macron was among the European leaders who sent military assets to Greenland last week. AP “This is a very dangerous situation for the Safety, Security, and Survival of our Planet,” Trump said of the moves. “These Countries, who are playing this very dangerous game, have put a level of risk in play that is not tenable or sustainable.” Macron said he stood by his decision to join the operation and called Trump’s latest tariff threat unacceptable, promising Europe would respond in a united fashion.\n\nAdvertisement\n\n“No intimidation nor threat will influence us, neither in Ukraine, nor in Greenland, nor anywhere else in the world when we are confronted with such situations,” Macron said. British Prime Minister Keir Starmer said Greenland was part of Denmark and its future was a matter for Greenlanders and Danes. British Prime Minister Keir Starmer says hitting allies with tariffs for protecting the security of NATO is “completely wrong”. Bloomberg “We have also made clear that Arctic security matters for the whole of NATO, and allies should all do more together to address the threat from Russia across different parts of the Arctic,” Starmer said. “Applying tariffs on allies for pursuing the collective security of NATO allies is completely wrong. We will, of course, be pursuing this directly with the US administration.”\n\nAdvertisement\n\nSwedish Prime Minister Ulf Kristersson also rejected Trump’s pressure. “We will not let ourselves be blackmailed,” he posted on X. “Only Denmark and Greenland decide on matters concerning Denmark and Greenland.” The European Union has called on emergency meeting of its national ambassadors to decide on a course of action. It said it stood behind Denmark and Greenland. Greenland Foreign Minister Vivian Motzfeldt (left) and Danish counterpart Lars Løkke Rasmussen in Washington last week. AP Trump’s announcement came days after a tense meeting in Washington between US Vice President JD Vance, Secretary of State Marco Rubio and the foreign ministers of Denmark and Greenland. Trump did not attend. Danish Foreign Minister Lars Løkke Rasmussen, a former prime minister, emerged from the “frank but constructive” discussion saying that it would be “totally unacceptable” for the US to disrespect Denmark’s territorial integrity or the Greenlandic people’s right to self-determination.\n\nAdvertisement\n\nThe parties agreed to form a working group to try to break the impasse, but the “fundamental disagreement” remained, Rasmussen said. Conservative Danish politician Rasmus Jarlov, chair of the parliament’s Defence, Resilience and Preparedness Committee, said in response to Trump’s latest threat that Denmark would never hand over Greenland. Thousands demonstrated against a US takeover of Greenland in the Danish capital, Copenhagen. Getty Images “Every insult, threat, tariff and lie that we receive strengthens our resolve,” Jarlov said on X. “We pray that our true allies will stand with us because we are going to need it.” A poll last year found 85 per cent of Greenlanders opposed joining the US. The territory’s population is about 56,000, but its location as a northern gateway to North America, and its rich stocks of critical minerals, make it strategically significant.\n\nAdvertisement\n\nThousands of protesters marched in Copenhagen and Greenland’s capital, Nuuk, on Saturday to reject Trump’s attempts to acquire the territory. In Copenhagen, they chanted “Greenland is not for sale” and held up slogans such as “No means No” and “Hands off Greenland” alongside the territory’s red-and-white flag as they marched to the US embassy. Greenlandic Prime Minister Jens-Frederik Nielsen led protests in the territory’s capital, Nuuk, on Saturday. AP One protester carried a sign that said: “Yankee go home”, while some attendees wore red, Make America Great Again-style caps that instead read: “Make America Go Away.” In Nuuk, crowds led by Prime Minister Jens-Frederik Nielsen carried flags and similar banners as they headed for the US consulate, chanting “Kalaallit Nunaat” – the island’s name in Greenlandic.\n\nAdvertisement\n\n“I’ve come here today because I think it’s important to show that Greenland is not for sale,” civil servant Naja Holm told Reuters. “It is not a toy. This is our home.” The US has made several attempts to buy Greenland since the 19th century. Trump talked about it in his first term, but has made it a bigger priority in his second, especially since Christmas. On Sunday (AEDT), he claimed the US had “subsidised” Denmark and Europe for decades by failing to charge tariffs, and it was time for Denmark to “give back”. US President Donald Trump says Greenland is vital for US national security. AP “World Peace is at stake!” he wrote. “China and Russia want Greenland, and there is not a thing that Denmark can do about it. They currently have two dogsleds as protection, one added recently. Only the United States of America, under PRESIDENT DONALD J. TRUMP, can play in this game, and very successfully, at that!”\n\nAdvertisement\n\nTrump said the US was open to negotiation with Denmark and the rest of Europe. The US’s need to acquire Greenland was especially important due to his plans for a “Golden Dome”, he said, referring to the proposed missile defence system that could also include Canada. Related Article Mining Trump has big hopes for Greenland – Australia just gave him a reality check Retiring Republican senator Thom Tillis, who was among several US lawmakers who met Danish Prime Minister Mette Frederiksen in Copenhagen this week, said Trump’s response to the European military exercises in Greenland damaged the NATO alliance. “It’s great for Putin, Xi and other adversaries who want to see NATO divided,” he said on X. “The fact that a small handful of ‘advisers’ are actively pushing for coercive action to seize territory of an ally is beyond stupid.”\n\nAdvertisement\n\nWith Reuters Get a note directly from our foreign correspondents on what’s making headlines around the world. Sign up for our weekly What in the World newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/brit-blows-up-over-rivals-suspect-act-20260118-p5nuvd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brit blows up over rival's suspect act",
        "publish_date": "Sun, 18 Jan 2026 12:10:22 +1100",
        "category": "finance",
        "authors": [],
        "text": "Brit blows up over rival's suspect act\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/gibson-on-fire-with-second-break-20260118-p5nuv3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gibson on fire with second break",
        "publish_date": "Sun, 18 Jan 2026 11:38:41 +1100",
        "category": "finance",
        "authors": [],
        "text": "Gibson on fire with second break\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/game-of-thrones-prequesl-a-knight-of-the-seven-kingdoms-explained-20260114-p5nu3g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The new Game of Thrones prequel is great. But what should you know before watching?",
        "publish_date": "Sun, 18 Jan 2026 11:30:00 +1100",
        "category": "entertainment",
        "authors": [
            "Benji Wilson"
        ],
        "text": "Advertisement\n\nCultureTV & radioBluffer's Guide The new Game of Thrones prequel is great. But what should you know before watching? Benji Wilson January 18, 2026 — 11:30am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe reviews are in. The much-anticipated Game of Thrones prequel, A Knight of the Seven Kingdoms, is being praised as a total success – “a fresh take” on Westeros that will “satisfy old fans who’d grown restless”. Thankfully, for those of us who tuned out of the Game of Thrones universe, the series works as a standalone show telling a straight-line story of a likeable nobody who comes in to town with his buddy, wanting nothing more than to prove himself. But if you’re feeling reluctant about diving back in, here’s everything you might want to know first. Peter Claffey stars in new Game of Thrones prequel, A Knight of the Seven Kingdoms HBO Max How does this show fit in to the Game of Thrones universe? Same universe, different time. A KOTSK is set in Westeros, the swords-and-sorcery quasi-medieval fantasy land that is the setting for both Game of Thrones and House of the Dragon. We’re roughly 100 years after the events of House of the Dragon and 100 years before Game of Thrones.\n\nAdvertisement\n\nIs it also based on a George R.R. Martin bestseller? Yep, three novellas called The Hedge Knight (1998), The Sworn Sword (2003) and The Mystery Knight (2010). They’re much smaller books than the doorstops that make up the Song of Ice and Fire series. Related Article ★★★★\n\nReview What a relief – they actually got this Game of Thrones prequel right So is this a much smaller show? It is. Some would say mercifully so. Set largely in a single location at a mid-level jousting tournament, AKOTSK gets six (shorter) episodes to tell the story of our new heroes Dunk (Peter Claffey) and Egg (Dexter Sol Ansell). Dunk is a peasant-born wannabe knight from the slums of Fleabottom who teams up with Egg, a bald stable boy desperate to be his sidekick. Together, they head to the small river town of Ashford Meadow for the big joust-off, hoping to earn their spurs.\n\nAdvertisement\n\nAre there dragons? No. They’ve all died out. If you want to fight at this tournament you do it on a horse. Wait – those blond-haired bullies who come to the tournament look suspiciously like Targaryens… They are. Baelor Breakspear Targaryen (Bertie Carvel), the heir to the throne, is here. And he’s joined by his brother Maekar Targaryen (Sam Spruell), cousin Valarr (Oscar Morgan) and Maekar’s pantomime villain son Aerion ‘Brightflame’ (Finn Bennett). The Targaryens think that the joust at Ashford Meadow is a bit beneath them but without their dragons the family needs to play nice with its subjects, so decides to play along. They spend most of AKOTSK wishing they were somewhere else.\n\nAdvertisement\n\nDon’t I know that guy? You mean Finn Bennett? Yes, he was the breakout star of HBO’s True Detective: Night Country. Or did you mean Bertie Carvel? He was Tony Blair in The Crown. Or perhaps you meant Daniel Ings, who was in The Crown, Sex Education and The Gentleman. Anyways, you get the idea: HBO has stacked AKOTSK full of top-notch British acting talent, just as it did with Game of Thrones. Oh, just Brits? And one crucial Aussie! Perth’s Tanzyn Crawford plays Tanselle ‘Too-Tall,’ a puppeteer who turns Ser Duncan’s head (and not just because they’re both tall). Peter Claffey and Australian Tanzyn Crawford in A Knight of the Seven Kingdoms HBO Max\n\nAdvertisement\n\nWho else will I know from Game of Thrones? You’ll also recognise the name Baratheon. Ings plays Ser Lyonel Baratheon, known as The Laughing Storm, a man who knows how to get a party started. Elsewhere, there are Fossoways (last seen in Game of Thrones season two) and Dondarrions (Beric was a key Game of Thrones player), but mostly this is about Ser Duncan the Tall and his squire Egg. Peter Claffey and Dexter Sol Ansell star in A Knight of the Seven Kingdoms HBO Max How tall is Duncan the Tall? In the books Dunk is written as 6′ 10″ (2 metres) but Peter Claffey who plays him is 6′ 5″. He’s still a bruiser though – before he became an actor, Claffey played rugby union in the second row for Ireland.\n\nAdvertisement\n\nWhat’s the tournament they’re all attending? It’s a five-lane mega joust in which knights strap on 60 pounds of armour, jump on a horse, pick up a 15-foot wooden pole and then charge at the other guy to knock him off his mount. Initially, it’s a “joust of peace”, a fun-for-all-the-family sports event where no one is meant to get hurt. But this is the Game of Thrones universe, so you know it’s going to turn nasty. Related Article Streaming ‘An expensive and clunky footnote’: House of the Dragon improves, but is it actually good? Why did they choose this chunk of George R.R. Martin’s massive oeuvre for the next TV adaptation? In part to keep Martin happy. He’s always said that the Dunk and Egg stories are his favourites. Also, Martin has criticised House of the Dragon for moving away from his source material, so this is a chance for HBO to show that they can stick to his script.\n\nAdvertisement\n\nIt’s also a good script to stick to – the Dunk and Egg novellas are funny, rely on a single point of view and show a spit-and-sawdust version of Westeros that feels new. There’s a feeling that viewers are a little punch drunk from 10 years of highborn machiavellians plotting to rule the world with huge armies and week-long battles. AKOTSK is a definite change of approach. Okay, I think I’m in. But what sort of commitment are we talking here? Game of Thrones went on for ages… Though this first season is just six episodes long, the show has already been renewed for a second season, with production under way in Ireland. Season two is expected in 2027. Whether we get more than that will, once again, depend on Martin. “The big issue is that I have only written three novellas, and I have a lot more stories about Dunk and Egg in my f---ing head,” he recently told The Hollywood Reporter. “I’ve got to get them down on paper”. A Knight of the Seven Kingdoms premieres January 19 on HBO Max. Find out the next TV, streaming series and movies to add to your must-sees. Get The Watchlist delivered every Thursday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/woodbridges-passionate-defence-of-de-minaur-20260118-p5nuv0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woodbridge's passionate defence of de Minaur",
        "publish_date": "Sun, 18 Jan 2026 11:14:27 +1100",
        "category": "finance",
        "authors": [],
        "text": "Woodbridge's passionate defence of de Minaur\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/dark-and-disturbing-this-is-a-turandot-for-our-times-20260117-p5nus5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dark and disturbing: This is a Turandot for our times",
        "publish_date": "Sun, 18 Jan 2026 11:11:56 +1100",
        "category": "entertainment",
        "authors": [
            "Katie Lawrence",
            "Chantal Nguyen",
            "Peter Mccallum"
        ],
        "text": "Advertisement\n\nSydney Festival CultureLive reviewsSydney live reviews Dark and disturbing: This is a Turandot for our times Katie Lawrence , Chantal Nguyen and Peter McCallum January 18, 2026 — 11:11am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nSydney Festival is upon us for another year. Here is everything you need to know - reviews, previews and interviews - to plan your festival experience. See all stories .\n\nOPERA\n\nTurandot\n\nOpera Australia\n\nJoan Sutherland Theatre, Opera House, January 15\n\nUntil March 27\n\nReviewed by PETER McCALLUM\n\n★★★★½ In Opera Australia’s new production of Puccini’s last (and incomplete) opera, Turandot, director Ann Yee and designers Elizabeth Gadsby (set), David Fleischer (costumes) and Paul Jackson (video) have placed a magnificent trio of principals, Rebecca Nash (Turandot), Young Woo Kim (Calaf) and Maria Teresa Leva (Liu), in a dark dystopia of the mind. Everyone wears the same drab blue and grey (except Turandot who first appears in pristine white). The walls and fabric have creeping dark patches at the edges like mould suffocating the soul, while a projected video-game avatar lurks on the back wall, blinking creepily. Rebecca Nash as Turandot. Keith Saunders Side-stepping the original’s racist stereotypes, Ping, Pong and Pang (Luke Gabbedy, John Longmuir, Michael Petruccelli) become P1, P2 and P3, cynical techno-geeks whose retro-technology inure them from reality.\n\nAdvertisement\n\nCentral to Yee’s conception is to make the ancestor who spurs Turandot’s hostility towards men, Lou-Ling, into an embodied character – a dancer (Hoyori Maruo), whose writhing convulsive movements return at salient moments. Although the silent dance before the music began had moments of awkwardness, it placed the persona firmly in the listener’s mind as a driver of action. When Lou-Ling unites with the gentle Liu, “so good, so sweet”, at the end, the message is clear: it is the suffering of both that creates healing from intergenerational trauma. Young Woo Kim as Calaf. Keith Saunders In this context, the problematic final scene (completed by the composer Adami from Puccini’s sketches) was meaningful where it is often ineffective (though one wonders if Puccini himself would have shortened it to create more verismo impact after the emotional climax of Liu’s death). Conductor Henrik Nanasi maintained dramatic momentum incisively up to that poignant moment, so the score moved forward with the decisiveness of the story, while leaving ample flexibility for the singers to expand expressive moments.\n\nAdvertisement\n\nAs Calaf, Kim sang with gorgeous, richly tanned velvety colours and stentorian strength that he seemed able to push to the limits without cracking the beautifully burnished finish. He leavened the soaring lines of Nessun Dorma with phrases of quieter nuance to give classic shape to this most famous of moments and, more broadly, created a rounded character, which avoided pushing Calaf’s forceful dominance too far into wearying and overbearing self-centredness. Nash was every bit his equal as Turandot, matching his tone in the riddle scene with vivid dramatic colours and riveting, almost frightening, intensity, which she transformed to a softer glow in the final scene. Leva captured both simplicity and depth as Liu singing with light charm in Act 1 and allowing more full-blooded passion into the sound in Act 3. Her most memorable note was the high B flat in her first aria, which emerged like a quiet truth in a mist of melancholy. Richard Anderson was a poignant Timur giving well-shaped lines unvarnished eloquence. As the three Ps, Gabbedy, Longmuir and Petruccelli provided sarcastic comic counterpoint, sustaining Puccini’s slightly overlong scene in Act II strongly, with well-articulated vocal lines and witty deflection, as though responsible for the running of the machinery of a surveillance state. In fading respectable skivvy and slacks Gregory Brown sang the Emperor’s role with frail clarity like one keen to return to his retirement village, while Shane Lowrencev made the Speaker’s role into a mindless vehicle of autocratic edicts. Placed on a revolving stage with static symbolic movements, the Opera Australia Chorus sang with vivid openness, subtlety and power to bind together these fragments of the excesses of human passion.\n\nAdvertisement\n\nDANCE\n\nEXXY\n\nSydney Opera House, Drama Theatre\n\nJanuary 15\n\nUntil January 18\n\nReviewed by KATIE LAWRENCE\n\n★★★★★ Think of something in the world that makes you question the future of humanity. I’ll wait.\n\n(Actually, I won’t — we’d be here all night.) Whatever came to mind, Dan Daw’s Exxy is the antidote. Exxy is a dance-theatre love letter to the best of us: to survival, to tenderness, and to a tiny boy with cerebral palsy and his ballsy Nan, belting out The Power of Love into the red dust of the outback. It is hilarious, ferocious, devastating – and somehow also an incredible night out.\n\nAdvertisement\n\nDan Daw is resplendent in a tank top and kilt. Neil Bennett The action unfolds against corrugated iron, framed by deck chairs and the vast Australian landscape. The cast of four (Daw, Tiiu Mortley, Joseph Brown and Sofia Valdiri) are stunning. Monologues and movement land like gut-punches, then pull you in for a hug. From the jump, Exxy commits hard to inclusion. Participation isn’t just welcome; it’s actively directed via flashing overhead captions. Don’t panic. I have never enjoyed being gently bossed around by a show more, including the singalong (no spoilers, but it goes off). The costumes and sets (by Kat Heath) are Mad Max survival chic: industrial greys, bodies braced for impact. It’s battle gear with a forehead kiss. Daw is resplendent in a tank top and kilt, tattoos on full display. His solos are breathtaking in their intelligence and clarity; the definition of a dancer working with his body. Guy Connelly’s soundtrack ranges from lilting melodies to techno thuds, matching the movement. The stage is carpeted in saltbush and light. Daw’s metaphor is clear: saltbush doesn’t just survive; it bursts through concrete.\n\nAdvertisement\n\nExxy is packed with camp, gleeful absurdity. Neil Bennett Exxy doesn’t sugarcoat. It tells stories of sexual rejection and casual cruelty: doors slammed in faces; turning up for a hookup only to be asked to leave after undressing; encounters with people who need someone else kneeling in order to feel tall. Don’t be misled into thinking Exxy is solemn. It is packed with camp, gleeful absurdity – performers on all fours, drooling onto the stage; a “who’s better at cerebral palsy” battle that ends in applause; a group marathon where the destination is unclear but the vibe is unadulterated “I got you.” Exxy is 90 minutes in a room full of people who vocally have your back. Like saltbush, Exxy doesn’t ask for permission to take up space. It insists on participation, demands tenderness – and turns the theatre into an intimate, raucous, glorious celebration of being alive.\n\nAdvertisement\n\nDANCE\n\nSave the Last Dance for Me\n\nPalm Grove, Sydney Town Hall, & Leichhardt Town Hall\n\nJanuary 15\n\nUntil January 23\n\nReviewed by CHANTAL NGUYEN\n\n★★★★½ In Save the Last Dance for Me, a white dance floor is marked out with masking tape in a diamond pattern. A slow, electro-swing beat begins (Aurora Bauzà and Pere Jou’s soundscape), and two men pace onto the dance floor (Gianmaria Borzillo and Giovanfrancesco Giannini). They both have neat, toned physiques; upright posture; slick fashionable clothes; and impassive facial expressions. Stylistically, they are clearly European contemporary dance artists. Gianmaria Borzillo and Giovanfrancesco Giannini. Stephen Wilson Barker But the dance itself has more earthy roots. It is the polka chinata, a folk dance from Bologna, Italy when early-1900s social norms prohibited men from dancing with unmarried women. So the men danced with each other, exerting to attract female attention with the polka chinata’s rapid complexity.\n\nAdvertisement\n\nBorzillo and Giannini slowly grasp each other in a ballroom embrace, their bodies gently lifting like two lungs inhaling. A pause like a wave cresting, then they begin gliding down each arm of the diamond, their feet moving in a swift, syncopated pattering step. The travelling step becomes hypnotic in its speed and liquid intricacy. One false move and the dance would meet the kind of tangled end you see in cycling race pile-ups. Related Series\n\nSydney Festival Sydney Festival 2026 But Borzillo and Giannini never misstep, their bodies moving with such smooth, disciplined synchrony that it is like watching one entity rather than two (interestingly, the two male bodies are far more visually uniform than ballroom dancing’s usual male-female pairing). There are dizzying spins and a remarkable scooching turn, where Borzillo and Giannini grasp each other’s biceps, crouch down, and begin to whirl. When the choreographer, Venice Golden Lion-winner Alessandro Sciarroni, first learnt about the polka chinata, you could count on one hand the number of couples who still knew how to dance it. He sent Borzillo and Giannini to Bologna to learn the dying artform. That effort led to this extraordinary piece, a rediscovery of a folk dance form, beatified and resurrected in a modern, fine arts setting.\n\nAdvertisement\n\nA smile breaks through Borzillo’s face, his neat shirt now drenched with sweat. As they break through a wall of exhaustion, the audience begins clapping along, uplifted by the combination of tradition and modernity. Passers-by linger, entranced. The finale is a joyous crescendo of movement, with grins all round. With Canadian import Kris Nelson directing this year’s Sydney Festival, the dance offerings have been exceptionally strong. At just 30 minutes, Save the Last Dance for Me is a clear winner. Get the day’s breaking news, entertainment ideas and a long read to enjoy. Sign up to receive our Evening Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/irans-leader-calls-trump-a-criminal-blames-protesters-for-deaths-20260118-p5nuuz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Iran's leader calls Trump a 'criminal' blames protesters for deaths",
        "publish_date": "Sun, 18 Jan 2026 10:58:53 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/i-m-a-casual-tennis-fan-what-have-i-missed-20260117-p5nuqv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I’m a casual tennis fan. What have I missed?",
        "publish_date": "Sun, 18 Jan 2026 10:56:42 +1100",
        "category": "sports",
        "authors": [
            "Scott Spits"
        ],
        "text": "So you like tennis, but don’t stay up all night watching it during the year unless there’s an Aussie on a roll at Wimbledon. But now it’s Australian Open time, and you can’t get enough of it. Let us bring you up to speed.\n\nWho is the men’s No.1, and what is ‘Sincaraz’?\n\nCarlos Alcaraz (world No.1) and Jannik Sinner (No.2) are dominating the men’s game. And they took their stranglehold to a new level in 2025 – thanks, in part, to a ridiculously good Roland Garros final won by Alcaraz that lasted five hours and 29 minutes.\n\nSome of the top seeds at the 2026 Australian Open. Credit: Getty, AP, The Age\n\nBetween them, Alcaraz and Sinner have won the past eight grand slams and nine of the past 10, hence the so-called ‘Sincaraz’ rivalry - bromance, even - between them.",
        "source": "TheAge"
    }
]