[
  {
    "url": "https://www.9news.com.au/national/south-korea-phasing-out-of-thermal-coal-to-impact-australian-exporters/ddcba754-8501-4d8c-ba66-ec92595d3c29",
    "title": "One of Australia's biggest customers ditches our biggest export",
    "publish_date": "Thu, 20 Nov 2025 00:21:32 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Energy experts say South Korea's pledge to phase out thermal coal should be a wake-up call for Australia's fossil fuel industry.﻿\n\nThis week South Korea - a major customer of Australian thermal coal exports - joined Powering Past Coal Alliance (PPCA), committing to abandon all its coal power by 2040.\n\nThe move was lauded by environment campaigners who have pushed major industrial nations to ditch fossil fuels and replace them with renewable energy sources.\n\nREAD MORE: Australia loses out in bid to host crucial climate conference\n\nSouth Korea is phasing out coal, and that has major implications for Australian mining companies. (AP)\n\nSouth Korea is the world's fourth largest importer of coal, which is used to power its industrial base and heat homes.﻿\n\nBut the country's steelmakers have been building steel plants that do not use coal, resulting in a gradual drop in demand for the fossil fuel.﻿\n\nBut South Korea's decision and similar moves by other nations also brings big implications for Australian coal exporters.\n\nThe value of Australian coal exports to South Korea is worth about $2.4 billion a year, data analytics company Kpler said.\n\nThe Australian Office of the Chief Economist has forecast a near 15 per cent decline in global thermal coal demand in the three years to 2027.\n\nThermal coal, along with iron ore, liquified gas and coking coal, make up Australia's four largest commodity exports from last year.\n\nClimate Energy Finance director Tim Buckley said those major exporters would be \"terminally challenged\" over coming decades as countries shifted to renewable energy to meet commitments under the 2015 Paris agreement.\n\n\"This should send a strong reminder to Australia as the second largest exporter of thermal coal behind only Indonesia that our key trade partners are responding to climate science and their treaty obligations,\" he said.\n\n\"Australia needs to pivot our export focus to low emissions industries of the future, in particular exporting green iron and aluminium, critical minerals and lithium hydroxide to help our key trade partners jointly deliver on their decarbonisation objectives.\"\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .\n\n﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/new-underquoting-laws-victoria-reserve-price-disclosure-set-to-be-introduced/f98139b7-96d6-4f95-95d1-60440c3c1318",
    "title": "Fresh laws will stop dodgy real estate agents from underquoting home prices",
    "publish_date": "Thu, 20 Nov 2025 00:44:56 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "A﻿ustralian-first laws will soon make it illegal for Victorian real estate agents to underquote the reserve price of a property in the days before an auction.\n\nAgents will be made to disclose a home's exact reserve price a week before it goes under the hammer in a major overhaul of underquoting legislation in the state.\n\nUnderquoting is already illegal in Victoria however the proposed ﻿reform will make it harder to advertise misleading prices closer to auction day.\n\nAgents will be made to disclose a home's exact reserve price a week before it goes under the hammer. (Dion Georgopoulos)\n\nThe key change was announced today by Victoria's Consumer Affairs Minister Nick Staikos﻿ today after media reports of dishonest auction practices.\n\nUnder the current laws, agents can set a reserve or asking price which is above the previously advertised figure as late as the day of the auction﻿.\n\nIt leads to potential homebuyers wasting their Saturday at auctions for a home they an't afford.\n\nThe updated laws will require agents to publish the actual reserve price at least seven days before auction day.\n\nReal estate agents who fail to disclose a reserve price within this time frame will be banned from proceeding to auction or sale.﻿\n\nAll marketing materials will be required to reflect the honest reserve price too.\n\n﻿\"Underquoting isn't fair and it's young Victorians and families paying the price,\" Staikos said today.\n\n\"That's why we're stamping it out by requiring reserve prices to be published at least seven days before an auction.\n\nVictoria's Consumer Affairs Minister Nick Staikos. (Eddie Jim)\n\n\"We want the housing market to be fair – that's why we're continuing to crack down on underquoting with strong laws, a dedicated taskforce and active enforcement.\"\n\nThe Labor government said its underquoting taskforce has﻿ issued over 200 infringements totalling over $2.3 million in fines.\n\nIn response, the Victorian Greens said it supported the fresh underquoting laws but warned it may not have any impact on housing affordability.﻿\n\nAll marketing materials will be required to reflect the honest reserve price too. (Getty)\n\nThe Greens claimed underquoting has \"run rampant\" in the state, which has fuelled competition and driven prices up.\n\n\"Labor's finally catching. First-home buyers have been getting completely screwed for years, wasting time and spending thousands on inspections for homes they were never going to afford,\" said Victorian Greens housing spokesperson Gabrielle de Vietri.\n\n\"Being told the reserve early is helpful, but it doesn't change the reality that most young people can't afford the reserve in the first place.\"\n\nSimilar laws were introduced this month in NSW , which penalises dodgy real estate agents who put misleading price estimates in property listings.﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/worst-cities-for-rush-hour-traffic-how-much-time-australians-spend-getting-to-work/2e51210b-cbd6-47ff-9d1a-45b61a597be9",
    "title": "Aussie cities with the most expensive commutes revealed",
    "publish_date": "Thu, 20 Nov 2025 00:19:52 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Australians who drive to work are losing a staggering 212 million hours a year sitting in traffic, the equivalent of 8.8 million working days and about $9.7 billion in lost time.\n\nAnalysts at iSelect used ABS, census and congestion data to find out how long Australians were spending stuck in rush hour traffic, and how much it was costing them in terms of lost earnings and fuel costs.\n\nMelbourne has the worst driving commute in the country, losing the equivalent of $4628 a year.\n\nAustralians are spending billions of dollars to get to work each year. (Getty)\n\nIn second place among the captials was Sydney ($4568)﻿, followed by Perth ($3496), Brisbane ($3447), Adelaide ($3377), Canberra ($2244), Hobart ($1856), and Darwin ($1390).\n\nSome regional centres also notched up high totals, including Newcastle ($2587) and the Gold Coast ($2443).\n\nAcross Australian cities, the average driver spends roughly $2788 a year due to congestion.\n\nDifferent professions also bear different costs.\n\nMedical practitioners spend more than four extra days a year in traffic, iSelect found, which was the equivalent of $6784 a year.\n\nOther high-cost occupations include air and marine transport professionals, who spend more than three days a year in traffic, translating to a combined cost of $5436. Health diagnostic and promotion professionals spend $5418.\n\nThe full research can be found here .﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/health/mrna-flu-vaccine-pfizer-trial-results/d7d0ba8e-9ed8-4035-95cc-882f99d38a78",
    "title": "New mRNA flu vaccine far more effective than existing jabs: study",
    "publish_date": "Wed, 19 Nov 2025 22:00:00 +0000",
    "category": "lifestyle",
    "authors": [
      "Nov"
    ],
    "text": "A newly developed mRNA-based flu vaccine is almost 35 per cent more effective against the most common form of influenza , according to a new study.\n\nThe phase three trial, whose results were published this morning in the New England Journal of Medicine , involved more than 18,000 people aged between 18 and 64.\n\nHalf of the participants were given a standard flu vaccine, while the other half received the new mRNA option developed by Pfizer.\n\nA phase three trial of an mRNA flu vaccine developed by Pfizer shows it is more than 34 per cent more effective against influenza A than existing vaccines. (AP)\n\nThe study found that the latter was 34.5 per cent more effective at protecting people against influenza A.\n\n\"The mRNA vaccine performed better than conventional flu vaccines,\" Professor Archa Fox from the University of Western Australia, who wasn't involved in the study, said.\n\n\"Only 0.63 per cent of people injected with the mRNA flu vaccine came down with the flu, compared to 0.95 per cent of people injected with the conventional flu vaccine.\"\n\nThe results are similar to a trial of another mRNA flu vaccine developed by Moderna, which showed a 26.6 per cent effectiveness increase compared to a standard vaccine.\n\nHowever, there weren't enough cases of influenza B in today's study to determine the Pfizer vaccine's effectiveness against that type of virus, and the mRNA jab was also linked to a higher rate of mild to moderate side effects.\n\nInfluenza killed more than 1000 people in Australia last year and is on track to kill even more in 2025. (CDC)\n\n\"Lab tests suggested that the new vaccine may not be as effective against B strains,\" Associate Professor Seth Cheetham from the University of Queensland said.\n\n\"The mRNA vaccine was safe, but an elevated rate of side effects, such as headache and injection site pain, was detected compared to traditional vaccines.\"\n\nThe level of severe side effects, though, was similarly low for both vaccines.\n\nHowever, the phase three trial showed another limitation of the Pfizer vaccine: a lack of benefit for vulnerable elderly patients.\n\n\"Most crucially, it showed no significant benefit for adults over 65, the group most at risk from severe flu, highlighting that this is a promising step forward but not a complete solution for all,\" molecular virologist Vinod Balasubramaniam said.\n\nVaccination rates against flu have dropped significantly in recent years in Australia, despite a surge in the number of cases of the potentially deadly illness.\n\nExperts are hoping the development of mRNA vaccines, using similar technology to what was behind the successful COVID-19 vaccines, could lead to better protection against the virus.\n\n\"Manufacturing mRNA vaccines is significantly faster than traditional methods, which rely on growing the virus in eggs or cells, a process that can take six months or more,\" Dr Emma Grant from La Trobe University said.\n\n\"Faster production means vaccine strains can be selected closer to the flu season, reducing the risk of mismatch with circulating viruses.\n\n\"Moreover, as demonstrated with COVID-19 vaccines, mRNA technology can activate multiple arms of the immune system, including long-lived killer T cells that recognise multiple different influenza strains…\n\n\"This capability moves us closer to the long-sought goal of a 'universal' influenza vaccine, one that provides broader and longer-lasting protection.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/man-ordered-to-turn-in-il-duce-licence-plates/1e2ca54d-06e5-4567-8a59-f68e70c4b31f",
    "title": "NSW man ordered to turn in plates featuring dictator's nickname",
    "publish_date": "Wed, 19 Nov 2025 21:19:40 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "A Sydney man says an order to turn over his personalised licence plates featuring the infamous nickname of a WWII dictator is a violation of his free speech rights.\n\nEddie sent a message to Ben Fordham Live on 2GB saying the message he received from Transport for NSW was \"another damning indictment of the woke left imposing their thoughts on our society\".\n\nHis personalised licence plates, for which he claims he paid just shy of $900, read ILDUCE, or \"Il Duce\" - Italian for \"The Leader\".\n\nREAD MORE: Meta to start closing teenage accounts weeks social media ban starts ﻿\n\nDuce is descended from the Latin word \"dux\", from which the noble title \"duke\"﻿ is also derived.\n\n\"Il Duce\" was also the widely used nickname of fascist dictator Benito Mussolini, who ruled Italy from 1922 until his overthrow and death in 1945, and who was a close ally of Adolf Hitler.\n\nEddie told 2GB's Ben Fordham that he chose the plates to reflect his business role.\n\nA man has been ordered to turn in his personalised licence plates emblazoned with \"ILDUCE\". (Supplied)\n\n﻿\"(The car) is under my company ownership, the words really mean 'the leader', I'm the director of the company,\" he said.\n\nHe acknowledged there was a \"connotation\" to Mussolini but maintained the words themselves were innocent.\n\nHe claimed there was a double standard in place, with other \"offensive\" licence plates allowed on the roads.\n\n\"Il Duce\", meaning \"The Leader\" in Italian, was the nickname of fascist dictator Benito Mussolini. (Supplied)\n\nMussolini, left, was an ally of Adolf Hitler in WWII. (AP)\n\nTransport for NSW confirmed a member of the public had reported the plates﻿, which were subject to an assessment by the department.\n\n\"The decision to withdraw the plates is based on a wider perception they could be directly related to fascist dictator Benito Mussolini,\" a spokesperson said.\n\n\"The ILDUCE number plates were originally issued due to an oversight in the vetting process.\"\n\nTransport for NSW will refund the balance of the annual fee owing for the plates and issue replacement plates at no cost.\n\nEddie will also be able to order a new set of personalised plates up to the same cost as he paid for the ILDUCE plates, free of charge.\n\nUntil then, he will be given general issue plates on the spot when he turns in the ILDUCE plates before the deadline of November 24.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/australia-post-brings-back-weekend-deliveries-ahead-of-christmas-rush/c1ebb868-b28c-481b-9053-0ac049ed796b",
    "title": "Australia Post brings back weekend deliveries ahead of Christmas rush",
    "publish_date": "Wed, 19 Nov 2025 22:49:12 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Australian shoppers can now expect parcels to arrive any day of the week, as Australia Post reintroduces temporary weekend deliveries starting this Saturday to manage the enormous volume of packages expected this festive season.\n\nThe move, which covers all metro capital cities and selected regional locations, comes as Australia Post prepares for the surge driven by major sales events like Black Friday and Cyber Monday.\n\nThe weekend service will remain in place until Christmas.\n\nAustralia Post will be delivering on weekends in the lead-up to the Christmas rush. (iStock)\n\nGary Starr, Australia Post's Executive General Manager for Parcels, Post, and eCommerce Services, said the extra service would ensure deliveries remained timely during the peak period.\n\n\"With Black Friday and Cyber Monday just around the corner, we're expecting to see a significant spike in parcel volumes and online spending activity,\" Starr said.\n\n\"Last year we delivered nearly 103 million parcels over the Black Friday sales period, and we're ready to go even bigger this holiday season. Weekend deliveries are just one of the ways Australia Post is stepping up to support our customers.\"\n\nTo handle the expected influx of parcels, Australia Post has had to expand its resources.\n\nThis includes adding more free Parcel Lockers and opening new, dedicated parcel-focused Post Offices with 24/7 self-serve options in metro areas across NSW, VIC, QLD, and ACT.\n\nChristmas deadlines for packages\n\nTo avoid disappointment, shoppers are being told to stick to these cut-off dates to guarantee arrival by Christmas Day.\n\nService Same state (metro) Interstate (metro) Parcel Post Monday, December 22 Friday, December 19 Express Post Tuesday, December 23 Tuesday, December 23\n\nPeople sending to or from Western Australia, Northern Territory, Tasmania, or regional and remote locations, should allow a few extra days.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/cancer-pancreatic-plea-disease-wiped-out-stephs-beloved-family-within-a-year/955a325d-9066-41fb-88b9-b04eb35beac2",
    "title": "One disease wiped out Steph's family in a year. Survival rates have barely changed",
    "publish_date": "Wed, 19 Nov 2025 18:29:04 +0000",
    "category": "lifestyle",
    "authors": [
      "Nov"
    ],
    "text": "Exclusive: For anyone, having a loved one diagnosed with cancer is devastating.\n\nEspecially when it's one of the least survivable kinds.\n\nBut﻿ Steph McGuire, 31, lost her mother, father and aunt to the same kind of cancer over just 12 months.\n\nSteph McGuire, 31, has lost her mother, father and aunt to the same kind of cancer in just 12 months. (Supplied)\n\n\"It's hard to know what to feel it's just so surreal,\" McGuire, from Melbourne, said.\n\n\"When mum got it, obviously it hit hard.\n\n\"Then a few months later, my dad got diagnosed, which was horrible.\n\n\"It was stage four, my mum was stage three.\n\n\"Then my aunty got diagnosed a year or so later.\n\n\"You're like, 'Surely it's not the same.'\"\n\nThe mother to Harvey, four, and Hazel, 10 months, with ﻿husband Shaydan, is now worried about her own health.\n\nHer mum, Vicki Jackson, who worked at a law firm, died aged 65 in July 2024, just over two years after being diagnosed with pancreatic cancer.\n\nHer early symptom was itching palms, a sign of bile in the bloodstream.\n\nSteph's father died from pancreatic cancer a year after her mother. (Supplied)\n\nHer former CEO father, Steve, who was given the devastating news that he too had pancreatic cancer just months after his ex-wife's diagnosis, died a year after that, aged 66.\n\nHe had bowel issues, which flagged a problem, though he defied expectations to live for three years﻿ after chemo and a trial treatment.\n\nIn between losing her parents, Steph's aunt and her mother's sister, Valerie Boyd, was also diagnosed with and died from the disease.\n\nShe had diabetes, which can be an indicator.\n\nSteph is now doing genetic testing to see if she's likely to develop it, though testing done on her parents indicated it was not a genetic type.\n\nAn early diagnosis is crucial to surviving.﻿\n\n\"It definitely freaks me out, ﻿once the symptoms are there, it's really too late,\" she says.\n\nAdvocates are also pushing for more money to help save lives.\n\nSteph's mother Vicki, right, and her aunt Valerie both died from the disease. (Supplied)\n\nMichelle Stewart, CEO of Pankind, said earlier detection and faster treatment - as well as funding for research - is needed.\n\n\"Survival has improved, but not fast enough and when several members of a family are diagnosed, it underscores the urgent need to understand familial and genetic risk,\" Stewart said.\n\nPankind has a family health checker online so Aussies can assess their risk.\n\nLast month, a new study for a screening program was announced, trialling surveillance methods for those at higher risk.\n\nIt aligns Australia with the global PRECEDE study, which aims to lift five-year survival rates from 13 to 50 per cent within a decade.\n\nA spokesman for the Department of Health, Disability and Ageing said the Australian Government supports health and medical research with $650 million annually from the Medical Research Future Fund (MRFF) and around $1 billion a year through the National Health and Medical Research Council's (NHMRC) Medical Research Endowment Account (MREA).\n\nIt has invested more than $13 million for research focused on pancreatic cancer in the past decade, he said.\n\n\"Between 2015 and 2024, the NHMRC has expended $41.5 million towards research relevant to pancreatic cancer.\n\n\"On 2 May 2024, Minister (Mark) Butler announced the MRFF Low Survival Cancers Mission (LSCM).\n\n\"It will provide $150 million over 10 years, from 2027-28, for research to improve care and health outcomes for people with low survival cancers, including pancreatic cancer.\"\n\nREAD MORE: Professor flooded with death threats after what he wants banned from Queensland ﻿\n\nHealth Minister Mark Butler has announced more money for cancer. (Getty)\n\nPancreatic cancer facts\n\nPancreatic cancer is the third-leading cause of cancer death in Australia.\n\nSymptoms include abdominal and back pain, jaundice, loss of appetite, unexplained weight loss, fatty stool, new onset or hard to manage diabetes and nausea.\n\nPatients diagnosed have just a 13 per cent chance of surviving for five years, according to Pankind.\n\nOnly three out of 10 people diagnosed will be alive after a year.\n\nIt's a number which has not increased for 15 years, unlike the figures for other cancers such as breast cancer, which is now at a 93 per cent five-year survival rate .",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-20/young-cricketer-ben-austin-farewelled-at-melbourne-funeral/106031014",
    "title": "'Champion young man' who died in cricketing accident farewelled",
    "publish_date": "Thu, 20 Nov 2025 01:46:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Shane Warne stand at Junction Oval was a sea of cricket shirts, football jumpers and scarves as friends and family gathered to farewell Melbourne teenager Ben Austin, who died in a tragic cricket accident last month.\n\nBen, 17, was struck in the neck by a ball while practising in the nets at Wally Tew Reserve in Ferntree Gully, in Melbourne's outer east.\n\nHe later died in hospital.\n\nJunction Oval in St Kilda — the home of Cricket Victoria — was a fitting venue for the sports-mad boy who loved cricket and football.\n\nA framed photo of Ben sat on a table on the oval alongside a football bearing his name, signed Collingwood and Waverley Park Hawks football jumpers, and the 2023 AFL premiership cup. A cricket bat with his name and the number 521 leant on the table.\n\nThe 2023 AFL premiership cup sat alongside a football and cricket bat. (ABC News)\n\nFuneral celebrant Jennifer Mettner said the oval was a special place for Ben and his father Jace.\n\n\"This is a place where Jace and Ben have been together,\" she said.\n\n\"They really loved being here. Taking in the atmosphere, and everything that it has to offer.\"\n\nMs Mettner also said starting the service at 11am was significant.\n\n\"11am was the time that the first ball of cricket was traditionally bowled,\" she said.\n\nA normal Tuesday turns into 'a nightmare'\n\nBen's grandfather, David Austin, said the teenager was a beloved son of Tracey and Jace and a big brother to Cooper and Zach.\n\nHe said Ben, who attended Rowville Sports Academy, hoped to become a physical education teacher if a sporting career didn't eventuate.\n\nBen's grandfather David Austin gave the eulogy. (ABC News)\n\n\"He then said, 'If my cricket and football don't reach the top level where I'm getting paid, I'll be a boundary umpire in the AFL. They get good money',\" David Austin recalled.\n\n\"And I thought, 'That'll work for Ben. He can run all day'.\"\n\nDavid Austin said the day of the accident started as any other Tuesday, with the three Austin brothers coming around for breakfast before school.\n\nBut it soon turned into \"a nightmare and our most tragic day\".\n\n\"Jace, Tracey and their family want to be very clear about one thing,\" he said as light rain began to fall\n\n\"This was an accident. No-one's fault, no-one's blame.\n\n\"Everything that's been said or written about Ben in the media is absolutely, 100 per cent correct. Ben loved his cricket and football. Ben was also a passionate supporter of the Collingwood Football Club.\n\n\"To have an outstanding young man, a ripper young man, taken so young — it makes no sense. It's not fair, it's not right. Sometimes life sucks.\"\n\n\"Rest in peace our champion young man, Ben Austin.\"\n\nJace Austin places a Collingwood scarf on his son's casket. (ABC News)\n\nBen's dad Jace, wearing a blue cricket cap, said his son \"lit up the world\".\n\n\"The best goal you ever scored or four you ever hit wasn't on the field, it was when your soul chose us as your family,\" he said.\n\nHe remembered fondly how Ben loved aeroplanes.\n\n\"He loved watching planes up close, tracking them on the app, telling me their size and destination.\n\n\"We would guess where the next one going to or from. A game I continue to play.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-20/blaithin-mackin-double-life-of-an-irish-aflw-player/106017896",
    "title": "'It is hard': The double life of Mackin as an Irish AFLW player",
    "publish_date": "Thu, 20 Nov 2025 00:09:46 +0000",
    "category": "sports",
    "authors": [],
    "text": "Of all the sacrifices athletes make in pursuit of their dreams, for Melbourne AFLW premiership player Blaithin Mackin, it's her mum's Sunday roast back in Ireland.\n\nThe 26-year-old Irishwoman spends four to five months in Australia playing with the Demons, and the other lion's share of the year back playing Gaelic for her county Armagh in the Ladies Gaelic Football Association (LGFA).\n\nAs one of six siblings — two who have kids — she says the hardest part of her playing career is missing important moments with them back home.\n\n\"I feel like it is hard. You're not fully settled anywhere, which sometimes I find tricky,\" Mackin told ABC Sport.\n\n\"I'm quite lucky that I have a good base at home — I still live with my parents — and then over here, I'm lucky with the girls and the friendships that I have. They're two good bases, but you are very much split.\"\n\nBlaithin Mackin of the Demons spends a third of the year in Australia and the rest in Ireland. (Getty: Dylan Burns/AFL Photos)\n\nMackin has lived with Demons teammates Alyssa Bannan, Megan Fitzsimon and Tyla Hanks previously. She now shares an apartment with her brother Connaire, who has joined her for the season.\n\n\"Which has been great,\" she said. \"Because it helps with homesickness.\"\n\nYet while many of her friends are putting down roots, she straddles living in two different countries to play both games.\n\n\"One of my best mates bought a house the other day and I was like, 'Whoa, I'm so far off', because I'm not at home full-time, I'm not here full-time,\" she said, noting that she wouldn't have it any other way as she doesn't want to give either sport up.\n\nBlaithin Mackin plays for Armagh with her sister Aimee. (Getty: Ramsey Cardy/Sportsfile)\n\nMackin is one of 40 Irish players in the AFLW, who make up almost 8 per cent of the entire competition.\n\nOn her own team is 35-year-old Sinead Goldrick, who Mackin said is surreal to play with, as she looked up to her as a kid in Gaelic.\n\nMany Irish players are attracted to the professionalism of the Australian game, whereas Gaelic is still amateur.\n\nThis means that Gaelic players have to fit training in around full-time work, often after hours, with little time for extras such as recovery, said Mackin.\n\nIrish influx is shaping the game in AFLW The AFLW has had an influx of Irish talent in recent years, with the new talent helping change the game.\n\nGWS' Eilish O'Dowd, for example, is a teacher back in Ireland and works each week day from nine to three or four before heading to training after dinner.\n\nThe appeal in Australia is being able to focus full-time on being a footballer and getting the most out of their bodies as athletes.\n\n\"You don't have this time for long either, where you're a footballer, so I just try to buy into that as much as I can,\" Mackin said.\n\n\"I love that side of it. To see how far you can push yourself as an athlete in terms of fitness.\n\n\"I've probably been a wee bit unlucky with injuries in the past two seasons to really fully get going with that. But I feel in the first two seasons, I was able to push myself again to be a really good version of myself as an athlete.\"\n\nThe competition, some argue, also benefits from a high influx of Irish talent within it.\n\nAlmost eight percent of the AFLW competition is made up of Irish players. (Getty: Michael Willson/AFL Photos)\n\nCats AFLW operations and recruiting manager Ben Waller said they naturally play with \"such attacking flair\", which brings a lot of energy to the game of AFLW.\n\nIn the third quarter of Melbourne's semifinal victory against Adelaide, Mackin got the handball-receive from captain Kate Hore and whacked the Sherrin onto the side of her boot to kick a critical goal to spark the Demons' comeback.\n\n\"Everyone was like, 'That was the biggest Gaelic kick I've ever seen', and I was like, 'Well, I didn't have time to think', so I just kicked, and when I just kick, that's what happens,\" laughed Mackin.\n\nNow, along with a second flag with Melbourne, Mackin's dream is to have her family be able to see her run around.\n\nThey stay up at all hours to watch her play. At least two AFLW games are broadcast in Ireland every week, and all the finals.\n\nLoading Instagram content\n\nEven her Irish club's chairman once joked at a dinner dance — their version of a best and fairest — that he never thought he'd be up at 2am watching Australian rules but there he was, cheering her on.\n\n\"[But] I've got five nephews and one niece. It was one of their birthdays the other day, actually. The oldest, he turned seven the other day, and I'm like, 'Damn, I missed it,'\" Mackin said.\n\n\"I would love it if I could take all my nephews and nieces to watch a game. It could be cool to have them here. But obviously, that's nearly impossible to do.\n\n\"My sister's always, like, if we win the lotto, we're straight on the flight over. And I'm like, 'Please win the lotto.'''",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-20/grand-designs-australia-sherwood-flood-house-design/105862434",
    "title": "This riverside block floods. So why would you build on it?",
    "publish_date": "Thu, 20 Nov 2025 00:00:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Richard Rowles sees the Brisbane River as a living thing that \"breathes in and out two times a day\".\n\n\"It's got its own character and it changes all the time. When it gets angry, you don't want to be anywhere near it. But the rest of the time, it's pretty good,\" he says.\n\nThis perspective was shaped by a childhood spent launching off the jetty behind his family's riverside block in Sherwood, where his Irish ancestors established themselves after arriving in Australia 160 years ago.\n\n\"We grew up here as kids, so we spent a lot of time in canoes, swimming and fishing and shrimping in the river,\" he remembers.\n\nRichard (far left), pictured in the 1970s along the river playing with kids from the neighbourhood. (Supplied)\n\nRichard and his wife Janette passed this lifestyle onto their now-adult sons William and Ollie, whom they raised in the neighbouring suburb of Chelmer.\n\nStream Grand Designs Australia on ABC iview Architecture Professor Anthony Burke is back with a brand new series of Grand Designs Australia following some truly brave home builders taking on the challenge of a lifetime.\n\nAfter Richard's mother died in 2015, leaving the block to him and his brother to divide between them, the couple decided it was time to move back to the place he had first called home.\n\n\"Selling Chelmer was really difficult because it was our family home, we raised the kids there,\" Janette tells Grand Designs Australia.\n\n\"[But] we liked the connection with the fact we come from somewhere and we're returning to where we came from,\" Richard adds.\n\nThat's how the plan for a new build beside a river prone to catastrophic floods took shape.\n\nThere was the 1974 event that altered Brisbane forever; the deadly 2011 floods; and the 2022 deluge — and that's just in recent memory.\n\nThe original house on the Rowles family block (pictured) was inundated during the 2011 floods. (Supplied)\n\nIndeed, after the Brisbane River again rose to dangerous levels in 2022 and flooded Richard and Janette's Sherwood block once more, the builders who had just arrived on site were forced to stop work.\n\nThe couple were already used to what Janette describes as the \"torture\" that is \"watching the slow, insidious creep of water … over a few days\".\n\nDespite the 2022 floods, Richard says the couple decided there was \"no turning back\" after they sold their Chelmer home. (Supplied)\n\nBut no-one expected a 200-odd-metre stretch of the riverbank to subside in that flood, causing the land to drop down by up to a metre in areas on their block.\n\nArchitect James Russell says approvals for the project were suddenly retracted, forcing them to redesign the house.\n\nJames Russell says a number of houses near Richard and Janette's block were condemned after the 2022 landslip (pictured). (Supplied)\n\nBut, without that 2022 flood, the couple's riverfront home wouldn't be quite so resilient.\n\nA house you can hose out\n\nAlmost two-and-a-half years of work and upwards of $2 million later, Richard and Janette have ended up with a light-filled house set 11 metres back from the river and almost half a metre above council requirements.\n\n\"All the habitable floor levels are well and truly above what the Brisbane City Council sees as the 100-year-plus flood levels,\" Russell explains.\n\nThe mysterious front screen battens along the exterior of Janette and Richard's house offer only a hint of what life is like inside. (ABC/Fremantle Media: Tom Blessing)\n\nAnchored by 26 piers placed 13.5 metres into the earth, Russell's redesign kept possible future landslips front of mind. He says the house should \"have 10 to 20mm movement maximum if the entire bank [were to give] way\".\n\nIn case of a record-breaking flood, all valuables are on the upper level and the blockwork undercroft of the house is submersible, with elevated power points and light switches.\n\nIn the event of a huge flood, Russell says Richard and Janette might see water rise up to the landscaped courtyard in the centre of the house. (ABC/Fremantle Media: Tom Blessing)\n\n\"The materials are really robust, almost like rock coming out of the ground,\" Russell says.\n\n\"Some people might find it odd that the power points and switches are up two metres high, but this way the flood can go through and you can let it go down and everything can be hosed out.\"\n\nConnecting those spaces to the upper level is a concrete set of stairs that leads to an internal courtyard.\n\nThe upper level of Richard and Janette's house was also built with water-resistant materials. (ABC/Fremantle Media: Tom Blessing)\n\nUpstairs, 170 water-resistant and removable melamine panels have been screwed to the exposed epoxy-painted steel frame, and heavy-duty ironbark floorboards that could survive days submerged were used throughout the space.\n\nThe result is a house Richard and Janette feel safe living in — even without conventional flood insurance.\n\n\"If you want flood insurance cover in these areas, you'll pay a fortune — certainly $30,000 to $40,000 a year, which is a lot of money if you're going into retirement,\" Richard says.\n\n\"Our opinion is we spent a considerable amount of money on flood 'insurance' with the ground engineering and in-ground structure, with the materials used in construction, and the height we built at.\"\n\nAfter the couple explained what they had done with the build to their insurance broker, Richard says they were able to insure their home excluding flood cover.\n\nThe future of flood plain living\n\nJames Davidson, whose architecture firm helped inform Queensland's flood resilience framework, acknowledges Richard and Janette's house is \"on the big end of town\".\n\nBut with 15 years' experience helping clients improve flood resilience on budgets of $50,000 to $100,000 per home, he says the same principles can be used for any property, \"no matter the cost\".\n\nArchitect James Davidson says flood-resilient design elements like those used in the Sherwood home buy their residents \"some time\". (ABC/Fremantle Media: Tom Blessing)\n\n\"And the cost-benefit is significant. If you put $50,000 into [flood resilience] now, it'll save incredible amounts of money over time.\"\n\nBuilding and retrofitting for flood resilience: Understand projected flood levels\n\nUse resilient materials up high\n\nMove services and switches up\n\nChoose non-cavity construction\n\nDitch plasterboard\n\nUse concrete, tiled and rendered surfaces\n\nRaise houses where possible\n\nTreat pine framing\n\nWhether building a new home or retrofitting, he says the most critical thing to understand is your current and projected flood levels.\n\n\"Council adjusts those levels with every new event,\" he explains.\n\n\" Understand that if you do build to the [current] council flood level, it might go higher next time and you might still be at risk. \"\n\nPeople often think making a property more flood-resilient is costly, but Davidson says the materials are affordable and readily available. (ABC/Fremantle Media: Tom Blessing)\n\nHe also recommends using resilient materials above those defined floodlines, as Janette and Richard did, and getting services like air conditioning and hot water units as high as possible.\n\nThe same goes for switches and powerpoints, so long as this is accessible.\n\nAnd where possible, Davidson suggests avoiding cavity construction.\n\n\"Cavities cause mould growth and humidity problems,\" he explains. \"Concrete slabs, tiled and rendered surfaces are good. And when it comes to cabinetry, there are flood-resilient materials.\"\n\nRichard and Janette's hose-out undercroft (pictured), atop which sits an elegant cantilevered steel structure that houses their living spaces. (ABC/Fremantle Media: Tom Blessing)\n\nWhen retrofitting, Davidson recommends raising houses wherever possible, using tiles, concrete slabs or hardwood for flooring, ditching plasterboard in the walls and treating any pine framing with mould-resistant paint.\n\nRetrofitting a home for natural disasters Rebuilding a home exactly as it was doesn't always make sense for those impacted by natural disasters.\n\nBut he sees none of these measures as \"solutions\" — in Davidson's mind, that would be retreating from the worst-hit areas.\n\n\"These things will buy some time … I'm not totally convinced that we should be building right onto the Brisbane River in the future.\n\n\"And I don't want my work to be seen as the 'get-out-of-jail-free card' where people say, 'Oh, we'll be fine, we've done it resiliently.'\"\n\nThere's no such thing, Davidson argues, as a flood-proof house.\n\n\"But there are resilient homes and homeowners who are happy to stay in [higher-risk] locations.\"\n\nWatch the new season of Grand Designs Australia free on ABC TV and ABC iview.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-20/somerville-house-investigates-teachers-notes-about-students/106031336",
    "title": "Brisbane girls school under fire after teachers' dossier on students leaked",
    "publish_date": "Wed, 19 Nov 2025 23:59:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Students and parents at one of Brisbane's most prestigious girls schools have been left appalled and upset after a document where teachers recorded notes about students' personalities, medical diagnoses, physical appearances and parents' marital status was leaked.\n\nTeachers at Somerville House wrote the document about students when they were in year seven, in 2021, which included descriptions of students such as the condition of their hair, their popularity with classmates, and their demeanour, referring to some students as \"odd\" or \"rude\".\n\nIt also included descriptions of how students responded to certain subjects and assessments and their behaviour in class, as well as details of their medical diagnoses and treatment — including the type of medical care and medication.\n\nThe notes also included descriptions of the marital status of parents and called some \"intense\" when describing their involvement in their daughter's learning.\n\nIt is understood students were able to access the document after stumbling across it when they were looking for files uploaded by a teacher in Microsoft Teams.\n\nThe incident has occurred while the students are studying for year 11 exams next week.\n\nPrincipal Sandra Hastie wrote to parents late last night to alert them to the issue, which she described as a \"data breach within our school IT system\", but did not apologise.\n\n\"Some students have been able to access and read private historical notes as a result of the data breach,\" the emailed letter said.\n\n\" Those notes contain comments that fall short of our standards and our values. \"\n\nDr Hastie told parents the school was investigating the notes and why the data breach occurred.\n\n\"The school will update you with any relevant information and will comply with its legal obligations to investigate and deal with the data breach,\" the emailed letter said.\n\nConcerned parents then wrote to the principal raising multiple issues and complaints, including about the nature of the comments written about each student, and the school's handling of the issue.\n\nSomerville House has been contacted for comment but has yet to respond to the ABC's questions.\n\nThe school, established in 1899, is the only Presbyterian and Methodist Schools Association pre-prep to year 12 facility for day and boarding students in Brisbane.\n\nPrep fees begin at $23,300, and for senior school years, parents pay $30,144 per year.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-20/australia-withdraws-bid-to-host-cop31-in-adelaide/106031148",
    "title": "Australia hands COP31 to Türkiye but Bowen to lead negotiations",
    "publish_date": "Wed, 19 Nov 2025 23:53:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "Adelaide will not hold next year's UN climate summit, with Climate Minister Chris Bowen revealing Australia was willing to cede hosting rights to Türkiye in exchange for it handing him the reins of the negotiations and cementing a major role for the Pacific at the summit.\n\nThere had been a growing expectation that Australia would drop its bid to host COP31 in Adelaide as it struggled to convince Türkiye withdraw from the contest.\n\nUnder UN rules, if the two countries were unable to strike a deal, then the meeting location would automatically revert to Germany, which hosts the United Nations body responsible for the Paris Agreement.\n\nLive: Albanese says COP31 compromise with Türkiye is an 'outstanding result' Australia has ceded the COP31 climate summit to Türkiye but Climate Change Minister Chris Bowen will be the president of the summit pending Ankara's approval. Follow live.\n\nMr Bowen told reporters in Belem that while negotiations were ongoing, both countries were willing to make \"significant concessions\" to strike a deal.\n\n\"Significant concession is what's required when you are trying to find consensus,\" he said.\n\n\"Obviously, it would be great if Australia could have it all. But we can't have it all. This process works on consensus.\"\n\nWhile details of the sharing arrangements are still being finalised, Mr Bowen said Türkiye would still hold the formal title of COP president and would \"handle the venues and the operation\" of the COP, but that he would be the \"president of the COP for the purposes of negotiations\".\n\n\"I would have all the powers of the COP presidency to manage, handle the negotiations, to appoint co-facilitators, to prepare draft text, to issue the cover decision,\" he said.\n\nPrime Minister Anthony Albanese, who earlier this week acknowledged that the UN's rules did not allow for a co-presidency, said this option presented a workaround and was an \"outstanding result\".\n\n\"It wasn't possible under the rules to have a joint presidency, but Türkiye has agreed that Minister Bowen and Australia will handle the negotiations in the lead-up to the COP,\" he said.\n\nPacific leaders consulted\n\nThe decision has bitterly disappointed climate advocates who championed Adelaide's bid, saying it would supercharge Australia's renewable energy industry and leverage the Pacific's moral authority to drive more ambition on global climate action.\n\nSouth Australian Premier Peter Malinauskas said he was \"disappointed\" but understood the prime minister's decision.\n\n\"He has taken a position to try and navigate the frankly obscene process that exists internationally,\" he said.\n\n\"We put our best foot forward and won the rights as a city and a state to host COP if it was won internationally, and internationally that was not able to be achieved.\"\n\nGavan McFadzean from the Australian Conservation Foundation said it was \"a massive missed opportunity for Australia and the Pacific\".\n\n\"Communities in the Pacific have been denied an important global platform to show how global inaction on climate change presents them with an existential threat,\" he said.\n\nShiva Gounden, head of the Pacific campaign at Greenpeace Australia Pacific, said it was \"disappointing\" but added \"the Pacific's fight for survival does not rise or fall on a single hosting decision\".\n\n\"For us, climate action has never been about prestige. It is about protecting and preserving our homelands, our cultures, and our future with dignity and humility.\"\n\nBut some climate experts were more optimistic about the compromise.\n\nErwin Jackson from Monash University's Climateworks Centre said the outcome would ensure \"Australia and the Pacific will remain central to global climate transition.\"\n\n\"The region has everything to gain by building global momentum towards clean energy,\" he said.\n\n\"Australia's leadership role as the president holding the pen on text negotiation outcomes and leaders meeting in the Pacific will be highly influential in the outcomes of COP31.\n\n\"Strong regional leadership will be critical to accelerating the shift to a low-emissions future across Australia, the Pacific and the world.\"\n\nMr Bowen said both countries had to reach an agreement in order to avoid \"12 months with a lack of leadership, no COP president in place, no plan\".\n\n\"I know some people [will] be disappointed in that outcome,\" he said.\n\n\"Other people, of course, would be even more disappointed if it had gone to Bonn [in Germany] without a COP president in place. This is a better outcome than that.\"\n\nMr Bowen also confirmed that Australia was looking to ensure a \"pre-COP\" leaders meeting would be held in the Pacific under the deal, as well as a major fundraising round for the Pacific Resilience Facility.\n\nAustralia has been canvassing these options with Pacific leaders over the past 48 hours as diplomats have scrambled to land a deal.\n\nMr Albanese said he had spoken directly to Papua New Guinea's Prime Minister James Marape and Fiji's Prime Minister Sitiveni Rabuka and that the pre-COP Pacific event would ensure \"the issues confronting this region, the very existence of island states such as Tuvalu and Kiribati … will be front and centre\".\n\nPNG Foreign Minister Justin Tkatchenko told news agency AFP Pacific leaders were \"all not happy, and disappointed it's ended up like this\".",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-20/victorian-government-announces-real-estate-underquoting-laws/106031070",
    "title": "Reserve property prices to be published in underquoting crackdown",
    "publish_date": "Wed, 19 Nov 2025 23:41:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Real estate agents in Victoria will be required to publish a property's reserve price at least seven days before it goes to auction under a state government crackdown on illegal underquoting.\n\nThe Victorian government on Thursday morning unveiled Australian-first laws requiring real estate agents to publish reserve prices — the minimum amount a seller will accept for a property — ahead of an auction or fixed-date sale.\n\nThe laws will mean real estate agents who fail to disclose the reserve price within the timeframe cannot proceed to auction or sale. They are set to be introduced next year.\n\nThe Victorian government introduced a taskforce to tackle underquoting in 2022. (ABC News: Ian Cutmore)\n\nUnderquoting occurs when a property is deliberately advertised for less than its estimated selling price or the owner's asking price.\n\nDespite underquoting being illegal, the Victorian government has acknowledged it remains a significant issue in the real estate industry.\n\nA taskforce it established late in 2022 to crack down on the practice has received more than 5,000 complaints.\n\nHopeful homebuyers have told the ABC about their \"demoralising\" and \"exhausting\" experiences attending auctions for properties advertised within an acceptable price range that they ultimately couldn't afford.\n\nVictorian Minister for Consumer Affairs Nick Staikos said the changes unveiled on Thursday were \"a big step forward\".\n\n\"Underquoting isn't fair, and it's young Victorians and families who are the ones paying for it,\" he said.\n\n\"This will mean that no longer will young prospective first home buyers have to waste their time on a property sales campaign when they never could afford the property in the first place.\"\n\nMinnister Nick Staikos said the changes would stop young homebuyers attending auctions for properties they couldn't afford. (ABC News)\n\nIn recent years, the Victorian government has increased penalties for agents caught underquoting, made its taskforce permanent and strengthened advertising guidelines.\n\nMr Staikos said the new laws would provide Victorians with further transparency in property transactions.\n\n\"[It] ensures there is fairness and equity for everyone when making a big financial decision of purchasing a home,\" he said.\n\nChanges won't address affordability, opposition says\n\nVictorian Opposition Leader Jess Wilson, on her second day in the role, said the government's proposed regulations would have little impact on affordability.\n\n\"In principle, I don't have any issues with more market transparency, but by telling an aspirational home owner what the reserve price is seven days in advance, it does nothing to make the home more affordable,\" she said.\n\n\"It just demonstrates how expensive and probably out of reach it is.\"\n\nJess WIlson questioned the effectiveness of the changes. (AAP: Joel Carrett)\n\nThe Victorian Greens, who introduced a bill proposing similar changes in August, said while the party welcomed Labor's move, the system was still \"stacked against first home buyers\".\n\nThe party's housing spokesperson, Gabrielle de Vietri, said Labor's proposal should go further and make agents disclose reserve prices as soon as a property is on the market.\n\n\"Being told the reserve early is helpful, but it doesn't change the reality that most young people can't afford the reserve in the first place,\" she said\n\n\"Right now, Labor's making the housing crisis worse by demolishing public housing and pushing prices up with no plan to address affordability.\"\n\nReal Estate Institute of Victoria chief executive Toby Balazs said the new laws would punish vendors.\n\n\"We do think it's an over-correction and ill-considered,\" he told ABC Radio Melbourne.\n\n\"There are ways in which we can bring greater price transparency to the market, but we need to balance that with the rights of vendors to maximise their profits.\"",
    "source": "ABC",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-20/hospital-at-home-mental-health-trial-in-kemspey/106026032",
    "title": "Trial to offer mental health care 'from the comfort of home'",
    "publish_date": "Wed, 19 Nov 2025 22:26:59 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "A New South Wales-first trial of an in-home mental health treatment service will result in its host town losing access to its hospital-based mental health unit.\n\nThe Hospital in the Home model, which involves doctors travelling to patients' homes to deliver treatment, will be trialled for mental health patients in the mid north coast town of Kempsey from early next year.\n\n\"This is a positive innovation for NSW Health where we have the opportunity to be a leader across the state with developing this pilot,\" said Mid North Coast Local Health District (MNCLHD) director of mental health services, Sarah Fox.\n\n\" This [trial] will allow us to reduce stigma and provide safe care in the comfort of people's homes. \"\n\nShe said patients would be \"reallocated\" from Kempsey District Hospital’s mental health unit, which could accommodate 10 patients as a voluntary inpatient facility, to at-home care or treatment at neighbouring hospitals when the trial started.\n\nThe mental health unit at Kempsey District Hospital will no longer take patients when the pilot starts in 2026. (ABC Coffs Coast: Charles Rushforth)\n\nServices restructured\n\nThe Hospital in the Home pilot will include expanded funding for community services, including mental health programs aimed at First Nations mental health patients in the town, where 12 per cent of the population is Indigenous.\n\nIn a statement, the MNCLHD said involuntary mental health patients will be transferred to Port Macquarie Base Hospital's Mental Health Unit, 55km away.\n\nThat unit will be provided with increased resources and beds.\n\nThe LHD said there had been consultation about mental health services and community needs during the past 12 months.\n\nKempsey District Hospital's mental health unit is the only service in the town of 31,000 people that accepts voluntary inpatients who can stay for multiple days for treatment.\n\nKempsey Shire Councillor Alexandra Wyatt is concerned about the closure of the unit, which she said had provided life-saving mental health treatment to her relatives.\n\n\"It offered them respite, to have a good night's sleep and a good meal, and to not have to deal with whatever is going on at home or out in the community,\" she said.\n\n\"Moving to an at-home hospital care situation, I think that's actually high risk.\n\n\" I feel that for our situation, [at home mental health care] could have resulted in a death. \"\n\nNSW Minister for Mental Health Rose Jackson said the mental health unit can reopen if the trial is unsuccessful.\n\n\"We want to make sure that if there's a decision in the future around re-opening that facility in Kempsey, we've got space for that,\" she said.\n\nRose Jackson says the government will roll out the trial across New South Wales if it proves successful. (ABC Broken Hill: Bill Ormonde)\n\n\"I hope community-based care is supported … but at the moment we're keeping an open mind.\n\n\"If it does work well, if this is something that the local community feels is really positive, watch this space and we might look to roll it out state-wide.\"\n\nInpatient services needed\n\nVictoria and Tasmania offer mental health treatment under the Hospital in the Home model, which has been lauded for offering life-changing care.\n\nPsychiatrist Patrick McGorry runs a clinic that offers mental health treatment to patients at home in Melbourne.\n\n\"It's been very successful,\" he said.\n\n\"But we still have our inpatient beds; in fact, we don't have enough of them.\"\n\nPatrick McGorry says programs offering mental health treatment at home have been successful in Victoria. (Supplied: Dr Patrick McGorry)\n\nDr McGorry said while it was reasonable that patients in Kempsey could adequately access inpatient services from Port Macquarie Base Hospital, the devil was in the details.\n\n\"The sequence has got to be right,\" he said.\n\n\"You need to fund the Hospital in the Home service first, then once that's working, it would be safe to close the beds, not before.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-20/retirement-housing-boom-bundaberg-coastline/106019174",
    "title": "Major retirement developments get go-ahead on Queensland coast",
    "publish_date": "Wed, 19 Nov 2025 22:02:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "Thousands of retirement and relocatable homes are either under construction or have been approved along a regional Queensland coastline known for its pristine beaches and \"affordable\" lifestyle.\n\nA combined 3,676 individual dwellings have been approved in Bundaberg, 4.5 hours' drive north of Brisbane, by the council in the last 12 months.\n\nAmong the 18 projects is a $320-million resort-style land lease community at Coral Cove, which includes 504 homes, a clubhouse and wellness facilities minutes from the beach.\n\nConstruction has also begun on the first stage of a 437-home gated community at Burnett Heads.\n\nAdrian Puljich, Helen Blackburn and Andrew Coulter turning the sod on the development at Burnett Heads. (Supplied: GemLife)\n\nGemLife managing director and chief executive Adrian Puljich said the $323-million project would be attractive to retirees migrating from south-east Queensland in search of an \"affordable\" lifestyle.\n\n\"We envisaged this project taking approximately six to eight years to deliver from start to finish,\" he said.\n\nMr Puljich said homes would start from approximately $700,000 and that there were six designs to choose from.\n\nGemLife said it would also invest $3.7 million in road upgrades, wastewater and sewerage infrastructure for the community.\n\nAn impression of GemLife Lighthouse Bay at Burnett Heads. (Supplied: GemLife)\n\nREA Group senior economist Angus Moore said the demographic of people living in the Wide Bay, which included Bundaberg and Hervey Bay, was older than the rest of the state.\n\n\"More than 40 per cent of [the] Wide Bay region is already aged over 55, compared to just under 30 per cent of Queensland as a whole,\" he said.\n\nIt also has the one of the highest percentages of over-65s in the country.\n\nUnlocking housing stock\n\nMr Moore said retirement projects provided those people with an opportunity to downsize and unlock housing stock for younger families.\n\n\"Downsizing and allowing our existing houses to be used by those that better suit them would help improve housing affordability,\" he said.\n\nMore than 500 retirement homes will be built at Coral Cove. (ABC Wide Bay: Johanna Marie)\n\nBut the area may not be as affordable as it once was, considering house prices in the Wide Bay have more than doubled in the last five years.\n\nThe median house price is currently $666,000, compared to the Sunshine Coast's median of $1,259,000 and the Gold Coast's $1,345,000.\n\nMr Moore believes the market will slow as more homes are built.\n\n\"Building more homes is fundamentally the only way that we will start to improve housing affordability sustainably over the long-term,\" he said.\n\n\"In particular, building more homes where people want to live, which is increasingly places like the Wide Bay region.\"\n\nStrain on health care and aged care\n\nBundaberg resident Sheryl Miedecke agreed more retirement homes were needed but was concerned about the added pressure on the health care and aged care sectors.\n\nSheryl Miedecke says there is a shortage of health professionals in Bundaberg. (ABC Wide Bay: Johanna Marie)\n\n\"I think it's a good thing to expand and have new people coming here, but whether they've got all the facilities to provide for retirees is the other thing,\" she said.\n\n\"That's a bit of a worry.\"\n\nBundaberg Regional Council has not received any development applications for new nursing homes, nor have any been included within the recently approved retirement projects.\n\n\"We certainly do need more nursing home developments … it is one of the things that I do talk to investors and developers about,\" Mayor Helen Blackburn said.\n\n\"Everything from student accommodation all the way through to nursing homes and increasing the size of our cemeteries — we need to be looking after everyone, right from the beginning all the way through to the end.\"\n\nBundaberg Mayor Helen Blackburn launched a petition calling for the sacking of the chief executive and board of the Friendly Society Private Hospital. (ABC Wide Bay: Johanna Marie)\n\nThe council has obtained funding under the state government's Residential Activation Fund for six critical infrastructure projects to support the growth.\n\nThat includes $7.7 million to go towards the $9.6 million Millbank Wastewater Treatment Plant.\n\nMr Puljich said the confidence in the Bundaberg region, including the prospect of a new public hospital, would drive further investment.\n\n\"We're very excited to see Bundaberg grow over the next decade and beyond,\" he said.\n\n\"With so much opportunity and so much investment, not just in seniors housing but across agriculture, general housing and, indeed, medical facilities.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-20/matildas-captain-sam-kerr-left-out-by-chelsea/106030886",
    "title": "Kerr set to be fit for Matildas despite Chelsea omission",
    "publish_date": "Wed, 19 Nov 2025 21:54:26 +0000",
    "category": "sports",
    "authors": [],
    "text": "Sam Kerr will miss Chelsea's Women's Champions League match against Barcelona, just days after the club said she was likely to play.\n\nChelsea manager Sonia Bompastor said the 32-year-old Matildas captain would not be in the squad because it was part of her planned rehabilitation after her long-term anterior cruciate ligament injury.\n\nKerr will be sitting in the stands on Friday morning AEDT for a second consecutive match.\n\nShe was omitted from Chelsea's Women's Super League squad for last Sunday's match against Liverpool.\n\nOn that occasion, Bompastor said of Kerr: \"She's fine and she will probably be involved in the game against Barcelona.\"\n\nKerr had played her first full 90 minutes for Chelsea in last week's Women's Champions League clash against St Polten in Austria.\n\nShe scored twice but Chelsea's medical staff seemingly felt it was still too much for her to feature against European powerhouse Barcelona.\n\nMary Fowler reveals she experienced racism in France Socceroos star Mary Fowler has shared her experiences of depression and self-harm, as well as racism from her teammates, that she endured during her time with Montpellier.\n\nKerr, though, should be cleared to travel to Australia to link up with the Matildas.\n\nThey play two internationals against New Zealand in Gosford (November 28) and Adelaide (December 2).\n\n\"Sam is fine, she will probably be going with the national team next week, but she's not available for us again,\" Bompastor said.\n\n\"It's just a case of managing her comeback. She got 90 minutes against St Polten and it was part of the plan for her to rest a little bit after that and not be involved in the following two games.\"\n\nEarlier this week, Matildas coach Joe Montemurro told reporters Kerr was \"doing really well\".\n\n\"She got 90 minutes during the week in the Champions League last week, obviously scoring goals, and that's where we want Sam to be,\" he said.\n\n\"But she still needs to be managed, and we've been in close contact with Chelsea in terms of managing the minutes.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-20/australia-stunted-in-growing-alternative-proteins-market/105897824",
    "title": "Producing alternative proteins for vegans is not as easy as you think",
    "publish_date": "Wed, 19 Nov 2025 21:32:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Demand for a new generation of food products called \"alternative proteins\" is forecast to triple as the global population rises, but startup companies in Australia say they cannot get the finance they need to establish the industry here.\n\nIngrid Appleqvist from the CSIRO's Food Innovation Centre said the lack of venture capital is a problem for many start-ups, along with a shortage of qualified staff and infrastructure needed to scale up.\n\nThe sector is fractured, she said, because 99 per cent of the businesses are small.\n\n\"[Food manufacturing is] the biggest manufacturing industry in Australia … but it's made up of tens of thousands of small to medium enterprises,\" Ms Appleqvist said.\n\nCSIRO's Ingrid Appleqvist says Australia lacks qualified staff and infrastructure needed to scale up. (Supplied: CSIRO)\n\nStart-ups need \"off take\" agreements to attract capital, but they often struggle to find buyers for their produce when their manufacturing facilities are still in the pilot phase.\n\nSydney company All G is among those heading overseas to access the high tech plant needed to make alternative proteins.\n\nChief scientist Jared Raynes said they want to expand their operation in Australia but there are limitations.\n\n\"It's really challenging to scale up because the infrastructure just doesn't exist in Australia,\" he said.\n\nAll G produce lactoferrin, a key ingredient in baby formula.\n\nIt usually comes from cows milk, but All G claims it can be produced much more efficiently by inserting the gene that produces lactoferrin into a special yeast.\n\n\"We do this in a bioreactor, a fancy type of fermenter, in a process not too dissimilar to brewing beer,\" Mr Raynes said.\n\nThey use sugar as a feedstock and potatoes as a source of proteins, and no animal products are used in this process.\n\n\"It usually takes 10,000 litres of milk to produce one kilogram of lactoferrin, [but] we can produce one kilogram with less than a thousand litres using fermentation,\" Mr Raynes said.\n\nJared Raynes of All G says Australia's pilot plants do not meet his company's needs. (Supplied: All G)\n\nPrecision fermenters take microorganisms like yeast, bacteria and fungi, together with a feed stock, and turns them into egg proteins, enzymes, flavours, colours, fats and oils.\n\nA precision fermentation plant has been built in Tasmania and two pilot plants are due to open next year, one in Werribee in Victoria and a second at Mackay in Queensland.\n\nBut Jared Raynes said they do not meet his company's needs.\n\nAs a result, All G has signed a partnership with a German food company to access a plant there.\n\nIndustry lobby group Cellular Agriculture Australia claims producing food this way requires less water and land, results in less emissions and does not cause deforestation and biodiversity loss.\n\nBut scientists warn that full life cycle assessment studies on the entire supply chain for alternative protein products are \"very limited [and] the impacts of microbe-derived proteins and cultured meat have not been fully assessed\".\n\nWhat are alternative proteins?\n\nSausages are an example of alternative protein products, this one made mainly from soy. (Supplied: Food Frontiers)\n\nAlternative proteins are being promoted as a possible solution to feed a growing world population.\n\nProducts include meat and seafood substitutes and specialised food ingredients made from soy, peas, hemp seeds and ancient grains like quinoa.\n\nThere are emerging products as well using insect-based ingredients and meat cultivated from animal cells or produced via fermentation.\n\nIn its report on the plant protein industry an independent think tank on alternative proteins in Australia and New Zealand, Food Frontier, reported the value of global plant protein ingredients was more than $24 billion in 2024 and was expected to triple by 2032.\n\nThe Grains & Legumes Nutrition Council surveys 2,900 Australian supermarket products, and their audits from 2022 to 2024 show 12 per cent had some plant protein ingredients, particularly in plant-based food and beverage products.\n\nAustralian market too small\n\nAustralia currently has six plant protein ingredient manufacturers, but most of them are limited in scale and capacity.\n\nManildra has a plant in Nowra in New South Wales which processes a million tonnes of wheat annually and turns it into concentrates, isolates, flours and starches that go into plant products.\n\nIntegra is a plant protein manufacturer based in SA, one of six alternative protein plants across the country. (Supplied: Food Frontiers)\n\nFive new plants have been established in the last six years in Victoria (Essantis), Western Australia (Wide Open Agriculture), Victoria (Australian Plant Proteins), Tasmania (Hemp Harvests) and South Australia (Integra Foods).\n\nUnlike traditional flour mills or pressing plants, these plants use a process called fractionation to concentrate and extract the primary protein ingredients from the flours of cereals, pulses and oilseeds.\n\nPlant-based patties look like meat but are made from completely vegan ingredients. (ABC News: Cam Lang)\n\nThe Grains & Legumes Nutrition Council found the need for plant protein ingredients is expected to grow because food service companies are looking for high fibre, protein-rich foods for the health care sector in particular.\n\nDespite that, Professor Brent Kaiser from Sydney University said the market was just not big enough to attract venture capital in Australia because alternative proteins were not a high priority for the average shopper.\n\n\"Until consumers have a better understanding of food security, and they choose to buy an alternative protein because it's sustainably produced, the market will remain small,\" he said.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-20/f1-las-vegas-oscar-piastri-mclaren-lando-norris/106030732",
    "title": "McLaren boss tips 'forlorn' Piastri to fight back in Las Vegas Grand Prix",
    "publish_date": "Wed, 19 Nov 2025 21:04:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "McLaren expects Oscar Piastri to regain form in the final three races of the F1 championship, despite the Australian trailing teammate Lando Norris on the drivers' standings.\n\nNorris, who won the two most recent races in Brazil and Mexico, leads the championship on 390 points ahead of this weekend's Las Vegas Grand Prix.\n\nPiastri is 24 points behind his McLaren stablemate, having led the standings earlier this season.\n\nThe Melburnian has failed to reach the podium in his past five races, prompting ex-world champion Damon Hill to suggest the 24-year-old is struggling.\n\n\"Oscar suddenly looks a bit forlorn, a bit under pressure,\" Hill recently said.\n\nBut McLaren chief executive Zak Brown defended Piastri in the build-up to the Las Vegas Grand Prix.\n\n\"Oscar's definitely fighting back,\" Brown said.\n\n\"I think one of his greatest strengths is he just gets in the zone.\"\n\nMcLaren orders part of 'perfect storm' that began Piastri's F1 form slump Oscar Piastri says the Azerbaijan Grand Prix weekend was the worst of his racing career and has hinted McLaren team orders may have played a part in it.\n\nBut Brown also expressed confidence in Great Britain's Norris, who is chasing his first championship.\n\n\"I've never seen Lando in a better place,\" Brown said.\n\nThe championship could be a two-driver duel between the McLaren pair by the conclusion of the Las Vegas Grand Prix.\n\nDefending champion Max Verstappen cannot afford to lose ground on the drivers' standings, as he trails Norris by 49 points in third place.\n\nMcLaren has already clinched the constructors' championship, leaving Brown excited about the prospect of claiming both titles in the same season for the first time this century.\n\n\"I'd love to be in a position where we leave this race and I know a papaya [McLaren] car is going to be the drivers' champion,\" Brown said.\n\n\"Last weekend in Brazil was great, because Lando extended his lead, but the glass-half-empty side is … it got closer between Max and Oscar.\n\n\"What we really want to do is not just win the drivers' championship. We want to finish first and second.\"\n\nAAP/Reuters",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-home-prices-set-to-hit-fresh-highs-in-2026-liberals-want-australian-values-screening-for-new-migrants-super-funds-accused-of-profiting-from-russian-blood-oil-20251120-p5ngwb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Trump signs bill to release all Epstein files; Liberals want ‘Australian values’ screening for new migrants",
    "publish_date": "Thu, 20 Nov 2025 12:54:15 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Fund manager Magellan says its head of global equities, Arvid Streimann, has resigned amid an internal investigation in an alleged relationship with a junior employee.\n\nMagellan Financial Group told the ASX on Thursday that Streimann had resigned after an Australian Financial Review report about an investigation into an alleged relationship published last night.\n\nMagellan’s head of global equities, Arvid Streimann, has resigned.\n\n“This had been separately brought to our attention and is under internal investigation,” Magellan said in an ASX statement.\n\n“MFG confirms that Arvid Streimann has resigned, effective 19 November 2025.”\n\n“MFG remains committed to ensuring appropriate workplace standards in line with its values.”\n\nThe AFR report said Magellan was investigating Streimann over an alleged relationship with a junior female employee.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/business/companies/aureka-strikes-record-grades-in-victoria-as-comstock-gold-lights-up-20251120-p5nh37.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aureka strikes record grades in Victoria as Comstock gold lights up",
    "publish_date": "Thu, 20 Nov 2025 12:54:02 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Aureka’s Comstock gold project in Victoria continues to turn heads with the company unwrapping a suite of assays that not only validate earlier sightings of visible gold but also deliver the highest grades ever recorded at the operation.\n\nThe latest numbers, pulled from diamond drill core glinting with coarse free gold, showcase a mineralised system rich in sulphides and structural pathways, and one that is rapidly expanding beyond the limits of the current JORC Resource.\n\nSt Arnaud Comstock visible gold with galena and sphalerite in drill hole 25NED002.\n\nThe standout headline maker comes from drill hole 25NED002, where Aureka cut 1 metre at a scorching 65.37 grams per tonne gold from 116.2m. The interval includes a 0.3m slice carrying an eye-watering 109g/t gold – the highest individual assay the company has seen at Comstock to date. The same zone also returned almost half a metre grading 65.4g/t gold, underlining a robust high-grade component rather than a one-off spike.\n\nThese new assays form part of Aureka’s targeted drilling along the Comstock shear zone – the backbone structure controlling gold emplacement in the district. Mineralisation is tightly associated with quartz reefs carrying arsenopyrite, pyrite, galena and sphalerite, a classic sulphide-rich signature for the St Arnaud Goldfields. The company notes that all of the latest intercepts sit outside of the current resource footprint, pushing the known mineralised system outwards by as much as 100 metres and strengthening the case for a significant resource upgrade.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/adam-liaw-s-kingfish-ceviche-bowls-20251120-p5nh2t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Adam Liaw’s kingfish ceviche bowls",
    "publish_date": "Thu, 20 Nov 2025 12:47:05 +1100",
    "category": "finance",
    "authors": [
      "Adam Liaw"
    ],
    "text": "Step 1 Heat your oven to 180C fan-forced (200C conventional) and place the sweet potatoes directly on the racks of the oven. Roast for 50 minutes until tender, then allow to rest. Once cool, split open and scoop out the insides.\n\nStep 2 Combine the kingfish with the coriander, red onion, olive oil, lime juice and season well with salt.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/weatherald-and-doggett-to-debut-in-ashes-opener-20251120-p5nh2q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Weatherald and Doggett to debut for Australia in Ashes opener",
    "publish_date": "Thu, 20 Nov 2025 12:34:16 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "Perth: Jake Weatherald and Brendan Doggett will debut for Australia in the first Ashes Test in Perth.\n\nAustralia’s players were informed of the team ahead of their final training session on Thursday, according to two sources with knowledge of discussions.\n\nTasmania’s Jake Weatherald will debut for Australia. Credit: Getty Images\n\nWeatherald’s selection will mean Marnus Labuschagne bats at No.3 on his return to the Test team, while Cameron Green is expected to edge out Beau Webster as the all-rounder.\n\nSteve Smith will confirm the XI later on Thursday.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/stress-fractures-have-derailed-our-quicks-an-expert-reveals-how-to-diminish-them-20251119-p5ngq7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Stress fractures have derailed our quicks. An expert reveals how to diminish them",
    "publish_date": "Thu, 20 Nov 2025 12:15:45 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "As a spotlight is shone on Australia’s fast bowling, a leading physiotherapist has revealed how the next generation can be protected from a common plight.\n\nDr Kevin Sims, who spent 20 years working with Cricket Australia and Queensland Cricket, describes back stress fractures as a problem that cannot be avoided completely, due to the balancing act required to prepare for elite-level bowling while managing recovery times.\n\nCameron Green and speed demon Lance Morris have had surgery in the past year after repeated issues, with Green only returning to bowling on the eve of the Ashes series beginning on November 21.\n\nLance Morris, Cameron Green and Callum Vidler are three pacemen to suffer back stress fractures in the past 12 months. Credit: Getty\n\nQueensland teenage tearaway Callum Vidler is rehabilitating, but has not had surgery, having been earmarked for higher honours since his heroics at the 2024 under-19s One-Day World Cup.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/how-did-that-happen-the-data-behind-the-wallabies-dramatic-slide-20251120-p5ngxy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How did that happen? The data behind the Wallabies’ dramatic slide",
    "publish_date": "Thu, 20 Nov 2025 12:15:02 +1100",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "The Wallabies haven’t scored more than 19 points in a Test since racking up 24 against New Zealand in Auckland in the opening Bledisloe Cup clash. The points conceded has also blown out by an average of four a game, leaving an average losing margin of 10 points a game. With a struggling attack, tries have dried up, falling from 3.6 a Test to 1.7, and they’re also conceding an average of one more per Test. Most tellingly, the Wallabies’ ability to score points in the second half has drastically fallen away. Though far from ideal, Australia had developed a habit of giving up a big deficit in the first halves of many of their Tests earlier in the year, but then fought back late to either win or lose narrowly.\n\nBut that second-half capacity has almost evaporated. From an average of more than 15 second-half points in the opening eight Tests, the Wallabies have averaged less than five points in the Bledisloe Cup and on the spring tour. They didn’t score a single point in the second half against England. By contrast, their rivals have run up 98 second-half points at an averaged 16 a Test. Injuries and the unavailability of players have been factors, of course, with the Wallabies’ depth – and bench strength – eroded with key men being lost throughout the year. Star fullback Tom Wright was a big loss, and so too Tate McDermott. Jake Gordon’s injury was covered by Nic White until the veteran No.9 finally retired for good. Rob Valetini struggled with injury throughout the year.\n\nThe Wallabies cycled through multiple five-eighths, too, with Noah Lolesio lost early and Tom Lynagh also in and out of the squad. James O’Connor, Tane Edmed and Carter Gordon were also used. But the tendency of coach Joe Schmidt to routinely make changes also raised eyebrows. The Wallabies used the same 23-man squad in consecutive Tests just once all year – for the second and third Lions games. Like second-half points, Australia’s discipline was also an issue: they started well in that area before falling away. Having been a major problem in previous years, where penalty counts were stubbornly stuck above 10 a game in most Tests, the Australians appeared to have turned a corner in the three-match Lions series, where they conceded less than 10 penalties in two games. Then in South Africa, the Wallabies gave up only four and six penalties.\n\nIn the opening eight Tests, the Wallabies averaged 8.5 penalties a game. But in the six Tests since, that has grown to 11.5 a game, and double-figure counts in four of six games. Most crucially, perhaps, the Wallabies have had players sent from the field in the past six Tests. After not attracting a yellow card in their first seven matches (again a far cry from recent years where one per Test was standard), six yellow cards came in the next seven Tests. The Wallabies have also started making more mistakes – either making it more difficult to win, or putting nails in coffins. When it comes to unforced errors – which is a mistake not brought on by the opposition – the Wallabies were making an average of 4.7 in the opening eight Tests. That has risen to 6.6 a Test since the Wallabies headed to Eden Park hopeful of breaking their Bledisloe Cup drought.\n\nOne of the clear areas Australia have struggled in for much of the year, but particularly on the spring tour, is in the air. Though an increasingly common part of top-flight rugby, the attack-minded Wallabies have never been a world-leading team when it comes to contestable kicks; be it defusing them or successfully deploying them. But they hadn’t been known as one of the world’s worst, either. Until this year, that is. The Wallabies have struggled so much to “retain” contestable kicks – the stat covering the ability to either catch a high ball, clean up a spilled catch or force an error from a rival – they’re ranked second-last of the 10 Six Nations-Rugby Championships teams in 2025. Surprisingly, the All Blacks have the worst retention rate.\n\nBut the problem is now so acute for the Wallabies that teams are building game plans around contestable kicking. England kicked with good effect in downing the Wallabies at Twickenham, scoring two of four tries from high balls, while Ireland’s win was based on attacking Australia from the air. Loading The Wallabies’ aerial struggle is like a batsman who is known to dislike short-pitched bowling, and thus gets bounced almost every over. So perception plays a big part, and it’ll only change if the Wallabies turn off the retention tap for rivals. The difference can be seen in comparing the Wallabies’ first Test against the Lions and their loss to Ireland. In both games, their rivals sent up 15 contestable kicks. The Lions only managed to retain six of them, and thus dialled back the contestable kick tally to just three in the second Test. But the Irish remarkably retained all 15.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/nsw/why-everyone-is-getting-sick-in-november-20251120-p5ngyg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why everyone is getting sick in November",
    "publish_date": "Thu, 20 Nov 2025 12:06:03 +1100",
    "category": "lifestyle",
    "authors": [
      "Angus Thomson"
    ],
    "text": "Unseasonably high flu cases are leading to an uptick in visits to NSW emergency departments while COVID infections continue to increase heading into the festive period.\n\nInfluenza cases jumped 33 per cent in the first week of November and continued to circulate at higher-than-usual levels last week, the latest NSW Health respiratory surveillance data shows. Around 400 people visited NSW emergency departments with influenza-like illnesses last week.\n\nNSW is experiencing higher-than-usual flu cases in November. Credit: The Sydney Morning Herald\n\nNSW Health’s Dr Jeremy McAnulty said the total number of flu cases this year had been higher than recent years despite the winter flu season peaking lower.\n\n“It’s been quite unusual in that we’ve seen this extended period of flu throughout the season, extending … to where we are almost in summer,” McAnulty said. “Earlier this year we saw the not-unusual increase in summer from what, we believe, was people travelling, and it never went down as far as we’d like.”",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/fresh-off-a-dally-m-winning-season-roosters-captain-extends-deal-to-end-of-2027-20251120-p5ngzk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fresh off a Dally M-winning season, Roosters captain extends deal to end of 2027",
    "publish_date": "Thu, 20 Nov 2025 12:03:52 +1100",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Dual premiership winner and former NSW and Australia captain James Tedesco will remain at the Sydney Roosters through to the end of 2027.\n\nNews of Tedesco’s one-year extension came on Thursday, an hour before the skipper was to front the media alongside recruit, Daly Cherry-Evans.\n\nOne more year: James Tedesco will remain at the Sydney Roosters until the end of 2027. Credit: James Brickwood\n\nDespite turning 33 in January, Tedesco has never been in better form, and won the Dally M last season by a record margin.\n\nTedesco’s latest contract will take him through to a 10th season at Bondi Junction, having joined the club from Wests Tigers in 2018 after making his NRL debut in 2012.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/environment/elephant-hides-behind-tree-20251120-p5nh2d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Elephant hides behind tree",
    "publish_date": "Thu, 20 Nov 2025 12:03:18 +1100",
    "category": "finance",
    "authors": [],
    "text": "Elephant hides behind tree\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/environment/climate-change/australia-can-win-big-international-bids-when-it-wants-this-was-an-omnishambles-20251120-p5nh0r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia can win big international bids when it wants. This was an omnishambles",
    "publish_date": "Thu, 20 Nov 2025 12:01:48 +1100",
    "category": "finance",
    "authors": [
      "Nick O'Malley"
    ],
    "text": "Still, Bowen, looking grey and drawn, was determined to put a positive spin on a thorough diplomatic rout of Australia by Turkey.\n\nNot only that, the crucial leaders’ meeting that traditionally runs before or during the first days of those talks would also be held in Turkey. And as host, Turkey would appoint the COP president to run the event and manage the mechanics of the world’s key multilateral machine to combat climate change for the succeeding year, as the rules dictated.\n\nIt was after 10pm in Belem, Brazil, when Climate Change and Energy Minister Chris Bowen finally conceded publicly that, after a three-year campaign spanning the Pacific and the world for a role Australia believed was all but locked in, Turkey would host next year’s United Nations COP climate talks.\n\nAustralia’s goals in the bid, he said, were to elevate the concerns of the Pacific and to act in the nation’s best interests. To that end, he had secured an in-principle agreement that he would serve at the talks under the title of “president of negotiations”, with authority to set the negotiating agenda, appoint chairs and leads and prepare the draft decision text.\n\nA pre-COP meeting would be held in the Pacific, which Australia would use to browbeat participants to contribute to a Pacific Resilience Fund.\n\nThis is not nothing. Anyone who has watched UN climate negotiations up close knows the roles of those who drive them are powerful and significant. The Pacific will be devastated by Australia’s failure, but it will not turn down any finance that might be extracted at such a forum.\n\nBowen insists that had he not blinked, and had the meeting reverted to the UN climate headquarters in Bonne, the result would have been a rudderless meeting at which Australia and the Pacific had no control.\n\n“Some people will be disappointed in that outcome,” he said to reporters during a gap in ongoing negotiations in Belem.",
    "source": "SMH",
    "cluster_id": 11
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-concedes-cop31-hosting-to-turkiye-bowen-to-lead-negotiations/o0dv8xuy2",
    "title": "'Obscene process': Criticism as Australia concedes COP31 hosting to Türkiye",
    "publish_date": "Thu, 20 Nov 2025 00:10:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia has formally given up its bid to host next year's United Nations climate summit, under a deal which will see COP31 held in Türkiye while Australia takes on the role of COP President for the negotiations.\n\n\n\n\n\nSA Premier Peter Malinauskas, who had been supportive of the bid for Adelaide to host, was critical of the UN's processes, describing them as \"obscene\".\n\n\n\n\n\n\"[The prime minister] has taken a position to try and navigate the frankly obscene process that exists internationally,\" he told reporters in Adelaide.\n\n\n\n\n\n\"It is clear that the rest of the world largely would have preferred COP to be in Adelaide but Türkiye wanted to exercise their veto right which then necessitated a judgement and at the prime ministerial level of our federal government to contemplate a negotiation which they pursued.\"\n\n\n\n\n\nHe said South Australia \"did our best\" but \"fell short\".\n\n\n\nREAD MORE Australia downplays co-hosting COP31 after Türkiye proposes sharing event\n\nGreenpeace spokesperson Simon Bradshaw said \"there's no hiding this is a real disappointment.\"\n\n\n\n\n\n\"A COP in the Australia Pacific would've been a tremendous opportunity to be accelerating global climate action to really be getting behind that long legacy of Pacific Climate leadership.\n\n\n\n\n\n\"But really wherever the venue, whatever the arrangement, the task remains the same. We now need to be doing everything we can to drive the phase out of fossil fuels and to ensure we limit warming to 1.5 degrees.\"\n\n\n\n\n\nPrime Minister Anthony Albanese has praised the decision as \"a big win\", despite the government spending months campaigning to host the summit.\n\n\n\nREAD MORE The tiny island taking one of the world's most valuable companies to court\n\n\"We're in a situation where it would not have advantaged multilateral action on climate change if we couldn't even agree on where a conference was, would have been a real setback,\" he told ABC Radio Perth on Thursday.\n\n\n\n\n\nClimate Change and Energy Minister Chris Bowen outlined the model in Belem, Brazil, saying it met Australia's three objectives: elevating Pacific voices, supporting multilateralism, and safeguarding national interests.\n\n\n\n\n\n\"There's a little way to go,\" he said, with the Western Europe and Others Group to meet again within 24 hours, \"but a model in which pre-COP is hosted in the Pacific … and the COP is held in Türkiye, but Australia, myself, is appointed COP President for Negotiations … is an outcome which achieves those objectives.\"\n\n\n\n\n\nBowen said the pre-COP event would be held in a Pacific Island nation and would double as a pledging meeting for the Pacific Resilience Fund.\n\n\n\nREAD MORE Thousands march in Brazil in first big UN climate protest in years\n\nThe summit itself would take place in Türkiye, avoiding a collapse of negotiations that would have forced COP31 to default to Bonn, Germany.\n\n\n\n\n\nGreens leader Larissa Waters said it was \"an embarrassing outcome\".\n\n\n\n\n\n\"It was clear from the start that the government didn’t really want to host a climate summit.\n\n\n\n\n\n\"The prime minister never really wanted to host a climate conference if it meant being honest about the future of coal and gas while his mining corporation mates are watching. If COP came to Australia, it would have been a good opportunity for the world’s leaders to grill Labor for their terrible track record on climate action.\"\n\n\n\nBowen defends concession\n\nBowen stressed the compromise was necessary to avoid the worst-case scenario: \"with a lack of leadership, no COP President in place, no plan,\" he said.\n\n\n\n\n\n\"That would mean 12 months with a lack of leadership … that would be irresponsible for multilateralism.\"\n\n\n\n\n\nAsked whether Australia had made a major concession, Bowen said Türkiye had also given ground.\n\n\n\n\n\nHe clarified the split presidency model: Türkiye would be COP president for hosting and logistics, while he would hold \"all the powers of COP presidency to manage the negotiations, to appoint co-facilitators, to prepare draft text, and to issue the cover decision.\"\n\n\n\nREAD MORE Thousands march in Brazil in first big UN climate protest in years\n\nOpposition leader Sussan Ley said she believed Türkiye is doing the Australian government a favour.\n\n\n\n\n\n\"The fact that this government even considered spending $2 billion of taxpayers money on this exercise just goes to show how their priorities are all wrong,\" she said on Thursday.\n\n\n\n\n\n\"Chris Bowen is very disappointed today, I am sure, but Australians should be very pleased with the decision that was taken away from this country and made overseas.\"\n\n\n\n\n\nWhile refusing to say exactly how much the federal government has spent on drawing the COP31 summit to Australia, Albanese defended the cost as a \"relatively small amount\".\n\n\n\n\n\nBowen said some would be disappointed, but more would have been disappointed \"if it had gone to Bonn without a COP President in place\".\n\n\n\n\n\n\"This is a better outcome than that.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 11
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/indonesias-drowning-island-takes-historic-climate-case-to-court/902jxfpoi",
    "title": "Indonesia’s drowning island takes historic climate case to court",
    "publish_date": "Wed, 19 Nov 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nLess than two hours by ferry from the grit and gridlock of megacity Jakarta, Pari Island seems almost too good to be true.\n\n\n\n\n\nThe Indonesian capital's 10 million people are swapped for just 1,500. Children spend all day playing barefoot on sandy white beaches, while pristine turquoise seas lap around them.\n\n\n\n\n\nThen you notice the swing sets and picnic tables peaking out of the water.\n\n\n\n\n\nArif Pujianto lives about 50 metres from the water - unless there's a high tide, he says.\n\n\n\n\n\n“During high tides or tidal floods, it comes right into the house, up to about here. You can still see the marks. When the tidal flood hit, it got in here, left all this damage, made things rot and fall apart.”\n\n\n\n\n\nLocals say life on this island was steady for generations, but over the past decade it has undergone a dramatic transformation.\n\n\n\n\n\nAll around the shore, structures that used to sit on land are now permanently submerged.\n\n\n\n\n\nEnvironmentalists monitoring Pari Island say 11 per cent has already been swallowed by the sea, with some projecting the entire island will be underwater by 2050.\n\n\n\n\n\nIf that happens, locals like Pujianto say they will have nowhere to go.\n\n\n\n\n\n“Well, this is my island, the place I’ve lived since I was a child. It’s predicted that by 2030 or 2040, more small islands will sink or disappear. So it’s not impossible that inhabited islands, too, could sink or become too damaged to live on. If that ever happens — I really hope it doesn’t. That’s why I filed this lawsuit.”\n\n\n\n\n\nIt is difficult to name a place that has contributed less to human-induced climate change than Pari Island.\n\n\n\n\n\nThere is not a single car on the island; the community grows and catches much of its food; they've even planted thousands of carbon-capturing mangroves along the coastline in a bid to protect it from further erosion.\n\n\n\n\n\nYet it's one of the places in Indonesia where the effects of climate change are being felt most acutely.\n\n\n\n\n\nRising tides have damaged homes, warming waters have ruined once-lucrative seaweed farms, and rapidly changing weather patterns have made fishing largely unprofitable.\n\n\n\n\n\nThe community is now demanding damages, having launched a landmark legal case against Swiss cement giant Holcim over its historic carbon emissions.\n\n\n\n\n\nSeaweed farmer Ibu Asmania is one of the four plaintiffs.\n\n\n\n\n\n“It's not like we just suddenly decided to sue Holcim. We studied this for a long time before choosing Holcim, because their emissions are among the highest in the world. The warming we're feeling now is caused by the massive emissions they've been producing since the 1950s.”\n\n\n\n\n\nThe cement industry accounts for around 8 per cent of global carbon emissions annually, mostly due to the extreme heat needed to produce clinker, which is one of the main ingredients in cement.\n\n\n\n\n\nHolcim is the industry's biggest player, worth more than $75 billion.\n\n\n\n\n\nAsmania and the other plaintiffs are seeking about $6,800 each, arguing Holcim is responsible for 0.42 per cent of all global emissions since 1950 and should therefore pay for the same proportion of the damage caused to Pari Island.\n\n\n\n\n\n“What we're demanding first is for Holcim to cut its emissions, and secondly, to repair the environmental damage on Pari Island, through restoration, disaster mitigation, mangrove replanting and building wave barriers. It would mean our sea could recover, the fish could come back, and the whole ecosystem could heal again.”\n\n\n\n\n\nAsmania and her husband, Sartono, have operated a small seaweed farm just off the coast of Pari Island for 20 years.\n\n\n\n\n\nAlmost every family on the island used to farm seaweed, but today she says only five are still trying.\n\n\n\n\n\nRising sea temperatures are bleaching their crops, making them largely unharvestable.\n\n\n\n\n\nThe community's other main source of income — fishing — has not spared the impacts of climate change either.\n\n\n\n\n\nBang Bobby is another plaintiff in the Holcim case. He remembers first going out to sea with his parents in his fifth year of primary school. Now 53 years old, he says he has been fishing the waters off Pari Island ever since.\n\n\n\n\n\n“We could still predict the seasons back then, including the wind directions month to month. Back in the day, during the easterly winds around August, we'd catch tuna mackerel and scads. Then, as the seasons shifted to westerlies around March or April, we'd catch Spanish mackerel, baby tuna, and lots of others. Now, even though we’re experienced, we can’t predict nature anymore — every forecast is completely off.”\n\n\n\n\n\nBobby says fish populations have declined across the island, which means local fishers need to travel much further out to sea to find their daily catch.\n\n\n\n\n\nDuring the region's eight-month-long wet season, when storms are sudden and intense, they often need to turn back before catching anything.\n\n\n\n\n\nThe difference in Bobby's income is dramatic; he used to turn a profit of around $500-$600 per month, but now, he says he is lucky to make $150.\n\n\n\n\n\n“This is something we have to do. Even though Pari Island is far from Holcim's factories, the emissions they produce have caused the climate change that's reached us here. Imagine a big basin filled with water. If you drop even a small stone into it, it still creates ripples and waves that reach everywhere. It's the same with emissions. You can't see them with your eyes, but their impact is real and we can feel it.”\n\n\n\n\n\nNo community has ever successfully sued a corporation on another continent over its carbon emissions.\n\n\n\n\n\nA Peruvian farmer spent the better part of a decade attempting to launch a lawsuit against German energy giant RWE, arguing its carbon emissions contributed to glacial flooding in his hometown, but the court rejected his case in May.\n\n\n\n\n\nMas Bagus from the Indonesian Forum for the Environment, which is assisting the Pari Island community with its legal case, say that if it is successful, it could set an important precedent for other communities seeking climate justice.\n\n\n\n\n\n“We know that emissions, and therefore the climate crisis, cannot be contained within administrative borders. They contribute to impacts in regions far beyond where they are produced. Of course, other corporations should also be held accountable. We invite others to do the same. Today it's Holcim, tomorrow it could be other companies that must also take responsibility.”\n\n\n\n\n\nThe Pari Island plaintiffs travelled to Switzerland in September to make their case and are now awaiting the court's decision on whether to consider their complaint.\n\n\n\n\n\nIn a statement to SBS News, a Holcim spokesperson said: \"In our opinion, the question of who is allowed to emit how much CO2 is a matter for the legislature and not a question for a civil court... We await the court's decision, yet regardless of the outcome, Holcim is fully committed to reaching net zero by 2050.\"\n\n\n\n\n\nBy then, the people of Pari Island fear it will be too late.\n\n\n\n\n\nEdi Mulyono is the fourth and final plaintiff in the case against Holcim.\n\n\n\n\n\nHe says he is doing this for his children.\n\n\n\n\n\n“I don't know how long I'll live; maybe I'll die tomorrow, but I've got three kids; the eldest is in high school, the youngest is still in kindergarten. What I fear most is what will happen when my children grow up and have their own kids. Where will they live if this island keeps eroding and disappearing because of coastal abrasion and tidal floods? That's what's always on my mind. That's why I'm still doing everything I can to protect this island from sinking.”\n\n\n\n\n\nREAD MORE ABOUT THIS STORY Feature The tiny island taking one of the world's most valuable companies to court\n\n\n\n",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/calls-for-superannuation-protections-as-some-retirees-lose-up-to-205-000/f8oephznl",
    "title": "Calls for superannuation protections as some retirees could lose up to $205,000",
    "publish_date": "Wed, 19 Nov 2025 18:54:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "Poorly performing retiree superannuation products could reduce income by $57,000 to $205,000 over the course of retirement, a new report has revealed, leading a consumer group to call for protections for retired Australians.\n\n\n\n\n\nThe report by Super Consumers Australia (SCA) found all of the options that failed the government’s annual performance test this year were also offered to retirees.\n\n\n\n\n\nHowever, the government's exclusions do not apply to products offered to retirees, so people with their retirement savings invested in them are none the wiser.\n\n\n\n\n\nThe federal government is currently reviewing the performance test, while the SCA is urging it to immediately extend the test to protect retirees.\n\n\n\nSCA deputy CEO Katrina Ellis said: \"It’s unreasonable that a 64-year-old is protected by a performance test, yet the moment they retire and move into an identical product, that safeguard disappears.\"\n\n\n\n\n\nThe 'Securing Australia’s Retirement: It’s time to protect retirees from dud investment options' report revealed that 91 per cent of failed investment options in the past three years were also available in the retirement phase at the time of failure.\n\n\n\n\n\nAlso, the analysis stated retirees are invested in all seven of the options that failed the 2025 performance test.\n\n\n\n\n\nOther funds, including AMP, Russell Investments, Colonial First State and REST, offered underperforming retirement products across multiple growth categories.\n\n\n\nAn AMP spokesperson told SBS News: \"(AMP) strongly rejects the narrow analysis and irresponsible claims made in the Super Consumers report, which gives a misleading picture for Australians considering where to invest their retirement savings.\n\n\n\n\n\n\"The report also fails to take into proper account the different objectives of retirement products, or consider contemporary lifetime income retirement solutions, which are delivering significantly better outcomes for retirees.\"\n\n\n\n\n\nA Russell Investments spokesperson said they were aware of the report and claimed the figures cited for its fund’s options \"are not accurate\".\n\n\n\n\n\nColonial First State said \"In regard to options in the report, APRA assessed the accumulation equivalent of these same retirement investment options and they passed the annual superannuation performance test.\n\n\n\n\n\n\"These options are managed consistently across both accumulation and retirement phases, including the same asset allocation, benchmarks, and investment managers. On that basis, had the performance test been applied to the retirement phase these options would have passed.\"\n\n\n\n\n\nSBS also contacted REST for comment but they had not responded by the time of publication.\n\n\n\nSCA said almost three-quarters of Australians support extending the performance test to retirement products, with even more calling for greater transparency so retirees can compare how their fund performs.\n\n\n\n\n\nEllis said: \"The superannuation system is meant to provide Australians with a dignified retirement, not leave them in the dark about whether their money is working for them.\"\n\n\n\n\n\n\"Retirees deserve the same protections as workers. Without them, people risk losing hundreds of thousands of dollars in retirement income and living standards will suffer.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-jobs-disappearing-at-a-growing-rate/lk203bdkr",
    "title": "'The worst we've seen': The type of job that's getting harder to find in Australia",
    "publish_date": "Wed, 19 Nov 2025 18:46:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "The odds of job seekers finding entry-level work are so low that \"even the most determined will be left behind\", according to new research from Anglicare Australia.\n\n\n\n\n\nThe anti-poverty organisation's latest annual Jobs Availability Snapshot, released on Thursday, compared the number of people receiving JobSeeker payments with the number of positions advertised in August this year that require little formal education or experience.\n\n\n\n\n\nIt found that for every entry-level vacancy, there were 39 job seekers — an increase on last year's figure of 35.\n\n\n\n\n\nTwenty-five of those 39 people are considered to have barriers to work, meaning they have been receiving JobSeeker payments for a least a year.\n\n\n\n\"That's the worst we've seen — and this is our 10th year of this snapshot,\" Anglicare Australia executive director Kasy Chambers told SBS News.\n\n\n\n\n\n\"If you are one of those people who've been on JobSeeker for three years, you've only got partial ability to work, or you haven't got English as your first language and you're competing with 38 other job seekers who have, you're going to find it difficult.\"\n\n\n\n\n\nGiven that anyone can apply for entry-level jobs and more people were taking on extra work due to the cost of living, there was likely \"greater competition than even we are measuring\", she added.\n\n\n\nWhy is it getting worse?\n\nChambers said one of the reasons the situation was getting worse was because the \"list of people who are long-term unemployed is getting bigger, and those who are long-term unemployed are staying unemployed for longer\".\n\n\n\n\n\nAlmost one in four JobSeeker recipients have been getting the payment for five or more years, compared to just one in 10 a decade ago.\n\n\n\n\n\nThe longer someone is unemployed, the harder it is for them to get a job, Chambers said.\n\n\n\n\n\n\"Apart from the fact that you haven't had up-to-date training, you haven't got the networks, but also you've been existing on JobSeeker payments, which is less than half the poverty line, so you are likely to be getting a bit worn,\" she said.\n\n\n\n\n\n\"Things like medication, dentistry, all those kind of things that many of us are lucky enough to take for granted, you're not going to be able to [access].\"\n\n\n\nAnglicare Australia executive director Kasy Chambers said the current employment system is failing those most in need of work. Source: AAP / Dominic Giannini The model employment service providers operate under makes them ineffective in helping people find suitable work, Chambers said.\n\n\n\n\n\n\"We've seen a lot of inquiries about it, we all know that it's not working, and yet we spend billions of dollars on it every year into private companies,\" she said.\n\n\n\n\n\n\"We hear ridiculous stories about these employment service providers denying somebody the ability to go to a job interview because they want them to go to some training that day, putting people with partial ability to work due to spinal conditions through barista courses, which is about standing all day — just really stupid things that are a churn of activity, but are absolutely meaningless and really they don't result in people getting good training, and they don't result in getting people into jobs.\"\n\n\n\n\n\nThe overall number of job advertisements has also been steadily declining over the past three years, according to figures from the Internet Vacancy Index, with the sharpest drop (37 per cent) among entry-level roles.\n\n\n\nREAD MORE Need a new job? These are the top 10 skills Australian employers are looking for\n\nChambers said as automation and artificial intelligence advance and jobs are increasingly mechanised, that downward trend was likely to continue.\n\n\n\n\n\n\"Entry-level jobs are under threat — and we need to do something about it,\" she said.\n\n\n\n\n\n\"We will always have people who haven't finished year 12, gone straight into a degree and then churn themselves out into the job that that degree was designed for, or the VET course.\"\n\n\n\n\n\nThe report noted that the employment of checkout operators and cashiers had fallen by 20.6 per cent over the past five years, according to federal government figures, which reflected the rise of self-service technology.\n\n\n\nWhat reforms are needed?\n\nChambers said the findings showed the urgent need to reform Australia's employment system.\n\n\n\n\n\n\"The jobs are not there, so it's not the person's fault — it is a structural issue,\" she said.\n\n\n\n\n\nAnglicare Australia's first recommendation is for the government to create quality entry-level jobs.\n\n\n\n\n\nChambers suggested entry-level roles in the care economy as an area of opportunity.\n\n\n\n\n\n\"There are plenty of places where we could be creative, but while we ask the market to do everything for us, that's not going to happen.\"\n\n\n\nAnglicare Australia is also calling for employment services to be overhauled so people are given appropriate support to find suitable and sustainable work.\n\n\n\n\n\n\"It is about talking to the person, finding out what their skills and strengths are and helping them match those to something that's available in their area, if there is something,\" Chambers said.\n\n\n\n\n\nThe rate of income support payments like JobSeeker also needs to be lifted above the poverty line, she said, so people can afford to look after their basic needs while they look for work or undergo training.\n\n\n\n\n\nThe maximum JobSeeker payment a single person without children can receive is $793.60 per fortnight, which equates to $20,633.60 a year.\n\n\n\n\n\n\"We cannot keep pretending that JobSeeker is an interim payment for a couple of weeks just to get people over a bad patch,\" Chambers said.\n\n\n\n\n\nSBS News has contacted the federal employment minister for comment.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/video/350-csiro-researchers-will-lose-their-jobs-in-devastating-cuts/5vqr899bg",
    "title": "350 CSIRO researchers will lose their jobs in 'devastating' cuts",
    "publish_date": "Wed, 19 Nov 2025 08:24:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/chris-minns-on-hospital-funding-row-we-cant-all-be-wrong/b6qoqlhwf",
    "title": "Chris Minns on hospital funding row: we can't all be wrong",
    "publish_date": "Wed, 19 Nov 2025 07:08:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAs New South Wales Premier Chris Minns points out, it's rare to see premiers across states and territories are united.\n\n\n\n\n\n\"Look, right across Australia, Queensland, Western Australia, South Australia, the Northern Territory, different states, different political parties run those states, we can't all be wrong.\"\n\n\n\n\n\nThe state premiers and territory chief ministers have teamed up to accuse the federal government of back-flipping on its promise on public hospital funding.\n\n\n\n\n\nBack in 2023, the federal and state governments agreed a new funding model for public hospitals, which would see the Commonwealth increasing its share of public hospital costs to 42.5 per cent by 2031.\n\n\n\n\n\nBut according to Mr Minns, the latest offer from the federal government is just 37 per cent of of the costs, which he says is a massive decline.\n\n\n\n\n\n\"The federal government's got a lot of far deeper pockets than the states do, but we are responsible for service delivery, and we need a new deal here, because what's being offered is just not good enough.\"\n\n\n\n\n\nThe changing position of the federal government occurred in September, when the Prime Minister Anthony Albanese reportedly issued a letter to Premiers and state health ministers.\n\n\n\n\n\nIn the letter, Mr Albanese reportedly urged the state governments to cut hospital spending, if they wanted a new funding deal to be reached.\n\n\n\n\n\nSpeaking from Western Australia along with WA Premier Roger Cook, Mr Albanese says he and the premiers are working through the issue.\n\n\n\n\n\n\"What we have on the table is an increased amount of funding, and indeed people talk about the agreement, what was on the table at that time was $30 billion, we currently have $20 billion on the table, we were working those issues through, $20 billion is a substantial increase in health funding for hospitals.\"\n\n\n\nThe National Cabinet will meet again this week to discuss the issue, but the Opposition leader Sussan Ley says the Albanese government's backflipping is a sign of failed budgeting.\n\n\n\n\n\n\"Isn't' it extraordinary that the Prime Minister is mismanaging the economy so badly, that he is now forced to write to health ministers?\"\n\n\n\nThe dispute comes to a head as experts point to a public hospital system under mounting pressure, from ambulance ramping to overcrowding in hospitals.\n\n\n\n\n\nThe situation has been worsening, despite a surge in public hospital spending in recent years.\n\n\n\nPeter Breadon is the Health Program Director at the Grattan Institute.\n\n\n\n\n\nIn a new report, his team suggest that state governments can cut back billions of dollars of avoidable hospital spending.\n\n\n\n\"We found that conservatively there's about 1.2 billion a year in the system that isn't helping patients and could be better spent. That includes shorter hospital stays. We spend longer in hospital in Australia for many surgeries where a lot of people could go home the same day compared to other wealthy countries.\"\n\n\n\nHis report is also calling on the Commonwealth to increase its contribution to hospital funding in line with growing demand for care.\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/eyes-on-nvidia-wages-rise-above-inflation/41eyofmex",
    "title": "Eyes on Nvidia & wages rise above inflation",
    "publish_date": "Wed, 19 Nov 2025 06:49:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-are-birmingham-bin-workers-on-strike/fe6fle5pm",
    "title": "Waste, harassment claims and walkouts: Behind a city's months-long bin workers' strike",
    "publish_date": "Wed, 19 Nov 2025 06:12:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "A long-running bin dispute in Birmingham, United Kingdom, has entered a new phase, as agency staff — who until now kept the service running — voted to join the strike over what they describe as bullying, harassment, and unsustainable workloads.\n\n\n\n\n\nThe bin strike has taken place since the beginning of the year, leading to large piles of waste building up intermittently, in one of the UK's biggest cities.\n\n\n\n\n\nUnite, the trade union representing the striking workers, said 18 of 22 agency workers employed via the workforce platform, Job & Talent, have voted to officially join picket lines from 1 December.\n\n\n\n\n\nSome have already turned back at the picket lines, saying a \"toxic\" workplace culture in the refuse service has made it impossible for them to keep working, the union said.\n\n\n\n\n\nThe move comes as hundreds of refuse workers, who have been on all-out strike since March, voted overwhelmingly to extend their industrial action — possibly pushing disruption well beyond the May 2026 local elections.\n\n\n\n\n\nWith rubbish piling up, contingency crews stretched, and both sides publicly hardening their stance, Birmingham's bin saga appears set for its most prolonged chapter yet.\n\n\n\nThe strike is further complicated by the Birmingham City Council's bankruptcy, which has forced reliance on contingency plans and agency staff. Source: Getty / Jacob King\n\nWhen did this dispute start?\n\nThe standoff started with Birmingham City Council's decision to remove a senior role on each bin crew in August 2024 — a position Unite maintains is \"safety-critical\". The council has insisted it was not industry standard.\n\n\n\n\n\nUnion members escalated from targeted action in January 2025 to a full walkout in March, after pay for drivers and senior loaders was reportedly slashed by as much as £8,000 ($16,000) a year.\n\n\n\n\n\nWorkers warned the cut — more than 20 per cent of annual pay — would leave families struggling to eat and, in some cases, keep their homes.\n\n\n\n\n\nUnite argued the dispute worsened when the council reportedly fired and rehired heavy goods vehicle drivers to force them onto lower rates. It also alleged the council refused to provide evidence to support its claim that equal pay concerns prevented any deal.\n\n\n\nREAD MORE UK Labour strips asylum seeker rights amid surging support for Nigel Farage's Reform party\n\nThroughout the dispute, Unite has insisted it remains willing to negotiate.\n\n\n\n\n\nBut the council, according to the union, backed away from a \"ballpark deal\" reached with CEO Joanne Roney in May — leaving talks frozen for months.\n\n\n\n\n\nMeanwhile, a spokesperson for Birmingham City Council said: \"Unite has rejected all our offers.\"\n\n\n\nHow did it spiral to this week's escalation?\n\nThe strike has already lasted eight months and drawn global attention, with images of overflowing bins, black bags lining streets and long queues outside temporary waste drop-off points.\n\n\n\n\n\nUnite said 99.5 per cent of its workers backed an extension of the strike on a 75 per cent turnout, suggesting staff feel the dispute is nowhere near resolution.\n\n\n\n\n\nInto this already tense environment, the agency workforce — crucial to keeping basic collections going — stepped forward.\n\n\n\n\n\nJob & Talent staff have long been embedded in the refuse service. The agency confirms its numbers have not increased during the strike.\n\n\n\n\n\nBut those workers have alleged the workload has become unmanageable and the treatment intolerable.\n\n\n\nUnite has reported claims of bullying and harassment, which includes footage of a Job & Talent manager warning staff they risked being blacklisted by council chiefs if they refused to cross picket lines.\n\n\n\n\n\nJob & Talent rejects the allegations and stresses it takes any welfare concerns \"extremely seriously\". A spokesperson said it operates with \"transparency, integrity and full compliance with employment laws\" and will not tolerate intimidation against workers participating in industrial action.\n\n\n\n\n\nIndustrial relations specialist Roger Seifert, from the University of Wolverhampton, described it as having evolved far beyond a typical workplace dispute.\n\n\n\n\n\nHe told the BBC that once councils rely heavily on agencies, \"pressure builds up\", gets shifted down the chain and produces \"bad blood\" — leaving residents to endure a worsening service.\n\n\n\nWhat is each side saying now?\n\nUnite has described the agency walkout as a \"real escalation\".\n\n\n\n\n\nSharon Graham, the union's general secretary, said workers are striking because of \"the terrible way they have been treated by Job & Talent and Birmingham council\", accusing the council of spending \"a fortune it doesn't have\" instead of agreeing a fair deal.\n\n\n\nUnite's national lead officer Onay Kasab said residents have every right to worry about strikes stretching through Christmas, New Year and into the election period, but blamed the council for the deadlock. He said the union is still committed to \"meaningful negotiations\" and wants bullying and blacklisting \"stamped out\".\n\n\n\n\n\nBirmingham City Council maintains Unite has \"rejected all our offers\" and insists its contingency plan is working. A spokesperson said the council is collecting around 1,330 tonnes of kerbside waste daily — more than before the strike — and more than 100,000 tonnes over the past six months.\n\n\n\n\n\nThe council said it will continue providing at least one collection a week.\n\n\n\n\n\nThe council also emphasised that the agency dispute does not sit with them but with Job & Talent, describing it as involving only \"a small number\" of workers.\n\n\n\nWhat happens next?\n\nWith Birmingham City Council now formally bankrupt, residents fear they will ultimately bear the cost of the stalemate.\n\n\n\nUnite's accountants estimate the dispute could cost the council £15 million ($30 million) over 2025.\n\n\n\n\n\nFor now, both sides remain entrenched.\n\n\n\n\n\nUnite said the path out is simple: a fair deal on pay and conditions.\n\n\n\n\n\nThe council insists its reforms are \"long overdue\" and it will press on.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/curacao-the-smallest-nation-to-qualify-for-fifa-world-cup/d8s2koj01",
    "title": "Curaçao makes World Cup history after completing fairytale qualification campaign",
    "publish_date": "Wed, 19 Nov 2025 05:28:44 +0000",
    "category": "sports",
    "authors": [],
    "text": "The tiny Caribbean nation of Curaçao — approximately half the size of the city of Canberra — has become the smallest country ever to qualify for the FIFA World Cup.\n\n\n\n\n\nA nerve-shredding finale to the CONCACAF qualifying campaign saw Curaçao — with a population of just 156,000 and a land mass of 444 sq km — squeeze into next year's finals in the United States, Canada and Mexico with a 0-0 draw against Jamaica in Kingston on Wednesday afternoon (AEDT).\n\n\n\n\n\nCuraçao, whose veteran Dutch coach Dick Advocaat was forced to miss the game due to a family issue in the Netherlands, were left celebrating a historic result.\n\n\n\n\n\nThe team known as the Blue Wave finished undefeated at the top of Group B with 12 points from six games, one point clear of Jamaica.\n\n\n\nCuraçao is by far the smallest nation ever to qualify for the World Cup, which is being expanded to 48 teams next year for the first time.\n\n\n\n\n\nThe previous smallest country to qualify for the tournament was Iceland in 2018, with a population of around 350,000.\n\n\n\nCuraçao has become the smallest country ever to qualify for the World Cup. Source: AFP / Ricardo Makyn Curaçao finally booked their place after an extraordinary finale at Kingston's National Stadium, where Jamaica — coached by former England manager Steve McClaren — launched a furious onslaught as they chased the win which would guarantee them a World Cup place at their opponent's expense.\n\n\n\n\n\nHaiti, meanwhile, who last appeared in the World Cup in 1974, also completed an improbable qualification campaign with a 2-0 win over Nicaragua on Wednesday.\n\n\n\n\n\nIronically, Haiti secured their decisive qualification victory in Curaçao, where the team have been forced to play their home qualifiers due to unrest in their homeland.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/socceroos-vs-colombia-international-friendly-results/7wlu8shlj",
    "title": "Socceroos lose to Colombia in New York as World Cup preparations continue",
    "publish_date": "Wed, 19 Nov 2025 03:33:30 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Socceroos suffered a 3-0 defeat against Colombia in a highly-anticipated international friendly in New York City on Wednesday AEDT, ahead of next year's FIFA World Cup in North America.\n\n\n\n\n\nAustralia — ranked 25th in the world — was coming off a disappointing loss against 50th-ranked Venezuela and needed to improve greatly to overcome Colombia, who are ranked 13th.\n\n\n\n\n\nThe Socceroos have just nine wins against South American teams from 49 attempts and have never beaten Colombia, recording two draws and two defeats.\n\n\n\n\n\nA 76th-minute penalty from Colombia's James Rodríguez, followed by an 89th-minute tap-in from fellow star Luis Díaz and then a Jefferson Lerma header from a corner in the third minute of added time meant that Colombia's undefeated streak against Australia continued.\n\n\n\n\n\nThe teams were deadlocked at half-time with Australia putting up a good fight against Colombia, who had most of the ball and for whom Bayern Munich's Díaz proved a constant threat.\n\n\n\nAustralia made five changes from their last starting XI against Venezuela.\n\n\n\n\n\nSocceroos coach Tony Popovic fielded an experimental line-up in the 1-0 loss to Venezuela on Saturday, with four players debuting, including three starters.\n\n\n\n\n\nHe conceded the performance against Venezuela was \"disjointed\" and for the middle hour \"there wasn't much good from us with and without the ball,\" and added that the World Cup would be where he'd want to beat a South American side.\n\n\n\nPopovic blames 'soft penalty', virus after loss\n\nPopovic lamented what he termed the \"softest penalty you can see\", also revealing the entire squad had been bedridden with a virus and been unable to train on Sunday ahead of the game on Tuesday (local time).\n\n\n\n\n\n\"We kept that quiet, because the players wanted to keep that quiet. So that's a credit to them,\" he said.\n\n\n\nREAD MORE Curaçao makes World Cup history after completing fairytale qualification campaign\n\n\"I was happy to mention that, but the players wanted to keep that quiet. We had a virus through the whole squad, including the staff, so we were unable to train Sunday. So the entire day, everyone was in bed.\n\n\n\n\n\n\"We flew three hours on Monday, came here and put up a really good, brave performance.\n\n\n\n\n\n\"I'm actually surprised at how well they did, because physically, they were clearly nowhere near it.\"\n\n\n\nAustralia and Colombia have both secured their spots in the 2026 FIFA World Cup.\n\n\n\n\n\nAustralia qualified for a sixth consecutive World Cup in June after beating Saudi Arabia 2-1, thanks to goals from striker Mitch Duke and midfielder Connor Metcalfe.\n\n\n\n\n\nColombia beat Bolivia 3-0 in September to secure automatic qualification from the CONMEBOL confederation headlined by Argentina, Brazil and Uruguay.\n\n\n\n\n\nMeanwhile, the tiny Carribean island nation of Curaçao, population 156,000, qualified for the World Cup for the first time on Wednesday with a 0-0 draw against Jamaica. They become the smallest country ever to qualify for a World Cup.\n\n\n\n\n\nThe 2026 FIFA World Cup will be co-hosted by the United States, Canada, and Mexico from 11 June to 19 July.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-home-prices-set-to-hit-fresh-highs-in-2026-liberals-want-australian-values-screening-for-new-migrants-super-funds-accused-of-profiting-from-russian-blood-oil-20251120-p5ngwb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Trump signs bill to release all Epstein files; Liberals want ‘Australian values’ screening for new migrants",
    "publish_date": "Thu, 20 Nov 2025 12:54:15 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Fund manager Magellan says its head of global equities, Arvid Streimann, has resigned amid an internal investigation in an alleged relationship with a junior employee.\n\nMagellan Financial Group told the ASX on Thursday that Streimann had resigned after an Australian Financial Review report about an investigation into an alleged relationship published last night.\n\nMagellan’s head of global equities, Arvid Streimann, has resigned.\n\n“This had been separately brought to our attention and is under internal investigation,” Magellan said in an ASX statement.\n\n“MFG confirms that Arvid Streimann has resigned, effective 19 November 2025.”\n\n“MFG remains committed to ensuring appropriate workplace standards in line with its values.”\n\nThe AFR report said Magellan was investigating Streimann over an alleged relationship with a junior female employee.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/business/companies/aureka-strikes-record-grades-in-victoria-as-comstock-gold-lights-up-20251120-p5nh37.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aureka strikes record grades in Victoria as Comstock gold lights up",
    "publish_date": "Thu, 20 Nov 2025 12:54:02 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Aureka’s Comstock gold project in Victoria continues to turn heads with the company unwrapping a suite of assays that not only validate earlier sightings of visible gold but also deliver the highest grades ever recorded at the operation.\n\nThe latest numbers, pulled from diamond drill core glinting with coarse free gold, showcase a mineralised system rich in sulphides and structural pathways, and one that is rapidly expanding beyond the limits of the current JORC Resource.\n\nSt Arnaud Comstock visible gold with galena and sphalerite in drill hole 25NED002.\n\nThe standout headline maker comes from drill hole 25NED002, where Aureka cut 1 metre at a scorching 65.37 grams per tonne gold from 116.2m. The interval includes a 0.3m slice carrying an eye-watering 109g/t gold – the highest individual assay the company has seen at Comstock to date. The same zone also returned almost half a metre grading 65.4g/t gold, underlining a robust high-grade component rather than a one-off spike.\n\nThese new assays form part of Aureka’s targeted drilling along the Comstock shear zone – the backbone structure controlling gold emplacement in the district. Mineralisation is tightly associated with quartz reefs carrying arsenopyrite, pyrite, galena and sphalerite, a classic sulphide-rich signature for the St Arnaud Goldfields. The company notes that all of the latest intercepts sit outside of the current resource footprint, pushing the known mineralised system outwards by as much as 100 metres and strengthening the case for a significant resource upgrade.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/adam-liaw-s-kingfish-ceviche-bowls-20251120-p5nh2t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Adam Liaw’s kingfish ceviche bowls",
    "publish_date": "Thu, 20 Nov 2025 12:47:05 +1100",
    "category": "finance",
    "authors": [
      "Adam Liaw"
    ],
    "text": "Step 1 Heat your oven to 180C fan-forced (200C conventional) and place the sweet potatoes directly on the racks of the oven. Roast for 50 minutes until tender, then allow to rest. Once cool, split open and scoop out the insides.\n\nStep 2 Combine the kingfish with the coriander, red onion, olive oil, lime juice and season well with salt.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/weatherald-and-doggett-to-debut-in-ashes-opener-20251120-p5nh2q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Weatherald and Doggett to debut for Australia in Ashes opener",
    "publish_date": "Thu, 20 Nov 2025 12:34:16 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "Perth: Jake Weatherald and Brendan Doggett will debut for Australia in the first Ashes Test in Perth.\n\nAustralia’s players were informed of the team ahead of their final training session on Thursday, according to two sources with knowledge of discussions.\n\nTasmania’s Jake Weatherald will debut for Australia. Credit: Getty Images\n\nWeatherald’s selection will mean Marnus Labuschagne bats at No.3 on his return to the Test team, while Cameron Green is expected to edge out Beau Webster as the all-rounder.\n\nSteve Smith will confirm the XI later on Thursday.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/stress-fractures-have-derailed-our-quicks-an-expert-reveals-how-to-diminish-them-20251119-p5ngq7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Stress fractures have derailed our quicks. An expert reveals how to diminish them",
    "publish_date": "Thu, 20 Nov 2025 12:15:45 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "As a spotlight is shone on Australia’s fast bowling, a leading physiotherapist has revealed how the next generation can be protected from a common plight.\n\nDr Kevin Sims, who spent 20 years working with Cricket Australia and Queensland Cricket, describes back stress fractures as a problem that cannot be avoided completely, due to the balancing act required to prepare for elite-level bowling while managing recovery times.\n\nCameron Green and speed demon Lance Morris have had surgery in the past year after repeated issues, with Green only returning to bowling on the eve of the Ashes series beginning on November 21.\n\nLance Morris, Cameron Green and Callum Vidler are three pacemen to suffer back stress fractures in the past 12 months. Credit: Getty\n\nQueensland teenage tearaway Callum Vidler is rehabilitating, but has not had surgery, having been earmarked for higher honours since his heroics at the 2024 under-19s One-Day World Cup.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/how-did-that-happen-the-data-behind-the-wallabies-dramatic-slide-20251120-p5ngxy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How did that happen? The data behind the Wallabies’ dramatic slide",
    "publish_date": "Thu, 20 Nov 2025 12:15:02 +1100",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "The Wallabies haven’t scored more than 19 points in a Test since racking up 24 against New Zealand in Auckland in the opening Bledisloe Cup clash. The points conceded has also blown out by an average of four a game, leaving an average losing margin of 10 points a game. With a struggling attack, tries have dried up, falling from 3.6 a Test to 1.7, and they’re also conceding an average of one more per Test. Most tellingly, the Wallabies’ ability to score points in the second half has drastically fallen away. Though far from ideal, Australia had developed a habit of giving up a big deficit in the first halves of many of their Tests earlier in the year, but then fought back late to either win or lose narrowly.\n\nBut that second-half capacity has almost evaporated. From an average of more than 15 second-half points in the opening eight Tests, the Wallabies have averaged less than five points in the Bledisloe Cup and on the spring tour. They didn’t score a single point in the second half against England. By contrast, their rivals have run up 98 second-half points at an averaged 16 a Test. Injuries and the unavailability of players have been factors, of course, with the Wallabies’ depth – and bench strength – eroded with key men being lost throughout the year. Star fullback Tom Wright was a big loss, and so too Tate McDermott. Jake Gordon’s injury was covered by Nic White until the veteran No.9 finally retired for good. Rob Valetini struggled with injury throughout the year.\n\nThe Wallabies cycled through multiple five-eighths, too, with Noah Lolesio lost early and Tom Lynagh also in and out of the squad. James O’Connor, Tane Edmed and Carter Gordon were also used. But the tendency of coach Joe Schmidt to routinely make changes also raised eyebrows. The Wallabies used the same 23-man squad in consecutive Tests just once all year – for the second and third Lions games. Like second-half points, Australia’s discipline was also an issue: they started well in that area before falling away. Having been a major problem in previous years, where penalty counts were stubbornly stuck above 10 a game in most Tests, the Australians appeared to have turned a corner in the three-match Lions series, where they conceded less than 10 penalties in two games. Then in South Africa, the Wallabies gave up only four and six penalties.\n\nIn the opening eight Tests, the Wallabies averaged 8.5 penalties a game. But in the six Tests since, that has grown to 11.5 a game, and double-figure counts in four of six games. Most crucially, perhaps, the Wallabies have had players sent from the field in the past six Tests. After not attracting a yellow card in their first seven matches (again a far cry from recent years where one per Test was standard), six yellow cards came in the next seven Tests. The Wallabies have also started making more mistakes – either making it more difficult to win, or putting nails in coffins. When it comes to unforced errors – which is a mistake not brought on by the opposition – the Wallabies were making an average of 4.7 in the opening eight Tests. That has risen to 6.6 a Test since the Wallabies headed to Eden Park hopeful of breaking their Bledisloe Cup drought.\n\nOne of the clear areas Australia have struggled in for much of the year, but particularly on the spring tour, is in the air. Though an increasingly common part of top-flight rugby, the attack-minded Wallabies have never been a world-leading team when it comes to contestable kicks; be it defusing them or successfully deploying them. But they hadn’t been known as one of the world’s worst, either. Until this year, that is. The Wallabies have struggled so much to “retain” contestable kicks – the stat covering the ability to either catch a high ball, clean up a spilled catch or force an error from a rival – they’re ranked second-last of the 10 Six Nations-Rugby Championships teams in 2025. Surprisingly, the All Blacks have the worst retention rate.\n\nBut the problem is now so acute for the Wallabies that teams are building game plans around contestable kicking. England kicked with good effect in downing the Wallabies at Twickenham, scoring two of four tries from high balls, while Ireland’s win was based on attacking Australia from the air. Loading The Wallabies’ aerial struggle is like a batsman who is known to dislike short-pitched bowling, and thus gets bounced almost every over. So perception plays a big part, and it’ll only change if the Wallabies turn off the retention tap for rivals. The difference can be seen in comparing the Wallabies’ first Test against the Lions and their loss to Ireland. In both games, their rivals sent up 15 contestable kicks. The Lions only managed to retain six of them, and thus dialled back the contestable kick tally to just three in the second Test. But the Irish remarkably retained all 15.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/nsw/why-everyone-is-getting-sick-in-november-20251120-p5ngyg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why everyone is getting sick in November",
    "publish_date": "Thu, 20 Nov 2025 12:06:03 +1100",
    "category": "lifestyle",
    "authors": [
      "Angus Thomson"
    ],
    "text": "Unseasonably high flu cases are leading to an uptick in visits to NSW emergency departments while COVID infections continue to increase heading into the festive period.\n\nInfluenza cases jumped 33 per cent in the first week of November and continued to circulate at higher-than-usual levels last week, the latest NSW Health respiratory surveillance data shows. Around 400 people visited NSW emergency departments with influenza-like illnesses last week.\n\nNSW is experiencing higher-than-usual flu cases in November. Credit: The Sydney Morning Herald\n\nNSW Health’s Dr Jeremy McAnulty said the total number of flu cases this year had been higher than recent years despite the winter flu season peaking lower.\n\n“It’s been quite unusual in that we’ve seen this extended period of flu throughout the season, extending … to where we are almost in summer,” McAnulty said. “Earlier this year we saw the not-unusual increase in summer from what, we believe, was people travelling, and it never went down as far as we’d like.”",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/fresh-off-a-dally-m-winning-season-roosters-captain-extends-deal-to-end-of-2027-20251120-p5ngzk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fresh off a Dally M-winning season, Roosters captain extends deal to end of 2027",
    "publish_date": "Thu, 20 Nov 2025 12:03:52 +1100",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Dual premiership winner and former NSW and Australia captain James Tedesco will remain at the Sydney Roosters through to the end of 2027.\n\nNews of Tedesco’s one-year extension came on Thursday, an hour before the skipper was to front the media alongside recruit, Daly Cherry-Evans.\n\nOne more year: James Tedesco will remain at the Sydney Roosters until the end of 2027. Credit: James Brickwood\n\nDespite turning 33 in January, Tedesco has never been in better form, and won the Dally M last season by a record margin.\n\nTedesco’s latest contract will take him through to a 10th season at Bondi Junction, having joined the club from Wests Tigers in 2018 after making his NRL debut in 2012.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/environment/elephant-hides-behind-tree-20251120-p5nh2d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Elephant hides behind tree",
    "publish_date": "Thu, 20 Nov 2025 12:03:18 +1100",
    "category": "finance",
    "authors": [],
    "text": "Elephant hides behind tree\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/environment/climate-change/australia-can-win-big-international-bids-when-it-wants-this-was-an-omnishambles-20251120-p5nh0r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia can win big international bids when it wants. This was an omnishambles",
    "publish_date": "Thu, 20 Nov 2025 12:01:48 +1100",
    "category": "finance",
    "authors": [
      "Nick O'Malley"
    ],
    "text": "Still, Bowen, looking grey and drawn, was determined to put a positive spin on a thorough diplomatic rout of Australia by Turkey.\n\nNot only that, the crucial leaders’ meeting that traditionally runs before or during the first days of those talks would also be held in Turkey. And as host, Turkey would appoint the COP president to run the event and manage the mechanics of the world’s key multilateral machine to combat climate change for the succeeding year, as the rules dictated.\n\nIt was after 10pm in Belem, Brazil, when Climate Change and Energy Minister Chris Bowen finally conceded publicly that, after a three-year campaign spanning the Pacific and the world for a role Australia believed was all but locked in, Turkey would host next year’s United Nations COP climate talks.\n\nAustralia’s goals in the bid, he said, were to elevate the concerns of the Pacific and to act in the nation’s best interests. To that end, he had secured an in-principle agreement that he would serve at the talks under the title of “president of negotiations”, with authority to set the negotiating agenda, appoint chairs and leads and prepare the draft decision text.\n\nA pre-COP meeting would be held in the Pacific, which Australia would use to browbeat participants to contribute to a Pacific Resilience Fund.\n\nThis is not nothing. Anyone who has watched UN climate negotiations up close knows the roles of those who drive them are powerful and significant. The Pacific will be devastated by Australia’s failure, but it will not turn down any finance that might be extracted at such a forum.\n\nBowen insists that had he not blinked, and had the meeting reverted to the UN climate headquarters in Bonne, the result would have been a rudderless meeting at which Australia and the Pacific had no control.\n\n“Some people will be disappointed in that outcome,” he said to reporters during a gap in ongoing negotiations in Belem.",
    "source": "TheAge",
    "cluster_id": 11
  },
  {
    "url": "https://au.news.yahoo.com/australia-not-giving-2026-climate-212810733.html",
    "title": "Australia backdown hands climate summit to Turkey",
    "publish_date": "2025-11-20T01:28:53Z",
    "category": "finance",
    "authors": [],
    "text": "Australia will not host the UN's annual climate summit in 2026, instead yielding to a rival bid from Turkey.\n\nThree years of campaigning to bring the COP31 climate talks to Adelaide, in partnership with Pacific nations, were dashed in last-gasp negotiations at the 2025 event in Brazil.\n\nWhile Australia had the overwhelming backing of the \"Western\" grouping to stage the 2026 event, under UN rules hosting rights are decided by consensus and negotiation, not a vote.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn a stand-off where Turkey was unwilling to cede ground, and with a deadline looming, Australia compromised by withdrawing its hopes to stage the event.\n\nClimate Change Minister Chris Bowen, Australia's representative at the COP talks, said an in-principle deal would see the summit go to Antalya, and Mr Bowen taking the role of COP negotiations president, with a lead-up event hosted in the Pacific.\n\nThe result is a diplomatic disaster for Prime Minister Anthony Albanese's government, which has spent great energy and, most likely, tens of millions of dollars campaigning for the event.\n\nMr Bowen flew into Belem insisting Australia remained committed to the bid, telling attendees on Tuesday \"we are in it to win it to the end, that's Australia's position\".\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAt the same time back home, Mr Albanese appeared to cool on the bid.\n\nAustralia's push was first launched at the climate talks in 2022.\n\nThe federal government championed the bid as a huge opportunity for Australia to both lead the world on emissions reductions, and secure \"the world's biggest clean energy trade fair\" to bring investment for Australian business.\n\nClimate Change Minister Chris Bowen will take on the role of COP negotiations president. (PR IMAGE PHOTO)\n\nDespite losing out on hosting rights Mr Albanese insisted the negotiated outcome was a \"big win\" for Australia.\n\n\"We will be the negotiator on climate policy globally over the next year and during the conference. That is a very worthwhile investment,\" he told the ABC on Thursday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Had we not put in bid for the COP that certainly wouldn't have occurred, and that will enable us to prioritise the issues that are confronting the Pacific, the very existence of countries like Tuvulu and Kiribati.\"\n\nMr Bowen said he kept Pacific hopes front and centre through the negotiations, with the compromise model including a \"pre-COP\" event in the Pacific which will act as a pledging event for a Pacific climate financing fund.\n\n\"Obviously, it would be great if Australia could have it all. But we can't have it all,\" he said on Thursday (AEDT).\n\nThe decision comes at a time of renewed focus on Australian energy and climate policy, given the Sussan Ley-led opposition's call to walk away from net zero.\n\nCritics of the bid, including Ms Ley, baulked at the likely cost of staging the summit, which had been estimated to cost at least hundreds of millions of dollars.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Turkey is doing the Australian government a big favour,\" she told the ABC on Thursday.\n\n\"We had a $12 billion deficit last year. We're heading to a $42 billion deficit this coming year, and meanwhile, this prime minister wants to spend $2 billion on hosting a talkfest here in this country?\"\n\nMr Albanese said only \"a small amount\" had been spent on the bid by the government, and South Australia, on campaigning and preparations.\n\n\"The amount that has been (spent) has been promoting Adelaide, of course, to the world, and it's been engaging with our priority about climate policy,\" he said.",
    "source": "Yahoo",
    "cluster_id": 11
  }
]