[
    {
        "url": "https://www.9news.com.au/national/interest-rates-rba-australia-savings/4d05cf8f-2ac6-4bdc-a2c8-5e3e75884f70",
        "title": "How much Aussie homeowners will save with a July rate cut",
        "publish_date": "Mon, 07 Jul 2025 01:26:32 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Mortgage holders are widely predicted to get more relief tomorrow, as the RBA makes its latest interest rate decision.\n\nWestpac, Commonwealth Bank and NAB ﻿are all predicting an interest rate cut after July's meeting, while ANZ is holding on to its forecast for a cut in August.\n\nIf the central bank moves to slash tomorrow, it will likely bring the ﻿cash rate down 25 basis points to 3.60 per cent.\n\nMortgage holders are widely predicted to get more relief tomorrow, as the RBA makes it's latest interest rate decision. (RENEE NOWYTARGER)\n\nSuch a cut will be welcomed by home owners who have been squeezed by the continuing hikes.﻿\n\nMoney.com.au has crunched the numbers to reveal how much Aussies could save on their monthly mortgage repayments.\n\nIf the 0.25 per cent July cut goes ahead as forecast, a borrower with a $600,000 mortgage could save an additional $90 a month, bringing their total monthly savings to $273 since the RBA began cutting rates.\n\nOwners with a $700,000 mortgage would save $106, while an extra $120 would be left in the bank for families with an $800,000 loan.﻿\n\nA borrower with a $1 million mortgage would save $150 a month from the July cut alone, bringing their total monthly savings to $456.\n\nThe savings are based on a starting home loan interest rate of 6.24 per cent, the average in February 2025, and a 25-year loan term.\n\nA borrower with a $1 million mortgage would save $150 a month from the July cut alone, bringing their total monthly savings to $456. (Peter Rae)\n\nMoney.com.au's Mortgage Expert, Debbie Hays, says a July rate cut would shift the dial for borrowers.\n\n\"Based on conversations we've had with borrowers, it's this third rate cut — the rule of three in action — that they believe will finally bring meaningful relief to their household budgets,\" Hays said\n\n\"After rate hikes in 2022 and 2023, and a sustained period of higher repayments, many are now watching closely to see if and when their lender passes on the cut in full,\" she says.\n\n\"It's an additional welcome boost at a time when people are receiving their tax returns — any extra breathing room in the budget is being gratefully received right now.\"\n\n\"For those still waiting to enter the property market, a third rate cut could boost their borrowing capacity by up to $50,000 — depending on the lender.\n\n\"While that might open the door to an extra bedroom or a more desirable suburb, it's also a double-edged sword, as it will fuel higher property prices and increased competition from other buyers with the same boost in borrowing power.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/darling-downs-zoo-queensland-update-woman-arm-injured-animal-bite/8e913db2-37d4-44d0-b0a6-2b07dd1b8318",
        "title": "Zoo won't 'punish' big cat after woman loses arm in attack",
        "publish_date": "Mon, 07 Jul 2025 01:08:00 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "A﻿ Queensland zoo has confirmed it won't euthanise an animal after a woman lost her arm when she was \"grabbed\" by a big cat yesterday.\n\nEmergency services were called to Darling Downs Zoo in Pilton, south of Toowoomba,﻿ about 8.23am after the woman in her 50s was attacked in an enclosure by one of the animals.\n\nThe woman, described by the zoo as a \"member of the family\", was watching keepers﻿ in the enclosure when one of the animals attacked.\n\nDarling Downs Zoo said it will remain closed todaya and plans to reopen tomorrow. (Nine)\n\nThe zoo did not say which animal attacked her, however investigators were seen paying close attention to a lion enclosure following the incident.\n\nIt is home to lions, cheetahs and a tiger, according to its website.\n\n\"The animal will definitely not be put down or punished in any way,\" Darling Downs Zoo said in a message shared to Facebook yesterday evening.\n\nIt also said the animal had not recently had cubs.\n\nThe zoo confirmed it will remain closed today ﻿and plans to reopen tomorrow.\n\nNationals leader David Littleproud﻿ said the attack would have been an \"enormous shock\" to fellow zoo staff.\n\nLittleproud said the woman had lost her arm in the incident.﻿\n\nHe also encouraged locals to continue to attend the much-loved animal park.\n\nThe zoo did not say which animal attacked her. (Nine)\n\n﻿\"I express my sincere condolences to the woman involved in the events that unfolded at Darling Downs Zoo,\" Littleproud said.\n\n\"This is a horrific incident. It is a tragedy and a shock to not just staff at the zoo, but the entire community.\"\n\nHe added: \"I encourage locals to continue to visit and enjoy the zoo, which will need support from the community during this difficult time.\"﻿\n\nThe zoo said the woman was﻿ a longtime member of the zoo \"family\".\n\nLittleproud said the woman had lost her arm in the incident.﻿ (9News)\n\n\"This is something that she has done many, many times over the past 20 years,\" the zoo said on Facebook.\n\n\"She is well versed in safety protocols around potentially dangerous animals.\n\n\"Inexplicably, at this stage, one animal grabbed her by one arm and caused severe damage to it.\"\n\n9News understands she was saved by the quick actions of an employee who used a belt to tie a tourniquet.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/stonehenge-bushmans-carnival-farm-angels-save-outback-rodeo-after-devastating-floods-western-queensland-floods-news/4a85ff4c-0df0-4ef1-b687-d501c0e2397d",
        "title": "This flood-hit community needed a miracle to save its rodeo. It found one",
        "publish_date": "Sat, 05 Jul 2025 21:02:58 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "It's the annual rodeo that puts the small farming community of Stonehenge, near Longreach in Western Queensland , on the map.\n\nWith no footy fields, no RSL, ﻿no library or town hall, the rodeo showgrounds are the community centre of Stonehenge.\n\nThe Stonehenge sign at the showgrounds was barely visible above water at the peak of the flood event earlier this year. (Supplied)\n\nCharmaine Batt, the secretary of the showgrounds and wife of cattle farmer David, said the rain caught the community off guard.\n\n\"I didn't think of the rodeo grounds straight away because we obviously had our own bit going on and watching the water run past our houses,\" she said.\n\n\"My husband flies a chopper so he got out as soon as he could and was just checking on people, making sure that people were safe.\n\n\"He had evacuated some neighbours into the closest town of Jundah, and then he continued on to help move what livestock he could to get them of out of the way of the river that just kept getting higher and higher.\n\n\"But then someone had actually flown over the showgrounds in their chopper and sent a photo and we were like, 'Oh my goodness, we've got more on our hands here'.\"\n\nWith the roads cut for weeks, Batt asked her husband to fly her into the showgrounds to see how much damage had been done.\n\nREAD MORE: ﻿ Millions of Australians relying on an inheritance to achieve major financial goals\n\nThe showgrounds are essentially the community centre. (Supplied)\n\nThe clean-up was a huge effort. (Supplied)\n\nShe said everything was caked in a thick layer of mud, including thousands of dollars' worth of catering equipment.﻿\n\nBut the thought of the rodeo being cancelled was heartbreaking.\n\n\"We rely on these events each year to connect and take a break from reality and just have a good weekend,\" Batt said.\n\n\"The kids are all keen to participate, they can ride a horse... ride a motorbike.\n\n\"The adults come together and we connect and have a laugh and support each other and not only that, but it brings a bit of economy to the town, and keeps the town alive.\n\n\"It was very important to us that it was revived.\"\n\nIn a community of only 50 people, who were all ﻿working to repair their own properties and livelihoods, it was going to take a miracle to get the showgrounds up and running in time for the rodeo in August.\n\nAnd on a trip to the nearby town of Jundah, Batt found one.﻿\n\nREAD MORE: Stinky town notices an improvement after expert sniffs out source of odour ﻿\n\nWhen the water subsided, the extent of the damage was revealed. (Supplied)\n\nMotorbike gymkhana is one of the rodeo's events for kids. (Supplied)\n\n\"I ran into a Farm Angels stall set up there helping all the locals... we were just chatting to them and they were checking on us, seeing if we were okay and what we needed,\" Batt said.\n\nIt wasn't long after that meeting that Farm Angels chief operating officer Jenny Gailey got in touch.\n\nFarm Angels, previously known as Drought Angels, is a national organisation ﻿that began as a grassroots effort to support local Chinchilla farmers impacted by drought in 2014.﻿\n\nThe organisation's key focus is supporting the mental health and wellbeing of farmers.\n\nBatt said Gailey organised 20 BlazeAid volunteers to help at a working bee with locals, shovelling mud and cleaning windows.\n\nShe then organised another charity, GivIt, to help with sourcing $20,000 worth of canteen equipment.\n\nFarm Angels also provided $5000 in cash to help the committee get the event up and running.\n\nCharmaine Batt, secretary of the Stonehenge showgrounds. (Supplied)\n\n\"We all think we can do it ourselves,\" Batt said.\n\n\"With these kinds of disasters, we're just sort of bracing ourselves to start fundraising, applying for grants and fixing things ourselves, and it was really a weight off our shoulders when she got in contact with us and said that she wanted to do everything she could.\n\n\"It's not just the financial side of things and the equipment, but just the fact that they're helping lift the whole community up in general, and she's always just a phone call away.\"\n\nFarm Angels founder Tash Johnston said the challenges facing farmers are complex.\n\n\"Our family farms are struggling to pay their bills and put food on their own tables,\" she told nine.com.au.\n\n\"The economic pressures, are mounting on them.\n\n\"There's a big push to move to regenerative farming and improving farming techniques, which many of them are really working on but at the same time, that costs money.\n\n\"When they're getting paid the same prices that they did back in 1973 for their beef and their grain and their milk, you know, it's hard for them to move to these practices.﻿\n\n\"These disasters are coming thicker and faster, in the current times, whether it's climate change or whether it's weather cycles, they are facing these challenges a lot closer together.\n\n\"We know this recovery is going to take them three to five years... so we stay with them, we'll continue supporting them, checking up on them.\"﻿\n\nFarm Angels founder Tash Johnston talking with farmers. (Supplied)\n\nShe said the best way to support Australian farmers was to buy Australian produce. ﻿\n\n\"We lose a farmer every 10 days to suicide in this country,\" Johnston said.\n\n\"We've got to do better.\"\n\nFarm Angels Flanno for a Farmer campaign is underway now.\n\nThe Stonehenge ﻿Bushman's Carnival is on August 15-17.\n\nReaders seeking support can contact Lifeline on 13 11 14 or beyond blue on 1300 22 4636.\n\nSuicide Call Back Service 1300 659 467.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/elon-musk-reveals-he-has-formed-new-political-party-the-america-party/91f36524-b88a-4193-844a-efa9e6242db4",
        "title": "Elon Musk declares formation of The America Party in latest Trump snub",
        "publish_date": "Sun, 06 Jul 2025 01:07:27 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "T﻿esla founder and billionaire Elon Musk has announced the name of his new political party: The America Party.\n\nThe South African-born tech entrepreneur has been vocal about his desire to create a third major political party to contest the Republican Party and Democratic Party in the United States.\n\n﻿After pilot-testing the name of his party with a poll on his platform X (formerly Twitter), Musk declared he has now formed The America Party.\n\nTesla CEO Elon Musk announced the formation of The America Party. (Getty)\n\n\"By a factor of 2 to 1, you want a new political party and you shall have it!\" Musk said.\n\n\"When it comes to bankrupting our country with waste & graft, we live in a one-party system, not a democracy.\n\n\"Today, the America Party is formed to give you back your freedom.\"\n\nMusk spoke about how he would bring his new US party into power in a post late last week on X.\n\n\"﻿One way to execute on this would be to laser-focus on just 2 or 3 Senate seats and 8 to 10 House districts,\" he said.\n\n\"Given the razor-thin legislative margins, that would be enough to serve as the deciding vote on contentious laws, ensuring they serve the true will of the people.\"\n\nMusk suggested his party could run during the 2026 midterm elections.\n\nPolitical parties in the US only need to be registered with the Federal Election Commission if they raise or spend money over a certain threshold.\n\nMusk spent hundreds of millions bankrolling Trump's second presidential election campaign. (Bloomberg via Getty Images)\n\nMusk spent US$277 million (approx. $422 million) of his own money ﻿in support of Donald Trump's 2024 election campaign.\n\nWithin months of Trump's re-election, relations soured between the president and the world's richest person.\n\n﻿Musk has publicly opposed Trump's 'Big, Beautiful Bill' which narrowly passed Senate last week and has critiqued the president's economic policy on X.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/trump-says-us-nears-trade-deals-tariff-effective-date-august-1/105502290",
        "title": "Trump administration's tariffs delayed until August 1",
        "publish_date": "Mon, 07 Jul 2025 02:06:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "The United States is close to finalising several trade agreements in the coming days and will notify other countries of higher tariff rates by July 9, US President Donald Trump says, with the higher rates scheduled to take effect on August 1.\n\nMr Trump and other top officials had flagged the August 1 date earlier, but it was unclear if all tariffs would increase then.\n\nAsked to clarify, Commerce Secretary Howard Lutnick told reporters the higher tariffs would take effect on August 1, but Mr Trump was \"setting the rates and the deals right now\".\n\nMr Trump in April announced a 10 per cent base tariff rate on most countries and additional duties ranging up to 50 per cent, although he later delayed the effective date for all but 10 per cent until July 9.\n\nThe new date offers countries a three-week reprieve.\n\nUS Treasury Secretary Scott Bessent told CNN's State of the Union earlier on Sunday (US time) that several big announcements of trade agreements could come in the next days, noting the European Union had made good progress in its talks.\n\nHe said Mr Trump would also send out letters to 100 smaller countries with whom the US does not have much trade, notifying them that they would face higher tariff rates first set on April 2 and then suspended until July 9.\n\n\"President Trump's going to be sending letters to some of our trading partners saying that if you don't move things along, then on August 1 you will boomerang back to your April 2 tariff level,\" Mr Bessent told CNN.\n\n\" So I think we're going to see a lot of deals very quickly. \"\n\nSince taking office, Mr Trump has set off a global trade war that has roiled financial markets and sent policymakers scrambling to guard their economies, including through deals with the US and other countries.\n\nWhite House economic council head Kevin Hassett told CBS's Face the Nation program there might be wiggle room for countries engaged in earnest negotiations.\n\n\"There are deadlines, and there are things that are close, and so maybe things will push back past the deadline,\" he said, adding that Mr Trump would decide if that could happen.\n\nIndia and the United States could make a final decision on a mini trade deal in the next 24 to 48 hours. (AP: Ben Curtis)\n\n'I hear good things'\n\nWhite House Council of Economic Advisers chairman Stephen Miran told ABC America that countries needed to make concessions to get lower tariff rates.\n\n\"I hear good things about the talks with Europe. I hear good things about the talks with India,\" Mr Miran said.\n\n\"And so I would expect that a number of countries that are in the process of making those concessions … might see their date rolled.\"\n\nMr Bessent told CNN the Trump administration was focused on 18 important trading partners that account for 95 per cent of the US trade deficit.\n\nBut he said there had been \"a lot of foot-dragging\" among countries in finalising trade deals.\n\nMr Trump has repeatedly said India is close to signing a deal and expressed hope that an agreement could be reached with the European Union, while casting doubt on a deal with Japan.\n\nThailand, keen to avert a 36 per cent tariff, is now offering greater market access for US farm and industrial goods and more purchases of US energy and Boeing jets, Finance Minister Pichai Chunhavajira told Bloomberg News.\n\nIndia and the United States are likely to make a final decision on a mini trade deal in the next 24 to 48 hours, local Indian news channel CNBC-TV18 reported on Sunday, with average tariffs on Indian goods shipped to the US to be 10per cent, it said.\n\nMr Hassett told CBS News that framework agreements already reached with Britain and Vietnam offered guidelines for other countries seeking trade deals.\n\nHe said Mr Trump's pressure was prompting countries to move production to the United States.\n\nMr Miran called the Vietnam deal \"fantastic\".\n\n\"It's extremely one-sided. We get to apply a significant tariff to Vietnamese exports,\" he said.\n\n\"They're opening their markets to ours, applying zero tariff to our exports.\"\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/shane-van-gisbergen-cruises-victory-nascar-chicago-street-race/105502182",
        "title": "Shane van Gisbergen cruises to victory at NASCAR Chicago Street Race",
        "publish_date": "Mon, 07 Jul 2025 01:59:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "It was hot in Chicago this week, but Shane van Gisbergen was even hotter.\n\nThe road course ace roared to the lead on Lake Shore Drive and ran away from the field in a nine-lap shootout, winning Sunday's third annual Grant Park 165, the NASCAR Cup Series' Chicago Street Race.\n\nThe Trackhouse Racing driver, who won Saturday's Xfinity Race and the Cup race's pole, got his number 88 Chevrolet past leader Chase Briscoe with 16 laps left and had a 2.5 second lead over Ty Gibbs before a caution on the final lap gave him his second win of 2025.\n\nThe victory was the Auckland, New Zealand native's third in 33 career starts and helped Chevrolet to sweep three victories in the streets of Chicago.\n\nHe started the weekend by winning the pole for the Sunday race. The 36-year-old Supercars champion then backed up his first career Cup victory in the Second City in 2023 by doing it again.\n\n\"What an amazing weekend for me,\" said van Gisbergen, who led 26 laps and dominated the series last month on Mexico City's road layout. \"We made no mistakes, and there were some really fast cars.\"\n\nVan Gisbergen said the weather was a problem.\n\n\"It was just so hot this weekend,\" he said. \"The track was very slick, and the times were a lot slower. The margin for error was very tiny. Just had to get it right.\"\n\nChevrolet was first to the checkered flag for the third time in the past five races.\n\nGibbs posted a season-best finish with the runner-up showing in his black Toyota.\n\n\"I feel like I wasn't free enough to hit my points,\" the number 54 Joe Gibbs Racing driver said. \"We had a good day overall just need to be faster.\"\n\nFollowing Gibbs were Tyler Reddick, Denny Hamlin and Kyle Busch.\n\nMichael McDowell led a race-high 31 laps but developed a stuck throttle midway through the race and finished 32nd.\n\nWith the entire Hendrick Motorsports stable starting at the rear of the 40-car field due to failed qualifying runs or repairs, four drivers holding play-off spots had to work to move through the field.\n\nAlex Bowman finished eighth, while Kyle Larson was 13th. Chase Elliott ended up 16th, and points leader William Byron came in last.\n\nIn what may have been NASCAR's final run in the Windy City's usually busy streets, race favourite van Gisbergen led the field from the pole position, but Row 1 starter McDowell snagged the lead in less than half a circuit.\n\nCarson Hocevar caused the first caution on Lap 4 when he bounced off the apron of Turn 10 and smacked the outside wall, coming to rest as seven cars, including Austin Dillon and Brad Keselowski, piled into Hocevar's number 77 car as it sat sideways against the outer barrier.\n\nWhile much of the field pitted, McDowell stayed on the 3.54 kilometre (2.2-mile) course, leading every circuit to beat Busch and Reddick for the top bonus points as Stage 1 ended at Lap 20.\n\nRyan Blaney put his number 12 Ford in position to claim 10 segment points as Stage 2 concluded on Lap 45. Briscoe, Reddick, Bowman and Bubba Wallace trailed the Team Penske driver.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/black-sabbath-final-show-ozzy-osbourne-metallica/105501962",
        "title": "Ozzy Osbourne and Black Sabbath pack out stadium for last-ever show",
        "publish_date": "Mon, 07 Jul 2025 01:53:14 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Hard-rock royalty and some 40,000 fans gathered for an ear-splitting tribute to Ozzy Osbourne at what the heavy metal icon says was his last-ever live performance.\n\nThe original line-up of Osbourne's band Black Sabbath performed at Villa Park soccer stadium in their home city of Birmingham, central England, on Saturday.\n\nThe 76-year-old singer, who has been diagnosed with Parkinson's disease, sang from a black throne that rose up from under the stage.\n\n\"Let the madness begin!\" he urged as he took the stage, and later paid tribute to fans.\n\n\"I don't know what to say, man, I've been laid up for like six years. You have no idea how I feel — thank you from the bottom of my heart,\" Osbourne said. \"You're all … special. Let's go crazy, come on.\"\n\nOsbourne performed several songs solo before being joined onstage, for the first time in 20 years, by Black Sabbath band mates Tony Iommi, Terence \"Geezer\" Butler and Bill Ward. The band ended a short set with Paranoid, one of their most famous songs.\n\nIt capped a day-long metal festival that included performances from the likes of Anthrax, Metallica and Guns N' Roses.\n\nFans around the world were able to join in on the celebration via a live stream that beamed the show into the homes of metalheads far and wide.\n\nEarly in the day, bands were given such short sets that they could play just one or two original songs, followed by a cover of an Ozzy Osbourne or Black Sabbath classic.\n\nAmong a cavalcade of highlights and guest appearances was a performance from a supergroup made up of heavy rock royalty including Billy Corgan, Sammy Hagar, Steven Tyler, Adam Jones, Vernon Reid, Tom Morello, Nuno Bettencourt, and a drum off between blink-182's Travis Barker, Red Hot Chili Peppers's Chad Smith, and Tool's Danny Carey.\n\nArtists who sent plaudits and well-wishes via video tributes included Jack Black, Dolly Parton, AC/DC, Cyndi Lauper, and Elton John.\n\n\" You are one of the most remarkable singers of our time,\" Elton John said. \"You are the king, you are the legend. \"\n\nActor Jason Momoa hosted the show, and didn't let that commitment stop him from getting amongst the action, jumping into the mosh pit at one stage to get the crowd riled up.\n\nOsbourne formed Black Sabbath in 1968 in Birmingham, a city then known for its heavy industry that became the crucible of the British metal scene.\n\nBlack Sabbath's devil imagery and thunderous sound made them one of the era's most influential — and parent-scaring — metal acts. Both the band and Osbourne as a solo artist have been inducted into the Rock & Roll Hall of Fame.\n\nOsbourne's fame expanded into the mainstream in the early 2000s when he joined his wife Sharon Osbourne, and two of their children, in the MTV reality TV show The Osbournes.\n\nHe has struggled with health issues since 2003 following a near-fatal quad bike crash. He revealed his Parkinson's in 2020 and paused touring in 2023 after spinal surgery.\n\n- AP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/warning-wind-energy-project-may-not-be-ready-by-coal-deadline/105464864",
        "title": "Wind energy developer warns WA project may not be ready by coal deadline",
        "publish_date": "Mon, 07 Jul 2025 01:00:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "A wind developer undergoing what it says is a \"marathon\" approval process says it may not be operational by the time Western Australia's coal-fired power stations are switched off.\n\nThe WA government has set a 2030 deadline for the wind-down of coal-fired power generation, and has backed onshore wind as a key part of the state's new electricity mix.\n\nProjects planned for southern WA include wind farms around West Arthur, Narrogin, Williams, Boddington and Scott River.\n\nHowever, many are yet to begin construction and a developer says the 2030 deadline may need to be extended to keep the lights on.\n\nIn Boddington, about 130 kilometres south of Perth, the companies behind the Marradong Wind Farm are yet to make a final investment decision.\n\nThe 45-turbine, 300-megawatt project is a collaboration between developers Wind with Purpose and Quenda Wind Power.\n\nThe latter is a subsidiary of Sumitomo Corporation, which partially owns the struggling Bluewaters Power Station in Collie.\n\nDevelopers say there's not much \"wiggle room\" in plans for a 300-megawatt wind farm to come online by 2029. (ABC South West: Jacqueline Lynch)\n\nQuenda business development head Daniel Kurz said meeting the state government's 2030 \"line in the sand\" would be challenging.\n\n\"A development process for a wind farm is not a sprint, it's definitely a marathon,\" Mr Kurz said.\n\nDaniel Kurz says setting up a wind farm in WA is a \"sprint not a marathon\". (ABC South West: Jacqueline Lynch)\n\nWind with Purpose chief executive Chris Kearney said while the project was currently on track to be operational by 2029, there was not much wiggle room.\n\n\"If we don't hit our targets for getting this project online, and likewise if Western Power don't have the infrastructure to connect these projects, then the reality is coal-fired power plants may have to stay online a few years longer than planned,\" he said.\n\n\" We all want to electrify and decarbonise, but nobody wants blackouts. \"\n\nChris Kearney says he expects coal will stay online longer if wind developers cannot get projects up in time. (ABC South West: Jacqueline Lynch)\n\nExtra transmission needed\n\nThe Marradong Wind Farm would use existing power infrastructure in the area.\n\nBut 100km down the road, RES Australia's wind farm — more than twice the size of the Marradong project with 110 turbines — would rely on transmission infrastructure being upgraded.\n\nOnce operational, the project in Dardadine, 197km south-east of Perth, would generate enough electricity to power up to 450,000 homes.\n\nIt is also yet to progress beyond the consultation and assessment stage.\n\nDevelopment director Greg Wilkinson said construction should start by 2028, with a view to being fully operational by the end of 2031.\n\nBut he said if the project went ahead and the power infrastructure was ready, he was willing to bring it forward.\n\n\"We're working with Western Power and Powering WA to ensure that we can get this project up and powering WA homes as soon as we can,\" Mr Wilkinson said.\n\nMany of WA's wind projects are still in the early stages. (ABC South West: Jacqueline Lynch)\n\nThe Clean Energy Council's Chris O'Keefe said a lack of transmission lines was a sticking point for the industry.\n\n\"The WA government needs to build 250 kilometres of new transmission lines,\" he said.\n\n\"[Otherwise] we might have a situation where we're generating two or three gigawatts of onshore wind, yet there's not enough transmission to get it to the places where it needs to get to.\"\n\nWind farms on land will be a big part of WA's energy mix into the future. (Supplied: Flat Rocks Wind Farm)\n\nGovernment promises expansion\n\nThe Cook government's latest budget included $584.3 million to be spent on network upgrades and the expansion of the Clean Energy Link.\n\nIt has also promised to set up transmission manufacturing hubs in Perth and the South West.\n\nThe WA government said it was not relying on a controversial, federally backed offshore wind project to be ready by 2030.\n\nBut Energy Minister Amber-Jade Sanderson said onshore wind would be \"critical\" heading into 2030.\n\n\"We do support a sensible mix of renewable energy and big battery storage … [and] we will still continue to need gas as a firming fuel as we exit coal,\" she said.\n\nAmber-Jade Sanderson says the state isn't relying on wind off the coast to reach its 2030 transition target. (ABC News: Daryna Zadvirna)\n\n\" We are confident we can meet the time frame for 2030 and maintain reliability and security of the energy system. \"\n\nMs Sanderson said she would work with proponents on what was needed.\n\nHowever, Mr O'Keefe said he was worried work was not happening quickly enough.\n\n\"They need to crack on with that if that 2030 target is to be met.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/lightweight-ct-scanners-could-transform-remote-healthcare/105494218",
        "title": "Lightweight CT scanners could transform remote healthcare",
        "publish_date": "Mon, 07 Jul 2025 00:45:08 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Sue Carroll has seen some grim things in her time as a bush nurse.\n\nHead injuries and skull fractures are among the worst and need treatment fast.\n\nMs Carroll is the nurse manager at Swifts Creek Bush Nursing Centre, almost 400 kilometres from Melbourne's hospitals — where many of the most serious patients must go either by road or by helicopter.\n\nSerious injuries often require CT scans to determine the extent of the damage and the treatments needed.\n\nBut not all hospitals can do this, which is why patients from remote areas are transferred to major cities.\n\n\"Time is critical, so you need them moved immediately,\" Ms Carroll said.\n\nHowever, Australian researchers are working on a first-of-its-kind mobile CT scanner that aims to provide more timely access to scans for people living in rural and remote areas.\n\nSue Carroll says mobile CT scanners may be useful in rural and remote areas. (Supplied: Sue Carroll)\n\nLighter, mobile medical technology\n\nMonash University's Design Health Collab is leading the design of the new CT scanners, alongside medical technology developer Micro-X and Johns Hopkins University in the United States.\n\nThe work is still in the early stages of development.\n\nThe team is designing the new scanners to be compact.\n\nTheir aim is a final weight of 225 kilograms — far less than conventional CT scanners that weigh 2 tonnes.\n\nThis means the technology could easily be fitted to smaller vehicles, unlike current mobile CT scanners that are installed onboard trucks.\n\nThe team hopes the system can also provide full-body scans and be used for general diagnostic imaging for things like abdominal pain, chest pain, head injuries, or neurological symptoms, cancer follow-ups, and trauma assessments.\n\nA visualisation of a new CT scanner in a vehicle. (Supplied: Monash University)\n\nIf everything goes according to plan, the mobile scanners could be used in several ways, including on-call in a similar way to ambulances, or by moving through regional towns on a schedule to provide regular, routine opportunities for healthcare.\n\nMs Carroll said she would still opt to send patients to a hospital in emergencies, so they could receive surgery as soon as possible.\n\nBut she could see a use for the mobile CT scanners if they visited communities on a regular basis in a similar way to the breast screening bus, to help reduce wait times for patients needing preventative or diagnostic scans.\n\n\"That sort of thing would work, if you knew they were coming into the area … to be able to book ahead,\" Ms Carroll said.\n\n'Postcode lottery' of rural health\n\nFor now, the team behind the lightweight scanners has received a grant from the US Advanced Research Projects Agency for Health (ARPA-H), allowing the compact CT scanners to be built and rolled out across rural communities in the US from 2029.\n\nDesign Health Collab project lead Nyein Chan Aung hoped the technology could one day be roaming Australia's roads too.\n\nNyein Chan Aung is confident the CT scanners can be brought to Australia's roads. (Supplied: Monash University, James HH Morgan)\n\n\"We're actively seeking partners and funding sources for Australia,\" he said.\n\n\"While this project is US-focused, the tech and learnings are applicable to Australia as we also face geographic and access challenges.\n\n\"We will likely also need adaptations to the Australian context, to respond to nuances in Australian aged care, rural health, or possibly a combined response of diagnostic and emergency needs.\"\n\nDr Aung said the new technology could bring hospital-level medical imaging to underserviced areas, beating the \"postcode lottery\".\n\n\"When it comes to rural communities there's just not enough services out there,\" he said.\n\n\"Seven million Australians live in rural or remote areas, and … stroke patients outside the big city areas often have to wait three to six hours longer to receive any sort of imaging, which essentially reduces all chances of having a good recovery.\n\n\"I think this is a very effective solution to very quickly meet the needs of people who just aren't getting any help.\"\n\nDesigned to be used by generalists\n\nDr Aung added that just 15 per cent of radiologists and 17 per cent of medical imaging technologists operated outside metropolitan areas, making it even more difficult for rural Australians to access imaging.\n\nCrucially, clinicians without specialist imaging skills will be able to use the scanners.\n\nWhile they would receive some additional training, Dr Aung said the operators would be generalists.\n\n\"The thing we're working on is a complete rethinking of how the CT should be — we're rebuilding it,\" he said.\n\nSaving time\n\nRay Gallagher is president of the Omeo District Football Netball League, not far from Swifts Creek.\n\nHe said he had \"seen some bad knocks\" in his time at the league, with players taken away by ambulance after a rough game.\n\nRural life also comes with its risks.\n\n\"We've got a new bike track at Omeo, they have the rodeo up there, we have picnic races, skiers, dirt bike riders,\" he said.\n\n\"There are lots of people trying hard to hurt themselves.\"\n\nMr Gallagher also supported a mobile CT scanner for rural communities on a routine basis to save people from making long road trips for preventative care.\n\nHe would like to see them incorporated into heli-med services for emergency situations to get patients scanned and evaluated quickly.\n\n\"Anything that makes things safer for people in our area or any area is a good thing,\" he said.\n\nThe Australian Society of Medical Imaging and Radiation Therapy has been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/woman-surgery-lion-attack-darling-downs-zoo/105501832",
        "title": "Woman who lost arm in lion attack at Queensland zoo to undergo surgery",
        "publish_date": "Mon, 07 Jul 2025 00:44:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "A woman who was bitten by a lion at a zoo west of Brisbane is set to undergo further surgery.\n\nThe woman in her 50s suffered a severe injury while watching keepers working in the carnivore enclosure at the Darling Downs Zoo, south of Toowoomba, on Sunday.\n\nEmergency services were called to the zoo around 8:30am and the woman was transported to Brisbane's Princess Alexandra Hospital in a stable condition.\n\nQueensland Health Minister Tim Nicholls said the woman had lost her arm and was \"recovering well\" in hospital.\n\nWoman was watching keepers at work when she was bitten by lion Photo shows lions lying down It's understood the woman lost an arm after the incident at the Darling Downs Zoo near Toowoomba.\n\nZoo owner Steve Robinson said he had not yet spoken to the woman, but would provide an update once she had undergone surgery.\n\nIn a statement, Darling Downs Zoo said the woman was well versed in safety protocols around potentially dangerous animals.\n\n\"This is something that she has done many, many times over the past 20 years,\" it said.\n\n\" Inexplicably, at this stage, one animal grabbed her by one arm and caused severe damage to it. \"\n\nThe statement said the animal involved would \"definitely not be put down or punished in any way\".\n\nIncident a 'tragedy and shock'\n\nA spokesperson for Workplace Health and Safety Queensland said its inspectors were investigating.\n\nDarling Downs Zoo said it was working with authorities to establish how the incident occurred.\n\n\"We are extremely grateful to the QAS, QPS and LifeFlight for their prompt attendance and to all of the people and organisations who have rallied round us with messages of support,\" the statement said.\n\nInvestigations into the incident are ongoing. (ABC News)\n\nDarling Downs Zoo was closed on Sunday and is expected to reopen on Tuesday.\n\nThe zoo, which is a two-hour drive from Brisbane, is home to several species of big cats including lions, tigers and leopards.\n\nMaranoa MP David Littleproud said the attack would have been an enormous shock to staff at the \"much-loved animal park\".\n\n\"This is a horrific incident,\" Mr Littleproud said.\n\n\" It is a tragedy and a shock to not just staff at the zoo, but the entire community. \"\n\nThe business, which is spread across a 48-hectare property on the Darling Downs, was listed for sale for around $6 million in 2023 but was taken off the market last year.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/racing-suspended-queensland-greyhound-track-the-q/105501470",
        "title": "Greyhound racing suspended at Queensland track due to unsafe conditions",
        "publish_date": "Mon, 07 Jul 2025 00:30:55 +0000",
        "category": "sports",
        "authors": [],
        "text": "Races at Queensland's new greyhound track The Q have been suspended after the track was deemed \"unsuitable for racing\".\n\nIt comes as the new $85 million facility grapples with a string of dog deaths since trials began at the track in March.\n\nThe Queensland Greyhound Racing Club (QGRC) said a watering issue was identified prior to trials being conducted ahead of scheduled races for Saturday's Brisbane Cup.\n\nIn a statement, it said teams worked to resolve the issue to allow the Brisbane Cup to go ahead, but the event was later cancelled midway.\n\nRacing Queensland says the cancelled events will be rescheduled for this weekend.\n\nRacing Queensland released a statement saying the Q2 track was unsafe for racing and events would be rescheduled.\n\n\"The decision to postpone Saturday's feature meeting was made after the Q2 Parklands track was deemed unsuitable for racing,\" the statement said.\n\nRacing Queensland said it would complete a refurbishment of the track and a new field would be drawn for the postponed event.\n\n\"A final decision on whether the rescheduled meeting will proceed will be made after the refurbishments are completed including an independent assessment of the track.\"\n\nThe postponed Brisbane Cup will take place on Saturday.\n\nThe $85 million venue is a collaboration between state government-owned Racing Queensland and local clubs.\n\nGovernment 'getting to the bottom' of issue\n\nThe venue, which is a collaboration between state government-owned Racing Queensland and local clubs, has a one-turn, two-turn and straight racing tracks.\n\nThe Queensland government put $44.15 million from the racing infrastructure fund towards the $85 million facility.\n\nThe Brisbane and Ipswich greyhound clubs have both relocated to the venue.\n\nLast month, the ABC revealed at least seven dogs had died due to injuries sustained at the racing track before its official opening.\n\nCoalition for the Protection of Greyhounds president Amy McMahon, the former Greens member for South Brisbane, said it was worrying that races went ahead on Saturday, despite concerns over the state of the track.\n\nCoalition for the Protection of Greyhounds president Amy MacMahon has raised concerns about the track. (ABC News: Dean Caton)\n\n\"We know that trainers were raising the alarm about The Q prior to the weekend — we had written to the minister that there are issues at The Q that needed to be attended to,\" she told ABC Radio Brisbane.\n\n\"They already knew on Friday that the track was unsafe … but they went ahead with at least two races on Saturday.\"\n\nActivists call for better transparency on 'racing-related deaths' Photo shows A racing greyhound highlighted mid-race. Animal welfare activists are concerned the \"true breadth of racing-related deaths\" in the greyhound industry are unknown.\n\nPremier David Crisafulli said he had spoken with the Minister for Sport and Racing Tim Mander, adding that greyhound racing is vital to \"who we are as Queenslanders\".\n\n\"The minister is asking the right questions,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/nrl-rugby-league-disability-annual-naidoc-round/105486088",
        "title": "Inside the game that's 'not just a sport, it's a community'",
        "publish_date": "Sun, 06 Jul 2025 23:30:45 +0000",
        "category": "sports",
        "authors": [],
        "text": "It's a cliché, but sport really was the winner in the annual Combined Indigenous All Stars versus All Stars Physical Disability Rugby League fixture.\n\nWhile the rules may be different, the action on the field at Redfern Oval on Sunday was every bit recognisable as rugby league.\n\nThere were length-of-the-field tries, chip-and-chase kicks, and big-hit tackles.\n\nThe Combined Indigenous All Stars players were hoping to hold the shield for an unprecedented third straight year.\n\nAustralia will host the Physical Disability Rugby League's second World Cup next year. (ABC News: Geoff Kemp)\n\nBill Bussell is a proud Yorta Yorta and Wiradjuri man who also lives with cerebral palsy.\n\n\"It feels deadly. It makes you feel good about yourself and you make new friends, like we are a big family now,\" he said.\n\nBill is one of the most respected players in the game with over 100 PDRL appearances to his name.\n\nYorta Yorta and Wiradjuri man Bill Bussell has more than 100 PDRL appearances to his name. (ABC News: Geoff Kemp)\n\nDoctors told Bill's mother, Kay, that he would never walk, talk or live past the age of 10.\n\nYet the player affectionately known as \"Bunyip\" by his teammates recently celebrated his 48th birthday.\n\nThe phrase \"one big family\" is used by just about anyone who plays, coaches, or watches the NSWPDRL.\n\n\"It's not just a sport, it's a community and that's what I'm probably most proud about,\" NSWPDRL founder George Tonna said.\n\nBill Bustle in training for the annual Indigenous vs All Stars Physical Disability Rugby League game. (ABC News: Geoff Kemp)\n\nStrength in culture\n\nThe Combined Indigenous All Stars versus PDRL All Stars fixture is a centrepiece of the PDRL season and is played at the start of NAIDOC week.\n\nThe Indigenous team is made up of Aboriginal and Torres Strait Islander players, as well as Indigenous peoples from New Zealand and the Pacific.\n\nTodd Dorward is a Kullilli man living on Dharug country and has been a stalwart of the Indigenous side over the past decade.\n\nA prolific artist who is visually impaired and deaf, Todd designed the Indigenous side's jersey worn in the fixture since 2023.\n\n\"It's very special, I can't describe it in words really,\" he said.\n\nArtist Todd Dorward designed the team's jersey for the NAIDOC event. (ABC News: Kris Flanders)\n\nTodd said the NAIDOC fixture gave him a chance to practise his culture on and off the field.\n\n\"Smoking ceremonies welcome people to country, and to cleanse ourselves of bad spirits,\" he said.\n\n\"And it lets the ancestors know that we're conducting formal events.\"\n\nTodd Dorward warms up for the game. (ABC News: Geoff Kemp)\n\nNow playing with the Roosters, Todd has played for multiple clubs and represented Australia since he started the sport in 2015.\n\nA talented multi-sport athlete, Todd's living room is filled with medals and trophies for football, cricket, and rugby league.\n\n\"I can't see why anything should stop anyone with a disability from playing rugby league or any sport in any manner,\" he said.\n\nTodd Dorward is proud to represent the Roosters and his culture. (ABC News: Geoff Kemp)\n\nRapid growth in the game\n\nGeorge Tonna knows the transformative power of playing rugby league for people living with a physical disability.\n\n\"It's saving lives,\" he said.\n\nA former player let him know the impact the game had on them.\n\n\"He approached me and said, 'Thanks for organising because it saved my life.'\n\n\" I see the [positive] change in individuals and that's what makes me so humble that I was there at the start and to see the growth is just unbelievable. \"\n\nAs a lifelong South Sydney fan, he wanted to be able to play the game he was passionate about and not just watch from the sidelines.\n\nSince first established in 2010, the PDRL has grown from a few mates on a paddock to a four-team league backed by the NRL.\n\nGeorge Tonna in a training session for the NAIDOC game. (AB News: Geoff Kemp)\n\nAustralia has a national PDRL side that has played in international tournaments.\n\nThe PDRL includes eight of the 10 impairment classifications used at the Paralympics.\n\nBut where this code differs is that athletes in different classifications all play at the same time.\n\n\"All different disabilities [have to] fit in on the same field,\" George said.\n\n\"So we came up with the concept of [players wearing] black shorts as tackle and red shorts as touch.\"\n\nFumbles or dropped balls are counted as a tackle rather than a knock-on, and there are no scrums in this competition.\n\nPlaying time is shorter with 20-minute halves.\n\nNext generation\n\nIn 2026, Australia will host the second PDRL World Cup.\n\nNSWPDRL is also working with the Gold Coast Titans to develop a State of Origin series featuring NSW and Queensland, which has been a dream since the competition started.\n\nGeorge believed the sport's strong community and a well-established competition would set up the next generation of players.\n\n\"I can't play forever, so we need the young fellas to keep the game going for years to come,\" he said.\n\nOne of those new faces is Wiradjuri teen Rowen Grooms.\n\nRowen Grooms is a more recent member of the Combined Indigenous All Stars. (ABC News: Geoff Kemp)\n\nThe 14-year-old lives with 22q11.2 deletion syndrome, which can cause heart abnormalities and developmental delays.\n\nRowen was never really interested in rugby league until he discovered the PDRL.\n\nNow he owns a football, which he kicks around with his grandfather, and watches games on television by his side.\n\nHis grandmother, Denise Grooms, saw his confidence soar.\n\n\"In his first game, the others were all so encouraging and letting him know what to do, and he scored a try,\" she said.\n\n\"I have to say we are very proud grandparents as we watch him take the field to either train or play.\n\n\" To see him running and throwing a ball with a smile is second to none. \"\n\nOn Sunday, the PDRL All Stars reclaimed the shield — and bragging rights — with a 26–4 victory.\n\nFor Todd Dorward, the game was about more than just the scoreboard.\n\n\"It's all about feeling proud of who you are and where you come from, and being with your people and culture,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/halls-creek-no-football-oval-for-second-season-as-works-delayed/105494768",
        "title": "Outback town that produced AFL stars left with no oval for second season",
        "publish_date": "Sun, 06 Jul 2025 23:00:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "One of outback Australia's most talent-laden footballing communities has been left without a safe football ground for a second consecutive season.\n\nHalls Creek, 3,000 kilometres north-east of Perth, is home to 3,600 people and has produced more than 10 AFL and AFLW footballers over the past decade.\n\nScouts have flocked to the town's rough-and-tumble oval, where players like Shane McAdam (Melbourne), Jy Farrar (Gold Coast), Ash Johnson (Collingwood) and Sam Petrevski-Seton (Carlton/West Coast) got their first taste of football.\n\nHalls Creek's oval remains unsafe amid delays to critical works. (Supplied: Shire of Halls Creek)\n\nBut after months of delays to planned works, the oval remains unsafe for football.\n\nIn a statement posted to the Shire of Halls Creek's Facebook page, chief executive Sue Leonard acknowledged the news was disappointing.\n\n\"Due to the unfinished nature of the work, the oval cannot be used safely in any capacity,\" she said.\n\n\"We acknowledge the delay is a significant setback for local footy teams, junior sports and many community members who rely on the oval as a central gathering and recreation space.\n\n\"We want to reassure the public that the project has not been abandoned.\n\n\"We are actively exploring all options to move the works forward.\"\n\nThe oval reconstruction works have stalled since this photo was taken in February. (Supplied: Shire of Halls Creek)\n\nLocal community saddened\n\nThe local competition split from the wider East Kimberley Football League in 2023 due to the staggering travel distances local clubs faced.\n\nBut the delays have made it hard for the fledgling South East Kimberley Football League to get up and running.\n\nThe local competition remains a source of pride, fun and community connection in a region facing immense social challenges.\n\nDennis Chungulla says local football is critical for the community. (ABC Kimberley: Ted O'Connor)\n\nDennis Chungulla coaches the Yardgee Dockers, one of two teams based in Halls Creek, and said the prospect of another year with limited footy was very disappointing.\n\nDespite past violent incidents during matches, he said the games were important \"family events\".\n\n\"The footballers are upset,\" he said.\n\n\" Football is the main thing for families, sitting down and watching their kids playing on the weekend, bringing joy and happiness to young people. \"\n\nFamilies used to enjoy spending time together watching football in Halls Creek. (ABC Kimberley: Ted O'Connor)\n\nHalls Creek Hawks president Trish Mackay said the delay had seen players drift away from the community.\n\n\"Some might have gone to Fitzroy [Crossing], some have definitely gone to teams in Kununurra,\" she said.\n\n\" Because they all love their football and they … just wanted to keep playing. \"\n\nSport also provides an important outlet for local youths, with Mr Chungulla often bringing in young players considered \"at risk\" in the wider community.\n\nHe said he was increasingly concerned about the impact another year without regular organised football would have.\n\n\"Without activities like these, you have kids roaming around the streets,\" Mr Chungulla said.\n\nMs Mackay said those who remained were desperate for footy to return.\n\n\"I've always got to answer: 'Look at the oval, you can't play on that, so we've got no football,'\" she said.\n\n\"Football is a big part of their lives.\"\n\nMany young people in Halls Creek dream of becoming AFL players. (ABC Kimberley: Giulia Bertoglio)\n\nHelp needed to keep competition alive\n\nMr Chungulla would like to be on the sidelines cheering the players on with their families as soon as possible, but he is not sure when the oval will be ready to host Australian Rules games again.\n\n\"It's been two years and we don't know what's going on,\" he said.\n\n\"We'd like to see something moving forward.\"\n\nSupporters travelled several hours to see their beloved Halls Creek Hawks win the 2022 grand final. (Supplied: Timbee Photography)\n\nMr Chungulla said the delay meant Halls Creek, Yardgee and other community teams would need help getting the competition up and running again.\n\nIn a social media statement, the Halls Creek Shire said it was engaging with the contractor — the second one since the works started — and could not provide any further details.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/tour-de-france-van-der-poel-beats-pogacar-stage-2-takes-yellow/105501420",
        "title": "Mathieu van der Poel takes Tour de France yellow jersey with stage two sprint",
        "publish_date": "Sun, 06 Jul 2025 22:57:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "Dutch cyclist Mathieu van der Poel won the hilly second stage of the Tour de France on Sunday after holding off defending champion Tadej Pogačar and two-time winner Jonas Vingegaard in a sprint to the line.\n\nVan der Poel took the race leader's yellow jersey from his Alpecin–Deceuninck teammate Jasper Philipsen in a second career stage victory on the Tour.\n\nNeither rider is considered an overall contender.\n\n\"It was super difficult, the finale was harder than I thought. But I was really motivated,\" Van der Poel said.\n\n\"Finally, four years after my first [stage] win, it was about time I took a second one. It's also the second time I'm rewarded with the yellow jersey as well, so I guess it was worth the wait.\"\n\nHe intends to wear yellow a little longer yet.\n\n\"I hope I can keep the jersey until the time trial [on Wednesday],\" Van der Poel said.\n\n\"[After that] it will be very hard.\"\n\nStage two was delayed by about 15 minutes after team buses arrived late to their parking spots because of heavy morning rain.\n\nFans lined the roads wearing raincoats and riders wore light jackets amid wet and blustery conditions on the slightly hilly 209 kilometre (130 mile) trek from Lauwin-Planque to Boulogne-sur-Mer in northern France.\n\nThe longest trek of this year's race featured about 4 kilometres of climbing suited to all-rounders like the three-time Paris-Roubaix classic winner Van der Poel and former cyclo-cross star Wout van Aert.\n\nGreasy roads increased the risk of spills and a strong headwind greeted riders approaching the finish as they took on the day's three consecutive climbs — short and sharp but very modest ones compared to the giant Alpine and Pyrenean ascents later in the three-week race.\n\nNone of the main Tour contenders could launch a decisive attack, although Vingegaard tried with 5 kilometres left.\n\nInstead, it was Van der Poel — nicknamed \"The Flying Dutchman\" — who surged clear and then withstood Pogačar's late burst, having also beaten the Slovenian star at Paris-Roubaix in April.\n\nVan der Poel crossed the line in 4 hours, 45 minutes, 41 seconds with Pogačar in second place and Vingegaard in third recording the same time.\n\nPogačar misjudged his attack, a rare mistake for him.\n\n\"Mathieu was stronger in the final sprint, so chapeau to him,\" Pogačar said.\n\n\"To be honest I messed up a little bit, because I got a bit scared to sprint against him and I waited too long on his wheel.\"\n\nIn the overall standings, Pogačar is four seconds behind Van der Poel.\n\nVingegaard is another two seconds back.\n\nJack Haig was the best of the Australians, finishing 31 seconds back in 36th.\n\nBen O'Connor remains the best-placed Australian overall, in 10th position, 41 seconds off the lead.\n\nFour-time Spanish Vuelta winner Primož Roglič — the 2020 Tour runner-up from Slovenia — and double Olympic champion Remco Evenepoel had both lost time on Saturday after being caught in a late crosswind.\n\nThey did not lose further time Sunday to Pogačar and Vingegaard, who enters this year's Tour in better shape.\n\nLast year, the Dane had barely recovered from a heavy race crash in Spain that left him with a collapsed lung, several broken ribs and a broken collarbone.\n\nHe finished the Tour in second place but could not match Pogačar in big climbs.\n\nThe 30-year-old Van der Poel was born in Belgium and shot to fame as a multiple cyclo-cross world champion before turning his sights to one-day classics and stage racing.\n\nCycling runs in the family.\n\nHis father Adri was also a cyclo-cross world champion and Van der Poel's maternal grandfather was the late French cyclist Raymond Poulidor.\n\nPoulidor took part in 14 Tours from 1962-76, finishing in second place overall three times and third five times.\n\nNicknamed \"Poupou\" and \"The Eternal Runner-up,\" Poulidor was adored by French fans.\n\nStage three is a flat stage for sprinters, 178.3 kilometres from Valenciennes to the coastal city of Dunkerque.\n\nThis race is entirely in France, with no stages held abroad as in previous years, and ends July 27 in Paris.\n\nAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/state-of-origin-game-iii-kick-off-team-lists/105472662",
        "title": "Ready for State of Origin Game III? Here's what to know ahead of kick-off",
        "publish_date": "Sun, 06 Jul 2025 22:24:46 +0000",
        "category": "sports",
        "authors": [],
        "text": "The State of Origin series is still anyone's game as we head into a blockbuster decider.\n\nAfter the Maroons' hard-fought win in Perth, all eyes are now on Sydney to see who will lift the shield.\n\nWill New South Wales win consecutive series for the first time since 2019, or will Queensland cinch another underdog victory?\n\nHere's everything you need to know ahead of the match.\n\nWhen is State of Origin Game III?\n\nGame III will be played on Wednesday, July 9.\n\nHere's the exact time the game will start in each time zone:\n\n8.05pm AEST\n\n7.35pm ACST\n\n6.05pm AWST\n\nWhere is Game III being played?\n\nGame III will be played at Stadium Australia in Sydney.\n\nHere, the Blues are hoping to leverage the home-field advantage.\n\nOf the 32 games played here, New South Wales has won 20.\n\nOne ended in a draw.\n\nNew South Wales is hoping to claim a win on home soil in Game III. (AAP: Dave Hunt )\n\nWhere can I watch the match?\n\nIt's being broadcast on Channel Nine.\n\nYou'll also be able to watch it on Nine's streaming platform 9Now.\n\nBecause Nine has the exclusive rights to the matches, you won't be able to watch the game on other streaming platforms like Kayo or Fox.\n\nYou can listen to coverage of the match on ABC Radio via the ABC listen app.\n\nABC Sport will live blog the match on the ABC News website.\n\nWho is playing?\n\nMaroons name Broncos 'bolter' for Origin decider Photo shows Composite image of Gehamat Shibasaki and Josh Papali'i. Gehamat Shibasaki is selected to debut in State of Origin III, while Josh Papali'i will make his first appearance for the Maroons since 2022.\n\nAfter a serious foot injury saw fullback Kalyn Ponga ruled out of the decider, the Maroons squad has undergone quite the reshuffle.\n\nCoach Billy Slater opted for a bolter, naming Brisbane Broncos journeyman Gehamat Shibasaki at centre.\n\nVeteran prop Josh Papali'i and Reece Walsh were also recalled.\n\nNew South Wales coach Laurie Daley kept the same blueprint from Game II for his squad, backing Brian To'o to recover from a knee injury in time to play.\n\nHere are the full squads for both sides:\n\nNew South Wales Queensland Dylan Edwards 1 Hamiso Tabuai-Fidow Brian To’o 2 Xavier Coates Stephen Crichton 3 Robert Toia Latrell Mitchell 4 Gehamat Shibasaki Zac Lomax 5 Valentine Holmes Jarome Luai 6 Cameron Munster (c) Nathan Cleary 7 Tom Dearden Max King 8 Josh Papalii Reece Robson 9 Harry Grant Payne Haas 10 Tino Fa'asuamaleaui Liam Martin 11 Reuben Cotter Angus Crichton 12 Kurt Capewell Isaah Yeo (c) 13 Trent Loiero Connor Watson 14 Kurt Mann Spencer Leniu 15 Lindsay Collins Hudson Young 16 Patrick Carrigan Stefano Utoikamanu 17 Jeremiah Nanai Jacob Kiraz 18 Reece Walsh Lindsay Smith 19 J'maine Hopgood Bradman Best 20 Josh Kerr\n\nWhat about the Women's State of Origin?\n\nThe series has already wrapped up.\n\nThe NSW Blues won two of the three women's matches this year. (AAP: Dan Himbrechts)\n\nNew South Wales claimed victory, having won two of the three games.\n\nHere are the scores from each match:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/wimbledon-controversy-electronic-line-system-off-during-match/105501314",
        "title": "Pavlyuchenkova fumes as Wimbledon technology fails, 37yo German storms into quarters",
        "publish_date": "Sun, 06 Jul 2025 22:12:51 +0000",
        "category": "sports",
        "authors": [],
        "text": "Wimbledon's move to electronic line calls has raised the ire of Anastasia Pavlyuchenkova after the Russian lost a key point because the system was \"deactivated\".\n\nA ball that clearly landed long in her Centre Court match against Sonay Kartal was not called out on Sunday because the electronic system that replaced line judges this year was shut off.\n\nAnd, because the replay review procedure that used to be in place also has been scrapped, the chair umpire called for a replay of the point at 4-all in the first set — much to the dismay of Pavlyuchenkova, the player who would have won the game if the proper call had been made originally.\n\nPavlyuchenkova wound up getting broken there to trail Britain's Kartal, but she eventually did manage to come back to win the match 7-6 (3), 6-4 and reach the Wimbledon quarterfinals for the first time since 2016.Wimbledon organisers have apologised after the electronic line-calling system on centre court was turned off in error and missed three calls in a single game.\n\nOrganisers have apologised to the players involved and say they continue to have full confidence in the accuracy of the technology. But on court, after the incident, Pavlyuchenkova was not happy.\n\n\"You took the game away from me,\" 2021 French Open runner-up Pavlyuchenkova told chair umpire Nico Helwerth at the changeover after the game ended.\n\nPavlyuchenkova, who is Russian, also said in the moment that the decision-making there went in Kartal's favour because she is a local player.\n\nAt her news conference, Pavlyuchenkova said Helwerth told her following the match that he did think Kartal's shot landed out.\n\n\"I think he felt bad, a little bit,\" Pavlyuchenkova said.\n\n\"He probably felt like he should have taken the initiative and called it out.\"\n\nShe also said Helwerth \"probably was scared to take such a big decision\".\n\nPavlyuchenkova was serving and had a game point when Kartal hit a backhand that landed beyond the opposite baseline, TV replays showed.\n\nBut there was no sound of one of the recorded voices being used for the first time at Wimbledon to reflect when the technology being used in place of human officials determines that a ball landed out.\n\nAnastasia Pavlyuchenkova missed out on a key point because the electronic line system was switched off. (Getty Images: Visionhaus)\n\nAt least Pavlyuchenkova could joke about the whole episode later.\n\nAsked how she would have felt about it had she lost the match, Pavlyuchenkova responded with a laugh: \"I would just say that I hate Wimbledon and never come back.\"\n\nShe also cracked that chair umpires are \"very good at giving fines and code violations\" and never miss those, but perhaps it would be beneficial if they did a better job of noticing mistaken calls.\n\nKartal said she couldn't see where her shot went.\n\n\"That situation is a rarity. I don't think it's really ever happened — if it has. It's tough. What can you do? The umpire's trying his best in that situation, and he handled it fine,\" Kartal said.\n\nThompson retires from Wimbledon mid-match with injury Photo shows Jordan Thompson of Australia leans on the net Australian Jordan Thompson retires from his round-of-16 match at Wimbledon against Taylor Fritz with a back injury, while Cruz Hewitt wins his first match in the Wimbledon junior singles.\n\n\"I think the system just malfunctioned a little bit, and the fairest way was what he did: replay the point.\"\n\nHelwerth delayed play while he made a phone call from his stand.\n\nEventually, play resumed, Pavlyuchenkova missed a forehand on the replay, then lost the game a few points later.\n\nThe explanation offered by an All England Club spokesman: \"Due to operator error, the system was deactivated on the point in question. The chair umpire followed the established process.\"\n\nThe French Open is now the only grand slam tournament that still uses line judges instead of electronic calls.\n\nFrom 2007 through last year, players were allowed to challenge in-or-out calls at Wimbledon; a video review was employed to decide whether a line judge's — or chair umpire's — ruling was correct.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThat challenge system was removed for the current tournament, but there immediately were demands on social media from some tennis fans or observers to bring that back to aid chair umpires.\n\nPavlyuchenkova agreed, saying: \"We should probably look into something else to have better decisions.\"\n\nVeteran Siegemund through to quarters\n\nMeanwhile seasoned German Laura Siegemund, the oldest woman left in the Wimbledon singles draw, ended the remarkable run of Argentine lucky loser Solana Sierra with a 6-3, 6-2 victory to storm into the quarterfinals.\n\nSiegemund's reward for her own heroics at the grass-court grand slam was a clash with top seed Aryna Sabalenka and the 37-year-old said she was heading into that match with a risk-free approach in the hope of reaching her first major semi-final.\n\n\"I haven't thought much about it yet. She's one of the greatest players that we have and one of the most aggressive also,\" Siegemund said.\n\n\"The only good thing about that match is that I have absolutely nothing to lose. But it's definitely one of the toughest opponents I think to have on grass.\"\n\nAP/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/asx-markets-business-news-live-updates/105501326",
        "title": "Live: ASX cautious before RBA rates decision and end of tariff pause",
        "publish_date": "Sun, 06 Jul 2025 21:26:40 +0000",
        "category": "finance",
        "authors": [
            "Stephanie Chalmers",
            "Stephen Letts",
            "Michael Janda",
            "Business Correspondent David Taylor"
        ],
        "text": "The ASX is priced for a flat opening with little guidance coming from Wall Street which was closed for US Independence Day festivities.\n\nEuropean markets traded on Friday and were generally softer, while the UK's FTSE closed flat.\n\nWith little in the rear vision to fret about, investors will be looking at the road ahead which is far from straight forward with the 90-day pause on the \"'liberation day\" tariffs set to expire on Wednesday.\n\nThe US deadline to its trading partners (and the penguins of the Heard and McDonald Islands) has yet to produce much in the way of meaningful action.\n\nWill there be a flurry of deals signed before July 9? Maybe, maybe not.\n\nAnd is it even a deadline, given the tariff hikes for any deal holdouts won't kick in until August 1.\n\nEuropean markets didn't seem overly confident of anything positive happening, with stocks across the region down around 0.8% on Friday.\n\nWall Street futures are somewhat glum too — the S & P 500 and Dow futures are down 0.6% for this evening's session and the Nasdaq is down a tick more.\n\nCommodities traded through the July 4 holiday with oil slipping 0.7% on expectations OPEC+ would announcing another output increase.\n\nThe cartel duly delivered a larger than expected supply increase of 548,000 barrels a day on Saturday, which is likely to weigh on oil prices when trading resumes this morning\n\nGold gained 0.3% largely thanks to a weaker US dollar and iron ore edged higher.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/federal-politics-live-blog-july-7/105501256",
        "title": "Live: Indigenous Australians minister says 'now is time' to take steps on truth-telling",
        "publish_date": "Sun, 06 Jul 2025 21:24:16 +0000",
        "category": "finance",
        "authors": [
            "Courtney Gould",
            "Romy Stephens"
        ],
        "text": "The Reserve Bank is widely tipped to drop interest rates by a quarter of a percentage point to 3.6 per cent on Tuesday, and all big four banks are now forecasting a quarter of a percentage point cut to the cash rate.\n\nAccording to interest rate comparison website Mozo, this means owner-occupier borrowers with a $500,000 mortgage could save $76 a month, or $918 over a year, on their home loan repayments.\n\nThis is based on the average variable home loan rate of 6.15 per cent per annum in the Mozo database for owner-occupiers, paying principal and interest with an 80 per cent loan-to-value ratio.\n\nEconomists say lower inflation and gathering global economic storm clouds are supporting the case for a Tuesday interest rate cut.\n\n\"It looks like a no-brainer that the Reserve Bank's going to cut the cash rate again at its July board meeting,\" AMP deputy chief economist Diana Mousina said.\n\nThe Reserve Bank will announce its decision on interest rates Tuesday at 2:30pm AEST.\n\nRead more from the ABC's business correspondent David Taylor at the link below.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/griffin-coal-mine-debt-bluewaters-power/105492506",
        "title": "Troubled WA coal mine falls $800m further into debt",
        "publish_date": "Sun, 06 Jul 2025 21:22:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "A key foreign-owned WA coal mine has fallen almost a billion dollars further into debt, even as the government prepares to pour more money into the insolvent company.\n\nGriffin Coal has been propped up by WA taxpayers since 2022 when the company was placed into receivership, amid fears its collapse could place the Perth and South-West electricity system at risk of blackouts and jeopardise hundreds of local jobs.\n\nThe company's biggest customer is Bluewaters Power — a coal-fired generator with capacity to supply about seven per cent of the grid's needs.\n\nAfter initially providing $40 million in support, the following year Premier Roger Cook announced a $220 million lifeline would be extended to Griffin Coal, describing it as payments \"we just need to make\".\n\nThis year's state budget contains provision for up to another $49 million for the company, taking the total bill to $308 million.\n\nThe Bluewaters facility is about five kilometres from Collie. (Supplied: Sumitomo)\n\n\"We just want the parties to sort themselves out so that they can get on and mine coal at a commercial rate, and that people can produce power at a commercial rate,\" Premier Roger Cook told budget estimates on Thursday.\n\n\"Quite frankly, the fact that the parties haven't been able to come to an agreement is a disgrace.\"\n\nShadow energy minister Steve Thomas didn't take to that argument kindly.\n\n‘A brutal solution’: Premier defends propping up failing coal mine with $220m Photo shows Roger Cook likes sideways outside state parliament. The WA government has extended its financial support propping up the stricken Griffin Coal mine south of Perth to protect the state's electricity supplies.\n\n\"How dare the premier attack the two companies that have been left to pick up the pieces of years of government mismanagement,\" he said.\n\n\"The government's so-called solution to the problem is a joke because the price that Griffin Coal needs to become viable is the same price that bankrupts Bluewaters Power.\n\n\"If there was a commercial solution available, the government has had a decade to deliver it and save that $300 million.\"\n\nBluewaters' future is so uncertain as a result of those tensions that when the independent Australian Energy Market Operator (AEMO) published its 10-year outlook last week, it assumed Bluewaters would be unavailable from mid-2027.\n\nThe Griffin Coal mine near Collie. (ABC News: Gian De Poloni)\n\nIt said that was due to the risk of Griffin being unable to supply coal once its government support ends.\n\nAEMO said while energy capacity would be \"largely balanced\" until mid-2027, \"there is a need for further investment\" beyond that point, in part because of the issues at Bluewaters.\n\n'No solution'\n\nThe depth of Griffin's difficulty was further highlighted in answer to questions asked by Dr Thomas, which show the company's debts have now reached $2.4 billion — some $800 million higher than a liquidator reported in 2022.\n\nMost of that debt — some $1.9 billion — is owed to ICICI Bank, India's biggest private bank.\n\nOther secured creditors are the Export Import Bank of India ($146 million), the Bank of Baroda ($144 million) and India Overseas Bank ($115 million).\n\nSteve Thomas says the situation came down to \"government mismanagement\". (ABC Great Southern: Mark Bennett)\n\n\"The government's put [more than] a quarter of a billion dollars into a company that will still be dead at the end of the process and taxpayers will be no better off,\" Dr Thomas said.\n\n\"That [money] should have refinanced and put new administration into Griffin Coal so that it could continue to supply Bluewaters, at least for the next 5-10 years.\n\n\"That would have been a better investment because it would have left the state with a viable asset at the end, rather than simply throwing a quarter of a billion dollars down a black hole that ultimately still results in the failure of the companies and the power system.\"\n\nA spokesperson for Griffin said: “The receivers and managers are actively engaging with customers, government, unions and other stakeholders on a commercial solution for Griffin Coal beyond 30 June 2026.”\n\nDecisions need to made now\n\nIndependent corporate analyst Peter Strachan agreed that, in hindsight, it could have been better for the state government to have purchased Griffin when it was sold to its current owners.\n\n\"From the state's point of view it was a fraught deal because these are critical assets, critical to the state of Western Australia,\" he said.\n\nWith that option well and truly in the past though, Mr Strachan said pouring in money to keep it running was one of few options.\n\nThe clock is ticking as the 2030 coal phase-out commitment approaches. (ABC News: Daniel Mercer)\n\n\"The state's got no option but to do that, or they could close it down and just import coal,\" he said — something the government did in late 2022.\n\nWith coal on its way out of the energy grid as the rise of renewables continues, Mr Strachan said time was of the essence.\n\n\"These are decisions that have to be made now, because if they're wanting to close the coal-fired power stations down by 2030, the clock is ticking,\" Mr Strachan said.\n\n2026 deadline\n\nDr Thomas's questions also revealed $13.5 million of the government's money had been paid directly to those secured creditors under a 'business continuation agreement'.\n\n\"The government's focus is on ensuring the continued operation of the mine to 30 June 2026,\" Mr Cook said in answer to those questions.\n\nBluewaters Power provides about seven per cent of the grid's needs. (ABC News: Kenith Png)\n\n\"The government entered into a business continuation agreement with the secured creditors and the receivers and managers to ensure the continued support of the secured creditors for this period.\n\n\"The [agreement] provides performance-based payments to the secured creditors, linked to the continued operation of the mine.\"\n\nMr Cook said those payments to secured creditors could reach $31.5 million by mid-2026.\n\nHe told estimates the current support regime would not continue beyond mid-2026.\n\nWA Premier Roger Cook says the government won't be funding Griffin beyond next year. (ABC News: Kenith Png)\n\n\"If the parties related reach a commercial decision in relation to the way that the Griffin mine and the Bluewaters power station function, well then we'll consider any proposals from that point,\" Mr Cook said.\n\n\"But we've made it quite clear that we will not be funding the arrangements beyond the June 30, 2026.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/australian-picture-books-could-boost-neurodivergent-kids/105476406",
        "title": "Our autistic child is 'magic-brained'. These books help her remember that",
        "publish_date": "Sun, 06 Jul 2025 21:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "\"Mumma, what kind of brain do I have?\"\n\nMy five-year old daughter, days after a final appointment for her autism assessment, wanted to know the results.\n\nHer dad and I sat her down to tell her that she is autistic with ADHD — or, magic brained, as we also call it in this house.\n\nEveryone reading this will know at least one neurodivergent person, even if that individual isn't aware that their atypical ways of being and challenges in life meet the criteria for a medical diagnosis. Around 5.5 million Australians live with disability, and it is estimated that neurodivergent folks make up between 15 and 20 per cent of Australia's population.\n\nThere is a lot of information on offer when your child is assessed for a neurodevelopmental disorder, but very little of it deals with how to help your child develop a positive identity and sense of self.\n\nUS Secretary of Health RFK Junior has told the world that \"autism destroys families\" and \"is an individual tragedy\".\n\nAutistic and ADHD folks often celebrate a diagnosis with cake, as my family did. (Supplied: Danielle Cahill)\n\nOur family ignored Kennedy's harmful words. We marked our daughter's diagnosis with a cake, as is customary in autistic culture.\n\nBut what can parents like me do to help our kids develop a healthy self-image? And how can their peers be encouraged to meet these differences with curiosity?\n\nHere's what's in Australia's new national autism strategy Photo shows A graphic showing a young boy looking up at an illustration of a brain England, the US and Canada are among the countries with national autism strategies — and now Australia has one too.\n\nFor younger children, experts say picture books about being neurodivergent can help develop a better understanding of their identity and a more positive sense of self.\n\nAll Brains Are Different, written and published by autism charity the Yellow Ladybugs, is the latest in a series of Australian picture books about neurodivergence.\n\nOther recent children's titles on the topic include Bernie Thinks in Boxes by Jess Horn, The Rainbow Brain by Sandhya Menon and Love Me, Love My ADHD by Chrissie Davies.\n\nThe real power of picture books about neurodivergence is when they are read by neurotypical children who directly learn and engage with difference via reading, according to clinical psychologist Professor Adam Guastella.\n\n\"If picture books can increase education to children about what it means to have different brains, it encourages a more inclusive and accepting schoolyard,\" he says.\n\nHaving to focus on deficits\n\nWhat often complicates the development of a positive sense of self for neurodivergent children is that, in order to obtain support through school, focus is often on a child's deficits.\n\n\"And these systems that are set up are constantly asking us to tell them what our kids can't do and so we get into a system where we are constantly emphasising their needs, the problems, the things they can't do, as a way to get support,\" Professor Guastella says.\n\nProfessor Guastella says receiving support is often predicated on a deficits-based diagnosis. (ABC News: Jade Macmillan)\n\nHis work includes developing assessments for neurodevelopmental conditions like autism to include looking at a child's strengths as well as their diagnosis.\n\n\"There's no reason why we shouldn't have a narrative that includes both and is also truly reflective of the reality of the situation for each child.\n\n\"But we have got into a habit, and it's a habit that's been generated by the systems of constantly focusing on the deficits,\" he said.\n\nYellow Ladybugs CEO Katie Koullas, who is one of the authors of All Brains Are Different, says she hopes neurodivergent children and their families feel seen on the pages of her book, which she believes can help neutralise the current polarising public discussions around neurodivergence.\n\n\"We're trying to change that script and say, 'Actually, there's a world that we can create that will celebrate all difference.' We shouldn't be subscribing to this fear that other people are pushing.\n\n\"If we can get in early to the younger generation before these kind of really outdated and backward and dinosaur approaches are learnt, then we can change the narrative,\" she said.\n\nKatie Koullas says picture books can help neurotypical children view their neurodivergent peers with curiosity. (Joanne Flessas from Venus & Rose Photography)\n\nRepresentation is crucial to fostering empathy and understanding, according to Gumbaynggirr woman Dr Lilly Brown who is CEO of the Indigenous publishing house Magabala.\n\nShe said, for Indigenous Australians, \"So much of the negative and inaccurate representation is really based on the dehumanisation of First Nations people.\n\n\"I'm sure a lot of neurodivergent folks understand this as well.\"\n\nLilly Brown says it's important for Indigenous Australian children to see themselves in picture books. (Supplied by Magabala)\n\nDr Brown says that while her publishing house doesn't currently publish a picture book on neurodivergence, it's only a matter of time as younger Indigenous folks who are interested in intersectionality and creating cultural works come to the fore.\n\n\"I talk to educators about this and, if you can create something that's going to be accessible to a First Nations neurodivergent person, then that resource or book or whatever is going to be accessible to everyone,\" she says.\n\nPicture books help parents just as much\n\nPicture books often mirror society and, for families, reading them is a way to accept and acknowledge a diagnosis, according to Jo Pentony, Victorian president of the Children's Book Council of Australia.\n\nThe picture books and titles for young adults bring \"what was once hidden out into the open\", Ms Pentony says.\n\nBooks to diversify your bookshelf Photo shows An illustration from a kid's book featuring a young black girl with big hair standing in front of a sun When kids are exposed to broader stories and narratives through books the effect is profound, writes RN's Namila Benson.\n\n\"The picture book, just like the conversation, does mean the more it's talked about, the more it's normalised,\" she says.\n\nBooks about neurodivergent folks written by Australians are particularly important for young readers who can see themselves represented in familiar settings.\n\n\"But if we're seeing ourselves in those stories, it's easy to see ourselves in our own environments as well, which tends to be what an Australian author and illustrator brings to their work,\" Pentony says.\n\nMy daughter now reaches for these Australian picture books at the end of a hard day. And the stories show her that there are others who understand how she feels.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/underground-miner-launches-legal-action-against-anglo-coal/105469850",
        "title": "Underground coal miner sues Anglo after 'traumatic' explosions",
        "publish_date": "Sun, 06 Jul 2025 20:51:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "A former underground coal miner who escaped a major explosion and watched his colleagues emerge severely burnt is suing Anglo Coal for more than $1 million in damages.\n\nRyan Martin was working as a supervisor at Grosvenor Coal Mine near Moranbah in central Queensland in May 2020 when an underground methane gas explosion seriously injured five workers.\n\nThe 35-year-old has filed a claim for compensation in the Supreme Court in Rockhampton against the mine's operator, Anglo Coal, for his suffering of post-traumatic stress disorder after two separate blasts at the same mine in four years.\n\nMr Martin was also working underground when an evacuation was ordered due to a \"shock wave\" incident a month after the initial blast.\n\nRyan Martin has lodged a claim for damages against Anglo Coal. (Supplied: Ryan Martin)\n\nDuring the first explosion he saw his colleagues with melted helmets screaming in pain and helped by filling up bottles of water to pour over them.\n\nHe said it was \"extremely confronting\" and \"ingrained\" in his head.\n\n\"I've never seen burns that severe before … to the point of nearly a full body burn,\" Mr Martin said.\n\n\"Their face was not their face anymore. Hands, back, chest, the whole lot.\n\n\" One of the blokes had clothes nearly burnt completely off him. To see all that, it's a sight and smell very hard to get out of your head. \"\n\nFive workers were seriously injured in the explosion at Grosvenor Coal Mine in May 2020. (ABC News: Jemima Burt)\n\nAn inquiry into the incident found the mine's gas drainage systems could not cope with the rate of production and coal mine workers were repeatedly subject to an unacceptable level of risk.\n\nMr Martin alleges management pressured him to go back to work underground in the following weeks until another evacuation was ordered a month later when a shock wave went through the pit.\n\n\"I feel like they did put production over safety,\" he said.\n\nThis painting of the five injured Grosvenor workers by an unknown artist hangs in the Moranbah hospital. (Supplied: Mackay Hospital and Health Service)\n\nFollowing a second explosion at the same mine last year Mr Martin decided to leave the industry permanently.\n\nHe was on shift at the time but not underground.\n\n\"That was definitely the straw that broke the camel's back in aiding my decision to end up pulling the pin from the mining industry,\" he said.\n\n\"It's not that I don't want to, I don't think I can.\"\n\nLoading...\n\nMr Martin said he had been diagnosed with post-traumatic stress disorder, severe depression, anxiety, and has regular appointments with a psychiatrist and psychologist.\n\n\"It's been tough. The nightmares were at the start. My sleep, it's basically non-existent now,\" he said.\n\nMr Martin's lawyer Paul Zapata said Anglo should have learnt from its mistakes in 2020 and described the latest explosion as \"gobsmacking\".\n\nPaul Zapata says his client didn't feel safe returning to work following the latest mine explosion last year. (Supplied: Shine Lawyers)\n\n\"To see it happen again, some four years later, it was just enough for Ryan to lose complete faith and trust that he was going to be safe,\" Mr Zapata said.\n\n\"Predominantly [the claim] is about his income loss in the future. He's going to have to try and now reinvent himself.\n\n\"Underground mining is very dangerous and the safety of workers should be paramount.\"\n\nMr Martin has worked at mines in the Bowen Basin since he was 18 and is now pursuing certifications to work on civil construction sites.\n\nRyan Martin says he suffers post traumatic stress disorder, severe depression and anxiety following the explosions. (Supplied: Ryan Martin)\n\nIn a statement, a spokesperson for Anglo American said the company was unable to comment on individual cases due to legal and privacy considerations.\n\n\"The health, safety and wellbeing of workers is always top priority,\" they said.\n\n\"We take that responsibility seriously and we are committed to ensuring a safe and supportive working environment for our people.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-07/akash-puts-england-in-deep-trouble-as-india-levels-test-series/105501236",
        "title": "Deep inspires India to series-tying win over England in second Test",
        "publish_date": "Sun, 06 Jul 2025 20:36:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "So much for India being in trouble without Jasprit Bumrah.\n\nWith the team's star pace bowler given a rest, Akash Deep — Bumrah's replacement — was the unlikely inspiration behind India's dominant, series-tying 336-run win over England on day five of the second Test at Edgbaston on Sunday.\n\nEngland vs India Men's cricket Test series 1st Test at Headingley: England wins by 5 wickets\n\n2nd Test at Edgbaston: India wins by 336 runs\n\n3rd Test at Lords (July 10-14)\n\n4th Test at Old Trafford (July 23-27)\n\n5th Test at The Oval (July 31-August 4) Series tied at 1-1\n\nDeep claimed the first five-wicket haul of his short Test career, removing four of the top five in England's batting order and then top scorer Jamie Smith (88) on the way to claiming figures of 6-99. He had match figures of 10-187.\n\nFittingly, the victory was clinched off the bowling of Deep, with tailender Brydon Carse scooping a catch to India captain Shubman Gill just before tea.\n\nGill was the tourists' other star performer, making 269 in the first innings and 161 in the second innings in a record-setting performance that has supercharged his first series as Test captain.\n\nSet a world-record target of 608, England started the final day on 3-72 with a draw its only realistic hope and was bowled out for 271 as India sealed a first win at Edgbaston in nine attempts.\n\nIt levelled the five-match series at 1-1 heading into the third Test at Lord's starting on Thursday.\n\nIndia recovered well after a tough defeat at Headingley last week, when England chased down 371 on day five.\n\nBumrah was left out to preserve his fitness but Deep was a more-than-able deputy.\n\nAt age 28, he is a late bloomer — certainly at Test level where he has played just eight matches since his debut in February last year — but looks the part already with his nagging line and length.\n\nSurely he will retain his spot at the home of cricket.\n\n\"He bowled with so much heart and the areas and the lengths he hit, he was just getting the ball to move both ways,\" Gill said.\n\n\"He was just magnificent for us.\"\n\nAsked if Bumrah would be back for the third Test, Gill replied: \"Definitely.\"\n\nGill is in the form of his life, racking up 430 runs in this match — second all-time for a total by one player in a Test — to go with a knock of 147 in the first test.\n\n\"I'd say I'm feeling comfortable with my game,\" Gill said with a smile.\n\n\"Hopefully with my contribution, India will be able to win this series. That would be a great achievement for us.\"\n\nEngland captain Ben Stokes pointed to the failure to get the Indians out cheaply in the first innings after reducing them to 5-211 as the key part of the match.\n\nIndia went on to post 587 all out and never looked back.\n\n\"We ran in, we tried everything, we changed plans, we manoeuvred it when we could,\" Stokes said.\n\n\"But when a team is on top of you — and India is a class team — it is always hard to wrestle the momentum back.\n\n\"The opposition is full of world-class performers. It's a tough one.\"\n\nWhile Bumrah will be returning for India, the quick turnaround is likely to see England turn to injury-prone quick Jofra Archer for his first Test match since February 2021.\n\nGus Atkinson could even return from injury, too, after being added to the squad for Lord's.\n\nPlay started one hour and 40 minutes late on Sunday because of early-morning rain and a resultant wet outfield.\n\nIt reduced the number of overs available to the Indians to 80 and they made immediate inroads thanks to Deep, who had bowled Ben Duckett and Joe Root late on Saturday.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nGetting good seam movement and help from the cracks on the pitch, Deep sent in a delivery to Pope (24) that the batter gloved down and onto his stumps.\n\nIn Deep's next over, Brook (23) was trapped LBW by a ball that jagged back off the seam. England failed with a review and was 5-83.\n\nDeep had figures of 4-58 by the time he was taken out of the attack, leaving Stokes and Smith to face a stern examination against left-arm spinner Ravindra Jadeja, who was turning the ball sharply out of the rough.\n\nAnother spinner, Washington Sundar, was given a bowl before lunch and he got the key wicket of Stokes in the final over of the session, trapping the England captain LBW for 33.\n\nSmith, who made 184 not out in the first innings, offered more resistance but was running out of partners and decided to go on the attack.\n\nThe wicketkeeper hit back-to-back sixes off Deep before — off the very next delivery — going for another off a slow ball and holing out to Sundar on the boundary behind square leg.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/whack-a-mole-comparative-advantage-is-being-redefined-by-trump-s-trade-war-20250707-p5mczh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Whack a mole: Comparative advantage is being redefined by Trump’s trade war",
        "publish_date": "Mon, 07 Jul 2025 12:16:17 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "“So, we’re going to start sending letters out to various countries starting tomorrow. They’ll range in value from maybe 60 or 70 per cent tariffs to 10 and 20 per cent tariffs,” he said. Loading “It’s a lot of money for our country, but we’re giving them a bargain,” he said, continuing to demonstrate his ignorance of the way tariffs work. Tariffs are paid when goods are landed in the US by the importer – they’re paid for by US companies, which may absorb some of the cost or pass some or all of it onto consumers. They are a tax on domestic consumption. If the tariff rates are going to range from 10 per cent to 70 per cent they will create massive arbitrage opportunities.\n\nCountries that were uncompetitive in a regime where the average US tariff was about 2.5 per cent are suddenly going to be very competitive if their rate is 10 per cent and their competitors are being hit with tariffs that are multiples of that level. The hotchpotch of tariffs that the Trump administration envisages will create chaos within the global trading system and the supply chains that support it, along with opportunities and threats for individual economies. It will also be an administrative nightmare for US customs. The US is aware that its differential tariffs could lead to attempts to game the regime and is particularly concerned that China might do what it did during the 2018-19 trade war, during Trump’s first term as president, when many Chinese exports to the US were re-routed through other Asian countries and Mexico. In the deal the administration announced with Vietnam, where it reduced the reciprocal tariff rate from 46 per cent to 20 per cent, it added a caveat. The rate will become 40 per cent on any goods or components that have been transhipped from another country. It’s seeking to impose similar, China-targeting, clauses in deals with its other major trading partners, along with other restrictions on their ability to trade with China. Given that China is also a major trading partner for most other economies, the US’ attempt to isolate China is likely to experience significant pushback.\n\nChina has already been re-directing its exports. In May, its exports to the US were 43 per cent lower than for the same month last year, but its total exports were up nearly 5 per cent. Exports to South East Asian countries were up 15 per cent and those to the European Union 12 per cent. Loading While it is unlikely that those exports flowing into Europe will be transhipped, the US will be playing “whack-a-mole” in Asia and Latin America as Chinese companies, and others, seek to exploit the new tariff regime. July 9, or whenever the new US tariff regime is in place, won’t be the end of the changes to the global trade settings. A source of considerable trade friction, and an impediment to deals with Japan, South Korea and the European Union, are Trump’s sectoral tariffs. The US has imposed 50 per cent tariffs on imports of steel and aluminium and 25 per cent on autos and auto parts.\n\nTrump has foreshadowed – the administration is compiling the necessary documentation – further sectoral tariffs on pharmaceutical products, semiconductors, timber and copper. Any deal or, more likely, tentative outlines for deals, announced this week will be vulnerable to any future new sectoral tariffs. The EU, for instance, is a major exporter of pharmaceuticals to the US. The EU accounts for about 14 per cent of all US goods imports and is America’s second-largest trade partner, behind China. While Bessent said there had been “very good progress” in discussions with the EU, and the EU itself has said it is hopeful that an agreement in principle can be signed, US demands that US companies be exempt from EU regulations and that the EU accept a 17 per cent tariff on its agricultural exports, along with the sectoral tariffs on steel, aluminium, autos and perhaps pharmaceuticals, are massive hurdles to any final deal. The EU has drawn up its own list of potential retaliatory tariffs on imports from the US, covering about €116 billion ($A209 billion) of US goods, that it could deploy if its negotiations break down.\n\nThe potential for a full-scale trade war between the US and EU is high, adding to the threat to global trade and the global economy posed by the existing trade hostilities between the US and China. Tensions between Europe and China are also mounting as China’s export volumes to the US decline but those to Europe climb. Vehicles waiting for shipment at a shipping terminal in Shanghai, China. Credit: Bloomberg Even before whatever Wednesday’s deadline for deals – or Trump’s unilaterally imposed tariffs – produces, the 10 per cent baseline tariffs and the 55 per cent rate on imports from China are having material effects. While the shifting flows of global trade are just starting to show up, an insight into their early impact on the US can be seen in US customs data, with tariff revenues hitting a record $US23 billion in May. That is a 270 per cent increase on the same month last year, a 25 per cent increase on the April number and a revenue stream that will obviously swell significantly once Trump’s post-July 9 tariff regime is in place.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/star-faces-36-5m-blow-if-queen-s-wharf-deal-flops-20250707-p5md0e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Star faces $36.5m blow if Queen’s Wharf deal flops",
        "publish_date": "Mon, 07 Jul 2025 12:09:04 +1000",
        "category": "finance",
        "authors": [
            "James Hall"
        ],
        "text": "Casino giant Star Entertainment’s bid to save a deal to sell its stake in Brisbane’s Queen’s Wharf precinct has hit a standstill, with the embattled publicly listed company revealing on Monday it will be forced to cough up nearly $37 million if the sale falls through.\n\nThe gaming group, which was on the brink of financial ruin for many months earlier this year, secured a deal in March to sell its stake in the glitzy riverside precinct to Hong Kong investors.\n\nHong Kong’s Chow Tai Fook Enterprises and Far East Consortium, who each own 25 per cent in Queen’s Wharf, last week threatened to walk away from the deal that includes them buying 50 per cent of the gaming, hotel and retail complex as well as the Treasury hotel and carpark.\n\nThe plan is for the Queen’s Wharf casino complex in Brisbane to be owned by HK investors Chow Tai Fook Enterprises and Far East Consortium, but that deal has hit a standstill. Credit: Glenn Campbell\n\nAhead of the looming deadline for the deal to fall over on Monday, Star released an update to the ASX revealing the parties involved had agreed to extend the negotiations to the end of the month.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/cabin-swept-away-with-people-still-inside-20250707-p5md2l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cabin swept away with people still inside",
        "publish_date": "Mon, 07 Jul 2025 12:04:16 +1000",
        "category": "finance",
        "authors": [],
        "text": "Cabin swept away with people still inside\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/ozzy-osbourne-plays-final-concert-sitting-on-black-throne-amid-parkinson-s-battle-20250707-p5mczf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ozzy Osbourne plays final concert sitting on black throne amid Parkinson’s battle",
        "publish_date": "Mon, 07 Jul 2025 12:01:38 +1000",
        "category": "entertainment",
        "authors": [
            "Nick Newling"
        ],
        "text": "British rock star Ozzy Osbourne has played his final concert, reuniting metal legends Black Sabbath, for the 40,000-strong show in his home town of Birmingham at the weekend.\n\nThe 76-year-old took to the stage for the first time in two years on Saturday night (Sunday AEST), performing the entire set seated on a dark, bat-winged throne, as he struggles with Parkinson’s disease.\n\nOzzy Osbourne performing on his bat-winged throne during his induction into the Rock & Roll Hall of Fame in 2024. Credit: Kevin Mazur/Getty Images for The Rock and Roll Hall of Fame\n\nDressed in a quintessential all-black ensemble, Osbourne, also a former reality star, rose from the ground seated on an enormous black throne and urged the crowd to “let the madness begin”. He later paid tribute to his fans.\n\n“I don’t know what to say, man. I’ve been laid up for like six years. You have no idea how I feel – thank you from the bottom of my heart,” Osbourne said. “You’re all … special. Let’s go crazy, come on.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/afl-considers-new-mid-season-competition-in-radical-fixture-shake-up-20250706-p5mcw1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL considers new mid-season competition in radical fixture shake-up",
        "publish_date": "Mon, 07 Jul 2025 11:59:00 +1000",
        "category": "sports",
        "authors": [
            "Sam Mcclure"
        ],
        "text": "The AFL is seriously considering introducing a secondary tournament that would run during the premiership season, award millions of dollars in prizemoney and could even offer the winning team a spot in the finals.\n\nThe idea, first suggested 18 months ago, was raised again by AFL heavyweights including chief executive Andrew Dillon when the club CEOs gathered on the Gold Coast last week and would potentially be introduced once Tasmania joins the competition as a 19th team in 2028.\n\nAFL boss Andrew Dillon met with club CEOs last week where the mid-season competition was discussed. Credit: Marija Ercegovac\n\nIt would reduce the number of rounds played in the premiership season. Under the proposal, teams would only play each other once in the premiership season, plus an additional rivalry round and Gather Round. The in-season tournament would then make up the difference to the current format, ensuring the terms of the AFL’s broadcast deal are met.\n\nFour club bosses spoken to by this masthead, who asked to remain anonymous because of the sensitive nature of the conversations, confirmed the idea was raised by the AFL last week and said they supported it in theory.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/celebrity/where-the-cheese-was-the-real-story-behind-australia-s-foul-mouthed-polymath-20250706-p5mcvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Where the cheese was: The real story behind Australia’s foul-mouthed polymath",
        "publish_date": "Mon, 07 Jul 2025 11:56:22 +1000",
        "category": "finance",
        "authors": [
            "Rob Harris"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Peter Russell-Clarke, the neckerchief-clad larrikin who became an unexpected fixture in Australian lounge rooms and taught a generation how to cook long before MasterChef, has died aged 89. Russell-Clarke was the unruliest of media pioneers – a bona fide polymath whose flair for cooking was matched only by his biting political cartoons and a sharp tongue that went gloriously rogue in a now-legendary bloopers reel, long before the internet invented “going viral”. With a trademark beret, stained smock, and a tea towel thrown over one shoulder, he was never just a cook. He was a storyteller. A painter. A provocateur. A genuine original. The sort who could poach an egg and puncture a prime minister’s ego in the same five-minute segment. A familiar face on television throughout the 1980s and early ’90s, Russell-Clarke fronted more than 900 episodes of Come and Get It on the ABC. He showed generations of Australians how to toast herbs and cook chops on residual heat, and became inextricably linked with dairy marketing via a single immortal phrase: “Where’s the cheese?” Yet, to reduce his life to a catchcry would be like calling Michelangelo a ceiling painter. Russell-Clarke was nothing less than a renaissance man with an Australian accent and a foul mouth. He was a culinary educator, but also a talented illustrator, prolific writer, advertising guru, political cartoonist, restaurateur and satirist. He was also a wine blender and a UN food ambassador. A man who once painted Dreamtime stories with Aboriginal elders in Far North Queensland and later cooked a jubilee dinner for the then Prince Charles.\n\nAdvertisement\n\nBorn in Ballarat in 1935, Russell-Clarke’s early life was marked by instability. His father, a defrocked Anglican minister, and his dressmaker mother, sent him to a Catholic boarding school in Bowral, NSW, “to get back at the Anglicans”, but didn’t bother paying the fees. His childhood, shaped by alcohol-affected parents and stints in foster care, was anything but linear. At one point, he lived with a Chinese-Australian family who taught him to cook banquet-style meals and introduced him to Eastern flavours. He would later claim these early culinary lessons formed the backbone of his intuitive, nose-first approach to food. It is difficult to know whether all his tales were true or had added garnish. He briefly lived on Melbourne’s streets, scrounging behind Bourke Street institutions like Florentino. Even then, his standards were high. He once said he’d written a letter to the chef, complaining that a discarded fish had freezer burn. “I’m buggered if I know how long I exis­ted like that, but it was a while. Good times, it made you lose weight!” he recalled in an interview years later. Peter Russell-Clarke pictured in 2013. Credit: Melanie Faith Dove That mix of refinement and irreverence would become his signature.\n\nAdvertisement\n\nBy his late teens, Russell-Clarke was working as a junior artist for one of Australia’s top advertising agencies. His job, initially, was fetching lunches. But soon he was freelancing as an illustrator and food consultant – two disciplines he would blend with great success. He went on to become political cartoonist for the Melbourne Herald, where he drew the comic strip Ben Bowyang and skewered public figures with glee and accuracy. Loading At the same time, he began illustrating for Shell, Mobil, Ford and even Boeing – work that would take him across the globe and into the homes of corporate high-flyers. But it was food, that always kept calling him back. Russell-Clarke ran one of Melbourne’s most popular restaurants, a no‑name, no‑menu venue in Carlton, often booked out 18 months in advance. Again, Charles came calling and, reportedly, he told him to “bugger off” because he was fully booked. “I cooked a silver jubilee dinner for him and the only reason they chose me is that they knew they could get away with not paying for the meal,” he once said. “The place was well ahead of its time, like a modern pop‑up. You just came and got whatever there was. It’s just too hard if someone orders off the menu.” He wrote, illustrated, or ghostwrote 35 books – including 25 cookbooks and an encyclopaedia of food. He was also, at various times, food editor for New Idea, Woman’s Day, The Age, and The Daily Mirror. For 27 years, he was the face of the Australian Dairy Corporation and the Egg Board, starring in TV commercials he often wrote and directed himself.\n\nAdvertisement\n\nThose of a certain age will remember him best as the five-minute man on ABC. Come and Get It, which aired just before The Goodies or Inspector Gadget, delivered succinct recipes in an unmistakable Russell-Clarke tone: warm, matey, occasionally bemused. Russell-Clarke’s energy remained fierce, even when he faced health challenges in his later years. “G’day!” he’d begin, and off he’d go – chatting about burnt herbs or properly cooking tomatoes (“you release a perfume”) before wrapping up with “you beaut!” and a cheeky grin. Behind the scenes, he was anything but tame. The infamous blooper reel – first passed around on email and then eventually YouTube – revealed a man unafraid to unleash torrents of profanity, frustration, and wit. The contrast between the polished, public Russell-Clarke and the mercurial off-air version only deepened public affection. Even in his later years, battered by health challenges – a heart attack, stroke and cancer diagnosis – Russell-Clarke’s energy remained fierce. Living with his wife of six decades, Jan, in Tooborac, north of Melbourne, he still cooked, still painted and still spoke with vision-impaired cooking enthusiasts about low-heat techniques. He insisted that blindness needn’t be a barrier to kitchen excellence – “It should make you a better cook,” he said. “You do it gently and slowly. Like making love.” That gentleness wasn’t always evident in his professional life. He could be abrasive, outrageous and contradictory. But there was wisdom in the way he treated food. A lamb chop deserved your attention. Herbs were to be toasted and respected. Food, for Russell-Clarke, was not just sustenance but story, art, politics and theatre.\n\nAdvertisement\n\n“There was nearly a war over Brussels sprouts, but the king of Brussels saved the day by telling the king of England how to cook them properly,” he once told a young reporter. “I don’t know if that story’s true or not, but it sounds good.” His art reflected that same narrative sensibility. He painted for commercial clients, for federal commissions, for himself. He exhibited widely around Australia and internationally, owning his own Soho Galleries on Victoria’s Bellarine Peninsula and completing a 10-storey mural series for a Lygon Street building – from rabbits underground to pigeons in the sky. Pictured in 1983. His cello paintings, inspired by musical theatre pieces he composed, portrayed instruments as people: sinuous, playful, human. In 2004, the National Portrait Gallery in Canberra requested a self-portrait for one of its exhibitions. He obliged with a piece that was part man, part mirth. After losing his home in a devastating fire while overseas, Russell-Clarke did what he always did – started again. Fifty paintings were destroyed. Four finished books went up in smoke. He said it was a blessing. “The first book I’ve rewritten is much better,” he shrugged. “I’m singing and dancing.” He famously called himself a “ratbag,” a label friends, fans and colleagues endorsed with affection.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/developer-pays-3-92m-for-st-ives-house-they-first-saw-at-the-auction-20250707-p5mczr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Developer pays $3.92m for St Ives house they first saw at the auction",
        "publish_date": "Mon, 07 Jul 2025 11:52:15 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A developer paid $3.92 million for a block of land in St Ives that they saw for the first time at auction on Saturday.\n\nThe 1,075 square metre block at 9 Myrtle Road was guided at $3.3 million and sold for $320,000 above its $3.6 million reserve.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.\n\nConsidered a knockdown, the property came with a three-bedroom house, but without photos, other than an aerial roof view and a floor plan. It was marketed as a land parcel to build a dream home or redevelop.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/touching-reason-behind-stars-pink-boots-20250707-p5md2d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Touching reason behind star's pink boots",
        "publish_date": "Mon, 07 Jul 2025 11:48:30 +1000",
        "category": "finance",
        "authors": [],
        "text": "Touching reason behind star's pink boots\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/the-whole-package-family-shells-out-for-luxury-home-with-waterslide-cricket-pitch-and-cinema-20250707-p5mczt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘The whole package’: Family shells out for luxury home with waterslide, cricket pitch and cinema",
        "publish_date": "Mon, 07 Jul 2025 11:43:24 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A luxury Stretton home with its own cricket pitch and cinema has sold for nearly double its 2021 price after three families went into bat for the keys.\n\nThe seven-bedroom, five-bathroom home at 110 The Parkway fetched $3.3 million under the hammer on Saturday, leaving the vendors ecstatic and the buyers relieved, as tight stock and falling interest rates fuel fierce competition across Brisbane.\n\nSet on a 736-square-metre block in the exclusive The Parks estate, the property came complete with a long list of lifestyle perks, including a saltwater pool, spa, outdoor kitchen and fireplace, plus a full CCTV security system.\n\nThe Stretton home was described as “one of those big lifestyle homes with big bedrooms and the whole package”. Credit: Domain\n\nBidding opened at $2 million and quickly leapt in $100,000 and $50,000 increments to $3 million, before settling into a two-horse race. In the end, a family from two suburbs away secured the keys, narrowly outpacing an underbidder who lived just one street over.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/sharemarket-steady-but-rally-sparks-sell-signal-worry-20250706-p5mcvs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX opens flat after record close and Wall Street’s high",
        "publish_date": "Mon, 07 Jul 2025 11:40:31 +1000",
        "category": "finance",
        "authors": [
            "Angus Delaney"
        ],
        "text": "The Australian sharemarket opened flat on Monday morning, after US and Australian stocks hit fresh heights last week, with both futures indicators and the dollar remaining steady.\n\nThe Reserve Bank’s monetary policy board meeting, which begins on Monday, tops the week’s economic agenda, though Donald Trump’s tariffs could once again roil markets.\n\nThe S&P/ASX 200 is down 6.8 points to 8596.2 with the bourse buoyed by the utilities sector while mining and energy stocks have sagged. The Australian dollar was fetching US65.40¢ at 10.30am AEDT.\n\nUS stock futures fell on Friday morning. Credit: AP\n\nOrigin Energy advanced 4.6 per cent, with the utilities sector up 2.6 per cent. Meridian Energy and APA Group had more modest increases, 0.7 per cent and 0.5 per cent, respectively, while Mercury NZ and AGL Energy fell 0.4 per cent and 0.5 per cent, respectively.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/only-one-bid-for-1-36m-north-melbourne-terrace-that-passed-in-but-sold-after-20250707-p5mczs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Only one bid for $1.36m North Melbourne terrace that passed in – but sold after",
        "publish_date": "Mon, 07 Jul 2025 11:36:08 +1000",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "A renovated Victorian terrace in North Melbourne passed in at auction for $1.32 million on Saturday, but sold in post-auction negotiations for $1.36 million.\n\nThe two-storey period home at 495 Abbotsford Street had a price guide of $1.3 million to $1.4 million and a reserve of $1.36 million.\n\nThere were two registered bidders, but one did not put their hand up because their finances had not been approved in time, said selling agent, Jayson Watts from Nelson Alexander Carlton.\n\nThe auction opened with a vendor bid of $1.3 million, followed by the only live bid of $1.32 million.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-australian-defence-force-facing-sexual-violence-allegations-victorian-premier-visits-east-melbourne-synagogue-following-antisemitic-attack-20250707-p5mcyb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Australian Defence Force facing sexual violence allegations; Victorian premier visit East Melbourne Synagogue following antisemitic attack",
        "publish_date": "Mon, 07 Jul 2025 11:34:57 +1000",
        "category": "finance",
        "authors": [
            "Emily Kowal"
        ],
        "text": "Melbourne acting lord mayor Roshena Campbell has praised two Lebanese brothers who stepped in after “extremist protesters” stormed an Israeli restaurant in Melbourne on Friday night.\n\nOn the same night as Friday’s synagogue attack, a group of 20 people stormed Israeli restaurant Miznon in the CBD, upturning tables, distressing diners and chanting “Death to the IDF”.\n\nSpeaking to Sky News, Campbell revealed two brothers protected “terrified” patrons and staff, and their actions captured “the true spirit of Melbourne.”\n\n“In those really dark moments there was also a great moment that I think show the true spirit of Melbourne and where we are at,” she said.\n\n“Two Lebanese brothers who owned the pizzeria across the road stepped in, they raced across, they barricaded the doors to keep the staff and patrons safe from those extremist protesters and I think that is where the community of Melbourne is at.\n\n“We stand in solidarity with our Jewish community, and we say there is no place in Melbourne for what is nothing short of hate and antisemitism that will never be tolerated in this city or this country,” she said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/melbourne-dads-fight-to-save-beloved-local-pub-20250707-p5md23.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne dad's fight to save beloved local pub",
        "publish_date": "Mon, 07 Jul 2025 11:33:14 +1000",
        "category": "finance",
        "authors": [],
        "text": "Melbourne dad's fight to save beloved local pub\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-woman-loses-arm-in-lion-attack-at-queensland-zoo-munster-to-play-origin-after-his-father-s-death-police-probe-multiple-deaths-in-homes-in-two-states-20250704-p5mcht.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Two teens arrested at airport over ‘spicy’ drug plot; Queensland zoo to reopen tomorrow after lion attack; Munster to play Origin after his father’s death",
        "publish_date": "Mon, 07 Jul 2025 11:28:36 +1000",
        "category": "finance",
        "authors": [],
        "text": "It is 22 storeys high, over one kilometre long and, yesterday, the Story Bridge officially turned 85.\n\nThe Story Bridge, pictured under construction in the 1930s.\n\nDesigned by John Bradfield in 1934 – the same man who designed the Sydney Harbour Bridge – the Story Bridge was officially opened on July 6, 1940.\n\nJoining Kangaroo Point and Fortitude Valley, it took five years to construct and is unique in being the largest bridge designed, fabricated and constructed completely by Australians.\n\nThe Story Bridge in 1958. Credit: Brisbane City Council Archives\n\nAll 12,000 tonnes of steelwork were fabricated in Rocklea at the workshop of Evans, Deakin & Co. Ltd, who were contracted to construct the bridge.\n\nThe bridge cost the State Government £1,492,000 and was later sold to the Brisbane City Council for the bargain price of £750,000.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/western-australia/burswood-racetrack-and-amphitheatre-builders-selected-20250707-p5md1o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Burswood racetrack and amphitheatre builders selected",
        "publish_date": "Mon, 07 Jul 2025 11:27:08 +1000",
        "category": "entertainment",
        "authors": [
            "Hamish Hastie"
        ],
        "text": "The group of companies that built the Boorloo Bridge has been selected to design and build the $217 million Burswood racetrack and amphitheatre.\n\nAn alliance between Seymour Whyte Constructions, Civmec and Aurecon Australasia has been announced to design and build the controversial project on the Burswood Peninsula that the state government has dubbed the Perth Entertainment and Sporting precinct.\n\nJanuary artist impression of the Perth street circuit and amphitheatre on the Burswood peninsula.\n\nThe alliance is the same group that built the $187 million Boorloo Bridge, which was completed in December last year $50 million over the original budget.\n\n“The preferred alliance team announced today have delivered some of our most iconic projects, including the new locally made Boorloo Bridge, which has become an incredible piece of public infrastructure,” Transport Minister Rita Saffioti said.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/most-older-australians-back-labors-3-million-super-tax-plan/xz6vomc4p",
        "title": "More than half of older Australians back Labor's $3 million super tax plan",
        "publish_date": "Sun, 6 Jul 2025 23:18:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than half of older Australians support increasing taxes on high superannuation balances.\n\n\n\n\n\nThe federal government is controversially considering lifting taxes on super balances above $3 million from 15 per cent to 30 per cent, a move predicted to affect about 0.5 per cent of savers.\n\n\n\n\n\nDespite outcry from the Opposition, about 57 per cent of seniors endorse the change, according to a survey of 3,000 people aged 50 and older conducted by National Seniors Australia for the Super Members Council.\n\n\n\n'Strong sense of fairness'\n\nSuper Members Council chief executive Misha Schubert said: \"There seems to be broad Australian understanding about the importance of equity and sustainability in the super system, and a strong sense of fairness as the starting point.\"\n\n\n\n\n\nSchubert said the survey results appear to track with broader public sentiment on Labor's bill.\n\n\n\nLower confidence in fairness among some Australians\n\nWhile a significant majority of those surveyed believed the super system was strong and sustainable, comparatively fewer thought it was equitable.\n\n\n\n\n\nWomen, those with poorer health and Australians with less formal education had lower levels of confidence in its fairness, the report found.\n\n\n\n\n\nMany of these demographics lack equal access to the benefits of superannuation due to a lack of employment opportunities or disrupted work histories.\n\n\n\nBut overall, older Australians almost universally understand the importance of super with 89.5 per cent believing it must be saved for retirement.\n\n\n\n\n\nOne in four respondents supported early release of funds beyond current rules.\n\n\n\nCoalition's housing plan\n\nThe Coalition has continued to push a housing plan that would allow first-time home buyers to access up to $50,000 from their super to put down a deposit, despite protests it would raise house prices and leave savers worse off in the future.\n\n\n\n\n\n\"Policy ideas that propose early release are dangerous and they make Australians poorer,\" Schubert said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-van-der-poel-edges-out-pogacar-to-win-second-stage-in-hilltop-finale/37drhgk64",
        "title": "Tour de France: Van der Poel edges out Pogacar to win second stage in hilltop finale",
        "publish_date": "Sun, 6 Jul 2025 20:13:55 +0000",
        "category": "sports",
        "authors": [],
        "text": "Alpecin's Mathieu van der Poel has edged Tadej Pogacar to win the second stage of the Tour de France in a tense hilltop finale at Boulogne-sur-Mer.\n\n\n\n\n\nThe Dutch rider takes the lead in the overall standings after depriving Pogacar of his 100th career win as around 30 riders broke away in the final 2km.\n\n\n\n\n\nIt was a second Tour de France stage win for Van der Poel, who took the yellow jersey from his teammate Jasper Philipsen — the winner of Saturday's opening stage.\n\n\n\n\n\nDenmark's Jonas Vingegaard seemed at ease as he crossed the line in third with Frenchman Romain Gregoire fourth and his compatriot Julian Alaphilippe fifth.\n\n\n\n\n\nVan der Poel also won stage two on the 2021 Tour de France and then dug deep to retain the yellow jersey for six gruelling days.\n\n\n\n\"Winning again four years after the last time, that's just great. In recent years I tried to get here on top form but never quite did,\" said Van der Poel, adding that racing the recent Criterium du Dauphine had done the trick.\n\n\n\n\n\n\"I also watched a video of the final kilometre three times this morning and knew exactly how to take it,\" he said.\n\n\n\n\n\nThe Dutch rider is the grandson of French cycling legend Raymond Poulidor, who came second in the Tour de France seven times, but never won and also never got to wear the yellow jersey.\n\n\n\nMathieu van der Poel said he had watched a video of the final kilometre three times in the morning. Source: AAP / EPA / Christophe Petit Tesson \"It was more emotional last time because he [Poulidor] had just died. I had so wanted to win it while he was still alive,\" Van der Poel said.\n\n\n\n\n\nPoulidor's grandson had punched the ground and screamed wildly on realising he had taken the jersey on his previous Tour de France stage win at the Mur de Bretagne.\n\n\n\n\n\nThere were no such scenes this time.\n\n\n\n\"I had a feeling I could win the stage today, but taking the yellow jersey is a nice bonus,\" said Van der Poel, normally better suited to the ultra-long Monument races, of which he won Milan-San Remo and Paris-Roubaix this season.\n\n\n\n\n\nHis teammate Philipsen may have lost the yellow jersey, but he will set off Monday wearing the green one assigned to the peloton's best sprinter.\n\n\n\n\n\nDefending champion Pogacar was also invited onto the podium due to the points he won atop the four hills of the day's stage, which earned him the right to don the polka-dot king of the mountains tunic.\n\n\n\n\n\nTeam UAE's Slovenian rider is second in the overall standings, with Visma's Vingegaard just two seconds behind him in third.\n\n\n\n\n\nThe race got underway as Pogacar and Vingegaard tested each other over the final 20km, with three short, sharp climbs on narrow roads.\n\n\n\nREAD MORE Tour de France Stage 1: Philipsen wins windy opener as Evenepoel trapped in split\n\nThat struggle blew up a peloton that had been largely calm until then.\n\n\n\nHeavy rain, stolen bicycles\n\nHeavy rain left giant puddles at the tiny start town of Lauwin Planque as the 182 riders set off on the 209km run towards the coastal port.\n\n\n\n\n\nRegional police estimated one million spectators had lined the roadsides on the opening day of action, but the rain dissuaded that kind of turnout the next day.\n\n\n\n\n\nThe French team Cofidis had to scramble on Sunday after 11 bikes were stolen from a team truck overnight.\n\n\n\n\n\nMonday's third stage is a 178km flat run to Dunkirk, where a mass bunch sprint is expected, unless the peloton gets splintered by the winds, as it did on stage one.\n\n\n\n\n\nThe first section of the Tour is raced through the north and west of France.\n\n\n\n\n\nThe volcanic landscape of the Puy de Dôme presents the first mountains as late as stage 10, with two more colossal climb days in the Pyrenees before the blockbuster final week in the Alps.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/new-tool-to-tackle-one-of-australias-biggest-killers/gn376h4lh",
        "title": "It's one of Australia's biggest killers — and there's a new tool to tackle it",
        "publish_date": "Sun, 6 Jul 2025 05:55:22 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Lung cancer is Australia’s fifth most diagnosed cancer, but causes the greatest number of deaths because it is often diagnosed too late.\n\n\n\n\n\nBut this week, a new screening program became available — and there are hopes it will detect cases much earlier for those at the highest risk, including Indigenous Australians and some migrant communities.\n\n\n\n\n\n\"We used to see a large number of people in their middle age to late middle age coming in with problems breathing or coughing up blood or losing weight, and they would have a diagnosis of lung cancer,\" said Dorothy Keefe, the CEO of Cancer Australia.\n\n\n\n\n\n\"And I remember my first consultant ... he would sit on their beds and he would hold their hands and he would tell them that he was very sorry but there was nothing that could be done.\"\n\n\n\n\n\nKeefe was reflecting on her experiences of caring for patients with terminal lung cancer as a junior doctor in the United Kingdom, and she wants medical professionals to avoid as many of those conversations here as possible.\n\n\n\n\n\nHealth Minister Mark Butler said despite it being one of the top five diagnosed forms of cancers, it's one of the deadliest because its often picked up when it's already advanced.\n\n\n\n\n\nHe said that makes them: \"very, very hard to treat — and making survivability much lower than some of the other cancers where we're seeing survivability increase quite dramatically.\"\n\n\n\nLISTEN TO INTERVIEW: Australia among first countries to launch lung cancer screening program SBS News 05/07/2025 12:37 English\n\nAnita Dessaix, chair of the Cancer Council's public health committee, said lung cancer mortality is especially a problem in some migrant communities and definitely so for Indigenous Australians, whose rates of diagnosis have been rising.\n\n\n\n\n\n\"There are particular parts of the population that experience currently worser outcomes, and that does include people who are living in rural and remote areas in Australia,\" Dessaix said. \"Those who potentially don't have English as their first language — so culturally and linguistically diverse communities — and also those who are Aboriginal and Torres Strait Islander people.\"\n\n\n\nWho can access the new lung cancer screening program?\n\nThe Australian government has funded a national early screening program it hopes will bring down those numbers.\n\n\n\n\n\nScans to detect lung issues normally cost hundreds of dollars, but Butler said that they will now cost nothing for patients deemed to be at high risk of lung cancer.\n\n\n\n\n\nThat includes people who are:\n\n\n\nBetween 50 and 70 years old\n\nShow no signs or symptoms of lung cancer\n\nHave a history of at least 30 pack-years of cigarette smoking, or are still smoking, or have quit in the past 10 years\n\nButler said the program will entitle high risk patients \"to a CT scan every two years, designed to pick up any early evidence of lung cancer and allow them then to be treated hopefully very, very successfully\".\n\n\n\n\n\nHe said people in regional communities would also be able to access the program later this year, with trucks equipped with mobile CT scan technology set to be rolled out in these areas.\n\n\n\n\n\nThe international evidence for these types of screening programs is promising.\n\n\n\n\n\nButler it suggests up to 70 percent of lung cancers are detected at early stages by low-dose CT scans, and deaths are subsequently reduced by 20 percent.\n\n\n\n\n\nAccordingly the CEO of the Lung Foundation Australia, Mark Brooke, hopes this program — the first new national cancer screening program in 20 years — will be a game changer.\n\n\n\n\n\n\"We will be one of the first countries in the world to have a national lung cancer screening program that will look across Australia,\" Brooke said. \"And particularly because it's been co-designed with Aboriginal and Torres Strait Islander people, will support those people who have often been forgotten.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australians-in-280m-euro-summer-surge-anz-says/zm8iqt11z",
        "title": "Australians in '$280 million Euro summer surge' — and emerging holiday hotspots",
        "publish_date": "Sun, 6 Jul 2025 05:21:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "European summer spending is set for a rebound, one of Australia's biggest banks predicts, with travellers also looking to other destinations to escape the winter at home.\n\n\n\n\n\nANZ says customers travelling to Europe across June, July, and August will spend up to $280 million — a projected 10 per cent increase compared to 2024 which it says is based on early trends in hotel and airline bookings.\n\n\n\n\n\nIt says pre-travel spending data showed that between January and May, hotel and airline bookings were up 11 per cent on the same period last year.\n\n\n\n\n\nThe projected total spend won't match the record of $313 million set in 2023, ANZ said. But it will be an uptick from 2024 where, despite more than 100,000 of its customers travelling to Europe, total spend and average spend per customer were down 19 per cent and 13 per cent respectively, compared to the previous year.\n\n\n\n\n\nBeyond saying travel to Europe among its customers had \"dipped\" in 2024, ANZ in its statement did not explain why it believes there might be an increase in total spending this year — although not one that would match the 2023 record.\n\n\n\nSome measures show consumer confidence — which predicts how consumers feel about the economy and their own finances — has improved since 2024. But it's also higher than in 2023.\n\n\n\n\n\nInterest rates , however, have fallen from the 12-year high which carried from late 2023 through 2024. That has eased mortgage repayments, though disposable incomes haven't significantly increased.\n\n\n\n\n\nLike Australia, Europe also battled a period of high inflation. Inflation in the European Union peaked at 11.5 per cent in late 2022 and has since cooled. Falling inflation doesn't necessarily equate to lower prices, it just means prices are growing at a slower rate — unless inflation turns negative.\n\n\n\n\n\nAdditionally, a recent analysis showed that a drop in jet fuel prices had lowered airfares. Global capacity — meaning seats on planes — was also up on last year and pre-pandemic levels, contributing to falling costs, according to corporate travel advisors FCM Consulting.\n\n\n\n\n\n\"Our data shows that customers are reigniting their passion for European travel. We’re seeing strong growth in early planning activity,\" said Yiken Yang, ANZ's managing director of everyday banking.\n\n\n\n\n\n\"While we may not hit the $313 million peak of 2023, 2025 is shaping up as a vibrant resurgence for the travel sector.\"\n\n\n\nANZ said non-European destinations in 2024 saw a 3 per cent increase in spend for the June-August period.\n\n\n\n\n\nIndonesia, New Zealand, Thailand and Japan were among the most popular destinations, ANZ said, which is consistent with what the Australian Bureau of Statistics says are countries favoured by holidaymakers.\n\n\n\n\n\nIt also said Hong Kong and Sri Lanka were \"emerging hotspots\" and recording \"significant\" year-on-year growth in spend.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/trumps-liberation-day-tariff-deadline-looms-amid-inflation-concerns/q8fwhijl2",
        "title": "Trump's 'Liberation Day' tariff deadline looms amid inflation concerns",
        "publish_date": "Sun, 6 Jul 2025 03:32:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nWith the implementation of US President Donald Trump's sweeping global tariffs, some countries are now scrambling to reach a deal.\n\n\n\n\n\nFew countries have managed to make secure deals with the US ahead of the deadline, raising concerns for the global economy.\n\n\n\n\n\nOn the 2nd of April this year, United States President Donald Trump stoked panic among global leaders, announcing sweeping tariffs on all imports to the US.\n\n\n\n\n\nAfter upending global financial markets and igniting a global trade war, only a few days passed before the administration ordered a 90-day pause on the measures.\n\n\n\n\n\nWith an end to the ninety days fast approaching and only a few deals reached, fears are mounting over potential impacts on the global economy.\n\n\n\n\n\nDonald Trump says he's signed and is ready to send letters to 12 countries so far, outlining the various tariff levels they'll face.\n\n\n\n\n\n\"I did, I signed some letters, and they'll go out on Monday, probably 12. Twelve different amount of money, different amounts of tariffs, and somewhat different statements. \"\n\n\n\n\n\nJOURNALIST : \"Mr. President, which countries will receive those letters on Monday?\"\n\n\n\n\n\nTRUMP: \"It'll be announced, I have to announce it on Monday, I can't do it now.\"\n\n\n\n\n\nDespite the administration's claims a pause would allow ample time to strike their goal of 90 deals in 90 days, most of those deals never materialised.\n\n\n\n\n\nAgreements were made with some countries, first with the U-K, then China, and most recently Vietnam.\n\n\n\n\n\nAfter a pact was made with Vietnam however, Chinese officials raised concerns about it's impact on Chinese trade.\n\n\n\n\n\nChinese Ministry of Commerce spokeswoman He Yongqian says China may take countermeasures.\n\n\n\n\n\n\"The imposition of the so-called 'reciprocal tariffs' by the United States on its global trading partners is a typical unilateral and bullying act. China has always firmly opposed it. We have noticed the relevant situation and is assessing the deal. China's position is consistent. We are happy to see all countries resolving economic and trade disputes with the United States through equal-footed consultation, but we firmly oppose any country reaching trade deals by sacrificing China's interests. If this happens, the Chinese side will resolutely take countermeasures to safeguard its legitimate rights and interests.\"\n\n\n\n\n\nIn India, which faces 26 per cent tariffs, officials say they're ready to make deals in the national interest but won't be rushed into reaching the US deadlines.\n\n\n\n\n\nJapanese and South Korea leaders are scrambling to reach a deal, with negotiators engaging in lengthy discussions with US officials over the weekend.\n\n\n\n\n\nSouth Korean President Lee Jae-Myung says negotiating a deal has been a difficult process.\n\n\n\n\n\n\"It’s clear that the tariff negotiations are not easy. At this point, I can't confidently say whether they’ll be concluded by July 8. We’re doing our utmost. What’s crucial is that the outcome must be mutually beneficial for both sides. However, even now, it’s not entirely clear what each side precisely wants — those details are still being worked out.\"\n\n\n\n\n\nOfficials also say they're closing in on a framework agreement with the European Union, which would avert 50 per cent tariffs.\n\n\n\n\n\nTalks in Washington could go down to the wire, but officials say the E-U is willing to accept 10 per cent blanket tariffs in exchange for an extension and possible concessions on a 25 per cent car tariff.\n\n\n\n\n\nSimon Schuetz is head of communications at the German Association of the automotive Industry.\n\n\n\n\n\nHe says the industry will struggle under the proposed terms.\n\n\n\n\n\n\"So, for our industry it is very important that in the upcoming week there will be a solution. We are quite aware that it is impossible in this short time to do a whole trade deal with all the details. So we are asking for first deals for the important domains like the automotive industry, because the current tariffs that we are facing are something that we cannot live with in the future that is very toxic for our industry. So Europe is really asked to find a deal with the USA now and then in the aftermath, they can do the details.\"\n\n\n\n\n\nWith European investors bracing for the looming impact of tariffs, European stocks declined on Friday.\n\n\n\n\n\nPoland is Europe's largest furniture exporter and the world's third largest, with the US being one of the country's biggest markets.\n\n\n\n\n\nDominik Czylkowski is the CEO of NOTI, a Polish furniture company.\n\n\n\n\n\nHe says the US market is crucial to success.\n\n\n\n\n\n\"That's a big market, and that's a big partnership for us. So, of course, we cannot cut that from day to day. And of course we have to solve the issue together and handle this situation for next few weeks until we will find the best solution for us, but mainly for our customers.\"\n\n\n\n\n\nMeanwhile, Australian Prime Minister Anthony Albanese says he has confidence the US tariffs won't impact Australia's economy.\n\n\n\n\n\nAs well as the 10 per cent baseline tariff, Australian steel and aluminium exports to the US face a 50 per cent tariff.\n\n\n\n\n\nMr Albanese told Sky News he expects the 10 per cent on all Australian imports to stay in place.\n\n\n\n\n\n\"We know that no country has a better tariff, if you like, level than ten percent. Now we'll continue to put our case as we as we do, we are in a position where you know on July 9 that won't really have an impact on us, because that's about other countries who have higher rates overnight. \"\n\n\n\n\n\nREPORTER: \"We won't get a letter on July 9? We won't get a determination?\"\n\n\n\n\n\nALBANESE:\" We're on 10 per cent\"\n\n\n\n\n\nREPORTER: \"That's what we're going to stay on after next week? \"\n\n\n\n\n\nALBANESE: \"Well, I assume that will be the case. \"\n\n\n\n\n\nAlso speaking to Sky News, opposition trade spokesperson Kevin Hogan says the Prime Minister ought to be doing more.\n\n\n\n\n\n\"I think he's waving a white flag, Andrew, and I don't know why he'd be saying that before the announcement. We have seen carve outs for some countries. We know the UK have had a bit of a carve out on the steel and aluminum tariffs. Remember, steel and aluminum tariffs have gone up to fifty percent. They're not at ten percent. Countries have got carve outs to that. We've seen carve outs, Mexico have got a few carve outs. Canada have got a few carve outs from what tariffs they initially had as well.\"\n\n\n\n\n\nWhile it's clear the tariffs will hit global economies hard, experts say the US economy is already facing the consequences of Mr Trump's policy.\n\n\n\n\n\nAccording to analysis by the JPMorganChase Institute, mid-sized businesses in the US face an estimated $82.3 billion in additional costs if the US maintains a 10 per cent universal rate on all imports.\n\n\n\n\n\nNo senior US official has been more vocal about this than Jerome Powell, chair of the Federal Reserve.\n\n\n\n\n\nDespite Mr Trump’s public demands and attacks, Mr Powell says he is keeping US interest rates on hold while waiting to see how the administration’s trade strategy pans out.\n\n\n\n\n\nTestifying to Congress late last month [[24/06]], he explains why.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-australia-among-first-countries-to-launch-lung-cancer-screening-program/9z7x715g3",
        "title": "INTERVIEW: Australia among first countries to launch lung cancer screening program",
        "publish_date": "Sat, 5 Jul 2025 22:30:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-1-philipsen-wins-windy-opener-as-evenepoel-trapped-in-split/y54dxtcgo",
        "title": "Tour de France Stage 1: Philipsen wins windy opener as Evenepoel trapped in split",
        "publish_date": "Sat, 5 Jul 2025 21:23:13 +0000",
        "category": "sports",
        "authors": [],
        "text": "There were mixed fortunes for the thousands of Belgian fans who poured over the border for the opening stage of the Tour de France as Jasper Philipsen won, but star rider Remco Evenepoel faltered in his long-range bid for the title itself.\n\n\n\n\n\nPhilipsen took the yellow jersey in a frantic sprint finish at the northern city of Lille, his tenth Tour de France win crowned with a rare race lead for a rider usually chasing sprint points.\n\n\n\n\n\nPhilipsen outsprinted Eritrean Biniam Girmay and Norway's Soren Waerenskjold while Dane Vingegaard and defending champion Tadej Pogacar of Slovenia crossed the line in the leading group.\n\n\n\n\n\nAustralia's Kaden Groves was delighted to play his part in helping his Alpecin-Deceuninck teammate Philipsen grab his third win of the season.\n\n\n\n\n\n\"There were echelons and the race split with about 25km to go,\" Groves said.\n\n\n\n\"That's what we expected actually, and we had numbers in the front [group] who could dictate the race.\"\n\n\n\n\n\nAnd Philipsen added: \"It's really amazing. My 10th victory is something I will never forget.\n\n\n\n\n\n\"The team performance was incredible. I think we were there all day. It was very nervous but we knew today could be our day and we have to be in the front and we were there in the split.\n\n\n\n\n\n\"The team did amazing and in the end we could just use our strength and finish it off.\"\n\n\n\nHow the Stage 1 race unfolded\n\nVingegaard was on red alert as the split started and his explosive acceleration helped stun the peloton and leave his Visma team delighted with the damage done by the day's work with a 40sec advantage over several important rivals.\n\n\n\n\n\n\"It was our plan to use the wind at 20km and it worked,\" said Vingegaard.\n\n\n\n\n\nKnown for his pounces in the mountains, Vingegaard has won the Tour in 2022 and 2023.\n\n\n\n\n\nThe 28-year-old grew up in a remote fishing community, racing into strong winds on the coastal roads in Denmark.\n\n\n\nDefending champion Pogacar appeared flustered at the finish line.\n\n\n\n\n\n\"It was as frantic as we had expected, but when the split came fortunately I was near the front,\" said the 26-year-old Slovenian.\n\n\n\n\n\n\"I'm just happy day one is done. Nine days to go before the first rest day.\"\n\n\n\n\n\nBilled as the third man here after finishing behind Pogacar and Vingegaard on his debut Tour in 2024, star rider Remco Evenepoel was in sombre mood at his team bus.\n\n\n\n\n\n\"We were asleep, we thought any danger was over,\" Evenepoel said of the split where both he and his team's sprinter Tim Merlier found themselves trapped just 20km from the finish.\n\n\n\nBelgian Remco Evenepoel of Soudal Quick-Step pictured at the start of the first stage. Source: AFP / Jasper Jacobs Around 40 riders in the first group contested the sprint where one of the day's many falls happened.\n\n\n\n\n\nPrimoz Roglic and Florian Lipowitz of Red Bull, and Team UAE's Joao Almeida were also caught out in the blustery winds.\n\n\n\n\n\nAnother UAE man, Adam Yates, lost minutes, meaning Pogacar's two deputies are off the pace if something happens to the UAE star man.\n\n\n\n\n\nAfrica's sole rider Biniam Girmay, winner of three stages in 2024, was second on the day as Philipsen got ahead of him with 100m to go.\n\n\n\nEritrean rider Biniam Girmay celebrates on the podium with the best young rider's white jersey after the 1st stage. Source: AFP / Loic Venance But Girmay, winner of the 2024 best sprinter's green jersey, ended the stage with the white jersey for the best 25-and-under rider.\n\n\n\n\n\nFans packed the route in one of France's more modest regions passing First World War memorials, red-brick houses and slagheaps from long-closed coal mines along the Belgian border.\n\n\n\n\n\nUnder overcast skies with the temperature a manageable 22C, the peloton cut a fast pace despite the windy conditions.\n\n\n\nRacing towards an intermediate sprint over cobbles, escapee Benjamin Thomas slid sideways and took out his sole rival Matteo Vercher in one spectacular fall and the pair were still bickering when the peloton shot past them.\n\n\n\n\n\nFormer time-trial world champion Filippo Ganna was one rider who will take no further part after a clumsy fall on a corner.\n\n\n\n\n\nThe Italian would have been a contender on the lengthy stage five individual time-trial, as well as key in the Ineos team's campaign to get veteran Geraint Thomas into the top 10 on his 14th and final Tour de France.\n\n\n\n\n\nPhilipsen, in yellow, will lead the peloton out for Sunday's second stage, a hilly 209km route to the beaches of Boulogne-sur-Mer.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/12-year-olds-first-sale-sparks-international-art-career/h249vv3o0",
        "title": "12-year-old's first sale sparks international art career",
        "publish_date": "Sat, 5 Jul 2025 21:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nSinging an ancient story passed from generation to generation.\n\n\n\n\n\nArtist Juanella Donovan and her daughters are joining the older women to dance the story of the seven sisters, feet in the pink desert sand outside Port Augusta.\n\n\n\n\n\n“I started singing along with the ladies, and I could hear my babies singing along with the ladies and I had to stop myself from crying. You know, those are the memories that I have of my childhood, the same sand dunes, that same dances and some of the elders aren’t here anymore, but those are the beautiful memories that we cherish.”\n\n\n\n\n\nBringing together her community to practice culture on country is what inspires Juanella Donovan.\n\n\n\n\n\nHer own childhood memories are steeped in the art and culture of her mob.\n\n\n\n\n\n\"I feel like that has really helped me build a strong cultural foundation and also cementing my identity as a proud Aboriginal person and my community and then helping me share that with others.”\n\n\n\n\n\nMs Donovan's latest work - in progress under a national regional arts fellowship – is a sculptural installation called 'Mother.'\n\n\n\n\n\nWoven from emu feathers and raffia, Mother is the root ancestor connecting the past present and future.\n\n\n\n\n\nHer maker - a mother of four herself - is also a director of a new art collective.\n\n\n\n\n\nPort Augusta Aboriginal Arts Mob arts mob - or PAAM - is part of the APY Art Collective, an Aboriginal owned network of art centres in communities across South Australia's remote north west.\n\n\n\n\n\nThe artists' inaugural exhibition recently showed in Adelaide, but as Ms Donovan explains, it’s not all about hanging work in galleries.\n\n\n\n\n\n“Art centres change lives, it helps our people to make an income that's respectful of themselves, and their culture and you know we have that here in Port Augusta. From award winning artists to people doing their first canvas, we’re all together, we are all helping each other and that's really, really special.\"\n\n\n\n\n\nMs Donovan says Port Augusta has not had a centre like this since she was a child.\n\n\n\n\n\nAnd she’s hoping it will bridge what she sees as a break down in connection between young people and elders.\n\n\n\n\n\n\"And helping the youth to get back on track and the fellas to get back together and remember what's important and that's preserving our culture and moving forward in a positive and productive way and I feel like PAAM is helping to make our community strong again. I think the hidden beauty of these art centres is the conversations that we as women are having over the table with the youth, with our children with out babies in our arms while we are making.\"\n\n\n\n\n\nShe says PAAM supports many artists from more remote areas who need to stay in Port Augusta to access services.\n\n\n\n\n\n“There's many artists that have disabilities or medical reason why they need to live in Port Augusta and away from country and to have that access to supported culture in a culturally safe place that's what PAAM provides to them and I think that's very important.”\n\n\n\n\n\nMs Donovan's mother Artist Regina McKenzie is also a strong advocate.\n\n\n\n\n\n\"The more we teach our children about who and where we come from and that's our culture, the better and the continuance is something I believe we should keep practising.”\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-music-icon-and-croc-hunter-who-was-a-driving-force-for-naidoc-week/zc2x99wpa",
        "title": "The music icon and croc hunter who was a driving force for NAIDOC Week",
        "publish_date": "Sat, 5 Jul 2025 20:29:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Ted Egan isn't just a songwriter with an extensive and well-known catalogue documenting life in the Northern Territory.\n\n\n\n\n\nAs a public servant, he also played a significant role in the formation of the group behind what is today known as NAIDOC (National Aboriginal and Islanders Day Observance Committee) Week.\n\n\n\n\n\nBorn in 1932 in Melbourne, Egan moved to the Top End in 1949 and started working for the NT Department of Aboriginal Affairs.\n\n\n\n\n\nHis work as a patrol officer and reserve superintendent took him out of the city and on to cattle stations and crocodile-hunting expeditions.\n\n\n\n\n\nIn his late 30s, Egan worked as a project officer with the Office of Aboriginal Affairs: a new national agency within the Prime Minister’s Department that had been established following the successful 1967 Referendum, which saw the Commonwealth now having overall responsibility for Aboriginal affairs.\n\n\n\n\n\nIn 1970, a year after Egan wrote the track Gurindji Blues with land rights leader Vincent Lingiari, Egan was sent to Sydney to attend the annual general meeting of the Commonwealth Council of NADOC (National Aborigines' Day Observance Committee).\n\n\n\nThe purpose of the National Aborigines Day Observance Committee was to \"create and promote an informed public opinion on the status and needs of the Aborigines\". The committee had been set up back in 1957, two years after the National Missionary Council of Australia (NMCA) had asked the federal government to establish a National Aborigines Day.\n\n\n\n\n\nWhile denying the request for a National Day, the federal government supported a National Aborigines Day via funding for publications, leaflets and stickers as a way of \"creating and promoting an informed public opinion on the status and the needs of the Aborigines … as to what is being done, and what remains to be done\".\n\n\n\n\n\nIn 1969, the NADOC Federal Executive was made up of Rev Frank Engel (chairman), Rev Robert Denham (secretary), Rev Richard Udy (treasurer) and committee members: Rev Robert Brown (SA), Rev James Sweet (Qld), Rev G Night (NSW), Mr Ken Colbung, Mrs S Dunn (NSW), Rev E Newman (NSW) and Pastor Schultz (NSW).\n\n\n\nA turning point\n\nIn the overall historical context of National Aborigines Day or NAIDOC Week, the February 1970 meeting of the National Executive was a turning point.\n\n\n\n\n\nAt the meeting, there was a move to elect an Aboriginal man — Ken Colbung from WA — as the new National Chairman. Colbung was the Secretary for NSW NADOC which had large staunch Aboriginal membership including Kaye Mundine, Clive and Tom Williams, Charles 'Chicka' Dixon, Lyall Munro, Bert Groves and Reverend Frank Roberts.\n\n\n\n\n\nIt would be the first time an Aboriginal person would be at the helm of the National Committee; Lester Bostock was also elected a joint treasurer.\n\n\n\n\n\nOn returning to Darwin, Egan typed up a report to his supervisor — Frank H Moy, assistant director (research) at the Office of Aboriginal Affairs — about the meeting.\n\n\n\n\n\n\"The members of the outgoing committee seemed anxious to replace some of the church officials on the Executive with Aboriginals and this is an encouraging sign,\" he wrote.\n\n\n\nEgan recommended that NADOC should be a national committee made up entirely of Indigenous representatives. Moy endorsed his observation about the lack of Aboriginal people on the National Executive.\n\n\n\n\n\n\"We have been lecturing them on this for two years now,\" Moy scrawled in pen over this section of Egan's report.\n\n\n\n\n\nIn his report, Egan went further, writing that the NADOC should be a national committee made up entirely of Indigenous representatives.\n\n\n\n\n\n\"It seems to me that if this is to become a national body, NADOC should appoint a representative (preferably an Aboriginal) in each state,\" Egan wrote.\n\n\n\n\n\n\"Mr Phillip Roberts would be an ideal choice for the Northern Territory and perhaps one of our liaison officers for the ACT. Could it be suggested to NADOC that an Aboriginal be appointed in each State, NT and ACT?\"\n\n\n\nFrom National Aborigines Day to NAIDOC Week\n\nLater that year, in September 1970, the annual general meeting of the National Council of NADOC saw Indigenous representatives from across the nation attend.\n\n\n\n\n\nThese included: Dick Roughsy (Mornington Island Qld) G Winnunguj (Goulburn Island NT), Tom Williams (Foundation Aboriginal Affairs NSW), George Abudullah (WA), Lyall Munro (Moree Advancement Committee), Kath Walker (National Tribal Council), and Dulcie Flower and Faith Bandler (Federal Council for the Advancement of Aborigines and Torres Strait Islanders - FCAATSI).\n\n\n\n\n\nEgan also used his report to cheekily comment on the lack of interest in the NT about the national celebrations.\n\n\n\n\n\n\"I know at present in the Northern Territory little is done towards the observance of National Aborigines Day because it is considered to be a day on which a few 'compensation neurotics' do a bit of stirring in Sydney,\" he wrote.\n\n\n\nLISTEN TO The Next Generation celebrated by First Nations Australians during NAIDOC Week 2025 SBS News 04/07/2025 05:58 English\n\nEgan's attendance at the meeting occurred in an era of growing calls to make National Aborigines Day a proper national day.\n\n\n\n\n\n\"It seems to me that there should be a move to make it a national day in its true sense,\" Egan summarised in his report.\n\n\n\n\n\n\"I think that our role should be to make the thing financially secure as far as publications etc are concerned and thereby make it an attractive enough proposition for Aborigines to take over 'their day',\" he concluded.\n\n\n\n\n\nKen Colbung would again sit as National Chairman in 1971 with Pastor Frank Roberts, Kath Walker and Dulcie Flower joining him on the National Executive.\n\n\n\nREAD MORE Women and children were at the heart of the protest that birthed NAIDOC\n\nIn 1972, control of NADOC was given to the newly established Commonwealth Department of Aboriginal Affairs, and in 1974, the Committee had full Aboriginal representation for the first time.\n\n\n\n\n\nIn 1975, National Aborigines Day became NAIDOC Week.\n\n\n\n\n\nBy this point, Egan had already released several albums and begun to establish his reputation as a musical chronicler of outback life.\n\n\n\n\n\nHe would go on to be a member of the first National Council for Aboriginal Reconciliation and serve as administrator of the Northern Territory from 2003 to 2007.\n\n\n\n\n\nNAIDOC Week will be marked 6-13 July.\n\n\n\n\n\nThe Point airs Tuesdays 7.30pm on NITV, and is available after the broadcast on SBS On Demand .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/donald-trump-says-tiktok-sale-is-pretty-much-finalised/4nmx8idj1",
        "title": "Donald Trump says TikTok sale is 'pretty much' finalised, only needing China’s sign off",
        "publish_date": "Sat, 5 Jul 2025 07:58:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "President Donald Trump says the United States \"pretty much\" has a deal on the sale of popular short-video app TikTok.\n\n\n\n\n\nTrump told reporters on Saturday (AEST) that he would start talking to Chinese President Xi Jinping \"or one of his representatives\" early next week.\n\n\n\n\n\nWhen asked how confident he was that China would agree to the deal, he said: \"I'm not confident, but I think so.\"\n\n\n\n\n\n\"I think the deal is good for China, and it's good for us\" Trump said. \"And for us, it's money ... we make a lot of money if the deal goes through.\"\n\n\n\n\n\nThe TikTok saga started after bipartisan legislation to ban the app on national security grounds unless it was sold to American buyers was signed early last year under the Biden administration.\n\n\n\n\n\nIt was scheduled to take effect the day before Trump's inauguration in January. But since then, the US President has extended the deadline for a sale three times , giving ByteDance time to spin off TikTok's US operations into a new firm that is majority-owned and operated by US citizens.\n\n\n\nWhat do we know about the potenial buyers?\n\nByteDance has previously confirmed talks with the US government, saying key matters needed to be resolved and that any deal would be \"subject to approval under Chinese law\".\n\n\n\n\n\nFor the deal to comply with US law, ByteDance cannot own more than 20 per cent of TikTok.\n\n\n\n\n\nLate last month, Trump told Fox News a buyer had been found and could be disclosed in about two weeks.\n\n\n\n\n\nHe didn't name the potential buyers, but said they are \"very wealthy people\".\n\n\n\n\n\nIn May, Trump also mentioned that a group of buyers was prepared to pay \"a lot of money\" for TikTok.\n\n\n\n\n\nThe previous month he said China would have agreed to a deal on the sale of TikTok if it were not for a dispute over Trump's tariffs on Beijing .\n\n\n\n\n\nSeveral US media outlets reported earlier this year that TikTok's US technology partner, Oracle, could take over in a deal that would potentially include the app's American investors.\n\n\n\n\n\nAnd there have also been reports that a group called The People’s Bid for TikTok might also be a potential buyer. The group is owned by billionaire Frank McCourt, who is known as the former owner of the Los Angeles Dodgers baseball team.\n\n\n\n\n\nWith reporting by the Reuters and Agence France-Presse news agencies.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/texas-floods-at-least-43-people-dead-dozens-of-children-remain-missing/88lr9mkon",
        "title": "Texas floods: At least 43 people dead; dozens of children remain missing",
        "publish_date": "Sat, 5 Jul 2025 04:54:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Some 43 people, including 15 children, have been confirmed dead following flash floods in central Texas, authorities said as rescuers continued a frantic search for campers, vacationers and residents who were still missing.\n\n\n\n\n\nMore than 850 people had been rescued, including some who were clinging to trees, after a sudden storm dumped up to 38cm of rain in an area around the Guadalupe River, about 140km northwest of San Antonio.\n\n\n\n\n\nAmong the missing were 27 girls from the Camp Mystic summer camp, Kerrville city manager Dalton Rice said at a press conference on Saturday evening, and there may be others beyond that.\n\n\n\n\n\n\"We are kind of looking at this in two ways called the known missing, which is the 27 ... We will not put a number on the other side because we just don't know,\" Rice said.\n\n\n\n\n\nThe disaster unfolded rapidly on Friday morning as heavier-than-forecast rain drove river waters rapidly to as high as 29 feet.\n\n\n\nOnlookers survey damage along the Guadalupe River after a flash flood swept through the area. Source: AAP / Eric Gay/AP \"We know that the rivers rise, but nobody saw this coming,\" said Kerr County judge Rob Kelly, the top local official in the region.\n\n\n\n\n\nKerr County sheriff Larry Leitha said eight of the confirmed dead, including three children, had yet to be identified.\n\n\n\n\n\nTexas lieutenant governor Dan Patrick said an unknown number of visitors had come to the area for an Independence Day celebration by the river.\n\n\n\n\n\n“We don't know how many people were in tents on the side, in small trailers by the side, in rented homes by the side,\" he said on Fox News Live.\n\n\n\n\n\nCamp Mystic had 700 girls in residence at the time of the flood, according to Patrick. Another girls' camp, Heart O' the Hills, said on its website that co-owner Jane Ragsdale had died in the flood but no campers had been present as it was between sessions.\n\n\n\nThe Camp Mystic Christian summer campsite was completely destroyed. Source: AP / Julio Cortez Videos posted online showed bare concrete platforms where homes used to stand and piles of rubble along the banks of the river. Rescuers plucked residents from rooftops and trees, sometimes forming human chains to fetch people from the floodwater, local media reported.\n\n\n\n\n\nLocal officials said the extreme flooding struck before dawn on Saturday (AEST) with little or no warning, precluding authorities from issuing advance evacuation orders as the Guadalupe River swiftly rose above major flood stage in less than two hours.\n\n\n\n\n\nUS homeland security secretary Kristi Noem said a \"moderate\" flood watch issued the previous day by the National Weather Service did not accurately predict the extreme rainfall and said the Trump administration was working to upgrade the system.\n\n\n\n\n\nThe administration has cut thousands of jobs from the National Weather Service's parent agency, the National Oceanic and Atmospheric Administration, leaving many weather offices understaffed, said former NOAA director Rick Spinrad.\n\n\n\n\n\nHe said he did not know if those staff cuts factored into the lack of advance warning for the extreme Texas flooding, but said they would inevitably degrade the agency's ability to deliver accurate and timely forecasts.\n\n\n\n\n\n\"People's ability to prepare for these storms will be compromised. It undoubtedly means that additional lives will be lost and probably more property damage,\" he said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/dont-look-back-in-anger-fans-rejoice-as-oasis-plays-first-show-in-16-years/s9u7ajeea",
        "title": "Don't look back in Anger: Fans rejoice as Oasis plays first show in 16 years",
        "publish_date": "Sat, 5 Jul 2025 04:20:07 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nBold, brash, and unapologetic, Noel and Liam Gallagher are back on stage for what some say is the most highly anticipated reunion tour of the century.\n\n\n\n\n\nThe British brothers from Manchester are once again fronting Oasis, the band responsible for major hits 'Wonderwall' and Don't Look Back in Anger' and ranked among the best selling groups of all time.\n\n\n\n\n\nTheir reunion comes sixteen years after Noel left the group, saying he could no longer work with his brother Liam.\n\n\n\n\n\nNow, with the hatchet seemingly buried, the pair are performing their first comeback show at Cardiff's Principality Stadium.\n\n\n\n\n\nForming in 1991, Oasis emerged as the face of a new cultural moment in the UK.\n\n\n\n\n\nThe moment was marked by the election of Tony Blair, the rise of UK artists like Damien Hirst, and UK models Kate Moss and Naomi Campbell ruling the fashion runways.\n\n\n\n\n\nWith an unpolished and at times insolent charisma, the Gallagher brothers captured the mood of a generation.\n\n\n\n\n\nRolling Stone UK reporter Nick Reilly says their success was, in part, fueled by what they represented.\n\n\n\n\n\n\"I think the 90s generally was a period of optimism. You kind of speak of Cool Britannia and the fact that Noel was so closely aligned to Tony Blair. And I think, you know, that there was a sense of optimism in the air and Oasis were a massive part of that. So I think that that optimism and that kind of joy that they offered in their music was part of it, but also the swagger, the kind of old rock and roll spirit like you mentioned the 60s. I think in many ways this was the first time we'd seen a band since perhaps like The Stones or The Who that had that sense of swagger in British music and that sense of like unrepentant rock and roll lifestyle.\"\n\n\n\n\n\nThe band's story was always volatile, marked by repeated clashes between the brothers even before their split in 2009.\n\n\n\n\n\nThe first public clash was in 1994, when a gig in Los Angeles turned ugly after Liam flung insults at the band and chucked a tambourine at his brother.\n\n\n\n\n\nIn 1995, an interview with the brothers found its way onto a vinyl entitled Wibbling Rivalry, cementing the brothers explosive reputation in the public mind.\n\n\n\n\n\nNoel: Not at all. Not at all. Not at all. What I'm saying is, what I'm saying is you think...\"\n\n\n\n\n\nLiam: \"You get into situations...\"\n\n\n\n\n\nNoel: \"No...you think it's rock'n'roll to get thrown off a ferry, and it's not.\"\n\n\n\n\n\nLiam: \"I don't think it's rock'n' roll.\n\n\n\n\n\nNoel: You f**king...that was your quote, you prick!\"\n\n\n\n\n\nLiam: \"No it weren't\"\n\n\n\n\n\nThere were numerous public clashes between the brothers in the nineties and early 2000's.\n\n\n\n\n\nThen, in 2009, after a show in Paris ended in a backstage fight, the group announced their split.\n\n\n\n\n\nNick Reilly says after so much animosity between them, many fans never thought a reunion was possible.\n\n\n\n\n\n\"And there's so many people that are in their 40s and 50s now that will remember that as one of the key milestones of their early years. So now, if we're speaking 16 years after they split up and suddenly the fans are given a chance to relive that one more time and have this band back together, when many thought it would be impossible given how acrimonious that split was in 2009. It's natural that there will be like a clamour of those fans who will want to see them again. But also I think that there's a certain timelessness with Oasis.\"\n\n\n\n\n\nBut even in 2011, Noel Gallagher told reporters he had regrets about how things went down that night in Paris.\n\n\n\n\n\n\"I regret it really because we only had two gigs left. If I had my time again, I would've gone back and done the gigs. That gig would have been dreadful because he was out of his mind. I would have done that gig and done the next gig and we'd have all gone away and we could've probably discussed it, what we were going to do. We may never have split up, we may just have just taken a hiatus and we could have all gone and done our other thing. Liam always said he would bring down Armageddon in the end. That's the way he kind of likes things to be, you know.\"\n\n\n\n\n\nOver the next few years, the brothers both launched solo careers, but Liam was adamant he would never return to Oasis.\n\n\n\n\n\nThen in 2018, through a series of tweets, Liam changed his tune - finally raising the possibility of a reunion.\n\n\n\n\n\nHe told reporters in 2019 that he was serious about the idea.\n\n\n\n\n\n\"The most important thing is about me and him being brothers. I've got another brother who he doesn't speak to. It would be nice if all three of us would be together. Obviously, our mum is still alive, so she gets upset by it. But he thinks I'm desperate to get the band back together for money. But I didn't join the band to make money. I joined the band to have fun and get off my head and go and see the world. I'd do it for nothing if everyone else is doing it for nothing.\"\n\n\n\n\n\nWhen Oasis officially announced a reunion tour in August last year many were in disbelief.\n\n\n\n\n\nLuke Mounteney was around nine years old when the band split, he says he was certain he'd never get this chance.\n\n\n\n\n\n‘’No, I thought. No, I don't think anyone of us really truly thought it would ever happen. I'd sort of committed that my life, I would never get to see Oasis because I haven’t seen before. So when it came about that it was a real thing, I don't think my heart rate dropped for a good while until I got tickets. And I remember I sat just crying with pure, genuine joy that I'd got a ticket and it was just an unbelievable moment for life, yeah.’’\n\n\n\n\n\nWhile fans had been pleading for the group to reunite for years, website issues and controversial dynamic pricing brought outrage, with many failing to secure a spot.\n\n\n\n\n\nWhile tickets were initially shown at one price, around $300, once fans reached the front of the digital queue, many found that basic tickets were rebranded as 'in demand' and double the price.\n\n\n\n\n\nFor some fans though, no price was too high.\n\n\n\n\n\n''Kind of what I expected it to be honest you know, it's their reunion they haven't been together for literally decades at this point. So I'd be willing to pay anything to, you know, see the reunion, especially first night as well. It's incredible.''\n\n\n\n\n\nFollowing Cardiff, Oasis will tour the UK throughout July, August and September.\n\n\n\n\n\nThe group will then head to Japan, South Korea, South America, Australia and North America.\n\n\n\n\n\nFor 48-year-old Matt Hobman, this tour is not just about the music.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/whack-a-mole-comparative-advantage-is-being-redefined-by-trump-s-trade-war-20250707-p5mczh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Whack a mole: Comparative advantage is being redefined by Trump’s trade war",
        "publish_date": "Mon, 07 Jul 2025 12:16:17 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "“So, we’re going to start sending letters out to various countries starting tomorrow. They’ll range in value from maybe 60 or 70 per cent tariffs to 10 and 20 per cent tariffs,” he said. Loading “It’s a lot of money for our country, but we’re giving them a bargain,” he said, continuing to demonstrate his ignorance of the way tariffs work. Tariffs are paid when goods are landed in the US by the importer – they’re paid for by US companies, which may absorb some of the cost or pass some or all of it onto consumers. They are a tax on domestic consumption. If the tariff rates are going to range from 10 per cent to 70 per cent they will create massive arbitrage opportunities.\n\nCountries that were uncompetitive in a regime where the average US tariff was about 2.5 per cent are suddenly going to be very competitive if their rate is 10 per cent and their competitors are being hit with tariffs that are multiples of that level. The hotchpotch of tariffs that the Trump administration envisages will create chaos within the global trading system and the supply chains that support it, along with opportunities and threats for individual economies. It will also be an administrative nightmare for US customs. The US is aware that its differential tariffs could lead to attempts to game the regime and is particularly concerned that China might do what it did during the 2018-19 trade war, during Trump’s first term as president, when many Chinese exports to the US were re-routed through other Asian countries and Mexico. In the deal the administration announced with Vietnam, where it reduced the reciprocal tariff rate from 46 per cent to 20 per cent, it added a caveat. The rate will become 40 per cent on any goods or components that have been transhipped from another country. It’s seeking to impose similar, China-targeting, clauses in deals with its other major trading partners, along with other restrictions on their ability to trade with China. Given that China is also a major trading partner for most other economies, the US’ attempt to isolate China is likely to experience significant pushback.\n\nChina has already been re-directing its exports. In May, its exports to the US were 43 per cent lower than for the same month last year, but its total exports were up nearly 5 per cent. Exports to South East Asian countries were up 15 per cent and those to the European Union 12 per cent. Loading While it is unlikely that those exports flowing into Europe will be transhipped, the US will be playing “whack-a-mole” in Asia and Latin America as Chinese companies, and others, seek to exploit the new tariff regime. July 9, or whenever the new US tariff regime is in place, won’t be the end of the changes to the global trade settings. A source of considerable trade friction, and an impediment to deals with Japan, South Korea and the European Union, are Trump’s sectoral tariffs. The US has imposed 50 per cent tariffs on imports of steel and aluminium and 25 per cent on autos and auto parts.\n\nTrump has foreshadowed – the administration is compiling the necessary documentation – further sectoral tariffs on pharmaceutical products, semiconductors, timber and copper. Any deal or, more likely, tentative outlines for deals, announced this week will be vulnerable to any future new sectoral tariffs. The EU, for instance, is a major exporter of pharmaceuticals to the US. The EU accounts for about 14 per cent of all US goods imports and is America’s second-largest trade partner, behind China. While Bessent said there had been “very good progress” in discussions with the EU, and the EU itself has said it is hopeful that an agreement in principle can be signed, US demands that US companies be exempt from EU regulations and that the EU accept a 17 per cent tariff on its agricultural exports, along with the sectoral tariffs on steel, aluminium, autos and perhaps pharmaceuticals, are massive hurdles to any final deal. The EU has drawn up its own list of potential retaliatory tariffs on imports from the US, covering about €116 billion ($A209 billion) of US goods, that it could deploy if its negotiations break down.\n\nThe potential for a full-scale trade war between the US and EU is high, adding to the threat to global trade and the global economy posed by the existing trade hostilities between the US and China. Tensions between Europe and China are also mounting as China’s export volumes to the US decline but those to Europe climb. Vehicles waiting for shipment at a shipping terminal in Shanghai, China. Credit: Bloomberg Even before whatever Wednesday’s deadline for deals – or Trump’s unilaterally imposed tariffs – produces, the 10 per cent baseline tariffs and the 55 per cent rate on imports from China are having material effects. While the shifting flows of global trade are just starting to show up, an insight into their early impact on the US can be seen in US customs data, with tariff revenues hitting a record $US23 billion in May. That is a 270 per cent increase on the same month last year, a 25 per cent increase on the April number and a revenue stream that will obviously swell significantly once Trump’s post-July 9 tariff regime is in place.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/star-faces-36-5m-blow-if-queen-s-wharf-deal-flops-20250707-p5md0e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Star faces $36.5m blow if Queen’s Wharf deal flops",
        "publish_date": "Mon, 07 Jul 2025 12:09:04 +1000",
        "category": "finance",
        "authors": [
            "James Hall"
        ],
        "text": "Casino giant Star Entertainment’s bid to save a deal to sell its stake in Brisbane’s Queen’s Wharf precinct has hit a standstill, with the embattled publicly listed company revealing on Monday it will be forced to cough up nearly $37 million if the sale falls through.\n\nThe gaming group, which was on the brink of financial ruin for many months earlier this year, secured a deal in March to sell its stake in the glitzy riverside precinct to Hong Kong investors.\n\nHong Kong’s Chow Tai Fook Enterprises and Far East Consortium, who each own 25 per cent in Queen’s Wharf, last week threatened to walk away from the deal that includes them buying 50 per cent of the gaming, hotel and retail complex as well as the Treasury hotel and carpark.\n\nThe plan is for the Queen’s Wharf casino complex in Brisbane to be owned by HK investors Chow Tai Fook Enterprises and Far East Consortium, but that deal has hit a standstill. Credit: Glenn Campbell\n\nAhead of the looming deadline for the deal to fall over on Monday, Star released an update to the ASX revealing the parties involved had agreed to extend the negotiations to the end of the month.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/cabin-swept-away-with-people-still-inside-20250707-p5md2l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cabin swept away with people still inside",
        "publish_date": "Mon, 07 Jul 2025 12:04:16 +1000",
        "category": "finance",
        "authors": [],
        "text": "Cabin swept away with people still inside\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/ozzy-osbourne-plays-final-concert-sitting-on-black-throne-amid-parkinson-s-battle-20250707-p5mczf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ozzy Osbourne plays final concert sitting on black throne amid Parkinson’s battle",
        "publish_date": "Mon, 07 Jul 2025 12:01:38 +1000",
        "category": "entertainment",
        "authors": [
            "Nick Newling"
        ],
        "text": "British rock star Ozzy Osbourne has played his final concert, reuniting metal legends Black Sabbath, for the 40,000-strong show in his home town of Birmingham at the weekend.\n\nThe 76-year-old took to the stage for the first time in two years on Saturday night (Sunday AEST), performing the entire set seated on a dark, bat-winged throne, as he struggles with Parkinson’s disease.\n\nOzzy Osbourne performing on his bat-winged throne during his induction into the Rock & Roll Hall of Fame in 2024. Credit: Kevin Mazur/Getty Images for The Rock and Roll Hall of Fame\n\nDressed in a quintessential all-black ensemble, Osbourne, also a former reality star, rose from the ground seated on an enormous black throne and urged the crowd to “let the madness begin”. He later paid tribute to his fans.\n\n“I don’t know what to say, man. I’ve been laid up for like six years. You have no idea how I feel – thank you from the bottom of my heart,” Osbourne said. “You’re all … special. Let’s go crazy, come on.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/afl-considers-new-mid-season-competition-in-radical-fixture-shake-up-20250706-p5mcw1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL considers new mid-season competition in radical fixture shake-up",
        "publish_date": "Mon, 07 Jul 2025 11:59:00 +1000",
        "category": "sports",
        "authors": [
            "Sam Mcclure"
        ],
        "text": "The AFL is seriously considering introducing a secondary tournament that would run during the premiership season, award millions of dollars in prizemoney and could even offer the winning team a spot in the finals.\n\nThe idea, first suggested 18 months ago, was raised again by AFL heavyweights including chief executive Andrew Dillon when the club CEOs gathered on the Gold Coast last week and would potentially be introduced once Tasmania joins the competition as a 19th team in 2028.\n\nAFL boss Andrew Dillon met with club CEOs last week where the mid-season competition was discussed. Credit: Marija Ercegovac\n\nIt would reduce the number of rounds played in the premiership season. Under the proposal, teams would only play each other once in the premiership season, plus an additional rivalry round and Gather Round. The in-season tournament would then make up the difference to the current format, ensuring the terms of the AFL’s broadcast deal are met.\n\nFour club bosses spoken to by this masthead, who asked to remain anonymous because of the sensitive nature of the conversations, confirmed the idea was raised by the AFL last week and said they supported it in theory.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/celebrity/where-the-cheese-was-the-real-story-behind-australia-s-foul-mouthed-polymath-20250706-p5mcvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Where the cheese was: The real story behind Australia’s foul-mouthed polymath",
        "publish_date": "Mon, 07 Jul 2025 11:56:22 +1000",
        "category": "finance",
        "authors": [
            "Rob Harris"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Peter Russell-Clarke, the neckerchief-clad larrikin who became an unexpected fixture in Australian lounge rooms and taught a generation how to cook long before MasterChef, has died aged 89. Russell-Clarke was the unruliest of media pioneers – a bona fide polymath whose flair for cooking was matched only by his biting political cartoons and a sharp tongue that went gloriously rogue in a now-legendary bloopers reel, long before the internet invented “going viral”. With a trademark beret, stained smock, and a tea towel thrown over one shoulder, he was never just a cook. He was a storyteller. A painter. A provocateur. A genuine original. The sort who could poach an egg and puncture a prime minister’s ego in the same five-minute segment. A familiar face on television throughout the 1980s and early ’90s, Russell-Clarke fronted more than 900 episodes of Come and Get It on the ABC. He showed generations of Australians how to toast herbs and cook chops on residual heat, and became inextricably linked with dairy marketing via a single immortal phrase: “Where’s the cheese?” Yet, to reduce his life to a catchcry would be like calling Michelangelo a ceiling painter. Russell-Clarke was nothing less than a renaissance man with an Australian accent and a foul mouth. He was a culinary educator, but also a talented illustrator, prolific writer, advertising guru, political cartoonist, restaurateur and satirist. He was also a wine blender and a UN food ambassador. A man who once painted Dreamtime stories with Aboriginal elders in Far North Queensland and later cooked a jubilee dinner for the then Prince Charles.\n\nAdvertisement\n\nBorn in Ballarat in 1935, Russell-Clarke’s early life was marked by instability. His father, a defrocked Anglican minister, and his dressmaker mother, sent him to a Catholic boarding school in Bowral, NSW, “to get back at the Anglicans”, but didn’t bother paying the fees. His childhood, shaped by alcohol-affected parents and stints in foster care, was anything but linear. At one point, he lived with a Chinese-Australian family who taught him to cook banquet-style meals and introduced him to Eastern flavours. He would later claim these early culinary lessons formed the backbone of his intuitive, nose-first approach to food. It is difficult to know whether all his tales were true or had added garnish. He briefly lived on Melbourne’s streets, scrounging behind Bourke Street institutions like Florentino. Even then, his standards were high. He once said he’d written a letter to the chef, complaining that a discarded fish had freezer burn. “I’m buggered if I know how long I exis­ted like that, but it was a while. Good times, it made you lose weight!” he recalled in an interview years later. Peter Russell-Clarke pictured in 2013. Credit: Melanie Faith Dove That mix of refinement and irreverence would become his signature.\n\nAdvertisement\n\nBy his late teens, Russell-Clarke was working as a junior artist for one of Australia’s top advertising agencies. His job, initially, was fetching lunches. But soon he was freelancing as an illustrator and food consultant – two disciplines he would blend with great success. He went on to become political cartoonist for the Melbourne Herald, where he drew the comic strip Ben Bowyang and skewered public figures with glee and accuracy. Loading At the same time, he began illustrating for Shell, Mobil, Ford and even Boeing – work that would take him across the globe and into the homes of corporate high-flyers. But it was food, that always kept calling him back. Russell-Clarke ran one of Melbourne’s most popular restaurants, a no‑name, no‑menu venue in Carlton, often booked out 18 months in advance. Again, Charles came calling and, reportedly, he told him to “bugger off” because he was fully booked. “I cooked a silver jubilee dinner for him and the only reason they chose me is that they knew they could get away with not paying for the meal,” he once said. “The place was well ahead of its time, like a modern pop‑up. You just came and got whatever there was. It’s just too hard if someone orders off the menu.” He wrote, illustrated, or ghostwrote 35 books – including 25 cookbooks and an encyclopaedia of food. He was also, at various times, food editor for New Idea, Woman’s Day, The Age, and The Daily Mirror. For 27 years, he was the face of the Australian Dairy Corporation and the Egg Board, starring in TV commercials he often wrote and directed himself.\n\nAdvertisement\n\nThose of a certain age will remember him best as the five-minute man on ABC. Come and Get It, which aired just before The Goodies or Inspector Gadget, delivered succinct recipes in an unmistakable Russell-Clarke tone: warm, matey, occasionally bemused. Russell-Clarke’s energy remained fierce, even when he faced health challenges in his later years. “G’day!” he’d begin, and off he’d go – chatting about burnt herbs or properly cooking tomatoes (“you release a perfume”) before wrapping up with “you beaut!” and a cheeky grin. Behind the scenes, he was anything but tame. The infamous blooper reel – first passed around on email and then eventually YouTube – revealed a man unafraid to unleash torrents of profanity, frustration, and wit. The contrast between the polished, public Russell-Clarke and the mercurial off-air version only deepened public affection. Even in his later years, battered by health challenges – a heart attack, stroke and cancer diagnosis – Russell-Clarke’s energy remained fierce. Living with his wife of six decades, Jan, in Tooborac, north of Melbourne, he still cooked, still painted and still spoke with vision-impaired cooking enthusiasts about low-heat techniques. He insisted that blindness needn’t be a barrier to kitchen excellence – “It should make you a better cook,” he said. “You do it gently and slowly. Like making love.” That gentleness wasn’t always evident in his professional life. He could be abrasive, outrageous and contradictory. But there was wisdom in the way he treated food. A lamb chop deserved your attention. Herbs were to be toasted and respected. Food, for Russell-Clarke, was not just sustenance but story, art, politics and theatre.\n\nAdvertisement\n\n“There was nearly a war over Brussels sprouts, but the king of Brussels saved the day by telling the king of England how to cook them properly,” he once told a young reporter. “I don’t know if that story’s true or not, but it sounds good.” His art reflected that same narrative sensibility. He painted for commercial clients, for federal commissions, for himself. He exhibited widely around Australia and internationally, owning his own Soho Galleries on Victoria’s Bellarine Peninsula and completing a 10-storey mural series for a Lygon Street building – from rabbits underground to pigeons in the sky. Pictured in 1983. His cello paintings, inspired by musical theatre pieces he composed, portrayed instruments as people: sinuous, playful, human. In 2004, the National Portrait Gallery in Canberra requested a self-portrait for one of its exhibitions. He obliged with a piece that was part man, part mirth. After losing his home in a devastating fire while overseas, Russell-Clarke did what he always did – started again. Fifty paintings were destroyed. Four finished books went up in smoke. He said it was a blessing. “The first book I’ve rewritten is much better,” he shrugged. “I’m singing and dancing.” He famously called himself a “ratbag,” a label friends, fans and colleagues endorsed with affection.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/developer-pays-3-92m-for-st-ives-house-they-first-saw-at-the-auction-20250707-p5mczr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Developer pays $3.92m for St Ives house they first saw at the auction",
        "publish_date": "Mon, 07 Jul 2025 11:52:15 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A developer paid $3.92 million for a block of land in St Ives that they saw for the first time at auction on Saturday.\n\nThe 1,075 square metre block at 9 Myrtle Road was guided at $3.3 million and sold for $320,000 above its $3.6 million reserve.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.\n\nConsidered a knockdown, the property came with a three-bedroom house, but without photos, other than an aerial roof view and a floor plan. It was marketed as a land parcel to build a dream home or redevelop.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/touching-reason-behind-stars-pink-boots-20250707-p5md2d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Touching reason behind star's pink boots",
        "publish_date": "Mon, 07 Jul 2025 11:48:30 +1000",
        "category": "finance",
        "authors": [],
        "text": "Touching reason behind star's pink boots\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/the-whole-package-family-shells-out-for-luxury-home-with-waterslide-cricket-pitch-and-cinema-20250707-p5mczt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘The whole package’: Family shells out for luxury home with waterslide, cricket pitch and cinema",
        "publish_date": "Mon, 07 Jul 2025 11:43:24 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A luxury Stretton home with its own cricket pitch and cinema has sold for nearly double its 2021 price after three families went into bat for the keys.\n\nThe seven-bedroom, five-bathroom home at 110 The Parkway fetched $3.3 million under the hammer on Saturday, leaving the vendors ecstatic and the buyers relieved, as tight stock and falling interest rates fuel fierce competition across Brisbane.\n\nSet on a 736-square-metre block in the exclusive The Parks estate, the property came complete with a long list of lifestyle perks, including a saltwater pool, spa, outdoor kitchen and fireplace, plus a full CCTV security system.\n\nThe Stretton home was described as “one of those big lifestyle homes with big bedrooms and the whole package”. Credit: Domain\n\nBidding opened at $2 million and quickly leapt in $100,000 and $50,000 increments to $3 million, before settling into a two-horse race. In the end, a family from two suburbs away secured the keys, narrowly outpacing an underbidder who lived just one street over.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/sharemarket-steady-but-rally-sparks-sell-signal-worry-20250706-p5mcvs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX opens flat after record close and Wall Street’s high",
        "publish_date": "Mon, 07 Jul 2025 11:40:31 +1000",
        "category": "finance",
        "authors": [
            "Angus Delaney"
        ],
        "text": "The Australian sharemarket opened flat on Monday morning, after US and Australian stocks hit fresh heights last week, with both futures indicators and the dollar remaining steady.\n\nThe Reserve Bank’s monetary policy board meeting, which begins on Monday, tops the week’s economic agenda, though Donald Trump’s tariffs could once again roil markets.\n\nThe S&P/ASX 200 is down 6.8 points to 8596.2 with the bourse buoyed by the utilities sector while mining and energy stocks have sagged. The Australian dollar was fetching US65.40¢ at 10.30am AEDT.\n\nUS stock futures fell on Friday morning. Credit: AP\n\nOrigin Energy advanced 4.6 per cent, with the utilities sector up 2.6 per cent. Meridian Energy and APA Group had more modest increases, 0.7 per cent and 0.5 per cent, respectively, while Mercury NZ and AGL Energy fell 0.4 per cent and 0.5 per cent, respectively.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/only-one-bid-for-1-36m-north-melbourne-terrace-that-passed-in-but-sold-after-20250707-p5mczs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Only one bid for $1.36m North Melbourne terrace that passed in – but sold after",
        "publish_date": "Mon, 07 Jul 2025 11:36:08 +1000",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "A renovated Victorian terrace in North Melbourne passed in at auction for $1.32 million on Saturday, but sold in post-auction negotiations for $1.36 million.\n\nThe two-storey period home at 495 Abbotsford Street had a price guide of $1.3 million to $1.4 million and a reserve of $1.36 million.\n\nThere were two registered bidders, but one did not put their hand up because their finances had not been approved in time, said selling agent, Jayson Watts from Nelson Alexander Carlton.\n\nThe auction opened with a vendor bid of $1.3 million, followed by the only live bid of $1.32 million.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-australian-defence-force-facing-sexual-violence-allegations-victorian-premier-visits-east-melbourne-synagogue-following-antisemitic-attack-20250707-p5mcyb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Australian Defence Force facing sexual violence allegations; Victorian premier visit East Melbourne Synagogue following antisemitic attack",
        "publish_date": "Mon, 07 Jul 2025 11:34:57 +1000",
        "category": "finance",
        "authors": [
            "Emily Kowal"
        ],
        "text": "Melbourne acting lord mayor Roshena Campbell has praised two Lebanese brothers who stepped in after “extremist protesters” stormed an Israeli restaurant in Melbourne on Friday night.\n\nOn the same night as Friday’s synagogue attack, a group of 20 people stormed Israeli restaurant Miznon in the CBD, upturning tables, distressing diners and chanting “Death to the IDF”.\n\nSpeaking to Sky News, Campbell revealed two brothers protected “terrified” patrons and staff, and their actions captured “the true spirit of Melbourne.”\n\n“In those really dark moments there was also a great moment that I think show the true spirit of Melbourne and where we are at,” she said.\n\n“Two Lebanese brothers who owned the pizzeria across the road stepped in, they raced across, they barricaded the doors to keep the staff and patrons safe from those extremist protesters and I think that is where the community of Melbourne is at.\n\n“We stand in solidarity with our Jewish community, and we say there is no place in Melbourne for what is nothing short of hate and antisemitism that will never be tolerated in this city or this country,” she said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/melbourne-dads-fight-to-save-beloved-local-pub-20250707-p5md23.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne dad's fight to save beloved local pub",
        "publish_date": "Mon, 07 Jul 2025 11:33:14 +1000",
        "category": "finance",
        "authors": [],
        "text": "Melbourne dad's fight to save beloved local pub\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-woman-loses-arm-in-lion-attack-at-queensland-zoo-munster-to-play-origin-after-his-father-s-death-police-probe-multiple-deaths-in-homes-in-two-states-20250704-p5mcht.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Two teens arrested at airport over ‘spicy’ drug plot; Queensland zoo to reopen tomorrow after lion attack; Munster to play Origin after his father’s death",
        "publish_date": "Mon, 07 Jul 2025 11:28:36 +1000",
        "category": "finance",
        "authors": [],
        "text": "It is 22 storeys high, over one kilometre long and, yesterday, the Story Bridge officially turned 85.\n\nThe Story Bridge, pictured under construction in the 1930s.\n\nDesigned by John Bradfield in 1934 – the same man who designed the Sydney Harbour Bridge – the Story Bridge was officially opened on July 6, 1940.\n\nJoining Kangaroo Point and Fortitude Valley, it took five years to construct and is unique in being the largest bridge designed, fabricated and constructed completely by Australians.\n\nThe Story Bridge in 1958. Credit: Brisbane City Council Archives\n\nAll 12,000 tonnes of steelwork were fabricated in Rocklea at the workshop of Evans, Deakin & Co. Ltd, who were contracted to construct the bridge.\n\nThe bridge cost the State Government £1,492,000 and was later sold to the Brisbane City Council for the bargain price of £750,000.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/western-australia/burswood-racetrack-and-amphitheatre-builders-selected-20250707-p5md1o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Burswood racetrack and amphitheatre builders selected",
        "publish_date": "Mon, 07 Jul 2025 11:27:08 +1000",
        "category": "entertainment",
        "authors": [
            "Hamish Hastie"
        ],
        "text": "The group of companies that built the Boorloo Bridge has been selected to design and build the $217 million Burswood racetrack and amphitheatre.\n\nAn alliance between Seymour Whyte Constructions, Civmec and Aurecon Australasia has been announced to design and build the controversial project on the Burswood Peninsula that the state government has dubbed the Perth Entertainment and Sporting precinct.\n\nJanuary artist impression of the Perth street circuit and amphitheatre on the Burswood peninsula.\n\nThe alliance is the same group that built the $187 million Boorloo Bridge, which was completed in December last year $50 million over the original budget.\n\n“The preferred alliance team announced today have delivered some of our most iconic projects, including the new locally made Boorloo Bridge, which has become an incredible piece of public infrastructure,” Transport Minister Rita Saffioti said.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/ex-nrl-flyer-relieved-cops-012821419.html",
        "title": "Ex-NRL flyer 'relieved' after cops drop drug, cash case",
        "publish_date": "2025-07-07T01:28:21Z",
        "category": "sports",
        "authors": [
            "Adelaide Lang"
        ],
        "text": "A feted former NRL speedster has been cleared of possessing drugs and suspected stolen cash after police withdrew the charges against him at the last minute.\n\nJames Roberts, 32, who played more than 160 NRL games for five clubs during his career, pleaded not guilty to possessing a prohibited drug and suspected stolen goods.\n\nPolice allege he had 0.3 gram of cannabis and $1400 in suspected stolen cash when he was pulled over on the morning of July 30, 2024.\n\nNajee Makhoul said there was no evidence to link James Roberts to the offences. (Steven Markham/AAP PHOTOS)\n\nBut the charges against the 2015 Dally M centre of the year were withdrawn by police at a court hearing where he was scheduled to contest them on Monday morning.\n\nADVERTISEMENT\n\nOutside court, his lawyer Najee Makhoul said there had been no evidence to link the former NRL player to the offences.\n\nPolice assumed Roberts' wad of cash was illegally obtained but that was \"just not the case at all,\" Mr Makhoul said.\n\nThe retired footballer received cash payments for NRL outings and appearances, and might withdraw funds from his bank, his lawyer said.\n\n\"That was the case here, and was just a wrong charge laid for the wrong reasons, and unfortunately he faced the consequences as a result,\" Mr Makhoul said.\n\nThe small amount of cannabis likewise couldn't be linked to Roberts because it had been found in his passenger's bag.\n\nNicknamed \"Jimmy the Jet\" for his speed, James Roberts played for five clubs across 12 NRL seasons. (Joel Carrett/AAP PHOTOS)\n\nRoberts, who did not appear in court on Monday, is looking forward to putting the ordeal behind him, Mr Makhoul said.\n\n\"It's a very fortunate outcome,\" he said.\n\nADVERTISEMENT\n\n\"(Roberts) is relieved, relieved for it to be done. He wants to continue with his life and move on.\"\n\nNicknamed \"Jimmy the Jet\" for his speed, Roberts played for the Wests Tigers, South Sydney Rabbitohs, Penrith Panthers, Gold Coast Titans and Brisbane Broncos across 12 seasons in the NRL.\n\nHe appeared in all three games for NSW in the team's successful 2018 State of Origin campaign and played for the Indigenous All Stars and City Origin before retiring in 2022.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/nurses-bins-beds-duties-strike-011141064.html",
        "title": "Nurses in bins, beds duties strike",
        "publish_date": "2025-07-07T01:11:41Z",
        "category": "finance",
        "authors": [
            "Andrew Hedgman"
        ],
        "text": "Queensland hospitals are bracing for disruption as nurses escalate their campaign for a pay rise, with a new phase of industrial action actions to begin on Tuesday.\n\nThe Queensland Nurses and Midwives’ Union (QNMU) has confirmed Stage 2 of its protected industrial action will commence from 7am on Tuesday, July 8, intensifying its campaign for better pay and working conditions.\n\nWhile union officials have stressed patient safety will remain a priority, the latest action is expected to have a broader operational impact across Queensland Health facilities, with thousands of workers refusing to perform various non-clinical tasks, including making beds, delivering meals and emptying bins.\n\nQueensland hospitals are bracing for disruption as nurses escalate their industrial campaign, with a new phase of industrial action actions to begin tomorrow. Picture: NCA NewsWire / John Gass\n\nIt follows the union’s rejection of the government’s latest wage offer of an 11 per cent pay rise over three years, in favour of a 13 per cent increase over the same period.\n\nADVERTISEMENT\n\nThe government’s proposal includes staged increases of 3 per cent in April 2025, 2.5 per cent in both April 2026 and April 2027, with a final 3 per cent in December 2027.\n\nHealth Minister Tim Nicholls has described it as a “nation-leading” package that includes an “Australian-first double-time-for-overtime care package”. However, QNMU Secretary Sarah Beaman said the deal would strip Queensland’s nurses and midwives of their status as the highest paid in the country, a position they’ve held for 15 years.\n\n“We will not be gaslit, or taken for fools,” Ms Beaman said.\n\nQNMU Secretary Sarah Beaman said the Queensland Government’s deal would strip Queensland’s nurses and midwives of their status as the highest paid in the country, a position they’ve held for 15 years. Picture: Richard Walker\n\nStage 2 of the protected action, legally permitted under the Fair Work Act 2009, will see union members refuse overtime without at least four hours’ notice, take their full meal and rest breaks, and step back from administrative duties including filing, data entry, stock replenishment, and internal meetings unrelated to patient care.\n\nADVERTISEMENT\n\nOther disruptions include a refusal to clean beds, move furniture, handle non-clinical waste, or participate in Medicare admissions documentation.\n\nIn mental health services, formal national reporting tools will be paused, although clinical observations will continue to be recorded.\n\nThe first stage of industrial action began on June 5 with low-level visibility activities such as staff wearing pink or promotional shirts and email signature updates.\n\nWhile this initially led to two weeks of renewed bargaining, the union says negotiations broke down when the government “pulled the rug out” on perceived progress.\n\nHealth Minister Tim Nicholls described the governments offer as a “nation-leading” package that includes an “Australian-first double-time-for-overtime care package.” Picture: NewsWire/Tertius Pickard\n\nAlthough wages are the headline issue, the industrial action highlights a string of longstanding grievances within Queensland’s healthcare system.\n\nNurses cite burnout, poor nurse-to-patient ratios, staff shortages, especially in regional areas, and broken promises from Covid-era commitments.\n\nADVERTISEMENT\n\nSurveys have found that over 58 per cent of Australian nurses report burnout, and 71 per cent say they are asked to do more than they can manage. Almost half of QNMU members surveyed said they were considering leaving the profession.\n\nThe union is also calling for improved minimum nurse-to-patient ratios, claiming current workloads are unsafe and compromise patient outcomes.\n\nNurses cite burnout, poor nurse-to-patient ratios, staff shortages, especially in regional areas, and broken promises from Covid-era commitments. Picture: NCA NewsWire / Dan Peled\n\nA 2024 report from the Nurses Professional Association of Queensland (NPAQ) also raised concerns about centralised bureaucracy, with one administrator for every two nurses in Queensland, compared to a 1:5 to 1:7 ratio in Germany and Scandinavia, as well as a culture of fear, bullying and punished whistleblowing.\n\nThe suicides of two midwives, one a new graduate and the other senior, at the Royal Brisbane and Women’s Hospital in 2015 and 2023 were cited as tragic examples of this toxic environment.\n\nADVERTISEMENT\n\nMidwife Jackie Pulleine alleged she faced retribution after raising concerns about patient safety at Redcliffe Hospital.\n\nQNMU says increasing waitlists, chronic overcrowding in emergency departments, and the death of Baby Benson amid neonatal bed shortages are all symptoms of a broken system.\n\nMs Beaman outside Townsville University Hospital with local clinical nurse Jo Konings. Ms Beaman said the funding necessary to recruit and retain skilled humans to care for Queensland has not been appropriately allocated.\n\nThe state government has now referred the dispute to the Queensland Industrial Relations Commission for conciliation.\n\nHealth Minister Tim Nicholls said the government remains committed to delivering a “nation-leading wages deal” as part of a record $33 billion investment in the state’s health system.\n\nThat includes hiring 4,500 additional health workers over the next year, he said.\n\nHowever, the QNMU argues this investment must also be reflected in frontline wages.\n\n“The funding necessary to recruit and retain skilled humans to care for Queensland has not been appropriately allocated,” Ms Beaman said.\n\n“Multibillion-dollar health facilities without skilled staff are like a car without an engine.”\n\nWith protected action escalating Tuesday and no resolution in sight, the QNMU warns the dispute “could escalate if demands are not met”.",
        "source": "Yahoo"
    }
]