[
  {
    "url": "https://www.9news.com.au/national/high-beam-rules-australia-fines-when-to-use-everything-to-know-explained/2ad1b8eb-d38e-4000-9661-fb970cc0a83a",
    "title": "The headlight habit that could cost you $1000",
    "publish_date": "Thu, 02 Oct 2025 00:35:48 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "Millions of Australians will drive with their high beams on in 2025 without realising a few hundred metres is all that stands between them and fines of up to ﻿$1000.\n\nSome mistakenly believe high beams, typically the brightest lights on a vehicle, can only be used on dark country roads without streetlights.\n\nOthers think high beams must be﻿ switched off as soon as another car is visible on the road, but that's not true either.\n\nMisuse your high-beams and you could face fines of up to $1000. (Getty)\n\nAnd some are even in the bad habit of leaving their high beam on until right before they pass an oncoming car.﻿\n\nHere's what you need to know about the road rules for high beams and the penalties for breaking them.﻿\n\nWhat are the rules for high beams in Australia?\n\nThe Australian Road Rules ﻿ are quite specific about how high beams can be used.\n\nDrivers can use high-beams on any road or street, but they must switch to low-beam when driving:\n\nless than 200 metres behind a vehicle travelling in the same direction\n\nless than 200 metres from an oncoming vehicle﻿﻿\n\nDrivers also must not use any light on their vehicle, including high beams, to dazzle other people on the road.﻿\n\nThey may, however, ﻿briefly flash their high beams immediately before beginning to overtake a vehicle.\n\nThese rules apply in all Australian states and territories.﻿\n\nREAD MORE: Nicole Kidman officially files for divorce from Keith Urban\n\nHaving this sign on your car could land you a $2200 fine View Gallery\n\nCan you get fined for misusing your high beams?\n\nBreaching the rules around high-beam use can attract costly fines﻿, depending on where a driver is caught.\n\nThe lowest fine is in the NT, where the penalty is $50.\n\nIn Queensland it's $66, ﻿in WA it's $100, in NSW it's $140, and in the ACT the fine is $224.\n\nIn SA, fines range from $70 to $300, and in Victoria fines start at $305﻿ and can exceed $1000 if the matter is taken to court.\n\nFines in Tasmania can be up to $1025.\n\nBreaking the road rules around high-beams will also set drivers back one demerit in all states and territories.﻿\n\nREAD MORE: Brisbane doctor revealed as mother found dead alongside daughter\n\n﻿Is it illegal to flash your high beams to warn other drivers? ﻿\n\nNot specifically, but drivers who do it may still cop fines for ﻿inappropriate use of headlights.\n\n\"While flashing headlights to warn others of police presence is not a specific offence in NSW, it can result in charges for related offences such as dazzling a driver or illegal use of high beams,\" a Transport for NSW spokesperson said.\n\nState and territory fines for these offences are typically in line with those listed above.﻿\n\nDrivers may also be ﻿charged with hindering a police officer, which may attract additional penalties.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/israel-hamas-war-idf-intercepts-aid-ships-bound-for-gaza-organisers-say/e66044b2-ce9a-4010-aa85-fe88f2f3baa9",
    "title": "Australian on vessel heading to Gaza claims group has 'outsmarted' Israeli military",
    "publish_date": "Thu, 02 Oct 2025 01:31:20 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "A group of Australians on board a vessel in a flotilla of aid boats intercepted by Israel claim they have outfoxed the military and are still on their way to Gaza.﻿\n\nAustralian filmmaker Juliet Lamont﻿ said in an update on Instagram that their vessel is now 49 nautical miles – or around four hours – from the besieged Palestinian territory's coast.\n\nShe said their boat Wahoo, which is part of the Global Sumud Flotilla, has so far \"outsmarted\" ﻿Israel authorities.\n\nJuliet Lamont is on board a vessel heading to Gaza. (Instagram/@julietlamont)\n\n\"We're up the front, and they haven't got us yet, so let's keep going,\" Lamont said.\n\n\"If we can keep sort of outsmarting them, we might get there and break the siege for Palestine.\"\n\nLamont said the other activists on the vessel are prepared to put themselves in danger to provide aid to Gaza.\n\n\"Ordinary people, like myself and all the people on this boat at the moment, have been prepared to use their white privilege and put their bodies on the line to deliver this aid,\" she said.﻿\n\nIn another update shared less than an hour ago, the activists said the Wahoo had \"outmaneuvered\" Israel's military Israel Occupation Forces, a term used by critics of Israel's military , and was still going strong.\n\nThe Instagram update claimed the boat would reach Gaza today.\n\nLamont said herself and the other activisits on the vessel are prepared to put themselves in danger to provide aid to Gaza. (Instagram/@julietlamont)\n\nAt least six Australians were initially reported as having been caught up in Israel's interception of aid vessels.\n\nIsraeli authorities said the activists on board, including Greta Thunberg, were safe and being transferred to Israel.\n\nThe Global Sumud Flotilla, composed of nearly 50 boats and 500 activists, was carrying a symbolic amount of humanitarian aid to Gaza.\n\nIsraeli authorities said the activists on board, including Greta Thunberg, were safe and being transferred to Israel. (AP)\n\n﻿The Sirius, Alma and Adara boats were intercepted some 70 nautical miles from the coast of Gaza, according to organisers who shared live positions of the flotilla.\n\nThe group, which includes Nelson Mandela's grandson, Mandla Mandela, former Barcelona Mayor Ada Colau and several European lawmakers, said it remained undeterred in its mission to break the Israeli blockade and bring aid to Palestinians .\n\nToday Europe correspondent Jessica Millward spoke to Lamont before the boats were intercepted.\n\n\"They shone really bright lights into our faces. We all put the surrender hands up,\" she told Millward.\n\n\"They did about three times and now they've gone.\n\n\"Other boats are still being intercepted there. It feels like a kind of cat and mouse game.\"\n\nREAD MORE: ﻿ Rapper sought following deadly service station shooting in Sydney\n\nA screenshot of the footage from the livestream of the Gaza flotilla shows passengers on one boat appearing to be detained by military forces. (Supplied)\n\nGreg Stoker, a US veteran aboard the Ohwayla, one of the boats in the flotilla, said around a dozen naval vessels with their transponders off had approached it.\n\n\"They are currently hailing our vessels, telling us to turn off our engines and await further instructions or our boats will be seized and we will face the consequences,\" he said in a shaky video posted on Instagram while wearing a red life jacket.\n\nIsraeli authorities used water cannons against some of the boats, Stoker and other activists reported on social media.\n\nThe Israeli Foreign Ministry posted a video on X showing Thunberg sitting on a ship's deck being handed a water bottle and raincoat.\n\n\"Greta and her friends are safe and healthy,\" it said.\n\nBoats from the Global Sumud Flotilla (GSF) are seen here. (Stefanos Rapanis/Reuters via CNN)\n\nItaly's Foreign Minister Antonio Tajani said the Israeli operation was expected to take 2-3 hours.\n\nHe told state TV Rai that the boats would be towed to Israel's port of Ashdod and the activists would be deported in the coming days.\n\nHe also said Israeli forces have been told \"not to use violence\".\n\nTurkey's Foreign Ministry condemned Israel's interception of the boats denouncing it as an \"act of terrorism\" and severe breach of international law. In a statement, the ministry said it was taking initiatives to ensure the immediate release of Turkish citizens and other passengers detained by the Israeli forces.\n\nThe flotilla enters a 'danger zone'\n\nThe vessels were sailing in international waters north of Egypt and had entered what activists and others called a \"danger zone\".\n\nWhile still in international waters, it is an area where the Israeli navy has stopped other boats attempting to break its blockade in the past and which the flotilla has been warned not to cross.\n\nAfter a tense encounter with two Israeli military vessels in the early hours yesterday, activists had resumed their journey and were broadcasting their voyage on livestreams from several of the boats.\n\nThe flotilla is aiming to break Israel's longstanding maritime blockade of Gaza. (Stefanos Rapanis/Reuters via CNN)\n\nSome activists held up messages of solidarity with people in Gaza and chanted \"Free Palestine!\" on camera.\n\nMusic could be heard playing in the background.\n\nAs night fell, they detected via radar several unidentified vessels approaching them and put their life vests on ahead of the Israeli military's imminent arrival.\n\nSome activists were able to broadcast the moment Israeli forces approached them live from their smartphones before tossing their devices into the water.\n\nThe flotilla, which began its journey from the Spanish port of Barcelona a month ago, was to reach the shores of Gaza by Thursday morning, organisers had said earlier.\n\nActivists had acknowledged that scenario was unlikely and were expecting Israeli authorities to try to stop them at any moment, as they have done in past attempts.\n\nBut this flotilla, with dozens of boats, was the largest attempt yet to break the Israeli maritime blockade of the Gaza strip that has been ongoing for 18 years.\n\nThe Turkish Red Crescent giving food and medical aid to the flotilla. (Anadolu/Getty Images via CNN)\n\nIsrael and other governments had warned them to turn back\n\nThe Israeli navy had reached out to the flotilla earlier Wednesday warning them that they were approaching an \"active combat zone\" and asking them to change course, the Israeli foreign ministry said, reiterating its offer to transfer the aid to Gaza through other channels. Israel's Foreign Minister Gideon Saar called the flotilla a provocation.\n\nIsrael's government has accused some of the flotilla members of being linked to Hamas, while providing little evidence to support the claim.\n\nActivists have strongly rejected the accusations and said Israel was trying to justify potential attacks on them.\n\nEuropean governments, including Spain and Italy, which had sent their navy ships to escort the flotilla during part of its journey, urged the activists to turn back and avoid confrontation.\n\nBut while Italy's Premier Giorgia Meloni said late Tuesday the flotilla's actions risked undermining US President Donald Trump's recent proposal for resolving the war in Gaza, Spain's prime minister defended them.\n\n\"We must remember it is a humanitarian mission that wouldn't be taking place if the Israeli government had allowed for the entry of aid,\" Pedro Sánchez told reporters on Wednesday.\n\nSpaniards taking part would benefit from full diplomatic protection, he added.\n\n\"They present no threat nor danger to Israel,\" he said.\n\nMuch of Gaza lies in ruins. (AP)\n\nWhat international maritime law says\n\nThe UN Convention on the Law of the Sea stipulates that a state only has jurisdiction up to 12 nautical miles (19 kilometres) from its shores.\n\nIn general, states don't have the right to seize ships in international waters, though armed conflict is an exception to this.\n\nYuval Shany, an expert on international law at Hebrew University in Jerusalem, said that as long as Israel's blockade of Gaza is \"militarily justified\" — meant to keep out weapons — and the ship intended to break the siege, Israel can intercept the vessel after prior warning.\n\nWhether the blockade is militarily justified and the legality of the blockade is a point of contention.\n\nBut the flotilla argues they are a civilian, unarmed group and that the passage of humanitarian aid is guaranteed in international law.\n\nOmer Shatz, an Israeli international law expert who teaches at Sciences Po University in Paris and co-litigated a previous flotilla case before the Israeli supreme court, told The Associated Press that even if the disputed siege of Gaza was considered lawful, \"international law paves a humanitarian road from the high seas to Gaza — both in international and national waters off Gaza,\" he said.\n\n\"If the basic needs of the population are not provided by the occupying power, there is a right to provide humanitarian aid, albeit under certain conditions,\" Shatz said.\n\nIsrael, for example, would have a right to board and search the vessels carrying aid to verify its cargo, similarly to what it does with aid trucks crossing into Gaza by land.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/finance/elon-musk-now-worth-500-billion-us-dollars/b84b09c9-e9df-4809-b37a-e7591b862150",
    "title": "Elon Musk becomes first person worth $US500 billion",
    "publish_date": "Wed, 01 Oct 2025 22:08:02 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "T﻿he staggering wealth of Elon Musk has hit new heights, with the Tesla CEO becoming the first person to be worth $US500 billion ($756 billion).\n\nMusk hit the milestone after shares in Tesla surged nearly 4 per cent on the US sharemarket overnight, bumping up his personal wealth by $US9.3 billion, reports Forbes.\n\nThe electric vehicle maker's share price has almost doubled since April when Musk said he would be spending more time running Tesla and stepping down as head of US President Donald Trump's Department of Government Efficiency (DOGE).\n\nElon Musk could become the world's first trillionaire if shareholders adopt a new proposal that would give him unprecedented sums of money if the company reaches certain ambitious milestones. (Andrew Harnik/Getty Images via CNN Newsource)\n\nMusk's 12 per cent stake in Tesla is now worth $US191 billion.﻿\n\nBut it would be worth much more if a 2018 stock options compensation package ﻿today worth $US133 billion had not been declared void by a US court judge in January 2024.\n\nThe value of those options have been discounted 50 per cent by Forbes, awaiting the result of a current court appeal by Musk.﻿\n\nMeanwhile, his fortune could be on track to hit $US1 trillion by 2033, on the back of the Tesla's board-proposed record-breaking pay package proposed last month.\n\nThat would hand Musk additional 423.7 million additional shares of Tesla stock worth up to $US1 trillion﻿.\n\nTesla shares have recovered since Elon Musk announced he was stepping back from his role in DOGE. (AP Photo/Mahesh Kumar A.) (AP)\n\nBut he would get those shares only if the value of Tesla stock increases significantly in coming years.\n\nMusk's half-a-trillion-dollar fortune has also been bolstered by the performance of his other companies.\n\nHis 42 per cent stake in SpaceX is worth $US168 billion, while his shares in xAI Holdings, the AI company founded by Musk, are valued at $US60 billion.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/victorian-truck-space-camp-bus-crash-young-girl-reveals-suffering/68b47cb4-ec15-4c10-b0d0-f89d989f68b7",
    "title": "'I wish I had died': Girl reveals suffering after truck crashes into school bus",
    "publish_date": "Wed, 01 Oct 2025 06:29:39 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "A young girl has described wishing she had died instead of suffering a crippling foot injury, as a truck driver faced court for ploughing into her school bus.\n\n\"I am very glad I'm alive, but then none of my pain, or my suffering would be here,\" the girl, who cannot be identified, told a Melbourne court between tears.\n\n\"I'm so tired of it and I wish I had died.\"\n\nThe bus was hit and pushed through a roadside barrier, down a steep embankment and then rolled several times. (9News)\n\nThe truck driver who caused her debilitating injuries did not face the girl, nor any of his 35 victims in court today, at a County Court pre-sentence hearing.\n\nBrett Michael Russell , 63, appeared by video link from prison, crossing his arms and appearing emotionless as he pleaded guilty to 12 charges including negligently causing serious injury.\n\nHe was driving a prime mover truck towing two trailers - all of which had defective brakes - from northwest Victoria to Melbourne when he collided with the Loreto College Ballarat bus in 2022.\n\nRussell, prosecutors say, knew all of the brakes were faulty but drove the truck anyway.\n\nAbout 3.16am on September 21, the truck hurled into oncoming traffic and collided with the bus, which had 32 passengers on board including 27 school students, on the Western Freeway.\n\nThe group were on their way to Melbourne Airport for the trip of a lifetime to NASA camp in the US.\n\nRussell's truck hit the back of the bus, which had slowed for traffic management and was pushed through a roadside barrier, down a steep embankment and then rolled several times.\n\nProsecutors say Brett Russell knew all of the brakes were faulty but drove the truck anyway. (9News)\n\nThree passengers were ejected from the bus and the rest were trapped inside, with traffic management workers rushing to their rescue before emergency services arrived.\n\nRussell pleaded guilty to 10 counts of negligently causing serious injury to seven students, whose ages ranged from 14 to 18, and three staff including Suzanne Fraser, 52, and Narelle Mulrooney, 49.\n\nHe also pleaded guilty to reckless conduct related to driving the B-double truck while knowing the truck and trailers' brakes were defective, placing the bus driver, Wayne Orr, who is yet to return to full-time work, and 21 other passengers in danger of serious injury.\n\nRussell further admitted a 12th charge of reckless conduct endangering serious injury relating to three roadside workers - Liam Ryan, Brendan Morris and Rodothea Kalisperis.\n\nAbout 50 people are attending today's hearing, including victims and their loved ones, with many of them due to read out statements on how the crash impacted them.\n\nA 15-year-old girl described in her darkest moments wishing she had died in the crash, so that she did not have to suffer from extreme pain in her leg and foot after undergoing several surgeries.\n\nTruck driver Brett Russell faced Melbourne Magistrates Court. (9News)\n\n\"I don't want a funky-looking leg, I want a normal leg,\" she told the court.\n\n\"I just want to be like everyone else.\"\n\nRussell admitted to police when he was interviewed about the crash that he knew there was a risk in towing two trailers and driving a truck with defective brakes.\n\n\"Yes. And I still took the risk,\" he told police, prosecutor Jim Shaw told the court.\n\nShaw said Russell breached his duty of care by being criminally negligent and fell greatly short of the standard of care a reasonable person would have exercised in continuing to drive the truck.\n\n\"He knew that he would be driving on parts of the road which had steep descents that would be difficult to navigate with brakes that did not work,\" the prosecutor said.\n\n\"He also knew the risks to other road users if he were unable to stop the truck.\"\n\nThe pre-sentence hearing continues this afternoon.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/queensland-jim-chalmers-press-conference-interrupted-by-scared-resident/9185c785-112e-41ba-b0bb-c21afa431a63",
    "title": "'Deeply scared' woman interrupts treasurer's press conference with plea",
    "publish_date": "Wed, 01 Oct 2025 04:56:43 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "A﻿ local resident interrupted Treasurer Jim Chalmers' press conference in Queensland to ask the government for help following a \"horrific\" attack on her home.\n\nChalmers was speaking at a media conference in the Brisbane suburb of Logan when a woman, later identified as Anoushka Arro, said she had a plea for the state's Minister for Housing Sam O'Connor.\n\n\"I recently have been the victim of an absolutely horrific, catastrophic event at my home, where the front gate was ripped off of my property onto the road,\" she said.\n\nThe woman was identified as Anoushka Arro. (9News)\n\n\"I live in fear. I have emailed him. I have tried to get some sort of resolve for the situation I am living under.\n\n\"I have counsel who are now assisting [me] but I am not being given anything from the state government.\"\n\nArro, who previously ran as a Logan City Council candidate, claimed tenants of public housing on her street have been harassing her.\n\nShe told Chalmers she can't leave her home because she is so \"deeply scared\".\n\n\"I want something addressed. I am shaking because I am so fearful and scared,\" she added.\n\n\"I can't leave my home, this person has a network of hoons, who drive past my house.\"\n\nChalmers said he was ﻿sorry to hear the woman was going through a difficult time.\n\nREAD MORE: Nicole Kidman officially files for divorce from Keith Urban\n\nChalmers was speaking at a media conference in the Brisbane suburb of Logan. (9News)\n\nREAD MORE: Brisbane doctor revealed as mother found dead alongside daughter\n\nHe asked for a private conversation to discuss the matter and said he would involve local MP for Nudgee Leanne Linard.\n\n\"What we'll arrange is, if we can have a private conversation and get your details, if Leanne (Linard) is your state member, we'll make sure that Leanne makes that representation to Minister O'Connor's office in the Crisafulli government, and we'll follow that up for you,\" he said.\n\n\"We're so sorry you are going through this very traumatic period and we will do what we can to represent you and represent your interests.\n\n\"Thank you for raising it with us.\"\n\nAfter Chalmers responded to a question from a journalist, the woman was seen shaking and crying.\n\n﻿The treasurer was speaking in Brisbane about a pay bump for aged care workers.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/dartbrook-coal-mine-to-go-into-care-and-maintenance/105842500",
    "title": "Controversial Hunter Valley coal mine mothballed after failed revival",
    "publish_date": "Thu, 02 Oct 2025 01:34:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "A struggling New South Wales coal mine has announced plans to stop running less than a year after its new operators tried to revive it.\n\nDartbrook Mine, an underground thermal coal joint venture by Australian Pacific Coal and Tetra Resources, will go into care and maintenance in mid-November, the ABC understands.\n\nThe Hunter Valley mine had been idle for 19 years until it was resurrected at the end of 2024.\n\nBut in July, the mine plunged into administration and receivership, after failing to meet its obligations for a $202 million loan from Singaporean commodities giant Vitol.\n\nSince then, the venture has been limping along with more than 100 miners, or more than two-thirds of Dartbrook's workforce, terminated within weeks of receivers taking over.\n\nAbout 50 workers remain at the mine.\n\nDo you know more about this or have a similar story? Email turner-cohen.alex@abc.net.au\n\nOn Wednesday, one of its joint operators, Australian Pacific Coal, suspended trading on the Australian Securities Exchange.\n\nIt could not finalise its accounts due to incomplete financial information from the Dartbrook Mine, its principal asset.\n\nThe ABC understands some workers were told verbally later that day that the mine was going into care and maintenance mode, and others only learned about it on Thursday morning.\n\nFTI Consulting, the firm acting as the receiver operating the site, provided a statement to the ABC confirming its plans to stop underground mining, but said so far, operations remained unaffected.\n\nJeff Drayton is baffled by the decision to suspend the mine's operations. (ABC News: Jake Lapham)\n\n\"Following an operational review, the Receivers and Managers of Dartbrook Coal Mine are proposing to suspend underground mining operations,\" the statement said.\n\n\"Operations at the coal handling and preparation plant remain unaffected.\"\n\nThe Dartbrook Mine currently has about 150,000 tonnes of coal stockpiled.\n\nThe receivers also said they had been provided funding to pay entitlements to affected workers, and that a workforce consultation was underway.\n\nWorkers at the site told the ABC that they had been informed it would take four to six weeks to suspend operations, with that time needed to remove equipment from the site.\n\nMuswellbrook Shire Mayor Jeff Drayton said he \"couldn't think of a worse decision\".\n\n\"You're trying to sell a coal mine and trying to get an extension, who would make a decision to put that into care and maintenance?\" he said.\n\nOn top of its $200 million debt to Vitol, Dartbrook owes several million dollars to other creditors.\n\nCr Drayton has previously said Dartbrook also owed the Muswellbrook Shire Council years worth of unpaid rates.\n\nThe mine was previously operated by Anglo Coal, but was put into care and maintenance in 2006.\n\nIt sat empty until the end of last year, when the Tetra-Australia Pacific Coal joint venture got it up and running.\n\nDeloitte is acting as the administrator of several entities relating to Tetra Resources, while insolvency firm McGrath Nicol is administering entities involved with Australian Pacific Coal.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/west-coast-bushfires-review-finds-flaws-tasmanian-response/105841250",
    "title": "Fatigue, cramped HQ and COVID hampered west coast fire effort, review finds",
    "publish_date": "Thu, 02 Oct 2025 01:17:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "A review of the response to last summer's bushfires on Tasmania's west coast has highlighted a cramped firefighting headquarters, fatigue issues, frustrated volunteers and an overall fragmented response system.\n\nThe fires burnt more than 101,000 hectares in February and March, including 9,400 hectares in the Wilderness World Heritage Area, while fires came within several kilometres of the township of Zeehan.\n\nIt included three main firegrounds: Canning Peak, Yellowband Plain and Mount Donaldson.\n\nThe fires (in orange) burnt more than 100,000 hectares. (ABC News: Paul Yeomans)\n\nThe Canning Peak fire burnt 295 hectares of threatened native vegetation, including king billy pine and pencil pine, while the Mount Donaldson fire destroyed key organic soils.\n\nThe fires came after a period of \"significant rainfall deficits\" on the west coast, followed by 1,227 lightning strikes causing 24 individual fires.\n\nIt saw the loss of 4.5 kilometres of boardwalk on the Overland Track, and a further 1.4 kilometres on other tracks, along with a commercially owned hut.\n\nThe fires came close to Zeehan, on the west coast. (ABC News: Paul Yeomans)\n\nTasmania's fire agencies requested an external review of its operations by the Australian and New Zealand Council for fire and emergency services (AFAC), which has made 20 recommendations.\n\nIt described the emergency management sector as \"mature and transparent\", but pointed out instances in which Tasmania's emergency services encountered issues due to resourcing and coordination problems.\n\nThis included the Incident Management Team headquarters in Burnie being too small, resulting in a COVID-19 outbreak to \"spread quickly\" due to staff working in close proximity.\n\nThe fires continued burning for several weeks. (ABC News: Maren Preuss)\n\nA week after the fires started, the Tasmania Fire Service (TFS) changed its fatigue management policy, which WorkSafe later ruled was unreasonable and \"had the potential to affect the health or safety of workers\".\n\nVolunteers were left frustrated by what they described as a \"hurry up and wait\" approach, in which they were sent to firegrounds at short notice, and then told they did not have enough information to be used.\n\nThe review pointed out that this, and other issues, were caused by a lack of overnight Incident Management Team.\n\n\"During the West Coast fire complex, due to the absence of night-time operations, intelligence gathering was hampered and delayed access to line scanning data,\" the review reads.\n\nThis delayed strategic planning to start the next day, the review stated.\n\nWorkSafe later ruled the fatigue management policy for the fire response was unreasonable. (Tasmania Fire Service)\n\nIt also found there was a limited pool of personnel qualified to manage major fire incidents, which exacerbated workforce issues and created gaps in backfilling.\n\nThe total cost of the firefighting effort was estimated to be $30 million, about a quarter of the State Fire Commission's annual budget.\n\nOne winch-capable aircraft is 'insufficient'\n\nTasmania has only one winch-capable aircraft, which had to be relied on hundreds of times, the review stated.\n\n\"It is clear that a single winch-capable aircraft is insufficient to effectively combat multiple ignitions and a large-scale, remote area bushfire scenario that was the West Coast complex,\" the review reads.\n\n\"During the fire complex, the winch was used approximately 250 times.\"\n\nOnly one winch-capable helicopter was available for the fire response. The winch was used about 250 times. (Tasmania Fire Service)\n\nA Tasmanian oval has been transformed into a tent city for firefighters Photo shows A man in a fire fighter uniform stands in a tent with his arms crossed. As firefighting efforts continue in Tasmania's west, a tent city has been erected on the Tullah sports oval. Meet the people working to provide crews with a home-away-from-home.\n\nIt noted that the winch was provided for four years as part of recommendations from the 2018-19 fires, but its funding ended in June this year.\n\nA government spokesperson said winch capability was \"being considered as part of the budget process\".\n\nThe Strategic Coordination Group — made up of the state's three fire authorities — will review the recommendations.\n\nThis includes a recommendation for increased prescribed burning and mechanical clearing near population centres and urban boundaries.\n\n\"We are confident that the industry will make practical use of the lessons from the 2025 West Coast fire complex,\" the review reads.\n\nGovernment to learn from review\n\nOther issues included the \"fragmented\" nature of Tasmania's emergency services system, which operate without a centralised body or oversight.\n\nFive maps to help you visualise Tasmania's massive wilderness fires Photo shows GFX 5 Tasmania North West fires The bushfires on Tasmania's west coast have now burned just under 95,000 hectares in hard-to-access terrain.\n\nEmergency Management Minister Felix Ellis said the personnel involved had responded in an outstanding way.\n\n\"The west coast fire caused significant environmental, economic, and social disruption, but notably, there was no loss of human life, no significant injuries, and minimal damage to built assets,\" he said.\n\n\"Learnings from the review will further enhance Tasmania's operational capabilities and support continuous improvement and collaboration across our organisations.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/rheed-mccracken-wins-world-para-athletics-championships-silver/105842664",
    "title": "McCracken wins silver as Arnhem teen starts quest to be 'just like Cathy'",
    "publish_date": "Thu, 02 Oct 2025 00:12:05 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's Rheed McCracken has had to settle for his second silver of the World Para Athletics Championships, despite watching the 100m T34 world record holder get disqualified for a false start.\n\nMcCracken added the 100m to his 400m silver a day earlier, once again unable to get past Thailand's Chaiwat Rattana at New Delhi's Jawaharlal Nehru Stadium.\n\nIt marked the third time in two years that the pair have shared a podium at major meets, with McCracken taking bronze as Rattana claimed 800m T34 gold at last year's Paris Paralympics.\n\nNeither had to compete with world record holder Walid Ktila after the 40-year-old 14-time world champion was disqualified for a false start.\n\n\"I executed the race I wanted to, and it was just too fast in the back end for me. I didn't have the pace in the last little bit,\" McCracken said.\n\n\"I felt like I got away really well, better than maybe next to me, but I didn't have the top-end speed, and that's racing. We all turn up here to try and win, and only one person can.\"\n\nMcCracken finished just 0.04 of a second behind Rattana's 15.00, returning to the 100m podium for the first time since the Tokyo Paralympics after falling 0.12 of a second short in Paris.\n\n\"I'm definitely happy. I was fourth in the 100m last year, and maybe that's a little bit of athletics karma. I got bronze in the 800m by a small margin that time [in Paris] and this time, it fell the other side,\" he said.\n\nMeanwhile, 17-year-old Briseis Brittain made her international debut.\n\nLike teammates Rhiannon Clarke and Layla Sharp, she did not make it out of the 200m T38 heats, but it marked the start of her journey towards emulating idol Cathy Freeman ahead of the 400m on Saturday.\n\n\"I am the first Arnhem Land from Ramingining to be competing at this level, and it's cool. I like Cathy Freeman, she was really amazing and talented,\" Brittain said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I want to be like her, and here I am, I am here right now, and I hope Cathy Freeman will see this. I'm so excited to do the 400m just like Cathy.\"\n\nElsewhere, 1,500m T13 bronze medallist Jaryd Clifford was unable to climb back onto the podium in the 5,000m, fading in the final laps to finish fifth.\n\n\"I want to assure everyone that I'm sure there is going to be a turning point in my career where I don't finish every single race and be a little bit disappointed,\" Clifford said.\n\n\"What we're doing is a long-term game and a long-term strategy, and I have faith it's going to work.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/helen-garner-diaries-baillie-gifford-prize-how-to-end-a-story/105841834",
    "title": "Helen Garner's 'candid, pacey' diaries up for $100k international prize",
    "publish_date": "Wed, 01 Oct 2025 23:02:44 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Helen Garner has been shortlisted for the prestigious Baillie Gifford Prize for non-fiction, worth 50,000 British pounds ($101,000), for her collected diaries: How to End a Story.\n\nThe diaries span 20 years, from 1978 to 1998, and chart much of the celebrated Australian author's career and personal life, including the aftermath of the release of her semi-autobiographical first novel, Monkey Grip (1977).\n\nWhen her first book came out, Helen Garner was criticised for simply publishing her diaries. She denied it, until 2002, when she said: \"I'm too old to bother with that crap any more.\" (Supplied: Darren James)\n\nHow to End a Story offers an insight into Garner's writing process, including her eye for beautiful, sometimes troubling, often absurdly funny details, while at the same time offering an unflinching look at painful moments in her life.\n\nThose moments include the backlash to the publication of The First Stone (1995), about a sexual harassment case at an Australian university; and her affair, marriage and break-up from fellow writer Murray Bail.\n\nThe Baillie Gifford judges — chaired by literary editor Robbie Millen — described How to End a Story as \"candid [and] pacey\".\n\n\"Told with devastating honesty, steel-sharp wit and an ecstatic attention to the details of everyday life, it offers all the satisfactions of a novel alongside the enthralling intimacy of something written in private and just for pleasure,\" Millen said.\n\nSpeaking to ABC Arts last year, American author Leslie Jamison — who wrote an introduction to the US release of How to End a Story — said she loved how Garner's diaries reckon with \"the anxiety that telling more personal or domestic stories doesn't matter as much\".\n\nThe 2025 Baillie Gifford Prize shortlist The Revolutionists: The Story of the Extremists Who Hijacked the 1970s by Jason Burke\n\nHow to End a Story: Collected Diaries by Helen Garner\n\nThe Boundless Deep: Young Tennyson, Science and the Crisis of Belief by Richard Holmes\n\nCaptives and Companions: A History of Slavery and the Slave Trade in the Islamic World by Justin Marozzi\n\nLone Wolf: Walking the Faultlines of Europe by Adam Weymouth\n\nElectric Spark: The Enigma of Muriel Spark by Frances Wilson\n\n\"The same person who wrote The Children's Bach wrote This House of Grief,\" she said.\n\n\" One can pay attention to the everyday and the ordinary and find profound truth there, and also pay attention to the extraordinary or the dramatic or the newsworthy and find a great truth there. \"\n\nThe Baillie Gifford Prize is an annual award for non-fiction books published in English in the UK in the preceding year.\n\nThe rest of the shortlist features five British authors, including two past finalists, whose works also explore the writing life: Frances Wilson, for her biography of author Muriel Spark; and Richard Holmes, for his biography of Alfred Lord Tennyson as a young poet.\n\nIt is the third year in a row that an Australian writer has been shortlisted for the Baillie Gifford, after historian Christopher Clark in 2023, and Richard Flanagan, who won last year's prize for Question 7.\n\nFinding an international audience at 82\n\nSpeaking of the prize in September, Garner said she was \"bewildered\" to even be longlisted. \"How do they even know I exist?\"\n\n\"Everything I've ever written has been very close to my personal experience and to my life, at various distances,\" Garner told The Book Show. (Supplied: Text)\n\nShe told them about her approach to writing in her diary: \"I am trying to write as well as I can, to make my sentences clean and springy, and never to bore myself.\"\n\nWhile she cut repetitions, irrelevant musings, and things that would \"pointlessly hurt\" people from the book, she wanted to \"be as brazen about my own experiences as I could stand\".\n\n\"This turns out to be one of the things that readers tell me they like about the diaries,\" she said.\n\n\" It's a way of connecting with strangers. The opposite of loneliness. \"\n\nGarner told ABC Radio National's The Book Show in 2020, as the second volume, One Day I'll Remember This, was released in Australia, she didn't want to ask people's permission to publish sections of the diaries.\n\nListen to Helen Garner on The Book Show in 2020 Photo shows Author Helen Garner, pictured looking solemnly at the camera against a dark background.\n\nInstead, she offered to show people close to her the passages about them. Only one person took up the offer, the others saying: \"Go right ahead, I trust you.\"\n\n\"That was a wonderful thing for me,\" Garner says.\n\n\"I think there are some people who would be pretty unhappy about having appeared in it, but somehow I feel alright about that. I don't feel I've ratted on anybody.\"\n\nGarner becoming a Baillie Gifford finalist at 82 is further proof the international literary community is in the midst of a decade-long rediscovery of her oeuvre.\n\nThe cover of the forthcoming Australian edition of How to End a Story: Collected Diaries 1978-1998. (Supplied: Text)\n\nIn 2016, she won the $US150,000 ($200,000) Windham Campbell Prize for non-fiction for her body of work; and in 2023, her novel The Children's Bach (1984) and non-fiction book This House of Grief (2014) were released in the US for the first time.\n\nThis year, This House of Grief, about the murder trial of Robert Farquharson, was the monthly read of British pop star Dua Lipa's wildly popular book club, while Sarah Jessica Parker's Carrie Bradshaw was spotted reading the same book in the final season of And Just Like That…\n\nFirst published in Australia in three separate volumes, the full collection How to End a Story will be released by Garner's local publisher, Text Publishing, in November.\n\nGarner's most recent book is The Season, a \"tender portrait of masculinity\" about her grandson's AFL team, while her book about the \"mushroom murder trial\", with fellow writers Chloe Hooper and Sarah Krasnostein, is due out next month.\n\nA controversial sponsor\n\nLast year, fellow Australian author Richard Flanagan refused to accept the prize money until sponsor Baillie Gifford put forward a plan to reduce its investment in fossil fuels and increase investment in renewable energy.\n\nABC Radio National's Top 100 Books of the 21st Century Top 100 Books is Radio National's new annual countdown where we hand over the reins to you to vote for your favourite books, and then we celebrate the Top 100 in a big weekend broadcast!\n\nThe investment management firm had been criticised for investing in fossil fuels and companies linked to Israel.\n\nIn 2024, the company withdrew from its sponsorship of nine literary festivals in the UK, including the Edinburgh International Book Festival.\n\nFlanagan ultimately declined the Baillie Gifford Prize money, which will be donated to a literacy charity.\n\nThe winner of the 2025 Baillie Gifford Prize will be announced on November 4, UK time.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/doug-cross-butcher-buys-innisfail-meatworks-to-expand/105830022",
    "title": "'Innovative' butcher covers supply chain after buying Qld meatworks",
    "publish_date": "Wed, 01 Oct 2025 22:55:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "A Far North Queensland butcher is expanding to provide an \"innovative\" end-to-end supply chain for beef producers and consumers.\n\nWhat started as Doug Cross's small butcher shop seven years ago has since expanded with an on-site boning room and established brand, Altitude Beef, supplying businesses and consumers throughout Queensland and interstate.\n\nMr Cross said purchasing the meatworks at Innisfail in June — about 100 kilometres away from the Atherton shop — marked the next logical step towards securing the brand's future.\n\nHe said it paved the way for more supply chain control while ensuring the process remained local once the facility was operational.\n\n\"I believe just ensuring that continuity of the processing side of it,\" he said.\n\nUnder the brand Altitude Beef, Doug Cross is currently producing 20,000kg of meat a week. (ABC Rural: Sophie Johnson)\n\nSourcing premium grass-fed, flat back cattle from about 80 Tablelands and Cassowary Coast graziers, the butcher said acquiring the meatworks presented a unique opportunity.\n\n\"I just thought that there's a niche market in North Queensland to do something with our beef up here,\" he said.\n\nMr Cross sends out 20,000 kilograms of meat — or 70 head of cattle — a week.\n\nHe hopes to increase that to 100 once the Innisfail meatworks opens.\n\nDoug Cross produces his beef product from locally sourced cattle. (ABC Rural: Sophie Johnson)\n\nThe brand supplies dozens of retailers and restaurants across Queensland, the Northern Territory and New South Wales.\n\nHe said working closely with producers, wholesalers and customers to build the business had resulted in strong support from the community.\n\n\"There's big demand … I think because we aren't one of the big multinationals, we're just a husband and wife show with an awesome crew of staff behind us just having a crack,\" he said.\n\n\"I can tell you in that box [of meat] whose cattle that is, where their farm was from, all their stories, everything.\"\n\nDoug Cross also produces his own cattle for the brand. (ABC Rural: Sophie Johnson)\n\n'Innovative' business model\n\nIndustry group Meat and Livestock Australia (MLA) said it was unique to see a butcher cover nearly all aspects of the processing supply chain.\n\n\"I think it's a fantastic initiative,\" Scott Cameron, MLA Group Industry Insights and Strategy Manager, said.\n\n\"It's very innovative and it's actually a very interesting way of being able to bring meat to market to consumers having that vertical end-to-end supply chain.\"\n\nMr Cameron said, despite a cost-of-living crisis, retail meat sales had increased domestically along with the price of beef.\n\nThe name Altitude Beef was based on the location, with the Atherton Tablelands being the highest point in Queensland. (ABC Rural: Sophie Johnson)\n\nHe said there were a few reasons for this, including a shift in consumer habits.\n\n\"We're actually seeing bit of a move away from food service into at-home consumption,\" he said.\n\n\"And because it's a little bit cheaper to eat at home than going out to dinner and nice restaurants, people are affording to buy high-quality meats and … cooking them at home.\"\n\nLocal farmers praise\n\nNick Trompf, a North Queensland stud stock breeder from Tallangalook Santa Gertrudis, Angus and Shorthorns, said accessing the meatworks at Innisfail would save costs and a 500-kilometre round trip to Townsville.\n\n\"One of the challenges in the Far North is there's only one major meatworks here and that's JBS in Townsville,\" he said.\n\n\"There's a fair bit of freight associated with that, obviously.\"\n\nNick Trompf says being able to use the meatworks at Innisfail will save a lot of transport. (ABC Rural: Sophie Johnson)\n\nMr Trompf said it had been inspiring to see Mr Cross's contribution to the growth of the beef industry in the Tropics.\n\n\"He's been at the forefront of the introduction of a lot of new breeds by encouraging people to crossbreed and to build the quality of their beef, and the consumer base from that beef over a number of years,\" he said.\n\n\"Since he launched his single butcher shop in Atherton and was courageous enough to pitch it at the high end of the market … he's been incredibly successful.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/nicole-kidman-keith-urban-what-couples-separating-can-expect/105837112",
    "title": "What couples can expect when separating after a long relationship",
    "publish_date": "Wed, 01 Oct 2025 22:10:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "If you're experiencing a separation after spending decades with your partner or spouse, you are not alone.\n\n\"Silver splitting\" or \"grey divorce\" is on the rise in Australia, according to psychologist and university lecturer Rachael Sharman.\n\nNicole Kidman has filed for divorce from Keith Urban after 19 years of marriage. (AP: Jordan Strauss/Invision)\n\n\"And their demographic is becoming more common,\" she says.\n\nAussie A-listers have Nicole Kidman and Keith Urban have separated, with the actress filing for divorce after 19 years of marriage to the country singer.\n\nWe spoke with experts about how you can navigate this difficult time both personally and professionally.\n\nWhat is separation and how is it different to divorce?\n\nIn Australian family law, separation refers to the situation where a couple, whether married or in a de facto relationship, decides to end their relationship and live apart.\n\n\"Separation occurs when at least one person in the relationship makes the decision to separate, acts on that decision and tells the other person,\" Legal Aid Queensland says.\n\n\"Your partner doesn't have to agree.\n\n\" You can be separated and still be living in the same home. \"\n\nDivorce is the formal process of officially ending a legal marriage, which starts with an application for divorce.\n\nThere is no formal legal process required for separation, but experts say it is essential to note the date of separation as it has implications for divorce, property settlements, and financial matters.\n\nSeeking out the right supports\n\nDr Sharman, from the University of the Sunshine Coast, on Kabi Kabi Country, recommends people seek financial guidance and a professional mediator to help them navigate the separation process, especially if there are children, shared assets and finances involved.\n\n\"I think the support that I see people lacking in is financial, particularly if you've not been the person to manage finances,\" she says.\n\nDr Sharman says screen time increased across the world during the pandemic. (Supplied: Rachael Sharman)\n\n\"Rather than necessarily racing off to the psychologist, I would probably suggest people head off to a financial planner and figure out exactly how are you going to live single.\"\n\nShe says a low or no-cost mediator, through Relationships Australia for example, can be a useful for navigating financial, property and parenting agreements.\n\n\"So, mediation will really help the separating couple come to a reasonable agreement over how you want to manage this and the separation of property, without involving the lawyers.\"\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nFamily law expert Geoffrey Sinclair says there are a few key things people should consider after a separation, including their capacity to borrow money.\n\n\"That's something that people don't really think about, particularly in circumstances where they've been able to borrow all their life,\" he says.\n\n\" As they get older, it gets harder to get money. \"\n\nSeparation could also affect superannuation, the terms of a will and enduring power of attorney, including decisions about health care.\n\nHow to navigate telling family and friends\n\nIn a separation that follows drifting apart or falling out of love — as distinct from a separation involving violence or abuse, which this article doesn't discuss — it's normal for people to feel shame or embarrassment.\n\nMelbourne/Naarm psychologist Juniper Muller, who works with LGBTQIA+ clients, encourages people to lean on their supports when they're going through a break-up — and to get in early.\n\n\"Sometimes you want to keep it really private,\" she says.\n\n\"But in fact, often that just isolates you and makes you feel really alone.\n\nSigns a relationship may be over Photo shows couple standing opposite one another in living room crop If you are feeling indifferent about your relationship, have high conflict, or just don't really enjoy their company anymore, it is possible the partnership has reached its end.\n\n\" If you're running into troubles in your relationship, don't wait until the break-up to talk to your friends or community about it. \"\n\nDr Sharman recommends a couple has a plan of how living arrangements and custody will possibly work, before they tell their children or close family members.\n\n\"I think it's a sit-down, face-to-face conversation, 'look we've come to this decision, this is what we're doing',\" she says.\n\n\"If it's a 'we don't know where we're living, we don't know what's going on with custody', people are going to really, really worry about you.\"\n\nShe says couples should not naturally assume their children will take the news well just because they may be older teenagers or young adults.\n\n\"I think there's an assumption that because they're not young they'll be fine; in fact some young adults can completely freak out,\" she says.\n\n\" So, make sure when you do sit down with people, you do sort of have some sort of plan that you can share with them. \"\n\nHow to navigate telling an employer or colleagues\n\nDr Sharman says deciding how to tell your employers and work colleagues you are separating is a \"deeply personal\" choice.\n\n\"I've seen people who've raced in and told everyone and had counselling with everyone up and down the hallway,\" she says.\n\n\"And then I've seen other people play their cards really close to their chest and for their workmates to maybe not realise until after a year or two after the whole thing's gone down.\"\n\nRelationship coach Megan Luscombe says people are not under any obligation to tell their employer or colleagues about their separation. (Supplied: Megan Luscombe)\n\nMegan Luscombe is a relationship coach based in Boonwurrung/Mount Martha, on Victoria's Mornington Peninsula.\n\nShe encourages people to decide for themselves what, if anything, they want to disclose.\n\n\"They may use boundary statements during disclosure such as, 'I'm navigating a separation with my husband/wife/partner right now and whilst I won't be talking further about it, I wanted to let you know,'\" she says.\n\n\"This is completely up to the individual and what works for one, might not suit the other.\"\n\nUnderstanding your separation style\n\nMelbourne-based family lawyer Dani Zetzer encourages her clients to take responsibility for their part in a separation.\n\n\"But I think that in order to speed up the process of healing, we need to consider, 'Well, hang on, what did we bring to the table?' she told ABC Radio National's Life Matters.\n\nLoading...\n\n\"That's a hard question to ask of ourselves when we're going through a really hard time, but I really think it's the key.\"\n\nMs Zetzer, who has worked with clients going through divorce for over a decade, says she's observed different types of people in a break-up.\n\nAdd to your watchlist Photo shows Mystery Road Origin ABC iview with young detective Jay Swan in the bush. The critically acclaimed Mystery Road: Origin returns as Detective Jay Swan (Mark Coles Smith) and Mary (Tuuli Narkle) uncover dark secrets in a haunted timber town, where the past threatens to tear them apart.\n\nThey include the person still holding onto hope of reconciliation, the person who \"micromanages everything … out of fear\", the person avoiding reality who has \"their head in the sand\", and the person \"really stuck in the past\" and struggling to move on.\n\nThe categories aren't scientific, but Ms Zetzer believes they are useful for people in a separation to consider to for understanding and empathy.\n\nThis article contains general information only. You should consider obtaining independent professional advice in relation to your particular circumstances.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/geraldton-medical-imaging-petition-hospital-redevelopment/105822158",
    "title": "Patients struggle to cover medical scan costs they say should be free",
    "publish_date": "Wed, 01 Oct 2025 21:59:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Residents in Western Australia's second-biggest regional centre are petitioning the state government to provide public diagnostic medical imaging machines and fully subsidised scans.\n\nMore than 800 people have signed a petition to parliament calling for MRI (magnetic resonance imaging), PET (positron emission tomography) and CT (computed tomography) machines to be added to plans for the Geraldton Health Campus.\n\nThe health campus, including the public hospital, is undergoing redevelopment, which is more than two years overdue and has blown out in cost by $8.5 million.\n\nPrivately operated MRI and CT machines are available at St John of God Hospital, but cost hundreds of dollars to access.\n\nA state government spokesperson said there were no out-of-pocket costs for patients referred for an MRI through Geraldton hospital.\n\nHowever, people who received their referrals through a specialist were forced to pay.\n\nThere is only one MRI unit north of Perth in WA and no PET units. (Australian Government: experience.arcgis.com/experience)\n\n'Punished for living regional'\n\nPetition signatory Samantha Prunster travelled to Perth last month for a free MRI scan that would have cost her $760 in Geraldton, with a partial refund of about $360 from Medicare.\n\nShe said she was referred by a specialist after she began experiencing pain in one shoulder and numbness in both her arms two years ago.\n\nShe said the MRI scan in Perth helped her doctor diagnose her with tendinopathy.\n\n\"I'm a single mum working two jobs just to pay my rent,\" Ms Prunster said.\n\n\"I can't afford $760.\"\n\nMs Prunster said she made the 450-kilometre trip to Perth with the belief that she could claim travel expenses back under the Patient Assisted Travel Scheme.\n\nBut she said her claim was rejected because there was an MRI machine in Geraldton.\n\nMs Prunster said she should not have been forced to travel for the same scans Perth residents can access for free.\n\n\"It's like we're being punished for living regional,\" she said.\n\n\" Those who can't afford it, they've just got to live with the pain. \"\n\nJohn Carey announced funding in June for an oncology unit as part of the redevelopment. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nHealthcare costs climb\n\nA state government spokesperson said the $190.2 million redevelopment of the hospital included an expanded emergency department and new intensive care and high dependency units.\n\nA new integrated mental health service and a recently announced radiation oncology unit would also be features of the hospital.\n\n\"These are the services patients and clinicians told us were most urgently needed,\" the spokesperson said.\n\n\"However, the WA Country Health Service will continue to monitor clinical activity in Geraldton and services will be reviewed as community needs evolve.\"\n\nKirrilee Warr says diagnostic medical imaging facilities should be included in the redevelopment. (ABC Midwest & Wheatbelt: Brianna Melville)\n\nLocal MP Kirrilee Warr said most residents travelled to Perth for MRI scans to avoid the costs charged by the private operator.\n\n\"We would love to see, through the stage two planning of Geraldton Regional Hospital Campus … this vital medical equipment,\" she said.\n\n\"It's worth every dollar spent here.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/mary-fowler-extends-manchester-city-career-with-new-contract/105842402",
    "title": "'Felt like home': Fowler announces new Man City deal",
    "publish_date": "Wed, 01 Oct 2025 21:59:23 +0000",
    "category": "sports",
    "authors": [],
    "text": "Matildas superstar Mary Fowler has extended her stay at Manchester City until 2027, declaring the club feels like home and has helped her flourish.\n\nFowler, who joined the English powerhouse in 2022 on a long-term deal that ran until 2026, has signed a fresh one-year extension.\n\nThe young gun's status as one of the best players in the world was highlighted by selection in the PFA Women's Super League Team of the Year, despite her campaign being curtailed by a serious knee injury in April.\n\nThe 22-year-old, who is determined to be fit for Australia's Asian Cup campaign on home soil in March, says there \"are a few reasons\" she agreed to stay in Manchester.\n\n\"City has felt like home for me for quite a while now, so to continue this journey with them, I'm really proud to do that,\" Fowler said in a statement.\n\n\"Enjoying my football is a big part of me playing well, and City has created an environment where I can flourish in that sense.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I love working with the girls who are here, and I haven't always had that, so I appreciate that.\n\n\"As my seasons here have progressed, I've become a lot more comfortable in this environment, and I think I'm the kind of person who plays a lot better when I'm comfortable with the people and coaching staff.\n\n\"I feel like I have that now, I have the good relationships with everyone here, and that's made me feel like I'm at home and has allowed me to be really comfortable out on the field.\"\n\nFowler has played 87 games for City, scoring 21 goals.\n\nManchester City's director of women's football, Therese Sjogran, described Fowler as \"a really important figure for us on and off the pitch\".\n\n\"We're delighted she's agreed to extend her stay,\" Sjogran said.\n\n\"She's a tremendous talent, but the way she's improved each year since joining City speaks volumes of her attitude and hard work off the pitch.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/phil-gould-hospitalised-with-heart-concerns/105842400",
    "title": "Phil Gould hospitalised but says 'everything is OK'",
    "publish_date": "Wed, 01 Oct 2025 21:54:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "Canterbury football boss Phil Gould has been hospitalised and is awaiting test results on his heart.\n\nGould was admitted to hospital on Monday and did not appear on Nine's 100% Footy program.\n\nThe Bulldogs general manager has been hospitalised since and there is no timeline for his discharge, but he posted to social media that \"everything is OK\" on Thursday morning.\n\n\"My regular blood tests this week, showed up something else that needed investigation,\" he wrote.\n\n\"Basically, I came in to change the tyres, and they found a problem with the engine. Go figure.\n\n\"I'm lucky they found it early.\n\n\"The doctors and hospital staff have been simply amazing, but hopefully I'm going home soon.\n\n\"Looking forward to Grand Final Day.\"\n\nThe 67-year-old remains one of the most influential figures in the NRL, through his work at both Nine and Canterbury.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nWith Gould at the helm, the Bulldogs have returned to being a force in the NRL again with a top-four finish this year, although they exited the finals in straight sets after a controversial mid-season move to acquire half Lachlan Galvin from the Tigers.\n\nGould is said to be in good spirits and in regular communication with the Bulldogs from his hospital bed.\n\nNews of Gould's health concerns emerged as the NRL's gala night kicked off, with fellow Canterbury officials and captain Stephen Crichton at the Dally M Medal.\n\nGould had his tenure at Canterbury extended until the end of 2031 last month, with coach Cameron Ciraldo earning a similar extension.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/asx-markets-business-news-live-updates-oct-2/105841806",
    "title": "Live: Wall Street closes higher despite weak jobs numbers",
    "publish_date": "Wed, 01 Oct 2025 21:23:06 +0000",
    "category": "finance",
    "authors": [
      "Stephen Letts"
    ],
    "text": "The ASX has followed Wall Street's lead higher this morning, after the solid gains in the US overnight.\n\nAt 10:30am AEST, the ASX 200 was up 0.6% to 8,898 points.\n\nBasic materials/miners led the gains, while there has been demand for real estate trusts and healthcare stocks with CSL (+2.9%) benefiting from the general lift in pharma stocks in the US and Europe.\n\nRetailers, discretionary and non-discretionary, are having a tougher time.\n\nASX 200 by sector (LSEG, ASX)\n\nThe miners have benefits from an improvement in manufacturing data in China and higher demand for their products.\n\nBHP appears to have shrugged off fears about a Chinese boycott to open 1.6% higher.\n\nASX major miners (LSEG, ASX)\n\nThe banks are all higher, led by Judo (+1.9%) and ANZ (+1.1%).\n\nASX banks (LSEG, ASX)\n\nPharmaceutical stocks are generally higher following a global trend overnight after Pfizer said it had cut a deal with the White House to reduce the price of its drugs.\n\nOne healthcare stock that's struggling is private hospital chain Ramsay Health (-3.4%) after a broker downgrade from Morgan Stanley.\n\nASX major pharma stocks (LSEG, ASX)\n\nReal estate investment trusts (REITs) are generally higher, led by heavyweight Goodman Group (+1.0%)\n\nASX major REITs (LSEG, ASX)\n\nThe retailers are patchy with Coles down 0.4% and Harvey Norman up +0.1%.\n\nMajor ASX retailers (LSEG, ASX)\n\nTop mover on the ASX 200 is the local listing of giant US aluminium producer Alcoa (+4.2%) while gold producers are well represented in the top 10.\n\nASX 200 top movers (LSEG, ASX)\n\nBottom mover on the ASX 200 is yesterday's big winner DroneShield (-13.8%) which looks like it has been hit with some profit taking after a stellar recent run.\n\nNews Corp (-6.0%) is also out of favour, following its US parent lower.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/federal-politics-live-blog-oct-2/105841154",
    "title": "Live: Coalition opens the door to revamped nuclear energy policy",
    "publish_date": "Wed, 01 Oct 2025 21:15:09 +0000",
    "category": "finance",
    "authors": [
      "Samantha Dick",
      "Fran Rimrod",
      "Courtney Gould",
      "Keane Bourke"
    ],
    "text": "The Albanese government's free trade agreement with the United Arab Emirates, removing tariffs on nearly all Australian exports has come into force.\n\nIt means Australian producers of products such as red meat, dairy, grains and honey will have greater access to the international market.\n\nThe deal is Australia's first free trade agreement with a Middle Eastern country.\n\nThe arrangement came into effect on October 1, following Prime Minister Anthony Albanese's recent visit to the UAE.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/bugs-bassist-jordan-brunoli-on-terminal-cancer-diagnosis/105839994",
    "title": "Jordan Brunoli on 'terrifying' reality of living with stage 4 cancer",
    "publish_date": "Wed, 01 Oct 2025 21:11:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "What goes through your mind when a doctor reveals to you that you've got stage 4 cancer?\n\nJordan Brunoli's initial reaction, he admits, was awful.\n\n\"I was like, 'Hell yeah, I get some time off work,'\" the Bugs bassist tells triple j hack in his first interview since his diagnosis earlier this year.\n\nJordan Brunoli has had 50 per cent of his bowel removed and now has a permanent stoma. (triple j: Brandon Lung)\n\n\"I was just so burnt out from general life stuff and immediately switched to downplaying it in my mind.\n\n\"But five seconds after that I was like, 'that's ridiculous, I'm too young.'\"\n\nNow 30, Jordan is one part of the Bugs trio that also includes singer Connor Brooker and drummer Brock Weston.\n\nThe band's announcement of Jordan's terminal diagnosis earlier this year sent shock waves through the Australian music community.\n\n\"I actually wasn't going to tell anyone except for maybe a couple of close friends,\" he admits.\n\n\"But I think I was convinced by Brock and Con to make it public.\"\n\nA sold-out fundraising concert in Jordan's honour is being held in Brisbane this weekend.\n\nJordan Brunoli with his partner George and his band mate Brock. (triple j: Brandon Lung)\n\n'You're being pushy'\n\nWhile the cancer came as a surprise to Jordan, he had known something was wrong for months.\n\n\"There was blood in my stool occasionally … lethargy and general tiredness,\" he said.\n\n\"I was getting a lot of hectic stomach pain.\"\n\nThe pain was so bad that Jordan was taking time off work.\n\nHe remembers keeling over in agony and being unable to move for hours.\n\n\" At that point, I couldn't eat. I was eating once or twice a week. \"\n\nLoading...\n\nBut despite his alarming symptoms, blood tests came back clear and Jordan's doctor insisted it was nothing serious.\n\n\"It's a virus, it's a virus. Don't worry, it'll go away in a couple of weeks,\" he recalls his doctor told him.\n\n\"Advocating for yourself in a doctor's office is difficult as a young person.\"\n\nAfter several visits, Jordan had had enough. He remembers feeling \"panicked\" that he wasn't being listened to.\n\n\"He was a bit dismissive when I asked for things … telling me I was being pushy.\n\n\"I thought, 'screw this, like I genuinely feel f***ed', and I knew there was something wrong with me.\"\n\nJordan Brunoli in hospital following bowel cancer surgery. (GoFundMe: Brock Weston and Connor Brooker )\n\nJordan got a second opinion from another doctor, and before long, had his cancer diagnosis.\n\nHe says he doesn't hold any ill will towards that first doctor, but wonders what might have been different if he had been listened to earlier.\n\nHe is pleading with young Australians to take their health seriously.\n\n\"Don't be tough, you're not impressing anyone.\n\n\"If I'd seen a doctor previously, maybe the outcome would be different.\n\n\"Advocate for yourself with the doctor and if they don't give you what you want, go see a new doctor.\"\n\nBugs band member Jordan Brunoli and his dog. (triple j: Brandon Lung)\n\nThe new normal\n\nOf concern, Jordan's experience is becoming more common among young Australians.\n\nAustralia has the highest rate of bowel cancer in the world, with the risk of being diagnosed under the age of 40 doubling since the year 2000.\n\nJordan's cancer has spread to his liver and lymph nodes.\n\nHe has already had major surgery, removing about 50 per cent of his bowel, and now has a permanent stoma.\n\n\"At least I've saved some time sitting on the toilet!\" he laughs.\n\n\"Physically it's easy … but mentally it still feels a bit alien.\n\n\"It is what it is.\"\n\nAn intense chemotherapy regimen has also been a huge adjustment, with Jordan admitting he has struggled with skin reactions, especially on his hands.\n\nAustralia's music community is rallying behind Bugs bassist Jordan Brunoli, with a huge fundraiser to help with his medical costs. (Supplied/Bugs)\n\nHe has also experienced brittle hair, pins and needles, and fatigue, but says he's thankful to have escaped any serious nausea.\n\nHe has been told he will be on chemotherapy for the rest of his life.\n\nIt could happen at any time\n\nWhen asked about his prognosis, Jordan pauses.\n\nHe has recently had some hard news from his oncologist.\n\n\"She just looked me dead in the eyes and she said … 'you're going to have cancer forever,'\" he said.\n\n\"That was tough. There was silence in the room.\"\n\nHe says he has struggled with feelings of anger and isn't afraid to admit he's scared.\n\n\"I'm constantly thinking tomorrow might be the day when my liver just gives up and I get jaundiced and drop dead.\n\n\"It could happen at any time, which is terrifying.\"\n\nBut Jordan says the fear has also been liberating.\n\n\"You kind of live life like you're going to die and just do the things that make you happy.\n\n\"Finding peace with the fact that time might be limited … and it's not my fault.\"\n\nAustralian music rallies\n\nFor now, Jordan's focus is the big fundraising gig that's being held in his honour in Brisbane this weekend.\n\nTickets for 'Saving a Bug's Life' sold out soon after going on sale, with acts including DZ Deathrays, Beddy Rays and Hope D turning out to perform.\n\nA Bug's Life is raising money to help support Jordan Brunoli.\n\nBugs will also be on stage, although Jordan admits he's nervous.\n\n\"The outpouring of support from bands has been unlike anything I've ever seen,\" he said.\n\n\"I can't thank everyone enough.\"\n\nJordan was initially against the idea of a fundraiser, but was convinced by friends that it would help his quality of life, as he's unsure how much longer he and his partner George will be able to keep working.\n\n\"It's helping me with groceries, stoma supplies and little things like that.\n\n\"It's just one less thing I have to worry about and I can focus on recovery and healing.\"\n\nMusic as therapy\n\nThe one constant in Jordan's life is his music.\n\nHe lets slip that Bugs is working on some new material and says his health means it will sound different from their lighter music of earlier years.\n\nHe describes it as \"therapy\" on days when he needs to get the noise out of his head.\n\n\"Especially when I'm really down, I'll just play guitar as much as my fingers will allow.\n\n\"I'm never gonna give that up.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-02/employee-who-suffered-trip-injury-has-damages-win-upheld/105834350",
    "title": "Employee injured after wasp startled him has $870k damages win upheld",
    "publish_date": "Wed, 01 Oct 2025 21:01:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "A groundsman who tripped over a bag of rubbish after a wasp startled him says he wants workers to understand their rights after his successful claim for damages was upheld by an appeal court.\n\nAaron Carey-Schofield was emptying wheelie bins at an accommodation village in Dysart, central Queensland, in 2019, when he fell backwards after an insect flew towards him, stinging him on the arm.\n\nHis left elbow shattered in the fall, resulting in three complicated surgeries.\n\nLast year, the Supreme Court in Rockhampton awarded $873,000 in damages after a judge found Mr Carey-Schofield, who was 41 when injured, was not properly trained by his workplace in safe work systems.\n\nA significant portion of the compensation was to cover past and future economic loss.\n\nAaron Carey-Schofield required three surgeries on his fractured elbow. (Supplied: Shine Lawyers)\n\nAt the time, labour hire company Hays employed Mr Carey-Schofield on a casual basis to work at the site, which was run by global accommodation company Civeo.\n\nBoth companies attempted to have the ruling overturned, but the Queensland Court of Appeal recently dismissed the application.\n\nHays and Civeo were contacted for comment.\n\nAaron Carey-Schofield says he still suffers pain and struggles to carry out daily tasks. (Supplied: Shine Lawyers)\n\nEmployer has 'high duty of care'\n\nIn an interview with the ABC after the Court of Appeal's ruling, Mr Carey-Schofield said he was trained to line up rubbish bags on the ground until all bins were emptied and then load them into the back of a vehicle with a buddy.\n\nCiveo staff said its system of work was to place each rubbish bag straight into the ute to avoid trip hazards, according to Supreme Court and Court of Appeal documents.\n\nBut Mr Carey-Schofield said that was not how he was trained.\n\nAaron Carey-Schofield was trained to line up all rubbish bags on the ground before loading them into a vehicle. (Supplied: Shine Lawyers)\n\nMr Carey-Schofield's lawyer, Paul Zapata, described it as a \"unique\" case.\n\n\"If you go to a pub and ask someone, 'Who do you reckon is at fault?', you would probably think it was the plaintiff at first glance, if you didn't know the law,\" he said.\n\n\"But ultimately, the law imposes this really high duty of care to make sure that employees are trained appropriately because they don't know better.\n\n\"So in this case, even though he's created the hazard, that was what he was told to do.\n\n\"Even though it has involved a bug, it's reasonably foreseeable that something might happen to startle a person, and if there is a hazard there that the employer has created then they should be responsible for the injury.\"\n\nPaul Zapata says the law imposes a high duty of care on employers. (Supplied: Shine Lawyers)\n\nMr Carey-Schofield said he hoped the case would raise awareness about workers' rights and employers' responsibilities.\n\n\"If you get injured and they [the employer] are responsible, they need to know they are responsible,\" he said.\n\n\"People shouldn't feel like they are left in the lurch because, 'This is just a little accident' — it's definitely worth pursuing.\"\n\nDaily life impacted\n\nMr Carey-Schofield said the injury — which left him with \"10 per cent of an elbow and very limited movement and lifting ability\" — had impacted \"every factor\" of his life, including his mental health.\n\n\"I have trouble showering, doing dishes, trying to do laundry,\" he said.\n\n\"With hobbies, I can't go for a swim, I can't go for a game of pool. I'm a musician and I still play but I'm in so much pain when I do.\"\n\nHe has not had a job since the injury but hopes to work again.\n\n\"I'm probably going to have to study something and try and do my own thing on computers, but I have no experience with that kind of stuff … it's a whole new thing for me and I'm quite worried.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/politics/queensland/no-council-more-committed-to-active-transport-declares-brisbane-transport-chair-20251002-p5mzgg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘No council more committed to active transport’, declares Brisbane transport chair",
    "publish_date": "Thu, 02 Oct 2025 11:47:45 +1000",
    "category": "finance",
    "authors": [
      "Felicity Caldwell"
    ],
    "text": "Brisbane councillor Andrew Wines says there is no council more committed to active transport than the current Schrinner LNP council, at a hearing where he also hinted the Story Bridge footpaths would reopen imminently.\n\nSpeaking at a parliamentary inquiry into e-mobility, Wines – the council’s public transport chair – refused to detail how much cash from Brisbane’s multimillion-dollar Neuron and Lime contracts was funnelled back into bike paths to get e-scooters off city streets.\n\nLabor MP Jonty Bush, a committee member of the inquiry, which was holding public hearings on Thursday, asked how much revenue Brisbane City Council received from its 7100 hire scheme e-scooters.\n\nWines said e-scooter revenue was dwarfed by the amount council spent on active transport. Credit: Courtney Kruk\n\nBush said other councils had said each device brought in about $2000 in revenue, which could equate to about $14 million for the council, but Wines responded that those details were commercial-in-confidence.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/who-s-in-and-who-s-out-kangaroos-set-to-name-seven-debutants-for-ashes-20251002-p5mzic.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Who’s in and who’s out? Kangaroos set to name seven debutants for Ashes",
    "publish_date": "Thu, 02 Oct 2025 11:45:56 +1000",
    "category": "sports",
    "authors": [
      "Michael Chammas"
    ],
    "text": "Kevin Walters is set to blood up to seven debutants for the end-of-season Ashes series against England as he moves to finalise his 23-man Kangaroos squad on Monday.\n\nThe Herald can reveal that Broncos superstar Reece Walsh, Roosters flyer Mark Nawaqanitawase, Cronulla hooker Blayke Brailey, Canterbury back-rower Jacob Preston, Newcastle centre Bradman Best, South Sydney enforcer Keaon Koloamatangi and Raiders youn gun Ethan Strange are all in line to be selected in Walters’ squad.\n\nThe series will begin at Wembley Stadium in London on October 25 and will be followed by games at Everton’s new stadium in Liverpool and a match in Leeds at Headingly to close out the series.\n\nThe Kangaroos will also be boosted by the inclusion of Broncos grand final centre Kotoni Staggs.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/a-kiwi-refereeing-the-bledisloe-we-d-be-sweet-as-says-rugby-australia-20251001-p5mz7g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A Kiwi refereeing the Bledisloe? We’d be sweet as, says Rugby Australia",
    "publish_date": "Thu, 02 Oct 2025 11:42:55 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "“Equally, if you look at our own performances in terms of the Wallabies, you have to eliminate as best as you can the referee from the game. We have probably let them come into the game more than should be. We just have to better.” Many of the best and most experienced referees in the world are currently from Australia and New Zealand, including Angus Gardner, Nic Berry, Ben O’Keeffe and Paul Williams. But they are not considered for Bledisloe Cup games because of World Rugby’s neutrality policy. Nic Berry issuing a red card to Lachie Swinton when refereeing the Wallabies in a Bledisloe Cup game 2020. Credit: Getty In 2020, however, when COVID forced drastic changes, Gardner, Berry, O’Keeffe and Williams all refereed trans-Tasman Test matches, and did so without a single moment of controversy. Asked if he’d be open to Australians and Kiwis refereeing Bledisloe games, Waugh said: “Without having spoken to the high-performance team here, I think we want the best referees in the world, refereeing our Test matches.\n\n“If those best referees are in our market, and it’s a New Zealander refereeing a Bledisloe Cup at Eden Park, I am sure we would be fine with that, as long as it’s (one of) the best referees in the world.” Rugby Championship future The Bledisloe Cup was reduced from a three-game series to a two-game series in 2022, but Waugh also revealed he was pushing for the three-game series to return. Loading “It’s obviously disappointing we haven’t won it since 2002. We’ve had some good teams pressed for it as well since then,” Waugh said.\n\n“Everyone probably wants a three-Test series. If you look at the great series of all different codes all around the world, if you’ve got an opportunity to play a best of three … or an odd number. We just obviously spent the weekend with our counterparts in New Zealand, and they’re very constructive around the path forward.” Waugh provided some clarity on the future of the Rugby Championship, after it was revealed the tournament would not be held in 2026 due to New Zealand’s eight-game tour of South Africa, and could be replaced by a series of tours in 2028. Waugh said the Wallabies would still play South Africa, Argentina and New Zealand next year, and the delayed start to the 2027 Rugby World Cup meant a full TRC would also be played that year. Waugh also indicated the Rugby Championship may still be played in 2028, and not the proposed tours, after the success of TRC this year. “It’s yet to be finalised, but there’s a consistency now around the TRC and interest in the TRC which you probably haven’t seen for a long time, and so as we think through 27, 28, 29, that level of consistency is really important in terms of fan-centric and fan engagement,” Waugh said.\n\nSchool stars and Marky Mark The record 81-48 victory of the Australian under 18s over the New Zealand Schools on Monday was followed by questions around how many of the star teenage players will stay in rugby, and how many will be lost to rugby league. Waugh said RA are confident they will keep most of the squad. The Australian Under-18s in action against New Zealand Schools on Monday in Canberra. Credit: Rugby Australia “Last year we had strong results through the Australian under 18s and schools program as well, and we secured 23 of the 26 players in that squad,” Waugh said. “We are hoping to at least achieve that for this group of young men as well. We are reasonably confident with where we are at with the group.” Waugh said he was pleased to hear Mark Nawaqanitawase announce he is returning from the NRL to rugby union at the end of next year, in a bid to play at the Rugby World Cup in Australia.\n\nThe former Wallaby, who has become a sensation in the NRL, also revealed he’d missed the international aspect of the 15-man game and the space on the field. “His comments reflect what we see as our value proposition as being,” he said. “Having players like Mark show interest in coming back to the game in Australia is great to hear, and now we go through the process of ensuring that comes to light.” Loading Waugh was coy on RA’s plans to secure Nawaqanitawase given RA’s push for frugality, however, and he indicated the flying winger playing overseas would not be a barrier to playing at the World Cup: “We will be pretty creative around we establish the best possible team in 27.” But he did indicate he prefers Australian players to be playing in Super Rugby.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/goodfood/brisbane-eating-out/valley-to-score-intimate-rooftop-bar-20250929-p5myqj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Valley to score intimate rooftop bar",
    "publish_date": "Thu, 02 Oct 2025 11:41:24 +1000",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nExclusive Eating outFood Valley to score intimate rooftop bar Most rooftop boozers are huge, but not this one. A celebrated chef and award-winning bartender are onboard, and guests can expect live entertainment four nights a week. Matt Shea October 2, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nWhen Daniel Sprange arrived in Brisbane six months ago, he noticed something about the city’s rooftop bars – they tended to be huge. “For someone from Sydney, Brisbane does them a bit differently,” Sprange says. “Something like Lina [in South Brisbane] or Sunsets [in Woolloongabba] – to me, it’s a unique concept to walk into a corporate or residential building, and you’re on the hunt for it. Then you get up to the rooftop and it’s this wide open space.” Ovolo The Valley manager Daniel Sprange. Markus Ravik Not every rooftop bar in Brisbane is built to such scale, of course. And what Sprange is talking about isn’t confined to rooftops, with Brisbane having history of leaning towards larger food and beverage tenancies, whether they’re on the ground or top floor. But that’s another conversation for another story.\n\nAdvertisement\n\nEither way, he says, Above will be different. Set to open in mid-October on the sixth-floor rooftop of Ovolo The Valley, where Sprange is general manager, the 60-seat Above is intended to be intimate and personable. Not that Sprange takes credit for the conception of Above, which began during the time of his predecessor, James Clark. The hotel group has been developing it for about a year, and hopes it will bolster the hotel’s food and beverage options after the May closure of Za Za Ta to make room for functions and events. Related Article Brisbane restaurant favoured by Billie Eilish closes after six years “We have our brand pillars at Ovolo and food and beverage is a big component of that,” Sprange says. “We still have [bar] Kazba downstairs but this will help elevate us and set us apart [among our competitors].\n\nAdvertisement\n\n“The current set-up up there was a small gym and a sauna and then the rooftop pool. We wanted to bring something to that space, to the hotel and to the community, so we thought, why not activate it?” In charge of the redesign is BSPN Architecture, which has been tasked with adding plenty of textured elements and greenery. The pool is also in the process of being retiled. “We’re giving the tiles a speckled blue treatment, and we hope it will add up to something that gives a Mediterranean feel. There will be a lot of sensory elements, with rendered sand-style walls. It’s designed to reflect the great light we get up there and add to that intimacy.” The completed bar will be heavy on Mediterranean design elements. For food, celebrated consulting chef Justin North and head chef Kya Knights have collaborated on a grazing menu that takes the Middle Eastern focus of Kazba and Za Za Ta before it but shifts ever so slightly eastwards towards the Mediterranean. Expect dishes such as stone baked pita with linseed and garlic oil, an “old-school hummus with crunchy chilli oil, beetroot served with a bulgar spread, and crudite vegetables with tahini yoghurt, soy and spiced pepitas.\n\nAdvertisement\n\nFor drinks, award-winning bartender Jake Down is compiling a cocktail list that for the most part will twist the classics, but also include original drinks and a couple of more refined takes on the rooftop slushy. There will be a focus throughout the list on showcasing Brisbane produce. Related Article Light Years team brings its ‘neighbourhood Italian’ to Brisbane The final element, Sprange says, will be live entertainment four nights a week. “Yes, we’re a hotel but we can’t stand on our own two feet without the support of the local community. There’s a lot of residential around here but also businesses, and we wanted to give them something that they want. “It’s on the fringe of the Valley and it’s somewhere they can wind down and enjoy something different, and something different from our hotel.” Above will open in October at Ovolo The Valley, 33/1000 Ann Street, Fortitude Valley\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Food\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/trump-thinks-the-body-works-like-a-battery-scientists-have-shown-why-he-s-wrong-20251001-p5mz8j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump thinks the body works like a battery. Scientists have shown why he’s wrong",
    "publish_date": "Thu, 02 Oct 2025 11:39:46 +1000",
    "category": "sports",
    "authors": [
      "Angus Thomson"
    ],
    "text": "Professor Andre La Gerche was having lunch with a colleague when the conversation turned to Donald Trump’s theories about exercise.\n\nProfiles of the US president in The New Yorker and The Atlantic have attributed Trump’s avoidance of physical activity other than golf to his belief that the body is like a battery, born with a finite amount of energy, and strenuous exercise only drains those reserves prematurely.\n\nUS President Donald Trump is reported to disapprove of exercise, believing humans are born with a finite amount of energy. Credit: Matt Willis\n\n“We had a bit of a laugh,” said La Gerche. “And then we thought ‘hang on, we’ve got some actual data to prove it’s silly.’ ”\n\nLa Gerche’s team at the Victor Chang Cardiac Research Institute analysed the average heart rate of 109 elite athletes and a control group of 38 non-athletes participating in a long-running study on heart health.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/business/companies/sydney-pub-baron-jon-adgemis-seeks-bankruptcy-over-1-8bn-in-debt-20251002-p5mzip.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney pub baron Jon Adgemis seeks bankruptcy over $1.8bn in debt",
    "publish_date": "Thu, 02 Oct 2025 11:37:08 +1000",
    "category": "finance",
    "authors": [
      "Patrick Begley"
    ],
    "text": "Sydney’s flashy hospitality dealmaker Jon Adgemis has fallen on his sword, declaring himself bankrupt with debts around $1.8 billion.\n\nThe collapse of his Public Hospitality Group follows years of financial woes for the former KPMG management consultant, who had picked up venues including The Norfolk in Redfern, Oxford House in Paddington, Darlinghurst’s The Strand Hotel and Alexandria’s Camelia Grove Hotel.\n\n“I take responsibility for the position that has been reached,” Adgemis said in a statement on Thursday.\n\nJon Adgemis’ pub empire had expanded rapidly before he fell into debt difficulty. Credit: Jesse Marlow\n\n“I am deeply disappointed that my broader vision for the group did not come to fruition, and that, despite sustained efforts, I was unable to deliver a better outcome for creditors.”",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/world/middle-east/this-is-what-solidarity-looks-like-who-are-the-australians-on-the-gaza-flotilla-20251001-p5mz6w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘This is what solidarity looks like’: Who are the Australians on the Gaza flotilla?",
    "publish_date": "Thu, 02 Oct 2025 11:30:02 +1000",
    "category": "sports",
    "authors": [
      "Bronte Gossling",
      "Hannah Hammoud"
    ],
    "text": "The mission represents the largest civilian-led maritime effort to date, attempting to break Israel’s 18-year land and sea blockade of Gaza, which has been enforced with the assistance of the Egyptian military in the south. Drums and cheers from the Palestinian flag-waving crowd could be heard in the background of Rafiq’s August 31 Instagram story, shared after he boarded the Gaza-bound Spectre in Barcelona. Sydney content creator Abubakir Rafiq is part of the Global Sumud Flotilla. Credit: @abubakirrafiq “It’s so loud, it’s so hot, there are a thousand people that came out just to support the flotilla,” Rafiq, wearing a black and white keffiyeh, told the camera. “This is what solidarity looks like, this is insane.” Speaking to this masthead on Wednesday, Rafiq said he felt optimistic about the flotilla’s prospects of success, despite Italy’s withdrawal of support for the international mission on the same day. While Italian vessels had previously escorted the flotilla at various stages of the journey, Italian Prime Minister Giorgia Meloni urged the flotilla to stop and made it clear the naval support would not continue.\n\n“I’m not feeling vulnerable,” Rafiq said. “The Italian government like the Australian government and many governments around the word are complicit in this genocide, so I never expected a navy vessel from them to begin with.” Hobart scientist Julia Henry is aboard the Polish-flagged Huga. She has four children aged from three to 19, and told this masthead in early September: “While I am not an activist, I have always been someone who will stand up to a bully and intervene in something that I think is not right. I am a protector. I was taught, and I teach my children, that is the right thing to do.” Also sailing with the flotilla is Northern Rivers filmmaker and climate activist Juliet Lamont, who directed the 2009 documentary The Snowman, and her two daughters, Isla Lamont and Luca Lamont. Juliet Lamont is acting as first mate on the vessel, the Wahoo, that is also carrying Queenslander Hamish Paterson. On Thursday, Paterson provided an update via social media, confirming that the Wahoo was still sailing and proceeding without interception. He wrote on Instagram: “They jam our internet and our comms with the flotilla so regularly that [it] is hard to get these updates out there.”\n\nAustralians Daniel Coward and Surya McEwan are making another attempt to break the blockade with the Global Sumud Flotilla. In April 2024, both Coward and McEwan were set to depart Turkey for the Gaza Strip with the Freedom Flotilla Coalition, but the humanitarian aid mission was halted after Guinea-Bissau removed its flag from two vessels. McEwen was also part of a Freedom Flotilla Coalition mission that was aborted in May 2025 after being attacked by drones in international waters off the coast of Malta. On September 24, McEwen said on Instagram that his boat, Luna Bark, had been hit with explosives. “The boat is damaged, but other than some hearing loss, everyone onboard is OK and determined to carry on,” he wrote. That same night, Rafiq’s vessel, Spectre, was also hit by drones, he said in an Instagram video. No injuries or casualties were reported. Israel has not commented on whether it was responsible for the alleged attacks last week, though it has repeatedly said it would not allow the Global Sumud Flotilla to reach Gaza, and has linked the flotilla with Hamas. On September 30, Israel’s Foreign Ministry released a post, “Official Hamas documents found in the Gaza Strip”, on X claiming they prove Hamas is directly involved “in the funding and execution” of the Global Sumud Flotilla. Maria Elena Delia, a spokesperson for the flotilla, rejected the allegations and labelled them “propaganda” in a statement to news agency Ansa.\n\nNew Zealand-born, Melbourne-based GP Bianca Webb-Pullman, who is sailing with the flotilla, previously labelled Israel’s allegations that it’s associated with Hamas as offensive. “I can tell you that this is a people’s movement,” Webb-Pullman said from the sea in a video shared to Instagram on September 24. “It’s quite offensive to me as a healthcare worker to have this accusation made because, as healthcare workers, there are many of us on this flotilla; it is absurd … This accusation is incorrect, and we have seen it used by Israel against healthcare workers in Gaza repeatedly.” Are Hollywood actors sailing with the flotilla?\n\nPart of the crowd in Barcelona was Irish actor Liam Cunningham, best known for playing Davos Seaworth in Game of Thrones. “The fact that you guys are here and the flotilla is happening is an indication of the world’s failure to uphold international law and humanitarian law,” Cunningham said in a pre-departure press conference. “It is a shameful, shameful period in the history of our world.” Cunningham is one of the tens of thousands from across the globe registered with the Global Sumud Flotilla, participation in which includes supporting the movement financially or with publicity in lieu of sailing. American actress Susan Sarandon has also expressed her support for the flotilla, as has Swedish actor Gustaf Skarsgård, who is the son of Stellan Skarsgård and brother of Alexander Skarsgård and Bill Skarsgård. Cunningham, Sarandon and Skarsgård are not sailing with the flotilla.\n\nHow did we get here? On August 31, 300 people boarded at least 20 ships in Barcelona, Spain, and set sail for the Occupied Palestinian Territories. More ships joined the maritime convoy from Tunisia and Catania on September 7, though on September 27, the Family Boat stopped its journey after being stranded off Crete due to a “catastrophic technical failure”. It’s estimated that between 50 and 70 ships from 44 countries are attempting to deliver food, water and medicine to Gaza. The Integrated Food Security Phase Classification (IPC) said in August that the Gaza Strip’s largest city, Gaza City, is gripped by famine. Two weeks later, the United Nations Commission of Inquiry on the Occupied Palestinian Territory released a report confirming Israel is responsible for genocide in Gaza. Last week, Italy, which has urged the flotilla to accept an alternative aid distribution proposal from the Latin Patriarchate of Jerusalem in Cyprus, and Spain deployed naval vessels to monitor the flotilla following alleged drone attacks. Italy’s frigate was set to stop once the flotilla got within 150 nautical miles (278 kilometres) of Gaza. Greece’s coastguard also monitored the flotilla when it was sailing through its rescue area, and Reuters reports Turkey has been monitoring the flotilla with drones.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/politics/nsw/vaucluse-loses-its-polo-event-as-residents-complain-about-noise-20250925-p5mxxs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Vaucluse loses its polo event as residents complain about noise",
    "publish_date": "Thu, 02 Oct 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "David Barwell"
    ],
    "text": "A plan to stage an equestrian polo event at a clifftop park in Vaucluse has been reined in by a Sydney council amid fears over the sound of galloping horses, impacts on surrounding home owners and the prospect of hooves tearing up the turf.\n\nWoollahra Council has knocked back a proposal for Christison Park in Vaucluse to be used for a Polo in the City event, which would have seen crowds up to 1500 flock to the site for an afternoon of horseback sporting revelry.\n\nUp to 1500 people had been expected to attend the November event. Credit: Polo in the City\n\nThe planned event was the brainchild of lawyer, polo player and entrepreneur Janek Gazecki, who applied to the council to use the park for a November event that would have included setting up corporate and VIP marquee areas.\n\nBut an assessment by Woollahra Council ruled the park was an “unacceptable” location to stage the event due to concerns over horses causing damage to turf and cricket facilities as well as impacts on other community users – including sporting clubs – that use the park.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/how-nrl-s-biggest-names-predicted-utoikamanu-would-be-the-difference-for-the-storm-20251001-p5mzcv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How NRL’s biggest names predicted Utoikamanu would be the difference for the Storm",
    "publish_date": "Thu, 02 Oct 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "On a murky Monday morning in February this year, some of the biggest names in the game gathered in Sydney for the NRL season launch.\n\nThis masthead made a point of asking all 17 captains and senior players which rival club would win the premiership if their own team fell short. More than half responded the Melbourne Storm – and one of the main reasons was the signing of Stefano Utoikamanu.\n\nBroncos prop Payne Haas said: “The Storm have a lot of talent, and now they’ve added Stefano in the middle. That’s what they needed. You need good front-rowers to win a comp, and they’ll turn him into a great front-rower. We’ve already seen the talent he has. I’m actually excited to see him play.”\n\nCanberra’s Joe Tapine added: “I think Melbourne have bought well with Stefano. He’s a good player and will add to their forward pack. He helped hold that Tigers pack together at different times.”",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/afl/beveridge-rejects-applause-for-dogs-mediocre-season-20251002-p5mzj6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Beveridge rejects applause for Dogs' 'mediocre' season",
    "publish_date": "Thu, 02 Oct 2025 11:25:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "Beveridge rejects applause for Dogs' 'mediocre' season\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/business/companies/if-there-s-a-bubble-tesla-is-it-car-maker-soars-on-hopes-for-musk-s-robot-push-20251001-p5mz5w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘If there’s a bubble, Tesla is it’: Carmaker soars on hopes for Musk’s robot push",
    "publish_date": "Thu, 02 Oct 2025 11:25:35 +1000",
    "category": "finance",
    "authors": [
      "Jordan Fitzgerald"
    ],
    "text": "Tesla shares are on a tear, sending the electric carmaker’s chief executive Elon Musk half-way to becoming the world’s first trillionaire. But will the upcoming third-quarter sales figures be strong enough to sustain the momentum?\n\nThe stock rallied 33 per cent in September, notching their best month in almost a year, as investors rallied around Musk’s renewed focus on the company. Overnight, they jumped another 3.3 per cent, making the billionaire the first-ever person worth $US500 billion ($756 billion) , according to Forbes’ Real-Time Billionaires tracker.\n\nEven more striking is Tesla’s ascent in the market since hitting a low in early April after US President Donald Trump paused his sweeping global tariffs. Since then, the share price has doubled, making it the best performer in the high-flying big tech cohort known as the Magnificent Seven.\n\nThe bet on Tesla is that Elon Musk can transform it from a car maker into an AI powerhouse. Credit: AP\n\nThe bet on Tesla is that Musk can transform it from a car manufacturer into an artificial intelligence powerhouse that makes robots and self-driving taxis. That goal is reflected in the unprecedented $US1 trillion pay package the company’s board proposed for Musk earlier this month.",
    "source": "SMH",
    "cluster_id": 2
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/the-world-renowned-australian-designer-you-ve-never-heard-of-20250730-p5miy7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The world-renowned Australian designer you’ve never heard of",
    "publish_date": "Thu, 02 Oct 2025 11:25:14 +1000",
    "category": "lifestyle",
    "authors": [
      "Robyn Willis"
    ],
    "text": "As origin stories go, Silvana Azzi Heras has a pretty good one. She was in her final year of her Bachelor of Design at the University of Western Sydney, as it was then known, when her lecturer contacted her about some work with a relatively new designer, Catherine Martin.\n\nIt was the mid-1990s and Martin and her husband, Baz Luhrmann, had enjoyed considerable success with his directorial debut film, Strictly Ballroom (including awards for best costume design and best production design), and the couple was about to start the publicity tour for his next offering, Romeo+Juliet. It was clear their stars were on the rise – and that Martin needed more help.\n\nSilvana Azzi Heras in her studio at home in the inner west. Credit: Steven Siewert\n\nSo, she called the university and asked for recommendations for a couple of the best students in the course. Azzi Heras’ name was put forward.\n\n“That weekend, my dad brought my little Apple computer over to Iona in Darlinghurst [where the couple lived] to help out CM,” she says.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/politics/federal/singtel-rings-up-no-tax-as-miners-and-banks-support-the-budget-20251001-p5mzdw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "SingTel rings up no tax as miners and banks support the budget",
    "publish_date": "Thu, 02 Oct 2025 11:17:53 +1000",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "The parent company of beleaguered telco company Optus failed to pay any corporate tax despite earning more than $8.2 billion in income from Australian customers, as new figures reveal that the federal budget increasingly depends on miners and banks.\n\nThe Australian Tax Office this morning released its annual corporate tax report that outlines the income and tax paid by the nation’s largest private and public companies. In 2023-24, more than 4000 firms paid $95.7 billion in tax on $3.3 trillion of income.\n\nSingapore Telecom, the parent company of Optus, has not paid company tax in four years despite more than $24 billion in income. Credit: Dominic Lorrimer\n\nBut Singapore Telecommunications (Singtel), the parent company to Optus which is under fire over its role in a Triple Zero outage across parts of the country, was not one of them. Despite declaring $8.2 billion in income, it had no taxable income or payable tax.\n\nIt’s the fourth successive year that Singtel has declared more than $8 billion in income but not paid company tax. It last paid tax in the 2019-20 when, on income of $9 billion, it declared $181.8 million in taxable income and paid $43 million in tax.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-as-wall-street-brushes-off-shutdown-tesla-relief-20251002-p5mzfp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Miners shine, sending ASX higher; News Corp slumps",
    "publish_date": "Thu, 02 Oct 2025 11:10:56 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "The Australian sharemarket has advanced at the open, led by mining stocks, while Wall Street rose overnight as it brushed off the shutdown of the US government.\n\nThe S&P/ASX 200 was 80.8 points, or 0.9 per cent, higher at 8926.50 as of 11.07am AEST, with six of its 11 industry sectors in the green. The Australian dollar was fetching US66.08¢ at 10.45am AEST.\n\nWall Street continued to power higher, setting the scene for gains on the ASX. Credit: AP\n\nBHP (up 1.5 per cent) clawed back some of Wednesday’s losses even as the escalating row over iron ore exports between the mining giant and China remains unresolved. BHP shares fell 2.5 per cent in the previous session on reports that China’s state-run iron ore buyer China Mineral Resources Group (CMRG) had told major steelmakers and traders to temporarily halt purchases of all new BHP cargoes. BHP chief Mike Henry spoke with Treasurer Jim Chalmers last night to discuss the dispute.\n\nFellow iron ore heavyweights Fortescue (up 1.2 per cent) and Rio Tinto (up on 0.8 per cent) also advanced.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/national/they-met-every-day-at-the-pool-for-years-until-the-coffee-cup-incident-20250901-p5mrjg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "They met every day at the pool for years – until the coffee cup ‘incident’",
    "publish_date": "Thu, 02 Oct 2025 11:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Stephen Lacey"
    ],
    "text": "I love Adrian’s engagement with life. He has lots of energy and belongs to this incredibly artistic circle. He takes his swag out to Balgo [in Western Australia] and Yuendumu [in the Northern Territory] and sleeps under the stars. He even has a fire pit in his backyard, so when artists come from the desert they feel at home.\n\nWe started having coffee together every morning after a swim. Neither of us was ever afraid of cold water. The pool temperature can be 16 degrees and we’ll still say it’s beautiful. That’s code for, “It’s frickin’ cold but doable.”\n\nRUSSELL : I was introduced to Adrian in 2008 at the Bondi Icebergs swimming club cafe by a mutual friend and we got on immediately. I thought he was a very cultured individual who could talk to anyone about anything.\n\nAdrian Newstead (left) and Russell Cheek: “When you talk to Russell, you have his undivided attention,” Adrian says. “He listens, he gets your story. It’s very endearing.” Credit: Brent Lewin\n\nIndigenous art dealer Adrian Newstead, 77, and performer/quizmaster Russell Cheek, 73, met at their local swimming pool 17 years ago. They’ve swum there every morning ever since – except when Adrian was banned.\n\nIn 2016, he was invited to Paris to show a collection of Indigenous Art Brut. His ability to get things done is just insane. He went to the outback and gathered all these paintings in next to no time. I speak French, so Adrian invited me along to interpret for the exhibition. We had the best time, hanging out in the cafes of the Marais.\n\nVery little about him annoys me, but he does like to complain about his ailments. I just take it all on board. And he’s really bad at texting, especially if he’s travelling. I’ll write to him and won’t hear anything back for four or five days.\n\nHe’s got a temper. Last year, new management at the Bergs cafe introduced paper cups, which are bad for the environment and horrible to drink coffee out of. So Adrian brought down his stoneware Tiwi mug. This new manager told him, “You can’t use that because of OH&S.” Adrian said, “I’ve never heard anything so f---ing lame!” The incident got reported to the board and they banned him from the cafe, club and pool for a year. It was eventually commuted to the first day of winter swimming.\n\n‘Adrian often wonders why we never see people in their 80s or beyond swimming here … We’ve vowed to go on for as long as we possibly can.’ Russell Cheek\n\nWe don’t disagree about much. We talk about footy and cricket, and art. We exchange views on how beautiful and resourceful the women around us are, and we talk about politics. On election night, me, Adrian and Dave Faulkner from the Hoodoo Gurus got together for a meal and we got Labor over the line.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/culture/music/harry-connick-jr-s-mum-had-a-wish-granting-it-is-his-greatest-challenge-yet-20250929-p5mynq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Harry Connick Jr’s mum had a wish. Granting it is his greatest challenge yet",
    "publish_date": "Thu, 02 Oct 2025 11:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Michael Dwyer"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size When Harry Connick Jr. was 10 years old, he tried to book a gig at Carnegie Hall. He’d been playing piano since he was three, prodigiously since five or six, and his mum was so proud she told everyone she’d see him perform there one day. When she was diagnosed with cancer, he made the call. “They’re like, ‘Well, this is the box office, we can’t help you’,” he says, flashing that million-dollar smile. “I told my mum, ‘I tried to play there’, and she thought that was nice, but anyway. She died when I was 13. And to this day, I’ve never been to Carnegie Hall. I wanted to save it for a special occasion.” One of the reasons he’s here in Melbourne this Friday afternoon, wandering alone and unrecognised into a Collingwood cafe in black t-shirt and jeans, grey wind-jacket and unsculpted stubble, is to prepare for that occasion. He’s been rehearsing a challenging new composition, he explains, with Orchestra Victoria. On May 22 next year, on what would have been Anita Frances Livingston’s 100th birthday, he’ll unveil a 50-minute dedication to her called Babe Elaboratio at Carnegie Hall. “She was the youngest of six, so they called her Babe,” Connick says. “She had a great command of the English language, but she was not a fan of ‘big two-dollar words’. She liked to speak very simply, very clearly. So instead of calling it a rhapsody or a concerto or a symphony, I wanted a better name.” Babe, a lawyer and a judge in the family’s hometown of New Orleans, was a bit of a dark horse. Harry and his sister never knew her age. Even her grave marker says only “Babe” and her date of death in 1981. No full name, no birthdate. “Which is a really strong choice for your tombstone,” he says. “I had to basically elaborate, using memories as signposts. The etymology of elaborate is labour: to work to build something. And my mother, I think, would have found it cheeky to call it Elaboratio.” He stirs his lemon and honey tea. “It’s very personal to me.”\n\nAdvertisement\n\nConnick’s labours with Orchestra Victoria will soundtrack a documentary he’s co-directing with his oldest daughter, Georgia, a graduate of the Australian Film, Television and Radio School who also made a couple of his recent videos. His younger daughters Kate (born Sarah; she played Fallon in Neighbours) and Charlotte are also involved. Harry Connick Jr with his wife Jill Goodacre and their daughters, from left, Georgia, Charlotte and Sarah, as he entered the Hollywood Walk of Fame in 2019. Credit: Getty Images They all live in Australia: three more reasons he’s this far from his American home weeks ahead of his climactic Jazz At the Bowl show for the Melbourne International Jazz Festival. He also has a production company based here, he says, raving about the “incredible talent” on tap. “Nothing’s really hard,” he says when asked about having all three daughters move to the far side of the world. “Like, losing my mum was hard. Having our girls live in Australia and have them loving this adventure? No. They’re 29, 28 and 23. My wife might say differently, but it’s not hard for me.” Connick’s love affair with Australia is no secret. His breakthrough When Harry Met Sally soundtrack sold platinum here in ’89, leading into a decade of packed theatres, festival stages and some kind of freakish crossover between the jazz songbook and pop idol mania. Harry Connick Jr on the set of The Piano with fellow judge Andrea Lam, centre, and host Amanda Keller. Credit: ABC The connection has matured through dozens of albums and return tours, and a smooth embrace of TV, not least his Australian Idol stint in 2023. Most recently, he joined concert maestro Andrea Lam on ABC TV’s The Piano: a feel-good travelogue that put amateur pianists and their stories on show in public places.\n\nAdvertisement\n\n“I liked the idea of taking the musicianship out of the instrument and focusing on the common humanity,” he says. “It wasn’t about ‘This is what you need to do to become a better pianist’. It was about what the instrument meant to those people. Loading “It made me remember that no matter what level you think you are as a musician, people are not hearing it like that. A lot of these pianists who came in didn’t have a clue what they were doing in terms of playing the instrument, which is beautiful. It was a lens through which I could experience the piano in a different way.” The bond between music and community is key to one of his most enduring projects. In the wake of Hurricane Katrina, Connick and saxophonist Branford Marsalis linked with Habitat for Humanity to build Musicians’ Village in New Orleans: 80 new homes, 80 per cent of them occupied by musicians and their families. In the middle of that is the Ellis Marsalis Centre for Music, named for Branford’s late father, one of Connick’s early mentors. “It’s turned into this incredible community centre with the most beautiful recording studio in New Orleans,” he says. Harry Connick Jr headlines Jazz at the Bowl on October 25. “Both of us are still board members, and we meet four times a year, and we still go all over the world raising money, playing. It would be nice to have a big endowment … but the only way to maintain that is to be very, very involved. So I mean, that’s the rest of my life.”\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/see-the-full-list-the-biggest-australian-companies-paying-the-least-tax/kdgh1o7wg",
    "title": "See the full list: The biggest Australian companies paying the least tax",
    "publish_date": "Thu, 2 Oct 2025 01:18:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "More than 1,000 large companies paid no tax last year, but compliance is at an all-time high.\n\n\n\n\n\nOn Thursday, the Australian Taxation Office (ATO) revealed the tax returns for 4,110 corporate entities in 2023-24 with a total income equal to $100 million or more.\n\n\n\n\n\nThe 11th corporate tax transparency report found the number of companies, both foreign and Australian-owned, paying no tax had dropped from 31 to 28 per cent.\n\n\n\n\n\nATO assistant commissioner Michelle Sams highlighted that there were \"legitimate reasons why a company may pay no income tax\".\n\n\n\nThese reasons include deducting tax offsets, reducing tax because a business may have incurred more expenses than income, as well as carrying losses forward from previous years.\n\n\n\n\n\n\"The Australian community can be assured we pay close attention to those who don’t pay corporate tax and ensure that they are not gaming the system,\" Sams said.\n\n\n\n\n\nWhile almost one in three large companies in the report paid no tax, $95.7 billion in income tax was paid, marking the second-highest total ever recorded.\n\n\n\nSams said the result reflected business conditions but also attributed it to \"the continued efforts of the Tax Avoidance Taskforce in holding large corporates to account\".\n\n\n\nWhich companies are paying the least tax?\n\nBrazilian multinational JBS, the largest meat and processing company in Australia, topped the list of companies that paid no tax in 2023-24.\n\n\n\n\n\nEnergy, telecommunications and natural resources companies also made the top 10.\n\n\n\n\n\nThe report notes an uptick from 11 to 16 oil and gas companies paying the petroleum resource rent tax (PRRT), a levy designed for Australians to recuperate profits from the extraction of natural resources.\n\n\n\nHowever, despite the increase in companies paying the PRRT, the overall amount of tax revenue collected declined from $1.86 billion to $1.48 billion.\n\n\n\n\n\nDomino's Pizza, with a total income of $700 million, demonstrates why some companies don't pay tax.\n\n\n\n\n\nIt has continued to suffer significant losses in Japan and France, forcing it close over 300 stores globally in the last year.\n\n\n\nWho's paying the most tax?\n\nThe total income of the companies assessed in the report was $3.3 trillion, with $365.5 billion in taxable income.\n\n\n\n\n\nBut more than half the tax paid came from 2.3 per cent of the corporate entities.\n\n\n\n\n\nMining companies Rio Tinto, BHP and Chevron paid $15.8 billion in taxes, with BHP's iron ore subsidiary contributing a further $2.1 billion.\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-two-year-question-in-labors-housing-battle/ji1yydwv5",
    "title": "In a battle to build, these five charts show Labor's housing headache",
    "publish_date": "Wed, 1 Oct 2025 19:32:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Albanese government is once again defending its ability to construct homes and keep up with increased demand.\n\n\n\n\n\nReserve Bank of Australia governor Michele Bullock this week skirted questions about offsetting rising house prices by cutting interest rates, stating she was in the business of targeting inflation as she delivered another rate hold .\n\n\n\n\n\nBullock did admit that, despite government efforts to address a supply hole, she can't see a way through the problem in the next two years.\n\n\n\n\n\n\"You are seeing some action on that, but it's going to be slow to work its way through,\" she told reporters.\n\n\n\n\n\n\"I'm not confident it's going to make any impact in the next two years.\"\n\n\n\n\n\nAhead of the May federal election, Labor campaigned on a $43 billion housing agenda, which includes building 1.2 million homes by 2029 to achieve the National Accord Target, with frontbenchers proudly labelling it \"ambitious\".\n\n\n\nPrime Minister Anthony Albanese said Bullock's remarks were \"common sense\" as it \"takes time to build a home\", promising an \"acceleration\" of building in later years.\n\n\n\n\n\nA spokesperson for Housing Minister Clare O'Neil said on Tuesday: \"Homes don’t get built overnight, but we are seeing a real turnaround in home building right across the country.\"\n\n\n\nOn track to build 1.2 million homes? Not quite\n\nAustralia would need to boost construction to unprecedented levels to catch up and meet its 1.2 million target, surpassing its completion peak of 219,285 dwellings in 2018.\n\n\n\n\n\nTo achieve the target, 60,000 homes need to be built every quarter. In 2024, roughly 45,000 houses and units were built each quarter — a total of 181,789, according to the Australian Bureau of Statistics (ABS).\n\n\n\n\n\nIn May, a report by the National Housing Supply and Affordability Council declared that at the current pace, the government would fall 262,000 homes short.\n\n\n\nAnalysing market changes over five years, it found that while housing prices and rents had soared since 2018-19, approval and completion rates were lagging.\n\n\n\n\n\nThe government had completed 17.8 per cent fewer homes in 2023-24 than five years earlier, with a lack of building of higher-density buildings like apartments particularly acute.\n\n\n\n\n\nBuilding approvals had also been on the decline. However, the latest ABS data, released at the end of September, shows the number of units approved for construction was up 3 per cent over 12 months, despite being down 6 per cent in August.\n\n\n\nMaster Builders Australia estimates one million homes will be built by 2029, also falling short, but CEO Denita Wawn says under the right conditions, the gap can be bridged.\n\n\n\n\n\n\"We're falling short of the stretch target,\" she told SBS News.\n\n\n\n\n\n\"The reason for that really is to do with the lack of skilled people to undertake that work, an inadequate amount of build-ready land, and delays, meaning that there are escalating costs.\"\n\n\n\nWhat can the government do to catch up?\n\nWawn acknowledges that for \"every year we have a shortfall, the forward years keep on increasing beyond 240,000\" homes needed a year to achieve the target.\n\n\n\n\n\nHowever, she believes the government can speed up construction by fast-tracking planning, focusing on skilled migration to attract the roughly 100,000 extra workers needed, and retraining people who didn't complete apprenticeships.\n\n\n\nEconomist Saul Eslake told SBS News state and local government needed to address zoning and planning regulations, with prospective buyers copping high charges imposed on developers, but conceded there's \"no silver bullet\".\n\n\n\n\n\n\"Accessing greenfield sites [undeveloped land] because of poor planning or public transport … has added to the cost and to the time taken to construct new housing,\" he said.\n\n\n\n\"There's a whole of factors involved, and while boosting supply is important, there's no magic bullet that will enable it to happen quickly.\"\n\n\n\n\n\nHe also suggested productivity declines over 25 years could be boosted by innovation, looking to the United States, where prefabricated or modular housing is helping build cheaper homes.\n\n\n\n\n\nProperty Council chief executive Mike Zorbas said even if 1.2 million homes aren't built, the government's target \"remains the best way to keep state governments incentivised and accountable.\"\n\n\n\n\n\n\"Rising construction costs, labour shortages and poor on-site productivity are putting pressure on the industry’s capacity to deliver new housing,\" he said.\n\n\n\n\n\n\"We’re currently behind our targets, but this shouldn’t make us throw up our hands and give up. Instead of conceding defeat, we should intensify our efforts and remain focused on achieving our housing targets.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-sunscreen-tga-recall-explainer/rz9nt85bm",
    "title": "Is your sunscreen safe? What to know amid Australia's SPF ratings storm",
    "publish_date": "Wed, 1 Oct 2025 19:31:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's sunscreen saga continues, with the Therapeutic Goods Administration (TGA) identifying more than 20 products it has placed under review due to concerns they don't accurately reflect their sun protection factor (SPF) rating.\n\n\n\n\n\nEighteen sunscreens have now either been recalled or had their sale paused in Australia amid the TGA's review, which came after an investigation by consumer advocacy group Choice earlier this year.\n\n\n\n\n\nHere's what you need to know about which products have been recalled, how products are tested in Australia, and how to protect yourself as Australia heads into the warmer months.\n\n\n\nWhich sunscreens have been recalled or placed under review?\n\nBack in June, Choice released the results of an investigation which found 16 of 20 products from a range of popular Australian sunscreen brands failed to meet their advertised SPF claims.\n\n\n\nThe product that performed the worst in its testing was Ultra Violette's Lean Screen SPF 50+ Mattifying Zinc Skinscreen, which returned an SPF of 4. The company initially rejected the results , saying it did not accept them as \"even remotely accurate\" and questioning the methodology of the test.\n\n\n\n\n\nIn August, Ultra Violette voluntarily recalled its Lean Screen SPF 50+ product , saying independent lab testing had yielded results showing samples of the product returned widely varying SPF data.\n\n\n\n\n\nOn Wednesday, the TGA said Lean Screen had been manufactured using the same base formulation as a number of other sunscreens manufactured by a company called Wild Child Laboratories.\n\n\n\n\n\nIt said the manufacturer had received preliminary SPF testing results for the base formulation, which indicated it was unlikely to have an SPF greater than 21. Additionally, some of the specific goods manufactured using the base formulation could have an SPF value as low as 4.\n\n\n\nREAD MORE This new Australian skin cancer test takes seconds — and could save thousands of lives\n\nThe affected products are:\n\n\n\n\n\n— Aspect Sun SPF 50+ Physical Sun Protection, and Tinted Physical Sun Protection\n\n\n\n\n\n— Aesthetics Rx Ultra Protection Sunscreen Cream\n\n\n\n\n\n— New Day Skin Good Vibes Sunscreen SPF50+, and Happy Days Sunscreen SPF 50+rs\n\n\n\n\n\n— Allganics Light Sunscreen SPF 50+\n\n\n\n\n\n— Beauti-FLTR Lustre Mineral SPF 50+\n\n\n\n\n\n— Found My Skin SPF 50+ Tinted Face/Body Cream\n\n\n\n\n\n— Ethical Zinc Daily Wear Light Sunscreen, Tinted Facial Sunscreen (Dark), and Tinted Facial Sunscreen (Light)\n\n\n\n\n\n— Endota Mineral Protect SPF50 Sunscreen\n\n\n\n\n\n— We are Feel Good Inc Mineral Sunscreen SPF 50+\n\n\n\n\n\n— GlindaWand The Fountain of Youth Environmental Defence Cream SPF 50+\n\n\n\n\n\n— UltraViolette Velvet Screen SPF50\n\n\n\n\n\n— People4Ocean SPF 50+ Mineral Bioactive Shield Lightly Tinted Cream\n\n\n\n\n\n— McoBeauty SPF 50+ Mineral Mattifying Sunscreen\n\n\n\n\n\n— Naked Sundays Collagen Glow Mineral Sunscreen\n\n\n\n\n\n— Outside Beauty & Skincare SPF 50+ Mineral Primer\n\n\n\n\n\n— Salus SPF 50+ Daily Facial Sunscreen Broad Spectrum\n\n\n\nAll companies have been notified, and many have already voluntarily recalled their products and their TGA registration.\n\n\n\n\n\nThe sale of 10 products has been paused, with another eight recalled or ceasing production. Two are being reviewed.\n\n\n\nHow are sunscreens tested in Australia?\n\nAustralia has some of the strictest regulations on sunscreens in the world. It's one of only a few places that regulate it as a therapeutic good (under the TGA) or a drug, rather than as a cosmetic product, as in the European Union and the United Kingdom.\n\n\n\n\n\nTo sell a sunscreen product in Australia, it must be entered into the Australian Register of Therapeutic Goods and comply with strict standards.\n\n\n\n\n\nThose standards cover things like SPF testing and broad-spectrum UVA testing, as well as water resistance and stability under various conditions.\n\n\n\n\n\nThe SPF rating of sunscreen products in Australia is conducted through testing on at least 10 human volunteers in a laboratory, where a small amount of the product is applied to a test site on their body.\n\n\n\n\n\nResearchers use a device called a solar simulator, which approximates natural sunlight, to measure how long it takes for the skin to redden in an area where the sample has been applied, compared to another part of the skin.\n\n\n\n\n\nThere are some challenges associated with testing, and the TGA noted that the variability of SPF test results is a known issue both in Australia and overseas.\n\n\n\n\n\nThe TGA said it's considering measures to enhance the consistency of SPF testing for all therapeutic sunscreen products in Australia.\n\n\n\nREAD MORE The 'hidden' Australian skin cancer problem that has researchers concerned\n\nMany products sold in Australia are tested overseas, but they are still required to meet the TGA's standards before being sold.\n\n\n\n\n\nOn Wednesday, the TGA said it had \"significant concerns\" about the reliability of SPF testing undertaken by the United Kingdom-based Princeton Consumer Research Corp (PCR Corp), saying many companies responsible for sunscreen manufactured using the same base formula had relied on PCR Corp testing to support their SPF claims.\n\n\n\n\n\nThe TGA said it had informed all companies responsible for sunscreens manufactured using the same base formulation about its concerns with PCR Corp's testing. It said it had written to PCR Corp about its concerns and not received a response.\n\n\n\n\n\nOn Tuesday, Choice CEO Ashley de Silva called on sunscreen companies to confirm which labs verified their latest SPF results.\n\n\n\nWhy is it so important to protect yourself from the sun in Australia?\n\nAustralia has the highest rates of skin cancer in the world and experiences some of the highest levels of UV in the world. It's estimated that two in three Australians will be diagnosed with skin cancer in their lifetime.\n\n\n\n\n\nAnne Cust, a professor of cancer epidemiology at The University of Sydney, said many Australians don't realise just how strong the sun is here compared to the rest of the world.\n\n\n\nREAD MORE The SPF products that could be putting you at risk of skin cancer\n\nOur UV levels are much higher than in the Mediterranean region in Europe, for example, but Cust said if you grew up in Australia, it might not be something you appreciate.\n\n\n\n\n\nTherefore, it's still very important to wear sunscreen (and take other precautions) when going out in the sun, and ensure you're using it properly.\n\n\n\n\n\nCust stressed that we know that even sunscreens with a lower SPF are effective in preventing sunburn and skin damage from the sun.\n\n\n\n\n\nShe welcomed the TGA looking at sunscreens as there \"needs to be high public confidence in sunscreens\".\n\n\n\nHow do you choose a sunscreen, and how can you ensure it's effective?\n\nCust said there were a few things to keep in mind when selecting a sunscreen to wear. While SPF50 is recommended, SPF30 will still give very good protection.\n\n\n\n\n\nYou should also ensure you choose a sunscreen that is both water-resistant and broad-spectrum, covering both the longer-wavelength UVA and shorter-wavelength UVB rays.\n\n\n\n\n\nUVB rays affect the outer skin layers and cause sunburn, which is a significant risk factor for melanoma. UVA, which can often get through glass, penetrates deeply into the skin and causes damage to cells,leading to photoaging. Both can cause skin cancer, so it's important to protect against both.\n\n\n\n\n\nHowever, Cust said while it's important to buy a sunscreen that provides adequate protection, what can often be more important is ensuring you're putting enough of it on and re-applying frequently enough.\n\n\n\nIt's important to reapply sunscreen frequently as well as use other methods of sun protection, such as wearing a broad-brimmed hat and sunglasses. Source: Getty / Liudmila Chernetska/iStockphoto \"Even with a sunscreen that is SPF50, if [people] don't apply enough, they're actually not getting the full SPF anyway,\" Cust said.\n\n\n\n\n\nShe said it was important to reapply every two hours when outdoors, as well as after swimming or sweating, as sunscreen will rub off.\n\n\n\n\n\n\"I think that's more concerning than whether the SPF is 50 or 30, because there's not actually a lot of difference in the efficacy of a sunscreen between SPF 50 and 30,\" she said.\n\n\n\nHow else can you protect yourself from the sun?\n\nWhile sunscreen is an important form of sun protection, it's also just one of several ways to protect yourself as we head into summer.\n\n\n\n\n\nStaying in the shade when possible, wearing a broad-brimmed hat, wearing sunglasses and covering up with clothing are just as important, even if you're also wearing sunscreen, Cust said.\n\n\n\n\n\nThis article contains general information only. For advice relating to your personal situation, see a qualified medical practitioner.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/fire-bans-hit-southern-and-central-qld-as-bushfire-season-looms/o0xemyav0",
    "title": "Fire bans hit southern and central QLD as bushfire season looms",
    "publish_date": "Wed, 1 Oct 2025 10:03:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/video/more-sunscreens-recalled-over-spf-concerns-with-one-testing-facility-questioned/j45e4r64z",
    "title": "More sunscreens recalled over SPF concerns with one testing facility questioned",
    "publish_date": "Wed, 1 Oct 2025 09:58:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "More sunscreens recalled over SPF concerns with one testing facility questioned\n\nPublished 1 October 2025, 8:10 am\n\nMore sunscreen products have been pulled from shelves over concerns they don't provide the level of sun protection they claim. The Therapeutic Goods Administration has also raised concerns about one testing facility linked to numerous faulty products.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/labors-5-deposit-for-first-home-buyer-scheme-launches-as-housing-price-fears-grow/3upt8fbcc",
    "title": "Labor's 5% deposit for first home buyer scheme launches as housing price fears grow",
    "publish_date": "Wed, 1 Oct 2025 09:55:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Labor's 5% deposit for first home buyer scheme launches as housing price fears grow\n\nPublished 1 October 2025, 8:09 am\n\nFrom today first home buyers can enter the market with just a 5 per cent deposit. It was a key Labor election pledge. The government will act as guarantor so buyers avoid paying lender's mortgage insurance. But there's a catch - the measure could raise house prices.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-what-does-the-us-shutdown-mean-in-practice/5bxj2lx2k",
    "title": "INTERVIEW: What does the US shutdown mean in practice?",
    "publish_date": "Wed, 1 Oct 2025 08:37:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/bhp-china-iron-ore-stand-off-house-prices-continue-to-rise/zflasuw75",
    "title": "BHP-China iron ore stand-off; house prices continue to rise",
    "publish_date": "Wed, 1 Oct 2025 08:17:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/philippines-6-9-magniture-earthquake-kills-at-least-60/eexymigxd",
    "title": "Magnitude-6.9 earthquake kills at least 69 in Philippines as injured overwhelm hospitals",
    "publish_date": "Wed, 1 Oct 2025 06:31:36 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "At least 69 people have died after a powerful earthquake hit central Philippines on Wednesday AEST, with injured patients overwhelming hospitals on the island of Cebu.\n\n\n\n\n\nThe shallow quake struck off the island's northern end near Bogo, a city of 90,000 people, according to the US Geological Survey (USGS).\n\n\n\n\n\nThe number of casualties was based on data from the Cebu provincial disaster office and was subject to validation, said Jane Abapo, an information officer at the regional civil defence office. Another official said more than 150 people were injured.\n\n\n\n\n\nInjured children cried and adults screamed while receiving treatment on beds laid out beneath blue tents on the driveway of the Cebu Provincial Hospital in Bogo.\n\n\n\n\n\nThey had been wheeled out of the building amid fears of further harm as hundreds of aftershocks rocked the region overnight.\n\n\n\nSource: SBS News Nearby, hospital workers carried black body bags on stretchers into vans that would take them to local mortuaries.\n\n\n\n\n\n\"We are receiving additional numbers of reported casualties, so this thing is very fluid,\" civil defence official Raffy Alejandro told reporters in Manila.\n\n\n\n\n\nThe Bogo hospital listed 53 confirmed deaths, 30 of them from Bogo, and 154 injured.\n\n\n\n\n\nThe Bogo city hospital has been \"overwhelmed\", Alejandro said.\n\n\n\n'The mall started shaking'\n\nRichard Guion, his left elbow heavily bandaged, recounted how he and his wife, who had a broken foot, were dug from under the collapsed concrete wall of their home by their 17-year-old son, who had been playing outside with his mobile phone when the quake struck.\n\n\n\n\n\n\"When the cement collapsed, I called out to him,\" 39-year-old Guion said, adding he was thankful his son ignored his earlier order to go to bed early.\n\n\n\n\n\nRescuer Teddy Fontillas, 56, told Agence France-Presse that he had not slept a wink, adding some patients had to be transferred to other hospitals because the one in Bogo was already overcrowded.\n\n\n\n\n\n\"I'm already struggling, but what we are doing is necessary to help our patients,\" he said.\n\n\n\n\n\n\"Because of the high volume of patients with serious injuries, the medical staff tended to some of them outside the hospital,\" Cebu provincial governor Pamela Baricuatro posted on her official Facebook page.\n\n\n\nThe Bogo hospital listed 53 confirmed deaths, 30 of them from Bogo, and 154 injured. Source: EPA / Juanito Espinosa Dramatic footage filmed by residents and widely shared on social media showed an old Catholic church on Bantayan Island near Cebu adorned with a string of light bulbs swaying wildly shortly before its belfry tumbled into the courtyard.\n\n\n\n\n\n\"I heard a loud booming noise from the direction of the church, then I saw rocks falling from the structure. Luckily, no-one got hurt,\" Martham Pacilan, 25, who was nearby when the belfry collapsed, told AFP.\n\n\n\n\n\nLocal television showed riders being forced to dismount from their motorcycles and hold onto the railings as a Cebu bridge violently rocked.\n\n\n\n\n\nBuildings were damaged as far as Cebu city, 100 kilometres to the south, where online shoe merchant Jayford Maranga, 21, hid under a restaurant table to avoid being struck by the collapsing metal ceiling of a shopping mall.\n\n\n\n\n\n\"My friend and I ate at the food court near closing time, and then, bang! It was as if the Earth stopped spinning. And then the mall started shaking,\" Maranga told AFP, adding his friend was slightly injured.\n\n\n\nOfficials said people could be trapped beneath collapsed buildings. Source: AP / Rufino Alub The Cebu provincial government has issued a call on its official Facebook page for medical volunteers to assist in the aftermath of the earthquake.\n\n\n\n\n\n\"There could be people trapped beneath collapsed buildings,\" provincial rescue official Wilson Ramos told AFP.\n\n\n\n\n\nThe rescue effort continued overnight as the Philippine Institute of Volcanology and Seismology reported that the region was being shaken by 379 aftershocks.\n\n\n\n\n\nQuakes are a near-daily occurrence in the Philippines, which is situated on the Pacific \"Ring of Fire\", an arc of intense seismic activity stretching from Japan through Southeast Asia and across the Pacific basin.\n\n\n\n\n\nMost are too weak to be felt by humans, but strong and destructive ones come at random, with no technology available to predict when and where they might strike.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-1-october-2025/og0ij6kg9",
    "title": "SBS News In Easy English 1 October 2025",
    "publish_date": "Wed, 1 Oct 2025 04:30:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWelcome to SBS News In Easy English. I'm Biwa Kwan.\n\n\n\n\n\nThe Greens party says it is concerned that the expansion of the federal government's first home buyers scheme is going to make the housing crisis worse.\n\n\n\n\n\nThe party's housing spokesperson, Barbara Pocock, says she is concerned the expanded scheme is likely to fuel more demand, driving up housing prices - and putting people into deep debt.\n\n\n\n\n\nUnder the scheme, first home buyers can buy a house with a five per cent deposit.\n\n\n\n\n\nThe federal government will guarantee a portion of a first home buyer’s home loan under the scheme, so they can purchase with a lower deposit.\n\n\n\n\n\nHousing Minister Clare O'Neil says that will reduce the time required to save a deposit.\n\n\n\n\n\n\"This is lifechanging stuff. And a genuine expansion of home ownership opportunities for that generation of Australians who are facing such a different housing market than their parents and grandparents faced. This is just a part of Labor's ambitious homes for Australia program. We have a 43 billion-dollar agenda. We're building more homes. We're getting renters a better deal. And today, particularly we're getting more young people around the country that amazing opportunity to get into home ownership.\"\n\n\n\n\n\n---\n\n\n\n\n\nAnother ten sunscreens have been pulled from shelves over concerns about their sun protection claims.\n\n\n\n\n\nEighteen sunscreens have now been recalled or paused in Australia.\n\n\n\n\n\nIt follows an announcement from the medicines regulator about testing results from Wild Child Laboratories Pty Ltd, the manufacturer of the base sunscreen formulation used by the Ultra Violette SPF 50+ Lean Screen product.\n\n\n\n\n\nThe Therapeutic Goods Administration says testing indicated the base formulation of the product is unlikely to have an SPF greater than 21.\n\n\n\n\n\n---\n\n\n\n\n\nThere are calls for internet and mobile phone data services to be re-connected in Afghanistan, after the Taliban ordered they be taken offline.\n\n\n\n\n\nMore than 43 million people in Afghanistan are now believed to be impacted by the shutdown, which the UN says has left the country almost completely cut off from the outside world.\n\n\n\n\n\nIt has impacted health programs and banking services.\n\n\n\n\n\nThe UN refugee agency has also been unable to reach its frontline aid workers who are helping with the response to the recent earthquakes that killed 2,200 people.\n\n\n\n\n\nMelbourne-based Afghan community leader Liaqat Khan has told SBS Pashto the shutdown has caused considerable distress amongst the diaspora in Australia.\n\n\n\n\n\n\"This drastic measure triggers the severed critical communication link between Afghans living in Australia, across the globe, and their loved ones back in Afghanistan, causing profound disruption to families and social connections. We view this action as a stark infringement on fundamental freedoms and violation of human rights.\"\n\n\n\n\n\n---\n\n\n\n\n\nLife-sized carvings of camels, gazelles and other animals dating back thousands of years have been discovered in northern Saudi Arabia.\n\n\n\n\n\nThe carvings date back around 12,000 years.\n\n\n\n\n\nScientists say they are confident they were created using a wedge-shaped rock to create sharp lines.\n\n\n\n\n\nArchaeologist Maria Guagnin, from the Max Planck Institute of Geoanthropology, says the carvings and engraving tools found at the site show people were living in the area about 2000 years earlier than scientists initially thought.\n\n\n\n\n\n---\n\n\n\n\n\nTo sport, and in women's cricket,\n\n\n\n\n\nAustralia begins its World Cup campaign against New Zealand in India today.\n\n\n\n\n\nAustralia is aiming to win consecutive O-D-I World Cups, which would be a first for Australia - or any country - since 1988.\n\n\n\n\n\nPhoebe Litchfield told the Willow Talk podcast, she is anticipating a tough game.\n\n\n\n\n\n\"I think for me wherever I bat, I think at the top of the order it's about making the most of the power play. And really, if they give you balls to put it away - you put it away. And kind of get on top of it to then go big throughout the middle - and we have a role to get ourselves in and really go big. Because I feel it is hard to start in India sometimes. Depending on the surface, I guess. But yeah, that's probably where my brain goes.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.theage.com.au/politics/federal/cop-out-prospect-of-climate-summit-spanning-australia-and-turkey-raises-carbon-emissions-question-20251001-p5mzcq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "COP out? Prospect of climate summit spanning Australia and Turkey raises carbon emissions question",
    "publish_date": "Thu, 02 Oct 2025 11:53:09 +1000",
    "category": "finance",
    "authors": [
      "Mike Foley"
    ],
    "text": "Australia and Turkey are considering splitting hosting duties for next year’s global climate summit, a move which could spur thousands of extra passenger flights and burn hundreds of tonnes of polluting aviation fuel in a bid to address the world’s climate crisis.\n\nThe Albanese government pledged in the 2025 election to bring the COP – which refers to the United Nations’ annual climate summit, known as the Conference of the Parties – to Australia in 2026.\n\nAir travel accounts for about 2.5 per cent of annual global emissions, according to the International Energy Agency. Credit: Getty Images\n\nSelecting a host nation requires a consensus of UN members and Turkey has refused to back down from its bid to bring what is known as the world’s biggest trade show to their shores next year.\n\nAustralia is negotiating with Turkey to jointly host the event, according to sources familiar with the discussions, despite Australia’s previous agreement to co-host the event with neighbouring states in the Pacific that are forecast to suffer some of the worst consequences from climate change.",
    "source": "TheAge",
    "cluster_id": 40
  },
  {
    "url": "https://www.theage.com.au/politics/queensland/no-council-more-committed-to-active-transport-declares-brisbane-transport-chair-20251002-p5mzgg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘No council more committed to active transport’, declares Brisbane transport chair",
    "publish_date": "Thu, 02 Oct 2025 11:47:45 +1000",
    "category": "finance",
    "authors": [
      "Felicity Caldwell"
    ],
    "text": "Brisbane councillor Andrew Wines says there is no council more committed to active transport than the current Schrinner LNP council, at a hearing where he also hinted the Story Bridge footpaths would reopen imminently.\n\nSpeaking at a parliamentary inquiry into e-mobility, Wines – the council’s public transport chair – refused to detail how much cash from Brisbane’s multimillion-dollar Neuron and Lime contracts was funnelled back into bike paths to get e-scooters off city streets.\n\nLabor MP Jonty Bush, a committee member of the inquiry, which was holding public hearings on Thursday, asked how much revenue Brisbane City Council received from its 7100 hire scheme e-scooters.\n\nWines said e-scooter revenue was dwarfed by the amount council spent on active transport. Credit: Courtney Kruk\n\nBush said other councils had said each device brought in about $2000 in revenue, which could equate to about $14 million for the council, but Wines responded that those details were commercial-in-confidence.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/who-s-in-and-who-s-out-kangaroos-set-to-name-seven-debutants-for-ashes-20251002-p5mzic.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Who’s in and who’s out? Kangaroos set to name seven debutants for Ashes",
    "publish_date": "Thu, 02 Oct 2025 11:45:56 +1000",
    "category": "sports",
    "authors": [
      "Michael Chammas"
    ],
    "text": "Kevin Walters is set to blood up to seven debutants for the end-of-season Ashes series against England as he moves to finalise his 23-man Kangaroos squad on Monday.\n\nThe Herald can reveal that Broncos superstar Reece Walsh, Roosters flyer Mark Nawaqanitawase, Cronulla hooker Blayke Brailey, Canterbury back-rower Jacob Preston, Newcastle centre Bradman Best, South Sydney enforcer Keaon Koloamatangi and Raiders youn gun Ethan Strange are all in line to be selected in Walters’ squad.\n\nThe series will begin at Wembley Stadium in London on October 25 and will be followed by games at Everton’s new stadium in Liverpool and a match in Leeds at Headingly to close out the series.\n\nThe Kangaroos will also be boosted by the inclusion of Broncos grand final centre Kotoni Staggs.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/a-kiwi-refereeing-the-bledisloe-we-d-be-sweet-as-says-rugby-australia-20251001-p5mz7g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A Kiwi refereeing the Bledisloe? We’d be sweet as, says Rugby Australia",
    "publish_date": "Thu, 02 Oct 2025 11:42:55 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "“Equally, if you look at our own performances in terms of the Wallabies, you have to eliminate as best as you can the referee from the game. We have probably let them come into the game more than should be. We just have to better.” Many of the best and most experienced referees in the world are currently from Australia and New Zealand, including Angus Gardner, Nic Berry, Ben O’Keeffe and Paul Williams. But they are not considered for Bledisloe Cup games because of World Rugby’s neutrality policy. Nic Berry issuing a red card to Lachie Swinton when refereeing the Wallabies in a Bledisloe Cup game 2020. Credit: Getty In 2020, however, when COVID forced drastic changes, Gardner, Berry, O’Keeffe and Williams all refereed trans-Tasman Test matches, and did so without a single moment of controversy. Asked if he’d be open to Australians and Kiwis refereeing Bledisloe games, Waugh said: “Without having spoken to the high-performance team here, I think we want the best referees in the world, refereeing our Test matches.\n\n“If those best referees are in our market, and it’s a New Zealander refereeing a Bledisloe Cup at Eden Park, I am sure we would be fine with that, as long as it’s (one of) the best referees in the world.” Rugby Championship future The Bledisloe Cup was reduced from a three-game series to a two-game series in 2022, but Waugh also revealed he was pushing for the three-game series to return. Loading “It’s obviously disappointing we haven’t won it since 2002. We’ve had some good teams pressed for it as well since then,” Waugh said.\n\n“Everyone probably wants a three-Test series. If you look at the great series of all different codes all around the world, if you’ve got an opportunity to play a best of three … or an odd number. We just obviously spent the weekend with our counterparts in New Zealand, and they’re very constructive around the path forward.” Waugh provided some clarity on the future of the Rugby Championship, after it was revealed the tournament would not be held in 2026 due to New Zealand’s eight-game tour of South Africa, and could be replaced by a series of tours in 2028. Waugh said the Wallabies would still play South Africa, Argentina and New Zealand next year, and the delayed start to the 2027 Rugby World Cup meant a full TRC would also be played that year. Waugh also indicated the Rugby Championship may still be played in 2028, and not the proposed tours, after the success of TRC this year. “It’s yet to be finalised, but there’s a consistency now around the TRC and interest in the TRC which you probably haven’t seen for a long time, and so as we think through 27, 28, 29, that level of consistency is really important in terms of fan-centric and fan engagement,” Waugh said.\n\nSchool stars and Marky Mark The record 81-48 victory of the Australian under 18s over the New Zealand Schools on Monday was followed by questions around how many of the star teenage players will stay in rugby, and how many will be lost to rugby league. Waugh said RA are confident they will keep most of the squad. The Australian Under-18s in action against New Zealand Schools on Monday in Canberra. Credit: Rugby Australia “Last year we had strong results through the Australian under 18s and schools program as well, and we secured 23 of the 26 players in that squad,” Waugh said. “We are hoping to at least achieve that for this group of young men as well. We are reasonably confident with where we are at with the group.” Waugh said he was pleased to hear Mark Nawaqanitawase announce he is returning from the NRL to rugby union at the end of next year, in a bid to play at the Rugby World Cup in Australia.\n\nThe former Wallaby, who has become a sensation in the NRL, also revealed he’d missed the international aspect of the 15-man game and the space on the field. “His comments reflect what we see as our value proposition as being,” he said. “Having players like Mark show interest in coming back to the game in Australia is great to hear, and now we go through the process of ensuring that comes to light.” Loading Waugh was coy on RA’s plans to secure Nawaqanitawase given RA’s push for frugality, however, and he indicated the flying winger playing overseas would not be a barrier to playing at the World Cup: “We will be pretty creative around we establish the best possible team in 27.” But he did indicate he prefers Australian players to be playing in Super Rugby.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/goodfood/brisbane-eating-out/valley-to-score-intimate-rooftop-bar-20250929-p5myqj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Valley to score intimate rooftop bar",
    "publish_date": "Thu, 02 Oct 2025 11:41:24 +1000",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nExclusive Eating outFood Valley to score intimate rooftop bar Most rooftop boozers are huge, but not this one. A celebrated chef and award-winning bartender are onboard, and guests can expect live entertainment four nights a week. Matt Shea October 2, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nWhen Daniel Sprange arrived in Brisbane six months ago, he noticed something about the city’s rooftop bars – they tended to be huge. “For someone from Sydney, Brisbane does them a bit differently,” Sprange says. “Something like Lina [in South Brisbane] or Sunsets [in Woolloongabba] – to me, it’s a unique concept to walk into a corporate or residential building, and you’re on the hunt for it. Then you get up to the rooftop and it’s this wide open space.” Ovolo The Valley manager Daniel Sprange. Markus Ravik Not every rooftop bar in Brisbane is built to such scale, of course. And what Sprange is talking about isn’t confined to rooftops, with Brisbane having history of leaning towards larger food and beverage tenancies, whether they’re on the ground or top floor. But that’s another conversation for another story.\n\nAdvertisement\n\nEither way, he says, Above will be different. Set to open in mid-October on the sixth-floor rooftop of Ovolo The Valley, where Sprange is general manager, the 60-seat Above is intended to be intimate and personable. Not that Sprange takes credit for the conception of Above, which began during the time of his predecessor, James Clark. The hotel group has been developing it for about a year, and hopes it will bolster the hotel’s food and beverage options after the May closure of Za Za Ta to make room for functions and events. Related Article Brisbane restaurant favoured by Billie Eilish closes after six years “We have our brand pillars at Ovolo and food and beverage is a big component of that,” Sprange says. “We still have [bar] Kazba downstairs but this will help elevate us and set us apart [among our competitors].\n\nAdvertisement\n\n“The current set-up up there was a small gym and a sauna and then the rooftop pool. We wanted to bring something to that space, to the hotel and to the community, so we thought, why not activate it?” In charge of the redesign is BSPN Architecture, which has been tasked with adding plenty of textured elements and greenery. The pool is also in the process of being retiled. “We’re giving the tiles a speckled blue treatment, and we hope it will add up to something that gives a Mediterranean feel. There will be a lot of sensory elements, with rendered sand-style walls. It’s designed to reflect the great light we get up there and add to that intimacy.” The completed bar will be heavy on Mediterranean design elements. For food, celebrated consulting chef Justin North and head chef Kya Knights have collaborated on a grazing menu that takes the Middle Eastern focus of Kazba and Za Za Ta before it but shifts ever so slightly eastwards towards the Mediterranean. Expect dishes such as stone baked pita with linseed and garlic oil, an “old-school hummus with crunchy chilli oil, beetroot served with a bulgar spread, and crudite vegetables with tahini yoghurt, soy and spiced pepitas.\n\nAdvertisement\n\nFor drinks, award-winning bartender Jake Down is compiling a cocktail list that for the most part will twist the classics, but also include original drinks and a couple of more refined takes on the rooftop slushy. There will be a focus throughout the list on showcasing Brisbane produce. Related Article Light Years team brings its ‘neighbourhood Italian’ to Brisbane The final element, Sprange says, will be live entertainment four nights a week. “Yes, we’re a hotel but we can’t stand on our own two feet without the support of the local community. There’s a lot of residential around here but also businesses, and we wanted to give them something that they want. “It’s on the fringe of the Valley and it’s somewhere they can wind down and enjoy something different, and something different from our hotel.” Above will open in October at Ovolo The Valley, 33/1000 Ann Street, Fortitude Valley\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Food\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/trump-thinks-the-body-works-like-a-battery-scientists-have-shown-why-he-s-wrong-20251001-p5mz8j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump thinks the body works like a battery. Scientists have shown why he’s wrong",
    "publish_date": "Thu, 02 Oct 2025 11:39:46 +1000",
    "category": "sports",
    "authors": [
      "Angus Thomson"
    ],
    "text": "Professor Andre La Gerche was having lunch with a colleague when the conversation turned to Donald Trump’s theories about exercise.\n\nProfiles of the US president in The New Yorker and The Atlantic have attributed Trump’s avoidance of physical activity other than golf to his belief that the body is like a battery, born with a finite amount of energy, and strenuous exercise only drains those reserves prematurely.\n\nUS President Donald Trump is reported to disapprove of exercise, believing humans are born with a finite amount of energy. Credit: Matt Willis\n\n“We had a bit of a laugh,” said La Gerche. “And then we thought ‘hang on, we’ve got some actual data to prove it’s silly.’ ”\n\nLa Gerche’s team at the Victor Chang Cardiac Research Institute analysed the average heart rate of 109 elite athletes and a control group of 38 non-athletes participating in a long-running study on heart health.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/business/companies/sydney-pub-baron-jon-adgemis-seeks-bankruptcy-over-1-8bn-in-debt-20251002-p5mzip.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney pub baron Jon Adgemis seeks bankruptcy over $1.8bn in debt",
    "publish_date": "Thu, 02 Oct 2025 11:37:08 +1000",
    "category": "finance",
    "authors": [
      "Patrick Begley"
    ],
    "text": "Sydney’s flashy hospitality dealmaker Jon Adgemis has fallen on his sword, declaring himself bankrupt with debts around $1.8 billion.\n\nThe collapse of his Public Hospitality Group follows years of financial woes for the former KPMG management consultant, who had picked up venues including The Norfolk in Redfern, Oxford House in Paddington, Darlinghurst’s The Strand Hotel and Alexandria’s Camelia Grove Hotel.\n\n“I take responsibility for the position that has been reached,” Adgemis said in a statement on Thursday.\n\nJon Adgemis’ pub empire had expanded rapidly before he fell into debt difficulty. Credit: Jesse Marlow\n\n“I am deeply disappointed that my broader vision for the group did not come to fruition, and that, despite sustained efforts, I was unable to deliver a better outcome for creditors.”",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/world/middle-east/this-is-what-solidarity-looks-like-who-are-the-australians-on-the-gaza-flotilla-20251001-p5mz6w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘This is what solidarity looks like’: Who are the Australians on the Gaza flotilla?",
    "publish_date": "Thu, 02 Oct 2025 11:30:02 +1000",
    "category": "sports",
    "authors": [
      "Bronte Gossling",
      "Hannah Hammoud"
    ],
    "text": "The mission represents the largest civilian-led maritime effort to date, attempting to break Israel’s 18-year land and sea blockade of Gaza, which has been enforced with the assistance of the Egyptian military in the south. Drums and cheers from the Palestinian flag-waving crowd could be heard in the background of Rafiq’s August 31 Instagram story, shared after he boarded the Gaza-bound Spectre in Barcelona. Sydney content creator Abubakir Rafiq is part of the Global Sumud Flotilla. Credit: @abubakirrafiq “It’s so loud, it’s so hot, there are a thousand people that came out just to support the flotilla,” Rafiq, wearing a black and white keffiyeh, told the camera. “This is what solidarity looks like, this is insane.” Speaking to this masthead on Wednesday, Rafiq said he felt optimistic about the flotilla’s prospects of success, despite Italy’s withdrawal of support for the international mission on the same day. While Italian vessels had previously escorted the flotilla at various stages of the journey, Italian Prime Minister Giorgia Meloni urged the flotilla to stop and made it clear the naval support would not continue.\n\n“I’m not feeling vulnerable,” Rafiq said. “The Italian government like the Australian government and many governments around the word are complicit in this genocide, so I never expected a navy vessel from them to begin with.” Hobart scientist Julia Henry is aboard the Polish-flagged Huga. She has four children aged from three to 19, and told this masthead in early September: “While I am not an activist, I have always been someone who will stand up to a bully and intervene in something that I think is not right. I am a protector. I was taught, and I teach my children, that is the right thing to do.” Also sailing with the flotilla is Northern Rivers filmmaker and climate activist Juliet Lamont, who directed the 2009 documentary The Snowman, and her two daughters, Isla Lamont and Luca Lamont. Juliet Lamont is acting as first mate on the vessel, the Wahoo, that is also carrying Queenslander Hamish Paterson. On Thursday, Paterson provided an update via social media, confirming that the Wahoo was still sailing and proceeding without interception. He wrote on Instagram: “They jam our internet and our comms with the flotilla so regularly that [it] is hard to get these updates out there.”\n\nAustralians Daniel Coward and Surya McEwan are making another attempt to break the blockade with the Global Sumud Flotilla. In April 2024, both Coward and McEwan were set to depart Turkey for the Gaza Strip with the Freedom Flotilla Coalition, but the humanitarian aid mission was halted after Guinea-Bissau removed its flag from two vessels. McEwen was also part of a Freedom Flotilla Coalition mission that was aborted in May 2025 after being attacked by drones in international waters off the coast of Malta. On September 24, McEwen said on Instagram that his boat, Luna Bark, had been hit with explosives. “The boat is damaged, but other than some hearing loss, everyone onboard is OK and determined to carry on,” he wrote. That same night, Rafiq’s vessel, Spectre, was also hit by drones, he said in an Instagram video. No injuries or casualties were reported. Israel has not commented on whether it was responsible for the alleged attacks last week, though it has repeatedly said it would not allow the Global Sumud Flotilla to reach Gaza, and has linked the flotilla with Hamas. On September 30, Israel’s Foreign Ministry released a post, “Official Hamas documents found in the Gaza Strip”, on X claiming they prove Hamas is directly involved “in the funding and execution” of the Global Sumud Flotilla. Maria Elena Delia, a spokesperson for the flotilla, rejected the allegations and labelled them “propaganda” in a statement to news agency Ansa.\n\nNew Zealand-born, Melbourne-based GP Bianca Webb-Pullman, who is sailing with the flotilla, previously labelled Israel’s allegations that it’s associated with Hamas as offensive. “I can tell you that this is a people’s movement,” Webb-Pullman said from the sea in a video shared to Instagram on September 24. “It’s quite offensive to me as a healthcare worker to have this accusation made because, as healthcare workers, there are many of us on this flotilla; it is absurd … This accusation is incorrect, and we have seen it used by Israel against healthcare workers in Gaza repeatedly.” Are Hollywood actors sailing with the flotilla?\n\nPart of the crowd in Barcelona was Irish actor Liam Cunningham, best known for playing Davos Seaworth in Game of Thrones. “The fact that you guys are here and the flotilla is happening is an indication of the world’s failure to uphold international law and humanitarian law,” Cunningham said in a pre-departure press conference. “It is a shameful, shameful period in the history of our world.” Cunningham is one of the tens of thousands from across the globe registered with the Global Sumud Flotilla, participation in which includes supporting the movement financially or with publicity in lieu of sailing. American actress Susan Sarandon has also expressed her support for the flotilla, as has Swedish actor Gustaf Skarsgård, who is the son of Stellan Skarsgård and brother of Alexander Skarsgård and Bill Skarsgård. Cunningham, Sarandon and Skarsgård are not sailing with the flotilla.\n\nHow did we get here? On August 31, 300 people boarded at least 20 ships in Barcelona, Spain, and set sail for the Occupied Palestinian Territories. More ships joined the maritime convoy from Tunisia and Catania on September 7, though on September 27, the Family Boat stopped its journey after being stranded off Crete due to a “catastrophic technical failure”. It’s estimated that between 50 and 70 ships from 44 countries are attempting to deliver food, water and medicine to Gaza. The Integrated Food Security Phase Classification (IPC) said in August that the Gaza Strip’s largest city, Gaza City, is gripped by famine. Two weeks later, the United Nations Commission of Inquiry on the Occupied Palestinian Territory released a report confirming Israel is responsible for genocide in Gaza. Last week, Italy, which has urged the flotilla to accept an alternative aid distribution proposal from the Latin Patriarchate of Jerusalem in Cyprus, and Spain deployed naval vessels to monitor the flotilla following alleged drone attacks. Italy’s frigate was set to stop once the flotilla got within 150 nautical miles (278 kilometres) of Gaza. Greece’s coastguard also monitored the flotilla when it was sailing through its rescue area, and Reuters reports Turkey has been monitoring the flotilla with drones.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/politics/nsw/vaucluse-loses-its-polo-event-as-residents-complain-about-noise-20250925-p5mxxs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Vaucluse loses its polo event as residents complain about noise",
    "publish_date": "Thu, 02 Oct 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "David Barwell"
    ],
    "text": "A plan to stage an equestrian polo event at a clifftop park in Vaucluse has been reined in by a Sydney council amid fears over the sound of galloping horses, impacts on surrounding home owners and the prospect of hooves tearing up the turf.\n\nWoollahra Council has knocked back a proposal for Christison Park in Vaucluse to be used for a Polo in the City event, which would have seen crowds up to 1500 flock to the site for an afternoon of horseback sporting revelry.\n\nUp to 1500 people had been expected to attend the November event. Credit: Polo in the City\n\nThe planned event was the brainchild of lawyer, polo player and entrepreneur Janek Gazecki, who applied to the council to use the park for a November event that would have included setting up corporate and VIP marquee areas.\n\nBut an assessment by Woollahra Council ruled the park was an “unacceptable” location to stage the event due to concerns over horses causing damage to turf and cricket facilities as well as impacts on other community users – including sporting clubs – that use the park.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/how-nrl-s-biggest-names-predicted-utoikamanu-would-be-the-difference-for-the-storm-20251001-p5mzcv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How NRL’s biggest names predicted Utoikamanu would be the difference for the Storm",
    "publish_date": "Thu, 02 Oct 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "On a murky Monday morning in February this year, some of the biggest names in the game gathered in Sydney for the NRL season launch.\n\nThis masthead made a point of asking all 17 captains and senior players which rival club would win the premiership if their own team fell short. More than half responded the Melbourne Storm – and one of the main reasons was the signing of Stefano Utoikamanu.\n\nBroncos prop Payne Haas said: “The Storm have a lot of talent, and now they’ve added Stefano in the middle. That’s what they needed. You need good front-rowers to win a comp, and they’ll turn him into a great front-rower. We’ve already seen the talent he has. I’m actually excited to see him play.”\n\nCanberra’s Joe Tapine added: “I think Melbourne have bought well with Stefano. He’s a good player and will add to their forward pack. He helped hold that Tigers pack together at different times.”",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/afl/beveridge-rejects-applause-for-dogs-mediocre-season-20251002-p5mzj6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Beveridge rejects applause for Dogs' 'mediocre' season",
    "publish_date": "Thu, 02 Oct 2025 11:25:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "Beveridge rejects applause for Dogs' 'mediocre' season\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/business/companies/if-there-s-a-bubble-tesla-is-it-car-maker-soars-on-hopes-for-musk-s-robot-push-20251001-p5mz5w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘If there’s a bubble, Tesla is it’: Carmaker soars on hopes for Musk’s robot push",
    "publish_date": "Thu, 02 Oct 2025 11:25:35 +1000",
    "category": "finance",
    "authors": [
      "Jordan Fitzgerald"
    ],
    "text": "Tesla shares are on a tear, sending the electric carmaker’s chief executive Elon Musk half-way to becoming the world’s first trillionaire. But will the upcoming third-quarter sales figures be strong enough to sustain the momentum?\n\nThe stock rallied 33 per cent in September, notching their best month in almost a year, as investors rallied around Musk’s renewed focus on the company. Overnight, they jumped another 3.3 per cent, making the billionaire the first-ever person worth $US500 billion ($756 billion) , according to Forbes’ Real-Time Billionaires tracker.\n\nEven more striking is Tesla’s ascent in the market since hitting a low in early April after US President Donald Trump paused his sweeping global tariffs. Since then, the share price has doubled, making it the best performer in the high-flying big tech cohort known as the Magnificent Seven.\n\nThe bet on Tesla is that Elon Musk can transform it from a car maker into an AI powerhouse. Credit: AP\n\nThe bet on Tesla is that Musk can transform it from a car manufacturer into an artificial intelligence powerhouse that makes robots and self-driving taxis. That goal is reflected in the unprecedented $US1 trillion pay package the company’s board proposed for Musk earlier this month.",
    "source": "TheAge",
    "cluster_id": 2
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/the-world-renowned-australian-designer-you-ve-never-heard-of-20250730-p5miy7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The world-renowned Australian designer you’ve never heard of",
    "publish_date": "Thu, 02 Oct 2025 11:25:14 +1000",
    "category": "lifestyle",
    "authors": [
      "Robyn Willis"
    ],
    "text": "As origin stories go, Silvana Azzi Heras has a pretty good one. She was in her final year of her Bachelor of Design at the University of Western Sydney, as it was then known, when her lecturer contacted her about some work with a relatively new designer, Catherine Martin.\n\nIt was the mid-1990s and Martin and her husband, Baz Luhrmann, had enjoyed considerable success with his directorial debut film, Strictly Ballroom (including awards for best costume design and best production design), and the couple was about to start the publicity tour for his next offering, Romeo+Juliet. It was clear their stars were on the rise – and that Martin needed more help.\n\nSilvana Azzi Heras in her studio at home in the inner west. Credit: Steven Siewert\n\nSo, she called the university and asked for recommendations for a couple of the best students in the course. Azzi Heras’ name was put forward.\n\n“That weekend, my dad brought my little Apple computer over to Iona in Darlinghurst [where the couple lived] to help out CM,” she says.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/politics/federal/singtel-rings-up-no-tax-as-miners-and-banks-support-the-budget-20251001-p5mzdw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "SingTel rings up no tax as miners and banks support the budget",
    "publish_date": "Thu, 02 Oct 2025 11:17:53 +1000",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "The parent company of beleaguered telco company Optus failed to pay any corporate tax despite earning more than $8.2 billion in income from Australian customers, as new figures reveal that the federal budget increasingly depends on miners and banks.\n\nThe Australian Tax Office this morning released its annual corporate tax report that outlines the income and tax paid by the nation’s largest private and public companies. In 2023-24, more than 4000 firms paid $95.7 billion in tax on $3.3 trillion of income.\n\nSingapore Telecom, the parent company of Optus, has not paid company tax in four years despite more than $24 billion in income. Credit: Dominic Lorrimer\n\nBut Singapore Telecommunications (Singtel), the parent company to Optus which is under fire over its role in a Triple Zero outage across parts of the country, was not one of them. Despite declaring $8.2 billion in income, it had no taxable income or payable tax.\n\nIt’s the fourth successive year that Singtel has declared more than $8 billion in income but not paid company tax. It last paid tax in the 2019-20 when, on income of $9 billion, it declared $181.8 million in taxable income and paid $43 million in tax.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-as-wall-street-brushes-off-shutdown-tesla-relief-20251002-p5mzfp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Miners shine, sending ASX higher; News Corp slumps",
    "publish_date": "Thu, 02 Oct 2025 11:10:56 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "The Australian sharemarket has advanced at the open, led by mining stocks, while Wall Street rose overnight as it brushed off the shutdown of the US government.\n\nThe S&P/ASX 200 was 80.8 points, or 0.9 per cent, higher at 8926.50 as of 11.07am AEST, with six of its 11 industry sectors in the green. The Australian dollar was fetching US66.08¢ at 10.45am AEST.\n\nWall Street continued to power higher, setting the scene for gains on the ASX. Credit: AP\n\nBHP (up 1.5 per cent) clawed back some of Wednesday’s losses even as the escalating row over iron ore exports between the mining giant and China remains unresolved. BHP shares fell 2.5 per cent in the previous session on reports that China’s state-run iron ore buyer China Mineral Resources Group (CMRG) had told major steelmakers and traders to temporarily halt purchases of all new BHP cargoes. BHP chief Mike Henry spoke with Treasurer Jim Chalmers last night to discuss the dispute.\n\nFellow iron ore heavyweights Fortescue (up 1.2 per cent) and Rio Tinto (up on 0.8 per cent) also advanced.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/national/they-met-every-day-at-the-pool-for-years-until-the-coffee-cup-incident-20250901-p5mrjg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "They met every day at the pool for years – until the coffee cup ‘incident’",
    "publish_date": "Thu, 02 Oct 2025 11:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Stephen Lacey"
    ],
    "text": "I love Adrian’s engagement with life. He has lots of energy and belongs to this incredibly artistic circle. He takes his swag out to Balgo [in Western Australia] and Yuendumu [in the Northern Territory] and sleeps under the stars. He even has a fire pit in his backyard, so when artists come from the desert they feel at home.\n\nWe started having coffee together every morning after a swim. Neither of us was ever afraid of cold water. The pool temperature can be 16 degrees and we’ll still say it’s beautiful. That’s code for, “It’s frickin’ cold but doable.”\n\nRUSSELL : I was introduced to Adrian in 2008 at the Bondi Icebergs swimming club cafe by a mutual friend and we got on immediately. I thought he was a very cultured individual who could talk to anyone about anything.\n\nAdrian Newstead (left) and Russell Cheek: “When you talk to Russell, you have his undivided attention,” Adrian says. “He listens, he gets your story. It’s very endearing.” Credit: Brent Lewin\n\nIndigenous art dealer Adrian Newstead, 77, and performer/quizmaster Russell Cheek, 73, met at their local swimming pool 17 years ago. They’ve swum there every morning ever since – except when Adrian was banned.\n\nIn 2016, he was invited to Paris to show a collection of Indigenous Art Brut. His ability to get things done is just insane. He went to the outback and gathered all these paintings in next to no time. I speak French, so Adrian invited me along to interpret for the exhibition. We had the best time, hanging out in the cafes of the Marais.\n\nVery little about him annoys me, but he does like to complain about his ailments. I just take it all on board. And he’s really bad at texting, especially if he’s travelling. I’ll write to him and won’t hear anything back for four or five days.\n\nHe’s got a temper. Last year, new management at the Bergs cafe introduced paper cups, which are bad for the environment and horrible to drink coffee out of. So Adrian brought down his stoneware Tiwi mug. This new manager told him, “You can’t use that because of OH&S.” Adrian said, “I’ve never heard anything so f---ing lame!” The incident got reported to the board and they banned him from the cafe, club and pool for a year. It was eventually commuted to the first day of winter swimming.\n\n‘Adrian often wonders why we never see people in their 80s or beyond swimming here … We’ve vowed to go on for as long as we possibly can.’ Russell Cheek\n\nWe don’t disagree about much. We talk about footy and cricket, and art. We exchange views on how beautiful and resourceful the women around us are, and we talk about politics. On election night, me, Adrian and Dave Faulkner from the Hoodoo Gurus got together for a meal and we got Labor over the line.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://au.news.yahoo.com/honda-ceos-major-car-warning-as-aussies-set-to-pay-more-for-popular-models-very-real-cost-014233474.html",
    "title": "Honda CEO's major car warning as Aussies set to pay more for popular models: 'Very real cost'",
    "publish_date": "2025-10-02T01:42:33Z",
    "category": "finance",
    "authors": [],
    "text": "Popular models of cars could soon cost much more for Australians to buy if the manufacturer is expected to keep up with a major rule change recently rolled out by the Albanese government, Honda CEO Jay Joseph has warned this week.\n\nThere has been a significant push for car manufacturers to meet stricter emissions targets or face hefty fines since the New Vehicle Efficiency Standard (NVES) was rolled out by authorities in July. Joseph claims Honda will inevitably have to increase the price of petrol and hybrid vehicles to cover the cost of fines it will be forced to pay under the NVES. He says the government's pursuit of electric vehicle (EV) uptake is out of step with consumer demand.\n\n\"We want to minimise how much we pass that along to consumers, but at some point we can't bear those costs without passing them on to consumers,\" Joseph told The Australian.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHonda's new car sales are reportedly expected to rise to 75 per cent hybrid next year, but under the NVES, they will likely be above the low emissions threshold set by the government, and partial cost of the fines will need to be absorbed by the consumer.\n\n\"Most hybrids, we believe, including ours, will start to be above the compliance threshold next July,\" he said, pointing to when the government will renew the policy.\n\nHonda boss claims car emissions policy will be counterproductive\n\nAdvice provided by independent advisory body Climate Change Authority last month, which informed the government's emission reduction target of 62 to 70 per cent, forecast that half of vehicle sales would need to be electric by 2035. Joseph argues this isn't reflected in buying behaviour, and with the cost of petrol and hybrid cars likely to increase, he believes Australians will simply hold onto their old cars for longer.\n\n\"There's a very real possibility that people will buy fewer new cars, and they will keep older vehicles on the road longer because the economics change to the point where it is more viable to invest in repairs and maintenance of older vehicles,\" he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Older vehicles, by their ­nature, have more emissions. They don't have the ­modern emissions technology, not to mention the safety features and other things that benefit all road users,\" he said.\n\n\"I believe there's a very real cost, real unintended consequence, of people keeping older vehicles on the road longer, which is counter-productive to reducing emissions.\"\n\nThe NVES strongly favours the buying of new electric vehicles. Source: The Australian & Getty\n\nHowever, Australia is one of the last major countries to introduce vehicle efficiency laws, which has resulted in us becoming a \"dumping ground\" for the least efficient and most polluting cars, as manufacturers continue to send those cars here, unable to distribute them elsewhere with stricter low-emission policies.\n\nHussein Dia, a Professor of Future Urban Mobility, told Yahoo News previously that the changes will eventually be positive for Australia, even if not immediately apparent at the start. He said the change will \"entice even European manufacturers\" to the Australian market.\n\nEV 'range anxiety' continues to be a major concern for drivers\n\nHonda, as well as Mitsubishi, have urged the Australian government to increase funding for charging infrastructure as anxiety over EVs' range continues to create a major obstacle for drivers taking the leap and buying the new technology.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nProspective drivers are concerned they will struggle to find a charger and instead will be limited on where they can travel to, unlike petrol car owners who can rely on an extensive network across the country.\n\nThe government has committed $40 million to establish 10,000 new EV public chargers as part of the Transport and Infrastructure Net Zero Roadmap, but warned further investment from the private sector is also needed.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 41
  },
  {
    "url": "https://au.news.yahoo.com/hero-drowned-river-tragedy-identified-013704675.html",
    "title": "Hero who drowned in river tragedy identified",
    "publish_date": "2025-10-02T01:37:04Z",
    "category": "finance",
    "authors": [],
    "text": "The man who died while trying to help two children struggling in a river has been identified. Tshering Penjor, 38, drowned in the Moore River at Guilderton, about 90km north of Perth, on Tuesday while trying to rescue the kids, Nine News reports.\n\nMr Penjor was at the popular camping spot with his 13-year-old daughter.\n\nFour swimmers were pulled from the river and paramedics rushed a woman in her 30s to Sir Charles Gardiner Hospital in a critical condition.\n\nTshering Penjor died on Tuesday while trying to rescue two children. Picture: Supplied\n\nTwo girls and a man in his 40s were taken to Joondalup Health Campus, a St John WA spokesman said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nA fundraiser has been set up for Mr Penjor, a member of the Bhutanese community.\n\n“Tshering was kind and hardworking with dedication towards his others,” GoFundMe organiser Arshdeep Singh said.\n\n“He and his family are in need of our support in return. He has left behind his wife and 13-year-old daughter.\n\nFive ambulance crews attended the scene. Picture: ABC News\n\nFour swimmers were pulled from the water. Picture: ABC News\n\n“His family and friends are experiencing an unimaginable loss which cannot be fulfilled.\n\n“Every donation, no matter the amount, makes a difference.”\n\nAs of Thursday morning, the fundraiser had collected more than $2500.\n\nBhutanese Association president Kinley Tenzin told Nine News that Mr Penjor’s wife was in a “state of shock”.\n\n“She was in a state of shock and then she was saying she cannot believe the situation,” she said.",
    "source": "Yahoo",
    "cluster_id": 42
  },
  {
    "url": "https://au.news.yahoo.com/one-quiet-change-let-export-010752654.html",
    "title": "One quiet change is about to let you export much more solar",
    "publish_date": "2025-10-02T01:07:52Z",
    "category": "finance",
    "authors": [],
    "text": "Australia has more solar panels per person than anywhere else in the world. One in three houses now has rooftop solar.\n\nOur grid operators are working hard to adjust to a new reality where the collective output of rooftop solar is one of our largest sources of power.\n\nEach year there are now a few very sunny days without much electricity demand where there’s so much solar the grid can’t absorb it all. To manage this, grid operators have put a limit on how much of our excess solar we can export to the grid – typically 5 kilowatts per house or as low as 1.5 kW in South Australia. This means households have to limit their solar exports most days of the year.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBut that’s changing. A humble new communication standard gives us a smarter way to manage solar exports so households can export more power, more often, without overloading local networks. The standard – known as the Australian Common Smart Inverter Profile – is a set of rules for how inverters and other devices communicate with the grid operator.\n\nIt may sound small, but these new rules could have very large benefits to households and the grid. For instance, it will mean South Australia’s 1.5 kW limit can grow to 10 kW when the local grid has capacity – which is most of the time.\n\nSolar arrays are on one in three Australian homes. We could make even more use of this common technology. Douglas Cliff/Getty\n\nWhy we need to shift to a smarter grid\n\nAround 40% of what Australians pay for power is due to the cost of past grid-building. Billions have been spent over the last 20 years to enable the grid to respond to the growth in peak demand – the few hours a year when demand could outstrip supply, potentially causing blackouts.\n\nAs we electrify homes and transport, total electricity demand could roughly double.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe good news is our solar panels, home batteries and electric vehicles are a very useful way to meet this rising demand and use the existing grid more efficiently. Over time, this should mean power bills finally stop rising. Some estimates suggest they will fall 20% over the next decade.\n\nRooftop solar is going from strength to strength. Globally speaking, Australia is behind on EV uptake but catching up. The new federal subsidy has supercharged the home battery market. Installations have shot from about 200 to 1,000 a day. Heat pumps and electric hot water systems are more and more popular.\n\nSolar panels, electric vehicles and home batteries can be used to avoid expensive grid upgrades. Raja Islam/Getty\n\nThe grid isn’t full\n\nIt’s common to assume the power grid is under strain. But in reality, we’re only using 43% of its capacity.\n\nThat means we can run a lot more through the same poles and wires if we time things better. It would cause much less strain on the grid if electric hot-water heaters, heat pumps and EVs are set to charge during the middle of the day, when solar is abundant.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWith this new standard in place, Australia should be able to avoid some expensive grid upgrades. Recent analysis shows better coordination of our household electricity resources could avoid the need to spend billions on new grid infrastructure such as transmission lines.\n\nWhat are the challenges?\n\nThe new standard will make a rapid and noticeable difference to how much solar householders can export overall. But it won’t be the same everywhere.\n\nA street at the end of a long rural line, with lots of rooftop solar and little daytime demand, will hit export limits sooner than a short urban line near a substation. Some households will be asked to reduce solar output more often than others, which raises fairness concerns.\n\nOur research group is running trials to find fairer ways of allocating grid capacity and to ensure everyone benefits from smart-grid technology.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThere’s also the question of trust. Some people may not feel comfortable letting their power company adjust their devices remotely and may choose to stick with limited solar exports. (Solar arrays can still be shut off remotely in an extreme grid event). Only 43% of energy consumers surveyed trust electricity companies to “do the right thing”.\n\nClearer protections will be essential as Australia’s electricity system grows more diverse, decentralised and complex. As more energy companies offer incentives to households to access the power stored in their EV and household batteries, regulations must be in place to ensure clarity over how much profit is shared with customers.\n\nStandard and deliver\n\nFor Australia’s solar households, this new communication standard will be a boon.\n\nBut expanding solar exports is the easy part. Securing public trust in the new two-way communication system will require clear messaging, enforceable protections, transparency and visible household benefits.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThis article is republished from The Conversation. It was written by: Marnie Shaw, Australian National University and Laura Jones, Australian National University\n\nRead more:\n\n\n\nMarnie Shaw has received funding from the Australian Renewable Energy Agency and Energy Consumers Australia.\n\nLaura Jones receives funding from the Australian Renewable Energy Agency.",
    "source": "Yahoo",
    "cluster_id": 43
  }
]