[
  {
    "url": "https://www.9news.com.au/world/chris-brown-arrested-over-alleged-attack-in-uk-nightclub/64a7bbcb-d849-4e01-a8b5-26b8bc4b3876",
    "title": "Chris Brown arrested over alleged attack in UK nightclub",
    "publish_date": "Thu, 15 May 2025 19:59:01 +0000",
    "category": "entertainment",
    "authors": [
      "May"
    ],
    "text": "U﻿S singer and songwriter Chris Brown has been arrested in the UK over allegations he was involved in the attack of another music producer at a London nightclub in 2023.\n\nBrown﻿ is accused of causing grievous bodily harm to music producer Abe Diaw at \"The Tape\" nightclub in London in early 2023.\n\nHe has not been charged.\n\nU﻿S singer and songwriter Chris Brown has been arrested in the UK over allegations he was involved in the attack of another music producer at a London nightclub in 2023. (Jordan Strauss/Invision/AP)\n\nIn a statement to the BBC, the Metropolitan Police said officers travelled to Manchester to arrest 36-year-old Brown after learning of his presence in the UK.\n\n﻿ ''A 36-year-old man was arrested at a hotel in Manchester shortly after 02:00hrs on Thursday, 15 May on suspicion of grievous bodily harm,\" police said.\n\n''He has been taken into custody where he remains.\n\n\"The arrest relates to an incident at a venue in Hanover Square on 19 February 2023.\n\n\"The investigation is being led by detectives from the Central West Area Basic Command Unit.\"\n\nBrown rose to prominence in the early 2000s with R&B hits such as \"Run it\" and \"Kiss Kiss\".",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/finder-survey-most-experts-predict-rba-to-cut-interest-rates-this-month/c14dbcb9-c9fc-4e00-bb70-9280e80b1294",
    "title": "Experts backing interest rate cut next week, with more on way",
    "publish_date": "Thu, 15 May 2025 22:08:33 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "M﻿ortgage holders can look forward to the first of multiple interest rate cuts starting next week when the Reserve Bank of Australia holds its meeting, according to new research.\n\nA resounding nine in 10 experts from the Finder survey ﻿released today believe RBA Governor Michelle Bullock will next Tuesday announce a 25-basis-point cut to the current 4.1 per cent cash rate.\n\nIt's unlikely to be the last, with three in four of the 41 economists surveyed forecasting two or more cuts to the cash rate over the next 12 months.\n\nReserve Bank Governor Michele Bullock is tipped to announce a cut to interest rates next week, a new survey found.. (9News)\n\nThey could come in July and August, according to 56 per cent.﻿\n\nTheir cheery outlook is backed by the inflation dropping to the RBA's target range of between 2 per cent and 3 per cent.\n\nExperts forecasting cuts also highlighted weak growth in the Australian economy and struggling consumer spending amid the global uncertainty sparked by US tariffs.\n\nThey were further buoyed yesterday when data showed the unemployment rates holding steady. Figures released by the Australian Bureau of Statistics showed the jobless rate remained at 4.1 per in April, in line with economists' forecasts.﻿\n\nIn February, the RBA made the first official rate cut in almost five years, and Finder head of research, Graham Cooke, believes more are on the way.\n\n\"Our experts are predicting several more cuts later this year, and we could be looking at a cash rate of close to 3 per cent by Christmas,\" he said.\n\n\"With any rate cut, if you can continue making the same payment each month, you will knock more off the principal and pay less interest over the long run.\"\n\nAmong the experts in the survey backing the RBA to announce a cut next week was David Robertson from Bendigo Bank.\n\nHe's in the majority expecting a 0.25 per cent reduction, but would like to see more.\n\n\"I expect the RBA to cut rates by another 25 basis points on May 20, with some risk of a larger cut (35 basis points would be ideal) but in the absence of a sudden sharper downturn in global conditions a 50 basis points cut appears unlikely.\"﻿\n\nBut a handful in the survey were more cautious, believing the RBA will keep rates on hold.\n\nThey included Malcolm Wood, of Ord Minnett﻿, who pointed to a tight labour market driving higher wages growth.\n\n\"With no productivity growth, this puts unit labour costs above the RBA's inflation target.\"\n\nDespite Labor's thumping election victory, the experts were skeptical about the Albanese government's pledge to build 1.2 million new homes by 2029.\n\nOne in five think that even if the target is reached, it won't improve housing affordability. ﻿\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/bruce-springsteen-scathing-remarks-donald-trump-administration-on-stage-uk-concert/b32fb3c5-ae6d-494e-9b82-821a1605c702",
    "title": "Rock legend slams Trump in scathing on-stage comments",
    "publish_date": "Thu, 15 May 2025 17:04:29 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Rock megastar Bruce Springsteen has made a series of critical remarks about US President Donald Trump and the policies of his administration, calling the American leader \"unfit\" for office.\n\n\"The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock n' roll in dangerous times,\" Springsteen said at the beginning of a concert in Manchester, northern England, on Wednesday (Thursday AEST).\n\n\"In my home, the America I love — the America I've written about that has been a beacon of hope and liberty for 250 years — is currently in the hands of a corrupt, incompetent and treasonous administration,\" he said.\n\nBruce Springsteen on stage in Manchester on Wednesday. (Shirlaine Forrest/Getty Images via CNN Newsource)\n\n\"Tonight, we ask all who believe in democracy and the best of our American spirit to rise with us, raise your voices against authoritarianism,\" added Springsteen.\n\nThe rock star spoke out several times during the show, later posting clips of his comments to his Instagram account.\n\n\"The last check on power, after the checks and balances of government have failed, are the people — you and me. It's in the union of people around a common set of values. Now that's all that stands between democracy and authoritarianism. So at the end of the day, all we've really got is each other,\" he continued.\n\nHe later criticised some of the US administration's most recent policies.\n\n\"In America, the richest men are taking satisfaction in abandoning the world's poorest children to sickness and death. This is happening now,\" he said.\n\nBruce Springsteen performs during the first night of his 'The Land of Hopes and Dreams' tour at Co-op Live on May 14, 2025 in Manchester, England. (Shirlaine Forrest/Getty Images)\n\n\"In my country, they are taking sadistic pleasure in the pain that they inflict on loyal American workers, they're rolling back historic civil rights legislation that led to a more just and plural society,\" he said.\n\n\"They're abandoning our great allies and siding with dictators against those struggling for their freedom. They're defunding American universities that won't bow down to their ideological demands. They're removing residents off American streets, and without due process of law, are deporting them to foreign detention centers and prisons. This is all happening now,\" added Springsteen.\n\nThe singer also criticised US lawmakers for failing to protect the American people from what he called \"an unfit president and a rogue government,\" and having \"no concern or idea of what it means to be deeply American\".\n\n\"The America that I've sung to you about for 50 years is real and, regardless of its faults, is a great country with a great people, so will survive this moment,\" said Springsteen.\n\nThe Manchester show was the first on the European leg of Springsteen and the E Street Band's Land of Hope and Dreams tour, which will also take in dates in France, Germany, Spain, Italy and the Czech Republic.\n\nSpringsteen previously criticised Trump and urged Americans to vote for Kamala Harris at a campaign rally for the Democratic candidate last year.\n\nHis criticism of Trump comes after Hollywood star Robert De Niro took aim at the US president at the Cannes Film Festival on Tuesday.\n\n\"In my country, we are fighting like hell for the democracy we once took for granted,\" said De Niro.\n\nRobert De Niro accepts the honorary Palme d'Or onstage during the opening ceremony at the 78th annual Cannes Film Festival at the Palais de Festival on May 13, 2025 in Cannes, France (Andreas Rentz/Getty Images)\n\n\"That affects all of us here, because the arts are democratic, art is inclusive and brings people together, like tonight. Art looks for truth. Art embraces diversity, and that's why art is a threat,\" added De Niro, who is an outspoken critic of the US president.\n\n\"That's why we are a threat to autocrats and fascists,\" he added.\n\nDe Niro ended his speech with a call for people to stand up to Trump \"without violence, but with great passion and determination.\"\n\n\"It's time for everyone who cares about liberty to organise, to protest and when there are elections, of course, to vote. Vote,\" the actor added.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/explainer-why-are-there-so-many-banknotes-in-australia-when-hardly-any-of-us-are-using-them/fa613ea9-0758-4961-b60a-785c478356fe",
    "title": "Why are there so many banknotes, when hardly any of us are using cash?",
    "publish_date": "Thu, 15 May 2025 03:28:41 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "The amount of banknotes circulating in Australia is at a near-record level not seen since the height of the pandemic.\n\nThe latest figures from the Reserve Bank of Australia (RBA) balance sheet , released last week, show there is a staggering $103.7 billion in notes in circulation.\n\nAs pro-cash advocacy group Cash Welcome points out, there has almost never been more cash physically circulating in Australia.\n\nThe amount of physical cash circulating in Australia is at a near-record high. (iStock)\n\n\"The all-time record for the total value of Australian notes circulating is $103.99 billion set in December 2022,\" the group's founder, Jason Bryce, said.\n\nBryce points towards the rise in the amount of banknotes in circulation as proof that Australia is far from heading towards a cashless society.\n\nYet, the fact remains that fewer and fewer of us are using physical cash in our everyday lives.\n\nSo, what exactly are Australians doing with all these banknotes?\n\nThe answer is more likely to be shoving them under our mattresses than using them at the supermarket checkout.\n\nAn analysis of the post-pandemic demand for banknotes by the RBA last year found the amount of cash actually being used for ordinary transactions had fallen by around four per cent since the end of the pandemic to around 13 per cent.\n\nJust a small proportion, between 9 and 26 per cent, of all banknotes are now used for what they were originally intended - legitimate everyday purchases.\n\nA further 5–9 per cent of banknotes in circulation have likely been lost, the analysis found, while another 7–11 per cent are used in the so-called 'shadow economy' for nefarious or criminal transactions.\n\nThe vast majority of our banknotes, however, about 55-80 per cent, are being hoarded, the RBA estimates.\n\n\"The dichotomy of strong banknote demand alongside falling transactional use suggests banknotes are being hoarded, likely for store-of-wealth or precautionary savings purposes,\" the RBA said in its analysis.\n\nThe chart, provided by Cash Welcome, shows the amount of cash in circulation from 2022 to 2025. (Cash Welcome)\n\nOne strong clue pointing towards hoarding is the demand for high-denomination banknotes, the RBA noted.\n\nWhile growth in low-denomination banknotes, $5, $10 and $20 notes typically used for everyday transactions, has only increased by an average 1 per cent annually since 2007, the number of $50 and $100 notes in circulation has shot up by around 5 per cent a year during the same time period.\n\nThe situation indicated \"much of the increase in banknote demand over this period was for hoarding purposes\", the RBA said.\n\nHowever, far from becoming a nation of hoarders, it's likely to be a minority of Australians who are skewing the figures and hanging on to all of that cash.\n\nA 2022 RBA consumer payments survey found 60 per cent of respondents did not hold any cash outside of their wallet.\n\n\"Instead, large amounts of cash are likely hoarded among a relatively small number of individuals,\" the RBA said.\n\nAssociate Professor Andrew Grant, from the University of Sydney Business School, said that although people holding onto cash were sometimes painted as paranoid or doomsday preppers, there were legitimate and rational reasons behind the trend.\n\nHigh-profile cases of cyber attacks had led to a lack of trust in banks and other institutions, while previous outages in electronic payments systems showed the danger of relying on our cards and phones, he said.\n\n\"I think people certainly do feel like even our electronic systems aren't infallible,\" Grant said.\n\n\"We have seen instances where the Optus network has gone down, for instance, and then people can't buy anything because all of the shops are using the same telecommunications tool.\n\n\"So perhaps there is something in it to say, well, what if there is a global cyber attack? What if there is some sort of event that brings systems down?\n\n\"How long can I survive? If I have cash, I'd expect people to still be able to accept that.\n\n\"It's also the general logic about why people might hold a bit of gold.\"\n\nHaving come through a pandemic, Australians were also only too aware of how easily social and economic structures could disintegrate when desperation kicked in, Grant said.\n\n\"We've seen people get into fights at the supermarket over toilet paper. We're not that far away from becoming uncivilised, I suppose.\"\n\nGrant agreed with the RBA's assessment that society was essentially being split into two definitive groups - those who held cash and those who didn't.\n\n\"There's basically a polarisation, almost, where people are either very pro-cash or pretty anti-cash,\" Grant said.\n\n\"A lot of Gen Z and younger people generally don't like to even carry a wallet. They want to transact with their phone and carrying a wallet makes you old, and it's a sign that you're not with it.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/oscar-piastri-remaining-focused-ahead-of-f1-grand-prix-imola/105299818",
    "title": "Piastri is 'just trying to win' as he chases Senna's McLaren record",
    "publish_date": "Fri, 16 May 2025 01:43:43 +0000",
    "category": "sports",
    "authors": [],
    "text": "Formula 1 championship leader Oscar Piastri enters this weekend's Emilia-Romagna Grand Prix riding a wave of momentum.\n\nThe Melbourne-born McLaren driver has won the previous three grands prix, and holds a 16-point lead over teammate Lando Norris in the drivers' championship with a quarter of the season completed.\n\nPiastri's victory two Sundays ago in Miami created history for McLaren, with the Australian becoming the first in 28 years to win three consecutive grands prix for the famed British team.\n\nF1 returns to Imola, the scene of its darkest hour, and the start of a new focus on safety Photo shows Men and women in an F1 garage look on with concern, with one woman biting her sunglasses While the legendary Ayrton Senna took most of the spotlight, Roland Ratzenberger's legacy lives on through F1's safety innovations.\n\nThe record for a McLaren driver is four, held by the legendary Ayrton Senna, a feat Piastri can replicate this Sunday night at the famous Imola circuit, where Senna lost his life in a crash 31 years ago.\n\nThe McLaren team dominated the Miami Grand Prix with Piastri and Norris claiming a 1-2, and finishing more than half a minute ahead of the rest of the field.\n\nWith four grand prix wins this season and the fastest car over race distance, Piastri said he was not getting ahead of himself despite being in a great position.\n\n\"I think there will be a lot of competition, but I feel like I'm driving well at the moment,\" he said at Imola on Thursday, local time.\n\n\"I feel like the team's doing a really good job helping me get the most out of myself, get the most out of the car.\n\n\"Clearly, the car is very strong.\n\n\"I think we have the potential to have a really good year, but I'm not too concerned about that at the moment — just trying to win more races.\"\n\nMcLaren won last year's constructors' championship and are at the front of the field again after six rounds.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe team holds a 105-point lead over second-place Mercedes, which is having a solid season despite being the only outfit in the top four not to register a grand prix or sprint race victory.\n\nPiastri told the media on Thursday his, and McLaren's, main focus was to beat their rivals, while also acknowledging the inter-team fight with Norris in the drivers' championship.\n\n\"For me at the moment, the results have been a good confidence boost for myself, so that's always important,\" he said.\n\n\"But in terms of the mentality and feeling in the team, we're still trying as hard as we can to beat all the other teams — and also each other.\n\n\"I think that's going to remain the same for the rest of the year.\"\n\nABC Sport will have a live blog of the Emilia-Romagna Grand Prix this Sunday, with the race beginning at 11pm AEST.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/wallaroos-to-face-usa-rugby-superstar-ilona-maher/105299746",
    "title": "Wallaroos set to face rugby's biggest star",
    "publish_date": "Fri, 16 May 2025 01:37:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "There are not many times when, in Australia, the Australian national team might not be the biggest drawcard on show.\n\nAnd yet this weekend, as the Wallaroos welcome the USA to Canberra for their Pacific Four clash, there will likely be a significant number of people in the stands there to watch one player — and she is not Australian.\n\n\"I've been talking to my friends about this,\" Wallaroos backrower Tabua Tuinakauvadra told a press conference in Canberra on Thursday.\n\n\"This is the first game they're coming to watch me play rugby, but they're coming to watch Ilona first.\"\n\nTabua Tuinakauvadra says friends who will watch her play for the first time will be there for Ilona Maher. (Getty Images: World Rugby/Johan Rynners)\n\nIlona is American star Ilona Maher, and it is not necessarily a surprise that the casual fan wants to see her play.\n\nWith 4.9 million Instagram followers, Maher has the highest social media following of any active rugby player.\n\nThat's right: more than the next-most-popular French superstar Antoine Dupont (1.2 million) and trailblazing South African skipper Siya Kolisi (1.4 million) combined.\n\nTo put it into even more perspective, you could add the England rugby team (1.5 million) and the Wallabies' (493,000) Instagram followers to that tally and still not have as many as the 28-year-old from Vermont.\n\n\"It's that visibility,\" Tuinakauvadra said.\n\n\"She's got such a great reach, she's such a personality off the field.\n\n\"It's what's drawn a lot of people to the game and lots of people have gotten into the game because of her, and lots of people will come and watch because of her.\n\n\"The more people we can reach, the more people we can inspire is all better for the game.\"\n\nIt is not just for her rugby that Maher has found her following.\n\nShe competed on Dancing with the Stars and became the first woman to lift her partner during a dance — living by the mantra she tells to her 3.5 million followers on TikTok: Beast. Beauty. Brains.\n\nIlona Maher finished as a runner-up on Dancing with the Stars. (Getty Images: Disney/Eric McCandless)\n\nThat was also the headline of the piece when she appeared in Sports Illustrated in 2024.\n\nA big part of Maher's message is that it is important to be comfortable in your own skin.\n\nOn the House of Maher podcast she does with her sisters Olivia and Adrianna she has said this is why she wears lipstick in games.\n\n\"I've always just found that, being put in that box of being a rugby player, you have to be big and masculine … I've never liked that I was told to be this certain way when I played sport,\" Maher said.\n\n\"It's us taking back our own narrative and saying, like, an 'f you' to those who think that we have to leave our beauty and femininity at the door when we play this tough sport.\"\n\nAfter winning bronze with the USA in Paris — at the expense of the Australian team — Maher has made the switch to the 15s game.\n\nIlona Maher will have fond memories of playing the Aussies in sevens. (Getty Images: ISI Photos/Alex Ho)\n\nAs part of that, she completed a short stint with Bristol in the UK, proving so popular that games needed to be moved to Ashton Gate stadium to accommodate the record crowds that flocked to see her.\n\n\"I love being a superstar,\" Maher told The Guardian earlier this year, following her Bristol stint.\n\n\"People call me the superstar of rugby but that's not enough for the sport. We can't just have one superstar.\"\n\nThe rugby public may have anointed her as the queen of women's rugby, but that is translating to big crowds too, with women in particular attending matches.\n\n\"In men's sports, you have a lot of male fans, especially in rugby. It's a boys' club. You have a lot of old men going to their team's game,\" she said in Bristol.\n\n\"Can we now get more women buying our jerseys and coming to our games? Women have power, women have influence and they're a good fanbase to have.\"\n\nIlona Maher is attracting new fans to the sport. (Getty Images: PA Images/Zac Goodwin)\n\nPlaying at outside centre last week against Canada, a match the USA lost 14-26, Maher will line up again in Canberra and have another chance to help grow the game with a big crowd in attendance.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women's Sport Survey.\n\nTuinakauvadra said Maher's presence was key and that by having women athletes show their personalities to a wider audience, the sport could only grow.\n\n\"The more we can get ourselves out there and show that we're humans first and athletes second, it's something that definitely appeals,\" Tuinakauvadra said.\n\n\"Not only to people coming up but people that just flick on the TV and the rugby will be on.\n\n\"If you can recognise that we are individuals as well, it's something that will definitely pull more people into watching and supporting us.\n\n\"I think it's such an exciting time to be an athlete and a woman playing sport right now.\"",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/inclusive-accessible-beyond-barriers-melbourne-design-week/105294548",
    "title": "Hannah has to meticulously plan going out. Better design would change that",
    "publish_date": "Fri, 16 May 2025 01:10:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "As someone who navigates the world using a wheelchair, the inaccessibility of public spaces is something I'm all too familiar with. It's a barrier I have to consider every time I travel, socialise outside my house, or go somewhere for work.\n\nIt's part and parcel of the mental load I carry as a physically disabled person, and it means my every move has to be meticulously planned and prepared for.\n\nThe list of ways a space can be inaccessible is frustratingly endless. Stairs. Gutters. Uneven terrain. Gaps between a platform and train. Narrow doorways or hallways. No lifts to bathrooms. And on and on it goes.\n\nPushing for change in how society tackles accessibility is one of the major cornerstones of my work as a disability advocate.\n\nHannah Diviney is a disability activist, author and actor. (Supplied)\n\nAnd the main issue I've found in all these years?\n\nPeople's attitudes; the way businesses and organisations value the \"worthiness\" of adapting a space when faced with things like cost or the amount of work it might take.\n\n\"Far too often, accessibility is treated as a compliance issue rather than a creative and innovative design opportunity,\" says Tim Wilson, director of Folk Architects.\n\nAs part of Melbourne Design Week, his organisation has teamed up with the Public Record Office Victoria to create Beyond Barriers, an exhibition showcasing the history and ingenuity of the disabled community throughout Melbourne and Australia.\n\nIt gives space and voice to individuals and movements long overdue for recognition.\n\nThe exhibition's goal is simple: to challenge and remove some of the stigma associated with making things accessible. It makes the case that inclusive and universal design benefits everybody.\n\nAnd it offers proof.\n\n'Little things matter'\n\nThe recent redesign and renovation of the Melbourne Arts Precinct — encompassing various creative institutions in the CBD — is an example of the city positioning itself as a leader in accessible design of public spaces.\n\nProjected image of Laak Boorndap, gardens that form part of the Melbourne Arts Precinct works.\n\nNick Morris is an independent consultant on universal design, accessibility in infrastructure, operations and events, and has been involved in the precinct's design. He also happens to be a Paralympian.\n\n\"True accessibility is looking at how an environment is designed, doing our best to remove barriers and making sure that the public has a seamless experience no matter what their accessibility needs,\" he says.\n\nAcross his decades of experience in the industry, Morris has advised on everything from commercial buildings to The Great Wall of China and multiple Olympic Games.\n\nHe was involved in the Arts Precinct Project and is keen to make clear that, in designing the space, the team really did try to consider everybody and everything.\n\nThat includes people with physical disabilities, and also those who are neurodivergent or who live with sensory issues.\n\nDisabled actors creating change in theatre Photo shows Close up of Bridie McKim, smiling widely, standing with long blonde hair, blue singlet and cream pants. Representation of people with disability has progressed, but, as actor Hannah Diviney explains, there's still a long way to go.\n\nIt also includes parents, the elderly and women who might be moving through the precinct at night. I'm ashamed to say that hadn't even crossed my mind when it comes to accessible design, but that's why discussions about universal design are so important.\n\n\"Little things matter and make a difference to people's experience,\" Morris says.\n\n\"Everything from lighting and how frequent or intense it is to signage, wayfinding and pathways, bathrooms, quiet areas, benches, places parents could take unsettled children to calm down, literally anything and everything we could think of.\"\n\nFolk Architects engaged people from a wide range of communities and walks of life, using their lived experience and knowledge to inform the Beyond Barriers project, something Wilson hopes will become the norm in public architecture and construction projects moving forward.\n\n\"It's an important way to signify that everyone is welcome in a space and deserves to enjoy it,\" he says.\n\nI've experienced first-hand that when these things are considered too hard or expensive, it sends a painful message to people with disabilities that our existing out in the world doesn't really matter.\"\n\nAs is often the way, when it comes to accessibility and equity in this country, we've made a lot of progress but we still have a long way to go. Here's hoping the exhibition does what it can to move the needle forward.\n\nThe Beyond Barriers exhibition talk and panel is on at 5.30pm, Wednesday, May 21 as part of Melbourne Design Week, May 15-25.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/doctors-say-genital-herpes-underreported-due-to-shame-and-stigma/105289814",
    "title": "Woman diagnosed with genital herpes as teen says shame was crippling",
    "publish_date": "Fri, 16 May 2025 01:05:07 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Growing up in regional Queensland, Jasmyn Gaggiano was relatively naive when it came to sexually transmitted infections (STIs).\n\nIt was not something she was taught about at school, or by her parents.\n\nSo it came as a shock for Ms Gaggiano, now 23, when she was diagnosed with genital herpes in the months after becoming sexually active as a teenager.\n\nMs Gaggiano wants to encourage others to speak out to break down stigma. (Supplied: Jasmyn Gaggiano)\n\nA nurse was the first to tell her it could be herpes after her symptoms left her unable to get out of bed.\n\n\"I couldn't go to the toilet, I struggled to move — it was horrible,\" she said.\n\nIt was her nonna, who she was staying with at the time, who decided she needed to go to hospital.\n\n\"[The nurse] looked at it and she said, 'Look, I'm going to be honest with you … I think this is genital herpes,'\" Ms Gaggiano said.\n\n\"And I said, 'What's herpes?'\"\n\nSTIs are increasing in Australia. Can anything lower these rates? Photo shows Generic stills of pamphlets with information about sexually transmitted infections, including chlamydia and syphillus. Sexual transmitted infections have continued to grow across Australia over the last three decades, with chlamydia, gonorrhoea and syphilis spiking in New South Wales alone. The reasons why are complex, experts say.\n\nWhen tests confirmed genital herpes, otherwise known as HSV-2, Ms Gaggiano said she was initially not bothered.\n\n\"I was like, 'Well, I don't need to tell anyone. I've got a boyfriend,'\" she said.\n\n\"And then we broke up and it sort of just hit me like a truck ... I was like, 'I'm going to have to tell people now.'\"\n\nMs Gaggiano said feelings of shame and isolation quickly set in.\n\n\"I thought, 'Everyone's going to find out. No-one's going to want to be friends with me. No-one's going to ever want to love me,'\" she said.\n\n\" I fell into a pretty big depression. \"\n\n'Lived with that secret'\n\nIt took Ms Gaggiano two years to feel confident to talk to someone other than her mum and nonna about her diagnosis.\n\nDuring that time, she even moved to a school in a different town.\n\n\"I lived with that secret for a few years until I turned 17 or 18 and I had a chat with my friend [who] confided in me that she had it too,\" she said.\n\n\" It did make me feel like I wasn't alone. \"\n\nJasmyn Gaggiano (right) with her sisters Chloe and Tiffany. (Supplied: Jasmyn Gaggiano)\n\nAfter speaking out, Ms Gaggiano felt empowered to start posting about her experience online at the age of 18.\n\n\"I really wanted to put a post out there and just tell everyone,\" she said.\n\n\"I felt like I had my control ripped away from me … like I didn't choose to get it.\"\n\nSince sharing her story, more than 200 people have contacted her to share their own experiences.\n\nGenital herpes under-reported\n\nQueensland Health Department data suggests about one in eight sexually active Australians have genital herpes.\n\nGino Pecoraro says genital herpes is potentially more common than thought. (AAP: Russell Freeman)\n\nBut according to National Association of Specialist Obstetricians and Gynaecologists president, Gino Pecoraro, it could be more common.\n\n\"It's hard to get an accurate incidence rate because a lot of people just suffer in silence and don't necessarily go and get it diagnosed or let people know that they've got it because of a stigma associated with it,\" Dr Pecoraro said.\n\nCommon symptoms include:\n\nMild tingling or itching\n\nGlands in the groin may become swollen and tender\n\nSmall blisters accompanied by irritation, pain, redness and swelling\n\nThe formation of shallow ulcers.\n\nGenital herpes is described as one of the most common STIs and can be caused by herpes simplex virus (HSV) type 1 or 2.\n\nThe more common HSV-1, or cold sores, can lead to genital herpes through oral sex.\n\nDr Pecoraro said transmission could occur in a number of other ways, including from people who were asymptomatic or it could be passed on to a baby during pregnancy.\n\nDating 'daunting' at first\n\nAt first, Ms Gaggiano said it was \"daunting\" to inform potential partners about her genital herpes diagnosis.\n\nBut that changed when she realised \"everybody deserves a choice\".\n\nMs Gaggiano said she managed her symptoms by visiting her GP for medication if an outbreak occurred, which she said was thankfully rare.\n\nShe said she hoped the more she and others talked about genital herpes, the more normalised it would become.\n\n\"It's just a massive cycle and it won't stop until we talk about it and educate ourselves,\" Ms Gaggiano said.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/john-pesutto-victorian-liberals-moira-deeming-defamation/105300370",
    "title": "Former Victorian Liberal leader ordered to pay $2.3m in costs from defamation battle",
    "publish_date": "Fri, 16 May 2025 00:55:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Former Victorian Liberal leader John Pesutto has been ordered to pay more than $2.3 million in costs after losing a defamation case brought by fellow Liberal MP Moira Deeming.\n\nThe order raises the prospect he will be bankrupted and forced out of state parliament.\n\nMs Deeming successfully sued Mr Pesutto after he moved to expel her from the party room in 2023 after she attended an anti-trans-rights rally that was gatecrashed by Neo-Nazis.\n\nIt is understood Mr Pesutto will be unable to pay the costs order, or his own legal bills, and has been seeking loans from Liberal powerbrokers to fend off being made bankrupt, but no deal has been struck.\n\nBankrupts are disqualified from state parliament.\n\nProminent Liberals trying to raise funds for Pesutto\n\nThe legal battle was prompted by Ms Deeming attending a Let Women Speak rally at state parliament in March 2023.\n\nThe event, categorised by supporters as a women's rights event, featured UK anti-trans-rights activist Kellie-Jay Keen. Ms Deeming was also involved in organising the rally.\n\nLate last year a judge found Mr Pesutto defamed Ms Deeming on multiple occasions, including in radio and TV interviews.\n\nThe court found Mr Pesutto had conveyed an imputation that Ms Deeming \"associates with Nazis and is thus unfit to be a member of the parliamentary Liberal Party\".\n\nMs Deeming was awarded $315,000 in damages and Mr Pesutto ultimately lost his job as party leader.\n\nMs Deeming, who was expelled from the Liberal party room in the weeks after her attendance at the rally and exiled to the crossbench, was readmitted after her defamation win.\n\nThe leadership tensions and the court case became a front for the battle for control of the state party that was taking place internally.\n\nIt is understood Mr Pesutto has sought financial assistance from the Cormack Foundation, an investment body that provides financial assistance to the Liberal Party.\n\nOther prominent Liberals have also tried to raise funds for him.\n\nIf he is forced from parliament, there is no guarantee that the Liberals will retain his Hawthorn seat in a by-election.\n\nThe seat sits within the independent-held federal seat of Kooyong, and internal voting-booth analysis of the May 3 election results show a tough road for the Liberals in the electorate.\n\nOpposition Leader Brad Battin was tight-lipped in the wake of the ruling, dismissing questions about a by-election as hypothetical.\n\nHe has been criticised by some of his colleagues for failing to broker a peace deal to avoid a costly by-election.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/lifeguards-ato-owed-money-as-company-enters-liquidation/105291788",
    "title": "Lifeguards owed $400,000 in super as company enters liquidation",
    "publish_date": "Fri, 16 May 2025 00:49:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "A lifeguarding service provider that has gone into liquidation will be asked to pay more than $400,000 in unpaid superannuation to former employees.\n\nDocuments from the Australian Securities and Investments Commission (ASIC) and liquidators show the Australian Taxation Office (ATO) will also claim an additional $1.4 million from the company.\n\nThe business, LSA Venues Central West Pty Ltd, is a sister company of Lifeguarding Services Australia Pty Ltd, and was used to pay more than 520 workers employed at pools in Queensland and New South Wales.\n\nLiquidators Jirsch Sutherland said it appeared a \"significant number\" of employees were owed superannuation.\n\nIn a statement, they said the ATO had found workers were owed just over $404,000 of unpaid superannuation from July 2021 to December 2024.\n\nLifeguarding Services Australia still operates pools in locations including Mackay, Emerald and Forbes, and previously held contracts at Airlie Beach and Kempsey.\n\nThe business was used to pay workers employed at pool venues in Queensland and New South Wales. (ABC Tropical North: Bryn Wakefield)\n\nEntitlements a 'key priority'\n\nLifeguarding Services Australia owner Stan Wall said a key priority of the liquidation was ensuring all staff entitlements were paid.\n\n\"We are working closely with an independent body to solve [the issue],\" he said.\n\nMr Wall said the unpaid entitlements \"are a result of varying reasons, including a staff member failing to provide us with a correct tax file number.\"\n\nHe recommended that any staff member with entitlement claims contact the Fair Work Commission.\n\nMr Wall said current management contracts, including the Bluewater Lagoon, Emerald Aquatic Centre and Forbes Olympic Pool, would not be impacted by the liquidation.\n\nConcern over money owed\n\nA former employee at the Blue Water Lagoon in Mackay, Sarah Lowcock, said the company owed her thousands of dollars.\n\n\"Personally, it would be about eight grand [in] unpaid super for me,\" she said.\n\nSarah Locock says she is owed superannuation after working for the company in Mackay. (ABC Tropical North: Bryn Wakefield)\n\nMs Lowcock said she would love to see the money she claimed to be owed, but believed the news of liquidation meant it was unlikely.\n\n\"There's not enough money, I don't think,\" she said.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/virtual-reality-games-not-dead-but-tech-challenges-remain/105254626",
    "title": "Virtual reality gaming 'not dead' but awaiting killer app",
    "publish_date": "Fri, 16 May 2025 00:29:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "In Steven Spielberg's 2018 film Ready Player One, humanity spends its days entertained in a massive virtual reality (VR) game called OASIS.\n\nBut in 2025, Spielberg's dystopian vision of a VR future is far from reality.\n\nVirtual reality games are still an entertainment niche, with manufacturers reducing prices to clear unsold VR headsets, VR software publishers laying off employees, and many development studios closing their doors.\n\nWhile concerns remain around motion sickness, social isolation and the lack of a \"killer app\" — a game so enjoyable that it drives up VR headset sales — Australian gamers, developers and researchers insist VR games are \"not dead\".\n\nLoading\n\nThey say there are still many possibilities for VR games, including in therapeutic settings, with Australians making unique contributions to the medium.\n\nAnais \"Naysy\" Riley, a Queensland content creator, says the immersion and physicality of the games are a great part of the appeal of VR for Australians.\n\n\"When you play a game, you're still controlling a character. But when you're in VR, it's a lot more immersive and you are that character,\" she says.\n\n\" If you're playing a Star Wars game, you're picking up a lightsaber and physically get to swing it. You get to face Darth Vader yourself … it's a bit more physical. \"\n\n\"It used to be quite expensive to get into VR and you used to need … an expensive PC and all these external sensors. But now [VR headsets] are cheaper than ever.\"\n\n'Stable niche' with persistent problems\n\nAccording to James Birt, Associate Professor of Creative Media Studies at Bond University, VR games have \"not hit the mark\" of traditional video game formats, even with streamlined and \"reasonably priced\" headset technology.\n\n\"We're looking at about 5 per cent of Australian households owning a [VR] headset … and about 50 million headsets [sold globally] across all the different brands,\" Dr Birt says.\n\n\"[Nintendo] sold 100 million units of the [interactive video game console] Wii … I think that's what the VR companies were really hoping they were going to get.\n\nJames Birt is a strong proponent of using VR games as a learning tool in educational settings. (Supplied: Bond University)\n\n\"But it's a magnitude below what one would consider as mass adoption and certainly tiny when you look at PlayStation or Xbox or PC or the [Nintendo] Switch.\n\n\" It's a niche of a larger industry, but it's a stable niche, and I think that's why I say that VR games are not dead; they've stabilised. \"\n\nDr Birt believes a \"stigma\" around VR games causing motion sickness was created by people who felt sick playing in earlier, less advanced VR headsets.\n\n\"It's a real shame because there are some absolutely incredible VR gaming experiences available that are so engaging and engrossing,\" he says.\n\nA lack of multiplayer experiences that can be enjoyed socially also hurts their mainstream appeal.\n\nGamer mums bonding with kids Photo shows A smiling, fair-haired woman with a pair of gaming headphones on. Gaming can bring numerous benefits for mums, research shows, but there is still stigma to be faced.\n\n\"VR is considered isolating because you're within the headset, you're by yourself. Beat Saber is a perfect example of that … it's an individual experience within an immersive world,\" Dr Birt says.\n\n\" I think a lot of people love to play multiplayer games, but they also love to play them together in the same space, and I think that is something that VR doesn't afford at all. \"\n\nFor many players, the lack of a \"killer app\" is the biggest obstacle to buying a VR headset.\n\nBut Ms Riley says finding a \"killer app\" depends on individual tastes.\n\n\"I found my killer app, it was Beat Saber. We've had some great games like Half-Life Alyx … that was the killer app for some people,\" she says.\n\n\"I think it's just finding the game that gets you into VR, and that's going to be different for everyone. How do you define a killer app?\"\n\nAustralian studios close\n\nJustin McArdle, the founder of FrameLabs, a software development studio based in Fremantle, Western Australia, says working in VR is an opportunity to be at the cutting edge.\n\nBut this opportunity comes with significant challenges for Australian studios.\n\nFrameLabs receives support from the WA government and Screenwest to fund the development of VR projects. (Supplied: FrameLabs)\n\n\"In Australia, [we are] very lucky to have government support, but you do get the feeling that if you actually look at the metrics on how many VR games have been supported across all those initiatives, it's low,\" Mr McArdle says.\n\n\"You can see that there is a kind of reticence about [VR games], you feel they don't really understand … we've had indie game studios going under [in Australia], which has been heartbreaking for the community.\"\n\nIn February 2025, Toast Interactive, the Gold Coast-based development studio that developed Max Mustard (2024) and Richie's Plank (2017), closed down.\n\nAccording to Mr McArdle, Australian studios contribute \"incredible creativity and energy\" to the global VR development scene.\n\nAward-winning Max Mustard was developed in Australia by Toast Interactive. (Supplied: Toast Interactive)\n\n\"[Richie's Plank] is the go-to for so many people who want to demonstrate the power of VR,\" he says.\n\n\"Whenever I meet with people around the world at games conferences, their eyes light up when they hear 'Australia'.\n\n\"They think it's a really creative, really innovative development community with really cool ideas.\"\n\nFuture uncertain, but many possibilities\n\nMr McArdle says Australian developers are adapting to an emerging younger audience and focusing on creating free-to-play, multiplayer experiences in VR.\n\n\"They are a teen audience … they haven't got money to pay for [games], so they're looking for free-to-play and they're really into the social aspects,\" he says.\n\nHe remains optimistic for the future of VR games and his studio has diversified into developing VR applications for the education, health and training sectors, including in therapeutic settings.\n\nBond University is using VR games to \"break down barriers\" between children and clinical psychologists. (Supplied: Bond University)\n\nAt Bond University, researchers have trialled using a VR version of Minecraft to help children overcome anxiety when seeing a clinical psychologist.\n\nPatients can interact with therapists in a virtual world before meeting them face to face.\n\n\"[It] allows the clinician and the child to build a rapport in an experience that's familiar for the child, but in an immersive environment where the child doesn't see the clinical environment,\" Dr Birt says.\n\nAppeal to buy virtual reality headsets Photo shows boy with blue tee wears virtual reality headset An appeal is launched to raise funds for virtual reality headsets that can help keep children calm when they have to go to hospital.\n\nThe trial has been well-received by both parents and clinicians.\n\n\"It's a really big win for youngsters who look at it as not about going and seeing the psychologist, but about playing with somebody because that person is doing what their friends would do in Minecraft with them,\" Mr McArdle says.\n\nHe believes VR games are \"very much not dead\" but evolving in a way not previously envisaged.\n\n\"I think we are on the cusp of a whole new wave that, over the next five years, you'll see feed into [the] mainstream.\"\n\nHe says Australian development studios are working towards making VR more accessible but need government support to continue \"during this difficult period\".\n\n\"We don't want Australia to be left behind because of spatial computing, artificial intelligence … they're all game-driven technologies and skill sets that can be deployed across any industry.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/erin-patterson-mushroom-murder-trial-blog-friday-16-may/105299730",
    "title": "Live: Erin Patterson's murder trial to hear from more witnesses",
    "publish_date": "Fri, 16 May 2025 00:26:46 +0000",
    "category": "lifestyle",
    "authors": [
      "Tim Callanan",
      "Kristian Silva",
      "Judd Boaz"
    ],
    "text": "Questions now turn to the amount of toxin that constitute a potentially lethal dose.\n\n\"There are lots of variables that needed to be considered for that lethal dose,\" Dr Gerostamoulos says, including the age and health of the subject and he confirms that is based on animal studies, not human studies.\n\nDr Gerostamoulos agrees that most of the studies on death cap mushroom comes from Europe because that is where most poisonings occur.\n\nMr Mandy is discussing a study which showed some people who consumed death cap mushrooms reacted with different levels of severity, which is categorised in four grades.\n\nHe mentions the first grade in which a person does not develop liver or kidney issues even though they ate the same meal as people who reacted more severely.\n\nDr Gerostamoulos is asked about whether, depending on an individual person's tolerance, the person's response may be different to that of other people who've eaten the same meal, and he agrees.\n\nHe also agrees that factors such as age, health, and weight might influence their response.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/pointsbet-fined-by-acma-for-spamming-customers-gambling-ads/105297304",
    "title": "PointsBet fined $500,000 after spamming customers with gambling ads",
    "publish_date": "Fri, 16 May 2025 00:18:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "An online gambling provider has been fined $500,000 after a communications watchdog investigation found the company sent more than 800 messages that breached Australia's spam laws.\n\nThe Australian Communications and Media Authority (ACMA) also found that PointsBet Australia breached laws related to BetStop — the National Self-Exclusion Register (NSER) — which allows people to exclude themselves from online gambling.\n\nBetStop was launched by the Albanese government in August 2023 to deliver a system that would protect gamblers who wanted to quit.\n\nWe lose billions each year to online gambling, but a new bill might help Photo shows Close up of phone with someone about to place a bet on a sports game Billions are lost by people betting online, mostly by those who can't afford it. A bill that would force online betting outfits to display to each client what they're losing, and what they've lost, each time they log on is hoped to change that.\n\nThe regulator found PointsBet sent 508 marketing messages between August and September 2023 to people on the self-exclusion register.\n\nBetween September and November 2023, the online gambling provider sent 705 emails that contained a direct link to its betting products without including an unsubscribe function.\n\nThe online gambling provider also sent 90 commercial texts without sender contact information.\n\nACMA chair Nerida O'Loughlin said it was concerning that PointsBet customers who took steps to exclude themselves from online gambling were receiving gambling material.\n\n\"People signing up to the NSER are taking positive steps to remove online gambling from their lives. Their decision must not be compromised by companies like PointsBet,\" Ms O'Loughlin said\n\n\"Wagering providers must also appropriately identify where messages promote or advertise their services and ensure that those messages comply with the rules, including the obligation to promote the NSER.\"\n\nThe watchdog found no customers who had registered to be excluded from online gambling had placed bets with the company during the period investigated.\n\nIf you or anyone you know needs help: Lifeline on 13 11 14\n\nGambling Help Online on 1800 858 858\n\nBeyond Blue on 1300 22 46 36\n\nA spokesperson for PointsBet said the investigation was launched after it self-reported a system failure in 2023 with the implementation of the BetStop system.\n\n\"While the company does not necessarily agree with the basis of all the findings, nor the quantum of the penalty, PointsBet put forward, and the ACMA accepted, the enforceable undertakings pursuant to which the company will review and strengthen its compliance processes,\" a spokesperson said.\n\n\"In terms of the spam findings, the emails 'containing a direct link to its betting products' were transactional, responsible gambling communications which included the PointsBet logo that unintentionally had an embedded link to our website. They were not intended to be commercial in nature.\n\n\"In relation [to] BetStop, the ACMA found that none of the impacted customers were able to login or place a bet while registered on BetStop. Throughout the investigation, PointsBet was transparent and cooperative with ACMA.\"\n\nLoading...\n\nCalls for a national gambling regulator\n\nMonash University's Charles Livingstone, who is a gambling researcher, said the online wagering industry in Australia makes almost $9 billion annually, so a $500,000 penalty was a \"drop in the bucket\".\n\nDr Livingstone added that those who had self excluded had taken steps to cancel their account, and create distance from gambling.\n\nOnce you register for BetStop, licensed Australian online and phone gambling providers will not be able to:\n\nlet you place a bet\n\nlet you open new betting accounts\n\nsend you marketing messages.\n\n\"Spamming those people is like giving an alcoholic a bottle of whiskey,\" Dr Livingstone said.\n\n\"It's really dangerous. It could lead them straight back into a dangerous habit that they have themselves decided they no longer want to participate in, and it shows gross irresponsibility.\"\n\nCharles Livingstone says the federal government needs to establish a national gambling regulator. (Supplied: Monash University)\n\nAustralians lose more than $25 billion a year on legal forms of gambling, representing the largest per capita losses in the world, according to official government research.\n\nHow Australia's biggest pokies dynasty is rewriting its legacy Photo shows Len Ainsworth poses for a portrait at a table in a dark room with poker machines behind him. Len Ainsworth built an empire on poker machines — devices that changed gambling forever. Over the last few decades, he's quietly shifted his attention, and power, towards philanthropy.\n\nDr Livingstone was critical of the federal government's \"delayed response\" to key recommendations from the You Win Some, You Lose More report stemming from a parliamentary inquiry into online gambling.\n\nThose recommendations included banning all advertising for online gambling and establishing a national regulator for online gambling.\n\n\"The number one would be establishing a national regulator with effective power to stop these practices,\" Dr Livingstone said.\n\n\"Financial penalties are so much water off a duck's back for many of these wagering operators, and they can absorb very significant financial penalties because they're making what we call an addiction surplus.\n\n\"If we had a national regulator, we could enforce universal standards, and we would find much more compliance.\"\n\nTim Costello says Australia's national blind spot is gambling. (ABC News: Scott Jewell)\n\nThe calls for a national regulator for gambling has been echoed by gambling reform advocate Tim Costello.\n\n\"We have the greatest gambling losses per head in the world and the greatest gambling harm of anywhere in the world. If America's blind spot is guns, ours is gambling,\" he said.\n\n\"It's absolutely time for the prime minister and the Albanese government to respond to the [You Win Some, You Lose More] report they've had now nearly three years.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/north-sydney-council-rate-rise-knocked-back-by-ipart/105299680",
    "title": "North Sydney's controversial 90pc rates hike plan knocked back",
    "publish_date": "Fri, 16 May 2025 00:10:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "North Sydney Council has lost a bid to hike rates by almost 90 per cent, with the regulator ruling it failed to make a compelling case for the massive rise.\n\nThe council applied to increase rates by 87 per cent over two years, pushing minimum residential rates from $715 to $1,548.\n\nUnder the plan submitted to the Independent Pricing and Regulatory Tribunal (IPART) rates for businesses would have gone up by even more.\n\nProtesters rallying outside the North Sydney Council meeting earlier this year. (ABC News: Ethan Rix)\n\nThe council claimed it needed the extra revenue to immediately start repairing its financial position, build up unrestricted reserves to guarantee financial strength and fund new infrastructure.\n\nThe issue has caused an uproar in the community since it was announced, with a council meeting in February descending into chaos when councillors voted to approve the plan.\n\nDuring that meeting North Sydney Mayor Zoë Baker shouted \"this is an outrage\" as locals heckled and called for the resignations of councillors supporting the proposal.\n\nCost blowouts\n\nThe costs to redevelop the iconic North Sydney Pool have blown out by an estimated $60 million. (AAP: Bianca De Marchii)\n\nIn knocking back the council's plan, IPART said the council failed to clearly identify the need for the dramatic increase in rates, and also that it was not clear about how it would spend the money\n\nIt noted criticisms from locals that the rates increase would be used to pay for a massive blowout in the cost of redeveloping the North Sydney Olympic Pool.\n\nThat project has seen the iconic swimming spot remain a construction zone since 2021.\n\nIPART has ruled instead of the 87 per cent requested, the council can only increase rates by 4 per cent next financial year, but it can lodge a new application in future years.\n\nCr Baker told 702 Radio Sydney Breakfast in the wake of the ruling that the council will have to cut $25 million from its budget for the coming financial year to avoid a \"real cash liquidity crisis\".\n\n\"They said that we should look to cutting services that are nice to have, not need to have,\" Cr Baker said.\n\n\"If that's the case, the IPART process is just not fit for doing really long-term structural repair.\"\n\nCr Baker said the council did not want to to sell assets to meet its financial obligations, so cutting the budget is the only short-term solution.\n\nNorth Sydney Council votes for 87pc rate hike Photo shows An artist's impression of the redeveloped North Sydney Olympic Pool The packed gallery inside the council chambers erupted in boos and jeers as the special rate variation was passed by councillors late on Monday night.\n\nThe Northern Beaches Council, which sought to increase rates by 40 per cent over three years, has had only the first two years of its plan approved, meaning rates will rise by 25 per cent by 2027.\n\nMayor Sue Hines said IPART's review of the council's cost savings and budgets was positive.\n\n\"I don't think people realise that councils these days provide so much more than roads, rates and rubbish … everything you virtually look at or touch is normally an asset of councils,\" Cr Hines said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/edible-insect-industrys-squeamish-consumers/105282822",
    "title": "Squeamish consumers a bit of a problem for edible insect industry",
    "publish_date": "Thu, 15 May 2025 23:33:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Easily dismissed as a \"hard sell\" to squeamish consumers, Australia's insect industry wants to be the nation's next agricultural powerhouse.\n\nAs it explores the use of insects in everything from human consumption to pet food and waste recycling, the industry admits there are some critical barriers still to overcome.\n\nIt hopes to address those with a $2 million research program led by the University of Adelaide that will help develop food standards, market opportunities and public education.\n\nStill early days\n\nProfessor Kerry Wilkinson from the university's School of Agriculture, Food and Wine said public perception and a lack of standards and regulation were some of the critical hurdles to the sector's growth within Australia.\n\n\"It's an emerging industry … still relatively young but absolutely growing and increasing its footprint, and that's really being underpinned by the amazing potential for what insects can do,\" Professor Wilkinson said.\n\n\"We can use them to manage food waste problems, but the insects themselves also represent a really high-value and nutritious protein source.\n\n\" It might be a bit of a hard sell for us to convince people to eat insects now, but with some insects there is that potential. \"\n\nThe global insect industry is forecast to be worth billions of dollars in the coming years. (Landline: Glyn Jones)\n\nExploring insect potential\n\nProfessor Wilkinson's research began more than a decade ago, focusing on mealworms and crickets as food, but has expanded to a multitude of potential uses.\n\n\"There's a whole range of applications and for me as a researcher it's really exciting to see the other things that insects can be used for — things like biofuels and pharmaceuticals,\" she said.\n\n\"There's potential to use them in pet food, and we've found that most pet owners are actually more comfortable with the idea of feeding their dogs with insect-based pet food than plant-based pet food.\"\n\nSupported by AgriFutures Australia, Professor Wilkinson has assembled a research team across the nation to tackle the challenge of \"social licence\", but also barriers like biosecurity and food safety.\n\n\"When farmers are rearing livestock, whether for human consumption or other uses, there are lots of standards in place and we want to make sure the [insect] industry is protected by similar standards,\" she said.\n\nPatricks of Coonawarra owner Luke Tocaciu offers cellar door visitors a chance to taste bugs alongside wine. (ABC South East SA: Elsie Adamo)\n\nIn South Australia's Coonawarra, winery owner Luke Tocaciu has been offering a \"Crickets and Cabernet\" edible insect and wine tasting for the past year.\n\nHe said many visitors to the cellar door had been open to trying edible insects for the first time.\n\n\"We've had lots of different reactions. People are surprised they taste good,\" Mr Tocaciu said.\n\nThe business was inspired to offer tastings due to edible insects' sustainability.\n\n\"It doesn't take a lot of energy to produce these insects and they are quite high in protein,\" he said.\n\n\"It's a really innovative space [and] I think it will be a growing industry in Australia.\"\n\nTurning waste into feed\n\nOlympia Yarger runs GoTerra, an Australian company that has developed a system using maggots to turn farm and food outlet waste into animal feed.\n\nUniversity of Adelaide Professor Kerry Wilkinson (left) and GoTerra founder Olympia Yarger. (Supplied)\n\nShe said insects were one of the most exciting opportunities in Australian agriculture today.\n\n\"Even though as an industry it's very young, we are constantly relying on international imports of feed ingredients to produce Australian produce and that is a sustainability issue, and it's a sovereignty issue,\" Ms Yarger said.\n\n\"So any way we can produce feed ingredients in Australia without taxing our existing supply chain is an absolute win.\n\n\"We need to put more time and energy into these sorts of inputs because any way we can do that means we can reduce costs for farmers.\n\n\"We can also create a much more stable feed security plan for Australia moving forward.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/afl-greats-pay-tribute-to-robert-walls/105299490",
    "title": "'Grateful' Roos reveals how he dashed home to farewell AFL champ Walls",
    "publish_date": "Thu, 15 May 2025 23:20:38 +0000",
    "category": "sports",
    "authors": [],
    "text": "Former Fitzroy and Sydney champion Paul Roos has revealed the emotional dash he made to Melbourne from the United States to farewell his coaching mentor Robert Walls.\n\nWalls died on Thursday after using voluntary assisted dying laws, having been diagnosed with acute lymphoblastic leukaemia, a rare and aggressive form of blood cancer, in 2023.\n\nRoos played for Fitzroy from 1982 to 1994, crossing paths with Walls who coached the Lions from 1981 to 1985.\n\n\"[When I heard Walls's death was imminent] I jumped on a plane and came back to Australia to see Robert specifically. I'm forever grateful,\" Roos told the ABC Sport AFL Daily podcast.\n\nLoading...\n\n\"I spent a few hours with him and we spoke about footy and life.\n\n\"He gave me some advice and I made sure he knew what a legacy he had left. I thanked him for everything he had done.\n\n\"It was an amazing conversation and something not many people have an opportunity to do, so I'll forever treasure that.\n\n\"I said, 'Mate, do you understand the legacy you left?' and he said 'Yeah, I think I do.'\"\n\nWalls was known as a hard coach who set high standards, guiding Carlton to a premiership in 1987 before stints at the Brisbane Bears and Richmond.\n\n\"He was always tough,\" Roos said.\n\n\"He was an athletic player but also a tough player. As a coach, he was innovative but he was also tough. I said to him, 'You were tough on us,' but he said, 'Paul, you guys were ready to be coached.'\n\nPaul Roos has explained the impact Robert Walls had on his career. (AAP: Julian Smith)\n\n\"He was tough and he was hard, and one of the main things he taught me was about feedback. The feedback he gave me I knew was from the heart because he wanted me to get better. And then the discipline and the hard work.\"\n\nWalls's time at the Bears — where he inherited an expansion side struggling both on and off the field — was criticised by some, particularly after it was revealed years later that Bears player Shane Strempel quit football after he was subjected to a brutal boxing session in 1991 that left him bloodied and bruised.\n\n\"He needed to know that he had to pay a price for his indiscretions, and he needed to be given an opportunity to earn some respect,\" Walls wrote in an article in 2001.\n\n\"For 10 or 12 minutes, he sparred/boxed five or six different opponents.\n\nRobert Walls (right) with Fitzroy champions Bernie Quinlan and Leon Harris. (AAP)\n\n\"I stood within five metres of him throughout, ensuring that he was in a safe situation. There were to be no haymakers or round arms.\"\n\nCarlton coach Michael Voss, who started his career under Walls, said he was an \"incredible mentor\" who was a \"hard arse\".\n\n\"I've copped the greatest sprays of all time from Robert,\" Voss said.\n\n\"Because I was in year 11 at school, I used to have my maths, and because he was a teacher I used to just try and break the ice by asking him for some advice about how I solved the maths problem.\n\n(From left) Jeff Gieschen, Ron Barassi, Bob Skilton, John Nicholls and Walls watch on as the Victorian team warms up for the 1995 State of Origin match. (Getty Images: Mark Dadswell)\n\n\"I didn't want to ask him about football because we weren't very good back then, so we lost a lot, but yeah, that's probably one of my more fond memories.\"\n\nThe three-time Brisbane premiership captain remembered Walls as having a massive influence.\n\n\"As hard as it was for that two and a half hours to sit beside him, it was also a great opportunity to be able to know him, the man, not just the coach,\" Voss said.\n\n\"He's been an incredible mentor for me over a very, very long period of time.\n\nMichael Voss (pictured) said Robert Walls shaped his early days at the Bears. (Getty Images)\n\n\"He's a genuine hard arse and really taught about professionalism and work ethic and didn't accept another standard except the best … he also drew the best out of you.\n\n\"As far as what he means for Carlton, he's taken legend status for us, so it probably shows just how much, how high a regard he's held. He'll be dearly missed.\"\n\nGeelong coach Chris Scott, who also started his career under Walls, said moving to Queensland from Victoria with Nigel Lappin, who is an assistant coach at the Cats, was a difficult time, but Walls helped shape the men.\n\n\"Wallsy was the first coach that Nigel Lappin and I ever had as professional footballers,\" Scott said.\n\n\"We went up as 17-year-olds to the fledgling Brisbane Bears, who had done it tough for a few years already. All the people who have had success at the Bears, the Lions and Fitzroy people that came across in time all reflect back on that time as really formative for the future success.\n\n\"The key person within that was Robert Walls.\n\n\"I tend to think about how hard that was, especially now being a head coach with all the support that I have. I can empathise for Wallsy, who was in a coaching sense a one-man band.\n\n\"For him in his last days and for his family, they must be so proud to reflect back on where football is now, particularly in the northern states, and everyone looks back and thinks if it wasn't for him, Brisbane wouldn't be in the situation that it is now.\n\n\"On a personal level, and I speak for Nigel Lappin as well, we wouldn't be where we are without him.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/terminal-breast-cancer-prompts-family-trip-around-australia/105283392",
    "title": "Mum of three with terminal cancer says 'don't wait to live your life'",
    "publish_date": "Thu, 15 May 2025 23:13:11 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Kate Hardman was heavily pregnant with her third child when she was diagnosed with terminal cancer and given three years to live.\n\n\"Your world falls apart, you're terrified,\" Kate said.\n\nShe had previously been diagnosed with breast cancer twice, but this time it had spread to her spine, fracturing the C5 vertebra in her neck.\n\n\" You feel like you're going to lose everything, you feel like you're going to miss out on your children growing up. \"\n\nKate Hardman required surgery after breast cancer spread to her spine. (Supplied: Kate Hardman)\n\nKate was flown from Darwin to Brisbane for immediate surgery on her neck and gave birth to her daughter a week later.\n\n\"She came at 35 weeks, perfectly healthy, little bundle of joy, small but perfect,\" the proud mum said.\n\n\"No effects from the treatment, the surgeries or anything that we'd been through.\"\n\nKate, now 40, was first diagnosed with breast cancer in 2017 after she discovered abnormalities while breastfeeding her first baby, a son who is now eight.\n\nKate Hardman was pregnant with her third child when she was diagnosed with terminal cancer. (Supplied: Kate Hardman)\n\nShe had a mastectomy on her left breast and was given ongoing medication, which she came off in 2021 so she and her husband Kriss Hardman could expand their family.\n\nIn 2023, when she was pregnant with her third child, the cancer returned in her right breast.\n\n\"I was 23 weeks pregnant when I was diagnosed for the second time with breast cancer, but it was bilateral … so I had a mastectomy on the right [breast],\" Kate said.\n\nAt 28 weeks, she began chemotherapy.\n\n\"I started my chemotherapy and then I started to get a sore neck … it got increasingly worse … I was having spasms in it.\"\n\nKate Hardman's breast cancer spread to her spine, fracturing her C5 vertebra. (Supplied: Kate Hardman)\n\nA CT scan revealed the cancer had spread to her neck and was now incurable.\n\n\"You kind of hit rock bottom, it's just devastating … your world gets turned upside down,\" Kate said.\n\nHer husband described the prognosis as overwhelming.\n\n\"Everything is on your brain, a million miles an hour,\" he said.\n\n\" You're thinking, how long is she going to be here for? Am I going to be bringing three kids up on my own as a single dad? \"\n\nBut after the initial shock, the couple decided it was time to shift their perspective and make the most of their time together.\n\nKate and Kriss Hardman have three young children. (Supplied: Kate Hardman)\n\nDetermined to find joy in living\n\nThe Hardmans have created a list of everything they want to experience together as a family, while they still can.\n\n\"Don't wait to live your life,\" Ms Hardman said.\n\n\" Get out there and do what you want to do because no-one is promised tomorrow. \"\n\nAlong with their kids — their son, and their daughters, aged three and one — they packed their lives into a caravan almost two months ago and hit the road.\n\nThe family plans to travel around Australia for 18 months, to create memories and to raise awareness about breast and prostate cancer, which Kriss has been successfully treated for.\n\nThe Hardman family is travelling around Australia making memories and raising awareness of cancer. (Supplied: Kate Hardman)\n\n\"My oncologist gave me a three-month supply of chemotherapy tablets,\" Kate said.\n\n\"How it works is every three months, I have to give them notes of where I'm going, and I get my referral sent to that hospital.\n\n\"I also have to do monthly blood tests, which get sent back to my oncologist in Darwin.\"\n\nEvery four weeks, Kriss Hardman gives his wife her hormone suppressant injection. (Supplied: Kate Hardman)\n\nKate says that while she does suffer some side effects from the medication, they are manageable and don't limit her daily life.\n\nProstate cancer caught early\n\nRaising awareness is also a personal mission for Kriss, 36, who was diagnosed with prostate cancer in 2020.\n\n\"I was lucky, I had some surgery and caught it really, really early,\" he said.\n\n\"I don't think I would have caught it as early had I not had a wife who had breast cancer.\n\n\"I would have put it off. I would have been one of those blokes that said, 'I'll go next week, next month', and then by the time you put it off and don't go, maybe it's too late.\"\n\nThe Hardmans are urging people to have regular check-ups with their GPs.\n\n\"It can save your life. It saved mine. If I had left it, I might not be here,\" Kriss said.\n\nThe Hardman family set out on their caravanning trip about two months ago. (Supplied: Kate Hardman)\n\nKate said cancer could impact anyone.\n\n\"I wouldn't be doing anything that I'm doing now had this not happened,\" she said.\n\nAnd they still have plenty of goals to tick off.\n\n\"We've still got countries and places written down in her little book somewhere that says I want to go and see this, do this, I want to experience this,\" Kriss said.\n\n\"That's what I want to achieve while she is here … I want to tick off as many of these places as we can.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/sigur-ros-live-australia-orchestra-tour-interview/105287774",
    "title": "After 25 years, Sigur Rós are used to people fainting at their concerts",
    "publish_date": "Thu, 15 May 2025 23:09:56 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "You never forget your first time hearing Sigur Rós. Their evocative, ethereal compositions sound unlike anybody else — a mix of post-rock grandeur, ambient soundscapes and neo-classical that manages to feel epic yet intimate.\n\nTwenty-six years after their groundbreaking second album, Ágaetis Byrjun (translation: A Good Beginning), made them Iceland's biggest sonic export since Björk, Sigur Rós continue to spellbind audiences with music that's difficult to categorise but easy to be swept up in.\n\nThis week, they bring the magic back for an Australian tour that sees the group accompanied by a full-scale orchestra.\n\n\"We always wanted to do a show with a full orchestra, but we never really wanted to do the kind of classic 'band and orchestra show',\" bassist Georg Holm tells Double J's Karen Leng.\n\nListen to Double J's interview with Sigur Rós Photo shows black & white portrait of the three members of Icelandic band Sigur Rós Georg Holm joins Karen Leng to discuss the band's global orchestral tour.\n\nThere's a long history of rock bands teaming up with orchestras, from Deep Purple to Metallica and Kiss, but Holm explains Sigur Rós aimed for a subtle difference — being absorbed into the wider ensemble as opposed to just fronting it.\n\n\"Every night has been a collaboration,\" says Holm, and what began as an experiment, \"with a few shows\" in New York City with the Wordless Music Orchestra, has grown into a global trek featuring local orchestras in each city.\n\nIn Australia, Sigur Rós will be accompanied by the Adelaide Symphony Orchestra, Melbourne Symphony Orchestra, Royal Melbourne Philharmonic Orchestra, Brisbane Philharmonic Orchestra, and Sydney Symphony Orchestra for Vivid LIVE.\n\n\"We like the idea of working with local people everywhere we go because it gives the music something else … It's great to hear the nuances and different ways of how people express the music.\"\n\nTouring with the band is conductor Rob Ames. \"He is the glue. He puts everything together [and] it's a unique experience every night,\" Holm says.\n\n\"It is amazing how you have the music written down — it's on sheet music … and you would think it's like reading from a book. But it's like the book is in Latin.\n\n\"It's just like a universal language, no-one knows how to pronounce it, but the conductor is there to tell you how to pronounce it.\n\n\"Everyone will put something from themselves into it. It's fantastic!\"\n\nHaving played in the US, Europe, Japan, Taiwan and Singapore already, Holm has \"definitely noticed\" the unique subtleties of each place and performance.\n\n\"[There are] differences in culture, and you do see how people react differently to your music. But I have to say, the old cliché of music being a universal language [has] a certain amount of truth.\"\n\nLoading YouTube content\n\nMusic that succeeds where words fail\n\nIn concert, the band's celestial textures and stirring songs often provoke intense emotional reactions from audiences.\n\n\"Through the years, we've kind of gotten used to that, people fainting and crying\" Holm laughs. \"I think it's absolutely amazing that people get a physical reaction to music.\"\n\nThe phenomenon reminds Holm of an anecdote from his late friend, British producer Ken Thomas, who worked on Ágaetis Byrjun and it's 2002 follow-up, ( ).\n\n\"He pointed out to us that the amazing thing about music is that it's just moving air. It is nothing else. You can't see music, and it is basically just air hitting your eardrums in different frequencies.\n\n\"I always find that amazing standing on stage. It's a bunch of musicians, and all we're doing is just creating a frequency that's moving air out into the audience. And the people out in the audience are getting a physical reaction to that.\n\n\" I think that's absolutely beautiful every time I think of that. \"\n\nDespite the fact very few fans speak the Icelandic band's native tongue, it's never been a barrier to their success. In fact, frontman Jón Þór Birgisson — or simply, Jónsi, often sings in the fictional language of Hopelandic, and his extraterrestrial falsetto is a large part of the band's otherworldly appeal.\n\n\"The amazing thing about him is that he's just getting better. Obviously with age, voices change but it doesn't seem to happen to Jónsi. His voice just seems to be growing and getting better with the years.\"\n\nJónsi Birgisson co-founded Sigur Rós in 1994 with teenage friend Georg Holm. (Getty Images: Jeremychanphotography)\n\nReinventing the Sigur Rós experience\n\nThe catalyst for the current tour is the orchestral Átta (Icelandic for eight), the group's first album of original material since 2013's darker, louder Kveikur (translation: fuse/candlewick).\n\n\"It didn't really feel like a whole decade between records … I didn't realise it until someone pointed it out to me,\" remarks Holm.\n\nHow Sigur Rós' music expresses what language cannot Photo shows Jonsi of Sigur Ros bows a guitar and sings into a microphone on stage in front of a sheet of LED lights In the case of Icelandic's famous post-rock band, ignorance can make for musical bliss.\n\nThe band's parts were mostly recorded in Los Angeles before they linked up with the London Contemporary Orchestra at the legendary Abbey Road studios.\n\n\"We've worked at Abbey Road a few times before, and it's always such an honour to be in that studio,\" Holm says. \"The history there, the people that work there are fantastic, and obviously the equipment is just unique.\"\n\nSignificantly, Átta is also Sigur Rós’s first album since the return of multi-instrumentalist Kjartan Sveinsson (who departed before Kveikur's release). \"He was instrumental — excuse the pun — in getting this whole thing together,\" adds Holm.\n\nSveinsson — with the assistance of Ames and his wife Maria Huld Markan Sigfúsdóttir of Icelandic group (and frequent Sigur Rós collaborators) Amiina — wrote orchestral arrangements for the tour, including reworks of the band's older material.\n\nLoading YouTube content\n\n\"We thought it would be great to play some of the songs that we haven't played before, or that we have tried to play before, but we've never felt worked in a live environment,\" says Holm.\n\n\"Also, maybe some songs that would be interesting to sort of reinvent. It's a fantastic opportunity to have a whole big orchestra behind you. We looked at it as an opportunity to do something new, something fresh.\"\n\nThat includes 'Starálfur', a string-centric highlight from Ágaetis Byrjun, and the title track to 1997 debut album Von. The latter, reinvented version has delighted even Holm.\n\n\"We were playing in Taipei and a thought just popped into my mind when we were playing 'Von'. We haven't really played it in a long time [and] now we're playing it in a completely different way. So, what has surprised me is that [the songs] do have a life of their own. They do evolve.\"\n\nSigur Rós perform at the following dates:\n\nFriday, May 16 – AEC Theatre: Kaurna Land, Adelaide\n\nSaturday, May 17 – AEC Theatre: Kaurna Land, Adelaide (sold out)\n\nMonday, May 19 – Hamer Hall: Wurundjeri Woi Wurrung Land, Melbourne (sold out)\n\nTuesday, May 20 – Hamer Hall: Wurundjeri Woi Wurrung Land, Melbourne (sold out)\n\nWednesday, May 21 – Palais Theatre: Wurundjeri Woi Wurrung Land, Melbourne\n\nFriday, May 23 – Vivid LIVE at Sydney Opera House: Gadigal Land, Sydney\n\nSaturday, May 24 – Vivid LIVE at Sydney Opera House: Gadigal Land, Sydney\n\nSunday, May 25 – Vivid LIVE at Sydney Opera House: Gadigal Land, Sydney (sold out)\n\nTuesday, May 27 – QPAC Concert Hall: Turrbal Jagera Land, Brisbane (sold out)\n\nWednesday, May 28 – QPAC Concert Hall: Turrbal Jagera Land, Brisbane",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/wa-oyster-bank-expands-as-tassie-growers-battle-mystery-illness/105283906",
    "title": "Oyster growers fight to preserve their 'Goldilocks' harbour in WA",
    "publish_date": "Thu, 15 May 2025 22:40:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "On Western Australia's south coast, Oyster Harbour, a secluded estuary at the convergence of the King and the Kalgan rivers, is living up to its name.\n\nSixteen square kilometres of shallow, clear, pristine water, the estuary has long been prized by local oyster and mussel farmers around Albany, 420 kilometres south of Perth.\n\nNow, a convergence of scale and technology has transformed the quiet harbour into a major hub for Australia's aquaculture sector.\n\nThe estuary has long been prized by local oyster and mussel farmers for its nutrient-rich waters. (ABC Great Southern: Andrew Chounding)\n\nAndrew and Nicola Forrest's company Harvest Road bought into the area in 2020, adding shellfish to its portfolio of aqua and agricultural businesses in WA.\n\nThe most recent harvest marked the culmination of four years' work for the group, winning three gold medals at the 2024 Sydney Royal Show and launching commercial sales for the first time.\n\n'Goldilocks zone'\n\nVeteran oyster grower and Harvest Road's head of aquaculture Rob Michael reared the gold medal-winning molluscs.\n\n\"This is a bit of a Goldilocks zone here in the south-west corner of WA for rock oysters,\" he said.\n\n\" It's a perfect temperature profile, salinity is good, we're very lucky. \"\n\nRob Michael says Oyster Harbour is a \"Goldilocks zone\" for growing oysters. (ABC Great Southern: Andrew Chounding)\n\nMr Michael said the King and Kalgan rivers drove food for the oysters into the bay.\n\n\"We have huge algal blooms, that's the food for these oysters and they just power, especially through the summer months,\" he said.\n\nThe water may be pristine, but growing oysters is still hard, wet work. (ABC Great Southern: Andrew Chounding)\n\nAbout 500 hectares of the harbour are licensed for aquaculture use.\n\nNewer developments across the bay in Princess Royal Harbour and King George Sound are expected to add 310 hectares to Albany's aquaculture development zone.\n\nOnce completed, the region will produce about 1,500 tonnes of shellfish each year.\n\nAlbany's aquaculture development zone is expected to produce 1,500 tonnes of shellfish once complete. (ABC Great Southern: Andrew Chounding)\n\nHow are oysters grown?\n\nThe area's growth is due in part to the work being done on the other side of Frenchman's Bay at the Albany Shellfish Hatchery.\n\nThe state-of-the-art facility is a tightly controlled nursery and laboratory where baby oysters, or spat, are grown by manager John Bilton.\n\nJohn Bilton runs Albany's biosecure shellfish hatchery. (ABC Great Southern: Andrew Chounding)\n\n\"A spat supply is essential to starting up a farm, and it's the hardest thing, it's the riskiest thing, and it's also quite expensive,\" he said.\n\n\"It's a fair bit of chemistry, bucket chemistry.\n\n\"When we start off, we're dealing in hundreds of millions of eggs.\n\n\"We get down to the end stage, and we were delivering, and we're down to the tens of millions, that's a deliberate strategy … you've got to keep culling to make sure that you're taking the best off the batch.\"\n\nBaby oysters or spat grown at the hatchery resemble gravel in their juvenile state. (ABC Great Southern: Andrew Chounding)\n\nThe hatchery was opened in 2017 to produce spat for WA's shellfish industry, but rapid growth has sparked an equally rapid expansion of the facility to the tune of $3.6 million, doubling what Mr Bilton and his team produce.\n\n\"Orders have gone up, and because we're a biosecure hatchery and we've got this quarantine capability, we can look further afield,\" Mr Bilton said.\n\n\"We're also doing some pearl oysters for the pearl growers up at the Abrolhos [Islands], and we're talking to New South Wales now.\n\n\" I think it is a bit of an oyster bank. \"\n\nGrowers sink desalination plans\n\nWith the farm and hatchery opening up markets on the east coast, protecting the bay's pristine waters has become increasingly pivotal.\n\nLast year, plans to develop a water desalination plant next door to the hatchery drew the ire of shellfish producers and residents.\n\nThe harm it posed to the industry eventually saw WA Premier Roger Cook scrap the plan.\n\nPlans were scrapped for a desalination plant that would have pumped brine into the bay harbour. (ABC Great Southern: Sam Goerling)\n\nWith illnesses wreaking havoc on some eastern states' producers, Mr Bilton said it should have never been considered.\n\n\"What we need as an industry is a pristine environment or a protected environment,\" he said.\n\n\" What we're very concerned about is things that might degrade the natural environment. \"\n\nMystery illness hurts Tasmanian industry\n\nThat degradation is being felt by other, more established growers on Australia's east coast.\n\nIn 2022 a seasonally occurring QX disease outbreak devastated growers around Port Stephens in NSW.\n\nWhile in Tasmania's south, a mystery illness at Pipe Clay Lagoon has seen oyster production plummet.\n\nOysters Tasmania vice-chairman Josh Poke said the cause of mass deaths was unknown.\n\nJosh Poke says millions of oysters have been lost to the mystery illness. (ABC Hobart: Kate Nickels)\n\n\"There are five growers in the bay at this point, and none of us have had success consistently over summer with growing and conditioning oysters,\" he said.\n\nMr Poke said while some producers had farms in other parts of the state, those who only farmed in the lagoon were struggling to hold on.\n\nMr Poke says oysters grown at Pipe Clay Lagoon are struggling to mature during peak conditioning periods. (ABC Hobart: Kate Nickels)\n\n\"I really feel for them because this is their sole source of income and they're having to dip into retirement savings to just try to tick along,\" he said.\n\n\" It's getting to a point where even if we find out what's wrong, we mightn't be able to come back from it. \"\n\nMr Poke says some growers at Pipe Clay are considering selling up and moving out. (ABC Hobart: Kate Nickels)\n\n'Canaries in the coal mine'\n\nThe state government commissioned an independent study led by University of Tasmania research fellow Andrew Trotter to investigate the deaths.\n\n\"We're conducting this project to really investigate why we've seen that decline in oyster farming productivity over the last three or four years,\" Dr Trotter said.\n\nAndrew Trotter is looking into the mass oyster deaths at Pipe Clay Lagoon. (ABC Hobart: Kate Nickels)\n\nWhile the 12-month study is short by industry standards, he said the scale of the losses dictated the urgency.\n\n\"Farmers, what they want to know is they can expect to be able to farm there in the next year or five years,\" Dr Trotter said.\n\n\"Or is it game over?'\n\n\"Hopefully we can provide concrete answers.\"\n\nThe project is comparing oysters grown at different sites in and around Pipe Clay Lagoon. (ABC Hobart: Kate Nickels)\n\nIt's a cautionary tale for those on the other side of the country, such as John Bilton, who hopes to avoid a similar outcome.\n\n\" We put an economic value on clean water … we're the canaries in the coal mine, we really are. \"\n\nWatch ABC TV's Landline at 12:30pm on Sunday or on ABC iview.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-16/grattan-on-riday-david-littleproud-sussan-ley-nuclear/105297770",
    "title": "The Coalition must figure out its answer to the net zero question",
    "publish_date": "Thu, 15 May 2025 22:37:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "With the future of the Coalition relationship on the line, Nationals leader David Littleproud drove to his Liberal counterpart Sussan Ley's hometown of Albury this week. They had much to talk about, and it wasn't going to be easy.\n\nLittleproud and Ley have had a combustible relationship in the past.\n\nAfter Ley, on the backbench at the time, in 2018 co-sponsored a private member's bill to restrict live sheep exports, Littleproud, the agriculture minister, said dismissively: \"I'm going to predicate my decisions on evidence, not emotion.\"\n\nMore seriously, when she was environment minister in 2019–22, Ley and Littleproud clashed over the Murray-Darling Basin.\n\nThe Nationals leader is father of, and a true believer in, the opposition's nuclear policy; Ley began as an agnostic on the issue, saying in 2019: \"To be honest, I am not strongly for or against nuclear power.\"\n\nThe two leaders differ in their economic philosophies. Littleproud is what detractors of the Nationals and their predecessor the Country Party used to call an \"agrarian socialist\". It was the Nationals who, in the last term, drove the Coalition policy to break up supermarkets that misused their power. Ley is less inclined to industry intervention.\n\nLoading\n\nLey and Littleproud have to find a way for their two parties to continue to share the same house and, assuming they do, how they divide up the rooms, and manage their joint spaces.\n\nKevin Hogan, the new Nationals deputy, said late on Thursday there was a will to sign a Coalition agreement, but certainly there was \"a scenario where it doesn't get signed\".\n\nThe Nationals are feeling their power after an election in which they held almost all their seats and the Liberals were devastated.\n\nTheir Senate leader, Bridget McKenzie, who is outspoken and frequently in the media, said this week: \"We haven't had this amount of political clout within the Coalition since the 70s.\"\n\nHow many shadow ministries the Nationals receive is determined on a formula, but central is what posts they obtain.\n\nSign up for Weekend Reads in your inbox Photo shows Virginia Trioli in a stylish suit on a set with lighting behind her Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\n\"There needs to be a very serious conversation heading into any Coalition discussions about the role of the National Party,\" she said.\n\n\"We don't need to rush into an agreement, but we do need to make sure it reflects the realities of the election result, which does give greater kudos and say to the National Party within that.\"\n\nIn a cheeky reference that wouldn't go down well with some Liberals, McKenzie said: \"In our 120-year history, for 16 of these years, we held the treasury portfolio in government.\"\n\nThe Nationals are not going to hold the Treasury post in opposition. But they will try to have a louder economic voice. (There is speculation they might seek the finance shadow ministry.)\n\nMcKenzie referred to the power of party greats Doug Anthony, Ian Sinclair and Peter Nixon in Malcolm Fraser's government. She could have gone back to the legendary John \"Black Jack\" McEwen in earlier years.\n\nDavid Littleproud, flanked by Kevin Hogan and Bridget McKenzie. (ABC News: Matt Roberts)\n\nBack then, the party exercised power through the sheer strength of such individual personalities, and their ability to prevail in battles with colleagues. Looking at the Fraser years, it's remarkable to think the prime minister used Nixon (who died just before the election, aged 97) in trying to manage a difficult and ambitious senior Liberal, Andrew Peacock, who aspired to the leadership.\n\nThe modern Nationals have no such personalities. In recent years the party has also been riven by division over leadership and policy. Littleproud saw off a leadership challenge from Matt Canavan this week.\n\nCanavan lost the ballot but his call for the party to walk away from the target of reducing emissions to net zero by 2050 has yet to be resolved.\n\nAll opposition policies are on the table, with Ley and her deputy Ted O'Brien saying they won't rush the reconsideration of them.\n\nBut this shapes as a complicated process, littered with obstacles.\n\nWhat if the Liberal Party and the Nationals came to different conclusions on whether to retain the 2050 commitment? It could be touch and go whether the Nationals ditch it. The Liberals would be courting disaster to do so: that would divide the party and further alienate voters in the teal-type areas that they need to win back.\n\nABC Politics in your inbox Photo shows Brett Worthington looks at the camera wearing a blue blazer and glasses Sign up to the ABC Politics newsletter with Brett Worthington\n\nIf the two parties found themselves at odds on net zero, could they viably stay together in coalition?\n\nThe review of the nuclear policy is interlinked with the net zero commitment — nuclear was advanced as a way of getting to the target — and is also fraught. There will be pressure from some Liberals to just junk it. But Littleproud and others within his party would fight hard for it.\n\nThe issue of timing is also critical. The opposition doesn't have the luxury — that it appears to think it has — of going too slowly on the net zero issue.\n\nEnergy and climate policy will be central issues over coming months.\n\nThe government delayed until beyond the election considering what 2035 emissions reduction target it will submit under the Paris Climate Agreement. The Climate Change Authority, which must make a recommendation to the government on the target, helpfully said it had more work to do.\n\nBut the target must be submitted by September. The government is expected to receive the recommendation from the authority around July. The authority has been consulting on a 65 per cent to 75 per cent reduction. It could recommend a single figure, or (perhaps more likely) a range.\n\nAnywhere between 65 per cent and 75 per cent would be ambitious in practical terms. The 2035 debate will take the argument away from primarily electricity into the areas of industry, transport and agriculture.\n\nIf the opposition is to be credible in whatever criticisms it wants to make, it will need to have at least a settled position on the net zero question.\n\nIn jumping ship, Jacinta Nampijinpa Price has found herself adrift. (ABC News: Ian Cutmore)\n\nMoreover, in trying to rebuild electoral support, the Liberals in particular require an early confirmed stance on net zero. Climate is a specially important issue with young voters, among whom the party's support is woeful.\n\nMeanwhile, as all the machinations play out, Jacinta Nampijinpa Price must be giving a thought to what might have been, had she not defected from the Nationals to the Liberals in a misjudged bid to become Liberal deputy.\n\nShe may regard the Liberals as her natural home, as she says, but if she'd stayed she might have become Nationals deputy leader this week (previous deputy Perin Davey lost her seat). That would have had her well placed to pursue her portfolio ambitions, backed by Littleproud. But who will be her champion now?\n\nIn jumping ship, Price has found herself adrift, for the moment at least.\n\nMichelle Grattan is a professorial fellow at the University of Canberra and chief political correspondent at The Conversation, where this article first appeared.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-motorists-more-likely-to-speed-in-school-zones-20250515-p5lzh1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Motorists more likely to speed in school zones | West End venue to close its doors for good | Gable Tostee appeals casino ban",
    "publish_date": "Fri, 16 May 2025 12:02:31 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "West End bar and live music venue The Bearded Lady will shut down permanently next Friday.\n\nIn a post on social media yesterday, the venue said it had hoped to find a solution that would allow it to stay open, but learned this week it was not to be.\n\n“We’ve done everything in our power to keep the doors open, but unfortunately, negotiations with the landlord fell through yesterday,” the post reads.\n\n“Key members of our local music community were ready and willing to take on the lease, but at the last minute, the landlords informed us they no longer wish to be involved with hospitality.”\n\nThe Bearded Lady will close its doors on Friday, May 23. Credit: Facebook\n\nBeloved by musicians in the local scene, the spot on Boundary Street was struggling financially, and earlier this year set up an online appeal that reached only $27,000 of its $200,000 goal.\n\nNews of its closure was met with an outpouring of sentiment, with local councillor Trina Massey paying tribute to “a vital, beating heart of the West End music and arts scene. A space for creativity, resistance, and pure magic.”",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/environment/conservation/waternsw-admits-pfas-contamination-could-date-from-1992-20250516-p5lzpx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WaterNSW admits PFAS contamination could date from 1992",
    "publish_date": "Fri, 16 May 2025 12:00:03 +1000",
    "category": "finance",
    "authors": [
      "Caitlin Fitzsimmons"
    ],
    "text": "WaterNSW has confirmed the cancer-causing “forever chemicals” found in Blue Mountains reservoirs are from aqueous fire fighting foam – a product that was phased out in 2007, which suggests the contamination has been in drinking water for at least 17 years.\n\nThe report prepared for WaterNSW by engineering firm Jacobs Group confirmed that the contamination could be as early as 1992 when a petrol tanker crashed on the Great Western Highway near Medlow Bath, as previously reported by this masthead.\n\nSTOP PFAS convener Jon Dee in Leura. Credit: Sitthixay Ditthavong\n\nThe also suggests a 2002 vehicle crash and the Medlow Bath Rural Fire Brigade Station as potential sources of the contamination.\n\nWaterNSW confirmed Medlow Dam and Greaves Creek Dam, which were taken offline last year, would remain disconnected from the water supply.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/from-campervan-to-cusp-of-wallaby-history-the-third-coming-of-james-o-connor-20250514-p5lz41.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "From campervan to cusp of Wallaby history: The third coming of James O’Connor",
    "publish_date": "Fri, 16 May 2025 12:00:00 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The journey towards a rare second crack at the British and Irish Lions began for James O’Connor with serendipity and a campervan. It was late 2024 and O’Connor was weighing up his next move in rugby. With Queensland backing its rookie class of Tom Lynagh and Harry McLaughlin-Phillips, the Wallabies veteran had departed Ballymore and had half-a-eye on a move into coaching. But, at only 34, O’Connor wasn’t quite ready to hang up the boots. “I was moving well and I felt like I had some good footy left in me,” O’Connor said. There were options in France, Japan and the USA, but the one that intrigued O’Connor the most was a faint nibble earlier in the year from the mighty Crusaders. The 14-time Super Rugby champions - who won the title in 2023 - had just had an uncharacteristically awful season and missed the finals, and were scouting around for a greybeard to replace the experience of departed All Blacks star Richie Mo’unga. O’Connor was on post-season holidays when he got a call, and was asked if he could get to Christchurch to sit down with Crusaders coach Rob Penney. No worries, O’Connor replied. See you shortly.\n\nAdvertisement\n\n“I happened to be on a road trip in New Zealand in an RV with my wife,” O’Connor said. “And I was probably about an hour away at that stage, just over at Akaroa (east of Christchurch). “So I drove over, literally pulled the RV up and met up with Rob, and it went really well. Then we all went out to dinner afterwards, and pretty much shook hands after that. “It seemed a no-brainer to me. Go to the Crusaders for a year - I get to experience New Zealand Super Rugby, but also the most successful franchise in Super history. “Go there and see what’s made them so successful: how do they keep churning out such good players? How are they playing so well as a team? What is the culture? “Not only just for me rugby-wise, but also with that coaching element as well.” News of O’Connor joining the Crusaders on a one-year deal was met mostly with curiosity on both sides of the Tasman, and the usual smattering of narky Kiwi talkback callers as well. James O’Connor? But few predicted what would happen next.\n\nAdvertisement\n\nJames O’Connor has been impressive off the bench for the Crusaders. Credit: Getty Images The Crusaders have swiftly returned to full power output in 2025, and while that didn’t require the power of Nostradamus to foresee, the role of O’Connor in the revival certainly proved the surprising storyline. Playing off the bench, O’Connor has become an artful practitioner of the finisher role in the last quarter of games; steering the Crusaders home with the considered option-taking honed in 64 Tests for the Wallabies, two World Cups, a Lions series and 18 years as a professional. He nailed a post-siren goal in the rain to beat arch-rivals the Blues, and is now beloved by the Crusaders faithful. People began asking if he was All Blacks-eligible, and a video of a fan paying for his order at a McDonald’s drive through went viral. O’Connor has been so effective for the Crusaders he has played himself firmly back into contention for a Wallabies squad recall, ahead of the Lions tour in June and July. He last played for Australia in 2022. Knowing what it takes to succeed at the Crusaders, and to earn the praise of the Kiwi rugby cognoscenti as well, Joe Schmidt has spoken with O’Connor and last week admitted he was in the mix for selection.\n\nAdvertisement\n\nIf picked, it would be O’Connor’s second Test series against the Lions, after he played no.10 for the Wallabies in all three Tests of the 2013 series. Double-Lions is a highly exclusive club, with currently only one member behind the rope: George Smith is still the only Wallaby to play against the Lions twice, a dozen years apart. James Slipper is also likely to join in 2025. “I’m not gonna lie, part of me going to the Crusaders was wanting to play at that level again,” O’Connor said. “I even had this chat with Les (Kiss) when I left, he was , ‘look if you actually want to have a crack of the Lions or playing with the Wallabies again, you’ve got to be playing top-level rugby’. “So that was part of the decision to come to the Crusaders. Not that I was holding my breath, but I always felt I would love to have one more crack (for the Wallabies), and get a little do-over and play the rugby I know I can play for the group. I always felt I would love to have one more crack (for the Wallabies), and get a little do-over. James O’Connor\n\nAdvertisement\n\n“I had a good chat with Joe, it’s still early days. He just said ‘I feel you’ve taken a lot of good options and you are playing some good footy’. It was more just gauging my interest and I was like ‘yeah I’d love to be involved’.” O’Connor will be in Sydney on Friday night with the Crusaders. Impressing Schmidt isn’t high on the to-do list for O’Connor, but only because selflessness has proven to be the major reason the Wallabies coach is even watching. When talking with Penney and Crusaders coaches early on, O’Connor was told they had a specific job in mind: the closer. “They were like ‘this is where we’re losing games and this is an area we’d love you to own’,” O’Connor said. “At the start, it wasn’t “hell yeah I want to be a finisher”. I was more I’d love to play in the ten spot. But again, the more I soaked up the environment and made it not about me, it was just what can I do for the team? “It sounds very simple but I don’t think I’ve really ever had that mindset, fully. “I have butchered it in the past off the bench, trying to do too much, overplaying.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/afl/robert-walls-didn-t-do-hot-takes-he-pioneered-footy-s-hard-take-20250515-p5lzlb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Robert Walls didn’t do hot takes. He pioneered footy’s hard take",
    "publish_date": "Fri, 16 May 2025 11:58:19 +1000",
    "category": "sports",
    "authors": [
      "Jake Niall"
    ],
    "text": "As a callow young journalist at the now defunct Herald, I recall our editors, who had Carlton affinities, bringing Wallsy in to write some columns in the 1990 season, the year after his brutal culling by the ruthless Blues. He wrote one about Collingwood, detouring into his experience of the Victoria Park cauldron, which he labelled the “most biased” and hostile crowd in the game. “Thank god for police protection,” he added pointedly. Loading In the 1990s, when Walls was finished up as coach of the Brisbane Bears, he wrote some preview-style pieces for The Age, whose then sports editor was impressed by Walls’ clarity of thought in concise, short sentences. “Footy doesn’t have a (Peter) Roebuck,” then sports editor Patrick Smithers told Walls, referencing Australian cricket’s most authoritive (ex-player) voice. “You’re good at this.” And so was launched a media career that was as innovative as his invention of “the huddle” and other set plays he pioneered as coach at Fitzroy and Carlton. Radio - mainly 3AW – and television gigs inevitably followed.\n\nThe columns would arrive by fax machine, carefully hand-written with a school teacher’s touch. Wallsy was never “ghosted” by an editor or journo, as per less literate footballers. An ex-champion who played under Wallsy – and loved him, as so many players and colleagues did – jestingly said on the day of his passing that some of his coaching methods would run into Occupational Health and Saety strife in these more regulated times (the same is true of other coaches). Consider how his disciplining of Bears player Shane Strempel – put in to the ring and pummeled by teammates – would be received in today’s environment. The same might be said of some of his hard takes. Wallsy essentially wrote that the West Coast 2006 premiership was tainted. He wrote of Tony Liberatore, who had felled Matthew Knights (whom Wallsy had coached), that if Libba had indeed split Knights’ head open, “then he has become a pathetic figure on the football field.” He scored a player zero out of 10 for a grand final performance.\n\nIn the televisual ring, his most celebrated confrontation was with Kevin Sheedy, which followed a spat on 3AW. Sheedy, who could mix jest and irreverence with an old back pocket’s spite, had quipped “not all the snipers were in Vietnam” in the ’70s, in a snipe at Walls. Sheedy accused Walls of “hiding” in Brisbane after his stint at Carlton. “See you on Monday,” Walls fired back. The volcanic radio exchange was followed the next Monday by Sheedy’s appearance on Seven’s Talking Footy, where Walls was a panelist alongside host Bruce McAvaney and this paper’s pioneering chief football writer Caroline Wilson. Robert Walls on air for Channel Ten with Stephen Quartermain. Credit: Getty Images David Barham, then the producer of Talking Footy and who became of Wallsy’s closest mates (and hired him to call at Ten), instructed McAvaney to do the introduction and let the current and ex-coaches let fly – as they did. Walls counter-punched – hard – by noting that Sheedy had been driving a Rolls-Royce at Essendon and didn’t know what it was like to get money from his own bank account to pay a player at a broke club, and so forth. The pair ended the program on more convivial terms, like a pair of boxers who had just finished the bout.\n\nIt was riveting television. Walls, as several media people have noted, played the media game as he had coached – hard but fair. His calls landed and even if they upset individuals and clubs, Wallsy had the commentator’s most crucial commodity – authority. If there is no exact analogue to Wallsy in today’s voluminous footy media, I would venture that his columns were the game’s answer to Nikki Savva’s now, in that they came from someone who had been inside the tent (Savva having worked for Peter Costello and John Howard), and who brought that insiders’ vantage and intimate knowledge, but opined without fear or favour. He also had a knack for reading the play in live broadcasts. Quartermain recalls how, in the 2004 game famed for James Hird hugging a spectator following the match-winning goal at Docklands (after Hird had a stunning last quarter), Wallsy had implored West Coast to surround and smother Hird if they wanted to hang on.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/politics/federal/australian-federal-election-2025-live-results-victoria-key-swing-seats-news-updates-start-time-liberal-labor-independent-teal-kooyong-goldstein-wills-bruce-zoe-daniel-tim-wilson-peter-khalil-samantha-ratnam-julian-hill-zahid-safi-monique-ryan-amelia-hamer-20250502-p5lw46.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victoria hot seats LIVE results: Tim Wilson’s lead in Goldstein narrows further; Kooyong gave us a full-blown political melodrama; the Victorian seats yet to be called",
    "publish_date": "Fri, 16 May 2025 11:58:16 +1000",
    "category": "finance",
    "authors": [
      "Rachael Dexter",
      "Charlotte Grieve",
      "Clay Lucas",
      "Cara Waters"
    ],
    "text": "Asked to reflect on the past six weeks covering Kooyong, my first instinct is to say: I feel like Amelia Hamer looks in that now-infamous photo with Peter Dutton (taken by this masthead’s James Brickwood) — exhausted, bewildered and slightly awed.\n\nThe battle between Monique Ryan — the 58-year-old former paediatric neurologist who unseated then-treasurer Josh Frydenberg in 2022 — and Amelia Hamer, the 31-year-old Oxford-educated grand-niece of former Victorian premier Sir Rupert Hamer, always promised intrigue.\n\nBut I didn’t expect this well-heeled patch of Melbourne’s east to deliver quite this much commotion – right up until Monday, when Hamer conceded and Ryan claimed victory for a second time.\n\nThe now infamous photo of Amelia Hamer (left) with Senator Jane Hume and then opposition leader Peter Dutton in Kooyong. Credit: James Brickwood\n\nEven before the campaign officially began, Kooyong was making headlines.\n\nRyan’s husband, Peter Jordan, was filmed taking a Hamer campaign sign from a nature strip in Camberwell. The footage was undeniably funny — and deeply embarrassing for Ryan, whose political brand is built on integrity.\n\nRyan and Jordan apologised quickly. Defenders noted the sign was technically illegally placed, but the image of “Pinching Pete” as the Liberals dubbed him – teal T-shirt peeking out from under his jacket as he scampered down the street – became meme fuel. One local pub even began selling stubby holders emblazoned with: “Monique, please DO NOT take this beer!”\n\nThe Liberals ran with the joke for the rest of the campaign.\n\nBut it wasn’t long before Hamer hit turbulence of her own. In the second week of the campaign I revealed she owned two investment properties – one in London and another in Canberra’s wealthiest suburb – despite publicly positioning herself as a renter who really understood the housing crisis.\n\nIt was a sloppy and obvious omission. Ryan’s social media whiz-kids, as well as satirical news sites, quickly generated memes about the generationally wealthy candidate cosplaying as a struggling renter.\n\nHamer never really directly addressed whether she had purposefully omitted her landlord status, instead trying to sidestep questions on it. “You can be renting and also own a property,” she said, citing conversations with locals about “the struggles of being a landlord” in Victoria dealing with land tax from the Allan government.\n\nThe Liberals hit back after Monique Ryan’s husband Peter Jordan was filmed removing one of Amelia Hamer’s campaign signs.\n\nMore of Hamer’s personal wealth was raked over after a Ryan campaign volunteer republished public court documents showing she was among the beneficiaries of a $20 million family trust — proof that dirt units come in all shapes and sizes.\n\nSoon after, the predictable graffiti on corflutes turned nastier: “Capitalists will die”, “I get off on poor suffering”, and “Communism will win” were spray-painted across Hamer’s face.\n\nAt times, it felt like Hamer was under strict orders from Liberal party HQ to keep a low profile.\n\nShe skipped out on at least three community candidate forums. She often did media appearances flanked by her old boss, Senator Jane Hume, who stepped in to answer curlier questions, which reinforced a perception that she couldn’t speak for herself.\n\nBut when I finally managed to interview her on camera, Hamer held her own. She was confident and articulate. The leash should’ve been loosened far earlier. Even forums perceived as hostile would have been worth her fronting up to make her party’s case.\n\nRyan also had media stumbles. On ABC’s Insiders, she flubbed a question about disclosing influencer payments, later clarifying she misunderstood. She also blanked a Sky News reporter trying to spring a live interview at pre-polling.\n\nAmelia Hamer and Monique Ryan at a Jewish community forum during the campaign. Credit: Justin McManus\n\nEach side tried to paint the other’s campaign as being full of grey-haired volunteers. However, while retirees abounded, both camps had plenty of younger supporters — including millennial campaign managers. That’s a good sign for democracy, especially for the Liberals after their worst ever national defeat.\n\nThe campaign did veer into childishness at times. Ryan took aim at the Liberal Party over a satirical social media post that depicted her as a scowling action figure in Barbie-style packaging, under the label: “MONIQUE RYAN – VOTES WITH THE GREENS 77% OF THE TIME.”\n\nBut most of the negative campaigning seemed to come from Liberal HQ — and there was a noticeable disconnect between that and Hamer’s own conduct. I never once heard Hamer reference Ryan’s voting record or go below the belt in public. Her pitch was more about neglected local issues and the disadvantages of not having a major party MP. She appeared uncomfortable with the signage wars being waged in her name — a conflict that escalated all the way to the Supreme Court in the final days of the campaign.\n\nLoading\n\nA funding vehicle behind the teal independents — Climate 200 — also created headaches, including for Ryan in Kooyong. I revealed that residents had received calls and texts as part of a “push-polling” effort conducted on behalf of the group, just moments after Ryan had appeared on live TV describing push-polling as “not ideal”.\n\nIt’s unclear how effective the Liberal Party’s central line of attack on Ryan — that she voted with the Greens in Parliament 77 per cent of the time — really was. Rusted-on Liberal supporters lapped it up, but for those who had already backed Ryan, it was hardly a shock. After all, “teal” was always supposed to be a blend of blue and green.\n\nStill, the claim clearly got under Ryan’s skin. She labelled the line as misinformation and hit back with a five-page pamphlet of her own, accusing the Liberals of spreading “egregious falsehoods”.\n\nShe pointed out she’d voted in favour of just 21 of 37 Greens motions — 56 per cent — slicing the same data in a different way.\n\nThe famous anti-Monique Ryan sign outside the Tower Hotel. Credit: Rachael Dexter\n\nWhile Ryan focused on her role pressuring the government on big-ticket items — the 20 per cent cut to HECS debts, advocating for 60-day medicine prescriptions, and improving the National Anti-Corruption Commission — Hamer went hard on hyper-local promises. All up, she pledged $14 million worth.\n\nThe Easter long weekend was the catalyst for a truly chaotic week on the trail in Kooyong. It kicked off when footage surfaced of a local surgeon — Professor Greg Malham — inexplicably filming himself tearing down and stomping on Monique Ryan corflutes, all while cracking jokes about disposing of a dead body and leaving his full number plate in view.\n\nThe video was widely condemned — not just by Ryan and Hamer, but also by domestic violence campaigners. Malham later self-reported to the medical regulator and was placed under investigation.\n\nThen came a candidates’ forum on refugee and asylum seeker policy, where an anti-lockdown activist attempted to hijack the discussion by ambushing Ryan with questions about her husband’s now-infamous sign theft. He filmed her reaction for social media, but was swiftly shut down by the event organiser, who was not having a bar of it.\n\nBut the week reached full chaos mode the following evening at what was meant to be a quiet event about public broadcasting at the Kew Library. Three protesters — whom Ryan later described as “right-wing nutbags” — gatecrashed the forum. I was the only journalist in the room to witness the bizarre scene unfold.\n\nTensions escalated when a female attendee, who was clearly distressed, tried to punch one of the agitators in the face.\n\nRyan herself waded in to break up the scuffle, physically intervening to stop things from boiling over before police arrived.\n\nThat chaotic week ended with a long-anticipated moment: Ryan and Hamer finally appeared on stage together for the first time in the campaign — at a Jewish community event under the watchful eye of Australian Federal Police. It was icy but civil.\n\nIn the final week of the campaign, fresh controversies emerged. The Age broke a story revealing that volunteers wearing Monique Ryan T-shirts had been filmed claiming a community organisation — one with historical links to the Chinese Communist Party’s foreign influence operations — had encouraged people to vote for the teal MP.\n\nAt the same time, our reporting revealed that Kooyong — along with other targeted electorates — had been flooded with campaign helpers from the Exclusive Brethren, a secretive Christian sect. These volunteers helped hand out how-to-vote cards and staff pre-poll booths, despite objecting to voting themselves.\n\nShadowy, right-wing third-party groups – Australians for Prosperity, Repeal the Teal, and Better Australia – flocked to pre-polling booths but mainly disappeared on election day itself. Their presence so rattled Ryan she launched a last-ditch fundraising campaign, trying to raise $20,000 for last-minute advertising to “cut through the noise, reach undecided voters, and tell them the truth”.\n\nThen came the signage furore outside a Kew pre-polling booth: a spat between Boroondara council and the Liberal Party that went on for days, complete with accusations of political interference, given the council’s number of teal councillors. It came to a head when council officers swooped in to confiscate 14 Liberal A-frame signs, which they crammed into the back of the Boroondara-branded hatchback.\n\nCouncil officers confiscated 14 signs at the Kew pre-poll voting booth. Credit: Rachael Dexter\n\nForty-eight hours out from election day, I found myself reporting from the Supreme Court, where eight lawyers — who were likely billing by the hour — argued over constitutional issues that would only apply for a single day. The Supreme Court ultimately sided with the Liberals, granting an injunction in their favour. The Liberals promptly celebrated their ideological win over the council, a fleeting victory.\n\nNeo-Nazis also made an unwelcome appearance when Joel Davis, from the National Socialist Network, showed up wearing a T-shirt mimicking Liberal Party branding while distributing fake and antisemitic pamphlets to voters – horrifying everyone. Davis was accompanied by men in costume beards and fake Orthodox Jewish attire, brandishing pamphlets that had been sent to Jewish communities in neighbouring electorates claiming the Liberals planned to “give the Jews everything they want”.\n\nHamer wasn’t short of Liberal Party elder help on the campaign trail, receiving support from Liberals of all stripes, including former premier Jeff Kennett, who made a grand appearance at her election night party. Her predecessor, Josh Frydenberg, was also spotted in the dying days of the campaign, handing out pamphlets at pre-polling.\n\nAnd then there was Opposition Leader Peter Dutton’s fleeting appearance at the Tower Hotel in Hawthorn East — a venue that became notorious for its vocal anti-Monique Ryan campaigning, complete with a massive anti-Ryan sign mounted on the pub (for which it would later be fined by the council).\n\nOpposition Leader Peter Dutton with Amelia Hamer at the Tower Hotel in the final days of the campaign. Credit: James Brickwood\n\nThis marked Dutton’s second visit to Kooyong, and it was fleeting. In a rather telling moment, the man who had hoped to become prime minister was prevented from answering any questions by the media by his staff. It was a brief yet revealing moment into the national campaign strategy.\n\nAs in 2022, so much of the Liberal Party’s story is entwined with the story of Kooyong. The machinations of this electorate are emblematic of the existential wrestle the party faces — and what it stands for in a modern Australia.\n\nIt felt eerie that Petro Georgiou, a former member for Kooyong under John Howard and known to many as the “conscience of the Liberal Party”, died during the campaign. As our special writer Tony Wright penned at the time, “Georgiou was a voice for diversity and considered a champion of Indigenous Australians, underdogs and outsiders”.\n\nIt was Ryan who reminded a local forum that Georgiou’s values now feel worlds apart from the politics of today — in both major parties.\n\n“Our politics has become meaner and smaller in the last two or three decades,” she said. “He was a man who demonstrated great personal integrity in the way that he fought for the rights of refugees.”\n\nHamer was adored by Liberal voters: I saw this first-hand at pre-polling. Whether it was the “Dutton factor” that ultimately held her back is up for debate. But the fact she came so close suggests green shoots for the party, if it can harness the kind of youth and energy Hamer brought to the campaign.\n\nJosh Frydenberg and Amelia Hamer with a pre-poll voter in Malvern. Credit: Rachael Dexter\n\nEven Hamer, though, admits you can’t fatten a pig on market day — “We talked a lot about getting Australia back on track, but the question is: back on track to what?” she said on 3AW last week, talking about her party’s slim policy offering.\n\nThere was fun and plenty of smiles to be had in the ’Yong — I want to give a shout-out to the campaign volunteers from all parties who let me spend time with them on the front line, complete with smiles, snacks and campaign intel. Greens candidate Jackie Carter and Labor’s Clive Crosby conducted themselves with humour and grace as enthusiastic participants in the whole spectacle despite it being a two-horse race.\n\nAfter a false start and an early crow from the media and Ryan herself, Ryan did claim Kooyong for a second term. Not by as much as in 2022, but she got there with what looks like at least 1000 votes – and looks to be the sole teal independent in Victoria.\n\nMonique Ryan claimed the seat of Kooyong on Monday afternoon. Credit: Eddie Jim\n\nHer victory reaffirms Kooyong’s transformation from a blue-ribbon certainty to a teal-tinged battleground, where even a redistribution, a $14 million funding blitz and a strong candidate couldn’t wrest the seat back for the Liberals this time. One imagines the fight will only be tougher again in three years.\n\nThe experience of covering Kooyong felt like being strapped into a speeding, swerving golf buggy — on a ride where the stakes were local and national, trivial and existential, hilarious and deeply serious, often all at once.\n\nKooyong didn’t just give us a contest. It gave us a full-blown political melodrama. And I, for one, need a nap.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-coalition-division-pm-heads-to-rome-roberts-smith-back-in-court-20250516-p5lzoh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Coalition division; PM heads to Rome; Roberts-Smith loses appeal",
    "publish_date": "Fri, 16 May 2025 11:52:27 +1000",
    "category": "finance",
    "authors": [
      "Ben Cubby"
    ],
    "text": "The federal government has asked the Fair Work Commission to deliver an “economically sustainable” mandated wage increase to low-income workers.\n\n“This will help around three million workers across the country, including cleaners, retail workers and early childhood educators,” Treasurer Jim Chalmers and Employment Minister Amanda Rishworth said in a press release.\n\nLoading\n\nIn a submission to the commission, the government sought an above-inflation pay increase for minimum wage workers. The minimum wage is currently $24.10 per hour.\n\nThe minimum wage has increased by $143 a week since the government came to office, and the median wage has increased by $206 per week, the government said in its release.\n\nThe Fair Work Commission is due to make a decision on wages next month.\n\n“This position is both economically responsible and fair,” the press release said. “It will ensure low paid workers can get ahead as inflation moderates and real wages continue to grow across the economy.”",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/world/north-america/baby-kj-was-born-with-a-rare-deadly-disease-a-one-of-a-kind-gene-tweak-healed-him-20250516-p5lzoe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Baby KJ was born with a rare, deadly disease. A one-of-a-kind gene tweak healed him",
    "publish_date": "Fri, 16 May 2025 11:51:15 +1000",
    "category": "lifestyle",
    "authors": [
      "Laura Ungar"
    ],
    "text": "A baby born with a rare and dangerous genetic disease is growing and thriving after getting an experimental gene-editing treatment made just for him.\n\nResearchers described the case in a new study, saying he’s among the first to be successfully treated with a custom therapy that seeks to fix a tiny but critical error in his genetic code that kills half of affected infants.\n\nKJ Muldoon after a follow-up dose of an experimental gene editing treatment at the Children’s Hospital of Philadelphia last month. Credit: AP\n\nThough it may be a while before similar personalised treatments are available for others, doctors hope the technology can someday help the millions left behind – even as genetic medicine has advanced – because their conditions are so rare.\n\n“This is the first step towards the use of gene-editing therapies to treat a wide variety of rare genetic disorders for which there are currently no definitive medical treatments,” said Dr Kiran Musunuru, a University of Pennsylvania gene-editing expert who co-authored the study published in the New England Journal of Medicine.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/daley-dilemmas-our-experts-select-their-nsw-teams-for-origin-20250515-p5lzdl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Daley dilemmas: Our experts select their NSW teams for Origin",
    "publish_date": "Fri, 16 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "Considered too loyal to players who didn’t repay the faith, Daley will officially name his side for the opening game against Queensland on Monday.\n\nOne of the criticisms of Laurie Daley during his first stint as NSW coach were his selections.\n\nSuch is the fullback talent available in the NRL at the moment, that several star No.1s are likely to be picked for the Blues out of position.\n\nThe main debate surrounds who will wear the No.1 jersey. Dylan Edwards is the incumbent and, despite the Panthers having a slow start to their title defence, has done little wrong this year.\n\nTedesco, meanwhile, is playing as well as ever. The Roosters captain is averaging 203 running metres per game (189 metres for Edwards) and currently sits equal third in the Dally M medal standings.\n\nTom Trbojevic, Latrell Mitchell and Ryan Papenhuyzen are other custodians pushing for NSW selection in other spots, but the shoot-out for the No.1 jersey is between Tedesco and Edwards.\n\nIt was a huge call from previous Blues coach Michael Maguire to drop Tedesco, and it would be an even bigger call from Daley to bring him back at Edwards’ expense.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/round-11-around-the-clubs-20250511-p5ly7j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Best suffers hamstring injury, out of Origin contention",
    "publish_date": "Fri, 16 May 2025 11:33:03 +1000",
    "category": "sports",
    "authors": [
      "Michael Chammas",
      "Robert Dillon",
      "Dan Walsh",
      "Adrian Proszenko"
    ],
    "text": "“Mr Payten has been reminded of his obligations under the NRL rules and code of conduct, as well as his general responsibility as a sporting leader to set an appropriate example to grassroots and junior participants across the broader rugby league community,” the statement read. “All rugby league participants are reminded to respect referees and match officials, who perform a vital and integral role within the game.” Payten was asked at last week’s post-match press conference, after his team’s thrilling golden-point draw with the Panthers, whether referees were reluctant to make tough calls in extra time. Cowboys coach Todd Payten. Credit: Getty He agreed, replying: “That’s what they’re paid to do, make the right call at the right time ... it was so frustrating.\n\n“We want consistency and we’re not getting it. “I’m confused about what’s a high shot, and what’s not. I’m sure everyone else is … I’ll talk to the NRL through the week about it and go through the right channels. “But it’s white noise. ‘Yeah, we got that wrong’, but no one is held accountable for it. “If it’s my player making error after error, or a couple of howlers, then there’s a fair chance he’s not in the team.” Payten has been a regular critic of match officials over the years. In his rookie year as a head coach, at the Warriors in 2020, he said it “infuriates me, embarrasses me as a coach that we are still having this [refereeing errors] happen in our game”.\n\nThen in 2022, he claimed high-profile teams and players “get the benefit of the doubt too often” in terms of 50-50 calls. He was touted as the next SBW. Could he be heading for the Tigers? Wests Tigers have emerged as potential contenders for the signature of off-contract Newcastle forward Kai Pearce-Paul. The England international, who has made 29 NRL appearances for the Knights, was compared to Sonny Bill Williams when he first arrived from Super League, and although he has shown glimpses of his potential during his time in the Hunter, he has not been as dominant as he was in the UK. Knights forward Kai Pearce-Paul. Credit: Getty Images\n\nThe 198-centimetre, 108-kilogram back-rower, who is unlikely to be re-signed by the Knights, is keen on a new start and several NRL clubs have expressed interest, most notably the Tigers. As yet, no deal has been struck but if the parties can come to terms for an immediate switch – rather than Pearce-Paul arriving at the end of the season – it would free up the money Newcastle need to immediately bring out-of-favour Rooster Dom Young back to the club. Young is contracted to the Roosters until the end of 2027, but the club is at loggerheads with the Knights over whether they should pay any of the winger’s freight. Meanwhile, the Tigers have lost in-form prop Fonua Pole for at least four to five weeks after he suffered an MCL injury in Sunday’s 64-0 thrashing in Melbourne. Pole has been one of the Tigers’ best performers each week and will leave a considerable void up front, particularly if front row partner Terrell May is handed a NSW Origin debut by Laurie Daley.\n\nThe Tigers host the Rabbitohs on Sunday night, with Daley and the NSW hierarchy weighing up whether to name his Origin I squad after full-time or wait until Monday morning. The Tigers have the bye in round 12 and it is hoped rising young half Latu Fainu (thumb) and winger Jeral Skelton (hamstring) will be able to return the following week against North Queensland. Robinson slams Knights over Young negotiations Sydney Roosters coach Trent Robinson is preparing to farewell Brandon Smith but has cast doubt on Dominic Young’s proposed return to Newcastle by firing a broadside at Knights officials. Robinson said on Monday that Smith was undergoing a medical at South Sydney and the Kiwi hooker’s mid-season transfer to the Rabbitohs “should get sorted out today”.\n\nNewcastle’s hopes of enticing Young back up the freeway, however, appear far less promising, after Robinson took the Knights to task for allegedly asking the Roosters to not only release the 23-year-old from the remainder of his contract, but also to pay him out for the rest of this season. Young is barely 18 months into a four-year deal and, unless the Knights can come back with a revised offer, Robinson said the Roosters were content to honour his contract. Asked if the proposed deal could fall through, Robinson replied: “Yeah, unless things change from their end. “I think they’re trying to bluff us into it, but we didn’t want it to happen. We didn’t instigate any of this. Anyway, that’s done.\n\n“I think I’ve been pretty clear in our stance and how it went down. So it’s just get back to work, let’s keep playing, and get back to Dom playing his best footy and being in a place for selection.” Robinson said reports last week that the Roosters were trying to move Young on, to free up salary cap space, were incorrect. He said the club had received an approach from Newcastle, with whom Young started his NRL career, scoring 43 tries in 51 games before his move to Bondi Junction. Dominic Young won’t be joining the Knights unless the Roosters agree to release him. Credit: Getty Images “The way it was put out there was as if we were trying to push him out, which wasn’t the case,” Robinson said. “Newcastle rang us – obviously having talked to his manager beforehand when he got dropped, to try and get him out – and we said yes ... then they’ve backtracked at the end of the week and today, so that’s really annoying.\n\n“If you ask for something, you’ve prepared it, then you stick by it. And they haven’t done that, and it’s thrown Dom in a spin, and us all this week, when it wasn’t our doing. “So it’s pretty annoying … it’s been pitched one way, and then they’ve pivoted.” Robinson said the sticking point was that the Knights asked the Roosters to pay out the balance of Young’s contract for this season, estimated to be worth about $200,000. “They want us to release him, but us to pay money for it, when we weren’t even thinking about releasing him,” Robinson said. “In what world does that happen?” Brandon Smith is on his way out of Bondi. Credit: Getty Images\n\nKnights chief executive Philip Gardner declined to respond to Robinson’s comments, saying: “We have more class than that.” Young was dropped after the Roosters’ round seven loss to Penrith and played NSW Cup on Sunday, scoring a try. Robinson said former Wallaby Mark Nawaqanitawase had leapfrogged Young based on his form this season, but that could change. “It’s just I thought Mark was outplaying him,” Robinson said. “Really simple. It happens every week in sport around the world. It’s quite simple. He’s a really good player. He’s an NRL player. He’s a starting NRL player. But Mark was playing slightly better, and you make that choice.” Loading\n\nIn contrast to the Young imbroglio, Robinson said the transfer of Smith to arch-rivals South Sydney was likely to be “pretty simple from both ends”. “I think both sides have handled it pretty cleanly and quite well, which would be disappointing for the gossip columnists to hear, but it was pretty clean, all of that,” he said. “And then, yeah, the other one [Young] ... it’s pretty rare. I haven’t seen too many go like that, to be honest.” Robinson said the Roosters were still interested in signing departing Manly skipper Daly Cherry-Evans, but have not yet started negotiating with his management. Trainers under scrutiny for wetting ball as Cowboys coach rages at referees\n\nBy Dan Walsh The NRL will on Monday review reports of both Penrith and North Queensland trainers spraying water on the ball before golden-point kick-offs as Cowboys coach Todd Payten prepares to lodge a formal complaint over several calls in his side’s 30-all draw with Penrith. Both Payten and Penrith opposite Ivan Cleary were incensed with the officiating in Saturday’s 90-minute thriller in Townsville, with the North Queensland mentor struggling to hold himself back from swearing as he critiqued contentious calls. The NRL football department is also in possession of footage shot from the stands in which Penrith’s football manager Shane Elford – who doubles as their blue-shirt trainer on game day – sprays water on the ball before the Panthers kicked off golden point. Cowboys halfback Jake Clifford caught the ball without incident.\n\nPayten did not respond to calls on Sunday but told The Daily Telegraph that Elford “did it before every kickoff. We noticed it in the [coaching] box”. North Queensland’s trainer also sprayed water on the ball before Clifford prepared to kick off the second half of extra-time, but referee Todd Smith picked up on it. Smith could be heard on the broadcast calling for an extra ball and explaining shortly afterwards that “he squirted the ball”. The NRL goes over all football matters as part of its weekly Monday reviews. Payten raised multiple referee decisions in his post-match press conference, taking specific issue with Cowboys winger Murray Taulagi being penalised for a high shot on Liam Henry, who slipped into the contact.\n\nThe Panthers scored from the set that followed. Payten was incensed that Cowboys centre Viliami Vailea was not awarded a penalty minutes later after being flattened by Tom Jenkins in cover defence. Loading The collision left Vailea in pain on the ground. “Murray Taulagi got a penalty where a bloke fell into his chest and then Viliami Vailea, less than five minutes later, got his head taken off,” Payten said.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/culture/theatre/picture-of-misery-opera-australia-posts-10-million-loss-as-audiences-hit-a-cliff-20250515-p5lzk2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Picture of misery’: Opera Australia posts $10 million loss as audiences hit a cliff",
    "publish_date": "Fri, 16 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Linda Morris",
      "Nick Galvin"
    ],
    "text": "Opera Australia has plunged deeper into financial crisis, posting a $10 million operating deficit as chair Rod Sims defended its worst results since the pandemic.\n\nAustralia’s largest performing arts company was forced to draw down on its emergency capital fund to offset its losses after its Sydney winter season and its much-hyped run of Sunset Boulevard failed to meet box office forecasts.\n\nSarah Brightman in the underwhelming production of Sunset Boulevard. Credit: Justin McManus\n\nMelbourne performances of the Andrew Lloyd Webber musical last year were blighted by poor reviews, unsold seats and long absences by its lead, Sarah Brightman, due to injury.\n\nIn addition, OA blamed the closure of the company’s State Theatre home in Melbourne and the need to perform in other venues for the hit to its bottom line.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/national/nsw/they-thought-they-had-bought-land-to-build-their-dream-homes-it-all-ended-up-in-court-20250516-p5lzox.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "They thought they had bought land to build their dream homes. It all ended up in court",
    "publish_date": "Fri, 16 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Neil Breen"
    ],
    "text": "Purchasers of 154 blocks of land at Marsden Park in Sydney’s north-west will receive $100,000 each in compensation, as well as have their deposits and stamp duty refunded, under a settlement offer in a multimillion-dollar class action.\n\nIn 2020 and 2021, at the height of COVID-19, the buyers, predominantly families, signed contracts worth between $600,000 and $700,000 per block at Clydesdale Estate, nestled off Richmond Road.\n\nEach block was secured with a 10 per cent down payment, plus full stamp duty of about $30,000.\n\nPurchasers bought the blocks of land from Chinese-owned developer Boyuan Holdings Limited (BHL) and its sister company Cyan Stone, atop a web of holding companies.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/goodfood/tips-and-advice/how-to-cook-with-less-salt-without-sacrificing-flavour-20250429-p5lv06.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How to cook with less salt without sacrificing flavour",
    "publish_date": "Fri, 16 May 2025 11:23:46 +1000",
    "category": "finance",
    "authors": [
      "Becky Krystal"
    ],
    "text": "Advertisement\n\nTips & adviceHealthy eating How to cook with less salt without sacrificing flavour From low-sodium alternatives to being more mindful about when to season your cooking, these simple tips will help you keep the flavour without the health risks. Becky Krystal May 16, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nOf all the various dietary needs, limiting the amount of sodium in recipes is among the most common requests. The good news is that, if you’re eating mostly home-cooked food, you’re already well on your way to reducing your salt intake, as around 75 per cent of dietary sodium comes from packaged or prepared food, according to Dietitians Australia. Photo: Supplied The next step is to be mindful about how you’re making that from-scratch fare. Reducing (or eliminating, if necessary) salt is about more than refraining from grabbing that shaker, though. Beginning with your trip to the grocery store and up to the point you season your food at the end of cooking, there are plenty of opportunities throughout the process that can help you be smarter about salt. Here are a few tips. Look for tinned tomatoes that state low-salt on the label. Supplied\n\nAdvertisement\n\nBuy no-salt-added products Standard pantry ingredients can contain sodium — sometimes large amounts — that you might not know about unless you scrutinise the labels. Common culprits include canned tomatoes, broth or stock, canned beans, tomato paste, and other canned vegetables. No-salt-added versions of these types of products, however, are readily available. Choose reduced-sodium options No-salt-added isn’t the only option for store-bought staples. Plenty of ingredients are available in reduced- or less-sodium versions. The best example is soy sauce. My standard bottle is always one with less sodium, and I have never found the seasoning lacking. You can also find less-sodium options for jarred pasta sauces, broth and stock, cheese, canned beans, and salsa, among other items. Soy sauce is loaded with salt so try to opt for low-salt varieties when possible. Supplied\n\nAdvertisement\n\nMake your own pantry items If you’re not starting with no-salt-added canned beans, fear not. A quick rinse can make a significant difference. Cook’s Illustrated commissioned a lab to see how much sodium you can eliminate simply by rinsing canned beans. Looking at cans of store-bought cannellini, pinto and black beans, plus chickpeas, the lab found that draining and rinsing them cut the sodium by about 100 milligrams per half-cup serving, roughly 25 per cent. Add salt smartly Depending on your own health situation, cutting back on sodium may not mean not using salt ever. So focus on getting more bang for your buck, flavour-wise. As Samin Nosrat says in her book Salt, Fat, Acid, Heat it matters when you use salt.\n\n\n\n“Add it in the right amount, at the right time, in the right form. A smaller amount of salt applied while cooking will often do more to improve flavour than a larger amount added at the table.” So, salt your meat in advance, sprinkle some on your vegetables before roasting, and add it to the water in which you’ll be boiling vegetables, pasta and grains. That way you’re giving the salt time to work and season from within. Shichimi togarashi can be used to add flavour to ingredients like avocado. William Meppem\n\nAdvertisement\n\nTry other assertive flavours Nothing is an exact replacement for salt. (Some people find alternatives such as potassium chloride too metallic, and it’s best used in consultation with a physician since it can be problematic in the presence of certain medical conditions.) Still, you can experiment with other flavours, either in conjunction with less salt or in place of it. Consider citrus juice or zest, vinegar, herbs and spices. Especially at the end of cooking, a hit of vinegar or lemon juice can brighten and sharpen a dish when you might otherwise add salt. Good spices or seasoning blends that help perk up a completed dish Sumac\n\nZa’atar. Some blends include salt, so read the label.\n\nEverything spice. You can make your own and leave out the salt.\n\nToasted sesame seeds\n\nShichimi togarashi\n\nCrushed red pepper flakes The Washington Post\n\nAdvertisement\n\nThe best recipes from Australia's leading chefs straight to your inbox. Sign up\n\nSave Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Healthy eating\n\nDiet",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/technology/what-does-the-internet-have-to-do-with-your-wellbeing-turns-out-quite-a-bit-20250513-p5lyta.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What does the internet have to do with your wellbeing? Turns out, quite a bit",
    "publish_date": "Fri, 16 May 2025 11:19:33 +1000",
    "category": "finance",
    "authors": [
      "Michelle Bateman"
    ],
    "text": "The risk of social isolation becomes more pronounced after retirement, but many seniors are well-versed in using technology and expect to keep it up long after they’ve left the workforce. This is even more important for retirees chasing a tree or sea change, says Dr Graham, as the lifestyle advantages of moving away from the city can be outweighed by more limited access to specialist in-person health services. “For me, the ongoing greater adoption of digital technology is the only way to bridge the health inequality that exists between someone who lives in a metropolitan area, versus someone who’s living out in rural NSW.”\n\nHe adds that “seniors are quite receptive to adopting new technology” but may need a friend or family member to help them get set up. His advice: make a printed hard copy of any instructions and include pictures and diagrams showing each step.\n\nThe nbn research also showed more than half (52 per cent) of nbn users accessed medical resources online, and two-in-five (39 per cent) accessed telehealth via the nbn network, with more than three-quarters (77 per cent) reporting this improved their health outcomes.\n\nMaking it meaningful\n\nThe digital age has not diminished our need for connection; it has amplified our ability to achieve it. Credit: iStock\n\nTo get the most benefit from online social connections, Tomlinson recommends trying a variety of methods and platforms. “Each form of digital communication offers us something different and balance is important to support our emotional wellbeing. It’s important not to rely too heavily on one mode of contact, as having a mix of interactions mimics how we connect in the offline world.”\n\nOnline communities can be valuable for fostering shared interests or purposes; video calls allow us to have real-time interactions and see people face-to-face; and group chats can help us maintain contact and a sense of closeness with people that we don’t see all that often. Along with a strong internet connection, being authentic and consistent is your best bet for making meaningful connections.\n\n“Keep in touch, be present and reliable in order to build trust over time,” Tomlinson advises. “Quality over quantity is key. You don’t need to have a constant stream of messages going or have hundreds — or thousands — of friends and interactions online. A few deep, meaningful interactions are likely to be more fulfilling than shallow ones.”\n\nUltimately, the digital age has not diminished our need for connection; it has amplified our ability to achieve it. For many, increased access to stable and reliable broadband, and forced adoption during the COVID-19 lockdowns, helped transform virtual interactions from glitchy gimmick to an indispensable lifeline. The power to forge meaningful relationships, support our wellbeing and bridge distances now rests, quite literally, at our fingertips.\n\nAnd those great connections can only be made better with a stable and reliable internet connection powered by the nbn network. Learn more by visiting the nbn website.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/business/companies/operation-elon-the-aussie-who-made-820m-selling-her-tesla-shares-20250514-p5lz4c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Operation Elon: The Aussie who made $820m selling her Tesla shares",
    "publish_date": "Fri, 16 May 2025 11:17:47 +1000",
    "category": "finance",
    "authors": [
      "Colin Kruger"
    ],
    "text": "Let’s start with a different question: why is this respected Silicon Valley veteran selling? Who would not want to own shares in a company that – as its return to the trillion-dollar valuation club demonstrates – seems to be protected from any sense of economic logic. Sales continued to plunge across its biggest European markets last month, despite a long-awaited update of its most popular car. Its trillion-dollar valuation only makes sense if you look at it as a meme stock – a company that suddenly goes viral on social media and its shares skyrocket for no clear reason. While leaving Tesla on self-drive mode, Musk found time to support extreme right-wing causes across Europe, which triggered a plunge in sales on the Continent, as well as the Trump administration, which is waging a global trade war that is also costing Tesla dearly.\n\nAnd when reports emerged that Tesla’s directors were searching for a potential replacement for Musk – a very sensible decision for any board in the circumstances – Denholm made a public statement declaring the report to be “absolutely false” and made it clear that Tesla and its founder Musk were joined at the hip. A protester stands outside a Tesla showroom in West London. Credit: Getty Images “The CEO of Tesla is Elon Musk and the board is highly confident in his ability to continue executing on the exciting growth plan ahead,” she said in a tweet on his social media platform, X. It is no wonder this board was slammed by a US court judge over a $US56 billion pay packet for Musk. It was accused of acting as enabler for the company founder, not as an overseer for investors. But the rules are different at Tesla.\n\nIts trillion-dollar valuation only makes sense if you look at it as a meme stock – a company that suddenly goes viral on social media and its shares skyrocket for no clear reason. And Musk is its meme. Denholm seems to get this. Any valuation currently subscribed to Tesla left reality a long time ago, and the only tether with valuations on planet Earth is its mercurial founder. Tesla’s valuation was extraordinary enough when it was merely worth more than every other carmaker on the planet combined. That was based on the idea that it had too much of a lead on e-vehicles – the car of the future – for anyone else to catch it. While US and European sales reflect repugnance for Musk’s politics, the fall-off in China reflects a far more sobering reality: Tesla is way behind its multitude of Chinese rivals on every significant feature: price, recharging times and autonomous driving features which are now offered free on some Chinese cars. The Nio EP9 on display at the Guangzhou Auto Show in China late last year. China is taking the lead on e-vehicle development. Credit: Bloomberg\n\nKeep in mind that the future earnings that underpin its current $US1.1 trillion valuation are expected to shrink if his Republican buddies successfully gut electric vehicle subsidies to the tune of billions of dollars. And the price investors pay for each dollar of Tesla’s profit far exceeds dominant tech rivals such as Nvidia, Apple and Microsoft. Cars clearly don’t drive its valuation now, it is the market perception of Musk’s ability to morph the company into a dominant force in AI, robotaxis and humanoid robots. That is a much harder argument to make in the current environment. Any valuation currently subscribed to Tesla left reality a long time ago, and the only tether with valuations on planet Earth is its mercurial founder. You don’t need to go outside the US borders to see what significant competition Tesla faces on the AI front. And China appears to be streets ahead when it comes to autonomous driving, robotaxis and is already talking about AI-aided robots as its next workforce.\n\nIt underlines that Denholm’s one job at Tesla is to keep Musk interested enough to ensure he gives the company a decent crack at the impossible task before it. The issue is not whether Tesla is a valuable company, it is whether it is worth anything remotely close to the current market valuation. It gives an interesting context to Denholm’s massive stock sale, which has left her with shares worth about $US27 million. James Murdoch, the younger son of Rupert, is another high-profile shareholder who has sold millions of dollars worth of Tesla stocks. Credit: Bloomberg Her Tesla stake is almost certainly worth less than her trophy homes in Sydney and nearby Whale Beach where she reportedly tried, and failed, to get approval for a lift to be installed that would deliver her to the sun-kissed sand.\n\nIf she isn’t willing to hold shares she paid almost nothing for, other investors should take heed. And you only need to look at Musk’s focus to see why. His trip to the Middle East with Trump yielded the news that Saudi Arabia had authorised the use of SpaceX’s Starlink satellite communications service. Loading Unlike e-vehicles, robotaxis, AI and dancing robots, Musk’s SpaceX totally dominates the space sector with thousands of low orbit, cost-efficient, satellites. Unlike Tesla, SpaceX is also privately owned and considered the future of his considerable wealth.",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-and-go-jo-are-out-of-the-eurovision-song-contest-2025/7193reejc",
    "title": "Eurovision 2025: Australia and 'milkshake man' Go-Jo knocked out of song contest",
    "publish_date": "Thu, 15 May 2025 21:25:36 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's Eurovision entrant, Go-Jo, has been knocked out of the 2025 Eurovision Song Contest.\n\n\n\n\n\nGo-Jo, whose real name is Marty Zambotto, opened the second semi-final with his song Milkshake Man on Friday morning (AEST).\n\n\n\n\n\nViewers chose their favourite performances via televote, and 10 countries went through out of the 16 in the second semi-final.\n\n\n\nLithuania, Israel, Armenia, Denmark, Austria, Luxembourg, Finland, Latvia, Malta and Greece were the 10 countries that made it through.\n\n\n\n\n\nIn addition to Australia, Montenegro, Ireland, Georgia, Czechia and Serbia were also knocked out of the contest in the second semi-final.\n\n\n\n\n\nGo-Jo spoke to SBS News ahead of the semi-final, and was asked what success would look like for him in this year's contest.\n\n\n\n\n\n\"I think just seeing smiles,\" he replied, adding that it would be a reflection of the hard work that went into the performance.\n\n\n\n\n\n\"A lot of people would see me, as the performer, but I have an incredible team behind everything.\n\n\n\n\n\nI think one of the most meaningful things is making them proud, and obviously Australia. It's such a big thing for me. Just, seeing everyone smile at the end of everything, I think that's a big win.\"\n\n\n\nLISTEN TO 'Surreal and honourable': Gojo prepares for Eurovision semi-final SBS News 15/05/2025 06:17 Play\n\nIt's the second year in a row Australia has been knocked out of the contest during the semi-final, with 2024 entrants Electric Fields also not qualifying.\n\n\n\n\n\nThe last time Australia made it through to the grand final was in 2023, with progressive metal band Voyager and their song Promise. It finished in ninth place, with Sweden taking out the top spot.\n\n\n\nWhen will the Eurovision 2025 grand final be?\n\nYou can watch the Eurovision 2025 grand final on Sunday 18 May at 5am AEST on SBS and SBS On Demand.\n\n\n\nWho will compete in the Eurovision 2025 grand final?\n\nIn addition to the 10 qualifiers listed above, Sunday's grand final will also feature the 10 qualifiers from the first semi-final: Iceland, Poland, Estonia, Ukraine, Sweden, Portugal, Norway, San Marino, Albania, and the Netherlands.\n\n\n\n\n\nHost country Switzerland, as well as the 'big five' of France, Germany, Italy, Spain and the United Kingdom, all of whom automatically qualified, will also compete.\n\n\n\n\n\nVisit the SBS On Demand Eurovision hub for the latest highlights and replays from Basel.\n\n\n\n\n\nYou can listen to every Eurovision winner and this year's entries on SBS EuroPop — our 24/7 Eurovision music station, running for the entire month of May.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/women-drive-job-gains-as-unemployment-rate-remains-at-4-1/wzbndnwe0",
    "title": "Women drive job gains as unemployment rate remains at 4.1%",
    "publish_date": "Thu, 15 May 2025 08:00:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/misogyny-in-a-bow-the-hidden-dangers-of-soft-sexism/bupxiez6p",
    "title": "'Misogyny in a bow': The hidden dangers of soft sexism",
    "publish_date": "Thu, 15 May 2025 07:34:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "A viral podcast clip has sparked discussions about soft sexism and hidden misogyny, and the importance of women's financial security.\n\n\n\n\n\nIn an excerpt from The Pocket Podcast , host Chris Griffin said he would not want his partner \"working unless she wants to work\" if it was going to lead to her \"complaining\" about her day when she got home.\n\n\n\n\n\nGriffin went on to say he would like his partner's eyes to \"light up with excitement\" when talking about her passions or daily activities, and used examples of collecting postcards and going on \"hot girl walks\".\n\n\n\n\n\n\"It's the calm, it's the harmony, it's the peace and love that a man that's got a busy life that's chasing his dreams needs when he's trying to wind down,\" he added.\n\n\n\nHe said he would \"heavily encourage\" his partner to go on walks with her friends to get \"feminine energy\", talk, and \"have a bit of excitement\".\n\n\n\n\n\n\"I don't think a girl needs to go through challenge, pain and hardship to be an amazing girl. I think she can fill her day with passion-filled things and still be amazing.\"\n\n\n\n\n\nLaura Henshaw, co-founder and CEO of the Kic health app, shared the clip to her Instagram stories, saying she was concerned about the message it would send to young listeners about gender roles.\n\n\n\n\n\n\"As women, we do not exist to 'serve' our partners. To live out days so we can be in a 'good' mood for them,\" she wrote.\n\n\n\n\n\nHenshaw said it is important for women to feel empowered to make their own choices about their careers, work for financial independence, and build up superannuation for retirement.\n\n\n\nLISTEN TO Financial inequality in Australia at its greatest since 2001 SBS News 06/03/2025 04:52 Play\n\nGriffin later responded in an Instagram comment, saying his remarks were about supporting a partner's purpose and joy, and that if a partner wanted to pursue a career, he would respect that.\n\n\n\n\n\nHe also said he did not think it was fair to label traditional views as \"toxic\".\n\n\n\n\n\n\"I respect your view, I just don’t share it. And I know not everyone will agree with mine, but that’s okay,\" he wrote.\n\n\n\n\n\n\"I’m not here to please everyone. I just stand by what I believe, with respect.\"\n\n\n\n\n\nSome followers agreed with Griffin, saying they felt his views reflected choice and freedom, and could have a place in a healthy relationship.\n\n\n\n'Misogyny in a bow'\n\nHenshaw described the comments in the podcast as \"misogyny in a bow\" and said she found these attitudes \"terrifying\".\n\n\n\n\n\n\"When you have a video where you're in a professional studio, the video is high quality, you've got motivational music behind it ... the misogynistic message is being framed in a way that is caring and loving, [that] is what is really scary,\" she said.\n\n\n\n\n\n\"It's masked up in this beautiful little bow when that's not what it is at all.\"\n\n\n\n\n\nShe said Griffin's response had failed to address the full context of the issue, and said she believed the language throughout the podcast had been possessive and patronising toward women.\n\n\n\nHenshaw also took issue with the way Griffin and his guest, YouTuber Wade Papenfus, spoke about their own career goals and passions, compared with women's interests and ambitions.\n\n\n\n\n\n\"What's so difficult within all of this is that the underlying message is that as women, we need a man to survive,\" she said.\n\n\n\n\n\n\"We can't be our best selves unless we have a man, we're not born to work hard, we're born to make a man happy ... all of those messages that feel like we're in 1950.\"\n\n\n\n\n\nShe also said the content could send a harmful underlying message about gender roles and be detrimental to men.\n\n\n\n\n\n\"If we are putting pressure on men to have to provide for the whole family and do that on their own in the current economic climate, that is really toxic as well,\" she said.\n\n\n\n\n\n\"That is really scary.\"\n\n\n\n'Still patriarchy — just prettier language'\n\nIn a video on Instagram, anti-violence and gender equality advocate Tarang Chawla described Griffin's comments as an example of soft sexism, despite sounding caring.\n\n\n\n\n\n\"It masquerades as men's mental health or care for women or men, but it's really modernised sexism that's packaged in soft tones and inspirational music,\" Chawla said.\n\n\n\n\n\n\"It idealises women as being ornamental, peaceful and emotionally nurturing, but still ultimately existing to serve a man's wellbeing and ambition.\"\n\n\n\n\n\nHe said this type of rhetoric is increasingly common in influencer and manosphere-adjacent spaces.\n\n\n\n\"And for a lot of women, that's the message that came through loud and clear on Chris's clip. He says: 'We don't need you to make money, we're sorted',\" Chawla said.\n\n\n\n\n\n\"But the translation is 'You can work, as long as it doesn't interrupt my peace. Your labour is optional but your emotional availability, that's non-negotiable'.\"\n\n\n\n\n\nChawla said these attitudes are a \"repackaging of a 1950s housewife\", with a woman's emotional labour serving the man's dream life.\n\n\n\n\n\n\"Telling women they don't need to work as long as they stay soft, calm, and peaceful; it isn't empowering. It's control disguised as care, because this isn't about her freedom or her independence, it's about his comfort,\" he said.\n\n\n\n\n\n\"When men centre themselves in what women should feel, do or be — even under the banner of support, it's still patriarchy — just under prettier language\".\n\n\n\nChawla has publicly offered to speak with Griffin on his podcast, an offer Henshaw hopes the host will accept.\n\n\n\n\n\n\"I would hope that he could change the perspective on women for his audience, and it might mean that they respect women more, they respect them in the workplace, they respect them within their relationship,\" she said.\n\n\n\n\n\n\"That's where the opportunity is for him in this situation.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/trump-visit-to-qatar-signals-a-change-in-us-relationship-with-the-middle-east/pj39vljob",
    "title": "Trump visit to Qatar signals a change in US relationship with the Middle East",
    "publish_date": "Thu, 15 May 2025 04:59:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n(Qatari music)\n\n\n\n\n\nDonald Trump gets the royal welcome in Qatar with singers and sword dancers putting on a show for the United States President.\n\n\n\n\n\nAfter flying from Saudi Arabia, President Donald Trump kicked off the second leg of his three-nation Middle East tour by getting Qatar's ruling emir, Sheikh Tamim Bin Hamad Al Thani, to sign a series of economic and defence deals.\n\n\n\n\n\nThe first of the agreements has Qatar buying 160 jetliners from US company Boeing plus options to buy 50 more, a deal worth a reported AU$149 billion.\n\n\n\n\n\nThe other deals focused on defence and the purchase of military drones, with Qatar offering a statement of intent for more than AU$59 billion in future defence investments.\n\n\n\n\n\nQatari leader Sheikh Al Thani says the agreements have strengthened the US-Qatar relationship.\n\n\n\n\n\nAL THANI: \"I think after signing these documents, we are going to another level of relationship between Qatar and the United States. So I just wanted to thank you, Mr. President, again for this historic visit. Thank you, very much, sir.\"\n\n\n\n\n\nTRUMP: \"Well, thank you very much. And this has been a very interesting couple of hours. But I just want to thank you. We've been friends for a long time, long before politics. We always had a very special relationship. And we're going to help each other. The United States is in a very strong position militarily. We have the best equipment anywhere in the world. You're buying a lot of that equipment, actually. And I think we're gonna see some of it in action tomorrow.\"\n\n\n\n\n\nQatar's recent offer to provide a AU$620 million Boeing 747 jet to Donald Trump to use as a temporary Air Force One plane has been criticised as an attempt to buy favour with the US President.\n\n\n\n\n\nQatari Prime Minister Sheikh Mohammed bin Abdulrahman Al Thani has argued on Fox News that it is not a personal gift but a routine government-to-government transaction.\n\n\n\n\n\n“Unfortunately, I see that this story is taking a different direction and is being more politicised, while it's a normal government to government deal.”\n\n\n\n\n\nThe Qatari Emir, Sheikh Al Thani also used his meeting with President Trump to encourage the leader to use the US's leverage to help bring the war in Gaza to an end.\n\n\n\n\n\n\"I truly believe that you are a president of peace. Right now, even as we gather tonight, our teams are engaged in intensive diplomacy to secure a ceasefire in Gaza. Mr President, your involvement could catalyse a breakthrough where others have stalled, but only if done in concert with serious partners. Qatar brings the channels, the access, and the credibility. The United States brings power, leverage, and global weight. If we act together, we have a real shot at ending the bloodshed and restoring regional confidence.\"\n\n\n\n\n\nIn a surprising move, President Donald Trump has avoided Israel on his Middle East trip, although his special envoys Steve Witkoff and Adam Boehler have travelled to meet with the families of hostages and show their support.\n\n\n\n\n\nThe Trump administration has appeared to distance itself from the Netanyahu government in recent diplomatic efforts, negotiating a ceasefire with the Houthis directly and coordinating the release of US-Israeli hostage Edan Alexander with Hamas itself.\n\n\n\n\n\nPresident Trump's growing alliance with Qatar, which Israeli officials have long accused of aiding militant group Hamas, could be signalling a shift in the US leaders regional priorities.\n\n\n\n\n\nHe says he is now working with Qatar to secure a deal with Iran to prevent the geopolitical rival from obtaining nuclear weapons.\n\n\n\n\n\n\"You're also working with us very closely with respect to negotiating a deal with Iran. We have two courses, there's only two courses. There aren't three or four or five. There's two. There's a friendly and a non-friendly. And the non-friendly is a violent course, and I don't want that but they have to get moving.\"\n\n\n\n\n\nBut Iranian officials have not received Mr Trump's request for a nuclear deal well, especially the US President's earlier claims that Iran is supporting terrorism and is encouraging regional proxy wars.\n\n\n\n\n\nIranian President Masoud Pezeshkian says his country wants peace and such comments are hypocritical coming from the U-S considering their continued backing of Israel's assault on Gaza.\n\n\n\n\n\n\"Did we destroy sixty thousand women and children in Gaza in a year under the bombs and missiles they had? Did we cut off their access to food, water and medicine? Are we a danger? We will not bow down to any bully. This is not just my word, but all women and youth, elites and those who are zealous will not bow down to any power.\"]]\n\n\n\n\n\nBut, while Donald Trump's efforts to achieve diplomatic success with Iran remain unlikely for now, his decision to lift sanctions on Syria has been met with praise from Syria's interim president Ahmed al-Sharaa.\n\n\n\n\n\nMr Trump appears to have suggested he made the decision to remove all sanctions imposed during the rule of the former leader of Syria Bashar al-Assad at the request of Saudi Crown Prince Mohammed bin Salman.\n\n\n\n\n\nPresident al-Sharaa, whose rebel alliance ousted al-Assad, celebrated the move as a turning point for Syria. \"President Donald Trump responded, thanks to him, and then came the decision to lift the sanctions, a historic and courageous decision that removed the suffering of the Syrian people and helped their renaissance and set the basis of stability in the region. Syrians, we still have a long way to go. Today, serious work has begun and with it the renaissance of modern Syria has begun. So Syria is together towards progress, prosperity, science and action.\"\n\n\n\n\n\nPresident Trump has now met with Mr al-Sharaa, the first encounter between the leaders of the US and Syria in 25 years.\n\n\n\n\n\nIn a statement, the White House says during the meeting, Mr Trump also urged President al-Sharaa to deport Palestinians it described as “terrorists”, and to normalise relations with Israel.\n\n\n\n\n\nBut otherwise, the US President reflected fondly on the meeting.\n\n\n\n\n\nREPORTER: \"How did you find the Syrian President?\"\n\n\n\n\n\nTRUMP: \"Great. I think very good. Young, attractive guy. Tough guy. Strong past, very strong past. A fighter.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/surreal-and-honourable-gojo-prepares-for-eurovision-semi-final/baowp93gq",
    "title": "'Surreal and honourable': Gojo prepares for Eurovision semi-final",
    "publish_date": "Thu, 15 May 2025 03:59:37 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\n\n\n\n\n\nAfter failing to make the final last year, Australia needed to shake things up at Eurovision 2025, so who better to send than the Milkshake man?\n\n\n\n\n\nSoon, we’ll know if Europe likes the taste of what Gojo’s serving.\n\n\n\n\n\n“It's like so surreal. And you know, looking up at this, at this, all the chairs, and knowing that it how it's going to be so filled is it's a very surreal feeling, and it's very honourable as well. Just to you know, I see the postcard playing, and it says, you know, that I'm representing Australia. It's everything about it is just, you know, it lights me up and it makes me feel very warm and excited.”\n\n\n\n\n\nHis quick-change-in-a-blender set to be one of the most memorable… and risky… moments of the night.\n\n\n\n\n\n“Yeah well it’s actually magic! There’s nothing that happens that’s physical.. it’s all magic, it’s all cosmos of the universe.”\n\n\n\n\n\nFor the first time, Australia’s up first.\n\n\n\n\n\nOpening the show is not always considered a good thing, the theory being viewers might have forgotten an act by voting time.\n\n\n\n\n\nBut GoJo’s not concerned.\n\n\n\n\n\n“Love it so much, could not be happier, actually. I think it's like... and I know the energy I bring, and I'm very opening stages. Like, I remember opening... I, you know, did some stuff with the Jonas Brothers when they played in Sydney, and I'm just, I feel like I'm very used to it, and I love warming the stage and getting the crowd energised for all the other acts. And, and, and like I said, I'm very confident. And so excited about our performance in particular, because I just, you know, I know all the hard work we've all put into it and how fun it's going to be.”\n\n\n\n\n\nEurovision is meant to unite nations, but for the second year running, Israel’s participation has sparked controversy amid the ongoing war in Gaza.\n\n\n\n\n\nThough Israel has competed in the contest for over 50 years and won four times, this year’s inclusion has reignited debate.\n\n\n\n\n\nDozens of former contestants and several participating countries have questioned why Israel remains eligible, while Russia was banned following its invasion of Ukraine.\n\n\n\n\n\nThey’ve called on Eurovision organisers to review Israel’s involvement.\n\n\n\n\n\nThe European Broadcasting Union said Israel’s entry was submitted by its national broadcaster, not its government.\n\n\n\n\n\nThis year, Israel is represented by Yuval Raphael, a survivor of the 7 October 2023 Hamas attack at the Nova music festival.\n\n\n\n\n\nShe was met by pro-Palestinian protestors at the opening ceremony.\n\n\n\n\n\nMs Raphael says the best way for her to respond to criticism is to stay focused on giving her best performance.\n\n\n\n\n\n“There is always side noises, and there is always opinions and conversations about so many things, but I think, for me, concentrating and just keeping everything aside as much as I can to bring the best performance is the best decision that I can make.”\n\n\n\n\n\nAnd she used the spotlight to make a final plea on behalf of hostages still held in Gaza.\n\n\n\n\n\n“I would like to finish with one thing, if I can, please, about the hostages. They should have been home a long, long time ago. And hopefully they will be home when I get back, I wish. And that's it. Thank you very much.”\n\n\n\n\n\nSecurity around the event has been increased.\n\n\n\n\n\nBasel police are currently investigating an incident where a protester allegedly made a throat-slitting gesture toward the Israeli delegation during the opening ceremony.\n\n\n\n\n\nPolice spokesperson Rooven Brucker confirmed the matter is under investigation.\n\n\n\n\n\n“We are aware of an incident of the person apparently making a threatening gesture towards the delegation from Israel and further clarification is underway.”\n\n\n\n\n\nHe says officers are prepared for a range of possible disruptions but so far, events have remained peaceful.\n\n\n\n\n\n“An ongoing assessment of the situation is being carried out by the security forces at the ESC. We are prepared for various and a wide range of incidents that could happen. So far it has been peaceful and we hope it stays that way.”\n\n\n\n\n\nAs for GoJo, he says that spirit of unity remains very much alive on the stage.\n\n\n\n\n\n“The competition was created to bring unity amongst Europe so, that’s what it continues to do and it always feels like the love is always there and that’s the most important thing.”\n\n\n\n\n\nGoJo and Yuval Raphael are performing in the second semi-final on Thursday [[15 May]], with the Grand Final set for Saturday night [[17 May]] at Basel’s Saint Jakobshalle arena.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-15-may-2025/ksu4uxm0e",
    "title": "Prime Minister focuses on defence in Indonesia | Midday News Bulletin 15 May 2025",
    "publish_date": "Thu, 15 May 2025 02:08:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Prime Minister focuses on defence in meeting with Indonesia\n\nRussia, Ukraine confirm imminent meeting in Turkey\n\nJordan Day's ambitions for PGA Championships\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPrime Minister Anthony Albanese says regional security and defence will be on the agenda when he holds formal talks with Indonesian President Prabowo Subianto in Jakarta today.\n\n\n\n\n\nMr Albanese has arrived in Jakarta with Foreign Affairs Minister Penny Wong and Home Affairs Minister Tony Burke.\n\n\n\n\n\nAsked how he would manage Russia's attempts to have a greater influence in Indonesia, Mr Albanese says his government is investing in both defence and diplomatic arrangements.\n\n\n\n\n\n\"Look, we'll continue to invest in our capability and President Prabowo has acknowledged important arrangements that we have put in place with a sovereign nation with AUKUS, but in addition to that, we're building our capability and defence arrangements and security arrangements with countries like Indonesia, Papua New Guinea, the Philippines, and other countries in our region. In addition to that, we are investing in - in our relationships, that's one of the reasons why I am here.\"\n\n\n\n+++\n\n\n\n\n\nThe Greens will meet in Melbourne today to choose a new leader.\n\n\n\n\n\nFormer leader Adam Bandt lost his seat of Melbourne at the election, with the minor party losing three out of its four seats in the House of Representatives whilst retaining 11 spots in the Senate.\n\n\n\n\n\nSenators Sarah Hanson-Young, Mehreen Faruqi, and Larissa Waters are expected to contest for the leadership position.\n\n\n\n\n\nLiberal leader Sussan Ley and Nationals leader David Littleproud will also meet today, to discuss the sharing of opposition portfolios between the parties.\n\n\n\n\n\nThe discussions are expected to last several days.\n\n\n\n\n\nMs McKenzie told Channel 9 the talks would not just focus on the number, but type of portfolios each party would hold, as well as how the Coalition operates.\n\n\n\n\n\n\"It's a very successful partnership over a long period of time. But it shouldn't be taken for granted. It needs to be an agreement that is mutually beneficial to both parties and actually reflects the reality of the election result, where the National Party are proportionately did incredibly well.\n\n\n\n\n\nWe haven't had this amount of political clout within the Coalition since the 70s.\"\n\n\n\n---\n\n\n\n\n\nHamas-run Palestinian health authorities say more than 80 people were killed by Israeli strikes in Gaza overnight.\n\n\n\n\n\nMedics say most of the dead, including women and children, were killed in airstrikes on houses in the Jabalia area of northern Gaza.\n\n\n\n\n\nIsrael's military also issued evacuation orders to people in several districts in Gaza City, including schools and the Al-Shifa Hospital.\n\n\n\n\n\nManal Al-Ankar says her daughter was among those ordered to evacuate the hospital.\n\n\n\n\n\n“My daughter was admitted to hospital as a result of the siege, starvation and malnutrition. The hospital was notified to evacuate a short time ago, and as you can see, hundreds of beds, hundreds of injured, where should they go? Where shall we head to? We only have God, there is no power and no strength except with God, we only complain about our weakness to God. God is sufficient for us and is the best disposer of affairs for all who let us down.”\n\n\n\n\n\nMeanwhile, Israeli media is reporting Hamas military leader, Mohammad Sinwar, and other senior officials have been killed in a strike on the European Hospital in Khan Younis.\n\n\n\n\n\nThere has been no confirmation by the Israeli military or Hamas.\n\n\n\n\n\nIsraeli officials say it could take days or weeks to confirm the possible assassination.\n\n\n\n\n\n+++\n\n\n\n\n\nRussian President Vladimir Putin has announced a delegation will attend peace talks with Ukrainian President Volodymyr Zelenskyy in Turkey today [[Thurs]].\n\n\n\n\n\nThe delegation includes an adviser to the President, senior diplomats and defence officials - but there is no commitment that Mr Putin himself will attend.\n\n\n\n\n\nThere has been uncertainty whether the meeting will take place ever since Mr Zelenskyy, who is currently en route to Ankara, called for the Russian leader to meet him face to face.\n\n\n\n\n\nIt comes as the European Union approves its 17th sanctions package on Russia, aimed at oil exports and more Russian officials.\n\n\n\n\n\nGerman chancellor Friedrich Merz flagged the possibility of further sanctions and strongly criticised Russia's refusal to comply with a 30-day ceasefire proposed by Ukraine that was to begin last Monday.\n\n\n\n\n\n“We are waiting for (Russian President Vladimir) Putin's agreement and we agree that if there is no real progress this week, we want to work together at the European level for a significant tightening of sanctions.\"\n\n\n\n---\n\n\n\n\n\nThe lineup for the 2025 Eurovision Song Contest grand final is shaping up with 10 acts progressing through the first semi-final of the competition.\n\n\n\n\n\nThey will join the six countries who automatically qualify for the final, along with 10 other acts who will compete tomorrow.\n\n\n\n\n\nAustralia's entry Go-Jo, who will appear in the second semi-final, told SBS he can't wait to perform.\n\n\n\n\n\n“It's so surreal and looking up at all the chairs and knowing how it's going to be filled up, it's a very surreal feeling, and it's very honourable as well. I see the postcard playing and it says I'm going to be representing Australia. Everything about it just lights me up and it makes me feel very warm and excited.\"\n\n\n\n\n\nThe acts that have moved through the latest round include Norway, Albania, Sweden, Portugal, the Netherlands and Ukraine.\n\n\n\n\n\nBelgium, Slovenia, and Croatia were knocked out.\n\n\n\n\n\nThe second semifinal can be watches on Friday the 16 May at 5am AEST on SBS and SBS On Demand.\n\n\n\n---\n\n\n\n\n\nIn golf,\n\n\n\n\n\nThe PGA championships are underway in North Carolina today, with former Australian number one Jason Day joining the ranks of champions Rory McIlroy and Scotty Scheffler to take on defending tournament champion Xander Schauffele.\n\n\n\n\n\nDay says he is cleaning up some unfinished business before he retires.\n\n\n\n\n\nHe is gunning for a second career major - on the comeback tour after a drought-breaking 13th Tour victory in 2023.\n\n\n\n\n\nAmerican Jordan Spieth has his own ambitions for the Quail's Hollow tournament - this week will be his ninth attempt at a career Grand Slam.\n\n\n\n\n\nHe says he has been inspired by Rory McIlroy, who achieved his first P-G-A tour win at the course.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-motorists-more-likely-to-speed-in-school-zones-20250515-p5lzh1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Motorists more likely to speed in school zones | West End venue to close its doors for good | Gable Tostee appeals casino ban",
    "publish_date": "Fri, 16 May 2025 12:02:31 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "West End bar and live music venue The Bearded Lady will shut down permanently next Friday.\n\nIn a post on social media yesterday, the venue said it had hoped to find a solution that would allow it to stay open, but learned this week it was not to be.\n\n“We’ve done everything in our power to keep the doors open, but unfortunately, negotiations with the landlord fell through yesterday,” the post reads.\n\n“Key members of our local music community were ready and willing to take on the lease, but at the last minute, the landlords informed us they no longer wish to be involved with hospitality.”\n\nThe Bearded Lady will close its doors on Friday, May 23. Credit: Facebook\n\nBeloved by musicians in the local scene, the spot on Boundary Street was struggling financially, and earlier this year set up an online appeal that reached only $27,000 of its $200,000 goal.\n\nNews of its closure was met with an outpouring of sentiment, with local councillor Trina Massey paying tribute to “a vital, beating heart of the West End music and arts scene. A space for creativity, resistance, and pure magic.”",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/environment/conservation/waternsw-admits-pfas-contamination-could-date-from-1992-20250516-p5lzpx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WaterNSW admits PFAS contamination could date from 1992",
    "publish_date": "Fri, 16 May 2025 12:00:03 +1000",
    "category": "finance",
    "authors": [
      "Caitlin Fitzsimmons"
    ],
    "text": "WaterNSW has confirmed the cancer-causing “forever chemicals” found in Blue Mountains reservoirs are from aqueous fire fighting foam – a product that was phased out in 2007, which suggests the contamination has been in drinking water for at least 17 years.\n\nThe report prepared for WaterNSW by engineering firm Jacobs Group confirmed that the contamination could be as early as 1992 when a petrol tanker crashed on the Great Western Highway near Medlow Bath, as previously reported by this masthead.\n\nSTOP PFAS convener Jon Dee in Leura. Credit: Sitthixay Ditthavong\n\nThe also suggests a 2002 vehicle crash and the Medlow Bath Rural Fire Brigade Station as potential sources of the contamination.\n\nWaterNSW confirmed Medlow Dam and Greaves Creek Dam, which were taken offline last year, would remain disconnected from the water supply.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/from-campervan-to-cusp-of-wallaby-history-the-third-coming-of-james-o-connor-20250514-p5lz41.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "From campervan to cusp of Wallaby history: The third coming of James O’Connor",
    "publish_date": "Fri, 16 May 2025 12:00:00 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The journey towards a rare second crack at the British and Irish Lions began for James O’Connor with serendipity and a campervan. It was late 2024 and O’Connor was weighing up his next move in rugby. With Queensland backing its rookie class of Tom Lynagh and Harry McLaughlin-Phillips, the Wallabies veteran had departed Ballymore and had half-a-eye on a move into coaching. But, at only 34, O’Connor wasn’t quite ready to hang up the boots. “I was moving well and I felt like I had some good footy left in me,” O’Connor said. There were options in France, Japan and the USA, but the one that intrigued O’Connor the most was a faint nibble earlier in the year from the mighty Crusaders. The 14-time Super Rugby champions - who won the title in 2023 - had just had an uncharacteristically awful season and missed the finals, and were scouting around for a greybeard to replace the experience of departed All Blacks star Richie Mo’unga. O’Connor was on post-season holidays when he got a call, and was asked if he could get to Christchurch to sit down with Crusaders coach Rob Penney. No worries, O’Connor replied. See you shortly.\n\nAdvertisement\n\n“I happened to be on a road trip in New Zealand in an RV with my wife,” O’Connor said. “And I was probably about an hour away at that stage, just over at Akaroa (east of Christchurch). “So I drove over, literally pulled the RV up and met up with Rob, and it went really well. Then we all went out to dinner afterwards, and pretty much shook hands after that. “It seemed a no-brainer to me. Go to the Crusaders for a year - I get to experience New Zealand Super Rugby, but also the most successful franchise in Super history. “Go there and see what’s made them so successful: how do they keep churning out such good players? How are they playing so well as a team? What is the culture? “Not only just for me rugby-wise, but also with that coaching element as well.” News of O’Connor joining the Crusaders on a one-year deal was met mostly with curiosity on both sides of the Tasman, and the usual smattering of narky Kiwi talkback callers as well. James O’Connor? But few predicted what would happen next.\n\nAdvertisement\n\nJames O’Connor has been impressive off the bench for the Crusaders. Credit: Getty Images The Crusaders have swiftly returned to full power output in 2025, and while that didn’t require the power of Nostradamus to foresee, the role of O’Connor in the revival certainly proved the surprising storyline. Playing off the bench, O’Connor has become an artful practitioner of the finisher role in the last quarter of games; steering the Crusaders home with the considered option-taking honed in 64 Tests for the Wallabies, two World Cups, a Lions series and 18 years as a professional. He nailed a post-siren goal in the rain to beat arch-rivals the Blues, and is now beloved by the Crusaders faithful. People began asking if he was All Blacks-eligible, and a video of a fan paying for his order at a McDonald’s drive through went viral. O’Connor has been so effective for the Crusaders he has played himself firmly back into contention for a Wallabies squad recall, ahead of the Lions tour in June and July. He last played for Australia in 2022. Knowing what it takes to succeed at the Crusaders, and to earn the praise of the Kiwi rugby cognoscenti as well, Joe Schmidt has spoken with O’Connor and last week admitted he was in the mix for selection.\n\nAdvertisement\n\nIf picked, it would be O’Connor’s second Test series against the Lions, after he played no.10 for the Wallabies in all three Tests of the 2013 series. Double-Lions is a highly exclusive club, with currently only one member behind the rope: George Smith is still the only Wallaby to play against the Lions twice, a dozen years apart. James Slipper is also likely to join in 2025. “I’m not gonna lie, part of me going to the Crusaders was wanting to play at that level again,” O’Connor said. “I even had this chat with Les (Kiss) when I left, he was , ‘look if you actually want to have a crack of the Lions or playing with the Wallabies again, you’ve got to be playing top-level rugby’. “So that was part of the decision to come to the Crusaders. Not that I was holding my breath, but I always felt I would love to have one more crack (for the Wallabies), and get a little do-over and play the rugby I know I can play for the group. I always felt I would love to have one more crack (for the Wallabies), and get a little do-over. James O’Connor\n\nAdvertisement\n\n“I had a good chat with Joe, it’s still early days. He just said ‘I feel you’ve taken a lot of good options and you are playing some good footy’. It was more just gauging my interest and I was like ‘yeah I’d love to be involved’.” O’Connor will be in Sydney on Friday night with the Crusaders. Impressing Schmidt isn’t high on the to-do list for O’Connor, but only because selflessness has proven to be the major reason the Wallabies coach is even watching. When talking with Penney and Crusaders coaches early on, O’Connor was told they had a specific job in mind: the closer. “They were like ‘this is where we’re losing games and this is an area we’d love you to own’,” O’Connor said. “At the start, it wasn’t “hell yeah I want to be a finisher”. I was more I’d love to play in the ten spot. But again, the more I soaked up the environment and made it not about me, it was just what can I do for the team? “It sounds very simple but I don’t think I’ve really ever had that mindset, fully. “I have butchered it in the past off the bench, trying to do too much, overplaying.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/afl/robert-walls-didn-t-do-hot-takes-he-pioneered-footy-s-hard-take-20250515-p5lzlb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Robert Walls didn’t do hot takes. He pioneered footy’s hard take",
    "publish_date": "Fri, 16 May 2025 11:58:19 +1000",
    "category": "sports",
    "authors": [
      "Jake Niall"
    ],
    "text": "As a callow young journalist at the now defunct Herald, I recall our editors, who had Carlton affinities, bringing Wallsy in to write some columns in the 1990 season, the year after his brutal culling by the ruthless Blues. He wrote one about Collingwood, detouring into his experience of the Victoria Park cauldron, which he labelled the “most biased” and hostile crowd in the game. “Thank god for police protection,” he added pointedly. Loading In the 1990s, when Walls was finished up as coach of the Brisbane Bears, he wrote some preview-style pieces for The Age, whose then sports editor was impressed by Walls’ clarity of thought in concise, short sentences. “Footy doesn’t have a (Peter) Roebuck,” then sports editor Patrick Smithers told Walls, referencing Australian cricket’s most authoritive (ex-player) voice. “You’re good at this.” And so was launched a media career that was as innovative as his invention of “the huddle” and other set plays he pioneered as coach at Fitzroy and Carlton. Radio - mainly 3AW – and television gigs inevitably followed.\n\nThe columns would arrive by fax machine, carefully hand-written with a school teacher’s touch. Wallsy was never “ghosted” by an editor or journo, as per less literate footballers. An ex-champion who played under Wallsy – and loved him, as so many players and colleagues did – jestingly said on the day of his passing that some of his coaching methods would run into Occupational Health and Saety strife in these more regulated times (the same is true of other coaches). Consider how his disciplining of Bears player Shane Strempel – put in to the ring and pummeled by teammates – would be received in today’s environment. The same might be said of some of his hard takes. Wallsy essentially wrote that the West Coast 2006 premiership was tainted. He wrote of Tony Liberatore, who had felled Matthew Knights (whom Wallsy had coached), that if Libba had indeed split Knights’ head open, “then he has become a pathetic figure on the football field.” He scored a player zero out of 10 for a grand final performance.\n\nIn the televisual ring, his most celebrated confrontation was with Kevin Sheedy, which followed a spat on 3AW. Sheedy, who could mix jest and irreverence with an old back pocket’s spite, had quipped “not all the snipers were in Vietnam” in the ’70s, in a snipe at Walls. Sheedy accused Walls of “hiding” in Brisbane after his stint at Carlton. “See you on Monday,” Walls fired back. The volcanic radio exchange was followed the next Monday by Sheedy’s appearance on Seven’s Talking Footy, where Walls was a panelist alongside host Bruce McAvaney and this paper’s pioneering chief football writer Caroline Wilson. Robert Walls on air for Channel Ten with Stephen Quartermain. Credit: Getty Images David Barham, then the producer of Talking Footy and who became of Wallsy’s closest mates (and hired him to call at Ten), instructed McAvaney to do the introduction and let the current and ex-coaches let fly – as they did. Walls counter-punched – hard – by noting that Sheedy had been driving a Rolls-Royce at Essendon and didn’t know what it was like to get money from his own bank account to pay a player at a broke club, and so forth. The pair ended the program on more convivial terms, like a pair of boxers who had just finished the bout.\n\nIt was riveting television. Walls, as several media people have noted, played the media game as he had coached – hard but fair. His calls landed and even if they upset individuals and clubs, Wallsy had the commentator’s most crucial commodity – authority. If there is no exact analogue to Wallsy in today’s voluminous footy media, I would venture that his columns were the game’s answer to Nikki Savva’s now, in that they came from someone who had been inside the tent (Savva having worked for Peter Costello and John Howard), and who brought that insiders’ vantage and intimate knowledge, but opined without fear or favour. He also had a knack for reading the play in live broadcasts. Quartermain recalls how, in the 2004 game famed for James Hird hugging a spectator following the match-winning goal at Docklands (after Hird had a stunning last quarter), Wallsy had implored West Coast to surround and smother Hird if they wanted to hang on.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/politics/federal/australian-federal-election-2025-live-results-victoria-key-swing-seats-news-updates-start-time-liberal-labor-independent-teal-kooyong-goldstein-wills-bruce-zoe-daniel-tim-wilson-peter-khalil-samantha-ratnam-julian-hill-zahid-safi-monique-ryan-amelia-hamer-20250502-p5lw46.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victoria hot seats LIVE results: Tim Wilson’s lead in Goldstein narrows further; Kooyong gave us a full-blown political melodrama; the Victorian seats yet to be called",
    "publish_date": "Fri, 16 May 2025 11:58:16 +1000",
    "category": "finance",
    "authors": [
      "Rachael Dexter",
      "Charlotte Grieve",
      "Clay Lucas",
      "Cara Waters"
    ],
    "text": "Asked to reflect on the past six weeks covering Kooyong, my first instinct is to say: I feel like Amelia Hamer looks in that now-infamous photo with Peter Dutton (taken by this masthead’s James Brickwood) — exhausted, bewildered and slightly awed.\n\nThe battle between Monique Ryan — the 58-year-old former paediatric neurologist who unseated then-treasurer Josh Frydenberg in 2022 — and Amelia Hamer, the 31-year-old Oxford-educated grand-niece of former Victorian premier Sir Rupert Hamer, always promised intrigue.\n\nBut I didn’t expect this well-heeled patch of Melbourne’s east to deliver quite this much commotion – right up until Monday, when Hamer conceded and Ryan claimed victory for a second time.\n\nThe now infamous photo of Amelia Hamer (left) with Senator Jane Hume and then opposition leader Peter Dutton in Kooyong. Credit: James Brickwood\n\nEven before the campaign officially began, Kooyong was making headlines.\n\nRyan’s husband, Peter Jordan, was filmed taking a Hamer campaign sign from a nature strip in Camberwell. The footage was undeniably funny — and deeply embarrassing for Ryan, whose political brand is built on integrity.\n\nRyan and Jordan apologised quickly. Defenders noted the sign was technically illegally placed, but the image of “Pinching Pete” as the Liberals dubbed him – teal T-shirt peeking out from under his jacket as he scampered down the street – became meme fuel. One local pub even began selling stubby holders emblazoned with: “Monique, please DO NOT take this beer!”\n\nThe Liberals ran with the joke for the rest of the campaign.\n\nBut it wasn’t long before Hamer hit turbulence of her own. In the second week of the campaign I revealed she owned two investment properties – one in London and another in Canberra’s wealthiest suburb – despite publicly positioning herself as a renter who really understood the housing crisis.\n\nIt was a sloppy and obvious omission. Ryan’s social media whiz-kids, as well as satirical news sites, quickly generated memes about the generationally wealthy candidate cosplaying as a struggling renter.\n\nHamer never really directly addressed whether she had purposefully omitted her landlord status, instead trying to sidestep questions on it. “You can be renting and also own a property,” she said, citing conversations with locals about “the struggles of being a landlord” in Victoria dealing with land tax from the Allan government.\n\nThe Liberals hit back after Monique Ryan’s husband Peter Jordan was filmed removing one of Amelia Hamer’s campaign signs.\n\nMore of Hamer’s personal wealth was raked over after a Ryan campaign volunteer republished public court documents showing she was among the beneficiaries of a $20 million family trust — proof that dirt units come in all shapes and sizes.\n\nSoon after, the predictable graffiti on corflutes turned nastier: “Capitalists will die”, “I get off on poor suffering”, and “Communism will win” were spray-painted across Hamer’s face.\n\nAt times, it felt like Hamer was under strict orders from Liberal party HQ to keep a low profile.\n\nShe skipped out on at least three community candidate forums. She often did media appearances flanked by her old boss, Senator Jane Hume, who stepped in to answer curlier questions, which reinforced a perception that she couldn’t speak for herself.\n\nBut when I finally managed to interview her on camera, Hamer held her own. She was confident and articulate. The leash should’ve been loosened far earlier. Even forums perceived as hostile would have been worth her fronting up to make her party’s case.\n\nRyan also had media stumbles. On ABC’s Insiders, she flubbed a question about disclosing influencer payments, later clarifying she misunderstood. She also blanked a Sky News reporter trying to spring a live interview at pre-polling.\n\nAmelia Hamer and Monique Ryan at a Jewish community forum during the campaign. Credit: Justin McManus\n\nEach side tried to paint the other’s campaign as being full of grey-haired volunteers. However, while retirees abounded, both camps had plenty of younger supporters — including millennial campaign managers. That’s a good sign for democracy, especially for the Liberals after their worst ever national defeat.\n\nThe campaign did veer into childishness at times. Ryan took aim at the Liberal Party over a satirical social media post that depicted her as a scowling action figure in Barbie-style packaging, under the label: “MONIQUE RYAN – VOTES WITH THE GREENS 77% OF THE TIME.”\n\nBut most of the negative campaigning seemed to come from Liberal HQ — and there was a noticeable disconnect between that and Hamer’s own conduct. I never once heard Hamer reference Ryan’s voting record or go below the belt in public. Her pitch was more about neglected local issues and the disadvantages of not having a major party MP. She appeared uncomfortable with the signage wars being waged in her name — a conflict that escalated all the way to the Supreme Court in the final days of the campaign.\n\nLoading\n\nA funding vehicle behind the teal independents — Climate 200 — also created headaches, including for Ryan in Kooyong. I revealed that residents had received calls and texts as part of a “push-polling” effort conducted on behalf of the group, just moments after Ryan had appeared on live TV describing push-polling as “not ideal”.\n\nIt’s unclear how effective the Liberal Party’s central line of attack on Ryan — that she voted with the Greens in Parliament 77 per cent of the time — really was. Rusted-on Liberal supporters lapped it up, but for those who had already backed Ryan, it was hardly a shock. After all, “teal” was always supposed to be a blend of blue and green.\n\nStill, the claim clearly got under Ryan’s skin. She labelled the line as misinformation and hit back with a five-page pamphlet of her own, accusing the Liberals of spreading “egregious falsehoods”.\n\nShe pointed out she’d voted in favour of just 21 of 37 Greens motions — 56 per cent — slicing the same data in a different way.\n\nThe famous anti-Monique Ryan sign outside the Tower Hotel. Credit: Rachael Dexter\n\nWhile Ryan focused on her role pressuring the government on big-ticket items — the 20 per cent cut to HECS debts, advocating for 60-day medicine prescriptions, and improving the National Anti-Corruption Commission — Hamer went hard on hyper-local promises. All up, she pledged $14 million worth.\n\nThe Easter long weekend was the catalyst for a truly chaotic week on the trail in Kooyong. It kicked off when footage surfaced of a local surgeon — Professor Greg Malham — inexplicably filming himself tearing down and stomping on Monique Ryan corflutes, all while cracking jokes about disposing of a dead body and leaving his full number plate in view.\n\nThe video was widely condemned — not just by Ryan and Hamer, but also by domestic violence campaigners. Malham later self-reported to the medical regulator and was placed under investigation.\n\nThen came a candidates’ forum on refugee and asylum seeker policy, where an anti-lockdown activist attempted to hijack the discussion by ambushing Ryan with questions about her husband’s now-infamous sign theft. He filmed her reaction for social media, but was swiftly shut down by the event organiser, who was not having a bar of it.\n\nBut the week reached full chaos mode the following evening at what was meant to be a quiet event about public broadcasting at the Kew Library. Three protesters — whom Ryan later described as “right-wing nutbags” — gatecrashed the forum. I was the only journalist in the room to witness the bizarre scene unfold.\n\nTensions escalated when a female attendee, who was clearly distressed, tried to punch one of the agitators in the face.\n\nRyan herself waded in to break up the scuffle, physically intervening to stop things from boiling over before police arrived.\n\nThat chaotic week ended with a long-anticipated moment: Ryan and Hamer finally appeared on stage together for the first time in the campaign — at a Jewish community event under the watchful eye of Australian Federal Police. It was icy but civil.\n\nIn the final week of the campaign, fresh controversies emerged. The Age broke a story revealing that volunteers wearing Monique Ryan T-shirts had been filmed claiming a community organisation — one with historical links to the Chinese Communist Party’s foreign influence operations — had encouraged people to vote for the teal MP.\n\nAt the same time, our reporting revealed that Kooyong — along with other targeted electorates — had been flooded with campaign helpers from the Exclusive Brethren, a secretive Christian sect. These volunteers helped hand out how-to-vote cards and staff pre-poll booths, despite objecting to voting themselves.\n\nShadowy, right-wing third-party groups – Australians for Prosperity, Repeal the Teal, and Better Australia – flocked to pre-polling booths but mainly disappeared on election day itself. Their presence so rattled Ryan she launched a last-ditch fundraising campaign, trying to raise $20,000 for last-minute advertising to “cut through the noise, reach undecided voters, and tell them the truth”.\n\nThen came the signage furore outside a Kew pre-polling booth: a spat between Boroondara council and the Liberal Party that went on for days, complete with accusations of political interference, given the council’s number of teal councillors. It came to a head when council officers swooped in to confiscate 14 Liberal A-frame signs, which they crammed into the back of the Boroondara-branded hatchback.\n\nCouncil officers confiscated 14 signs at the Kew pre-poll voting booth. Credit: Rachael Dexter\n\nForty-eight hours out from election day, I found myself reporting from the Supreme Court, where eight lawyers — who were likely billing by the hour — argued over constitutional issues that would only apply for a single day. The Supreme Court ultimately sided with the Liberals, granting an injunction in their favour. The Liberals promptly celebrated their ideological win over the council, a fleeting victory.\n\nNeo-Nazis also made an unwelcome appearance when Joel Davis, from the National Socialist Network, showed up wearing a T-shirt mimicking Liberal Party branding while distributing fake and antisemitic pamphlets to voters – horrifying everyone. Davis was accompanied by men in costume beards and fake Orthodox Jewish attire, brandishing pamphlets that had been sent to Jewish communities in neighbouring electorates claiming the Liberals planned to “give the Jews everything they want”.\n\nHamer wasn’t short of Liberal Party elder help on the campaign trail, receiving support from Liberals of all stripes, including former premier Jeff Kennett, who made a grand appearance at her election night party. Her predecessor, Josh Frydenberg, was also spotted in the dying days of the campaign, handing out pamphlets at pre-polling.\n\nAnd then there was Opposition Leader Peter Dutton’s fleeting appearance at the Tower Hotel in Hawthorn East — a venue that became notorious for its vocal anti-Monique Ryan campaigning, complete with a massive anti-Ryan sign mounted on the pub (for which it would later be fined by the council).\n\nOpposition Leader Peter Dutton with Amelia Hamer at the Tower Hotel in the final days of the campaign. Credit: James Brickwood\n\nThis marked Dutton’s second visit to Kooyong, and it was fleeting. In a rather telling moment, the man who had hoped to become prime minister was prevented from answering any questions by the media by his staff. It was a brief yet revealing moment into the national campaign strategy.\n\nAs in 2022, so much of the Liberal Party’s story is entwined with the story of Kooyong. The machinations of this electorate are emblematic of the existential wrestle the party faces — and what it stands for in a modern Australia.\n\nIt felt eerie that Petro Georgiou, a former member for Kooyong under John Howard and known to many as the “conscience of the Liberal Party”, died during the campaign. As our special writer Tony Wright penned at the time, “Georgiou was a voice for diversity and considered a champion of Indigenous Australians, underdogs and outsiders”.\n\nIt was Ryan who reminded a local forum that Georgiou’s values now feel worlds apart from the politics of today — in both major parties.\n\n“Our politics has become meaner and smaller in the last two or three decades,” she said. “He was a man who demonstrated great personal integrity in the way that he fought for the rights of refugees.”\n\nHamer was adored by Liberal voters: I saw this first-hand at pre-polling. Whether it was the “Dutton factor” that ultimately held her back is up for debate. But the fact she came so close suggests green shoots for the party, if it can harness the kind of youth and energy Hamer brought to the campaign.\n\nJosh Frydenberg and Amelia Hamer with a pre-poll voter in Malvern. Credit: Rachael Dexter\n\nEven Hamer, though, admits you can’t fatten a pig on market day — “We talked a lot about getting Australia back on track, but the question is: back on track to what?” she said on 3AW last week, talking about her party’s slim policy offering.\n\nThere was fun and plenty of smiles to be had in the ’Yong — I want to give a shout-out to the campaign volunteers from all parties who let me spend time with them on the front line, complete with smiles, snacks and campaign intel. Greens candidate Jackie Carter and Labor’s Clive Crosby conducted themselves with humour and grace as enthusiastic participants in the whole spectacle despite it being a two-horse race.\n\nAfter a false start and an early crow from the media and Ryan herself, Ryan did claim Kooyong for a second term. Not by as much as in 2022, but she got there with what looks like at least 1000 votes – and looks to be the sole teal independent in Victoria.\n\nMonique Ryan claimed the seat of Kooyong on Monday afternoon. Credit: Eddie Jim\n\nHer victory reaffirms Kooyong’s transformation from a blue-ribbon certainty to a teal-tinged battleground, where even a redistribution, a $14 million funding blitz and a strong candidate couldn’t wrest the seat back for the Liberals this time. One imagines the fight will only be tougher again in three years.\n\nThe experience of covering Kooyong felt like being strapped into a speeding, swerving golf buggy — on a ride where the stakes were local and national, trivial and existential, hilarious and deeply serious, often all at once.\n\nKooyong didn’t just give us a contest. It gave us a full-blown political melodrama. And I, for one, need a nap.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-coalition-division-pm-heads-to-rome-roberts-smith-back-in-court-20250516-p5lzoh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Coalition division; PM heads to Rome; Roberts-Smith loses appeal",
    "publish_date": "Fri, 16 May 2025 11:52:27 +1000",
    "category": "finance",
    "authors": [
      "Ben Cubby"
    ],
    "text": "The federal government has asked the Fair Work Commission to deliver an “economically sustainable” mandated wage increase to low-income workers.\n\n“This will help around three million workers across the country, including cleaners, retail workers and early childhood educators,” Treasurer Jim Chalmers and Employment Minister Amanda Rishworth said in a press release.\n\nLoading\n\nIn a submission to the commission, the government sought an above-inflation pay increase for minimum wage workers. The minimum wage is currently $24.10 per hour.\n\nThe minimum wage has increased by $143 a week since the government came to office, and the median wage has increased by $206 per week, the government said in its release.\n\nThe Fair Work Commission is due to make a decision on wages next month.\n\n“This position is both economically responsible and fair,” the press release said. “It will ensure low paid workers can get ahead as inflation moderates and real wages continue to grow across the economy.”",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/world/north-america/baby-kj-was-born-with-a-rare-deadly-disease-a-one-of-a-kind-gene-tweak-healed-him-20250516-p5lzoe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Baby KJ was born with a rare, deadly disease. A one-of-a-kind gene tweak healed him",
    "publish_date": "Fri, 16 May 2025 11:51:15 +1000",
    "category": "lifestyle",
    "authors": [
      "Laura Ungar"
    ],
    "text": "A baby born with a rare and dangerous genetic disease is growing and thriving after getting an experimental gene-editing treatment made just for him.\n\nResearchers described the case in a new study, saying he’s among the first to be successfully treated with a custom therapy that seeks to fix a tiny but critical error in his genetic code that kills half of affected infants.\n\nKJ Muldoon after a follow-up dose of an experimental gene editing treatment at the Children’s Hospital of Philadelphia last month. Credit: AP\n\nThough it may be a while before similar personalised treatments are available for others, doctors hope the technology can someday help the millions left behind – even as genetic medicine has advanced – because their conditions are so rare.\n\n“This is the first step towards the use of gene-editing therapies to treat a wide variety of rare genetic disorders for which there are currently no definitive medical treatments,” said Dr Kiran Musunuru, a University of Pennsylvania gene-editing expert who co-authored the study published in the New England Journal of Medicine.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/daley-dilemmas-our-experts-select-their-nsw-teams-for-origin-20250515-p5lzdl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Daley dilemmas: Our experts select their NSW teams for Origin",
    "publish_date": "Fri, 16 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "Considered too loyal to players who didn’t repay the faith, Daley will officially name his side for the opening game against Queensland on Monday.\n\nOne of the criticisms of Laurie Daley during his first stint as NSW coach were his selections.\n\nSuch is the fullback talent available in the NRL at the moment, that several star No.1s are likely to be picked for the Blues out of position.\n\nThe main debate surrounds who will wear the No.1 jersey. Dylan Edwards is the incumbent and, despite the Panthers having a slow start to their title defence, has done little wrong this year.\n\nTedesco, meanwhile, is playing as well as ever. The Roosters captain is averaging 203 running metres per game (189 metres for Edwards) and currently sits equal third in the Dally M medal standings.\n\nTom Trbojevic, Latrell Mitchell and Ryan Papenhuyzen are other custodians pushing for NSW selection in other spots, but the shoot-out for the No.1 jersey is between Tedesco and Edwards.\n\nIt was a huge call from previous Blues coach Michael Maguire to drop Tedesco, and it would be an even bigger call from Daley to bring him back at Edwards’ expense.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/round-11-around-the-clubs-20250511-p5ly7j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Best suffers hamstring injury, out of Origin contention",
    "publish_date": "Fri, 16 May 2025 11:33:03 +1000",
    "category": "sports",
    "authors": [
      "Michael Chammas",
      "Robert Dillon",
      "Dan Walsh",
      "Adrian Proszenko"
    ],
    "text": "“Mr Payten has been reminded of his obligations under the NRL rules and code of conduct, as well as his general responsibility as a sporting leader to set an appropriate example to grassroots and junior participants across the broader rugby league community,” the statement read. “All rugby league participants are reminded to respect referees and match officials, who perform a vital and integral role within the game.” Payten was asked at last week’s post-match press conference, after his team’s thrilling golden-point draw with the Panthers, whether referees were reluctant to make tough calls in extra time. Cowboys coach Todd Payten. Credit: Getty He agreed, replying: “That’s what they’re paid to do, make the right call at the right time ... it was so frustrating.\n\n“We want consistency and we’re not getting it. “I’m confused about what’s a high shot, and what’s not. I’m sure everyone else is … I’ll talk to the NRL through the week about it and go through the right channels. “But it’s white noise. ‘Yeah, we got that wrong’, but no one is held accountable for it. “If it’s my player making error after error, or a couple of howlers, then there’s a fair chance he’s not in the team.” Payten has been a regular critic of match officials over the years. In his rookie year as a head coach, at the Warriors in 2020, he said it “infuriates me, embarrasses me as a coach that we are still having this [refereeing errors] happen in our game”.\n\nThen in 2022, he claimed high-profile teams and players “get the benefit of the doubt too often” in terms of 50-50 calls. He was touted as the next SBW. Could he be heading for the Tigers? Wests Tigers have emerged as potential contenders for the signature of off-contract Newcastle forward Kai Pearce-Paul. The England international, who has made 29 NRL appearances for the Knights, was compared to Sonny Bill Williams when he first arrived from Super League, and although he has shown glimpses of his potential during his time in the Hunter, he has not been as dominant as he was in the UK. Knights forward Kai Pearce-Paul. Credit: Getty Images\n\nThe 198-centimetre, 108-kilogram back-rower, who is unlikely to be re-signed by the Knights, is keen on a new start and several NRL clubs have expressed interest, most notably the Tigers. As yet, no deal has been struck but if the parties can come to terms for an immediate switch – rather than Pearce-Paul arriving at the end of the season – it would free up the money Newcastle need to immediately bring out-of-favour Rooster Dom Young back to the club. Young is contracted to the Roosters until the end of 2027, but the club is at loggerheads with the Knights over whether they should pay any of the winger’s freight. Meanwhile, the Tigers have lost in-form prop Fonua Pole for at least four to five weeks after he suffered an MCL injury in Sunday’s 64-0 thrashing in Melbourne. Pole has been one of the Tigers’ best performers each week and will leave a considerable void up front, particularly if front row partner Terrell May is handed a NSW Origin debut by Laurie Daley.\n\nThe Tigers host the Rabbitohs on Sunday night, with Daley and the NSW hierarchy weighing up whether to name his Origin I squad after full-time or wait until Monday morning. The Tigers have the bye in round 12 and it is hoped rising young half Latu Fainu (thumb) and winger Jeral Skelton (hamstring) will be able to return the following week against North Queensland. Robinson slams Knights over Young negotiations Sydney Roosters coach Trent Robinson is preparing to farewell Brandon Smith but has cast doubt on Dominic Young’s proposed return to Newcastle by firing a broadside at Knights officials. Robinson said on Monday that Smith was undergoing a medical at South Sydney and the Kiwi hooker’s mid-season transfer to the Rabbitohs “should get sorted out today”.\n\nNewcastle’s hopes of enticing Young back up the freeway, however, appear far less promising, after Robinson took the Knights to task for allegedly asking the Roosters to not only release the 23-year-old from the remainder of his contract, but also to pay him out for the rest of this season. Young is barely 18 months into a four-year deal and, unless the Knights can come back with a revised offer, Robinson said the Roosters were content to honour his contract. Asked if the proposed deal could fall through, Robinson replied: “Yeah, unless things change from their end. “I think they’re trying to bluff us into it, but we didn’t want it to happen. We didn’t instigate any of this. Anyway, that’s done.\n\n“I think I’ve been pretty clear in our stance and how it went down. So it’s just get back to work, let’s keep playing, and get back to Dom playing his best footy and being in a place for selection.” Robinson said reports last week that the Roosters were trying to move Young on, to free up salary cap space, were incorrect. He said the club had received an approach from Newcastle, with whom Young started his NRL career, scoring 43 tries in 51 games before his move to Bondi Junction. Dominic Young won’t be joining the Knights unless the Roosters agree to release him. Credit: Getty Images “The way it was put out there was as if we were trying to push him out, which wasn’t the case,” Robinson said. “Newcastle rang us – obviously having talked to his manager beforehand when he got dropped, to try and get him out – and we said yes ... then they’ve backtracked at the end of the week and today, so that’s really annoying.\n\n“If you ask for something, you’ve prepared it, then you stick by it. And they haven’t done that, and it’s thrown Dom in a spin, and us all this week, when it wasn’t our doing. “So it’s pretty annoying … it’s been pitched one way, and then they’ve pivoted.” Robinson said the sticking point was that the Knights asked the Roosters to pay out the balance of Young’s contract for this season, estimated to be worth about $200,000. “They want us to release him, but us to pay money for it, when we weren’t even thinking about releasing him,” Robinson said. “In what world does that happen?” Brandon Smith is on his way out of Bondi. Credit: Getty Images\n\nKnights chief executive Philip Gardner declined to respond to Robinson’s comments, saying: “We have more class than that.” Young was dropped after the Roosters’ round seven loss to Penrith and played NSW Cup on Sunday, scoring a try. Robinson said former Wallaby Mark Nawaqanitawase had leapfrogged Young based on his form this season, but that could change. “It’s just I thought Mark was outplaying him,” Robinson said. “Really simple. It happens every week in sport around the world. It’s quite simple. He’s a really good player. He’s an NRL player. He’s a starting NRL player. But Mark was playing slightly better, and you make that choice.” Loading\n\nIn contrast to the Young imbroglio, Robinson said the transfer of Smith to arch-rivals South Sydney was likely to be “pretty simple from both ends”. “I think both sides have handled it pretty cleanly and quite well, which would be disappointing for the gossip columnists to hear, but it was pretty clean, all of that,” he said. “And then, yeah, the other one [Young] ... it’s pretty rare. I haven’t seen too many go like that, to be honest.” Robinson said the Roosters were still interested in signing departing Manly skipper Daly Cherry-Evans, but have not yet started negotiating with his management. Trainers under scrutiny for wetting ball as Cowboys coach rages at referees\n\nBy Dan Walsh The NRL will on Monday review reports of both Penrith and North Queensland trainers spraying water on the ball before golden-point kick-offs as Cowboys coach Todd Payten prepares to lodge a formal complaint over several calls in his side’s 30-all draw with Penrith. Both Payten and Penrith opposite Ivan Cleary were incensed with the officiating in Saturday’s 90-minute thriller in Townsville, with the North Queensland mentor struggling to hold himself back from swearing as he critiqued contentious calls. The NRL football department is also in possession of footage shot from the stands in which Penrith’s football manager Shane Elford – who doubles as their blue-shirt trainer on game day – sprays water on the ball before the Panthers kicked off golden point. Cowboys halfback Jake Clifford caught the ball without incident.\n\nPayten did not respond to calls on Sunday but told The Daily Telegraph that Elford “did it before every kickoff. We noticed it in the [coaching] box”. North Queensland’s trainer also sprayed water on the ball before Clifford prepared to kick off the second half of extra-time, but referee Todd Smith picked up on it. Smith could be heard on the broadcast calling for an extra ball and explaining shortly afterwards that “he squirted the ball”. The NRL goes over all football matters as part of its weekly Monday reviews. Payten raised multiple referee decisions in his post-match press conference, taking specific issue with Cowboys winger Murray Taulagi being penalised for a high shot on Liam Henry, who slipped into the contact.\n\nThe Panthers scored from the set that followed. Payten was incensed that Cowboys centre Viliami Vailea was not awarded a penalty minutes later after being flattened by Tom Jenkins in cover defence. Loading The collision left Vailea in pain on the ground. “Murray Taulagi got a penalty where a bloke fell into his chest and then Viliami Vailea, less than five minutes later, got his head taken off,” Payten said.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/culture/theatre/picture-of-misery-opera-australia-posts-10-million-loss-as-audiences-hit-a-cliff-20250515-p5lzk2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Picture of misery’: Opera Australia posts $10 million loss as audiences hit a cliff",
    "publish_date": "Fri, 16 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Linda Morris",
      "Nick Galvin"
    ],
    "text": "Opera Australia has plunged deeper into financial crisis, posting a $10 million operating deficit as chair Rod Sims defended its worst results since the pandemic.\n\nAustralia’s largest performing arts company was forced to draw down on its emergency capital fund to offset its losses after its Sydney winter season and its much-hyped run of Sunset Boulevard failed to meet box office forecasts.\n\nSarah Brightman in the underwhelming production of Sunset Boulevard. Credit: Justin McManus\n\nMelbourne performances of the Andrew Lloyd Webber musical last year were blighted by poor reviews, unsold seats and long absences by its lead, Sarah Brightman, due to injury.\n\nIn addition, OA blamed the closure of the company’s State Theatre home in Melbourne and the need to perform in other venues for the hit to its bottom line.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/national/nsw/they-thought-they-had-bought-land-to-build-their-dream-homes-it-all-ended-up-in-court-20250516-p5lzox.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "They thought they had bought land to build their dream homes. It all ended up in court",
    "publish_date": "Fri, 16 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Neil Breen"
    ],
    "text": "Purchasers of 154 blocks of land at Marsden Park in Sydney’s north-west will receive $100,000 each in compensation, as well as have their deposits and stamp duty refunded, under a settlement offer in a multimillion-dollar class action.\n\nIn 2020 and 2021, at the height of COVID-19, the buyers, predominantly families, signed contracts worth between $600,000 and $700,000 per block at Clydesdale Estate, nestled off Richmond Road.\n\nEach block was secured with a 10 per cent down payment, plus full stamp duty of about $30,000.\n\nPurchasers bought the blocks of land from Chinese-owned developer Boyuan Holdings Limited (BHL) and its sister company Cyan Stone, atop a web of holding companies.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/goodfood/tips-and-advice/how-to-cook-with-less-salt-without-sacrificing-flavour-20250429-p5lv06.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How to cook with less salt without sacrificing flavour",
    "publish_date": "Fri, 16 May 2025 11:23:46 +1000",
    "category": "finance",
    "authors": [
      "Becky Krystal"
    ],
    "text": "Advertisement\n\nTips & adviceHealthy eating How to cook with less salt without sacrificing flavour From low-sodium alternatives to being more mindful about when to season your cooking, these simple tips will help you keep the flavour without the health risks. Becky Krystal May 16, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nOf all the various dietary needs, limiting the amount of sodium in recipes is among the most common requests. The good news is that, if you’re eating mostly home-cooked food, you’re already well on your way to reducing your salt intake, as around 75 per cent of dietary sodium comes from packaged or prepared food, according to Dietitians Australia. Photo: Supplied The next step is to be mindful about how you’re making that from-scratch fare. Reducing (or eliminating, if necessary) salt is about more than refraining from grabbing that shaker, though. Beginning with your trip to the grocery store and up to the point you season your food at the end of cooking, there are plenty of opportunities throughout the process that can help you be smarter about salt. Here are a few tips. Look for tinned tomatoes that state low-salt on the label. Supplied\n\nAdvertisement\n\nBuy no-salt-added products Standard pantry ingredients can contain sodium — sometimes large amounts — that you might not know about unless you scrutinise the labels. Common culprits include canned tomatoes, broth or stock, canned beans, tomato paste, and other canned vegetables. No-salt-added versions of these types of products, however, are readily available. Choose reduced-sodium options No-salt-added isn’t the only option for store-bought staples. Plenty of ingredients are available in reduced- or less-sodium versions. The best example is soy sauce. My standard bottle is always one with less sodium, and I have never found the seasoning lacking. You can also find less-sodium options for jarred pasta sauces, broth and stock, cheese, canned beans, and salsa, among other items. Soy sauce is loaded with salt so try to opt for low-salt varieties when possible. Supplied\n\nAdvertisement\n\nMake your own pantry items If you’re not starting with no-salt-added canned beans, fear not. A quick rinse can make a significant difference. Cook’s Illustrated commissioned a lab to see how much sodium you can eliminate simply by rinsing canned beans. Looking at cans of store-bought cannellini, pinto and black beans, plus chickpeas, the lab found that draining and rinsing them cut the sodium by about 100 milligrams per half-cup serving, roughly 25 per cent. Add salt smartly Depending on your own health situation, cutting back on sodium may not mean not using salt ever. So focus on getting more bang for your buck, flavour-wise. As Samin Nosrat says in her book Salt, Fat, Acid, Heat it matters when you use salt.\n\n\n\n“Add it in the right amount, at the right time, in the right form. A smaller amount of salt applied while cooking will often do more to improve flavour than a larger amount added at the table.” So, salt your meat in advance, sprinkle some on your vegetables before roasting, and add it to the water in which you’ll be boiling vegetables, pasta and grains. That way you’re giving the salt time to work and season from within. Shichimi togarashi can be used to add flavour to ingredients like avocado. William Meppem\n\nAdvertisement\n\nTry other assertive flavours Nothing is an exact replacement for salt. (Some people find alternatives such as potassium chloride too metallic, and it’s best used in consultation with a physician since it can be problematic in the presence of certain medical conditions.) Still, you can experiment with other flavours, either in conjunction with less salt or in place of it. Consider citrus juice or zest, vinegar, herbs and spices. Especially at the end of cooking, a hit of vinegar or lemon juice can brighten and sharpen a dish when you might otherwise add salt. Good spices or seasoning blends that help perk up a completed dish Sumac\n\nZa’atar. Some blends include salt, so read the label.\n\nEverything spice. You can make your own and leave out the salt.\n\nToasted sesame seeds\n\nShichimi togarashi\n\nCrushed red pepper flakes The Washington Post\n\nAdvertisement\n\nThe best recipes from Australia's leading chefs straight to your inbox. Sign up\n\nSave Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Healthy eating\n\nDiet",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/business/companies/operation-elon-the-aussie-who-made-820m-selling-her-tesla-shares-20250514-p5lz4c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Operation Elon: The Aussie who made $820m selling her Tesla shares",
    "publish_date": "Fri, 16 May 2025 11:17:47 +1000",
    "category": "finance",
    "authors": [
      "Colin Kruger"
    ],
    "text": "Let’s start with a different question: why is this respected Silicon Valley veteran selling? Who would not want to own shares in a company that – as its return to the trillion-dollar valuation club demonstrates – seems to be protected from any sense of economic logic. Sales continued to plunge across its biggest European markets last month, despite a long-awaited update of its most popular car. Its trillion-dollar valuation only makes sense if you look at it as a meme stock – a company that suddenly goes viral on social media and its shares skyrocket for no clear reason. While leaving Tesla on self-drive mode, Musk found time to support extreme right-wing causes across Europe, which triggered a plunge in sales on the Continent, as well as the Trump administration, which is waging a global trade war that is also costing Tesla dearly.\n\nAnd when reports emerged that Tesla’s directors were searching for a potential replacement for Musk – a very sensible decision for any board in the circumstances – Denholm made a public statement declaring the report to be “absolutely false” and made it clear that Tesla and its founder Musk were joined at the hip. A protester stands outside a Tesla showroom in West London. Credit: Getty Images “The CEO of Tesla is Elon Musk and the board is highly confident in his ability to continue executing on the exciting growth plan ahead,” she said in a tweet on his social media platform, X. It is no wonder this board was slammed by a US court judge over a $US56 billion pay packet for Musk. It was accused of acting as enabler for the company founder, not as an overseer for investors. But the rules are different at Tesla.\n\nIts trillion-dollar valuation only makes sense if you look at it as a meme stock – a company that suddenly goes viral on social media and its shares skyrocket for no clear reason. And Musk is its meme. Denholm seems to get this. Any valuation currently subscribed to Tesla left reality a long time ago, and the only tether with valuations on planet Earth is its mercurial founder. Tesla’s valuation was extraordinary enough when it was merely worth more than every other carmaker on the planet combined. That was based on the idea that it had too much of a lead on e-vehicles – the car of the future – for anyone else to catch it. While US and European sales reflect repugnance for Musk’s politics, the fall-off in China reflects a far more sobering reality: Tesla is way behind its multitude of Chinese rivals on every significant feature: price, recharging times and autonomous driving features which are now offered free on some Chinese cars. The Nio EP9 on display at the Guangzhou Auto Show in China late last year. China is taking the lead on e-vehicle development. Credit: Bloomberg\n\nKeep in mind that the future earnings that underpin its current $US1.1 trillion valuation are expected to shrink if his Republican buddies successfully gut electric vehicle subsidies to the tune of billions of dollars. And the price investors pay for each dollar of Tesla’s profit far exceeds dominant tech rivals such as Nvidia, Apple and Microsoft. Cars clearly don’t drive its valuation now, it is the market perception of Musk’s ability to morph the company into a dominant force in AI, robotaxis and humanoid robots. That is a much harder argument to make in the current environment. Any valuation currently subscribed to Tesla left reality a long time ago, and the only tether with valuations on planet Earth is its mercurial founder. You don’t need to go outside the US borders to see what significant competition Tesla faces on the AI front. And China appears to be streets ahead when it comes to autonomous driving, robotaxis and is already talking about AI-aided robots as its next workforce.\n\nIt underlines that Denholm’s one job at Tesla is to keep Musk interested enough to ensure he gives the company a decent crack at the impossible task before it. The issue is not whether Tesla is a valuable company, it is whether it is worth anything remotely close to the current market valuation. It gives an interesting context to Denholm’s massive stock sale, which has left her with shares worth about $US27 million. James Murdoch, the younger son of Rupert, is another high-profile shareholder who has sold millions of dollars worth of Tesla stocks. Credit: Bloomberg Her Tesla stake is almost certainly worth less than her trophy homes in Sydney and nearby Whale Beach where she reportedly tried, and failed, to get approval for a lift to be installed that would deliver her to the sun-kissed sand.\n\nIf she isn’t willing to hold shares she paid almost nothing for, other investors should take heed. And you only need to look at Musk’s focus to see why. His trip to the Middle East with Trump yielded the news that Saudi Arabia had authorised the use of SpaceX’s Starlink satellite communications service. Loading Unlike e-vehicles, robotaxis, AI and dancing robots, Musk’s SpaceX totally dominates the space sector with thousands of low orbit, cost-efficient, satellites. Unlike Tesla, SpaceX is also privately owned and considered the future of his considerable wealth.",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://au.news.yahoo.com/live/unbelievable-scenes-after-trumps-tariff-pause-highway-chaos-after-wind-turbine-hits-bridge-american-expat-riles-aussies-010053903.html",
    "title": "'Unbelievable' scenes after Trump's tariff pause, highway chaos after wind turbine hits bridge, American expat riles Aussies",
    "publish_date": "2025-05-16T01:00:53Z",
    "category": "finance",
    "authors": [
      "Tom Flanagan",
      "Australian Associated Press"
    ],
    "text": "A mad scramble is underway as US businesses look to capitalise on Donald Trump's agreement to temporarily pause tariffs with China.\n\nBusinesses are doing what they can to get in as many products from China in a bid to avoid any extra costs potentially beyond the 90-day freeze amid the US president's trade war with China.\n\nAnd Chinese suppliers have now revealed the frenzy that's unfolded on their side.\n\n\"I knew it would come. But it still kind of overwhelmed me when it finally came,\" the general manager of a homeware business told the Global Times.\n\n\"This single day sales figure equates to half a month of sales revenue in usual times.\"\n\nAnd he revealed how desperately US customers want to get goods over and what measures they'll go to to get them.\n\n\"What is even more unbelievable is some clients are asking for air freight delivery! This has never happened before,\" he said, revealing customers normally opt for their heavy goods to be sent by ship.\n\nGao Lingyun, a researcher at the Chinese Academy of Social Sciences, told the state media outlet the surge showed the value of Chinese goods and highlighted their \"irreplaceable quality\".",
    "source": "Yahoo",
    "cluster_id": 40
  }
]