[
    {
        "url": "https://www.9news.com.au/national/live-updates-victorian-bushfires-and-cyclone-koji-forms/785b1734-98e7-42a4-a460-d2e2a0da2441",
        "title": "Ten major bushfires, 15 emergency warnings remain as toll becomes clearer",
        "publish_date": "Sun, 11 Jan 2026 00:46:34 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Welcome to our live coverage of two major events in Australia today as devastating bushfires b﻿urn in Victoria and a tropical cyclone hits Queensland.\n\nEx-Tropical Cyclone Koji has crossed the Queensland coast and is now a tropical low. Meanwhile, there are still a number of out-of-control bushfires raging in Victoria.\n\nYou can follow all the latest developments below.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/victoria-bushfires-firefighter-brigade-commander-tyrone-rice-loses-harcourt-home/718c8e02-4f8c-4ece-896d-529653115e8d",
        "title": "'It was too late': Firefighter loses home while defending neighbouring properties",
        "publish_date": "Sat, 10 Jan 2026 07:57:32 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "A firefighter brigade commander and his brother are coming to terms with losing their homes, after a bushfire ﻿tore through their small town in Victoria's Central Highlands.\n\nTyrone Rice has worked with the County Fire Authority (CFA) for 48 years and was fighting one of the dozens of bushfires ravaging the state when he received news his own Harcourt home was in the firing line.\n\n\"It was too late, it was gone, it was already on fire,\" he told 9News.\n\nTyrone Rice lost his home while fighting a bushfire. (Nine)\n\nRice is ﻿now grappling with the loss.\n\n\"﻿Bit like a kick in the guts, but I'm not the first person to go through it, and I won't be the last,\" he said.\n\nAcross the road, ﻿his brother is facing the same devastation.\n\nRetirees Ray and Loretta Rice have lived in the town for 19 years and had their forever home demolished by the fire.\n\nNow, only charred brick remains. ﻿\n\n\"Probably hasn't hit me yet,\" Ray said.\n\n\"Our retirement has all gone up in smoke... You can rebuild houses. I've been broke before, so we start again, but 79 is a bit old to be starting again.\"\n\n\"This is all ours... was [ours],\" Loretta said, becoming visibly emotional.\n\n﻿ READ MORE: ﻿ Hundreds of firefighters on standby as Sydney tops 40 degrees\n\nRetirees Ray and Loretta Rice lost their forever home. (Nine)\n\nThe retirees' now have to start again. (Nine)\n\nThe fire swept through yesterday afternoon, with its speed catching locals by surprise.\n\nFor those who stayed behind, last night was a reprieve as temperatures dropped.\n\nThis morning, locals were able to see the extent of the damage after the fire burned through 30,000 hectares of land, destroying 50 structures, including homes and farms. ﻿\n\nVictorian Premier Jacinta Allan acknowledged the town's devastation.\n\n\"﻿This is a fabulous small community that has been hit really hard,\" she said.\n\nAustralians have poured their support behind the community to help them recover from their losses. ﻿\n\nTyrone said the response has been overwhelming. ﻿\n\n\"In fact, I haven't replied to them all. There's just too many,\" he said. ﻿\n\nTyrone has received support from the community. (Nine)\n\nOther frontline responders also lose their homes ﻿\n\nIn Alexandra, ﻿volunteer firefighter Michael Harper spent more than 20 hours on the frontline saving other people's homes.\n\nDuring that time, he lost his home of 10 years to a blaze.\n\nMeanwhile, the Mayor of Murrindindi, Damien Gallagher, who was part of the strike team fighting the fire, was also told his house had been destroyed.\n\n\"The intensity of the heat is incredible,\" he said.\n\n\"And with my crew, the guys on the back did an incredible job in some tough situations where they couldn't breathe.\"\n\nBut he came back to find a miracle - his home still standing.\n\n\"We really need to pour our hearts out to the community members, many of whom are coming home to no home,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/fa-cup-champions-crystal-place-beaten-by-macclesfield/106217706",
        "title": "Sixth-tier minnow Macclesfield ends Crystal Palace's FA Cup defence",
        "publish_date": "Sun, 11 Jan 2026 01:37:39 +0000",
        "category": "sports",
        "authors": [],
        "text": "Macclesfield has delivered one of the biggest upsets in FA Cup history, stunning defending champion Crystal Palace 2-1 in a third-round thriller.\n\nSixth-tier Macclesfield is the first non-league team to eliminate the FA Cup holders since Crystal Palace knocked out Wolverhampton Wanderers in the 1908-09 first round.\n\nArsenal was the last holder to go out in the third round, in 2018.\n\nPaul Dawson and Isaac Buckley-Ricketts struck in each half as Macclesfield — coached by Wayne Rooney's younger brother John — bridged a gap of 117 places in England's football pyramid.\n\n\"I can't believe it, we never thought we would be in this position,\" John Rooney told the BBC.\n\n\"We were incredible from the first minute. I thought we were deserved winners. I couldn't be any prouder of the lads.\"\n\nDawson rose to head home a curled free kick from Luke Duffy in the 43rd minute.\n\nWrexham defeats Forest in FA Cup Wrexham defeats Nottingham Forest on penalties to advance to the fourth round of the FA Cup.\n\nBuckley-Ricketts doubled the lead in the 60th minute when he twisted his body to wrong-foot Palace goalkeeper Walter Benitez in front of a delirious crowd at Moss Rose, which hosted an under-9s practice earlier in the day.\n\nPalace's Yeremy Pino scored with a stunning free kick in the 90th minute but Macclesfield hung on to win.\n\nThe victory was the latest chapter in a remarkable rise for Macclesfield, which was expelled from the National League five years ago, because of substantial debts.\n\nThe club was purchased by local businessman Robert Smethurst and Macclesfield entered the ninth tier in 2021-22 and has since won three promotions in four seasons.\n\nMacclesfield was also playing with heavy hearts after 21-year-old forward Ethan McLeod died in a car accident while travelling back from an away match last month.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/grateful-dead-founding-member-bob-weir-dies-at-78/106217686",
        "title": "Grateful Dead founding member Bob Weir dies at 78",
        "publish_date": "Sun, 11 Jan 2026 01:12:08 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Bob Weir, guitarist, singer and founding member of the Grateful Dead, has died at age 78.\n\nWeir's death was announced on Saturday in a statement on his Instagram page.\n\n\"It is with profound sadness that we share the passing of Bobby Weir,\" the statement said.\n\n\"He transitioned peacefully, surrounded by loved ones, after courageously beating cancer as only Bobby could. Unfortunately, he succumbed to underlying lung issues.\"\n\nWeir joined the Grateful Dead — originally the Warlocks — in 1965 in San Francisco at age 17.\n\nMickey Hart, Phil Lesh, Jerry Garcia, Brent Mydland, Bill Kreutzmann and Bob Weir were all members of the Grateful Dead. (AP: Supplied)\n\nHe spent the next 30 years playing on endless tours with the Grateful Dead alongside fellow singer and guitarist Jerry Garcia, who died in 1995.\n\nWeir wrote or co-wrote and sang lead vocals on Dead classics, including Sugar Magnolia, One More Saturday Night and Mexicali Blues.\n\nIn the decades since, he kept playing with other projects, including Dead and Company.\n\nLoading Instagram content\n\n\"For over sixty years, Bobby took to the road,\" the Instagram statement said.\n\n\"A guitarist, vocalist, storyteller, and founding member of the Grateful Dead. Bobby will forever be a guiding force whose unique artistry reshaped American music.\"\n\nWeir's death leaves drummer Bill Kreutzmann as the only surviving original member. Founding bassist Phil Lesh died in 2024.\n\nDead and Company played a series of concerts for the Grateful Dead's 60th anniversary in July at Golden Gate Park in San Francisco.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/live-updates-tropical-cyclone-koji-north-queensland-bom/106212666",
        "title": "Live: Ex-Cyclone Koji crosses coast, bringing 150mm of rain in 2 hours",
        "publish_date": "Sun, 11 Jan 2026 00:59:23 +0000",
        "category": "finance",
        "authors": [
            "Lottie Twyford",
            "Claudia Williams",
            "Kym Agius"
        ],
        "text": "Whitsundays Mayor Ry Collins told the ABC conditions were still \"wet and wild\" in the area on Sunday morning after a tough night with heavy rainfall and strong winds.\n\n\"We've seen quite a lot of damage ... trees down and those sorts of things,\" he said.\n\nLike many residents, Cr Collins has lost power at his home. He spoke to ABC News from his car, where he says a mobile phone booster was helping him secure signal.\n\n\"We do have some minor telecommunications issues as well, but yeah that power is definitely something we want to get rectified soon,\" he explained.\n\nCr Collins said crews would begin working to restore power as soon as it was safe to do so.\n\nAs of midday, Ergon says about 4,000 people have lost power in the Whitsundays, as have about 9,500 households in the Mackay area.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/youth-rodeo-mentoring-western-australia-cowboys-cowgirls/106014112",
        "title": "From regional WA to the USA: Young rodeo hopefuls join mentoring program",
        "publish_date": "Sun, 11 Jan 2026 00:05:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "Western Australia's brightest young cowboys and cowgirls are being flown across the world to learn from champions of the sport, part of an industry youth program developed by a Wheatbelt couple.\n\nFor years, WA rodeo royalty Mark and Jo Kestel have informally sent dozens of junior riders to America for advanced training competition opportunities, often at their own expense.\n\nMr Kestel, who grew up in the Midwest town of Carnamah 280 kilometres from Perth, said he got into the sport later in life and wanted to create more opportunities for young riders to develop their skills.\n\nJo and Mark Kestel host 12 rodeos across regional WA each year. (ABC Midwest and Wheatbelt: Eliza Bidstrup.)\n\n\"I've been rodeoing most of my life but I didn't get onto my first bull until I was 28 so I was a bit of a late starter,\" Mr Kestel said.\n\n\" You can't deny that there's something addictive about the adrenaline and endorphin rush you get riding rodeo. \"\n\nWanting to share that rush with the next generation, the Kestels launched the Double Barrel Entertainment Youth Rodeo Development program in August.\n\nA group of six WA riders have been selected to travel to the United States in 2026 to train with US-based world champions and compete in international rodeos, sponsored and supported by the Kestels.\n\nMr Kestel said training for young people has changed dramatically over the years.\n\nMark Kestel has been bringing rodeos to regional towns around WA for decades. (ABC Midwest and Wheatbelt: Eliza Bidstrup.)\n\n\"Back in the day they used to have cowboy camps where they would live there and train twice a week but those days are gone now,\" he said.\n\n\" WA has an incredible depth of talent in our junior cowboys and cowgirls and my wife and I wanted to make sure they got every opportunity available to them. \"\n\nOne of those talented up-and-comers supported by the program is 14-year-old Aja Tito from Karratha.\n\nAja Tito trained under rodeo veterans while overseas. (ABC Pilbara: Kimberley Putland)\n\nShe has already claimed the top spot in breakaway roping – a timed event where a mounted rider lassos a calf around the neck and stops the clock.\n\nShe has also taken out the state title of All Around Cowgirl only 2 years into rodeoing.\n\nMs Tito credited her achievements to the mentoring she has received from those in the sport, including during her trip to the US earlier in the year.\n\n\"Being able to travel across the world has really been the best way to open up my eyes to what is possible,\" she said.\n\nDuring her time in the US as part of the mentoring program, she trained under 23-time Women's Professional Rodeo Association World Champion, Jackie Crawford.\n\n14-year-old Aja Tito has taken out state titles for rodeoing. (Photo: Susan Photography.)\n\n\"Working with Jackie I got to understand how to change my swing to make it easier for myself, and how to work my horse to a higher level,\" Ms Tito said.\n\n\"Jackie is a legend of the sport and the things I learnt from her have helped me get to number one.\n\n\"Every single one of the kids who have been sent over to the US have improved so much after going over, with some even taking out titles while over there.\"\n\nMs Tito will travel to Tamworth to compete in the finals for breakaway and the title All Round Cowgirl, and hopes to return to the US in 2027.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/busy-beaches-southern-wa/106211286",
        "title": "WA towns look to tackle overtourism as 'crazy' crowds pack car parks, beaches",
        "publish_date": "Sat, 10 Jan 2026 23:29:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "As Western Australian tourist towns experience an influx of summer visitors, some locals are worried their home towns could become too crowded unless visitor numbers are controlled at attractions and beaches.\n\nAt one of the South West's biggest attractions, the Busselton Jetty, visitation has grown by more than 60 per cent over the past decade.\n\nAs many as 10,000 people visited the jetty between Christmas and New Year's Day.\n\nEvery year the Busselton Jetty swim attracts thousands of people to the region's biggest attraction. (Supplied: Abby Murray Photography)\n\nStaff have been looking at ways to avoid overtourism in the future.\n\nBusselton Jetty CEO Lisa Shreeve said she was conscious of keeping the place 'special'.\n\n\"When you go to places around the world like the Trevi Fountain and you see 10,000 people standing there, it really impacts your experience if you have to be so congested,\" she said\n\n\" The Busselton Jetty is special and we don't want to lose that. \"\n\nLisa Shreeve says she does not want to see the attraction become as busy as places like the Trevi Fountain in Italy. (ABC South West WA: Jacqueline Lynch)\n\nMs Shreeve said the team would consider limiting the number of people on tours and other ways to spread out visitation.\n\n\" I don't think we would have to cap walk tickets at this stage but we definitely have to cap underwater observatory tickets and train tickets. \"\n\nStaff at the Busselton Jetty are looking at ways to avoid overtourism, including caps on people taking its tours. (ABC South West WA: Jacqueline Lynch)\n\n'Crazy' Dunsborough tourism\n\nIn the neighbouring town of Dunsborough, the chair of the local reference group said he wanted the town's visitor numbers capped by limiting accommodation spots.\n\nJeff Forrest has seen the beaches around his hometown become busier over the decades. (ABC South West WA: Jacqueline Lynch)\n\nJeff Forrest has lived in Dunsborough for almost 40 years and said he had seen local beaches become increasingly busy.\n\n\"Every year we see something crazy,\" he said.\n\n\" There has been times where on the coast you can't get a car park at all, not even on the side of the road. \"\n\nAt peak times in can be difficult to find a car park at places like Meelup Beach. (ABC South West WA: Jacqueline Lynch)\n\n\"We welcome tourists, that's important, but if we're not careful overtourism will actually destroy the character, the amenity, the natural environment, the beauty of the area that we've got to sell.\"\n\nHe said he was worried the region was reaching its limit.\n\n\"How many sheep can you put in a paddock before you ruin the paddock,\" he said\n\n\"It's about working out what the real carrying capacity of the area is and then finding ways to manage and restrict the numbers that come here.\"\n\nThere are concerns extra people and cars are putting pressure on the natural environment. (ABC South West WA: Jacqueline Lynch)\n\nSlice of paradise for everyone\n\nAt Meelup Beach many visitors were not keen on the idea of capping tourists to Dunsborough.\n\nKalia and Matt Alessi say they are happy to share the beach, which is far less crowded than coastal areas in Sydney. (ABC South West WA: Jacqueline Lynch)\n\nKalia and Matt Alessi have lived in Syndey and said beaches in the eastern states were far busier.\n\n\"For a really busy time of the year, it's been quite a nice beach to enjoy,\" Ms Alessi said.\n\n\"Tourism boosts the economy so much [and] we want to respect locals as much as possible, but if you put a cap you might hinder other organisations.\"\n\nSome say compared to beaches in places like Sydney it is not that busy on WA beaches. (AAP: Dan Himbrechts)\n\nThe pair said they were happy to share the beach.\n\n\"The beach is for everyone, regardless of how busy it is, so I think to put a cap is a little bit selfish and greedy,\" said Mr Alessi.\n\nMeelup Beach has been bustling with visitors over the summer. (ABC South West WA: Jacqueline Lynch)\n\nCouncil reluctant to intervene\n\nThe City of Busselton has already cracked down on short-stay accommodation like Airbnb.\n\nMayor Phil Cronin said the council was unlikely to intervene further.\n\nHe said the issue would fix itself before numbers grew to levels seen in some parts of Europe and the eastern states.\n\nPhil Cronin says he thinks people will naturally turn away from the region if it becomes too busy. (ABC South West WA: Jacqueline Lynch)\n\n\"If we get to a point of saturation this won't be such an attractive place to be,\" he said.\n\n\"Tourism brings in $1 billion a year just to this area ... we have to embrace tourism.\"\n\nGreens Pool, near Denmark, has also been popular with visitors over the summer. (ABC Great Southern: Rosemary Murphy)\n\nExplore elsewhere\n\nFurther south, The Department of Biodiversity, Conservation and Attractions warned holidaymakers on social media about 'chock-a-block' car parks at places like William Bay National Park, near Denmark.\n\nThe Department of Biodiversity, Conservation and Attractions has spotted cars parking on the side of the access road into Greens Pool in Denmark. (Supplied: DBCA)\n\nRegional Leader for Parks and Visitor Services Peter Masters has urged visitors to \"go elsewhere\" if their favourite spots were full.\n\n\n\n\"A lot of national parks at times get overloved,\" he said\n\n\n\n\"We don't want damage to the vegetation. There's also increased risk of fire from starting underneath their vehicles so please park in the designated areas.\n\n\" Everyone doesn't necessarily need to go to the coast to have a good time, there's plenty of inland activities on offer. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/lack-of-services-leaving-nt-lipoedema-patient-without-care/106187588",
        "title": "People with lipoedema face healthcare barriers, forcing some to relocate",
        "publish_date": "Sat, 10 Jan 2026 23:16:02 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "About three years ago Karen Kinnersley made the gut-wrenching decision to leave her much-loved Darwin home and relocate to Victoria — a place she had left two decades prior.\n\nWhile living in the NT capital, Ms Kinnersley had been diagnosed with lipoedema, but had failed to find a Darwin-based medical specialist who understood or could treat the disease.\n\n\"I loved it up there [in Darwin], my three kids were there, all my friends, but my health was declining, so I really needed to prioritise my health and access [to] services,\" she said.\n\nKaren Kinnersley says lipoedema is an expensive condition to manage. (ABC News: Harrison Tippet)\n\nMs Kinnersley has stage 3 lipoedema, a chronic hereditary medical condition affecting 11 per cent of people assigned female at birth.\n\nIt causes abnormal build-up of fatty tissues around the arms, hips, and legs and can lead to immobility.\n\nAdvocates say the condition is relatively unknown across Australia due to a lack of research, which sees those diagnosed with it spend thousands of dollars on treatments and therapeutics in hopes of maintaining their mobility.\n\nKaren Kinnersley's weekly treatments cost between $100 and $140. (ABC News: Harrison Tippet)\n\nLack of services 'disheartening'\n\nJen Bartlett, director of Lipoedema Australia, said it was \"disheartening and disappointing\" that there's a lack of services for women across the country.\n\nShe said more research funding for the condition would lead to a greater understanding about its prevalence in the community.\n\nLong-term Darwin resident Leah Potter, who has stage 4 lipoedema, believes this lack of specialist services is forcing people to battle the condition in isolation.\n\nLeah Potter has stage 4 lipoedema and wants to improve community awareness of the condition. (ABC News: Michael Franchi)\n\nMs Potter said most people with the condition lived in pain and shame, which compounded other underlying health issues.\n\n\"I keep telling my story to every medical professional I see, and they don't seem to know about [lipoedema] or even believe me,\" she said.\n\nMs Potter said people in Darwin with lipoedema often relied on telehealth, which could be very expensive.\n\nOther women with lipoedema told the ABC that Darwin's humid climate posed another challenge, but the biggest issue was the absence of formal and informal support groups.\n\nResearch funding is critical\n\nMs Bartlett, from Lipoedema Australia, said more research into the condition would help the charity submit an application for support from Medicare.\n\nThis is not skin-deep For years, these women say they've been dismissed and shamed for a painful disease they have little control over.\n\n\"We are missing key pieces of data that would help with that application,\" she said.\n\nShe said although some people with lipoedema could access the compression garment scheme, people with the condition needed more support.\n\n\"I would like to see Medicare coverage ... for things like lymphatic drainage, compression therapy in every state,\" she said.\n\n\"Being able to access private health insurance to cover hospital stays ... would be really important.\"\n\nA spokesperson from NT Health said its occupational therapy departments at the Royal Darwin and Palmerston Regional hospitals provide specialist assessment and management options for patients with lipoedema.\n\n\"Patients are provided with a self-management plan tailored to each individual, which may include skin care, compression pumps and garments, lymphatic drainage, exercises, education and referrals to additional allied health providers for further care and support,\" they said.\n\nRamin Shayan says it is important not to dismiss patient concerns. (ABC News: Kyle Harley)\n\nMelbourne-based plastic surgeon Ramin Shayan, who specialises in reconstructive treatments, wants to see more education for medical professionals.\n\nHe said dismissing patients' concerns could worsen their psychological distress.\n\n\"I think it's the psychological impact of telling people that you need to go away and lose weight when in fact… what we're talking about is not susceptible to normal weight loss measures,\" he said.\n\n\"There is the implication people are … being told that there's something wrong with them, that you're guilty of being lazy or gluttonous when actually it's a real pathological disease that's very harmful.\"\n\nKaren Kinnersley says her health started to decline before leaving the NT. (ABC News: Harrison Tippet)\n\nBack in regional Victoria, Ms Kinnersley is spending between $100 and $140 for her weekly treatments.\n\nBoth Dr Shayan and Ms Kinnersley urged people who suspected they had lipoedema to seek early diagnosis and treatment, which could save them pain and money in later years.\n\nTo afford the surgeries she will need in future, Ms Kinnersleyis being forced to dip into her retirement fund.\n\n\"It's a really expensive condition to manage, and the only way I am going to access surgery is to dip into my superannuation,\" she said.\n\nShe worries about that decision to use her entire superannuation, which she said will leave her reliant on her family, health, and welfare systems.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/tennis-racquet-stringer-numbers-take-a-hit/106158244",
        "title": "Inside the world of stringing tennis racquets",
        "publish_date": "Sat, 10 Jan 2026 23:03:39 +0000",
        "category": "sports",
        "authors": [],
        "text": "Behind the scenes of the world's most elite tennis tournaments there's a team of people rapidly working on keeping equipment well strung.\n\nStringers have historically worked around the clock to ensure racquets are strung to the perfect tension.\n\nFor Shane Mikic, stringing a racquet is second nature.\n\n\"It's about having a really good technique and doing the same thing, racquet after racquet,\" he said.\n\n\"Stringing a racquet is just muscle memory.\"\n\nShane Mikic strings for tournaments including the US Open. (Supplied: Shane Mikic)\n\nHailing from Townsville in north Queensland, Mr Mikic is a part of the Wilson stringing team and has strung racquets for three decades, working his first Grand Slam in 2010.\n\nHe has since flown across the world to string for the likes of Rafael Nadal and Venus Williams, and handles racquets at majors events including the US Open, Roland Garros and Laver Cup.\n\nFor professional players having a tennis racquet strung is critical to their performance on court.\n\nTeams of stringers work on racquets at tournaments such as the Australian Open. (Supplied: Tennis Australia)\n\nMr Mikic said some tennis players preferred lower tension in their strings, while others wanted a firmer string bed.\n\n\"In tennis, if the strings are wrong, forget it. The ball's not going in the court,\" Mr Mikic said.\n\n\"Players have to have the exact string and stiffness that they're used to playing with.\"\n\nStringer shortage\n\nTennis Australia said 7,797 racquets were strung at the 2025 Australian Open, with the highest number on a single day at 616.\n\nIn 2025 the Australian Open also broke attendance records, attracting 116,528 people in its opening week, up from 89,894 people in 2024.\n\nWell over 7,000 racquets are strung at the Australian Open, according to Tennis Australia. (Supplied: Tennis Australia)\n\nRacquet sports equipment manager Lyndon Krause said while tournaments thrived, there was an aging demographic of tennis stringers and the industry was grappling with a shortage.\n\nHe said Tennis Australia had about 50 stringers currently on roster that met tournament requirements.\n\n\"We've got more tournaments now than we've ever had,\" he said.\n\n\"I'd say the average age for a stringer is mid-50s and above.\n\n\"The need for stringers is above and beyond anything else.\"\n\nTennis Australia will next year relaunch a program dedicated to the training of stringers and to provide a pathway into the tournament scene.\n\n\"The learning curve is very steep, so what we're looking for is people who are passionate about the sport of tennis,\" Dr Krause said.\n\n'Flat out'\n\nMr Mikic said elite-level games were fast-paced and high-stress environments for stringing teams.\n\n\"Stringing teams at a tournament are flat out,\" he said.\n\n\"You can start the day with maybe 15 racquets in your box that need to be strung by 11 o'clock, then during that time you'll have players dropping in at the last minute.\"\n\nShane Mikic said stringing at tournaments was a high-stress environment. (Supplied: Shane Mikic)\n\nHe said being a good stringer relied on technical knowledge.\n\n\"It's about player preference, but it's also the type of ball they hit as well,\" he said.\n\n\"Generally players who hit with a lot of topspin can get away with having a looser string bed.\n\nLoading...\n\n\"Players who hit very flat, say someone like Bernard Tomic, generally has to string a little bit tighter to get the control that he needs.\"\n\nDr Krause said Tennis Australia was trying to challenge traditional stringing room environments in its bid to ramp up numbers of stringers.\n\n\"There's been an expectation for stringers to start an hour before play and end an hour after play,\" he said.\n\n\" Previously the stringers used to be accustomed to doing 20-hour days. \"\n\nHe said Tennis Australia were working to redefine those stereotypes, including roping-in stringers on a shift-based model and on shared machines.\n\n\"We're now looking into how do we increase the efficiency of the room, provide more opportunities, leverage the existing talent we've got out there now,\" he said.\n\nThe 2026 Australian Open begins in Melbourne on January 12.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/great-keppel-island-underwater-observatory-star-attraction/105282860",
        "title": "The 'wonderful and unusual' heyday of an island's underwater observatory",
        "publish_date": "Sat, 10 Jan 2026 22:34:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "\"G'day, Coral here.\"\n\nThat's how Coral Wedd would answer the phone in the 1980s at the Middle Island Underwater Observatory's souvenir shop in the Pacific Ocean off Queensland.\n\n\"Not very many people go overseas to work each day under water by the name of Coral,\" Ms Wedd, formerly Howes, laughed.\n\nCoral Wedd worked at the Middle Island Underwater Observatory from 1980 to 1982. (ABC News: Vanessa Jarrett)\n\n\"Coral would go to work under the water selling coral to the tourists.\"\n\nIt still makes her chuckle 40 years later.\n\n\"The typical day was the envy of everybody I think,\" she said.\n\nLoading...\n\n\"It was a wonderful time working on the observatory, it was an unusual time.\"\n\nGreat Keppel Island is 24 kilometres off the coast of Yeppoon in central Queensland.\n\nHundreds of tourists would fill boats and cruise along the Keppel islands, visiting the underwater observatory along the way. (Archives)\n\nIn the crystal-clear waters not far from the island, the Middle Island Underwater Observatory was a star attraction in the 80s and 90s.\n\n\"Hundreds of tourists … would come down daily from Rockhampton to the Capricorn Coast, they would load onto the tourist boats … probably 200 people each,\" Ms Wedd recalled.\n\nThree fathoms deep into the sea, it even once hosted maritime nuptials.\n\nThe wedding of Mark William Heslin to Sharee Anne Newland was held in the underwater observatory on October 11, 1980. (Image: ABC Capricornia/Vanessa Jarrett)\n\nA month after the underwater observatory opened in 1980, souvenirs from the gift shop were moved aside to make way for guests and a wedding party.\n\nMark William Heslin and Sharee Anne Newland tied the knot underwater on October 11, 1980.\n\n\"It was quite a novelty for the underwater observatory,\" Ms Wedd reflected.\n\nThe Middle Island Underwater Observatory was quite innovative and new at the time. (ABC News: Vanessa Jarrett)\n\nIn a sad but poignant affair, she also recalled when a young man's ashes were laid to rest.\n\nHe had visited the underwater observatory in the months prior and was fascinated with the set-up and the fish, she said.\n\nThrough an unfortunate accident, he passed away and his parents asked if his ashes could be buried nearby.\n\n\"Our diver from the observatory took the ashes,\" Ms Wedd said.\n\n\"The parents stood and watched as he planted the ashes under a rock and in the sand.\n\n\"It was a bittersweet day for his parents … that was the first, too, for the observatory.\"\n\nA rare kind of tourist attraction\n\nThe opening of the Green Island Underwater Observatory in 1954. (Supplied: Quicksilver Group)\n\nAustralia was home to the world's first underwater observatory stationary structure in 1954 at Green Island off Cairns in Far North Queensland.\n\nBuilt from an old Navy dive chamber, the observatory — which attracted a visit from Queen Elizabeth II in 1970 — closed in 2012 after being deemed unsound.\n\nQueen Elizabeth II and the Duke of Edinburgh with Vince Vlasoff on Green Island’s Underwater Observatory, 1970. (Supplied: Sylvia Card/Cairns Historical Society)\n\nToday, the world's largest underwater observatory is at Busselton Jetty, in Western Australia, built in 2003 with a 9.5 metre observation chamber.\n\nA historic photo of the Middle Island Underwater Observatory, potentially the opening day on September 25, 1980. (Archives)\n\nThe Middle Island Underwater Observatory was the largest in Australia when it opened on September 25, 1980.\n\nIt was the dream of Yeppoon man Jim Nimmo, with the support of his wife Sheena.\n\nMs Wedd was there for the opening day, which involved much fanfare.\n\nThe souvenir shop on the ocean floor of the underwater observatory. (ABC News: Vanessa Jarrett)\n\n\"Lots of broadcasting, radio and TV, very important people coming across, lots of people there, all excited to see it,\" she said.\n\n\"Interestingly, the most excitement was from the dignitaries that came up from Brisbane, they were quite fascinated with the construction, the transport, the sinking [of the observatory under the water].\"\n\nElectrical current to prevent corrosion\n\nThe Middle Island underwater observatory under construction in the harbour. (Supplied: Capricorn Coast Historical Society)\n\nThe structure was built on land by Yeppoon firm, Goodies Engineering, between 1979 and 1980.\n\nIt was filled with 500 tonnes of ballast, made of copper and ilmenite.\n\nThe material was loaded via a giant funnel and crane at the Rosslyn Bay Harbour.\n\nTo prevent corrosion, the structure was designed that an electrical current would pass through it 24 hours a day.\n\nThe observatory was dismantled and taken to Farnborough Beach to be floated on the high tide. (Supplied: Capricorn Coast Historical Society)\n\nThe structure was floated out to sea and was set down 6 metres below sea level on plated piles driven into the seabed.\n\nA Taiwanese shipwreck and other pieces of junk were sunk at the same time to create a habitat for marine life.\n\nThe 10-metre wide building had a souvenir shop on the ocean ground floor with 14 windows that looked out to the ocean.\n\nAn operator would feed the marine life twice a day to keep them lurking close by while tourists watched in awe through the windows.\n\nVisitors would look out the windows and see the marine life outside. (Archives)\n\n\"The windows of the observatory were the only ones of their kind, they were 6 foot long, not the little portholes that most of the observatories had at the time,\" Ms Wedd said.\n\n\"I think that was the only one of its kind to have a tourist shop under water, in Australia anyway.\"\n\n'Current state to be assessed'\n\nFollowing the closure of the Great Keppel Island Resort in 2008, the underwater observatory was shuttered as well.\n\nThese days, the only visitors are marine life and scuba divers or snorkellers.\n\nThe area has been rezoned as a green zone, meaning no fishing can take place, which has in turn created a thriving marine life population.\n\nCoral has formed over the old structure and sea animals use the nooks and crannies as a habitat.\n\nIt has become a popular spot with reef fresh, cod, groupers, sharks, rays and turtles often sighted.\n\nThe future of the site now lies in the hands of the state government, which rescinded the leases from former Great Keppel Island Resort owners, Tower Holdings, in 2023.\n\nEarlier this year, a tender was awarded to a demolition company to clean up abandoned buildings on Great Keppel Island, and as part of the works, an assessment was to be undertaken of the Middle Island Underwater Observatory.\n\nThe Middle Island Underwater Observatory, pictured in January 2026, sits abandoned but is popular with snorkellers and divers. (ABC Capricornia: Vanessa Jarrett)\n\nIn a new statement requested by the ABC, a Department of Natural Resources and Mines, Manufacturing, and Regional and Rural Development spokesperson said the condition of the underwater observatory was still under assessment.\n\nThey said the department's priority was the safety and security of the former Great Keppel Island resort site.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/australia-wins-cross-country-gold-medal-mixed-relay/106217508",
        "title": "Hull anchors Australia to World Cross Country Championships gold",
        "publish_date": "Sat, 10 Jan 2026 22:19:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Olympic medallist Jessica Hull has anchored Australia to victory in the mixed relay event at the World Cross Country Championships in Tallahassee, Florida.\n\nHull teamed up with Oliver Hoare, Linden Hall and Jack Anstey to win gold, with the Australians recording a time of 22 minutes and 23 seconds across the four 2 kilometre legs of the race.\n\nAustralia stopped the clock three seconds ahead of France, with Ethiopia third (22:34).\n\nIt is Australia's fifth medal in World Athletics Cross Country Championships history.\n\nHull and Hoare helped Australia win bronze in the same race at the 2023 world titles, which were held in Bathurst.\n\n\"We're all pretty proud of that one,\" said Hull, who won silver in the 1,500m on the track at the Paris Olympics.\n\n\"There's been a belief that we cannot just medal, but we can probably win it, and we all carried that into today because we weren't afraid to try and run to win.\"\n\nIn the individual events, Lauren Ryan was the best-placed Australian in the women's 10km race, finishing in 13th position.\n\nRyan ran a time of 33:47, while fellow Australian Leanne Pompeani was six seconds behind in 15th place.\n\nKenya's Agnes Jebet Ngetich won gold in 31:28.\n\nKy Robinson was 24th in the men's 10km race, one place ahead of Australian teammate Edward Marks.\n\nRobinson clocked 29:56, two seconds quicker than Marks, with Uganda's Jacob Kiplimo winning in a time of 28:18.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/arsenal-shows-support-for-kyra-cooney-cross/106217464",
        "title": "Arsenal shows support for Cooney-Cross in wake of mother's cancer diagnosis",
        "publish_date": "Sat, 10 Jan 2026 21:39:01 +0000",
        "category": "sports",
        "authors": [],
        "text": "Arsenal players and supporters have paid emotional tributes to Matildas star Kyra Cooney-Cross following her return to Australia to be with her mother, who has been diagnosed with cancer.\n\nMatildas star returns home to face family tragedy Arsenal's Australia international Kyra Cooney-Cross flies back to Australia to be with her mother, who has been diagnosed with stage 4 cancer.\n\nCooney-Cross revealed during the week she had rushed back to be with her mother Jess, who is in hospital in Queensland.\n\n\"A few days ago, our world changed forever,\" the 23-year-old wrote on Instagram.\n\n\"My amazing mum, Jess, has been diagnosed with Stage 4 cholangiocarcinoma (bile duct cancer). It's a rare and aggressive cancer, and there is no cure.\"\n\nThe news prompted a show of emotional support from her Arsenal teammates, including fellow Matildas Steph Catley and Caitlin Foord.\n\nThe Arsenal squad warmed up in shirts bearing her name and her playing number, 32, before the WSL match against Manchester United on Saturday night AEDT.\n\nThe match, played at Arsenal's home ground in north London, attracted 37,000 spectators.\n\nA group of spectators marched to the ground, holding up signs that read: \"We love you Kyra and Jess.\"\n\nIn the 32nd minute of the match, they held the signs up in the stadium, as spectators around the ground broke into applause.\n\nArsenal fans got behind Kyra Cooney-Cross and her family. (Getty Images/Arsenal FC: Alex Burstow)\n\n\"There's bigger things in life,\" Arsenal manager Renee Slegers said.\n\n\"Of course, we miss Kyra here, but Kyra is where she needs to be right now, with the family, so our thoughts are with her, Jess and the rest of the family.\"\n\nManchester United also showed its support for Cooney-Cross.\n\n\"I just want to share a message for Kyra and her family,\" United manager Marc Skinner said.\n\n\"From everyone in Manchester United, we wish you all the very best, and the football family's with you, and I hope that you can find a happy space.\"\n\nThe match, which was the first played after the WSL winter break, finished in a goalless draw.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/united-cup-tennis-gauff-swiatek-us-poland/106217432",
        "title": "Gauff beats Świątek but Poland advances to United Cup final",
        "publish_date": "Sat, 10 Jan 2026 20:45:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Coco Gauff has dealt Iga Świątek a blow ahead of the Australian Open, but the US star could not stop Poland from reaching the United Cup final in Sydney.\n\nGauff outclassed Świątek 6-4, 6-2 to record a fourth straight win over the world number two and force a mixed doubles decider in a dramatic semifinal at Ken Rosewall Arena on Saturday night.\n\nBut brought back to play alongside US teammate Christian Harrison, Gauff was powerless to stop the inspirational Polish pair of Katarzyna Kawa and Jan Zieliński.\n\nHolding firm in two tiebreaks, the Poles prevailed 7-6 (7/5), 7-6 (7/3) after midnight to reach a third straight final.\n\nPoland, who lost to the US in last year's tournament decider, will face Switzerland in Sunday night's final.\n\nHubert Hurkacz had given Poland the early lead when he edged out Taylor Fritz 7-6 (7/2), 7-6 (7/1) in the opening singles rubber.\n\n\"Hats off to Hubert, who's coming back after seven months away to play incredible tennis and inspiring all of us to play like we did today,\" Zieliński said after Poland wrapped up victory.\n\n\"He's just been an inspiration to all of us.\"\n\nAussies exit United Cup Alex de Minaur produces a signature tenacious display, but it is not enough to send Australia through to the United Cup semifinals in Sydney.\n\nEarlier on Saturday, Belinda Bencic led the Swiss into their first United Cup final.\n\nBencic was the heart and soul of the epic 2-1 victory over Belgium.\n\nAfter surviving a third-set tiebreaker to defeat Elise Mertens 6-3, 4-6, 7-6 (7/0) in the opening singles match, Bencic teamed with Jakub Paul to win their third decisive mixed doubles match of the tournament.\n\nBencic and Paul beat Mertens and Zizou Bergs 6-3, 0-6 [10/5] after regrouping from a second-set collapse when they won just 12 points.\n\nThe mixed victory was necessary after Bergs continued his impressive campaign with a 6-3, 6-7 (4/7), 6-3 triumph over Stan Wawrinka to level the tie as the temperature exceeded 40 degrees during Sydney's summer heatwave.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/future-of-spin-bowling-in-australian-cricket/106213212",
        "title": "Is spin bowling a dying art in Australian cricket?",
        "publish_date": "Sat, 10 Jan 2026 20:43:39 +0000",
        "category": "sports",
        "authors": [],
        "text": "Like many up-and-coming cricketers across Australia, Paawan Sharma dreams of one day donning the baggy green.\n\nThe 19-year-old bowls leg breaks for Geelong in Victoria's Premier Cricket competition.\n\nHe says life as a young spinner can be a grind on Australia's pace-friendly pitches.\n\nPaawan Sharma practising his leg spin bowling. (ABC News: Darryl Torpy)\n\n\"It's obviously hard with the pitches in Australia, they don't offer much to spinners,\" Sharma said.\n\n\"Pitches are favouring pace bowlers more, so spinners aren't getting much of a go.\n\n\"We obviously don't get [pitches] that turn a lot or bounce, so spinners don't get much value from spinning the ball.\"\n\nDuring the just-completed Ashes series, Australia opted against selecting a front-line spinner in three of the five Tests.\n\nThe fifth and final Test in Sydney marked the first time in 138 years that a specialist spinner did not feature in an SCG Test.\n\n\n\n\n\nCoaches and past players say the pitches weren't spin friendly. (AAP: Joel Carrett) The preceding Test at the MCG was the first to be played in Australia in which not a single over of spin was bowled.\n\nHaving closely followed the series, Sharma said he was beginning to question what his future held.\n\n\"It's not great to be seeing a team with no spinners, especially in Australia,\" Sharma said.\n\n\"[Spin bowling] is always going to keep evolving, it's not going to say the same as what it was five years ago — spinners will keep finding a way to get up there because we are an important part of the team.\n\n\"I guess we just have to find a way to get up there.\"\n\nSimilar concerns were raised by 12-year-old Boyd, who messaged ABC Sport during the Sydney Test.\n\n\"As a young aspiring spinner playing under 12s, why has the Australian team made it so hard for me and other young spinners to play Test cricket?\" he asked.\n\nFormer Australian fast bowler and ABC Sport expert Jason Gillespie said he \"firmly\" believed spinners still had a key role to play at Test level.\n\n\"A spinner always plays a role, even if the surface doesn't necessarily dictate it,\" Gillespie said.\n\n\"Spinners are going to learn how to bowl on different surfaces, surfaces that may not encourage spin.\n\nJason Gillespie says spinners need to build experience bowling on different surfaces. (Getty Images)\n\n\"I can kind of understand why the teams both chose not to play spin at times in this series — they probably felt that the Test matches weren't going to go for five days.\n\n\"But it's a Test match and our young spinners need to learn how to bowl in all conditions, not just in spin-friendly conditions.\"\n\nFormer Australian spinner Ray Bright said the frenetic pace of modern Test cricket was not helping.\n\n\"This Ashes series has probably been one of the shortest, so it hasn't really given wickets a chance to deteriorate,\" Bright said.\n\n\n\n\n\n\"If they keep serving up the wickets they have, well you might as well play a batter [instead].\"\n\n\n\nRay Bright says greater focus needs to be put on the development of young spinners. (ABC News: Darryl Torpy) \"They've been green and grassy from day one, so they haven't broken up at all in any shape or form.\"If they keep serving up the wickets they have, well you might as well play a batter [instead].\"\n\nBright believes more support for spinners coming through the lower levels is critical for Australia to find a long-term successor to Nathan Lyon.\n\n\"I don't know how much effort has been put into developing and encouraging them,\" Bright said.\n\n\"We need captains and coaches to give [young spinners] a bowl and not just go to the medium pacers all the time, particularly on good, flat wickets.\"\n\nFrankston-Peninsula Cricket Club's Peter Buchanan said the current lack of support was turning many spinners away from the craft.\n\n\"A lot of young cricketers today tend to be bowling medium pace or even faster,\" Buchanan said.\n\nPeter Buchanan hopes spin bowling isn't \"a dying art\". (Supplied: Peter Buchanan)\n\n\"There is the odd spinner, but nowadays boys and girls tend to rely on two or three of the skills.\n\n\"You don't see too many young cricketers that are just trying to learn how to bowl off spin and leg spin, they're generally batters who can bowl a bit.\n\nBuchanan said it was \"quite possible\" the lack of spin seen in the Ashes would accelerate that trend.\n\n\"I think there's still a place in the game for a spinner, but I just think at the moment with these drop-in pitches, they're tending to be more conducive to medium and fast bowling,\" he said.\n\n\"With the white ball format, a lot of these junior competitions, young cricketers are only allowed to bowl certain amount of overs and as a spin bowler you actually need to bowl lots of overs to … improve your craft and it takes a long time.\n\n\"So, I think it's an issue but hopefully it's not a dying art because we need to have spin bowling as an option in all games of cricket.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/world-cup-monobob-bree-walker-australia-wins-gold/106217414",
        "title": "Aussie bobsleigh star Walker claims historic win ahead of Winter Olympics",
        "publish_date": "Sat, 10 Jan 2026 20:32:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "Bree Walker is on course for a Winter Olympic monobob medal after becoming the first Australian to win a World Cup gold at the famed St Moritz-Celerina track in Switzerland.\n\nWalker's victory was her third of the World Cup season, moving the 33-year-old to second on the overall standings ahead of next month's Milano-Cortina Winter Olympics.\n\nThe Queenslander posted 1 minute and 11.98 seconds in her opening run, which was the fastest time of the round.\n\nShe showed cool nerves when she took to the track as the last competitor in the final run, clocking 1:11.29 for a combined time of 2:23.27.\n\nShe finished 0.53 ahead of Switzerland's silver medallist Melanie Hasler (2:23.80), with Austria's Katrin Beierl claiming bronze in 2:23.95.\n\nPeel boosts Aussie Winter Olympics hopes After recently struggling for form, Australian star Laura Peel strikes gold at the aerials World Cup event in Canada in her best showing of the season.\n\nFellow Australian Sarah Blizzard (2:26.06) was 20th on the final standings.\n\nWalker, who has won six World Cup events in her career, said her coach Pierre Lueders deserved much of the credit for the victory in Switzerland.\n\n\"Pierre has been teaching me for years, and it's been a slow process,\" she said.\n\n\"He loves this track and has had so much success here, so I think I should dedicate this win to him today.\"\n\nWalker finished ninth in the previous World Cup event held in Winterberg, Germany.\n\nShe has 1,219 points on the overall World Cup standings, sitting behind German Laura Nolte (1,246 points).\n\nShe will return to the St Moritz-Celerina track on Monday AEDT for the two-woman bobsleigh event, teaming up with Kiara Reddingius.\n\nABC/AAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/barbie-nose-trend-social-media/105967608",
        "title": "The 'Barbie nose' is everywhere. It has some experts concerned",
        "publish_date": "Sat, 10 Jan 2026 20:28:38 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Abbi Dib was 13 years old when she first considered getting a nose job.\n\nTiny, sloped noses were dominating pop culture, and she dreamed of changing her own features to match.\n\nAs soon as she turned 18, Abbi joined a public waitlist for a rhinoplasty.\n\nAbbi Dib after her rhinoplasty. (Supplied: Abbi Dib)\n\nBut while the surgery smoothed out the bridge of her nose and fixed her snoring, it wasn't the dramatic transformation the Melbourne journalist had hoped for.\n\n\"I remember being upset it wasn't sloped,\" she said.\n\n\"People would be like, 'Oh, you've had a nose job? That's really weird, it doesn't look like it.'\n\n\" That would be a shot to my heart. \"\n\nAbbi Dib has considered getting a second rhinoplasty. (Supplied: Abbi Dib)\n\nAbbi, who comes from a Middle Eastern background, still has moments when she considers getting a second surgery to make her nose even smaller.\n\n\"[But] it would look so ridiculous because I have such big eyes that if I had a really tiny nose I would look like an alien,\" she said.\n\n\"And, also, it would be so far from my culture.\n\n\"But if I'm having a bad week and I feel ugly, then the thought does cross my mind.\"\n\nIf you or someone you know needs help: Butterfly National Helpline — 1800 33 4673\n\nEating Disorders Families Australia — 1300 195 626\n\nEating Disorders Victoria — 1300 550 236\n\nEating Disorders Qld — 07 3844 6055\n\nProfessionals Credentialed in Eating Disorders\n\nLifeline on 13 11 14\n\nSuicide Call Back Service — 1300 659 467\n\nKids Helpline — 1800 55 1800\n\nMensLine — 1300 78 99 78\n\nSocial media, celebrity culture driving trend\n\nKnown colloquially as the \"ski-slope\" or \"Barbie\" nose, this delicate, upturned rhinoplasty is \"everywhere\" according to Professor Gemma Sharp, the founding director of the Consortium for Research in Eating Disorders.\n\nSocial media is a major driver, she said, with more people posting before-and-after videos that normalise the procedure.\n\n\"You've got influencers who'll talk about having the procedure done and how much it has improved their lives, which is very, very powerful,\" she said.\n\nAn increasing number of people are seeking a \"ski-slope\" rhinoplasty. (Supplied: TikTok/selinadasilvaa)\n\nProfessor Sharp said selfie culture is also a factor, with phone cameras making noses appear larger than they actually are.\n\nMeanwhile photo filters are changing people's facial structure and shape even when they don't ask for it, further fuelling dissatisfaction.\n\nUniversity of Hong Kong philosopher and cosmetic surgery ethics expert Dr Yves Saint James Aquino said celebrity culture is also a \"really strong\" influence.\n\n\"There is a sort of narrow view that if we achieve the physical ideal, we might be able to achieve all the other social ideals, including wealth, fame and popularity,\" he said.\n\nYves Saint James Aquino. (Supplied: Dr Yves Saint James Aquino)\n\nAustralian cosmetic surgeon Dr Namrata Anavekar said she has seen an almost 20 per cent increase in patients seeking this look in the past year.\n\nHowever, the Australasian Society of Aesthetic Plastic Surgeons board member said any \"trend-associated\" surgeries like these are a concern.\n\n\"As opposed to a fashion trend where you can throw out your skinny jeans and buy a pair of boot cuts, surgery is permanent,\" she said.\n\n\" What's a trend now may not be in about 10 years. \"\n\nNamrata Anavekar has seen an increase in patients seeking a \"Barbie nose\". (Supplied: Dr Namrata Anavekar)\n\nBarbie nose suits 'very few faces'\n\nIn addition to cosmetic changes, rhinoplasty can be performed for health reasons, such as to correct breathing problems or repair damage from injury of congenital defects.\n\nWhile traditional rhinoplasties aim to refine the nose so it blends in, the Barbie nose look generally suits \"very few faces\", Professor Sharp warns.\n\n\"People get that Barbie doll look and they go, 'My nose looks lost on my face'. So they'll end up seeking more facial procedures just to try to make it look balanced again,\" she said.\n\nThe \"Barbie nose\" procedure removes much of the structural integrity of the nose, increasing risks of breathing difficulties and even nasal collapse.\n\nIt can take \"significant revisional procedures\" to restructure the nose, including using rib cartilage.\n\nA before and after example of the \"Barbie nose\" rhinoplasty. (Supplied: TikTok/dr.ferda.erol7)\n\nThe recovery process can also be long and painful.\n\n\"It feels like a bus has hit you in the face,\" Abbi said.\n\nFor two weeks, the then-18-year-old struggled to breathe past the splints up her nostrils and had to use a douche bottle to clear the mucus and blood out of her nose.\n\nIt took about two years before the swelling fully subsided.\n\nAbbi Dib hasn't regretted her rhinoplasty. (Supplied: Abbi Dib)\n\nDr Namrata says it's crucial people seek advice from a qualified cosmetic plastic surgeon prior to any procedures — particularly those driven by trends.\n\n\"Don't look for a budget price,\" she said.\n\n\"You want to engage with a surgeon who's not just going to say yes to a procedure, but they want to ensure your safety in combination with your goals.\"\n\nProfessor Sharp also advised people see a mental health professional prior to a nose job, to explore their motivations.\n\n\"Is there an underlying mental health condition that would be better treated through psychological therapy rather than surgery?\" she said.\n\nGemma Sharp says people should see a psychologist prior to getting a nose job. (Supplied: Gemma Sharp)\n\nPressure to erase 'ethnic' nose\n\nThe Butterfly Foundation's Helen Bird says trends like these allow industries to prey on people's insecurities.\n\n\"This pressure can build and build until people start to believe that changing their appearance will bring them worth and happiness,\" she said.\n\nThe trend also shows how Western beauty ideals continue to dominate globally, Ms Bird said.\n\nA beauty trend of small, upturned noses is widespread on social media. (Supplied: TikTok/thatsleah)\n\nFor Abbi, this feels like nothing new.\n\n\"I think the pressure to [not have] an 'ethnic' nose has always existed,\" she said.\n\n\"There's literally people who rub their baby's nose when they're really tiny [to] get rid of the bump.\"\n\nSocial media is playing a key role in reinforcing the trend. (Supplied: TikTok/jasminiaura/hope_schwing)\n\nProfessor Sharp said she had seen \"quite a bit of regret\" from some patients who changed their so-called \"ethnic\" features to keep up.\n\n\"They go, 'I don't look like anyone in my family anymore',\" she said.\n\n\"That's something people really need to consider before undergoing a rhinoplasty.\"\n\nDr Aquino emphasised that cosmetic surgery is not something to be ashamed of, adding that race isn't defined by a single facial feature.\n\n\"People should have the right to do whatever they want with their body. However, I believe people should do it in a safe way,\" he said.\n\nAbbi Dib urges people to do their research before they get a nose job. (Supplied: Abbi Dib)\n\n'People do it to turn into someone else'\n\nSeven years on from her nose job, Abbi says she doesn't regret a thing — however, she urges people to do their research.\n\n\"Some things are irreversible,\" she said.\n\n\"Allow a few years to think about it and try not to make the decision when you're 18 or 19.\"\n\nShe also encouraged anyone seeking a rhinoplasty to ensure it fits their face — rather than fitting a trend.\n\n\"People want to act like plastic surgery is to enhance your natural features,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/nsw-community-bands-lose-government-funding/106196730",
        "title": "'Significant' impact for community bands as funding applications rejected",
        "publish_date": "Sat, 10 Jan 2026 20:11:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "For the past 90 years, the City of Wollongong Brass and Wind Band has been proud of keeping its membership fees down, but the looming loss of funding has cast doubt on the band's future.\n\n\"We want to include everybody as much as possible,\" said the band's president Neil Wright.\n\n\"Some people might say it's kind of a niche … but there's a lot of people who do this.\"\n\nThe volunteer-run group is one of more than 100 community and school bands in New South Wales, which are represented by the Bands Association of NSW (BANSW).\n\nFor years the association has received funding through the state government's arts and culture grant schemes, and has allocated it to local bands to cover venue hire, advertising, organising concerts, buying sheet music or repairing instruments.\n\nBANSW president Jeff Markham said the amount they received often \"waxed and waned\", but they had consistently secured around $55,000 each year for the past decade.\n\nJeff Markham says consistent funding had been the key to the community band scene's longevity. (Supplied)\n\n\"We've had certainty of funding which has allowed us to plan,\" he said.\n\nIn Wollongong, Mr Wright said the money had helped fund music camps, workshops and social media advertising.\n\n\"Most of our grants have been towards fostering our young and upcoming players,\" he said.\n\n\"It's good getting particularly the young ones into the organisation, but you've got to find ways of wanting them to actually remain as part of the organisation.\"\n\nNeil Wright is the president of the City of Wollongong Brass and Wind Band. (Supplied)\n\nFight for funding\n\nMore than 140 organisations were successful in the latest round of funding, which for the first time operated under a competitive model.\n\nGroups had been able to apply for multi-year funding over for a period of two or four years.\n\nBut BANSW's funding application was rejected.\n\nA spokesperson for Create NSW said the latest funding rounds had been \"highly competitive\".\n\n\"The Arts and Cultural Funding Program is delivered through an open, competitive, independently assessed process,\" the spokesperson said in a statement.\n\n\" Funding is not ongoing or guaranteed. \"\n\nCreate NSW said it held multiple meetings with BANSW to provide \"feedback and support\" before and after its application was submitted.\n\n'Significant' impact on bands\n\nMr Markham said the possibility of BANSW no longer being able to fund local bands for the time being would have a \"significant\" impact — especially on groups with younger players.\n\n\"The youth program is a lot of work, it's a lot of expense, and it's a lot of energy,\" he said.\n\nA spokesperson for Create NSW said funding is not ongoing or guaranteed. (Supplied)\n\nMr Wright said if they were granted money this year, they would have used it on promotional materials like banners and signs.\n\n\"Currently, we just do without, and hope people might come up close enough and ask questions,\" he said.\n\n\"They're just little things … [but] if we're able to get a grant, we don't have to think about where we are going to take that money from.\"\n\nHe said it might also affect their membership costs.\n\n\"Something we've been fairly proud of is keeping our membership fees down.\"\n\nBudget changes flagged\n\nMr Markham said without grant funding, bands could soon be forced to reassess whether some of their events and programs are worth budgeting for.\n\n\"Most of the stuff a band does in the community, they don't get paid for it,\" he said.\n\nMr Markham says band members may be asked to help cover activity costs. (Supplied)\n\n\"Without that little bit of funding, all of the money has to come from the band itself, which means there's no upfront commitment to do these things.\"\n\nMr Markham said the alternative was to ask members to reach into their own pockets to help meet band costs.\n\n\"They're all out fundraising, but all those fundraising efforts are all to just keep the doors open,\" he said.\n\n\"Everything else extra to that is basically on the members.\"\n\nRegional bands hit hard\n\nThe Hills Music Academy in Sydney's north-west has youth and senior bands with around 100 members.\n\nMusical director Garry Clark said the academy had been receiving grant funding periodically over the last 25 years.\n\nHe said their larger membership base and event partnerships meant they would not be as affected by the loss of funding as their regional counterparts.\n\nGarry Clark says small regional bands would be hit hard by the funding loss. (Supplied)\n\n\"Smaller groups, less active groups, they would really struggle,\" he said.\n\n\"A lot of the regional groups would maybe not even be able to function, because numbers are not as high.\"\n\nMr Wright said that may be the case for his musicians.\n\n\"We'll [still] put on events, it just means however that we can't subsidise these events … there might be some players who might not be able to attend.\"\n\nBringing community together\n\nMr Clark says musicians provide an important service to their community. (Supplied)\n\nMr Clark said locals would ultimately suffer if their bands could not survive.\n\n\"Seeing a band out in public performing, marching down the street, playing Christmas carols in a shopping centre, all those little things that bring the community together.\"\n\nMr Markham said the importance of community bands is often underestimated.\n\n\"Your community band is quite often the first place that somebody will be introduced to live music,\" he said.\n\n\"We play in nursing homes, we play at funerals … and quite often for many people, the community band is the last live music that they see as well.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-11/indonesian-catholic-priest-swaps-sermons-for-rock-n-roll/106096618",
        "title": "Outback priest known beyond his diocese for rock'n'roll",
        "publish_date": "Sat, 10 Jan 2026 20:11:02 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Cranking electric guitar licks to accompany prayers during Sunday Mass in a remote outback church isn't how most people envision their rock star dreams.\n\nBut for Indonesian priest Father Oche Matutina, it's the perfect alignment of two great loves — God and rock 'n' roll.\n\nThe Catholic Redemptorist missionary arrived in Australia in 2020 before the pandemic slammed borders shut. The 50-year-old initially served in Melbourne, but in 2022 he was moved by his superiors to Bourke in north-western NSW.\n\nAfter joining the seminary in Indonesia at age 17, Oche Matutina was ordained at 29. (ABC Western Plains: Catherine James)\n\n\"It was hard for me to move from the city, especially since I heard some stories about Bourke,\" Fr Matutina said.\n\n\" But once I arrived here, everything changed. I love this place. \"\n\nHis provincial — a religious superior — had shared with him how difficult it was to find priests willing to relocate to the rural town some 800 kilometres from Sydney and based in one of the largest Catholic dioceses in Australia.\n\nThe Diocese of Wilcannia-Forbes covers more than half of New South Wales and its priests will drive hundreds of kilometres each week to reach the faithful in towns sparsely scattered across the outback plains.\n\nLast year, Fr Matutina asked his provincial to keep him in Bourke for three more years.\n\n\"He didn't say yes or no, but he was smiling. I think it was positive.\"\n\nOche Matutina came to Australia in 2020 to provide pastoral care. (ABC Western Plains: Catherine James)\n\nHeavy metal childhood\n\nGrowing up as one of seven children on Indonesia's Sumba island, music — specifically Led Zeppelin, Jimi Hendrix and Metallica — dominated Fr Matutina's childhood, encouraged by a father who crafted guitars and ukuleles out of wood.\n\nThroughout school, he dreamed of the big stage and spotlights as he and his siblings entertained locally with their band.\n\nBut a German priest who loved to hum changed the game.\n\nLoading...\n\n\"He always walked around with his habit and humming,\" Fr Matutina said, recalling how happy he seemed.\n\n\"He started something in my heart to be a priest.\"\n\nA pivotal conversation between the pair where Fr Matutina shared his dilemma about whether to pursue the priesthood or music clinched the decision to do both.\n\nThe German priest told him he'd be even more effective as a priest through music.\n\n\"[He] said to me, you can be a priest and play music. You can do more through music.\"\n\nBourke's Yellowbelly band members practise their set ahead of a gig in southern Queensland. (ABC Western Plains: Catherine James)\n\nJoining the seminary at 17, he would initially dial back the heavy metal as some superiors found it unbecoming, but the classic rock continued, with the likes of Chuck Berry, country rock, and the blues.\n\n\"Music is a prayer for me because music gives me joy,\" he said.\n\n\" And I remember my teacher saying it a long time ago — when you sing, you pray two times. \"\n\nCulture shock\n\nFr Matutina has found his passion for music more invaluable since arriving in Australia and realising most people aren't too keen to talk religion.\n\n\"It's different in Indonesia — you can meet people and they will ask you to talk about faith,\" he said.\n\n\"In Australia … many people don't really like to hear about faith, about church.\n\n\"When I start to talk about faith, sometimes people just leave me.\"\n\nSo music serves as the common ground instead.\n\n\"Through music, I make a connection,\" he said.\n\n\"Then we have opportunity to start the conversation, to talk. We just talk. I don't say anything about coming to church, about faith.\"\n\nOche Matutina joins his Yellowbelly bandmates for a gig in Eulo, Queensland. (Supplied)\n\nDrawing the crowds\n\nThe novelty of the electric guitar and prayers like Our Father with a country rock twang has proven to be a hit at Sunday mass. Attendance has grown tenfold since 2022, Fr Matutina said, from three to five people to sometimes 30 to 50 people in the pews.\n\nBut with 20 per cent of Bourke's roughly 2,700 residents identifying as Catholic in the 2021 census, it's clear to Fr Matutina that most of the parish never set foot in the church.\n\nSo he took his music beyond its walls.\n\nHis jam sessions with a local guitarist and singer Stephen Wilson, 20, were soon joined by bassist Kobie Lollback, 21. Not long after, drummer Dwayne (Sol) Elwood-Hudson, 51, joined in.\n\nBy Easter 2025, the four had formed a covers band, Yellowbelly. Together they've travelled throughout north-western NSW and southern Queensland to play in pubs, community events and anywhere people gather.\n\nOche Matutina loves busting out moves … like playing his electric guitar behind his head. (ABC Western Plains: Catherine James)\n\nFr Matutina is the unlikely lead guitarist, wearing his priestly collar and pulling rock star moves like playing riffs with his guitar behind his head.\n\nFor the other band members, who are all Aboriginal, the fact he's a Catholic priest from Indonesia was unremarkable.\n\n\"He's just like us. The only difference is his job, you know,\" Kobie Lollback says.\n\n\"He's not pushing church values on us. He's pretty much just one of us, basically.\"\n\nMr Lollback says he gets asked more questions about the age difference between the band mates.\n\n\"They say, 'How do you guys play the same music when you're like 30 years apart?'\" he said.\n\n\"We just say we connect. It's very hard to explain, [but] if you play in a band, you know that you only connect with certain types of people.\"\n\nLoading...\n\nFather Rock'n'roll\n\nFr Matutina's reputation has spread throughout the vast Wilcannia-Forbes diocese with strangers waving hello to him on pastoral visits in towns hours of travel away from Bourke.\n\n\"People now know me wherever I go,\" he said.\n\n\"Before [I was] just going and there was no expression.\n\n\"But now — 'Father!!'\" He waved his hand frantically in imitation.\n\nHe might even have some groupies.\n\n\"Sometimes girls in the car [drive by] shouting, 'Father! Father!'\"\n\nHe has viewed it all as serving his first mission to be a priest as a sort of conduit to God by spreading the kind of happiness he believes music can offer.\n\nPastoral care in Bourke is Oche Matutina's primary focus and he has asked to stay for another three years. (ABC Western Plains: Catherine James)\n\n\"Faith is not just about coming to church. It is not just about praying in the church … it is about being together with people, sharing happiness, joy with the people.\n\n\"Outside there's many doctrines, many definitions … but for me it's simply like that — connection with people. That's faith.\n\n\"I want to show people God's kindness, God's love through myself.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/environment/climate-change/the-data-doesn-t-lie-it-s-getting-hotter-and-fossil-fuels-are-fanning-the-flames-20260109-p5nstm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The data doesn’t lie: it’s getting hotter and fossil fuels are fanning the flames",
        "publish_date": "Sun, 11 Jan 2026 13:30:00 +1100",
        "category": "finance",
        "authors": [
            "Amanda Mckenzie"
        ],
        "text": "I’m writing this as the CEO of the Climate Council, and also as a mum of two young children. Every time the temperature is forecast to soar into the high 30s and even 40s, the same question hits: how do I keep my kids safe? Not just comfortable. Safe.\n\nWhat’s often missed in the national conversation is that extreme heat is already one of Australia’s deadliest hazards. Between 2001-18, nearly 500 heat-related deaths were reported to coroners in Australia. More recently, a study estimated 1009 Australians died due to heatwaves between 2016 and 2019, with Queensland and NSW recording the highest death tolls.\n\nThe devastating fires in Victoria on the weekend. Credit: The Age\n\nIn recent days, fires have left scenes of devastation across Victoria, with the loss of homes mounting. Meanwhile, large swaths of the country have experienced severe to extreme heat, from Western Australia across South Australia, NSW and Tasmania. Daytime temperatures pushed into the mid to high 40s, with overnight minimums in the mid-20s, offering little relief after dark. Some communities recorded temperatures at least 8C to 16C above average. When nights stay hot, bodies can’t recover, and that’s when the health impacts become most serious.\n\nExtreme heat isn’t just “a hot day”. It isn’t the summer weather Australians grew up expecting. It is a dangerous, escalating threat, supercharged by the continued burning of fossil fuels. Extreme heat also hits the hip pocket. Families pay through higher power bills and rising insurance premiums.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/walker-wins-gold-in-switzerland-20260111-p5nt5x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Walker wins gold in Switzerland",
        "publish_date": "Sun, 11 Jan 2026 13:15:47 +1100",
        "category": "sports",
        "authors": [],
        "text": "Walker wins gold in Switzerland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/my-best-beach-20251229-p5nqk2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "My best beach",
        "publish_date": "Sun, 11 Jan 2026 13:08:41 +1100",
        "category": "finance",
        "authors": [],
        "text": "Opinion\n\nThe scene of unimaginable terror on December 14, Bondi is Australia’s most iconic beach. NSW Minister for Water Rose Jackson, born and bred in the eastern suburbs, reflects on why Bondi will endure as the dynamic beating heart of our city.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/affectionate-homage-to-disco-classics-not-enough-to-ignite-the-drama-20260109-p5nsy5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Affectionate homage to disco classics not enough to ignite the drama",
        "publish_date": "Sun, 11 Jan 2026 13:01:58 +1100",
        "category": "entertainment",
        "authors": [
            "Cameron Woodhead",
            "Marcus Teague"
        ],
        "text": "MUSICAL\n\nSaturday Night Fever ★★\n\nThe Athenaeum, until January 25\n\nA pop-cultural touchstone of the late ’70s, Saturday Night Fever was the film that made John Travolta a megastar and turned disco into a global phenomenon.\n\nIts soundtrack album remains one of the bestselling in history, with all those chart-topping bangers from the Bee Gees defining the sound of a musical genre that never really goes out of style. The songs alone should make a jukebox musical an appealing proposition, though the transition from screen to stage isn’t exactly a smooth move. If you’ve only seen the PG version of the film, you might not be aware of just how dark the storyline gets in the R-rated release: gang violence, gang rape, family violence, suicide, pervasive male chauvinism and misogyny.\n\nEthan Churchill (centre) strikes an iconic pose as Tony Manero with the cast of Saturday Night Fever. Credit: Ben Fon\n\nYoung Italian-American Tony Manero (Ethan Churchill) is stuck in an uninspiring job. His home life is tormented by a violent alcoholic father (George Kapiniaris), and his friends are toxic in the masculinity stakes: brawling with rival ethnic gangs and hanging at a local discotheque trying to seduce young women into having sex with them.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/shoppers-grab-groceries-by-torchlight-as-bushfire-leaves-yea-in-the-dark-20260111-p5nt54.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Shoppers grab groceries by torchlight as bushfire leaves Yea in the dark",
        "publish_date": "Sun, 11 Jan 2026 12:57:03 +1100",
        "category": "finance",
        "authors": [
            "Marta Pascual Juanola"
        ],
        "text": "“Next person. Cash only. You’ll need to be guided,” a worker manning the door at the Yea FoodWorks told those waiting outside the supermarket.\n\nThe town remained without power on Sunday morning as locals eagerly waited to stock up on supplies.\n\nLocals in Yea were forced to shop using torchlight on Sunday morning as the power remained off after the bushfires. Credit: Jason South\n\nInside the store, staff guided customers through the aisles in the dark with a torch and clipboard.\n\nSome were picking up coffee and milk, while others needed tomatoes, bread and Milo.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rams-clinch-playoff-win-with-38-seconds-left-20260111-p5nt5k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rams clinch playoff win with 38 seconds left",
        "publish_date": "Sun, 11 Jan 2026 12:20:04 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rams clinch playoff win with 38 seconds left\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/the-canadian-australian-who-wants-to-reverse-bradbury-his-way-to-olympic-gold-20251113-p5nf1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Canadian-Australian who wants to ‘reverse Bradbury’ his way to Olympic gold",
        "publish_date": "Sun, 11 Jan 2026 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "“The Reverse Bradbury?” Corey eventually echoes with a bemused look. “That’s interesting.” “Interesting” is code for the daftest thing he has ever heard, but at least he is smiling. Steve Bradbury celebrates Australia’s first-ever Winter Olympics gold medal at Salt Lake in 2002. Credit: Getty Images We park the Bradbury theory and move on to the next topic of conversation: how did he come to be an Australian? The story starts, he says, with his mother, Melanie, who was born in Canada but went to school and university in Sydney from the age of nine.\n\nLoading She moved to Australia with her parents in the late 1970s. Her father, Ronald Hawkes, helped discover a gold mine in Western Australia. Hawkes was a geologist and the general manager of Plutonic Gold. During the family’s time in Sydney, his company opened a pit in Western Australia, about 300 kilometres north-east of Meekatharra. In 1988, Melanie returned to Canada to finish her economics degree and met and married Trevor Corey. They spent time in Halifax and Toronto before settling back in their home town of Fredericton, New Brunswick. Corey was born in 1997.\n\nBut, as Melanie later explains down the phone from Canada, she never lost her connection to Australia. “For me and my sister, it was our formative years,” she says. “So much of my schooling was done there. I did the HSC [Higher School Certificate], and, you know, the extracurricular activities that you do – it’s more part of you than you realise. “My sister had a fantastic Aussie accent. I think mine was always just kind of mixed – my husband teases me because whenever I go back, it’s like a little light switch that comes back on.” Corey was first introduced to ice hockey by his father, but by the age of eight had lost interest in the puck.\n\n“I just want to skate fast,” he told his parents. For the next 15 years, he pursued speed skating, rising through the ranks until he was in the top six in the country. He then hit a speed hump. “It became apparent that there were certain skaters that were being given preferential treatment,” his mother explains. “And I had always sort of said, ‘You know if it doesn’t work out for you here, you can probably look to Australia’.” Brendan Corey’s skates during the quarter-finals at the 2022 Winter Olympics in Beijing. Credit: AP The seed was further sown when Corey met former Australian speed skater Richard Nizielski at an international competition in Montreal in 2019. Corey explained that his mother had been a one-time resident Down Under.\n\nNizielski countered with an offer: “If you can ever come to Australia, we can always use a good skater.” Then fate played a hand. Later that year, Corey missed selection for the Canadian team after being taken out by a teammate during a practice session and suffering concussion. Suddenly finding his career in limbo, he decided to move to Australia. “I’ve been living here on and off since 2019-2020,” Corey says. “I am usually here for two-to-three months of the year, and the other nine or 10, I’m overseas training.\n\n“I’ve been training in Italy for the past two years with the Italian Olympic team in short track.” While Corey has made Melbourne his new home, he says he is yet to find a favourite coffee shop or immerse himself fully in the city’s way of life. “I’ll go to the occasional AFL game, but I’m just enjoying the sights while I’m here, exploring the city, going to the beaches sort of thing,” he says. “I like to explore the country as a whole.”\n\nAs for his parents, Trevor and Melanie Corey immediately embraced their son’s choice. “I know other people, when Brendan went to Australia, kind of were considering it as well, but to them, it was like, ‘Oh, Australia’s so far’,” Melanie says. “Whereas for me, there was just no hesitation because I was familiar. It was not like a ‘here’ and ‘there’ kind of thing. It made sense, like it wasn’t foreign to me at all.” Melanie says her two children, Brendan and his sister Brianna, grew up hearing her speak fondly of Australia. “It was just kind of natural for them,” she says. “I think some of the words that I would use were Australian slang, and they got used to hearing that.\n\n“For example, the word ‘reckon’ – a lot of Aussies use ‘reckon’, but people don’t so much here. “And I would tell him he was ‘cheeky’, and that was another word that was not used here. So it was in their everyday life in some way.” Once it became apparent Corey would represent his new country at international level, he was made an Australian citizen. Brendan Corey crashes during the men’s 1000m quarter-finals in the Beijing 2022 Winter Olympic Games. Credit: Getty Images He skated for Australia in the men’s 1000m short track skating at the 2022 Winter Olympics in Beijing, but crashed out in the quarter-finals.\n\n“In this sport, the top two move on to the next round, and I was sitting in third on the last lap, so I thought, ‘I need to try something, I don’t want to just sit here and finish third’,” he explains. “I felt like I should try the pass, but I was a bit tight, and ended up being too tight.” Which brings us back to Bradbury. Corey was only five when the peroxide-blond Australian won the unthinkable gold. But even in Canada he knew his story well. They have since met several times face to face. “That was an incredible moment in sports,” Corey says. “I don’t think something like that will ever happen again.” So the “Reverse Bradbury” concept, winning from the front, is a possibility? “I like to be a part of the race, be in the action,” Corey concedes.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/nsw-good-food-guide/banks-cafe-20260111-p5nt55.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Banks Cafe",
        "publish_date": "Sun, 11 Jan 2026 11:50:38 +1100",
        "category": "finance",
        "authors": [
            "Erina Starkey"
        ],
        "text": "For breakfast by the water, nowhere will get you closer to the edge than Banks Cafe. This converted beach house has cocooning white interiors and a sunny timber deck, while picnic tables and striped umbrellas are set along the banks of the Hastings River.\n\nIt’s prime pelican territory, so keep an eye on your blue swimmer crab scrambled eggs and butter-poached prawn croissants. Open all day, the menu features beer-battered fish and chips for lunch, and pan-seared barramundi with fennel beurre blanc in the evening. Book ahead if you can – the queues can also bank up.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/in-trump-s-america-smart-robots-and-ai-mask-an-uncomfortable-future-20260102-p5nr6x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "In Trump’s America, smart robots and AI mask an uncomfortable future",
        "publish_date": "Sun, 11 Jan 2026 11:03:34 +1100",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "“Big screens are no longer the exception; they’re the expectation,” Samsung Australia’s Simon Howe said. Australia remains a top-10 market globally for premium televisions per capita – we love our screens even when budgets are tight. Hisense expanded its RGB MiniLED range with the UR Series, bringing premium display technology to accessible price points. The company’s partnership with French audio specialists Devialet continues, and for gamers, 180Hz refresh rates promise competitive advantage. Your AI assistant can recommend what to watch next. It cannot explain why the world outside your living room grows more volatile. The new TVs will undoubtedly be popular locally but what stood out most wasn’t the hardware. It’s the insistence that artificial intelligence must be embedded in everything. Samsung, LG and Hisense each spruiked new AI features full of promise. Tony Brown, LG’s television lead, made the pitch I heard all week: AI processes your content for optimal picture quality, scales up low-definition YouTube clips and navigates streaming abundance. Samsung’s “Visual AI Companion” lets you query sports statistics mid-game.\n\nYet the relentless AI branding still sits somewhere between actual innovation and a marketing arms race. After the pandemic drove a wave of TV upgrades, many consumers will be ready to upgrade again this year, particularly ahead of the FIFA World Cup. Questions about picture quality, size and price will still probably be more important than whether your TV can tell you which actor you’re looking at. Loading Lego’s surprise The most novel announcement wasn’t from a tech company at all. Lego unveiled Smart Play, which the company calls its biggest innovation in 50 years. Eight years in development, the system embeds sophisticated electronics into standard bricks. A chip smaller than a LEGO stud combines sensors, microphones and computing into a 2x4 footprint. These smart bricks form a “decentralised computing network” – models built by different children can interact without prior connection.\n\nFuturist Sally Dominguez, observing from the show floor, noted that purely digital AI products gave visitors “a really boring time walking around”, but when digital technologies create hybrid physical experiences, products can really sing. Literally, in the case of Lego. The Lego demonstration drew audience excitement – and even some gasps – in ways that another slightly slimmer laptop simply couldn’t. LEGO smart bricks are shown during a LEGO news conference ahead of the CES tech show. Credit: AP Julia Goldin, the company’s chief marketing officer, framed it as consumer driven rather than technology driven. “This innovation came through understanding how kids play,” she said in an interview. The platform extends physical play time, encourages storytelling and crucially doesn’t require a screen or power button. Children can simply start playing. The first Star Wars sets will be launched in March. Futurist Mark Pesce noted his hope that the system allowed unstructured play rather than constraining imagination to pre-programmed interactions. We’ll see.\n\nThe ‘zero-labour’ home The broader theme was domestic liberation through robotics. LG demonstrated CLOiD, an AI-powered home robot representing the company’s vision of bringing intelligence from screens into the physical world. The timeline for Australian homes? “A few years away”, but the direction is clear. Samsung’s AI smart kitchens and laundry appliances similarly point to a choreless future. An LG Electronics CLOiD home robot. Credit: Bloomberg More immediately, Ecovacs showcased robot vacuums with 30,000 pascals of suction and “perpetual runtime” batteries that fast-charge during cleaning pit stops. The company leads the Australian market and is integrating AI stain detection that identifies dried ketchup, sprays it, waits, then cleans. “You should be able to just decide that you want your floor cleaned, your windows cleaned, and let us take care of that,” says Karen Powell, Ecovacs’ Australian head.\n\nWhere was Australia? Dr Catherine Ball. Credit: Fairfax Walking the floor, you encounter national pavilions from South Korea, France and Israel. They are co-ordinated presences where startups cluster under a common flag, making it easier for buyers and investors to find them. Australia, conspicuously, had nothing. Dr Catherine Ball, a futurist who tracks the show, argues this represents a structural gap with very real costs. She says CES is one of the few places where buyers, investors, partners and media converge at scale – where a startup can move from “nice demo” to “let’s pilot this” in a single week. Australian founders hustle alone, making our IP harder to discover, harder to trust and easier to overlook. She says that means fewer warm introductions, fewer conversations about distribution and less visibility in rooms where shortlists get written and awards doled out. A co-ordinated “Team Australia” booth would create a single front door for startups, she says.\n\nIt’s a reasonable question whether Australia’s innovation ambitions are serious or merely rhetorical. We talk about becoming a technology exporter while leaving our entrepreneurs to navigate the world’s largest innovation show without institutional support. AI-enabled toys and robots were everywhere at CES. Credit: AP The uncomfortable truth As is often the case for the tech sector, CES exists in a bubble. Its 140,000 attendees were sealed off from reality in windowless convention centres. The overarching theme of the show was about making life easier and better, through AI, smart robots and bigger and brighter television sets. Yet on the same day we watched demonstrations of robot companions designed to eliminate loneliness, an ICE agent shot a woman through her windshield, just a couple of days after US forces captured Venezuelan President Nicolás Maduro in a military operation and flew him to New York.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/we-love-you-kyra-and-jess-arsenal-stand-with-cooney-cross-and-ill-mother-20260111-p5nt45.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘We love you Kyra and Jess’: Arsenal stand with Cooney-Cross and ill mother",
        "publish_date": "Sun, 11 Jan 2026 10:29:39 +1100",
        "category": "sports",
        "authors": [
            "Emma Kemp"
        ],
        "text": "Kyra Cooney-Cross is a long way from London’s Emirates Stadium, but Arsenal’s home ground was symbolically close to her during Saturday’s Women’s Super League match against Manchester United.\n\nDays after the Matildas midfielder rushed back to Australia to be with her mother, Jess, who has been diagnosed with a rare and aggressive form of cancer, her club teammates and supporters offered a series of moving tributes.\n\nArsenal players warm up in shirts in support of Kyra Cooney-Cross and her severely ill mother, Jess. Credit: Getty Images\n\nCooney-Cross shared late last week that she had left her club duties in North London and flown to Queensland, where Jess is in hospital with Stage 4 cholangiocarcinoma - bile duct cancer - for which there is no cure.\n\n“My mum is my hero, my best friend, my everything, and the person who has shaped every part of who I am,” she posted on Instagram.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/possibility-of-prince-harry-and-king-charles-reuniting-20260111-p5nt4l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Possibility of Prince Harry and King Charles reuniting",
        "publish_date": "Sun, 11 Jan 2026 09:51:34 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Possibility of Prince Harry and King Charles reuniting\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/the-next-ashes-series-is-only-18-months-away-here-s-what-australia-must-do-to-win-again-20260109-p5nsyd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The next Ashes series is only 18 months away. Here’s what Australia must do to win again",
        "publish_date": "Sun, 11 Jan 2026 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Geoff Lawson"
        ],
        "text": "Suitcases packed, hotel rooms vacated, sore heads and red eyes hidden under baseball caps and behind sunglasses, winners and losers alike face the same post-series exodus.\n\nEngland will scarper with tails between legs, hoping to dodge an inquisition from the press when they land at Heathrow. Some will find an isolated tropical island where English is not the first language, some will shed the whites of Test cricket and begin preparations for the smash and bash of the upcoming T20 World Cup.\n\nThe dogs bark and the caravan moves on. Most of England’s batters will have little problem adapting to the game’s shortest form. But their Test team will be in flux from now until forever if they continue to pursue an inflexible philosophy. It has not worked against a team that met force with cleverness in conditions they understand.\n\nThe tourists have not faced meaningful consequences for their failures, and they will continue to underachieve until they do. The nice thing for us is that we don’t give a tinker’s sledge about what England do. There are, however, some issues to be sorted with the home team.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-you-need-to-know-about-the-super-k-flu-variant/tdpgmr6b2",
        "title": "The 'Super-K' flu variant is spreading in Australia. Here's what makes it 'unusual'",
        "publish_date": "Sun, 11 Jan 2026 00:13:41 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A new strain of influenza known as 'Super-K', or the subclade-K variant, could be responsible for an unusual spring and summer boost in flu cases, epidemiologists say.\n\n\n\n\n\n\"The unusual thing here for Australia is the timing,\" WHO Collaborating Centre for Reference and Research on Influenza director Patrick Reading told SBS News.\n\n\n\n\n\n\"The not unusual thing is probably the symptoms,\" he said.\n\n\n\n\n\nReading recalls the subclade-K variant emerged towards the end of Australia and New Zealand's typical flu season, circulating in September rather than the winter months.\n\n\n\n\n\n\"That was responsible for elevated influenza cases throughout the spring and actually throughout the start of our summer in December as well.\"\n\n\n\n\n\nAccording to the Global Initiative on Sharing All Influenza Data (GISAID), the total lab confirmed cases of subclade-K in Australia so far currently sits at 1,083.\n\n\n\n\n\nA new report by the Australian Centre for Disease Control (ACDC) stated that subclade-K's rapid spread has the potential to put increased pressure on Australian health care services over the summer and into the 2026 influenza season.\n\n\n\n\n\n\"Current case numbers for influenza are higher than usual for this time of year compared to previous seasons,\" an ACDC spokesperson said.\n\n\n\nSo far this year, over 4,100 cases of influenza have been confirmed by laboratories, with the true number of flu cases likely to be higher.\n\n\n\n\n\nBy comparison, in the first quarter of last year, an average of around 3,300 cases were confirmed weekly.\n\n\n\nWhat was the cause of the subclade-K flu variant?\n\n\"Every few decades, a flu virus can undergo a much larger genetic change called antigenic shift, which can lead to a pandemic, but this is not what has happened with super-K,\" University of South Australia epidemiology professor Adrian Esterman said.\n\n\n\n\n\n\"Instead, super-K is best understood as a drifted version of the familiar H3N2 virus, with enough changes to allow it to spread more widely in populations with existing immunity.\"\n\n\n\n\n\nThe ACDC report noted Australian subclade-K viruses may have originated in or been imported from the US, following detections in the US in June and July last year.\n\n\n\n\n\nReading said there's no current evidence that the variant is more severe than a regular flu. What experts are seeing, however, is that it easily transmits.\n\n\n\n\n\n\"It appears that it's probably going to have an ability to at least be slightly less sensitive to antibody or vaccine-mediated protection,\" he said.\n\n\n\n\n\nDeakin University epidemiology professor Catherine Bennett told SBS News: \"This new subvariant of the H3N2 is that bit more immune evasive with these latest mutations in the part of the virus that allows it to invade our cells, making us more susceptible.\"\n\n\n\n\n\nBennett said the 2025 flu vaccine included H3N2, but not this specific class.\n\n\n\nLISTEN TO Influenza cases surge: time to get vaccinated say experts SBS News 06:40 English\n\n\"Flu vaccines wane in effectiveness, so people vaccinated back in April-May and only getting infected now won't have the same benefit,\" she said.\n\n\n\n\n\nHowever, the 2026 flu vaccine for the southern hemisphere has already been updated to include this variant, and will likely be available around April, Bennett said.\n\n\n\n\n\nEsterman said the flu vaccine remains worthwhile and provides important protection.\n\n\n\n\n\n\"It still significantly reduces the risk of severe disease.\"\n\n\n\nWhat does a typical flu season look like in Australia?\n\n\"When we get seasonal influenza every year in Australia, or anywhere, it's a combination of three viruses,\" said Reading.\n\n\n\n\n\nThere are two influenza A viruses — a H3N2 and H1N1 — and one influenza B virus.\n\n\n\n\n\nAccording to the Australian Centre for Disease Control, there were 365,261 reports of the flu in 2024. Cases spiked between May and August, and drastically dropped following the winter.\n\n\n\n\"As we move into spring, flu generally comes down in Australia, and then it's very low during summer,\" said Reading.\n\n\n\n\n\nLast year there were 502,493 reports of influenza, with cases clearly continuing until the end of the year following those winter months.\n\n\n\n\n\nAccording to GISAID, H3N2 subclade-K is driving an estimated 90 per cent of cases in the United States.\n\n\n\n\n\n\"What we saw around September [in Australia] onwards is the H1N1s and B viruses decreased, but we saw an increase in H3N2 viruses,\" Reading said.\n\n\n\nHow can I avoid catching the flu?\n\n\"People who are unwell should consider testing and should avoid mixing with other people as much as possible,\" Bennett said.\n\n\n\nREAD MORE Is it COVID or the flu? A new test that just hit pharmacy shelves will give you the answer\n\n\"Keep homes well-ventilated, hold gatherings outdoor if possible, and wear a mask in busy public indoor spaces if susceptible to more severe respiratory infections.\"\n\n\n\n\n\nNSW Health advises getting the annual flu vaccine, as well as practising good hand hygiene — including handwashing.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/bushfire-crisis-claims-homes-and-livelihoods/xdni787mt",
        "title": "Bushfire crisis claims homes and livelihoods",
        "publish_date": "Sat, 10 Jan 2026 11:09:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than a hundred structures have been lost and at least 300,000 hectares razed by multiple fires burning throughout Victoria.\n\n\n\n\n\nA state of emergency was declared in 20 local government areas on Saturday, with fire-fighting efforts concentrated on the fiercest blazes, including one in the state's centre and another in the northeast.\n\n\n\n\n\nThree people feared missing were located, with the trio unaccounted for since Thursday after fire destroyed their house in the hard-hit town of Longwood, about 50km north of Melbourne.\n\n\n\n\n\nEmergency Management Commissioner Tim Wiebusch said an early estimate that 115 structures had gone up in flames was expected to climb.\n\n\n\n\n\nThe toll includes: Ravenswood-Harcourt (50 structures), Longwood (30), Grass Flat (20), Yarroweyah (10) and Streatham (five).\n\n\n\nSignificant losses of livestock, cropping land and vineyards have occurred at most of the locations listed.\n\n\n\n\n\n\"We've also seen impacts to critical infrastructure, in particular the Bendigo railway line that has been impacted by fire and is now closed,\" Mr Wiebusch said.\n\n\n\n\n\nPeter Cookson, Little Yarra Country Fire Authority captain, recounted the terrifying experience of defending properties on Friday night in the regional town of Yarck.\n\n\n\nVery confronting\n\n\"All hell broke loose\", he said, with conditions intensifying to the point that his unit was forced to withdraw due to the danger.\n\n\n\n\n\n\"It just got so intense, we all had to get out of there,\" he said.\n\n\n\n\n\nAs he left the burning town, images of the hills and properties ablaze stayed with him.\n\n\n\n\n\n\"It was very confronting,\" Mr Cookson said.\n\n\n\n\n\n\"One of my last visions were the homeowners in their utes out in their paddocks, driving around with their big water tanks.\"\n\n\n\n\n\n\"We couldn't tell them what to do, it's their property. It's up to them whether they stay and we can't force them to leave.\"\n\n\n\n\n\n\"But that does sit in my mind.\"\n\n\n\n\n\nHe confirmed homes had been lost in the small town.\n\n\n\nLong way to go\n\nThere were 14 relief centres open across Victoria on Saturday, host to shocked families who had lost their homes or were waiting to hear more.\n\n\n\n\n\nEmotional locals attended a community meeting in Castlemaine, just outside Harcourt on Saturday, where they were given updates on the raging fire.\n\n\n\n\n\nVictoria was under a total fire ban on Saturday that was set to stay in place on Sunday.\n\n\n\n\n\nCFA chief officer Jason Heffernan said conditions had eased but there was a long way to go before fires were brought under control.\n\n\n\n\n\n\"Understand how the increased fire risk will impact you and ensure your fire plan covers all possible contingencies,\" he said.\n\n\n\nREAD MORE Should Australia give names to heatwaves?\n\nAuthorities confirmed a firefighter had been hospitalised with third-degree burns to his hands and a volunteer needed hospital treatment after being hit in the face by a hose.\n\n\n\n\n\nAn interstate firefighter also suffered a medical episode and was airlifted to Melbourne.\n\n\n\n\n\nAll three were recovering from their injuries.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/heatwaves-sydney-vulnerability-disadvantage-urban-heat-island/jqibb44oo",
        "title": "Not all suburbs are equal: How heatwaves can amplify inequality",
        "publish_date": "Fri, 9 Jan 2026 19:33:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Parts of the country have been sweltering through a heatwave that's set to continue in Sydney this weekend, with temperatures of around 42C expected on Saturday.\n\n\n\n\n\nBut urban heat is not distributed equally. In some parts of Sydney — particularly the western suburbs, where temperatures during heatwaves can be several degrees higher than in the east — the forecast for Saturday is even warmer.\n\n\n\n\n\nThe impacts of heat inequality are exacerbated during a heatwave. So why do some suburbs experience that heat more acutely, and can anything be done about it?\n\n\n\nWhy is it hotter in some suburbs than others?\n\nWhile western Sydney is frequently cited as an example of geographical heat inequality, similar dynamics can be observed in other parts of the country, such as Melbourne and Adelaide, with inland suburbs experiencing heatwaves more intensely than their coastal counterparts.\n\n\n\nRiccardo Paolini is an associate professor at UNSW's School of Built Environment. He said a combination of factors leads to some parts of a city being more vulnerable to heat than others.\n\n\n\n\n\nIn Sydney's case, he said the primary factor driving higher temperatures in the west compared to the coast during heatwaves was advection, hot air flowing from inland areas, blocking cooling sea breezes from reaching western suburbs.\n\n\n\n\n\n\"During a heat wave, this hot front penetrates farther and farther, up to the inner west, and therefore you have a greater prevalence of the heat wave over the western suburbs,\" he told SBS News.\n\n\n\n\n\nThis is compounded by the 'urban heat island' effect, in which urban areas are significantly warmer than rural areas due to the high density of hard surfaces, like buildings and roads that retain more heat than greener spaces.\n\n\n\n\n\nThese include pavements made of asphalt and concrete and dark roofing on houses and other buildings, combined with insufficient vegetation, green space and shade, particularly around homes.\n\n\n\n\n\n\"These very, very dark surfaces heat the air like the bottom of a pot heats the water when you're cooking pasta,\" Paolini said.\n\n\n\nWhy does it matter?\n\nThis increased vulnerability can have varied and significant effects on the individual and broader society, and can overlap with populations that experience socio-economic disadvantage, such as western Sydney.\n\n\n\n\n\nOllie Jay is a professor of heat and health at the University of Sydney.\n\n\n\n\n\nHe told SBS News that while there are areas that get hotter temperatures, often amplified by the built environment, it's also important to consider populations with higher vulnerability.\n\n\n\n\n\n\"So you've got people there that are more vulnerable to that level of heat stress,\" he said.\n\n\n\n\n\n\"People who are older, people who have a chronic disease, often people who don't have access to air conditioning, or all three of those things put together.\"\n\n\n\nLISTEN TO Nearly seven million Australians at risk from urban fires, new report warns SBS News 04:39 English\n\nAccording to advocacy group Sweltering Cities, renters and low-income households are more likely to live in homes that don't provide good natural insulation or cooling, nor have access to cooling options such as air conditioning.\n\n\n\n\n\n\"A lot of people who are most vulnerable to the heat actually don't have access to air conditioning,\" Jay said.\n\n\n\n\n\nPaolini said there was a correlation between high outdoor temperatures and physical activity, and that at a certain threshold, people simply stay at home or other indoor spaces that are cool.\n\n\n\n\n\n\"There's the effects of spending more money for electricity, bills for those who have air conditioning,\" he said.\n\n\n\n\n\n\"There's the sleep divide between coastal areas and inland areas, where people living in western suburbs have poorer sleep quality because of extreme heat during this period.\n\n\n\n\n\n\"It's getting worse over time.\"\n\n\n\n\n\nOne of the ways heat inequality is most acutely felt is when it comes to health.\n\n\n\n\n\n\"If we just think about the hospital cases [during a heatwave], both mortality and morbidity, then what we really see is that all of those numbers are massively amplified in people who are elderly … and people who have chronic diseases such as heart disease, kidney disease,\" Jay said.\n\n\n\nREAD MORE The reality virtually no Aussie can escape when a heatwave hits\n\nJay pointed out that beyond heat-related deaths, there were many other negative impacts below the surface when it came to negative health outcomes.\n\n\n\n\n\n\"You've got these other things that are happening inside the body when you get hot. It's not just your high body temperature. It's the fact that your heart has to work a lot harder to keep cool when you're exposed to the heat,\" he said.\n\n\n\n\n\n\"If you've got heart disease, that makes you much more susceptible to a heart attack. If you've got kidney disease, you're at much greater risk of kidney failure if you have dehydration. It's really quite complex and deep, broad impacts on human health and wellbeing across the lifespan.\"\n\n\n\n\n\nAs it stands, urban heat equality is set to intensify as the effects of climate change become more severe — with ocean temperatures continually rising and even less cooling sea breezes.\n\n\n\n\n\nPaolini said Australian heatwaves are starting to more closely resemble those in Europe, which have excess heat-related mortality during extended heatwaves.\n\n\n\n\n\n\"So they don't have [temperatures of] 48C, as in Penrith, but they have eight days in a row when the night temperature doesn't drop below 28C or 30C, or even 32C in some cities. If you don't have air conditioning, this means that you cannot sleep, and then people who already have pre-existing medical conditions are exposed,\" he said.\n\n\n\n\n\n\"It's looking to a not-so-nice future for us, because urbanisation is increasing, density is increasing. With poor planning, that's where we are headed.\"\n\n\n\nWhat can be done?\n\nIn Sydney’s west, there's been a growing push to plant more trees and increase tree canopy coverage to combat the urban heat island effect and reduce the impact of heatwaves.\n\n\n\n\n\nPaolini said that while councils have focused on increasing the targets for tree canopy coverage, \"in reality it's decreasing, because a lot of new developments, these urban sprawl developments, they chop off every tree and then they put out a few broomsticks without any room for the roots to grow\".\n\n\n\n\n\n\"After 10 years, the tree is still a broomstick,\" Paolini said. \"This means that the tree is not casting shadow over the street, and this means that the asphalt is absorbing a lot of solar radiation that then is dissipated by convection, so warming up there ... People want bigger houses, and this is eating up the space for the tree roots. That's a reality.\"\n\n\n\n\n\nMore broadly, Paolini pointed to projects like the Greater Sydney Heat Smart City Plan — led by council and contributed to by several research groups — aiming to mitigate extreme heat impacts across the region.\n\n\n\n\n\nHowever, he said a lot of governance structures are fragmented, despite the problem being regional.\n\n\n\n\n\n\"So even if you put all your best landscaping and all the best urban planning in one council area, it will improve the situation, but it's like operating the air conditioning with the windows open.\"\n\n\n\nPaolini said positive steps included a decrease in dark roofing as, since 2022, the National Construction Code included provisions for a minimum level of solar reflectance for new houses built. There's also a maximum solar absorptance — the amount of solar heat a roof takes in — of 64 per cent for new housing.\n\n\n\n\n\n\"It's a good start. The problem is, what do we do with what has already been built over the previous 50 years?\"\n\n\n\n\n\nJay said it was vital that steps be taken to mitigate the \"steady march\" of climate change, such as decarbonising the economy and committing to the end of mass fossil fuel use.\n\n\n\n\n\n\"There's warming that's baked into the climate system that we're going to feel the effects for the next 30 years, at least, even if we were to stop using fossil fuels today,\" he said.\n\n\n\n\n\n\"So we've got to think about how we adapt.\n\n\n\n\n\n“We can think about the way that buildings are built, making sure there's better glazing, there's fans installed, that you haven't got direct sunlight coming in. Better exterior blinds, better insulation in walls and roofs. These are the types of adaptations that reduce the amount of heat that gets into the indoor environment from the hot weather outside.”\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/is-a-300bn-mega-mining-merger-back-on-the-cards/1gadc4s1i",
        "title": "Is a $300bn mega mining merger back on the cards?",
        "publish_date": "Fri, 9 Jan 2026 06:27:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/environment/climate-change/the-data-doesn-t-lie-it-s-getting-hotter-and-fossil-fuels-are-fanning-the-flames-20260109-p5nstm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The data doesn’t lie: it’s getting hotter and fossil fuels are fanning the flames",
        "publish_date": "Sun, 11 Jan 2026 13:30:00 +1100",
        "category": "finance",
        "authors": [
            "Amanda Mckenzie"
        ],
        "text": "Advertisement\n\nEnvironmentClimate changeGlobal warming Opinion The data doesn’t lie: it’s getting hotter and fossil fuels are fanning the flames\n\nAmanda McKenzie January 11, 2026 — 1:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nI’m writing this as the CEO of the Climate Council, and also as a mum of two young children. Every time the temperature is forecast to soar into the high 30s and even 40s, the same question hits: how do I keep my kids safe? Not just comfortable. Safe. What’s often missed in the national conversation is that extreme heat is already one of Australia’s deadliest hazards. Between 2001-18, nearly 500 heat-related deaths were reported to coroners in Australia. More recently, a study estimated 1009 Australians died due to heatwaves between 2016 and 2019, with Queensland and NSW recording the highest death tolls. The devastating fires in Victoria on the weekend. The Age In recent days, fires have left scenes of devastation across Victoria, with the loss of homes mounting. Meanwhile, large swaths of the country have experienced severe to extreme heat, from Western Australia across South Australia, NSW and Tasmania. Daytime temperatures pushed into the mid to high 40s, with overnight minimums in the mid-20s, offering little relief after dark. Some communities recorded temperatures at least 8C to 16C above average. When nights stay hot, bodies can’t recover, and that’s when the health impacts become most serious. Extreme heat isn’t just “a hot day”. It isn’t the summer weather Australians grew up expecting. It is a dangerous, escalating threat, supercharged by the continued burning of fossil fuels. Extreme heat also hits the hip pocket. Families pay through higher power bills and rising insurance premiums.\n\nAdvertisement\n\nThe good news is that Australia is already changing how we power our lives. Renewables are rising, batteries are scaling up and households are electrifying, but we have to move faster and stop making the problem worse. Related Article Analysis\n\nExtreme weather The official temperature was 42 degrees – but western Sydney felt as hot as 55 degrees Heat doesn’t always leave a dramatic scar on the landscape. It doesn’t always make the nightly news in the same way a cyclone or a catastrophic bushfire does. But it is relentless. It overwhelms the body, especially for babies and young children, older Australians, outdoor workers, people with disability, and anyone without access to cool, safe housing. It can also put healthy people at risk, particularly anyone working or exercising outdoors. Heat is also brutally unfair. If you live in a well-insulated home with efficient cooling, you can shut the door on the worst of it. If you are in a poorly built rental or a heat-trapping home, you can’t. And here’s the truth we have to confront: heatwaves are already more frequent, more intense and longer-lasting. Coal, oil and fossil gas are heating the planet, and we are living with the consequences. Next week’s Copernicus annual climate update is likely to reinforce what the last decade has made clear: the world is heating fast, and every fraction of a degree now makes extreme heat more dangerous.\n\nAdvertisement\n\nWhen extreme heat hits, it doesn’t just harm health, it disrupts childhood. School becomes unsafe. Outdoor play becomes impossible. Sleep becomes fractured. Tempers fray. Learning drops. Related Article Updated\n\nBushfires Fires to burn for weeks after razing area twice the size of London Parents for Climate has documented a growing number of school closure days caused by extreme weather, including repeated closures in north Queensland due to extreme heat. They also warn the official lists only tell part of the story. And many schools, frankly, are not equipped. Whether a child can learn safely on a scorching day can come down to whether their classroom has air conditioning, shade, access to water and back-up power. In 2026 Australia, that should not be a lottery. Summers are getting more extreme, but the solutions are clear and they are already under way. We need to accelerate them. First, stop expanding fossil fuels and rapidly cut climate pollution by accelerating clean energy, electrification and efficiency. Second, make our communities safer through better heat planning, cooler homes, shaded streets, resilient schools, accessible public cooling spaces and stronger emergency preparedness. That means practical, achievable changes. Better building standards so homes are fit for a hotter Australia. Minimum energy performance standards so renters are not left to swelter. Strong workplace protections when heat becomes dangerous. And an energy system built for reliability in extremes, powered by renewables and storage, not old coal.\n\nAdvertisement\n\nRelated Article Bushfires Revealed: Why NSW faces extreme bushfire danger with fewer firefighters It also means being honest about who is paying. It is not fair that families are carrying the costs while fossil fuel companies keep pushing for more coal and gas. We know how to cut climate pollution and keep the lights on. We just need to move faster. As a mum, I want my kids to grow up in an Australia where summer still means fun, not fear. But we won’t get there by treating this as “just another heatwave”. This is climate change, in our streets and schools, in our homes. Extreme heat is already deadly. Fossil fuels are making it worse. And we can change course – if we choose to. Amanda McKenzie is CEO of the Climate Council.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/walker-wins-gold-in-switzerland-20260111-p5nt5x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Walker wins gold in Switzerland",
        "publish_date": "Sun, 11 Jan 2026 13:15:47 +1100",
        "category": "sports",
        "authors": [],
        "text": "Walker wins gold in Switzerland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/my-best-beach-20251229-p5nqk2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "My best beach",
        "publish_date": "Sun, 11 Jan 2026 13:08:41 +1100",
        "category": "sports",
        "authors": [],
        "text": "Far from being a bit cliquey with the interlopers from Sydney, these locals are ready to help, despite the odd jibe about the flashy Speedos.\n\nJanuary 11, 2026\n\nHamish Macdonald",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/shoppers-grab-groceries-by-torchlight-as-bushfire-leaves-yea-in-the-dark-20260111-p5nt54.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Shoppers grab groceries by torchlight as bushfire leaves Yea in the dark",
        "publish_date": "Sun, 11 Jan 2026 12:57:03 +1100",
        "category": "finance",
        "authors": [
            "Marta Pascual Juanola"
        ],
        "text": "Advertisement\n\nNationalVictoriaBushfires Shoppers grab groceries by torchlight as bushfire leaves Yea in the dark Marta Pascual Juanola January 11, 2026 — 12:57pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n“Next person. Cash only. You’ll need to be guided,” a worker manning the door at the Yea FoodWorks told those waiting outside the supermarket. The town remained without power on Sunday morning as locals eagerly waited to stock up on supplies. Locals in Yea were forced to shop using torchlight on Sunday morning as the power remained off after the bushfires. Jason South Inside the store, staff guided customers through the aisles in the dark with a torch and clipboard. Some were picking up coffee and milk, while others needed tomatoes, bread and Milo.\n\nAdvertisement\n\nHomewood local Fiona Purvis walked down the aisles looking for cartons of milk and a large tub of water. “We’re keeping our eskies full with just the essentials — milk and bread, butter,” she said. Shoppers at FoodWorks in Yea were forced to shop by torch. Jason South Purvis and her family decided to stay back and protect their 800-acre property, a 10-minute drive out of Yea on the banks of the Goulburn River. “We knew that we could protect the farm,” she said. “We’ve got about 200 head of cattle”.\n\nAdvertisement\n\nWorker Adam Kupke said the supermarket had a generator but it broke down overnight. “We’re just trying to do what we can for the people that need help, basically. It might get to a point where we’re gonna have to close, [but] we’re just doing this for the moment,” he said. Kupke said words could not describe the horror the region had experienced since the fires started. “I know so many people. I grew up in the area. It’s devastating, mate,” Kupke said.\n\nAdvertisement\n\nWhile hundreds of buildings and homes have been destroyed, no lives have been lost – but there have been many stories of close calls. Just north of Yea, at a remote property on Caveat-Dropmore Road, police made a dramatic air rescue, evacuating two generations of a family, including a 92-year-old man and the family’s cat. Police rescued a family at a remote property near Yea after their home was razed by fire. Police said on Sunday morning that they used the Air Wing on Saturday to evacuate the family, who had lost their home while trying to defend it and sought shelter in a shipping container on their property as the fire raged around them. “Two women, aged 59 and 82, and a 92-year-old man called emergency services Friday afternoon seeking assistance to evacuate their isolated property on Caveat-Dropmore Road,” Victoria Police said in a statement.\n\nAdvertisement\n\nRelated Article Updated\n\nBushfires Fires to burn for weeks after razing area twice the size of London “After trying to manage the conditions for two days, including the complete loss of their home by fire, the 59-year-old woman called for help with concerns for the health of her mother and uncle. “Police have been told the family bunkered down and sought safety in a shipping container on their property as the fire swept through the area on Wednesday, 7 January. The trio also slept in their vehicle Friday night.” Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rams-clinch-playoff-win-with-38-seconds-left-20260111-p5nt5k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rams clinch playoff win with 38 seconds left",
        "publish_date": "Sun, 11 Jan 2026 12:20:04 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rams clinch playoff win with 38 seconds left\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/the-canadian-australian-who-wants-to-reverse-bradbury-his-way-to-olympic-gold-20251113-p5nf1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Canadian-Australian who wants to ‘reverse Bradbury’ his way to Olympic gold",
        "publish_date": "Sun, 11 Jan 2026 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "“The Reverse Bradbury?” Corey eventually echoes with a bemused look. “That’s interesting.” “Interesting” is code for the daftest thing he has ever heard, but at least he is smiling. Steve Bradbury celebrates Australia’s first-ever Winter Olympics gold medal at Salt Lake in 2002. Credit: Getty Images We park the Bradbury theory and move on to the next topic of conversation: how did he come to be an Australian? The story starts, he says, with his mother, Melanie, who was born in Canada but went to school and university in Sydney from the age of nine.\n\nLoading She moved to Australia with her parents in the late 1970s. Her father, Ronald Hawkes, helped discover a gold mine in Western Australia. Hawkes was a geologist and the general manager of Plutonic Gold. During the family’s time in Sydney, his company opened a pit in Western Australia, about 300 kilometres north-east of Meekatharra. In 1988, Melanie returned to Canada to finish her economics degree and met and married Trevor Corey. They spent time in Halifax and Toronto before settling back in their home town of Fredericton, New Brunswick. Corey was born in 1997.\n\nBut, as Melanie later explains down the phone from Canada, she never lost her connection to Australia. “For me and my sister, it was our formative years,” she says. “So much of my schooling was done there. I did the HSC [Higher School Certificate], and, you know, the extracurricular activities that you do – it’s more part of you than you realise. “My sister had a fantastic Aussie accent. I think mine was always just kind of mixed – my husband teases me because whenever I go back, it’s like a little light switch that comes back on.” Corey was first introduced to ice hockey by his father, but by the age of eight had lost interest in the puck.\n\n“I just want to skate fast,” he told his parents. For the next 15 years, he pursued speed skating, rising through the ranks until he was in the top six in the country. He then hit a speed hump. “It became apparent that there were certain skaters that were being given preferential treatment,” his mother explains. “And I had always sort of said, ‘You know if it doesn’t work out for you here, you can probably look to Australia’.” Brendan Corey’s skates during the quarter-finals at the 2022 Winter Olympics in Beijing. Credit: AP The seed was further sown when Corey met former Australian speed skater Richard Nizielski at an international competition in Montreal in 2019. Corey explained that his mother had been a one-time resident Down Under.\n\nNizielski countered with an offer: “If you can ever come to Australia, we can always use a good skater.” Then fate played a hand. Later that year, Corey missed selection for the Canadian team after being taken out by a teammate during a practice session and suffering concussion. Suddenly finding his career in limbo, he decided to move to Australia. “I’ve been living here on and off since 2019-2020,” Corey says. “I am usually here for two-to-three months of the year, and the other nine or 10, I’m overseas training.\n\n“I’ve been training in Italy for the past two years with the Italian Olympic team in short track.” While Corey has made Melbourne his new home, he says he is yet to find a favourite coffee shop or immerse himself fully in the city’s way of life. “I’ll go to the occasional AFL game, but I’m just enjoying the sights while I’m here, exploring the city, going to the beaches sort of thing,” he says. “I like to explore the country as a whole.”\n\nAs for his parents, Trevor and Melanie Corey immediately embraced their son’s choice. “I know other people, when Brendan went to Australia, kind of were considering it as well, but to them, it was like, ‘Oh, Australia’s so far’,” Melanie says. “Whereas for me, there was just no hesitation because I was familiar. It was not like a ‘here’ and ‘there’ kind of thing. It made sense, like it wasn’t foreign to me at all.” Melanie says her two children, Brendan and his sister Brianna, grew up hearing her speak fondly of Australia. “It was just kind of natural for them,” she says. “I think some of the words that I would use were Australian slang, and they got used to hearing that.\n\n“For example, the word ‘reckon’ – a lot of Aussies use ‘reckon’, but people don’t so much here. “And I would tell him he was ‘cheeky’, and that was another word that was not used here. So it was in their everyday life in some way.” Once it became apparent Corey would represent his new country at international level, he was made an Australian citizen. Brendan Corey crashes during the men’s 1000m quarter-finals in the Beijing 2022 Winter Olympic Games. Credit: Getty Images He skated for Australia in the men’s 1000m short track skating at the 2022 Winter Olympics in Beijing, but crashed out in the quarter-finals.\n\n“In this sport, the top two move on to the next round, and I was sitting in third on the last lap, so I thought, ‘I need to try something, I don’t want to just sit here and finish third’,” he explains. “I felt like I should try the pass, but I was a bit tight, and ended up being too tight.” Which brings us back to Bradbury. Corey was only five when the peroxide-blond Australian won the unthinkable gold. But even in Canada he knew his story well. They have since met several times face to face. “That was an incredible moment in sports,” Corey says. “I don’t think something like that will ever happen again.” So the “Reverse Bradbury” concept, winning from the front, is a possibility? “I like to be a part of the race, be in the action,” Corey concedes.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/nsw-good-food-guide/banks-cafe-20260111-p5nt55.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Banks Cafe",
        "publish_date": "Sun, 11 Jan 2026 11:50:38 +1100",
        "category": "finance",
        "authors": [
            "Erina Starkey"
        ],
        "text": "For breakfast by the water, nowhere will get you closer to the edge than Banks Cafe. This converted beach house has cocooning white interiors and a sunny timber deck, while picnic tables and striped umbrellas are set along the banks of the Hastings River.\n\nIt’s prime pelican territory, so keep an eye on your blue swimmer crab scrambled eggs and butter-poached prawn croissants. Open all day, the menu features beer-battered fish and chips for lunch, and pan-seared barramundi with fennel beurre blanc in the evening. Book ahead if you can – the queues can also bank up.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/take-the-age-quiz-20230608-p5df2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Take The Age quiz",
        "publish_date": "Sun, 11 Jan 2026 10:59:41 +1100",
        "category": "finance",
        "authors": [],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nWHERE AM I?\n\nWhere is this building located? ARM\n\nNicknamed “The Dome”, this grotto-like building has been likened to an eggshell and giant brain. The $45.5 million structure contains a number of public spaces, including a cafe and exhibition space, and celebrated its 10th birthday last year. What is it, and where is it located? Check next week’s quiz for the answer.\n\nDecember 19th’s WHERE AM I? The Evan Walker Bridge connects Melbourne CBD to Southbank.\n\nThis summer edition quiz includes some of the best questions from The Age quiz last year. The regular quiz will return in its regular format from January 23.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/we-love-you-kyra-and-jess-arsenal-stand-with-cooney-cross-and-ill-mother-20260111-p5nt45.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘We love you Kyra and Jess’: Arsenal stand with Cooney-Cross and ill mother",
        "publish_date": "Sun, 11 Jan 2026 10:29:39 +1100",
        "category": "sports",
        "authors": [
            "Emma Kemp"
        ],
        "text": "Kyra Cooney-Cross is a long way from London’s Emirates Stadium, but Arsenal’s home ground was symbolically close to her during Saturday’s Women’s Super League match against Manchester United.\n\nDays after the Matildas midfielder rushed back to Australia to be with her mother, Jess, who has been diagnosed with a rare and aggressive form of cancer, her club teammates and supporters offered a series of moving tributes.\n\nArsenal players warm up in shirts in support of Kyra Cooney-Cross and her severely ill mother, Jess. Credit: Getty Images\n\nCooney-Cross shared late last week that she had left her club duties in North London and flown to Queensland, where Jess is in hospital with Stage 4 cholangiocarcinoma - bile duct cancer - for which there is no cure.\n\n“My mum is my hero, my best friend, my everything, and the person who has shaped every part of who I am,” she posted on Instagram.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/possibility-of-prince-harry-and-king-charles-reuniting-20260111-p5nt4l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Possibility of Prince Harry and King Charles reuniting",
        "publish_date": "Sun, 11 Jan 2026 09:51:34 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Possibility of Prince Harry and King Charles reuniting\n\nRoyal expert Russell Myers says there is a possibility of Prince Harry and King Charles reuniting as the Duke of Sussex returns to UK for court case.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/millions-of-instagram-users-sent-password-reset-emails-20260111-p5nt4e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Millions of Instagram users sent 'password reset' emails",
        "publish_date": "Sun, 11 Jan 2026 09:35:11 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/the-next-ashes-series-is-only-18-months-away-here-s-what-australia-must-do-to-win-again-20260109-p5nsyd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The next Ashes series is only 18 months away. Here’s what Australia must do to win again",
        "publish_date": "Sun, 11 Jan 2026 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Geoff Lawson"
        ],
        "text": "Suitcases packed, hotel rooms vacated, sore heads and red eyes hidden under baseball caps and behind sunglasses, winners and losers alike face the same post-series exodus.\n\nEngland will scarper with tails between legs, hoping to dodge an inquisition from the press when they land at Heathrow. Some will find an isolated tropical island where English is not the first language, some will shed the whites of Test cricket and begin preparations for the smash and bash of the upcoming T20 World Cup.\n\nThe dogs bark and the caravan moves on. Most of England’s batters will have little problem adapting to the game’s shortest form. But their Test team will be in flux from now until forever if they continue to pursue an inflexible philosophy. It has not worked against a team that met force with cleverness in conditions they understand.\n\nThe tourists have not faced meaningful consequences for their failures, and they will continue to underachieve until they do. The nice thing for us is that we don’t give a tinker’s sledge about what England do. There are, however, some issues to be sorted with the home team.",
        "source": "TheAge"
    }
]