[
  {
    "url": "https://www.9news.com.au/national/virgin-plane-makes-emergency-landing-at-brisbane-airport/e26ba04c-65ef-483c-adad-c043c43fece8",
    "title": "Fire starts on packed Virgin Australia plane as it lands",
    "publish_date": "Thu, 06 Nov 2025 21:02:51 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "A﻿ packed Virgin Australia passenger jet made a dramatic landing at Brisbane Airport overnight when a fire started in its brake system.\n\nFlight VA 454 from Darwin, which was carrying 178 passengers, had landed just before 7pm yesterday when the fire began.\n\nIt prompted an emergency response from airport firefighters, who quickly extinguished the blaze.\n\nFirefighters extinguished a brake fire in a Virgin Australia plane when it landed at Brisbane Airport on Thursday. (Aaron Mealing/Supplied)\n\nAll passengers and crew members were able to exit safely once the flames were brought under control\n\nVirgin Australia said today engineers would be inspecting the plane before it is returned to service.\n\n\"Airport firefighters responded to a brake fire on flight VA454 which occurred after landing at Brisbane airport last night,\" a spokesperson for the airline said.\n\n\"The fire was quickly extinguished, and all guests and crew disembarked normally and safely.\n\n\"We thank our crew and airport firefighters for their swift response.\n\n\"The safety of our guests and crew is always our highest priority.\"\n\nVirgin Australia said there were no delays to other services and the carrier does not anticipate impacts to today's scheduled flights.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/common-heartburn-blood-pressure-medications-linked-to-worse-breast-cancer-outcomes/6f3e2668-02c0-4f55-9344-59fca65fea1a",
    "title": "Some common meds linked to adverse breast cancer outcomes: study",
    "publish_date": "Thu, 06 Nov 2025 23:58:03 +0000",
    "category": "lifestyle",
    "authors": [
      "Nov"
    ],
    "text": "Common medications taken by millions of Australians have been linked to adverse outcomes for breast cancer patients, a new study has found.﻿\n\nThe study revealed a complex relationship between commonly prescribed medications and cancer outcomes but is not advocating anyone should stop taking medications without medical advice.\n\nResearchers from the University of South Australia and Flinders University set out to investigate how everyday items such as blood pressure pills, cholesterol-lowering drugs, and heartburn medication, may interact with cancer therapies.\n\nREAD MORE: Travel chaos looming as thousands of US flights to be scrapped\n\nCommon medicines could be linked to higher death rates from breast cancer. (MoleQL/iStock)\n\nThey found that proton pump inhibitors (PPIs) used to treat indigestion and heartburn were associated with poorer overall survival for breast cancer patients, and a 36 per cent higher risk of severe, treatment-associated side effects﻿.\n\nResearchers believe PPIs could interfere with the body's immune responses, or change how the body reacts to cancer drugs, though they note further investigation is needed.\n\nThe study, published in Cancer Medicine, also found that drugs commonly prescribed for heart disease or hypertension, such as beta-blockers, ACE inhibitors, angiotensin receptor blockers, and calcium-channel blockers, were linked to higher rates of severe side-effects from breast cancer treatment - but did not appear to affect overall survival rates.﻿\n\nDrugs such as statins and metformin, used to manage high cholesterol and diabetes respectively, showed no significant impacts on either survival or side effects.\n\nMedicines used to treat high blood pressure could be dangerous for breast cancer patients. (Getty)\n\nThe data was based on 19 major clinical trials involving 23,000 people, sponsored by pharmaceutical companies including Lilly, Pfizer and Roche, and is believed to be the largest and most comprehensive analysis of its kind in the world.\n\nLead author Dr Natansh Modi, from UniSA and Flinders University, said the findings revealed a complex relationship between commonly prescribed medications and cancer outcomes.\n\n\"Many women with breast cancer are also managing other chronic conditions such as high blood pressure, diabetes or acid reflux, meaning they are often taking multiple drugs at once,\" Modi said.\n\nREAD MORE: Musk on the cusp of being first ever trillionaire\n\n\"Our results don't suggest that people should stop taking their non-cancer medicines, but it underlines how important it is for doctors to regularly review patient medications because people are living longer and managing multiple health issues.\"\n\nCorresponding senior author, Flinders University Associate Professor Ashley Hopkins, said the findings show that patients taking PPIs in cancer treatment settings warranted closer attention in particular.\n\n\"It doesn't mean that patients should cease their reflux medication without medical advice, but clinicians should be alert to potential risks and review whether PPIs are genuinely needed,\" he said.\n\nIt's estimated over 20,000 people will be diagnosed with breast cancer in 2025. (Getty)\n\nThe researchers said the study highlighted the need for a more holistic approach to breast cancer management that considered all medications a patient was taking.\n\nThe authors have also called for follow-up studies to explore the biological reasons behind the observed drug interactions and to develop clinical guidelines for the safe co-prescription of these medicines during cancer therapy.\n\nThis year, the government estimates more than 20,000 people will be diagnosed with breast cancer, of which 3353 are predicted to die.﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/elon-musk-first-trillionaire-tesla-pay-packet-approved/a674adac-8ea7-454a-aea8-245907dddb7b",
    "title": "Tesla approves pay packet that could make Elon Musk the first trillionaire",
    "publish_date": "Thu, 06 Nov 2025 23:29:27 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Tesla shareholders approved a pay package that could make CEO Elon Musk , already the world's richest person, the world's first trillionaire.\n\nTesla announced that more than 75 per cent of shares voted in favour of the pay package during the company's annual shareholder meeting.\n\nThe vote didn't include the 15 per cent of the company that Musk already owns.\n\nElon Musk is on track to become the world's first trillionaire. (AP)\n\nMusk thanked the shareholders and the Tesla board soon after the vote was announced.\n\n\"I super appreciate it,\" he said.\n\nMusk doesn't take any salary, but the approved pay package comes in the form of a stock grant that would give him as much as 423.7 million additional Tesla shares over the next ten years.\n\nThose shares could be worth about $1.54 trillion, assuming the company reaches the $13 trillion market cap needed to have Musk qualify for the full potential payout.\n\nIn addition, Tesla needs to achieve a series of either operational or financial targets for him to get the full number of shares, which would be distributed in 12 equal blocks.\n\nGetting all the shares available under this package over the next ten years would be the equivalent of earning $423.5 million a day, dwarfing any other executive pay package in history.\n\nDemonstrators in Austin protest Elon Musk's pay deal. (AP)\n\nFor Tesla to reach the $13.09 trillion in market value needed, shares need to jump 466 per cent from today's stock price.\n\nThat's also about 70 per cent higher than the world's most valuable company, Nvidia, which hit a record $7.7 trillion market cap last week.\n\nMusk is already worth an estimated $728 billion according to Bloomberg's billionaire tracker, most due to his holdings in Tesla, as well as the other companies he controls, including SpaceX and xAI.\n\nA no vote today could have meant his exit from Tesla's CEO office.\n\nTesla's board said in a filing that Musk had raised the possibility of leaving the company if he didn't get the assurances of control that the pay package could grant him.\n\nHowever, the company has had a rocky year.\n\nTesla has lost popularity after Elon Musk embraced Donald Trump and far-right values. (CNN)\n\nSales and profits plunged in the first half and Tesla faces potential billions in lost revenue due to reduced US government support for electric vehicles.\n\nBut Musk and Tesla executives dismiss those problems, saying Tesla is shifting focus from merely selling EVs to selling self-driving cars, including a fleet of \"robotaxis,\" as well as humanoid robots.\n\nThose products and concepts are still under development and haven't gone on sale.\n\nThat means even with the passage of the pay package, it's not certain that Musk will ever see any of its potential hundreds of millions of shares.\n\nHe will need to straighten out the company's current problems and then live up to the big promises that he's made for the future.\n\nMusk said the robots will be bigger than the company's car business - or any other business, even.\n\n\"I think it's going to be the biggest product of all time by far,\" he said.\n\n\"So like bigger than cell phones, bigger than anything.\n\n\"I guess a way to think about it is that every human on Earth is going to want to have their own personal R2D2 or C3PO.\"\n\nHe even predicted Tesla's robots could replace surgeons, lead to the end of global poverty and re-shape the global economic order.\n\nHe claims they could be produced for $30,000 each, allowing the company to sell them for about the price of a car.\n\nMusk has insisted he needs the additional shares to have more control over the company, not because he wants so much more wealth.\n\n\"It's not like I'm going to go spend the money,\" Musk said on a call with investors last month.\n\n\"There needs to be enough voting control to give (me) a strong influence – but not so much that I can't be fired if I go insane.\"\n\nREAD MORE: Why thousands of Australians are buying and selling snack vending machines",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/us-government-shutdown-forces-flight-cuts/a3136e68-88bf-44da-b9a5-48aaee31eaa3",
    "title": "Thousands of flights to be cut across US airports amid government shutdown",
    "publish_date": "Thu, 06 Nov 2025 22:56:05 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "America's busiest airports, including those in New York, Los Angeles and Chicago, were set to face thousands of flight cuts starting on Friday due to the government shutdown, according to a list distributed to the airlines and obtained by The Associated Press.\n\nThe Federal Aviation Administration's order to reduce air traffic at 40 of the busiest airports by 10 per cent across the US includes the popular gateways of Hawaii and Dallas for Australians flying to North America.\n\nWith just hours to go, airlines were scrambling to figure out where to cut, and travellers were waiting nervously to see if their flights would take off as scheduled.\n\nTravelers wait in long security lines at George Bush Intercontinental Airport, in Houston. (AP Photo Lekan Oyekanmi) (AP)\n\nA screen displays today's United Airlines flight information at O'Hare International Airport in Chicago. (AP Photo/Nam Y. Huh) (AP)\n\nThe cutback stands to impact thousands of flights nationwide because the FAA directs more than 44,000 flights daily, including commercial passenger flights, cargo planes and private aircraft.\n\nQantas services to the US have not been impacted, but the airline is monitoring the situation on a daily basis.﻿\n\nSome airlines planned to focus on slashing routes to and from small and medium-sized cities.\n\n\"This is going to have a noticeable impact across the US air transportation system,\" industry analyst Henry Harteveldt said.\n\nThe FAA said on Wednesday it would reduce air traffic by 10 per cent across \"high-volume\" markets to maintain travel safety as air traffic controllers exhibit signs of strain during the shutdown.\n\nThe affected airports include busy connecting hubs and those in popular tourist destinations, including Atlanta, Denver, Dallas, Orlando, Miami, and San Francisco. In some of the biggest cities - such as New York, Houston and Chicago - multiple airports will be affected.\n\nA sign is posted near a sedurity screening area at Philadelphia International Airport in Philadelphia. (AP Photo/Matt Rourke) (AP)\n\nControllers already have missed one full paycheck and are scheduled to again receive nothing next week as the shutdown drags on.\n\nThe FAA has been delaying flights at times when airports or its other facilities are short on controllers.﻿\n\nEven if the government reopens on the weekend, travellers should expect there to be residual impacts from the shutdown as the US public holiday of Thanksgiving approaches, and even in to Christmas, according to the president of the National Air Traffic Controllers Association, Nick Daniels.\n\n\"It will take us months to come out of all the impacts that it's causing ... There were delays before the shutdown. There's obviously delays during the shutdown. There's going to be delays after the shutdown,\" he said.﻿",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/parking-fine-queensland-logan-naturestrip/9d16bbce-4259-4385-8869-b2b6ba080d7f",
    "title": "Why a Queensland man's park has divided public opinion",
    "publish_date": "Thu, 06 Nov 2025 10:33:16 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "A man's \"courteous\" decision to leave his car on the lawn next to his friend's ﻿house has sparked debate online after he was fined more than $100 over the park.\n\nMaitland Hanley thought he was being considerate by parking his van on the nature strip next to the driveway while visiting a friend in Logan last month.\n\n\"There's not a lot of space on these roads for people to park, so I thought, you know what, I'll just park up on the grass so I'm not in the way of anyone,\" Hanley said.\n\nREAD MORE: Four bodies found after house fire in central Queensland\n\nMaitland Hanley thought he was being considerate by parking his van on the nature strip next to the driveway while visiting a friend in Logan last month. (9News)\n\nBut Hanley's decision backfired when a $111 fine showed up in the mail.\n\n\"I think it's ridiculous. I tried to fight it and they weren't having it,\" he said.\n\nThe offence - stopping on a nature strip - is illegal under Australian road rules and enforced by local councils with varying penalties.\n\nTwelve other fines have been issued on the same street in the past year. ﻿\n\n\"Imagine someone that is struggling to make like a weekly wage and they get a $111 fine,\" Hanley said.\n\nThe offence - stopping on a nature strip - is illegal under Australian road rules and enforced by local councils with varying penalties. (9News)\n\nThe fine has divided public opinion after Hanley took to social media to air his frustrations, despite opting to pay the fine.\n\n\"It's real 50-50 to be honest, some people are like, they're rallying behind me and then there's the other 50 per cent that are like 'get on with it, get over it',\" he said.\n\nLegislation states a legally parked car must be within the property boundary, facing the direction of travel and have all wheels on the road.\n\nThere's a bylaw for roads narrower than six metres specific to Logan City Council that allows nature strip parking if there's still 1.2 metres of access.\n\n﻿\"The weirdest part for me is I was only there for like an hour,\" Hanley said.\n\n\"I hope that this can help in some way and some other people won't be parking on nature strips anytime soon.\"\n\nLogan City Council said Hanley's park was \"in breach of parking rules issued under s 197(1) of the Transport Operations (Road Use Management – Road Rules) Regulation 2009, also known as Queensland Road Rules\".\n\n\"Council's role is to uphold the State legislation and enforce parking laws in the City of Logan,\" a spokesperson said in a statement.\n\n\"Nature strips and grass verges function as pedestrian thoroughfares and must remain clear to ensure safe access for all road users.\"",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/housing-crisis-austraia-grattan-institute-proposal-planning-reform/dfa50e17-94be-457c-b2c7-430bb0a9227c",
    "title": "Bold housing crisis proposal could wipe $100k off prices",
    "publish_date": "Thu, 06 Nov 2025 03:35:15 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "$100,000 could be slashed from the price of properties and rents also made significantly more affordable under an ambitious plan to drastically increase the number of homes built in Australia .\n\nThe proposal, put forward by independent think tank the Grattan Institute, calls on governments to allow three-storey townhouses to be built on residential land in capital cities without the need for planning permits.\n\nIt also says the same exception should apply to apartment blocks of up to six storeys near public transport hubs and \"key commercial centres\".\n\nHousing in Wyndham Vale in Melbourne's south-west. (Justin McManus)\n\nAuthors Brendan Coates, Joey Moloney and Matthew Bowes argued the changes – along with nine other recommendations put forward in the report – would help alleviate many of the issues that have caused Australia's housing crisis.\n\n\"Housing in Australia's major cities is among the least affordable in the world,\" they wrote.\n\n\"Restrictive planning controls add hundreds of thousands of dollars to the cost of new housing in our capital cities.\n\n\"For decades, Australia has failed to build enough homes in the places that people most want to live.\n\n\"Now we have a housing affordability crisis that is dividing families and communities and robbing young Australians of their best chance in life.\"\n\nThe authors said the plan would speed up construction projects. (Louie Douvis)\n\nBy providing default approval for those townhouses and apartments, new construction projects would be able to avoid time-consuming council and other government processes that the authors argue overwhelmingly favour a lack of development.\n\n\"The key problem is that state and territory land-use planning systems say 'no' to new housing by default, and 'yes' only by exception,\" they wrote.\n\nIt would also help Australian cities significantly increase their levels of population density, which currently lag well behind those seen overseas.\n\nREAD MORE: Microsoft apologises to millions of Australians\n\n﻿ The report says the proposed changes would lead to 67,000 homes being built a year, which would, in turn, cut rents by 12 per cent and reduce median prices by $100,000 over a decade.\n\nThe authors also argue the proposal could reduce Australian greenhouse gas emissions by providing more people with shorter commutes and would boost the national economy by up to $25 billion a year in the long term.\n\n\"Building more homes where people most want to live will make housing cheaper and create wealthier, healthier, and more vibrant cities,\" the report states.\n\nThe recommendations come just days after new research from Cotality found the cost of a median Australian home hit a new record high of $872,538, driven by the fastest price rise in more than two years – despite interest rates remaining somewhat restrictive at 3.6 per cent since August.\n\nPrime Minister Anthony Albanese during a visit to Pacific Link Housing in the NSW electorate of Robertson during the 2025 federal election campaign. (Alex Ellinghausen)\n\nThe Reserve Bank and other experts have consistently warned the housing crisis has been driven by a lack of supply.\n\nRBA Governor Michele Bullock has cautioned that, even though governments are starting to make promising moves to address the lack of construction, it is likely to be at least two years before property starts to get more affordable for Australians .\n\nWhile the federal government set a target of building 1.2 million new homes between last July and June 2029, it is already lagging well behind and faces little prospect of actually hitting that goal.\n\nThe Grattan report argues part of the problem is the $3.5 billion in incentives from the Commonwealth to the states for building more homes are poorly structured.\n\nThe authors said the federal government should pay those incentives in periodic instalments rather than a lump sum at the end of the five-year period, and that it should also pay the states to reform planning controls.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/banks-warned-on-rejecting-work-from-home-arrangements/e93ca327-68a0-453d-b244-1d582e8b6186",
    "title": "Push on big banks could change work-from-home rules for everyone",
    "publish_date": "Thu, 06 Nov 2025 01:28:28 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "T﻿he bosses of Australia's big banks have been warned they face a flood of cases unless they reassess rejected work-from-home requests.\n\nThe Finance Sector Union (FSU) said today it has written to senior executives in the sector calling for them to review their flexible work policies following a landmark decision against Westpac.\n\nThe ruling found the bank acted unlawfully when it denied a workers' request to work from home.\n\nThe Finance Sector Union has urged Australia's 'big four' banks to review rejected applications by employees for working from home arrangements.. (AAP Image/Joel Carrett)\n\nIn a letter, the FSU warns that employers could be breaching workplace law if they continue to reject flexible work requests without proper consideration, consultation or justification.\n\nThe Fair Work Commission ruled Karlene Chandler had the right to work from home full time after Westpac failed in its obligations under the Fair Work Act.\n\nShe sought to work remotely from her home south of Sydney to enable her to carry out school drop-offs and pick-ups for her two young children.﻿\n\nThe bank's failures included not responding within 21 days, not engaging genuinely with Chandler's request and not providing her specific reasons for refusing it, the commission found.\n\nThe FSU says the ruling sets a precedent that will have far-reaching consequences across the finance sector.\n\nWorking from home has become increasingly popular since the pandemic. (Getty)\n\nIt claims many employers have sought to impose blanket return-to-office mandates without consideration for workers' personal circumstances.\n\nThe FSU has identified other examples of work-from-home arrangement by finance workers that have ﻿been rejected by managers.\n\n\"Our members have proven they can deliver from home,\" said National Assistant Secretary Nicole McPherson.\n\n\"Flexibility is not a perk, it's a legal right and we'll keep fighting to make sure every worker in finance can exercise it.\"\n\nWestpac has been contacted for comment by 9news.com.au.\n\nHighest-paying jobs in Australia that don't need a degree View Gallery\n\nAustralian Bankers Association Simon Birmingham said working from home arrangements were best left to individual banks and their staff.\n\n\"Australian banks employ around 180,000 people in a wide variety of roles.\n\n\"Work from home has become a valued part of employment arrangements for banks and many of their employees but isn't possible in all circumstances all of the time.\n\n\"Flexible workplace arrangements are ideally matters for individual banks and their employees, who are best placed to together achieve outcomes that deliver the best for all parties.\"",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/nick-kyrgios-not-taking-aryna-sabalenka-lightly/105983950",
    "title": "Can Kyrgios beat the best female player in the world? He thinks so",
    "publish_date": "Fri, 07 Nov 2025 01:51:30 +0000",
    "category": "sports",
    "authors": [],
    "text": "Citing his special place in the tennis history books, Nick Kyrgios is \"very confident\" of taking care of Aryna Sabalenka in the sport's much-hyped and latest Battle of the Sexes showdown.\n\nBut Kyrgios admits he's wary of the world number-one's firepower and won't be taking Sabalenka lightly as he feels the full responsibility of protecting the reputation of the men's locker room.\n\n\"I was in Hong Kong recently, and a lot of the male players were like, 'Look, you're representing all of us'. So here I am in the firing line again,\" Kyrgios told AAP.\n\n\"I'm not no stranger to taking the heat from the media, but I'm excited, whatever the result may be.\n\n\"I'm going to go out there and show the world that as good as she is, she's got some weaknesses.\"\n\nKyrgios and Sabalenka will square off for two sets in Dubai on December 28.\n\nA first-10-point tiebreaker will be played if they split sets, with court dimensions 9 per cent smaller on Sabalenka's side, giving Kyrgios less room to land winners.\n\nAryna Sabalenka is the top female player in the world. (Getty Images: Amadolu/Artur Widak)\n\nBoth players will be limited to one serve per point.\n\nMindful that tennis is littered with women beating men in previous encounters down the years, Kyrgios said he'd be foolish not to be respectful of the Belarusian's game.\n\n\"Obviously, you've got one potentially, I think, one of the greatest of all time women's players and she's not even almost close to scratching the surface of what she can achieve,\" Australia's 2022 Wimbledon finalist said.\n\n\"I think she wins multiple more grand slams.\n\n\"She's honestly been talking a little bit more about this match than I have to be honest, but I'm ready to take the challenge, obviously.\n\n\"I'm going to go out there and, in all honesty, it's a lot of pressure for me too.\n\n\"The research said that men were not 9 per cent superior, but I guess with the dimensions they are using, it kind of evens it up as much as we can for us to go out there and compete.\"\n\nAsked for a scoreline prediction, Kyrgios was guarded but cited why he would win.\n\nNick Kyrgios has had to deal with a number of injuries in the past few years. (AP: Lynne Sladky)\n\n\"Look, I'm very confident,\" he said.\n\n\"I mean, look there have been 16 people that have ever walked the earth that have beaten the big three and the big four [of Roger Federer, Rafael Nadal, Novak Djokovic and Andy Murray].\n\n\"So I feel like I'm quite confident, but at the same time I'm very aware she's dangerous.\n\n\"If I go out there with a smaller court and she gets an early break, then the pressure starts hitting.\n\n\"It's not just about tennis at that point, and the crowd's definitely going to be on her side.\"\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nKyrgios insists there'll be no repeat of the late-night shenanigans at a Wimbledon village pub the night before facing Rafael Nadal on tennis's most famous centre-court before he faces Sabalenka.\n\n\"No way, no way,\" said Kyrgios, who is down to number 652 in the world, having only played six matches in three years due to wrist and knee injuries.\n\n\"I'm going to be ready. I'm fairly confident. I feel good about it.\"\n\nEver since Billie-Jean King put a 55-year-old Bobby Riggs in his place in the original Battle of the Sexes in 1973, women's stars have made a habit of showing up the men in exhibition matches.\n\nEvonne Goolagong Cawley trumped Ilie Nastase two years later, while Australian-born Brit Johanna Konta most recently defeated a 50-something former Wimbledon champion, Pat Cash.\n\nAAP\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/us-domestic-flight-cuts-in-government-shutdown-explained/105978408",
    "title": "US flights chaos looming amid shutdown cuts. Here's the advice for travellers",
    "publish_date": "Fri, 07 Nov 2025 01:43:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "United States aviation authorities are bracing for widespread travel disruption when as many as one in 10 domestic flight services are cut from daily operations at 40 major airports amid the ongoing government shutdown.\n\nThe halt to government work, which has become the longest political standstill in US history, has seen air traffic control staff members not coming to work because they are not being paid.\n\nTheir absences have caused flight delays, with more than 3.2 million passengers impacted nationwide.\n\nMore than 3.2 million passengers have already been impacted by a slowing or temporary pausing of air traffic operations in various parts of the US. (Reuters: Ryan Murphy)\n\nThe Federal Aviation Authority (FAA) this week said it planned to reduce national air traffic in the US by 10 per cent in \"high-volume\" markets from 6am Eastern Time on Friday (9pm Friday AEST) to maintain travel safety.\n\nThe Trump administration's Transportation Department later released a separate statement saying it only planned to cut flight numbers by 4 per cent, rising to 5 per cent on Saturday, 6 per cent on Sunday and up to 10 per cent by next week, Reuters reported.\n\nSo, what does that mean for the tens of thousands of domestic flights set to be cancelled, their passengers and the viability of air travel in the US in the immediate future? Here's what we know.\n\nFirstly, why did the US government shut down?\n\nThe US government has been subject to a political pause for 37 days, sparked on October 1 by furious Democrats, who are demanding President Donald Trump begin serious negotiations amid a stalemate over expiring healthcare subsidies.\n\nThe US government shutdown in numbers The ongoing federal government shutdown has surpassed the record for the longest in US history, leaving thousands of workers without pay. Here are some of the key numbers.\n\nThe shutdown has led to mass closures of federal agencies, left thousands of workers without pay and millions more without money to buy food.\n\nThe FAA has been slowing or temporarily halting air traffic at certain airports across the US whenever a safety concern arises due to a shortage of tarmac controllers, at times leading to hours-long travel delays.\n\nWhile some air traffic controllers are expected to continue working through the planned reductions, there have been instances of staff absences at airports across the country that have also led to flight disruptions.\n\nTransportation Secretary Sean Duffy has predicted that an ongoing shutdown could result in travel chaos, and said financial pressures on 13,000 air traffic controllers and 50,000 Transportation Security Administration (TSA) agents working without pay would only continue to intensify.\n\n\"If you bring us to a week from today, Democrats, you will see mass chaos,\" he said on Tuesday.\n\n\" You will see mass flight delays. You'll see mass cancellations, and you may see us close certain parts of the airspace, because we just cannot manage it because we don't have air traffic controllers. \"\n\nWhich airports will be impacted by flight cuts?\n\nBryan Bedford, the administrator of the FAA, said this week that reductions to domestic flights would be implemented to maintain air safety during a traditionally busy part of the year for travellers.\n\nThe Airlines for America trade group last year projected more than 31 million passengers planned to fly on US carriers over the November Thanksgiving holiday period, in a record increase from the year before.\n\nFlight reductions are being implemented due to staff shortages in air traffic control centres operating at major airports. (AP: Seth Wenig)\n\n\"When we see pressures building in these 40 markets, we just can't ignore it,\" Mr Bedford told a press conference.\n\n\"If the pressures continue to build even after we take these measures, we'll come back and take additional measures.\"\n\nA list of impacted airports was released by the FAA on Thursday, local time. The Associated Press reported that impacted major travel hubs included airports in Virginia, Texas, New York, California and Florida.\n\nEarlier in the week, aviation analytics firm Cirium predicted flight reductions in 30 of the US's busiest airports would result in as many as 1,800 commercial flights and more than 268,000 airline seats being impacted.\n\nAt least 760 flights scheduled for Friday were already cancelled by late on Thursday, according to the Flight Aware website — which equated to more than four times the number of cancellations the day before.\n\nAmerican Airlines, the US's largest commercial carrier, said in a statement on Wednesday that it expected the \"vast majority\" of its customers to be unaffected by the reductions but also cut about 220 flights.\n\n\"As schedule changes are made, we will proactively reach out to customers who are impacted. As always, we encourage all customers to check their flight status on aa.com or the mobile app,\" the statement said.\n\nSouthwest, the country's largest low-cost domestic carrier, said it was evaluating how the reductions would affect its schedule but confirmed cuts to about 120 services, while the Association of Flight Attendants-CWA, which represents 55,000 flight attendants at 20 airlines, called the shutdown \"cruel attacks on all Americans\".\n\nUnited Airlines would cut 4 per cent of its flights over the weekend based on guidance from the FAA, company spokesperson Josh Freed said. Delta Airlines said it would cancel up to 170 flights scheduled for Friday.\n\nThe FAA directs more than 44,000 flights daily, including commercial passenger flights, cargo planes and private aircraft.\n\nAirlines can face a $US75,000 ($115,000) fine for each flight operated over the limit, the FAA said. The agency also threatened to impose cuts if carriers did not make cuts equitably across communities.\n\nThree of the country's busiest airports, located in New York City and New Jersey, are set to be impacted by the reductions. (AP: Seth Wenig)\n\nUS-based airlines are used to dealing with cutting thousands of flights on short notice during severe weather, but the difference now is that these cuts during the shutdown will last indefinitely until safety data improves.\n\nWhat is the advice for travellers?\n\nThe Australian government's Smartraveller website says travellers should expect \"flight delays, longer queue times at a number of airports and increased processing times to issue US visas\" as a result of the shutdown.\n\n\"Check with your nearest US Embassy/Consulate or your travel provider to see if your travel plans have been affected,\" an advisory on the website says.\n\nAmerican Automobile Association spokesperson Aixa Diaz says some travellers in the US are already considering adjusting their plans and driving to destinations, but acknowledged that it was not an option for everyone.\n\nTravellers in the US are being advised to expect longer waits and to allow for more time at airports before scheduled flights. (AP: Matt Rourke)\n\nShe advised that people with booked trips tried to stay informed by downloading their airline's mobile app and monitoring it for updates to planned travel, checking airport websites for the latest information, and allowing for plenty of time at airports before a flight.\n\n\"It's frustrating for travellers because there's not much you can do. At the end of the day, you either fly or you don't,\" she said.\n\n\"You go on your trip and you roll the dice and you show up at the airport, or you choose to drive. So you don't have that many options.\"\n\nBarry Biffle, the head of low-cost carrier Frontier Airlines, also recommended travellers buy backup tickets with another airline to avoid being stranded.\n\nUnited, Delta Air Lines and American Airlines have all said that they would offer refunds to passengers who opted not to fly, even if they purchased tickets that were not normally refundable.\n\nHow could Australian travellers be impacted?\n\nIt will depend on the flight they take, according to Flight Centre CEO Graham Turner.\n\n\"Generally, international flights will be protected, from what we believe,\" he told the ABC.\n\n\"Assuming people are prepared for some disruption, the chances are that the international flights will be the last to be disrupted — that's the advice that we're giving to our customers in the States.\n\n\" If people can [fly] directly into their destination — whether it's LA or New York — the chances are that they should be OK out of Australia … If you have to have a domestic transfer, you may well have to wait a while. \"\n\nMr Turner also said Flight Centre would advise business customers, which made up most of the company's consumer base, to be aware that there would be fewer available seats during peak-hour services, longer delays at major airports and the chance of \"reduced redundancy\" — meaning a person's chances of booking onto another plane after a cancelled flight would be more difficult due to higher demand.\n\nWhat might happen next to travel in the US?\n\nMajor US airlines were this week still assessing how significantly the ongoing shutdown and reductions to flight numbers would impact their customers.\n\nAirlines for America, which represents major carriers such as Delta United, American and Southwest, said its members were trying to understand the next steps.\n\n\"We are working with the federal government to understand all details of the new reduction mandate and will strive to mitigate impacts to passengers and shippers,\" it said.\n\nSean Duffy says that the longer the federal government shutdown continues, the worse the impacts could grow on domestic flight operations. (AP: Jacquelyn Martin)\n\nAirlines have repeatedly urged an end to the shutdown since it began, and many major carriers have suffered significant dips in their share prices.\n\nSome airlines say the shutdown has not impacted their overall business, but have warned bookings could drop if the shutdown drags on.\n\nOn Tuesday, Mr Bedford said up to 40 per cent of air traffic controllers at the FAA's 30 largest airports were failing to show up for work. On Wednesday, that led to more than 2,100 flights nationwide experiencing delays.\n\nMr Duffy said the FAA wanted to take a proactive approach to solving the issue, instead of reacting after an aviation disaster, such as the deadly mid-air collision in January between a commercial jet and a military helicopter near Ronald Reagan Washington National Airport in Virginia.\n\n\"We learned from that, and so now we look at data and — before it would become an issue — we try to assess the pressure and try to make moves before there could be adverse consequences,\" he said.\n\n\"That's what's happening here today.\"\n\nLoading...\n\nABC/wires",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/overseas-workers-regional-shire-staff-wa/105944266",
    "title": "Overseas-born workers fill a void in regional communities",
    "publish_date": "Fri, 07 Nov 2025 00:59:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Councils in regional WA continue to face challenges in attracting and retaining staff to serve their local communities, with isolation a key factor.\n\nHowever, in WA's Midwest, overseas-born workers who are attracted to the country lifestyle and the spirit of local community are filling the void.\n\nCocos-Malay Adim Hajat is a community development officer who has packed up his life and family to call the region home.\n\nPerenjori has a population of about 630. (ABC Midwest Wheatbelt: Chloe Henville)\n\nMr Hajat grew up on an island with a population of 600 people.\n\nHe and his wife, Manisah Macrae, were attracted to the tight-knit community of Perenjori because it reminded them of life on the Cocos Islands.\n\n\"[The] Cocos Islands is a very small community, very cultural and traditional,\" he said.\n\n\"We look after family very well and we live with extended family, so for me community development is my kind of forte because I look after the community in the same way.\"\n\nSmall towns a place to flourish\n\nAdim Hajat with staff while working for the Cocos Islands shire. (Supplied: Adim Hajat)\n\nMr Hajat has worked in 10 local governments across his career, including remote Aboriginal communities, before moving to Perenjori last year.\n\nHe said his background helped to bring a different perspective to his role as a community development officer.\n\nAdim Hajat and his wife Manisah Macrae share their culture by cooking for the Perenjori community during events. (ABC Midwest Wheatbelt: Piper Duffy)\n\n\"As a community development officer I like to diversify and share my culture ... like with meals, that's how we share our life,\" Mr Hajat said.\n\n\"So smaller communities is fantastic to do that because they're very accepting because they want new people to come to town.\"\n\nMr Hajat said he had noticed other community development officers had migrated to shires in the region.\n\n\"There's places like Coorow where she's [the community development officer] Indonesian and the officer at Three Springs is from India,\" Mr Hajat said.\n\nAdim Hajat and his wife Manisah Macrae say the Perenjori community has welcomed them with open arms. (ABC Midwest Wheatbelt: Piper Duffy)\n\nCommunity is everything\n\nMuthuri Murithi, 27, works as a community development officer in the nearby town of Morawa after studying in Perth.\n\nHe attended boarding school while growing up in Nairobi, Kenya.\n\n\"Growing up with other kids just as part of your daily life because you're with them from Monday to Monday ... they become your community,\" Mr Murithi said.\n\n\"I feel like it shaped me in a unique way because growing up in Kenya the idea of community is people coming together as a whole.\"\n\nMuthuri Murithi with Morawa community members at a NAIDOC event. (Supplied: Muthuri Murithi)\n\nMr Murithi said although his upbringing helped bring a different perspective to regional living, it was important to understand the locals.\n\n\"In Australia when you think of community, you think of the people who are next to you, so your neighbour, local doctor, your teacher,\" he said.\n\n\" [Morawa] Is full of local farmers and other people who service the region and they all have different needs ... you need to be able to adapt to that. \"\n\nMuthuri Murithi says regional life offers adventure. (Supplied: Muthuri Murithi)\n\nMr Murithi said the Midwest had been an easy place to settle into and the region had unique experiences to offer.\n\n\"I had already travelled to Australia from Kenya so I was like 'this can't be too bad', I've already travelled way longer,\" he said.\n\n\"You get to say hi to people when you're driving, people wave at you, it's just a different feeling.\n\n\"I had given up on camping from previous experiences but now [in Morawa] I love just being out in the wild.\"\n\nKaren Chappel says once people settle in regional areas, they are happy. (ABC News: Jack Stevenson)\n\nAttracting staff a challenge\n\nWA Local Government Association president Karen Chappel said attracting and maintaining staff in regional WA continued to be a challenge.\n\n\"There's a population shift that we know to larger centres and we are also competing with other industries,\" Ms Chappel said.\n\n\"We have to think outside the square for our workforce recruitment, which isn't easy.\n\n\" WA is so large and most small country towns are four or five hours from the nearest centre and psychologically that's a big step for people. \"\n\nKaren Chappel says rural towns are welcoming places. (ABC Midwest Wheatbelt: Chloe Henville)\n\nMs Chappel said many local governments were using staff housing as an employment incentive.\n\n\"The challenge for us is to recruit people but generally, once they're with us, they're happy,\" she said.\n\nMs Chappel said community development officers moving from different backgrounds was important to help the region continue to grow.\n\n\"They bring youth and diversity and always seem to have good spirits, willing to assimilate within our communities,\" she said.\n\n\"Rural towns welcome everybody and it doesn't matter what agency you come from or who you work for, everyone becomes part of your life.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/daly-cherry-evans-leaves-manly-for-roosters/105983484",
    "title": "Cherry-Evans confirms historic switch after 352-game Manly career",
    "publish_date": "Fri, 07 Nov 2025 00:35:43 +0000",
    "category": "sports",
    "authors": [],
    "text": "Manly great Daly Cherry-Evans has completed one of the most high-profile shifts in NRL history, joining the Sydney Roosters.\n\nCherry-Evans's departure marks the first time a player with 350-plus games has ever changed clubs.\n\nThe arrival of the veteran, who is set to partner Sam Walker in the halves, shapes as a significant boost to the Roosters' premiership hopes.\n\n\"Daly's experience and understanding of the game will be a strong addition to our group and we're excited to welcome him to the Roosters,\" coach Trent Robinson said in a statement on Friday.\n\n\"I'm looking forward to working with him.\"\n\nThe 36-year-old will formally join the Roosters later this month.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nAs the only remaining active NRL player born in the 1980s, Cherry-Evans shocked the league in March by revealing he would leave the Sea Eagles at season's end.\n\nThe Roosters have long been considered the frontrunners for Cherry-Evans's signature.\n\nCherry-Evans leaves an immense void at Manly; statistics indicate no single player at any club has had a bigger and better impact in the past two decades.\n\nNo player in NRL history has started more games at halfback for one club, with all 352 of his matches coming there since winning a premiership in his rookie 2011 season.\n\nThe former Manly captain's 29 field goals are a record for the NRL era, as are his seven golden-point winners.\n\nCherry-Evans, dropped after game one of this year's State of Origin series, played 26 games for Queensland and 21 Tests for Australia.\n\nAAP\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/mount-gambier-surge-in-rooftop-solar-and-home-battery-uptake/105973904",
    "title": "SA city's bulk-buy renewables program drives surge in battery and solar uptake",
    "publish_date": "Fri, 07 Nov 2025 00:33:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Regional households are helping to drive a surge in home battery installations as more households look to slash their power bills.\n\nIn Mount Gambier, South Australia's largest city outside Adelaide, there has been a flurry of battery and solar panel installations in homes following the launch of a community bulk-buy renewables program.\n\nAcross Australia, more than 50,000 batteries have been installed since the federal government's Small-scale Renewable Energy Scheme was expanded in May to include batteries.\n\nIn July, the City of Mount Gambier launched a community renewables program in partnership with solar technology provider Shinehub, offering bulk-buying rates for home solar and battery systems to residents.\n\nNearly 100 households have so far signed up for the first round of the program in Mount Gambier. (ABC South East SA: Samuel O'Brien)\n\nCouncil environmental sustainability business partner Aaron Izzard said nearly 100 households had signed up for the first round of the program.\n\n\"Half of that is solar and battery systems and another 40 or so is just battery retrofits,\" Mr Izzard said.\n\n\" The number one motivator is electricity prices and reducing household costs. \"\n\nMr Izzard said he would like to see the partnership between the City of Mount Gambier and Shinehub replicated across regional South Australia.\n\n\"The whole reason for a bulk buy is so you can activate more of that economy of scale so you can get installers and the equipment down and do it all in one go,\" he said.\n\n\"I would encourage other councils to have a look at it.\"\n\nElisabeth Champion, who had her system installed about a month ago, said the installation had transformed the way her family used electricity at home.\n\nElisabeth Champion has taken up the scheme. (ABC South East SA: Samuel O'Brien)\n\n\"Our last bill was $90, most of which was service charges,\" she said.\n\n\"It's been delightful for me because I can't stand the cold. Every morning, I get up now and the heater is on.\n\n\"We wouldn't have done that previously; we'd turn the heater on when it's absolutely freezing.\"\n\nMs Champion decided to install a battery as well, allowing her to take advantage of the power her panels generated during the day.\n\nElisabeth Champion with her new battery. (ABC South East SA: Samuel O'Brien)\n\n\"[It] probably wouldn't have been worth it for us without the battery because it means that by 11 o'clock in the morning the battery is full and we can run the rest of the day just on the battery,\" she said.\n\n\"It just gives us a little bit more freedom to use power that we wouldn't have otherwise.\"\n\nBattery uptake accelerates\n\nAccording to the federal government's figures, household battery uptake is accelerating, with more than 50,000 batteries installed in homes across the country since the scheme was expanded.\n\nThe Royal Automobile Association of South Australia reported 65 per cent of solar systems it had installed in 2025 also included batteries, up from 29 per cent two years ago.\n\nSouth Australian households are taking up the Cheaper Home Batteries Program. (ABC News: Daniel Mercer)\n\nPrincipal advisor Peter Nattrass said South Australia was taking the lead, finding ways to save money on electricity bills.\n\n\"We have about 7 per cent of Australia's population, but we've seen 16 per cent of all the batteries under the Cheaper Home Batteries Program,\" he said.\n\n\"South Australian households are really tuning in that the premium feed in tariffs that were around 10 years ago are no longer there.\n\n\"We have days now during the middle of the day … where the entire state is run just on rooftop solar, which globally is something to behold.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/socceroos-name-teen-for-upcoming-friendlies-venezuela-colombia/105983334",
    "title": "Manchester United teen added to Socceroos squad",
    "publish_date": "Fri, 07 Nov 2025 00:14:32 +0000",
    "category": "sports",
    "authors": [],
    "text": "Manchester United teenager James Overy headlines 11 inclusions in the Socceroos squad as Jackson Irvine and Riley McGree make long-awaited returns from injury.\n\nOvery, who turns 18 this weekend, has earned his first senior call-up ahead of games against Venezuela and Colombia, having impressed with the Young Socceroos at the U20 World Cup.\n\nThe energetic Perth-born right-back recently signed his first professional contract with the Red Devils and had played under-19s for Scotland before committing to Australia.\n\nSocceroos coach Tony Popovic has indicated he will cast his selection net wide, while injuries to Alessandro Circati, Jordy Bos, Jacob Italiano and Aziz Behich also forced his hand.\n\nIrvine and McGree make long-awaited returns from foot injuries while Adelaide United skipper Craig Goodwin is also back in the squad — the only tested A-League Men player to feature.\n\nJackson Irvine has been named in the squad following injury. (Getty Images: Corbis/Steve Christo)\n\nAustralia face Venezuela on November 15 (AEDT) in Houston, Texas then Colombia in Queens, New York on November 19 (AEDT) — two of the host cities for next year's World Cup finals.\n\nWisła Płock striker Deni Jurić, the younger brother of former Socceroos marksman Tomi Jurić, earns his first call-up at 28.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nFresh off his first senior hat-trick, Sydney FC recruit Al Hassan Toure joins younger brother Mohamed Toure in the squad for the first time, with teammate Paul Okon-Engstler chasing a first cap.\n\nUncapped defender Jack Iredale (Hibernian) and one-cap defender Callum Elder (Derby County) are also among the European-based selections.\n\nMelbourne City goalkeeper Patrick Beach has earned his first call-up, replacing Joe Gauci, while teammate Kai Trewin has been rewarded for his fine form as a defensive midfielder.\n\nDaniel Arzani, Mitch Duke, Ajdin Hrustić, Hayden Matthews, Alexander Robertson and Patrick Yazbek drop out of the squad.\n\n\"It's another opportunity to expand the depth and introduce players who have not yet been exposed to the Socceroos environment or senior international football,\" Popovic said in a statement.\n\n\"We also welcome back some familiar faces, from Australia and abroad.\n\n\"I've had the chance to closely observe the opening rounds of the A-League season, and we believe this is the ideal time to integrate domestic players into the squad.\n\n\"We are delighted to be back in the United States to face strong South American opposition as we continue our preparations for the World Cup.\"\n\nSocceroos squad\n\nGoalkeepers: Patrick Beach*, Paul Izzo, Mat Ryan\n\nDefenders: Cameron Burgess, Miloš Degenek, Callum Elder, Jason Geria, Jack Iredale*, Lewis Miller, James Overy*, Kye Rowles\n\nMidfielders: Max Balard, Cameron Devlin, Jackson Irvine, Connor Metcalfe, Riley McGree, Paul Okon-Engstler*, Aiden O'Neill, Kai Trewin*\n\nAttackers: Martin Boyle, Nicholas D'Agostino, Craig Goodwin, Nestory Irankunda, Deni Jurić*, Al Hassan Toure*, Mohamed Toure\n\n* denotes uncapped players\n\nAAP\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/qld-plane-brake-fire-after-landing-brisbane-airport/105982588",
    "title": "Fire sparks on plane moments after landing at Brisbane Airport",
    "publish_date": "Thu, 06 Nov 2025 21:55:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Emergency services have put out a brake fire which was sparked moments after a plane landed at Brisbane Airport.\n\nVision posted to social media showed firefighters working to put out the fire on the Boeing 737, which travelled from Darwin and landed just before 7pm on Thursday.\n\nFour aviation fire rescue trucks worked to put out the fire, before the 180 passengers and crew on board Virgin Australia flight VA454 disembarked as normal.\n\nNo-one was injured as a result of the fire.\n\nFirefighters extinguished the blaze. (Instagram: Aaron Mealing)\n\nIn a statement, a spokesperson for Virgin Australia thanked the crew and airport firefighters for their \"swift response\".\n\n\"The safety of our guests and crew is always our highest priority,\" the statement read.\n\nIt is understood the plane will be inspected by Virgin Australia's engineering team before it returns to service.\n\nNo delays occurred as a result of the fire, and no services are expected to be impacted on Friday.\n\nThe blaze was quickly extinguished. (Instagram: Aaron Mealing)\n\nBrake fires not 'that common'\n\nSpeaking generally, aviation expert Keith Tonkin said brake fires could occur for a few different reasons, largely due to overheating.\n\n\"Some of the reasons the brakes can get hot are because they may have been sticking or grabbing or locked on,\" he said.\n\n\"Or it could be that the aircraft was overweight or the pilots, for some reason, had to hold the brakes for longer ... and cause a lot of energy to go into them during the landing.\"\n\nMr Tonkin said while brake fires are not \"that common\", they are \"relatively regular\" and something pilots are trained for and fire crews competent at responding to.\n\nIn most cases, he said the fires can be contained around the landing gear.\n\nWhen they occur at a place like an airport — where there are firefighters ready to respond — they can be extinguished quickly, allowing passengers to disembark \"in an orderly fashion\", Mr Tonkin said.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/oscar-piastri-says-he-still-has-what-it-takes-to-win-f1-champ/105982570",
    "title": "Piastri says he 'has still got what it takes' to win F1 crown",
    "publish_date": "Thu, 06 Nov 2025 21:51:55 +0000",
    "category": "sports",
    "authors": [],
    "text": "Oscar Piastri has offered a defiant response to critics who say he can not handle the pressure of the Formula One title battle, insisting: \"I know I've still got what it takes to win the championship.\"\n\nThe Australian's championship lead stood at a substantial 34 points after his Dutch Grand Prix triumph in Zandvoort at the end of August.\n\nHowever, it finally evaporated five races later as McLaren teammate Lando Norris's runaway victory last time out in Mexico City moved him a point ahead in the title race.\n\nThe deterioration in the previously dominant Melburnian's form, without a podium in his last four outings, has led to all sorts of barbs aimed at Piastri and the team, with former world champ Jacques Villeneuve labelling it a \"total collapse\".\n\n\"It is due to the effect of the pressure when you have to step up. And you react differently,\" Canada's 1997 winner Villeneuve claimed, suggesting Piastri had not been the same driver since the Azerbaijan Grand Prix, when he crashed twice and jumped the start.\n\nBut as he prepared for the São Paulo Grand Prix on Thursday, Piastri dismissed the idea of a crisis of confidence.\n\nHow to follow Oscar Piastri during the F1 grand prix this weekend Oscar Piastri enters this weekend's Formula 1 racing, trailing his teammate by one point in the drivers' championship. Here is how to follow the Formula 1 São Paulo Grand Prix.\n\n\"I mean, people can think what they want to think, right?\" he told Sky Sports.\n\n\"But for me, I know that I've still got what it takes to win the championship. Yeah, there's been some bumps along the road, but there's been bumps along the road for everyone this year at different points.\n\n\"So I'm confident I've learned a lot of helpful things, from the last couple of weekends in particular. And I'm confident as well that I can still perform at some of the heights of success we've had this year.\n\n\"There's still a lot of laps to go this year, and I'm very confident I can still win.\"\n\nPiastri has won seven races this term, looking an untouchable favourite at one point.\n\nYet his underpowered performances in the two most recent races in Austin and Mexico City, while teammate Norris flourished, have looked alarming.\n\nOscar Piastri is confident in his own ability. (Getty Images: Kym Illman)\n\n\"Austin and Mexico have been kind of two races that have been different to a lot of others. There were clearly some things that were just requiring very different driving, for whatever reason. So I think those two are similar,\" he said.\n\n\"But I don't think any of the races before that were were bad or catastrophic. There were some mistakes here and there, but learning from the last two weekends has been important.\"\n\nThe conspiracy theorists have also enjoyed floating the idea that McLaren have been favouring Norris in the run-in.\n\nEven Jos Verstappen, father of Red Bull's champion Max Verstappen who's still on the charge in the championship race just 36 points adrift of Norris in third, has happily been stirring the pot, telling Dutch newspaper De Telegraaf that Piastri and manager Mark Webber should \"bang fists on tables\" at McLaren over his treatment.\n\nMcLaren has said it would not favour either driver in the title run in, while Piastri shrugged off those claims.\n\n\"We can stand up for ourselves and I feel very comfortable doing that, and that's very much encouraged by the team to kind of make our point for ourselves individually,\" he said.\n\n\"I respect the team allowing us to both try and fight for the drivers' championship.\n\n\"I want to go out there and try and win the championship knowing I did it on my own merit and doing the things that I could do in my control … I don't think anything needs to change.\"\n\nAAP\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/china-imports-first-australian-canola-shipment-in-five-years/105974992",
    "title": "China imports first Australian canola shipment in five years",
    "publish_date": "Thu, 06 Nov 2025 21:51:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "After a five-year ban, the first shipment of Australian canola to China is expected to sail from a regional West Australian port this weekend.\n\nAnalysts say the 65,000-tonne trial shipment is a sign Australia's $4-billion canola export industry could reinstate trade with what was once one of its most valuable customers.\n\nAustralian canola was locked out of China in 2020 due to disease concerns, but a spat between China and the world's largest exporter of the product, Canada, could reopen the door for Australian farmers.\n\nAustralian exports of canola are expected to be worth more than $4 billion this season. (Supplied: Paul Goh)\n\nCBH Esperance Port zone general manager Paul Channon said the Armonia A docked on Wednesday and was expected to be loaded and to sail to Qingdao, in north-east China's Shandong province, on Saturday.\n\n\"We're lucky to be part of that shipment within our zone, and it's a welcome sight sitting out in the bay at the moment,\" he said.\n\nAccording to the federal Department of Agriculture, Fisheries and Forestry's Manual of Importing Country Requirements, Chinese state-run trading firm COFCO is the approved importer for canola at Qingdao.\n\nCBH's stem website lists the owner of the canola as CBH Grain, the trading arm of the grower-owned cooperative.\n\nCanola is a significant crop for Australian grain growers. (ABC Goldfields: Joanna Prendergast)\n\nFive-year lockout\n\nFive years ago Chinese authorities said the fungal disease blackleg was detected in a shipment of Australian canola and closed the trade.\n\nSince then, China, which is a significant canola producer in its own right, has relied significantly on imports of canola from Canada to top up its needs.\n\nBut earlier this year it blocked Canadian canola seed imports by imposing a massive tariff in a move thought to be related to a stoush over Canadian tariffs on electric vehicles.\n\nIn September, Australian government forecasting agency ABARES suggested the completion of a phytosanitary framework addressing China's concerns could pave the way for five trial shipments of Australian canola.\n\nOil-rich canola seed will be sent to China as part of the trial. (ABC Rural: Rose Grant)\n\nFuture potential\n\nAustralia is the world's second-largest exporter of canola and this year's 5.2-million tonne crop is expected to be worth $4.2 billion.\n\nThe majority of the canola exported comes from Western Australia.\n\nGrain Trade Australia chief executive Pat O'Shannassy said given that China was the world's largest buyer of canola, the reopening of trade could offer significant opportunities for Australian producers.\n\n\"The negotiation process around biosecurity and quarantine, it doesn't move as fast as, say, technology — once you lose access it is very difficult to get it back,\" he said.\n\nMr O'Shannassy said once the trial was complete it would be essential that government continued to negotiate for fully restored market access.\n\n\"Having more demand in the market is a good thing for growers … the China market for Australia, particularity for grains, is very important and long-standing,\" he said.\n\n\"If we can get that trade flowing again it will be significant for both Australia and China.\"\n\nA Department of Agriculture Fisheries and Forestry spokesperson said there was \"an active and ongoing government-government discussion\" and that details were yet to be finalised.\n\nGood news for prices\n\nIn its September market update ABARES predicted a moderate increase in canola prices for the coming harvest.\n\nDennis Voznesenski says China re-entering the Australia canola market would support prices. (ABC News: John Gunn)\n\nCommonwealth Bank agricultural economist Dennis Voznesenski said a formal resumption of Australian canola trade with China would be a significant boon for Australian farmers.\n\n\"It would definitely be supportive [of prices]\" he said.\n\n\"Fingers crossed that that shipment sails smoothly and we then have further shipments.\n\n\"Its incredibly important this year because our largest typical buyer, Europe, they had a much larger crop this year … so Europe wont need as much locally.\n\n\"So we're really in a place where where we need another buyer and if that buyer is China then that's really good news.\"\n\nMr Voznesenski said markets were volatile when driven by politics.\n\n\"With these shipments, you've got to keep in mind that, even if they are large purchases, even if it's from us or the US in the past, there are times that those shipments have been cancelled and that's what we've got to keep an eye on.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/charles-leclerc-announces-engagement-to-alexandra-saint-mleux/105982546",
    "title": "Ferrari star Leclerc announces engagement ahead of Brazilian GP",
    "publish_date": "Thu, 06 Nov 2025 21:47:58 +0000",
    "category": "sports",
    "authors": [],
    "text": "Charles Leclerc was all smiles at a news conference ahead of the Brazilian Grand Prix, where a good result could get him closer to fourth place in the drivers' standings.\n\nHis happiness, though, had more to do with developments off the track: he just got engaged.\n\nLeclerc will marry his long-time partner, Alexandra Saint Mleux.\n\n\"I'm very, very happy, obviously. It is a special week, full of emotions,\" Leclerc said.\n\n\"It's obviously a very special moment for anyone to do that step. And, yeah, Alex and I are incredibly happy.\"\n\nLeclerc sits fifth in the drivers' championship and can only move as high as fourth. (Getty Images: Mark Thompson)\n\nThe season itself has not given Leclerc as many reasons to celebrate. The Ferrari driver entered the year hoping to contend for the title, but with four races left, he only has fourth place left to fight for.\n\nHe is currently fifth, 54 points behind Mercedes driver George Russell.\n\nLeclerc, who finished a career-best second in the 2022 season, arrives at the iconic Interlagos racetrack on a good run after finishing second at the United States Grand Prix in Austin and in third place in Mexico City last weekend.\n\nHow to follow Oscar Piastri during the F1 grand prix this weekend Oscar Piastri enters this weekend's Formula 1 racing, trailing his teammate by one point in the drivers' championship. Here is how to follow the Formula 1 São Paulo Grand Prix.\n\n\"The momentum is with us. We've had a good last few races, which is a good thing, but we cannot really rely on the past for the future,\" Leclerc said.\n\n\"It's all about starting from zero again.\"\n\nFerrari also holds a one-point lead over Mercedes for second place in the constructors' championship, where McLaren has already secured the top spot.\n\n\"This weekend we are focusing step by step on what we can control and try and make our processes the best, the most perfect possible,\" Leclerc said.\n\n\"And then we'll see where we end up.\"\n\nLeclerc's best finish at Interlagos is fourth place in 2022. He came fifth in 2021 and 2024, and seventh in 2018.\n\n\"I hope that is finally the weekend where I get back on the podium here in Brazil,\" he said.\n\nBortoleto to make home debut\n\nA year ago, Gabriel Bortoleto watched the Brazilian GP from the outside as a McLaren academy driver. Now the Kick Sauber rookie will take part in his home race for the first time.\n\nThe 21-year-old Bortoleto will become the first Brazilian F1 driver racing at Interlagos since Felipe Massa in 2017.\n\nGabriel Bortoleto is set to make his F1 debut at his home race. (LAT Images: Andy Hone)\n\n\"I want to feel how it is, Interlagos and everything. But I don't see it pressure-wise. I don't need to perform better or worse because I'm in Brazil. It's the same thing. I'm going to do my job,\" Bortoleto said.\n\n\"I'm happy that my family is going to be around, and a lot of Brazilian fans, and that's for sure bringing a lot of good energy for me.\"\n\nEven though Bortoleto was born in Osasco, a city in the state of São Paulo located less than 40km from the racetrack, he does not view it as having a home advantage.\n\n\"It's a track I've not been to so many times in the past. I've driven here once, but four years ago with a GT car. So, I don't know the track very much,\" Bortoleto said.\n\n\"But I am very excited about driving here in front of the Brazilian crowd.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/nt-suncable-seeks-expansion-to-muckaty-station-solar-farm/105979824",
    "title": "Huge outback solar provider SunCable looks to expand",
    "publish_date": "Thu, 06 Nov 2025 21:36:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "An ambitious plan to construct Australia's largest solar farm in the outback has grown even grander in scale, with a bid launched to build a second farm on Muckaty Station.\n\nThe company behind the plans, SunCable, has for years been working towards building a 12,000-hectare solar farm near the Northern Territory town of Elliott with the aim of generating enough energy to power parts of the NT.\n\nLoading...\n\nSunCable says the project could eventually power the island nation of Singapore and parts of south-east Asia, via a subsea cable.\n\nDocuments lodged with the NT's Environmental Protection Authority show the company — which is backed by billionaire Mike Cannon-Brookes — is also proposing to build a second solar farm of a similar scale further south, on Muckaty Station.\n\nSunCable chief executive Ryan Willemsen-Bell told the NT Country Hour, if the plan was approved, the Muckaty farm would be a \"further area of generation capacity that can support the SunCable project\".\n\nMuckaty Station could soon be home to a new solar farm, if the proposal is approved. (AAP: Neda Vanovac)\n\n\"We're in the early stages of investigating that site,\" he said.\n\n\"What we have identified at the moment is approximately 50,000 hectares which we think is developable.\n\n\" We're not suggesting that all of that will be developed for solar, but that's the area of interest on the site we're investigating at the moment. \"\n\nIf constructed, the Muckaty site would be additional to the massive solar generation precinct proposed for Powell Creek Station, the adjoining northern property.\n\nMike Cannon-Brookes backs SunCable. (AAP: Mick Tsikas)\n\nThe Aboriginal-owned station, Muckaty, made headlines a decade ago when it was the subject of a contentious proposal to house a nuclear waste dump.\n\nThat plan was eventually knocked back.\n\nCould be making energy 'this decade'\n\nMr Willemsen-Bell said the company wanted to be able to provide surety his company's project had the infrastructure capacity to grow and meet future energy demands.\n\nMuckaty Station is a rural property in the heart of the Northern Territory. (ABC News: Caddie Brain)\n\n\"What's important is that we are able to provide the customers, that would offtake that energy, the certainty that we can meet the forward demand that they will have over time,\" he said.\n\n\" That we can meet the energy demands of the future. \"\n\nSunCable project receives environmental approval The remote NT project has received crucial approval from the federal government.\n\nHe did not clarify exactly when the first solar panels could be installed at Powell Creek, but said the project \"could be generating energy by the latter part of this decade\".\n\nThe Northern Land Council, which looks after the interests of Aboriginal landowners in the Muckaty area, said in a statement it had been \"engaging with SunCable\" over the plans.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/farm-frittes-factory-opposite-heavy-mineral-mine/105978190",
    "title": "$300m potato chip factory approved opposite heavy mineral mine",
    "publish_date": "Thu, 06 Nov 2025 21:29:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "A $300 million potato processing plant is expected to bring 250 new jobs to the small regional Victorian town of Dooen, population 250.\n\nOn Wednesday, the Victorian government approved the construction of the Farm Frites Australia manufacturing facility to be built alongside the Wimmera Intermodal Freight Hub, 8 kilometres north-east of Horsham.\n\nThe factory would operate around the clock, with capacity to process 250,000 tonnes of Australian-grown potatoes per year.\n\nFarm Frites supplies potato chips to major fast-food chains including KFC and Hungry Jacks.\n\nThe facility is expected to open in 2027.\n\nDooen in regional Victoria will soon be home to a $300 million potato processing plant. (ABC News: Mark Leonardi)\n\nMinister for Economic Growth and Jobs Danny Pearson said he was proud to support the company.\n\n\"We're proudly backing companies to invest in advanced manufacturing because we know it is key to unlocking economic growth and creating more opportunities for all Victorians,\" he said.\n\nThe planning permit for the potato facility was granted as part of the state's Development Facilitation Program, which fast-tracks decisions on projects expected to drive economic growth.\n\nThe potato plant would operate directly across the road from the proposed Avonbank mineral sands mine.\n\n'Excellent' location, neighbouring mine\n\nFarm Frites Australia general manager Kieran Prestidge said he considered the Wimmera town a strategic location.\n\n\"Dooen is perfectly located between the best growing regions in Australia and has excellent road and rail links, which will help us put more Australian produce on plates and tables all around the country,\" he said.\n\nActing Horsham Rural City Mayor Brian Klowss welcomed the project, but said he had some logistical concerns.\n\n\"We’re looking forward to welcoming Farm Frites to our region,\" Mr Klowss said.\n\nHowever, Mr Klowss said he was worried about the potato plant operating metres away from the proposed Avonbank mine.\n\nBrian Klowss welcomes the expansion to local industry but has some concerns. (ABC News: Gillian Aeria)\n\n\"I've got concerns about the whole precinct being as close to the proposed Avonbank mine, including hay exports,\" Mr Klowss said.\n\n\" I'm concerned about cross-contamination of our major industries. \"\n\nChinese-backed company Wim Resource plans to dig up 12.75 million tonnes of heavy-mineral concentrate, including critical minerals at the mine.\n\nWim Resource has been contacted for comment.\n\n'A sprinkling of critical minerals'\n\nVictorian Farmers Federation president Brett Hosking said it felt like the government was rushing to approve projects in the Wimmera without concern for possible consequences.\n\n“This facility sits within a few hundred metres of the proposed Avonbank Heavy Mineral Sands Project,\" Mr Hosking said.\n\nBrett Hosking says the Victorian government is rushing to approve projects in the Wimmera. (Supplied: GrainGrowers)\n\n\"It is dependent on a constant and reliable supply of production from Victoria's potato growers, who are currently at risk of having their production impacted by the proposed VNI West transmission project.\n\n\"It relies upon a strong local workforce, which is under pressure from the competing needs of rapidly expanding agricultural success in the region and now you've got these proposed new developments.\"\n\nMr Hosking said the government needed to evaluate its long-term priorities.\n\n\"We all love salt on our chips, although I feel we're less keen on a sprinkling of critical minerals.\"\n\nHousing demand pressure\n\nMember for Lowan Emma Kealy said housing hundreds of new workers would pose another challenge.\n\n\"We love to have them come along, but we already have a lack of housing, and they will need accommodation,\" Ms Kealy said.\n\n\" We've heard a lot of talk about an increase to housing from the Victorian government and we're just not seeing that in regional areas. \"\n\nEmma Kealy says more housing is needed near Horsham to accomodate the influx of workers. (Supplied: Emma Kealy)\n\nThe Victorian government has been contacted for comment.\n\nMr Klowss said the council required increased support from the Victorian government for a range of industry projects in the region, including mineral sands mines and wind turbine facilities.\n\n\"Some will be local, but I don't know [where they will live] because we haven't had strategic investment from the government. That's housing and health care.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/albany-house-prices-record-highest-growth-in-regional-australia/105973756",
    "title": "Property price spike stretches buyers keen on coastal WA city",
    "publish_date": "Thu, 06 Nov 2025 21:20:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Melbourne-raised Nina Salvatore was travelling and working in nursing around the country when she fell in love with the way of life in a city on WA's south coast.\n\n\"It does feel like it's a really good balance for opportunity for work and family and that balanced lifestyle and not having that traffic or city stress,\" she said.\n\nThe healthcare worker has been looking to buy a home in Albany for the past eight months.\n\nBut her dreams have been delayed by the reality of the city's housing market.\n\nPeople are attracted to the coastal lifestyle offered by the growing city. (ABC Great Southern: Eliza Kavanagh)\n\n\"When I have gone to a house inspection there is already 50 other people there and it feels almost pointless,\" she said.\n\n\"It sort of feels like it's determined that someone will offer more, when there are so many other people there, some of whom would be investors.\"\n\nMs Salvatore said she would keep looking until next year, but said she would be forced to look elsewhere if she could not find a property.\n\n\"I would move back east and try and find somewhere I could potentially buy a house,\" she said.\n\nAn attractive lifestyle\n\n\"The secret of Albany is now well and truly out,\" Albany real estate agent Kyle Sproxton said.\n\n\" People have fallen in love with the lifestyle and we have found ourselves in this position. \"\n\nMedian house prices rose from $571,811 to $698,667 in the 12 months to September, according to an October report by Cotality.\n\nThe 22.2 per cent increase made Albany the city with the biggest growth in house prices in regional Australia and second in the country overall, behind Palmerston in Darwin by 0.1 per cent.\n\nSome houses are going for 10 to 15 per cent above their asking price. (ABC Great Southern: Rhys Jones)\n\nNot enough houses\n\nMr Sproxton said low stock levels and high demand had driven the price increase with buyers \"commonly offering 10 to 15 per cent over the asking price\".\n\n\"Prior to COVID, I had 27 listings and now I currently have one, a single residential listing,\" he said.\n\n\" It's not just established homes but a lack of supply in affordable blocks of land that people can build on. \"\n\nCity of Albany Mayor Greg Stocks said people had woken up to livability in the regions, with various developments set to hit the market over the next three years.\n\nHe said a major project had already been lodged with the WA Planning Commission.\n\n\"Seven hundred and twenty lots will hit the market in North McKail between 12 and 18 months from now,\" he said.\n\n\"What we need is support from the government, which we are in talks over, to get the infrastructure in place to open land, so prices don't escalate too far.\"\n\nVacant blocks are few and far between in Albany. (ABC Great Southern: Rhys Jones)\n\nSelling with heart\n\nDespite the high demand, some buyers have found ways to get their offer over the line.\n\nWhen Kim Boothman and her husband Jay were selling their family home in 2023, the highest bidder was planning to turn the property into short-term accommodation.\n\nBut Ms Boothman wanted a local family who would continue their neighbourly friendships, so they sold to Andy McKinnon and Floss Munro, despite their lower bid.\n\n\"We helped out our neighbours and had put a gate in the back fence so our kids could play with the kids over the back fence,\" Ms Boothman said.\n\n\"We wanted that to continue.\"\n\nAndy McKinnon and Floss Munro, with daughter Rosie, feel lucky to have bought a home. (Supplied: Maureen Walmsley)\n\nHuman element\n\nRay Stocker from RJS Property Advisors said the sale was a bit unusual.\n\n\"It was important to the sellers in this instance that they had a family that appreciated the house and wanted to be involved with the community, so they did not go for the higher offer,\" he said.\n\n\"The market's become, for buyers, pretty competitive so putting a human element to the offer may get it over the line when up against outside investors.\"\n\nReal estate agents say affordability and lifestyle are driving demand. (ABC Great Southern: Rhys Jones)\n\nHe said Albany started from a lower price base to begin with, and now looked to have caught up with other regional centres.\n\nHe said demand was driven largely by tree changers.\n\n\"People look at the affordability and lifestyle in Albany and when they can sell their home in Perth, pocket some money, and purchase a spot here, they go for it,\" he said.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/how-the-daisy-pearce-effect-is-helping-aflw-shine/105980538",
    "title": "Pearce scoffs at 'the Daisy effect', but its impact is loud and clear",
    "publish_date": "Thu, 06 Nov 2025 21:15:27 +0000",
    "category": "sports",
    "authors": [],
    "text": "In WA's notorious media fishbowl, Daisy Pearce is a rare darling, earning widespread praise for her coaching prowess even before she led West Coast to its first ever AFLW finals series.\n\nFrom the moment she walked through the door of West Coast's Lathlain headquarters two years ago, she brought immediate improvement to a club that had struggled through its first four seasons in the competition.\n\nDaisy Pearce's arrival brought an immediate uptick in the fortunes of the West Coast Eagles. (AAP Image: Joel Carrett)\n\nNow, Pearce has led the Eagles to their first-ever finals appearance, against Carlton in Melbourne on Sunday.\n\nPearce is one of the most recognisable names in women's football, and was one of the first two — with Erin Phillips — AFLW players to be inducted into the Australian Football Hall of Fame earlier this year.\n\nDaisy Pearce was inducted into the Australian Football Hall of Fame earlier this year. (AAP Image: Con Chronis)\n\nMany have backed the 37-year-old to become the AFL men's league's first female senior coach — praise she has mixed feelings about.\n\n\"I'm glad people think that I'm having a positive impact, but I sort of just want to be the best I can for the players I coach now,\" she said.\n\nDaisy Pearce lifted the AFLW premiership cup as a player with Melbourne. (Getty Images: Dylan Burns)\n\n\"Coaching in the AFL wouldn't be necessarily a step up from what I'm doing … down the track, let's hope that we see people interchanging between the two because they're viewed as similar and just-as-important positions.\"\n\nWomen's game rising\n\nWhile discrepancies clearly linger, the gap between the way men's and women's sports are treated has shrunk significantly since Pearce was growing up.\n\nLike many inaugural AFLW players, she was disallowed from playing in the local boys' league beyond the age of 13.\n\nWhy Phillips and Pearce's contribution to footy goes far beyond the field Erin Phillips and Daisy Pearce's contribution to football in Australia go further than the years they played in the AFLW.\n\n\"Not a lot of people saw the point or saw what the reason for my passion and determination was, because there wasn't a pathway to follow,\" she said.\n\n\"There are now household names. I'll walk down the street and people from all walks of life … will say 'far out, how good's Ella Roberts at football' or 'Jas Garner, what a player'.\n\n\"And it just is like soothing for my soul because I think that was the missing thing for so long. You just wanted to be seen as a footballer.\"\n\nParticipation boom\n\nSince the AFLW launched in 2017, female participation in the sport has more than tripled.\n\nIn WA, the growth in overall participation rates has outpaced the national average, and there has been a 10 per cent year-on-year rise in girls aged between five and 12 participating in Auskick, Superkick and community football programs.\n\nWest Coast coach Daisy Pearce took the AFLW cup to her daughter's primary school ahead of the team's first final. (ABC News: Bridget McArthur)\n\nPearce herself has been credited for the positive attention she has brought to the sport since moving west, presiding over West Coast's most successful AFLW season to date, and developing a growing fanbase among young aspiring footballers.\n\n\"Sometimes when I drop my kids off at school, I get told 'hi Daisy Pearce' by kids in their class, which is pretty funny,\" she said.\n\nDaisy Pearce keeps her eyes on the prize. (ABC News: Bridget McArthur)\n\n\"But 'the Daisy Pearce effect', I don't think it's that, I think it's more investment and opportunity in the game and people like me.\"\n\nPearce said there was still a way to go in terms of investment, particularly in regional areas.\n\nDaisy Pearce in charge of training. (ABC News: Bridget McArthur)\n\nShe called for a bigger focus on not just getting young girls and women into sport, but keeping them there, with things like school and career pressure, body image and club environments still posing challenges to involvement.\n\nBring on the Blues\n\nHaving captained Melbourne to a premiership three years ago, Pearce is now chasing her first cup as a coach.\n\nThe Eagles head to Victoria this weekend as underdogs for their elimination final clash with Carlton, the same team that beat them under lights in wet weather at Leederville Oval last weekend.\n\nMikayla Western will miss the clash after suffering a serious knee injury at training. (ABC News: Bridget McArthur)\n\nWest Coast will take to the field bolstered by the return of star defender Jess Rentsch from a one-match suspension.\n\nBut the team will be without vice-captain Mikayla Western, who suffered a serious knee injury at training last week.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-07/coolangatta-qcwa-branch-rejects-10-million-offer-for-hall/105878286",
    "title": "Country Women's Association branch rejects $10m offer for humble hall",
    "publish_date": "Thu, 06 Nov 2025 20:55:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Karen Howell is not hosting fundraising events or high teas, she is busy fending off developers from buying the humble Queensland Country Women's Association (QCWA) hall on the Gold Coast.\n\nTimber-framed and painted in the iconic QCWA blue and white, the building — which sits on a 526 square metre block of land — has attracted a lot of interest from developers in recent years, thanks to its location.\n\nIt is situated on the Coolangatta foreshore, a popular tourist hotspot surrounded by pristine beaches and high-rise holiday apartments.\n\nMs Howell, who is president of the Coolangatta QCWA branch, said there had been offers of more than $10 million to purchase the building.\n\n\"I personally have had emails, phone calls, text messages, people coming into the hall, all asking questions, taking photos — all developers — because they strongly want our block of land to be able to build a big high-rise here,\" she said.\n\nThe hall was built in 1937. (ABC Gold Coast: Glenn Mullane)\n\nSome developers have even offered to pay to relocate the hall or gift the branch a meeting room in a new building.\n\nBut Ms Howell said the branch was not interested in selling the property because it had been a significant part of the community for almost 90 years.\n\n\"The QCWA has had a presence in the area since 1937 and, in that time, they've done so much community work, with the community and for the community, and we still carry on that work today supporting women and their families,\" she said.\n\n\"Even though it's not a flashy building, it's been here for so long that it's just part of the community now.\n\n\"They [the locals] don't want any more development and so we stand strong against it.\"\n\nThe QCWA is pushing for the hall to be listed on the local heritage register to keep developers at bay.\n\nKaren Howell says the QCWA continues to support women and their families. (ABC Gold Coast: Danielle Mahe)\n\nOffers for prime real estate rejected\n\nThe QCWA has more than 220 branches, which operate from hundreds of halls across the state.\n\nWhile each branch is responsible for the upkeep of its hall, it is the association that owns the properties.\n\nState vice-president Sue Baillie said she was not surprised by the interest from developers, considering the Gold Coast had one of the tightest rental markets in the country.\n\n\"Obviously, it's in prime real estate territory,\" Ms Baillie said.\n\n\"But the members are really passionate about their branch and the building is kept in good condition, so they're quite happy to go ahead and have the premises heritage listed, and we sanction that as well.\"\n\nShe said the QCWA recently turned down offers from developers who were interested in purchasing its hall in Cleveland in south-east Queensland, which was damaged by a suspicious fire in September.\n\nSue Baillie says the QCWA Coolangatta branch boasts the biggest membership in south-east Queensland. (Supplied: QCWA)\n\nMs Baillie said the organisation would only offload properties if there were not enough members to form a branch.\n\n\"If the branch in that area has closed — and this is happening in a lot of country areas where membership numbers get so low and it's not worth having a branch there — we've been selling those halls off,\" she said.\n\nSuch was the fate of the QCWA hall in Rockhampton, which was sold in 2014 due to dwindling membership, as well as its state-heritage-listed hostel in Ipswich, which sold for $2 million earlier this year.\n\nIn some cases, the QCWA will gift properties back to the community, like it did with its hall in Maryborough.\n\nHowever, Ms Baillie said there were no plans to sell the hall in Coolangatta, given it had one of the biggest branches in south-east Queensland, with 32 members.\n\nThe hall is in prime real estate territory. (ABC Gold Coast: Glenn Mullane)\n\nPush for local heritage status\n\nTo be listed on the local heritage register, a property must meet one or more of the following criteria: historical, scientific, typological, aesthetic or social and spiritual significance.\n\nHeritage expert Benjamin Gall said the QCWA hall in Coolangatta should have been listed on the local heritage register several years ago because it met the threshold for historical and social value.\n\nHowever, Mr Gall said even if the application was successful, its local heritage status would not protect it from being developed, relocated or demolished.\n\nBenjamin Gall says local heritage status does not protect a building from being demolished. (ABC News: Mark Leonardi)\n\n\"Places that are entered on the local heritage register can be demolished, but what it does is provides the correct level of an assessment to occur,\" he said.\n\n\"It compels owners to prove that it is the only prudent and feasible option.\"\n\nGold Coast councillor Gail O'Neill, whose division takes in Coolangatta, said regardless of the outcome, it was important to preserve the town's history for future generations.\n\n\"Coolangatta goes back a long way. It was a town in its own right. Once upon a time we had our own mayor,\" Cr O'Neill said.\n\n\"We want to keep the heritage and the southern Gold Coast alive. So, I think it's only the right thing to do.\"\n\nPublic submissions about the proposed heritage listing closed on October 20 and will be discussed at a council meeting later this month.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/50-years-on-the-whitlam-dismissal-explained-20251107-p5n8kn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "50 years on: The Whitlam Dismissal explained",
    "publish_date": "Fri, 07 Nov 2025 12:42:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "50 years on: The Whitlam Dismissal explained\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/this-italian-chopped-salad-is-one-of-adam-liaw-s-summer-go-tos-20251107-p5n8km.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This Italian chopped salad is one of Adam Liaw’s summer go-tos",
    "publish_date": "Fri, 07 Nov 2025 12:41:28 +1100",
    "category": "finance",
    "authors": [
      "Adam Liaw"
    ],
    "text": "Serving suggestion: You could also top the salad with torn fresh mozzarella, and keep the lettuce leaves whole if serving immediately. William Meppem\n\nChopped salads are a great summer go-to. They keep well in the fridge and the chopped leaves don’t go as noticeably limp in the sun as whole leaves.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/18-nutrition-packed-bowls-for-effortless-and-delicious-healthy-eating-20251104-p5n7rf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "18 nutrition-packed bowls for effortless and delicious healthy eating",
    "publish_date": "Fri, 07 Nov 2025 12:39:02 +1100",
    "category": "sports",
    "authors": [
      "Sarah Pound"
    ],
    "text": "You have reached your maximum number of saved items.\n\nRemove items from your saved list to add more.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-retreat-tech-giants-weigh-down-wall-street-20251107-p5n8f5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX loses ground, Macquarie slumps; tech giants weigh down Wall Street",
    "publish_date": "Fri, 07 Nov 2025 12:38:38 +1100",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "The Australian sharemarket has slipped into the red by lunchtime after Wall Street lost ground overnight as influential technology stocks fell.\n\nThe S&P/ASX 200 was down 11 points, or 0.1 per cent, to 8817.3 in early afternoon trade, with six of 11 industry sectors in positive territory, led by energy stocks. Tech shares are the biggest weight on the local bourse.\n\nCorporate earnings and forecasts have been the big focus all week. Credit: AP\n\nFinancial stocks are weaker, with the big four banks mixed. National Australia Bank jumped 1.9 per cent, to regain some of Thursday’s heavy losses after releasing its results, Commonwealth Bank lost 1 per cent, Westpac lost 0.5 per cent and ANZ Bank was flat. Macquarie tumbled 7 per cent after unveiling a $1.7 billion profit, which was below expectations.\n\nEnergy stocks advanced to bolster the wider market as oil prices rose this morning. Woodside Energy jumped 1.5 per cent, Ampol rose 0.3 per cent and Santos advanced 0.6 per cent.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/adam-liaw-s-fried-mini-pizzas-plus-why-you-should-put-ketchup-in-your-pizza-sauce-20251107-p5n8ic.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Adam Liaw’s fried mini pizzas (plus why you should put ketchup in your pizza sauce)",
    "publish_date": "Fri, 07 Nov 2025 12:18:28 +1100",
    "category": "finance",
    "authors": [
      "Adam Liaw"
    ],
    "text": "Step 1 To make a sauce, combine the garlic, oil, smoked paprika, passata and tomato ketchup in a small saucepan. Cover and place over medium heat. Simmer for 10 minutes. Season with salt and set aside while you prepare the pizzas.\n\nStep 2 Heat a large frying pan over medium heat and add plenty of olive oil (about 1 tablespoon per base). Fry the bases one at a time for about 2-3 minutes on each side, then arrange on serving plates.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/afl/a-clear-no-1-bolters-and-bidders-who-your-afl-club-will-pick-in-the-draft-20251103-p5n7e7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A clear No.1, bolters and bidders: Who your AFL club will pick in the draft",
    "publish_date": "Fri, 07 Nov 2025 12:02:11 +1100",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "A back stress injury meant Uwland missed this year’s championships after an outstanding bottom-age campaign last year that had him pegged as the best prospect in the 2025 class. The man viewed as Errol Gulden 2.0 did not reach those heights in the limited football he played after recovering, but his football IQ is as good as anyone’s in this draft. He boasts silky skills and can run all day. Might captain the Suns one day. If not: There has been noise for a while, which heated up during the trade period, that the Eagles might bid on Carlton father-son defender Harry Dean. They could also opt to bid on Dylan Patterson or Daniel Annable here. Patterson might be the most damaging and exciting player in this year’s draft. He takes the game on with his kicking and fast feet – including a nasty goose step – and sometimes tries to do too much, but showed in a VFL game against Carlton late in the season that he can rein his attacking nature in. Likened to Andrew McLeod, Patterson rejected NRL clubs’ overtures to stay on the AFL path, and could be a difference-maker for the Suns.\n\nIf not: Gold Coast will desperately hope this doesn’t happen because it would cruel their chances of securing their five fancied academy prospects. West Coast might pick Cooper Duff-Tytler instead, or bid on Dean or Annable. The Eagles have long been linked to Duff-Tytler, a talented ex-basketballer who boasts similar traits to AFL ruck stars Luke Jackson and Tom De Koning with his athleticism, leap, agility and follow-up work. He showed in a VFL appearance for Essendon, where he played predominantly as a forward, that he can impact the game in attack as well, even if that remains a query in some quarters. Should develop rapidly in an AFL environment. If not: Some recruiters think the Eagles would at least consider Sullivan Robey. There is also a chance Richmond are already picking here, and they could snap up Robey before placing bids.\n\nRobey is this year’s bolter, after many clubs hoped they could keep him a secret once he graduated from Rowville’s senior side to belatedly burst onto the scene for the Ranges mid-season. He grew about 17 centimetres in the past two years and developed physically, in equal parts owing to an impressive home gym and his dedication. First made his mark as a lead-up forward, then showed his strength and power as a midfielder. If not: The Tigers might start bidding first. They are also linked to Xavier Taylor and Sam Grlj. The Lions’ premiership window will never shut if kids like Annable keep popping up, after the Ashcroft brothers arrived in recent years. Annable racks up disposals, excels at stoppages and is creative by hand. There are all sorts of flattering comparisons ahead of the draft each year, and recruiters see a bit of Simon Black in Annable. Brisbane will gleefully match any bid on Annable, and would quietly be chuffed if it comes this late. If not: The Tigers either stopped bidding and selected Taylor or Grlj, or bid on Dean instead.\n\nThis would be ideal for the Blues, given Dean is widely rated as a top-five talent. A bid here would also not wipe out both their first-round picks. Dean is one of the best key defender prospects in years, and stands out because there is a major shortage of that position in this crop. He aggressively flies for marks and spoils, reads the ball superbly, and has the athleticism and composure to thrive at the top level. If not: A Dean bid has already come and gone, and the Tigers are bidding on someone else. It would be a shock if Dean did not receive a bid by this pick.\n\nTaylor once polarised because of inconsistent decision-making and execution, including a habit for kicking into the man on the mark – but he has cleaned that up (mostly), and risen sharply on draft boards. Was best afield in the Ranges’ grand final triumph, where his intercepting skills, athleticism, versatility and competitiveness were on show. Importantly, there is confidence Taylor will stand up defensively in the AFL. If not: The Tigers went for Sam Grlj’s combination of blazing speed, endurance and athleticism. The Bombers could shape the draft with their back-to-back picks. The suspicion is they will invest in midfielders after parting with Dylan Shiel, Will Setterfield and Ben Hobbs, on top of the Zach Merrett situation, Darcy Parish’s injury history, and with Elijah Tsatas still proving himself. Sharp won the Larke Medal as the best-performed player at the championships, and is a physical, competitive onballer who wins the ball in big doses. If not: Essendon have also been linked to Sam Cumming, Jacob Farrow and forward-ruck Aidan Schubert.\n\nA shoulder injury cut Cumming’s season short, but not before he stamped himself as a potential top-10 selection. He is a dual-position threat who can impact the game as a deep forward with his marking ability and knack for kicking goals, or as a midfielder, where his physicality, aggression and dynamism are all ticks. There have even been Mark Ricciuto comparisons. Recruiters also like Cumming’s defensive commitment. If not: The Bombers might instead opt for Farrow, who some believe has more upside and would likely start at half-back before eventually moving into the midfield. The Demons are never afraid to go against the grain. This is higher than Nairn has been projected, but Melbourne have him in their sights. Nairn had a seven-goal game at the championships before demonstrating his ball-winning wares with consecutive 30-plus-disposal outings to end the season. He is a high IQ footballer, can run all day as a wingman, could develop into an inside midfielder, marks well overhead and is a neat kick.\n\nIf not: They would love Sam Cumming to still be on the board, and might select small forward Lachy Dovaston, defender Jacob Farrow or try to fortify their key defensive posts for the future with Blake Thredgold. Dovaston, who hails from the same Talent League club as Nick Watson, is the best small forward in this draft. He might lack Watson’s tricks, but still has his share, and has greater running capacity and is considered superior defensively to when the star Hawk was the same age. Dovaston kicks goals for fun (and lots of them), is consistent, has become more selfless, runs hard up and down the ground, and tested brilliantly at the combine. If not: Farrow would give the Demons another kicking weapon across half-back, and could become a midfielder in time. Thredgold would also make sense with Steven May nearing the end of his career, while they could pair Latrelle Pickett with his cousin Kysaiah.\n\nLittle is known across the league about the Hawks’ plans, but Farrow would be a good get. His draft range starts at Essendon’s picks, and he has admirers into the mid-teens. Farrow is one of the best kicks in this class, makes quick decisions, impacts the game as an interceptor, and showed his agility in combine testing. He has also performed well in the midfield, but is more proven down back, where he will start and possibly stay in the AFL. If not: The Hawks might go for Sam Grlj’s mix of speed and endurance, or they could look to bolster their forward line with one of Mitch Marsh, Aidan Schubert or Archie Ludowyke. The Blues might lose this pick, depending on where a Harry Dean bid comes. They would love Lachy Dovaston to still be available, but Grlj has speed to burn and was one of only two players to run the two-kilometre time trial quicker than six minutes at the combine. He entered top-five calculations with a superb start to the year before hitting a rough patch, but his VFL form for Richmond was excellent. Grlj could eventually become a midfielder. If not: Carlton might continue their small forward pursuit and pick Latrelle Pickett, or could be in the market for a defender such as Oskar Taylor or Josh Lindsay, who bring different strengths.\n\n15. Oskar Taylor (GWS) South Belgrave/Eastern Ranges\n\nDefender, 183cm, 2/5/2007\n\nTalent League U18 stats (avg): 20.5 disposals, 3.2 rebound 50s, 5.1 intercept possessions It is dangerous to predict what the Giants might do, but Taylor seems a good fit. His stocks increased the longer the year went after not playing at the championships, capped by his eye-catching results at the combine, where he set the fastest 20-metre sprint time and finished second for agility. Taylor puts that acceleration to great use to quickly create separation and get the ball moving forward. He can tidy up his kicking and improve defensively. If not: The Giants have also been linked to Latrelle Pickett, while Grlj would be in contention if he were available. Others mentioned were Archie Ludowyke and West Coast next-generation academy forward Tylah Williams. 16. Latrelle Pickett (West Coast)\n\nTumby Bay/Glenelg\n\nForward, 182cm, 28/12/2005\n\nSANFL reserves stats (avg): 11.9 disposals, 4.9 score involvements, 1.8 goals Melbourne star Kysaiah Pickett’s cousin has top-20 interest in what is an even crop, but there is a chance he is still up for grabs in the 20s. Pickett turns 20 in December, so he is slightly older than his draft peers, but has impressed this year with his progress at Glenelg. The Eagles are among the clubs that have kept a close eye on Pickett, who is quick, elusive, capable of the mercurial, and has the cheek that the best small forwards possess. If not: The Eagles might opt for the safer option of sweet-kicking defender Josh Lindsay, or could grab a forward such as Aidan Schubert, Mitch Marsh or Archie Ludowyke. 17. Josh Lindsay (Western Bulldogs) Newtown & Chilwell/Geelong Falcons/Victoria Country\n\nDefender/midfielder, 183cm, 7/4/2007\n\nTalent League U18 stats (avg): 20.5 disposals, 7 contested possessions, 3.7 intercept possessions\n\nU18 champs stats (avg): 22.3 disposals, 4.8 intercept possessions, 444 metres gained\n\n2025 All-Australian\n\nLindsay is an excellent decision-maker and arguably the best kick in the draft – the result of years of dedication honing his skills, including a strict morning routine – so this would be a good result for the Bulldogs. He has been a consistently high performer at all levels, and is viewed as a safe selection who could slot straight into a defensive role. There are varying opinions on whether Lindsay could develop into a midfielder. Josh Lindsay won the best on ground medal playing for the Australia under-18a against Coburg VFL in April. Credit: via Getty Images If not: The Dogs have a key defensive need, so they could go for Thredgold, who is comfortably the best tall backman still available. 18. Blake Thredgold (Adelaide) Payneham Norwood Union/Sturt/South Australia\n\nDefender, 194cm, 27/8/2007\n\nSANFL U18 stats (avg): 11.6 disposals, 5.4 marks, 2 intercept marks\n\nU18 champs stats (avg): 13 disposals, 5 marks, 1 intercept mark\n\nRecruiters took notice of Thredgold’s solid job last year as a bottom-ager on future Collingwood forward Charlie West. He also quelled fellow first-round prospect Mitch Marsh in this year’s SANFL under-18 grand final and dominated in the air to cap a strong finals series. Thredgold is on North Melbourne’s radar, but the Crows might get in first. He is a tad undersized but a genuine lockdown defender who is strong, athletic and competitive. If not: There are lots of South Australian options, if the Crows want to go down that path. Marsh, Aidan Schubert, Jevan Phillipou and Harley Barker would all be viable options. 19. Archie Ludowyke (Geelong) East Sandringham/Sandringham Dragons/Victoria Metro\n\nForward, 197cm, 19/11/2007\n\nTalent League U18 stats (avg): 9.3 disposals, 3.3 F50 marks, 3.3 goals\n\nU18 champs stats (avg): 4 disposals, 1 mark, 1.7 score involvements Ludowyke started the year brightly for the Dragons and the AFL Academy after long being rated the best key forward in this class. However, he had a goalless championships – which was not all his fault, as a player relying on service – before suffering a season-ending PCL injury in Metro’s win over the Allies. This would be a classic Cats play to invest in a player with good size and athleticism who launches himself at the Sherrin.\n\nLoading If not: Geelong regularly, and successfully, ignore the status quo in the draft. Mitch Marsh, Aidan Schubert, Louis Emmett and Harley Barker might be in play. Or could they bid on Jai Murray (Gold Coast) or Tylah Williams (West Coast)? 20. Mitch Marsh (Fremantle) Kangarilla/West Adelaide/South Australia\n\nForward, 190cm, 15/2/2007\n\nSANFL U18 stats (avg): 12.5 disposals, 6.1 marks, 2 goals\n\nU18 champs stats (avg): 8.5 disposals, 6 marks, 3 goals\n\n2025 All-Australian The Dockers gleefully drafted 2025 Rising Star winner Murphy Reid at around this pick last year, and could unearth another bargain in Marsh, who kicked the most goals at the 2025 championships. He emerged from the carnival as a top-10 contender who some thought could play other positions, but appears to have slid after a so-so end to the season. But the talent and upside are there, and Marsh could add to a talented Freo forward line.\n\nIf not: The Dockers could place a bid on West Coast next-generation academy forward Tylah Williams, or might punt on upside with one of All-Australian winger Harley Barker or talented forward Noah Hibbins-Hargreaves. 21. Aidan Schubert (Essendon) Gawler Central/Central District/South Australia\n\nForward/ruckman, 196cm, 21/12/2007\n\nSANFL U18s stats (avg): 19.2 disposals, 4.4 clearances, 2.2 goals\n\nU18 champs stats (avg): 17 disposals, 3.3 F50 marks, 2.5 goals\n\n2025 All-Australian The Bombers might snap up Schubert with one of their first two picks, so would probably be delighted if he is still up for grabs here. His awkward ball drop and kicking style are talking points, and put some clubs off, while he measured shorter than some scouts expected. But Schubert had an outstanding championships to surge into the top-10 mix. Talls can sometimes drift, given the risks involved, but his competitiveness and endurance appeal. If not: There are interesting names still available, so Essendon may continue the midfield theme with Oliver Greeves, add more talent to their front end with Noah Hibbins-Hargreaves, or go for ACL-recovering winger Harley Barker.\n\nLoading 22. Oliver Greeves (Hawthorn) Vermont/Eastern Ranges/Victoria Metro\n\nMidfielder, 191cm, 7/2/2007\n\nTalent League U18 stats (avg): 25.5 disposals, 9.8 contested possessions, 1.1 goals\n\nU18 champs stats (avg): 25 disposals, 11.8 contested possessions, 4.5 clearances\n\n2025 All-Australian Greeves is linked to the Hawks by virtue of their rejected application to include him in their next-generation academy program because of his Indigenous background. He also trained with them during the pre-season through the AFL Academy. Greeves is polarising – with most queries centred on his running ability – but a contested beast who has the height and ability to also impact the game when he plays as a marking forward. If not: Hawthorn did a great job rebuilding their list in the draft, and in trade and free agency, so there are not many holes. They can probably afford to take a risk on Harley Barker, or show patience with someone such as Louis Emmett.\n\nSecond round 23. Louis Emmett (North Melbourne) Glen Iris/Oakleigh Chargers/Victoria Metro\n\nRuckman/forward, 199cm, 23/3/2007\n\nTalent League U18 stats (avg): 15.3 disposals, 9.3 contested possessions, 1.1 goals\n\nU18 champs stats (avg): 12.7 disposals, 4.3 marks, 2 clearances There is talk the Kangaroos might trade for Gold Coast’s pick 18 (before it is absorbed in matching bids), but it is unclear if that move is directly related to trying to select key defender Blake Thredgold. The popular view on Emmett, who finished third in the time trial at the combine, is that he will need to develop into a key-position player at either end – but there is upside here. His draft range starts far earlier than this and could be wider. If not: Could the Roos bid on some of the glut of players in this part of the draft, such as Sydney’s Max King, Harry Kyle and Lachy Carmichael, Essendon’s Adam Sweid, Gold Coast’s Jai Murray and Beau Addinsall, Carlton’s Jack Ison or Collingwood’s Zac McCarthy?\n\n24. Harry Kyle (Sydney match North Melbourne bid) UNSW-Eastern Suburbs Bulldogs/Sydney Academy/Allies\n\nDefender/midfielder, 188cm, 16/7/2007\n\nTalent League U18 stats (avg): 20.8 disposals, 9.3 contested possessions, 1.1 goals\n\nU18 champs stats (avg): 12.5 disposals, 10.3 uncontested possessions, 1.3 intercept possessions As always with bids, particularly in this region of the draft, there is a great unknown, but recruiters think this is roughly where Kyle might bob up. The Swans academy product finished top 10 in three tests at the combine, including winning the running vertical jump. Part of Kyle’s appeal is that this was his first year in the academy, so there is serious scope for improvement. He is a good size, has a big tank and brings positional versatility. If not: The Kangaroos might bid on someone else, or not at all. They previously drafted Brayden George off an ACL, so they may be wary to do so again with Harley Barker, but the South Australian could reap great rewards. Other options might be Jevan Phillipou or Riley Onley. 25. Jevan Phillipou (North Melbourne)\n\nLoading PHOS Camden/Woodville-West Torrens/South Australia\n\nMidfielder/forward, 183cm, 30/3/2007\n\nSANFL U18 stats (avg): 22.7 disposals, 9.7 contested possessions, 4.9 clearances Just like his St Kilda-listed brother Mattaes, Phillipou made an impression with his supreme confidence in club interviews. Injury sidelined him from the championships, and at different stages of his junior career, but there is plenty to like, including how self-driven and talented he is. The ex-decathlete is a good athlete, and brings the speed and dynamism that clubs want. Some recruiters rate him in the teens, so don’t be surprised if he is long gone. If not: The Roos could go for someone else in this range, such as Harley Barker or Riley Onley, but rival recruiters don’t expect them to go for Noah Hibbins-Hargreaves, given his similarities to Zane Duursma. 26. Harley Barker (Essendon)\n\nMount Barker/Sturt/South Australia\n\nWingman, 188cm, 2/5/2007\n\nSANFL U18 stats (avg): 16.8 disposals, 6.8 marks, 3.2 clearances\n\nU18 champs stats (avg): 16 disposals, 3.3 inside 50s, 5.8 score involvements\n\n2025 All-Australian There is risk with Barker, who sustained an ACL rupture playing for Sturt after earning All-Australian honours. If a club is willing to take that on board, there is so much to like about Barker’s prospects, given he was considered a top-10 smokey after his championships performance. His size, speed, endurance and skill add up to an impressive package, and he uses his running ability to get involved at both ends. There is a chance he slides. If not: The Dons might bid on a player instead, but might not want to tempt fate on their academy players Adam Sweid and Hussien El Achkar. Other options include Riley Onley, Noah Hibbins-Hargreaves and Sam Swadling. 27. Jack Ison (Carlton match Essendon bid) Parkside/Oakleigh Chargers/Victoria Metro\n\nMidfielder/forward, 191cm, 26/3/2007\n\nTalent League U18 stats (avg): 20.5 disposals, 4.5 clearances, 4.5 tackles\n\nU18 champs stats (avg): 13.3 disposals, 4.7 score involvements, 3.7 tackles\n\nLoading Injuries impacted the start of Ison’s season, but the Blues’ next-generation academy prospect finished strongly – and opposition recruiters took notice. Ison’s height and aerial prowess make him a candidate to fill various roles across the ground, beyond just the midfield. There is still a smallish sample size on him, but the scouting report acknowledges that he can do things others in this range cannot, so Carlton will gleefully match a bid. If not: There are a heap of other players in this part of the draft who are connected to clubs, and clubs will likely start bidding upon them somewhere here. 28. Max King (Sydney match Essendon bid) Cardiff Hawks/Sydney Swans Academy/Allies\n\nForward/midfielder, 191cm, 1/9/2007\n\nTalent League U18 stats (avg): 14 disposals, 3.8 marks, 2.3 tackles\n\nU18 champs stats (avg): 7.3 disposals, 2.7 marks, 0.7 goals\n\nCould the Bombers make a double bid? There is probably not a better athlete in this draft, and he blew everyone away with his 80-centimetre vertical jump at the combine. King took some breathtaking grabs throughout the season, and his individual highlights and potential are why he was once viewed as a top-10 contender – and why a bid could come in the teens. The challenge in rating him is whether his football IQ will catch up to his athleticism. If not: As above, there are many other bidding candidates, or players such as Riley Onley, Noah Hibbins-Hargreaves and Sam Swadling likely come into calculations. 29. Noah Hibbins-Hargreaves (Essendon) Mornington/Dandenong Stingrays/Victoria Country\n\nForward, 186cm, 16/11/2007\n\nTalent League U18 stats (avg): 16.3 disposals, 1.9 F50 marks, 1.5 goals\n\nU18 champs stats (avg): 12 disposals, 8.8 uncontested possessions, 1.5 goals The glimpses are incredibly exciting when it comes to Hibbins-Hargreaves, who produced some enormous performances in his draft season, including several bags of goals. He is best suited as a forward, where his class and skill come to the fore. That said, there are concerns about Hibbins-Hargreaves’ inconsistency and contest work at ground level. Some recruiters would not consider him here, but others might jump earlier than this.\n\nIf not: Could the Bombers pick their own academy product, Adam Sweid, here instead? Rival recruiters have asked that question. 30. Lachy Carmichael (Sydney match Western Bulldogs bid)\n\nSydney Swans Academy/North Shore Bombers/Allies\n\nDefender, 183cm, 27/8/2007\n\nTalent League U18 stats (avg): 27 disposals, 7.7 contested possessions, 5.7 intercept possessions\n\nU18 champs stats (avg): 24.8 disposals, 4.8 rebound 50s, 6 score involvements\n\n2025 All-Australian Will the Swans match a third academy player in the top 30? In a draft where many prospects are flawed or erratic, Carmichael’s ultra-consistency across several years is a big tick. He was an All-Australian at under-16 level in 2023, and earned that same honour at this year’s under-18 championships, where he was also the Allies’ MVP. Carmichael is defensively sound, but his kicking and relative lack of athleticism keep him in this range. If not: Sydney may not match a Carmichael bid if it comes so soon after ones on Harry Kyle and Max King, but it will be interesting to see. The Dogs could also bid on any number of other club-tied prospects, including Gold Coast pair Jai Murray and Beau Addinsall.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/nsw/nab-employee-charged-over-role-in-penthouse-syndicate-s-alleged-150m-bank-fraud-20251105-p5n81i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Luxury watches and jewellery: The extravagant life of an alleged NAB fraudster",
    "publish_date": "Fri, 07 Nov 2025 12:00:05 +1100",
    "category": "finance",
    "authors": [
      "Riley Walter"
    ],
    "text": "“One way to let your wrist alleviate stress away is by practicing some twist movement, and I’m feeling better already,” Sungkar wrote in one post flashing a Rolex Datejust Wimbledon in a video that appears to have been filmed while he was working in NAB’s business centre. Loading In another, Sungkar proudly poses inside a Tokyo branch of the pre-owned luxury watch retailer Okura with a Hublot watch worth up to $30,000. In other posts, Sungkar proudly displays an Audemars Piguet worth up to $35,000. Addressing the growing scandal for the first time, NAB chief executive Andrew Irvine on Thursday told the this masthead: “Insider fraud is always difficult, we’ve got zero tolerance for it, and you can be sure that we’re looking at all of our processes and controls to make sure that those are strengthened as we go forward.” Sungkar has been sacked by the bank, having initially been stood down pending the outcome of internal and police investigations.\n\nSungkar had worked for the bank since 2008, when he was employed in a customer advisory role, and was promoted to a senior position in October 2018 when he returned from an 18-month stint working as a mortgage broker. He was promoted to his position, in which he dealt directly with mortgage brokers who provided him with documents for loan applications, in August 2022. Several other NAB employees are under investigation for allegedly facilitating home and business loans for the syndicate under the direction of the Penthouse Syndicate’s alleged ringleader, Shanghai-born 38-year-old Bing “Michael” Li. Those employees have not been charged, but have been stood down from their positions pending the outcome of an internal investigation and detectives’ probe into the employees’ alleged involvement with the syndicate. No NAB customers have been targeted in the alleged fraud. Detectives have arrested 16 syndicate members since Strike Force Myddleton was formed last January to investigate a $10 million fraud scheme involving the purchase of non-existent luxury cars in Sydney’s west.\n\n“I said that we’d be coming for them, and we’ve started,” Detective Superintendent Gordon Arbinja, commander of the financial crimes squad, told this masthead. “And this person won’t be the last.” Detective Superintendent Gordon Arbinja, commander of the financial crimes squad, said further arrests linked to the Penthouse Syndicate are expected. Credit: Janie Barrett In what was a major catalyst for the Penthouse Syndicate’s spectacular downfall, Li was arrested in July in the $18 million penthouse of the Crown’s residential tower at Barangaroo, from where police say he directed the syndicate. Detectives believe the syndicate has defrauded several of the major banks and other financiers of more than $250 million dating back at least seven years. Li’s arrest and the subsequent investigation into the NAB employees has brought police scrutiny to professionals working on the outskirts of the finance industry, including corrupt solicitors, mortgage brokers and real estate agents who police say form a network of facilitators that helped the syndicate build its multimillion-dollar property portfolio.\n\n“At every single point of the transaction, there’s trust. Whether it’s a banker, whether it’s a solicitor, a conveyancer, a valuer – there’s always an element of trust that the bank relies upon – and every single time, that trust has been violated,” Arbinja said. Li, who remains in custody after several failed bail applications, has been charged with more than 80 offences related to $12.9 million worth of fraud linked to the luxury car scheme and other frauds, but police allege he was heavily involved in orchestrating a large portion of the alleged NAB fraud and has, through mules hired by the syndicate, bought several properties in the past two years. Detectives allege Li has orchestrated the laundering of millions of dollars through the purchase of property and other assets. The Penthouse Syndicate’s alleged ringleader, Bing “Michael” Li, was arrested in the penthouse of the Crown’s residential tower in July. Other NAB employees at several locations across Sydney are suspected of receiving bribes from the syndicate to approve home and business loan applications, which police allege they knew were submitted with fraudulent documents including company records, tax returns and financial statements. The syndicate’s alleged infiltration of the finance giant raises questions about what anti-corruption measures were in place at the bank, which became aware of the alleged fraud and its scale only through the police investigation.\n\nIn July, NAB finalised an enforceable undertaking with the federal government’s anti-money laundering and financial crimes watchdog, the Australian Transaction Reports and Analysis Centre (AUSTRAC). Loading In exchange for being spared a multimillion-dollar fine, NAB agreed to improve its compliance with anti-money laundering laws and counter-terrorism financing laws. Despite the scrutiny on the bank’s fraud and money-laundering controls, most of the Penthouse Syndicate’s alleged defrauding of NAB was carried out while the undertaking was in place. Sungkar was allegedly paid $17,000 to facilitate fraudulent business loans worth millions of dollars for “shell” companies purchased by the syndicate. Sungkar was allegedly paid through transfers made to his now-estranged wife’s bank account by Li.\n\nPenthouse Syndicate members have purchased several of the companies, which typically have a minimum of two years’ trading history, for between $5000 and $10,000. Police allege the syndicate has used fraudulent financial documents linked to the companies to inflate members’ income, allowing them to secure multimillion-dollar mortgage and business loans. Sungkar is alleged to have approved fraudulent business loans worth millions for several shell companies linked to syndicate members Hanna Karliana and her partner, Indra Hari Nurkianto. Karliana, 61, and Nurkianto, 60, were in August charged with a number of offences over their alleged roles in the Penthouse Syndicate. Police allege Sungkar facilitated fraudulent business loans for syndicate members Hanna Karliana and Indra Hari Nurkianto. Credit: Instagram Police allege the couple bought $15 million worth of property – two CBD apartments and a Bellevue Hill townhouse – on behalf of the syndicate using fraudulent documents. Sungkar is accused of facilitating millions of dollars worth of business loans for shell companies of which Karliana and Nurkianto were directors. “This person, as far as I’m concerned, is the gatekeeper of funds,” Arbinja said.\n\n“Wtihout this person, the fraud cannot be facilitated. So he’s in a position of trust. He violated that trust, and now, we know that over $200 million in funds have been attributed to this organised crime syndicate.” Loading Chris Sheehan, head of NAB’s group investigations and fraud business unit, said the bank had “zero tolerance for employees who engage in criminal conduct”. “There is absolutely no place for financial crime in our community and we recognise the important role we play in the monitoring and reporting of suspicious activity, working closely with police as well as regulators and government agencies as necessary,” Sheehan said. Sheehan said NAB was working with police and providing “significant support to aid the investigation and attempted recovery of any funds lost to criminal activity”.\n\nArbinja said NAB had co-operated with the police investigation since it became aware of the alleged fraud. “These types of syndicates can only be investigated thoroughly with the proper cooperation of our banking partners. It can’t be done solely with police,” he said. “We cannot get to this day without the bank’s assistance.” Beyond NAB, detectives are investigating the syndicate’s suspected infiltration of the country’s other major banks, which the group is believed to have defrauded. The NSW Crime Commission has seized $60 million worth of property, cars and luxury goods linked to Li, his partner, Zhouyao “Yumi” Chen and other syndicate members.\n\nChen, 37, has been charged with several offences related both to the luxury car scheme, and more than $4 million worth of allegedly fraudulent NAB mortgage and business loans. Karliana and Nurkianto’s daughter-in-law, Thi Ngo Hao Vu, 35, has been charged with a number of offences related to $3.2 million worth of allegedly fraudulent mortgage and business loans. According to court documents, another senior NAB banking manager allegedly approved a $2 million mortgage application and a business loan worth almost $500,000 after advising Li, Vu and her husband, Ibnu Pratama, which documents would be needed to secure the loan. The mortgage was used to purchase Bondi Junction beauty salon Beauty Pavilion. Pratama left Australia in December 2023, a week after detectives raided the home of one of his, Li and Vu’s Beauty Pavilion business partners. He has not returned to the country. A warrant for his arrest was issued in September.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/put-your-general-knowledge-to-the-test-with-the-good-weekend-quiz-20251105-p5n7zy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Put your general knowledge to the test with the Good Weekend quiz",
    "publish_date": "Fri, 07 Nov 2025 11:59:00 +1100",
    "category": "finance",
    "authors": [],
    "text": "By Brian Yatman\n\nTry our new Mini Crossword\n\nTen clues. Twenty-five squares. How quickly can you solve this bite-sized puzzle? Track your win streaks and challenge family and friends by sharing your results.\n\nPremium subscribers to The Age can play the Mini Crossword (and all our puzzles, including Target Time) here and premium subscribers to The Sydney Morning Herald can play them here.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/business/companies/absolute-game-changer-qantas-launches-new-premium-class-for-economy-20251107-p5n8hb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Absolute game-changer’: Qantas launches new premium class for economy",
    "publish_date": "Fri, 07 Nov 2025 11:50:37 +1100",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "The Qantas is launching Economy Plus, a class that will give customers up to 40 per cent more legroom, priority boarding and access to overhead baggage space.\n\nThe product, deemed “significant” by one industry participant, will help refocus Qantas’ on the domestic business travel segment, which is facing stiff competition from Virgin Australia and a lacklustre recovery from the COVID era.\n\nQantas Economy Plus seating will roll out in 2026.\n\nEconomy Plus will be like premium economy but on domestic short-haul flights. It will be available in the new Airbus A321XLR and A220s across the airlines’ network in Australia, New Zealand and the Pacific Islands. It will also be added into Boeing 737s cabin refits, announced in February.\n\n“We’re always looking for ways to enhance the onboard experience and maximise comfort for our customers,” said Qantas chief executive Vanessa Hudson. “We believe this new seating product will be popular with our corporate and leisure travellers when it launches next year.”",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/politics/federal/as-rates-hit-the-brakes-is-3-6-per-cent-as-low-as-we-should-go-20251106-p5n864.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "As rates hit the brakes, is 3.6 per cent as low as we should go?",
    "publish_date": "Fri, 07 Nov 2025 11:49:52 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "But as the Commonwealth Bank’s head of Australian economics Belinda Allen noted, there might not be any further rate cuts. “We expect it would take a material move higher in the unemployment rate, together with more moderate inflation prints, to bring the RBA back to the cutting table,” she said. Something not in Chau’s question, or remarked upon by Bullock itself, is how the economy and Australian consumers are performing with the cash rate at 3.6 per cent. Every major lender has reported in recent weeks that delinquency rates - the proportion of people behind on their mortgages - is actually falling (from barely elevated levels). Household consumption has lifted, both in quantity and value. The private sector is, as the RBA noted, starting to take over from the public sector.\n\nThere is real financial pain in parts of the community while unemployment has ticked up. Foodbank this week reported that half of all renters are suffering some form of “food insecurity” which means they are trying everything from reducing the quality and variety of food to skipping meals. Foodbank Queensland volunteers at the food distribution warehouse in Brisbane. Demand for its services remains at very high levels. Credit: @foodbankqld The Reserve’s own liaison program with charities is finding that demand for services continues to exceed supply, with the biggest pressure points “homelessness, emergency financial and food support and domestic violence”. What’s been surprising, however, has been the lack of widespread and demonstrable financial damage across the nation’s army of borrowers who have borne the brunt of the RBA’s actions.\n\nAfter the Reserve started lifting the cash rate from its 0.1 per cent pandemic-era low, there were real fears for the huge proportion of mortgage holders who had taken fixed rate loans. Loading When these loans re-set at much higher rates, the argument ran, Australians en masse would tumble lemming-like off a “mortgage cliff”. That would be on top of all those people with variable rate mortgages who would struggle to survive. But the cliff and economic disaster didn’t eventuate. Research compiled by a group of economists including several from the e61 think tank, released this week, suggests Australians’ use of offset and redraw accounts may be the nation’s economic secret sauce.\n\nWhile annual repayments on variable mortgage lifted by an average $13,800, the economists found the impact on consumer spending was muted. One of the report’s authors, Gianni La Cava, said people used their mortgage offset and redraw facilities, enabling them to maintain their spending. And, as rates came down, most borrowers did not reduce their repayments. They started rebuilding their mortgage-linked savings. This has major repercussions for the Reserve Bank and how it thinks movements in interest rates work and whether 3.6 per cent will actually bring inflation under control. “The borrower cash flow channel of monetary policy may have weakened in both directions. The resilience that helped households weather higher rates may also dull the stimulus from lower ones,” La Cava said.\n\nReserve Bank data shows even as the share of household income used to pay mortgages hits 10 per cent, the level of excess mortgage repayments has grown. While the bank will never admit it, especially during a heated political battle over the nation’s housing market, there is a concern that ever-lower interest rates will supercharge property prices. In this week’s quarterly monetary policy statement, the bank revealed that for every 10 per cent lift in housing prices, economic growth is 0.7 per cent higher. In dollar terms, that’s an $18.5 billion jump in economic activity. “The boost to GDP growth also flows through to higher inflation; in particular, we would expect new dwelling inflation to rise sharply as capacity pressures in housing construction increase,” it noted.\n\nThat increase in activity would push up underlying inflation by about 0.25 percentage points. Such a lift would not only kill any prospect of further rate relief, it would put a rate increase on the agenda. The Grattan Institute noted this week in its report advocating major changes to capital city planning rules that the nation’s ratio of house prices to income has soared over the past two decades. Sydney’s median house cost 6.3 times the median household income back in 2001. Now that median house costs around $1.5 million or almost 10 times median household income. Brisbane and Adelaide have seen even larger increases in the income needed to buy a new home while the ratio has almost doubled in Canberra (with a median house value approaching $1 million).\n\nOur higher priced houses require ever larger mortgages which means a larger share of household income now goes towards paying down the home loan. And yet people have managed to get ahead on their mortgages. All but the richest quarter of home borrowers are further ahead in their repayments today than before the pandemic. These issues, on top of all the other economic problems at play domestically and across the world, swirled around the Reserve Bank’s meeting room as it discussed where interest rates may be headed. There was also an elephant in the room - the bank’s past and current inflation performance. The RBA constantly undershot its 2-3 per cent inflation target across the five years leading up to the pandemic. It was one of the reasons the bank went through an independent review.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/national/handcrafted-spoons-custom-clay-bricks-what-it-takes-to-open-a-restaurant-in-2025-20251021-p5n43t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Handcrafted spoons, custom clay bricks: What it takes to open a restaurant in 2025",
    "publish_date": "Fri, 07 Nov 2025 11:45:00 +1100",
    "category": "finance",
    "authors": [
      "Myffy Rigby"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Stop me if you’ve heard this one. A three-hat chef and a prize-winning architect walk into an abandoned kiosk in a park. They turn it into what may well be the most significant restaurant opening in a decade. The punchline? Neither of them has ever opened one before. Yiaga, meaning “to seek and find” in Woiwurrung, the language of Melbourne’s traditional owners, the Wurundjeri people, is a creative collaboration between Vue de Monde executive chef Hugh Allen and architect John Wardle. The Pavilion Cafe had sat abandoned in the Fitzroy Gardens on the eastern edge of the CBD for close to a decade. After a project five years and many millions of dollars in the making, the redesigned and renovated restaurant opened last month. It’s tempting to slice a tall poppy before it’s even had time to flower, to dismiss this as a restaurant made by (and for) people with money (Yiaga is partially backed by billionaire Singaporean brothers Philip and Robert Ng, who also own the majority share of three-hat fine diner Vue de Monde). And at $295 a head (excluding wine), with just 44 seats, the 12- to 15-course degustation menu – which rolls on for around three hours – is not designed for your average Fitzroy Gardens picnicker. Yiaga’s founder and executive chef, Hugh Allen. Credit: Kristoffer Paulsen But here’s another way to look at it. The post-2020 hospitality scene has been in a bit of a share-plate slumber, dominated by grand bistros and neighbourhood diners, with the occasional creative jolt to the arm from small, fun, owner-operated restaurants. Safe, comforting, familiar. Now here’s Yiaga: a dining experience that’s sophisticated in pitch, mature in tone and -thoroughly realised. A loving dispatch to the colours, textures and flavours that make up Australia’s changeable environment. Thoughtful, provocative and unfailingly stylish. In a world of designer chefs and the countless restaurants around the planet bearing their names – Robuchon, Ramsay, Boulud, Nobu – it’s outliers such as Hugh Allen who bring something new to the table. A reminder that dining out can be more than a meal, it can be an art form. On that front, Australia is no slouch. In Victoria, there’s Dan Hunter’s farm-to-table Brae. In NSW, there’s Daniel Puskas’s progressive, ferment-driven Sixpenny, and Josh Niland’s fish-focused Saint Peter. They all bring the noise when it comes to elite Australian fine-dining. But little of our extraordinary, diverse food scene has managed to hold attention on the world stage. Could Yiaga be the one to finally move the dial? I spent three days at the restaurant as they set up for their first guests to find out.\n\nAdvertisement\n\nThe 30-year-old chef is no stranger to excellence. Allen spent three years cooking at Noma, chef René Redzepi’s Copenhagen restaurant that’s widely considered one of the world’s greats, featuring a menu that dances a fine line between naturalist and futurist, executed with 10,000-hour precision. For chefs, working there is the culinary equivalent of training to become a green beret. At just 23, he became executive chef at Vue de Monde on the 55th floor of the Rialto Tower. At 26, he became the youngest chef in four decades to hold three hats. He’s spent the past six years running Vue, which recently retained its three hats at The Age Good Food Guide Awards. Only four restaurants in Victoria currently hold that position. The restaurant is in Melbourne’s Fitzroy Gardens. Credit: Kristoffer Paulsen Despite all that, Hugh Allen is not a flashy guy. He has very little time for things that don’t directly feed back into the restaurant he’s invested so much of his heart, soul and money in. His iPhone is so cracked, it’s like looking at a Magic Eye puzzle. His laptop screen, also damaged, has a huge black line through it. He’s been hoping someone will knock it off one of the benches and completely destroy it so he can justify purchasing a new one. All this is thrown into sharp relief against his beautifully appointed new restaurant, where even the dessert spoons were hand-crafted by a silversmith. Besides, the show is not Hugh Allen himself, the show is Yiaga. For instance, it’s unusual to see the self-assured, softly spoken chef at the pass (the divider between the kitchen and the outside world, where traditionally you’d find the person running the show). That’s head chef Michael McAulay’s job. Another Noma alum, the 27-year-old moved from Scotland to Australia initially to work at Vue de Monde, where he was sous chef for two years, before spending the past year working on launching Yiaga with Allen. Together, they’re a study in contrast. McAulay works on his toes, darting and weaving like a matador, holding the front line with a thick Glaswegian brogue. Allen floats with the quiet constancy of a Zen monk, speaking in lilting tones, gliding from one chef station to another.\n\nAdvertisement\n\nThe pair aren’t the only two Vue transplants. General manager Hugo Simoes and sommelier Dorian Guillon, both longtime members of the Vue team, have also made their way to the garden from the dark, lacquered surrounds of the 55th floor. Allen and Simoes will -continue to split their time between the two. Head chef Michael McAulay in the open kitchen. Credit: Kristoffer Paulsen Maybe it’s a generation/age thing, and maybe it’s some of that aforementioned familiarity with his team creating a sense of comfort and calm, but the psychological warfare that would have previously been a hallmark of a kitchen operating at this level doesn’t seem to exist. The impression is of a healthy kitchen culture (one of their hiring rules is a “no dickhead -policy”). Perhaps the idea of beauty only being achieved through -brutality is a concept of the past. If the energy from the 13-strong kitchen team (aged between 20 and 31) is anything to go by, it certainly is here. I ask Allen one afternoon how he deals with his internalised rage – a trait common in noteworthy chefs working in highly pressurised environments. (Infamous culinary torture artist Marco Pierre White once said, “If you are not extreme, then people will take shortcuts because they don’t fear you.”) Allen told me he doesn’t have any such torment. And I believe him. He is probably the least angst-riddled chef I’ve ever met. Loading Before guests arrive, front- and back-of-house sit down together for “family meal”: a chance for calm before the oncoming adrenal storm. Chefs eat generous plates of roast chicken, rice and roast baby zucchini like they mean business, focused on getting back to their stations as quickly as they can. There’s a sense of urgency and industry in the air – tonight is the first night they’ve all worked as a team. Allen walks around reminding everyone to get some fresh air and stretch before service. “They just want to get back to setting up,” says Allen. “Especially when everything’s new, it’s always quite overwhelming.”\n\nAdvertisement\n\nMcAulay tours each station in the kitchen, trying the finishing elements of each dish on the menu. He’s been tasting steadily throughout the day. “A lot\n\nof it is the really fine detail,” says the chef, dropping a teaspoon into a container of fresh water. “Nothing gets packed away until it gets tasted by me or Hugh. Thinking about everything again just dials you in. You tasted [the sauce] the first time, but then it’s settled: does it need a tiny bit more salt, is it too intense?” It also allows honest dialogue. Any problems with a dish can be flagged early enough to be fixed, creating a calmer environment for everyone. “The only reason you would pack something away if it hasn’t been tasted is if something is wrong,” says McAulay. “But everyone’s really good here. I trust everyone.” In the lead-up to opening, industry chatter was focused on what Allen would bring to the table as a chef outside the confines of Vue de Monde and its 25‑year legacy. Could he create something original? Would it be Vue 2.0? Noma in the park? The answer is mostly no, and very slightly yes. The vision, flavour and execution is most definitely Hugh Allen’s. To put a dish through the Yiaga lens, Allen and McAulay asked themselves whether it is “seek and find enough”. It must push boundaries, flavour-wise. “Just because it’s an amazing dish somewhere else doesn’t mean it’ll make sense here,” says McAulay. The open-plan kitchen flows into the dining space. “I want my staff to really engage with the diners,” says Allen. Credit: Kristoffer Paulsen Coral trout, initially served with brassicas, felt too classic and European to the pair. Instead, they kept experimenting until they landed on barbecuing the Far North Queensland fish, pairing it with a cheek of new-season mango and sunrise lime, finally injecting it with the base heat of Mexican chilli oil, a suggestion from 29-year-old chef Eduardo Guasch.\n\nAdvertisement\n\nThere’s a wildness to the composition here, akin to a Turner landscape. A command of balance and restraint, executed with the kind of abandon only people who have learnt the rules can achieve when they decide to break them. “We don’t really know what ‘here’ feels like ourselves, yet,” says Allen. “We’re new here as well. But we want the food to be very interesting. We want to really push things.” Corner Inlet squid from Gippsland were so large when they were delivered that they took up an entire kitchen benchtop. The flesh is gently confited and cured in white miso, dressed with desert lime, served in a light citrus broth and finished with the peppery tang of Thai basil. There’s deep harmony in a set coconut cream layered with concentrated coconut water, finished with a lump of caviar, a touch of lime zest and a tiny hint of fresh-pressed macadamia oil. A dish so finely tuned that it dampens and mutes the surrounding sounds of the restaurant, just for a moment. Flavoured oils are used less like an ingredient and more like a perfume: gentle enhancements like Geraldton wax, and those macadamia and chilli oils. “I think dining should be exciting,” says Allen. “Food that’s aromatic. Ingredients you’ve never had before, hopefully. Flavours that you can’t work out. Obviously, with all that it still has to be delicious, but we want it to feel very new and really Aussie.” Coconut cream and caviar: Yiaga’s menu aims to “push the flavour boundaries”. Credit: Kristoffer Paulsen Kangaroo cutlets are gently cooked through service, starting raw at the top of the open hearth, slowly taking in smoke for flavour, then brought down over the coals, glazed with smoked butter and a concentrated sauce made from all the other parts of the kangaroo, served with maitake mushrooms poached in mushroom stock then grilled and glazed with cured egg yolk. They’re looking farther afield at producers, too, utilising forgotten or under-appreciated ingredients. Slices of 14-year-old retired wagyu cow (which would normally be around four when they meet their fate) are draped over a bite-sized steamed bun. The meat, from producer David Blackmore, is very slightly salt-cured but mostly raw, seasoned with green ants and wild garlic capers.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/where-sports-have-a-duty-of-care-it-must-override-the-desire-for-personal-autonomy-20251106-p5n8cu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Where sports have a duty of care, it must override the desire for personal autonomy",
    "publish_date": "Fri, 07 Nov 2025 11:45:00 +1100",
    "category": "sports",
    "authors": [
      "Darren Kane"
    ],
    "text": "“Cricket is a potentially dangerous game: it involves a heavy, hard ball being speared towards a batter from a relatively short distance at great speed. It is a testament to the skill and courage of those who play the game at the highest level that more incidents don’t occur. Still, safeguards are essential if death and injury is to be minimised.“\n\n– NSW State Coroner, Inquest into the death of Phillip Hughes\n\nThe difficult questions are the ones that demand answers. For example, what on earth passes for functional concussion protocols inside the Tongan Rugby League set-up? Whatever the NRL’s investigation into the events that left Elisa Katoa in hospital with brain bleeding uncovers, the sight of a staffer attempting to hold the Tonga forward’s head up – likely as his consciousness ebbed away – as he sat on the bench was sickening.\n\nAfter three serious head knocks across the warm-up and match, Katoa – who isn’t certain to play the game again – should not have been left so hopelessly exposed. Players won’t voluntarily self-administer head impact assessments. Heads should roll. Katoa’s should never have been one of them.\n\nHowever, there aren’t many sports that don’t carry an element of danger. Equestrianism, AFL, baseball, track cycling and swimming each carry various and inherent risks, which participants can’t hope to entirely divorce themselves from.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/from-beckham-to-melham-what-s-left-when-you-re-already-achieved-your-dream-20251106-p5n8c7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "From Beckham to Melham, what’s left when you’ve already achieved your dream?",
    "publish_date": "Fri, 07 Nov 2025 11:30:51 +1100",
    "category": "lifestyle",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "Along with wanting to be Sally Boyden from Young Talent Time, my first dream was going to Disneyland. From age six, my head exploded watching The Wonderful World of Disney over Rice-a-Riso snazzed up with flaked almonds by Mum.\n\nThe fireworks! The castle! The Snow White Grotto! I was desperate to get there. So when I actually rocked up to actual Disneyland in 1979, in a denim midi and braces like the singer in Promises, I felt euphoric.\n\nThis week David Beckham was awarded a knighthood, and Jamie Melham won the Melbourne Cup. Credit: AP, Getty\n\nFelt like I do now on a good edible.\n\nBut as with all trips, there was a downside to the high. Afterwards, reality felt more meh. Even then, with only Spirograph as a major life skill, I suspected having no horizon to move towards meant drifting in circles.",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/national/nsw/i-am-never-moving-out-why-jo-s-rental-could-be-the-new-australian-dream-20250818-p5mns8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I am never moving out’: Why Jo’s rental could be the new Australian dream",
    "publish_date": "Fri, 07 Nov 2025 11:30:00 +1100",
    "category": "finance",
    "authors": [
      "Julie Power"
    ],
    "text": "Williams in her apartment: “I don’t see it as rent, I am paying for a lifestyle.” Credit: Sitthixay Ditthavong Williams in Indi Sydney’s rooftop lounge, which she has previously hired out for a party. Credit: Sitthixay Ditthavong The 25-metre pool at Indi Sydney, the CBD’s first exclusively build-to-rent apartment block. Credit: Sitthixay Ditthavong The Herald visited Indi with two architects, Anthony St John Parsons, who won NSW’s house of the year and a national award for interior architecture, and Kate Dickinson, an associate principal with Woods Bagot, as part of its ongoing reviews of apartment life. Consultants BDO estimate the national BTR pipeline includes about 39,300 apartments across 113 projects, worth about $30.1 billion. That represents a growth of 10,000 apartments and nearly $9 billion over the past year.\n\nProfessor Anthony Bourke, the host of Grand Designs and podcast The Home Front, says apartment living can be part of the new Australian dream. “In fact it will be. It’s whether we can look at rental and apartment living as a desirable alternative to the detached home, and can we shake the idea that it’s just a step-up before getting a ‘real home’.” Bourke said the challenge was bringing the model within the reach of the average family. Williams’ 69-square-metre one-bedroom unit with a balcony rents for $1100 a week. “I don’t see it as rent, I am paying for a lifestyle,” she said. “I would rather pay more because I don’t have to pay for gym, I have beautiful facilities, I don’t have to leave … I can go for lunch or have a drink on the rooftop where you are looking out across the harbour.” In most high-end apartment blocks, where units are privately owned, the rooftop space would be given over to penthouses. But at Indi, it is a shared space for tenants with a rooftop dining area, a chef’s kitchen, and outdoor space.\n\nBates Smart managing director, architect Philip Vivian, said Indi was sustainable. “You’ve got to compare it to 234 homes in the suburbs, basically a full suburb with lawns being watered and two cars in every garage … or 234 eco huts all accessed by cars versus far more sustainable zero cars, low-carbon transport.” Architect Anthony St John Parsons, Indi operations director Courtney Raven, Woods Bagot associate principal Kate Dickinson and Bates Smart managing director Philip Vivian. Credit: Wolter Peeters A floorplan of a two-bedroom unit in Indi Sydney. Credit: Investa To reduce greenhouse gases, they “dematerialised” wherever they could. The structural columns that span the 25-metre pool were unadorned. The developers wanted to cover the concrete in the hallways too. But, Vivian said, “Wherever we can expose the structure, we left it.” It is part of the building’s beauty and charm, residents said.\n\nIn countries such as France, build-to-rent is a lifetime option and many landlords will not offer leases shorter than five years. Like Investa, the manager and developer of Indi, landlords are usually long-term institutional investors. Loading Housing experts AHURI warn BTR needs to be regulated. Ownership of too many units by one owner creates a risk to tenants and the community if the business owner puts up rents excessively or evicts everyone at the same time to refurbish/redevelop buildings. On the upside, the blocks are likely to be built to a better standard because building owners know they will be responsible for the maintenance for longer. Dr Chris Martin of UNSW’s City Futures Research Centre warns of the dark side, and describes many of the advantages as plausible.\n\n“It says something about the uncertainty and turnover in the way the rental housing system currently is structured that the prospect of a mega-corporate landlord has been embraced as such a good thing.” ‘It says something about the uncertainty and turnover in the way the rental housing system currently is structured that the prospect of a mega-corporate landlord has been embraced as such a good thing.’ Chris Martin Martin, a former NSW Tenants Union head, says half of landlords turn over within five years of entering the Sydney and Melbourne market. “In Australia, BTR has been very plausibly presented as an enhancement to the security that people have, but there have also been international experiences where the rise of large corporate landlords has been detrimental to housing.” He said the growth of build-to-rent in the US and Europe has resulted in big corporate landlords abusing their power.\n\n“Many bought en masse distressed properties, single-family detached dwellings … And the evidence is that they move to evict tenants more readily than smaller holding landlords.” Loading Compared with her experience renting other properties, Williams said she hoped corporate landlords would be held to a higher standard, and so far had no problems. Atkinson said it was nice to know the BTR product was providing bang for buck. “Maybe you’d meet someone on the rooftop, and grow old together! “The great Aussie dream historically has been the aspiration, but I think as the population changes and diversifies, so does any one person’s aspiration.”\n\nFor example, a tenant may want to spend more on travel, knowing their home is secure, without the distraction of interest rates. Residents at Indi. Credit: Felix Mooneram The common spaces are generous. “For BTR this is an interesting space as they are sacrificing tangible NLA [net lettable area]/rent for non-rentable area.” St John Parsons said Indi’s architecture was amazing. “As a building, it is bloody beautiful.” And he was impressed by how it dealt with “a really tricky dynamic underneath, the metro”. It was perfect for YoPros, as he calls young professionals, if not YoPro parents like him with two children, who need childcare and preschools.",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/lifestyle/health-and-wellness/after-months-of-feeling-off-i-took-myself-off-to-the-gp-i-didn-t-expect-this-diagnosis-20251020-p5n3xv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After months of feeling off, I took myself off to the GP. I didn’t expect this diagnosis",
    "publish_date": "Fri, 07 Nov 2025 11:30:00 +1100",
    "category": "lifestyle",
    "authors": [
      "Nick Galvin"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In the medical trade, it has the impressively apocalyptic (if somewhat gendered) moniker, “The Widowmaker”, a blockage of the left anterior descending artery (LAD) that is most emphatically not a good thing if yours is the heart to which it happens to be attached. Stay with me here as I get a bit technical: the matey-sounding LAD is one of the main routes that supplies your heart with all the vital gubbins needed to keep it beating (blood, oxygen et cetera). And even with my limited scientific background (I come from a medical family, but my eldest brother followed dad into the doctoring lark, letting us other two brothers off the hook), I know a working heart is non-negotiable when it comes to staying alive. If your three-millimetre LAD gets gummed up, the resulting heart attack, according to Dr Google, is most often “catastrophic” or “massive”. Survival rates are less than 10 per cent. These are not good odds. Let’s back up a few weeks to a time when I was blissfully unaware of the LAD in my chest quietly helping my heart beat some 100,000 times a day. After several months of feeling a “bit off”, which I put down to the lingering effects of enforced idleness due to a fractured ankle, I finally dragged myself to my GP. It had taken quite a while but avoiding deadlines until the very last minute is a way of life for most journalists. Sometimes, I don’t even get around to procrastinating. The other motivating factor was that we were very shortly due to fly to Spain on a much-anticipated family holiday. I just needed reassurance that all was tickety boo with my ticker and that my planned cerveza and paella tour was not in danger.\n\nAdvertisement\n\nThe good doctor took one look (actually, several looks and a detailed case history) and packed me off to the first cardiologist who could fit me in at very short notice. He took several more looks, gave me one long, very worried look, told me to put away the Spanish guidebooks, and booked a computed tomography angiogram. Loading The procedure involves lying down and being fed into a huge doughnutty thing that makes lots of dramatic banging and whirring noises. A contrast dye is injected via a canula so the doctors can get a good look at what’s going on under the bonnet. I had been warned I might feel like I’d … er … lost control of my bodily functions but, even so, suddenly feeling like you’ve filled a nappy in public is strangely disconcerting. As I lay there coming to terms with my new identity as a doubly incontinent 59-year-old with a dicky ticker, the radiologist appeared with a look on his face that implied I probably shouldn’t buy green bananas and definitely not pick up any long books. His advice was to go home, avoid all exertion (which, ironically, is probably what got me into this mess in the first place) and count down the five days until I was booked in for an angioplasty. On the train home, I imagined what my blockage might look like under a microscope. I pictured a micro-sized fatberg made up of sausage rolls, meat pies and chips all gummed together with pate (mmmmm, pate) and soft cheese (mmmmm, soft cheese). When Nick Galvin got the call to go into hospital earlier than expected, he didn’t think twice.\n\nAdvertisement\n\nThere’d be a tiny gap left just waiting for a cream bun somewhere in my body to come barrelling up the artery and plug that final hole, at which point my face would turn bright pink and steam would come out of my ears in the style of a Tom and Jerry cartoon. The reality, I suspect, would probably not be quite so jolly. I spent the next day or so like a man carrying a Ming vase across a polished floor. Wearing socks. And boxing gloves. Blindfold. After a few beers. You get the picture. Loading The following evening, I got a call from a number I didn’t recognise. Usually, this would be some desperate publicist who thinks the way to get me enthused about their client’s latest book/collaboration/ground-breaking one-woman show about meerkat mating rituals is to call during dinner. However, for whatever reason, I picked up. On the line was the totally wonderful Dr Fiona Foo, one of the nation’s few female interventional cardiologists. She asked if I was busy the following day (nope – just sitting, trying to keep that vase in one piece). She could make time to operate on my micro-fatberg if I could get myself up to Macquarie University Hospital. Next day, I was at MUH all prepped and ready to go, chatting to the irrepressible doctor, who radiated confidence and competence, both important attributes in someone about to head up an artery on a Fantastic Voyage-style journey to your heart like anyone else might pop out to Coles. In an angiogram, tools are inserted into the artery via a small incision. Foo prefers the radial artery in the wrist but the groin is also prepped as a back-up.\n\nAdvertisement\n\nAll of which left me lying in a chilly operating theatre, Foo and her team around me, exposed in a manner that in other circumstances would result in a two-year good behaviour bond. But did I care? I did not. That would be the fentanyl they used to take the edge off. It’s a wonderful thing for lowering inhibitions and it made this all feel like the most glorious lark. It really ought to be illegal outside hospitals. Loading Alongside the operating table was a large video screen that allowed Foo to guide the tools to precisely the right spot. What I could see was pretty incomprehensible and quite dull, but I resisted asking for Netflix instead. Over the next 90 minutes or so, the dexterous Foo tamed the micro-fatberg with a tiny balloon and then inserted a stent – a wire cage – to hold open the artery. Shortly afterwards, I was wheeled to the Coronary Care Unit, where I spent the night being fussed over by a brilliant crew of nurses. Next morning, despite a sleepless night – just like on the movies, there are an awful lot of bleeping machines in a CCU, to which nobody pays the slightest bit of notice – I realise I’m feeling good. In fact, I’m feeling f--king sensational.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sense-of-impending-doom-should-the-liberals-and-nationals-break-up-forever/g7992uf1h",
    "title": "'Sense of impending doom': Should the Liberals and Nationals break up forever?",
    "publish_date": "Thu, 6 Nov 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/astronomical-price-gains-regional-property/nh4mia09c",
    "title": "These Aussie regions have posted 'astronomical' price gains — but there's a catch",
    "publish_date": "Thu, 6 Nov 2025 18:33:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "There's a lot of money to be made in Australia's 'ghost towns'.\n\n\n\n\n\nScattered along the country's coastlines and nature destinations are spots where the majority of homes sit empty for the bulk of the year, awaiting the return of their owners or short-term holidaymakers come summer.\n\n\n\n\n\nNationally, there were just over a million homes empty on Census night in 2021 — around 10 per cent, but less than the nearly 11 per cent at the previous Census in 2016.\n\n\n\n\n\nBut there are pockets of the country where that vacancy rate balloons — and alongside it, home values.\n\n\n\n\n\nWhile it's difficult to know exactly how many of the unoccupied properties on that Census night were holiday homes, 10 August 2021 was a Tuesday evening in winter, and many of the county's getaway homes likely sat dormant.\n\n\n\n\n\nRecent analysis by real estate company Ray White identified 10 regional areas with high vacancy rates where home values have had \"astronomical\" growth in the past decade, \"defying\" the conventional logic that high vacancy rates reflect slow market growth.\n\n\n\n\n\nOf the 10 areas it highlighted, the highest vacancy rate was in Moreton Island, off the coast of south-east Queensland, with a population of under 300 and a vacancy rate of 66 per cent.\n\n\n\nMoreton Island, off the coast of south-east Queensland, has a population of under 300 and a vacancy rate of 66 per cent. Source: Getty / Reinhard Dirscherl / ullstein bild The island has experienced 140 per cent growth in the median house price over the past decade, with the average home now sitting at $1.25 million.\n\n\n\n\n\nBut there are less extreme examples. The Central Highlands in Tasmania had a 58 per cent occupancy rate, with a 10-year growth of 157 per cent.\n\n\n\n\n\nBoth Point Nepean and the Lorne-Anglesea regions in Victoria had vacancy rates above 55 per cent, with a 10-year growth of 99.9 per cent and 103.4 per cent, respectively.\n\n\n\n\n\nThe average home in Point Nepean now sits at $1.31 million, while in the Lorne-Anglesea area that figure rises to $1.57 million.\n\n\n\n\n\nOn the NSW south coast, the 15km strip between Callala Bay and Currarong had a 48 per cent vacancy rate — but a 126.8 per cent 10-year growth rate, with the average home now at $1.15 million.\n\n\n\nSource: SBS News / Madeleine Wedesweiler Vanessa Rader, Ray White's head of research, said the report revealed Australia’s holiday home phenomenon had a concentrated geography, and these areas challenged fundamental assumptions about property investment returns.\n\n\n\n\n\n\"Using unoccupied housing data as a proxy for holiday home concentration reveals regional markets operating under entirely different economic principles than metropolitan residential investment,\" Rader said.\n\n\n\n\n\nNicola Powell, Domain's chief of research and economics, agreed that the locations were united by their lifestyle and holiday home appeal.\n\n\n\n\n\n'Classic' coastal or nature-based destinations had surged in recent years as Australians “increasingly sought lifestyle property”, particularly following the onset of the COVID-19 pandemic in 2020 and the move to remote and hybrid work, she said.\n\n\n\n\n\n\"I think it permanently boosted demand for homes in scenic and lower-density areas,\" Powell said. \"When you look at these regions, they cater for both second holiday homes, but also short-term letting as well.\"\n\n\n\nPowell said the scarcity of homes available to buy was also keeping property prices high in those areas.\n\n\n\n\n\n\"The limited stock and the high unoccupied proportion of dwellings really feed this,\" she said.\n\n\n\n\n\nGiven that surge, a holiday home can seem a straightforward investment for those wealthy enough to make one.\n\n\n\n\n\nBut looks — even pristine and coastal — can be deceiving.\n\n\n\nWhat other considerations are there?\n\nRader warned holiday homes can come with \"huge\" holding costs before a buyer has even spent a summer in one.\n\n\n\n\n\n\"Highly unoccupied regions operate infrastructure designed for seasonal rather than permanent populations. Holiday home owners encounter service connection delays, limited provider options, and higher charges reflecting peak-period capacity constraints,\" she said.\n\n\n\n\n\nRader said recent regulatory changes designed to respond to affordability pressures in the housing market could also reduce rental income potential for holiday home investors — such as Victoria's 7.5 per cent levy on short-stay platforms and councils implementing rates surcharges for Airbnb properties.\n\n\n\n\n\nIn the case of a remote location like Moreton Island, she said building materials and tradespeople required ferry transport, significantly increasing maintenance costs.\n\n\n\n\n\nBut perhaps the most significant concern is that many areas with high vacancy rates experienced environmental risks beyond what most traditional residential investments faced — and thus, higher insurance premiums.\n\n\n\nREAD MORE The problem that could cost Australia more than $8 billion every year\n\nRay White's report said properties in coastal areas could often attract insurance premiums 20 to 30 per cent above regional averages. Premiums for Moreton Island, for instance, often run 30 to 40 per cent above mainland alternatives, according to Ray White's analysis.\n\n\n\n\n\n\"[Premiums] have grown so considerably, and we are a nation that has a lot of these kinds of big natural disaster type events, unfortunately, particularly fires and flooding. It's really built into this kind of new cost to even own these properties,\" Rader said.\n\n\n\n\n\n\"In order to hold onto these assets, the outlay is far higher than they have been in the past.\"\n\n\n\n\n\nPowell also said Domain's research indicated that Australians priced in considerations like bushfires and riverine flooding when buying a home, with the price impact rising as those risk factors increased.\n\n\n\n\n\nHowever, she said coastal erosion — the loss of land along the shoreline due to factors such as rising sea levels — didn’t appear to have the same impact on price.\n\n\n\n\n\n\"What we found was that buyers prioritise location and views over those long-term risks. For every 10 metres away from the coast, the value of the home declined by 2.6 per cent,\" she said.\n\n\n\n\n\n\"We found that if a property is first in line [to the sea], it adds 20.4 per cent to the home's value, and if there's no road break, it adds another 5.4 per cent. So it really shows Australians prioritise lifestyle over risk.\"\n\n\n\n\n\nPowell said that anyone looking to buy in one of those locations needed to be careful.\n\n\n\n\n\n\"If you're unsure of what the risk is associated with the home that you're looking at, the quickfire way to find out is to get an insurance quote. The premiums really do tell you the risk profile.\"\n\n\n\nIs the bubble bursting?\n\nPowell said there was \"always going to be\" an element of demand for homes in these prime holiday locations.\n\n\n\n\n\nBut it remains to be seen whether the price growth in these areas is sustainable. In the last year, Glamorgan to Spring Bay in Tasmania experienced a 6.5 per cent annual decrease, with a 0.4 per cent increase in Tasmania's Central Highlands.\n\n\n\n\n\nWhile both Lorne-Anglesea and Point Nepean had high 10-year growth, they both had \"modest\" annual growth of 3.8 per cent. Rader says this suggests premium markets are reaching \"natural appreciation limits as affordability constraints restrict buyer expansion\".\n\n\n\n\n\nWith climate change continuing to intensify risks like rising sea levels and extended bushfire seasons, Rader said the long-term viability of homes in these scenic — but vulnerable — locations was also increasingly threatened.\n\n\n\nRader made the point, however, that even with a price ceiling, \"if there is a beautiful, lovely, newly built home, [high] prices are still being achieved\".\n\n\n\n\n\nDoes that high residential growth translate to commercial markets? It's unlikely, Rader said.\n\n\n\n\n\n\"Say you had a suburb with retail shops, if you can't keep your tenants in there because there isn't enough flow-through traffic, or they can only survive three months, six months of the year … not all businesses can do that,\" she said.\n\n\n\n\n\n\"How viable is that for that business? And then, how viable is that for the landlord that's trying to rent it out? So they're having to take a hit on their terms of their rent to make sure they keep the tenant in there.\"\n\n\n\n\n\nIf rising prices push people out of these areas, those locations will likely swing more and more towards being holiday tourism markets, cyclically driving increasingly higher vacancy rates.\n\n\n\n\n\n\"That market would really just cement itself as being a tourism destination first, more than a residential location. But people do need to live in these places, too,\" she said.\n\n\n\n\"If it were more of a trend and the prices were escalating so much, we would find local people would probably move slightly outside of that kind of core location,\" she added. \"The prices in that location would continue to increase, and in turn, the occupancy rate would continue to fall as well.\"\n\n\n\n\n\nRader said that as values rose in what were otherwise quite regional locations, with limited infrastructure because the population couldn't support it, \"there's only so much that you think that those markets can grow in a broader sense\".\n\n\n\n\n\n\"People aren't there all the time. There's only so many shops that can be there or so many activities that can always be on, or gyms and things that people like to go to, hospitals as well,\" she said.\n\n\n\n\n\n\"If you want to go on holiday somewhere, you want to have that kind of holiday experience. But can that holiday experience really be there when half of the year there's no one actually living in these locations?”\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/video/tasmania-becomes-first-australian-state-to-offer-compensation-for-homosexuality-convictions/o2l7onxog",
    "title": "Tasmania becomes first Australian state to offer compensation for homosexuality convictions",
    "publish_date": "Thu, 6 Nov 2025 08:26:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tasmania becomes first Australian state to offer compensation for homosexuality convictions\n\nPublished 6 November 2025, 5:56 am\n\nTasmania has become the first state in Australia to offer compensation for those charged or convicted of homosexuality or cross-dressing. Tasmania Correspondent Kerrin Thomas has more from Hobart",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/nab-results-disappoint-bank-sector-challenges/818xmrp7p",
    "title": "NAB results disappoint & bank sector challenges",
    "publish_date": "Thu, 6 Nov 2025 06:03:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sudans-civil-war-spirals-out-of-control-mamdani-takes-on-trump-would-you-snip-and-share/l5ds2hdw6",
    "title": "Sudan’s civil war ‘spirals out of control’, Mamdani takes on Trump & would you snip and share?",
    "publish_date": "Thu, 6 Nov 2025 06:00:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/national/50-years-on-the-whitlam-dismissal-explained-20251107-p5n8kn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "50 years on: The Whitlam Dismissal explained",
    "publish_date": "Fri, 07 Nov 2025 12:42:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "50 years on: The Whitlam Dismissal explained\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/this-italian-chopped-salad-is-one-of-adam-liaw-s-summer-go-tos-20251107-p5n8km.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This Italian chopped salad is one of Adam Liaw’s summer go-tos",
    "publish_date": "Fri, 07 Nov 2025 12:41:28 +1100",
    "category": "finance",
    "authors": [
      "Adam Liaw"
    ],
    "text": "Serving suggestion: You could also top the salad with torn fresh mozzarella, and keep the lettuce leaves whole if serving immediately. William Meppem\n\nChopped salads are a great summer go-to. They keep well in the fridge and the chopped leaves don’t go as noticeably limp in the sun as whole leaves.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/18-nutrition-packed-bowls-for-effortless-and-delicious-healthy-eating-20251104-p5n7rf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "18 nutrition-packed bowls for effortless and delicious healthy eating",
    "publish_date": "Fri, 07 Nov 2025 12:39:02 +1100",
    "category": "sports",
    "authors": [
      "Sarah Pound"
    ],
    "text": "You have reached your maximum number of saved items.\n\nRemove items from your saved list to add more.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-retreat-tech-giants-weigh-down-wall-street-20251107-p5n8f5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX loses ground, Macquarie slumps; tech giants weigh down Wall Street",
    "publish_date": "Fri, 07 Nov 2025 12:38:38 +1100",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "The Australian sharemarket has slipped into the red by lunchtime after Wall Street lost ground overnight as influential technology stocks fell.\n\nThe S&P/ASX 200 was down 11 points, or 0.1 per cent, to 8817.3 in early afternoon trade, with six of 11 industry sectors in positive territory, led by energy stocks. Tech shares are the biggest weight on the local bourse.\n\nCorporate earnings and forecasts have been the big focus all week. Credit: AP\n\nFinancial stocks are weaker, with the big four banks mixed. National Australia Bank jumped 1.9 per cent, to regain some of Thursday’s heavy losses after releasing its results, Commonwealth Bank lost 1 per cent, Westpac lost 0.5 per cent and ANZ Bank was flat. Macquarie tumbled 7 per cent after unveiling a $1.7 billion profit, which was below expectations.\n\nEnergy stocks advanced to bolster the wider market as oil prices rose this morning. Woodside Energy jumped 1.5 per cent, Ampol rose 0.3 per cent and Santos advanced 0.6 per cent.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/adam-liaw-s-fried-mini-pizzas-plus-why-you-should-put-ketchup-in-your-pizza-sauce-20251107-p5n8ic.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Adam Liaw’s fried mini pizzas (plus why you should put ketchup in your pizza sauce)",
    "publish_date": "Fri, 07 Nov 2025 12:18:28 +1100",
    "category": "finance",
    "authors": [
      "Adam Liaw"
    ],
    "text": "Step 1 To make a sauce, combine the garlic, oil, smoked paprika, passata and tomato ketchup in a small saucepan. Cover and place over medium heat. Simmer for 10 minutes. Season with salt and set aside while you prepare the pizzas.\n\nStep 2 Heat a large frying pan over medium heat and add plenty of olive oil (about 1 tablespoon per base). Fry the bases one at a time for about 2-3 minutes on each side, then arrange on serving plates.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/afl/a-clear-no-1-bolters-and-bidders-who-your-afl-club-will-pick-in-the-draft-20251103-p5n7e7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A clear No.1, bolters and bidders: Who your AFL club will pick in the draft",
    "publish_date": "Fri, 07 Nov 2025 12:02:11 +1100",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "A back stress injury meant Uwland missed this year’s championships after an outstanding bottom-age campaign last year that had him pegged as the best prospect in the 2025 class. The man viewed as Errol Gulden 2.0 did not reach those heights in the limited football he played after recovering, but his football IQ is as good as anyone’s in this draft. He boasts silky skills and can run all day. Might captain the Suns one day. If not: There has been noise for a while, which heated up during the trade period, that the Eagles might bid on Carlton father-son defender Harry Dean. They could also opt to bid on Dylan Patterson or Daniel Annable here. Patterson might be the most damaging and exciting player in this year’s draft. He takes the game on with his kicking and fast feet – including a nasty goose step – and sometimes tries to do too much, but showed in a VFL game against Carlton late in the season that he can rein his attacking nature in. Likened to Andrew McLeod, Patterson rejected NRL clubs’ overtures to stay on the AFL path, and could be a difference-maker for the Suns.\n\nIf not: Gold Coast will desperately hope this doesn’t happen because it would cruel their chances of securing their five fancied academy prospects. West Coast might pick Cooper Duff-Tytler instead, or bid on Dean or Annable. The Eagles have long been linked to Duff-Tytler, a talented ex-basketballer who boasts similar traits to AFL ruck stars Luke Jackson and Tom De Koning with his athleticism, leap, agility and follow-up work. He showed in a VFL appearance for Essendon, where he played predominantly as a forward, that he can impact the game in attack as well, even if that remains a query in some quarters. Should develop rapidly in an AFL environment. If not: Some recruiters think the Eagles would at least consider Sullivan Robey. There is also a chance Richmond are already picking here, and they could snap up Robey before placing bids.\n\nRobey is this year’s bolter, after many clubs hoped they could keep him a secret once he graduated from Rowville’s senior side to belatedly burst onto the scene for the Ranges mid-season. He grew about 17 centimetres in the past two years and developed physically, in equal parts owing to an impressive home gym and his dedication. First made his mark as a lead-up forward, then showed his strength and power as a midfielder. If not: The Tigers might start bidding first. They are also linked to Xavier Taylor and Sam Grlj. The Lions’ premiership window will never shut if kids like Annable keep popping up, after the Ashcroft brothers arrived in recent years. Annable racks up disposals, excels at stoppages and is creative by hand. There are all sorts of flattering comparisons ahead of the draft each year, and recruiters see a bit of Simon Black in Annable. Brisbane will gleefully match any bid on Annable, and would quietly be chuffed if it comes this late. If not: The Tigers either stopped bidding and selected Taylor or Grlj, or bid on Dean instead.\n\nThis would be ideal for the Blues, given Dean is widely rated as a top-five talent. A bid here would also not wipe out both their first-round picks. Dean is one of the best key defender prospects in years, and stands out because there is a major shortage of that position in this crop. He aggressively flies for marks and spoils, reads the ball superbly, and has the athleticism and composure to thrive at the top level. If not: A Dean bid has already come and gone, and the Tigers are bidding on someone else. It would be a shock if Dean did not receive a bid by this pick.\n\nTaylor once polarised because of inconsistent decision-making and execution, including a habit for kicking into the man on the mark – but he has cleaned that up (mostly), and risen sharply on draft boards. Was best afield in the Ranges’ grand final triumph, where his intercepting skills, athleticism, versatility and competitiveness were on show. Importantly, there is confidence Taylor will stand up defensively in the AFL. If not: The Tigers went for Sam Grlj’s combination of blazing speed, endurance and athleticism. The Bombers could shape the draft with their back-to-back picks. The suspicion is they will invest in midfielders after parting with Dylan Shiel, Will Setterfield and Ben Hobbs, on top of the Zach Merrett situation, Darcy Parish’s injury history, and with Elijah Tsatas still proving himself. Sharp won the Larke Medal as the best-performed player at the championships, and is a physical, competitive onballer who wins the ball in big doses. If not: Essendon have also been linked to Sam Cumming, Jacob Farrow and forward-ruck Aidan Schubert.\n\nA shoulder injury cut Cumming’s season short, but not before he stamped himself as a potential top-10 selection. He is a dual-position threat who can impact the game as a deep forward with his marking ability and knack for kicking goals, or as a midfielder, where his physicality, aggression and dynamism are all ticks. There have even been Mark Ricciuto comparisons. Recruiters also like Cumming’s defensive commitment. If not: The Bombers might instead opt for Farrow, who some believe has more upside and would likely start at half-back before eventually moving into the midfield. The Demons are never afraid to go against the grain. This is higher than Nairn has been projected, but Melbourne have him in their sights. Nairn had a seven-goal game at the championships before demonstrating his ball-winning wares with consecutive 30-plus-disposal outings to end the season. He is a high IQ footballer, can run all day as a wingman, could develop into an inside midfielder, marks well overhead and is a neat kick.\n\nIf not: They would love Sam Cumming to still be on the board, and might select small forward Lachy Dovaston, defender Jacob Farrow or try to fortify their key defensive posts for the future with Blake Thredgold. Dovaston, who hails from the same Talent League club as Nick Watson, is the best small forward in this draft. He might lack Watson’s tricks, but still has his share, and has greater running capacity and is considered superior defensively to when the star Hawk was the same age. Dovaston kicks goals for fun (and lots of them), is consistent, has become more selfless, runs hard up and down the ground, and tested brilliantly at the combine. If not: Farrow would give the Demons another kicking weapon across half-back, and could become a midfielder in time. Thredgold would also make sense with Steven May nearing the end of his career, while they could pair Latrelle Pickett with his cousin Kysaiah.\n\nLittle is known across the league about the Hawks’ plans, but Farrow would be a good get. His draft range starts at Essendon’s picks, and he has admirers into the mid-teens. Farrow is one of the best kicks in this class, makes quick decisions, impacts the game as an interceptor, and showed his agility in combine testing. He has also performed well in the midfield, but is more proven down back, where he will start and possibly stay in the AFL. If not: The Hawks might go for Sam Grlj’s mix of speed and endurance, or they could look to bolster their forward line with one of Mitch Marsh, Aidan Schubert or Archie Ludowyke. The Blues might lose this pick, depending on where a Harry Dean bid comes. They would love Lachy Dovaston to still be available, but Grlj has speed to burn and was one of only two players to run the two-kilometre time trial quicker than six minutes at the combine. He entered top-five calculations with a superb start to the year before hitting a rough patch, but his VFL form for Richmond was excellent. Grlj could eventually become a midfielder. If not: Carlton might continue their small forward pursuit and pick Latrelle Pickett, or could be in the market for a defender such as Oskar Taylor or Josh Lindsay, who bring different strengths.\n\n15. Oskar Taylor (GWS) South Belgrave/Eastern Ranges\n\nDefender, 183cm, 2/5/2007\n\nTalent League U18 stats (avg): 20.5 disposals, 3.2 rebound 50s, 5.1 intercept possessions It is dangerous to predict what the Giants might do, but Taylor seems a good fit. His stocks increased the longer the year went after not playing at the championships, capped by his eye-catching results at the combine, where he set the fastest 20-metre sprint time and finished second for agility. Taylor puts that acceleration to great use to quickly create separation and get the ball moving forward. He can tidy up his kicking and improve defensively. If not: The Giants have also been linked to Latrelle Pickett, while Grlj would be in contention if he were available. Others mentioned were Archie Ludowyke and West Coast next-generation academy forward Tylah Williams. 16. Latrelle Pickett (West Coast)\n\nTumby Bay/Glenelg\n\nForward, 182cm, 28/12/2005\n\nSANFL reserves stats (avg): 11.9 disposals, 4.9 score involvements, 1.8 goals Melbourne star Kysaiah Pickett’s cousin has top-20 interest in what is an even crop, but there is a chance he is still up for grabs in the 20s. Pickett turns 20 in December, so he is slightly older than his draft peers, but has impressed this year with his progress at Glenelg. The Eagles are among the clubs that have kept a close eye on Pickett, who is quick, elusive, capable of the mercurial, and has the cheek that the best small forwards possess. If not: The Eagles might opt for the safer option of sweet-kicking defender Josh Lindsay, or could grab a forward such as Aidan Schubert, Mitch Marsh or Archie Ludowyke. 17. Josh Lindsay (Western Bulldogs) Newtown & Chilwell/Geelong Falcons/Victoria Country\n\nDefender/midfielder, 183cm, 7/4/2007\n\nTalent League U18 stats (avg): 20.5 disposals, 7 contested possessions, 3.7 intercept possessions\n\nU18 champs stats (avg): 22.3 disposals, 4.8 intercept possessions, 444 metres gained\n\n2025 All-Australian\n\nLindsay is an excellent decision-maker and arguably the best kick in the draft – the result of years of dedication honing his skills, including a strict morning routine – so this would be a good result for the Bulldogs. He has been a consistently high performer at all levels, and is viewed as a safe selection who could slot straight into a defensive role. There are varying opinions on whether Lindsay could develop into a midfielder. Josh Lindsay won the best on ground medal playing for the Australia under-18a against Coburg VFL in April. Credit: via Getty Images If not: The Dogs have a key defensive need, so they could go for Thredgold, who is comfortably the best tall backman still available. 18. Blake Thredgold (Adelaide) Payneham Norwood Union/Sturt/South Australia\n\nDefender, 194cm, 27/8/2007\n\nSANFL U18 stats (avg): 11.6 disposals, 5.4 marks, 2 intercept marks\n\nU18 champs stats (avg): 13 disposals, 5 marks, 1 intercept mark\n\nRecruiters took notice of Thredgold’s solid job last year as a bottom-ager on future Collingwood forward Charlie West. He also quelled fellow first-round prospect Mitch Marsh in this year’s SANFL under-18 grand final and dominated in the air to cap a strong finals series. Thredgold is on North Melbourne’s radar, but the Crows might get in first. He is a tad undersized but a genuine lockdown defender who is strong, athletic and competitive. If not: There are lots of South Australian options, if the Crows want to go down that path. Marsh, Aidan Schubert, Jevan Phillipou and Harley Barker would all be viable options. 19. Archie Ludowyke (Geelong) East Sandringham/Sandringham Dragons/Victoria Metro\n\nForward, 197cm, 19/11/2007\n\nTalent League U18 stats (avg): 9.3 disposals, 3.3 F50 marks, 3.3 goals\n\nU18 champs stats (avg): 4 disposals, 1 mark, 1.7 score involvements Ludowyke started the year brightly for the Dragons and the AFL Academy after long being rated the best key forward in this class. However, he had a goalless championships – which was not all his fault, as a player relying on service – before suffering a season-ending PCL injury in Metro’s win over the Allies. This would be a classic Cats play to invest in a player with good size and athleticism who launches himself at the Sherrin.\n\nLoading If not: Geelong regularly, and successfully, ignore the status quo in the draft. Mitch Marsh, Aidan Schubert, Louis Emmett and Harley Barker might be in play. Or could they bid on Jai Murray (Gold Coast) or Tylah Williams (West Coast)? 20. Mitch Marsh (Fremantle) Kangarilla/West Adelaide/South Australia\n\nForward, 190cm, 15/2/2007\n\nSANFL U18 stats (avg): 12.5 disposals, 6.1 marks, 2 goals\n\nU18 champs stats (avg): 8.5 disposals, 6 marks, 3 goals\n\n2025 All-Australian The Dockers gleefully drafted 2025 Rising Star winner Murphy Reid at around this pick last year, and could unearth another bargain in Marsh, who kicked the most goals at the 2025 championships. He emerged from the carnival as a top-10 contender who some thought could play other positions, but appears to have slid after a so-so end to the season. But the talent and upside are there, and Marsh could add to a talented Freo forward line.\n\nIf not: The Dockers could place a bid on West Coast next-generation academy forward Tylah Williams, or might punt on upside with one of All-Australian winger Harley Barker or talented forward Noah Hibbins-Hargreaves. 21. Aidan Schubert (Essendon) Gawler Central/Central District/South Australia\n\nForward/ruckman, 196cm, 21/12/2007\n\nSANFL U18s stats (avg): 19.2 disposals, 4.4 clearances, 2.2 goals\n\nU18 champs stats (avg): 17 disposals, 3.3 F50 marks, 2.5 goals\n\n2025 All-Australian The Bombers might snap up Schubert with one of their first two picks, so would probably be delighted if he is still up for grabs here. His awkward ball drop and kicking style are talking points, and put some clubs off, while he measured shorter than some scouts expected. But Schubert had an outstanding championships to surge into the top-10 mix. Talls can sometimes drift, given the risks involved, but his competitiveness and endurance appeal. If not: There are interesting names still available, so Essendon may continue the midfield theme with Oliver Greeves, add more talent to their front end with Noah Hibbins-Hargreaves, or go for ACL-recovering winger Harley Barker.\n\nLoading 22. Oliver Greeves (Hawthorn) Vermont/Eastern Ranges/Victoria Metro\n\nMidfielder, 191cm, 7/2/2007\n\nTalent League U18 stats (avg): 25.5 disposals, 9.8 contested possessions, 1.1 goals\n\nU18 champs stats (avg): 25 disposals, 11.8 contested possessions, 4.5 clearances\n\n2025 All-Australian Greeves is linked to the Hawks by virtue of their rejected application to include him in their next-generation academy program because of his Indigenous background. He also trained with them during the pre-season through the AFL Academy. Greeves is polarising – with most queries centred on his running ability – but a contested beast who has the height and ability to also impact the game when he plays as a marking forward. If not: Hawthorn did a great job rebuilding their list in the draft, and in trade and free agency, so there are not many holes. They can probably afford to take a risk on Harley Barker, or show patience with someone such as Louis Emmett.\n\nSecond round 23. Louis Emmett (North Melbourne) Glen Iris/Oakleigh Chargers/Victoria Metro\n\nRuckman/forward, 199cm, 23/3/2007\n\nTalent League U18 stats (avg): 15.3 disposals, 9.3 contested possessions, 1.1 goals\n\nU18 champs stats (avg): 12.7 disposals, 4.3 marks, 2 clearances There is talk the Kangaroos might trade for Gold Coast’s pick 18 (before it is absorbed in matching bids), but it is unclear if that move is directly related to trying to select key defender Blake Thredgold. The popular view on Emmett, who finished third in the time trial at the combine, is that he will need to develop into a key-position player at either end – but there is upside here. His draft range starts far earlier than this and could be wider. If not: Could the Roos bid on some of the glut of players in this part of the draft, such as Sydney’s Max King, Harry Kyle and Lachy Carmichael, Essendon’s Adam Sweid, Gold Coast’s Jai Murray and Beau Addinsall, Carlton’s Jack Ison or Collingwood’s Zac McCarthy?\n\n24. Harry Kyle (Sydney match North Melbourne bid) UNSW-Eastern Suburbs Bulldogs/Sydney Academy/Allies\n\nDefender/midfielder, 188cm, 16/7/2007\n\nTalent League U18 stats (avg): 20.8 disposals, 9.3 contested possessions, 1.1 goals\n\nU18 champs stats (avg): 12.5 disposals, 10.3 uncontested possessions, 1.3 intercept possessions As always with bids, particularly in this region of the draft, there is a great unknown, but recruiters think this is roughly where Kyle might bob up. The Swans academy product finished top 10 in three tests at the combine, including winning the running vertical jump. Part of Kyle’s appeal is that this was his first year in the academy, so there is serious scope for improvement. He is a good size, has a big tank and brings positional versatility. If not: The Kangaroos might bid on someone else, or not at all. They previously drafted Brayden George off an ACL, so they may be wary to do so again with Harley Barker, but the South Australian could reap great rewards. Other options might be Jevan Phillipou or Riley Onley. 25. Jevan Phillipou (North Melbourne)\n\nLoading PHOS Camden/Woodville-West Torrens/South Australia\n\nMidfielder/forward, 183cm, 30/3/2007\n\nSANFL U18 stats (avg): 22.7 disposals, 9.7 contested possessions, 4.9 clearances Just like his St Kilda-listed brother Mattaes, Phillipou made an impression with his supreme confidence in club interviews. Injury sidelined him from the championships, and at different stages of his junior career, but there is plenty to like, including how self-driven and talented he is. The ex-decathlete is a good athlete, and brings the speed and dynamism that clubs want. Some recruiters rate him in the teens, so don’t be surprised if he is long gone. If not: The Roos could go for someone else in this range, such as Harley Barker or Riley Onley, but rival recruiters don’t expect them to go for Noah Hibbins-Hargreaves, given his similarities to Zane Duursma. 26. Harley Barker (Essendon)\n\nMount Barker/Sturt/South Australia\n\nWingman, 188cm, 2/5/2007\n\nSANFL U18 stats (avg): 16.8 disposals, 6.8 marks, 3.2 clearances\n\nU18 champs stats (avg): 16 disposals, 3.3 inside 50s, 5.8 score involvements\n\n2025 All-Australian There is risk with Barker, who sustained an ACL rupture playing for Sturt after earning All-Australian honours. If a club is willing to take that on board, there is so much to like about Barker’s prospects, given he was considered a top-10 smokey after his championships performance. His size, speed, endurance and skill add up to an impressive package, and he uses his running ability to get involved at both ends. There is a chance he slides. If not: The Dons might bid on a player instead, but might not want to tempt fate on their academy players Adam Sweid and Hussien El Achkar. Other options include Riley Onley, Noah Hibbins-Hargreaves and Sam Swadling. 27. Jack Ison (Carlton match Essendon bid) Parkside/Oakleigh Chargers/Victoria Metro\n\nMidfielder/forward, 191cm, 26/3/2007\n\nTalent League U18 stats (avg): 20.5 disposals, 4.5 clearances, 4.5 tackles\n\nU18 champs stats (avg): 13.3 disposals, 4.7 score involvements, 3.7 tackles\n\nLoading Injuries impacted the start of Ison’s season, but the Blues’ next-generation academy prospect finished strongly – and opposition recruiters took notice. Ison’s height and aerial prowess make him a candidate to fill various roles across the ground, beyond just the midfield. There is still a smallish sample size on him, but the scouting report acknowledges that he can do things others in this range cannot, so Carlton will gleefully match a bid. If not: There are a heap of other players in this part of the draft who are connected to clubs, and clubs will likely start bidding upon them somewhere here. 28. Max King (Sydney match Essendon bid) Cardiff Hawks/Sydney Swans Academy/Allies\n\nForward/midfielder, 191cm, 1/9/2007\n\nTalent League U18 stats (avg): 14 disposals, 3.8 marks, 2.3 tackles\n\nU18 champs stats (avg): 7.3 disposals, 2.7 marks, 0.7 goals\n\nCould the Bombers make a double bid? There is probably not a better athlete in this draft, and he blew everyone away with his 80-centimetre vertical jump at the combine. King took some breathtaking grabs throughout the season, and his individual highlights and potential are why he was once viewed as a top-10 contender – and why a bid could come in the teens. The challenge in rating him is whether his football IQ will catch up to his athleticism. If not: As above, there are many other bidding candidates, or players such as Riley Onley, Noah Hibbins-Hargreaves and Sam Swadling likely come into calculations. 29. Noah Hibbins-Hargreaves (Essendon) Mornington/Dandenong Stingrays/Victoria Country\n\nForward, 186cm, 16/11/2007\n\nTalent League U18 stats (avg): 16.3 disposals, 1.9 F50 marks, 1.5 goals\n\nU18 champs stats (avg): 12 disposals, 8.8 uncontested possessions, 1.5 goals The glimpses are incredibly exciting when it comes to Hibbins-Hargreaves, who produced some enormous performances in his draft season, including several bags of goals. He is best suited as a forward, where his class and skill come to the fore. That said, there are concerns about Hibbins-Hargreaves’ inconsistency and contest work at ground level. Some recruiters would not consider him here, but others might jump earlier than this.\n\nIf not: Could the Bombers pick their own academy product, Adam Sweid, here instead? Rival recruiters have asked that question. 30. Lachy Carmichael (Sydney match Western Bulldogs bid)\n\nSydney Swans Academy/North Shore Bombers/Allies\n\nDefender, 183cm, 27/8/2007\n\nTalent League U18 stats (avg): 27 disposals, 7.7 contested possessions, 5.7 intercept possessions\n\nU18 champs stats (avg): 24.8 disposals, 4.8 rebound 50s, 6 score involvements\n\n2025 All-Australian Will the Swans match a third academy player in the top 30? In a draft where many prospects are flawed or erratic, Carmichael’s ultra-consistency across several years is a big tick. He was an All-Australian at under-16 level in 2023, and earned that same honour at this year’s under-18 championships, where he was also the Allies’ MVP. Carmichael is defensively sound, but his kicking and relative lack of athleticism keep him in this range. If not: Sydney may not match a Carmichael bid if it comes so soon after ones on Harry Kyle and Max King, but it will be interesting to see. The Dogs could also bid on any number of other club-tied prospects, including Gold Coast pair Jai Murray and Beau Addinsall.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/nsw/nab-employee-charged-over-role-in-penthouse-syndicate-s-alleged-150m-bank-fraud-20251105-p5n81i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Luxury watches and jewellery: The extravagant life of an alleged NAB fraudster",
    "publish_date": "Fri, 07 Nov 2025 12:00:05 +1100",
    "category": "finance",
    "authors": [
      "Riley Walter"
    ],
    "text": "“One way to let your wrist alleviate stress away is by practicing some twist movement, and I’m feeling better already,” Sungkar wrote in one post flashing a Rolex Datejust Wimbledon in a video that appears to have been filmed while he was working in NAB’s business centre. Loading In another, Sungkar proudly poses inside a Tokyo branch of the pre-owned luxury watch retailer Okura with a Hublot watch worth up to $30,000. In other posts, Sungkar proudly displays an Audemars Piguet worth up to $35,000. Addressing the growing scandal for the first time, NAB chief executive Andrew Irvine on Thursday told the this masthead: “Insider fraud is always difficult, we’ve got zero tolerance for it, and you can be sure that we’re looking at all of our processes and controls to make sure that those are strengthened as we go forward.” Sungkar has been sacked by the bank, having initially been stood down pending the outcome of internal and police investigations.\n\nSungkar had worked for the bank since 2008, when he was employed in a customer advisory role, and was promoted to a senior position in October 2018 when he returned from an 18-month stint working as a mortgage broker. He was promoted to his position, in which he dealt directly with mortgage brokers who provided him with documents for loan applications, in August 2022. Several other NAB employees are under investigation for allegedly facilitating home and business loans for the syndicate under the direction of the Penthouse Syndicate’s alleged ringleader, Shanghai-born 38-year-old Bing “Michael” Li. Those employees have not been charged, but have been stood down from their positions pending the outcome of an internal investigation and detectives’ probe into the employees’ alleged involvement with the syndicate. No NAB customers have been targeted in the alleged fraud. Detectives have arrested 16 syndicate members since Strike Force Myddleton was formed last January to investigate a $10 million fraud scheme involving the purchase of non-existent luxury cars in Sydney’s west.\n\n“I said that we’d be coming for them, and we’ve started,” Detective Superintendent Gordon Arbinja, commander of the financial crimes squad, told this masthead. “And this person won’t be the last.” Detective Superintendent Gordon Arbinja, commander of the financial crimes squad, said further arrests linked to the Penthouse Syndicate are expected. Credit: Janie Barrett In what was a major catalyst for the Penthouse Syndicate’s spectacular downfall, Li was arrested in July in the $18 million penthouse of the Crown’s residential tower at Barangaroo, from where police say he directed the syndicate. Detectives believe the syndicate has defrauded several of the major banks and other financiers of more than $250 million dating back at least seven years. Li’s arrest and the subsequent investigation into the NAB employees has brought police scrutiny to professionals working on the outskirts of the finance industry, including corrupt solicitors, mortgage brokers and real estate agents who police say form a network of facilitators that helped the syndicate build its multimillion-dollar property portfolio.\n\n“At every single point of the transaction, there’s trust. Whether it’s a banker, whether it’s a solicitor, a conveyancer, a valuer – there’s always an element of trust that the bank relies upon – and every single time, that trust has been violated,” Arbinja said. Li, who remains in custody after several failed bail applications, has been charged with more than 80 offences related to $12.9 million worth of fraud linked to the luxury car scheme and other frauds, but police allege he was heavily involved in orchestrating a large portion of the alleged NAB fraud and has, through mules hired by the syndicate, bought several properties in the past two years. Detectives allege Li has orchestrated the laundering of millions of dollars through the purchase of property and other assets. The Penthouse Syndicate’s alleged ringleader, Bing “Michael” Li, was arrested in the penthouse of the Crown’s residential tower in July. Other NAB employees at several locations across Sydney are suspected of receiving bribes from the syndicate to approve home and business loan applications, which police allege they knew were submitted with fraudulent documents including company records, tax returns and financial statements. The syndicate’s alleged infiltration of the finance giant raises questions about what anti-corruption measures were in place at the bank, which became aware of the alleged fraud and its scale only through the police investigation.\n\nIn July, NAB finalised an enforceable undertaking with the federal government’s anti-money laundering and financial crimes watchdog, the Australian Transaction Reports and Analysis Centre (AUSTRAC). Loading In exchange for being spared a multimillion-dollar fine, NAB agreed to improve its compliance with anti-money laundering laws and counter-terrorism financing laws. Despite the scrutiny on the bank’s fraud and money-laundering controls, most of the Penthouse Syndicate’s alleged defrauding of NAB was carried out while the undertaking was in place. Sungkar was allegedly paid $17,000 to facilitate fraudulent business loans worth millions of dollars for “shell” companies purchased by the syndicate. Sungkar was allegedly paid through transfers made to his now-estranged wife’s bank account by Li.\n\nPenthouse Syndicate members have purchased several of the companies, which typically have a minimum of two years’ trading history, for between $5000 and $10,000. Police allege the syndicate has used fraudulent financial documents linked to the companies to inflate members’ income, allowing them to secure multimillion-dollar mortgage and business loans. Sungkar is alleged to have approved fraudulent business loans worth millions for several shell companies linked to syndicate members Hanna Karliana and her partner, Indra Hari Nurkianto. Karliana, 61, and Nurkianto, 60, were in August charged with a number of offences over their alleged roles in the Penthouse Syndicate. Police allege Sungkar facilitated fraudulent business loans for syndicate members Hanna Karliana and Indra Hari Nurkianto. Credit: Instagram Police allege the couple bought $15 million worth of property – two CBD apartments and a Bellevue Hill townhouse – on behalf of the syndicate using fraudulent documents. Sungkar is accused of facilitating millions of dollars worth of business loans for shell companies of which Karliana and Nurkianto were directors. “This person, as far as I’m concerned, is the gatekeeper of funds,” Arbinja said.\n\n“Wtihout this person, the fraud cannot be facilitated. So he’s in a position of trust. He violated that trust, and now, we know that over $200 million in funds have been attributed to this organised crime syndicate.” Loading Chris Sheehan, head of NAB’s group investigations and fraud business unit, said the bank had “zero tolerance for employees who engage in criminal conduct”. “There is absolutely no place for financial crime in our community and we recognise the important role we play in the monitoring and reporting of suspicious activity, working closely with police as well as regulators and government agencies as necessary,” Sheehan said. Sheehan said NAB was working with police and providing “significant support to aid the investigation and attempted recovery of any funds lost to criminal activity”.\n\nArbinja said NAB had co-operated with the police investigation since it became aware of the alleged fraud. “These types of syndicates can only be investigated thoroughly with the proper cooperation of our banking partners. It can’t be done solely with police,” he said. “We cannot get to this day without the bank’s assistance.” Beyond NAB, detectives are investigating the syndicate’s suspected infiltration of the country’s other major banks, which the group is believed to have defrauded. The NSW Crime Commission has seized $60 million worth of property, cars and luxury goods linked to Li, his partner, Zhouyao “Yumi” Chen and other syndicate members.\n\nChen, 37, has been charged with several offences related both to the luxury car scheme, and more than $4 million worth of allegedly fraudulent NAB mortgage and business loans. Karliana and Nurkianto’s daughter-in-law, Thi Ngo Hao Vu, 35, has been charged with a number of offences related to $3.2 million worth of allegedly fraudulent mortgage and business loans. According to court documents, another senior NAB banking manager allegedly approved a $2 million mortgage application and a business loan worth almost $500,000 after advising Li, Vu and her husband, Ibnu Pratama, which documents would be needed to secure the loan. The mortgage was used to purchase Bondi Junction beauty salon Beauty Pavilion. Pratama left Australia in December 2023, a week after detectives raided the home of one of his, Li and Vu’s Beauty Pavilion business partners. He has not returned to the country. A warrant for his arrest was issued in September.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/put-your-general-knowledge-to-the-test-with-the-good-weekend-quiz-20251105-p5n7zy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Put your general knowledge to the test with the Good Weekend quiz",
    "publish_date": "Fri, 07 Nov 2025 11:59:00 +1100",
    "category": "finance",
    "authors": [],
    "text": "By Brian Yatman\n\nTry our new Mini Crossword\n\nTen clues. Twenty-five squares. How quickly can you solve this bite-sized puzzle? Track your win streaks and challenge family and friends by sharing your results.\n\nPremium subscribers to The Age can play the Mini Crossword (and all our puzzles, including Target Time) here and premium subscribers to The Sydney Morning Herald can play them here.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/business/companies/absolute-game-changer-qantas-launches-new-premium-class-for-economy-20251107-p5n8hb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Absolute game-changer’: Qantas launches new premium class for economy",
    "publish_date": "Fri, 07 Nov 2025 11:50:37 +1100",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "The Qantas is launching Economy Plus, a class that will give customers up to 40 per cent more legroom, priority boarding and access to overhead baggage space.\n\nThe product, deemed “significant” by one industry participant, will help refocus Qantas’ on the domestic business travel segment, which is facing stiff competition from Virgin Australia and a lacklustre recovery from the COVID era.\n\nQantas Economy Plus seating will roll out in 2026.\n\nEconomy Plus will be like premium economy but on domestic short-haul flights. It will be available in the new Airbus A321XLR and A220s across the airlines’ network in Australia, New Zealand and the Pacific Islands. It will also be added into Boeing 737s cabin refits, announced in February.\n\n“We’re always looking for ways to enhance the onboard experience and maximise comfort for our customers,” said Qantas chief executive Vanessa Hudson. “We believe this new seating product will be popular with our corporate and leisure travellers when it launches next year.”",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/politics/federal/as-rates-hit-the-brakes-is-3-6-per-cent-as-low-as-we-should-go-20251106-p5n864.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "As rates hit the brakes, is 3.6 per cent as low as we should go?",
    "publish_date": "Fri, 07 Nov 2025 11:49:52 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "But as the Commonwealth Bank’s head of Australian economics Belinda Allen noted, there might not be any further rate cuts. “We expect it would take a material move higher in the unemployment rate, together with more moderate inflation prints, to bring the RBA back to the cutting table,” she said. Something not in Chau’s question, or remarked upon by Bullock itself, is how the economy and Australian consumers are performing with the cash rate at 3.6 per cent. Every major lender has reported in recent weeks that delinquency rates - the proportion of people behind on their mortgages - is actually falling (from barely elevated levels). Household consumption has lifted, both in quantity and value. The private sector is, as the RBA noted, starting to take over from the public sector.\n\nThere is real financial pain in parts of the community while unemployment has ticked up. Foodbank this week reported that half of all renters are suffering some form of “food insecurity” which means they are trying everything from reducing the quality and variety of food to skipping meals. Foodbank Queensland volunteers at the food distribution warehouse in Brisbane. Demand for its services remains at very high levels. Credit: @foodbankqld The Reserve’s own liaison program with charities is finding that demand for services continues to exceed supply, with the biggest pressure points “homelessness, emergency financial and food support and domestic violence”. What’s been surprising, however, has been the lack of widespread and demonstrable financial damage across the nation’s army of borrowers who have borne the brunt of the RBA’s actions.\n\nAfter the Reserve started lifting the cash rate from its 0.1 per cent pandemic-era low, there were real fears for the huge proportion of mortgage holders who had taken fixed rate loans. Loading When these loans re-set at much higher rates, the argument ran, Australians en masse would tumble lemming-like off a “mortgage cliff”. That would be on top of all those people with variable rate mortgages who would struggle to survive. But the cliff and economic disaster didn’t eventuate. Research compiled by a group of economists including several from the e61 think tank, released this week, suggests Australians’ use of offset and redraw accounts may be the nation’s economic secret sauce.\n\nWhile annual repayments on variable mortgage lifted by an average $13,800, the economists found the impact on consumer spending was muted. One of the report’s authors, Gianni La Cava, said people used their mortgage offset and redraw facilities, enabling them to maintain their spending. And, as rates came down, most borrowers did not reduce their repayments. They started rebuilding their mortgage-linked savings. This has major repercussions for the Reserve Bank and how it thinks movements in interest rates work and whether 3.6 per cent will actually bring inflation under control. “The borrower cash flow channel of monetary policy may have weakened in both directions. The resilience that helped households weather higher rates may also dull the stimulus from lower ones,” La Cava said.\n\nReserve Bank data shows even as the share of household income used to pay mortgages hits 10 per cent, the level of excess mortgage repayments has grown. While the bank will never admit it, especially during a heated political battle over the nation’s housing market, there is a concern that ever-lower interest rates will supercharge property prices. In this week’s quarterly monetary policy statement, the bank revealed that for every 10 per cent lift in housing prices, economic growth is 0.7 per cent higher. In dollar terms, that’s an $18.5 billion jump in economic activity. “The boost to GDP growth also flows through to higher inflation; in particular, we would expect new dwelling inflation to rise sharply as capacity pressures in housing construction increase,” it noted.\n\nThat increase in activity would push up underlying inflation by about 0.25 percentage points. Such a lift would not only kill any prospect of further rate relief, it would put a rate increase on the agenda. The Grattan Institute noted this week in its report advocating major changes to capital city planning rules that the nation’s ratio of house prices to income has soared over the past two decades. Sydney’s median house cost 6.3 times the median household income back in 2001. Now that median house costs around $1.5 million or almost 10 times median household income. Brisbane and Adelaide have seen even larger increases in the income needed to buy a new home while the ratio has almost doubled in Canberra (with a median house value approaching $1 million).\n\nOur higher priced houses require ever larger mortgages which means a larger share of household income now goes towards paying down the home loan. And yet people have managed to get ahead on their mortgages. All but the richest quarter of home borrowers are further ahead in their repayments today than before the pandemic. These issues, on top of all the other economic problems at play domestically and across the world, swirled around the Reserve Bank’s meeting room as it discussed where interest rates may be headed. There was also an elephant in the room - the bank’s past and current inflation performance. The RBA constantly undershot its 2-3 per cent inflation target across the five years leading up to the pandemic. It was one of the reasons the bank went through an independent review.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/national/handcrafted-spoons-custom-clay-bricks-what-it-takes-to-open-a-restaurant-in-2025-20251021-p5n43t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Handcrafted spoons, custom clay bricks: What it takes to open a restaurant in 2025",
    "publish_date": "Fri, 07 Nov 2025 11:45:00 +1100",
    "category": "finance",
    "authors": [
      "Myffy Rigby"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Stop me if you’ve heard this one. A three-hat chef and a prize-winning architect walk into an abandoned kiosk in a park. They turn it into what may well be the most significant restaurant opening in a decade. The punchline? Neither of them has ever opened one before. Yiaga, meaning “to seek and find” in Woiwurrung, the language of Melbourne’s traditional owners, the Wurundjeri people, is a creative collaboration between Vue de Monde executive chef Hugh Allen and architect John Wardle. The Pavilion Cafe had sat abandoned in the Fitzroy Gardens on the eastern edge of the CBD for close to a decade. After a project five years and many millions of dollars in the making, the redesigned and renovated restaurant opened last month. It’s tempting to slice a tall poppy before it’s even had time to flower, to dismiss this as a restaurant made by (and for) people with money (Yiaga is partially backed by billionaire Singaporean brothers Philip and Robert Ng, who also own the majority share of three-hat fine diner Vue de Monde). And at $295 a head (excluding wine), with just 44 seats, the 12- to 15-course degustation menu – which rolls on for around three hours – is not designed for your average Fitzroy Gardens picnicker. Yiaga’s founder and executive chef, Hugh Allen. Credit: Kristoffer Paulsen But here’s another way to look at it. The post-2020 hospitality scene has been in a bit of a share-plate slumber, dominated by grand bistros and neighbourhood diners, with the occasional creative jolt to the arm from small, fun, owner-operated restaurants. Safe, comforting, familiar. Now here’s Yiaga: a dining experience that’s sophisticated in pitch, mature in tone and -thoroughly realised. A loving dispatch to the colours, textures and flavours that make up Australia’s changeable environment. Thoughtful, provocative and unfailingly stylish. In a world of designer chefs and the countless restaurants around the planet bearing their names – Robuchon, Ramsay, Boulud, Nobu – it’s outliers such as Hugh Allen who bring something new to the table. A reminder that dining out can be more than a meal, it can be an art form. On that front, Australia is no slouch. In Victoria, there’s Dan Hunter’s farm-to-table Brae. In NSW, there’s Daniel Puskas’s progressive, ferment-driven Sixpenny, and Josh Niland’s fish-focused Saint Peter. They all bring the noise when it comes to elite Australian fine-dining. But little of our extraordinary, diverse food scene has managed to hold attention on the world stage. Could Yiaga be the one to finally move the dial? I spent three days at the restaurant as they set up for their first guests to find out.\n\nAdvertisement\n\nThe 30-year-old chef is no stranger to excellence. Allen spent three years cooking at Noma, chef René Redzepi’s Copenhagen restaurant that’s widely considered one of the world’s greats, featuring a menu that dances a fine line between naturalist and futurist, executed with 10,000-hour precision. For chefs, working there is the culinary equivalent of training to become a green beret. At just 23, he became executive chef at Vue de Monde on the 55th floor of the Rialto Tower. At 26, he became the youngest chef in four decades to hold three hats. He’s spent the past six years running Vue, which recently retained its three hats at The Age Good Food Guide Awards. Only four restaurants in Victoria currently hold that position. The restaurant is in Melbourne’s Fitzroy Gardens. Credit: Kristoffer Paulsen Despite all that, Hugh Allen is not a flashy guy. He has very little time for things that don’t directly feed back into the restaurant he’s invested so much of his heart, soul and money in. His iPhone is so cracked, it’s like looking at a Magic Eye puzzle. His laptop screen, also damaged, has a huge black line through it. He’s been hoping someone will knock it off one of the benches and completely destroy it so he can justify purchasing a new one. All this is thrown into sharp relief against his beautifully appointed new restaurant, where even the dessert spoons were hand-crafted by a silversmith. Besides, the show is not Hugh Allen himself, the show is Yiaga. For instance, it’s unusual to see the self-assured, softly spoken chef at the pass (the divider between the kitchen and the outside world, where traditionally you’d find the person running the show). That’s head chef Michael McAulay’s job. Another Noma alum, the 27-year-old moved from Scotland to Australia initially to work at Vue de Monde, where he was sous chef for two years, before spending the past year working on launching Yiaga with Allen. Together, they’re a study in contrast. McAulay works on his toes, darting and weaving like a matador, holding the front line with a thick Glaswegian brogue. Allen floats with the quiet constancy of a Zen monk, speaking in lilting tones, gliding from one chef station to another.\n\nAdvertisement\n\nThe pair aren’t the only two Vue transplants. General manager Hugo Simoes and sommelier Dorian Guillon, both longtime members of the Vue team, have also made their way to the garden from the dark, lacquered surrounds of the 55th floor. Allen and Simoes will -continue to split their time between the two. Head chef Michael McAulay in the open kitchen. Credit: Kristoffer Paulsen Maybe it’s a generation/age thing, and maybe it’s some of that aforementioned familiarity with his team creating a sense of comfort and calm, but the psychological warfare that would have previously been a hallmark of a kitchen operating at this level doesn’t seem to exist. The impression is of a healthy kitchen culture (one of their hiring rules is a “no dickhead -policy”). Perhaps the idea of beauty only being achieved through -brutality is a concept of the past. If the energy from the 13-strong kitchen team (aged between 20 and 31) is anything to go by, it certainly is here. I ask Allen one afternoon how he deals with his internalised rage – a trait common in noteworthy chefs working in highly pressurised environments. (Infamous culinary torture artist Marco Pierre White once said, “If you are not extreme, then people will take shortcuts because they don’t fear you.”) Allen told me he doesn’t have any such torment. And I believe him. He is probably the least angst-riddled chef I’ve ever met. Loading Before guests arrive, front- and back-of-house sit down together for “family meal”: a chance for calm before the oncoming adrenal storm. Chefs eat generous plates of roast chicken, rice and roast baby zucchini like they mean business, focused on getting back to their stations as quickly as they can. There’s a sense of urgency and industry in the air – tonight is the first night they’ve all worked as a team. Allen walks around reminding everyone to get some fresh air and stretch before service. “They just want to get back to setting up,” says Allen. “Especially when everything’s new, it’s always quite overwhelming.”\n\nAdvertisement\n\nMcAulay tours each station in the kitchen, trying the finishing elements of each dish on the menu. He’s been tasting steadily throughout the day. “A lot\n\nof it is the really fine detail,” says the chef, dropping a teaspoon into a container of fresh water. “Nothing gets packed away until it gets tasted by me or Hugh. Thinking about everything again just dials you in. You tasted [the sauce] the first time, but then it’s settled: does it need a tiny bit more salt, is it too intense?” It also allows honest dialogue. Any problems with a dish can be flagged early enough to be fixed, creating a calmer environment for everyone. “The only reason you would pack something away if it hasn’t been tasted is if something is wrong,” says McAulay. “But everyone’s really good here. I trust everyone.” In the lead-up to opening, industry chatter was focused on what Allen would bring to the table as a chef outside the confines of Vue de Monde and its 25‑year legacy. Could he create something original? Would it be Vue 2.0? Noma in the park? The answer is mostly no, and very slightly yes. The vision, flavour and execution is most definitely Hugh Allen’s. To put a dish through the Yiaga lens, Allen and McAulay asked themselves whether it is “seek and find enough”. It must push boundaries, flavour-wise. “Just because it’s an amazing dish somewhere else doesn’t mean it’ll make sense here,” says McAulay. The open-plan kitchen flows into the dining space. “I want my staff to really engage with the diners,” says Allen. Credit: Kristoffer Paulsen Coral trout, initially served with brassicas, felt too classic and European to the pair. Instead, they kept experimenting until they landed on barbecuing the Far North Queensland fish, pairing it with a cheek of new-season mango and sunrise lime, finally injecting it with the base heat of Mexican chilli oil, a suggestion from 29-year-old chef Eduardo Guasch.\n\nAdvertisement\n\nThere’s a wildness to the composition here, akin to a Turner landscape. A command of balance and restraint, executed with the kind of abandon only people who have learnt the rules can achieve when they decide to break them. “We don’t really know what ‘here’ feels like ourselves, yet,” says Allen. “We’re new here as well. But we want the food to be very interesting. We want to really push things.” Corner Inlet squid from Gippsland were so large when they were delivered that they took up an entire kitchen benchtop. The flesh is gently confited and cured in white miso, dressed with desert lime, served in a light citrus broth and finished with the peppery tang of Thai basil. There’s deep harmony in a set coconut cream layered with concentrated coconut water, finished with a lump of caviar, a touch of lime zest and a tiny hint of fresh-pressed macadamia oil. A dish so finely tuned that it dampens and mutes the surrounding sounds of the restaurant, just for a moment. Flavoured oils are used less like an ingredient and more like a perfume: gentle enhancements like Geraldton wax, and those macadamia and chilli oils. “I think dining should be exciting,” says Allen. “Food that’s aromatic. Ingredients you’ve never had before, hopefully. Flavours that you can’t work out. Obviously, with all that it still has to be delicious, but we want it to feel very new and really Aussie.” Coconut cream and caviar: Yiaga’s menu aims to “push the flavour boundaries”. Credit: Kristoffer Paulsen Kangaroo cutlets are gently cooked through service, starting raw at the top of the open hearth, slowly taking in smoke for flavour, then brought down over the coals, glazed with smoked butter and a concentrated sauce made from all the other parts of the kangaroo, served with maitake mushrooms poached in mushroom stock then grilled and glazed with cured egg yolk. They’re looking farther afield at producers, too, utilising forgotten or under-appreciated ingredients. Slices of 14-year-old retired wagyu cow (which would normally be around four when they meet their fate) are draped over a bite-sized steamed bun. The meat, from producer David Blackmore, is very slightly salt-cured but mostly raw, seasoned with green ants and wild garlic capers.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/where-sports-have-a-duty-of-care-it-must-override-the-desire-for-personal-autonomy-20251106-p5n8cu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Where sports have a duty of care, it must override the desire for personal autonomy",
    "publish_date": "Fri, 07 Nov 2025 11:45:00 +1100",
    "category": "sports",
    "authors": [
      "Darren Kane"
    ],
    "text": "“Cricket is a potentially dangerous game: it involves a heavy, hard ball being speared towards a batter from a relatively short distance at great speed. It is a testament to the skill and courage of those who play the game at the highest level that more incidents don’t occur. Still, safeguards are essential if death and injury is to be minimised.“\n\n– NSW State Coroner, Inquest into the death of Phillip Hughes\n\nThe difficult questions are the ones that demand answers. For example, what on earth passes for functional concussion protocols inside the Tongan Rugby League set-up? Whatever the NRL’s investigation into the events that left Elisa Katoa in hospital with brain bleeding uncovers, the sight of a staffer attempting to hold the Tonga forward’s head up – likely as his consciousness ebbed away – as he sat on the bench was sickening.\n\nAfter three serious head knocks across the warm-up and match, Katoa – who isn’t certain to play the game again – should not have been left so hopelessly exposed. Players won’t voluntarily self-administer head impact assessments. Heads should roll. Katoa’s should never have been one of them.\n\nHowever, there aren’t many sports that don’t carry an element of danger. Equestrianism, AFL, baseball, track cycling and swimming each carry various and inherent risks, which participants can’t hope to entirely divorce themselves from.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/from-beckham-to-melham-what-s-left-when-you-re-already-achieved-your-dream-20251106-p5n8c7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "From Beckham to Melham, what’s left when you’ve already achieved your dream?",
    "publish_date": "Fri, 07 Nov 2025 11:30:51 +1100",
    "category": "lifestyle",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "Along with wanting to be Sally Boyden from Young Talent Time, my first dream was going to Disneyland. From age six, my head exploded watching The Wonderful World of Disney over Rice-a-Riso snazzed up with flaked almonds by Mum.\n\nThe fireworks! The castle! The Snow White Grotto! I was desperate to get there. So when I actually rocked up to actual Disneyland in 1979, in a denim midi and braces like the singer in Promises, I felt euphoric.\n\nThis week David Beckham was awarded a knighthood, and Jamie Melham won the Melbourne Cup. Credit: AP, Getty\n\nFelt like I do now on a good edible.\n\nBut as with all trips, there was a downside to the high. Afterwards, reality felt more meh. Even then, with only Spirograph as a major life skill, I suspected having no horizon to move towards meant drifting in circles.",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/national/nsw/i-am-never-moving-out-why-jo-s-rental-could-be-the-new-australian-dream-20250818-p5mns8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I am never moving out’: Why Jo’s rental could be the new Australian dream",
    "publish_date": "Fri, 07 Nov 2025 11:30:00 +1100",
    "category": "finance",
    "authors": [
      "Julie Power"
    ],
    "text": "Williams in her apartment: “I don’t see it as rent, I am paying for a lifestyle.” Credit: Sitthixay Ditthavong Williams in Indi Sydney’s rooftop lounge, which she has previously hired out for a party. Credit: Sitthixay Ditthavong The 25-metre pool at Indi Sydney, the CBD’s first exclusively build-to-rent apartment block. Credit: Sitthixay Ditthavong The Herald visited Indi with two architects, Anthony St John Parsons, who won NSW’s house of the year and a national award for interior architecture, and Kate Dickinson, an associate principal with Woods Bagot, as part of its ongoing reviews of apartment life. Consultants BDO estimate the national BTR pipeline includes about 39,300 apartments across 113 projects, worth about $30.1 billion. That represents a growth of 10,000 apartments and nearly $9 billion over the past year.\n\nProfessor Anthony Bourke, the host of Grand Designs and podcast The Home Front, says apartment living can be part of the new Australian dream. “In fact it will be. It’s whether we can look at rental and apartment living as a desirable alternative to the detached home, and can we shake the idea that it’s just a step-up before getting a ‘real home’.” Bourke said the challenge was bringing the model within the reach of the average family. Williams’ 69-square-metre one-bedroom unit with a balcony rents for $1100 a week. “I don’t see it as rent, I am paying for a lifestyle,” she said. “I would rather pay more because I don’t have to pay for gym, I have beautiful facilities, I don’t have to leave … I can go for lunch or have a drink on the rooftop where you are looking out across the harbour.” In most high-end apartment blocks, where units are privately owned, the rooftop space would be given over to penthouses. But at Indi, it is a shared space for tenants with a rooftop dining area, a chef’s kitchen, and outdoor space.\n\nBates Smart managing director, architect Philip Vivian, said Indi was sustainable. “You’ve got to compare it to 234 homes in the suburbs, basically a full suburb with lawns being watered and two cars in every garage … or 234 eco huts all accessed by cars versus far more sustainable zero cars, low-carbon transport.” Architect Anthony St John Parsons, Indi operations director Courtney Raven, Woods Bagot associate principal Kate Dickinson and Bates Smart managing director Philip Vivian. Credit: Wolter Peeters A floorplan of a two-bedroom unit in Indi Sydney. Credit: Investa To reduce greenhouse gases, they “dematerialised” wherever they could. The structural columns that span the 25-metre pool were unadorned. The developers wanted to cover the concrete in the hallways too. But, Vivian said, “Wherever we can expose the structure, we left it.” It is part of the building’s beauty and charm, residents said.\n\nIn countries such as France, build-to-rent is a lifetime option and many landlords will not offer leases shorter than five years. Like Investa, the manager and developer of Indi, landlords are usually long-term institutional investors. Loading Housing experts AHURI warn BTR needs to be regulated. Ownership of too many units by one owner creates a risk to tenants and the community if the business owner puts up rents excessively or evicts everyone at the same time to refurbish/redevelop buildings. On the upside, the blocks are likely to be built to a better standard because building owners know they will be responsible for the maintenance for longer. Dr Chris Martin of UNSW’s City Futures Research Centre warns of the dark side, and describes many of the advantages as plausible.\n\n“It says something about the uncertainty and turnover in the way the rental housing system currently is structured that the prospect of a mega-corporate landlord has been embraced as such a good thing.” ‘It says something about the uncertainty and turnover in the way the rental housing system currently is structured that the prospect of a mega-corporate landlord has been embraced as such a good thing.’ Chris Martin Martin, a former NSW Tenants Union head, says half of landlords turn over within five years of entering the Sydney and Melbourne market. “In Australia, BTR has been very plausibly presented as an enhancement to the security that people have, but there have also been international experiences where the rise of large corporate landlords has been detrimental to housing.” He said the growth of build-to-rent in the US and Europe has resulted in big corporate landlords abusing their power.\n\n“Many bought en masse distressed properties, single-family detached dwellings … And the evidence is that they move to evict tenants more readily than smaller holding landlords.” Loading Compared with her experience renting other properties, Williams said she hoped corporate landlords would be held to a higher standard, and so far had no problems. Atkinson said it was nice to know the BTR product was providing bang for buck. “Maybe you’d meet someone on the rooftop, and grow old together! “The great Aussie dream historically has been the aspiration, but I think as the population changes and diversifies, so does any one person’s aspiration.”\n\nFor example, a tenant may want to spend more on travel, knowing their home is secure, without the distraction of interest rates. Residents at Indi. Credit: Felix Mooneram The common spaces are generous. “For BTR this is an interesting space as they are sacrificing tangible NLA [net lettable area]/rent for non-rentable area.” St John Parsons said Indi’s architecture was amazing. “As a building, it is bloody beautiful.” And he was impressed by how it dealt with “a really tricky dynamic underneath, the metro”. It was perfect for YoPros, as he calls young professionals, if not YoPro parents like him with two children, who need childcare and preschools.",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/lifestyle/health-and-wellness/after-months-of-feeling-off-i-took-myself-off-to-the-gp-i-didn-t-expect-this-diagnosis-20251020-p5n3xv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After months of feeling off, I took myself off to the GP. I didn’t expect this diagnosis",
    "publish_date": "Fri, 07 Nov 2025 11:30:00 +1100",
    "category": "lifestyle",
    "authors": [
      "Nick Galvin"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In the medical trade, it has the impressively apocalyptic (if somewhat gendered) moniker, “The Widowmaker”, a blockage of the left anterior descending artery (LAD) that is most emphatically not a good thing if yours is the heart to which it happens to be attached. Stay with me here as I get a bit technical: the matey-sounding LAD is one of the main routes that supplies your heart with all the vital gubbins needed to keep it beating (blood, oxygen et cetera). And even with my limited scientific background (I come from a medical family, but my eldest brother followed dad into the doctoring lark, letting us other two brothers off the hook), I know a working heart is non-negotiable when it comes to staying alive. If your three-millimetre LAD gets gummed up, the resulting heart attack, according to Dr Google, is most often “catastrophic” or “massive”. Survival rates are less than 10 per cent. These are not good odds. Let’s back up a few weeks to a time when I was blissfully unaware of the LAD in my chest quietly helping my heart beat some 100,000 times a day. After several months of feeling a “bit off”, which I put down to the lingering effects of enforced idleness due to a fractured ankle, I finally dragged myself to my GP. It had taken quite a while but avoiding deadlines until the very last minute is a way of life for most journalists. Sometimes, I don’t even get around to procrastinating. The other motivating factor was that we were very shortly due to fly to Spain on a much-anticipated family holiday. I just needed reassurance that all was tickety boo with my ticker and that my planned cerveza and paella tour was not in danger.\n\nAdvertisement\n\nThe good doctor took one look (actually, several looks and a detailed case history) and packed me off to the first cardiologist who could fit me in at very short notice. He took several more looks, gave me one long, very worried look, told me to put away the Spanish guidebooks, and booked a computed tomography angiogram. Loading The procedure involves lying down and being fed into a huge doughnutty thing that makes lots of dramatic banging and whirring noises. A contrast dye is injected via a canula so the doctors can get a good look at what’s going on under the bonnet. I had been warned I might feel like I’d … er … lost control of my bodily functions but, even so, suddenly feeling like you’ve filled a nappy in public is strangely disconcerting. As I lay there coming to terms with my new identity as a doubly incontinent 59-year-old with a dicky ticker, the radiologist appeared with a look on his face that implied I probably shouldn’t buy green bananas and definitely not pick up any long books. His advice was to go home, avoid all exertion (which, ironically, is probably what got me into this mess in the first place) and count down the five days until I was booked in for an angioplasty. On the train home, I imagined what my blockage might look like under a microscope. I pictured a micro-sized fatberg made up of sausage rolls, meat pies and chips all gummed together with pate (mmmmm, pate) and soft cheese (mmmmm, soft cheese). When Nick Galvin got the call to go into hospital earlier than expected, he didn’t think twice.\n\nAdvertisement\n\nThere’d be a tiny gap left just waiting for a cream bun somewhere in my body to come barrelling up the artery and plug that final hole, at which point my face would turn bright pink and steam would come out of my ears in the style of a Tom and Jerry cartoon. The reality, I suspect, would probably not be quite so jolly. I spent the next day or so like a man carrying a Ming vase across a polished floor. Wearing socks. And boxing gloves. Blindfold. After a few beers. You get the picture. Loading The following evening, I got a call from a number I didn’t recognise. Usually, this would be some desperate publicist who thinks the way to get me enthused about their client’s latest book/collaboration/ground-breaking one-woman show about meerkat mating rituals is to call during dinner. However, for whatever reason, I picked up. On the line was the totally wonderful Dr Fiona Foo, one of the nation’s few female interventional cardiologists. She asked if I was busy the following day (nope – just sitting, trying to keep that vase in one piece). She could make time to operate on my micro-fatberg if I could get myself up to Macquarie University Hospital. Next day, I was at MUH all prepped and ready to go, chatting to the irrepressible doctor, who radiated confidence and competence, both important attributes in someone about to head up an artery on a Fantastic Voyage-style journey to your heart like anyone else might pop out to Coles. In an angiogram, tools are inserted into the artery via a small incision. Foo prefers the radial artery in the wrist but the groin is also prepped as a back-up.\n\nAdvertisement\n\nAll of which left me lying in a chilly operating theatre, Foo and her team around me, exposed in a manner that in other circumstances would result in a two-year good behaviour bond. But did I care? I did not. That would be the fentanyl they used to take the edge off. It’s a wonderful thing for lowering inhibitions and it made this all feel like the most glorious lark. It really ought to be illegal outside hospitals. Loading Alongside the operating table was a large video screen that allowed Foo to guide the tools to precisely the right spot. What I could see was pretty incomprehensible and quite dull, but I resisted asking for Netflix instead. Over the next 90 minutes or so, the dexterous Foo tamed the micro-fatberg with a tiny balloon and then inserted a stent – a wire cage – to hold open the artery. Shortly afterwards, I was wheeled to the Coronary Care Unit, where I spent the night being fussed over by a brilliant crew of nurses. Next morning, despite a sleepless night – just like on the movies, there are an awful lot of bleeping machines in a CCU, to which nobody pays the slightest bit of notice – I realise I’m feeling good. In fact, I’m feeling f--king sensational.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 35
  }
]