[
    {
        "url": "https://www.9news.com.au/world/trump-says-larry-ellison-michael-dell-and-murdochs-will-be-involved-in-tiktok-deal-usa-news/f6776aa0-86a1-4f32-a503-8f39d8dcd2bf",
        "title": "Trump says Larry Ellison, Michael Dell and Murdochs will be involved in TikTok deal",
        "publish_date": "Mon, 22 Sep 2025 01:13:21 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "President Donald Trump on Sunday said tech and media giants Larry Ellison, Michael Dell, and Lachlan and Rupert Murdoch will be a part of the group to take over TikTok's algorithm in the acquisition of the social media platform's US operations.\n\n\"You know, they're very well-known people. And Larry Ellison is one of them. He's involved. He's a great guy. Michael Dell is involved. I hate to tell you this, but a man named Lachlan is involved,\" Trump said on Fox News' \"Sunday Briefing,\" referring to Lachlan Murdoch — the CEO of Fox Corp., which is the parent company of Fox News — and the son of Fox Corp. founder Rupert Murdoch.\n\nTrump added that Rupert Murdoch \"is probably going to be in the group.\"\n\nREAD MORE: MAGA firebrand laughs on stage at Charlie Kirk memorial\n\nPresident Donald Trump on Sunday said tech and media giants Larry Ellison, Michael Dell, and Rupert Murdoch will be a part of the group to take over TikTok's algorithm in the acquisition of the social media platform's US operations. (CNN)\n\nThe TikTok talks involving the Murdochs could result in Fox Corp. becoming part of the consortium, according to a person familiar with the matter.\n\nRupert and Lachlan Murdoch would not be investing as individuals.\n\nParticipating in the TikTok consortium could provide a boost for Fox Corp., which has been making many digital media investments to offset declining areas of business like broadcast television.\n\nDell is the CEO of computer maker Dell Technologies.\n\nTrump's comments are a change from the consortium of investors previously named in the TikTok deal.\n\nThe Trump administration had said that the group of investors would include Ellison's company, Oracle, along with Silver Lake and Andreessen Horowitz.\n\nWhite House press secretary Karoline Leavitt told Fox News on Saturday that TikTok will have seven board members, six of whom will be American.\n\nThe makeup of American investors is required by the bill passed by Congress in April 2024, which required a nationwide ban of TikTok operations in the United States unless the social media app sold about 80 per cent of its assets to American investors.\n\nREAD MORE: Staggering number of Aussie jobs at risk over AI\n\nTikTok is seen in the app stores of an iPhone and Google Pixel. (CNN)\n\nLeavitt had said on Saturday that data and privacy for the app in the United States will be led by Oracle and that the company would be one of the American investors.\n\nEllison's company began hosting TikTok's US data in 2020.\n\nTrump said Friday that he had \"a very productive call\" with Chinese President Xi Jinping, and that progress was made toward finalizing the deal.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/donald-trump-promises-autism-announcement-tomorrow-from-white-house/67f5ca42-48ff-4e19-b9b1-c6ab1ea03e26",
        "title": "'Answer to autism': Trump goes off-book for big reveal at memorial",
        "publish_date": "Mon, 22 Sep 2025 00:59:01 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "US President Donald Trump has promised a major autism-rel﻿ated announcement from the White House on Monday US time.\n\nThe revelation came with Trump onstage in Arizona, where he paid tribute to slain right-wing activist Charlie Kirk in a lengthy speech.\n\nAt one point he deviated to promise \"﻿one of the biggest announcement really, medically, I think in the history of our country\".\n\nREAD MORE: MAGA firebrand laughs on stage at Charlie Kirk memorial\n\nPresident Donald Trump speaks at a memorial for conservative activist Charlie Kirk. (AP)\n\n\"We're going to be doing it with Bobby (Secretary of Health Robert F Kennedy Jr) and Oz (Administrator of the Centres of Medicare and Medicaid Services Mehmet Oz) and all of the professionals,\" he said.\n\n\"I think you're going to find it to be amazing. I think we found an answer to autism.\n\n\"How about that?\"\n\nHe said it was likely to be \"one of the most important news conferences I'll ever have\".\n\nREAD MORE: Staggering number of Aussie jobs at risk over AI\n\nHealth and Human Services Secretary Robert F Kennedy Jr, also at the Kirk memorial. (AP)\n\n\"We're going to be talking in the Oval Office and the White House about autism, how it happens, so we won't let it happen anymore,\" he said.\n\n\"And how to get at least somewhat better when you have it so that parents can help their child, their beautiful child. That's a big one, I've been bugging everybody over there get the answer to that.\"\n\nHe returned to theme by suggesting Kirk would have enjoyed the announcement.\n\nREAD MORE: Australia in firing line as Israeli leader blasts global superpowers\n\nKennedy is a vaccine skeptic. (9News)\n\nOn the weekend, Trump also revealed the Monday announcement at the American Cornerstone Institute's Founders' dinner, claiming autism diagnoses were increasing exponentially - an increase medical experts typically put down to improved diagnostic techniques, especially for girls and women.\n\nKennedy, a vaccine sceptic whose shake-up of health institutions in the US has prompted criticism from some quarters, has previously characterised autism as a chronic disease and an epidemic, rather than a developmental disorder.\n\nThe effects of autism can vary widely from person to person.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/optus-outage-company-will-face-consequences-communications-minister-anika-wells-says/56c999ee-1b0e-43e8-ab63-92219efd6a12",
        "title": "Optus to face 'consequences', minister promises after outage",
        "publish_date": "Sun, 21 Sep 2025 23:42:41 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Optus can expect \"consequences\" after another outage left people unable to contact Triple Zero in an \"enormous failure\", Communications Minister Anika Wells said.\n\nMultiple people died during the network outage, during which they were unable to reach emergency services.\n\n﻿Following Optus chief executive Stephen Rue's admission yesterday that the telco had missed several warnings that calls to Triple Zero were not going through, Wells this morning confirmed Optus had been told about the issue but not acted on it.\n\nREAD MORE: Jewish leaders in Australia blast recognition of Palestinian statehood ﻿\n\nOptus has been slammed over a recent outage. (Getty)\n\n\"Optus will be held to account,\" she said.\n\n\"Optus and all telecommunications providers have obligations under Australian law to make sure emergency services calls go through.\"\n\nWells and Australian Communications and Media Authorit﻿y head Nerida O'Loughlin did not specify what consequences Optus would face, but O'Loughlin noted that the telco had been penalised $12 million after breaching similar laws in 2023. ﻿\n\nO'Loughlin said 624 Triple Zero calls had been affected during the outage, which occurred between 12.30am and 1.30pm on Thursday in South Australia, Western Australia, and the Northern Territory.\n\nShe said initial emails from Optus about the scale of the outage had been \"perfunctory\" and \"inaccurate\".\n\nUnder existing regulations, telecommunications companies are required to tell stakeholders, including the government and ACMA, as soon as an outage is detected.﻿\n\nREAD MORE: Man dead after being hit by forklift at warehouse ﻿\n\nOptus chief executive Stephen Rue. (Nine)\n\n﻿\"In this case we weren't notified at all until the outage was resolved,\" O'Loughlin said.\n\nACMA is undertaking a thorough investigation of the incident, though Wells and O'Loughlin did not say when they expected that to be resolved.\n\n\"Once we have the facts about what has happened and once I take the recommendations that come from the recommendation from ACMA, I will then consider what is an appropriate response for the telecommunications as a whole,\" Wells said.﻿\n\nThe minister also indicated that the outage could prompt a broader examination of the industry, noting that Optus was not the only provider to have overseen Triple Zero outages.\n\n\"This is not entirely a matter for Optus,\" Wells said.\n\n\"We are considering what needs to be done holistically or as part of legislative relief for the Australian people, given their confidence has no doubt been shaken by what has happened here.﻿\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/one-in-four-australian-jobs-at-high-risk-of-automation-ai-disruption/ab5f43e3-5ef5-4404-b3ce-51b42396b31d",
        "title": "One in four ﻿﻿Australian jobs are at 'high risk' of automation, new research reveals",
        "publish_date": "Sun, 21 Sep 2025 19:23:12 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "One in four ﻿﻿Australian jobs are at high risk of automation as robotic processes, chatbots and AI models take over tasks previously performed by humans.\n\nAI alone could transform up to 1.5 million jobs by 2030, according to new research, and roles in retail, finance, and media are among the most affected already.\n\nResearch from ﻿Pearson has revealed that the nature of work in Australia is changing and Australians are struggling to keep up due to a growing skills gap, which could soon become a \"skills chasm\".\n\nOne in four ﻿﻿Australian jobs are at 'high risk' of automation, putting workers under fresh pressure. (Nine/Getty)\n\nAnd workers could lose a fortune in ﻿earnings if they don't start upskilling now.\n\nCurrent employee capabilities don't always ﻿align with what employers need, and that's likely to get worse as more industries embrace AI and automation.\n\n\"Almost one in four people in Australia are going to have automation impact their employment and impact their job in the next five years,\" Pearson's country head Taha Haidermota told 9news.com.au.\n\n\"Jobs will change, but that doesn't mean they're going to be eliminated, they'll just be transformed into a shape or nature that you may not necessarily have today.\n\n\"It's very easy to think, oh my gosh, the robots are coming. And that isn't true.\"\n\nWorkers who can adapt and reskill to work alongside AI and automation will thrive.\n\nThose who can't are likely to struggle because their existing skills won't fit new employer needs.\n\nSuch skills gaps are already making it hard for Aussies to transition from education to work and between jobs, whether due to an involuntary exit or automation disruption.\n\nThese slow transitions take a toll on individuals﻿ though lost income, job insecurity, and diminished wellbeing.\n\nREAD MORE: How to maximise public holidays and make the most of your annual leave in 2025\n\nWorried AI will take your job? These are the lowest risk professions View Gallery\n\nThey also have a massive impact on Australia's economy, costing the nation up to $104 billion each year.\n\nAnd if Australians can't adapt to new ways of working, these impacts will only get worse.﻿\n\n\"Adaptability is going to be absolutely key over the next few years,\" Haidermota said.\n\n\"Because things are changing, the pace at which things are changing has increased, and the impact on ordinary Australians is how are they equipped to deal with that change?\"\n\nWhich is why it's so important for workers to start future-proofing their careers now.\n\nPearson's report suggests the best ways to do so are by prioritising upskilling and \"learning to learn\", and ﻿moving away from outdated linear career paths.\n\nWorkers who learn to adapt to career changes and reskill effectively are less likely to be negatively impacted by automation and AI.﻿\n\nThey ﻿could see wage growth of up to 12 per cent within two years, and boost the economy by slashing the time it takes workers to transition between roles.\n\nOn-the-job training and external education will help workers upskill and future-proof their careers. (Getty)\n\nEmployers should prioritise upskilling ﻿opportunities for staff, whether it be on-the-job training or external education, to better prepare them for the changing nature of work.\n\nSkills that will be most in-demand in the coming years will include collaboration, customer focus, and cultural and social intelligence.﻿\n\nGone are the days where one-time education ﻿could launch workers into a career they'd stick to for the rest of their working lives.\n\nInstead, ﻿Aussies will need to embrace career pivots outside the traditional path of attending university and climbing a linear career ladder.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/byron-haddow-bali-death-family-demand-answers-queensland-body-returned-organ-missing/abacd388-b391-43ca-a350-1b757861fbd9",
        "title": "Queensland man's body returned from Bali with vital organ missing",
        "publish_date": "Sun, 21 Sep 2025 08:48:52 +0000",
        "category": "lifestyle",
        "authors": [
            "Sep"
        ],
        "text": "A﻿ grieving family is demanding answers after their son's body was returned from Bali after his mysterious death with a vital organ missing.\n\nThe FIFO worker was hoping to relax﻿ on a fun getaway, but his body was found in the plunge pool of his villa in May.\n\nNoosa man Byron Haddow died on while holidaying on the Indonesian island. (Byron Haddow)\n\nHis death was only the beginning of a long and traumatic quest for answers from his devastated family.\n\nBryon's family pushed for an investigation resulted in a major delay in repatriating his remains back to Noosa.\n\n﻿His mum Chantal told 9News she suspects something sinister happened.\n\n\"I feel like there was foul play,\" she said.\n\n﻿When his body finally was brought home, a horrifying discovery made in a second autopsy by the Queensland coroner.\n\nByron's mum Chantal is demanding answers. (9News)\n\nHis heart was missing.\n\n\"They just rung us to ask if we were aware that his heart was retained over in Bali,\" Chantal said.﻿\n\n\"It was another kick in the guts.\"﻿\n\nIt remains unclear why Byron's organ was removed.﻿\n\nIt was only sent back to Australia months after his funeral and burial.﻿\n\nIt remains unclear why Byron's organ was removed.﻿ (9News)\n\nThe results of a local autospy report﻿ are still pending.\n\nMeanwhile, Chantal is still coming to terms with her devastating loss.\n\n\"He was just so full of life,\" she added.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/optus-triple-zero-outage-south-australia-baby-death-police/326bcf7b-ad5f-4393-a811-e50ae6951991",
        "title": "Optus outage 'unlikely' to have contributed to eight-week-old baby's death",
        "publish_date": "Sun, 21 Sep 2025 06:05:02 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A critical outage in the telco giant's network meant triple zero calls in South Australia, Western Australia and the Northern Territory were blocked, with the company announcing it had contributed to three deaths; a\n\nfourth\n\nwas later confirmed by WA Premier Roger Cook.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/centrelink-payments-changes-2025-new-rates-september-20-everything-to-know-explained/7ad1411a-7f1e-4e0d-b1dd-c1dd45803dd6",
        "title": "Millions of Aussies to get a cash boost today as Centrelink payments jump",
        "publish_date": "Fri, 19 Sep 2025 21:10:31 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Millions of Australians will get a cash boost today as Centrelink payments increase under indexation changes, offering relief in the cost-of-living crisis.﻿\n\nThese changes are made every year in March and September and are designed to ensure that payments keep up with inflation.﻿\n\nHere's everything you need to know about the Centrelink payment changes.﻿\n\nREAD MORE: Aussie staples under threat of being wiped out in just decades\n\nA number of Centrelink payments will increase this week, offering relief to many struggling in the cost of living crisis.﻿ (Dylan Coker / The Sydney Morning Herald)\n\nWhich Centrelink payments are getting the increase?\n\nA number of payments will increase today, including the age pension, carer payment, and disability support pension.\n\nFederal rent assistance, youth allowance and JobSeeker payments will also jump to keep up with inflation.\n\nThe income limits for some payments will also increase, ﻿meaning more Aussies may be eligible to receive them.\n\nWhen do the new Centrelink payment rates start?\n\nThe changes will come into effect today, Saturday, September 20.﻿\n\nRecipients will ﻿see the first increased payment in their bank account from that date onwards.\n\nREAD MORE: Father and son face fate over car chase murder\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nHow much are payments increasing in September 2025?\n\nThe dollar amount each payment will increase by varies.\n\nThe age pension will jump by $29.70 for singles, increasing the total fortnightly payment from $1149.00 to $1178.70 $29.70.\n\nFor couples it will increase by $22.40﻿ each, resulting in a total fornightly payment of $888.50 per person.\n\nSingle parents will receive a $16.20 boost and partnered parents will get an extra $11.40.\n\nThat will bring total fortnightly payments to ﻿$1039.70 and $734.40 respectively.\n\nRental assistance will go up by just $3.40 for singles and $3.20 for couples, with fortnightly payments to sit at $215.40 and $203.﻿\n\nRental assistance for families will increase by up to $4.48.\n\n﻿JobSeeker payments will jump by $12.50 for singles over 22 with no children, bringing the fortnightly total up from $781.10 to $793.60.\n\nCouples will receive an extra ﻿$11.40 each.\n\nYouth allowance will increase by $16.20, jumping from $1011.50 per fortnight to $1027.70.﻿\n\nSome payments will increase by just a few dollars per fortnight. (Getty Images/iStockphoto)\n\nDo you need to do anything to get the new rate?\n\nNo. These rate changes will automatically be applied to any payments made after today.﻿\n\nWhy are Centrelink payments indexed twice a year?\n\nCentrelink payments are indexed twice a year to ensure payments keep up with inflation and the rising cost of living.\n\nThese changes are based on a number of factors, including the consumer price index, weekly wage changes, and the pensioner and beneficiary living cost index.﻿\n\nThe next change will be in March 2026.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-22/seed-funding-three-new-bulk-billing-clinics-canberra-eoi/105800968",
        "title": "Funding invested to establish three bulk billing clinics in Canberra",
        "publish_date": "Mon, 22 Sep 2025 02:03:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal government has committed $10.5 million to introduce more bulk billing clinics in the ACT — but will it help the capital's longstanding issues with GP availability?\n\nExpressions of interest are being sought for organisations who are interested in establishing three new bulk billed clinics in the capital, it was announced today.\n\nACT Senator Katy Gallagher said the EOI was open to either existing clinics or those interested in opening a service that offered bulk billing.\n\n\"We want more GPs,\" Senator Gallagher said.\n\n\"We don't want our hard-working GPs to be just shouldering an additional load, and you've got to see this in conjunction with the work we're doing with the Medicare urgent care clinic which will open in Woden soon.\n\n\"And it'll work alongside all the nurse-led urgent care clinics, or walk-in centres, that we have across the ACT.\"\n\nACT Senator Katy Gallagher says they hope the investment will address the bulk billing issue facing Canberrans. (ABC News: David Sciasci)\n\nBulk billing 'a constant issue'\n\nThe initiative is part of the Labor government's broader $24.3 million health package promised to the ACT ahead of the federal election, to make GP visits more accessible and affordable.\n\nThe $10.5 million would be invested as \"seed funding\" to establish the three clinics, as a one-off payment.\n\nThe money could either go towards existing services looking to become bulk billed, or to creating new clinics, Senator Gallagher said, with a preference for the clinics spread across the ACT to cover different geographic regions.\n\n\"Bulk billing has been a constant issue both for the ACT government and for the Commonwealth and most importantly, for the citizens of Canberra,\" she said.\n\n\"We have seen this incentive operate in other places around Australia and it works.\n\n\" We're testing, over the next month, to see what the appetite is from those providers. \"\n\nACT Council of Social Services CEO Dr Devin Bowles says GPs need more financial incentives to bulk bill. (ABC News: Matt Roberts)\n\nFederal Health Minister Mark Butler said Canberra had been experiencing \"longstanding issues with GP availability\" and that the three new clinics would \"address this discrepancy\".\n\n\"Our government is determined to make it easier for Australians, including Canberrans, to find a bulk billing GP with 90 per cent of GP visits nationally to be bulk billed by 2030,\" he said.\n\nBut the ACT Council of Social Service says the new bulk billing clinics will likely not be enough to reach the federal government's target for 90 per cent of GP visits nationally to be bulk billed by 2030.\n\nDevin Bowles from the ACT Council of Social Service says GPs need more financial incentives to bulk bill.\n\n\"It's a step in the right direction, but to achieve Labor's 90 per cent bulk billing rate by 2030 target we are going to need a lot more,\" he said.\n\n'Time will tell' what impact funding will have: AMA\n\nAustralian Medical Association (AMA) ACT president Kerrie Aust is also keen to see what impact the funding would have.\n\n\"Time will tell whether or not there are large corporates which would like to take some of that money,\" she said.\n\n\" Clearly it is recognised that the current bulk billing incentives and additional payments that have been promised aren't enough, and the government feels that they need to invest a further $10.5 million as seed funding in order to get these clinics up. \"\n\nACT Australian Medical Association President Kerrie Aust says she thinks the focus should be on quality of care. (ABC News: Stuart Carnegie)\n\nDr Aust said there was huge demand for GPs in the ACT and that she wasn't sure governments were \"intervening in the right way\" to attract doctors and resolve the issues.\n\nShe said Canberrans as a population wanted doctors willing to offer a more holistic, \"slow medicine\" service.\n\n\"I guess this really comes down to what's often a misunderstanding about the role of the general practitioner,\" she said.\n\n\"Someone might come in with a cold and people might see that as easy medicine but those are opportunities to check, you know, 'How is the family going? What's happening with the child's eczema?'\n\n\"All those kinds of things are actually part of that wraparound very, very efficient care that we start to lose with fragmentation, so it's really interesting that we're talking about the importance of bulk billing ... all down to these dollar numbers ... but not actually talking about the most important thing which is quality of care.\"\n\nThe EOI process is open until October 8.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-22/gold-coast-schoolies-beach-parties-in-limbo-due-to-erosion/105767042",
        "title": "Schoolies beach parties in limbo due to 'unprecedented' Gold Coast erosion",
        "publish_date": "Mon, 22 Sep 2025 01:45:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Beach parties could be off-limits for thousands of schoolies on the Gold Coast this year because of beach erosion brought on by Cyclone Alfred.\n\nSafety concerns have forced the state government and Gold Coast council to try to find an alternative site for the official schoolies hub before celebrations kick off on November 22.\n\nSix months on from Cyclone Alfred, many of the city's famous beaches remain stripped of sand with rock walls exposed, making them unsuitable to host an estimated 15,000 teenage school leavers.\n\n\"We have been working closely with the City of Gold Coast on the best location for the schoolies hub,\" a Queensland government spokesperson said.\n\n\"The council has been working hard to get the beaches back to a suitable condition following unprecedented beach erosion in Surfers Paradise following ex-Tropical Cyclone Alfred.\"\n\nSignificant erosion is creating problems for major events held on Surfers Paradise beach. (ABC Gold Coast: Glenn Mullane)\n\nSafe space to party\n\nThe schoolies hub is a dedicated alcohol and drug-free entertainment precinct at Surfers Paradise.\n\nIt was introduced in 2003 so high school graduates could have a safe space to celebrate with their peers.\n\nDuring the first week of schoolies, a section of beach is fenced off from the public and stages are set up on the sand where DJs and live bands provide hours of entertainment every night.\n\nEntry is free and it can only be accessed by Year 12 graduates wearing an official wristband.\n\nThey must be willing to undergo security checks at any time.\n\nThe schoolies hub on Surfers Paradise beach was packed with partygoers in 2024. (ABC Gold Coast: Steve Keen)\n\nActing Mayor Mark Hammel said the state government had yet to confirm if the activities would go ahead on the beach.\n\n\"The city is working with the state government to confirm details on this year's Safer Schoolies initiative,\" Cr Hammel said.\n\n\" Safety is our number one priority and will be at the forefront of any decisions that are made. \"\n\nSurfers Paradise Esplanade, which is closed to traffic as part of a three-month trial, is being considered as an option.\n\n\"With the closure of The Esplanade coinciding with schoolies this year, there will be even more space to host events and entertainment,\" Cr Hammel said.\n\nThe Esplanade in Surfers Paradise could become home to the schoolies hub this year. (Supplied: City of Gold Coast)\n\nEvents up-ended\n\nBeach erosion has already up-ended several major events on the Gold Coast this year.\n\nThe Pacific Airshow, which last year attracted 270,000 spectators, was meant to take place over three days on Surfers Paradise beach in August, but it was cancelled.\n\nIn May, the Out 2 Lunch music festival was relocated from Surfers Paradise to Southport, while the World Surf League's Gold Coast Pro was moved from Snapper Rocks to Burleigh Heads.\n\nOrganisers of the Pacific Airshow, which debuted at Surfers Paradise in 2023, cancelled this year's event due to safety concerns. (Supplied: Pacific Airshow)\n\nTens of millions of dollars have already been spent on restoration efforts, including sand pumping.\n\nThe Gold Coast council has previously said it could take up to three years to recover from the storm.\n\nCompetitive schoolies market\n\nCancelling beach festivities would damage the Gold Coast's reputation as the leading schoolies destination, according to Griffith University Institute for Tourism expert Daniel Gschwind.\n\n\"Thankfully, we have long beaches on the Gold Coast and foreshore areas that might be suitable,\" Professor Gschwind said.\n\nDaniel Gschwind says cancelling beach parties for schoolies could be detrimental the city's reputation. (ABC News: Brendan Mounter)\n\n\"But it would certainly be desirable to have that result fairly soon so that planning can begin and school leavers can be attracted to a really fantastic event with the music and all the other things that go on with it.\"\n\nIn recent years, the schoolies market has become more competitive as high school graduates looked further afield to places such as Bali and Fiji.\n\n\"Schoolies now have many choices to celebrate the end of their school years … even international destinations have jumped onto the bandwagon and are now marketed as potential school leaver destinations,\" Professor Gschwind said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-22/discus-rain-world-athletics-championships-2025/105799880",
        "title": "'Silly at this point': Pundits slam farcical end to discus finals",
        "publish_date": "Mon, 22 Sep 2025 00:27:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "Matt Denny finished in an agonising fourth place in a farcical discus final at the World Athletics Championships in Tokyo.\n\nThe competition was significantly delayed by torrential rain that hit Tokyo, turning the throwing circle into a treacherous, unnavigable death trap.\n\nMykolas Alekna managed a legal throw, but Denny slid on the circle and fell as the heavens opened, leading to a cessation in the competition for two hours.\n\n\"He is pissed off,\" Nina Kennedy said, as Denny flung the discus away.\n\n\"This isn't what elite sport is about.\"\n\nThe competition was restarted after the conclusion of all the other events and the closing ceremony, after consultation with the athletes.\n\nMatt Denny managed two no throws in his last two attempts. (Getty Images: Michael Steele)\n\n\"The vast majority of discus athletes want the competition to take place tonight,\" a World Athletics statement read.\n\n\"Every effort will be made to keep the circle and surrounding area dry and the competition will commence.\n\n\"The athletes have been offered the opportunity to wear any shoes they feel are safe.\n\n\"We thank all teams for their cooperation, and wish all discus athletes the best of luck under very difficult conditions.\"\n\nWearing a variety of different footwear — Denny taped his standing foot, others wore trainers and German Mika Sosna went into the cage in his socks in a bid to find some grip — the athletes resumed, with volunteers dabbing at the torrent of water with towels.\n\nBut the problems remained.\n\n\"I'm finding this really hard to watch,\" Tamsyn Manou said on SBS as competitors slipped and slid across the circle.\n\n\"Someone could get really hurt.\"\n\nAustrian thrower Lukas Weißhaidinger slipped and fell badly in the circle, as did Mario Díaz of Cuba.\n\nLukas Weißhaidinger could have seriously injured himself when he fell. (Getty Images: Cameron Spencer)\n\nIt clearly had an impact, with just three athletes throwing further than they did in qualifying in dry conditions on Saturday morning.\n\n\"I've watched track and field for my whole life, and I've never seen as many falls as this night,\" Kennedy said on Nine.\n\n\"This is just getting dangerous and silly at this point.\"\n\nOut of 52 attempts in the final, a whopping 50 per cent were fouled, with Henrik Janseen failing to record a single distance.\n\n\"This is not a fair competition,\" veteran commentator Bruce McAveny said on SBS.\n\n\"It has been rushed.\"\n\nConditions were attrocious. (Getty Images: Michael Steele)\n\nDenny said he felt the competition should have been delayed to the next day.\n\n\"I just said if there's an option to throw tomorrow, I don't care if there's 100,000 people or zero people, like we did zero people for the Olympics in '21,” Denny said.\n\n\"But I understand that people have flights, people have things booked, people are ready to go.\n\n\"It's just really hard, really emotional and disappointing.\"\n\nDaniel Ståhl won the competition with his final throw, launching the discus 70.47m to beat Mykolas Alekna (67.84m).\n\n\"This was my first rainy championships ever,\" Ståhl said.\n\n\"I tried to focus today as much as possible, focus on not giving up and just staying positive. Sometimes things like this happen. There are delays, the competition takes time. I just tried to reboot my energy.\n\n\"If I thought I was going to make a fault, I would make it.\n\n\"You have to have this different mentality — if it's raining, you have to be ready for it.\n\n\"Today wasn't slippery for me at all because I have really good shoes.\"\n\nAlenka, meanwhile, said he \"never imagined that the conditions were going to be like that.\"\n\nAlex Rose finished in bronze medal position with 66.96m, winning Samoa it's first ever world championship medal.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-22/optus-investigation-triple-0-outage/105800556",
        "title": "Optus will be 'held accountable' over triple-0 failure, minister says",
        "publish_date": "Sun, 21 Sep 2025 23:23:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's communications regulator has begun its investigation into an Optus triple-0 outage linked to multiple deaths, with Communications Minister Anika Wells warning there will be consequences for the telco.\n\nLast week's outage primarily impacted South Australia, Western Australia and the Northern Territory and resulted in the failure of more than 600 emergency calls over 13 hours.\n\nOptus chief executive Stephen Rue revealed on Friday that three people had died during the outage, which he said was \"completely unacceptable\".\n\nMs Wells told journalists in Brisbane on Monday that the company would be \"held accountable\".\n\n\"We will be considered about our response but there will be consequences,\" Ms Wells said.\n\n\" They and all providers have no excuses here. \"\n\nRegulator not notified till after the fact\n\nAustralian Media and Communications Authority (ACMA) chair Nerida O'Loughlin said her agency was not notified of the outage until after it was resolved, which is counter to the usual processes.\n\nFor significant outages, she said, the regulator would typically receive multiple emails a day \"as soon as the telco is aware that something has gone wrong\".\n\nWhat we know about the Optus outage Photo shows optus 'yes' sign on glass fronted office block Three people died after a devastating Optus outage caused hundreds of emergency calls to fail, but information about the incident remains scarce.\n\n\"In this case, we didn't know that something had gone wrong until the matter had been resolved more than 10 hours later,\" she said.\n\n\"The emails we received on Thursday were perfunctory and some were inaccurate. It wasn't until the Friday, and very late in the day before the press conference, when we were informed by the CEO that there was 624 calls in play and of the deaths.\"\n\nMs Wells said she was first informed that there was an outage affecting 10 calls on Thursday afternoon and then did not hear anything further until Friday, when she was notified that it had grown to 100 calls.\n\nTwenty minutes later, she said, she was told that 600 calls had been impacted and, shortly after, her department informed her that three deaths had occurred.\n\n\"Optus has failed the Australian people in what has happened here. They can expect to suffer significant consequences as a result,\" she said.\n\nMs Wells said she had spoken with the Optus chief executive over the weekend and expressed \"my unbelievable disappointment that we were here again so quickly\".\n\nSecond Optus triple-0 outage in two years\n\nPrime Minister Anthony Albanese declined to say whether Mr Rue should step down over the incident when asked on Monday, but said he would \"be surprised\" if the chief executive had not thought about it.\n\n\"I'd be surprised if that wasn't occurring, but … [what] we want to see is the investigation take place,\" he said in New York, where he will soon be joined by Ms Wells to present to the United Nations on the upcoming social media ban.\n\n\"Optus has obligations, as do other communications companies, and quite clearly … they haven't fulfilled the obligations that they have,\" he said.\n\nThe prime minister added that the government had \"action at its disposal\" but the first concern would be undertaking a proper investigation to \"find out the facts, exactly how this happened\".\n\nMr Rue last week blamed the outage on a technical fault identified during a network upgrade.\n\nOver the weekend, the telco revealed that two customers contacted the company's call centre early on Thursday to alert them to the triple-0 failure.\n\nOptus chief executive Stephen Rue said the outage was completely unacceptable. (Reuters: Hollie Adams)\n\nOne of those calls was made as early as 9am, hours before the problem was fixed, and well over a day before the company held a media conference disclosing key details.\n\nThe number of deaths potentially linked to the outage grew to four over the weekend, before South Australian police said the Optus failure was unlikely to have contributed to the death of an eight-week-old baby near Adelaide.\n\nA 68-year-old woman in Adelaide and two men in Perth, aged 74 and 49, also died during the outage.\n\nIt is the second time in recent years that an Optus outage has impacted triple-0 calls.\n\nACMA found Optus failed to provide access to the emergency call service for 2,145 people during an outage in 2023.\n\nOptus then failed to conduct 369 welfare checks on people who had tried to make an emergency call during the outage.\n\nThe telecommunications company was subsequently hit with more than $12 million in penalties.\n\n\"We didn't expect to be here again so soon, less than two years after that breach,\" Ms O'Loughlin said.\n\n\"As the minister said, we will, as the regulator, be holding Optus to account for this second outage over the last couple of years.\"\n\nOptus could face fines of more than $10 million and could be liable for other penalties over the incident.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-22/united-nations-general-assembly-what-to-watch-for-in-new-york/105800440",
        "title": "Four things to watch for at the UN's biggest meeting of the year",
        "publish_date": "Sun, 21 Sep 2025 23:19:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "World leaders are arriving in New York for the annual High-level Week at the United Nations General Assembly.\n\nAnd for the first time, Australian Prime Minister Anthony Albanese is among them.\n\nIn amongst a packed schedule of events, here are four things to watch for.\n\nPossible Trump-Albanese meeting\n\nUnder political pressure since a false start in Canada in June, Anthony Albanese's office has been working hard to lock down a meeting with Donald Trump, finally, on the sidelines of UNGA.\n\nThe Australian prime minister and the US president have both indicated they will \"see\" each other. But it is still not clear if they will have a formal bilateral meeting, or more of a \"happenstance encounter\".\n\n\"We'll see each other in New York — he's hosting a reception on Tuesday night of next week,\" Mr Albanese last week told ABC radio, referring to a function the president is hosting for leaders from around the world.\n\n\" And as well, we'll see each other at various forums that are taking place between now and the end of the year. It's summit season. \"\n\nLoading...\n\nOn Saturday, Mr Trump said he would meet \"probably 20\" world leaders during the UN summit, but did not name any.\n\n\"Everybody wants to meet, but I'm one person,\" Trump said. \"I'm going to meet with some of the majors.\"\n\nThe stakes of any meeting are high. \"It's probably the most consequential meeting between an American and Australian in living memory,\" former deputy secretary of state Kurt Campbell said in Sydney last week.\n\nTop of the prime minister's priority list will be the AUKUS security and submarines deal, currently under Pentagon review.\n\nLittle is known about the progress of that review, though some US media reports suggest the pact is safe. King Charles talked it up at a Windsor Castle banquet with Trump last week.\n\nTrade and tariffs are also a priority, though hopes of a meaningful exemption from Mr Trump's import taxes have been fading over time.\n\nThe US has multiple grievances with Australia over trade (such as \"non-tariff barriers\" to business like biosecurity controls and social media regulation), and over defence (namely that Australia isn't spending as much on it as the US would like).\n\nSo any public event with Mr Trump, who has a tendency to publicly air his grievances with allies during such meetings, would represent some risk for the prime minister.\n\nWestern recognition of Palestine as country\n\nThis is another big grievance of the US. The Western world is breaking with the superpower on the formal recognition of Palestine.\n\nLoading...\n\nOn the eve of the UN assembly's High-level Week, Australia — along with the UK and Canada — issued a declaration formally recognising Palestine as its own sovereign country.\n\nAt least seven other western nations are set to do the same, including Andorra, Belgium, France, Luxembourg, Malta, Portugal and San Marino. They are joining 147 of 193 UN states that already recognised Palestine.\n\nThe Palestinian Authority has, in turn, offered commitments such as governance reforms, demilitarisation and general elections.\n\nThe US is hostile towards the idea of recognising a Palestinian state now, even as polling suggests a majority of Americans support it.\n\nThe Trump administration argues Hamas is being \"rewarded\".\n\nBut French President Emmanuel Macron says the recognition move is actually the \"best way to isolate Hamas\".\n\nAs Israel bombs Gaza, recognition of Palestine is a last-gasp effort Photo shows A man waves a Palestinian flag in front of police officers at Parliament House. While the Israel Defense Forces bomb Gaza and bulldoze the West Bank for settlements, moves to recognise Palestine in pursuit of a two-state solution may appear like something of a sick joke.\n\nThe US has denied visas for Palestinian officials to attend the UN event. So on Saturday, 145 countries voted to allow Palestine to take part in the summit virtually.\n\nThe US and Israel voted against the resolution, but only Nauru, Palau and Paraguay joined them, and six countries abstained (Albania, Fiji, Hungary, North Macedonia, Panama and Papua New Guinea).\n\nThe West's support for a Palestinian state has been spurred by Israel's intensifying bombardment of Gaza, now deemed a genocide by a UN commission of inquiry. The commission's finding last week is in line with the assessment of the world's top human rights groups and many genocide scholars.\n\nThere is widespread acceptance that the moves to recognise Palestine will not change the situation on the ground, and there are calls for UN member states to take much stronger action.\n\nThe UN commission of inquiry has backed human rights advocates' calls for sanctions on Israel.\n\nIt is also recommended member states stop supplying arms and jet fuel to Israel, and cooperate with the International Criminal Court, which has war crimes arrest warrants out for Israeli leaders.\n\nFrance and Saudi Arabia will co-host a summit on the future of Palestine at the UN's headquarters in New York on Monday, local time.\n\nPush for a stronger response to Russian aggression\n\nThis year's UN General Assembly session will be the fourth since Russia's full-scale invasion of Ukraine.\n\nLast year, Ukrainian President Volodymyr Zelenskyy brought a \"victory plan\", for which he sought support from the US's then-president Joe Biden.\n\nThis year, he is planning to meet Mr Trump, whose support has been much shakier than his predecessor's.\n\nZelenskyy to meet Trump at UN Photo shows Cars on fire at the site of a residential building damaged during a Russian drone strike The Ukrainian president says he will hold \"a meeting with the President of the United States\" to discuss security guarantees for Ukraine and sanctions on Russia.\n\nReports out of Kyiv say Mr Zelenskyy will request more US sanctions on Russia.\n\nMeanwhile, Moscow's UN envoy said Russian Foreign Minister Sergei Lavrov would meet US Secretary of State Marco Rubio, according to Russian state media.\n\nMr Trump has been pushing for weeks for a meeting between Zelenskyy and Russian President Vladimir Putin --- something he said Mr Putin had agreed to during a phone call more than a month ago.\n\nOn Thursday, Mr Trump said that Mr Putin had \"really let me down\". He is urging countries to penalise Russia by refusing to buy its oil.\n\nAlbanese's first UN speech and messages on social media and climate change\n\nIn past years, Foreign Minister Penny Wong has delivered Australia's statement at the UN's annual meeting of world leaders.\n\nBut this year, for the first time, the prime minister will address the general assembly.\n\nHe is likely to restate Australia's position on global conflicts and its wishes for peace, and talk about the importance of international cooperation and the rules-based world order, as Ms Wong has in past years.\n\nHe is also likely to mention Australia's new emissions reduction target and its social media ban for users under 16.\n\nHow will the social media ban work? Photo shows Graphic of child looking at a screen with the logos of all social media companies with squiggles in the background. The social media saga has produced its fair share of intrigue. But the latest big reveal on how the ban will work has left us with just another cliffhanger.\n\nAustralia is presenting to the UN an emissions target of a 62-70 per cent reduction on 2005 levels by 2035.\n\nAnd it will host a forum to promote its upcoming social media ban for under-16s.\n\nUnder the upcoming ban, social media platforms will have to take \"reasonable steps\" to stop Australians under the age of 16 from signing up.\n\n\"Australia is leading the world, but the world is following Australia's lead,\" Mr Albanese said of the ban.\n\nHe said the EU — which was considering a similar policy — as well as Greece and Fiji, would be represented at the forum on Wednesday morning, local time.\n\n\"We'll be out trying to round up a few more to come to what will be a really important event,\" he said.\n\nCommunications Minister Anika Wells and Energy Minister Chris Bowen, as well as Ms Wong, are accompanying Albanese to help him sell the policies to the world.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-22/world-road-cycling-championships-jay-vine-wins-silver/105800504",
        "title": "Australia's Vine claims spectacular silver in time trial at cycling world champs",
        "publish_date": "Sun, 21 Sep 2025 22:01:19 +0000",
        "category": "sports",
        "authors": [],
        "text": "Remco Evenepoel has crushed his rivals with one of the greatest time trial performances of all time, claiming a third-straight world title on a testing course in Rwanda.\n\nThe Olympic road and TT champion beat Australian Jay Vine into second place by a whopping one minute, 14 seconds.\n\nBut the more striking moment when Evenepoel flew past three-time Tour de France champion, Tadej Pogačar, on the final climb.\n\nThe hilly, 40.6km course around Kigali in Rwanda was supposed to level the playing field between the 25-year-old time trial specialist Evenepoel and Pogačar, who was celebrating his 27th birthday.\n\nPogačar, the defending road race world champion, started two minutes, 30 seconds ahead of his rival, but was passed with just over 2km remaining in the race.\n\nTadej Pogačar had a disappointing 27th birthday. (Getty Images: Dario Belingheri)\n\n\"I think on a day like today it doesn't matter who it is,\" Evenepoel, who completed the course at an average speed of 48.9kmh, said.\n\n\"On the cobbles when I saw that I was coming closer quite quickly, I knew that I had to push through.\n\n\"It doesn't matter who it is, I just wanted to go as fast as possible.\"\n\nPogačar finished two minutes, 37 seconds behind and could only manage fourth, wilting in the hot conditions at 1.567m altitude.\n\n\"It was a hard one to swallow, but he's Remco, and he is so good in this discipline,\" Pogačar said.\n\n\"Of course, I am disappointed that Remco caught me, but it is incredible how good he is in this discipline. Chapeau for all the ride by him.\"\n\nBelgian rider Ilan Van Wilder finished third, 1.6 seconds ahead of the Slovenian great.\n\n\"I felt pretty good straight away on the first flat part, I felt like the legs were turning. I was holding my pace without going over the limit,\" Evenepoel said.\n\nRemco Evenepoel is a three-time world time trial champion, as well as the reigning Olympic titlist. (Getty Images: Dario Belingheri)\n\n\"I saw I had quite a big gap so I wanted keep a pace that I could hold.\n\n\"I had a really good day. I hope I can keep this until next week [for the road race].\n\n\"I feel very happy and this is a big motivation boost.\"\n\nVine, who crashed while in medal contention last year in Zurich, but won gold in the mixed team event, was thrilled to claim sivler.\n\n\"A silver against, now the three-time world champ, I'm pretty happy with that,\" he said.\n\n\"It's an incredible feeling representing your country at the world level. To bring back a silver medal — it's not the one I wanted to bring back — but it's a good consolation prize.\n\n\"I'm really happy about bringing the medal home.\"\n\nEvenepoel is the third male rider to win three world titles in a row against the clock, with German Tony Martin (2011-2013) and Australian Michael Rogers (2003-05) the others to have achieved it.\n\n\"The row I get in, there are two impressive guys, Tony and Michael,\" Evenepoel said.\n\n\"It's a big honour for me to step up.\n\n\"I guess for me, next year, I have to go for another one, because I want to be the first to win four in a row.\n\n\"I'm gunna enjoy this one first of course.\"\n\nLuke Plapp finished seventh, three minutes and three seconds down.\n\nChapman misses podium by 16 seconds\n\nBrodie Chapman just missed out on a medal. (Getty Images: Dario Belingheri)\n\nIn the women's race, Australia's Brodie Chapman finished just off the podium in fourth place, just 16 seconds behind Demi Vollering.\n\nMarlen Reusser, a two-time runner up who has finished on the podium three times in her career in the world time trial, finally claimed gold with blistering ride.\n\n\"It was brutal course,\" Reusser, who celebrated her 34th birthday yesterday, said.\n\n\"I went really hard on the climbs, maybe too hard in the beginning but it was the right way to pace it.\n\n\"I still can't believe it, I think I've been on the podium so many times without winning so this is very special.\"\n\nShe finished 51 seconds ahead of Anna van der Breggen as the Dutch finished with silver and bronze.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-22/wsl-sam-kerr-returns-home-to-standing-ovation-in-chelsea/105800446",
        "title": "Kerr earns standing ovation in long-awaited return to Kingsmeadow",
        "publish_date": "Sun, 21 Sep 2025 21:39:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sam Kerr did not mark her eagerly awaited return to Chelsea's Kingsmeadow Stadium home with her customary goal — but she got the next best thing with an ecstatic welcome back from her adoring army of Blues' fans.\n\nA roar resounded around the ground in the 69th minute of Chelsea's Women's Super League clash against Leicester as the home crowd offered substitute Kerr a standing ovation and a hero's welcome for her first match there in more than 21 months.\n\nAfter all her injury woes, what they then got was a fairly subdued return from the 32-year-old striker, as she could not really get into the game while the champions held on to their 1-0 lead and moved clear at the top of the WSL table with three wins out of three.\n\nSuch is her record at Kingsmeadow that Kerr, whose face adorned the front of the match day programme, is always expected to find the target at the little arena in south-west London, especially after her return at Aston Villa the previous week in her first match for 634 days, when she came off the bench to score in stoppage time.\n\nBut she was unable to find that much-hoped-for follow-up to her 100th Chelsea goal, as the nearest she came was when she could not quite get on the end of some fine work from Aggie Beever-Jones, who had made a thrusting run.\n\nIt was England international Beever-Jones whose third goal in three games after just 7 minutes had earlier proved enough to seal the points for Chelsea, but they still did not look anywhere near their sharpest despite their perfect nine-point haul.\n\nBeever-Jones took advantage of a ricochet off Celeste Boureille to unerringly hit the target with a neat, lifted finish but Chelsea failed to kick on, even after the break, when coach Sonia Bompastor brought on the club's record signing, Alyssa Thompson.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nShe did not have much of an impact and neither did Kerr when finally introduced, to considerable excitement, for her 20-minute cameo.\n\nInstead, it was another Matilda, Emily van Egmond, who had the chance to earn her new team, Leicester, a late if unlikely point.\n\nThe veteran midfielder, who may have been lucky to still be on the field after a booking for a rough first-half challenge, had the chance to volley home a rebound after teammate Rosella Ayane had hit the bar, but she could only balloon her shot over.\n\nLater, Manchester United and Arsenal, who featured Steph Catley and Caitlin Foord in their starting line-up, could only share a goalless draw, leaving Chelsea two points clear as they seek a seventh straight WSL title.\n\nFoord produced one of the liveliest moments in a dull game, as she cut in from the left and shot just wide near the end of the first half.\n\nLiverpool's fixture at Aston Villa was postponed, and a minute's silence was observed in the other games of the day for former Reds and Chelsea manager Matt Beard, who had died over the weekend at the age of 47.\n\nThe Katrina Gorry-captained West Ham are now bottom without a point after a 4-1 defeat by Dario Vidošić's Brighton & Hove Albion, who moved up to sixth in the table.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-22/asx-markets-business-news-live-updates/105799724",
        "title": "Live: ASX gains after another record close on Wall Street",
        "publish_date": "Sun, 21 Sep 2025 21:13:11 +0000",
        "category": "finance",
        "authors": [
            "Stephen Letts",
            "Michael Janda"
        ],
        "text": "Wall Street's three key indices all hit new record highs for the second successive session, buoyed by last week's rate cut from the Fed and the prospect of more to come.\n\nThe blue-chip Dow, the S & P 500 and tech-centric Nasdaq rose 0.4%, 0.5% and 0.7% respectively.\n\nApple was a standout, gaining 3.2% after bullish commentary on demand for its latest iPhone and broker upgrade from J.P. Morgan.\n\nOver the week, the S & P 500 gained a solid 1.2% and the Nasdaq did even better, up 2.2%.\n\nASX 200 futures closed on Friday pointing to a 0.3% gain this morning — a positive start after two consecutive weeks of losing ground.\n\nMuch of the action in the US centred on the thoughts of the Fed's newest governor, Stephen Miran, the White House economic adviser parachuted into the Federal Open Market Committee by President Donald Trump.\n\nMr Miran pushed for a larger cut at last week's meeting that delivered the expected 25bps reduction.\n\nHe is likely to be pushing that barrow for some time, given his cunning plan is for an overall 150bps reduction, or seven more cuts, even if inflation continues to edge higher.\n\n\"Certainly, if the idea is the Fed is moving in a direction to relax the inflation target, that is definitely a recipe for running hot, and that's good for stocks,\" chief investment officer at Horizon Investments Scott Ladner told Reuters.\n\nEuropean markets were little changed on Friday and over the week, although defence sector stocks continue to be in solid demand.\n\nDespite the rate cut, the US dollar continued its recent rally as traders were coming around to the idea that the Fed (with the exception of Mr Miran) wasn't in any urgency in the easing cycle.\n\nThe US dollar gained around 0.3% against its six major trading peers. The Australian dollar slipped 0.3% back just under 66 US cents.\n\nSpot gold eased back from its record high above $US3,700/ounce, but was still up around 0.8% over the week.\n\nWhile oil tends to bubble up after rate cuts, both global and US benchmarks slipped (Brent -1.1% and West Texas Intermediate Crude -1.4%) as traders bet any increase in demand would not outweigh more supply in the pipeline.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-22/wa-coastal-towns-for-rent/105628728",
        "title": "'Literally no affordable housing': The holiday homes hollowing out towns",
        "publish_date": "Sun, 21 Sep 2025 21:12:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tourism is these towns' biggest breadwinner — but with a housing crisis in full swing, short-term stays are pushing locals away.\n\nA lot has changed since Helen Findlay moved to the coastal town of Busselton 25 years ago, looking for the good life.\n\nThat was back when the pace was slow, rents were affordable, and tourism was nascent.\n\nHelen Findlay say Busselton's identity has changed dramatically. ( )\n\nIt's the second time in two years that Ms Findlay and her dog Banjo have been living in the car. ( )\n\nMs Findlay has lived in Busselton for two decades. ( )\n\nNow in her 50s, the healthcare worker is packing up her house, preparing to couch surf or sleep in her car with her dog, Banjo, for the second time in two years.\n\nShe's yet another victim of the national housing affordability crisis.\n\n\"The town itself is losing the original things that people moved for and valued … that community and that feeling of connection, that feeling of neighbourhood, that feeling of a small coastal town,\" she said.\n\nGrowing pains\n\nIt's one of the town's great contradictions, reaping the benefits of booming tourism while grappling with a crippling housing crisis.\n\nThe region's growing pains are clear in suburbs like Geographe, where nearly every street has a house under construction.\n\nThose homes have helped keep up with the City of Busselton's population growing more than 22 per cent since 2015.\n\nBut it's still not enough.\n\nHouse prices have grown 50 per cent between 2016 and 2025, according to the Real Estate Institute of WA — about in line with the Perth metropolitan area.\n\nThe average rent is $700 to $800 a week.\n\nMs Findlay has been priced out of the Busselton housing market. ( )\n\nThat has left locals like Ms Findlay priced out of her hometown, where the median house sale price is now $815,000, compared to Perth's $800,000.\n\nShe's having to move out of a small granny flat she's lived in for the last year and a half after her lease wasn't renewed.\n\nMs Findlay's lease on her flat is not being renewed. ( )\n\nMs Findlay says there used to be more affordable housing options in Busselton. ( )\n\nMs Findlay says the housing crisis has worsened due to the post-COVID-19 population growth. ( )\n\n\"There is literally no affordable housing available … I'm a single person, not married with no dependents and moving into a share home is not really an option for me at the age of 55,\" she said.\n\nAs she packs a life's worth of kitchenware, clothes and mementos into boxes piled outside her granny flat, there's another factor she blames for the squeeze — short-term rentals like Airbnb homes.\n\nIt's a problem governments the world over have been struggling with, but many have been flying blind without accurate data.\n\nWhat the data says\n\nIn an effort to understand the problem, since July it's been mandatory for Western Australians running a short-term rental to register the property with the state government.\n\nData released exclusively to the ABC gives one of the greatest insights into the scale of the issue to date.\n\nAcross the state, there are more than 11,000 short-term rentals — about one per cent of all dwellings.\n\nMost — around 46 per cent — are in Perth.\n\nFrom 2026, those that are un-hosted — where the owner doesn't live onsite — and leased out for more than 90 nights a year, will need local government approval.\n\nPlanning Minister John Carey, who has ordered that change, wants to see fewer short-term rentals.\n\nJohn Carey says more long-term rental stock is needed. ( )\n\n\"I would absolutely prefer people ... to swap over to long-term rentals,\" he said.\n\n\"But I do accept this, particularly in the South West, short-term rentals provide that supply for the tourism market.\n\n\"But it is a fine balance.\"\n\nMr Carey said the state government had done all it could and it was now up to local governments to use the available data to make the right decisions for their community.\n\nThe South West region, being southern WA's premier tourist destination, is home to about 27 per cent of the state's registered short-term rentals.\n\nZooming in to specific areas helps to understand the impact of short-term rentals by drawing a comparison to the long-term rentals on offer.\n\nOne of the smaller areas is the Shire of Jerramungup, on WA's south coast, which has about as many short-term rentals as it does rentals overall.\n\nThe Bankwest Curtin Economics Centre helped crunch that data to pinpoint the state's greatest pain points.\n\nWhile not all short-term rentals are suitable for the private long-term market, the centre's Steven Rowley said even if half were, it could boost supply by 50 per cent.\n\nProfessor Steven Rowley has been working to quantify the impact of the short-term rental market on the housing crisis. ( )\n\n\"When rental markets have vacancy rates that are extremely low, local governments should be thinking what can they do to bring more short-term rental accommodation back into the private rental market,\" he said.\n\nBut of course, that was a difficult dance, he said, because it meant telling people how they could — or shouldn't — use their homes.\n\nShire of Jerremungup president Joanne Iffla owns a cafe on Bremer Bay's main street. ( )\n\nJoanne Iffla is the shire president and owns a café in Bremer Bay.\n\nShe said the town's housing situation has changed rapidly over the past five years.\n\n\"There isn't a lot for sale, and anything that does come for sale is snapped up quite quickly,\" she said.\n\nTourists flock to the town for its pristine beaches and stunning wildflowers.\n\nBremer Bay is a popular holiday destination on WA's coast. ( )\n\nMs Iffa said tourists put a strain on the community's resources. ( )\n\nThe town is popular with families. ( )\n\nTourism has put pressure on the town's housing stock. ( )\n\n\"Power, water … and connectivity is a huge problem during the influx,\" Ms Iffla said.\n\n\"Most business owners will have their own power backup.\n\n\"And while we do embrace tourism, it does put a real pressure on housing.\"\n\nIt's forced some business owners to buy or lease properties for their staff to live in.\n\nJoanne Iffla says business owners are being forced to arrange housing for staff. ( )\n\n\"If we couldn't find housing within the town, like rentals, we just could not open,\" she said.\n\n\"So it is a cost of doing business within Bremer Bay.\"\n\nRisky business\n\nIt's a similar story about 500 kilometres west in Dunsborough.\n\nSamantha Bottegal's Japanese restaurant in the heart of Dunsborough serves sushi rolls and bento boxes to a mix of white-collar workers and tourists seven days a week.\n\nSamantha Bottegal is the co-owner of the Japanese restaurant Peko Peko in Dunsborough. ( )\n\nShe's signed housing leases for two of her employees so she can keep her business running.\n\n\"We go guarantor, we put ourselves on the lease as well, which is obviously a bit more risk for us, but unless we do that we won't secure accommodation,\" she said.\n\nMs Bottegal has to put up her staff in accommodation. ( )\n\nMs Bottegal is wary of what reducing short-term rentals could mean for the tourist town.\n\n\"If there's less … there could be less people, more expensive [retail] prices\" she said.\n\nRestrictions on short term rentals have pros and cons for local business. ( )\n\n\"If we have more housing for local staff that's great … we won't have so much of a burden on us.\n\n\"But at the same time, if we have trouble with the amount of tourists which come in it could affect business, not just for us but the whole town.\"\n\nA careful balancing act\n\nThe City of Busselton, which includes Dunsborough, has the most short-term rentals of any local government in the state — 1,691.\n\nThe City of Busselton has the highest proportion of short-term rentals in the state. ( )\n\nPlenty of tourists use those properties to visit the Busselton Jetty — the longest timber-piled jetty in the Southern Hemisphere.\n\nWatching tourists snapping selfies and enjoying ice creams, Mayor Phill Cronin explained the town's dilemma.\n\nBusselton Mayor Phill Cronin is wary of the stranglehold short term rentals have on the City. ( )\n\nThe Busselton Jetty in WA's South West. ( )\n\nAn aerial shot of the famous Busselton Jetty. ( )\n\n\"We're getting to a point where there is a massive amount of tourism accommodation and we're finding that restriction on long-term rentals is really starting to hurt the local community,\" he says.\n\nThe City of Busselton has imposed a ban on new unhosted holiday homes in certain residential areas.\n\nIt's also hiked rates on existing holiday homes by 21 per cent over the 2025-26 financial year, to try and free up more housing for residents.\n\nBusselton Mayor Phill Cronin says a line has to be drawn on short term rentals. ( )\n\n\"We had to draw a line somewhere in the sand,\" he said.\n\n\"We understand Dunsborough's always been an incredible tourist town and one that is really loved by all of the community, but because we are changing, it is our role as a council to make sure we're fair to tourists and the community.\"\n\nAn aerial map of the Dunsborough Lakes subdivision, where un-hosted Airbnb properties are banned. ( )\n\nDunsborough Lakes, is one of the areas where new un-hosted short-term rentals have been banned by the local council.\n\nThe Lakes subdivision began developing in the early 1990s, as demand for residential land in the popular coastal tourist haven boomed.\n\nMatt Hamilton lives there, and has carefully arranged his home as a hotel room, complete with a bowl of plastic fruit set on the kitchen island and prints of Audrey Hepburn and Marilyn Monroe on the wall.\n\nMatt Hamilton rents out his home on a short-term basis. ( )\n\nFor the last five years he's rented out his property over holiday periods and some weekends.\n\nThe musician believes the short-term rental ban has unfairly targeted affordable areas but not the wealthy tourism hotspots by the beachside such as Old Dunsborough.\n\nMatt Hamilton's future in Dunsborough Lakes has been cast into uncertainty. ( )\n\n\"That's what doesn't make sense to me, the areas being targeted are working class areas,\" he said.\n\n\"It's actually going to force people out of the area by taking a revenue stream away.\n\n\"It's not play money. This is real money going to paying off our mortgages.\"\n\nMr Hamilton believes residents in Dunsborough Lakes are copping a bad deal. ( )\n\n'This can happen to anyone'\n\nBack in Busselton, the council's changes have done little to help Ms Findlay.\n\nShe hopes people understand why moving out of the town isn't always a possibility.\n\nMs Findlay says the council's changes are too little, too late. ( )\n\n\"Not wanting to give up their full-time job, their school, their family, their connections, their support systems, it's not always an option to say you need to go looking elsewhere outside of a tourism town,\" Ms Findlay said.\n\nAnd, she warned, nobody is immune to increasing housing pressures.\n\n\"This can happen to anybody overnight … a health situation, a domestic violence situation, a mental health issue,\" she said.\n\nCredits",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-22/storm-damaged-turbine-at-nsw-central-west-wind-farm-concerns/105782400",
        "title": "Wind turbine blade failure six months after installation 'a big shock'",
        "publish_date": "Sun, 21 Sep 2025 20:58:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Safety concerns have been raised over turbines at a wind farm in the New South Wales Central West after a blade snapped in half during a storm.\n\nMore than a dozen turbines at the Flyers Creek Wind Farm have been switched off after one was damaged due to strong winds.\n\nIn a statement, a spokesperson for the owners of the facility, Iberdrola Australia, said the tower's blade initially suffered damage during a storm in June.\n\nHowever, they said, after a loss of electric power and strong winds earlier this month, the turbine suffered further damage.\n\nRegions face 'social licence' balancing act for renewables Photo shows Man leans against fence, looks across farmland towards a peninsula in the distance. As Labor continues to target 82 per cent renewables by 2030, the amount of wind and solar in regional communities will continue to scale up. But balancing community and environmental interests has been challenging for companies and governments.\n\nThe spokesperson said a series of scheduled and unscheduled inspections at the wind farm regularly occurred.\n\n\"These inspections cover a wide range of components from the blades and nacelle to the tower and foundation,\" they said.\n\n\" We do not have any concerns regarding the blades on the other wind turbines. \"\n\nThe wind turbines are located on a livestock property, however, an exclusion zone is in place to protect animals and farm workers.\n\nWind farm safety concerns\n\nThe wind farm became fully operational in April and houses 38 turbines.\n\nProfessor of structural engineering at Monash University, Amin Heidarpour, said it was \"surprising\" to see a blade snap so soon.\n\n\"Normally, a wind turbine blade has a life span of about 20 to 25 years,\" he said.\n\n\" Failure of a blade just six months after installation is a big shock. \"\n\nThe Flyers Creek Wind Farm has 38 turbines. (ABC Central West: Emily Middleton)\n\nProfessor Heidarpour said turbines were designed to withstand winds in excess of 100 kilometres per hour, but typically had automatic shutdown systems when speeds reached 90 kph.\n\nThe failure at the Flyers Creek Wind Farm came after a similar incident occurred in western Victoria earlier this year during which a tower collapse in strong winds.\n\nProfessor Heidarpour said while people \"shouldn't be concerned\" about the safety of wind farms, there has been an increase in blade failure in recent years.\n\n\"We should start to do a proper study to better understand what is the main cause behind the failure of these blades,\" he said.\n\nCalls for safety review\n\nThe leader of the NSW Nationals Party, Dugald Saunders, said while damage of this nature did not happen all that frequently, it highlighted growing concerns among communities hosting the infrastructure.\n\n\"There is some concern if a blade can snap during a storm,\" he said.\n\nNSW Nationals leader Dugald Saunders has called for a safety audit of wind turbines in the state.\n\nIn a statement, a spokesperson for the Department of Planning, Housing and Infrastructure said the risk of turbine damage \"was considered during the assessment\" of the project.\n\n\"Due to the setback distances of the turbine locations from residences and the road, the risk to the public from this incident is considered negligible,\" the spokesperson said.\n\nMr Saunders said the current safety assessments that were carried out for approved wind farm projects lacked transparency and a \"safety audit\" should be done to raise confidence among residents.\n\n\"The idea of not really knowing what safety assessments are in place … that is where there needs to be some genuine improvement to assure the community.\n\n\"Otherwise, it will always feel like it is being done behind closed doors with a veil of silence.\"\n\nThe spokesperson for Iberdrola said a replacement blade had been ordered and they were working to determine an \"appropriate return to service plan\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-22/converted-e-bikes-ban-on-nsw-rail-metro-network-november-1/105799084",
        "title": "Commuters taking converted e-bikes on NSW trains, metro to face fines up to $1,110",
        "publish_date": "Sun, 21 Sep 2025 19:58:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "E-bikes posing a \"higher fire risk\" will be banned from trains after dozens of incidents were found to be linked to the battery technology powering them.\n\nCommuters travelling with a converted e-bike on a Sydney Train, Trainlink or Metro services, will face penalties of $400 to $1,110 from November 1.\n\nThe ban will only apply to converted e-bikes — a pedal bicycle fitted with an aftermarket battery and motor — and will apply on trains and platforms.\n\nThe NSW government said a fire at Blacktown Station in April involved a converted e-bike. (Supplied: NSW government)\n\nThe state government made the decision following discussions with stakeholders and a public consultation that yielded almost 3,000 responses.\n\n\"The overwhelming message from the consultation was that banning all e-bikes from trains would go too far,\" Transport Minister John Graham said.\n\nHe said converted e-bikes posed greater fire risks, usually due to \"DIY installations, inadequate wiring and the use of second-hand batteries, and incompatible or poor quality components\".\n\n\"Taking out the highest risk e-bikes is a sensible and balanced step, but we will watch this space very closely and take further action if necessary,\" he said.\n\n77 fires related to e-micromobility lithium-ion batteries\n\nThe lithium-ion batteries powering e-bikes and other electric \"micromobility\" devices have been linked to a spate of fires.\n\nFire and Rescue NSW said there have been 77 incidents so far this year, resulting in 16 injuries, but it could not provide more detailed data revealing how many were caused by converted e-bikes.\n\nThe state government made the decision following discussions with stakeholders. (ABC News: Abubakr Sajid)\n\nAccording to the state government, two incidents were caused by e-bikes — one at Liverpool Station in August, and the other in a lift at Blacktown Station in April.\n\nHowever, only the latter involved an e-bike that had been converted with an aftermarket kit.\n\nAnother e-bike fire reportedly occurred in Melbourne, on a metro train in March.\n\nBicycle NSW, a non-profit member group representing the state's bicycle riders, said the policy represents a proportionate response.\n\n\"The real risk is with the kit-modified e-bikes,\" chief executive Peter McLean said.\n\n\" It's not just the lithium-ion batteries that are cheap, but it's the wiring and the charging systems on them as well which pose a significant risk. \"\n\nBattery in bin causes fire, 15 tonnes of rubbish dumped in street Photo shows A pile of rubbish in the middle of the road. A battery embedded in a device thrown out with household rubbish took just seconds to spark a multi-agency emergency response.\n\nMr McLean acknowledged the policy could disproportionately affect people who couldn't afford new e-bikes.\n\n\"It may be disadvantaging lower socio-economic users of bicycle riders, so there is a small chance of that.\"\n\nHe said e-bikes had been available long enough to foster a second-hand market — and recommended budding riders buy well-known brands.\n\n\"It's really, really important because these devices also provide a very, very significant benefit to many people across society … from food delivery to social connection to multimodal connection.\"\n\nTransport for NSW staff will be trained to enact the policy, the government said, and will \"conduct hotspot blitzes\" when it comes into effect in November.\n\nMeanwhile, the state government is drafting legislation to improve the regulation of shared e-bikes.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/technology/optus-to-face-significant-consequences-over-fatal-outage-20250922-p5mwuh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Albanese says he’d be surprised if Optus boss wasn’t considering his future",
        "publish_date": "Mon, 22 Sep 2025 12:04:08 +1000",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "Prime Minister Anthony Albanese said he would be “surprised” if Optus chief executive Stephen Rue was not considering resigning from his position after last week’s fatal Triple Zero outage linked to multiple deaths.\n\nRue was formerly the chief executive of NBN Co, and joined Optus in November 2024 promising to stabilise the company and rebuild customer trust after Optus suffered a major data breach in 2022 and then a nationwide outage that cut millions of Australians off from Triple Zero in 2023.\n\nPrime Minister Anthony Albanese speaking in New York. Credit: Dominic Lorrimer\n\nWhile Rue has been in the job for less than a year, Prime Minister Anthony Albanese said on Monday morning that he expected the chief executive to be considering his position.\n\n“Optus has obligations, as do other communications companies, and clearly they haven’t fulfilled the obligations that they have,” Albanese told the ABC from New York.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-australian-recognition-of-palestine-comes-into-effect-trump-arrives-in-arizona-for-kirk-memorial-20250922-p5mwtq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Australian recognition of Palestine met with mixed reaction; Trump addresses crowd of thousands at Kirk memorial",
        "publish_date": "Mon, 22 Sep 2025 12:03:29 +1000",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Businesses have been challenged by the Reserve Bank governor to do their own bit to lift Australian productivity.\n\nGiving evidence to a parliamentary inquiry this morning, Michele Bullock was asked about the country’s poor productivity performance over the past two decades. Productivity levels are around where they were in 2016.\n\nBullock said while governments had a role to play in improving productivity, the business sector also had to lift its game.\n\n“Businesses have to step up as well,” she said. “Australian businesses haven’t had the dynamism that other industries overseas [have had].”\n\nMichele Bullock, governor, Reserve Bank of Australia today. Credit: Alex Ellinghausen\n\nOne complaint about productivity has been the increase in government spending in so-called “non-market” sectors which include health and education. It was a key feature of the federal government’s recent three-day economic roundtable.\n\nBut Bullock pushed back at linking government spending and productivity levels.\n\n“I don’t think you can make a correlation between more public spending in these areas [as] bad,” she said.\n\nThe bank’s chief economist, Sarah Hunter, noted one of the biggest falls in productivity in recent years had occurred in the mining sector.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/the-moutai-barometer-chinese-economy-feels-sting-of-booze-ban-for-elite-20250917-p5mvuv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The ‘Moutai barometer’: Chinese economy feels sting of booze ban targeting elite",
        "publish_date": "Mon, 22 Sep 2025 12:00:18 +1000",
        "category": "finance",
        "authors": [
            "Lisa Visentin"
        ],
        "text": "In Renhuai city, home of China’s famous firewater liquor Moutai, the once-raging alcohol industry is in the grips of an economic hangover. Sales people are leaving in droves and small distilleries have gone bust, locals say, following a government booze ban that has targeted China’s elite.\n\nChinese officials and businessmen who love to banquet have stopped raising their glasses of Moutai after the government imposed an alcohol ban as part of an anti-corruption drive that directed them to live frugally on the public dime.\n\nBut the edict has ushered in austere times for a food and beverage sector already struggling with an economic downturn. It has also hobbled the government’s own efforts to get people to spend more to boost the economy, and has helped drag down the price of Moutai.\n\nA giant sculpture of a Kweichow Moutai bottle near the Yanjin River in Maotai Town, Renhuai City. Credit: Sanghee Liu\n\nOfficially known as Kweichow Moutai, after the top distillery that manufactures it, the liquor is the premium version of the throat-stripping, sorghum-based spirit called baijiu and is renowned for its 53 per cent alcohol potency.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/there-will-be-more-outages-like-optus-as-tech-runs-the-world-20250922-p5mwuc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "There will be more outages like Optus’ as tech runs the world",
        "publish_date": "Mon, 22 Sep 2025 11:59:48 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The complexity of the modern IT systems used by the bigger companies and their vulnerability to human errors, whether in the entering of data, the underlying coding or the execution of an upgrade, means they will never be 100 per cent reliable. Loading The challenge for those responsible for them is to minimise the number of “events” and the degree of damage or disruption they might cause, and having the processes in place to respond as appropriately and quickly as possible when they do occur. Optus, it would seem, doesn’t have foolproof processes in place, given the delays between when customers tried to alert the company that there was a problem, the time it took for the issue to be escalated to senior managers, the problems the company experienced in extracting records from its systems so that welfare checks could be made to the callers, and the time it took for Optus to notify the authorities and the public. The moment its call centres started receiving calls saying there was an issue with the Triple Zero network, someone senior should have been notified. Optus’ chief executive Stephen Rue says that will now be the protocol. Better late than never, although that’s no consolation for the families of those who died while trying to contact emergency services.\n\nThere will be plenty of post-mortems of exactly how the outage occurred, with blame and criticism distributed and, no doubt, financial consequences for the company. Loading It should be noted, however, that the Triple Zero system has essentially been outsourced to private companies – the three major telcos – who are supposed to support it with investment, staff and processes. They may, or may not, adequately resource or focus sufficient attention on what is a not-for-profit service. Whether it is the banks and their anti-money laundering responsibilities, or the telcos and their Triple Zero services, these companies are being asked to collectively invest billions of dollars to provide community services and are then fined heavily, suffer immense damage to corporate and personal reputations and position if their technology or processes fail. Something similar could be said about the inability of some of our biggest companies’ technology to cope with their employees’ remuneration arrangements. “Wage theft” at the big company level relates more to the inability of IT systems to cope with the complexities generated by multiple awards, different shifts and individual pay arrangements than it does to deliberate underpayment.\n\nThe government and community may be asking more of major companies than they, or the available technology, can deliver. There’s an assumption, which we all know is wrong, that the technology will always work perfectly. There’s an assumption, which we all know is wrong, that the technology will always work perfectly. Given that no-one can guarantee that these big technology platforms will never experience malfunctions (it is almost guaranteed that they will) the community service obligations attacked to their licences to operate are poisoned chalices. The consequences of failure, however, ought to provide the motivation to do everything possible to try to minimise the number and magnitude of the damaging events they experience, and the regularity of these incidents within the sector ought to mean that their executives have a pretty good handle on where the vulnerabilities in their systems and processes are. In Optus’ case, a series of issues – it was also hit by a massive cyberattack in 2022 where nearly 10 million customers’ data was exposed – raises the question whether its Singaporean parent has invested sufficiently in the resilience of its Australian infrastructure and, given that Rue pointed to a failure of processes, whether the local management has responded adequately to the lessons it should have learned from its 2023 outage.\n\nThe fact that Telstra and Vodafone have also had major outages, however, says that more investment and/or more robust processes aren’t necessarily the complete solution, although they would presumably help. Last year, computers around the world that were running Microsoft’s Windows software crashed after an update was rolled out by cybersecurity firm Crowdstrike Falcon. Globally, companies are increasingly reliant on a handful of providers for their cybersecurity and their data storage. In future, another layer of vulnerability and dependency will be added as artificial intelligence becomes more embedded in companies’ systems. The Optus’ experience isn’t unique and probably won’t be the last outage or technology-related crisis within a big Australian organisation.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/tammy-hembrow-thanks-fans-for-their-support-following-divorce-announcement-20250624-p5m9v6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tammy Hembrow thanks fans for their support following divorce announcement",
        "publish_date": "Mon, 22 Sep 2025 11:53:39 +1000",
        "category": "finance",
        "authors": [],
        "text": "Tammy Hembrow thanks fans for their support following divorce announcement\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/author-shares-simple-strategies-to-improve-your-wellbeing-20250922-p5mwyg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Author shares simple strategies to improve your wellbeing",
        "publish_date": "Mon, 22 Sep 2025 11:51:03 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Author shares simple strategies to improve your wellbeing\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/structurally-unsound-with-views-like-these-bidders-happy-to-spend-1-47m-20250922-p5mwvn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Structurally unsound? With views like these, bidders happy to spend $1.47m",
        "publish_date": "Mon, 22 Sep 2025 11:41:17 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A structurally unsound house in need of a million-dollar renovation has sold for nearly $400,000 above reserve after a local family outbid developers to claim a rare slice of Stafford Heights.\n\nSet on a 1174-square-metre block – one of the last of its size in the suburb – the four-bedroom postwar cottage at 85 Pangeza Street triggered a six-way bidding war on Saturday, with the buyers paying $1.475 million.\n\nIt marks the home’s first change of hands in almost 50 years.\n\nThe selling agent said buyers valued the block’s sheer size and its city views. Credit: Domain\n\nBidding kicked off at $1 million and crawled in $25,000 increments until the home was called on the market at $1.1 million – near the reserve.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/sydney-home-seller-s-reno-pays-for-itself-and-more-in-1-25m-payday-20250922-p5mwvf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney home seller’s reno ‘pays for itself’ and more in $1.25m payday",
        "publish_date": "Mon, 22 Sep 2025 11:36:10 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A fresh renovation of a one-bedroom apartment in Cremorne lifted the sale price for the vendors by $400,000 to $1.25 million compared to a $850,000 offer late last year in its original condition.\n\nThe one-bedroom turnkey apartment at 501/221 Ben Boyd Road has panoramic views of Middle Harbour and a parking spot.\n\nSix buyers registered, and four actively bid for the Sydney pad guided at $1,050,000. Bidding opened at $1 million, jumped to $1.15 million, then rose in $10,000 strides above its $1,155,000 reserve until it sold under the hammer for $1.25 million.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/nrl-around-the-clubs-finals-week-three-20250922-p5mwud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Being a sook’: Panthers duo shrug off injury worries ahead of Broncos showdown",
        "publish_date": "Mon, 22 Sep 2025 11:33:00 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Billie Eder"
        ],
        "text": "Penrith’s Liam Martin and Casey McLean insist they will be fit to play in Sunday’s grand final qualifier against Brisbane after being forced from the field in the Panthers semi-final thumping of Canterbury.\n\nMartin was in obvious discomfort after he was tackled by former teammate Viliame Kikau, with the NSW and Kangaroos star staying down and struggling to breathe late in the contest.\n\nThe 28-year-old came from the field and struggled to make his way up the Accor Stadium tunnel at one point, but he was in good spirits soon afterwards and said he was not concerned about any recurrence of a rib cartilage injury he carried through last year’s finals.\n\n“They’re all right now,” Martin said of his ribs after full-time.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/bulldogs-buku-khamis-requests-trade-to-carlton-20250922-p5mwxd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bulldogs’ Buku Khamis requests trade to Carlton",
        "publish_date": "Mon, 22 Sep 2025 11:33:00 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "Western Bulldogs utility Buku Khamis has told the club he wants to be traded to Carlton as he seeks more opportunities to play senior football.\n\nThe 25-year-old, who has played 41 matches since making his debut in 2021, attracted interest from the Blues, who are looking to bring in support for defensive pillar Jacob Weitering after losing free agent Jack Silvagni to St Kilda.\n\nThe Bulldogs are open to discussing a trade with Carlton, according to two competition sources with knowledge of the situation, but as a contracted player who adds depth to their list at either end of the ground, they are expected to drive a hard bargain before releasing Khamis.\n\nLachlan McNeil (left) and Buku Khamis of the Bulldogs celebrate a goal. Credit: AFL Photos via Getty Images\n\nCarlton have made it clear they will be active in this year’s trade period as they try to add speed and class to their line-up. They have said key forward Charlie Curnow is a required player, but the contracted forward is keen to make a fresh start at either Geelong, Gold Coast or Sydney.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/woman-pays-1-6m-for-two-bedder-in-melbourne-s-most-liveable-suburb-20250922-p5mwvk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woman pays $1.6m for two-bedder in Melbourne’s ‘most liveable’ suburb",
        "publish_date": "Mon, 22 Sep 2025 11:27:55 +1000",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "The home was well-maintained and had a deeper block than similar terraces in the area, said Daniel. “It also had a Dutch-inspired renovation in the kitchen and just lots of potential,” he added. Daniel said the Fitzroy North market is performing well, and turnkey properties are popular. Fitzroy North was this year crowned the most liveable suburb in Melbourne by the PwC CityPulse 2025 report, based on its safety and closeness to education, health and other essential services. The property was one of 1246 scheduled to go to auction in Melbourne last week. By Saturday evening, Domain Group recorded a preliminary auction clearance rate of 73.2 per cent from 930 reported results throughout the week, while 78 auctions were withdrawn. Withdrawn auctions are counted as unsold properties when calculating the clearance rate.\n\nIn St Kilda, a double-level terrace that sits above the converted circa 1930s Kingsclere mansion sold at auction for its reserve price of $1.15 million. The home at 30/44 Fitzroy Street had a price guide of $1.1 million to $1.2 million. The property, which features city views, is in a “premium bayside location” close to Albert Park Lake and St Kilda Beach, said selling agent Peter Perrignon from Belle Property, South Yarra. Two bidders took part in the auction: a young man who had returned from overseas and a young married couple looking for their first home.\n\nLoading “Bidding opened at $1.1 million, then rose to $1.15 million. The young couple had hit their ceiling and didn’t want to go any further, so it was sold to the young man,” Perrignon said. The sellers were investors who purchased the property 25 years ago, renting it out to one tenant for 20 years. “That shows how much he loved the place,” Perrignon said. Like many inner-city areas, the St Kilda market is showing more movement, Perrignon said.\n\n“The auction rate has picked up, and the number of buyers getting ready for the upcoming [First Home Guarantee scheme expansion] or trying to get in before … it is definitely having an impact,” he said. In Thornbury, a renovated three-bedroom family home was sold at auction for $1,485,000 to a downsizing couple from Kew. The residence at 295 Gooch Street was guided between $1,425,000 to $1,475,000 and had a reserve of $1,475,000. The vendors, a family of three looking to upsize, had bought the home seven years ago and had done a “nice renovation”, said selling agent Nigel Harry from Jellis Craig Northcote.\n\nLoading The upgrade included whitewashed timber floors, a bright and open-plan living area, an entertainer’s deck, and landscaped gardens. The auction took place in front of a modest crowd of 15 to 20 people, opening with a bid of $1.425 million. “Between the school holidays and bad weather, I don’t think many people wanted to come out for the auction,” said Harry. The bidding rose in increments of $10,000 until it hit the selling price of $1,485,000.\n\n“The successful bidders, a downsizing couple, were moving to be closer to their adult children, and the allure of buying something they could move right into was really appealing,” Harry said. “The underbidder was at the other end of the equation, they were a young family looking to upsize and to move out of a townhouse into their first house,” he added. Diaswati Mardiasmo, chief economist at PRD, said the Melbourne market is holding stable. “The unemployment rate is stable, wage growth is stable, everything in the economy is stable at the moment, which is why we aren’t seeing a higher auction clearance rate,” she said. The main factors influencing this, Mardiasmo said, could be the upcoming federal government’s Home Guarantee scheme, which expands on October 1.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/ponting-calls-on-australia-to-make-big-batting-call-for-ashes-20250922-p5mww7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ponting calls on Australia to make big batting decision for Ashes",
        "publish_date": "Mon, 22 Sep 2025 11:18:37 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Ricky Ponting says Australia should consider moving vice-captain Travis Head up to No.3 to get on the front foot against England for the Ashes, allowing all-rounders Cameron Green and Beau Webster to bat alongside each other at five and six.\n\nAustralia’s top six is far from settled a couple of months out from the first Ashes Test, with the selectors wanting to take a look at the early rounds of the Sheffield Shield before making up their minds.\n\nRicky Ponting and Justin Langer. Credit: Getty\n\nLooking back at his own career, Ponting said that after an apprenticeship in the middle order, senior players should be looking to move up higher, and suggested that Head’s aggressive approach would get the hosts off on the right foot against England.\n\nHe also suggested that Sam Konstas should keep his spot at the top of the order alongside Usman Khawaja following a century for Australia A in India last week.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/a-carlton-wine-room-owner-is-now-running-this-popular-backstreet-pub-20250919-p5mwho.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A Carlton Wine Room owner is now running this popular backstreet pub",
        "publish_date": "Mon, 22 Sep 2025 11:00:00 +1000",
        "category": "finance",
        "authors": [
            "Besha Rodell"
        ],
        "text": "Advertisement\n\nEating outJust open A Carlton Wine Room owner is now running this popular backstreet pub But he doesn’t want to fancy things up. The goal is to create a relaxed vibe like “a country pub that’s landed in the middle of Carlton”. Besha Rodell September 22, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nWhen the Brandon Hotel in Carlton North announced that it would be closing last month, punters were worried. Having lost the nearby Dan O’Connell hotel a few years back – and with many other neighbourhood pubs closing or morphing into fancier, trendier venues – losing the slightly daggy, wonderfully low-key Brando felt like a gut punch. Andrew Joy, one of the new owners of the Brandon Hotel in Carlton North. Simon Schluter Last week, the pub’s Instagram page began showing signs of life, and last Tuesday, the creaky old doors reopened under new operators. They are Andrew Joy of the hatted Carlton Wine Room and Cameron McIntyre, a builder who has worked on many pubs in the inner city, including the nearby Royal Oak and Union House in Richmond. So far, the changes are confined to food and drink. The menu has been pared back significantly. There are sausage rolls, a burger, a parma and a couple of heftier options. Beer and wine options have changed. For now, there are six whites, six reds, a rose and a sparkling. Everything is $12 a glass. Related Article Hold our beer, the pub is back. Here are Melbourne’s 20 best right now\n\nAdvertisement\n\nAnd while Joy and McIntyre do plan to eventually give the space a refresh, they’re holding off while they figure out what people want from this corner pub. “We’re looking at the current pub scene, and we want to respect what the building is and what locals want,” Joy says. “Yes, I want it to look nice. But we want to live with it for a bit before we change it.” Much of what they’ve done is remove, rather than add, things. “We’ve already taken a look at the facade and realised that there’s beautiful tile under all this paint.” Joy emphasises that he wants the venue to be somewhere people can come for a cheap meal or just a beer.\n\nAdvertisement\n\nA new chef will be on board in the next few weeks, but the food won’t be fancy. “I just want pub classics done exceptionally well,” he says. “I’m from the country – I want it to feel like a country pub that’s landed in the middle of Carlton,” he says. “I want to see people playing cricket in the street outside.” Lunch Fri-Sat; dinner daily 237 Station Street, Carlton North, brandonhotel.com.au\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/traveller/travel-news/the-new-ships-cruising-europe-s-rivers-20250701-p5mbj6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The new ships cruising Europe’s rivers",
        "publish_date": "Mon, 22 Sep 2025 10:57:38 +1000",
        "category": "finance",
        "authors": [
            "Brian Johnston"
        ],
        "text": "Advertisement\n\nTravel newsRiver cruises The new ships cruising Europe’s rivers Brian Johnston September 22, 2025 — 10:57am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nIt seems none of us tire of Europe’s waterways. In fact, to judge from a flotilla of stylish new ships about to set sail, more of us than ever will soon be afloat on the continent’s culture-packed waterways. Avalon Envision. Among new ships this year are Riviera Rose and AmaSintra on the Douro in Portugal, Riviera Radiance and SS Elisabeth on the Danube, and Spirit of the Moselle and Amadeus Amara on Rhine-Danube routes. Scenic recently overhauled its river ship interiors with new layouts, new furnishings and transformations of their deck, lounge and dining areas. Now Avalon Waterways is in the middle of its own two-year refresh. Emerald Cruises too has been upgrading its entire eight-vessel Europe fleet this year, including redesigns of areas such as its Horizon Lounge and pool/cinema space, and the replacing of textiles and artworks.\n\nAdvertisement\n\nBrand-new ships this year include four 190-guest vessels from Viking Cruises on the Rhine, Main and Danube. Also, the company’s 168-guest Viking Nerthus floats out on the Seine in France and Viking Gyda on the Douro. Several more Viking ships are coming next year. APT Solara. APT Solara and APT Ostara have also arrived down the slipways. The 154-guest ships feature six dining venues – the most on any European river ship – as well as a spa, gym and hair salon. Both will be offering itineraries on the Rhine and Danube such as the ever-popular 15-day Magnificent Europe itinerary between Amsterdam and Budapest. There are more river ships coming in 2026, too. In the premium category, Emerald Cruises launches the 180-guest Emerald Astra on itineraries along the Rhine, Moselle and Danube, while the 182-guest Travelmarvel Rigel will sail a new eight-day Rhine-Moselle itinerary for Travelmarvel between Amsterdam and Basel in Switzerland. Jostling for space on the Danube will the 154-passenger SS Emilie from Uniworld, which is celebrating its 50th anniversary in 2026. Uniworld’s ships are known for their striking decor and this time Austrian artist Gustav Klimt is the inspiration, so expect green and yellow hues and a sparkle of gold. The ship is named for Klimt’s partner and muse Emilie Floge.\n\nAdvertisement\n\nMeanwhile two 130-guest ships will be joining the Tauck fleet in France: MS Serene on the Seine and MS Lumiere on the Rhone. Both will have a sun deck with swimming pool, wellness area and larger than usual suites. In good news for solo travellers, single supplements will be waived across all Category 1 cabins. And finally in 2027 – not as far away as you might think – three more as yet unnamed Uniworld ships are coming to the Rhine, Danube and Douro rivers. And in big news, Celebrity Cruises, until now only an ocean cruise company, will be launching a whole new river-cruise endeavour. Details are slim, but 10 ships are on order that will operate on the world’s rivers, with the first few tipped to sail out in Europe.\n\nSign up for the Traveller newsletter The latest travel news, tips and inspiration delivered to your inbox. Sign up now.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: River cruises\n\nAmsterdam\n\nCruises Brian Johnston seemed destined to become a travel writer: he is an Irishman born in Nigeria and raised in Switzerland, who has lived in Britain and China and now calls Australia home.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/murdoch-family-joins-tiktok-us-ownership-deal-says-trump/iwyqiznyb",
        "title": "Murdoch family joins TikTok US ownership deal, says Trump",
        "publish_date": "Mon, 22 Sep 2025 00:34:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points US President Donald Trump announced the Murdochs would help with proposed deal to keep TikTok in the US.\n\nThe deal would require TikTok's US assets to be transferred from China's ByteDance to American ownership.\n\nTikTok has 170 million users in the US and significantly influences political and cultural discourse.\n\nUS President Donald Trump says media mogul Lachlan Murdoch and business leaders Larry Ellison and Michael Dell will be involved as US investors in a proposed deal to keep TikTok operating in the United States.\n\n\n\n\n\nTrump has said that the US and China have made progress on a deal requiring TikTok's US assets to be transferred to local owners from China's ByteDance.\n\n\n\n\n\nTikTok counts 170 million users in the United States and helps shape public discourse on politics and culture.\n\n\n\nREAD MORE TikTok deal still unclear as Trump, Xi lower tensions in first call in months\n\nTrump praised the group in an interview with Fox News, calling them prominent people and \"American patriots\".\n\n\n\n\n\n\"I think they're going to do a really good job,\" Trump said, crediting TikTok with helping build his support among young voters in the 2024 presidential election.\n\n\n\n\n\nLachlan Murdoch, the CEO of Fox Corp and chair of News Corp, recently cemented long-term control of his family's media empire that includes Fox News and the Wall Street Journal after settling a years-long legal battle with his siblings.\n\n\n\n\n\nThe family patriarch, 94-year-old Rupert Murdoch, may also be involved in the deal, Trump said.\n\n\n\nAny investment in TikTok US would come through Fox Corp, two people familiar with the matter told Reuters.\n\n\n\n\n\nThe Murdochs would not invest as individuals, nor would News Corp, parent company of the Wall Street Journal and the New York Post, these sources said.\n\n\n\n\n\nRupert and Lachlan Murdoch's news outlets attract conservative-minded audiences but they have occasionally drawn Trump's ire.\n\n\n\n\n\nTrump sued the Wall Street Journal and Rupert Murdoch for defamation over a July report that said Trump signed a 2003 birthday greeting for late financier and convicted sex offender Jeffrey Epstein that included a sexually suggestive drawing and a reference to shared secrets.\n\n\n\n\n\nThe newspaper has defended its reporting and vowed to fight the lawsuit.\n\n\n\nEllison, the co-founder of Oracle and a major Republican donor, has long been linked to a potential TikTok deal.\n\n\n\n\n\nOn Saturday, White House press secretary Karoline Leavitt said Oracle would be responsible for TikTok's data and security and that US citizens will control six of the seven seats for a planned board.\n\n\n\n\n\nTrump's administration has declined to enforce a US law enacted during his predecessor's administration requiring TikTok's divestiture over fears its US user data could be accessed by the Chinese government.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/telco-regulator-launches-investigation-into-optus-failure/gkr1a9sel",
        "title": "What penalties could Optus face after its 'second significant and egregious failure'",
        "publish_date": "Sun, 21 Sep 2025 23:57:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Optus can \"expect to suffer significant consequences\" as the telecommunications regulator launches its investigation into the network's outage, which may have led to three deaths.\n\n\n\n\n\nPeople across three states were unable to contact the triple-zero emergency line during a 10-hour outage on Optus' outage last week.\n\n\n\n\n\nCommunications Minister Anika Wells said Optus will be held accountable for the outage and has obligations to ensure emergency services calls are prioritised and go through.\n\n\n\n\n\n\"They have perpetuated a failure upon the Australian people with what has happened here. They can expect to suffer significant consequences as a result,\" Wells told reporters on Monday morning.\n\n\n\nWhat penalties could Optus face?\n\nWells said the government is working to understand the factors that led to the breach, announcing that the Australian Communications and Media Authority (ACMA) has launched an investigation into the incident.\n\n\n\n\n\n\"This is the second significant and egregious failure on the part of Optus. But also, other telecommunications providers have had triple-zero outages as well. This is not entirely a matter for Optus,\" she said.\n\n\n\n\n\nACMA chair Nerida O'Loughlin said the authority will be seeking significant information from Optus.\n\n\n\n\n\n\"We will need time to dig into what has exactly happened here,\" she said on Monday.\n\n\n\n\n\n\"We will, as the regulator, be holding Optus to account for this second outage over the last couple of years.\"\n\n\n\n\n\nO'Loughlin referenced a previous Optus outage in 2023, which prompted the then-CEO to resign and led to the company facing penalties of over $12 million.\n\n\n\n\n\n\"We didn't expect to be here again so soon, less than two years after that breach,\" she said.\n\n\n\n\n\nWhile the law doesn't allow for criminal convictions over the Optus outage, there could be financial penalties, according to O'Loughlin.\n\n\n\n\n\n\"I won't speculate on the size of penalties because they are complicated, in terms of the number of contraventions, but there are $19,000 per infringement notice, and the court can impose up to $250,000 per contravention,\" she said.\n\n\n\nOptus CEO Stephen Rue said over the weekend the company takes \"full accountability\" for the breach.\n\n\n\n\n\n\"We take full accountability for the technical failure and that we were unaware of this for ... an unacceptable gap in time.\"\n\n\n\n\n\nSpeaking to reporters in New York on Monday, Prime Minister Anthony Albanese said Optus's behaviour is \"completely unacceptable, we have made that very clear\".\n\n\n\n\n\n\"There'll be a proper investigation by the authorities and the government has action at its disposal, but the immediate concern will be that investigation.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/cost-of-retirement-on-the-rise-for-many-australians/acuunp273",
        "title": "Some Australians are not confident about their retirement. Here's how much you need a year",
        "publish_date": "Sun, 21 Sep 2025 19:38:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sydney mother of two Sinta Velasco is the breadwinner of her family at the same time as supporting elderly relatives in the Philippines.\n\n\n\n\n\nAt 45 years old, she's decades away from retirement age but is already finding the idea of saving enough to live comfortably daunting.\n\n\n\n\n\n\"As a single-income household, we've really had to think about small and big expenses. I know every dollar adds up,\" Velasco told SBS.\n\n\n\n\n\nShe's part of a growing number of Australians worried about the cost of retirement, which new research suggests is getting more expensive.\n\n\n\nSinta Velasco said she is budgeting carefully to save for retirement while caring for her ageing parents. Source: SBS News / Cameron Carr\n\nThe cost of a comfortable retirement is on the rise\n\nThe rising cost of living has seen the annual cost of a comfortable retirement climb by more than $13,000 in just five years, according to the latest Association of Superannuation Funds of Australia retirement standard.\n\n\n\n\n\nAustralian couples aged 65 and over now need more than $75,000 a year to retire, while singles need $53,000.\n\n\n\n\n\nAnalysis from AMP has uncovered that some groups are more vulnerable than others when it comes to feeling financially confident.\n\n\n\nAMP's retirement expert Ben Hillier said rising inflation has heightened concerns for people saving for retirement, especially women.\n\n\n\n\n\n\"We're seeing, unfortunately, some concerning data, especially around gender. Females are far less confident about their retirement than males,\" he told SBS News.\n\n\n\n\n\n\"Only two in five women are confident about retirement compared to three in five males. And even more concerning perhaps are those single females, especially those with children, who are amongst the lowest levels of confidence of all Australians.\"\n\n\n\nREAD MORE How much super do Australians need to retire? It could be less than you think\n\nHillier said that women are often juggling work while caring for children and, at times their own parents, more so than men.\n\n\n\n\n\n\"Quite clearly from the research, there's an unfair gender split in terms of who's carrying the most of that burden between looking after the children and also looking after the parents,\" he said.\n\n\n\n\n\n\"And of course that's going to translate into not being able to focus on the future and consequently having lower levels of confidence.\"\n\n\n\n'Sandwich generation' the least confident about retirement\n\nSinta Velasco is also a member of the 'sandwich generation', a group that cares for both children and their ageing parents.\n\n\n\n\n\nAMP data found this group of Australians in their 40s, and juggling caring for relatives, were the least confident about retiring, with less than two in five feeling financially secure.\n\n\n\n\n\nWhile her husband is out of work, her single income is stretched supporting their children as well as the couple’s parents.\n\n\n\nSource: SBS News / Leon Wang \"We look at, for example, how we can cut down on some subscriptions,\" she said.\n\n\n\n\n\n\"And just being wiser in terms of everyday decisions like eating out, cutting down on that. We're just trying to be as prudent as possible and to live below our means.\"\n\n\n\n\n\nVelasco has now lived in Australia for eight years and said it's particularly important for migrants to find social support and financial advice when it comes to retirement planning.\n\n\n\n\n\n\"I feel like if I'm stuck, I could ask professionals like financial advisors, 'these are my concerns, what do you think I should focus on?'\"\n\n\n\nWhich Australians are confident about their retirement?\n\nThe AMP research found several inequities when assessing Australians' thoughts on retirement and affordability.\n\n\n\n\n\nPartnered Australians were more confident about retiring than singles, with 60 per cent of those in relationships feeling secure compared to just 40 per cent of those not in a couple.\n\n\n\n\n\nSingle mothers were among the least confident about retiring, with less than 20 per cent of single women with children in their 40s feeling financially prepared.\n\n\n\nMeanwhile, divorced or separated women were also less confident than their male counterparts.\n\n\n\n\n\nHillier said the financial challenges facing these groups can be compounded further if they are renters and don’t own their own homes.\n\n\n\n\n\n\"A retirement can last 20, 30, even 40 years. And so being exposed to the rental market during that period of time without some sort of bedrock of property wealth behind you really makes that particular group are quite a lot more vulnerable.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/cyberattack-on-european-airports/fr7ztrpmh",
        "title": "A cyber attack has hit some of Europe's busiest airports. Here's what you need to know",
        "publish_date": "Sun, 21 Sep 2025 00:55:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Some of Europe's busiest airports including London's Heathrow have been affected by a cyber attack against a provider of check-in and boarding systems, causing flight delays and cancellations.\n\n\n\n\n\nBrussels Airport, Berlin Airport were both affected while Dublin Airport said it was also facing minor impact from the issue, along with Cork Airport, Ireland's second biggest after Dublin.\n\n\n\n\n\nAt Heathrow, Berlin and Brussels, dozens of flight departures and arrivals were cancelled, aviation data provider Cirium said. Officials in Brussels said there had been four flight diversions, as well as \"delays on most of the departing flights.\"\n\n\n\n\n\nBrussels Airport said it had asked airlines to cancel half of their scheduled departing flights on Sunday to avoid long queues and late cancellations, signalling that the disruption would continue through the weekend.\n\n\n\n\n\nThe disruption is the latest in a string of hacks targeting governments and companies across the world, hitting sectors from healthcare and defence to retail and autos. A recent breach at luxury carmaker Jaguar Land Rover brought its production to a halt.\n\n\n\nWhat was impacted in the cyberattack?\n\nThe attack affected the MUSE software made by Collins Aerospace, which provides systems for several airlines at airports globally.\n\n\n\n\n\nThe aviation tech company, which specialises in digital and data processing services, is a subsidiary of the American aerospace and defence group RTX, formerly known as Raytheon.\n\n\n\n\n\nRTX said it was aware of a \"cyber-related disruption\" to the software at selected airports, without naming them.\n\n\n\n\n\n\"The impact is limited to electronic customer check-in and baggage drop and can be mitigated with manual check-in operations,\" RTX said in a statement, adding that it was working to fix the issue as quickly as possible.\n\n\n\nPeople stand in a line to check in after the attack caused delays at Brussels International Airport. Source: AP / Harry Nakos A European Commission spokesperson said there were currently no indications of a \"widespread or severe attack\" and that the origin of the incident was still under investigation.\n\n\n\nWho was behind the attack?\n\nRTX did not give any information on who might be behind the attack.\n\n\n\n\n\nThese kinds of sweeping outages are typically the result either of ransomware attacks, where online extortionists paralyse corporate networks in the hope of payment, or deliberate digital sabotage.\n\n\n\n\n\nRafe Pilling, director of threat intelligence at cybersecurity company Sophos, said the impact of the incident highlighted \"the fragile and interdependent nature of the digital ecosystem underpinning air travel\".\n\n\n\n\"We've seen huge impact across retail and currently automotive in the UK this year,\" he said.\n\n\n\n\n\n\"The threat is significant and very real.\"\n\n\n\n\n\nSeveral breach-tracking websites have previously said that Collins Aerospace was hit by ransom-seeking hackers in 2023.\n\n\n\nAviation industry 'prime target' for cyber attacks\n\nCyber attacks and tech outages have disrupted airports around the world in recent years, from Japan to Germany, as air travel increasingly relies on online, interconnected systems.\n\n\n\n\n\nThe aviation sector saw a 600 per cent increase in cyber attacks from 2024 to 2025, according to a report by French aerospace company Thales released in June.\n\n\n\n\n\n\"From airlines and airports to navigation systems and suppliers, every link in the chain is vulnerable to attack,\" the report warned, pointing out that the strategically and economically important sector had become a \"prime target\" for cyber attacks.\n\n\n\nREAD MORE Fed up with flight delays? Passengers could soon get refunds under new scheme\n\nAviation expert Anita Mendiratta, who is also a special adviser to the secretary general of UN tourism, told Agence France-Presse it was difficult to know who was behind the attack.\n\n\n\n\n\nBut she stressed it was \"a disruption caused to a software not a specific airport\" and it was important to try to \"contain the contagion\".\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/heres-the-tea-global-shortage-means-steep-prices-for-matcha-lovers/mo2j9gaqg",
        "title": "Here's the tea: Global shortage means steep prices for matcha lovers",
        "publish_date": "Sat, 20 Sep 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"I have matcha every morning. It's actually my go-to drink. It is kind of how I start the day.\"\n\n\n\n\n\nMelissa Lindsay is a customer of Asha Tea House in San Francisco.\n\n\n\n\n\nThe owner is David Lau.\n\n\n\n\n\n\"So matcha is a stone milled green tea. It's actually a tea powder and instead of drinking an infusion of the tea leaf with hot water, you're consuming the entire leaf.\"\n\n\n\n\n\nThe GS Haly Company is one of the organisations that supplies matcha to shops like this.\n\n\n\n\n\nSenior Tea Buyer Aaron Vick says matcha has traditionally been used in Japanese tea ceremonies, but now is being mass-consumed in drinks and desserts across the globe.\n\n\n\n\n\n\"Matcha has long been an important ingredient for baked goods, for confectionary, candies.\"\n\n\n\n\n\nIn fact, matcha has been hailed as a superfood, splashed across social media in bright green lattes, and embraced by cafes from Tokyo to Los Angeles.\n\n\n\n\n\nRecently however, Aaron Vick says there have been issues brewing on the horizon: because this year’s harvest simply can’t keep up with the global craze.\n\n\n\n\n\n\"There is limited supply, not due to lack of innovation or ambition, but simply there's only so much tea grown in Japan.\"\n\n\n\n\n\nAaron says these supply issues, coupled with the popularity of matcha itself, has seen prices spike.\n\n\n\n\n\nIn fact, prices for matcha are surging worldwide, with Japanese matcha, known for its quality, set to jump by up to 70 percent this year.\n\n\n\n\n\n\"We've always been saying matcha is growing, but certainly within the last one or two years there has been exponential unprecedented growth in demand.\"\n\n\n\n\n\nDavid Lau can attest to that.\n\n\n\n\n\n\"The price has skyrocketed. For us it's more than doubled; and we weren't expecting that at all. Our matcha drinks, we sell them in the hundreds every day. And we go through many hundreds of kilograms every month or two. Yeah, it's a lot of matcha.\"\n\n\n\n\n\nLarry Tiscornia teaches traditional Japanese tea service lessons - and he has also seen a change.\n\n\n\n\n\n\"My wife and I teach privately weekly and we have students that come and learn how to do the tea ceremony. People are going at these tea stores and they're limited to like one small 20-gram can. But one year ago you could go in and buy hundreds of grams of tea. So it's very bizarre.\"\n\n\n\n\n\nThe spike in pricing is being fuelled by poor weather in Japan, as well as labour shortages in both Japan and China.\n\n\n\n\n\nThe Japanese government has been trying to help, offering support to tea growers through funding, equipment - and even counselling - to encourage a shift from regular sencha tea to matcha.\n\n\n\n\n\nSince 2008, production of tencha, the leaf used to make matcha, has nearly tripled - and exports to the US now account for about a third of Japan’s total tea exports.\n\n\n\n\n\nBut whether that's enough remains to be seen.\n\n\n\n\n\nAaron Vick says says US tariffs are adding even more pressure: there's 15 percent duties now on Japanese matcha and nearly 38 percent on matcha from China.\n\n\n\n\n\n\"The cost increases that we have been discussing up to now have been purely derived from supply and demand situation and the shortage of available leaf against the sudden extreme popularity of matcha. Additional to that, we will also certainly see an increase in price due to tariffs.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/john-santi-lays-his-brothers-remains-to-rest-after-finding-out-museum-displayed-specimens-without-consent/hl1qtneb3",
        "title": "John Santi lays his brother's remains to rest after finding out museum displayed specimens without consent",
        "publish_date": "Sat, 20 Sep 2025 21:30:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"The good memory was that he was my best friend. Not only a brother, he was my best friend when he died. I was only 13 when he died but he used to be more a confidant and I would go everywhere with him.\"\n\n\n\n\n\nMemories of a much-loved brother.\n\n\n\n\n\n\"We had some good times, even though I was so young. We used to go tenpin bowling, to the movies and that together. Even with his girlfriend he would take me along.\"\n\n\n\n\n\nDecades later the pain is still raw for John Santi.\n\n\n\n\n\n\"Because he was only 19 when he died...yeah, I miss him so much.\"\n\n\n\n\n\nJohn's brother Tony Santi died in a motorcycle accident in Tasmania in the 1970s.\n\n\n\n\n\nBut raw grief has come up again this year for John and his family.\n\n\n\n\n\nThat's when they found out his brother's brain had been removed without consent at an autopsy after his death, and kept as part of a collection at the Rodda Museum at the University of Tasmania.\n\n\n\n\n\n\"One of the hardest parts is having to rebury him, so he's been burried twice. After 50 years I had to rebury his body part. That happened about three weeks ago. We went and laid that to rest with him. That's something we should never have had to do.\"\n\n\n\n\n\nJohn Santi's brother wasn't the only person treated in this way.\n\n\n\n\n\nA Tasmanian coronial investigation recently released its final report, confirming 177 samples had been kept by the museum without permission.\n\n\n\n\n\nThe report stated that human specimens were collected, and in some cases publicly displayed, by the University of Tasmania for decades without the knowledge or consent of families.\n\n\n\n\n\nThe museum collected the remains from coronial autopsies from 1966 to 1991 for teaching and research purposes.\n\n\n\n\n\nMeg Webb is the Independent Member for Nelson in Tasmania.\n\n\n\n\n\nShe says her office has been contacted by a number of Tasmanian families affected by this situation.\n\n\n\n\n\n\"They've been re-traumatised because often the circumstances of their loved ones death was very traumatic and unpleasant in the first place and this has bought all that back to them. Then to have to go through a formal process of perhaps identifying that they are the correct relatives and then also having to make arrangements of what's going to happen with their loved ones remains, has been really gruelling. I really feel for those Tasmanian families and I don't think we've arrived at the end of the process yet because I don't think we've achieved appropriate accountability for how and why this happened.\"\n\n\n\n\n\nThe investigation, led by coroner Simon Cooper, found the handling of the remains was not in accordance with national standards, which he said were set up in 2002 but not acted upon by the Tasmanian government.\n\n\n\n\n\nIt appeared previous coroners were unaware the specimens had been distributed to the museum, coroner Simon Cooper said.\n\n\n\n\n\nHe added that the belated discovery that human remains were removed at autopsy and not returned to the body had been a source of pain and anger for many families.\n\n\n\n\n\nIt appeared one now-deceased forensic pathologist, Dr Royal Cummings, provided most of the specimens to the museum, with some of his predecessors and successors also engaged in the practice.\n\n\n\n\n\nIn the conclusion of his report Coroner Cooper said:\n\n\n\n\n\n\"The retention of human remains without family or coronial approval, or even knowledge, is an historic practice out of keeping with, and offensive to, contemporary standards and values. It is inconceivable to my mind that it would ever happen again although the fact that the practice continued for as long as it did and ended only comparatively recently is also almost equally inconceivable.\"\n\n\n\n\n\nMs Webb says she has written to the Tasmanian Attorney General asking for two specific things.\n\n\n\n\n\n\"One is a state apology to the Tasmanian families that have been impacted by this situation, and also a commitment to continue an investigation into any breach of law that occurred during this process, so that we can know about any individuals or institutions that need to be held accountable for breaking the law here. I think that that's something that the families affected deserve to know and would provide appropriate closure to this situation.\"\n\n\n\n\n\nThe remains in question were removed from public display in 2018.\n\n\n\n\n\nThe coroner's office had spent years reconciling records to determine their origin.\n\n\n\n\n\nIn January, the names of 126 people whose specimens had been identified were published online and family members urged to come forward.\n\n\n\n\n\nThe coroner said 100 specimens had been identified and disposed of in line with the wishes of families.\n\n\n\n\n\nDr Sally Wasef is a forensic research fellow in Paleogenetics at the Queensland University of Technology.\n\n\n\n\n\nShe says institutions now need ethical clearance and clear permission to obtain human remains, but this hasn't always been the case.\n\n\n\n\n\n\"I think it was common practice in the olden days that people would think that they can keep some of the remains because they are either colonial or unidentified. That would give them the rights to keep them for research on scientific purposes. I think they can justify to themselves that you know they are benefiting the community and they're not doing any harm basically and allowing medical students or other researchers to have a go to advance a cure, or look more into diseases or cause of death. Even if it's good intentions, it's not the right way of doing things, it's unethical.\"\n\n\n\n\n\nDr Wasef says there are now clear national standards introduced in 2001 about how human remains can be obtained for medical research.\n\n\n\n\n\n\"Most of the universities now have what is called body farms which is basically a specific location inside the universities where there are bodies that have been donated by the person before their death to research. And they do all of the research based on those remains that have been donated for the purpose.\"\n\n\n\n\n\nDr Wasef also works closely with Indigenous communites helping them to identify human remains that were stolen in previous decades and centuries - when such practices were widespread.\n\n\n\n\n\nLike John Santi, Dr Wasef says the Indigenous communities affected want to see their ancestors laid to rest once and for all.\n\n\n\n\n\nMany of those remains are still being held in museums in Australia and other parts of the world.\n\n\n\n\n\n\"Indigenous Australians believe that the remains are not going to rest if they are in the wrong country which means you have to specifically identify the right community that you return those remains to.\"\n\n\n\n\n\nDr Wasef says the unauthorised collection of human remains - whether those of close relatives or those of people who have been dead for thousands of years - is not only a legal and ethical issue.\n\n\n\n\n\nShe believes for some individuals and cultures it's also a spiritual one.\n\n\n\n\n\n\"I am originally Egyptian and it hurts me every time I see a mummy displayed because this defeats the purpose of mummification. Mummification was meant to give those people an afterlife and we take them off place and display them. That's how I feel every time I see those mummies displayed.\"\n\n\n\n\n\nCloser to home, Meg Webb wants says the Coroner's report is really just a starting point for investigating further what has occurred in Australia.\n\n\n\n\n\n\"There's probably a need here for a wholesale review in every state of Australia to look at whether there are still instances where there's been inappropriate handling and storage and perhaps display of people's remains without consent and to really dig out how that's occurred and put measures in place to ensure it cannot happen again.\"\n\n\n\n\n\nJohn Santi also wants to see more done to make sure people don't have to go through what has happened to his family.\n\n\n\n\n\n\"I'm just glad my mum and dad have passed (died) so they didn't have to go through all this\"\n\n\n\n\n\nThe University of Tasmania’s Deputy Vice-Chancellor for Health Professor Graeme Zosky, has said in a statement the University is deeply sorry for the sadness and hurt felt by family members affected.\n\n\n\n\n\nUniversity staff had also met personally with many families seeking further information, and the university is also carefully considering the Coroner’s report to determine any further actions.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-quite-simple-way-this-group-of-australians-could-save-lives/dx9i8syah",
        "title": "The 'quite simple' way this group of Australians could save lives",
        "publish_date": "Sat, 20 Sep 2025 05:39:43 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Australia is facing a critical shortage of registered stem cell donors — and the solution lies with younger Australians, according to the Leukaemia Foundation.\n\n\n\n\n\nThe group estimates that around 1,000 people in the country are \"urgently\" waiting for a suitable donor match to help treat diseases like blood cancer.\n\n\n\n\n\nBill Stavreski, the head of research at the Leukaemia Foundation, said stem cells can be the sole option for many people with serious illnesses.\n\n\n\n\n\n\"They have a critical and urgent disease, whether it is leukaemia or lymphoma, and for many, this is the only treatment possible,\" he told SBS Macedonian.\n\n\n\nRelying on overseas donors\n\nStavreski said that people spending long times on waitlists face \"detrimental\" health outcomes.\n\n\n\n\n\n\"The majority of unrelated donors for Australians who are having a stem cell transplant or waiting for a stem cell transplant are relying on overseas donors. Now, that is quite critical for many who are on the wait list or about to have a stem cell transplant,\" he said.\n\n\n\n\n\n\"The current number of people registered, at approximately 65,000, is just not enough.\"\n\n\n\nREAD MORE Melanie was sceptical of this underutilised cancer treatment. It saved her life\n\nWhile other countries have stem cell donation programs in schools, hospitals and workplaces, that's lacking in Australia, Stavreski said.\n\n\n\n\n\n\"Each year, more than 2000 stem cell transplants are undertaken, and unfortunately, we're relying too much on overseas donors. And there are also those where donors cannot be found.\"\n\n\n\n\n\nHe encouraged all Australians to donate, and emphasised that one group could be particularly helpful.\n\n\n\n\n\n\"Young Australians are really the key part here in terms of stem cells, the healthiest and the most populous stem cells are when you are between 18 to 35,\" he said.\n\n\n\nWhat's it like donating stem cells?\n\nStavreski said there are misconceptions about donating stem cells, as some people may have an outdated understanding of how the procedure works.\n\n\n\n\n\n\"In the past, the stem cells were taken from the hip bone. That's no longer the case; there isn't the pain that comes along with it,\" he said.\n\n\n\nLISTEN TO Engineered stem cells breakthrough could save lives SBS News 03:20 English\n\nHe explained that stem cell donations are not as invasive as they used to be and are now \"quite simple\".\n\n\n\n\n\n\"It is like donating blood from one arm. The blood will come out, a machine will separate the cells, and the remaining blood will go through to the other arm. It only takes 30 minutes to 60 minutes for the entire process,\" he said.\n\n\n\n\n\n\"You don't need any other needles or any anaesthetic.\"\n\n\n\nDiverse donors needed\n\nWhen determining which stem cells will be most effective in treatment, ancestry plays an important role.\n\n\n\n\n\nCurrently, most donors are of Western European descent, which could mean patients from other nationalities and First Nations backgrounds miss out.\n\n\n\n\n\n\"What is important, and to really reflect what the population is in Australia, is that we need donors from all ancestries,\" Stavreski said.\n\n\n\n\n\n\"It's important that the stem cells are a match. So in terms of using stem cells from other donors, if it's not a perfect match, well then the transplant just cannot happen.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-some-australian-parents-are-giving-their-kids-as-much-as-200k/3ljc87ncz",
        "title": "Why some Australian parents are giving their kids as much as $200k",
        "publish_date": "Sat, 20 Sep 2025 01:22:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Young Australians are asking relatives for financial assistance more often to help get onto the property ladder and tackle \"front of mind\" cost-of-living pressures.\n\n\n\n\n\nNew data from economists at UBS found 20 per cent of Australians gave money to a family member over the last 12 months, the highest number since the research survey began six years ago.\n\n\n\n\n\nOf those tapping the bank of mum and dad for cash, just over half received $5,000 for general expenses, while one in four asked for as much as $200,000 to buy property.\n\n\n\n\n\nThe surge in family lending follows new first-home buyer assistance from the federal government , as UBS predicts a rise in house prices of around 3 per cent over the next year.\n\n\n\nIntergenerational wealth\n\nUBS economist Stephen Wu said family help has been pretty key for younger Australians hoping to get a leg up in the property market.\n\n\n\n\n\n\"Australia is a very wealthy country by some metrics, amongst the wealthiest in the world and we know that a lot of that wealth is tied up in housing,\" he told SBS World News.\n\n\n\n\n\n\"A lot of these older Australians, so parents and grandparents are actually moving some of this wealth and providing it to their family and members, their children and their grandchildren, such that they are able to meet cost of living pressures and also to get a foot in the housing market.\"\n\n\n\n\n\nWu explained that this intergenerational wealth transfer is becoming more common.\n\n\n\n\n\nIn the meantime, the cost of living has become less of a concern for Australians.\n\n\n\n\n\n\"We know that income growth has been quite strong. We know that inflation is easing and it's within the RBA's inflation target band,\" Wu said.\n\n\n\n\n\n\"That means that real wages are growing again. So I think there is quite a good sign that the worst is behind us and we're going to see for those younger Australians, this boost to real incomes helping to alleviate cost of living pressures.\"\n\n\n\nLISTEN TO The bank of mum and dad helping first home buyers, & investors look to US Federal Reserve SBS News 14:22 English\n\nHowever, with property prices predicted to rise, there could be economic angst for some.\n\n\n\n\n\n\"Obviously, there is a lot of wealth in the country and those who are lucky enough to actually get that [family] support are going to be quite grateful. But not everyone is going to be quite so lucky,\" Wu said.\n\n\n\nFirst home buyer scheme\n\nThe federal government will expand its Home Guarantee Scheme in October , which allows eligible buyers to purchase with a five per cent deposit and no lender's mortgage insurance.\n\n\n\n\n\nThe scheme will also remove income and place limits and raise property price caps across most regions.\n\n\n\n\n\nBut as more first-home buyers take advantage of the boosted scheme, demand will also rise, pushing about 100 suburbs outside the scheme's caps by the end of the year.\n\n\n\n\n\nPrice caps in Sydney will lift from $900,000 to $1.5 million, Melbourne from $800,000 to $950,000 and Brisbane from $700,000 to $1 million.\n\n\n\n\n\nAdelaide, Perth and Hobart's caps will increase from $600,000 to $900,000, $850,000 and $700,000, respectively.\n\n\n\n\n\nDarwin's cap will remain unchanged at $600,000, while the ACT will have its cap increased from $750,000 to $1 million.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/technology/optus-to-face-significant-consequences-over-fatal-outage-20250922-p5mwuh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Albanese says he’d be surprised if Optus boss wasn’t considering his future",
        "publish_date": "Mon, 22 Sep 2025 12:04:08 +1000",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "Prime Minister Anthony Albanese said he would be “surprised” if Optus chief executive Stephen Rue was not considering resigning from his position after last week’s fatal Triple Zero outage linked to multiple deaths.\n\nRue was formerly the chief executive of NBN Co, and joined Optus in November 2024 promising to stabilise the company and rebuild customer trust after Optus suffered a major data breach in 2022 and then a nationwide outage that cut millions of Australians off from Triple Zero in 2023.\n\nPrime Minister Anthony Albanese speaking in New York. Credit: Dominic Lorrimer\n\nWhile Rue has been in the job for less than a year, Prime Minister Anthony Albanese said on Monday morning that he expected the chief executive to be considering his position.\n\n“Optus has obligations, as do other communications companies, and clearly they haven’t fulfilled the obligations that they have,” Albanese told the ABC from New York.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-australian-recognition-of-palestine-comes-into-effect-trump-arrives-in-arizona-for-kirk-memorial-20250922-p5mwtq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Australian recognition of Palestine met with mixed reaction; Trump addresses crowd of thousands at Kirk memorial",
        "publish_date": "Mon, 22 Sep 2025 12:03:29 +1000",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Businesses have been challenged by the Reserve Bank governor to do their own bit to lift Australian productivity.\n\nGiving evidence to a parliamentary inquiry this morning, Michele Bullock was asked about the country’s poor productivity performance over the past two decades. Productivity levels are around where they were in 2016.\n\nBullock said while governments had a role to play in improving productivity, the business sector also had to lift its game.\n\n“Businesses have to step up as well,” she said. “Australian businesses haven’t had the dynamism that other industries overseas [have had].”\n\nMichele Bullock, governor, Reserve Bank of Australia today. Credit: Alex Ellinghausen\n\nOne complaint about productivity has been the increase in government spending in so-called “non-market” sectors which include health and education. It was a key feature of the federal government’s recent three-day economic roundtable.\n\nBut Bullock pushed back at linking government spending and productivity levels.\n\n“I don’t think you can make a correlation between more public spending in these areas [as] bad,” she said.\n\nThe bank’s chief economist, Sarah Hunter, noted one of the biggest falls in productivity in recent years had occurred in the mining sector.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/the-moutai-barometer-chinese-economy-feels-sting-of-booze-ban-for-elite-20250917-p5mvuv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The ‘Moutai barometer’: Chinese economy feels sting of booze ban targeting elite",
        "publish_date": "Mon, 22 Sep 2025 12:00:18 +1000",
        "category": "finance",
        "authors": [
            "Lisa Visentin"
        ],
        "text": "In Renhuai city, home of China’s famous firewater liquor Moutai, the once-raging alcohol industry is in the grips of an economic hangover. Sales people are leaving in droves and small distilleries have gone bust, locals say, following a government booze ban that has targeted China’s elite.\n\nChinese officials and businessmen who love to banquet have stopped raising their glasses of Moutai after the government imposed an alcohol ban as part of an anti-corruption drive that directed them to live frugally on the public dime.\n\nBut the edict has ushered in austere times for a food and beverage sector already struggling with an economic downturn. It has also hobbled the government’s own efforts to get people to spend more to boost the economy, and has helped drag down the price of Moutai.\n\nA giant sculpture of a Kweichow Moutai bottle near the Yanjin River in Maotai Town, Renhuai City. Credit: Sanghee Liu\n\nOfficially known as Kweichow Moutai, after the top distillery that manufactures it, the liquor is the premium version of the throat-stripping, sorghum-based spirit called baijiu and is renowned for its 53 per cent alcohol potency.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/there-will-be-more-outages-like-optus-as-tech-runs-the-world-20250922-p5mwuc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "There will be more outages like Optus’ as tech runs the world",
        "publish_date": "Mon, 22 Sep 2025 11:59:48 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The complexity of the modern IT systems used by the bigger companies and their vulnerability to human errors, whether in the entering of data, the underlying coding or the execution of an upgrade, means they will never be 100 per cent reliable. Loading The challenge for those responsible for them is to minimise the number of “events” and the degree of damage or disruption they might cause, and having the processes in place to respond as appropriately and quickly as possible when they do occur. Optus, it would seem, doesn’t have foolproof processes in place, given the delays between when customers tried to alert the company that there was a problem, the time it took for the issue to be escalated to senior managers, the problems the company experienced in extracting records from its systems so that welfare checks could be made to the callers, and the time it took for Optus to notify the authorities and the public. The moment its call centres started receiving calls saying there was an issue with the Triple Zero network, someone senior should have been notified. Optus’ chief executive Stephen Rue says that will now be the protocol. Better late than never, although that’s no consolation for the families of those who died while trying to contact emergency services.\n\nThere will be plenty of post-mortems of exactly how the outage occurred, with blame and criticism distributed and, no doubt, financial consequences for the company. Loading It should be noted, however, that the Triple Zero system has essentially been outsourced to private companies – the three major telcos – who are supposed to support it with investment, staff and processes. They may, or may not, adequately resource or focus sufficient attention on what is a not-for-profit service. Whether it is the banks and their anti-money laundering responsibilities, or the telcos and their Triple Zero services, these companies are being asked to collectively invest billions of dollars to provide community services and are then fined heavily, suffer immense damage to corporate and personal reputations and position if their technology or processes fail. Something similar could be said about the inability of some of our biggest companies’ technology to cope with their employees’ remuneration arrangements. “Wage theft” at the big company level relates more to the inability of IT systems to cope with the complexities generated by multiple awards, different shifts and individual pay arrangements than it does to deliberate underpayment.\n\nThe government and community may be asking more of major companies than they, or the available technology, can deliver. There’s an assumption, which we all know is wrong, that the technology will always work perfectly. There’s an assumption, which we all know is wrong, that the technology will always work perfectly. Given that no-one can guarantee that these big technology platforms will never experience malfunctions (it is almost guaranteed that they will) the community service obligations attacked to their licences to operate are poisoned chalices. The consequences of failure, however, ought to provide the motivation to do everything possible to try to minimise the number and magnitude of the damaging events they experience, and the regularity of these incidents within the sector ought to mean that their executives have a pretty good handle on where the vulnerabilities in their systems and processes are. In Optus’ case, a series of issues – it was also hit by a massive cyberattack in 2022 where nearly 10 million customers’ data was exposed – raises the question whether its Singaporean parent has invested sufficiently in the resilience of its Australian infrastructure and, given that Rue pointed to a failure of processes, whether the local management has responded adequately to the lessons it should have learned from its 2023 outage.\n\nThe fact that Telstra and Vodafone have also had major outages, however, says that more investment and/or more robust processes aren’t necessarily the complete solution, although they would presumably help. Last year, computers around the world that were running Microsoft’s Windows software crashed after an update was rolled out by cybersecurity firm Crowdstrike Falcon. Globally, companies are increasingly reliant on a handful of providers for their cybersecurity and their data storage. In future, another layer of vulnerability and dependency will be added as artificial intelligence becomes more embedded in companies’ systems. The Optus’ experience isn’t unique and probably won’t be the last outage or technology-related crisis within a big Australian organisation.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/tammy-hembrow-thanks-fans-for-their-support-following-divorce-announcement-20250624-p5m9v6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tammy Hembrow thanks fans for their support following divorce announcement",
        "publish_date": "Mon, 22 Sep 2025 11:53:39 +1000",
        "category": "finance",
        "authors": [],
        "text": "Tammy Hembrow thanks fans for their support following divorce announcement\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/author-shares-simple-strategies-to-improve-your-wellbeing-20250922-p5mwyg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Author shares simple strategies to improve your wellbeing",
        "publish_date": "Mon, 22 Sep 2025 11:51:03 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Author shares simple strategies to improve your wellbeing\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/structurally-unsound-with-views-like-these-bidders-happy-to-spend-1-47m-20250922-p5mwvn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Structurally unsound? With views like these, bidders happy to spend $1.47m",
        "publish_date": "Mon, 22 Sep 2025 11:41:17 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A structurally unsound house in need of a million-dollar renovation has sold for nearly $400,000 above reserve after a local family outbid developers to claim a rare slice of Stafford Heights.\n\nSet on a 1174-square-metre block – one of the last of its size in the suburb – the four-bedroom postwar cottage at 85 Pangeza Street triggered a six-way bidding war on Saturday, with the buyers paying $1.475 million.\n\nIt marks the home’s first change of hands in almost 50 years.\n\nThe selling agent said buyers valued the block’s sheer size and its city views. Credit: Domain\n\nBidding kicked off at $1 million and crawled in $25,000 increments until the home was called on the market at $1.1 million – near the reserve.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/sydney-home-seller-s-reno-pays-for-itself-and-more-in-1-25m-payday-20250922-p5mwvf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney home seller’s reno ‘pays for itself’ and more in $1.25m payday",
        "publish_date": "Mon, 22 Sep 2025 11:36:10 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A fresh renovation of a one-bedroom apartment in Cremorne lifted the sale price for the vendors by $400,000 to $1.25 million compared to a $850,000 offer late last year in its original condition.\n\nThe one-bedroom turnkey apartment at 501/221 Ben Boyd Road has panoramic views of Middle Harbour and a parking spot.\n\nSix buyers registered, and four actively bid for the Sydney pad guided at $1,050,000. Bidding opened at $1 million, jumped to $1.15 million, then rose in $10,000 strides above its $1,155,000 reserve until it sold under the hammer for $1.25 million.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/nrl-around-the-clubs-finals-week-three-20250922-p5mwud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Being a sook’: Panthers duo shrug off injury worries ahead of Broncos showdown",
        "publish_date": "Mon, 22 Sep 2025 11:33:00 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Billie Eder"
        ],
        "text": "Penrith’s Liam Martin and Casey McLean insist they will be fit to play in Sunday’s grand final qualifier against Brisbane after being forced from the field in the Panthers semi-final thumping of Canterbury.\n\nMartin was in obvious discomfort after he was tackled by former teammate Viliame Kikau, with the NSW and Kangaroos star staying down and struggling to breathe late in the contest.\n\nThe 28-year-old came from the field and struggled to make his way up the Accor Stadium tunnel at one point, but he was in good spirits soon afterwards and said he was not concerned about any recurrence of a rib cartilage injury he carried through last year’s finals.\n\n“They’re all right now,” Martin said of his ribs after full-time.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/bulldogs-buku-khamis-requests-trade-to-carlton-20250922-p5mwxd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bulldogs’ Buku Khamis requests trade to Carlton",
        "publish_date": "Mon, 22 Sep 2025 11:33:00 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "Western Bulldogs utility Buku Khamis has told the club he wants to be traded to Carlton as he seeks more opportunities to play senior football.\n\nThe 25-year-old, who has played 41 matches since making his debut in 2021, attracted interest from the Blues, who are looking to bring in support for defensive pillar Jacob Weitering after losing free agent Jack Silvagni to St Kilda.\n\nThe Bulldogs are open to discussing a trade with Carlton, according to two competition sources with knowledge of the situation, but as a contracted player who adds depth to their list at either end of the ground, they are expected to drive a hard bargain before releasing Khamis.\n\nLachlan McNeil (left) and Buku Khamis of the Bulldogs celebrate a goal. Credit: AFL Photos via Getty Images\n\nCarlton have made it clear they will be active in this year’s trade period as they try to add speed and class to their line-up. They have said key forward Charlie Curnow is a required player, but the contracted forward is keen to make a fresh start at either Geelong, Gold Coast or Sydney.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/woman-pays-1-6m-for-two-bedder-in-melbourne-s-most-liveable-suburb-20250922-p5mwvk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woman pays $1.6m for two-bedder in Melbourne’s ‘most liveable’ suburb",
        "publish_date": "Mon, 22 Sep 2025 11:27:55 +1000",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "The home was well-maintained and had a deeper block than similar terraces in the area, said Daniel. “It also had a Dutch-inspired renovation in the kitchen and just lots of potential,” he added. Daniel said the Fitzroy North market is performing well, and turnkey properties are popular. Fitzroy North was this year crowned the most liveable suburb in Melbourne by the PwC CityPulse 2025 report, based on its safety and closeness to education, health and other essential services. The property was one of 1246 scheduled to go to auction in Melbourne last week. By Saturday evening, Domain Group recorded a preliminary auction clearance rate of 73.2 per cent from 930 reported results throughout the week, while 78 auctions were withdrawn. Withdrawn auctions are counted as unsold properties when calculating the clearance rate.\n\nIn St Kilda, a double-level terrace that sits above the converted circa 1930s Kingsclere mansion sold at auction for its reserve price of $1.15 million. The home at 30/44 Fitzroy Street had a price guide of $1.1 million to $1.2 million. The property, which features city views, is in a “premium bayside location” close to Albert Park Lake and St Kilda Beach, said selling agent Peter Perrignon from Belle Property, South Yarra. Two bidders took part in the auction: a young man who had returned from overseas and a young married couple looking for their first home.\n\nLoading “Bidding opened at $1.1 million, then rose to $1.15 million. The young couple had hit their ceiling and didn’t want to go any further, so it was sold to the young man,” Perrignon said. The sellers were investors who purchased the property 25 years ago, renting it out to one tenant for 20 years. “That shows how much he loved the place,” Perrignon said. Like many inner-city areas, the St Kilda market is showing more movement, Perrignon said.\n\n“The auction rate has picked up, and the number of buyers getting ready for the upcoming [First Home Guarantee scheme expansion] or trying to get in before … it is definitely having an impact,” he said. In Thornbury, a renovated three-bedroom family home was sold at auction for $1,485,000 to a downsizing couple from Kew. The residence at 295 Gooch Street was guided between $1,425,000 to $1,475,000 and had a reserve of $1,475,000. The vendors, a family of three looking to upsize, had bought the home seven years ago and had done a “nice renovation”, said selling agent Nigel Harry from Jellis Craig Northcote.\n\nLoading The upgrade included whitewashed timber floors, a bright and open-plan living area, an entertainer’s deck, and landscaped gardens. The auction took place in front of a modest crowd of 15 to 20 people, opening with a bid of $1.425 million. “Between the school holidays and bad weather, I don’t think many people wanted to come out for the auction,” said Harry. The bidding rose in increments of $10,000 until it hit the selling price of $1,485,000.\n\n“The successful bidders, a downsizing couple, were moving to be closer to their adult children, and the allure of buying something they could move right into was really appealing,” Harry said. “The underbidder was at the other end of the equation, they were a young family looking to upsize and to move out of a townhouse into their first house,” he added. Diaswati Mardiasmo, chief economist at PRD, said the Melbourne market is holding stable. “The unemployment rate is stable, wage growth is stable, everything in the economy is stable at the moment, which is why we aren’t seeing a higher auction clearance rate,” she said. The main factors influencing this, Mardiasmo said, could be the upcoming federal government’s Home Guarantee scheme, which expands on October 1.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/ponting-calls-on-australia-to-make-big-batting-call-for-ashes-20250922-p5mww7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ponting calls on Australia to make big batting decision for Ashes",
        "publish_date": "Mon, 22 Sep 2025 11:18:37 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Ricky Ponting says Australia should consider moving vice-captain Travis Head up to No.3 to get on the front foot against England for the Ashes, allowing all-rounders Cameron Green and Beau Webster to bat alongside each other at five and six.\n\nAustralia’s top six is far from settled a couple of months out from the first Ashes Test, with the selectors wanting to take a look at the early rounds of the Sheffield Shield before making up their minds.\n\nRicky Ponting and Justin Langer. Credit: Getty\n\nLooking back at his own career, Ponting said that after an apprenticeship in the middle order, senior players should be looking to move up higher, and suggested that Head’s aggressive approach would get the hosts off on the right foot against England.\n\nHe also suggested that Sam Konstas should keep his spot at the top of the order alongside Usman Khawaja following a century for Australia A in India last week.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/a-carlton-wine-room-owner-is-now-running-this-popular-backstreet-pub-20250919-p5mwho.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A Carlton Wine Room owner is now running this popular backstreet pub",
        "publish_date": "Mon, 22 Sep 2025 11:00:00 +1000",
        "category": "finance",
        "authors": [
            "Besha Rodell"
        ],
        "text": "Advertisement\n\nEating outJust open A Carlton Wine Room owner is now running this popular backstreet pub But he doesn’t want to fancy things up. The goal is to create a relaxed vibe like “a country pub that’s landed in the middle of Carlton”. Besha Rodell September 22, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nWhen the Brandon Hotel in Carlton North announced that it would be closing last month, punters were worried. Having lost the nearby Dan O’Connell hotel a few years back – and with many other neighbourhood pubs closing or morphing into fancier, trendier venues – losing the slightly daggy, wonderfully low-key Brando felt like a gut punch. Andrew Joy, one of the new owners of the Brandon Hotel in Carlton North. Simon Schluter Last week, the pub’s Instagram page began showing signs of life, and last Tuesday, the creaky old doors reopened under new operators. They are Andrew Joy of the hatted Carlton Wine Room and Cameron McIntyre, a builder who has worked on many pubs in the inner city, including the nearby Royal Oak and Union House in Richmond. So far, the changes are confined to food and drink. The menu has been pared back significantly. There are sausage rolls, a burger, a parma and a couple of heftier options. Beer and wine options have changed. For now, there are six whites, six reds, a rose and a sparkling. Everything is $12 a glass. Related Article Hold our beer, the pub is back. Here are Melbourne’s 20 best right now\n\nAdvertisement\n\nAnd while Joy and McIntyre do plan to eventually give the space a refresh, they’re holding off while they figure out what people want from this corner pub. “We’re looking at the current pub scene, and we want to respect what the building is and what locals want,” Joy says. “Yes, I want it to look nice. But we want to live with it for a bit before we change it.” Much of what they’ve done is remove, rather than add, things. “We’ve already taken a look at the facade and realised that there’s beautiful tile under all this paint.” Joy emphasises that he wants the venue to be somewhere people can come for a cheap meal or just a beer.\n\nAdvertisement\n\nA new chef will be on board in the next few weeks, but the food won’t be fancy. “I just want pub classics done exceptionally well,” he says. “I’m from the country – I want it to feel like a country pub that’s landed in the middle of Carlton,” he says. “I want to see people playing cricket in the street outside.” Lunch Fri-Sat; dinner daily 237 Station Street, Carlton North, brandonhotel.com.au\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/travel-news/the-new-ships-cruising-europe-s-rivers-20250701-p5mbj6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The new ships cruising Europe’s rivers",
        "publish_date": "Mon, 22 Sep 2025 10:57:38 +1000",
        "category": "finance",
        "authors": [
            "Brian Johnston"
        ],
        "text": "Advertisement\n\nTravel newsRiver cruises The new ships cruising Europe’s rivers Brian Johnston September 22, 2025 — 10:57am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nIt seems none of us tire of Europe’s waterways. In fact, to judge from a flotilla of stylish new ships about to set sail, more of us than ever will soon be afloat on the continent’s culture-packed waterways. Avalon Envision. Among new ships this year are Riviera Rose and AmaSintra on the Douro in Portugal, Riviera Radiance and SS Elisabeth on the Danube, and Spirit of the Moselle and Amadeus Amara on Rhine-Danube routes. Scenic recently overhauled its river ship interiors with new layouts, new furnishings and transformations of their deck, lounge and dining areas. Now Avalon Waterways is in the middle of its own two-year refresh. Emerald Cruises too has been upgrading its entire eight-vessel Europe fleet this year, including redesigns of areas such as its Horizon Lounge and pool/cinema space, and the replacing of textiles and artworks.\n\nAdvertisement\n\nBrand-new ships this year include four 190-guest vessels from Viking Cruises on the Rhine, Main and Danube. Also, the company’s 168-guest Viking Nerthus floats out on the Seine in France and Viking Gyda on the Douro. Several more Viking ships are coming next year. APT Solara. APT Solara and APT Ostara have also arrived down the slipways. The 154-guest ships feature six dining venues – the most on any European river ship – as well as a spa, gym and hair salon. Both will be offering itineraries on the Rhine and Danube such as the ever-popular 15-day Magnificent Europe itinerary between Amsterdam and Budapest. There are more river ships coming in 2026, too. In the premium category, Emerald Cruises launches the 180-guest Emerald Astra on itineraries along the Rhine, Moselle and Danube, while the 182-guest Travelmarvel Rigel will sail a new eight-day Rhine-Moselle itinerary for Travelmarvel between Amsterdam and Basel in Switzerland. Jostling for space on the Danube will the 154-passenger SS Emilie from Uniworld, which is celebrating its 50th anniversary in 2026. Uniworld’s ships are known for their striking decor and this time Austrian artist Gustav Klimt is the inspiration, so expect green and yellow hues and a sparkle of gold. The ship is named for Klimt’s partner and muse Emilie Floge.\n\nAdvertisement\n\nMeanwhile two 130-guest ships will be joining the Tauck fleet in France: MS Serene on the Seine and MS Lumiere on the Rhone. Both will have a sun deck with swimming pool, wellness area and larger than usual suites. In good news for solo travellers, single supplements will be waived across all Category 1 cabins. And finally in 2027 – not as far away as you might think – three more as yet unnamed Uniworld ships are coming to the Rhine, Danube and Douro rivers. And in big news, Celebrity Cruises, until now only an ocean cruise company, will be launching a whole new river-cruise endeavour. Details are slim, but 10 ships are on order that will operate on the world’s rivers, with the first few tipped to sail out in Europe.\n\nSign up for the Traveller newsletter The latest travel news, tips and inspiration delivered to your inbox. Sign up now.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: River cruises\n\nAmsterdam\n\nCruises Brian Johnston seemed destined to become a travel writer: he is an Irishman born in Nigeria and raised in Switzerland, who has lived in Britain and China and now calls Australia home.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/turn-4-days-leave-9-011616478.html",
        "title": "How to turn 4 days leave into 9 in October",
        "publish_date": "2025-09-22T01:16:16Z",
        "category": "sports",
        "authors": [],
        "text": "Aussies are eagerly awaiting their next long weekend where they can head to the beach, kick their feet up and relax.\n\nAnd it’s not too far away, with the weather warming and the early October long weekend imminent for some states and territories, while others are set to miss out completely.\n\nWhen is the October long weekend?\n\nThe October long weekend is from Friday, October 3 to Monday, October 6.\n\nWho will get the public holiday?\n\nSouth Australia, New South Wales and the ACT will receive the Labour Day public holiday on Monday October 6, with the same day serving as the King’s Birthday public holiday for residents in Queensland.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nUnfortunately, those in the Northern Territory, Victoria and Western Australia are not set for a public holiday.\n\nThe King’s Birthday long weekend will fall on October 3-6, but only SA, NSW and ACT will be the beneficiaries. Picture: NewsWire / Nikki Short.\n\nWhy does the King’s Birthday differ between states?\n\nWhile most of the country observes the King’s Birthday in June, Queensland instead celebrates the day in October.\n\nThis is to ensure a more evenly distributed spread of public holidays across the year, and has been the case since 1983.\n\nWestern Australia also celebrates the King’s Birthday outside of June, but instead reserves the occasion for September.\n\nDoes everyone get AFL grand final Friday off?\n\nSadly no.\n\nThe public holiday preceding Aussie Rules’ season ender is reserved strictly for Victorians, who will enjoy the Friday September 26 off, before all eyes will be on the Melbourne Cricket Ground on Saturday September 27.\n\nWhile Victorians won’t get a day off on October 6, they’ll be the only state to benefit from a public holiday the day before the AFL grand final on September 26. Picture: NewsWire/Nadir Kinani.\n\nHow to make the most of annual leave\n\nResidents in South Australia, NSW and ACT will be able to maximise time off with some strategically planned annual leave ahead of time.\n\nEmployees could receive as much as nine days off between October 4 and 12 with four days of annual leave taken from October 7-10.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/outage-outrage-optus-leaders-future-173000939.html",
        "title": "Confidence shaken: telco will face serious consequences",
        "publish_date": "2025-09-22T00:57:22Z",
        "category": "finance",
        "authors": [],
        "text": "Optus will be held accountable after a serious triple-zero outage, as the role of private companies in delivering emergency calls is reconsidered.\n\nPressure is continuing to mount on the telco giant after it experienced a major outage that has been linked to up to four deaths, including that of a newborn baby.\n\nIt's the second time in two years an Optus network issue has prevented Australians from accessing the emergency line, fuelling anger over its failure to implement the recommendations from a review into the first major outage.\n\nOptus boss Stephen Rue says action will be taken \"to ensure that this does not happen in future\". (Lukas Coch/AAP PHOTOS)\n\nFederal Communications Minister Anika Wells said Optus would face the consequences of its actions.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"This is the second significant and egregious failure on the part of Optus,\" she told reporters on Monday.\n\n\"They have perpetuated a failure upon the Australian people with what has happened here, and they can expect to suffer significant consequences.\"\n\nOptus was slapped with more than $12 million in penalties after its first outage and could be subject to similar fines again, communications watchdog chair Nerida O'Loughlin said.\n\nThe Australian Communications and Media Authority is investigating the latest incident and could also seek commitments from Optus to improve its processes.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThursday's outage, which Optus only publicised late on Friday, came 18 months after rival Telstra also failed to comply with emergency call rules during a triple-zero network disruption.\n\nCommunications Minister Anika Wells says the confidence of the Australian people has been shaken. (Mick Tsikas/AAP PHOTOS)\n\nAsked about private companies' responsibility for delivering emergency calls, Ms Wells said she would need to review the issue.\n\n\"This isn't entirely a matter for Optus,\" she said.\n\n\"We are now considering what needs to be done holistically or as part of legislative relief for the Australian people, given their confidence has been shaken.\"\n\nOptus has also been the subject of ire for a lack of timely and accurate communication over the outage.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMs Wells said she received an email about the outage affecting 10 calls on Thursday afternoon.\n\nHer office received no further information until 24 hours later, when it was told the outage had affected 600 calls.\n\nIt wasn't until the department had gotten in contact that she found out about the deaths.\n\nThis was not the first time Optus customers have experienced an unplanned outage. (Joel Carrett/AAP PHOTOS)\n\nOptus chief executive Stephen Rue is facing calls to resign after revelations that a third of the 18 review recommendations stemming from the 2023 outage are yet to be implemented.\n\nSpeaking from New York, Prime Minister Anthony Albanese said Optus's behaviour was \"completely unacceptable\".\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nFederal Liberal MP Tim Wilson raised questions about Optus's overseas call centres, including whether they were the ones managing triple-zero calls or if they had received initial complaints from customers about the network not working.\n\nEarly investigations into Thursday's incident appeared to show that established processes were not followed.\n\nA botched firewall update blocked hundreds of triple-zero calls from Optus customers in South Australia, Western Australia and the Northern Territory.\n\nMr Rue leaned on an independent investigation into the incident when asked how Optus could be trusted in the future.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"We will make the facts public, and I can assure you, we will be implementing everything,\" he said.\n\nA couple of customers contacted Optus on Thursday morning to warn it the service wasn't working. (Erik Anderson/AAP PHOTOS)\n\nTwo customers contacted Optus call centres early on Thursday morning, before the outage was fixed after more than 13 hours.\n\nA review uncovered three more calls over the issue but \"red flags\" were not raised because call volumes were normal, Mr Rue said.\n\nAn eight-week-old boy from Gawler West, north of Adelaide, was among the deaths linked to the fault.\n\nBut SA Police cautioned the outage was \"unlikely to have contributed\" to the boy's death because his grandmother immediately used another phone to contact triple zero after her initial call failed.\n\nThe other deaths included a 68-year-old woman from the Adelaide suburb of Queenstown, a 74-year-old man from the Perth suburb of Willetton and a 49-year-old from the Perth suburb of Kensington.",
        "source": "Yahoo"
    }
]