[
    {
        "url": "https://www.9news.com.au/world/elon-musk-no-longer-richest-man-in-world/bd28e17a-c79f-48aa-9d47-6e84698f5ee8",
        "title": "Elon Musk just lost his title as world's richest person",
        "publish_date": "Wed, 10 Sep 2025 21:43:13 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Elon Musk has lost his title of \"world's richest person\" to Oracle co-founder Larry Ellison.\n\nEllison's wealth jumped by $US101 billion ($152 billion) to $US393 billion ($594 billion) after Oracle's stunningly strong earnings report this week, surpassing Musk's net worth of $US385 billion, according to Bloomberg.\n\nOracle (ORCL) reported surging demand for its data centre capacity from AI customers, launching the stock into the stratosphere. Shares gained 36 per cent on Wednesday, which was the stock's biggest single-day gain since 1992.\n\nElon Musk is no longer the richest person in the world. (AP Photo/Matt Rourke) (AP)\n\nChief executive Safra Catz announced on Tuesday after the stock market closed that Oracle signed four multibillion-dollar contracts with customers during the quarter, and she expects to sign several more in the coming months.\n\nThat electric forecast was powered by Oracle's emergence as a key provider of infrastructure that powers AI companies' enormous demands for computing power – Oracle's bread and butter as a cloud services and database software provider.\n\n\"We'll be talking about this one for a long time,\" said Ben Reitzes, analyst at Melius Research, about Oracle's earnings report in a note to investors on Wednesday.\n\nReitzes called Oracle's $US455 billion backlog in demand for its AI services \"staggering.\"\n\nEllison is Oracle's largest individual shareholder and captured the title of world's richest person because of the stock's extraordinary gains on Wednesday. The stock's jump is exceedingly rare for a company that has a massive market value.\n\nOracle co-founder Larry Ellison is the world's richest person. (Bloomberg photo by David Paul Morris) (Bloomberg)\n\nOracle's market value gained roughly $US244 billion on Wednesday, lifting it to roughly $US922 billion. Oracle on Wednesday jumped from being the 13th-most valuable company in the US S&P 500 to the 10th most-valuable.\n\nBloomberg notes Ellison's leap in wealth is the \"biggest one-day increase ever recorded\" recorded by the index.\n\nMeanwhile, Tesla shares (TSLA) are down roughly 14 per cent this year.\n\nMusk first captured the title of the world's richest person in 2021 and has largely held on to it for the past few years, thanks in part to his various investments in Tesla and SpaceX.\n\nOver the years, Musk has briefly lost it twice, first in 2021 to LVMH CEO Bernard Arnault and in 2024 to Amazon founder Jeff Bezos.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/prince-harry-king-charles-meeting-cancer/77c06049-a8ec-4b1d-b036-190b0f02869e",
        "title": "Prince Harry reunites with his father, King Charles",
        "publish_date": "Wed, 10 Sep 2025 17:39:32 +0000",
        "category": "entertainment",
        "authors": [
            "Sep"
        ],
        "text": "P﻿rince Harry has met his father King Charles for the first time in more than 18 months on a solo trip to the UK.\n\nThe King is having treatment for an undisclosed form of cancer.\n\n﻿The royal pair have not seen each other for 19 months, despite Harry's multiple trips to the UK for court cases from his new home in California, USA with his wife Meghan and their two children, Prince Archie, six and Princess Lilibet, four.\n\nREAD MORE: Israel launches strikes in Yemen as EU chief seeks sanctions on Israel ﻿\n\nPrince Harry arrives at Clarence House on September 10, 2025 in London, England. (Ben Montgomery/Getty Images)\n\nKing Charles III seen arriving at Clarence House. (Getty)\n\nBuckingham Palace confirmed the meeting to UK media.\n\nBut both men were seen arriving at the King's official residence, Clarence House in London this afternoon, UK time.\n\nA palace source told The Telegraph the King enjoyed a private tea with the Duke which lasted 45 minutes.\n\nPrince Harry is in the UK for a series of charity engagements.\n\nPrince Harry returns to UK amid reunion speculation View Gallery\n\n﻿King Charles had been at Balmoral Castle in Scotland for the summer but was seen returning to London.\n\nThe prince has not seen his father since early 2024.\n\nTheir relationship soured following 'Megxit' when he opted to leave his role in the Royal family after his marriage to Meghan.﻿\n\n﻿However there have been reports of meetings between representatives of both sides.\n\nPrince Harry, Duke of Sussex waves as he departs following a visit to the Centre for Blast Injury Studies in London. (Suzanne Plunkett - Pool/Getty Images)\n\nPrince Harry greets a crowd after visiting the community recording studio in St. Anns on September 9, 2025 in Nottingham, England. (Photo by Paul Grover - WPA Pool/Getty Images) (Getty)\n\nSpeculation of a possible meeting between the father and son has been growing throughout Harry's solo trip back to Britain.\n\nOn Wednesday, the 40-year-old duke visited the Centre for Blast Injury Studies at Imperial College London.\n\nThe last time that Charles and Harry spent time together was in February 2024 when the duke dashed back to Britain for a 30-minute meeting following the King's shock cancer diagnosis.\n\nHarry, who is fifth in line to the throne, wasn't able to see his father when he returned in April as Charles was on a state visit to Italy.\n\nThe Duke and Duchess of Sussex during the USA v Nigeria wheelchair basketball in the Vancouver Convention Centre (VCC) during the 2025 Invictus Games in February. (PA Images via Getty Images)\n\nHowever his estranged brother, Prince William, does not appear to be in London to meet Harry.\n\nHe was in Cardiff, Wales today on an official visit.\n\nWhile no details have been given about the King's cancer, the prince has indicated the situation could be severe.\n\n\"I would love a reconciliation with my family,\" he told BBC News in May.\n\n\"I don't know how much longer my father has. He won't speak to me because of this security stuff... but it would be nice to reconcile.\"﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/aussie-mum-and-dad-investors-are-turning-to-ai-for-financial-advice/b941faa7-75e6-4d53-a8a0-a36ec5d09c1f",
        "title": "Aussie 'mum and dad' investors turn to AI for financial advice",
        "publish_date": "Thu, 11 Sep 2025 00:57:38 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A new survey has revealed a dramatic shift in how Australians are managing their money, with almost half of all \"mum and dad\" investors now asking artificial intelligence platforms for investment tips.\n\nFindings from an Australian Retail Investor Confidence survey, conducted by Chartered Accountants ANZ, highlight a growing reliance on tools like ChatGPT and Co-Pilot to guide investment decisions.\n\nThe survey, which for the first time asked 1000 Australian investors about their use of AI, found that 48 per cent are now using these platforms.\n\nAussie investors are increasingly turning to AI for financial advice, a new survey has found. (iStock)\n\n\"We have seen adoption of AI grow rapidly for both personal and professional use, but it is interesting to see investors are using it to guide where their money goes,\" Chartered Accountants ANZ CEO Ainslie van Onselen said.\n\nThe trend is particularly strong among younger investors, with 78 per cent of those aged 18-29 using AI for their financial decisions.\n\nThe survey also found a gender gap, with 15 per cent of male investors using AI extensively, compared to just 9 per cent of women.\n\nWhile the adoption of AI is on the rise, trust remains a significant hurdle.\n\nAround 43 per cent of those surveyed said they don't use AI because they lack confidence in the information it provides, and 46 per cent prefer to stick with more traditional sources.\n\nThe findings underscore the importance of reliable, human-backed financial information.\n\n\"Investors regard auditors as the foremost protectors of their interests, demonstrating a high level of trust in qualified professionals who deliver audit and assurance services,\" Van Onselen said.\n\n\"After all, AI information is only as good as its source.\"\n\nThis is supported by the survey data, which showed a four-point jump in strong confidence in audited financial statements since last year, now at 54 per cent.\n\nDespite global uncertainty, investor confidence in the Australian market is on the rise.\n\nCA ANZ chief economist, Professor Richard Holden, attributes this to a strong domestic economy.\n\n\"Confidence in Australian capital markets and listed companies has risen significantly at a time of global uncertainty, along with confidence in auditors and financial statements,\" Holden said.\n\nThe increasing use of AI highlighted the need for high-quality data to train these models, Holden added.\n\nThe survey also revealed a six-point increase in the percentage of investors with high confidence in Australian companies, and 42 per cent cited the recent federal election as a factor that boosted their confidence to invest.\n\nHowever, global unrest is making investors more cautious about overseas investments, with confidence in these markets dropping from 78 per cent to 73 per cent.\n\nThe rise of AI in finance is not limited to retail investors.\n\nA separate global report from Chartered Accountants Worldwide and Ipsos UK found that 79 per cent of chartered accountants believe their role as \"data guardians\" will become increasingly important as AI is integrated more into business.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/entertainment/palestine-pledge-boycott-israel-film-industry-olivia-colma-mark-ruffalo-emma-stone/0d4dd1d3-c585-465d-bac6-03e5e96be8ed",
        "title": "Mark Ruffalo, Olivia Colman, Emma Stone among stars to boycott Israeli films",
        "publish_date": "Wed, 10 Sep 2025 19:58:14 +0000",
        "category": "entertainment",
        "authors": [
            "Sep"
        ],
        "text": "Some prominent Hollywood names are among the filmmakers and industry figures who've signed a pledge to boycott Israeli film institutions — including festivals, broadcasters and production companies — that are “implicated in genocide and apartheid against the Palestinian people”.\n\nThe group Film Workers for Palestine posted an open letter today, including signatures from Hollywood luminaries like Emma Stone, Ayo Edebiri, Mark Ruffalo Olivia Colman, John Cusack, Riz Ahmed, Rob Delaney, Javier Bardem, Tilda Swinton and Cynthia Nixon among many others. The group said it had collected more than 3000 industry signatures since the pledge was made public.\n\n“As filmmakers, actors, film industry workers, and institutions, we recognize the power of cinema to shape perceptions,” the open letter says. “In this urgent moment of crisis, where many of our governments are enabling the carnage in Gaza, we must do everything we can to address complicity in that unrelenting horror.”\n\nMark Ruffalo and Emma Stone, co-stars of acclaimed film Poor Things, both signed on. (Getty)\n\nFilm Workers for Palestine — a group of film professionals based in various countries formed in early 2024 — said their pledge was inspired by Filmmakers United Against Apartheid, who refused to screen their films in apartheid South Africa.\n\n“We pledge not to screen films, appear at or otherwise work with Israeli film institutions — including festivals, cinemas, broadcasters and production companies — that are implicated in genocide and apartheid against the Palestinian people,” the letter says.\n\nThe group has not called for a boycott on all Israeli film institutions. It claims on its website that Israel’s public and private broadcasters “have decades-old and ongoing involvement in whitewashing, denying and justifying Israel’s war crimes” and also says Israel’s major film festivals — including the Jerusalem Film Festival, Haifa International Film Festival and others — “continue to partner with the Israeli government while it carries out what leading experts have defined as genocide against Palestinians in Gaza.”\n\nBut it says that it does not consider all film institutions in Israel complicit, and advises people to ask questions and “seek guidelines set by Palestinian civil society.”\n\nOlivia Colman poses for photographers upon arrival at the Burberry Winter 2024 fashion show. (Vianney Le Caer/Invision/AP)\n\nThe Jerusalem Film Festival did not immediately reply to a request for comment.\n\nThe pledge also specifies that it is targeting institutions and not individuals: “The call is for film workers to refuse to work with Israeli institutions that are complicit in Israel’s human rights abuses against the Palestinian people. This refusal takes aim at institutional complicity, not identity.”\n\nA representative of the Israeli film and television industry called the boycott “misguided.”\n\n“We are the industry that (has been) struggling for years, making efforts for decades to promote discussion,” working with Palestinians and Israelis to tell the story of the conflict from all sides, said Tzvika Gottlieb, CEO of the Israeli Film & TV Producers Association, in an interview.\n\nREAD MORE: Apple unveils thinnest iPhone ever as new changes revealed\n\nAyo Edebiri (Matt Winkelmeyer/Getty Images)\n\nGottlieb said his industry “has consistently maintained a critical stance toward government policies, and is very vocal in criticism of this administration’s current actions. We urgently call for an immediate end to the violence, an end to the suffering, and the release of all hostages right now.”\n\nHis group added in official remarks that “this call for a boycott is profoundly misguided. By targeting us — the creators who give voice to diverse narratives and foster dialogue — these signatories are undermining their own cause and attempting to silence us.”\n\nIn response, Film Workers for Palestine issued a statement to The Associated Press, saying their initiative is “rooted in historic struggles,\" in particular \"the successful international movement to end the apartheid regime of South Africa.”\n\nTilda Swinton at the opening ceremony during the 82nd Venice International Film Festival. (WireImage)\n\n“Should Israeli film institutions wish to continue working with pledge signatories, their choice is clear: end complicity in Israel’s genocide and apartheid, and endorse the full rights of the Palestinian people under international law, in line with Palestinian civil society guidelines,\" the statement said. \"To date, almost none has.”\n\nThe pledge comes after a pro-Palestinian demonstration at the recent Venice International Film Festival drew an estimated 10,000 participants. That followed a call by a group called Venice4Palestine for the festival to condemn the destruction in Gaza.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/adelaide-queen-elizabeth-hospital-under-fire-for-forcefully-evicting-man-with-walking-frame/62a697ee-a1f6-49e5-b32d-0a18864a9058",
        "title": "Hospital under fire for forcefully evicting man with walking frame",
        "publish_date": "Wed, 10 Sep 2025 10:32:13 +0000",
        "category": "lifestyle",
        "authors": [
            "Keziah Sullivan",
            "Sep"
        ],
        "text": "Adelaide's Queen Elizabeth Hospital is under scrutiny after video footage showed a man using a walking frame being forcefully evicted.\n\nThe incident, which occurred in the early hours of Sunday morning, involved security personnel carrying the man outside the hospital and leaving him with his walking frame near Woodville Road.\n\n\"(They) didn't sit him up on his walker or anything like that,\" a witness said.\n\nAdelaide's Queen Elizabeth Hospital is under scrutiny after video footage showed a man using a walking frame being forcefully evicted. (9News)\n\n\"It was pretty disgusting to see from a healthcare service.\"\n\nThe witness said she had seen the man in the hospital's emergency department.\n\n\"All we had seen was an elderly man asking for help, his speech was slurred, you couldn't really understand him,\" she said.\n\n\"He couldn't walk without his walker, that was very obvious,\" she added.\n\nThe hospital has told 9News the man had been invited into the ED after appearing distressed in the ambulance bay, but was then asked to leave when his behaviour became \"anti-social\".\n\n\"Our security staff will assess each situation … and will make sure that they are using the minimal amount of force that is required to make sure that people are safe,\" Health Minister Chris Picton said.\n\nThe hospital wouldn't comment on whether the force was appropriate.\n\nBut SA Health released a statement saying the man was \"safely\" removed by security.\n\nThe man, who is believed to be homeless, later returned to the emergency department but was not admitted as a patient.\n\n\"If that had happened to one of my family members, I could promise you I wouldn't be staying quiet about it,\" the witness said.\n\n\"I wouldn't really know the right way to go about it, but I just know that that wasn't the right way.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/genes-not-just-diet-could-help-protect-people-from-diabetes-according-to-new-research/089f0d5d-bd69-45d1-a600-101c9565ca2e",
        "title": "Genes, not just diet, could help protect people from diabetes",
        "publish_date": "Wed, 10 Sep 2025 09:55:34 +0000",
        "category": "lifestyle",
        "authors": [
            "Sep"
        ],
        "text": "Experts say our genes, not just our diet, can drive gut health and help protect people from diabetes.\n\nSydney-based researchers at the Charles Perkins Centre have identified a genetic component influencing the composition of the gut microbiome and its subsequent impact on metabolic health.\n\nWhile dietary factors are acknowledged to play a significant role in gut health, the research suggests that genetics also contribute significantly.\n\nExperts say our genes, not just our diet, can drive gut health and help protect people from diabetes. (9News)\n\nThe study focuses on alpha-defensins, small proteins or peptides produced by genes, with varying levels observed between individuals.\n\n\"The microbiome is like a garden, it contains beautiful plants but it also contains weeds,\" Professor David James from the Charles Perkins Centre said.\n\n\"The beautiful plants contribute to good health, and the weeds bad health.\n\n\"These peptides are the pruners of the garden.\"\n\nExperiments conducted on mice demonstrated that these peptides selectively target specific bacteria within the gut.\n\nProfessor David James from the Charles Perkins Centre. (9News)\n\n\"What we found was that feeding these peptides to mice improved their metabolic health, they were protected against the effects of an unhealthy diet, and we think it's really exciting,\" researcher Dr Stewart Masson said.\n\nResearchers would now like to see how human health and diseases such as diabetes are influenced by measuring the peptides in people, so low levels can be boosted.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-11/clinton-moore-lands-world-first-freestyle-motocross-720-trick/105752952",
        "title": "'Impossible' world-first stunt landed on Queensland sugarcane farm",
        "publish_date": "Thu, 11 Sep 2025 01:32:55 +0000",
        "category": "sports",
        "authors": [],
        "text": "After more than 15 years of trying Australian freestyle motocross rider Clinton Moore has landed the \"impossible\" trick.\n\nThe 720 stunt — involving two full rotations of the bike in the air — took place in the middle of a sugarcane paddock on the outskirts of Bundaberg.\n\n\"In the freestyle community, a lot of people have been saying this is just the impossible trick,\" Moore said.\n\n\"With a lot of dedication and hard work over the years I've finally made that possible.\n\n\" It feels like I've got a massive weight off my shoulders now. \"\n\nClinton Moore at his family's sugarcane farm in Bundaberg, where his career began. (ABC Wide Bay: Johanna Marie)\n\n'So incredibly inspiring'\n\nIt has been a challenging journey — Moore crashed making a first attempt at the X Games in Los Angeles in 2012 and was run over by his own bike.\n\nIn recent months there were two other failed attempts during shows in Brisbane.\n\nThere is no official recognition of the world-first achievement but Moore has been praised on social media by American motocross superstar Travis Pastrana and the sport's international community.\n\n\"It is so incredibly inspiring seeing him land the 720,\" Freestyle Kings director Josh Hannah said.\n\n\" We couldn't be more proud of him. \"\n\nClinton Moore attempting the 720 in Brisbane earlier this year. (Supplied: Freestyle Kings)\n\nMoore, 37, said he was inspired by Pastrana, who is the only other rider to have attempted the trick.\n\n\"Travis attempted it a couple of years prior to [me] and that's what gave me the idea to follow that up,\" he said.\n\n\"We've talked about this a lot and he's been very supportive.\"\n\nEnding where it all began\n\nMoore was crowned the Red Bull X-Fighters World Tour Champion in 2015 and continues to tour and perform in exhibition shows across the world.\n\nClinton Moore said he is almost ready to retire from professional riding. (Supplied: Freestyle Kings)\n\nBut landing the 720 on the property he grew up and learnt to ride motorbikes was one of his biggest successes.\n\n\"It's a pretty amazing feeling that I landed here at home in my backyard, even though I've done a lot of my first tricks here,\" Moore said.\n\n\"I feel like maybe the story was just really meant to end here at home on the sugarcane farm where I was born and raised.\n\n\" This is my dad's sugarcane farm and it's good to come back and finish the story here, landing the world's first 720. \"\n\nClinton Moore performing on a Freestyle Kings world tour. (Supplied: Freestyle Kings)\n\nMoore said he felt ready to \"hang the boots up\".\n\n\"I'll always keep riding my bike cause it's a love and passion, he said.\n\n\"But you know, it's just here at home where it all started, I guess.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-11/genevieve-bell-resigns-as-anu-vice-chancellor/105751680",
        "title": "'Not an easy decision': ANU vice-chancellor Genevieve Bell resigns",
        "publish_date": "Thu, 11 Sep 2025 00:27:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian National University (ANU) vice-chancellor Genevieve Bell has resigned from her position but says she will remain at the university in an academic capacity after some time off.\n\nProfessor Bell had been under increasing scrutiny due to forced redundancies and her handling of related concerns from staff and students.\n\nIn a letter tendering her resignation as vice-chancellor, she said working in the role had been \"an extraordinary privilege and also a heavy responsibility\".\n\n\"This was not an easy decision,\" Professor Bell said.\n\n\"As many of you know, the ANU has been a special place for me, ever since I was a child.\n\n\"Like the rest of our community, I believe firmly in our delivering on our national mission — to create and transmit knowledge through research and teaching of the highest quality.\n\n\"And know that doing this requires a solid financial, cultural and operational foundation.\"\n\nProfessor Bell said achieving that solid foundation had been \"difficult\" and acknowledged that recently the university had been experiencing \"a very hard time\".\n\nShe said she would be taking some time off, including a period of study leave, before returning to the School of Cybernetics as a distinguished professor.\n\n\"I know there is still more work to do so,\" she said.\n\n\" I very much want to see the ANU thrive into the future and for it to continue to be a remarkable place and I don't want to stand in the way of that. \"\n\nProfessor Bell was appointed as the institution's 13th vice-chancellor in January 2024, taking over from Professor Brian Schmidt.\n\nThe cultural anthropologist inherited what she described as an \"enormous number of challenges\" at the ANU.\n\nIn October of last year, the university announced plans to save $250 million in operating costs by 2026 — including $100 million through salaries.\n\nIn a letter to ANU staff, Chancellor Julie Bishop thanked Professor Bell for her service as vice-chancellor and president.\n\nPressure to save millions\n\nA series of \"change proposals\" followed — involving cuts and restructures across the institution.\n\nThe 'Renew ANU' plan and Professor Bell's leadership have both been the subject of fierce and mounting backlash from staff, students and the National Tertiary Education Union.\n\nThe ANU has plans to overhaul the 60-year-old ANU School of Music, including dropping one-on-one instrument lessons. (ABC News: Callum Flinn)\n\nA controversial move to axe the renowned School of Music garnered particular outrage, sparking campus protests and condemnation from leaders in the arts industry.\n\nAustralian Chamber Orchestra director Richard Tognetti warned the plan would be tantamount to \"cultural vandalism\".\n\nProfessor Bell also faced criticism for being paid $70,000 for 24 hours' work by her previous employer, Silicon Valley technology company Intel, while also taking home her more than $1 million vice-chancellor's salary.\n\nUnion members supported a vote of no confidence against her and Ms Bishop and have repeatedly called for their resignation.\n\nProfessor Bell long resisted that pressure and accused her critics of using her gender as a tactic to undermine her.\n\n\"Sexism is alive and well and living in Australia,\" she told ABC's Stateline in March.\n\nAustralian National University chancellor Julie Bishop was accused of bullying and harassment. (ABC News: Matt Roberts)\n\nAccusations and investigations add to turmoil\n\nUproar over the ANU's leadership reached fever pitch last month, when academic and former ANU Council member Liz Allen accused Chancellor Julie Bishop of bullying, harassment and hostile behaviour during a Senate inquiry into university governance.\n\nLoading...\n\nMs Bishop, who was appointed as chancellor in 2020 after a career in federal politics, denied any wrongdoing and the university established a group to oversee an investigation into the allegations.\n\nMeanwhile, the ANU remains under investigation by the higher education regulator, the Tertiary Education Quality and Standards Agency (TEQSA), over concerns about the university's operations.\n\nA fortnight ago, Professor Bell announced future savings in the university's ongoing restructure would not involve forced job cuts.\n\nThat did not include areas of the university where a savings plan had already been announced.\n\nThe move failed to remedy the loss of confidence in Professor Bell's leadership.\n\n'Will take time to heal'\n\nLachlan Clohesy of the National Tertiary Education Union said they welcomed news of the resignation.\n\n\"The announcement of the vice-chancellor's departure must also be accompanied by an announcement that all forced redundancies will now cease,\" he said.\n\n\"We welcome this development. But we also need to recognise the incredible toll the last two years have taken on the ANU community, and that will take time to heal.\n\n\"Changing the vice-chancellor will not fix the ANU's issues unless governance concerns are also addressed.\"\n\nThe student group No Cuts at ANU called the resignation the \"outcome of months of campaigning by students, staff and the ANU community against Renew ANU and university management\".\n\n\"This has demonstrated that the real power lies with students and staff, not the profiteering bosses at the head of this university,\" spokeswoman Lucy Chapman-Kelly said.\n\n\"Students facing hundreds of staff cuts, multiple degrees abolished, the merger or eradication of entire colleges, have called for Bell to be sacked since January this year.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-11/nt-mud-crab-industry-closure-for-christmas-to-protect-stock/105756524",
        "title": "NT mud crabs off Christmas menu as industry closes for three months",
        "publish_date": "Wed, 10 Sep 2025 23:58:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Northern Territory's mud crab industry will not supply crabs to the market this Christmas after a decision to close its fisheries for three months.\n\nIt came after a harvest strategy assessment found the catch rate of mud crabs in the Arafura West region had fallen below a trigger point.\n\nFrom November 1 to January 31, there will be no commercial crabbing in Arafura West, which covers a large stretch of the territory coastline.\n\nThere will also be a voluntary closure in the Gulf of Carpentaria from December 1 to February 28.\n\nThere are two mud crab fisheries in the Northern Territory. (Supplied: AFANT)\n\nNT Seafood Council chief executive Daniel Capps said the mud crab industry had faced an initial mandatory closure of six weeks, but volunteered for it to go longer.\n\n\"The thinking here is, let's act before there is a sustainability issue,\" he said.\n\n\"The industry has shown real leadership here and are on the front foot, they're being proactive in making sure there isn't an issue in the future.\"\n\nMr Capps said it was not the first time a trigger point had been reached and the current situation was not a cause for alarm.\n\n\" Let's be proactive, because there's nothing more Territorian than mud crabs and we want to make sure they're there for the future. \"\n\nMud crabs are caught in the Gulf of Carpentaria. (ABC Rural: Daniel Fitzgerald)\n\nNo crabs for Christmas\n\nThe Aboriginal Sea Company (ASC) owns several mud crab fishing licences.\n\nActing chief executive Jared Copley said the company supported the closure.\n\n\"We think it's good practice to give the crab [population] a refresh,\" he said.\n\n\"We want to see mud crabs thrive for years to come, so we fully support the closure and it's also why we've opted for the additional six weeks.\"\n\nMr Copley said the wet season period was normally a quieter time for the industry, but customers would notice a lack of NT mud crabs for sale over the Christmas period.\n\n\"There is going to be a bit of pain for local customers wanting to get a mud crab over the Christmas period, so they'll have to seek alternative sources [or] get something else for the table,\" he said.\n\nChanges for recreational fishers\n\nAmateur Fishermen's Association of the Northern Territory (AFANT) chief executive David Ciaravolo said the commercial industry was responsible for 70 per cent of the total catch in the Arafura West zone, and recreational fishers were taking the other 30 per cent.\n\nHe said the mud crab harvest strategy required NT Fisheries to \"implement appropriate management options\" for recreational fishing, and AFANT was now surveying its members about possible options.\n\n\"So what we're trying to do is reduce the harvest of crabs during the key spawning season,\" he said.\n\n\"It's an important time of year for recreational crabbing and people wanting to get some crabs for Christmas.\n\n\" But there are things we can do to contribute to the sustainability and recovery of stocks. \"\n\nDavid Ciaravolo is confident mud crab stocks can bounce back. (ABC News: Jane Bardon)\n\nMr Ciaravolo said the survey included options such as reducing the possession limit or introducing a season closure for recreational crabbing.\n\n\"We know that most recreational fishers will understand the need to support sustainable resource management and are willing to play their part in supporting the recovery of mud crab stocks,\" he said.\n\n\"We recognise the strong commitment to sustainability, evidenced by the commercial sector's initiative to double the commercial closure [time].\"\n\nLoading...\n\nMr Ciaravolo expected NT Fisheries would make a decision on recreational crabbing rules by October.\n\nHe said crab numbers plummeted in the gulf in 2015 but through improved weather conditions and sustainable fishing, the numbers bounced back.\n\nHe said the current possession limit for mud crabs in the NT was \"a very generous\" 10 crabs per person, per day.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-11/magnetic-island-world-heritage-area-dredged-mud/105739090",
        "title": "Caught between progress and a natural wonder an island battles floating mud",
        "publish_date": "Wed, 10 Sep 2025 23:35:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Just a 15-minute ferry ride from the growing northern industrial hub of Townsville in North Queensland lies a tropical island paradise on the Great Barrier Reef's doorstep.\n\nTourists flock to Magnetic Island to see green sea turtles and unique underwater coral reefs, but when the winds change, so do the conditions underwater — visibility is reduced to almost nothing.\n\nLocal divers say this photo, taken during the dredge period, shows evidence of a sediment plume. (Supplied: Lawrence Scheele)\n\nGethin Morgan from Magnetic Island Nature Care believes in his 30 years on the island, the underwater environment has degraded.\n\n\"When the wind blows and you've got a few days of strong wind the whole bay just gets muddy right into these little bays,\" he said.\n\nHe blames the Port of Townsville and its maintenance dredging program, which allows silt and mud to be dumped in the bay.\n\n\"We're pushing for it to be dumped in deeper water but before that could happen there needs to be proper modelling done now,\" he said.\n\nGethin Morgan says tourists used to be able to see pristine corals at Geoffrey Bay's intertidal zone. (ABC News: Baz Ruddick)\n\nMr Morgan believes the fine silt, dredged from the shipping channel, is being washed onto the island's inshore reefs.\n\n\"It's a tremendous refuge, it's a biodiversity hotspot. Cleveland Bay is really important,\" he said.\n\nThe port will next year begin planning for how to deal with the dredged material over the next decade.\n\nA satellite image taken during this year's dredge period. (Supplied: Lawrence Scheele)\n\nDredging maintains port operations\n\nDredging is required to keep shipping channels clear up and down the coastline, with one hopper dredge, owned by the Port of Brisbane, servicing nine Queensland ports year-round.\n\nThat includes the Port of Townsville, where the channel was recently widened as part of a $251 million expansion completed in late 2024, allowing vessels of up to 300 metres to berth.\n\nThis hopper dredge, owned by the Port of Brisbane, services nine Queensland ports. (Supplied: Port of Townsville)\n\nFor a month each year, the Port of Townsville dredges 400,000 to 450,000 metres cubed of sediment from the city's shipping passage.\n\nIt is permitted to dispose the mud at an underwater depth of 10 to 16 metres, in an area that was excised from the Great Barrier Reef Marine Park as a Dredge Material Placement Area.\n\nThe Port of Townsville's expansion has allowed larger cruise ships to dock. (ABC News: Baz Ruddick)\n\nReef always in cycle of stress and recovery\n\nSilt can cause damage to coral by blocking light, which inhibits the ability of the algae living in the coral to photosynthesise and feed the coral.\n\nBut Andy Lewis, a marine biologist and the executive director of not-for-profit the Coral Sea Foundation, said the reefs around the island were in good condition.\n\n\"There is no doubt that the dredging is increasing sediment load in the water, but the reefs around here are adapted to living in a high sediment environment,\" he said.\n\nAndy Lewis has lived at Magnetic Island and monitored its reefs for more than two decades. (ABC News: Baz Ruddick)\n\nDr Lewis, who has dived Magnetic Island's reefs for more than 25 years and kept records of recovery, did not believe there was evidence of long-term decline in coral cover as a result of dredge activity.\n\n\"Some of the highest coral cover reefs we have around the island are in areas of exceptionally high sediment flow,\" he said.\n\nHe said the shallow average depth of water and sediment run-off from the mainland nearby made the environment naturally turbid, and that cyclones had also taken a toll.\n\n\"[Cyclone Tessi]took out a lot of those corals in the intertidal [zone]but the subtidal corals below the high tide mark are still in really good condition,\" he said.\n\nThis \"blue bum\" porite coral in Geoffrey Bay shows quick recovery from natural stressors over a three-year period. (Supplied: Coral Sea Foundation)\n\nHowever, he still believed the best-case scenario for the environment would be putting all dredge spoil on land, particularly in the face of increasing stress on the reef.\n\n\"I think everything that we can do now to limit the amount of pressure on our reef system is valuable,\" he said.\n\nOceanographer Eric Wolanski recently published a paper on the health of the Cleveland Bay ecosystem, suggesting dredging had exacerbated the bay's natural murkiness by adding more sediment.\n\n\"The water has become very turbid and it has decreased from 8m visibility in the 1960s to 1m nowadays,\" Dr Wolanski said.\n\nEric Wolanski says modelling shows dumped dredged mud is being moved by currents around the island. (ABC News: Baz Ruddick)\n\nThe Port of Townsville has monitoring buoys in place around the bay that monitor water quality.\n\nIt is one of several in Queensland, like Gladstone and Cairns, permitted to dump maintenance dredge spoil in designated marine areas.\n\nDr Wolanski is critical of the monitoring.\n\nHe believes silt was affecting reefs on the western side of the island where there are no permanent water monitoring buoys in place.\n\n\"It's completely unsustainable. It's not an example we should use to plan for the future,\" he said.\n\nLocal divers say this coral at Magnetic Island is coated with sediment. (Supplied: Lawrence Scheele)\n\nPlacement site to be reviewed from next year\n\nIn a statement, a Port of Townsville spokesperson said it would consider \"community feedback\" on where to put the dredge spoil as part of its next management plan.\n\n\"We are currently preparing for our next 10-year sea placement application,\" they said.\n\n\"As part of our commitment to best practice, we will review all available science, community feedback and regulatory guidance as part of the application process.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-11/basil-zempilas-pens-letter-after-jacinta-nampijinpa-price-dumped/105760506",
        "title": "Zempilas seeks to repair damage from Nampijinpa Price remarks on migrants",
        "publish_date": "Wed, 10 Sep 2025 23:32:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "WA Liberal leader Basil Zempilas has written to the state's Indian Society in a bid to smooth over damage caused by comments from federal colleague Jacinta Nampijinpa Price, who is due to speak at an event at one of the society's venues tonight.\n\nIt comes after federal Liberal leader Sussan Ley yesterday dumped Senator Nampijinpa Price from her frontbench, citing hurtful comments she made last week about Indian-Australians, as well as her lack of support for Ms Ley's leadership.\n\nSenator Nampijinpa Price claimed the federal government was bringing in large numbers of Indian migrants because they voted for the Labor Party.\n\nShe is slated to speak at a Liberal Party event tonight, held at the Indian Society's community centre in the Perth suburb of Willetton.\n\nJacinta Nampijinpa Price has been dumped from the federal Liberal frontbench. (ABC News: Matt Roberts)\n\nA website for the event promotes her speaking alongside outspoken state Liberal MP Nick Goiran, describing the pair as \"two MPs who are never afraid to say what needs to be said\".\n\nOrganisers last night told the ABC the event was still planned to go ahead, despite Senator Nampijinpa Price's demotion.\n\nThe Indian Society yesterday told the ABC it was not associated with the event, which had been booked through an online portal.\n\nCommentary unhelpful: Zempilas\n\nIn a letter to Indian Society of WA president Deepak Sharma, Mr Zempilas said some of the commentary over recent weeks had been unhelpful.\n\nSenator Nampijinpa Price is due to speak at a Liberal Party event at an Indian Society community centre. (ABC News: Mya Kordic)\n\n\"As … a product of Western Australia's proud migrant history, I feel compelled to address some of the public commentary regarding Australia's immigration policies and our migrant community, particularly the Indian community,\" Mr Zempilas wrote.\n\n\"Free speech and the right to protest are important tenets of Australia's democracy. However, some of what we have seen and heard over recent weeks has been unhelpful.\n\n\"That's not the Australian way, and it's not representative of the value of this State's cultural diversity.\n\n\"Migrants have been and continue to be an integral part of our communities.\n\n\"Their contributions make those communities and our State stronger and more vibrant.\"\n\nMr Zempilas highlighted the Indian community as an important contributor to WA society.\n\nSacking Nampijinpa Price was Ley's only option, and she took it Photo shows A woman stands in front of a purple curtain Comments about Indian migrants were one thing, but refusing to back in her leader Sussan Ley made it impossible for Jacinta Nampijinpa Price to stay.\n\n\"Members of the Indian community have played and continue to play a pivotal role in adding to the rich fabric of Western Australian life, taking up the opportunity to get involved in their local communities and contribute fully and meaningfully to society.\n\n\"I want to reaffirm my commitment to supporting the Indian community and cultural diversity in this state.\n\n\"I regret that members of your community may have felt aggrieved and hurt by recent commentary and commit to working with you to move forward in the spirit of inclusion and cohesion, which has served Western Australia so well over our proud history.\"\n\nIndian Society of WA vice-president Divya Sharma welcomed Mr Zempilas's letter.\n\n\"We do appreciate his commitment to supporting our Indian community and to the cultural diversity in this state,\" Dr Sharma said.\n\n\"Pigeon-holing any community is not helpful. What I feel obviously is that when … statements of support are publicly known, and positive messaging which doesn't get the airtime it deserves, [it] goes a long way towards reassuring a migrant community that they are supported.\"\n\nLiberals warned trust damaged\n\nMeanwhile, a WA advocate for the Indian community has warned the Liberal Party will need to work hard to regain trust following Senator Nampijinpa Price's comments.\n\nSuresh Rajan said Ms Ley's decision to dump Senator Price from the frontbench was likely designed to help regain the trust of the Indian community.\n\nSuresh Rajan has called for Senator Nampijinpa Price to apologise over her comments. (ABC News: Briana Shepherd)\n\n\"I would be inclined to think that the party will need to do a lot more work and continue to support and to encourage the Indian community before they will regain the trust that's been so badly damaged on this occasion,\" Mr Rajan said.\n\nMr Rajan called for Senator Nampijinpa Price to apologise over her comments, and said she ought to gain a better understanding of the Indian community and its values.\n\n\"If she wants to be taken seriously, then she should really be engaging with the community before she goes out and makes comments of this nature, or at least talk to people who have an understanding of the patterns and the migration process that's involved here,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-11/stuart-smith-resignation-liberal-party-victoria-state-secretary/105760572",
        "title": "Victorian Liberal state secretary resigns over texts mocking women",
        "publish_date": "Wed, 10 Sep 2025 23:31:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Victorian Liberal state secretary Stuart Smith has resigned over text messages he sent to a staff group chat making fun of the party's women's council and mocking a female MP.\n\n\"In the best interests of the party, I have tendered my resignation to minimise distractions from the important task of winning the next election,\" Mr Smith said.\n\n\"I regret the comments and have apologised for them.\n\n\"I thank the party for the opportunity and wish the team well.\"\n\nThe text messages from Mr Smith to his Liberal head office colleagues were reportedly disparaging of the women's council and, in separate comments, ridiculed 76-year-old Liberal MP Beverley McArthur.\n\nMember for the Western Victorian region Beverley McArthur. (ABC News: Rudy De Santis)\n\nMs McArthur said on Thursday morning Mr Smith's resignation was \"the only acceptable course of action\".\n\n\"There's probably some others that need to consider their position,\" she said.\n\n\"But, you know, despite my demure, diminutive demeanour, I'm a big girl and I can take this.\n\n\"Trashing of women is just not acceptable.\"\n\n'Right thing to do', Battin says\n\nOpposition leader Brad Battin said Mr Smith resigning was \"the right thing to do\".\n\n\"His comments were unacceptable and do not reflect the standards of professionalism, integrity, and inclusion that we all expect of each other,\" he said on Thursday.\n\n\"I lead a team that aspires to the highest standards of professionalism, integrity and inclusion.\n\n\"My focus, and the focus of every one of my MPs, is to deliver real solutions for every Victorian — safer communities, better services, and cost of living relief.\"\n\nLiberal MP Evan Mulholland said it was a \"good thing\" Mr Smith had resigned.\n\n\"Those kinds of comments about a colleague are completely unacceptable. We've moved on, the party has made the right call, and we're focused on the next election,\" he said.\n\nLiberal MP David Southwick said Mr Smith's comments were \"inappropriate\" and the party had acted swiftly.\n\n\"The matter's been handled and we're moving on,\" he said.\n\nExecutive director of the Liberal-aligned Hilma's Network, Charlotte Mortlock, told the ABC she welcomed Mr Smith's resignation.\n\nHis departure comes a few days before the party's next state council meeting this weekend, where the position of state party president is up for election, and former president Greg Mirabella is expected to challenge incumbent Phil Davis.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-11/king-charles-hosts-meeting-with-sa-premier-peter-malinauskas/105760222",
        "title": "King Charles hosts SA premier, who 'would love' royal visit at climate summit",
        "publish_date": "Wed, 10 Sep 2025 23:07:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "South Australian Premier Peter Malinauskas says he would \"love\" King Charles to travel to Adelaide for the COP31 climate change summit in the event of Australia securing hosting rights.\n\nMr Malinauskas met with the sovereign on an official visit to the United Kingdom, during which he also signed an agreement with nuclear reactor manufacturer Rolls-Royce regarding the AUKUS submarine deal.\n\nThe premier told ABC Radio Adelaide that he and King Charles discussed next year's UN climate summit during their meeting at Clarence House in London.\n\nAdelaide's anxious wait for COP31 decision Photo shows A crowd of people gather under a lot of flags at a climate conference. Australia's bid to host next's year UN climate conference in Adelaide is taking longer than expected, raising concerns about preparations for the event.\n\nAustralia and Türkiye remain locked in a long-running stand-off over the right to hold the COP31 summit in 2026, but Adelaide will be the host city if Australia emerges triumphant.\n\n\"It's well known that the king's got a very substantial interest in all things environmental, and South Australia, being a potential host of the COP conference next year, was certainly on the king's mind,\" Mr Malinauskas said.\n\nThe premier said while it would be \"inappropriate\" to speak about \"what bid the king is supporting\", he would \"obviously love him to be there\" if SA's bid were successful.\n\n\"He has attended them [COP summits] in the past and I don't think it's unreasonable for me to say we would very much love it if he did [attend the 2026 summit], but ultimately it's the UN's event,\" Mr Malinauskas said.\n\n\"The king is very attuned to what COP is about and what it represents and he's certainly conscious of part of the merit of South Australia's bid by virtue of the fact that he was well and truly aware of how far advanced South Australia is in terms of our penetration of renewables in our state.\n\n\"He was across the numbers.\"\n\nAUKUS components being built\n\nDuring the trip to the UK, Mr Malinauskas attended the Defence and Security Equipment International arms conference, where the Trump administration's review of the AUKUS deal was \"a topic for conversation\", the premier said.\n\nUnder current plans, the SSN-AUKUS fleet will include nuclear reactors built by Rolls-Royce.\n\nMr Malinauskas said he and the British defence company signed a memorandum of understanding on commitments to workforce development and skills training in South Australia.\n\nAUKUS faces an 'American first' test Photo shows Donald Trump points at someone with his right hand index finger. Key defence figures on both sides of the Atlantic warn the risks to AUKUS run deeper than whether a review finds it is \"America first\" enough for Donald Trump.\n\n\"Rolls-Royce are going to have a presence here in Adelaide through this agreement,\" Mr Malinauskas told ABC Radio Adelaide.\n\n\"The agreement between us and Rolls-Royce establishes the program or, I guess, the framework I should say, about how we're going to do skills procurement for Rolls-Royce in a nuclear setting, which is about their collaboration with our TAFE, potentially with our technical colleges … but also with our universities.\"\n\nEarlier this week, Mr Malinauskas travelled to Rolls-Royce's facilities in Derby in the English midlands.\n\nHe said despite doubts about the AUKUS project, work was already underway.\n\n\"There is nothing but a sense of urgency to get cracking on the construction of the SSN-AUKUS submarine which is ultimately a UK design,\" he said.\n\n\"I saw firsthand the very first components that they are already manufacturing for Australia's first nuclear submarine that will be built at Osborne.\n\n\"They are already building them … for the first of the SSN-AUKUS.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-11/murdoch-children-pleased-family-trust-dispute-is-behind-them/105760498",
        "title": "Murdoch children 'pleased' family trust dispute is 'behind them'",
        "publish_date": "Wed, 10 Sep 2025 23:04:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "James Murdoch, Elisabeth Murdoch and Prudence MacLeod nee Murdoch say they are happy to have reached an agreement to settle litigation over the Murdoch family trust.\n\n\"Prudence, Elisabeth and James are pleased that the matter is now behind them,\" said a spokesperson for James Murdoch in a statement.\n\nThe Murdoch family reached a deal this week in which Murdoch's politically conservative eldest son, Lachlan Murdoch, will cement control of the family media empire, which includes Fox News and the Wall Street Journal.\n\nWe now know what happens to Rupert Murdoch's empire when he dies Photo shows Lachlan Murdoch stands at a lectern to give a speech, the projection of a US flag behind on screen The deal secures Rupert Murdoch's legacy as the founder of the world's most powerful conservative media empire.\n\nThe agreement, announced on Tuesday, ends a family brawl over who will control one of the most high-profile global media groups, putting to rest questions of succession within the Murdoch family after its patriarch's death.\n\nThe Murdoch family drama was widely viewed as an inspiration for the television series Succession, about infighting among members of a media dynasty.\n\nIts real-life resolution preserves the conservative tilt of Murdoch's media outlets.\n\nMurdochs prevented from buying back in\n\nThe feud was sparked by a plan to change the Murdoch family trust to hand control of the family's companies to Lachlan when Rupert, 94, dies.\n\nThe plan required a rewrite of the trust's \"irrevocable\" terms, which would have evenly divided control of Fox Corporation and News Corporation between Rupert's four oldest children.\n\nThe agreement has ended a family brawl over who will control one of the most high-profile global media groups when Rupert Murdoch dies. (Supplied: News Corp)\n\nThree of them — James, Elisabeth and Prudence — opposed the plan, which was devised by Rupert and Lachlan, and the dispute went before a court in Nevada last year.\n\nThe Murdoch companies: News Corp: The Australian newspaper, capital city tabloids including Sydney's The Daily Telegraph and Melbourne's The Herald Sun, Sky News Australia, REA Group including realestate.com.au, US newspapers including The Wall Street Journal and The New York Post, UK newspapers including The Sun and The Times.\n\nThe Australian newspaper, capital city tabloids including Sydney's The Daily Telegraph and Melbourne's The Herald Sun, Sky News Australia, REA Group including realestate.com.au, US newspapers including The Wall Street Journal and The New York Post, UK newspapers including The Sun and The Times. Fox Corp: Fox News, Fox Sports (US), Fox Entertainment. Former prime minister Tony Abbott is a director.\n\nIn December, the court's probate commissioner found Lachlan and his father had acted in \"bad faith\", and ruled in favour of the three siblings.\n\n\"The effort was an attempt to stack the deck in Lachlan Murdoch's favour after Rupert Murdoch's passing so that the succession would be immutable,\" the commissioner wrote. Rupert had vowed to appeal.\n\nNow, a Fox Corporation statement says the family has \"reached a mutual resolution of the legal proceeding in Nevada … resulting in the termination of all litigation\".\n\nJames, Elisabeth and Prudence will each receive more than $US1 billion ($1.52 billion) for their shares in the companies, The New York Times reported, citing an anonymous source with knowledge of the negotiations.\n\nFox said the three siblings would also be prevented from ever buying back into the companies.\n\nThe family trust will be resolved, and new trusts will be set up for Lachlan and his younger half-sisters, Chloe and Grace, who had a non-controlling stake in the original trust.\n\nABC/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-11/jacinta-nampijinpa-price-liberals-react-sacking/105760472",
        "title": "Ley apologises for Nampijinpa Price's remarks about Indian migrants",
        "publish_date": "Wed, 10 Sep 2025 22:52:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Opposition Leader Sussan Ley has apologised for Jacinta Nampijinpa Price's remarks that \"hurt\" Indian Australians eight days after they were first made.\n\n\"May I take this opportunity, as leader of the Liberal Party, to apologise to all Indian Australians and indeed others who were hurt and distressed by the comments that were made, comments that I said at the time should not have been made,\" Ms Ley said.\n\nLast Wednesday Senator Nampijinpa Price suggested the government was favouring Indian migrants to boost Labor's vote, setting off a firestorm within Indian community groups and the Coalition itself.\n\nShe was dumped from the front bench late yesterday after a hastily arranged press conference where the outspoken senator again refused to apologise for her remarks, and failed to back Ms Ley as opposition leader when asked, saying instead it was a \"matter for our party room\".\n\nMs Ley later called Senator Nampijinpa Price to advise that she would be sacked from the front bench, bookending a week of turmoil for the Liberal Party.\n\nThe opposition leader initially declined to apologise for the remarks, though she insisted they were wrong and would not be repeated.\n\nThe defiant NT senator has not apologised for her remarks, but says she regrets the clumsy way she expressed concerns about \"mass migration\".\n\nThis morning, Liberal allies of Senator Jacinta Nampijinpa Price said they expected she would return to a prominent role in time.\n\nBut they have backed Opposition Leader Sussan Ley's decision to dump her from the frontbench.\n\nSpeaking on Sky News, Shadow Finance Minister James Paterson said it had been a disappointing episode.\n\n\"I support Sussan Ley, I support her as our leader. I am very disappointed that this is where we have found ourselves because Jacinta is also a very good friend of mine, and I think she had a very big contribution to make on the frontbench.\n\n\"Political careers are not linear anymore; they have fits and starts, and forward steps and back steps, and I am confident Jacinta will be back in a prominent role in due course.\"\n\nSenator Paterson said he \"hoped\" Senator Nampijinpa Price would not behave as an agitator on the backbench, adding he did not believe that was how she would \"play these things\".\n\nLiberal allies of senator Jacinta Nampijinpa Price say Sussan Ley was right to sack her from the shadow ministry. (ABC News: Ian Cutmore)\n\nHe added that he did not expect Senator Nampijinpa Price to quit the party or return to the Nationals, from which she defected only four months ago.\n\nLiberal Deputy Ted O'Brien said one of the features of the party was the freedom to express ideas as they please.\n\n\"That has been a longstanding feature of the party … [but] words matter,\" Mr O'Brien told ABC News Breakfast.\n\n\"The Indian community here in Australia, they certainly did not ask to be the centre of political dialogue over the last week.\"\n\nSacking Jacinta Nampijinpa Price was Sussan Ley's only option, and she took it Photo shows A woman stands in front of a purple curtain Comments about Indian migrants were one thing, but refusing to back in her leader made it impossible for her to stay.\n\nMr O'Brien repeated that he wanted to send a clear message to Indian Australians that the Liberal Party welcomed them.\n\nHe said Ms Ley made the right decision to dump Senator Nampijinpa Price.\n\nNationals Senate leader Bridget McKenzie agreed that the senator could not remain in her role.\n\n\"This went on for too long,\" she told Channel Nine.\n\n\"Senator Nampijinpa Price united the country against Labor's divisive Voice referendum a couple of years ago, but the reality is in our system of government, whether you are in the Labor Party, the Liberal Party or the National Party, you have got to have confidence in your leader, and if you don't, the responsibility and onus is on you to resign.\n\n\"Usually, if ministers don't support the leader, they resign. I think she almost stumbled into the situation.\"\n\nMs Ley rejected a suggestion that her handling of the matter had put her leadership under threat.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-11/claudia-hollingsworth-world-athletics-championship/105756644",
        "title": "'Sky's the limit' for Claudia Hollingsworth at World Athletics Championships",
        "publish_date": "Wed, 10 Sep 2025 22:11:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "There are few who fly under the radar as much as Australian athlete Claudia Hollingsworth.\n\nThe humble 20-year-old is part of the golden-age record 88 Australian athletes that will start at the World Athletics Championships, beginning on Saturday in Tokyo.\n\nThe Olympic semi-finalist has been building all year for the championships, last month smashing the Australian 800m record at the Silesia Diamond League in a time of 1 minute, 57.67 seconds, bringing down Catriona Bisset's mark from two years ago.\n\nThat run also placed her 14th for the year among the women's 800 metres, and saw a world lead, another national record, and five other personal bests among a star-studded field of competitors.\n\n\"I feel like [the] sky is the limit,\" Hollingsworth said.\n\n\"Having Abbey [Caldwell] there and giving each other a hug after the race was really special,\" she said of breaking the Oceania record.\n\n\"And to get the record was amazing, and being in such a huge [stadium], with the crowds so big was great atmosphere and a great place to do it.\"\n\nWith the depth in Australian athletics, it's no surprise that Hollingsworth — who already has a silver medal from the 2024 World Athletics U20 Championships — will be joined by an Aussie cohort of Abbey Caldwell and Jessica Hull in Japan.\n\n\"I think it's awesome. We've pushed each other to these fast times,\" Hollingsworth said.\n\n\"And I think it's great seeing how many girls are running 1:58 or sub, and I know we can all go a lot quicker, and we're going to do that by helping each other.\n\n\"Seeing other people race just as fast and maybe faster is really motivating.\n\n\" The last few races have given me a lot of confidence going into the world champs, reiterating that I'm up there with the best in the world. \"\n\nSuch is the depth in track running that Sarah Billings (1:57.83), Georgia Griffith (1:59.22), Bendere Oboya (1:59.27) and Tess Kirsopp-Cole (1:59.95) have all broken through the sub-2 minute mark this year, while Bissett (former record holder) missed out on selection.\n\nOlympic medallists and Gout Gout join biggest Australian team for world champs Photo shows Gout Gout runs in a 200m race. Australian Athletics names its biggest-ever team for a global meet, with five Paris Olympic medallists and teenage sensation Gout Gout among an 88-strong squad.\n\nSuch is the pressure on the global stage, that no Australian woman has ever made the final in the 800m at the World Championships, with Caldwell falling agonisingly short by .06 seconds in the semi-finals at the last championships.\n\nInternally, the expectations for the youngest of them all, Hollingsworth to use the European summer and go to another level at Tokyo are high.\n\n\"Competing in those Diamond Leagues, putting yourself in those fields where they will be either in the final or at least the semi-final and, practising racing against those girls,\" she said.\n\n\"Each learning experience has really helped.\"\n\nHollingsworth doesn't shy away from the pressure she places on herself, looking to the future of her career.\n\n\"Going to LA, and Brisbane, making an Olympic final and medalling or being on the podium is a huge goal for me.\n\n\"I think a little bit [that the] sky's the limit. I'm going to the world champs, with I guess, expectations on myself, but also just to go out there and see how far I can go.\n\n\"I just want to take it race by race and each day by day in training, and I'm sure those goals will slowly start getting ticked off.\n\n\"The experience I get from Craig [coach Craig Mottram] is sort of unmatched and I try listening, take as much of that on board as I can.\"\n\nLoading...\n\nMaster and apprentice deal with pressures\n\nA four-time Olympian, Mottram has been coaching Hollingsworth since she was 12 and says her development on and off the track is different to other athletes he's coached.\n\n\"I think she's got a very strong personality; she's very resilient, she's grounded, she has a great family,\" Mottram said.\n\n\"She's got an exceptional ability — physically and mentally — to perform at the highest possible level, but in doing so keeps things very realistic and has a good time doing it.\n\n\"She's shown me a lot around the development of a young athlete, keeping a balance in life, having a home life and keeping consistency with things that you love doing.\n\n\"You can do all of that and still be one of the best in the world.\"\n\nMottram, who still holds the Australian men's 5,000m record set in 2004, knows what the pressure is like to be ahead of the pack, guiding Hollingsworth with a trusted relationship that has been built from hard work, frank conversations and understanding.\n\n\"We've had a few sit-downs over the years where we've spoken about expectations and what the sport of athletics is like, and what it's like in school versus what it's like internationally on a global scale,\" he said.\n\n\"I've obviously had a lot of experience through my 17–18 years of running at a high level.\n\n\"So sharing that with her I think gives her the knowledge and understanding that she can obviously go on and do it, and it gives a little bit of comfort.\n\n\"But also knowing the world of sport and athletics in particular has changed a lot — when I was running, records were not broken as frequently as they are at the moment.\n\n\" So I think it's just part of the development of our sport. And for Claudia in particular, I think she's broken her first record recently and she'll break many more to come. \"\n\nDespite all the success in Hollingsworth's young career, Mottram said what he sees on the track is only second to life off the track for the prodigy.\n\n\"Running in my opinion, is second to her as a person.\n\n\"I think if she keeps true to that she'll be fantastic and will do great things.\"\n\nLoading...\n\nJellybeans the keys to success for high-achieving family\n\nAs Hollingsworth gets a rare moment back on home soil, she embraces all that got her there — her family.\n\n\"I've come from a family that's just always told us to try our best and try everything,\" Hollingsworth said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I remember Dad saying when we joined high school, just give everything a go and give it your best shot.\n\n\"I think just having that attitude towards everything in life has really driven me and given me that determination and sort of expectations on myself.\n\n\"But if things don't go to plan, then [showing] that resilience to try again and not give up.\"\n\nFrom a twin sister, Gemma, who's been on stage for musicals such as Legally Blonde and on TV screens on The Voice, to another sister Sunday, a trampolinist on the global stage, both have helped show Claudia a pathway to taking on the world in her own way.\n\n\"It's not like a pushy family or anything like that. We all drive ourselves, so it's not really coming from Mum and Dad,\" she said.\n\n\"[They're] just there to support and give us a hug at the end of the day.\"\n\nThose hugs from Mum started with packed lunches growing up, where extra jellybeans were snuck in for a boost for swimming meets, athletics carnivals or \"just a bad day at school\".\n\nLoading Instagram content\n\nFrom there it stuck as a superstition, especially orange, purple and red flavours.\n\n\"I started having three or four jellybeans before every cross-country race and I just couldn't stop,\" she said.\n\n\" Maybe it's a good luck charm. It's fuel, it's energy. Getting any sort of lollies in before the race is important … I take a few bags overseas. \"\n\nAfter attending a training camp in Cairns, Hollingsworth now turns her focus to performing in the green and gold again, with heats beginning on Thursday, September 17 in the evening, and aiming for the breakthrough into the final on the Sunday night, October 21.\n\n\"Yeah, it's amazing. I feel so grateful and passionate every time I get to wear the uniform,\" Hollingsworth said.\n\n\"It's such an honour, and to know you're representing your whole country, it's not something everyone gets to do. When you get to do it, it's just incredible.\n\n\"On the start line, you feel like you have a responsibility and a job to do for the country.\n\n\"You want to make everyone proud and everyone watching.\n\n\"So yeah, it's just a lot of pride and excitement and I can't wait to get out there and see what I can do.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-11/satellite-images-show-wa-canola-fields-visible-from-space/105739264",
        "title": "Flowers bloom so bright they can be seen from space",
        "publish_date": "Wed, 10 Sep 2025 22:05:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "The start of spring in Western Australia is heralded by rolling fields of golden canola that light up the countryside from the Midwest down to the South Coast.\n\nThe impressive crop draws attention from photographers around the world and can even be seen from space.\n\nRecent satellite images capturing the crop have been highlighted by the Grains Research and Development Commission (GRDC).\n\nBut the paddocks of gold were not a part of WA's landscape until the 1960s, when canola was introduced from Canada.\n\nA canola field just outside of Northam, north-east of Perth. (Supplied: Cameron Hanks Photography)\n\nThe crop did not thrive in Australian conditions, so breeding programs began in the 1970s to develop varieties with better disease resistance and oil quality.\n\nGRDC WA regional manager Peter Bird said the introduction of herbicide-tolerant canola two decades later was \"really what kicked things off\".\n\n\"It's a crop you can't use herbicides on in its natural state, but it's also been a very temperamental type of crop,\" he said.\n\n\"The bugs love to eat it and a disease called blackleg and other diseases kind of wiped it out in these early years.\"\n\nThe Milky Way glows above a field of bright yellow canola in York, north of Perth. (Supplied: Paul Goh)\n\nMr Bird said strong investment in improving soil health and disease management in WA had led to canola becoming a \"reliable\" crop that could be grown in medium and low rainfall areas.\n\n\"It's been a really great success story for Western Australian farmers and now it's a big crop,\" he said.\n\nStrong canola forecast\n\nThe Australian Bureau of Agricultural and Resource Economics and Science's September Crop Report forecasts Australia will produce about 6.4 million tonnes of canola this year, 34 per cent above the 10-year average.\n\nThe report predicts WA will contribute 3.3 million tonnes, accounting for more than 50 per cent of the nation's production.\n\nCanola is grown between WA's Mid West and South Coast. (ABC Great Southern: Rhys Jones)\n\nMr Bird said most of WA's canola was exported to countries in Europe, the United Arab Emirates and South East Asia, generating about $1.2 billion annually for the state's economy.\n\nCanola generates billions of dollars for the Australian economy. (Supplied: Sprinkle Tinny)\n\nIncreasingly, canola oil is also manufactured into biofuel, a more environmentally-friendly fuel alternative, which Mr Bird said had been driving the price of canola higher than usual.\n\nGalaxy photos\n\nPerth-based photographer Paul Goh has been drawn to canola for years and recently started experimenting with astrophotography to enhance his pictures.\n\nPaul Goh has been experimenting with astrophotography of the canola fields near York. (Supplied: Paul Goh)\n\nHe said there was something special about the golden fields.\n\n\"Often [WA] is known for our minerals industry, but our agricultural industry, I feel, is just as important,\" he said.\n\n\" Canola is part of the Australian and Western Australian identity. \"\n\nMr Goh said he reminded people to be \"respectful of boundaries and the biosecurity of canola\" when he shared photos of fields to his social media platforms.\n\n\"It's certainly not worth contaminating or putting the crop at risk just to get the shot,\" he said.\n\nWA is forecast to produce more than 50 per cent of Australia's canola this year. (ABC Great Southern: Rhys Jones)\n\nMr Goh said he would probably head out again to the canola fields of York, 97 kilometres east of Perth, chasing the thrill of the perfect shot.\n\n\"When you see that first preview on the back of the screen and it looks how you intended it — the colours are vivid, the Milky Way looks clear — it's such a wonderful feeling,\" he said.\n\n\"You almost just want to get home and start editing straight away.\"\n\nCanola fields can be found in the Great Southern region of WA. (ABC Great Southern: Rhys Jones)\n\nHow's this season?\n\nThe Esperance region, 700 kilometres south-east of Perth, is the leading canola-producing area in the country.\n\nCascade farmer Mark Walter grows about 2,000 hectares of canola, west of Esperance.\n\nWhile reluctant to predict an exact figure, he believed his farm was on track for its best canola crop.\n\nCanola fields in the Esperance region can be seen from space. (Supplied: Digital Agriculture Services)\n\n\"We had a really good early start [with] 40 millimetres [of rain] through March, so seeded a reasonable amount of the canola early,\" he said.\n\n\"And then had 120 millimetres around Easter time, so we reseeded 700 hectares and the rest went in after that.\"\n\nCanola is exported as oil to South East Asia, the United Arab Emirates and Europe. (ABC Great Southern: Rhys Jones)\n\nEpasco Farms manager Nick Ruddenklau, who grows canola in Condingup, said it was a rocky start to the season.\n\nBut the forecast was \"looking really good\".\n\n\"The last two seasons were really short springs and that really knocked things around,\" Mr Ruddenklau said.\n\n\"So definitely more confident going into this spring with [hopefully] another rain in September, and another one in early October would be good.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/babies-need-a-rebrand-with-the-birthrate-in-freefall-we-re-overlooking-one-aspect-of-parenting-20250911-p5mu5r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Babies need a rebrand: with the birthrate in freefall, we’re overlooking one aspect of parenting",
        "publish_date": "Thu, 11 Sep 2025 11:51:16 +1000",
        "category": "lifestyle",
        "authors": [
            "Charlotte Mortlock"
        ],
        "text": "As a very new mother, I was prepared for breastfeeding to be a nightmare. For sleep to be non-existent. For a love unlike anything I’d ever experienced before. But no one braced me for comedy.\n\nEarlier this year, pop star Chappell Roan came under fire when she said the quiet bit out loud: she doesn’t know anyone with children who is happy, and those that have children “are in hell”. Are we surprised that Western civilisation is suffering from cataclysmic population shrinkage if that’s what pop stars are telling young fans? Who wants to willingly enter into 18 years of “hell”?\n\nYou have to laugh: Charlotte Mortlock with her baby.\n\nIt’s now likely we will see the global population starting to decline by the 2050s, just a few decades away. In Australia, this trend began in 2014, and we are now at a near-record low of 1.5 babies per woman, the lowest in almost two decades. In England and Wales, births have declined to a record low, and Japan, one of the worst-affected countries, is experiencing a net loss of 100 people each hour.\n\nSome will argue this will be good for the environment, but it will be catastrophic for economies, the vulnerable and the ageing with a smaller workforce burdened with covering nations’ taxes of and providing the labour and productivity needed to sustain them. Countries will be heavily dependent on migrants (even more so than now) and will likely compete to poach the most skilled and brightest from developing countries.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-wind-gusts-of-up-to-46km-h-buffet-brisbane-20250910-p5mtvo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Wind gusts of up to 46km/h buffet Brisbane | Motorists urged to avoid Main Street, Kangaroo Point and expect traffic delays | Signalling faults spark train cancellations and delays up to 30 minutes",
        "publish_date": "Thu, 11 Sep 2025 11:45:58 +1000",
        "category": "finance",
        "authors": [],
        "text": "The Queensland government says it will undertake an open recruitment and selection process for a new small business commissioner after the resignation of former retail lobby boss Dominique Lamb.\n\nDominique Lamb, Queensland’s small business commissioner. Credit: LinkedIn\n\nLamb will leave her role in three weeks, about three years after she was appointed by the former Labor government.\n\nSmall and Family Business Minister Steve Minnikin thanked Lamb for her contribution and said acting arrangements would be put in place so the office could keep delivering its work.\n\nThe announcement came two days after news emerged that Charles Burke would finish up as Queensland’s food farmers’ commissioner this week, at the end of his one-year term.\n\nPrimary Industries Minister Tony Perrett released a statement on Monday thanking Burke for his work, but did not say whether he intended to appoint a replacement for the role.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/albaneses-summit-shirt-faux-pas-20250911-p5mu6i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Albanese's summit shirt faux pas",
        "publish_date": "Thu, 11 Sep 2025 11:44:05 +1000",
        "category": "finance",
        "authors": [],
        "text": "Albanese's summit shirt faux pas\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-festival-review-the-platypus-takes-a-marriage-breakdown-through-the-multiverse-20250805-p5mkh9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane Festival review: The Platypus takes a marriage breakdown through the multiverse",
        "publish_date": "Thu, 11 Sep 2025 11:43:26 +1000",
        "category": "entertainment",
        "authors": [
            "Nick Dent"
        ],
        "text": "THE PLATYPUS ★★★★\n\nCremorne Theatre, QPAC, until September 13\n\nFrancis Greenslade is the hangdog-faced comedic actor familiar from Winners and Losers, as well as every TV show Shaun Micallef has ever made. His dour-yet-sparkling play The Platypus, which he has also directed, exhibits several Micallefian traits: surreally funny, unashamedly erudite, and underneath it all quite cutting and acerbic.\n\nLike the titular egg-laying mammal, it’s something of a paradox – a laugh riot about the slow death of a marriage. Jess (Rebecca Bower) and Richard (John Leary) are a 40-ish Brisbane couple dealing with things most couples deal with: health issues, money worries and an unseen child who’s way too fond of his phone.\n\nRebecca Bower and John Leary play a bickering couple – and many other characters – in The Platypus. Credit: Mark Gambino\n\nThey irritate the hell out of each other, and can’t get things together in the bedroom. Both have their eyes on other people. Bower and Leary play all the additional characters, with deft character work and costume touches to make it clear who’s who.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/emotions-are-high-essendon-ceo-won-t-guarantee-captaincy-for-merrett-howe-expects-to-play-in-preliminary-final-20250911-p5mu6p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Emotions are high’: Essendon CEO won’t guarantee captaincy for Merrett; Howe expects to play in preliminary final",
        "publish_date": "Thu, 11 Sep 2025 11:42:00 +1000",
        "category": "sports",
        "authors": [
            "Andrew Wu",
            "Marc Mcgowan"
        ],
        "text": "The morning after coach Brad Scott insisted Merrett would not be traded under any circumstances , Vozzo said the club’s relationship with their on-field leader could be mended despite their best player’s face-to-face meeting with Hawthorn coach Sam Mitchell.\n\nAndrew Wu Essendon chief Craig Vozzo has refused to guarantee Zach Merrett will remain as captain if he stays at the club, saying players will have a major say in whether the disgruntled skipper retains the role next year.\n\nThe Bombers are maintaining their hard line on Merrett, whose future at the struggling club is up in the air due to the Bombers’ poor performances on the field, for the second off-season in a row.\n\nThough Merrett has not formally requested a trade, his desire to get out of the Hangar has placed his position as captain in doubt if the Bombers hold him to his contract, which expires at the end of 2028.\n\n“Can he remain captain? It’s a really complex one. It’s one now you need to deal with in a calm way, you can’t deal with it today,” Vozzo said on SEN on Thursday morning.\n\n“Today, the emotions are really, really high. My emotions are high, don’t get me wrong. If I was making an emotional decision today, I’d say ‘no way Zach can be the captain of the club’.\n\n“But it doesn’t work like that, you have to take the emotion out of it, understanding the honour and the privilege.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/theatre/ghosts-bowerbirds-and-logie-giveaways-inside-the-very-curious-world-of-lisa-mccune-20250908-p5mt7v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ghosts, bowerbirds and Logie giveaways: Inside the very curious world of Lisa McCune",
        "publish_date": "Thu, 11 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Elizabeth Flux"
        ],
        "text": "Instead, her walls are covered with a constantly changing collection of art. Right now, she is working her way through the city’s different op shops to find different images of flowers. “I’m a real bowerbird,” she says with a laugh. “It’s amazing when people donate things like their grandmother’s old floral paintings that she did for some competition. I’ve got this beautiful tiny gold one, and it’s golden sunflowers in this really ornate frame.” Sauteed spinach and gnocchi pomodoro Credit: Simon Schluter The idea of wanting to try new things, to not be predictable, is something that comes up again in different ways across the afternoon. We order gnocchi, spinach and steak tartare to share. McCune is the one to suggest ordering the latter, and when it arrives with a side of crisps, she looks at it with interest. “My kids would love this,” she says, explaining that for her, normally she tends towards vegetables and beans. “I’m challenging my palette,” she adds with a smile, mixing the egg into the steak. She takes a bite and a small piece falls on her plate. “Oh, disaster!” she says, and then: “It is really good.” McCune is warm, easy to laugh, and occasionally puckish. When photographer Simon Schluter arrives, they greet each other warmly – they’ve worked together before – and after he’s taken a few shots through the window, she looks through at him, says, “ooh he’ll hate this”, then carefully spoons a wad of spinach in front of her top teeth and shoots him a wide grin.\n\nMcCune was born in Sydney, grew up in Perth, trained at WAAPA and then acting brought her to Melbourne where she still lives. From a young age, her interest was quite firmly fixed on musical theatre, so she originally thought that was where her career would be headed. “I came out of drama school, and I got a great agent, and she said to me, I think you’re going to do work in television. And I was like, ‘Oh, I hadn’t thought about that’.” One of her first jobs was a series of ads for Coles supermarkets. “I remember just being so utterly excited by what the camera could do and how that worked.” Soon afterwards, she was cast in Blue Heelers where she quickly became a household name. “Professionally for me, I was exposed to a lot of really great writers, a lot of really good actors and directors,” she reflects. “So as a young actor, it’s a fantastic place to be because just in and out of the door every week were really great people who were at the top of their game [which] taught me a lot about humility and about working hard and always being respectful.” Lisa McCune in a scene from Blue Heelers in 1995. Her love of collaboration has carried through the decades that followed. “I’m not one of those actors that is desperate to do a one-person show,” she says. “I love working with people.”\n\nThe 39 Steps has four actors performing a large number of roles. “I think it makes people laugh because it’s so mad … There’s a lot of shadow play, lots of old theatrical tricks to create illusions.” Lisa McCune and Ian Stenlake in a scene from The 39 Steps. Credit: Cameron Grant The play is inspired by the 1935 Hitchcock film, which in turn was adapted from John Buchan’s 1915 novel. McCune stars alongside Ian Stenlake, David Collins and Shane Dundas – the latter two perhaps better known as The Umbilical Brothers. “I’ve been so inspired by the team on 39 Steps,” McCune says. “It’s been so enjoyable creatively”. As we make our way through the plate of gnocchi, the conversation hops from technology (“I subscribe to this thing called The Rundown – it’s a newsletter that comes out pretty much every day about AI and what’s happening on that day, because it’s just changing so much”), to gardening and the price of coffee. McCune’s quiet but sharp curiosity and interest in stories spills out beyond her acting. Across the course of the meal, she looks around and wonders about the other people around us – whether they work nearby, whether they are local, whether this is their first time eating here or if it’s a favourite spot of theirs.\n\nShe tells me about the book she’s reading – about photographer Max Dupain – and about a recent visit to the remounted French Impressionism Exhibition at the NGV. Loading “There was this really interesting man, and he had a seat with him. He sat, and he was writing copious notes in a tiny notebook,” she recalls. “And when he stood up to move away from the painting, I said to him, ‘Hello, I find you just as fascinating as the painting. What are you doing?’” The man explained that he was an academic with a focus on art and that he studied the Impressionists. From there, they went on to talk about the paintings around them. When something grabs her interest, she doesn’t let it stop at curiosity – she digs in and asks questions. “I just gather bizarre knowledge,” she says with a laugh. “The other day, I stopped in Sydney to talk to some stonemasons working on a building early in the morning. I went up to the gardens to go for a walk … and they told me all about this building they were working on. And then that sent me kind of looking for a book about it.” She pauses. “I love that moment of going, ‘oh, my God, I didn’t know that’.”\n\nThis curiosity extends to her family history. About a decade back, she was the subject of an episode of Who Do You Think You Are? which traced multiple generations of McCune’s family. Since then, “every summer when I’ve got a bit of a break over that Christmas period, I’ll delve into it”. The bill at The European. Credit: When her research uncovered an address, “I went and knocked on the door in Elsternwick, and the guy that lived there said, ‘Yeah, that family did live here!’, and he invited the old lady down the road,” she recalls. “She came down one Sunday, and we all sat around and she told me about her memories of the family,” she pauses. “Oral history opens up doors that I think a lot of written history doesn’t hold.” Each year has a different shape for McCune. “I just wake up every day and just think, what’s the phone call that’s going to come today?” The time in between, however, is very full. There’s her family, her production company, and a driving curiosity that often sends her down a chain of reading and research and questioning.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/the-college-dropout-who-just-became-the-world-s-richest-person-20250911-p5mu4d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The college dropout who just became the world’s richest person",
        "publish_date": "Thu, 11 Sep 2025 11:26:54 +1000",
        "category": "finance",
        "authors": [
            "Diana Li",
            "Brody Ford",
            "Anders Melin"
        ],
        "text": "The increase lifted his total net worth to $US383.2 billion. It’s the biggest one-day increase ever recorded, and put him ahead of Musk for much of the day before the Tesla CEO edged back into pole position by $US1 billion. How did Ellison make his fortune on Oracle? Raised on the south side of Chicago after being adopted by his mother’s aunt and uncle when he was nine months old, Ellison dropped out of both the University of Illinois and the University of Chicago and moved to Berkeley, California, taking a computer programming job at Ampex, where he worked on a database called Oracle for the Central Intelligence Agency. Ellison has also benefited from a close relationship with US President Donald Trump. Credit: Bloomberg With two partners, Ellison founded in 1977 what eventually became Oracle. The company sold shares in an initial public offering on March 12, 1986, a day before Microsoft’s IPO. He stepped down as Oracle’s chief executive officer in September 2014, taking on the titles of chairman and chief technology officer.\n\nLoading Why is Oracle having a moment right now? Oracle has invested billions of dollars over the past few years to become a provider of cloud infrastructure, offering computing power and storage over the internet. The firm has benefited from the enthusiasm for artificial intelligence as start-ups and other AI firms seek more capacity. As of early September, Oracle’s share price had tripled since the public release of ChatGPT in November 2022. It hit an all-time high after market close in New York on September 9, as Oracle provided an aggressive outlook for its cloud business that surprised Wall Street and galvanised hopes that the global build-out of AI infrastructure is accelerating. It was a win for a company that was already having a good year. In July, Oracle inked an unprecedented commitment with ChatGPT operator OpenAI for 4.5 gigawatts worth of data-centre capacity – enough energy to power millions of American homes. Oracle also counts companies such as Nvidia and ByteDance’s TikTok as major cloud customers. Taken together, this shows how Oracle is emerging as a key provider of such computing capacity, competing with cloud leaders Amazon, Microsoft and Alphabet’s Google.\n\nEllison has also benefited from a close relationship with US President Donald Trump. Ellison has been a Trump supporter and Republican donor for years. Since Trump returned to office in January, he’s rewarded Ellison by elevating Oracle on multiple occasions. Ellison also owns a stake in Tesla. Credit: Bloomberg Ellison and Oracle are part of a $US500 billion AI infrastructure project called Stargate that Trump first touted in January. Trump has expressed support for Oracle to acquire a partial stake in the US business of TikTok, which would give Oracle a share of one of the world’s most popular consumer products. Oracle’s bid for the popular video app owned by China’s ByteDance, which includes several other potential investors, has been endorsed by Trump, but hasn’t been approved by the Chinese government. What other businesses does Ellison own? He’s spent hundreds of millions of dollars on luxury real estate in the past decade, including properties in Malibu and Rancho Mirage in California; the Beechwood Mansion in Newport, Rhode Island; and an estate in the San Francisco Bay Area modelled on 16th century Japanese feudal architecture.\n\nEllison has been a major shareholder of Tesla and owned about 1.5 per cent of the company as of the carmaker’s 2022 proxy statement. He stepped down from Tesla’s board of directors in June that year, and his stake hasn’t been disclosed in subsequent filings. He was also one of the largest outside backers of Musk’s bid to purchase Twitter, which has since been renamed X. What are Ellison’s interests outside of tech? The software mogul has a history of lavish living. In a 2002 email to the tech founder, an accountant suggested that Ellison “budget and plan” because his spending habits were becoming difficult to sustain, according to a January 2006 San Francisco Chronicle article. Ellison finances his lifestyle using debt and the proceeds from Oracle stock sales and dividends, which have amounted to more than $US12 billion since 2003, according to an analysis of data compiled by Bloomberg. He’s an avid sailor and partially financed the BMW Oracle Racing team, which won the America’s Cup in February 2010. He sold his stake in Rising Sun, a 138-metre megayacht, to billionaire David Geffen later that year. Ellison’s Oracle Team USA defended the America’s Cup in October 2013, defeating a team from New Zealand. He signed the Giving Pledge in 2010, promising to give away at least 95 per cent of his wealth to charitable causes.\n\nLoading How has Ellison been involved in Hawaii? Ellison’s love for Hawaii, which began in his childhood, led to his $US300 million purchase of 98 per cent of the island of Lanai in 2012. There, he’s partnered with David Agus – a doctor who treated Ellison’s late best friend, Steve Jobs – to create Sensei, a chain of luxury wellness resorts focused on longevity. His personal connections have brought high-profile visitors including Musk, Hollywood actor Tom Cruise and Israeli Prime Minister Benjamin Netanyahu to the once-sleepy island. Ellison’s supporters have said his investments have helped revitalise Lanai but there have been complaints that the island has become more hospitable to the super-rich while squeezing out families that have lived there for generations. Bloomberg",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-wall-street-advances-as-inflation-slows-oracle-surges-20250911-p5mu3t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX trades lower as banks decline; Gold miners jump",
        "publish_date": "Thu, 11 Sep 2025 11:12:42 +1000",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "The Australian sharemarket has retreated in early trade, with financial and health stocks weighing on the index, but gold miners continued to rise.\n\nThe S&P/ASX 200 was 14.9 points, or 0.2 per cent, lower at 8815.5 at 11.04am AEST, with seven of 11 industry sectors in the red. The Australian dollar was fetching US66.14¢ at 10.35am AEST.\n\nWall Street’s benchmark index is on its way to another record close. Credit: Bloomberg\n\nFinancial stocks lost ground, with NAB and Westpac each falling 0.9 per cent, ANZ down 1.1 per cent and the Commonwealth Bank shedding 0.7 per cent.\n\nMining stocks were mixed with iron ore heavyweights BHP down 0.1 per cent and Fortescue and Rio Tinto up 0.4 per cent and 0.1 per cent, respectively. Gold miners jumped after the price of the safe-haven continued to march higher. Resolute Mining surged 5.7 per cent, Evolution Mining rose 4.8 per cent, Newmont jumped 2.6 per cent and Northern Star added 3.2 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-only-person-who-crossed-the-line-at-geelong-on-wednesday-was-bailey-smith-20250911-p5mu58.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The only person who crossed the line at Geelong on Wednesday was Bailey Smith",
        "publish_date": "Thu, 11 Sep 2025 11:11:23 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "He was the only one who crossed the boundaries of civility. Those boundaries are necessary to avoid unnecessary drama around the whole unusual interaction that occurs daily between athletes and everyone else in professional sport. No potential defence stacks up. Bailey Smith, Max Holmes and Gryan Miers. Credit: Getty Images Why did he choose to pick on a local photographer who has done her job well and without drama for 25 years? If he wanted privacy for the massage, get it done inside the rooms. Or head to Mars (Stadium).\n\nIf that wasn’t possible and it was an issue, ask a media official or football manager whether the photographer could refrain from taking a photo at that point. If Smith was having a bad day, that’s life. I can bet with certainty there were people within the stadium that day who had personal battles of their own. We all want Smith to feel well, given the mental health struggles he has shared. But having mental health issues doesn’t mean anyone should get a pass for bad behaviour. That’s a stereotype better left to history.\n\nSo it comes back to a basic question: why? It would be the same question you would ask a mate if he turned up at your party and abused one of your lifelong friends. If he or she then wondered why you were making such a fuss, then you wouldn’t invite them back. Perhaps Smith just has a reality TV star’s penchant for drama, and we are all being played. But Wynd, the News Corp photographer, was not being intrusive. She wasn’t doorstopping, nor pointing her lens into a space thousands of cameras haven’t been before.\n\nStill, Smith treated her like a paparazzi photographer, using demeaning language to show his disdain. It was, to use a word Jack Ginnivan deployed well when doorstopped in Adelaide, embarrassing. It’s not as though media people wilt either. Wynd and others are used to the cut and thrust that comes with being in this business. But we all know when a line is crossed. It would be unfair to write that Geelong have let Smith get away with this sort of petulance. They are working hard to shift his behaviour in the right direction, as the Western Bulldogs did before them. Geelong are choosing to do so in the background rather than via a public dressing down or punitive measures. That’s fine. I respect that strategy. But the Cats’ brand, one they have been working hard to maintain, is taking a hit as a result.\n\nEveryone knows Smith’s form on the field has people inside the club contorting themselves to explain his positive attributes, of which, it must be said, there are many. That is unfortunate because the players are among the finer groups in the competition, respected within the community and outside the club, a legacy built over 20 years at least. They continue to look after their mate and he could show some gratitude for that. The best way to do that is through his actions. Coach Chris Scott is in a tough position too, but his intent is to help Smith through rather than bow to the baying mob, who want Smith to pay publicly. It’s a strength of Scott’s and preferable to the punitive approach the AFL takes. However, he can no longer rate Smith’s season a 10/10 because that well-meaning show of support doesn’t pass the pub test – or any other test for that matter, although I respect his obligation to defend his player.\n\nLoading Smith won’t be the first or the last with a dim view of the mainstream media, particularly as the world fragments. But if he’s smart, he will learn how to deal with people inside a stadium a community built. Because when mainstream media are invited into GMHBA Stadium, they don’t leave their phones or cameras in a basket at the front door. Right now, Smith’s big-city attitudes aren’t going down well. Geelong want to embrace him. For the most part, they have. They want to protect him from intrusion as he tries to enjoy the best the coast has to offer. He’s helping them in the quest for a premiership and is a Brownlow chance.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/embattled-anu-vice-chancellor-to-resign-amid-staff-fury-20250911-p5mu6d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Embattled ANU vice chancellor resigns amid staff fury",
        "publish_date": "Thu, 11 Sep 2025 11:07:03 +1000",
        "category": "finance",
        "authors": [
            "Natassia Chrysanthos",
            "Christopher Harris"
        ],
        "text": "Embattled Australian National University vice chancellor Genevieve Bell is expected to announce her resignation on Thursday, after a tumultuous period for the institution.\n\nSources with knowledge of the situation, but not authorised to speak about it, said Bell had tendered her resignation to the council on Wednesday night. The university was expected to announce it on Thursday.\n\nGenevieve Bell appears before a parliamentary committee in January. Credit: Alex Ellinghausen\n\nANU’s council, headed by former Liberal foreign minister Julie Bishop, appointed Bell as vice chancellor in September 2023.\n\nThe university has been racked by a year-long public relations nightmare, which began when it revealed plans to axe scores of jobs in a bid to put it on track to financial sustainability.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/what-we-know-about-prince-harry-and-king-charles-reuniting-20250911-p5mu7s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What we know about Prince Harry and King Charles reuniting",
        "publish_date": "Thu, 11 Sep 2025 11:04:33 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "What we know about Prince Harry and King Charles reuniting\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/inside-the-new-9honey-series-crown-duels-20250911-p5mu8n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inside the new 9Honey series Crown Duels",
        "publish_date": "Thu, 11 Sep 2025 11:00:14 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Inside the new 9Honey series Crown Duels\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/princess-of-wales-set-to-host-event-alongside-melania-trump-20250911-p5mu83.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Princess of Wales set to host event alongside Melania Trump",
        "publish_date": "Thu, 11 Sep 2025 10:53:22 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Princess of Wales set to host event alongside Melania Trump\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/winning-is-what-i-ve-done-backed-by-long-time-allies-ange-makes-bold-arrival-at-forest-20250911-p5mu78.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Winning … is what I’ve done’: Backed by long-time allies, Ange makes bold arrival at Forest",
        "publish_date": "Thu, 11 Sep 2025 10:52:15 +1000",
        "category": "sports",
        "authors": [
            "Ian Chadband"
        ],
        "text": "Ange Postecoglou has declared he’s determined to take two-time European Cup winners Nottingham Forest back to their “rightful place” in English football, reminding his new club’s fans: “I love winning things – that’s what I’ve done.”\n\nFour months since leaving Tottenham as Europa League champions, Postecoglou has made it clear he wants to help transport the English Midlands outfit back to the days when they ruled the continental game under Brian Clough.\n\n“I get a sense the club wants more and that’s certainly what I want, so it’s a really exciting time,” said the 60-year-old, who – it was also confirmed on Wednesday – has brought his backroom coaching staff from Spurs with him to the City Ground.\n\n“I love winning things and that’s what I want to do here.”",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/ley-apologises-to-indian-australians-says-price-remains-valued-party-member/li9efqs2v",
        "title": "Ley apologises to Indian Australians, says Price remains 'valued' party member after sacking",
        "publish_date": "Thu, 11 Sep 2025 01:45:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Opposition leader Sussan Ley has apologised to Indian Australians over Jacinta Nampijinpa Price's inflammatory remarks after sacking the senator from the Opposition frontbench.\n\n\n\n\n\n\"May I take this opportunity, as leader of the Liberal Party, to apologise to all Indian Australians and indeed others who were hurt and distressed by the comments that were made,\" Ley said at a press conference on Thursday.\n\n\n\n\n\n\"May I reaffirm my strong support for all our migrant communities for the values that they bring to this country, for the contribution they make and for choosing to come to Australia.\"\n\n\n\n\n\nPrice last week falsely claimed the federal government was prioritising Indian migrants to bolster its vote. She moved to clarify her remarks , saying she was highlighting general concern for Labor's \"mass migration agenda\" and when pushed on this further on Wednesday, said they were \"clumsy\" but again did not apologise. She also refused to endorse Ley's leadership.\n\n\n\n\n\nHours later, Price was dumped from the frontbench, with Ley saying the Northern Territory senator had failed to uphold the standards she had set as leader. The Opposition leader said Price had refused to apologise for her remarks that caused Indian Australians \"significant hurt\", and refused to endorse her leadership, which had made her position untenable.\n\n\n\nPrice said she accepted the decision, adding she regretted not being clearer when making the comments initially and that she \"never intended to be disparaging towards our Indian community\".\n\n\n\n\n\n\"My concern is not migration itself — it’s the magnitude of migration,\" Price said.\n\n\n\n\n\nShe said she would \"continue to speak up on issues which are in the national interest\" from the backbench.\n\n\n\n\n\nLey on Thursday wouldn't divulge her \"private discussions\" with Price, but said she remained a \"valued member\" of the Liberal Party.\n\n\n\n\n\n\"[Price] has contributed much in public policy and debate in this country and will continue to do so,\" Ley said.\n\n\n\nLey said a decision on Price's replacement in the Opposition cabinet will be made in due course.\n\n\n\n\n\nPrice was Opposition spokesperson for defence industry until her demotion.\n\n\n\n\n\nOpposition finance spokesman James Paterson said the axing was disappointing, but was confident his Senate colleague would return to a prominent position within the Liberal party.\n\n\n\n\n\n\"It was self-evidently not an edifying week for the Liberal Party and we are concerned about the way in which Indian Australians heard that discussion and felt about that,\" he told Sky News on Thursday.\n\n\n\n\n\n\"Political careers are not linear any more, they have fits and starts, forward steps and back steps, and I'm confident that Jacinta will be back in a prominent role in the front bench.\"\n\n\n\n\n\nDeputy opposition leader Ted O'Brien said while Price had the freedom to speak out on issues, her comments had to be dealt with and Ley made the right decision.\n\n\n\n\n\n\"Words can sometimes be positive and help someone out, or words can hurt, and I think we all have to be mindful, no matter what we do in life, to try to choose our words as best as we can.\"\n\n\n\n\n\nPrice had defected from the Nationals to sit in the Liberal party room, shortly after the Coalition's election defeat in May.\n\n\n\n\n\n— With reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/girt-by-sea-explained-national-anthem-now-in-60-languages/z1ycvk2zl",
        "title": "'Girt by sea' explained: National anthem now in 60+ languages",
        "publish_date": "Wed, 10 Sep 2025 22:04:13 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The Australian National Anthem and Citizenship Pledge will be accessible to millions of new Australians after they were translated in more than 60 languages in a landmark initiative by SBS Audio.\n\n\n\n\n\nThe project will be formally launched on Citizenship Day on 17 September at a special citizenship ceremony at Government House in Canberra presided over by Governor-General Sam Mostyn AC.\n\n\n\n\n\nThe ceremony will celebrate our newest Australians, recognising the valued contribution of those from diverse migrant and refugee backgrounds to Australian society.\n\n\n\n\n\nThe initiative is available for free and online and features many of the languages most commonly spoken by new migrants and refugee communities in Australia.\n\n\n\nREAD MORE Australia's national anthem has been reimagined by this Aboriginal rapper\n\nMostyn said the national anthem held a distinctive place in Australia's shared story and commended SBS for the initiative.\n\n\n\n\n\n\"Making it available in many of the languages spoken across our nation will help all Australians understand the beauty and symbolism behind the words we hear at our national commemorations, events, school assemblies and more,\" she said.\n\n\n\n\n\n\"These are moments that make me proud to be Australian.\"\n\n\n\n\n\nSBS's Acting Managing Director Jane Palfreyman said multiculturalism was one of Australia's great strengths and the initiative demonstrated a celebration of our differences.\n\n\n\n\n\n\"SBS is helping ensure every Australian can engage with these national symbols in ways that reflect and respect our shared diversity,\" she said.\n\n\n\n\n\nDavid Hua, SBS's Director of Language and Audio Content, said for 50 years it had been the broadcaster's purpose to reflect Australia and foster a more cohesive society.\n\n\n\n\n\n\"The national anthem is something we all hear often, and this project makes it more accessible, building belonging and pride by deepening understanding of its meaning,\" he said.\n\n\n\n\n\nThis initiative follows SBS’s successful delivery of multilingual versions of Acknowledgement of Country, Ode of Remembrance, and Uluru Statement from the Heart over recent years.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/how-much-you-need-for-a-comfortable-retirement-nab-latest-to-cut-jobs/lvwy0rsjq",
        "title": "How much you need for a comfortable retirement? | NAB latest to cut jobs",
        "publish_date": "Wed, 10 Sep 2025 07:40:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-what-does-israels-puzzling-strike-on-qatar-mean-for-a-gaza-peace-deal/8abz5pbkq",
        "title": "INTERVIEW: What does Israel's 'puzzling' strike on Qatar mean for a Gaza peace deal?",
        "publish_date": "Wed, 10 Sep 2025 07:34:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/climate-change-and-chinas-charm-australias-pressing-role-to-play-in-the-pacific/7fa8tbhia",
        "title": "Climate Change and China's Charm: Australia's pressing role to play in the Pacific",
        "publish_date": "Wed, 10 Sep 2025 07:30:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIn the heat of Honiara, Pacific leaders and diplomats are gathering in the Solomon Islands capital for the region's paramount political meeting.\n\n\n\n\n\nHigh on the agenda for this year's forum is stronger action on climate change, maintaining regional security, and a review of regional partnerships.\n\n\n\n\n\nClimate change is one of, if not the most pressing, security threats faced by Pacific Island nations.\n\n\n\n\n\nAs China and Australia compete for influence in the region, Climate Council Researcher Wesley Morgan says strong climate action could help Australia cement its position.\n\n\n\n\n\n\"Australia is deeply concerned about China's growing influence in the region. So in 2022 China signed a security deal with Solomon Islands, and Australia is keen to avoid a situation where other countries sign security deals with China. For their part, Pacific Island countries are crystal clear that climate change is their single greatest security threat. So if Australia is to really cement its place as a security partner for Pacific governments, Australia will need to be taking action to address climate change, and that means setting as strong a target as possible to cut emissions over the next decade.\"\n\n\n\n\n\nOne outcome expected at the 2025 Forum is the establishment of the region's new climate fund, The Pacific Resilience Facility.\n\n\n\n\n\nSet to be signed and ratified during the summit, the fund is the first Pacific-led, owned, and managed financing mechanism in the region.\n\n\n\n\n\nPressure is also on the Australian government to secure the hosting rights for the next annual COP31 Climate Summit, which Turkiye is now also bidding for.\n\n\n\n\n\nPrime Minister Anthony Albanese says climate action is key to credibility in the Pacific.\n\n\n\n\n\n\"We will contribute an initial $100 million I have confirmed for that. This is more than a fund, it's a promise to Pacific communities they will not face climate threats alone.\"\n\n\n\n\n\nOn regional security, Prime Minister Anthony Albanese says he will negotiate an upgrade to the security agreement with Fiji.\n\n\n\n\n\nMr Albanese skipped day one of the forum for a detour to Vanuatu, where he failed to sign a long-awaited security and development deal with Vanuatu.\n\n\n\n\n\nWith the future of the Nakamal agreement hanging in the balance, Vanuatu's leadership says concerns persist over the deals possible impact on their ability to accept foreign funding for critical infrastructure.\n\n\n\n\n\nBased in Vanuatu, Dr Tess Newton-Cain is an Adjunct Associate Professor at the Griffith Asia Institute.\n\n\n\n\n\n\"Their impetus, their main driver, is to ensure that they have available to them the resources that they need to guarantee human security in Vanuatu, and that means working with a wide range of partners, and they do not see in their short to medium term, they do not see any scope for entering into something that would limit the choice of partners they work with .\"\n\n\n\n\n\nA previous security agreement in 2022, which would have given Australia power to veto Chinese investment in Vanuatu's critical infrastructure, failed to materialise in 2022 over similar concerns.\n\n\n\n\n\nDr Newton-Cain says that Australia has the opportunity to prove itself as a friend to Vanuatu by giving them time to find an agreement that benefits both.\n\n\n\n\n\n\"Bearing in mind what happened in 2022, Australia knows that you need to kind of commit to the process, and that it's not a single swipe of a pen, that there is going to be that need for the Vanuatu leadership to have satisfied its own people, the opposition and the community at large, that there has been sufficient consultation and that Vanuatu interests are being protected.\"\n\n\n\n\n\nOver the past year, Chinese military presence has reached new levels in the Pacific.\n\n\n\n\n\nFrom staging a live fire military exercise in the waters between Australia and New Zealand to conducting its first intercontinental ballistic missile test in the Pacific since 1980, China has not been coy about its strategic interests in the region.\n\n\n\n\n\nJoel Nilon is the Pacific Fellow at the Pacific Security College at the Australian National University.\n\n\n\n\n\nHe says one key outcome expected at the forum is the signing of Fiji's proposed 'Ocean of Peace' Declaration.\n\n\n\n\n\n\" This will be a declaration that is about sort of ensuring the region remain a sort of zone of peace free from conflict. It will set out a number of principles, you know, related to prevention of conflicts, upholding the rule of law, not only for foreign countries, but also for partners.\"\n\n\n\n\n\nAhead of the summit, China gifted the Solomon Islands a fleet of 27 new vehicles to drive delegates around during the forum.\n\n\n\n\n\nThat same day, Australia also gifted the Solomon Islands a fleet of 61 new police vehicles.\n\n\n\n\n\nLocal papers on the Pacific nation ran two full page articles about the gifted vehicles, side by side, headlined almost identically.\n\n\n\n\n\nMihai Sora is Program Director of the Pacific Islands Program at the Lowy Institute.\n\n\n\n\n\nHe says these gifts are a way to build relationships from the outside.\n\n\n\n\n\n\"That's the vector by which they can increase the influence with the relevant local security actors, in the absence of the military in Solomon Islands, for example, or Navy. They use the police force to build up those relationships ... So that's really that's that's really the dynamics that's that's at play there. For Australia, one concern is also that you know in accommodating an increased Chinese security presence, established relationships that Australia has that are sanctioned by the Pacific Islands Forum would be sort of elbowed out. You know, there's only so much bandwidth for a trusted partner and so hence China and Australia are vying to be that trusted partner.\"\n\n\n\n\n\nAnother key agenda item is a review of regional partnerships in the Pacific, which will look at how regional meetings operate and even how external partners engage with the forum.\n\n\n\n\n\nThe Pacific Island Forum has 18 full members and around two dozen external partners, including China, Taiwan and the United States.\n\n\n\n\n\nSparking backlash, this year's host and ally of China the Solomon Islands, opted not to invite any external partners.\n\n\n\n\n\nWhile the official reasoning cited the unfinished review of regional partnerships, Mihai Sora says he believes it was done appease China, as well as other members who recognise Taiwan.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/breakthrough-chlamydia-vaccine-offers-hope-for-endangered-koalas/jl6wrui1l",
        "title": "Breakthrough chlamydia vaccine offers hope for endangered koalas",
        "publish_date": "Wed, 10 Sep 2025 07:09:37 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A breakthrough vaccine for a common sexually transmitted disease has provided fresh hope for Australia's most beloved endangered animal — and maybe a blueprint for human use.\n\n\n\n\n\nResearchers at the University of the Sunshine Coast spent more than a decade developing a single-use vaccine for chlamydia in koalas.\n\n\n\n\n\nAfter habitat loss and vehicle strikes, chlamydia is one of the main threats to koala populations , leading to blindness, pneumonia, urinary and reproductive tract infections, infertility and death.\n\n\n\n\n\n\"Chlamydial disease affects 50 per cent or more of all koala populations, so we need a new tool,\" said professor Peter Timms, from the university's Centre for Bioinnovation.\n\n\n\nREAD MORE Fewer than 200 wild koalas survive near this NSW town. The locals hope to change that\n\nThe vaccine has been approved by the national regulator, the Australian Pesticides and Veterinary Medical Authority.\n\n\n\n\n\nTimms said studies on koala populations using the vaccine over a 10-year period had shown reduced rates of disease and improved health outcomes, particularly for animals of breeding age.\n\n\n\n\n\nHe hoped the vaccine would begin to be rolled out early in 2026, starting with koalas in wildlife hospitals before progressing to wild populations.\n\n\n\n\n\nTimms said there was evidence that koalas became more vulnerable to chlamydia outbreaks because of long-term stress caused by habitat loss, bushfires and drought.\n\n\n\n\n\n\"We have got examples in places like northern NSW where chlamydia infection levels have gone from very low to nearly 80 (per cent),\" he said.\n\n\n\nWhile increased rates of chlamydial disease were related to fragmentation of koala populations due to land clearing, Timms said habitat loss remained the greatest threat to the koala's survival overall.\n\n\n\n\n\n\"The problem with trees is that it takes a long time for them to grow, whereas a vaccine for chlamydial treatment can work immediately,\" he said.\n\n\n\n\n\nTimms said the development of the vaccine had the potential to help in the fight against chlamydia in humans.\n\n\n\nThe World Health Organization estimated that in 2020, there were more than 128 million new infections among people aged 15-49 globally.\n\n\n\n\n\n\"The rest of the world is interested in what we're doing in the koala space, so there's lessons to be learned from a koala vaccine that could be translated across to vaccines in humans as well,\" Timms said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/babies-need-a-rebrand-with-the-birthrate-in-freefall-we-re-overlooking-one-aspect-of-parenting-20250911-p5mu5r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Babies need a rebrand: with the birthrate in freefall, we’re overlooking one aspect of parenting",
        "publish_date": "Thu, 11 Sep 2025 11:51:16 +1000",
        "category": "lifestyle",
        "authors": [
            "Charlotte Mortlock"
        ],
        "text": "As a very new mother, I was prepared for breastfeeding to be a nightmare. For sleep to be non-existent. For a love unlike anything I’d ever experienced before. But no one braced me for comedy.\n\nEarlier this year, pop star Chappell Roan came under fire when she said the quiet bit out loud: she doesn’t know anyone with children who is happy, and those that have children “are in hell”. Are we surprised that Western civilisation is suffering from cataclysmic population shrinkage if that’s what pop stars are telling young fans? Who wants to willingly enter into 18 years of “hell”?\n\nYou have to laugh: Charlotte Mortlock with her baby.\n\nIt’s now likely we will see the global population starting to decline by the 2050s, just a few decades away. In Australia, this trend began in 2014, and we are now at a near-record low of 1.5 babies per woman, the lowest in almost two decades. In England and Wales, births have declined to a record low, and Japan, one of the worst-affected countries, is experiencing a net loss of 100 people each hour.\n\nSome will argue this will be good for the environment, but it will be catastrophic for economies, the vulnerable and the ageing with a smaller workforce burdened with covering nations’ taxes of and providing the labour and productivity needed to sustain them. Countries will be heavily dependent on migrants (even more so than now) and will likely compete to poach the most skilled and brightest from developing countries.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-wind-gusts-of-up-to-46km-h-buffet-brisbane-20250910-p5mtvo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Wind gusts of up to 46km/h buffet Brisbane | Motorists urged to avoid Main Street, Kangaroo Point and expect traffic delays | Signalling faults spark train cancellations and delays up to 30 minutes",
        "publish_date": "Thu, 11 Sep 2025 11:45:58 +1000",
        "category": "finance",
        "authors": [],
        "text": "The Queensland government says it will undertake an open recruitment and selection process for a new small business commissioner after the resignation of former retail lobby boss Dominique Lamb.\n\nDominique Lamb, Queensland’s small business commissioner. Credit: LinkedIn\n\nLamb will leave her role in three weeks, about three years after she was appointed by the former Labor government.\n\nSmall and Family Business Minister Steve Minnikin thanked Lamb for her contribution and said acting arrangements would be put in place so the office could keep delivering its work.\n\nThe announcement came two days after news emerged that Charles Burke would finish up as Queensland’s food farmers’ commissioner this week, at the end of his one-year term.\n\nPrimary Industries Minister Tony Perrett released a statement on Monday thanking Burke for his work, but did not say whether he intended to appoint a replacement for the role.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/albaneses-summit-shirt-faux-pas-20250911-p5mu6i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Albanese's summit shirt faux pas",
        "publish_date": "Thu, 11 Sep 2025 11:44:05 +1000",
        "category": "finance",
        "authors": [],
        "text": "Albanese's summit shirt faux pas\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-festival-review-the-platypus-takes-a-marriage-breakdown-through-the-multiverse-20250805-p5mkh9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane Festival review: The Platypus takes a marriage breakdown through the multiverse",
        "publish_date": "Thu, 11 Sep 2025 11:43:26 +1000",
        "category": "entertainment",
        "authors": [
            "Nick Dent"
        ],
        "text": "THE PLATYPUS ★★★★\n\nCremorne Theatre, QPAC, until September 13\n\nFrancis Greenslade is the hangdog-faced comedic actor familiar from Winners and Losers, as well as every TV show Shaun Micallef has ever made. His dour-yet-sparkling play The Platypus, which he has also directed, exhibits several Micallefian traits: surreally funny, unashamedly erudite, and underneath it all quite cutting and acerbic.\n\nLike the titular egg-laying mammal, it’s something of a paradox – a laugh riot about the slow death of a marriage. Jess (Rebecca Bower) and Richard (John Leary) are a 40-ish Brisbane couple dealing with things most couples deal with: health issues, money worries and an unseen child who’s way too fond of his phone.\n\nRebecca Bower and John Leary play a bickering couple – and many other characters – in The Platypus. Credit: Mark Gambino\n\nThey irritate the hell out of each other, and can’t get things together in the bedroom. Both have their eyes on other people. Bower and Leary play all the additional characters, with deft character work and costume touches to make it clear who’s who.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/emotions-are-high-essendon-ceo-won-t-guarantee-captaincy-for-merrett-howe-expects-to-play-in-preliminary-final-20250911-p5mu6p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Emotions are high’: Essendon CEO won’t guarantee captaincy for Merrett; Howe expects to play in preliminary final",
        "publish_date": "Thu, 11 Sep 2025 11:42:00 +1000",
        "category": "sports",
        "authors": [
            "Andrew Wu",
            "Marc Mcgowan"
        ],
        "text": "The morning after coach Brad Scott insisted Merrett would not be traded under any circumstances , Vozzo said the club’s relationship with their on-field leader could be mended despite their best player’s face-to-face meeting with Hawthorn coach Sam Mitchell.\n\nAndrew Wu Essendon chief Craig Vozzo has refused to guarantee Zach Merrett will remain as captain if he stays at the club, saying players will have a major say in whether the disgruntled skipper retains the role next year.\n\nThe Bombers are maintaining their hard line on Merrett, whose future at the struggling club is up in the air due to the Bombers’ poor performances on the field, for the second off-season in a row.\n\nThough Merrett has not formally requested a trade, his desire to get out of the Hangar has placed his position as captain in doubt if the Bombers hold him to his contract, which expires at the end of 2028.\n\n“Can he remain captain? It’s a really complex one. It’s one now you need to deal with in a calm way, you can’t deal with it today,” Vozzo said on SEN on Thursday morning.\n\n“Today, the emotions are really, really high. My emotions are high, don’t get me wrong. If I was making an emotional decision today, I’d say ‘no way Zach can be the captain of the club’.\n\n“But it doesn’t work like that, you have to take the emotion out of it, understanding the honour and the privilege.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/theatre/ghosts-bowerbirds-and-logie-giveaways-inside-the-very-curious-world-of-lisa-mccune-20250908-p5mt7v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ghosts, bowerbirds and Logie giveaways: Inside the very curious world of Lisa McCune",
        "publish_date": "Thu, 11 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Elizabeth Flux"
        ],
        "text": "Instead, her walls are covered with a constantly changing collection of art. Right now, she is working her way through the city’s different op shops to find different images of flowers. “I’m a real bowerbird,” she says with a laugh. “It’s amazing when people donate things like their grandmother’s old floral paintings that she did for some competition. I’ve got this beautiful tiny gold one, and it’s golden sunflowers in this really ornate frame.” Sauteed spinach and gnocchi pomodoro Credit: Simon Schluter The idea of wanting to try new things, to not be predictable, is something that comes up again in different ways across the afternoon. We order gnocchi, spinach and steak tartare to share. McCune is the one to suggest ordering the latter, and when it arrives with a side of crisps, she looks at it with interest. “My kids would love this,” she says, explaining that for her, normally she tends towards vegetables and beans. “I’m challenging my palette,” she adds with a smile, mixing the egg into the steak. She takes a bite and a small piece falls on her plate. “Oh, disaster!” she says, and then: “It is really good.” McCune is warm, easy to laugh, and occasionally puckish. When photographer Simon Schluter arrives, they greet each other warmly – they’ve worked together before – and after he’s taken a few shots through the window, she looks through at him, says, “ooh he’ll hate this”, then carefully spoons a wad of spinach in front of her top teeth and shoots him a wide grin.\n\nMcCune was born in Sydney, grew up in Perth, trained at WAAPA and then acting brought her to Melbourne where she still lives. From a young age, her interest was quite firmly fixed on musical theatre, so she originally thought that was where her career would be headed. “I came out of drama school, and I got a great agent, and she said to me, I think you’re going to do work in television. And I was like, ‘Oh, I hadn’t thought about that’.” One of her first jobs was a series of ads for Coles supermarkets. “I remember just being so utterly excited by what the camera could do and how that worked.” Soon afterwards, she was cast in Blue Heelers where she quickly became a household name. “Professionally for me, I was exposed to a lot of really great writers, a lot of really good actors and directors,” she reflects. “So as a young actor, it’s a fantastic place to be because just in and out of the door every week were really great people who were at the top of their game [which] taught me a lot about humility and about working hard and always being respectful.” Lisa McCune in a scene from Blue Heelers in 1995. Her love of collaboration has carried through the decades that followed. “I’m not one of those actors that is desperate to do a one-person show,” she says. “I love working with people.”\n\nThe 39 Steps has four actors performing a large number of roles. “I think it makes people laugh because it’s so mad … There’s a lot of shadow play, lots of old theatrical tricks to create illusions.” Lisa McCune and Ian Stenlake in a scene from The 39 Steps. Credit: Cameron Grant The play is inspired by the 1935 Hitchcock film, which in turn was adapted from John Buchan’s 1915 novel. McCune stars alongside Ian Stenlake, David Collins and Shane Dundas – the latter two perhaps better known as The Umbilical Brothers. “I’ve been so inspired by the team on 39 Steps,” McCune says. “It’s been so enjoyable creatively”. As we make our way through the plate of gnocchi, the conversation hops from technology (“I subscribe to this thing called The Rundown – it’s a newsletter that comes out pretty much every day about AI and what’s happening on that day, because it’s just changing so much”), to gardening and the price of coffee. McCune’s quiet but sharp curiosity and interest in stories spills out beyond her acting. Across the course of the meal, she looks around and wonders about the other people around us – whether they work nearby, whether they are local, whether this is their first time eating here or if it’s a favourite spot of theirs.\n\nShe tells me about the book she’s reading – about photographer Max Dupain – and about a recent visit to the remounted French Impressionism Exhibition at the NGV. Loading “There was this really interesting man, and he had a seat with him. He sat, and he was writing copious notes in a tiny notebook,” she recalls. “And when he stood up to move away from the painting, I said to him, ‘Hello, I find you just as fascinating as the painting. What are you doing?’” The man explained that he was an academic with a focus on art and that he studied the Impressionists. From there, they went on to talk about the paintings around them. When something grabs her interest, she doesn’t let it stop at curiosity – she digs in and asks questions. “I just gather bizarre knowledge,” she says with a laugh. “The other day, I stopped in Sydney to talk to some stonemasons working on a building early in the morning. I went up to the gardens to go for a walk … and they told me all about this building they were working on. And then that sent me kind of looking for a book about it.” She pauses. “I love that moment of going, ‘oh, my God, I didn’t know that’.”\n\nThis curiosity extends to her family history. About a decade back, she was the subject of an episode of Who Do You Think You Are? which traced multiple generations of McCune’s family. Since then, “every summer when I’ve got a bit of a break over that Christmas period, I’ll delve into it”. The bill at The European. Credit: When her research uncovered an address, “I went and knocked on the door in Elsternwick, and the guy that lived there said, ‘Yeah, that family did live here!’, and he invited the old lady down the road,” she recalls. “She came down one Sunday, and we all sat around and she told me about her memories of the family,” she pauses. “Oral history opens up doors that I think a lot of written history doesn’t hold.” Each year has a different shape for McCune. “I just wake up every day and just think, what’s the phone call that’s going to come today?” The time in between, however, is very full. There’s her family, her production company, and a driving curiosity that often sends her down a chain of reading and research and questioning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/the-college-dropout-who-just-became-the-world-s-richest-person-20250911-p5mu4d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The college dropout who just became the world’s richest person",
        "publish_date": "Thu, 11 Sep 2025 11:26:54 +1000",
        "category": "finance",
        "authors": [
            "Diana Li",
            "Brody Ford",
            "Anders Melin"
        ],
        "text": "The increase lifted his total net worth to $US383.2 billion. It’s the biggest one-day increase ever recorded, and put him ahead of Musk for much of the day before the Tesla CEO edged back into pole position by $US1 billion. How did Ellison make his fortune on Oracle? Raised on the south side of Chicago after being adopted by his mother’s aunt and uncle when he was nine months old, Ellison dropped out of both the University of Illinois and the University of Chicago and moved to Berkeley, California, taking a computer programming job at Ampex, where he worked on a database called Oracle for the Central Intelligence Agency. Ellison has also benefited from a close relationship with US President Donald Trump. Credit: Bloomberg With two partners, Ellison founded in 1977 what eventually became Oracle. The company sold shares in an initial public offering on March 12, 1986, a day before Microsoft’s IPO. He stepped down as Oracle’s chief executive officer in September 2014, taking on the titles of chairman and chief technology officer.\n\nLoading Why is Oracle having a moment right now? Oracle has invested billions of dollars over the past few years to become a provider of cloud infrastructure, offering computing power and storage over the internet. The firm has benefited from the enthusiasm for artificial intelligence as start-ups and other AI firms seek more capacity. As of early September, Oracle’s share price had tripled since the public release of ChatGPT in November 2022. It hit an all-time high after market close in New York on September 9, as Oracle provided an aggressive outlook for its cloud business that surprised Wall Street and galvanised hopes that the global build-out of AI infrastructure is accelerating. It was a win for a company that was already having a good year. In July, Oracle inked an unprecedented commitment with ChatGPT operator OpenAI for 4.5 gigawatts worth of data-centre capacity – enough energy to power millions of American homes. Oracle also counts companies such as Nvidia and ByteDance’s TikTok as major cloud customers. Taken together, this shows how Oracle is emerging as a key provider of such computing capacity, competing with cloud leaders Amazon, Microsoft and Alphabet’s Google.\n\nEllison has also benefited from a close relationship with US President Donald Trump. Ellison has been a Trump supporter and Republican donor for years. Since Trump returned to office in January, he’s rewarded Ellison by elevating Oracle on multiple occasions. Ellison also owns a stake in Tesla. Credit: Bloomberg Ellison and Oracle are part of a $US500 billion AI infrastructure project called Stargate that Trump first touted in January. Trump has expressed support for Oracle to acquire a partial stake in the US business of TikTok, which would give Oracle a share of one of the world’s most popular consumer products. Oracle’s bid for the popular video app owned by China’s ByteDance, which includes several other potential investors, has been endorsed by Trump, but hasn’t been approved by the Chinese government. What other businesses does Ellison own? He’s spent hundreds of millions of dollars on luxury real estate in the past decade, including properties in Malibu and Rancho Mirage in California; the Beechwood Mansion in Newport, Rhode Island; and an estate in the San Francisco Bay Area modelled on 16th century Japanese feudal architecture.\n\nEllison has been a major shareholder of Tesla and owned about 1.5 per cent of the company as of the carmaker’s 2022 proxy statement. He stepped down from Tesla’s board of directors in June that year, and his stake hasn’t been disclosed in subsequent filings. He was also one of the largest outside backers of Musk’s bid to purchase Twitter, which has since been renamed X. What are Ellison’s interests outside of tech? The software mogul has a history of lavish living. In a 2002 email to the tech founder, an accountant suggested that Ellison “budget and plan” because his spending habits were becoming difficult to sustain, according to a January 2006 San Francisco Chronicle article. Ellison finances his lifestyle using debt and the proceeds from Oracle stock sales and dividends, which have amounted to more than $US12 billion since 2003, according to an analysis of data compiled by Bloomberg. He’s an avid sailor and partially financed the BMW Oracle Racing team, which won the America’s Cup in February 2010. He sold his stake in Rising Sun, a 138-metre megayacht, to billionaire David Geffen later that year. Ellison’s Oracle Team USA defended the America’s Cup in October 2013, defeating a team from New Zealand. He signed the Giving Pledge in 2010, promising to give away at least 95 per cent of his wealth to charitable causes.\n\nLoading How has Ellison been involved in Hawaii? Ellison’s love for Hawaii, which began in his childhood, led to his $US300 million purchase of 98 per cent of the island of Lanai in 2012. There, he’s partnered with David Agus – a doctor who treated Ellison’s late best friend, Steve Jobs – to create Sensei, a chain of luxury wellness resorts focused on longevity. His personal connections have brought high-profile visitors including Musk, Hollywood actor Tom Cruise and Israeli Prime Minister Benjamin Netanyahu to the once-sleepy island. Ellison’s supporters have said his investments have helped revitalise Lanai but there have been complaints that the island has become more hospitable to the super-rich while squeezing out families that have lived there for generations. Bloomberg",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-wall-street-advances-as-inflation-slows-oracle-surges-20250911-p5mu3t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX trades lower as banks decline; Gold miners jump",
        "publish_date": "Thu, 11 Sep 2025 11:12:42 +1000",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "The Australian sharemarket has retreated in early trade, with financial and health stocks weighing on the index, but gold miners continued to rise.\n\nThe S&P/ASX 200 was 14.9 points, or 0.2 per cent, lower at 8815.5 at 11.04am AEST, with seven of 11 industry sectors in the red. The Australian dollar was fetching US66.14¢ at 10.35am AEST.\n\nWall Street’s benchmark index is on its way to another record close. Credit: Bloomberg\n\nFinancial stocks lost ground, with NAB and Westpac each falling 0.9 per cent, ANZ down 1.1 per cent and the Commonwealth Bank shedding 0.7 per cent.\n\nMining stocks were mixed with iron ore heavyweights BHP down 0.1 per cent and Fortescue and Rio Tinto up 0.4 per cent and 0.1 per cent, respectively. Gold miners jumped after the price of the safe-haven continued to march higher. Resolute Mining surged 5.7 per cent, Evolution Mining rose 4.8 per cent, Newmont jumped 2.6 per cent and Northern Star added 3.2 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-only-person-who-crossed-the-line-at-geelong-on-wednesday-was-bailey-smith-20250911-p5mu58.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The only person who crossed the line at Geelong on Wednesday was Bailey Smith",
        "publish_date": "Thu, 11 Sep 2025 11:11:23 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "He was the only one who crossed the boundaries of civility. Those boundaries are necessary to avoid unnecessary drama around the whole unusual interaction that occurs daily between athletes and everyone else in professional sport. No potential defence stacks up. Bailey Smith, Max Holmes and Gryan Miers. Credit: Getty Images Why did he choose to pick on a local photographer who has done her job well and without drama for 25 years? If he wanted privacy for the massage, get it done inside the rooms. Or head to Mars (Stadium).\n\nIf that wasn’t possible and it was an issue, ask a media official or football manager whether the photographer could refrain from taking a photo at that point. If Smith was having a bad day, that’s life. I can bet with certainty there were people within the stadium that day who had personal battles of their own. We all want Smith to feel well, given the mental health struggles he has shared. But having mental health issues doesn’t mean anyone should get a pass for bad behaviour. That’s a stereotype better left to history.\n\nSo it comes back to a basic question: why? It would be the same question you would ask a mate if he turned up at your party and abused one of your lifelong friends. If he or she then wondered why you were making such a fuss, then you wouldn’t invite them back. Perhaps Smith just has a reality TV star’s penchant for drama, and we are all being played. But Wynd, the News Corp photographer, was not being intrusive. She wasn’t doorstopping, nor pointing her lens into a space thousands of cameras haven’t been before.\n\nStill, Smith treated her like a paparazzi photographer, using demeaning language to show his disdain. It was, to use a word Jack Ginnivan deployed well when doorstopped in Adelaide, embarrassing. It’s not as though media people wilt either. Wynd and others are used to the cut and thrust that comes with being in this business. But we all know when a line is crossed. It would be unfair to write that Geelong have let Smith get away with this sort of petulance. They are working hard to shift his behaviour in the right direction, as the Western Bulldogs did before them. Geelong are choosing to do so in the background rather than via a public dressing down or punitive measures. That’s fine. I respect that strategy. But the Cats’ brand, one they have been working hard to maintain, is taking a hit as a result.\n\nEveryone knows Smith’s form on the field has people inside the club contorting themselves to explain his positive attributes, of which, it must be said, there are many. That is unfortunate because the players are among the finer groups in the competition, respected within the community and outside the club, a legacy built over 20 years at least. They continue to look after their mate and he could show some gratitude for that. The best way to do that is through his actions. Coach Chris Scott is in a tough position too, but his intent is to help Smith through rather than bow to the baying mob, who want Smith to pay publicly. It’s a strength of Scott’s and preferable to the punitive approach the AFL takes. However, he can no longer rate Smith’s season a 10/10 because that well-meaning show of support doesn’t pass the pub test – or any other test for that matter, although I respect his obligation to defend his player.\n\nLoading Smith won’t be the first or the last with a dim view of the mainstream media, particularly as the world fragments. But if he’s smart, he will learn how to deal with people inside a stadium a community built. Because when mainstream media are invited into GMHBA Stadium, they don’t leave their phones or cameras in a basket at the front door. Right now, Smith’s big-city attitudes aren’t going down well. Geelong want to embrace him. For the most part, they have. They want to protect him from intrusion as he tries to enjoy the best the coast has to offer. He’s helping them in the quest for a premiership and is a Brownlow chance.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/embattled-anu-vice-chancellor-to-resign-amid-staff-fury-20250911-p5mu6d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Embattled ANU vice chancellor resigns amid staff fury",
        "publish_date": "Thu, 11 Sep 2025 11:07:03 +1000",
        "category": "finance",
        "authors": [
            "Natassia Chrysanthos",
            "Christopher Harris"
        ],
        "text": "Embattled Australian National University vice chancellor Genevieve Bell is expected to announce her resignation on Thursday, after a tumultuous period for the institution.\n\nSources with knowledge of the situation, but not authorised to speak about it, said Bell had tendered her resignation to the council on Wednesday night. The university was expected to announce it on Thursday.\n\nGenevieve Bell appears before a parliamentary committee in January. Credit: Alex Ellinghausen\n\nANU’s council, headed by former Liberal foreign minister Julie Bishop, appointed Bell as vice chancellor in September 2023.\n\nThe university has been racked by a year-long public relations nightmare, which began when it revealed plans to axe scores of jobs in a bid to put it on track to financial sustainability.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/what-we-know-about-prince-harry-and-king-charles-reuniting-20250911-p5mu7s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What we know about Prince Harry and King Charles reuniting",
        "publish_date": "Thu, 11 Sep 2025 11:04:33 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "What we know about Prince Harry and King Charles reuniting\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/inside-the-new-9honey-series-crown-duels-20250911-p5mu8n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inside the new 9Honey series Crown Duels",
        "publish_date": "Thu, 11 Sep 2025 11:00:14 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Inside the new 9Honey series Crown Duels\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/princess-of-wales-set-to-host-event-alongside-melania-trump-20250911-p5mu83.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Princess of Wales set to host event alongside Melania Trump",
        "publish_date": "Thu, 11 Sep 2025 10:53:22 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Princess of Wales set to host event alongside Melania Trump\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/winning-is-what-i-ve-done-backed-by-long-time-allies-ange-makes-bold-arrival-at-forest-20250911-p5mu78.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Winning … is what I’ve done’: Backed by long-time allies, Ange makes bold arrival at Forest",
        "publish_date": "Thu, 11 Sep 2025 10:52:15 +1000",
        "category": "sports",
        "authors": [
            "Ian Chadband"
        ],
        "text": "Ange Postecoglou has declared he’s determined to take two-time European Cup winners Nottingham Forest back to their “rightful place” in English football, reminding his new club’s fans: “I love winning things – that’s what I’ve done.”\n\nFour months since leaving Tottenham as Europa League champions, Postecoglou has made it clear he wants to help transport the English Midlands outfit back to the days when they ruled the continental game under Brian Clough.\n\n“I get a sense the club wants more and that’s certainly what I want, so it’s a really exciting time,” said the 60-year-old, who – it was also confirmed on Wednesday – has brought his backroom coaching staff from Spurs with him to the City Ground.\n\n“I love winning things and that’s what I want to do here.”",
        "source": "TheAge"
    }
]