[
    {
        "url": "https://www.9news.com.au/national/volvo-recalls-195-hybrid-cars-over-fire-risk/e6d0c956-70bd-4cd7-9fdd-e555b7a15a3a",
        "title": "Car giant recalls 195 vehicles over fears they could catch fire",
        "publish_date": "Thu, 03 Apr 2025 21:22:26 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "C﻿ar giant Volvo has recalled 195 plug-in hybrid vehicles sold in Australia over a fault which could trigger a vehicle fire.\n\nThe recall is for four models - the XC60 and XC90 SUVs, the S60 sedan and the V60 wagon﻿.\n\n\"Due to a manufacturing defect, the cell modules installed in the high voltage battery may be defective,\" said Volvo Cars Australia.\n\n\"As a result, it could cause a thermal overload leading to a vehicle fire when the vehicle is parked with a fully charged battery.\n\nThe Volvo XC90 SUV is one of the models subject to the recall. (Vehicle Recalls Australia)\n\n\"A vehicle fire could increase the risk of injury or death to vehicle occupants, other road users, bystanders and/or damage to property.\"\n\nOwners of affected vehicles should contact their authorised Volvo dealership to arrange for the repair work to be carried out, free of charge.\n\nFor more information, call Volvo customer care on 1300 787 802.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-election-2025-daughter-of-pauline-hanson-launches-one-nation-senate-bid/89a1f673-de5a-40c0-a68c-d23554d271c7",
        "title": "'I am my own woman':  Daughter of Pauline Hanson launches Senate bid",
        "publish_date": "Thu, 03 Apr 2025 22:55:52 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "T﻿he daughter of One Nation leader Pauline Hanson has announced she will run for the Senate in Tasmania at the federal election under her mother's party.\n\nLee Hanson, who has lived in the state for 13 years, says her upbringing as the daughter of the firebrand politician played a key role in shaping her decision to enter politics.\n\nBut she also insists she is determined to carve her own path in federal parliament and doesn't wish to be a \"career politician\".\n\nREAD MORE: The federal election seats where just a few hundred votes could make all the difference\n\nSenate candidate Lee Hanson, the daughter of One Nation leader Pauline Hanson. (Pauline Hanson's One Nation Party) (Supplied)\n\n\"I have the privilege of my mother being one of the most tenacious, resilient and strongest women in Australia; Pauline Hanson,\" she said.\n\n\"Those values have carried through to me, she's always been my role model.\"\n\n\"But I am my own woman. I bring my own strength and convictions. I'm part of a younger generation with a new lens and different life experiences.\n\n\"I'm fresh blood—and I'm ready to get to work.\"﻿\n\nLee Hanson says her campaign focus will be on education, healthcare and cost-of-living pressures facing Tasmanians.\n\nOne Nation leader Pauline Hanson is one of Australia's most polarising politicians. (Alex Ellinghausen/Nine)\n\n\"Our hospitals and GPs are overwhelmed. Tasmanians are lucky to get in to see or afford a doctor, let alone a specialist,\" she said.\n\n\"GPs and maternity wards are shutting down. We have a three year wait list for our children to see a paediatrician and mental health and wellbeing services are practically non-existent.\"\n\n\"Our education system is broken. Teachers are struggling and our curriculum is not providing our children or our workforce with the outcomes and skills they need. Tasmania can be the exemplar in rebuilding our education system.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/donald-trump-tariffs-this-is-how-they-were-calculated/ad0f5c69-8f35-4b68-a5ac-dce926e9a76d",
        "title": "The dubious way Trump calculated his tariffs",
        "publish_date": "Thu, 03 Apr 2025 20:45:55 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "US President Donald Trump's massive tariffs announced on dozens of nations yesterday were pitched as \"reciprocal,\" matching what other countries charge the US dollar for dollar, even taking into account non-tariff barriers like value-added taxes and other such measures.\n\nBut the actual calculation the Trump administration used is not reciprocal at all.\n\nMatching countries' tariffs dollar for dollar is an incredibly difficult task, involving poring over each country's tariff schedule and matching a complex array of products, each of which has a different charge for any variants.\n\nREAD MORE: Trump tariffs shock global economy as leaders weigh retaliation ﻿\n\nPresident Donald Trump holds a signed executive order during an event to announce new tariffs in the Rose Garden of the White House. (AP)\n\nInstead, the Trump administration used quite a simple calculation: the country's trade deficit divided by its exports to the US times 0.5. That's it.\n\nThe calculation was first suggested by journalist James Surowiecki in a post on X and backed up by Wall Street analysts. The Trump administration later confirmed that was the calculation it used.\n\nFor example, America's trade deficit with China in 2024 was US$295.4 billion ($467.18 billion), and the US imported US$439.9 billion ($695.71 billion) worth of Chinese goods.\n\nThat means China's trade surplus with the United States was 67 per cent of the value of its exports – a value the Trump administration labelled as \"tariff charged to USA\".\n\nThe tariffs are set to affect global trade, economists have warned. (Copyright: © Maciej Leszczynski)\n\nBut it was no such thing.\n\n\"While these new tariff measures have been framed as 'reciprocal' tariffs, it turns out the policy is actually one of surplus targeting,\" noted Mike O'Rourke, chief marketing strategist at Jones Trading, in a note to investors yesterday.\n\n\"There does not appear to have been any tariffs used in the calculation of the rate.\n\nThe Trump administration is specifically targeting nations with large trade surpluses with the United States relative to their exports to the United States,\" he added.\n\nREAD MORE: Major nation celebrates dodging new Trump tariffs ﻿\n\nThe full list of Trump's 'reciprocal' tariffs View Gallery\n\nThe simple calculation used by the Trump administration could have broad implications for countries America depends on for goods – and the global companies that supply them.\n\n\"Knowing how these rates were calculated highlights that they are generally going to be most severe on the nations that US companies rely heavily upon in their supply chain,\" O'Rourke said.\n\n\"It is hard to imagine how these tariffs would not wreak havoc upon the profit margins of major multinational corporations.\"\n\nWill you boycott American products over Donald Trump's tariffs? Yes 1216 No 253",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/amazon-makes-bid-to-buy-tik-tok-ahead-of-us-ban/bf063ecb-0b0a-4407-9fd9-6421c23223d2",
        "title": "Amazon's last-minute bid for TikTok ahead of US ban on platform",
        "publish_date": "Thu, 03 Apr 2025 20:30:29 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Amazon has put in a bid to purchase TikTok, a Trump administration official said, in an eleventh-hour pitch as a US ban on the platform is set to go into effect on Saturday.\n\nThe official, who was not authorised to comment publicly and spoke on the condition of anonymity, said the Amazon offer was made in a letter to US Vice President JD Vance and Commerce Secretary Howard Lutnick.\n\nThe New York Times first reported on the bid.\n\nAn icon TikTok seen on a smartphone screen in Beijing, China, earlier this year. (AP Photo/Andy Wong) (AP)\n\nPresident Donald Trump on Inauguration Day gave the platform a reprieve, barrelling past a law that had been upheld unanimously by the Supreme Court, which said the ban was necessary for national security.\n\nUnder the law, TikTok's Chinese-owned parent company ByteDance is required to sell the platform to an approved buyer or take it offline in the US. Trump has suggested he could further extend the pause on the ban, but he has also said he expects a deal to be forged by Saturday.\n\nAmazon declined to comment. TikTok did not immediately respond to a request for comment.\n\nThe existence of an Amazon bid surfaced as Trump was scheduled this week to meet with senior officials to discuss the coming deadline for a TikTok sale.\n\nAlthough it's unclear if ByteDance plans to sell TikTok, several possible bidders have come forward in the past few months. Among the possible investors are the software company Oracle and the investment firm Blackstone. Oracle announced in 2020 that it had a 12.5 per cent stake in TikTok Global after securing its business as the app's cloud technology provider.\n\nTikTok chief executive officer Shou Zi Chew testified during a hearing in the US Congress in March, 2023, on Capitol Hill in Washington. (AP Photo/Alex Brandon) (AP)\n\nIn January, the artificial intelligence startup Perplexity AI presented ByteDance with a merger proposal that would combine Perplexity's business with TikTok's US operation. Last month, the company outlined its approach to rebuilding TikTok in a blog post, arguing that it is \"singularly positioned to rebuild the TikTok algorithm without creating a monopoly.\"\n\nAny acquisition by a consortium of investors could in effect keep ByteDance in control of the algorithm, while any acquisition by a competitor would likely create a monopoly in the short form video and information space,\" Perplexity said in its post.\n\nThe world's top 10 richest people for 2025 View Gallery\n\nThe company said it would remake the TikTok algorithm and ensure that infrastructure would be developed and maintained in \"American data centres with American oversight, ensuring alignment with domestic privacy standards and regulations.\"\n\nOther potential bidders include a consortium organised by billionaire businessman Frank McCourt, which recently recruited Reddit co-founder Alexis Ohanian as a strategic adviser.\n\nInvestors in the consortium say they've offered ByteDance $US20 billion ($32 billion) in cash for TikTok's US platform. Jesse Tinsley, the founder of the payroll firm Employer.com, says he too has organised a consortium and is offering ByteDance more than $US30 billion for the platform. Wyoming small business owner Reid Rasner has also announced that he offered ByteDance roughly $US47.5 billion.\n\nPeople calling for the banning of TikTok, the hugely popular video-sharing app, gather at the US Capitol in Washington, in March,, 2023. (AP Photo/J. Scott Applewhite) (AP)\n\nBoth the FBI and the Federal Communications Commission have warned that ByteDance could share user data — such as browsing history, location and biometric identifiers — with China's authoritarian government.\n\nTikTok said it has never done that and would not do so if asked. The US government has not provided evidence of that happening.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/high-paying-jobs-australia-fastest-growing-careers/a8a84101-8e4c-4097-8130-af6856b26e7e",
        "title": "Australia's fastest growing jobs with competitive salaries",
        "publish_date": "Thu, 03 Apr 2025 19:20:29 +0000",
        "category": "finance",
        "authors": [
            "April"
        ],
        "text": "1 of 26 Attribution: Getty\n\nAre you looking for a job with a competitive salary?\n\nThese are the top 25 fast-growing, high-paying sectors.\n\nThe team at the job search engine Indeed have analysed listings with median salaries above $80,000 and sizable growth in job postings.\n\nScroll﻿ through to see the roles.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/donald-trump-tariffs-economic-impact-australia-explained/a4f2524c-612b-455a-99b3-7162e35f1485",
        "title": "How hard will Trump's new tariffs impact the Australian economy?",
        "publish_date": "Thu, 03 Apr 2025 19:20:42 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Unlike the 25 per cent taxes imposed on steel and aluminium last month, ﻿the new duties impact all Australian imports into the US, and will therefore have a far more widespread impact across the economy.\n\nSo how will they impact Australia? From potential interest rate cuts to the likelihood of a global economic downturn, this is what you need to know.\n\nDonald Trump singled out the Australian beef industry while unveiling new tariffs. (AP Photo/Mark Schiefelbein)\n\nWill Australians be hit with price rises due to the tariffs?\n\nNot directly.\n\nTariffs are paid ﻿by the importer, not the exporter, so the consumers who are likely to face higher prices are Trump's own constituents: the American people.\n\n\"The US will, of course, bear the brunt of the inflation uplift,\" Wilsons Advisory head of investment strategy David Cassidy said.\n\nMeat and Livestock Australia (MLA)﻿, which is particularly impacted by the tariffs given Trump singled out Australia's beef exports and ban on American beef, said local shoppers needn't worry about new price rises.\n\n\"US tariffs will impact the prices paid by American families and may have flow-on impacts on the supply chain,\" MLA managing director Michael Crowley said.\n\n\"It is unlikely these changes will make a difference to retail prices here in Australia.\"﻿\n\nMeat prices are unlikely to rise in Australia due to the tariffs. (Lisa Maree Williams/Getty Images)\n\nSo what will the impact on Australia's economy be?\n\nIt's worth noting from the outset that the exact impact of the tariffs is up in the air, and will be dictated by a range of factors, including other nations' responses (particularly China's) and whether there are more taxes to be announced.\n\nThat said, similarly to the steel and aluminium tariffs , the direct impacts on the Australian economy will likely be limited.\n\nOnly about 4 per cent of exported Australian goods go to the US, leaving the vast majority unimpacted.\n\nThe full list of Trump's 'reciprocal' tariffs View Gallery\n\n﻿Gold and pharmaceuticals, which are two of the top five exports to the United States, also appear to have been exempted from the tariffs, providing further reprieve for the local economy.\n\nThe biggest direct impact will be felt by the beef industry. Worth billions of dollars each year (the Red Meat Advisory Council puts the figure for 2024 at $4.16 billion), it is Australia's biggest export to the US, and simultaneously the US is the Australian beef industry's biggest market.\n\nWhile exports will continue despite the tariffs, it's likely to lead to less demand for Australian meat.\n\n\"Our beef industry will need to look for alternative markets to stay viable,\" Professor Robert Brooks from Monash Business School said.\n\nAustralian beef exporters will need to find new markets for their produce. (9News)\n\nWhat about indirect impacts on the Australian economy?\n\nThis is where things start to get a bit more worrisome.\n\nThe Australian stock exchange – ﻿as with plenty of other share markets – has already spent a day swimming in the red following the tariff announcement.\n\nIt closed the trading day down a little more than 1.07 down on Thursday, roughly a $33 billion loss, which was actually an improvement on the more than $50 billion shed in the hours after Trump made the new taxes official.\n\nLocal industries are also worried about the potential for other nations – many of whom have been hit far more severely by the new tariffs – to ﻿look to Australia as a new or increased market for their goods now the US is a less viable option.\n\nThat could lead to them dumping a high volume of cheap produce here, undercutting local businesses.\n\nShare markets have been swimming in the red following Trump's tariff announcement. (Peter Braig)\n\nThe federal government announced some financial support to encourage shoppers to buy Australian during last week's federal budget, and Prime Minister Anthony Albanese yesterday said anti-dumping measures will be strengthened.\n\nThen there's the risk of a global economic downturn if Trump's tariffs are met with retaliation and a widespread trade war breaks out.\n\n\"While Australia's direct trade exposure to the US is minimal, the knock-on effects via China and broader Asian nations that have seen hefty tariffs could weigh on our export-heavy economy, especially if global demand slows and commodity prices retreat,\" eToro market analyst Josh Gilbert said.\n\n\"For a small, open economy like Australia, any slowdown in global growth would have an impact locally.\"\n\nTrump's 'Liberation Day' announcement in the Rose Garden View Gallery\n\nOne particularly important economy is China, where, as our largest trading partner, a reduction in demand would hurt Australian exporters.\n\n\"What happens to growth in China will be critical,\" Brooks said.\n\n\"Any slowdown there, particularly as a result of escalating trade tensions, could have ripple effects for the Australian economy.\"\n\nSome economists are﻿ worried the tariffs could go as far as to spark recessions in the next nine months.\n\n\"These policies, if sustained, would likely push the US and global economy into recession this year,\" JPMorgan analysts said in a note to investors.\n\nREAD MORE: Trump places tariffs on uninhabited islands off coast of Antarctica ﻿\n\nThe prosperity of Australia's econnomy is closely tied to China. (Alex Ellinghausen/SMH)\n\n﻿Are there any potential benefits?﻿\n\nThere are a couple of silver linings ﻿that could emerge for Australia.\n\nChief ﻿among them is the potential for a free trade deal with the European Union – which has been long discussed but never signed off on – to finally be inked as both economies seek new markets for their export goods.\n\n\"I think things have changed and the opportunity to have further negotiations about a free trade agreement on better terms than have been previously offered now exists,\" Trade Minister Don Farrell said .\n\nAustralian mortgage holders will also welcome the news that traders now believe there's a better chance of ﻿more interest rate relief throughout the year.\n\nThe market is now all but certain of another ﻿rate cut in May – it was previously pricing in a 79 per cent chance of the Reserve Bank reducing the cash rate in its next meeting – and is optimistic of a further three by the end of 2025, one more than previously expected.\n\nWill you boycott American products over Donald Trump's tariffs? Yes 1210 No 250",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/prince-harry-bullying-claims-watchdog-to-probe-charity-cofounded-by-roayl-after-chairwoman-accusation/13f7c9ac-a4aa-4647-9f57-94f21487c366",
        "title": "'Heartbreaking to witness': Harry speaks out as UK watchdog launches probe",
        "publish_date": "Thu, 03 Apr 2025 14:08:47 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Britain's charity regulator has opened an investigation into an African charity co-founded by Prince Harry, a week after the prince and other trustees resigned due to a dispute with the charity's chairwoman.\n\nSentebale, which provides support for young people in Botswana and Lesotho, has been wracked by controversy since Harry abruptly resigned on March 26, saying the relationship between the board and its chair was beyond repair.\n\nChair Sophie Chandauka later accused the prince of orchestrating a bullying and harassment campaign to try to force her out.\n\nPrince Harry and Prince Seeiso of Lesetho meet pupils in a class at the Kananelo Centre for the Deaf outside Maseru, Lesotho in 2013. (AP)\n\nThe Charity Commission said on Thursday that it was in \"direct contact\" with parties on both sides to gather evidence in its compliance case.\n\n\"The regulator's focus, in line with its statutory remit, will be to determine whether the charity's current and former trustees, including its chair, have fulfilled their duties and responsibilities under charity law,\" the commission said in a statement.\n\nChandauka took several shots at Harry in an interview with Sky News on Sunday, describing how the prince's Netflix deal interfered with a scheduled fundraiser and how an incident with his wife, Meghan, the Duchess of Sussex, became a source of friction.\n\nHarry co-founded Sentebale nearly 20 years ago in memory of his late mother, Princess Diana.\n\nSentebale Chair Sophie Chandauka. (AP)\n\nHe said he hoped the Charity Commission would uncover \"the truth\" about what caused him to resign as patron of Sentebale.\n\n\"What has transpired over the last week has been heartbreaking to witness, especially when such blatant lies hurt those who have invested decades in this shared goal,\" he said in a statement.\n\n\"No one suffers more than the beneficiaries of Sentebale itself.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/independent-mp-parliament-politics-teal-federal-election-2025/104990946",
        "title": "The independents running at the 2025 election, and what they stand for",
        "publish_date": "Fri, 04 Apr 2025 01:41:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Fewer Australians than ever voted for a major party at the last election.\n\nWhile some of these votes went to minor parties, many went to independents: but who are they and what do they stand for?\n\nIf you want to know more about the four parties dominating Australian politics, find out about what they stand for here.\n\nLike their name suggests, an independent MP is separate from any party, with their own individual policies and views.\n\nBut they can be broken down into a few groups: here's a guide to who's who.\n\nLooking for a particular person?\n\nThe long-timers (Andrew Wilkie, Helen Haines + Bob Katter)\n\nOn the current crossbench (where independents sit), Andrew Wilkie, Helen Haines and Bob Katter have been in parliament the longest.\n\nWho is Andrew Wilkie?\n\nHe represents the electorate of Hobart and is a former spy.\n\nHe advocates heavily for privacy protections and against pokies and the gambling industry.\n\nHe's also been a big supporter of a federal anti-corruption commission, something he has in common with Helen Haines.\n\nAndrew Wilkie, Helen Haines and Bob Katter have been in parliament the longest on the current crossbench. (Claudia Long (ABC News)/Canva)\n\nOK, so who is Helen Haines?\n\nShe's a former nurse and midwife from Wangaratta, an area she now represents as the member for Indi.\n\nShe advocates for better regional healthcare and housing.\n\nShe is the second independent elected to represent Indi, backed by the Voices Of movement, something that was then replicated by a group called the teals (find out more about them here.)\n\nBut Helen Haines is not a teal — orange is her colour, actually!\n\nWhat about this Bob Katter guy?\n\nHe's one of the longest-serving MPs ever, representing the seat of Kennedy in outback Queensland, the seat his dad used to represent.\n\nHe used to be in The Nationals but switched to being an independent in 2001.\n\nHe technically leads the Katter's Australian Party, but he's the only one elected to federal parliament and his focus is on limiting monopolies (like the supermarkets), nationalisation of essential services like gas and airports, and giving everyone the right to own a gun.\n\nThe Teals\n\nWhat do you get when you mix Liberal blue and Green, uh, green?\n\nTeal.\n\nThis group of independents gets its nickname because when it comes to values, they're typically a bit more economically conservative but socially progressive.\n\nAt the last election, this crew managed to win a number of long-time Liberal seats, focusing on issues like climate change, integrity and gender equality.\n\nBecause each is an independent, they put their own spin on things, but vote together most of the time.\n\nThe teal independents get the nickname because when it comes to their values, they’re typically a bit more economically conservative but socially progressive.\n\nZali Steggall was the first teal to be elected, winning the Sydney seat of Warringah from former Liberal PM Tony Abbott in 2019.\n\nAt the 2022 election she was joined by:\n\nMonique Ryan (MP for Kooyong in Melbourne)\n\nSophie Scamps (MP for Mackellar in Sydney)\n\nKate Chaney (MP for Curtin in Perth)\n\nZoe Daniel (MP for Goldstein in Melbourne)\n\nAllegra Spender (MP for Wentworth in Sydney)\n\nKylea Tink (MP for the now-abolished seat of North Sydney)\n\nThey're also all backed by a major fundraising group called Climate 200, run by director of the Smart Energy Council millionaire Simon Holmes a Court.\n\nHe used to give financial backing to Liberal MP Josh Frydenberg, but they fell out over him supporting a coal fired power station.\n\nFun fact: the teal MP his group backed defeated Mr Frydenberg and now holds the seat.\n\nThe group also provides financial support to a number of MPs who are not in the teal grouping, but support strong action to counter global warming.\n\nThe party leavers\n\nQuite a few independents in parliament started out as party MPs.\n\nThat includes:\n\nLidia Thorpe (Green)\n\nJacqui Lambie (PUP)\n\nFatima Payman (Labor)\n\nRussell Broadbent (Liberal)\n\nTammy Tyrrell (Jacqui Lambie Network)\n\nRussell Broadbent and Andrew Gee both used to be part of the Liberal National Coalition before moving to sit on the crossbench as independents.\n\nIn the Senate, Lidia Thorpe, David Van, Fatima Payman and Tammy Tyrell also left their respective parties to sit on the crossbench.\n\nVictorian senator Thorpe left the Greens because she wanted to better represent the grassroots blak sovereign movement, something she said she couldn't do within the party.\n\nIn the Senate, David Van, Fatima Payman, Lidia Thorpe, Jacqui Lambie and Tammy Tyrrell all left their respective parties to sit on the crossbench.\n\nVictorian senator Van was expelled from the Liberal Party in 2023, following sexual assault allegations by Senator Thorpe and former Liberal senator Amanda Stoker.\n\nHe rejected these allegations, quit the party and became an independent.\n\nWA senator Payman left the Labor party for the crossbench in 2024, saying the government had not acted enough to support Palestine and protect civilians during Israel's war on Gaza.\n\nShe's since launched her own party — Australia's Voice — though exactly what their policies are isn't clear right now.\n\nTechnically, Lambie left her original party too: she was initially a Palmer United Party senator, until the pair had a falling out and she got elected again as an independent.\n\nShe now heads up the Jacqui Lambie Network, which focuses on advocating for Tasmanians and veterans.\n\nUntil recently, she had company in the Senate with Tammy Tyrell, who was elected as a Jacqui Lambie Network senator but left the group in 2023 and now sits on the crossbench as an independent.\n\nThe mini minor parties\n\nOn the lower house crossbench is Rebekha Sharkie, who represents Centre Alliance.\n\nThis party was formerly called the Nick Xenophon Team and it's primary focus is South Australia and improving the lives of people there.\n\nIn the Senate, the other small parties on the crossbench are Pauline Hanson's One Nation and the United Australia Party.\n\nThere are a number of small minor parties in parliament, whose MPs function like independents.\n\nOne Nation has two senators and the UAP has one; both parties fall far to the right of the political spectrum.\n\nOne Nation wants to reduce Australia's refugee intake, reduce availability of unemployment payments and impose heavy restrictions on abortion.\n\nMembers of the party have also been associated with spam text messages as well as spreading conspiracy theories about vaccines and the United Nations.\n\nThe United Australia Party has also had members spread these conspiracy theories, it also lists wanting to abolish HECs debt and process more minerals in Australia as key policies.\n\nMining magnate Clive Palmer pumped $123 million into his UAP campaign last election and won one Victorian senate seat that is held by Ralph Babet.\n\nThe other two\n\nThere's two more independents in parliament, one in the Senate and one in the reps.\n\nIn the Senate is David Pocock.\n\nThe former Wallabies captain won the ACT's second Senate seat from a Liberal in 2022, advocating for strong action on climate change and transparency in politics.\n\nThere are two more independents in parliament — one in the Senate and one in the reps.\n\nAnd in Western Sydney, former ABC journalist and local Liberal candidate Dai Le won the formerly-safe seat of Fowler from Labor that same election, after the major party parachuted former premier and senator Kristina Keneally in as their candidate.\n\nDai Le is the first Vietnamese Australian refugee to win a seat in parliament and is particularly focused on cost of living relief and better services for her electorate.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/tennis-players-call-for-more-prize-money-at-grand-slams/105137784",
        "title": "Top WTA and ATP players call for more prize money at grand slams",
        "publish_date": "Fri, 04 Apr 2025 01:33:59 +0000",
        "category": "sports",
        "authors": [],
        "text": "Emma Navarro says she put her name to a letter signed by the world's top tennis players calling for significant improvements in prize money at the four grand slams as a way to ensure equal treatment.\n\nFrench media outlet L'Equipe reported this week almost all the top 20 WTA and ATP players had sent the letter to organisers of Wimbledon, and the Australian, French and US opens recently demanding a more equitable distribution of revenue.\n\nWhile those at top of the game can benefit from increased prize money, players at the lower levels often struggle due to a lack of steady sponsorship as well as expensive coaching, travel and accommodation.\n\n\"I talked a little bit to the other players about it and felt like it was a good idea to sign,\" world number 11 Navarro told reporters at the Charleston Open in South Carolina.\n\n\"I think there have been some sort of unfair pay ratios — I don't know the correct terminology — in the past.\n\nDaria Kasatkina wins 'stressful' debut as an Australian player Photo shows Daria Kasatkina celebrates with both arms in the air Daria Kasatkina, Australia's newest tennis star, overcomes the stress of switching allegiances in a straight-sets win.\n\n\"I think it's a good cause to come together as players and make sure we're getting treated fairly.\"\n\nThe United States Tennis Association (USTA), which runs the US Open, confirmed it had received the letter and said it \"welcomes open and direct conversations with players\".\n\nThe USTA noted it was proud of its history of leadership on player compensation.\n\n\"This includes offering equal prize money to men and women for more than 50 years and awarding the largest purse in tennis history at the 2024 US Open,\" a USTA statement read.\n\nWorld number eight Qinwen Zheng said more money from the grand slam tournaments would filter down to the lower ranks.\n\n\"I think that's going to benefit all the players, not only the top players, especially those that work hard during the year and need to get paid from the grand slams and have to survive,\" she said.\n\nQinwen said she was unsure if the demands of the players would be met.\n\n\"We try to do what we can, and then let's see what the gods bring to us,\" she said.\n\n\"But at least we're trying.\"\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/superannuation-cyber-attack-rest-afsa/105137820",
        "title": "Australian superannuation funds hit by cyber attacks, with members' money stolen",
        "publish_date": "Fri, 04 Apr 2025 01:24:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "A number of Australian superannuation funds have been hit with suspected cyber attacks, with members of one fund losing at least $100,000 in retirement savings.\n\nAustralian Super has been hit with 600 attempted cyber attacks in the past month, ABC News understands, with four members losing at least $100,000.\n\nThe industry body that represents superannuation funds, Association of Superannuation Funds of Australia (ASFA), said in a statement that other funds had experienced attempted cyber attacks over the weekend.\n\n\"While the majority of the attempts were repelled, unfortunately a number of members were affected,\" AFSA said in its statement.\n\n\"Funds are contacting all affected members to let them know and are helping any whose data has been compromised.\"\n\nAnother fund, Rest, said no members' cash had been taken.\n\n\"At this stage, we believe that some of our members may have had limited personal information accessed and we are currently working through this with those impacted members,\" Rest said in a statement.\n\nThe prime minister just told reporters that he was aware of the cyber attacks.\n\n\"I have been informed about that,\" Anthony Albanese said while on the campaign trail.\n\n\"We will respond in time. We are considering what has occurred. Bear in the mind, the context here, there is a cyber attack in Australia roughly every six minutes. This is a regular issue.\"\n\nHe reiterated federal funding to tackle cyber criminal activity, which was boosted in the wake of a wave of cyber attacks on major companies including Optus, Medibank and Latitude.\n\nIn the case of Medibank, the health insurer's members' private and sensitive details were posted to the dark web.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/tom-cruise-pays-tribute-to-late-actor-val-kilmer/105136900",
        "title": "Tom Cruise pays tribute to 'dear friend' Val Kilmer",
        "publish_date": "Fri, 04 Apr 2025 00:49:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tom Cruise paid tribute to late Top Gun co-star Val Kilmer by leading movie theatre owners in a moment of silence at the CinemaCon event on Thursday.\n\nThe moment stood in stark contrast to the otherwise action-packed presentation of Paramount Pictures' upcoming movies.\n\n\"I'd like to honour a dear friend of mine, Val Kilmer,\" said Cruise, at the start of his hotly anticipated appearance at the annual industry summit in Las Vegas.\n\nTop Gun sparked a decades-long bond Photo shows Val Kilmer and Tom Cruise in a happy scene from Top Gun. Since they met on the set of Top Gun in 1986, Tom Cruise and Val Kilmer have shared a close friendship.\n\n\"I really can't tell you how much I admired his work, how much I thought of him as a human being, and how grateful and honoured I was when he joined Top Gun and then came back for Top Gun: Maverick,\" he said.\n\nKilmer, one of the biggest Hollywood actors of the 90s, shot to fame playing the cocky, square-jawed and mostly silent fighter pilot in training Tom 'Iceman' Kazansky in the original 1986 Top Gun.\n\nKilmer died of pneumonia aged 65, his family announced this week.\n\nHe battled throat cancer after being diagnosed in 2014, and made his final on-screen appearance in the long-awaited sequel Top Gun: Maverick.\n\nKilmer's real-life health issues were written into the character, giving him a physically diminished appearance and a raspy voice.\n\nLoading...\n\n\"Thank you, Val. I wish you well on your next journey,\" Cruise said to the silent room.\n\nCruise was there to build hype for Mission: Impossible — The Final Reckoning, the eighth instalment of the franchise set to hit theatres May 23.\n\nHe introduced a trailer for the new release, which shows Cruise playing Ethan Hunt as he clings to the wheels of a small biplane as it soars down a narrow canyon and barrel rolls through the skies.\n\nThe trailer contained extensive flashbacks to famous scenes from earlier in the eight-film blockbuster franchise, such as Cruise dangling between lasers and climbing the Burj Khalifa tower in Dubai.\n\n\"I need you to trust me one last time,\" says Cruise's character, in what Paramount is marketing as supposedly the final movie of the franchise.\n\nAFP/AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/gina-rinehart-confirms-rift-with-peter-dutton-over-gas-policy-/105137108",
        "title": "Gina Rinehart and Peter Dutton confirm rift over gas policy",
        "publish_date": "Fri, 04 Apr 2025 00:42:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Billionaire conservative fundraiser Gina Rinehart has confirmed she has fallen out with Peter Dutton over the opposition leader's gas reservation plan, joining other industry figures complaining about a lack of policy detail.\n\nThe ABC on Thursday revealed the relationship between the two has soured, after Ms Rinehart's Hancock Energy website posted several news stories critical of the Coalition plan, which was announced in last week's budget reply speech in the absence of a press release or long-promised modelling.\n\nMr Dutton pushed back at suggestions the clash has become personal and said he has \"respect for Gina Rinehart as Australia's most successful businesswoman\".\n\n\"We'll have points of difference with many people, but that doesn't mean it impacts your friendship or your relationship with different business people,\" Mr Dutton told reporters in Sydney on Friday.\n\n\"So that's the best response I can give you.\"\n\nRinehart disappointed over business agenda\n\nSources told the ABC on Thursday that Ms Rinehart has been disappointed that Mr Dutton has failed to adopt a more overtly pro-business agenda on industrial relations and tax.\n\n\"She felt like he talked a big game until he had to deliver,\" one Coalition source said.\n\nMs Rinehart on Friday posted a statement on her website insisting that her friendship with Mr Dutton \"existed before he became leader of the opposition\".\n\n\"The beauty of the non-left side of politics, indeed around the world, is that people can disagree on issues at times and still remain good friends.\n\n\"My respect for Peter Dutton, his character and integrity continues, irrespective of our various differences at times.\"\n\nDutton and Rinehart fall out over gas, net zero Photo shows Gina Rinehart Peter Dutton composite A senior Coalition source told the ABC Ms Rinehart believed the opposition leader was not sufficiently pro-business.\n\nA separate statement posted below Ms Rinehart's comments, by Hancock Energy CEO Stuart Johnson, echoed industry criticism of the Dutton gas plan, which includes forcing gas exporters to divert supply destined for offshore markets to domestic buyers at no more than $10 a gigajoule. The current price is around $14 a gigajoule.\n\n\"Like others in the industry we are keen to see the details of the policy to understand how it will encourage continued investment,\" Mr Johnson wrote.\n\n\"Hancock believes that an abundant supply of gas is vital for reliable electricity, including for homes, hospitals, security, airports, businesses and more across Australia, and welcomes measures to streamline government approvals and provide policy certainty, to ensure Australia as a country is not overlooked for the necessary investment.\"\n\nGas business not impacted by policy\n\nBoth Ms Rinehart and Mr Johnson said Hancock's gas businesses were not \"currently\" expected to be affected by Mr Dutton's policy as described in his budget reply speech.\n\n\"Since 2022 Hancock has invested in excess of $2 billion into the Australian gas industry,\" he said.\n\n\"Given that most of our existing eastern states gas production through our investment in Senex has been sold under long-term contracts, we do not believe we would be affected by the Coalition policy, at least currently.\"\n\nMr Dutton, who almost a week ago promised to publish details and modelling of his gas plan \"very soon\", said on Friday that Ms Rinehart employs thousands of Australians.\n\n\"And normally the Labor Party would celebrate that as well,\" he said.\n\n\"There is an enormous contribution that the mining sector makes to Australia and we just evidenced that yesterday in Western Australia,\" Mr Dutton said, speaking a day after visiting Perth.\n\n\"Without WA pumping as an economy, we aren't paying for roads here in Western Sydney and we aren't paying for schools and we aren't building tunnels and infrastructure without that revenue from the mining sector.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/qld-outback-flooding-travel-for-easter-holidays/105131966",
        "title": "Don't cancel on us, outback Qld tourism providers urge travellers",
        "publish_date": "Fri, 04 Apr 2025 00:42:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "For most of outback Queensland, April is considered the start of tourist season.\n\nThe Easter long weekend, school holidays and cooler weather mean rodeos, festivals and camping.\n\nBy now, tourists would usually be packing their cars, dusting off tents and downloading podcasts ready to hit the road.\n\nRoads are starting to reopen in some parts of the outback, but many are still inundated. (Supplied: Eric Beresford)\n\nBut devastating floods in the south and a late wet season in the north have stalled the start to the season and tourism operators are anxious visitors will not come even after the clean-up.\n\nAlan \"Smithy\" Smith, who owns a tour company in Longreach, a two-day drive from Brisbane, worries images of floods and damaged roads will scare prospective visitors.\n\nAlan Smith said this season could be a \"once in a lifetime\" event. (Supplied: Outback Aussie Tours)\n\n\"Everyone sees it splashed on national news and social media,\" he said.\n\n\" They apply that (perception) for the whole year or for months and wipe out the opportunity or experience of actually coming into the area. \"\n\nLast year, more than a million tourists spent $813 million in the region, according to Tourism and Events Queensland.\n\nMr Smith said it was impossible to know what impact the recent flooding would have on that income.\n\n\"I don't think we'll ever put a finger on it,\" he said.\n\nJundah, two hours south of Longreach, surrounded by floodwaters. (Supplied: QPS)\n\nMr Smith said flooding at his outback hospitality and camp site on the Thompson River was nothing compared to places further south, but still packed a punch.\n\n\"Where we run our show, you'd need a good snorkel there right now,\" he said.\n\n\"It's right up through the floor of the bar … we can honestly say we have a wet bar at Smithy's.\"\n\nMr Smith said the recovery process for the outback would be huge, but out of the tragedy rejuvenation would come.\n\nThe outback in North West Queensland blooming. (Supplied: Annette Dwyer)\n\n\"It won't bring back the stock losses,\" he said.\n\n\"But the flush of green will come. People will never get this opportunity to see this country as green, as lush and all the birds and animals that go with.\n\n\"So as soon as the roads are safe, as soon as those communities are back together and can handle people, they need the help.\"\n\n'Support the communities'\n\nTwo hours south, experienced traveller Dianne Woodstock, from Gympie, delayed her trip to Winton by two days until it was safe to drive, but did not consider turning for home.\n\nDianne Woodstock has been digging in Winton since 2009. (Supplied: Dianne Woodstock)\n\n\"I had a lot of people [back home] say to me, 'Why are you still going?'\" she said.\n\nMs Woodstock makes the trek each year to volunteer as an honorary technician at the Australian Age of Dinosaurs centre.\n\nShe said numbers at the attraction were lower than usual but hoped that would change soon when roads reopen.\n\n\"If you can't get through the next bit, you stay in that town, you spend a few dollars and you support the communities,\" she said.\n\nFinancial cost 'immeasurable'\n\nEleven hours north, the gulf fishing village of Karumba is home to just under 500 people but during peak tourist season it hosts visiting fishing enthusiasts keen to haul in the catch of their lives.\n\nThe extent of the road closures is obvious on the Qld Traffic website. (Supplied: Qld Traffic )\n\nAccommodation provider Yvonne Tunney said it was impossible to measure the cost of the late wet season.\n\n\"We're taking lots of cancellations of bookings at the moment because the roads are closed,\" she said.\n\n\"[But] the long-term is very positive because it's going to be a cracker of a season.\n\nYvonne Tunney is keen to welcome visitors as soon as roads are safe. (ABC Landline: Cam Lang)\n\n\"The water holes, the bird life, the wildlife — it's going to be fantastic.\"\n\nMs Tunney urged tourists to be wary of social media and instead rely on local knowledge.\n\n\"I can't express enough the frustration we all feel right across the board with misinformation and disinformation,\" she said.\n\n\" Check the local areas you want to travel in, talk to the councils and the visitor information centres in those towns. \"\n\nThe famous Karumba sunset. (ABC Rural: Hailey Renault)\n\n'The show goes on'\n\nSeven hours south, in Julia Creek, the 28-year-old Dirt n Dust festival — a combination of rodeo, races and concerts — has been postponed.\n\nThe largest event on the calendar for the town of 500 brings thousands of tourists over three days, but Julia Creek Turf Club president Timothy Mark said the decision to postpone was unavoidable due to the sodden ground and road closures.\n\n\"It wouldn't be a good event for anyone involved,\" he said.\n\n\"There could be cars stuck there for a week.\"\n\nDirt n Dust is a major event in the outback tourism calendar. (Supplied: Dirt n Dust )\n\nOrganisers hope the decision to postpone instead of cancel will bring more tourists to the event.\n\n\"It's a big loss for the town, but the show goes on,\" Mr Mark said.\n\n'Just be patient'\n\nThree hours west, in Mount Isa, tourist park co-owner Kylie Rixon said flooding sometimes meant tourists skipped Queensland entirely.\n\nKylie Rixon is used to navigating wet seasons in the outback. (ABC North West Qld: Maddie Nixon)\n\n\"If their drive route was to come up through Charleville, and now that may not be possible, maybe they'll say, 'Oh well, we'll just go to South Australia this winter,'\" she said.\n\nMs Rixon is asking prospective tourists to be flexible during the recovery clean up further south.\n\n\"It's flooded at the minute, but don't dismiss it, just be patient,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/wonthaggi-desal-fired-up-to-ease-dry-conditions/105089636",
        "title": "Victoria's billion-dollar desalination plant set to reawaken",
        "publish_date": "Fri, 04 Apr 2025 00:19:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Victoria's hulking desalination plant is set to be reawakened for the first time in more than two years with the state government placing an order for 50 gigalitres of fresh drinking water.\n\nThe Wonthaggi Desalination plant, hunkered deep into the coastal landscape in south-eastern Victoria, has laid dormant since it was last ordered into operation in March 2022.\n\nThe plant, which converts seawater into drinking water, was in operation for 10 months in that year when it partly filled an order for 15 gigalitres of water delivered the following financial year.\n\nVictorian Water Minister Gayle Tierney said the most recent order would ensure there was enough drinking water for Melbourne and Geelong residents during the state's dry conditions.\n\n\"We know that in a severe drought storage levels can drop by 20 per cent in as little as a year,\" Ms Tierney said.\n\n\" Which is why we're acting now to avoid water restrictions and put us in a strong position for the long term. \"\n\nThe decision to order desalinated water comes as Geelong water storages reach 42.2 per cent.\n\nMelbourne's water storages are sitting at 78.1 per cent, compared to 91.5 per cent same time last year.\n\nAnd while the latest water order will see a flurry of work once again at the Wonthaggi site, some in the local community still think time and energy could have been better spent on more sustainable water solutions.\n\nHow the plant works\n\nDespite its slick integration into the rugged Bass Coast environment, the plant was a highly visible presence from 2007 when it became the focus of protests, high-paying construction jobs and even allegations of bikie involvement.\n\nThe desalination plant can supply up to 150 billion litres of water a year to Melbourne, Geelong, South Gippsland and Western Port townships, delivering water via the private sector to state water authorities.\n\nTo date, it has produced 455 billion litres of fresh drinking water for Greater Melbourne and regional areas.\n\nAs part of a 30-year contract with parent company Aquasure, the Victorian government must pay for ongoing operation and maintenance costs, whether the desalination plant is running or not.\n\nThat's in addition to the $3.5 billion initial outlay to build the plant, which was finished in December 2012.\n\nRepayments by the state government to the Victorian Desalination Project in 2023/24 were more than $567 million, a figure that pales in comparison with the record $630 million paid in the 2013/14 financial year.\n\nIt is understood more than 80 people currently staff the plant.\n\nOrder up\n\nA Melbourne Water advice document published last year made a non-binding forecast that an \"appropriate\" output for the plant in 2025/26 would be 50 gigalitres (a gigalitre is a million litres), increasing to 75GL the following financial year.\n\nThe state government hasn't ordered water from the plant since its modest 15GL order in 2022/23, of which just 3.4GL was delivered, on advice from Melbourne Water.\n\nDespite this, an Infrastructure Victoria report last month flagged future expansion plans for the plant, increasing its production capacity by 50GL a year to keep up with predicted water security needs.\n\nUp to 65 per cent of Melbourne's water may need to come from manufactured sources, the report stated, an increase from 2020 when 25 per cent of Melbourne's water was desalinated and 10 per cent recycled.\n\nVolume of desalinated water ordered (gigalitres) between 2016/17 and 2024/25. (ABC News: Madeleine Stuchbery)\n\nA Victorian government spokesperson said the plant could provide \"up to one-third\" of Melbourne's water demand.\n\n\"Victorians continue to have some of the lowest water bills in the country and Melbourne's water bills remain the lowest of any capital city in Australia,\" the spokesperson said.\n\nBut Shadow Water Minister Tim McCurdy said the plant cost Victorians more than $700 million a year \"to sit idle\", producing the needs of a contract, rather than Victorians.\n\n\"It seems illogical to contemplate the expansion of a facility that currently sits idle and is a financial burden to the Victorian budget and the Victorian people,\" he said.\n\nWonthaggi desalination plant can supply up to 150 billion litres of water a year. (ABC Gippsland: Madeleine Stuchbery)\n\nVictoria's insurance policy\n\nVictoria University honorary professor Stephen Gray has researched water treatment for more than 30 years, including desalination.\n\nHe said Victoria's desalination plant was built to secure supply, rather than to be continuously operational.\n\n\"Desalination plants traditionally want to operate the whole time; that's how you get good performance out of them,\" he said.\n\n\"A lot of the Australian ones have had to run at lower capacity or intermittently and Australia has become quite expert at that.\"\n\nProfessor Gray said he thought there were fiscal reasons behind the decision to run the plant intermittently.\n\n\"Water in dams is the cheapest water and you want to use that when it's available and turn on the more expensive water when it's needed,\" he said.\n\nWhat community cost?\n\nMark Robertson remembers the tumultuous years between the plant's announcement and the start of construction in 2009.\n\nMr Robertson, president of environmental advocacy group Watershed Victoria, was involved in peaceful protests voicing concerns about the environment and Victoria's water supply.\n\nAnti-desal protesters from the Bass Coast community at Spring Street in the late 2000s. (Supplied: Neil Rankine)\n\n\"At what cost? That was our slogan,\" he said.\n\n\"Environment, financial, and community — everybody's paying for it.\"\n\nMore than 15 years on, he still has concerns about the plant, including how much power it uses.\n\nAquasure said the power required to run the plant when fully operational was entirely offset by renewable energy.\n\nThe company has committed to buying back the same amount of renewable energy certificates, also known as carbon credits, as the plant and transfer pipeline uses annually.\n\nIt said the plant's energy consumption per household, per day was about the same as a four-star energy efficient fridge.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/luxury-rehab-facility-highlands-recovery-drops-court-case-leaves/105132004",
        "title": "$25,000-a-week luxury rehab centre shuts down amid community backlash",
        "publish_date": "Fri, 04 Apr 2025 00:06:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "A luxury rehabilitation facility that was operating on a property south of Sydney without council consent is closing down following community backlash.\n\nHighlands Recovery, owned by Paracelsus Health Pty Ltd, was offering tailored treatment programs for trauma, mental health issues and addiction at a cost of up to $25,000 a week.\n\nIt operated out of a multimillion property on the outskirts of Bowral and applied to change the development application (DA) mid last year from an existing dwelling to a group home.\n\nHighlands Recovery started seeing patients onsite before Wingecarribee Shire Council refused its application in October on the basis the 2 hectare property was not a suitable location for a luxury rehabilitation facility.\n\nNearby residents upheld many concerns, including increased traffic, and noise, and the potential risks associated with having vulnerable people wandering their neighbourhood.\n\nThe East Bowral property features nine-bedrooms, five-bathrooms and a tennis court. (Supplied: Highlands Recovery)\n\nFollowing the council's decision, the business said in a statement it had moved to a hotel in Moss Vale about 13 kilometres from Bowral.\n\nHighlands Recovery attempted to fight the decision in the NSW Land and Environment Court but dropped the case last week.\n\n\"[This is] due to sustained opposition from both the local council and neighbouring residents,\" Highlands Recovery said in a statement.\n\nThe council said it agreed to a discontinuation of the court matter.\n\n\"Therefore, the DA previously refused by Wingecarribee Local Planning Panel stands,\" council said.\n\nHighlands Recovery said it had also made the \"very difficult decision\" to stop offering its service in the region.\n\n\"At this time, we do not have any plans to continue offering luxury trauma or rehabilitation services from the region or elsewhere,\" the statement said.\n\nPatient care out of a hotel\n\nWhile the Land and Environment Court matter was underway, Highlands Recovery said it continued patient care out of Moss Manor, a boutique art hotel in Moss Vale.\n\nMoss Manor is a luxury hotel run out of the former Moss Vale Council chamber and mayoral residence. (Supplied)\n\n\"[This was] solely to fulfil its obligations to existing clients already in the program,\" the statement read.\n\n\"This was a short-term measure during the run-off phase, and we voluntarily concluded operations shortly thereafter.\"\n\nMoss Manor did not want to officially comment on the matter.\n\nNeighbours claim the Bowral property has been left vacant since a \"repossession\" sign was tied to the fence in January. (Supplied)\n\nHighlands Recovery confirmed it had not gone bankrupt.\n\n\"The commercial realities of being unable to operate from the Southern Highlands made it unsustainable to continue,\" the company said.\n\nMore than 20 staff and their clients are set to be affected, with the business laying blame on the local community.\n\nHighlands Recovery advertised a stay of between 28 and 90 days for clients. (Supplied: Highlands Recovery)\n\n\"It is unfortunate that the lack of a supportive environment in the Bowral region has resulted in the closure of this much-needed service.\"\n\nThe Bowral Action Group, formed to oppose Highlands Recovery's DA proposal, said it was \"delighted\" the business had dropped the court matter.\n\n\"Together with the passionate support of local residents, we have all achieved a wonderful result for our wonderful Southern Highlands community,\" the group said in a statement.\n\nPrivate rehab facility claims to have improved Photo shows A sign says 'Teen Challenge Grace Academy Grace Chapel' The WA health minister urges the public to avoid private mental health, drug and alcohol rehabilitation facilities until the sector is regulated.\n\nHighlands Recovery is not among the list of accredited NSW Health-funded alcohol and other drug rehabilitation services.\n\nThe Bowral Action Group has called on members of the NSW government to \"urgently review current legislation\" and \"take immediate action\" to regulate privately owned rehabilitation services.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/labor-instant-asset-write-off-20-thousand-12-months/105136854",
        "title": "Albanese targets cafes and tradies in instant asset write-off",
        "publish_date": "Fri, 04 Apr 2025 00:00:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Small businesses will get a 12-month reprieve and be able to instantly write-off another $20,000 in expenses, if Labor wins next month's federal election.\n\nLabor has moved to neutralised a similar Coalition policy but fell short of outright matching the opposition's policy.\n\nIf elected, the Coalition would make permanent a $30,000 instant asset write-off for small businesses.\n\nPrime Minister Anthony Albanese said the 12-month extension would allow businesses to buy new tools and upgrade their equipment and defended not making the tax incentive permanent.\n\n\"Because what you want to do is to encourage them to invest now,\" he told ABC Radio Sydney.\n\n\"That's the whole point, so that you create that economic activity and the multiplier that flows through immediately, rather than say, ‘oh well don't worry, sometime in the future, forever, you can do this’.\n\n\"We want to encourage that economic activity now from small business and tradies.\"\n\nMr Albanese and Opposition Leader Peter Dutton are campaigning in western Sydney, where they're eager to win the support of cafe owners, tradies and other small business operators.\n\nMr Dutton used his budget reply speech to unveil the $30,000 commitment.\n\nPolicy would extend for the next financial year under Labor\n\nInstant asset write-offs, of varying degrees, have been available for small businesses for years.\n\nIt means a business can purchase equipment and then deduct the cost from its taxable profit.\n\nABC Politics in your inbox Photo shows Brett Worthington looks at the camera wearing a blue blazer and glasses Sign up to the ABC Politics newsletter with Brett Worthington\n\nIn the dying hours of parliament before the election, Labor managed to pass a 12-month extension for this financial year.\n\nThe new announcement would see the policy extended for the next financial year and available for businesses with an annual turnover up to $10 million.\n\nMr Dutton, campaigning in Western Sydney, said the government was merely trying to patch a problem of its own making.\n\n\"Let's look at a local tradie in Western Sydney. Under Mr Albanese on budget night was told that you could have an instant asset write-off for a purchase but capped at $1,000,\" he said.\n\n\"Now, the government doesn't believe in this.\n\n\"What they have done now by flipping it to $20,000 is to try and patch up a problem of their own making to get them through the election and then I think it reverts back to $1,000.\"\n\nLoading...\n\nHaving problems seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/dark-mofo-events-2025-mona-tasmania-chris-twite/105117620",
        "title": "Dark Mofo returns with creepy jazz clowns and a man slowly buried in sand",
        "publish_date": "Thu, 03 Apr 2025 23:02:56 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Tasmanian winter arts and music festival Dark Mofo has announced its program for 2025, which features performances from gothic-rock band The Horrors and anonymous masked duo Clown Core, as well as art projects like a collective scream and an artist buried in sand.\n\nIt's the first festival under new artistic director Chris Twite, and comes after a break last year due to \"rising costs and changing conditions\".\n\nChris Twite was announced as Dark Mofo's new artistic director in 2023, but last year's cancellation means this year marks his first edition of the festival. (Supplied)\n\nTwite — who joined Dark Mofo after programming roles at Brisbane Festival, Sydney Festival and Sydney Opera House — says the year off gave the festival the space to forensically break down what it wants to achieve, and how to do so cost-effectively.\n\n\"The legacy of Dark Mofo is greater than me,\" he says.\n\n\"It's a challenging, confronting arts festival that's unlike any other in Australia, and it's my role to just shepherd it through the next era and make sure that it outlasts me.\"\n\nThis year's Dark Mofo also sees the return of festival staples, including late-night party Night Mass, the Nude Solstice Swim, Winter Feast, and interactive art precinct Dark Park at Macquarie Point, the site of a proposed Hobart stadium.\n\nThe burning of the Ogoh-Ogoh effigy will also return; this year it's in the shape of the endangered Maugean skate — the endangered fish whose threat of extinction saw Greens senator Sarah Hanson-Young pull out a salmon in Parliament to at the end of March.\n\nMuch of the festival's non-musical program is free or low-cost, including the art program, and Twite says that's especially appreciated by local audiences.\n\nDark Mofo's annual Ogoh-Ogoh ritual burning is back, in a procession from Parliament Lawns to Dark Park. (Supplied)\n\n\"Anyone can come and be in a place to see world-class art,\" he says.\n\nIt's all part of a focus on the festival being, in Twite's words, one of \"discovery\".\n\n\"The audiences who come are curious — whether that's someone visiting who wants to find a late-night party, or whether it's a family with a kid in a stroller in the blistering wind on the foreshore in the middle of the night.\"\n\nMoody music program features creepy clowns and boundary-pushing international acts\n\nDark Mofo's music program includes 17 Australian-exclusive acts — including The Horrors's first Australian shows since 2012 as well as US alt-rapper Tierra Whack (last here for Splendour in the Grass in 2022) and progressive metal band Baroness.\n\nClown Core's 2020 album, Van, was accompanied by videos for each track where the duo played live in a mini-van, driven by a man in a balaclava. (Supplied: YouTube)\n\nJazz-metal anonymous duo Clown Core have been confusing the internet with bizarre, surreal videos and genre-defying releases since 2008, but only began performing live in 2023. Now, Australian audiences can take in the absurdity — and terrifying masks — up-close.\n\nOther exclusive acts include US darkwave acts Boy Harsher and Cold Cave, who previously cancelled their 2024 tour, electronic breakcore duo Machine Girl (think Dance Dance Revolution meets cyberpunk), and the modern Berlin-based iteration of influential Australian post-punk band Crime & The City Solution, with frontman Simon Bonney standing strong.\n\nPhiladelphia artist Tierra Whack debuted in 2018 with Whack World, an eclectic, funny and inventive mixtape with 15 tracks in less than 15 minutes. (Supplied)\n\nNew Australian trio Under In Between will also make their live debut, consisting of Dead Can Dance's Lisa Gerrard, composer Cye Wood and William Barton, a Kalkadunga man and multi-instrumentalist known for playing the yidaki with classical orchestras across the world.\n\nAdditional Australian acts include Luritjia singer-songwriter Keanu Nelson, Melbourne dance-punk act Gut Health, doom metal act Divide and Dissolve, and Melbourne trio The Peep Tempel, as part of their previously announced reunion shows.\n\nArts festival Berlin Atonal will also take over Hobart's Playhouse Theatre for an audio-visual event called Nox Omina, while the Tasmanian Symphony Orchestra will perform a symphony of abstract waterscapes at the Federation Concert Hall, curated by London Contemporary Orchestra's artistic co-director and conductor, Robert Ames.\n\nKeanu Wilson released his debut album Wilurarrakutu last year, a collection of buoyant casiotone Gospel songs sung in both Luritja and English. (Supplied)\n\nThe festival also shares several artists with Sydney's Vivid and Melbourne's Rising festivals, including Beth Gibbons of Portishead, indie-rock act DIIV, alt-jazz artist Jessica Pratt and trap artist Thaiboy Digital.\n\nThis year's music programming extends beyond Hobart, with Thelma Plum and Methyl Ethel playing together at Launceston's Princess Theatre, while Ulverstone gets XYZZY, a psychedelic collaboration between New Zealand illustrator Jess Johnson and American musician Simon Ward.\n\nProvoking conversation through art\n\nAustralian artist Simon Zoric will bring his series Coffin Rides to Dark Mofo, where visitors go on a trip to the afterlife — and take home a photo as proof. (Supplied)\n\nHighlights of Dark Mofo's art program include the work of First Nations Alaskan artist Nicholas Galanin, British producer Richard Russell's collaborative music project Everything Is Recorded, Brazilian Marina Abramović collaborator Paula Garcia, and Cuban performance artist Carlos Martiel.\n\nGalanin's work at Dark Park is a 12-metre-wide neon sign that reads: \"I've written a new national anthem. Take a knee and scream until you can't breathe.\"\n\n\"[People] can scream as long as they want,\" Twite says. \"It's this moment for catharsis, for protest, for shouting, for release.\"\n\nIt won't be the festival's only ear-splitting moment: Twice during the festival you'll be able to hear the latest work from Everything Is Recorded (aka legendary XL Recordings boss Richard Russell) — a 30-minute meditation on the winter solstice that will project from a sound system over the city of Hobart.\n\n\"We're the only arts organisation to own one of these systems,\" Twite says. \"It's usually reserved for mass evacuations and for warnings, so it can project sound for seven kilometres in every direction.\n\n\"It works by sound bouncing off everything else, so it sounds like it's everywhere around you all at once … Local residents can come out of their house to hear it.\"\n\nBrazilian artist Paula Garcia and a stunt driver will edge towards a head-on collision across two hours for Crash Body. (Supplied)\n\nGarcia's work meanwhile will see her and a stunt driver almost collide for more than two hours, a performance putting audiences into \"this perpetual state of tension and unnerving and dread\", Twite says.\n\nIt's a one-time-only performance, and the first car-based work Garcia has performed in front of an audience.\n\nMartiel will extend a performance he first debuted at the Venice Biennale in 2017, which saw him trapped in a glass box filling slowly with water from the Mediterranean Sea.\n\nFor one performance only at Dark Mofo, Martiel will be stuck inside an hourglass slowly filling with sand, at Hobart Town Hall.\n\n\"It's really exciting to put that work out into the world,\" Twite says. \"But it'll be very hard to watch.\"\n\nOther international artists include French-Japanese duo Nonotak, Swiss artist Claudia Comte, Brazilian artist Paul Setúbal, Kiwi artist and musician Ronnie van Hout, and Belgian-based Filipino artist Joshua Serafin.\n\nNew Zealand artist Ronnie van Hout's Quasi — a sculpture where the artist's face is merged with a giant hand — will watch Dark Mofo's crowds atop a waterfront building. (Supplied)\n\nThe festival's local artists, including Trawlwoolway artist and playwright Nathan Maynard, also don't shy away from difficult themes.\n\nHoused in a basement, Maynard's previously announced work highlights museums' history of stealing and displaying the remains of ancestors of First Nations peoples. It draws attention to an especially timely conversation about the repatriation of both cultural objects and peoples: just last month, the University of Aberdeen in Scotland agreed to return the skull of a Tasmanian Aboriginal man and a shell necklace to Traditional Owners.\n\nMaynard has described his installation as speaking \"to the sadistic power white insitutions flex when they deny First Nations people the humanity of putting our ancestors' remains to rest\". (Supplied: Dark Mofo/Jesse Hunniford)\n\n\"I'm excited to see the conversations that are provoked from people going [to see Maynard's work],\" Twite says.\n\n\"It is already spurring conversation outside of the festival, and that's important, because the repatriation of those remains is ongoing. They still are in countless collections, unnamed, unknown, and these people deserve to be returned.\"\n\nAustralian artist Travis Ficarra's new sculpture Chocolate Goblin will stand five metres tall at a decommissioned church. (Supplied)\n\nOther local artists that make up the program include Ida Sophia, bringing her Ramsay-Prize-winning video work to Tasmania; Simon Zoric; Ben Cannings; Karina Utomo; and Travis Ficarra, who brings a five-metre-tall goblin sculpture to the altar of a decommissioned church.\n\nDark Mofo Films will also return with a program of 11 movies at North Hobart's State Cinema, including cult classics David Lynch's Eraserhead, Ted Kotcheff's Wake in Fright, and Rolf de Heer's Bad Boy Bubby.\n\nDark Mofo runs from June 5-15 in Hobart, with the Nude Solstice Swim on June 21.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/epl-ange-postecoglou-var-tottenham-spurs-chelsea/105136666",
        "title": "Postecoglou claims VAR is 'killing the game' after Spurs lose to Chelsea",
        "publish_date": "Thu, 03 Apr 2025 22:56:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tottenham manager Ange Postecoglou has expressed his frustration that video reviews are \"killing the game\" after his team had an equaliser overturned in the 1-0 loss at Chelsea in the English Premier League.\n\nPape Sarr's goal in the 69th minute was disallowed for his foul in the build-up, with video assistant referee Jarred Gillett and on-field referee Craig Pawson taking a long time to reach a decision.\n\nIt contributed to the second half having 12 minutes of stoppage time at Stamford Bridge.\n\nEnzo Fernández had earlier scored for Chelsea in the 50th minute.\n\n\"It's [VAR] killing the game,\" Postecoglou said.\n\n\"It's not the same game it used to be.\"\n\nPostecoglou added: \"You just don't know what you're going to get. You're standing around for 12 minutes. It's killing the game.\n\n\"But no-one cares about that. I think everyone loves the drama, the controversy.\n\n\"I'm sure there'll be 24 hours of discussion around it, I think that's what everyone wants. It's killing the spectacle of the game.\"\n\nPostecoglou appeared more unhappy that it took so long to come to a decision, rather than the decision itself.\n\n\"If the ref saw that and needed to see that for six minutes, tell me what's clear and obvious about it,\" he said.\n\nThere has been a growing disconnect between Postecoglou and Tottenham's fans, with the team languishing in 14th place and losing its playing identity.\n\nThis was a 16th loss in 30 Premier League matches this season for Spurs.\n\nTheir visiting fans serenaded Postecoglou with a chant of \"You don't know what you're doing\" when he brought on Sarr to replace Lucas Bergvall.\n\nPostecoglou then appeared to face the fans and cup his hand to his ear after Sarr scored the goal that was later disallowed.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/how-pebbling-small-gestures-help-maintain-friendships/105036638",
        "title": "'Pebbling' keeps me connected with friends when I'm exhausted",
        "publish_date": "Thu, 03 Apr 2025 22:47:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "When a penguin in the wild wants to express its affection for another penguin, they will find a pebble and drop it at the feet of the object of their affection.\n\nThis process is known as pebbling.\n\nFor penguins, the pebbles have a practical purpose: they are an integral part of nests, ensuring that baby penguins have a relatively safe place in which to hatch and grow.\n\nIn recent years, the use of \"pebbling\" has evolved to apply to humans.\n\nAlthough it was initially adopted within the autistic community to describe a form of gift-giving, or a romantic gesture between members of a couple, it's now also used to refer to one person sending another person (or group of people) a photo or video on social media.\n\nThe photo or video is usually sent without any context. It is, in effect, the human, digital version of a penguin dropping a pebble at the feet of a loved one.\n\nI only learnt of this new meaning for the term last year, but have been engaging in pebbling for a few years.\n\nLearning the pebbling love language\n\nThe first instance of pebbling I recall was over 10 years ago, with my friend Melanie. Back then, I was far more anxious than I am now, and social media was not as ubiquitous (at least not for me).\n\nShe'd sent me a meme — the specifics of which I can't recall.\n\nWhat I do recall is seeing the meme without context and panicking — what if I said the wrong thing in response? What was she trying to imply with the meme? What subtext was I missing?\n\nABC Lifestyle Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nI thanked her for sending it and hoped I hadn't somehow ruined our friendship. Spoiler: I hadn't.\n\nI don't remember when I first started sending other people content in the same way, but now I do it without that second guessing.\n\nAdorable Lincoln who often features in messages from my friend Jess, giving me glimpses into her day and her wider world. (Supplied: Laura Pettenuzzo)\n\nGlimpses of my friends' wider worlds\n\nThe content about which my friends and I pebble (yes, I use it as a verb) can vary according to what we come across as we scroll through our social media feeds or in response to what's happening in our lives.\n\nFor example, my friend Jess loves dogs. Her pet cavoodle, Lincoln, is her best friend, and is beloved by all who meet him.\n\nShe'll often send me pictures of Lincoln at day care, at work with her, or settled next to the book she's reading.\n\nIn this way, I delight not just in Lincoln (who is utterly adorable) but in glimpses of Jess's wider world, too.\n\nWhen Jess knows I'm stressed at work, she'll send me humorous or encouraging content, and I know she won't be offended if the only thing I offer in reply is a thumbs up or a love heart.\n\nI try to do the same for Jess and my other friends on social media.\n\nPet sitting helps me feel needed Photo shows A selfie of a woman wearing a white mask and a fluffy ragdoll cat with blue eyes. Pet sitting Kevin gave me routine and connection at a hard time.\n\nWhen I can't manage a call\n\nPebbling might seem like a small thing — in some ways, it absolutely is. But, as with anything, the meaning we've ascribed to it can make it something greater.\n\nEvery message is a bridge from their minds to mine, a reminder that our bond endures.\n\nSometimes pebbling works for me because I'm busy, or I feel too overwhelmed to engage in any other way.\n\nSometimes — often — it's because I'm exhausted by my cerebral palsy, a disability that drains a disproportionate amount of my energy.\n\nMost of my energy, by necessity, is devoted to my work. By the end of each weekday, and often on the weekends, the thought of a phone call is too much, and an in-person catch-up is not in the realm of possibility.\n\nBut, sending an image or video to a friend as I let myself unwind? That, I can manage.\n\nThe content about which my friends and I pebble varies depending on our relationship and what's happening in our lives. (Supplied: Laura Pettenuzzo)\n\nPebbling with intention\n\nIf I know that a friend is reading a particular book, or watching a particular show, I'll send content related to that.\n\nTo my fellow disabled friends, I'll send sarcastic content about broken elevators or inaccessible spaces, things I know will resonate.\n\nFriendships are built on so much more than quick content exchanges, of course. They need a foundation of trust and shared understanding, of conversations had and memories made.\n\nI've got all of those, and I have pebbling, too.\n\nWith every reel, image or GIF, I'm trying to say, \"I love you,\" and \"I miss you,\" and \"please don't forget about me.\"\n\nWhen I can't say those things myself, because of distance or clashing schedules or disability, I hope that pebbling can say it for me.\n\nLaura Pettenuzzo (she/her) is a disabled writer living on Wurundjeri country.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/trump-tariffs-howard-lutnick-australia-us-beef/105136526",
        "title": "Trump adviser suggests lifting US beef ban won't lead to tariff exemption",
        "publish_date": "Thu, 03 Apr 2025 22:38:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "Donald Trump's commerce secretary has indicated Australia should not expect an exemption from tariffs even if it relaxes its restrictions on imports of American beef.\n\nThe US president singled out Australia's barriers on beef imports when he unveiled his \"liberation day\" tariffs plan, which has sent American markets plummeting and provoked panicked trade partners to plot retaliation.\n\nAustralian exports will be hit with a 10 per cent tariff from Saturday, the lowest rate applied to any country.\n\nDozens of countries face higher \"reciprocal\" tariffs, but Australia's longstanding trade deficit with the US means it has avoided a rate beyond the minimum.\n\nWhat is a tariff? A tariff is a tax on a product imported from another country.\n\nfrom another country. It's paid to the government by the company that imports the product.\n\nthat imports the product. The tariff is generally calculated as a percentage of the price paid by the importer to the foreign seller.\n\npaid by the importer to the foreign seller. Historically, tariffs have pushed up prices as higher product costs are often passed on to consumers.\n\nIn an interview with business channel CNBC, Commerce Secretary Howard Lutnick was asked: \"If they [Australia] were to start taking American beef imports, would that be something that would get them an exemption, and how quickly do you think that could happen?\"\n\nMr Lutnick responded: \"I don't think the word 'exemption' is going to be a factor. I don't think that's such a thing. I think what there's going to be is a world of fairness.\"\n\nAustralia blocked the importation of fresh US beef in 2003 because of fears over BSE, commonly known as mad cow disease.\n\nThe World Organisation on Animal Health now rates the BSE risk in the US as \"negligible\". The American beef lobby has been pushing for access to the Australian market, which it says it remains unfairly locked out of.\n\n\"Australia bans — and they're wonderful people, and wonderful everything — but they ban American beef,\" Mr Trump said during his speech on tariffs on Wednesday, local time.\n\n\"And, you know, I don't blame them, but we're doing the same thing right now, starting at midnight tonight, I would say.\"\n\nThe comment initially sparked fears that the US, which is Australia's largest red meat export market, was banning Australian beef. But Prime Minister Anthony Albanese later said American officials had confirmed that was not the case.\n\nIn a separate interview on Thursday, Mr Lutnick said biosecurity measures that stopped American agricultural exports were \"nonsense\".\n\nCommerce Secretary Howard Lutnick has been advising Donald Trump on tariffs. (AP: Mark Schiefelbein)\n\n\"One-point-four billion people in India and we can't sell them corn, Europe won't let us sell beef, Australia won't let us sell beef,\" he told CNN.\n\n\"They want to say, what, 'the seeds are different', right? Other people in the world are using seeds that insects — come on, this is nonsense, this is all nonsense. What happens is they block our markets.\"\n\nBoth Prime Minister Anthony Albanese and Opposition Leader Peter Dutton have said they were opposed to weakening biosecurity regulations to appease the Americans.\n\nWhat Trump's tariffs could mean for Australian exports Photo shows Two glasses of red wine. Here's what Donald Trump's 10 per cent tariff could mean for Australian exports.\n\nMr Albanese has outlined a five-point plan to respond to the tariffs, while Mr Dutton has indicated a Coalition government would try to leverage the US-Australia military alliance to strike a deal.\n\nDemocratic congressman Joe Courtney, a co-chair of the Friends of Australia Caucus, said the tariffs on Australia \"defy any logic\". He too pointed to the military alliance, and praised Australia for its \"herculean effort to strengthen its military posture in the Indo-Pacific and deliver on the AUKUS mission\".\n\n\"Imposing a tariff equal to Iran is a slap in the face to a great ally and an embarrassment to Americans who value our two countries' shared commitment to a free and open Indo-Pacific,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-04/trump-tariffs-impact-economy-inflation-yesterdays-problem/105131364",
        "title": "Inflation in Australia is 'yesterday's problem' after Trump's tariffs",
        "publish_date": "Thu, 03 Apr 2025 21:59:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "What impact will US President Donald Trump's new tariffs have on the global economy? What will they do to inflation and growth in Australia?\n\nEconomists have scrambled to answer those questions, and they say the chances of interest rate cuts have increased in Australia, because concerns could soon shift to supporting economic growth.\n\nWhat impact will Trump's tariffs have on Australia's economy?\n\nEconomists say the \"direct\" impact of President Trump's new tariff regime on Australia's economy will be small.\n\nThat's because Australia received a tariff rate of 10 per cent, which was the smallest tariff rate applied to any country, and the US isn't a huge export market for Australia (although individual sectors of Australia's economy, such as the beef industry, will have to adjust).\n\nTrump's tariffs hurt Australia Photo shows US President Donald Trump sits behind a desk in the White House rose garden, signing an executive order. The federal government is worried sweeping tariffs could spark economic turmoil in the region and globally, and the impact this could have on Australia.\n\nThey say in 2023-24, Australia exported roughly $22 billion worth of goods to the US, which was less than 5 per cent of our total goods exports.\n\nCBA economists Kristina Clifton and Samara Hammoud estimate that a modest 0.2 per cent of Australia's nominal GDP could be at risk from Trump's tariffs over the next few years.\n\nTo put that in perspective, they say Canada's GDP could decline by 2.6 per cent over the next few years, while Mexico (-2.4 per cent) and China (-1.7 per cent) will also be hit heavily, and the Eurozone (-0.8 per cent) and Japan (-0.7 per cent) will be moderately hit.\n\nHowever, economists say the \"indirect\" impact of Trump's new tariffs could be a problem for Australia, depending on how the tariffs disrupt trading patterns and damage global growth.\n\nThat's because the US has put large tariffs on Australia's major trading partners.\n\nThe US tariffs applied to Australia's major trading partners could end up having a significant indirect impact on Australia. (Source: CBA)\n\nFor example, it has put a 64 per cent tariff rate on Chinese imports, and a 24 per cent tariff rate on Japanese imports.\n\nThose two countries accounted for 50 per cent of Australia's goods exports in 2023-24 (36.8 per cent of Australia's goods exports were sent to China, 14.5 per cent to Japan).\n\nAnd CBA's economists say the global impact of Trump's tariffs could be large if China's economy slows in response to the tariffs, although they expect Chinese authorities to deploy additional stimulus to prevent China's economy falling short of its \"around 5 per cent\" GDP growth target.\n\nA marked slowdown in China's economy will have ramifications for Australia, so we'll have to wait and see.\n\n\"The indirect impact from our trading relationships with other economies, especially China, is more uncertain and will take some time to unpack,\" CBA senior economist Belinda Allen said.\n\nIs inflation now 'yesterday's problem'?\n\nEarlier this week, when the Reserve Bank Board kept interest rates on hold, financial market pricing suggested there was a 70 per cent chance that the RBA would cut rates in May.\n\nBut after Trump's tariff plan was announced yesterday, that jumped to a 90 per cent chance.\n\nFinancial markets also think there will be another rate cut by August, and a third by November.\n\nReserve Bank leaves interest rates on hold Photo shows People walking past the outside of the Reserve Bank of Australia in Sydney. The RBA board has kept its cash rate target unchanged at 4.1 per cent this month, after delivering its first cut since November 2020 at its Feburary meeting.\n\nThe odds for all three rate cuts increased noticeably yesterday, on the expectation that Trump's tariffs will slow down global growth and therefore dampen inflation (although in the US, the tariffs could cause a jump in consumer prices).\n\nTraders are clearly betting the RBA and other central banks will have to respond to the slowdown in global growth by cutting rates.\n\n\"Inflation is rapidly becoming yesterday's problem,\" IG market analyst Tony Sycamore said.\n\n\"The RBA is expected to shift their attention to shoring up growth.\n\n\"The reason for the dramatic shift is [the] tariff announcements went far beyond what was expected, and have increased the chances of a trade war and recession in the US.\n\n\"Furthermore with goods from countries like China and Vietnam now effectively shut out of the US we expect to see a flood of cheaper goods into other Asian markets including our own,\" he said.\n\nCan we avoid a global recession?\n\nIt's a fluid situation.\n\nEconomists say we'll have to see whether Donald Trump will give exemptions to individual countries, during trade negotiations in coming months, before we know what the final structure of his tariffs looks like.\n\nBut let's assume no country will get an exemption from the tariffs as they've been announced.\n\nTariffs threaten financial blow-up Photo shows Donald Trump holds a list of tariffs by country. The Reserve Bank's latest financial stability review identifies three key risks to financial stability, and Donald Trump's tariff announcement worsens all of them.\n\nBen May, the director of global macro research at Oxford Economics, says the fact that President Trump's tariffs will begin almost immediately, rather than being phased in over time, means they'll have a big negative impact on global economic activity.\n\nHe says there's a real possibility the global economy will slow markedly.\n\n\"The sudden tariff hikes may lead to more front-loaded impacts, and could lead to greater near-term supply-chain disruption, as there is less time for firms to adjust to the new environment,\" he said.\n\n\"In two or three years' time, US imports could fall by around 15 per cent due to discounted reciprocal tariff hikes set to take effect within a week.\n\n\"Along with ongoing uncertainty about future trade policy, this is likely to lead to a marked downgrade to our world GDP growth forecasts, with annual global growth plausibly falling below 2 per cent [this year].\n\n\"This would still be some way off the technical definition of a global recession — for this to happen, GDP growth would need to fall below the rate of world population growth, which is currently about 0.9 per cent in annual terms.\n\n\"Nonetheless, it would be the weakest annual growth rate since the global financial crisis, excluding the pandemic period,\" he said.\n\nTrade diversion is a risk (and opportunity) for Australia\n\nEconomists say for Australia, much will depend on how economic activity in Asia is impacted.\n\nThat's because 85 per cent of Australia's goods exports go to Asia, accounting for 18 per cent of Australia's GDP.\n\nThey say it's hard to know what will happen at this stage, and whether or not individual countries manage to negotiate exemptions with the US.\n\nBut if the tariffs remain in place indefinitely, every affected country will adjust their trading relationship with the United States, and with each other.\n\nAlbanese outlines five-point plan to respond to Trump's tariffs Photo shows a male politician wearing a suit and yellow tie speaking at a lectern The prime minister has outlined his government's strategy for responding to American tariffs, indicating further announcements in the weeks ahead.\n\nAnd countries will look for potential gains to be made from alternative trading relationships, and those new relationships will re-wire global trade.\n\nFor example, when geopolitical relations broke down between Australia and China in 2020, China imposed tariffs or other trade restrictions on a range of Australian goods including coal, timber, lobsters, barley, cotton, wine, beef and lamb.\n\nThat led to some initial pain for Australia's exporters, but Australia's exporters eventually found new markets for their goods and many of those new trading relationships have solidified, even though China has now removed those trading restrictions on Australia.\n\nEconomists say there will undoubtedly be some trade diversion in response to Trump's tariffs, and that could work in Australia's favour or against Australia's favour, depending on the situation.\n\nPrime Minister Anthony Albanese says he won't retaliate directly against the US tariffs, but he has announced a range of policies to help Australia's exporters find new markets overseas.\n\nThese include $50 million of emergency funding for affected industries, a new Economic Resilience Program with $1 billion in zero-interest loans to help producers find new export opportunities, the strengthening of anti-dumping rules, and the establishment of a critical minerals reserve.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/goodfood/vic-good-food-guide/pizza-pizza-pizza-20250404-p5lp7s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pizza Pizza Pizza",
        "publish_date": "Fri, 04 Apr 2025 12:54:09 +1100",
        "category": "finance",
        "authors": [
            "Emily Holgate"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\n1 / 3 Pizza Pizza Pizza does slices late into the night. Supplied 2 / 3 Outside the Meyers Place bar. Supplied 3 / 3 A selection of the New York-style pies available. Supplied Previous Slide Next Slide\n\nPizza$$$$\n\nJust down the popular Meyers Place laneway, Pizza Pizza Pizza has fast become a go-to pit stop for late-night diners seeking New York-style pies and cocktails in the CBD. It’s open until 1am, making this moody, dimly-lit bar a hub for hungry punters spilling out of neighbouring theatres on Friday and Saturday nights.\n\nOrder by the slice or by the pie (12 or 18 inches) – maybe it’s a classic pepperoni, or a funghi-heavy ‘Magic Mushroom’ number drizzled in truffle oil. Gluten free bases and vegan cheese are available, too, and you can mix-and-match toppings with half-half pies.\n\nBehind a black curtain at the rear lies a semi-private, sitting-only bar where you can settle in for a negroni night cap.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/bendigo-s-chinese-community-fires-up-for-2025-easter-festival-20250404-p5lp7x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bendigo’s Chinese community fires up for 2025 Easter Festival",
        "publish_date": "Fri, 04 Apr 2025 12:49:53 +1100",
        "category": "finance",
        "authors": [],
        "text": "Bendigo’s Chinese community fires up for 2025 Easter Festival\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/who-gets-the-friends-in-a-divorce-it-depends-on-who-you-ask-20250403-p5lozw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Who gets the friends in a divorce? It depends on who you ask",
        "publish_date": "Fri, 04 Apr 2025 12:33:15 +1100",
        "category": "lifestyle",
        "authors": [
            "Sara Mulcahy"
        ],
        "text": "Saying goodbye No matter how much you may want to maintain friendships made during your marriage, there will be people who don’t stand the test of time. Losing friends to your ex can be painful — it may well feel like yet another layer of grief to process during an already challenging time. Coping with this loss will mean you have to dig deep to find resilience. Friends who choose to prioritise your ex may have their own reasons —perhaps that was the closer relationship all along, or they simply feel more aligned with them now. It doesn’t reflect on your value as a person. And it’s OK to grieve. “Losing shared friends is a real loss, and it’s OK to feel sad, hurt or even betrayed,” says Cao. “Give yourself permission to process these emotions without judgment.”\n\nLoading Jowett says this was hard to process when she split from her husband. “Sadly, I did lose some friends who were more his friends — and he also needed his own supporters,” she says. Cao says to focus on your own friendships, build new connections, and try to stay positive. “It’s easy to fall into resentment or frustration, but focusing on the loss can drain your energy. Instead, prioritise self-care and activities that bring you joy.”\n\nWhen friends split up From the other side of the fence, it can be challenging to see your friends splitting up, especially if you’ve known both of them for a long time. At best, you might be upset as your social situation is rocked. You might at first resent feeling forced to choose. At worst, you might feel manipulated or used, a pawn in the continuing battle. “Create space for your friends to share their feelings,” says Cao. “Avoid being the messenger between the parties, respect your friend’s privacy and don’t gossip with mutual friends.” For Jowett, whose experience inspired her to become a life coach for women like her, having a friend like Ritman was critical to her wellbeing in the months after she separated. “When I felt like hiding, Oenone was one of my circle of key supporting friends encouraging me,” she says. “She would message me to check in and call me for chats, suggest outings.\n\nLoading “I knew I could trust her implicitly and it was safe to be vulnerable about my loss, without divorce-shame. I had someone who listened and empathised and didn’t dramatise it or discuss it elsewhere.” But what if you don’t want to have to choose? Is it possible to stay neutral Switzerland and for all to be well? “You can remain friends with both parties,” says Cao. “But it does require careful navigation, clear boundaries and sensitivity. More often than not, people will end up choosing a side.” Of course, if one or other of the married parties has done something undeniably wrong, this changes things. Joint friends often feel honour-bound to take the side of the spouse who has been unwittingly thrust into the role of victim.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/celebrity/does-my-brand-look-big-in-this-how-influencers-sold-their-souls-20250328-p5lnag.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Does my brand look big in this? How influencers sold their souls",
        "publish_date": "Fri, 04 Apr 2025 12:33:03 +1100",
        "category": "finance",
        "authors": [
            "Brodie Lancaster"
        ],
        "text": "Her complaint might have been specific to a breed of Manhattan Pilates princesses whose schedules consist of taking photos of their morning matcha and attending product launches, but it could apply to any major city around the world. Including Melbourne.\n\n“They’re all carbon copies of each other … they all look like they shop at Revolve,” a user called @martinifeeny told her small circle of followers, referencing a fast-fashion brand known for shipping twenty-somethings to Coachella for the purpose of having their picture taken and not actually entering the festival. “They’re all basic – but they’re skinny and pretty, so stuff looks cute on them. But boring … no hate.”\n\nCall me outdated, but my mind is still locked into last week’s viral video in which a person aired her opinions about a crop of new arrivals to New York, declaring the city’s influencers to be “boring as f---”.\n\nA conversation has been brewing online. And when I say “online” I mean “on TikTok”. And when I say “been brewing” I really mean “happening recently enough that it’s still newsworthy but over a week ago, so the zeitgeist has mostly moved on to the next outrageous thing to react to with peak emotion”.\n\nNow, before you label me a geriatric Millennial shaking my fist at the cloud I pay $4.49 each month to store photos of my cat in, let me affirm that I’m upset at neither the concept nor the proliferation of influencers. A version of their work has always existed, and without the structures of traditional media walling their behaviour off with a facade of exclusivity, it’s become a lucrative and accessible business for many people drawn to it. If you can take the photos and build the audience and find a way to connect, all power to you! Get the bag. Personally, I sound like I’m going to cry when I have to talk into a camera, so it’s simply not on the cards for me.\n\nLoading\n\nBut I’ve spent enough time working in advertising over the past 15 years and staring into the blue glow of my phone every night for approximately one to six hours to confidently say that the criteria for succeeding as an online creator today is less about wielding any amount of genuine influence, and more to do with a person’s capacity to transform into an authentic-sounding billboard for whatever brand pays them to do so.\n\nIn the mid-2000s, I was a teenager as the first generation of social media stars were born. I watched as people wrote fashion blogs that transformed them into front-row fixtures at international couture shows on the strength of their ability to express themselves through writing and styling.\n\nI saw party girls whose faces somehow looked better with streaks of mascara cascading down them go from knowing the right DJs to collaborating with designers on shoes I would have killed to afford. I saw Tumblr stars influence culture, open gallery shows and headline festivals. I saw the greatest blogging minds of my generation, eventually, migrate to one platform and slowly mould themselves to fit an algorithm determined by a dweeb king.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/meet-the-teenager-at-the-centre-of-a-three-code-tug-of-war-20250403-p5loxj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meet the teenager at the centre of a three-code tug of war",
        "publish_date": "Fri, 04 Apr 2025 12:31:47 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "NRL great Scott Prince has thrown his support behind teenage phenom Shalom Sauaso pursuing multiple rugby codes, until the rival sports attain full-time professionalism.\n\nThe 17-year-old is in a tug of war for her services, as she prepares to play for the Queensland Reds in the Super Rugby Women’s semi-final on Sunday before launching her NRLW career at the Brisbane Broncos.\n\nSauaso has also been on rugby sevens radar, having been named the 2023 Global Youth Sevens’ most valuable player. By the time of the Brisbane 2032 Olympics, she will be approaching her prime.\n\nShalom Sauaso’s tackle-busting ability has been crucial in the Queensland Reds’ strong season. Credit: Neha Kumar/Queensland Rugby Union\n\nBut her NRLW coach Prince gave her his blessing to continue juggling the codes.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/art-and-design/more-like-a-tomb-than-luxury-apartments-the-plans-dividing-sydney-s-elite-20250331-p5lnth.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "More like a tomb than luxury apartments: the plans dividing Sydney’s elite",
        "publish_date": "Fri, 04 Apr 2025 12:26:07 +1100",
        "category": "finance",
        "authors": [
            "Julie Power"
        ],
        "text": "It’s the design war that has divided bankers, lawyers, celebrities, politicians, some senior members of the Hari Krishna – and many architects.\n\nThe 19-storey luxury Altair Apartments at Rushcutters Bay won architects Engelen Moore – now Ian Moore Architects – a grand slam of prestigious awards including the World Architecture Festival’s best building in Australasia in 2002.\n\nAltair Apartments in Potts Point is the subject of a development dispute. Credit: Flavio Brancaleone\n\nSince then, Ian Moore became the building’s go-to architect, working on a range of projects to ensure the integrity of a building that Altair’s website calls an “architectural icon”.\n\nThat was until late last year when Moore says he was removed without notice by the developer NTG Investment Group from a proposal to build new apartments on the site of two retail lots on the southern forecourt.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/us-stock-market-leads-worldwide-sell-off-following-trump-s-tariff-shock-20250404-p5lp2e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX tumbles after Wall Street’s $4 trillion meltdown",
        "publish_date": "Fri, 04 Apr 2025 12:25:23 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket is sharply lower but has clawed back some of its early losses after a horrific night on overseas markets as investors digested the impact of Donald Trump’s reciprocal tariffs.\n\nThe ASX200 was 116.4 points or 1.5 per cent lower at 12.00pm AEDT, with more than $30 billion wiped off the value of the bourse, and nine of 11 industry sectors in the red. The market was down nearly 2 per cent in early trade.\n\nRepercussions from US President Donald Trump’s sweeping tariff announcements spread across global markets. Credit: AP\n\nThe energy sector tumbled after oil prices slipped more than 6 per cent overnight. Santos fell 6.6 per cent and Woodside Energy plunged 6.1 per cent.\n\nMining stocks have pared early losses. BHP was 0.7 per cent lower, Rio Tinto slipped 0.3 per cent while Fortescue added 0.2 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/economic-turmoil-created-by-trump-s-tariffs-will-affect-everything-from-coffee-to-interest-rates-20250403-p5loy0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Economic turmoil created by Trump’s tariffs will affect everything from coffee to interest rates",
        "publish_date": "Fri, 04 Apr 2025 12:10:46 +1100",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "Politically, Trump’s decision was perhaps the biggest intervention by a US president in an Australian federal election since Lyndon Johnson visited the nation in October 1966 to effectively endorse Harold Holt who would lead the Coalition its largest ever victory. The economic turmoil is being driven by two factors. Trump’s plan upends how the globe has operated – and grown – since the 1940s. It also means huge financial shocks that will filter through governments, businesses and consumers. The biggest hit will be borne by Americans. The Budget Lab at Yale, a non-partisan research centre, estimates the tariffs announced this week will lower American economic growth this year by 0.5 percentage points. In the long term, it puts the permanent annual cost at between $US100 billion to $180 billion.\n\nYou can see how it comes to such a large number. It reckons the tariffs on countries that supply many of America’s clothes – such as Bangladesh (tariff hit of 37 per cent) – will push up apparel prices in the US by 17 per cent. Overall inflation is 2.3 per cent higher this year, delivering an average loss per household of $UD3800. For the poorest households, who have an average annual income of around $US16,000, the hit is $US1700. America’s average tariff rate was 2.7 per cent before Trump’s announcement. It is now 22.5 per cent, the highest level since 1909. In that year, America export $US1.9 billion worth of goods. Last year, it was $US2.1 trillion. Fitch Ratings chief economist Brian Coulton summed it up like this. “Tariff hikes will result in higher consumer prices and lower corporate profits in the US. Higher prices will squeeze real wages, weighing on consumer spending, while lower profits and policy uncertainty will act as a drag on business investment,” he said.\n\nCoulton also noted that the Federal Reserve, which would ordinarily cut interest rates to spur growth, will be less likely to do so because of the inflationary impact of tariffs. Loading Could the tariffs spark a recession? This is why the chances of an American recession this year are now put at one-in-two by economists and financial markets. The direct hit to the Australian economy is relatively muted. Yes, the country exports a lot of hamburger beef to the US, something that caught the attention of the famously Big Mac eating president.\n\nBut in this case, the cost of the 10 per cent tariff on Australia will be borne by Trump and every other hamburger loving American. The same American fans of South Australian lemons ($44,000 in 2024) or Victorian olive oil ($16.1 million). The problem, particularly for Australia, is what it may do to China. In value, Australia sends more to the European Union than the US. And both are nothing close to our two-way trade with China which last year reached a record $325 billion. Under Trump’s tariffs (which build on tariffs he imposed in his first term and those put in place by Joe Biden), the effective tariff rate on Chinese products is approaching 70 per cent. Trump has also slapped high tariffs on countries where Chinese businesses have moved their operations to avoid earlier American imposts. For instance, Vietnam (46 per cent) and Cambodia (49 per cent) are being hit.\n\nWill it make products in Australia cheaper or more expensive? These countries are also home to the production plants of companies like Nike, whose share price nose-dived 14 per cent after the tariff plan was revealed. China’s Commerce Ministry has signalled retaliatory action against the US. In Trump’s first term, China targeted American farmers that forced the president to bail them out. This time, it could be much larger. China could be forced into selling its products into other nations. Such low-cost goods could end up in nations such as Australia, and is one of the reasons Anthony Albanese (and immediately matched by Peter Dutton) promised to put more money into anti-dumping arrangements. Those anti-dumping measures, and the reverberations across the world economy, won’t worry the seals and penguins of Heard and McDonald Islands who have become surprising global media stars after being hit with their own tariff.\n\nWhat do the tariffs mean for my interest rates? But it also points to the problem ahead for the Reserve Bank. With Australia not retaliating with its own tariffs, inflation – and growth – is likely to be lower. There is now a very good chance the RBA will cut official interest rates at its mid-May meeting and follow that up with at least two more rate cuts by November. Those lower rates, however, will be only offer small respite if the global economy stumbles because of Trump’s actions. Famously, the Great Depression started because of a huge run on Wall Street in late 1929. But it was a huge increase in American tariffs the following year that consigned the US – and the rest of the world – into its deepest economic downturn.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-at-centre-of-queensland-s-illegal-cigarette-boom-20250324-p5lm32.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane at centre of Queensland’s illegal cigarette boom",
        "publish_date": "Fri, 04 Apr 2025 12:06:57 +1100",
        "category": "finance",
        "authors": [
            "William Davis"
        ],
        "text": "The scale of the cigarette black market in Queensland is revealed in new documents obtained by Brisbane Times.\n\nGovernment data acquired under right to information laws shows seizures in the state rose significantly in the second half of last year, despite the legitimate tobacco market shrinking nationally.\n\nAbout 939 alleged breaches were reported in the six months to December. In the 12 months before that, just 439 breaches were recorded.\n\nIllegal Manchester cigarettes bought in Brisbane. Credit: William Davis\n\nAbout 29 million cigarettes were seized in Queensland between July 2023 and December 2024.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/exaggerations-from-albanese-dutton-lost-in-trump-s-tariff-blitz-20250331-p5lnxf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Exaggerations from Albanese, Dutton lost in Trump’s tariff blitz",
        "publish_date": "Fri, 04 Apr 2025 12:01:37 +1100",
        "category": "finance",
        "authors": [
            "Bronte Gossling"
        ],
        "text": "Loading “Another day and another Greens policy that the prime minister has adopted,” Bandt said on Sunday at a press conference in inner Melbourne’s St Kilda West. “Their first step is to say no, and then they adopt them, and we take that as a really good sign.” Bandt, alongside Greens Senator Nick McKim, first announced a supermarket price gouging policy, which includes a Prices Commission that would make referrals to the ACCC, early last month. Albanese announced Labor’s very similar plan over the weekend. Power bills have also risen, but not by $1300 as Peter Dutton says Speaking from Western Sydney’s Eastern Creek on day three of the campaign, Dutton pledged to clean up Labor’s “wreckage”, saying “people’s power bills have gone up by $1300″.\n\nLoading On Sunday, Albanese repeated Labor’s attack line that a vote for the Coalition was a vote for higher taxes. That claim is premature, because the Coalition could still announce a tax cut policy, and it ignores Dutton’s plan to cut fuel excise for 12 months. “[Dutton] is going to an election not just having voted against our tax cuts this week, he is saying that he will introduce legislation to increase the taxation rates of all 14 million Australians,” Albanese declared on the ABC’s Insiders program. Labor’s reduction of the bottom tax rate to 14 per cent over two years, starting from mid-2026, is only worth at best $10 a week to people earning more than $45,000. It was a surprising element of Jim Chalmers fourth budget, but within a day of its announcement, shadow treasurer Angus Taylor announced the Coalition would repeal the tax cut if elected. Dutton, also on Sunday, said his plan to halve fuel excise for 12 months was superior to the “hoax” of Labor’s tax cut, saying: “[Albanese] is promising 70 cents a day in a tax cut which doesn’t start for 15 months. I think this prime minister is out of touch with how much pain Australians are feeling.”\n\nLoading Did Peter Dutton cut $50 billion from hospitals as Anthony Albanese claimed? Not really Albanese whipped out his Medicare card once again on Tuesday in Adelaide, claiming that when Dutton was Minister for Health and Aged Care between 2013 and 2014, there was “$50 billion cut from hospitals, he attempted to introduce a tax every time people visit a GP and … abolish bulk-billing altogether.” Budget documents from 2014-15 show that Dutton did plan to slash hospital spending by $50 billion over the following decade, but his forecast never came to fruition. In fact, data from the Australian Institute of Health and Welfare shows hospital spending has consistently increased over the last 12 years, including before Tony Abbott shuffled Dutton out of the health portfolio in late 2014. Dutton did try to introduce a $7 co-payment charge for traditionally bulk-billed services including standard GP consultations, out-of-hospital pathology and imaging services, though after 10 months of back-and-forth, the policy was dumped in March 2015. And many GPs have been charging significant gap fees for consultations during Labor’s time in office.\n\nPeter Dutton has said he will not cut Medicare, no matter how many times Anthony Albanese brandishes his card The Coalition has denied it would cut Medicare or health funding, and has also denied its plan to cut 41,000 public servants would impact frontline services. In February, the Coalition matched Labor’s $8.5 billion boost to Medicare. Anthony Albanese’s Medicare card has been a constant presence on the campaign trail. He’s pictured here with it in Adelaide on April 1. Credit: Alex Ellinghausen This week, the Liberals released a new television advertisement saying Labor’s claim the Coalition would cut health funding is disinformation – though the figures they use as evidence in their rebuttal are slightly misleading. The ad cites Australian government hospital funding figures to suggest the Liberals gave hospitals dramatically more money when they were last in office compared to Labor. It also points to higher bulk-billing rates in 2021-22 as evidence they will look after Medicare.\n\nLoading The Morrison government did boost hospital funding primarily to combat COVID-19, with the new Liberal ad comparing the extraordinary pandemic figure with funding under the Gillard government more than a decade ago, when Australia had a smaller population to care for. It has not been adjusted for inflation either. As for the bulk-billing rate figure, it ignores the years-long Medicare rebate freeze that largely happened under the Coalition, meaning the bonus for bulk-billing did not keep up with inflation, which soared as the world emerged from the pandemic, causing the rate of free doctor visits to fall sharply early in Labor’s term. The bulk-billing rate also reflects the number of Australians getting free COVID vaccines, which has subside Wages have gone backwards under Anthony Albanese as Peter Dutton claims, but it’s not that simple Dutton has repeatedly claimed real wages – wages adjusted for inflation – have fallen under Albanese, which is technically correct. According to the latest Australian Bureau of Statistics figures, real wages have fallen 1.1 per cent during Albanese’s term.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/new-world-order-trump-s-tariff-attack-sparks-global-recession-fears-20250404-p5lp2h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New world order: Trump’s tariff attack sparks global recession fears",
        "publish_date": "Fri, 04 Apr 2025 11:55:44 +1100",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Meanwhile, the Chicago Board Options Exchange Volatility Index (VIX), a popular measure of expected market volatility – often called “the fear gauge” – soared 40 per cent in a day and was up 57 per cent over the past five days. The price of gold has risen 8 per cent in the past month. Now the question is how the world will react. Will institutions like the World Trade Organisation (WTO) hold, or will they be rendered meaningless? How will Beijing retaliate to Trump’s “bullying”? Will it be fundamentally weakened? Will prices rise in the US and could it tip the world’s largest economy into recession, followed by others? US President Donald Trump announces new tariffs in the Rose Garden alongside Commerce Secretary Howard Lutnick. Credit: AP “This is a game changer, not only for the US economy but for the global economy,” said Olu Sonola, head of US economic research at Fitch Ratings. “Many countries will likely end up in a recession.” It was difficult to overstate how consequential the “Liberation Day” tariffs would be, said Kelly Ann Shaw, a senior trade and economics adviser to Trump in his first term. “This is the single biggest trade action of our lifetime,” she told a Brookings Institution event in Washington.\n\nShaw, now a partner at law firm Hogan Lovells, said it was likely the tariff rates were an “opening offer” from the Trump administration, not the final word. “I do think that these tariff rates will shift over time. But this is huge. And this is a pretty seismic and significant shift in the way that we trade with every country on earth.” Trading favours Trump, routinely described by fawning advisers and allies as “the world’s greatest dealmaker”, is famously transactional. Deals are always possible, exemptions are always on the table, as are further crackdowns. Doing the rounds on US television on Friday AEDT, Lutnick indicated there was room to move on tariffs, but only after countries “changed their ways”. This did not mean negotiating, he said; the US wanted to see concrete action first. “Let’s see what they do,” he told CNN. “Talking is nonsense.”\n\nIn the Rose Garden, the president said he expected to field angry calls from world leaders. On board Air Force One the next day, he said negotiation was possible if the country offered something “phenomenal” in return. (China could get a degree of tariff relief for allowing the sale of TikTok, he suggested.) Shaw said she thought the 10 per cent baseline tariff – the one applied to Australia – was more likely to stick than the various higher tariffs applied to countries such as Japan, India, South Korea, Israel and Vietnam, as well as the European Union. Trump bills the tariffs as “reciprocal” – based on what other countries charge the US in tariffs and on non-tariff trade barriers. At the announcement, Trump and Lutnick displayed the rates on big laminated cardboard charts. But as people realised afterwards, the rates were not reciprocal at all. In fact, the “tariffs charged to the USA” was a direct expression of the US’s trade imbalance with that country. They simply divided the US trade deficit with each country by that country’s exports to the US, arriving at a percentage.\n\nA seemingly complex formula posted on the website of the US Trade Representative did not substantially alter the equation. The trade office justified its method by saying it “assumed” all persistent trade imbalances were due to tariffs or non-tariff trade barriers. Mary Lovely, a senior fellow at the Peterson Institute for International Economics, said the calculations were deeply misleading. “I think the world ‘reciprocal’ can now be laid to rest. It’s a complete misnomer,” she told the Brookings event. “As a technical economist, I can tell you there’s really no methodology there ... It’s like going to your doctor, finding out you have cancer and the basis for your medication is your weight divided by your age.” Bizarre inclusions – such as a 10 per cent tariff on the uninhabited Heard and McDonald Islands, and a 29 per cent tariff on Norfolk Island – only added to the sense these tariffs were lifted from a spreadsheet and not really thought through. The fact the tariffs are not actually reciprocal makes it harder for countries to identify what they might offer in return for a reprieve. But Australia is counting on the administration’s desire for rare earth minerals to swing a potential deal down the track.\n\n“We’ve got the whole periodic table, just about, in this country. That’s a good thing,” Albanese said, confirming the government would establish a strategic reserve of critical minerals if re-elected. Opposition Leader Peter Dutton also says minerals must play a central role in striking a deal, and argues only he can do it. The world reacts\n\nFrom afar, Trump has dominated the start of the election campaign. Both parties criticised him, with Albanese calling the tariffs “totally unwarranted” and not the act of a friend. Dutton accused the president of disrespecting Australia’s “special relationship” with the US, which included fighting together in every major war for a century. French President Emmanuel Macron, centre, his Prime Minister Francois Bayrou, left, and Presidency General Secretary Alexis Kohler meet with representatives of the sectors affected by the new Trump tariffs at the Elysee Palace in Paris. Credit: AP Their reaction was shared. French President Emmanuel Macron called for “collective solidarity” and for European businesses to pause new investments in the US. European Commission President Ursula von der Leyen denounced the tariffs as a major blow to the world economy, but held fire on retaliation.\n\nUS Treasury Secretary Scott Bessent warned in a CNN interview: “If you retaliate, that’s how you get escalation.” So far, most countries have followed that path, not wanting to push the button on a trade war. Morever, leaders who were already grappling with a US that has thumbed its nose at the United Nations and the World Health Organisation are now reassessing their own relationships with Washington and their role in a liberal world order that Trump has partially vacated. “We believe in international co-operation,” said Canadian Prime Minister Mark Carney, a transplant from the world of central banking who is also in an election campaign. “We believe in the free and open exchange of goods, services and ideas. If the United States no longer wants to lead, Canada will.” Trade economists are divided about where the rules-based order now stands. At the Brookings Institution on Thursday, Shaw said the WTO had been on life support for 25 years and was effectively a non-entity already.\n\nLovely said the WTO had serious problems but wasn’t yet dead. “The problem is it’s rudderless,” she said. “The US was the architect and essential partner. Now the US is removing itself, not officially but defacto.” Lovely argued that despite the US’s enormous market power, it was unlikely that countries would drastically restructure their economies to please it when there would be a new president in 3½ years. More likely, they would band together and bolster co-operative agreements that excluded the US, such as the Trans-Pacific Partnership of which Australia is a member. Trump withdrew from that agreement upon taking office in his first term, although the US had never formally ratified it in the first place. Loading Steven Hamilton, a former Australian treasury official, now assistant economics professor in Washington, said Trump’s tariffs on friendly nations such as Vietnam, Cambodia, South Korea and Japan were especially counter-productive.\n\n“Trump has driven his friends into the arms of his enemies at a time when you’re trying to peel them away from China,” he said. “Trump had taken US tariff rates back to the levels of the 19th century, and he’ll take the US economy back to the 19th century with him.” The war at home\n\nThere is also no guarantee Trump’s new world order will be dismantled by his successor, whether they are a Democrat or Republican. Joe Biden kept many of the tariffs Trump introduced in his first term, especially on China. And Democrats, slowly rebuilding from their defeat in November, are under increasing pressure to find answers for Americans’ economic dissatisfaction, even though the US economy has been performing well. Loading Trump’s contention that the world trade system screwed over the US found plenty of support on the campaign trail. As he reminded the crowd in the Rose Garden, he won all seven swing states, including the rust belt states of Michigan, Wisconsin and Pennsylvania, where car making and manufacturing has dwindled in the era of globalised commerce.\n\n“Never forget, every prediction our opponents made about trade for the last 30 years has been proven totally wrong,” Trump said. But now that he is in power, Trump must deliver results, including keeping a lid on inflation, another grievance on which he campaigned vigorously, and avoiding recession. Lutnick has said a recession would be “worth it” to restructure the US economy, while Trump plays it down but admits there could be bumps. The White House stresses the tariffs must be seen in context of the administration’s broader economic policies. Loading Economists are generally much more pessimistic. “This has to be one of the biggest unforced economic policy errors in US history,” said David Beckworth, a senior research fellow at George Mason University’s Mercatus Centre and a former US Treasury economist, in a post on X. Scott Lincicome from the Cato Institute, a libertarian think tank in Washington, said Trump’s tariffs would increase US import taxes to levels not seen since the Smoot-Hawley Tariff Act of 1930, “which incited a global trade war and deepened the Great Depression”.\n\n“Trump’s risible rhetoric about the economic power of tariffs is, like his trade strategy, detached from reality,” Lincicome said. “The only thing these tariffs will ‘liberate’ is money from Americans’ wallets.” There is also a cloud hanging over the legal mechanism Trump is using to impose these tariffs, which would typically be a matter for Congress. Instead, Trump invoked a national emergency on trade deficits – just as he called an emergency on fentanyl to justify earlier tariffs on Canada and Mexico. This week, four Senate Republicans voted with Democrats to back a measure that would rescind Trump’s emergency declaration for Canada – though it is unlikely to pass the House of Representatives. One of the Democrats, Senator Tim Kaine of Virginia, said it was likely they would pursue a similar bill to block the emergency declaration underpinning this week’s tariffs. The Democrats’ Senate leader Chuck Schumer said the tariffs were far worse than he predicted. “It was the largest tax hike on families since World War II,” he said. “Yesterday was not liberation day, it was tax day.” with Reuters",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/ange-postecoglou-took-on-tottenham-fans-and-lost-this-feels-like-the-end-20250404-p5lp5z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ange Postecoglou took on Tottenham fans and lost ... this feels like the end",
        "publish_date": "Fri, 04 Apr 2025 11:52:16 +1100",
        "category": "sports",
        "authors": [
            "Sam Dean",
            "Matt Law",
            "Rob Bagchi"
        ],
        "text": "This might prove to be the day the Ange Postecoglou dream died as the Tottenham Hotspur head coach took on his own supporters and lost.\n\nPostecoglou had clashed with Spurs fans in the past, most notably after the defeats at Bournemouth and Fulham, but this felt different. This felt like the end of what had started as a love affair.\n\nAnge Postecoglou’s Spurs have lost again. Credit: Getty Images\n\nEnzo Fernandez’s winning goal inflicted a 16th Premier League defeat on Tottenham and meant that Postecoglou became the first Spurs manager to lose all of his first four games against London rivals Chelsea.\n\nBut, incredibly, in this car crash of a league season for Spurs, that was not the worst of it for Postecoglou.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/pm-is-mobbed-by-huge-group-of-school-children-20250404-p5lp71.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "PM is mobbed by huge group of school children",
        "publish_date": "Fri, 04 Apr 2025 11:49:59 +1100",
        "category": "finance",
        "authors": [],
        "text": "PM is mobbed by huge group of school children\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/sydney-swans-afl-player-chad-warner-on-swysh-20250404-p5lp72.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney Swans AFL player Chad Warner on Swysh",
        "publish_date": "Fri, 04 Apr 2025 11:49:41 +1100",
        "category": "sports",
        "authors": [],
        "text": "Sydney Swans AFL player Chad Warner on Swysh\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/dogs-of-four-why-canterbury-are-undefeated-20250402-p5loim.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dogs of four: Why Canterbury are undefeated",
        "publish_date": "Fri, 04 Apr 2025 11:49:19 +1100",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "The Bulldogs NRL-best defence (14.5 points per game) is founded on a rushing line speed that isn’t exactly spelled out in statistics, but it was plain for all to see in last Saturday’s defeat of Cronulla. Champion Data pegs the Bulldogs’ pre-contact metres - the yardage covered by a ball-carrier before being met by a defender - at five metres per carry this season, sixth in the NRL. Anecdotally though, Canterbury’s aggression had former skipper Michael Ennis in raptures in commentary as the Sharks were slowly but surely smothered into a 20-6 upset on their home turf - the Bulldogs’ first Shire win in 11 years. A week earlier, Cronulla’s outside backs engineered two brilliant long-range tries against a ragged Rabbitohs defensive line - particularly on their kick chases. South Sydney’s disjointed kick chase against Cronulla. Credit: Rugby League Writers\n\nTaking note, Canterbury’s relentless line speed was matched whenever they chased kicks long and short. As noted by Rugby League Writers’ Jason Oliver, the Sharks spied the tell-tale triangles - the space created either side of a defender outside a uniform line - in a disjointed Rabbitohs kick chase in round three, and duly exploited them. The Bulldogs didn’t offer this to Cronulla’s Will Kennedy and his wingers. Combined with swarming line speed and a couple of Josh Curran charge downs - the ultimate effort play - the territory battle Cronulla won so emphatically against South Sydney was turned back on them.\n\nThe squad: the Bulldogs suddenly have depth Canterbury’s slow-burn under Ciraldo has been well-documented, so too the game plan that accentuates a fit, mobile side that is less concerned with missed tackles as scrambling to cover them.\n\nThe horrors of a 66-0 thrashing from Newcastle midway through Ciraldo’s first season at Belmore has been a regular reference point, and as instructive as any ahead of Sunday’s clash against the Knights. What Ciraldo described as a “dark day” saw Newcastle do whatever they pleased with a Bulldogs outfit missing a dozen first-graders after their reserve grade side also suffered a heavy loss. The 2023 season couldn’t end quick enough for Cameron Ciraldo’s Canterbury. Credit: Getty The lowest ebb of Canterbury’s rebuild made it painfully clear just how little depth the club’s roster had, and how far Ciraldo’s squad was from implementing his defence-focused game plan. The Bulldogs turnover since has been stark. Of the 17 Ciraldo named for his first game as Canterbury coach in 2023, just Jacob Kiraz, Matt Burton, Max King, Reed Mahoney, Viliame Kikau and Jacob Preston remain.\n\nLocal juniors like Bailey Hayward, Kiraz, Kurtis Morrin and Lipoi Hopoi are the first of what is hoped to be many. The recruitment blitz that yielded more utilities than a Monopoly board has delivered what Ciraldo craved - players willing to learn and above all compete, because an NRL utility is often honing the skills of a new position. And if there is a shortcoming somewhere in their game, out-enthusing an opposition is the surest way to compensate for it. Kurt Mann, Jaeman Salmon, Connor Tracey, Curran and Hayward all cover multiple positions while occupying an individual roster spot, and all bar Hayward have bought into Ciraldo’s uncompromising game plan after moving on from rival clubs.\n\nLoading Marquee recruits Stephen Crichton, Mahoney, Burton and Kikau have each played their instructional roles with lessons from Penrith and Parramatta (from what feels like a different Eels era now). The Bulldogs were without $800,000 stars Burton and Kikau against Cronulla, and will be again against Newcastle. Yet their left edge of Hayward, Jacob Preston and Bronson Xerri made that same channel an attacking focal point that dominated Cronulla - after claiming ascendancy with the bread-and-butter kick chase and defensive pressure. It’s all very Penrith. And while the Bulldogs are on top after only four rounds and the Panthers have won four-straight titles, Ciraldo has brought unmistakable elements of Penrith in both personnel and philosophy to Belmore, chiefly because he helped build the Panthers dynasty.\n\nPenrith, meanwhile, might just be starting to wobble with their shallowest playing stocks of the past five years. The talent raids of rival clubs - with Canterbury at the forefront - has AAP able to compile an entire top 30 roster of former Panthers now playing elsewhere in the game. Ciraldo leads a crack coaching staff too. Gould has detailed previously both his hesitations about taking on the Bulldogs rebuild and then bringing Ciraldo in to lead it. For the best part of a decade, excluding the Wests Tigers bin fire, this was the hardest job in rugby league. The great hope for rivals watching on is how the Bulldogs have been reborn; with a beautifully simple fix.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/daylight-savings-ends-this-weekend-heres-what-you-need-to-know/53ec03rix",
        "title": "Daylight saving ends this weekend. Here's what you need to know",
        "publish_date": "Thu, 3 Apr 2025 23:33:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "As the mornings get darker and a bit colder, daylight saving time is officially coming to an end this weekend.\n\n\n\n\n\nThe time adjustment is designed to maximise daylight hours in the evening over summer, and, as winter approaches, shift more daylight to the mornings when the clocks move back.\n\n\n\n\n\nHere's everything you need to know about daylight saving ending this weekend.\n\n\n\nWhen does daylight saving end?\n\nDaylight saving time for 2025 will officially end this Sunday 6 April at 3am AEDT.\n\n\n\n\n\nClocks will roll back one hour to 2am, meaning some Australians will gain an extra hour of sleep. Essentially, the hour between 2am and 3am will repeat itself, extending the night by one hour.\n\n\n\nREAD MORE Daylight saving: The unintended health consequences losing an hour can have\n\nDaylight saving time occurs every year from the first Sunday in October to the first Sunday in April.\n\n\n\n\n\nFrom this Sunday, mornings will be brighter, as the sun will rise earlier due to the clock adjustment.\n\n\n\nWhy does daylight saving exist?\n\nDaylight saving helps align our daily schedules with natural daylight, giving people more usable sunlight in the evenings during summer while shifting it to the mornings in winter to make early starts brighter and safer.\n\n\n\n\n\nIt's necessary because the tilt of the Earth's axis means the time between sunrise and sunset shifts throughout the year.\n\n\n\n\n\nProfessor Tim Bedding from the School of Physics at the University of Sydney said: \"The result is that days are longer in summer than in winter.\"\n\n\n\n\n\n\"The effect of DST becomes less as you move towards the equator, which is presumably why Queensland decided not to adopt daylight saving.\"\n\n\n\nAfter daylight saving time ends, Australia effectively loses two of its time zones. Source: SBS News\n\nWhich states and territories observe daylight saving?\n\nIt's up to individual states and territories to decide if they wish to observe it or not, but those a bit further from the equator have taken up the time zone change.\n\n\n\n\n\nDaylight saving time is observed in:\n\n\n\nNSW\n\nVictoria\n\nSouth Australia\n\nTasmania\n\nACT\n\nNorfolk Island\n\nThe following states and territories do not observe daylight savings:\n\n\n\nQueensland\n\nWestern Australia\n\nNorthern Territory\n\nChristmas Island\n\nCocos (Keeling) Islands\n\n\"In a large geographically and climatically diverse country, one size does not necessarily fit all,\" Bedding said, explaining why states and territories closer to the equator typically opt out of daylight saving.\n\n\n\nHow do the time zones change?\n\nWhen daylight saving ends, Australia effectively loses two of its five time zones. Here's how it will look from 6 April:\n\n\n\nQueensland, NSW, ACT, Victoria and Tasmania will be in Australian Eastern Standard Time (AEST).\n\nNorthern Territory, South Australia and Broken Hill (NSW) will be in Australian Central Standard Time (ACST), which is half an hour behind AEST.\n\nWestern Australia will remain on Australian Western Standard Time (AWST), which is two hours behind AEST and 1.5 hours behind ACST.\n\nA 2024 survey found overwhelming support for daylight saving across Australia. Source: SBS News\n\nAustralians mostly in support\n\nDaylight saving was first introduced in Tasmania in 1916 to conserve energy during World War One. It was later adopted across Australia in 1971, though Queensland abandoned it a year later.\n\n\n\n\n\nDaylight saving time is designed to give people longer evenings with more sunlight in the summer, while shifting the sunlight to the mornings during the winter, making early starts brighter.\n\n\n\n\n\nSince then, daylight saving has been a recurring point of debate .\n\n\n\n\n\nA survey conducted last year found 80 per cent of Australians supported daylight saving, with those living further south and working indoors more likely to be in favour, while those living higher up north and outdoor workers tended to be less supportive.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-donald-trumps-tariffs-impacted-global-markets/sq164l4bg",
        "title": "Historic losses and fears of recession as Donald Trump's tariffs hit global markets",
        "publish_date": "Thu, 3 Apr 2025 21:02:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Wall Street benchmarks slumped on Thursday, ending with the largest one-day percentage losses since 2020, as US President Donald Trump's sweeping tariffs ignited fears of an all-out trade war and a global economic recession.\n\n\n\n\n\nThe United States Dow Jones index has dropped more than 1,680 points — nearly 4 per cent.\n\n\n\n\n\nInvestors fled from risky assets, seeking the safety of government bonds, after Trump announced a 10 per cent tariff on most US imports and much higher levies on dozens of other countries.\n\n\n\n\n\nThe tariffs, poised to disrupt the global trade order, highlight a stark shift from just a few months ago when the promise of business-friendly policies under the Trump administration propelled US stocks to record highs.\n\n\n\n\n\nInvestors sold positions to reflect the new economic reality, with concerns about how other countries would react to Trump's Rose Garden declarations.\n\n\n\nChina vowed retaliation, as did the European Union, which faces a 20 per cent duty. South Korea, Mexico, India and several other trading partners said they would hold off for now as they seek concessions before the targeted tariffs take effect on 9 April.\n\n\n\n\n\nThe coming days are expected to be volatile as events unfold and the full effect of Trump's economic actions start to feed through into the wider economy. The CBOE Volatility index, known as Wall Street's fear gauge, touched a three-week high.\n\n\n\n\n\nSteven DeSanctis, small and mid-cap strategist at a US-based financial services company, Jefferies Financial Group, said: \"There are still a lot more questions than answers out here.\"\n\n\n\nAccording to preliminary data, the S&P 500 lost 275.05 points to end at 5,395.92 points, while the Nasdaq Composite dropped 1,053.60 points to 16,547.45. The Dow Jones Industrial Average fell 1,682.61 points to 40,542.71.\n\n\n\n\n\nHigh-flying technology stocks suffered big declines after pushing Wall Street to record highs in recent years.\n\n\n\n\n\nApple sank, reeling from an aggregate 54 per cent tariff on China, the base for much of the iPhone maker's manufacturing. Nvidia slumped, as did Amazon.com.\n\n\n\n\n\nUS stocks have lost ground since Trump took office in January, with the S&P 500 and the Nasdaq dropping 10 per cent from record highs last month, marking a correction as investors priced in the economic damage from the tariffs.\n\n\n\nTraders are ramping up expectations for the US Federal Reserve to cut interest rates four times this year, starting with a quarter-point cut in June.\n\n\n\n\n\nGeorge Bory, chief investment strategist for the fixed income team at asset management firm Allspring Global Investments, said: \"The Fed does have considerable firepower to help the market.\"\n\n\n\n\n\n\"The market is now pricing in more rate cuts, and perhaps sooner,\" he said, adding an easing in June now seemed guaranteed, with the chance of a cut in May as well.\n\n\n\n\n\nRetailers were hit hard, with Nike and Ralph Lauren falling on a raft of new tariffs on major production hubs, including Vietnam, Indonesia and China.\n\n\n\nUS President Donald Trump has outlined his tariff plans at an event he called 'Liberation Day'. Source: AAP / Kent Nishimura / POOL / EPA Big banks such as Citigroup and Bank of America, which are sensitive to economic risks, fell, as did JPMorgan Chase & Co.\n\n\n\n\n\nThe US small-cap Russell 2000 index tumbled, underscoring concerns about the health of the domestic economy.\n\n\n\n\n\n\"Small-cap companies tend to be suppliers to the large-cap companies, so as things go bad for the large-cap names because of tariffs, they are going to put a lot of pressure on their small-cap suppliers,\" DeSanctis said.\n\n\n\n\n\nExxon Mobil and Chevron fell, as crude prices slumped 6.8 per cent on the tariffs and OPEC+ speeding up output hikes.\n\n\n\n\n\nThe consumer staples sector was one of the few bright spots. The sector is traditionally considered a defensive play, but it was also buoyed on Thursday by Lamb Weston, which gained after reporting earnings.\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/party-time-the-game/62qxoi6ju",
        "title": "Party Time: The Game",
        "publish_date": "Thu, 3 Apr 2025 20:23:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Lecturer of Marketing with the Australian National University Andrew Hughes talks us through the mechanics of a campaign and what politicians are allowed to do (spoiler: it's almost anything), whilst CEO of Cheek Media and co-host of Big Small Talk Hannah Ferguson talks about what’s working (and what really isn’t) for politicians online.\n\n\n\n\n\nListen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/pipe-dream-what-is-the-tariff-driven-golden-age-donald-trump-looks-for/aaktne6gz",
        "title": "'Pipe dream': Can Donald Trump's tariffs bring back America's 'golden age'?",
        "publish_date": "Thu, 3 Apr 2025 18:36:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "On Thursday, United States President Donald Trump marked what he called 'Liberation Day,' unveiling his highly anticipated trade tariffs and outlining his \"dreams\" for America.\n\n\n\n\n\n\"April 2 2025 [US time] will be forever remembered as the day American industry was reborn, the day America's destiny was reclaimed, and the day that we began to make America wealthy again,\" Trump said at the White House Rose Garden.\n\n\n\n\n\n\"For decades, our country has been looted, pillaged, raped and plundered by nations near and far, both friend and foe alike.\"\n\n\n\n\n\nIn his speech, Trump announced sweeping tariffs targeting most countries globally, followed by a declaration of a \"national emergency\".\n\n\n\n\n\nHe closed by promising a \"golden age\" for the US and detailing the expected impact of tariffs on the nation's economy.\n\n\n\nHow do the new tariffs work?\n\nAlmost every country will be impacted by these new tariffs — some more, others less.\n\n\n\n\n\nOut of the 190-plus countries in the world, Trump's decision applies to most.\n\n\n\n\n\nThe White House has released a list of about 180 countries and territories that will face the new set of 'reciprocal tariffs'.\n\n\n\nWhat does reciprocal tariffs mean?\n\nThe term reciprocal tariffs suggests the Trump administration is hitting countries with similar levies to what they are placing on the US.\n\n\n\n\n\nBut that does not appear to be the case.\n\n\n\n\n\nPrime Minister Anthony Albanese responded to Trump's tariff announcement by saying: \"President Trump referred to reciprocal tariffs. A reciprocal tariff would be zero, not 10 per cent.\"\n\n\n\n\n\nAll countries listed have been levied at least a 10 per cent tariff, while around 60 countries — labelled as the 'worst offenders' — will face higher rates.\n\n\n\n\n\nExperts say the Trump administration appears to have arrived at its 'reciprocal tariff' figures by taking the 2024 US trade deficit with a country and dividing it by that country's exports to the US. It then applied a 50 per cent 'discount'.\n\n\n\n\n\nFor example, the chart Trump displayed (below) says China imposed 67 per cent tariffs (including currency manipulation and trade barriers) on the US.\n\n\n\nUS President Donald Trump and the White House shared a series of charts on social media detailing the tariff rates they say other countries impose on the US. Source: Getty / Chip Somodevilla The US trade deficit with China last year was US$295.4 billion ($467.3 billion) and US imports from China were US$438.9 billion ($694.4 billion). Dividing the deficit by the imports yields a figure of 67 per cent, which the US then 'discounted' to 34 per cent. The same rationale applies to many other countries on the list.\n\n\n\n\n\nAustralia, which imports more goods from the US than it exports to it, and some other countries including the UK, Brazil, Turkey and Saudi Arabia, have been hit with a \"minimum baseline tariff\" of 10 per cent.\n\n\n\n\n\nThe rationale for the 10 per cent figure is not clear, but may relate to what the administration sees as trade barriers, for example restrictions on imports of US beef.\n\n\n\n\n\nRichard Holden, professor of economics at the University of NSW's Business School, told SBS News: \"Different countries are being hit with different levels of tariffs, but no-one's getting away with anything less than 10 [per cent].\"\n\n\n\n\n\n\"Countries will face different levels of tariffs based on the White House's view about what those tariff barriers are,\" he said.\n\n\n\nWhat kind of America is Trump dreaming of?\n\nTrump has promised the tariffs would result in \"jobs and factories coming roaring back into\" the US.\n\n\n\n\n\nHe said ultimately this would mean \"stronger competition and lower prices for consumers\".\n\n\n\n\n\nBut Holden said that may not be true.\n\n\n\n\"This is, really, a tax on American consumers. It's just going to make things that Americans buy more expensive. So, it's just like even putting on a big national sales tax,\" he said.\n\n\n\n\n\nBryce Wakefield, the CEO of the Australian Institute of International Affairs, told SBS News that calling the event Liberation Day is an \"excuse for what may very well be disastrous policy\".\n\n\n\n\n\nBut Trump has defended the policy, saying the imposition of tariffs was necessary because \"foreign trade and economic practices have created a national emergency\".\n\n\n\nWhy did Trump declare a national emergency?\n\nFollowing the announcement, the White House released a fact sheet titled 'President Donald J. Trump Declares National Emergency to Increase our Competitive Edge, Protect our Sovereignty, and Strengthen our National and Economic Security'.\n\n\n\n\n\n\"President Trump is invoking his authority under the International Emergency Economic Powers Act of 1977 (IEEPA) to address the national emergency posed by the large and persistent trade deficit that is driven by the absence of reciprocity in our trade relationships and other harmful policies like currency manipulation and exorbitant value-added taxes (VAT) perpetuated by other countries.\"\n\n\n\n\n\n\"Large and persistent annual US goods trade deficits have led to the hollowing out of our manufacturing base; resulted in a lack of incentive to increase advanced domestic manufacturing capacity; undermined critical supply chains; and rendered our defense-industrial base dependent on foreign adversaries,\" the document stated.\n\n\n\nREAD MORE What to know about tariffs and how they work\n\nThe tariffs have been central to Trump's vision to strengthen the US economy and move the country to what he describes as a new \"golden age\".\n\n\n\n\n\n\"This will be indeed the golden age of America. It's coming back. We will come back very strongly,\" Trump said.\n\n\n\n\n\nWakefield said the phrase is commonly used among nationalists.\n\n\n\n\n\n\"The 'golden age' in nationalist rhetoric is simply an imagined time in the past where things were always better,\" he said.\n\n\n\n\n\n\"And in every nationalist's mind, the actual period of that golden age might be different. It's left vague for a reason.\"\n\n\n\nWhich Biden-era 'damages' is Trump talking about?\n\nThe White House fact sheet lays out a variety of reasons to support Trump's tariffs.\n\n\n\n\n\n\"These tariffs are central to President Trump's plan to reverse the economic damage left by President [Joe] Biden and put America on a path to a new golden age,\" it states.\n\n\n\n\n\n\"President Biden squandered the agricultural trade surplus inherited from President Trump's first term, turning it into a projected all-time high deficit of [US]$49 billion ($78 billion).\n\n\n\nREAD MORE Meet the Australian farmers Donald Trump has a beef with\n\n\"'Made in America' is not just a tagline — it's an economic and national security priority of this administration. The president's reciprocal trade agenda means better-paying American jobs making beautiful American-made cars, appliances, and other goods.\"\n\n\n\n\n\nHolden highlights what the wording truly implies.\n\n\n\n\n\n\"He [Trump] is talking about the reduction in the US manufacturing sector that's been going on for, you know, four decades or so. So that's what he's talking about,\" he said.\n\n\n\nCan Trump really bring back the 'golden age'?\n\nSome experts believe Trump referred to the 1950s — an era when the US faced a post-World War Two economic boom.\n\n\n\n\n\nShane Oliver, chief economist at fund manager AMP, believes Trump's aim to manufacture all kinds of products in the US is a \"pipe dream\".\n\n\n\n\n\n\"I know America, every so often, has these dreams of returning to the 1950s ... every so often [the US] has these retro moments of dreaming to go back in the past,\" he said.\n\n\n\n\n\n\"But this appears to be another one, obviously more extreme than what we saw [before].\n\n\n\n\"I think the golden age he's referring to is one where production, manufacturing returns to the US, cars are fully made in America, [same with] pharmaceuticals, farming, and so on.\n\n\n\n\n\n\"It's gonna take many years for that to happen ... Lots of companies will be unsure ... whether to bring production back now or to wait and see whether these tariffs stick. Or, a change in government in the US could see them reverse.\n\n\n\n\n\n\"I think there's a lot of uncertainty around it.\"\n\n\n\n\n\nOne of the products that Trump singled out in his speech was Australian beef.\n\n\n\n\n\nHe said the US imported $3 billion of Australian beef last year.\n\n\n\nHow will the US tariffs impact the global economy?\n\nThe tariff announcement was made shortly after Wall Street trading closed, and US stocks began to fall in after-hours trading.\n\n\n\n\n\nThe Asian stock market also fell, while gold prices hit a record high. The Australian share market also declined sharply after the speech.\n\n\n\n\n\n\"It's obviously gonna have a big disruptive impact on the global economy; there's obviously gonna be a hit to consumer confidence, business confidence, supply chains, and so on,\" Oliver said.\n\n\n\n\n\n\"That obviously can have an impact globally, particularly if other countries retaliate.\"\n\n\n\nLISTEN TO Trump announces tariffs: 'the day America's destiny was reclaimed' SBS News 03/04/2025 08:50 Play\n\nJust ahead of the announcement, Ursula von der Leyen, the president of the European Commission, said if necessary, Europe has \"a strong plan to retaliate\".\n\n\n\n\n\nWhile Canada has retaliated by imposing 25 per cent tariffs on goods from the US, Australia maintains it will not retaliate .\n\n\n\n\n\nHolden said no-one will benefit from these tariffs, not even the Americans.\n\n\n\n\n\n\"Let's be clear, nobody benefits from tariffs. That's why over the last 50 years around the world, we've had coordinated global efforts to try and remove trade barriers.\n\n\n\n\n\n\"The world is better off when no-one has any tariffs on anything. And everybody's worse off when there are tariffs.\n\n\n\n\n\n\"This is not good news really for anybody.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/trump-singles-out-australian-beef-exports/qh9kice09",
        "title": "Trump singles out Australian beef exports",
        "publish_date": "Thu, 3 Apr 2025 09:22:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Trump singles out Australian beef exports\n\nPublished 3 April 2025, 8:14 am\n\nAustralian business groups have expressed disappointment by the size and scale of global tariffs imposed by the US on Australia and other trading nations. Australia is the biggest supplier of beef to the US, with experts saying a 10 per cent tariff could impact processor margins, domestic cattle prices and export volumes.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/not-the-act-of-a-friend-trump-slaps-10-tariff-on-australian-exports/cas599oht",
        "title": "'Not the act of a friend': Trump slaps 10% tariff on Australian exports",
        "publish_date": "Thu, 3 Apr 2025 09:11:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "'Not the act of a friend': Trump slaps 10% tariff on Australian exports\n\nPublished 3 April 2025, 8:13 am\n\nA blanket 10% tariff has been applied to all Australian goods exported to the United States. Donald Trump, singled out beef for criticism, describing Australia's trade restrictions on imports as a \"ban\". The Prime Minister has announced $50 million in emergency funding for impacted industries while leaving no doubt that the friendship with the US is under pressure.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/labor-rules-out-retaliation-as-us-imposes-more-tariffs-on-australian-goods/a8abmvh91",
        "title": "Labor rules out retaliation as US imposes more tariffs on Australian goods",
        "publish_date": "Thu, 3 Apr 2025 07:54:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"They're wonderful people, and wonderful everything, but-\"\n\n\n\n\n\nThat's US President Donald Trump talking about Australians in his announcement of a blanket 10 percent tariff on all Australian goods.\n\n\n\n\n\nMr Trump singled out local measures on American beef during his remarks.\n\n\n\n\n\n\"They ban American beef, yet we imported $3 billion of Australian beef from them just last year alone. They won't take any of our beef; they don't want it because they don't want it to affect their farmers. And you know what I don't blame them, but we're doing the same thing right now, starting about midnight tonight.\"\n\n\n\n\n\nIn Australia, beef imports from the U-S have been banned for years due to concerns about mad cow disease, and Prime Minister Anthony Albanese has said that is not about to change.\n\n\n\n\n\nIt's a sentiment echoed by National Farmers' Federation President, David Jochinke.\n\n\n\n\n\n“Our biosecurity is not up for negotiation. We’re not going to be having any technical discussions about carving out any deals for any nation.”\n\n\n\n\n\nTariffs on pharmaceuticals have not been confirmed in this round of announcements, despite complaints from U-S companies because some prescription drugs are subsidised and made cheaper under the Pharmaceutical Benefits Scheme.\n\n\n\n\n\nAnd some observers have said Australia has had a better result than many other countries, with some facing tariffs of up to 50 per cent.\n\n\n\n\n\nStill, Anthony Albanese says he considers the tariffs a destructive move that will damage relations with the U-S.\n\n\n\n\n\n\"Let me be clear: they are totally unwarranted. President Trump referred to reciprocal tariffs. A reciprocal tariff would be zero, not 10 per cent. The administration's tariffs have no basis in logic and they go against the basis of our two nations' partnership. This is not the act of a friend.\"\n\n\n\n\n\nMr Albanese says his government will not hit back with reciprocal tariffs.\n\n\n\n\n\nThe Prime Minister says such measures would simply fire the gun on a race to the bottom that he believes would lead to higher prices and slower growth.\n\n\n\n\n\nBut he says the government has no intention of doing nothing.\n\n\n\n\n\n\"We will stand up for Australia. We will continue to make the strongest case for these unjustified tariffs to be removed from our exporters. Our existing free trade agreement with the United States contained dispute resolution mechanisms. We want to resolve this issue without resorting to using these.\"\n\n\n\n\n\nThose dispute resolution mechanisms include the prospect of a complaint to the World Trade Organisation.\n\n\n\n\n\nThe Labor government says it has tried to negotiate with Donald Trump behind closed doors - and that this is a response being considered as no nation has succeeded in securing exemptions from this round of tariffs.\n\n\n\n\n\nOpposition Leader Peter Dutton still says Mr Albanese could have tried harder to advance Australia's interests.\n\n\n\n\n\n\"I do believe that we could have achieved a different outcome. Firstly, I think there's no doubt that we would have had greater connection and greater communication with the White House.\"\n\n\n\n\n\nThe government had previously tried to strike a critical minerals deal with the U-S, as it sought to avoid an earlier round of 25 per cent tariffs on Australian steel and aluminium exports.\n\n\n\n\n\nThe proposition was rejected by the U-S, and Resources Minister Madeleine King said at the time she it was unlikely Australia would sweeten the offer any time soon.\n\n\n\n\n\nMr Dutton says the Coalition would have leveraged Australia's defence ties with the U-S to get the best deal at a globally uncertain time.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/what-trumps-reciprocal-tariffs-means-for-markets/rt3bm8mi7",
        "title": "What Trump's reciprocal tariffs means for markets",
        "publish_date": "Thu, 3 Apr 2025 07:18:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/more-inclusive-access-government-accepts-expanded-definition-of-infertility/h29iamayx",
        "title": "'Massive win for our community': More Australians to be able to access subsidised IVF",
        "publish_date": "Thu, 3 Apr 2025 07:14:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal health department has accepted an expanded definition of infertility that would allow LGBTIQ+ couples and single people to be able to access Medicare rebates for assisted reproductive technology.\n\n\n\n\n\nAfter a year-long campaign, advocates and fertility specialists welcomed the move, which they say will provide more equitable access to fertility care across the country — including in vitro fertilisation (IVF) and intrauterine insemination (IUI).\n\n\n\n\n\n\"I'm pleased to announce that the Albanese Labor government has accepted an expanded definition of fertility to ensure single women and women in same-sex relationships can access IVF subsidies under Medicare,\" Assistant Minister for Health Ged Kearney said in a post on Instagram on Wednesday.\n\n\n\n\n\nAshley Scott, executive officer of Rainbow Families — a not-for-profit organisation for LGBTIQ+ families — described this week's announcement as a \"massive win for our community\".\n\n\n\n\n\n\"We've been actively lobbying the federal government to ensure that LGBTQ+ people are treated like any other family,\" Scott said on Wednesday.\n\n\n\n'Discrimination when starting a family'\n\nMedicare rebates for fertility treatment are generally available once a medical cause of infertility is diagnosed.\n\n\n\n\n\nThis has been defined as the inability to conceive after 12 months or more of regular, unprotected intercourse. However, advocates and some specialists said this was delaying or blocking some LGBTIQ+ couples and single people from receiving rebates.\n\n\n\n\n\nRainbow Families conducted a survey last year which found that around half of LGBTIQ+ parents had not received any Medicare rebates when trying to conceive at Australian clinics.\n\n\n\nREAD MORE How many Australians are LGBTIQ+? We now have an idea\n\nAround one in three received a rebate once they had been deemed medically infertile following at least three rounds of failed treatments.\n\n\n\n\n\n\"We've heard from community for a long time now about the discrimination they face when starting a family using an IVF clinic,\" Scott said on Wednesday.\n\n\n\n\n\n\"Some people were able to access the Medicare rebate on their first attempt, while others had to prove they were medically infertile — sometimes after three failed rounds of IVF or IUI. Even within the same clinics, there was a lack of consistency.\"\n\n\n\nLISTEN TO Hysterical: Why do some groups have to fight for safe and affordable sexual and reproductive healthcare? SBS News 30/07/2024 32:32 Play\n\nA sweeping review of Australia's fertility sector, conducted by the Fertility Society of Australia and New Zealand (FSANZ) last year, also called for more equitable access to treatments like IVF, irrespective of a person's relationship status, sexual orientation or gender identity.\n\n\n\n\n\nThis included changing the definition of infertility, which was recently revised by the Australian and New Zealand Society for Reproductive Endocrinology and Infertility (ANZSREI) \"as the basis for expanded and non-discriminatory access to IVF and ART (assisted reproductive technology)\".\n\n\n\n\n\nThe definition broadens the sector’s definition of infertility to include \"the inability to achieve a successful pregnancy based on a patient’s medical, sexual, and reproductive history, age, physical findings, diagnostic testing, or any combinations of these factors, and the need for medical intervention to achieve a successful pregnancy.\"\n\n\n\n\n\nSBS News understands the health department has written to peak bodies in the fertility sector, confirming it acknowledges the updated version of infertility.\n\n\n\n\n\nThis means services which a health practitioner considers meet the updated definition and are delivered in line with relevant Medicare Benefits Schedule (MBS) items can attract a rebate.\n\n\n\nA 'really important policy change'\n\nKearney said the move was a \"really important policy change for so many women\".\n\n\n\n\n\n\"For too long, single women and lesbians faced barriers when it came to accessing IVF. It was expensive, it was unfair, and it was just plain wrong,\" she said.\n\n\n\n\n\n\"There's been so many women and community organisations who have fought for this change for so long. I’m happy to share this win with them.\"\n\n\n\nREAD MORE DJ became infertile following chemotherapy. He was never asked this important question\n\nFSANZ president Dr Petra Wale said the society welcomed the health department's recognition of the revised definition of infertility as a \"clinically relevant\" service under Medicare and the Health Insurance Act.\n\n\n\n\n\n\"This acknowledgement is a significant step toward improving equitable access to fertility care and aligns with ANZSREI’s expanded definition of infertility, which has been endorsed by FSANZ and RANZCOG (Royal Australian and New Zealand College of Obstetricians and Gynaecologists).\"\n\n\n\n\n\nWale said the acknowledgement \"paves the way for more inclusive access to reproductive care\".\n\n\n\n\n\n\"This expanded definition reinforces the principle that fertility care should not be restricted by relationship status, sexual orientation, or gender identity.\"\n\n\n\n\n\nWale said the revised definition \"affirms the critical role of clinicians\" in determining patient eligibility.\n\n\n\n\n\nShe said further efforts are underway to seek recognition under the expanded definition of Australian Defence Force personnel, who are not currently covered by Medicare.\n\n\n\nREAD MORE After years of struggling to conceive, Reece and Annabelle may finally have an answer\n\nFight for equal reproductive 'not over'\n\nFor Rainbow Families, the fight for equality in reproductive care \"is not over\", with surrogacy \"still excluded\" from the Medicare rebate, Scott said.\n\n\n\n\n\nSarah Jefford, a surrogacy lawyer, explained to SBS News last September that under Medicare’s rules, fertility treatment can be provided for the purpose of surrogacy, but there are no available rebates.\n\n\n\n\n\n“We will continue to advocate for this to change so that all LGBTQ+ people — including gay dads and people using surrogacy — have equal access to family-building support,\" Scott said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/see-the-full-list-trumps-liberation-day-tariffs-and-what-they-mean/4ou0556bf",
        "title": "See the full list: Trump's 'Liberation Day' tariffs and what they could mean for the world",
        "publish_date": "Thu, 3 Apr 2025 06:08:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "United States President Donald Trump's newly announced global tariffs are set to impact a world economy that has barely recovered from the post-pandemic inflation surge and is weighed down by record debt and unnerved by geopolitical strife.\n\n\n\n\n\nThe effects are far-reaching, with a 10 per cent baseline US tariff on imported goods from all countries. Many countries have also been hit with what Trump describes as \"reciprocal\" tariffs, for countries his administration says have high trade deficits on US imports.\n\n\n\n\n\nThose include a 34 per cent tariff on China (in addition to a 20 per cent tariff it already faces) and a 20 per cent tariff on goods from the European Union.\n\n\n\n\n\nA 25 per cent tariff on cars and parts had been confirmed earlier. Australia has been hit with the baseline 10 per cent tariff.\n\n\n\nDonald Trump outlined his tariff plans on what he has called 'Liberation Day'. Source: AAP / Kent Nishimura / POOL / EPA To get an example of how far-reaching these tariffs are, they include the Heard and McDonald Islands — an Australian external territory of mostly barren Antarctic islands, that is not populated by people, and can only be reached from Australia by a two-week sea journey.\n\n\n\n\n\nNorfolk Island, a tiny Australian territory in the South Pacific Ocean, was also singled out with a 29 per cent tariff.\n\n\n\n\n\nA spokesperson for Norfolk Island has since told SBS News it has \"no known exports\" to the US and would not be subject to the 29 per cent tariff, only the 10 per cent Australia will be subject to.\n\n\n\nWhen will the tariffs come into effect?\n\nThe 10 per cent baseline tariffs will take effect on Saturday, from 12.01am local time — just after 3pm AEDT.\n\n\n\n\n\nThe individualised \"reciprocal\" tariffs on specific countries come into effect a few days later on Wednesday 9 April — 12.01am local time, 2.01pm AEST.\n\n\n\nWere any countries not included in the announcement?\n\nCanada and Mexico, the US' two largest trading partners, were not included in Thursday's announcement.\n\n\n\n\n\nBoth countries already face a 25 per cent tariff for allegedly not doing enough to curb migration and fentanyl trafficking.\n\n\n\n\n\nGoods from Mexico and Canada that meet the United States-Mexico-Canada trade agreement requirements will largely remain tariff-free.\n\n\n\nREAD MORE What to know about tariffs and how they work\n\n\"For Canada and Mexico, the existing fentanyl/migration ... orders remain in effect, and are unaffected by this order,\" the White House fact sheet said.\n\n\n\n\n\nDespite running a trade surplus of US$2.5 billion ($3.95 billion) with the US, Russia was not included in the tariff list.\n\n\n\n\n\nSome American news outlets have reported that this is because Russia — along with Cuba, Belarus and North Korea, all of which were also excluded from the list — already faces \"extremely high tariffs\", according to a White House spokesperson.\n\n\n\nWhat could the global impact of tariffs be?\n\nDepending on how Trump and leaders of other nations proceed, the tariffs could also be a turning point for a globalised system which until now had taken for granted the strength and reliability of the US, its largest component.\n\n\n\n\n\n\"Trump's tariffs carry the risk of destroying the global free trade order the United States itself has spear-headed since the Second World War,\" said Takahide Kiuchi, chief economist at the Japan-based Nomura Research Institute.\n\n\n\n\n\nBut in the coming months, it will be the price-hiking — and therefore demand-dampening — effects of new levies applied to thousands of goods bought and sold by consumers and businesses across the planet that will prevail.\n\n\n\n\n\n\"I see it as a drift of the US and global economy towards worse performance, more uncertainty, and possibly heading towards something we could call a global recession,\" said Antonio Fatas, macroeconomist at the INSEAD business school in France.\n\n\n\n\n\n\"We are moving into a world which is worse for everyone because it is more inefficient,\" said Fatas, who has acted as a consultant for the International Monetary Fund and World Bank.\n\n\n\n\n\nTrump said the tariffs would return strategically vital manufacturing capabilities to the United States.\n\n\n\n\n\nUnder the new global levies imposed by Trump, the US tariff rate on all imports jumped to 22 per cent — a rate last seen around 1910 — from just 2.5 per cent in 2024, said Olu Sonola, head of US economic research at Fitch Ratings.\n\n\n\n\n\n\"This is a game changer, not only for the US economy but for the global economy,\" Sonola said.\n\n\n\n\n\n\"Many countries will likely end up in a recession.\"\n\n\n\n\n\nThe impact on national economies is set to diverge widely, given the spectrum of tariffs ranging from 10 per cent for Britain to 49 per cent for Cambodia.\n\n\n\nIf the result is a wider trade war, that would have even larger repercussions for producers like China, which would be left hunting for new markets in the face of wilting consumer demand around the world.\n\n\n\n\n\nAnd if the tariffs push the US itself towards recession, that will weigh heavily on developing countries whose fortunes are closely tied to those of the world's largest economy.\n\n\n\n\n\n\"What happens in the United States doesn't stay in the United States,\" said Barry Eichengreen, professor of economics and political science at the University of California, Berkeley.\n\n\n\n\n\n\"The economy is too big and too connected to the rest of the world via trade and capital flows for the rest of the world to be unaffected.\"\n\n\n\nAn 'inverted world'?\n\nThe knock-on effects for policymakers in central banks and governments are also potentially significant.\n\n\n\n\n\nAn unravelling of the supply chains which for years kept a lid on prices for consumers could lead to a world in which inflation tends to run \"hotter\" than the 2 per cent which central bankers currently agree is a manageable target to aim for.\n\n\n\n\n\nThat would complicate decisions for the Bank of Japan, which may face pressure to combat too-high inflation with more interest rate hikes just as its major counterparts eye cuts, and as its export-reliant economy takes a hit from US duties.\n\n\n\n\n\nCar exporters Japan, hit with a 24 per cent tariff rate, and South Korea, which had a 25 per cent rate imposed on it, have signalled plans to take emergency measures to support businesses hit by the higher US levies.\n\n\n\n\n\nEconomies with weaker output growth would leave governments struggling even more to pay down the world's record US$318 trillion ($505 trillion) debt load and find money for budget priorities ranging from defence spending to climate action and welfare.\n\n\n\nAnd what if the tariffs do not bring about Trump's oft-stated goal of encouraging business to invest in domestic US manufacturing, given the domestic labour shortages already facing a country with close to full employment?\n\n\n\n\n\nSome see him seeking other ways to remove the US global trade deficit that riles him so much — for example, by demanding that others join in a re-balancing of foreign exchange rates to the advantage of US exporters.\n\n\n\n\n\n\"We are going to continue to see him putting out there potentially more risky ways of dealing with the continuous strength of the dollar,\" said Freya Beamish, chief economist at investment strategy firm TS Lombard.\n\n\n\n\n\nSuch moves could jeopardise the privileged position of the dollar as the world reserve currency of choice — an outcome few predict, if only because there are, for now, no real alternatives to the dollar.\n\n\n\n\n\nNonetheless, European Central Bank president Christine Lagarde said during an event in Ireland overnight that Europe needed to act now and accelerate economic reforms to compete in what she called an \"inverted world\".\n\n\n\n\n\n\"Everyone benefited from a hegemon, the United States, that was committed to a multilateral, rules-based order,\" she said of the post-Cold War era of low inflation and growing trade in an open global economy.\n\n\n\n\n\n\"Today we must contend with closure, fragmentation and uncertainty.\"\n\n\n\nThe full tariff list: Who has been targeted and by how much?\n\nThis list includes both the tariffs announced by Trump on Thursday, along with the amount the US claims it's charged in tariffs by that country.\n\n\n\nChina : 34 per cent (claimed tariff charged to US is 67 per cent)\n\nEuropean Union : 20 per cent (claimed tariff charged to US is 39 per cent)\n\nVietnam : 46 per cent (claimed tariff charged to US is 90 per cent)\n\nTaiwan : 32 per cent (claimed tariff charged to US is 64 per cent)\n\nJapan : 24 per cent (claimed tariff charged to US is 46 per cent)\n\nIndia : 26 per cent (claimed tariff charged to US is 52 per cent)\n\nSouth Korea : 25 per cent (claimed tariff charged to US is 50 per cent)\n\nThailand : 36 per cent (claimed tariff charged to US is 72 per cent)\n\nSwitzerland : 31 per cent (claimed tariff charged to US is 61 per cent)\n\nIndonesia : 32 per cent (claimed tariff charged to US is 64 per cent)\n\nMalaysia : 24 per cent (claimed tariff charged to US is 47 per cent)\n\nCambodia : 49 per cent (claimed tariff charged to US is 97 per cent)\n\nUnited Kingdom : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSouth Africa : 30 per cent (claimed tariff charged to US is 60 per cent)\n\nBrazil : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nBangladesh : 37 per cent (claimed tariff charged to US is 74 per cent)\n\nSingapore : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nIsrael : 17 per cent (claimed tariff charged to US is 33 per cent)\n\nPhilippines : 17 per cent (claimed tariff charged to US is 34 per cent)\n\nChile : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nAustralia : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nPakistan : 29 per cent (claimed tariff charged to US is 58 per cent)\n\nTürkiye : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSri Lanka : 44 per cent (claimed tariff charged to US is 88 per cent)\n\nColombia : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nPeru : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nNicaragua : 18 per cent (claimed tariff charged to US is 36 per cent)\n\nNorway : 15 per cent (claimed tariff charged to US is 30 per cent)\n\nCosta Rica : 10 per cent (claimed tariff charged to US is 17 per cent)\n\nJordan : 20 per cent (claimed tariff charged to US is 40 per cent)\n\nDominican Republic : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nUnited Arab Emirates : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nNew Zealand : 10 per cent (claimed tariff charged to US is 20 per cent)\n\nArgentina : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nEcuador : 10 per cent (claimed tariff charged to US is 12 per cent)\n\nGuatemala : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nHonduras : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMadagascar : 47 per cent (claimed tariff charged to US is 93 per cent)\n\nMyanmar : 44 per cent (claimed tariff charged to US is 88 per cent)\n\nTunisia : 28 per cent (claimed tariff charged to US is 55 per cent)\n\nKazakhstan : 27 per cent (claimed tariff charged to US is 54 per cent)\n\nSerbia : 37 per cent (claimed tariff charged to US is 74 per cent)\n\nEgypt : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSaudi Arabia : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nEl Salvador : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nCôte d’Ivoire : 21 per cent (claimed tariff charged to US is 41 per cent)\n\nLaos : 48 per cent (claimed tariff charged to US is 95 per cent)\n\nBotswana : 37 per cent (claimed tariff charged to US is 74 per cent)\n\nTrinidad and Tobago : 10 per cent (claimed tariff charged to US is 12 per cent)\n\nMorocco : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nAlgeria : 30 per cent (claimed tariff charged to US is 59 per cent)\n\nOman : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nUruguay : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nBahamas : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nLesotho : 50 per cent (claimed tariff charged to US is 99 per cent)\n\nUkraine : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nBahrain : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nQatar : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMauritius : 40 per cent (claimed tariff charged to US is 80 per cent)\n\nFiji : 32 per cent (claimed tariff charged to US is 63 per cent)\n\nIceland : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nKenya : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nLiechtenstein : 37 per cent (claimed tariff charged to US is 73 per cent)\n\nGuyana : 38 per cent (claimed tariff charged to US is 76 per cent)\n\nHaiti : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nBosnia and Herzegovina : 35 per cent (claimed tariff charged to US is 70 per cent)\n\nNigeria : 14 per cent (claimed tariff charged to US is 27 per cent)\n\nNamibia : 21 per cent (claimed tariff charged to US is 42 per cent)\n\nBrunei : 24 per cent (claimed tariff charged to US is 47 per cent)\n\nBolivia : 10 per cent (claimed tariff charged to US is 20 per cent)\n\nPanama : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nVenezuela : 15 per cent (claimed tariff charged to US is 29 per cent)\n\nNorth Macedonia : 33 per cent (claimed tariff charged to US is 65 per cent)\n\nEthiopia : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nGhana : 10 per cent (claimed tariff charged to US is 17 per cent)\n\nMoldova : 31 per cent (claimed tariff charged to US is 61 per cent)\n\nAngola : 32 per cent (claimed tariff charged to US is 63 per cent)\n\nDemocratic Republic of the Congo : 11 per cent (claimed tariff charged to US is 22 per cent)\n\nJamaica : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMozambique : 16 per cent (claimed tariff charged to US is 31 per cent)\n\nParaguay : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nZambia : 17 per cent (claimed tariff charged to US is 33 per cent)\n\nLebanon : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nTanzania : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nIraq : 39 per cent (claimed tariff charged to US is 78 per cent)\n\nGeorgia : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSenegal : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nAzerbaijan : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nCameroon : 11 per cent (claimed tariff charged to US is 22 per cent)\n\nUganda : 10 per cent (claimed tariff charged to US is 20 per cent)\n\nAlbania : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nArmenia : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nNepal : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSint Maarten : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nFalkland Islands : 41 per cent (claimed tariff charged to US is 82 per cent)\n\nGabon : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nKuwait : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nTogo : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSuriname : 10 per cent (claimed tariff charged to US is 10 per cent) Belize : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nPapua New Guinea : 10 per cent (claimed tariff charged to US is 15 per cent)\n\nMalawi : 17 per cent (claimed tariff charged to US is 34 per cent)\n\nLiberia : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nBritish Virgin Islands : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nAfghanistan : 10 per cent (claimed tariff charged to US is 49 per cent)\n\nZimbabwe : 18 per cent (claimed tariff charged to US is 35 per cent)\n\nBenin : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nBarbados : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMonaco : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSyria : 41 per cent (claimed tariff charged to US is 81 per cent)\n\nUzbekistan : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nRepublic of the Congo : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nDjibouti : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nFrench Polynesia : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nCayman Islands : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nKosovo : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nCuraçao : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nVanuatu : 22 per cent (claimed tariff charged to US is 44 per cent)\n\nRwanda : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSierra Leone : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMongolia : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSan Marino : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nAntigua and Barbuda : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nBermuda : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nEswatini : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMarshall Islands: 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSaint Pierre and Miquelon : 50 per cent (claimed tariff charged to US is 99 per cent)\n\nSaint Kitts and Nevis : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nTurkmenistan : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nGrenada : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSudan : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nTurks and Caicos Islands : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nAruba : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMontenegro : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSaint Helena : 10 per cent (claimed tariff charged to US is 15 per cent)\n\nKyrgyzstan : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nYemen : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSaint Vincent and the Grenadines : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nNiger : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSaint Lucia : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nNauru : 30 per cent (claimed tariff charged to US is 59 per cent)\n\nEquatorial Guinea : 13 per cent (claimed tariff charged to US is 25 per cent)\n\nIran : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nLibya : 31 per cent (claimed tariff charged to US is 61 per cent)\n\nSamoa : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nGuinea : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nTimor-Leste : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMontserrat : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nChad : 13 per cent (claimed tariff charged to US is 26 per cent)\n\nMali : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMaldives : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nTajikistan : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nCabo Verde : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nBurundi : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nGuadeloupe : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nBhutan : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMartinique : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nTonga : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMauritania : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nDominica : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMicronesia : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nGambia : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nFrench Guiana : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nChristmas Island : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nAndorra : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nCentral African Republic : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSolomon Islands : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nMayotte : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nAnguilla : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nCocos (Keeling) Islands : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nEritrea : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nCook Islands : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSouth Sudan : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nComoros : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nKiribati : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSão Tomé and Príncipe : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nNorfolk Island: 29 per cent (claimed tariff charged to US is 58 per cent)\n\nGibraltar : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nTuyalu : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nBritish Indian Ocean Territory : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nTokelau : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nGuinea-Bissau : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nSvalbard and Jan Mayen : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nHeard and McDonald Islands : 10 per cent (claimed tariff charged to US is 10 per cent)\n\nRéunion : 37 per cent (claimed tariff charged to US is 73 per cent)\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-farmers-donald-trump-tariffs/nqauvc7jc",
        "title": "Meet the Australian farmers Donald Trump has a beef with",
        "publish_date": "Thu, 3 Apr 2025 05:39:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian farmers are urging calm in the face of fresh tariffs imposed on Australian exports by the United States — unless you're a burger consumer in America.\n\n\n\n\n\nOn Thursday, US President Donald Trump laid out his Liberation Day plans, announcing reciprocal tariffs that trade partners would face from 5 April.\n\n\n\n\n\nTrump singled out Australia's beef industry in his speech, alluding to a potential ban on beef imports as he delivered a widespread 10 per cent tariff. However, SBS understands there will be no explicit ban on beef.\n\n\n\n\n\n\"We imported $3 billion of Australian beef from them just last year alone. They won't take any of our beef. They don't want it because they don't want it to affect their farmers,\" Trump said.\n\n\n\nAustralia has controls on the importation of fresh US beef and beef products due to concerns about bovine spongiform encephalopathy, also known as mad cow disease.\n\n\n\nAustralian consumers unlikely to be impacted by tariffs\n\nWestern Australia beef farmer Mark Thomas was relieved to see Australia was on an \"even playing field with the rest of the world\".\n\n\n\n\n\n\"It looks like 10 per cent is the lowest that has been put on countries. So I'd say, considering that's all we've received, it's a good result,\" he told SBS News.\n\n\n\nMark Thomas is a livestock farmer from Western Australia. Source: SBS News / Christopher Tan The 37-year-old explains the tariffs shouldn't impact the prices farmers receive from abattoirs as this is set according to supply and demand, which should remain strong.\n\n\n\n\n\n\"Currently, beef export prices are historically high, largely due to the fact that America has got very low herd numbers,\" Thomas said.\n\n\n\n\n\nIn 2024, Australia exported 394,716 tonnes of beef to over 100 markets, worth $4.16 billion, according to the Red Meat Advisory Council (RMAC).\n\n\n\nAustralia exported more than 394,000 tonnes of beef to over 100 different markets in 2024. Source: SBS News / Christopher Tan \"Even with a 10 per cent tariff, I don't believe that will reduce their [abattoir] margins to zero,\" Thomas said.\n\n\n\n\n\n\"While they still have a margin, they will be looking to buy cattle.\"\n\n\n\n\n\nThomas said Australians should remain largely unaffected at the checkout, as prime steaks aren't exported to the US.\n\n\n\n\n\n\"A lot of it's lean trim, which is used for hamburgers. So unless you're having hamburgers every night, you're probably not going to be too affected,\" he said.\n\n\n\nTony Hegarty is a beef and sheep producer in the Hunter Valley, NSW. Source: Supplied Tony Hegarty, a beef and sheep producer in the Hunter Valley, said it's important to \"remain calm\" as industries understand the full impacts.\n\n\n\n\n\nAs the chair of the NSW Farmers Association cattle committee and with over 40 years' experience as a farmer, Hegarty said Australia's market had diversified in the face of similar pressures.\n\n\n\n\n\n\"We've dealt with it before, with China recently, but even back as far as the mid 70s, when UK left us and went into the EU [European Union], we had to diversify into markets, and that's what our industry has done over a long period of time,\" Hegarty told SBS News.\n\n\n\n\n\nHe said that while there may be short-term impacts, the market will adjust and ship its produce elsewhere. It will largely be US customers who face increased costs due to the measures.\n\n\n\nHow US tariffs will drive up Big Mac prices in America\n\nHowever, the announcement is bad news for Big Mac lovers in America, including Trump.\n\n\n\n\n\nAmericans consume roughly six billion hamburgers containing Australian beef each year, according to RMAC estimates.\n\n\n\n\n\nTariffs, which are taxes imposed on goods imported into a country, could push up burger prices in the US as suppliers try to cover the extra fee.\n\n\n\nTariffs could push up burger prices in the US. Credit: Official White House photograph by Joyce N. Boghosian RMAC chair John McKillop priced the total impact on American consumers from tariffs on Australian red meat at $600 million.\n\n\n\n\n\n\"Without Australian lean beef blended with local fatty trim, the US would need to use higher value cuts in their burgers and miss out on valuable export opportunities,\" he said in a statement.\n\n\n\n\n\nWhile expressing disappointment, Australian Meat Industry Council CEO Tim Ryan maintains the US remains an important market for Australian meat.\n\n\n\nSource: SBS News \"The fundamentals around the Australian meat export industry have not changed. We produce a high-quality product that the world wants, and that's not going to change today,\" Ryan said.\n\n\n\n\n\n\"We play an important role in the US meat market, and currently they're experiencing a shortage, so Australian product will continue to have a role in supplementing US domestic production.\"\n\n\n\n\n\nThey clarified that Australia does not have a ban on US beef exports, but has requested that beef made in the US from cattle born and raised in Mexico or Canada undergo biosecurity and food safety assessments.\n\n\n\nIndustry welcomes government response\n\nStanding up shortly after Trump, Prime Minister Anthony Albanese labelled the 10 per cent tariffs as \"not the act of a friend\" and encouraged Australians to buy local.\n\n\n\n\n\n\"We will promote buying Australian is one way that we can respond. We can be proud of our products,\" he told reporters in Melbourne.\n\n\n\n\n\n\"We can't control what the US administration determines, but we can engage with them. This is a decision that they have made. It's one which we think, importantly, is not in the interests of the United States.\"\n\n\n\nREAD MORE From shopping to superannuation: How a US trade war could impact Australians\n\nAlbanese announced $50 million in government funding for affected industries seeking new export markets.\n\n\n\n\n\nDavid Jochinke, president of the National Farmers' Federation, welcomed the funding amid ongoing work with the government to support Australian agriculture and farmers.\n\n\n\n\n\n\"This is the time to stand up for Australian farmers and get behind us to continue our workers producing high-quality food for not only the nation but the world,\" he said.\n\n\n\n\n\nOpposition leader Peter Dutton criticised the government for not securing an exemption for Australia.\n\n\n\n\n\n\"If the prime minister had leveraged (critical minerals and defence) within the relationship before now, I think we would find ourselves in a different position today,\" he told reporters in Perth.\n\n\n\n\n\n\"We would have had greater connection and greater communication with the White House, and we demonstrated that only a few years ago.\"\n\n\n\n\n\nNo countries have secured tariff exemptions. Mexico and Canada were not included in this round of tariffs as they already have 25 per cent tariffs on them. Russia, Cuba, Belarus and North Korea were also absent from the list, but they already face \"extremely high tariffs\", according to the White House.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-3-april-2025/dod75yoaj",
        "title": "Furious bipartisan agreement over new US tariffs | Evening News Bulletin 3 April 2025",
        "publish_date": "Thu, 3 Apr 2025 05:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralian pharamceuticals are exempt from U-S President Donald Trump's sweeping new tariffs.\n\n\n\n\n\nThe Industry Representative, Medicines Australia, says it has received confirmation of the exemption.\n\n\n\n\n\nThe beef industry hasn't been so lucky.\n\n\n\n\n\nIt will be hit with a ten per cent tariff, along with most Australian imports to the U-S.\n\n\n\n\n\nMr Trump is citing Australia's ban on the importation of American beef, which has been in place since a 2003 outbreak of Mad Cow Disease in the U-S, as reason for the tariff.\n\n\n\n\n\n\"Australia bans, and they're wonderful people and wonderful everything, but they ban American beef. Yet we imported 3 billion dollars of Australian beef from them just last year alone. They won't take any of our beef. They don't want it because they don't want it to affect their farmers. And you know what? I don't blame them. But we're doing the same thing right now.\"\n\n\n\n\n\nU-S consumers could be amongst the worst-hit by the tariff, as Australian beef is in about six billion hamburgers consumed in the U-S each year.\n\n\n\n\n\nApart from beef, Australia's biggest exports to the U-S are financial services, gold, sheep and goat meat, vaccines, and transportation services.\n\n\n\n\n\n+++\n\n\n\n\n\nA domestic political row, has broken out in the middle of the federal election campaign, over U-S President Donald Trump's tariffs on Australian goods- despite both the government and opposition agreeing they are unacceptable.\n\n\n\n\n\nBoth Prime Minister Anthony Albanese and Opposition Leader Peter Dutton have decried the tariffs... but the coalition has accused the government of not negotiating hard enough for an exemption.\n\n\n\n\n\nForeign Minister Penny Wong has told Sky News any claims the government are not doing everything they can to avoid negative impacts on Australian producers are reckless and wrong.\n\n\n\n\n\n\"Peter Dutton seems to think he’s Superman, but he’s actually Captain Obvious. He suggests that this is a time for negotiation, well that is what we have been doing. He suggests we should be discussing critical minerals; that is what we have been doing. And really, what we saw from Mr Dutton today is more reckless arrogance. We saw him today talking down Australia.\"\n\n\n\n\n\n+++\n\n\n\n\n\nOpposition Leader Peter Dutton has attacked the federal government for delaying the approval of a major gas expansion in Western Australia until after the election.\n\n\n\n\n\nWoodside Energy estimates that the expansion of their Northwest Shelf project will produce 4.3 billion tonnes of greenhouse gases over its lifetime.\n\n\n\n\n\nMr Dutton says the Coalition's plan to dramatically increase fossil fuel production will bring down prices for consumers and encourage local manufacturing.\n\n\n\n\n\nHe says the delay in approving the Woodside project has been designed to appease voters in inner-city seats on the east coast.\n\n\n\n\n\n\"It is a disaster for the W-A economy and it's a disaster for the whole economy across the nation. Gas is so intimately involved in the production of steel in this country that it's making it prohibitive to build and manufacture in our country if we don't get the gas picture right. We want to put more gas into the system domestically. We want gas for Australians first and that will push down prices.\"\n\n\n\n\n\n+++\n\n\n\n\n\nIt is being claimed that inmate at men's remand prison in Western Australia are being held in inhumane conditions.\n\n\n\n\n\nWestern Australia's Hakea Prison is located in the Perth suburb of Canning Vale.\n\n\n\n\n\nThe state's Custodial Services Inspector, Eamon Ryan, has written a report, tabled in state parliament, stating inmates there have limited access to fresh air, are subject to excessive lockdowns, and live in unhygienic cells infested with pests.\n\n\n\n\n\nHe says daily staffing shortages at the maximum security facility are having major effects.\n\n\n\n\n\nAbout 80 per cent of the men of the men at Hakea have not been convicted of the offences with which they are charged.\n\n\n\n\n\nThe state's Justice Department says it has established a task force to improve conditions.\n\n\n\n\n\n+++\n\n\n\n\n\nNew South Wales Premier Chris Minns says there's no need to panic after a glitch on the Sydney Metro system- but the rail union isn't so sure.\n\n\n\n\n\nYesterday, footage went viral of a driverless metro train travelling through the city's north, from Chatswood to Crows Nest- with the carriage door left open between stations.\n\n\n\n\n\nThe trains can travel as fast as 100 kilometres per hour.\n\n\n\n\n\nSydney Metro chief Peter Regan says staff did not fully follow procedures to manually shut the door.\n\n\n\n\n\nMr Minns says the incident was a result of human error, no one's life was in jeopardy, and there is no plan to change any arrangements for Metro trains.\n\n\n\n\n\nHowever, Rail, Tram and Bus Union Secretary Toby Warnes it's a miracle no one was hurt, and the incident shows there's not a mature enough safety protocol system in place.\n\n\n\n\n\n+++\n\n\n\n\n\nIn football,\n\n\n\n\n\nMatildas coach Tom Sermanni admits he isn't confident that goalkeeper Mackenzie Arnold will be fit to play in their first friendly against South Korea tomorrow [[Fri 4th April]] in Sydney.\n\n\n\n\n\nArnold will undergo scans ahead of Friday night's match at Allianz Stadium after injuring her arm during training.\n\n\n\n\n\nThe Matildas are already without Ellie Carpenter, Hayley Raso, Katrina Gorry and captain Sam Kerr who are all out due to injury.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/competing-visions-for-closing-the-gap-as-campaigning-continues-in-nt/k8ifknjec",
        "title": "Competing visions for closing the gap as campaigning continues in NT",
        "publish_date": "Thu, 3 Apr 2025 04:00:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "XXX\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIn Ramingining, Arnhem Land, crocs, culture and community are colliding with the upcoming federal election.\n\n\n\n\n\nAt the centre of it all?\n\n\n\n\n\nCompeting visions for Indigenous economic development, housing, and what it actually means to close the gap.\n\n\n\n\n\n\"Look at that, look at them looking. Look at him, he's ready to jump. (Laughter) He's ready to jump.\"]]\n\n\n\n\n\nThat laughter came from federal Labor MPs who are visiting the Arafura Swamp Ranger Program, a federally funded initiative blending traditional ecological knowledge with modern environmental management.\n\n\n\n\n\nRexy Djarrkadama is an Arafura Swamp senior ranger.\n\n\n\n\n\nHe has a baby croc in hand, showing it to Malarndirri McCarthy and Marion Scrymgour.\n\n\n\n\n\n\"When we are collecting eggs, collecting eggs, we use a traditional way because we can commit our self to them, talk to them and say hello to the country where we are.\"\n\n\n\n\n\nThe program isn't just about crocs, it’s about careers, jobs created on Country that provide local school-leavers with an alternative to welfare dependency.\n\n\n\n\n\n\"I like it and it's good creating more jobs for people that are coming up from school, this is the best you know. I reckon its best job in the Rangers. I like it, because I have been working many different jobs that I didn't like it. I reckon Rangers is the best one.\"\n\n\n\n\n\nLabor’s pledge is to double the number of Indigenous rangers by the end of the decade.\n\n\n\n\n\nIt’s a strategy Minister for Indigenous Australians Malarndirri McCarthy says is about worthwhile employment.\n\n\n\n\n\n\" It's also about jobs, to be able to have fulfilling jobs, jobs that make you feel worthwhile, jobs that enable you to look after your family, to care for your children, to live a quality of life that you didn't live before. ... It's beautiful to be able to do that in Caring for Country in the ranger program.\"\n\n\n\n\n\nBut leaving the ranger base, it doesn’t take long to the rough patches—literally.\n\n\n\n\n\nRoads are broken.\n\n\n\n\n\nHomes are overcrowded.\n\n\n\n\n\nAnd infrastructure? ... Barely holding together.\n\n\n\n\n\nPeter Djigirr is a Yolngu elder.\n\n\n\n\n\n\"In the wet season time there is a big mob water along the road and sometime we have problem with the car every day it break or we get bogged. All days. So we want good roads to be there so we can drive quick and visit our homeland.\"\n\n\n\n\n\nLabor’s vision is clear: economic development, local employment, and community empowerment.\n\n\n\n\n\nBut the Coalition isn’t staying quiet.\n\n\n\n\n\nCampaigning in Melbourne, Opposition Leader Peter Dutton wouldn’t confirm whether a Coalition government would cut funding from Indigenous Affairs.\n\n\n\n\n\nInstead, he focused on fiscal prudence.\n\n\n\n\n\n\"Families are under pressure in their own budgets and they expect the government, the federal government, to spend money wisely and so that's the approach that we've taken. The government talks about waste, but they don't do anything about it, so we need to make sure that we've got the most efficient spend of taxpayers' money.\"\n\n\n\n\n\nEnter Senator Jacinta Nampijinpa Price, opposition spokeswoman on Indigenous Australians, and one of the Coalition’s most vocal figures on Indigenous policy.\n\n\n\n\n\n\"Simply throwing hundreds of millions of dollars at the issue is not addressing those concerns for me.\n\n\n\n\n\nSo, I've been pretty clear for some time now in that, you know, called for an audit of of the funds that are being spent in the Indigenous Affairs space to determine where the outcomes actually exist and where they're failing. And I also ... in order to do this audit is to provide a level of accountability that I think isn't, hasn't existed for a long time, which is why we've got such a huge, yawning gap.\"\n\n\n\n\n\nFor Ms Price, the issue isn’t just how much is spent, but where it's going, and what it achieves.\n\n\n\n\n\n“Grassroots organisations that are clearly providing wonderful outcomes in their communities and really only need a small amount of money to get by, but are being overlooked when it comes to funding provided to them or not being provided through NIAA and so these little places get missed.\"\n\n\n\n\n\nIt’s a critique of a system she says is riddled with inefficiency.\n\n\n\n\n\nShe questions the reliability of Indigenous data and worries that increasing rates of self-identification may be skewing Closing the Gap outcomes.\n\n\n\n\n\nBut even amid criticism, Senator Price is no stranger to supporting Indigenous-led initiatives, as long as they are delivering results.\n\n\n\n\n\n\"This is something the Coalition is very proud about in terms of the Ranger program, but we want to, again, it'll be part of an audit process as well to ensure that it is the programme is strengthened and it's providing really good outcome for those on country. But again, I'm also aware that, you know, not all, not all indigenous people want to be Rangers. They want to be business entrepreneurs, so it's going to be a priority, but amongst other priorities as well, to ensure that we're growing a wonderful private sector for Indigenous Australians at the same time.\"\n\n\n\n\n\nHer message is clear: economic independence should be the endgame.\n\n\n\n\n\nThat means reforming Native Title, empowering Traditional Owners to generate income on their land, and removing bureaucratic obstacles preventing councils, many of which are 100 per cent Indigenous, from accessing funding.\n\n\n\n\n\nAs for housing?\n\n\n\n\n\nMs Price is equally concerned about the high cost of remote builds, sometimes $1.5 million for a single home.\n\n\n\n\n\nShe’s promising to revisit existing agreements and deliver better value for money.\n\n\n\n\n\nAnd on road infrastructure?\n\n\n\n\n\n\"Right now. I mean, I know we in the Northern Territory are pretty upset at the very little that's been provided in the budget for territory roads, which is just about maintenance. Really nothing, nothing new there in terms of supporting road infrastructure. .. We know how important road infrastructure is right around the country for access, you know, for communities in terms of freight, in terms of addressing the cost of living issue as well. That's important for those communities.\"\n\n\n\n\n\nSo, what’s the choice before voters in places like Ramingining?\n\n\n\n\n\nOn one side, Labor is leaning on symbolism and long-term investment, tying cultural heritage to economic empowerment.\n\n\n\n\n\nOn the other, the Coalition, led by Jacinta Price in this area, is pushing for a tougher, outcomes-driven approach.\n\n\n\n\n\n“My focus is to close the gap, is to address the needs of particularly our most marginalised Indigenous Australians. I recognise that there are many, many of us who are doing particularly well with our lives, but as a priority, there are many Indigenous Australians in this country, those who can't read and write, those who, you know, first language is not English, and we need to bring them up to the same level as those of us who are doing particularly well in this country.\"\n\n\n\n\n\n\n\nTwo visions.\n\n\n\n\n\nOne shared goal.\n\n\n\n\n\nAs the election looms, both parties are campaigning, battling not just for votes, but for trust.\n\n\n\n\n\nAnd maybe that’s what matters most in communities like this one.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australias-norfolk-island-and-two-uninhabited-territories-targeted-by-us-tariffs/scme0dzxt",
        "title": "'No known exports': Australia's Norfolk Island says it won't have to pay higher US tariffs",
        "publish_date": "Thu, 3 Apr 2025 02:52:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "The administrator of a tiny Australian island targeted by Donald Trump's 'Liberation Day' tariffs has confirmed it will not be paying a higher tariff despite being identified on a list circulated by the United States president.\n\n\n\n\n\nOn Thursday, Trump announced Australia would be subject to a 10 per cent tariff , but Norfolk Island was singled out for higher tariffs despite being an Australian territory.\n\n\n\n\n\nNorfolk Island was facing a 29 per cent tariff, which the US said was in response to the 58 per cent tariff (including currency manipulation and trade barriers) it faced from Norfolk Island.\n\n\n\n\n\nA spokesperson for the Norfolk Island administrator told SBS News it had \"no known exports\" to the US.\n\n\n\n\n\n\"Tourism is the main industry on Norfolk Island and the primary driver of economic activity,\" she said.\n\n\n\nNorfolk Island is located about 1,600km from Australia. Source: Getty / Encyclopaedia Britannica/Universal Images Group \"There are no known exports from Norfolk Island to the United States of America and no tariffs or known non-tariff trade barriers on goods coming to Norfolk Island,\" the spokesperson said.\n\n\n\n\n\nNorfolk Island is an external Australian territory about 1,600km north-east of Sydney. It has a population of around 2,188 people.\n\n\n\n\n\nThe spokesperson said they had confirmed the island would not be subject to a higher 29 per cent tariff — only the 10 per cent being applied to Australia broadly.\n\n\n\n\n\n\"It appears that the official Trump administration's executive order that applies additional tariff rates on specific countries does not include Australia or the external territories including Norfolk Island,\" she told SBS News.\n\n\n\n\n\n\"This means the 10 per cent tariff announced today applies to all of Australia.\"\n\n\n\nUninhabited Heard and McDonald islands also targeted\n\nThere was also confusion around why the Heard and McDonald islands, both uninhabited Australian external territories, were also singled out on Trump's list .\n\n\n\n\n\nThe islands are populated by seals, penguins, and birds — but not by people.\n\n\n\n\n\nThe US has suggested a 10 per cent tariff will be placed on goods from these islands, a \"reciprocal\" tariff on the 10 per cent it believes it pays.\n\n\n\nNorfolk Island is part of Australian territory\n\nIn his address, Prime Minister Anthony Albanese questioned why Norfolk Island had been singled out.\n\n\n\n\n\n\"I think Norfolk Island somehow has been hit with 29 per cent tariff rather than 10 per cent,\" he told reporters.\n\n\n\n\n\n\"Last time I looked, Norfolk Island was a part of Australia.\"\n\n\n\n\n\nResidents of Norfolk Island vote in Australian elections and are subject to laws on taxation, social security, immigration, biosecurity, customs and health arrangements, including Medicare and the Pharmaceutical Benefits Scheme.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/trump-announces-tariffs-the-day-americas-destiny-was-reclaimed/nht6zdm7q",
        "title": "Trump announces tariffs: 'the day America's destiny was reclaimed'",
        "publish_date": "Thu, 3 Apr 2025 02:51:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nUS President Donald Trump has called it the 'most beautiful word in the dictionary', and today he's shown just how serious he was.\n\n\n\n\n\nThat word, of course, is tariffs.\n\n\n\n\n\nIn a sweeping announcement made today, U-S President Donald Trump signed an order imposing a baseline 10 per cent tariff on all goods imported to the U-S, with some countries hit with higher duties.\n\n\n\n\n\nFrom close allies to long-standing rivals, no country was spared.\n\n\n\n\n\n“For decades our country has been looted, pillaged raped and plundered by nations near and far, by friend and foe alike. American steelworkers, autoworkers, farmers and skilled craftsmen, we have a lot of them here today, they really suffered gravely, they watched in anguish as foreign leaders have stolen our jobs, foreign cheaters have ransacked our factories, and foreign countries have torn apart our once beautiful American dream.”\n\n\n\n\n\nSpeaking at the White House Rose Garden, Mr Trump says that for years, large and persistent US goods trade deficits have been 'hollowing out' the domestic manufacturing base.\n\n\n\n\n\nAlongside a 10 per cent baseline tariff, he also announced an additional punitive import tax - tailored for each of about 60 countries.\n\n\n\n\n\nWith new barriers placed on the world's largest consumer economy, Donald Trump says the measures will return wealth to Americans.\n\n\n\n\n\nAddressing his concerns about auto workers and car manufacturing, he also announced a separate 25 per cent global tariff on car imports.\n\n\n\n\n\n“But such horrendous imbalances have devastated our industrial base and put our national security at risk. I don't blame these other countries at all for this calamity. I blame former presidents and past leaders who weren't doing their job. They let it happen and they let it happen to an extent that nobody can even believe. That's why effective at midnight, we will impose a 25% tariff on all foreign made automobiles.”\n\n\n\n\n\nDisrupting a decades old trade order, the new barriers undo arrangements that have been in place since 1947.\n\n\n\n\n\nBut Donald Trump says that for too long, the rest of the world has been taking advantage of the United States.\n\n\n\n\n\nWith global trading partners expected to respond with countermeasures, Mr Trump says there will be no exemptions without something offered in return.\n\n\n\n\n\n“Likewise to all of the foreign presidents, prime ministers, kings, queens, ambassadors and everyone else who will soon be calling to ask for exemptions from these tariffs, I say, terminate your own tariffs, drop your barriers. Don't manipulate your currencies. They manipulate their currencies like nobody can even believe which is a bad, bad thing, and very devastating for us.”\n\n\n\n\n\nThomas Bridges is an assistant professor of economics at the University of Delaware.\n\n\n\n\n\nHe says if the announcements lead to higher tariffs long term, it could have significant impacts on the global economy.\n\n\n\n\n\n“The foundation of a strong economy is one in which people can specialize in what they do best. And the same holds for a global economy, like the foundation for a strong global economy is when nations can specialize in the production of goods or services that they can do best. And having no barriers to trade, you know, makes the economy more efficient and provides sort of a solid foundation. So, my concern would be that if these tariffs are long lasting, it could have quite significant effects on, you know, the foundations of global economies.”\n\n\n\n\n\nProfessor Bridges is not alone in his concerns about the long term effects.\n\n\n\n\n\nSo, what exactly are tariffs and why is Donald Trump imposing them?\n\n\n\n\n\nTariffs are a form of tax, imposed on goods coming into a country by the nation receiving them.\n\n\n\n\n\nThe company importing goods to the United States is generally the one who will pay extra, they then can decide whether to absorb that cost themselves or pass it onto the consumer.\n\n\n\n\n\nWhile tariffs often lead to higher prices for consumers, Donald Trump says the measures are about encouraging American industry and boosting the US economy.\n\n\n\n\n\nIn Texas, Houston Wine Shop manager Antonio Gianola says Americans don't realise how much this will affect them.\n\n\n\n\n\n“I don't think we realize how much these things really affect us domestically. it's not, I would say it's just not it's not something that somebody else pays. That's something that America pays. And American businesses and American employees are the people that end up suffering.”\n\n\n\n\n\nCanada and Mexico, the two largest trading partners of the US, will not face additional tariffs on top the 25 per cent tariffs announced earlier this year.\n\n\n\n\n\nAustralia is among a select few countries hit only with the baseline 10 per cent tariff, alongside the UK, New Zealand, Singapore and others.\n\n\n\n\n\nMr Trump did however express some concerns about Australian beef.\n\n\n\n\n\n“Australia bans, and they're wonderful people and wonderful everything, but they ban American beef. Yet, we imported three billion dollars of Australian beef from them just last year alone. They won't take any of our beef. They don't want it because they don't want it to affect their farmers, and you know what? I don't blame them, but we're doing the same thing right now starting out midnight tonight.”\n\n\n\n\n\nThe ban on US beef was imposed in 2003 after the United States saw an outbreak of bovine spongiform encephalopathy, also known as mad cow disease.\n\n\n\n\n\nPrime Minister Anthony Albanese says he will stand strong in the face of US tariffs, but says Australia won't impose retaliatory tariffs.\n\n\n\n\n\nWhen responding to the news, Mr Albanese says it's important to remember that Australian exports to the US represent under 5 per cent of goods exports.\n\n\n\n\n\n“President Trump referred to reciprocal tariffs. A reciprocal tariff would be zero, not 10 per cent. The administration's tariffs have no basis in logic and they go against the basis of our two nation's partnership.”\n\n\n\n\n\nAs trading partners around the world respond to the announcement, some Americans are also responding with alarm.\n\n\n\n\n\nIn Washington, communications worker Sophia says she has concerns about the auto import tariffs.\n\n\n\n\n\n“I was just talking to my roommate about how I'm so thankful I don't have a car or need a car in a city like D.C. because I can't imagine - I know it's like 25% on auto imports now so - yeah that's huge for anyone who is looking to purchase a car this year. Thankfully I get to rely on public transport and walking but yeah it's going to be a lot.”\n\n\n\n\n\nDonald Trump has promised Americans that as a result of his economic and trade policies, American consumers will pay less for things like groceries.\n\n\n\n\n\nDemocratic senator Chuck Schumer says the opposite will happen.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/goodfood/vic-good-food-guide/pizza-pizza-pizza-20250404-p5lp7s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pizza Pizza Pizza",
        "publish_date": "Fri, 04 Apr 2025 12:54:09 +1100",
        "category": "finance",
        "authors": [
            "Emily Holgate"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\n1 / 3 Pizza Pizza Pizza does slices late into the night. Supplied 2 / 3 Outside the Meyers Place bar. Supplied 3 / 3 A selection of the New York-style pies available. Supplied Previous Slide Next Slide\n\nPizza$$$$\n\nJust down the popular Meyers Place laneway, Pizza Pizza Pizza has fast become a go-to pit stop for late-night diners seeking New York-style pies and cocktails in the CBD. It’s open until 1am, making this moody, dimly-lit bar a hub for hungry punters spilling out of neighbouring theatres on Friday and Saturday nights.\n\nOrder by the slice or by the pie (12 or 18 inches) – maybe it’s a classic pepperoni, or a funghi-heavy ‘Magic Mushroom’ number drizzled in truffle oil. Gluten free bases and vegan cheese are available, too, and you can mix-and-match toppings with half-half pies.\n\nBehind a black curtain at the rear lies a semi-private, sitting-only bar where you can settle in for a negroni night cap.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/bendigo-s-chinese-community-fires-up-for-2025-easter-festival-20250404-p5lp7x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bendigo’s Chinese community fires up for 2025 Easter Festival",
        "publish_date": "Fri, 04 Apr 2025 12:49:53 +1100",
        "category": "finance",
        "authors": [],
        "text": "Bendigo’s Chinese community fires up for 2025 Easter Festival\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/who-gets-the-friends-in-a-divorce-it-depends-on-who-you-ask-20250403-p5lozw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Who gets the friends in a divorce? It depends on who you ask",
        "publish_date": "Fri, 04 Apr 2025 12:33:15 +1100",
        "category": "lifestyle",
        "authors": [
            "Sara Mulcahy"
        ],
        "text": "Saying goodbye No matter how much you may want to maintain friendships made during your marriage, there will be people who don’t stand the test of time. Losing friends to your ex can be painful — it may well feel like yet another layer of grief to process during an already challenging time. Coping with this loss will mean you have to dig deep to find resilience. Friends who choose to prioritise your ex may have their own reasons —perhaps that was the closer relationship all along, or they simply feel more aligned with them now. It doesn’t reflect on your value as a person. And it’s OK to grieve. “Losing shared friends is a real loss, and it’s OK to feel sad, hurt or even betrayed,” says Cao. “Give yourself permission to process these emotions without judgment.”\n\nLoading Jowett says this was hard to process when she split from her husband. “Sadly, I did lose some friends who were more his friends — and he also needed his own supporters,” she says. Cao says to focus on your own friendships, build new connections, and try to stay positive. “It’s easy to fall into resentment or frustration, but focusing on the loss can drain your energy. Instead, prioritise self-care and activities that bring you joy.”\n\nWhen friends split up From the other side of the fence, it can be challenging to see your friends splitting up, especially if you’ve known both of them for a long time. At best, you might be upset as your social situation is rocked. You might at first resent feeling forced to choose. At worst, you might feel manipulated or used, a pawn in the continuing battle. “Create space for your friends to share their feelings,” says Cao. “Avoid being the messenger between the parties, respect your friend’s privacy and don’t gossip with mutual friends.” For Jowett, whose experience inspired her to become a life coach for women like her, having a friend like Ritman was critical to her wellbeing in the months after she separated. “When I felt like hiding, Oenone was one of my circle of key supporting friends encouraging me,” she says. “She would message me to check in and call me for chats, suggest outings.\n\nLoading “I knew I could trust her implicitly and it was safe to be vulnerable about my loss, without divorce-shame. I had someone who listened and empathised and didn’t dramatise it or discuss it elsewhere.” But what if you don’t want to have to choose? Is it possible to stay neutral Switzerland and for all to be well? “You can remain friends with both parties,” says Cao. “But it does require careful navigation, clear boundaries and sensitivity. More often than not, people will end up choosing a side.” Of course, if one or other of the married parties has done something undeniably wrong, this changes things. Joint friends often feel honour-bound to take the side of the spouse who has been unwittingly thrust into the role of victim.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/celebrity/does-my-brand-look-big-in-this-how-influencers-sold-their-souls-20250328-p5lnag.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Does my brand look big in this? How influencers sold their souls",
        "publish_date": "Fri, 04 Apr 2025 12:33:03 +1100",
        "category": "finance",
        "authors": [
            "Brodie Lancaster"
        ],
        "text": "Her complaint might have been specific to a breed of Manhattan Pilates princesses whose schedules consist of taking photos of their morning matcha and attending product launches, but it could apply to any major city around the world. Including Melbourne.\n\n“They’re all carbon copies of each other … they all look like they shop at Revolve,” a user called @martinifeeny told her small circle of followers, referencing a fast-fashion brand known for shipping twenty-somethings to Coachella for the purpose of having their picture taken and not actually entering the festival. “They’re all basic – but they’re skinny and pretty, so stuff looks cute on them. But boring … no hate.”\n\nCall me outdated, but my mind is still locked into last week’s viral video in which a person aired her opinions about a crop of new arrivals to New York, declaring the city’s influencers to be “boring as f---”.\n\nA conversation has been brewing online. And when I say “online” I mean “on TikTok”. And when I say “been brewing” I really mean “happening recently enough that it’s still newsworthy but over a week ago, so the zeitgeist has mostly moved on to the next outrageous thing to react to with peak emotion”.\n\nNow, before you label me a geriatric Millennial shaking my fist at the cloud I pay $4.49 each month to store photos of my cat in, let me affirm that I’m upset at neither the concept nor the proliferation of influencers. A version of their work has always existed, and without the structures of traditional media walling their behaviour off with a facade of exclusivity, it’s become a lucrative and accessible business for many people drawn to it. If you can take the photos and build the audience and find a way to connect, all power to you! Get the bag. Personally, I sound like I’m going to cry when I have to talk into a camera, so it’s simply not on the cards for me.\n\nLoading\n\nBut I’ve spent enough time working in advertising over the past 15 years and staring into the blue glow of my phone every night for approximately one to six hours to confidently say that the criteria for succeeding as an online creator today is less about wielding any amount of genuine influence, and more to do with a person’s capacity to transform into an authentic-sounding billboard for whatever brand pays them to do so.\n\nIn the mid-2000s, I was a teenager as the first generation of social media stars were born. I watched as people wrote fashion blogs that transformed them into front-row fixtures at international couture shows on the strength of their ability to express themselves through writing and styling.\n\nI saw party girls whose faces somehow looked better with streaks of mascara cascading down them go from knowing the right DJs to collaborating with designers on shoes I would have killed to afford. I saw Tumblr stars influence culture, open gallery shows and headline festivals. I saw the greatest blogging minds of my generation, eventually, migrate to one platform and slowly mould themselves to fit an algorithm determined by a dweeb king.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/meet-the-teenager-at-the-centre-of-a-three-code-tug-of-war-20250403-p5loxj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meet the teenager at the centre of a three-code tug of war",
        "publish_date": "Fri, 04 Apr 2025 12:31:47 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "NRL great Scott Prince has thrown his support behind teenage phenom Shalom Sauaso pursuing multiple rugby codes, until the rival sports attain full-time professionalism.\n\nThe 17-year-old is in a tug of war for her services, as she prepares to play for the Queensland Reds in the Super Rugby Women’s semi-final on Sunday before launching her NRLW career at the Brisbane Broncos.\n\nSauaso has also been on rugby sevens radar, having been named the 2023 Global Youth Sevens’ most valuable player. By the time of the Brisbane 2032 Olympics, she will be approaching her prime.\n\nShalom Sauaso’s tackle-busting ability has been crucial in the Queensland Reds’ strong season. Credit: Neha Kumar/Queensland Rugby Union\n\nBut her NRLW coach Prince gave her his blessing to continue juggling the codes.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/art-and-design/more-like-a-tomb-than-luxury-apartments-the-plans-dividing-sydney-s-elite-20250331-p5lnth.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "More like a tomb than luxury apartments: the plans dividing Sydney’s elite",
        "publish_date": "Fri, 04 Apr 2025 12:26:07 +1100",
        "category": "finance",
        "authors": [
            "Julie Power"
        ],
        "text": "It’s the design war that has divided bankers, lawyers, celebrities, politicians, some senior members of the Hari Krishna – and many architects.\n\nThe 19-storey luxury Altair Apartments at Rushcutters Bay won architects Engelen Moore – now Ian Moore Architects – a grand slam of prestigious awards including the World Architecture Festival’s best building in Australasia in 2002.\n\nAltair Apartments in Potts Point is the subject of a development dispute. Credit: Flavio Brancaleone\n\nSince then, Ian Moore became the building’s go-to architect, working on a range of projects to ensure the integrity of a building that Altair’s website calls an “architectural icon”.\n\nThat was until late last year when Moore says he was removed without notice by the developer NTG Investment Group from a proposal to build new apartments on the site of two retail lots on the southern forecourt.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/us-stock-market-leads-worldwide-sell-off-following-trump-s-tariff-shock-20250404-p5lp2e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX tumbles after Wall Street’s $4 trillion meltdown",
        "publish_date": "Fri, 04 Apr 2025 12:25:23 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket is sharply lower but has clawed back some of its early losses after a horrific night on overseas markets as investors digested the impact of Donald Trump’s reciprocal tariffs.\n\nThe ASX200 was 116.4 points or 1.5 per cent lower at 12.00pm AEDT, with more than $30 billion wiped off the value of the bourse, and nine of 11 industry sectors in the red. The market was down nearly 2 per cent in early trade.\n\nRepercussions from US President Donald Trump’s sweeping tariff announcements spread across global markets. Credit: AP\n\nThe energy sector tumbled after oil prices slipped more than 6 per cent overnight. Santos fell 6.6 per cent and Woodside Energy plunged 6.1 per cent.\n\nMining stocks have pared early losses. BHP was 0.7 per cent lower, Rio Tinto slipped 0.3 per cent while Fortescue added 0.2 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/economic-turmoil-created-by-trump-s-tariffs-will-affect-everything-from-coffee-to-interest-rates-20250403-p5loy0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Economic turmoil created by Trump’s tariffs will affect everything from coffee to interest rates",
        "publish_date": "Fri, 04 Apr 2025 12:10:46 +1100",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "Politically, Trump’s decision was perhaps the biggest intervention by a US president in an Australian federal election since Lyndon Johnson visited the nation in October 1966 to effectively endorse Harold Holt who would lead the Coalition its largest ever victory. The economic turmoil is being driven by two factors. Trump’s plan upends how the globe has operated – and grown – since the 1940s. It also means huge financial shocks that will filter through governments, businesses and consumers. The biggest hit will be borne by Americans. The Budget Lab at Yale, a non-partisan research centre, estimates the tariffs announced this week will lower American economic growth this year by 0.5 percentage points. In the long term, it puts the permanent annual cost at between $US100 billion to $180 billion.\n\nYou can see how it comes to such a large number. It reckons the tariffs on countries that supply many of America’s clothes – such as Bangladesh (tariff hit of 37 per cent) – will push up apparel prices in the US by 17 per cent. Overall inflation is 2.3 per cent higher this year, delivering an average loss per household of $UD3800. For the poorest households, who have an average annual income of around $US16,000, the hit is $US1700. America’s average tariff rate was 2.7 per cent before Trump’s announcement. It is now 22.5 per cent, the highest level since 1909. In that year, America export $US1.9 billion worth of goods. Last year, it was $US2.1 trillion. Fitch Ratings chief economist Brian Coulton summed it up like this. “Tariff hikes will result in higher consumer prices and lower corporate profits in the US. Higher prices will squeeze real wages, weighing on consumer spending, while lower profits and policy uncertainty will act as a drag on business investment,” he said.\n\nCoulton also noted that the Federal Reserve, which would ordinarily cut interest rates to spur growth, will be less likely to do so because of the inflationary impact of tariffs. Loading Could the tariffs spark a recession? This is why the chances of an American recession this year are now put at one-in-two by economists and financial markets. The direct hit to the Australian economy is relatively muted. Yes, the country exports a lot of hamburger beef to the US, something that caught the attention of the famously Big Mac eating president.\n\nBut in this case, the cost of the 10 per cent tariff on Australia will be borne by Trump and every other hamburger loving American. The same American fans of South Australian lemons ($44,000 in 2024) or Victorian olive oil ($16.1 million). The problem, particularly for Australia, is what it may do to China. In value, Australia sends more to the European Union than the US. And both are nothing close to our two-way trade with China which last year reached a record $325 billion. Under Trump’s tariffs (which build on tariffs he imposed in his first term and those put in place by Joe Biden), the effective tariff rate on Chinese products is approaching 70 per cent. Trump has also slapped high tariffs on countries where Chinese businesses have moved their operations to avoid earlier American imposts. For instance, Vietnam (46 per cent) and Cambodia (49 per cent) are being hit.\n\nWill it make products in Australia cheaper or more expensive? These countries are also home to the production plants of companies like Nike, whose share price nose-dived 14 per cent after the tariff plan was revealed. China’s Commerce Ministry has signalled retaliatory action against the US. In Trump’s first term, China targeted American farmers that forced the president to bail them out. This time, it could be much larger. China could be forced into selling its products into other nations. Such low-cost goods could end up in nations such as Australia, and is one of the reasons Anthony Albanese (and immediately matched by Peter Dutton) promised to put more money into anti-dumping arrangements. Those anti-dumping measures, and the reverberations across the world economy, won’t worry the seals and penguins of Heard and McDonald Islands who have become surprising global media stars after being hit with their own tariff.\n\nWhat do the tariffs mean for my interest rates? But it also points to the problem ahead for the Reserve Bank. With Australia not retaliating with its own tariffs, inflation – and growth – is likely to be lower. There is now a very good chance the RBA will cut official interest rates at its mid-May meeting and follow that up with at least two more rate cuts by November. Those lower rates, however, will be only offer small respite if the global economy stumbles because of Trump’s actions. Famously, the Great Depression started because of a huge run on Wall Street in late 1929. But it was a huge increase in American tariffs the following year that consigned the US – and the rest of the world – into its deepest economic downturn.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-at-centre-of-queensland-s-illegal-cigarette-boom-20250324-p5lm32.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane at centre of Queensland’s illegal cigarette boom",
        "publish_date": "Fri, 04 Apr 2025 12:06:57 +1100",
        "category": "finance",
        "authors": [
            "William Davis"
        ],
        "text": "The scale of the cigarette black market in Queensland is revealed in new documents obtained by Brisbane Times.\n\nGovernment data acquired under right to information laws shows seizures in the state rose significantly in the second half of last year, despite the legitimate tobacco market shrinking nationally.\n\nAbout 939 alleged breaches were reported in the six months to December. In the 12 months before that, just 439 breaches were recorded.\n\nIllegal Manchester cigarettes bought in Brisbane. Credit: William Davis\n\nAbout 29 million cigarettes were seized in Queensland between July 2023 and December 2024.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/exaggerations-from-albanese-dutton-lost-in-trump-s-tariff-blitz-20250331-p5lnxf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Exaggerations from Albanese, Dutton lost in Trump’s tariff blitz",
        "publish_date": "Fri, 04 Apr 2025 12:01:37 +1100",
        "category": "finance",
        "authors": [
            "Bronte Gossling"
        ],
        "text": "Loading “Another day and another Greens policy that the prime minister has adopted,” Bandt said on Sunday at a press conference in inner Melbourne’s St Kilda West. “Their first step is to say no, and then they adopt them, and we take that as a really good sign.” Bandt, alongside Greens Senator Nick McKim, first announced a supermarket price gouging policy, which includes a Prices Commission that would make referrals to the ACCC, early last month. Albanese announced Labor’s very similar plan over the weekend. Power bills have also risen, but not by $1300 as Peter Dutton says Speaking from Western Sydney’s Eastern Creek on day three of the campaign, Dutton pledged to clean up Labor’s “wreckage”, saying “people’s power bills have gone up by $1300″.\n\nLoading On Sunday, Albanese repeated Labor’s attack line that a vote for the Coalition was a vote for higher taxes. That claim is premature, because the Coalition could still announce a tax cut policy, and it ignores Dutton’s plan to cut fuel excise for 12 months. “[Dutton] is going to an election not just having voted against our tax cuts this week, he is saying that he will introduce legislation to increase the taxation rates of all 14 million Australians,” Albanese declared on the ABC’s Insiders program. Labor’s reduction of the bottom tax rate to 14 per cent over two years, starting from mid-2026, is only worth at best $10 a week to people earning more than $45,000. It was a surprising element of Jim Chalmers fourth budget, but within a day of its announcement, shadow treasurer Angus Taylor announced the Coalition would repeal the tax cut if elected. Dutton, also on Sunday, said his plan to halve fuel excise for 12 months was superior to the “hoax” of Labor’s tax cut, saying: “[Albanese] is promising 70 cents a day in a tax cut which doesn’t start for 15 months. I think this prime minister is out of touch with how much pain Australians are feeling.”\n\nLoading Did Peter Dutton cut $50 billion from hospitals as Anthony Albanese claimed? Not really Albanese whipped out his Medicare card once again on Tuesday in Adelaide, claiming that when Dutton was Minister for Health and Aged Care between 2013 and 2014, there was “$50 billion cut from hospitals, he attempted to introduce a tax every time people visit a GP and … abolish bulk-billing altogether.” Budget documents from 2014-15 show that Dutton did plan to slash hospital spending by $50 billion over the following decade, but his forecast never came to fruition. In fact, data from the Australian Institute of Health and Welfare shows hospital spending has consistently increased over the last 12 years, including before Tony Abbott shuffled Dutton out of the health portfolio in late 2014. Dutton did try to introduce a $7 co-payment charge for traditionally bulk-billed services including standard GP consultations, out-of-hospital pathology and imaging services, though after 10 months of back-and-forth, the policy was dumped in March 2015. And many GPs have been charging significant gap fees for consultations during Labor’s time in office.\n\nPeter Dutton has said he will not cut Medicare, no matter how many times Anthony Albanese brandishes his card The Coalition has denied it would cut Medicare or health funding, and has also denied its plan to cut 41,000 public servants would impact frontline services. In February, the Coalition matched Labor’s $8.5 billion boost to Medicare. Anthony Albanese’s Medicare card has been a constant presence on the campaign trail. He’s pictured here with it in Adelaide on April 1. Credit: Alex Ellinghausen This week, the Liberals released a new television advertisement saying Labor’s claim the Coalition would cut health funding is disinformation – though the figures they use as evidence in their rebuttal are slightly misleading. The ad cites Australian government hospital funding figures to suggest the Liberals gave hospitals dramatically more money when they were last in office compared to Labor. It also points to higher bulk-billing rates in 2021-22 as evidence they will look after Medicare.\n\nLoading The Morrison government did boost hospital funding primarily to combat COVID-19, with the new Liberal ad comparing the extraordinary pandemic figure with funding under the Gillard government more than a decade ago, when Australia had a smaller population to care for. It has not been adjusted for inflation either. As for the bulk-billing rate figure, it ignores the years-long Medicare rebate freeze that largely happened under the Coalition, meaning the bonus for bulk-billing did not keep up with inflation, which soared as the world emerged from the pandemic, causing the rate of free doctor visits to fall sharply early in Labor’s term. The bulk-billing rate also reflects the number of Australians getting free COVID vaccines, which has subside Wages have gone backwards under Anthony Albanese as Peter Dutton claims, but it’s not that simple Dutton has repeatedly claimed real wages – wages adjusted for inflation – have fallen under Albanese, which is technically correct. According to the latest Australian Bureau of Statistics figures, real wages have fallen 1.1 per cent during Albanese’s term.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/new-world-order-trump-s-tariff-attack-sparks-global-recession-fears-20250404-p5lp2h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New world order: Trump’s tariff attack sparks global recession fears",
        "publish_date": "Fri, 04 Apr 2025 11:55:44 +1100",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Meanwhile, the Chicago Board Options Exchange Volatility Index (VIX), a popular measure of expected market volatility – often called “the fear gauge” – soared 40 per cent in a day and was up 57 per cent over the past five days. The price of gold has risen 8 per cent in the past month. Now the question is how the world will react. Will institutions like the World Trade Organisation (WTO) hold, or will they be rendered meaningless? How will Beijing retaliate to Trump’s “bullying”? Will it be fundamentally weakened? Will prices rise in the US and could it tip the world’s largest economy into recession, followed by others? US President Donald Trump announces new tariffs in the Rose Garden alongside Commerce Secretary Howard Lutnick. Credit: AP “This is a game changer, not only for the US economy but for the global economy,” said Olu Sonola, head of US economic research at Fitch Ratings. “Many countries will likely end up in a recession.” It was difficult to overstate how consequential the “Liberation Day” tariffs would be, said Kelly Ann Shaw, a senior trade and economics adviser to Trump in his first term. “This is the single biggest trade action of our lifetime,” she told a Brookings Institution event in Washington.\n\nShaw, now a partner at law firm Hogan Lovells, said it was likely the tariff rates were an “opening offer” from the Trump administration, not the final word. “I do think that these tariff rates will shift over time. But this is huge. And this is a pretty seismic and significant shift in the way that we trade with every country on earth.” Trading favours Trump, routinely described by fawning advisers and allies as “the world’s greatest dealmaker”, is famously transactional. Deals are always possible, exemptions are always on the table, as are further crackdowns. Doing the rounds on US television on Friday AEDT, Lutnick indicated there was room to move on tariffs, but only after countries “changed their ways”. This did not mean negotiating, he said; the US wanted to see concrete action first. “Let’s see what they do,” he told CNN. “Talking is nonsense.”\n\nIn the Rose Garden, the president said he expected to field angry calls from world leaders. On board Air Force One the next day, he said negotiation was possible if the country offered something “phenomenal” in return. (China could get a degree of tariff relief for allowing the sale of TikTok, he suggested.) Shaw said she thought the 10 per cent baseline tariff – the one applied to Australia – was more likely to stick than the various higher tariffs applied to countries such as Japan, India, South Korea, Israel and Vietnam, as well as the European Union. Trump bills the tariffs as “reciprocal” – based on what other countries charge the US in tariffs and on non-tariff trade barriers. At the announcement, Trump and Lutnick displayed the rates on big laminated cardboard charts. But as people realised afterwards, the rates were not reciprocal at all. In fact, the “tariffs charged to the USA” was a direct expression of the US’s trade imbalance with that country. They simply divided the US trade deficit with each country by that country’s exports to the US, arriving at a percentage.\n\nA seemingly complex formula posted on the website of the US Trade Representative did not substantially alter the equation. The trade office justified its method by saying it “assumed” all persistent trade imbalances were due to tariffs or non-tariff trade barriers. Mary Lovely, a senior fellow at the Peterson Institute for International Economics, said the calculations were deeply misleading. “I think the world ‘reciprocal’ can now be laid to rest. It’s a complete misnomer,” she told the Brookings event. “As a technical economist, I can tell you there’s really no methodology there ... It’s like going to your doctor, finding out you have cancer and the basis for your medication is your weight divided by your age.” Bizarre inclusions – such as a 10 per cent tariff on the uninhabited Heard and McDonald Islands, and a 29 per cent tariff on Norfolk Island – only added to the sense these tariffs were lifted from a spreadsheet and not really thought through. The fact the tariffs are not actually reciprocal makes it harder for countries to identify what they might offer in return for a reprieve. But Australia is counting on the administration’s desire for rare earth minerals to swing a potential deal down the track.\n\n“We’ve got the whole periodic table, just about, in this country. That’s a good thing,” Albanese said, confirming the government would establish a strategic reserve of critical minerals if re-elected. Opposition Leader Peter Dutton also says minerals must play a central role in striking a deal, and argues only he can do it. The world reacts\n\nFrom afar, Trump has dominated the start of the election campaign. Both parties criticised him, with Albanese calling the tariffs “totally unwarranted” and not the act of a friend. Dutton accused the president of disrespecting Australia’s “special relationship” with the US, which included fighting together in every major war for a century. French President Emmanuel Macron, centre, his Prime Minister Francois Bayrou, left, and Presidency General Secretary Alexis Kohler meet with representatives of the sectors affected by the new Trump tariffs at the Elysee Palace in Paris. Credit: AP Their reaction was shared. French President Emmanuel Macron called for “collective solidarity” and for European businesses to pause new investments in the US. European Commission President Ursula von der Leyen denounced the tariffs as a major blow to the world economy, but held fire on retaliation.\n\nUS Treasury Secretary Scott Bessent warned in a CNN interview: “If you retaliate, that’s how you get escalation.” So far, most countries have followed that path, not wanting to push the button on a trade war. Morever, leaders who were already grappling with a US that has thumbed its nose at the United Nations and the World Health Organisation are now reassessing their own relationships with Washington and their role in a liberal world order that Trump has partially vacated. “We believe in international co-operation,” said Canadian Prime Minister Mark Carney, a transplant from the world of central banking who is also in an election campaign. “We believe in the free and open exchange of goods, services and ideas. If the United States no longer wants to lead, Canada will.” Trade economists are divided about where the rules-based order now stands. At the Brookings Institution on Thursday, Shaw said the WTO had been on life support for 25 years and was effectively a non-entity already.\n\nLovely said the WTO had serious problems but wasn’t yet dead. “The problem is it’s rudderless,” she said. “The US was the architect and essential partner. Now the US is removing itself, not officially but defacto.” Lovely argued that despite the US’s enormous market power, it was unlikely that countries would drastically restructure their economies to please it when there would be a new president in 3½ years. More likely, they would band together and bolster co-operative agreements that excluded the US, such as the Trans-Pacific Partnership of which Australia is a member. Trump withdrew from that agreement upon taking office in his first term, although the US had never formally ratified it in the first place. Loading Steven Hamilton, a former Australian treasury official, now assistant economics professor in Washington, said Trump’s tariffs on friendly nations such as Vietnam, Cambodia, South Korea and Japan were especially counter-productive.\n\n“Trump has driven his friends into the arms of his enemies at a time when you’re trying to peel them away from China,” he said. “Trump had taken US tariff rates back to the levels of the 19th century, and he’ll take the US economy back to the 19th century with him.” The war at home\n\nThere is also no guarantee Trump’s new world order will be dismantled by his successor, whether they are a Democrat or Republican. Joe Biden kept many of the tariffs Trump introduced in his first term, especially on China. And Democrats, slowly rebuilding from their defeat in November, are under increasing pressure to find answers for Americans’ economic dissatisfaction, even though the US economy has been performing well. Loading Trump’s contention that the world trade system screwed over the US found plenty of support on the campaign trail. As he reminded the crowd in the Rose Garden, he won all seven swing states, including the rust belt states of Michigan, Wisconsin and Pennsylvania, where car making and manufacturing has dwindled in the era of globalised commerce.\n\n“Never forget, every prediction our opponents made about trade for the last 30 years has been proven totally wrong,” Trump said. But now that he is in power, Trump must deliver results, including keeping a lid on inflation, another grievance on which he campaigned vigorously, and avoiding recession. Lutnick has said a recession would be “worth it” to restructure the US economy, while Trump plays it down but admits there could be bumps. The White House stresses the tariffs must be seen in context of the administration’s broader economic policies. Loading Economists are generally much more pessimistic. “This has to be one of the biggest unforced economic policy errors in US history,” said David Beckworth, a senior research fellow at George Mason University’s Mercatus Centre and a former US Treasury economist, in a post on X. Scott Lincicome from the Cato Institute, a libertarian think tank in Washington, said Trump’s tariffs would increase US import taxes to levels not seen since the Smoot-Hawley Tariff Act of 1930, “which incited a global trade war and deepened the Great Depression”.\n\n“Trump’s risible rhetoric about the economic power of tariffs is, like his trade strategy, detached from reality,” Lincicome said. “The only thing these tariffs will ‘liberate’ is money from Americans’ wallets.” There is also a cloud hanging over the legal mechanism Trump is using to impose these tariffs, which would typically be a matter for Congress. Instead, Trump invoked a national emergency on trade deficits – just as he called an emergency on fentanyl to justify earlier tariffs on Canada and Mexico. This week, four Senate Republicans voted with Democrats to back a measure that would rescind Trump’s emergency declaration for Canada – though it is unlikely to pass the House of Representatives. One of the Democrats, Senator Tim Kaine of Virginia, said it was likely they would pursue a similar bill to block the emergency declaration underpinning this week’s tariffs. The Democrats’ Senate leader Chuck Schumer said the tariffs were far worse than he predicted. “It was the largest tax hike on families since World War II,” he said. “Yesterday was not liberation day, it was tax day.” with Reuters",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/ange-postecoglou-took-on-tottenham-fans-and-lost-this-feels-like-the-end-20250404-p5lp5z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ange Postecoglou took on Tottenham fans and lost ... this feels like the end",
        "publish_date": "Fri, 04 Apr 2025 11:52:16 +1100",
        "category": "sports",
        "authors": [
            "Sam Dean",
            "Matt Law",
            "Rob Bagchi"
        ],
        "text": "This might prove to be the day the Ange Postecoglou dream died as the Tottenham Hotspur head coach took on his own supporters and lost.\n\nPostecoglou had clashed with Spurs fans in the past, most notably after the defeats at Bournemouth and Fulham, but this felt different. This felt like the end of what had started as a love affair.\n\nAnge Postecoglou’s Spurs have lost again. Credit: Getty Images\n\nEnzo Fernandez’s winning goal inflicted a 16th Premier League defeat on Tottenham and meant that Postecoglou became the first Spurs manager to lose all of his first four games against London rivals Chelsea.\n\nBut, incredibly, in this car crash of a league season for Spurs, that was not the worst of it for Postecoglou.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/pm-is-mobbed-by-huge-group-of-school-children-20250404-p5lp71.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "PM is mobbed by huge group of school children",
        "publish_date": "Fri, 04 Apr 2025 11:49:59 +1100",
        "category": "finance",
        "authors": [],
        "text": "PM is mobbed by huge group of school children\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/sydney-swans-afl-player-chad-warner-on-swysh-20250404-p5lp72.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney Swans AFL player Chad Warner on Swysh",
        "publish_date": "Fri, 04 Apr 2025 11:49:41 +1100",
        "category": "sports",
        "authors": [],
        "text": "Sydney Swans AFL player Chad Warner on Swysh\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/dogs-of-four-why-canterbury-are-undefeated-20250402-p5loim.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dogs of four: Why Canterbury are undefeated",
        "publish_date": "Fri, 04 Apr 2025 11:49:19 +1100",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "The Bulldogs NRL-best defence (14.5 points per game) is founded on a rushing line speed that isn’t exactly spelled out in statistics, but it was plain for all to see in last Saturday’s defeat of Cronulla. Champion Data pegs the Bulldogs’ pre-contact metres - the yardage covered by a ball-carrier before being met by a defender - at five metres per carry this season, sixth in the NRL. Anecdotally though, Canterbury’s aggression had former skipper Michael Ennis in raptures in commentary as the Sharks were slowly but surely smothered into a 20-6 upset on their home turf - the Bulldogs’ first Shire win in 11 years. A week earlier, Cronulla’s outside backs engineered two brilliant long-range tries against a ragged Rabbitohs defensive line - particularly on their kick chases. South Sydney’s disjointed kick chase against Cronulla. Credit: Rugby League Writers\n\nTaking note, Canterbury’s relentless line speed was matched whenever they chased kicks long and short. As noted by Rugby League Writers’ Jason Oliver, the Sharks spied the tell-tale triangles - the space created either side of a defender outside a uniform line - in a disjointed Rabbitohs kick chase in round three, and duly exploited them. The Bulldogs didn’t offer this to Cronulla’s Will Kennedy and his wingers. Combined with swarming line speed and a couple of Josh Curran charge downs - the ultimate effort play - the territory battle Cronulla won so emphatically against South Sydney was turned back on them.\n\nThe squad: the Bulldogs suddenly have depth Canterbury’s slow-burn under Ciraldo has been well-documented, so too the game plan that accentuates a fit, mobile side that is less concerned with missed tackles as scrambling to cover them.\n\nThe horrors of a 66-0 thrashing from Newcastle midway through Ciraldo’s first season at Belmore has been a regular reference point, and as instructive as any ahead of Sunday’s clash against the Knights. What Ciraldo described as a “dark day” saw Newcastle do whatever they pleased with a Bulldogs outfit missing a dozen first-graders after their reserve grade side also suffered a heavy loss. The 2023 season couldn’t end quick enough for Cameron Ciraldo’s Canterbury. Credit: Getty The lowest ebb of Canterbury’s rebuild made it painfully clear just how little depth the club’s roster had, and how far Ciraldo’s squad was from implementing his defence-focused game plan. The Bulldogs turnover since has been stark. Of the 17 Ciraldo named for his first game as Canterbury coach in 2023, just Jacob Kiraz, Matt Burton, Max King, Reed Mahoney, Viliame Kikau and Jacob Preston remain.\n\nLocal juniors like Bailey Hayward, Kiraz, Kurtis Morrin and Lipoi Hopoi are the first of what is hoped to be many. The recruitment blitz that yielded more utilities than a Monopoly board has delivered what Ciraldo craved - players willing to learn and above all compete, because an NRL utility is often honing the skills of a new position. And if there is a shortcoming somewhere in their game, out-enthusing an opposition is the surest way to compensate for it. Kurt Mann, Jaeman Salmon, Connor Tracey, Curran and Hayward all cover multiple positions while occupying an individual roster spot, and all bar Hayward have bought into Ciraldo’s uncompromising game plan after moving on from rival clubs.\n\nLoading Marquee recruits Stephen Crichton, Mahoney, Burton and Kikau have each played their instructional roles with lessons from Penrith and Parramatta (from what feels like a different Eels era now). The Bulldogs were without $800,000 stars Burton and Kikau against Cronulla, and will be again against Newcastle. Yet their left edge of Hayward, Jacob Preston and Bronson Xerri made that same channel an attacking focal point that dominated Cronulla - after claiming ascendancy with the bread-and-butter kick chase and defensive pressure. It’s all very Penrith. And while the Bulldogs are on top after only four rounds and the Panthers have won four-straight titles, Ciraldo has brought unmistakable elements of Penrith in both personnel and philosophy to Belmore, chiefly because he helped build the Panthers dynasty.\n\nPenrith, meanwhile, might just be starting to wobble with their shallowest playing stocks of the past five years. The talent raids of rival clubs - with Canterbury at the forefront - has AAP able to compile an entire top 30 roster of former Panthers now playing elsewhere in the game. Ciraldo leads a crack coaching staff too. Gould has detailed previously both his hesitations about taking on the Bulldogs rebuild and then bringing Ciraldo in to lead it. For the best part of a decade, excluding the Wests Tigers bin fire, this was the hardest job in rugby league. The great hope for rivals watching on is how the Bulldogs have been reborn; with a beautifully simple fix.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/car-makers-may-soon-withdraw-aussie-models-increase-prices-ahead-of-major-rule-change-000626855.html",
        "title": "Car makers may soon withdraw Aussie models, increase prices ahead of major rule change",
        "publish_date": "2025-04-04T00:06:26Z",
        "category": "finance",
        "authors": [],
        "text": "Ford, Isuzu, Mazda, Toyota and Great Wall Motors are just some of the manufacturers that could be impacted in a few months' time.\n\nAustralia's car industry is facing serious uncertainty as the NVES comes into effect from July. Source: Getty\n\nAustralia's automotive market is facing serious uncertainty in the coming months, ahead of the federal government’s New Vehicle Efficiency Standard (NVES) that comes into effect in July, requiring manufacturers to meet stricter emissions targets or face heavy fines.\n\nAnnounced last year, the NVES sets carbon emissions limits for new cars sold in the country, mandating that manufacturers meet fleet-wide targets or face harsh financial penalties. The NVES — introduced in January, 2025 but enforced from July — aims to encourage the sale of more fuel-efficient and electric vehicles.\n\nAlong with Russia, Australia was one of the last major countries without vehicle efficiency laws, which resulted in us becoming a \"dumping ground\" for the least efficient and most polluting cars.\n\nProfessor of Future Urban Mobility, Hussein Dia, told Yahoo the changes will eventually be positive, even if not immediately apparent. \"[It's] going to entice even European manufacturers,\" Dia said earlier. \"We're not going to be a dumping ground for polluting vehicles anymore, which is a good thing\", he added.\n\nADVERTISEMENT\n\nFrom July, popular and well-known models, such as the Ford Everest 4x2 and Isuzu M-UX 4x2, may be pulled from sale due to classification as passenger vehicles, which have tighter restrictions, compared to their \"commercial\" 4x4 variants.\n\nIsuzu, Mazda, and Great Wall Motors have informed dealerships they anticipate incurring fines from NVES and may increase prices as a result. Toyota and Mitsubishi, while supportive of the policy, acknowledged the upcoming challenges.\n\nThe NVES sets carbon emissions limits for new cars sold in the country, mandating that manufacturers meet fleet-wide targets or face harsh financial penalties. Source: Getty\n\nThe changes may also mean availability of the wildly popular Toyota LandCruiser may soon become more limited, though Toyota assured the ABC it will maintain the supply of the \"tool of trade\" vehicle. It acknowledged the new targets are \"very challenging\" and said the company was still working through how to manage them.\n\nCocktail of uncertain conditions spells trouble for auto industry\n\nAt the same time, electric vehicle (EV) uptake remains slower than the government’s targets, raising questions about whether the market is ready to adapt to the NVES shift. While the year started with sluggish EV sales, recent figures suggest a modest rebound.\n\nADVERTISEMENT\n\nThe latest data from the Federal Chamber of Automotive Industries (FCAI) and Electric Vehicle Council (EVC) showed that 8,385 battery electric vehicles were sold in Australia in March, making up 7.5 per cent of total new car sales for the month.\n\nHowever, this is still lower than March, 2024 when 10,464 EVs were sold, accounting for 9.5 per cent of the market. The decline has been attributed to weaker sales of Tesla's Model Y and Model 3, impacted by consumer sentiment surrounding Elon Musk's involvement in US politics and anticipation of a new Model Y release. Adding to the turmoil, Donald Trump’s new tariffs on foreign automobiles and potential scrapping of EV subsidies in the US have created global market instability, leading some brands to reconsider their EV commitments.\n\nCoalition vows to remove NVES penalties for car makers\n\nThe Coalition has proposed removing NVES penalties if elected, arguing it would ease cost-of-living pressures. However, industry experts warn that without fines, Australia could once again become a dumping ground for high-emission vehicles, and brands might limit EV supply.\n\nADVERTISEMENT\n\nLimiting the supply of electric vehicles (EVs) could have significant negative consequences. It would slow down Australia's transition to cleaner, more sustainable transportation, hindering efforts to reduce greenhouse gas emissions. As global demand for EVs increases, restricting supply could also prevent manufacturers from capitalising on a growing market, which may hurt the local automotive industry’s potential for growth and innovation.\n\nForecasts suggest manufacturers could rack up $2.8 billion in NVES fines by 2029, and over 60 new EV models are soon expected to enter the Australian market, with sub-$60,000 options increasing significantly. Some stakeholders within the automotive industry are advocating for a 24-month grace period before the enforcement of fines.\n\nThis proposed delay would allow manufacturers more time to adjust to the stricter emissions targets and prepare their fleets for compliance, but on the other hand, it may also prolong the reliance on high-emission vehicles in the market, delaying the overall shift toward greener alternatives.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]