[
  {
    "url": "https://www.9news.com.au/national/optus-triple-zero-outage-senate-inquiry-stephen-rue/542c15b4-fd40-4a19-8bb6-95d46984299b",
    "title": "'Mistakes made': Optus bosses admit failures in fatal triple-zero outage",
    "publish_date": "Mon, 03 Nov 2025 00:35:53 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "The chairman and CEO of embattled telco Optus have been grilled at a Senate inquiry into the catastrophic triple-zero failure that left three people dead.\n\nHuman error during a firewall upgrade in September led to an outage in multiple states and territories, which led to customers being unable to call the emergency line.\n\nSpeaking at a Senate inquiry today, Optus CEO Stephen Rue admitted the mistakes made by the telco during and immediately after the outage.\n\nStephen Rue admitted \"there were mistakes made\" by the company during and after the outage. (Alex Ellinghausen)\n\n\"There is no doubt that the timeline shows there were delays, there were mistakes made,\" he said.\n\n\"The tragic deaths of people during this outage stay with us as individuals and as a company as we investigate the incident.\n\n\"I fully accept there are aspects to the way events unfolded and how they were communicated over September 18 and 19 that we should have handled better.\"\n\nRue said correct steps and procedures were not followed after the company became aware of the outage and admitted that despite the offshore call centre believing the network hadn't failed, the issue should have been escalated.\n\n\"This was a unique situation whereby the call centre people believed the network was not failing, but they should have escalated those calls,\" Rue said.\n\n\"The initial mistake, a human error, occurred when the wrong process plan was selected for a routine firewall upgrade.\n\n\"The selected plan did not divert traffic before locking equipment inside the exchange that routes triple-zero calls.\n\n\"This error was not detected because control steps were not followed and alarms were not acted on at the time.\"\n\nREAD MORE: ﻿ Former prince Andrew to lose final military title\n\nOptus CEO Stephen Rue speaks to the media in the days after the outage. The company has been criticised for being slow to report how many people were impacted by the outage. (Sitthixay Ditthavong)\n\nRue insisted this was \"an explanation, not an excuse\".\n\nHe also insisted the company had not been misleading in its delay in confirming how many calls were impacted in the outage.\n\n\"I wouldn't characterise it as misleading, it was information as we knew it at the time,\" he said.\n\n\"Sadly, it turned out to be different, we accept that.\"\n\nREAD MORE: ﻿ Shock CCTV shows moment man is snatched off the street in Sydney\n\nThe outage is one of many high-profile incidents to hit the company in recent years. (Getty)\n\nThe fallout has been disastrous for Optus, with the triple-zero failure the latest in a long line of incidents and issues at the company over the last three years.\n\nRue, who came into the company in 2023 after previous CEO Kelly Rosmarin resigned in the wake of a nationwide outage, is also under increased pressure to keep his job.\n\nTwo Optus executives have already announced their departure,﻿ but Rue received an endorsement from Optus chairman John Arthur.\n\n\"There were I think 10 failures here, 10 failures. And if you're asking me whether I am alarmed at that, I can assure you I am,\" he said.\n\n\"However, this man was brought into this company to make sure we became a company that didn't have 10 failures like that.\n\n\"Now that's his job, and I'm expecting him to finish it.\"\n\nREAD MORE: ﻿ The concerning factor believed to be behind surging house prices\n\nOptus chairman John Arthur insisted Stephen Rue was the right man for the role of CEO. (Alex Ellinghausen)\n\nRue said it was not the right time for him to step away from the company.\n\n\"I firmly believe that another change of leader at this time is not what Optus needs, or what our customers need,\" he said.\n\nOptus has been criticised for having critical infrastructure and call centres located offshore, and Rue said the company had made changes as a result of the triple-zero failure.\n\n\"We will take back calls that relate to triple-zero calls and relate to vulnerable customers… and ensure that they are dealt with onshore in Australia. And we're in the process of doing exactly that,\" he said.\n\n\"Our contact centre procedures have been overhauled, including a mandatory escalation process for any customer reports of triple-zero issues.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/finance/family-financial-help-heating-up-housing-market-finder-survey/ef0be735-9f2d-4a88-a7b0-31c7b642a38f",
    "title": "The concerning factor believed to be behind surging house prices",
    "publish_date": "Sun, 02 Nov 2025 21:30:12 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "A﻿head of tomorrow's interest rates decision by the Reserve Bank of Australia, the impact of the bank of mum and dad on home prices continues to stir debate.\n\nThe cash rate is hotly tipped to remain on hold at 3.60 per cent when the RBA hands down its decision at 2.30pm tomorrow, leaving hard-pressed mortgage holders disappointed.\n\nThe forecast was supported by a survey of economic experts by comparison site Finder that found 30 from 35 expected no change.\n\nMore first home buyers are relying on family financial help to get on the housing ladder. (Photo: Dion Georgopoulos / Australian Financial Review) (Dion Georgopoulos / Australian Financial Review)\n\nBut economists and analysts showed far less unity when quizzed about the effects of parents giving their children financial support to gain a foothold in the housing market.\n\nNew Finder research – based on a survey of 1006 first-home buyers – revealed 17 per cent relied on the financial help of parents or family to save their deposit, up from 11 in 2022.\n\nThat's the equivalent of almost 20,000 first home buyers a year who were lucky enough to receive financial help from their parents.\n\nFinder head of consumer research Graham Cooke said without it, property ownership would be out of reach for many young people.\n\n\"Those who can lean on mum and dad are typically entering the market not just sooner, but in a much stronger position,\" he said.\n\nBut while it's giving some lucky few a leg up, ﻿nearly one in three experts canvassed by Finder believe it is also distorting the housing market.\n\nAmong them are Michael Yardney, from Metropole Property Strategists, who thinks a twin-track housing market is evolving.\n\n\"This is creating a two-tier market of the haves and have-nots, families with property equity already and others,\" he said.\n\nOn the other hand, Tim Reardon from the Housing Industry Association said family support is a natural part of a well functioning market.\n\n\"[Parents] are not a distortion, they are correcting the market distortion created by the severe lending restrictions imposed on first home buyers,\" he said.\n\nThere was also concern about the impact of the government's First Home Guarantee Scheme, which will allow ﻿all first home buyers to purchase a home with only a 5 per cent deposit instead of the usual 20 per cent.\n\nFrom the 26 experts canvassed, 65 per cent think it will encourage first home buyers to take on more debt than they should.﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/leeuwin-damage-atsb-report-released-fremantle-port/105964856",
    "title": "Breaking: Communication breakdown led to iconic ship's damage in Fremantle harbour",
    "publish_date": "Mon, 03 Nov 2025 01:30:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "A lack of effective communication contributed to a collision between the sail training ship Leeuwin II and a container ship in Fremantle Harbour last year that injured two crew members, a new report has found.\n\nThe investigation by the Australian Transport Safety Bureau (ATSB) found one of the harbour pilots helping navigate the 333-metre long Maersk Shekou into the port failed to issue a crucial instruction as the giant vessel battled through rough seas and stormy weather, escorted by four tugboats.\n\nLoading...\n\nA secondary pilot, who was meant to be monitoring the ship's arrival, was distracted by taking a non-essential phone call.\n\nThe container ship, which was laden with more than 4,000 shipping containers, struck the Leeuwin, which was berthed at the quay, causing the wooden vessel's masts to collapse.\n\nThe two crew members on the Leeuwin sustained minor injuries trying to flee the ship via the gangway as the collision occurred.\n\nThe Leeuwin was struck by a container ship. (Supplied: Roel Loopers )\n\nMeanwhile, the Maersk Shekou's stern struck the roof of the nearby WA Maritime Museum, damaging the facade.\n\nThe report found crew on the container ship's bridge \"failed to adequately monitor, or challenge, the ship's turn and position in the channel\".\n\nLoading",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/eli-katoa-undergoes-surgery-after-head-knocks/105964618",
    "title": "Storm star undergoes surgery after multiple head knocks in Tonga clash",
    "publish_date": "Mon, 03 Nov 2025 00:38:25 +0000",
    "category": "sports",
    "authors": [],
    "text": "Melbourne Storm forward Eli Katoa suffered \"seizure activity\" and underwent surgery overnight after a series of head clashes in Tonga's match with New Zealand on Sunday.\n\nKatoa was allowed to play in the Pacific Championship Test despite copping a heavy knock from teammate Lehi Hopoate in the pre-game warm-up.\n\nHe then copped another high hit in the first half and passed a HIA test, before again being hit in the head in the second half.\n\nIn concerning scenes, Katoa was pictured on the sidelines receiving oxygen from medical staff while laid out on a stretcher.\n\nOfficials later confirmed he had suffered a brain bleed.\n\nThe Storm said it was in touch with Tonga's Chief Medical Officer after concerns were raised about how Katoa had been allowed to play after the pre-game collision.\n\n\"Melbourne Storm forward Eli Katoa was taken to hospital after suffering seizure activity on the bench during the second half of yesterday's Pacific Championships match between Tonga and New Zealand,\" a Storm statement read on Monday morning.\n\n\"Eli underwent surgery overnight and is in a stable condition being supported by his partner and mother. Storm medical staff remain in close contact with the hospital and Tonga's team Chief Medical Officer.\n\n\"The club will provide a further update as additional information becomes available.\"\n\nKatoa posted an image to Instagram on Monday morning from his hospital bed, thanking everyone for their concern.\n\n\"Appreciate everyone for checking in,\" he wrote.\n\n\"Sorry I haven't got back to any of you guys but I really appreciate all the love.\"\n\nTonga coach Kristian Woolf said after Sunday's game that the doctors had been confident Katoa was fine following the pre-match collision with Hopoate.\n\n\"We have two very experienced doctors there, they have done the usual HIA. He has passed all that and passed it well,\" Woolf said.\n\n\"My job is not to question doctors.\n\n\"They were both comfortable with that and comfortable with him coming back on to the field.\n\n\"Unfortunately he copped a second hit that was quite heavy, and there has been a bit of a poor result on the back of that.\"\n\nABC/AAP",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/melbourne-cup-time-how-to-watch-weather-forecast/105964240",
    "title": "What time is the Melbourne Cup? How to watch and the weather forecast",
    "publish_date": "Mon, 03 Nov 2025 00:37:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "Rain in Melbourne is set to play a factor in Australia's most famous horse race, with Flemington Racecourse predicted to be rated a Soft 7 or Heavy 8 for Tuesday's Melbourne Cup.\n\nMeanwhile, the pre-race favourite is attempting to complete a special feat in Australian racing while its jockey is hoping to be the second female to ever win the Melbourne Cup.\n\nFrom start time to weather forecast, below are some key things to know before the 2025 Melbourne Cup.\n\nWhat time is the Melbourne Cup?\n\nMelbourne Cup Day is held on the first Tuesday of November, which is November 4 this year.\n\nThe Melbourne Cup will be the seventh race of 10 at Flemington Racecourse.\n\nHere are the start times for the Melbourne Cup in each state and territory, including New Zealand.\n\n3pm AEDT: Victoria, NSW, Tasmania, ACT\n\n2:30pm ACDT: South Australia\n\n2pm AEST: Queensland\n\n1:30pm ACST: Northern Territory\n\n12pm AWST: Western Australia\n\n5pm NZDT: New Zealand\n\nWhat is the weather forecast for the Melbourne Cup?\n\nThere is plenty of rain expected to fall in the lead-up to Tuesday's Melbourne Cup.\n\nThe Bureau of Meteorology forecasted between 20-40 millimetres to fall in Melbourne on Monday, with up to another 10mm on Tuesday.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nThe amount of rain set to fall in Melbourne will mean Flemington Racecourse will be wet and slow on Cup Day.\n\nFlemington is a track that can drain well, but the rain on Monday and Tuesday has track manager Liam O'Keeffe predicting the course will either be rated a Soft 7 or Heavy 8 for the Cup.\n\n\"I would think if we get 20-40mm [on Monday] we would be on a heavy track at the end of that rainfall,\" O'Keeffe told Racing.com on Sunday.\n\n\"If we don't get any rain on the day [Tuesday], I would be confident we would get back into the soft range.\n\n\"But if we just get continuous showers throughout the day, which is forecast, it won't get a chance to improve.\"\n\nHow to watch and follow the Melbourne Cup\n\nThe Nine Network has the television rights to broadcast the 2025 Melbourne Cup.\n\nAll 10 races at Flemington will be broadcast on Channel Nine, and streamed on Nine Now.\n\nABC Sport will have live digital coverage of Melbourne Cup day with a live blog. You can also listen to the live call of the Melbourne Cup on the radio, online, or via the ABC Listen app.\n\nWho is the favourite to win the Melbourne Cup?\n\nThere will be a field of 24 for the Melbourne Cup.\n\nThe favourite to win the Cup is number 14, Half Yours.\n\nHalf Yours is trained by Tony and Calvin McEvoy, and will be ridden by jockey Jamie Melham.\n\nHalf Yours won the Caulfield Cup last month and is attempting to become the 13th horse to win the Melbourne-Caulfield Cup double.\n\nMelham would be the second female jockey ever, after Michelle Payne in 2015, to win the Melbourne Cup.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/south-hedland-worker-accommodation-heads-to-final-stage-approval/105943730",
    "title": "Plan for 1,300-room worker accommodation in WA heads to final stage of approval",
    "publish_date": "Mon, 03 Nov 2025 00:34:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "A $500 million, 1,300-room accommodation project in South Hedland has been given the green light by the regional Development Assessment Panel (DAP), which had rejected the first application nearly a year ago.\n\nThe Parola Court development in WA's Pilbara region, which originally proposed workforce accommodation with 1,653 rooms in November last year, has since been amended significantly by the applicant, Pacific Partnerships.\n\nAmid housing and short-term accommodation shortages, the new plan flagged 24 of the 1,311 rooms for tourism accommodation.\n\nDevelopment 'could have negative impacts'\n\nManaging director at consultancy RFF Owen Hightower said the proposed development did not align with the town's planning principles.\n\n\"The town's planning framework and rules were designed to encourage these developments to happen within the planned town centre … to ensure the facility maximised external engagement with the community,\" Mr Hightower said.\n\nThe proposed development is 2.3 kilometres away from the town centre.\n\nPacific Partnerships says the development will support the growth of mining and energy industries in the area. (ABC News: Kimberley Putland)\n\nMr Hightower said shifting the project closer to the centre would \"deliver all the aspirations of the community\" in activating the town centre.\n\n\"Where it's ended up and been approved really limits the ability for that to occur at all,\" he said.\n\nMr Hightower said the community understood the need for workforce accommodation, but the development's social impact survey highlighted concerns.\n\n\"There was an overwhelming perception that this development would have negative impacts … there were references to the location being inadequate within those surveys,\" he said.\n\nPort and South Hedland face ongoing short-term accommodation shortages. (ABC News: Kimberley Putland)\n\nA 'wait and see' approach\n\nTown of Port Hedland Commissioners Jessica Shaw and Ron Yuryevich sat on the panel and voted to approve the development.\n\nMs Shaw disagrees with Mr Hightower.\n\n\"When we considered all the planning principles — which you're required to as a DAP member — we determined that it was consistent and that it would be a good development for the town,\" she told ABC Pilbara Kimberley Mornings.\n\n\"It's a significant investment into Port Hedland.\n\n\"It will alleviate a lot of those housing issues, both for temporary workers and for permanent housing and so, yes, we did support the project.\"\n\nRon Yuryevich (left) and Jessica Shaw (right) were on the Development Assessment Panel. (ABC News: Courtney Withers)\n\nWhile not a condition of approval, the proponent agreed to make a voluntary contribution of $2.5 million every 10 years to the Town of Port Hedland.\n\nMs Shaw said she and Mr Yuryevich argued for the contributions to be a condition of approval, but they were outvoted.\n\nThe estimated lifespan of the development is 40 years, valuing the deal at $10 million.\n\nHedland First National Real Estate general manager Scott Lowe said the benefit of the development might be to ease housing shortages in the town.\n\nScott Lowe says the development could be a \"net positive\" for the community. (ABC News: Rachel Pupazzoni)\n\n\"Our preference would always be to see investment into permanent residential accommodation,\" he said.\n\n\"This facility might actually support that, in that if some of the occupants currently housed in permanent housing moved into it, then it frees up some accommodation in town for families or permanent residents to move into town.\n\n\" It's a 'wait and see' approach I guess because it could be net positive. \"\n\nWater Corporation 'confident' it can work with developer\n\nPort Hedland's water supply constraint was raised by both Mr Hightower and Ms Shaw.\n\nThe applicant said Water Corporation had not flagged any issues with supply.\n\nA Water Corporation spokesperson told the ABC that it was waiting for further information since providing advice last year.\n\n\"Once this is received, we are confident of being able to work with the developer to support the proposal in a staged and orderly way,\" the spokesperson said.\n\nThe ABC understands the development plan is expected to go before the Town of Port Hedland for approval in the coming months.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/new-york-marathon-photo-finish-benson-kipruto-eliud-kipchoge/105964270",
    "title": "New York Marathon won by 0.2 seconds after classic sprint",
    "publish_date": "Sun, 02 Nov 2025 23:56:35 +0000",
    "category": "sports",
    "authors": [],
    "text": "Benson Kipruto has survived a thrilling sprint finish to claim victory in the New York Marathon, winning with a time of 2 hours, 8 minutes and 9 seconds.\n\nKipruto ran flat out through the final 50 metres on Sunday, local time, to hold off a late fight from Alexander Mutiso, breaking the tape by less than two-tenths of a second in a photo finish.\n\nThe 2021 winner, Albert Korir, finished in third place in a time of 2:08:57.\n\n\"It was amazing. The last part was so hard,\" Kipruto said in a televised interview.\n\nThe crowd in Central Park were treated to a thrilling finish. (AP Photo: Yuki Iwamura)\n\n\"I was pushing so hard to make sure I win.\"\n\nIt was the fourth major title for Kipruto, who was in a two-man race with Mutiso at the 25-mile mark and appeared to be completely in control with 200 metres left.\n\nHe was forced to accelerate through the final straight, however, as Mutiso launched a gutsy late attack to wild cheers in Central Park.\n\nBenson Kipruto and Alexander Mutiso were able to hug it out after their brilliant sprint. (AP Photo: Angelina Katsanis)\n\nThe race was the second elite marathon to end in a sprint finish in recent months, with Alphonce Felix Simbu claiming gold at the World Athletics Championships by just 0.003 seconds from Amanal Petro in Tokyo.\n\nIt was a good day for Kenya, which swept both the men's and women's podiums, with Hellen Obiri winning the women's race in a course-record time of 2:19:51.\n\nParis bronze medallist Obiri, who won in 2023, was running shoulder-to-shoulder with runner-up Sharon Lokedi (2:20:07) and enjoyed a comfortable finish after pulling away ahead of the final turn to claim her fourth major title.\n\nLast year's winner, Sheila Chepkirui (2:20:24), was third.\n\n\"We had a very strong field,\" said Obiri, who pocketed an extra $US50,000 ($76,383) for breaking Margaret Okayo's 22-year-old course record of 2:22:31.\n\n\"[I told myself] let me try to do my best, let me push.\"\n\nHellen Obiri sprinted away in the closing stages to win comfortably. (AP Photo: Angelina Katsanis)\n\nIn the wheelchair division, Switzerland's Marcel Hug won a record-extending seventh title in the men's race in 1:30:16, while American Susannah Scaroni won the women's race in 1:42:10.\n\nKenyan two-time Olympic champion Eliud Kipchoge, the only man to break the 2-hour barrier in the marathon, finished 17th in 2:14:36.\n\nAmid rampant speculation that New York could be his final competitive marathon, the 40-year-old Kipchoge instead announced plans to embark on a two-year mission to run seven marathons across seven continents in his \"Eliud Kipchoge World Tour.\"\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nSpeaking to Olympics.com before the race, Kipchoge said he had plans to run \"for a purpose\", including racing in Antarctica.\n\n\"November, and it's New York … It's a place that has been on my mind for a long time. It's time for me to go there and get a Seven Star [award for finishing all seven major marathons] before embarking on my new journey of running for other things,\" he said.\n\nThe Seven Star award is given to runners who have completed the marathons in Tokyo, Boston, London, Sydney, Berlin, Chicago and New York City.\n\nSydney was named a major for the first time this year.\n\nThe five-borough classic capped the World Marathon Majors calendar for the year, after a doping suspension for the women's world record holder rocked competitive distance running.\n\nKenyan Ruth Chepngetich was banned for three years late last month after admitting to anti-doping rule violations.\n\nReuters/ABC",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/bluff-knoll-hiker-rescues-increase-stirling-range/105957436",
    "title": "More hikers getting stuck on popular trail as social media draws tourists",
    "publish_date": "Sun, 02 Nov 2025 23:32:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "A popular hiking trail in WA's Stirling Range National Park has seen a fourfold increase in the number of hikers being rescued so far this year, with rescuers saying a spike in visitors is the cause.\n\nThe Range, about 337 kilometres south-east of Perth, is a popular destination for hikers and tourists.\n\nOfficial figures show more than 50,000 people summit Bluff Knoll each year, but emergency services said there had been a steady rise in numbers, precipitating a spike in those needing a rescue.\n\nAt 1,099m, Bluff Knoll is southern WA's highest peak. (Supplied)\n\nRescues increase\n\nThe Department of Fire and Emergency Services (DFES) said rescue crews had been called to 12 incidents so far this year, up from the three for the same time last year.\n\nA total of four people were rescued in 2024.\n\nLast month, three people were airlifted or brought down by emergency services in three separate incidents.\n\nEarlier in the year, an injured rock climber who spent more than 24 hours on the side of the bluff was winched off the peak in a massive rescue operation.\n\nThis year, a man became stuck in a more isolated part of the bluff favoured by rock climbers. (ABC Great Southern: Andrew Chounding)\n\nDFES deputy commissioner operations Craig Waters said on average, 25 people from several emergency services were involved in each rescue.\n\nHe said the average rescue took up to eight hours, but complex conditions often meant some took longer.\n\n\"Severe weather can make rescues difficult, particularly on a summit like Bluff Knoll where volunteers need to hike the steep ascent with heavy equipment to get to injured or stranded people in the heat, wind or rain,\" he said.\n\n\"Aircraft, including the RAC Rescue helicopter, can be used to retrieve injured or stranded hikers but volatile weather means it cannot always safely carry out the rescue.\"\n\nMr Waters said the rescues were a reminder for hikers not to underestimate the state's more challenging tracks.\n\nGnowangerup and Albany State Emergency Services respond to rescues on the mountain. (Supplied: SES)\n\nMore people on the bluff\n\nGnowangerup SES manager Peter Blows, a regular first responder to the range, said the spike was due to more people visiting the national park.\n\n\"We just seem to be getting more and more calls down there, but I think that's to do with the number of people now that are discovering our lovely area,\" he said.\n\n\"Most people we've rescued or all of them have had all the gear … just if it gets too hot, they are down a little bit on water.\"\n\nAt work on the cliffs of Dyurrite/Mt Arapiles. (Supplied: SES)\n\nAustralia's peak body for bushwalking said the popularisation of wilderness hiking on social media had contributed to a rise in rescues across some of the country's top hiking trails.\n\n\"Bushwalking has become quite popular, especially in the social media groups where people get together casually and somebody says, 'Let's go to such and such an area' and then they turn up and shoot off for a walk,\" said Bushwalking Australia president Jeff McDonell.\n\n\"That's an issue for us because often the leaders aren't trained, and they may not have the navigation skills, and people are getting lost.\n\n\"Unfortunately, [rescues] have increased because of that.\"\n\nJeff McDonell says inexperience and lack of preparation can contribute to emergencies. (Supplied)\n\nInexperience to blame\n\nMr McDonell said while even experienced hikers could have accidents, rescues were often due to inexperience and lack of preparation.\n\n\"Bushwalking clubs are very well organised, they have trained leaders, they have first aid, they stick to the rules … never walk alone, always walk with groups, take a personal locator beacon (PLB), and if the weather turns bad, turn back,\" he said.\n\n\"We've got an area, Lederderg Gorge, which is only about an hour from Melbourne, and the SES have had to do several rescues recently.\n\n\"They've rescued a group of 25 people who went for a day walk and got lost, didn't have any light and got lost in the dark.\"\n\nSome state parks now lend out personal locator beacons. (Supplied: SES)\n\nIn July, two hikers were rescued from the Larapinta Trail in the Northern Territory in one week, while last month in Tasmania, police found the body of a missing hiker in Mount Field National Park.\n\nMr McDonell said in NSW, hikers on Mt Kosciusko and in the Blue Mountains could borrow PLBs for the duration of their walks.\n\nHe said that initiative could be expanded more widely.\n\n\"I think there's a role for the national parks to take a more proactive role,\" he said.\n\n\"In NSW, parks are loaning out PLBs for free, and we were looking at that in Victoria.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/our-birth-our-voice-maternal-health-forum-mother-maternity/105962312",
    "title": "Ward crowding amplifies trauma for mothers whose babies 'gone too soon'",
    "publish_date": "Sun, 02 Nov 2025 23:01:43 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Amy Malan lost her first baby after reporting decreased fetal movements multiple times within three weeks to different medical professionals.\n\n\"I feel like that was her voice and her voice was taken away from me and she was trying to tell me she was ready to come,\" Ms Malan said.\n\n\"Those weeks were really vital in her care and if we saw the same person, perhaps something could have been done.\"\n\nMs Malan was one of several women who spoke at a recent forum in Darwin about the importance of seeing the same midwives or doctors, known as continuity of care.\n\nAmy Malan has become an advocate for continuity of care after losing her daughter Georgie. (ABC News: Felicity James)\n\nThe event was organised by local mothers who have formed the group Our Birth, Our Voice, to inform the NT and federal governments about gaps in the maternal health system.\n\nStaffing shortages at an under-resourced Royal Darwin Hospital and a lack of birthing options, including private obstetric care after the recent closure of Darwin's private maternity ward, were among the issues raised.\n\n\"The message to the government is that we're here to stay,\" organiser Sophia Scaturchio said.\n\n\"This is not going to be an issue that we pick up today and is gone tomorrow.\n\n\" I think the chorus of voices is getting louder and louder and louder. \"\n\nRoza Arkam-Lovasi holding her second baby, who was born earlier this year. (ABC News: Felicity James)\n\nOthers, including Roza Arkam-Lovasi, spoke about the need for a safe space for mothers and families to grieve at the hospital following the trauma of losing a baby.\n\n\"A space to be with their babies, gone too soon, and not surrounded by babies crying when theirs is silent, a space where a support person can stay for the entire duration of a hospital stay,\" Ms Arkam-Lovasi said.\n\n\"The heartbreak of losing a baby is immeasurable.\n\n\" The trauma of being on the maternity ward with live babies is trauma that will stay with me forever. \"\n\nMs Arkam-Lovasi said everyone deserved the same continuity of care she received through a private midwifery program, which ensured she had the same midwife throughout her pregnancy and traumatic birth.\n\nThe forum highlighted gaps in the NT's maternity care system, with advocates calling for more investment in health. (ABC News: Felicity James)\n\n\"Although we have endured life's greatest loss, I hope that my story can help others, to feel seen, to feel heard,\" Ms Arkam-Lovasi said.\n\n\"To spark conversations that lead to change for lost families and maternity continuity of care in Darwin.\"\n\nTessa Czislowski has spoken publicly several times about being left to labour for hours in a public tea room at the Royal Darwin Hospital because of a shortage of beds.\n\nLoading...\n\n\"I have obviously got Millie and she was born ultimately safely, some women aren't that lucky and it shouldn't be about luck,\" she said.\n\n\"The issues that we're hearing about at Royal Darwin Hospital have been there for a long time.\n\n\"It's come about as a chronic under resourcing over consecutive governments both at a territory and federal level.\"\n\nFamilies are calling for bipartisan support to properly fund maternal services at Royal Darwin Hospital. (ABC News: Felicity James)\n\nKarine Foulkes and her husband, who works with the Defence Department, said they would be leaving Darwin in less than two weeks to seek mental health support and birth options interstate.\n\nThe couple lost their daughter Frankie to a condition called spinal muscular atrophy type 1, after what Ms Foulkes described as an ongoing dismissal of symptoms after birth.\n\n\"I wasn't listened to on multiple occasions by doctors, by everyone, midwives, everyone, the whole system failed Frankie,\" Ms Foulkes said.\n\nShe also spoke about a lack of support for grieving mothers.\n\nKarine Foulkes is leaving Darwin for better maternity and mental health care options. (ABC News: Felicity James)\n\n\"I was locked up at the Royal Darwin Hospital under the Mental Health Act because I was grieving, wasn't given a space,\" she said.\n\n\" There was no support whatsoever for my grief. \"\n\nIf you or someone you know needs help: Red Nose (grief and loss 24/7 support) on 1300 308 307 Pregnancy, Birth and Baby (advice from maternal child health nurses) on 1800 882 436 PANDA (Perinatal Anxiety and Depression Australia) on 1300 726 306 Bears of Hope (infant loss support) on 1300 114 673\n\nRepresentatives from both levels of government and NT Health chief executive Chris Hosking attended the forum.\n\nMr Hosking said he found the stories at the forum \"harrowing\" to listen to and would be meeting with his team to discuss how the feedback could be integrated into models of care.\n\n\"Simply giving the territory the equivalent of the average of the other states and territories, would add $200 million dollars a year to the NT's operating budget and make an enormous difference to our ability to deliver healthcare,\" he said.\n\nHe said the Northern Territory health system had been underfunded for more than a decade.\n\nNT Health chief executive Chris Hosking said more federal funding was required to offer improved maternal services. (ABC News: Felicity James)\n\n\"The reality is the territory's going to need a new major tertiary hospital fairly soon, we've started our planning processes for that,\" Mr Hosking said.\n\n\"That's something that will only ever be achieved if we have strong support from the Commonwealth.\"\n\nFederal Member for Solomon Luke Gosling said the government was awaiting a proposal for additional health funding from the NT government after an initial request from NT Health Minister Steve Edgington.\n\nWomen across the NT are calling for improved access to maternity services. (ABC News: Felicity James)\n\n\"I understand [federal Health Minister Mark] Butler has responded to Minister Edgington’s initial request advising that our government would be more likely to consider a detailed proposal in line with funding commitments made to NSW and Tasmania in response to withdrawal of maternity services in those jurisdictions,\" he said in the statement.\n\n\"Mr Butler is waiting on that proposal.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/wsl-sam-kerr-scores-for-chelsea-as-ellie-carpenter-stars/105964142",
    "title": "Kerr scores for Chelsea as manager says Matildas star is gaining confidence",
    "publish_date": "Sun, 02 Nov 2025 22:44:31 +0000",
    "category": "sports",
    "authors": [],
    "text": "Sam Kerr is back among the goals — and Chelsea boss Sonia Bompastor believes her typical quality finish in the Women's Super League was just the boost of confidence the great striker needs on the comeback trail.\n\nThe Matildas captain has had a lean time in front of goal since her return in mid-September. She had netted on her return from injury against Aston Villa but then failed to score in eight games for club and country while mainly getting late cameo appearances off the bench.\n\nThat super-sub role remained on Sunday morning (AEST) when Kerr was brought on at Stamford Bridge for the last quarter of an hour against London City Lionesses, replacing fellow Matilda Ellie Carpenter, who had earlier scored her first goal for the club to put them ahead.\n\nKerr had a bright spell of nearly 20 minutes but again without a goal until the 94th, when the ball fell kindly to her off a defender and, quick as flash, she directed a superbly controlled chip from an unpromising angle over the retreating goalkeeper to seal the 2-0 win.\n\nHer first goal at Stamford Bridge in nearly two years thrilled Kerr but perhaps enthused the club's French manager equally.\n\n\"I'm really pleased for Sam, she's been building up her minutes,\" Bompastor said.\n\n\"She was able to play more minutes with the national team, and she's getting back to a good level.\n\n\"She came in and made an impact on the game. She got a crucial goal for the team and her goal meant the game was over, even if it was in added time.\n\n\"It was nice for her, for her confidence and also for the team. Hopefully, we'll see Sam taking even more steps to get closer to her best level.\"\n\nIt was a big afternoon for Carpenter, too, who not only scored her first goal since her move from French giants Lyonnes but also thrived as the player of the match in a new wing-back rather than full-back role.\n\nThe change of shape meant their other right-back, Lucy Bronze, worked behind Carpenter, and the pair teamed up seamlessly to provide more of a threat down the flank, with the Aussie scoring after just 5 minutes.\n\n\"It was good. Both of them had good performances. I think they made a big impact on the game,\" Bompastor said of Carpenter and star England international Bronze.\n\n\"Ellie also had a really good performance. She was able to score a really important and early goal in the game.\"\n\nChampions Chelsea are one point clear of Manchester City, while Manchester United also kept close, just a further point behind after they won 3-2 at Dario Vidosic's Brighton on Sunday.\n\nElisabeth Terland fired United ahead and Jess Park made it two after the break, but the Seagulls threatened a comeback when Fran Kirby struck.\n\nPark then provided the assist for Lisa Naalsund in the 89th minute and United held on after Kiko Seike scored in stoppage time as Brighton, now seventh, slipped to a third straight defeat.\n\nTottenham are fourth after beating struggling Liverpool 2-1 with a Beth England winner, while Matildas Caitlin Foord and Steph Catley both impressed in Arsenal's 4-1 win at Leicester, where Stina Blackstenius scored twice.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/tennis-kimberly-birrell-loses-chennai-open-final/105963952",
    "title": "Aussie Birrell loses Chennai Open final but earns award for sporting gesture",
    "publish_date": "Sun, 02 Nov 2025 22:16:55 +0000",
    "category": "sports",
    "authors": [],
    "text": "A weary Kimberly Birrell has missed out on winning her maiden WTA title after losing the Chennai Open final — but the Australian earned the consolation of a special sportsmanship award for her selfless behaviour at the Indian tournament.\n\nGold Coast player Birrell was defeated 6-4, 6-3 by rising Indonesian player Janice Tjen in the final — a bitter disappointment as it was her second defeat in a championship match in Asia after also losing the Osaka final last year.\n\nBut seventh seed Birrell clearly was not at her sharpest after battling through an exhausting semifinal 24 hours earlier against Taiwan's Joanna Garland, in which the courageous Australian battled back from 5-0 down in the final set and saved five match points on the way to victory in 3 hours, 24 minutes.\n\nStill, it was not just Birrell's never-say-die performance in the longest match of her career that caught the admiration of organisers so much as her admirable concern for beaten opponent Garland, who struggled with the effects of cramp and injury when on the verge of victory.\n\nAt one point, slumping with illness at the back of the court, Garland needed medical treatment, leaving the Aussie showing concern for her condition.\n\nThen, once Birrell finally prevailed, she was more interested in hugging and consoling her vanquished opponent than revelling in one of the key breakthrough moments in her career.\n\n\"She's a great player and a great person too — we have a friendship off the court and you have to put that aside,\" Birrell said of Garland.\n\n\"When your opponent and a friend is struggling like that, it's really hard to concentrate and to focus. That was not fun at all, the last few games.\"\n\nUltimately, Birrell ended in tears herself, after then being presented with the tournament's Margaret Amritraj Fairplay Award for her display of sportsmanship.\n\nThe award is named in honour of the mother of Indian tennis great Vijay Amritraj, who told Birrell: \"This is named after my mum for fair play, and I thought this match was truly one of those matches.\"\n\nThe final, though, again proved too much for the 27-year-old Birrell as she went down to fourth seed Tjen, getting her serve broken five times in all during the 2-hour duel.\n\nThe disappointment for world number 117 Birrell was tempered by how her run to the final would take her back into the world's top 100 this week at number 94.\n\nThe top Australian woman in the rankings back at the start of the year, she had dropped to number five, but will rise one place after her big week.\n\nMeanwhile, in the Hong Kong Open final, young Canadian star Victoria Mboko managed to achieve what had just eluded another rising teen, Australian Maya Joint, in the semifinal as she overcame Spain's Cristina Bucsa for a 7-5, 6-7 (9-11), 6-2 triumph.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/health-funding-budget-challenges-tasmania-eric-abetz/105962530",
    "title": "Fears for health funding ahead of Tasmania's state budget this week",
    "publish_date": "Sun, 02 Nov 2025 21:50:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "With an interim state budget to be handed down on Thursday, a peak health body fears Tasmania's public health system won't receive enough support to address ballooning demand.\n\nGovernment policies to rein in spending — such as staff vacancy controls and efficiency measures — are already affecting service delivery, according to the Australian Medical Association (AMA).\n\nAMA Tasmania president Dr Michael Lumsden-Steel said staff were \"delaying decisions about anything that might cost money\".\n\nDr Michael Lumsden-Steel says long-term solutions are needed. (ABC News: Kate Nickels)\n\nWhile Dr Lumsden-Steel said this budget was \"critical\" for health, he had little hope of it having anything other than short-term supports — or it may even introduce cuts — after Treasurer Eric Abetz foreshadowed a focus on reducing spending.\n\nDr Lumsden-Steel said funding problems were not unique to Tasmania's health system.\n\n\"We've got each state with massive budget problems, we're seeing each state having massive health budget and healthcare delivery problems,\" he said.\n\n\"We can't do it with the resources we've got at the moment.\"\n\nThe AMA says a \"command and control structure\" is running health care in Tasmania. (ABC News: Luke Bowden)\n\nHealth budget blows out by $400m\n\nTreasury's Preliminary Outcomes Report in August showed a net operating balance of $1.2 billion in the 2024-25 financial year, with net debt reaching $5.04 billion.\n\nThe main blowouts have been in the Health Department, with a $400 million overspend largely on staff, including locums.\n\nMr Abetz said the report showed improvements \"while continuing to face fiscal challenges\".\n\n\"A comprehensive program of works, including with the Efficiency and Productivity Unit, will support our responsible, considered and measured management of every single taxpayer dollar,\" Mr Abetz said when releasing the report.\n\nTreasury's Pre-election Financial Outlook, released in June, warned that Tasmania's debt was headed for $13 billion by 2027-28, and called for \"immediate and sustained\" corrective action.\n\nSarah Lovell says the government needs to \"spend their money better\". (ABC News: Owain Stia James)\n\nLabor's health spokesperson, Sarah Lovell, said the government needed to look at the best way to spend the health budget.\n\n\"It doesn't mean they need to necessarily spend more in health, but they need to spend their money better. We need to be delivering better outcomes,\" Ms Lovell said.\n\nDr Lumsden-Steel said he wanted to see long-term solutions and a more strategic budget that considered hospitals' demand.\n\n\"When the health department gets a budget, that budget is not based on what the health department needs, it's purely based on what the government can afford,\" Dr Lumsden-Steel said.\n\n\"What we're seeing at the moment is a command and control structure that is running health care.\n\n\" We're seeing [government] departments running hospitals, not hospitals running hospitals with the support of [government] departments. \"\n\nHealth minister says more federal funding needed\n\nThree months into her role as health minister, Bridget Archer is under pressure to address long ambulance wait times and a growing elective surgery waitlist, which is currently at 9,275 — a 14 per cent increase in the past 12 months.\n\nLoading...\n\nA wage dispute with public sector unions, including the Health and Community Services Union, is also heating up.\n\nAsked on ABC Radio Hobart about potential cuts to health services, Ms Archer said the public sector generally had grown significantly since the COVID-19 pandemic.\n\n\"What we'd be looking to do is to look to what some of those [public service] settings looked like before the pandemic,\" she said.\n\n\"But, certainly, there will be no impact on those frontline services that Tasmanians need.\"\n\nIn relation to health funding, Ms Archer has called on the federal government to do more, saying Tasmania would be more than $670 million worse off under a proposed public hospital agreement with the states.\n\n\"The federal government is asking Tasmania, and asking all of the states, to reduce their health demand, but they are not providing us with the resources that we need, or the tools that we need, to reduce the demand in the first place,\" Ms Archer said.\n\nThe federal government, which has recently brought in bulk-billing incentives, said it was already providing the state government more than enough.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/wa-government-takes-fight-for-gst-deal-to-canberra/105962830",
    "title": "WA premier, treasurer head east as fight for WA's GST share heats up",
    "publish_date": "Sun, 02 Nov 2025 21:42:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "The state government has defended spending $1 million on an advertising campaign about Western Australia’s GST deal, as the fight to protect the state’s carve-up of the distribution ramps up.\n\nIt comes as Premier Roger Cook and Treasurer Rita Saffioti prepare to meet with Prime Minister Anthony Albanese in Canberra on Monday, with the GST deal and looming federal environment law reforms expected to be on the list of discussion points.\n\nThe campaign, called \"WA's GST is working for Australia\", will launch later this week, with advertisements set to run in eastern states newspapers, on billboards in Canberra, on radio and online.\n\nThe state government has spent $1 million on an advertising campaign about WA's GST deal. (Supplied)\n\n\"This is a real fight to make sure that WA keeps the deal that was struck in 2018,\" Ms Saffioti said on Sunday, ahead of her trip to Canberra.\n\n\"I would say every time we've been to the other states … it's constantly thrown in our face, the GST deal, and [by] economic commentators … it's now got to the public over east.\n\n\"So we have a job to inform people that a good GST deal for WA is good for the nation.\n\n\"We need to make sure that they understand that tearing up or changing the GST deal to penalise WA would impact national economic growth and national jobs.\"\n\nCash splash 'worth it': Treasurer\n\nReforms to the GST distribution by the Morrison government in 2018 mean WA keeps at least 75 cents for every dollar of GST revenue.\n\nWA GST deal under review Western Australia's GST deal, expected to cost the Commonwealth $60 billion by 2029, will form part of a review by the Australian Productivity Commission.\n\nIn September, Federal Treasurer Jim Chalmers released the terms of reference for the Australian Productivity Commission's review into those reforms, a review mandated by law.\n\nIn response, Ms Saffioti established a GST \"fairness fighter\" team within the Department of Treasury to lead the State's response to the review.\n\nAccording to the government and the WA Chamber of Commerce and Industry, without the 2018 deal, WA would receive 18 per cent of its population share for 2025-26, which they calculated as $6 billion less.\n\nMs Saffioti says WA would be worse off without the 2018 GST deal. (ABC News: Courtney Withers)\n\n\"This is a fight worth $6.5 billion this year,\" Ms Saffioti said on Sunday.\n\n\" So we believe spending $1 million to educate over in the eastern states is worth it because we're trying to prevent $6.5 billion being ripped off WA. \"\n\nPoint of contention\n\nThe GST deal has been a point of contention between states and territories since they were changed in 2018.\n\nPrime Minister Anthony Albanese as good as promised WA's deal would not change during the election campaign, going as far as signing that statement on a reporters arm.\n\nBut the review has stoked new fears the deal is at risk.\n\nPrime Minister Anthony Albanese wrote and signed No Change To WA GST on a reporters arm during the federal election campaign. (AAP: Richard Wainwright)\n\n\"While Anthony Albanese and the Federal Government have backed WA and the current GST deal, we know east coast states are trying to tear down the GST floor and reduce WA's GST share even further,\" a \"GST Fact Sheet\" provided by the WA government as part of the advertising campaign stated.\n\n\"It's just not fair and Western Australia can't sit on the sidelines.\"\n\nPart of the government's argument is that the current GST share received by WA is invested into economic infrastructure that drives the nation's economy.\n\nThe GST deal has been a point of contention between states and territories since the rules were changed in 2018. (ABC News: Sharon Gordon)\n\n\"Without this GST deal that was struck in 2018 we wouldn't be in a position to support economic growth, to build the roads, to build the ports, to make sure we get the energy and water infrastructure to support new projects,\" Ms Saffioti said on Sunday.\n\n\"That GST deal is fundamental to WA's economic growth and national economic growth.\n\n\"Even with the GST deal we are contributing $2.5 billion to other states … and that's just in GST.\n\n\"They [people outside of WA] all think that somehow, they're not getting anything out of WA.\"\n\nEnvironmental reforms on the agenda\n\nMr Cook and Ms Saffioti also plan to meet with Federal Environment Minister Murray Watt to discuss once-in-a-generation reforms to Australia's environment laws, introduced to parliament last week.\n\nMurray Watt will meet with Roger Cook and Rita Saffioti in Canberra this week. (ABC News: Matt Roberts)\n\nMs Saffioti said they would be looking to ensure \"industry continues to be involved\".\n\n\"It's making sure there's clarity … it's like all legislation, so you got the concept and then you've got the details and making sure that the details don't have any undesired consequences or consequences that couldn't be predicted,\" she said.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/queensland-weather-forecast-seq-wet-and-cool-in-west/105962724",
    "title": "Possible storms and showers forecast for south-east Queensland as weather cools",
    "publish_date": "Sun, 02 Nov 2025 21:41:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Evening showers and a possible storm are forecast for south-east Queensland after a weekend of wild weather, while the state's west will be significantly cooler than average.\n\nWeather bureau senior meteorologist Angus Hines said inland areas between Brisbane and the Capricornia region still faced the chance of a few late showers or an isolated storm on Monday after a partly cloudy day.\n\n\"If you're right down at the coastline, the risk of rainfall looks pretty slim,\" he said.\n\nThe outlook is \"a wholesale change in conditions\" from the severe thunderstorms that threatened the state on Saturday.\n\n\"On Monday across the east coast, generally bright weather and lots of sunshine,\" Mr Hines said.\n\n\"The large and giant hailstones that we've seen — we're unlikely to see a repeat of that.\n\n\"The high-end severe weather is not likely to be replicated.\n\n\"It's big changes in the atmosphere across Queensland, not just at the surface level but even higher up in the atmosphere.\"\n\nSome residents from the Scenic Rim and Gold Coast received hail overnight. (Supplied: Carmel Barnfield)\n\nResidents in Tamborine Mountain, as well as in northern Gold Coast suburbs including Pacific Pines and Maudsland, received hailstones up to 5 centimetres in diameter overnight.\n\nCooler in the west as rain arrives\n\nMr Hines said temperatures across western parts of the state could be up to 12 degrees Celsius below average on Monday.\n\n\"We are going to see a band of rain and a change to much cooler temperatures move into western parts of the state,\" he said.\n\n\"That's going to mean some spots in the low or mid 20s.\n\n\"Typically at this time of year [it's] around 35 to 38 degrees out in the far west.\n\nTwo dogs cool off in a creek in Rockhampton. (ABC Capricornia: Aaron Kelly)\n\n\"We're looking at fairly extensive wet weather from the far south-west around Birdsville and channel country up to the north-west.\n\n\"Probably not particularly heavy rain for most of these areas, just light to moderate falls, but fairly extensive wet weather with a lot of places getting at least a small drop of rain.\"\n\nCoastal showers on Tuesday\n\nThe bureau predicts the band of wet weather will push towards the coast on Tuesday.\n\n\"Most people won't get that much, they're not huge rainfall totals,\" Mr Hines said.\n\nSkies were beginning to clear at Maroochydore this morning. (ABC Sunshine Coast: Josh Dye)\n\n\"The temperature change won't be as dramatic … but a few degrees cooler for some coastal spots from around Wednesday onwards.\n\n\"Even though it might be a few degrees cooler, [it's] generally looking to be quite dry across the state.\"\n\nThe rest of the week is forecast to be mostly sunny in the south-east.\n\nA severe heatwave in the Far North will gradually ease as the week progresses.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/legal-services-board-of-victoria-warns-lawyers-about-ai-in-court/105916628",
    "title": "Legal errors raise questions over AI use in Victorian courtrooms",
    "publish_date": "Sun, 02 Nov 2025 21:03:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "An increasing number of court cases are being disrupted by the use of artificial intelligence, which is providing false case citations.\n\nIn the past year in Victoria, one solicitor's practising conditions were changed and a law firm was ordered to pay costs in another matter, after using AI to produce court documents, which returned errors.\n\nFamily law specialist Caroline Counsel, who is also chair of family law at the Victorian Law Institute, told the Mornings program on ABC Radio that AI was making its way into courtrooms in Victoria, with some problematic results.\n\n\"Unfortunately, people sort of think AI is the genie that's going to solve all the problems, but in actual fact it's like a really keen intern that wants to please,\" she said.\n\n\"So, if you ask it something and don't ask how it got to that conclusion, it could spit out what they call hallucinations — something that looks like a case, smells like a case and might even have a judge's name in it that's familiar to you — but the rest of it is just made up.\"\n\nCaroline Counsel says AI is making its way into courtrooms. (Supplied: Caroline Counsel Family Lawyers)\n\nAI has grabbed national headlines recently, with the ABC revealing more than a dozen universities in Australia were using AI to catch out students believed to be using AI in assessments, and getting it wrong.\n\nThe ABC has also highlighted issues facing Australian Community Media through its use of Google's Gemini model in regional newsrooms, with some staff raising concerns about the legal advice being offered by the AI system.\n\nThe law industry's watchdog, the Victorian Legal Services Board and Commissioner, has been forced to call out the misuse of AI tools such as generative AI — which creates content in response to user prompts — to prepare court documents.\n\nFabrications and hallucinations\n\nFederal Court documents show in August last year, solicitor Mr Dayal — a pseudonym given to him by the court — submitted a list and summary of legal authorities that did not exist and admitted not checking either for accuracy.\n\nIn that case, Mr Dayal told the court he would \"take the lessons learned to heart and will not commit any such further breach of professional standards in the future\".\n\nMr Dayal was referred by the court to the industry's watchdog for a review of his conduct.\n\nIn August this year, the Victorian Legal Services Board varied Mr Dayal's practising certificate so he could no longer practise as a principal lawyer or handle trust money, and required him to undertake supervised legal practice for a period of two years.\n\nAnd the case of Mr Dayal was not the only one.\n\nThe legal industry is struggling with the use of AI in court. (ABC Graphics: Lindsay Dunbar)\n\nIn July this year, Federal Court judge Bernard Murphy found it was not appropriate to refer a law firm to the Victorian Legal Services Board after an \"inexperienced junior solicitor\" used AI to prepare citations in legal documents for a native title claim.\n\nThat case found the junior solicitor had used Google Scholar's search tool to produce a list of citations, but then, when she attempted to replicate her search methods, Google Scholar returned different results.\n\nCourt documents show the junior solicitor apologised to the parties and to the court for her error, and the law firm she worked for was ordered to pay costs.\n\nJustice Murphy said it was likely that the false document citations came from using generative AI, which had the capacity to \"fabricate\" or \"hallucinate\" information.\n\nLegal bodies are questioning the role of AI in the profession. (Unsplash: Sasun Bughdaryan/License)\n\nPutting the genie back in the bottle\n\nIn its latest risk outlook, the Office of the Victorian Legal Services Board and Commissioner identified the improper use of AI as a key risk.\n\n\"Unlike a professionally trained lawyer, AI can't exercise superior judgement or provide ethical and confidential services,\" a spokesperson said.\n\nThe Supreme Court of Victoria and County Court of Victoria have established guidelines on the use of AI by lawyers, while the Victorian Legal Services Board has joined its counterparts in Western Australia and New South Wales to publish a statement on the use of AI in Australia's legal practice.\n\nMs Counsel said the courts \"were trying to put the genie back in the bottle\" as they grappled with lawyers using AI technology to prepare court documents.\n\n\"It's basically saying, 'Hey, look, you can't just use this randomly, and you can't generate footnotes or citations because we know that AI has this capacity to hallucinate, and you can't actually generate witness statements affidavits using AI,'\" Ms Counsel said.\n\nThe board said cases where lawyers had misled the court by tendering false citations generated by AI were increasingly the focus of regulators.\n\nIt said if the misuse of AI was proven, it might take disciplinary action by reprimanding the lawyer or ordering further education.\n\nThe board said it would consider prosecuting a matter before the Victorian Civil and Administrative Tribunal if the misuse amounted to professional misconduct.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/childcare-drought-leads-to-workforce-shortages-nsw-physio/105958574",
    "title": "'Families in tears' as daycare drought keeps workers out of jobs",
    "publish_date": "Sun, 02 Nov 2025 20:34:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Johanna Murphy spent a decade honing her specialist skills as a sports physiotherapist, but a childcare drought in her south-western New South Wales town means she can only work one day per week.\n\nThe mum of three is currently unable to take new patients and said this had a profound flow-on effect on the entire town.\n\n\"The perfect example would be: you wake up one morning and you can't move your head because your neck’s locked up. If you can't get in to see the physio to begin treatment, you can't sit at your desk because it's too sore,\" Ms Murphy said.\n\n\"People then can't do their job and if they're not doing their work, their colleagues take the load or the work just doesn't get done.\n\n\" I think if you asked everyone in town, they would be able to track an issue with access back to someone not being able to access childcare. \"\n\nJohanna Murphy only works one day per week in her private physiotherapy practice because she cannot get child care. (Supplied: Johanna Murphy)\n\nResidents leaving, jobs unfilled\n\nThe Edward River Council has collated data that shows 69 per cent of local children currently do not have access to a childcare place, with waitlists for local services exceeding 300 families.\n\nThe situation was further exacerbated in July when a local centre closed suddenly due to compliance issues, leaving nearly 30 families without care.\n\nMayor Ashley Hall said the council was working with an early education provider to establish a new 110-place daycare centre, but conceded it was still years away.\n\nThere is a shortage of daycare services in Deniliquin. (Supplied: River Region Early Education)\n\n\"It's the number one advocacy role that council are playing at the moment,\" Cr Hall said.\n\n\"We've got tremendous support from our community, but we need outside help, particularly for capital funding from the state and federal government.\"\n\nRiver Region Early Education provides daycare services in Deniliquin and surrounding rural communities.\n\nGeneral manager Felicity Michael said families were leaving the region and essential worker roles were hard to fill because of the shortage.\n\nFelicity Michael says essential workers are not coming to the region due to a lack of child care. (Supplied: Felicity Michael)\n\n\"We know of two teachers who have had to leave teaching positions in Deniliquin due to a lack of care for their children, and nurses unable to take up positions at the hospital due to the lack of childcare,\" she said.\n\nMs Michael said data from the Australian Early Development Census also highlighted a concerning trend.\n\n\"It is impacting the development of children, with more children in Deniliquin being developmentally vulnerable in two or more domains than the NSW or national average,\" she said.\n\n\"Children who are able to access early childhood education and care are more likely to be able to access early intervention [that will] set them up for a bright future. The lack of childcare is limiting these children's access to this vital early intervention.\"\n\nThe NSW Department of Education says the state government will deliver a new pre-school at Deniliquin South Public School by 2027. (Supplied: River Region Early Education)\n\nA town on tenterhooks\n\nEdward River Council had been in discussions with the NSW Education Department on establishing a temporary daycare centre at a local public school, but the proposal has stalled.\n\nIn a statement, a spokesperson said the department was working with local stakeholders to identify a solution for the short term.\n\nThey said the state government would deliver five new pre-schools in the wider Riverina region by 2027, including one at Deniliquin South Public School.\n\nFor now, though, Johanna Murphy said tensions were running high in town.\n\n\"My receptionist at work is getting some pretty unhappy clients calling who are trying to get in to see a physio and can't,\" she said.\n\n\"The poor admin staff at the childcare centres … there are people calling every single day to check in again, 'Am I further up the waitlist, am I any closer to getting childcare?' They’re getting families in tears in their waiting room.\n\n\"It is dire straits in Deniliquin and we need a solution as soon as possible.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-03/federal-politics-live-blog-nov-3/105958106",
    "title": "Live: Optus staff took hours to escalate discovery of deaths in triple-0 failure",
    "publish_date": "Sun, 02 Nov 2025 20:06:54 +0000",
    "category": "finance",
    "authors": [
      "Joshua Boscaini",
      "Courtney Gould",
      "Isabella Tolhurst",
      "Maani Truu"
    ],
    "text": "A press conference originally convened to discuss the inquiry into the Optus triple-0 outage has veered into questions about net zero by 2050 after that decision from the Nationals at the weekend.\n\nWA Liberal Dean Smith says the Coalition must be focused on holding Labor to account for high energy prices, which he says is making life tough for families and businesses.\n\n(ABC News: Luke Stephenson)\n\nBut Smith has welcomed the National party for providing clarity on their net zero position.\n\n\"Their position will help inform our position. But I'm sure the National Party is very, very, very aware that the Liberal Party will come with its own position, informed by its own priorities and considerations,\" Smith says.\n\nLiberal senator Sarah Henderson has jumped in off the back off Smith to say that she hopes her colleagues turn their back entirely on net zero.\n\n\"I believe that we will get a position where we will work together to reject Labor's net zero laws,\" Henderson says. \"These policies are not working. Australians can see it. The National Party have called this out.\n\n\"We are very concerned to ensure that we continue to reduce emissions. But we are not going to allow Australians to pay the highest price,\" she says.\n\nHenderson says she hopes the Liberals reach a position \"as soon as possible\" and that deliberations won't continue for much longer.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/sport/racing/danny-russells-tips-for-the-2025-melbourne-cup-20251103-p5n7cm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Danny Russell's Tips for the 2025 Melbourne Cup",
    "publish_date": "Mon, 03 Nov 2025 13:03:54 +1100",
    "category": "sports",
    "authors": [],
    "text": "Danny Russell's Tips for the 2025 Melbourne Cup\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-liberal-leaders-face-fresh-pressure-over-nationals-dumping-of-net-zero-11-injured-one-still-fighting-for-life-after-uk-train-mass-stabbing-20251103-p5n76y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Ley’s leadership in peril as senior Liberals move to dump net zero; Optus chair stands by CEO after Triple Zero outage",
    "publish_date": "Mon, 03 Nov 2025 12:57:17 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Earlier this year, this masthead’s Bidding Blind investigation revealed that prospective home buyers are being frequently misled by unrealistic price guides.\n\nThe project analysed more than 36,000 property sales in Melbourne and Sydney across 18 months and found that more than half of homes put up for auction in Australia’s two largest cities sold above the top end of the price guide (even when allowing for 10 per cent wriggle room in Sydney).\n\nA special investigation of 26,000 auctions reveals just how badly Melbourne’s property guide system misleads buyers. Credit: Mark Stehle\n\nOne of the ways agents get away with underquoting is by encouraging homeowners to allow them to advertise their properties at a lower price than they would be prepared to sell for, the investigation found.\n\n“The argument [from the agent] was, ‘You’ve got to create competition in the marketplace. If we go to auction, we would need to list for less so the auctioneer can build competition amongst the bidders,’” said Melbourne woman Maree.\n\nWe’re looking to speak to people who have recently sold a home about their experience of underquoting and price guides. You can contact journalist Aisha Dow on aisha.dow@nine.com.au or fill in the survey (leaving your contact details) below.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-man-stabbed-in-neck-with-fork-20251031-p5n6py.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Man ‘stabbed in neck with fork’; Premier promises e-bike crackdown; Beetlejuice the Musical coming to Brisbane",
    "publish_date": "Mon, 03 Nov 2025 12:42:56 +1100",
    "category": "finance",
    "authors": [],
    "text": "Do not be fooled by the patches of blue sky this morning, Brisbane is in for another muggy and stormy day.\n\nBrisbane avoided the worst of the storms this weekend and today’s storms are also expected to be less severe.\n\nIt is expected to begin raining across the city from 10am, with thunderstorms to roll in from 4pm.\n\nThe humidity level is currently at 79 per cent, making the temperature of 26 degrees feel more like 30 degrees.\n\nWhile it is hot and humid, at least it’s not a repeat of last Monday when Brisbane sweltered through its hottest October day in 21 years.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/business/banking-and-finance/westpac-profits-dip-to-6-9-billion-rams-home-loans-sold-20251103-p5n77h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Westpac boss says selling $21.4b RAMS loan book will help cut costs",
    "publish_date": "Mon, 03 Nov 2025 12:39:11 +1100",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "Westpac chief executive Anthony Miller says offloading the $21.4 billion RAMS home loan portfolio will help the bank’s long-term plan to streamline its technology and cut costs, even though the sale will reduce the bank’s market share.\n\nAs Westpac delivered a 1 per cent fall in full-year profits on Monday, it also announced it was selling the RAMS home loan portfolio to a consortium, a move that will result in Westpac losing a chunk of the mortgage market.\n\nWestpac has about 21 per cent of the home loan market at present, but its loans are spread across three different banking systems: one for Westpac–branded loans, one for St George and regional brands such as Bank of Melbourne, and one for RAMS.\n\n“In effect, I’ve got three small banks, three small bank cost challenges, three small bank compliance, three small bank risk challenges in managing the mortgage book,” Miller said.\n\nThe bank is undergoing a major technology project that will result in all its loans being moved onto one system, and this would have required significant spending for the RAMS loan book. Selling RAMS allowed the bank to achieve its goals faster and more efficiently, Miller said.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/technology/rue-refuses-to-resign-as-optus-unveils-triple-zero-overhaul-20251102-p5n73t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Savaged Optus boss faces claims of misleading Senate",
    "publish_date": "Mon, 03 Nov 2025 12:27:33 +1100",
    "category": "finance",
    "authors": [
      "David Swan"
    ],
    "text": "“It seems very clear that it was more important to you and to your executive team to make sure your corporate ducks were in order, that your profits will be in order, than people’s safety and transparency with government,” she said. “You didn’t give any further update... even when you knew on the Thursday night that it was worse than you had previously informed the government.” Pressed repeatedly on why he didn’t immediately provide updated information about the true number affected or deaths, Rue insisted he “wanted to provide accurate information” but admitted that his call to notify the regulator came nearly 18 hours after learning of the first fatality. Rue also conceded there were delayed welfare checks on at-risk customers as engineers scrambled to manually identify failed emergency calls. In his opening statement, Rue announced that Optus would add 300 people to its Australian call centres focused on Triple Zero customers and would on-shore its network operations from offshore contractors, in response to the catastrophic network failure.\n\nHe said Optus accepted full responsibility for the failures and said he “regretted reforms were not embedded earlier to prevent them”. Loading “We are all deeply sorry, the tragic deaths of people during this outage will stay with us as individuals and as a company, as we investigate and build on our response while progressing a sweeping transformation of Optus,” he said. “We will add around 300 people to our Australian call centres focused on Triple Zero and vulnerable customers, including our specialist care teams helping customers in rural areas, elderly customers or those with serious medical conditions. “In May this year, the board approved a management proposal to take back in-house network activities currently performed by Nokia, both onshore and offshore. At the time, the aim was to transition this work progressively to May 2027, but I have now asked the networks team to accelerate the move.\n\n“In addition to the on-shoring activities in call centres and networks, we are also recruiting 150 people to be part of a new Process Centre of Excellence in Australia, to accelerate the transformation and overall procedures across the business.” Loading Rue pushed back on calls for his resignation that have come from across the political spectrum. “I firmly believe that another change of leader at this time is not what Optus needs or what our customers need. The disruption and uncertainty could actually set back the transformation underway and create further risks,” he said. Optus chair John Arthur backed his chief executive, but promised future consequences for staff responsible for the Triple Zero outage.\n\n“That’s his job. Now, he’s partway through this job and I’m expecting him to finish it,” Arthur said. “Because I never in my life want to be in the position I’m in today where I have to answer these sorts of questions about a company I’m associated with.” He said once an internal Optus review, a review by the regulator, and the Senate inquiry were finalised, there would be consequences for both junior and senior staff. “I can assure you that there will be [accountabilities] when the dust settles. And what I mean by that is that when we have all of the facts… the board will deal with accountabilities.” The crisis stemmed from a botched firewall upgrade at Regency Park exchange in South Australia, where technicians failed to redirect traffic before locking down a critical “session border gateway”, according to Optus’ submission to the inquiry. Optus’ Paul O’Sullivan, former chairman, John Arthur, chairman, and Stephen Rue, CEO, at the Triple Zero service outage hearing at Parliament House in Canberra on Monday. Credit: Alex Ellinghausen\n\nThe submission reveals Nokia contractors used an outdated procedure document and incorrectly rated the change as “zero risk”, bypassing crucial engineering reviews. It states that Nokia personnel selected an “outdated Method of Procedure (MOP) document” for the change. This outdated document “did not include making changes... to ‘offload’ traffic from the Session Border Gateway” before applying the lock. Loading The work was also brought forward 24 hours without proper authorisation. Automated alarms for general call failures were generated within minutes of the outage starting. Those alerts, at 12.20am on September 18, were dismissed as routine maintenance activity, while five customer calls reporting Triple Zero failures between 10.13am and 2.57pm went unescalated – a “serious process issue” that Optus acknowledged was unacceptable.\n\nThe outage wasn’t identified until 1.17pm when South Australian Ambulance Service called Optus directly. Services were restored by 2.34pm, but the damage was done. Efforts to conduct welfare checks on affected customers were then delayed because the technical fault meant that standard Call Detail Records (CDRs) “showed no unsuccessful calls”. Engineers had to devise new methods to identify affected customers, with the first 100 identified by 7.50pm – more than five hours after services were restored. A further 524 customers were identified the next morning, followed by seven more days later. Welfare checks didn’t commence until 8.34pm on September 18, with Optus learning of the first fatality at 8.43pm. By Friday afternoon, three deaths had been reported, rising to four by Saturday. The company has appointed former Sydney Water chief executive Dr Kerry Schott to lead an independent review, and engaged consulting firm Kearney to oversee network management improvements. The inquiry continues.",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/sport/racing/melbourne-cup-2025-20251103-p5n7bt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Melbourne Cup 2025",
    "publish_date": "Mon, 03 Nov 2025 12:24:24 +1100",
    "category": "sports",
    "authors": [],
    "text": "The Melbourne Cup is almost upon us, and this is the easiest and best way to organise your home, party or office sweep. Enter the player names, get your picks and watch the race. Easy.\n\nNovember 1, 2025",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/india-wins-the-odi-world-cup-20251103-p5n7br.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "India wins the ODI World Cup",
    "publish_date": "Mon, 03 Nov 2025 12:16:40 +1100",
    "category": "sports",
    "authors": [],
    "text": "India wins the ODI World Cup\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/traveller/inspiration/fiji-s-best-places-to-stay-20230220-h29yh1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fiji’s best places to stay, whatever your budget",
    "publish_date": "Mon, 03 Nov 2025 12:12:59 +1100",
    "category": "finance",
    "authors": [
      "Craig Tansley"
    ],
    "text": "Advertisement\n\nInspirationFiji Fiji’s best places to stay, whatever your budget Craig Tansley Updated November 3, 2025 — 12:12pm , first published April 4, 2023 — 9:55am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThis article is part of Traveller’s Holiday Guide to the best of the Pacific. See all stories .\n\nKokomo has just 21 villas and all are located right on the beach with their own plunge pool. Kokomo Private Island Resort From rustic hostels and bures set on quiet beaches to private island retreats frequented by Hollywood stars, Fiji has somewhere to stay for every traveller and every budget. Wherever you choose, famously friendly service, and immersion in local culture and cuisine is guaranteed. VITI LEVU (MAIN ISLAND) Crowne Plaza Fiji Nadi Bay Resort & Spa\n\nAdvertisement\n\nPerfect for: Couples and families who like amenities as much as a sandy beach\n\nThis premium resort is located a convenient five kilometres from Nadi International Airport, so you can either use it as a convenient stopover for first or last nights, or spend your whole holiday here. Rebuilt on the site of a former Pullman resort on underrated Wailoaloa Beach, seven swimming pools link a variety of suites and rooms with 10 bar and dining options, including a cool speakeasy-style whiskey bar (something very different for the South Pacific). The property welcomed 60 new two-bedroom family rooms and 16 oceanfront suites at the start of 2025.\n\nCrowne Plaza Fiji Nadi Bay Resort & Spa; +679 670 0700. See fijinadibay.crowneplaza.com. From $430 a night. Fiji Beach House Perfect for: Budget travellers, adventurous families, groups\n\nHow’s this for Fiji’s best-kept secret; a beach retreat on the Coral Coast with its own beach with bungalows that cost less than the price of a round of drinks at some five-star resorts. Choose between bungalows ideal for couples or dorm rooms for groups of friends (or budget travellers) set in hectares of forest beside the beach, with a pool looking over the ocean. Fiji Beach House is the base for an aquatic adventure operation so you can choose between surf trips, paddle-boarding, snorkelling, fishing tours and more. Feast on fresh seafood and local produce at their on-site restaurant.\n\nQueens Highway, Coral Coast; +679 992 9500. See fijibeachhouse.com. From $160 a night. Fiji Marriott Resort Momi Bay\n\nAdvertisement\n\nPerfect for: Couples and families alike, which isn’t always the case in Fiji\n\nFiji Marriott Resort Momi Bay is both a romantic adults-only retreat for couples and a stylish family resort for parents who want to step beyond the typical family resort. Guests choose between adults-only overwater bungalows, or family-friendly rooms. There’s also an adult’s only bar and fine dining restaurant built on a cliff looking across the Mamanuca Islands. Families have a choice of four dining options. Set beside the sea and around a man-made lagoon surrounded by green grassy hills (and cows), it’s hard to believe you’re 25 minutes drive from Nadi International Airport.\n\nSavusavu Road, Momi Bay; +679 670 7000. See marriott.com. From $545 a night Matanivusi Beach Eco Resort Perfect for: Solo travellers, couples and families seeking water adventure\n\nYou don’t have to surf to stay here, but you’ll wish you did when you see the perfect uncrowded waves – but just being here is enough for anyone who likes the ocean. Off a secret road between the Coral Coast and Pacific Harbour, you’ll pass through a village to an eco-retreat built in coastal forest beside a stunning lagoon. Villas are connected by a boardwalk built above the forest, among 400-year-old fig trees. Meals are served communally with produce from an onsite organic garden – and there’s yoga and massage.\n\nVunaniu Road, Serua; +679 992 3230. See surfingfiji.com. From $415 a night.\n\nAdvertisement\n\nGrand Pacific Hotel Fiji Perfect for: Solo travellers and couples interested in history and culture\n\nIt’s a side of Fiji you mightn’t think of. Most of us rush to Fiji’s island resorts, but you could choose to look back at the South Pacific’s colonial-era times by sleeping at the South Pacific’s most iconic colonial-era hotel. Built in 1914, stay in the suite Queen Elizabeth has slept in four times. The hotel has housed every major dignitary to visit Fiji (Fiji’s parliament is across the road). Its walls record black-and-white memories of them all. Located in Suva, check out nearby historic botanic gardens, restaurants and bars and enjoy high tea on your private lawn.\n\nVictoria Parade, Suva; +679 3222 2000. See grandpacifichotel.com.fj. From $310 a night. Shangri La Yanuca Island\n\nAdvertisement\n\nPerfect for: Families and couples who may never leave the resort\n\nDrive 50 minutes south of Nadi International Airport and you’ll find Shangri La Yanuca Island connected by a causeway. It’s surrounded entirely by water, so you never have far to go to swim. There are four restaurants and two bars all on the waterfront, in a resort modelled on a traditional Fijian village. It’s perfect for families for its kids’ clubs, free activities and family-friendly amenities, but then couples also have the option of staying in its adults only Reef Wing or making use of its award-winning day spa, a short walk away.\n\nYanuca Island, Coral Coast; +679 652 0155. See shangri-la.com/yanucaisland/fijianresort. From $335 a night. YASAWA ISLANDS Waya Island Resort Perfect for: Couples who want a romantic retreat they won’t be paying off for years\n\nFiji’s latest couples-only private island retreat is a lot more accessible than some others spread across Fiji. It’s luxurious, but not over-the-top so. Chefs prepare meals in a home-style cooking format using ingredients grown on the island or caught from the sea. Built on an island in the less-explored Yasawa Islands, guests are surrounded by dramatic volcanic peaks and the kind of drop-dead perfect beach and calm blue water these islands are known for. Access is by way of ferry. Or blow the budget with a helicopter in and out.\n\nWaya Island Resort; +679 998 2288. See wayaisland.com. From $595 a night.\n\nAdvertisement\n\nYAUKUVE LEVU ISLAND Kokomo Private Island Resort Perfect for: Solo travellers and couples with an unlimited budget\n\nIt’s not cheap; but you’ll be staying on a 60-hectare island with no more than 50 guests surrounded by the Astrolabe Reef, one of the largest, most pristine coral gardens in the world (there’s 40 private dive sites off-shore). Only reachable by helicopter or seaplane, Kokomo Private Island Resort is in Fiji’s rarely visited Kadavu Islands. There are 21 seaside villas set beside some of the best beaches in Fiji. Despite its price tag, its piece de resistance is a bar/ restaurant cobbled together with driftwood and items from a Suva boatyard where guests watch baby black-tip reef sharks in an open-air eatery a metre above the sea.\n\nYaukuve Island, Kadavu; +679 776 441. See kokomoislandfiji.com. From $2100 a night. MAMANUCA ISLANDS\n\nAdvertisement\n\nCastaway Island Resort Perfect for: Families who don’t want to stray far\n\nThere’s nowhere safer for families to stay than Castaway Island Resort. Set on a 70-hectare island surrounded entirely by beaches and lagoons protected by coral reefs in the Mamanuca Islands, it’s a 90-minute ferry ride from Port Denarau. Stay in thatched bures set out like a traditional Fijian village. Guests congregate by the island’s best beach and swimming pools, to watch the sun setting. There are four restaurant/ bars to choose from (including one where you dine barefoot under the stars) or access nearby islands by speedboat.\n\nQalito Island, +679 666 1233, outrigger.com/fiji/castaway-island-fiji. From $790 a night. VANUA LEVU Jean-Michel Cousteau Resort Fiji\n\nAdvertisement\n\nPerfect for: Couples and families who adore the water\n\nEscape to Fiji’s second largest island, Vanua Levu, to find one of the South Pacific’s best combined family and couples luxury resorts. Located along a white-sand bay at the north of the island, you might guess that any resort owned by a relative of diving pioneer, Jacques Cousteau, is proud of its diving offering. Access some of the best dive sites on Earth at sites nearby, such as Namena Reef, which offers some of the most diverse fish and coral species in the world. Families have free kids’ club, dusk-to-dawn nanny service and a variety of activities, and couples have adults-only dining and luxury spas.\n\nLesiaceva Point Road, Savusavu; 03 9815 0379. See fijiresort.com. From $1737 a night. VOMO ISLAND Vomo Island\n\nAdvertisement\n\nPerfect for: Mums and dads who are couples too\n\nYou don’t have to go far in Fiji to escape to islands completely removed from its main island. Take a boat (or helicopter or seaplane) from main tourist hub, Denarau Island, and some of Fiji’s best islands – the Manamucas – are just there. The most removed is Vomo Island – a private island resort at the northern end of the archipelago. There’s no-one else on the island – though if you want more privacy, there’s a tiny islet you can reach with a two-minute boat ride. Couples love Vomo Island’s romantic restaurants and bars, but families have options with kids’ clubs, water activities and kids’ dining while parents escape to an adults-only restaurant.\n\nVomo Lai lai Island. Phone: +679 776 7955 or 1800 324 916. See vomofiji.com. From $1840 a night. Outrigger Fiji Beach Resort Perfect for: Families looking for an easy Fiji holiday\n\nPicture a Fijian family resort: staff greeting you with bula, kids playing in kids’ clubs by the beach, kava dished out by friendly locals, dance performances by night, nightly buffets, swim-up pool bars. That’s Outrigger Fiji Beach Resort. While it’s not for everyone (couples might be advised to steer clear), this is the ultimate South Pacific family resort. There is a free kids’ club, nanny services, complimentary beach activities like beach volleyball and paddle-boarding and eight bars and restaurants – but there’s also adult’s only restaurants and swimming pools to flee to when you drop the kids off. A multi-million revamp completed in 2023 introduced new waterslides, premium bures and upgraded recreation facilities.\n\nSydney Drive, Queens Highway, Sigatoka; +679 650 0044. See outrigger.com/fiji/fiji-beach-resort. From $358 a night Mantaray Island Resort\n\nAdvertisement\n\nPerfect for: Budget-minded adventurous families, couples and solo travellers\n\nThe Yasawa Islands remain one of Fiji’s best-kept secrets: 20 islands open to land-based tourism only since the late-’80s. While it’s home to some of Fiji’s most expensive private island retreats, why not stay beside the water for less than $150 per night? Take a catamaran from Port Denarau and sleep beside your own beach, close to some of the best diving and snorkeling in Fiji. Between May and October, these waters become the best spot on Earth to swim with manta rays. There’s a PADI dive school on site, and other activities such as fishing tours, guided snorkeling and village visits.\n\nNanuya Balavu Island, Yasawas; +679 776 6351. See mantarayisland.com. From $178 a night Wakaya Island Club & Spa Perfect for: Couples with unlimited budget to disappear\n\nEntrance is by propeller plane only, but that’s the whole point. There’s only 10 suites and two villas and with the dining and activities options available, chances are you won’t see any other guests. With that kind of privacy you might imagine the guests who’ve come before (did anyone say … Tom Cruise?). Everything is perfect here because you paid for it to be. Sleep beside a beach that fronts onto a Marine Protection Area where you snorkel or dive some of the most pristine reefs on Earth. Meals are served pretty much anywhere you like.\n\nWakaya Island; +679 344 8128. See wakayaresort.com. From $3870 a night.\n\nSign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now.\n\nTraveller Guides",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/traveller/inspiration/fiji-s-best-restaurants-and-bars-20230303-h2a8wy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fiji’s best restaurants and bars",
    "publish_date": "Mon, 03 Nov 2025 12:10:51 +1100",
    "category": "finance",
    "authors": [
      "Craig Tansley"
    ],
    "text": "Advertisement\n\nInspirationFiji Fiji’s best restaurants and bars Craig Tansley Updated November 3, 2025 — 12:10pm , first published April 4, 2023 — 10:01am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThis article is part of Traveller’s Holiday Guide to the best of the Pacific. See all stories .\n\nWith nearly 40 per cent of its population made up of those of Indian heritage, Fiji has one of the most diverse of all South Pacific cuisines. Combined with its indigenous cooking techniques and abundance of fresh produce and seafood, dining in Fiji is a big part of the reason for visiting. From fine dining beside the ocean to eating traditional dishes in rustic, inexpensive cafes, the dining choices in Fiji are out of this world. MAMANUCA ISLANDS\n\nAdvertisement\n\nMalamala Beach Club For a dining experience completely different to everything else in Fiji\n\nYou’d come for the novelty factor alone: Malamala Beach Club is the world’s first beach club on its very own island and it’s only half an hour by ferry from Port Denarau. Buy a day pass and hit the spa, and the island’s pools and stunning beaches. Its food offerings have been overshadowed; but this is a heck of a venue for a meal. There’s a choice between restaurants - dine pool-side or opt for the adult’s only area. The chicken curry is one of the best you’ll find in a country famous for them; though the loaded fries (with bacon and beef brisket) are legendary too.\n\nMalamala Island, Mamanuca Islands. Phone +679 999 5512. See malamalabeachclub.com/eat-drink Cloud 9\n\nAdvertisement\n\nWood-fired pizza and drinks in the middle of the ocean\n\nCloud 9 is one of Fiji’s most iconic dining and drinking options. It’s a floating two-level platform in the middle of the lagoons around the Mamanuca Islands, close to Fiji’s most legendary surf break, Cloudbreak. Take a boat transfer (or arrive by jet-ski or seaplane) from Port Denarau and enjoy a lunch of hand-made Italian pizza cooked in a wood-fired on-site oven. Eat on the sundeck or grab a day bed, and listen to DJs as you order cocktails from the bar and swim straight off the platform in some of the most pristine waters of Fiji.\n\nMamanuca Islands. Phone: +679 869 7947. See cloud9.com.fj VITI LEVU Broady’s Bar & Cafe Well-priced no-frills meals served for locals\n\nIt’s simple, inexpensive and it quickly became one of Fiji’s hottest eating venues – there’s live music here at nights and some of the best cocktails you’ll find in Melanesia. But owner Michael Broadridge wanted to make his bar/café a one-stop shop for everything from a hearty breakfast with Fiji’s best coffee, to dinners and nighttime entertainment. Situated just off the Queen’s Road in the Nadi suburb, Martintar, eating here is a great way to mix with Fijian locals away from the resorts. Don’t go past the grilled catch of the day with creamy ota (a local fern that is a Fijian delicacy).\n\nCnr Queens Road and Zahoor St, Nadi, Viti Levu. Phone: +679 672 2193. See facebook.com/BroadysBC\n\nAdvertisement\n\nTiko’s Floating Restaurant & Bar Where else should you eat seafood but on a boat?\n\nThis place has built itself a solid reputation among locals and more experimental tourists alike. Located on Suva Harbour, the nation’s capital is often overlooked. But getting here for a famous Tiko’s seafood feast as the sun sets over the harbour will make your holiday extra-special. Located on a two-storey boat whose lower deck is a bar and upper deck is a restaurant, the atmosphere is always charged. Try its iconic curried mud crab (qari) in coconut cream; not before a Margarita below.\n\nStinson Parade Road, Suva Harbour, Viti Levu. Phone +679 450 2959. See facebook.com/tikosfloatingrestaurant Wicked Walu Photo: Alamy\n\nAdvertisement\n\nSeafood delicacies on a private islet\n\nLocated within a resort (outside diners are welcome) easily accessible on Viti Levu’s Coral Coast, here’s another Fijian restaurant you can’t beat for location. Built on a tiny islet off the mainland, guests walk along a causeway lit up with flaming tiki torches to a restaurant on its own island. You can choose to dine by candlelight on the beach, or within an open-sided traditional Fijian-style pavilion. Seafood is the specialty here – the restaurant is Trip Advisor’s Top-Rated seafood restaurant in Fiji. Order a seafood platter for two – though children are welcome if you prefer to share the intimate experience.\n\nQueens Road, Warwick, Viti Levu. Phone: +679 653 0555. See warwickhotels.com Kanavata (Nunuku Resort) Personalised meals for couples in the treetops\n\nThere's a thousand romantic dining options across Fiji in its five-star resorts and hotels. But there's one option that really stands out – simply for its location. Travel to Pacific Harbour on Viti Levu's south coast and enjoy a romantic meal for two on a viewing platform built right up amongst the canopy of a local dilo tree overlooking a beach. A dedicated chef will cook for your tastes, with seafood caught in Beqa lagoon a specialty (with everything from lobster, octopus to snapper available). Consider a spa treatment on the platform after your meal. You don't have to be a guest.\n\n11 Nanuku Drive, Pacific Harbour, Viti Levu. Phone: +679 345 2100. See nanukuresort.com Baka Blues Cafe\n\nAdvertisement\n\nCelebrating USA’s Southern barbecue… in Melanesia\n\nThere’s always been something quirky about Pacific Harbour, the lesser-known tourist hub past the Coral Coast on Fiji’s main island, Viti Levu. Home to a collection of bars, restaurants and cafes that break the mould of what you’d expect to find in Fiji – Baka Blues Cafe is a New Orleans inspired blues bar which celebrates the American Deep South. You’ll find local musicians, photos from the South and a menu celebrating Southern barbecue, Creole and Cajun food (don’t go without trying the sizzling baby back ribs or Texas T-bone). It’s a sports bar too – though families are encouraged to sit where kids can play the giant Jenga blocks.\n\n1342 Hibiscus Drive, Port Harbour, Viti Levu. Phone: +679 992 7453. See restaurantsnapshot.com/BakaBluesCafe Ocean Terrace (Bedarra Beach Inn) Wholesome Fijian fare served in a cosy setting\n\nCentrally located on the Coral Coast, you won’t find better curries anywhere in Fiji (all are served with various home-made chutneys). And yet Ocean Terrace Restaurant is most famous for its local lobster – cooked in a bisque and laced with brandy. Sit outside on the veranda overlooking the pool to the lagoon beyond for either breakfast, lunch or dinner. Dinner includes candlelight and live music. Don’t go past their coconut pancake rolls with local fish, though their kokoda (raw local fish marinated with coconut milk and lime) shouldn’t be missed.\n\nSunset Strip, Korotogo, Sigatoka, Viti Levu. Phone: +679 6500 476. See bedarrafiji.com Bulaccino\n\nAdvertisement\n\nA casual farm-to-table cafe and restaurant\n\nThis was the café that kicked off Fiji’s café culture when it opened in 2006, making the country a genuinely legitimate destination for coffee aficionados. Though coffee’s just part of what you’ll get. Run by a local family, most ingredients come straight off the owners’ 12 hectare organic farm just outside Nadi (you can take a farm tour), making this a bona fide farm-to-table eatery. The setting’s casual but chic – art deco with an open-air bar set in a garden outside. Locals love it, so it’s a great way to immerse yourself into the Nadi community away from the resorts of Denarau Island. There’s also an outpost in Suva.\n\nQueens Road, Namaka, Nadi, Viti Levu. Phone: +679 672 8638. See bulaccino.com Geckos Resort Restaurant Great seafood and curries served with a weekend dance show\n\nGeckos Resort Restaurant is a Coral Coast dining institution – home to one of the most lively Polynesian dance and fire shows in Fiji. Located within a low-key 28-room resort set in an historic village, it’s only 500 metres from the Shangri La Resort, and a few minutes from Sigatoka Town. Visit on a Friday and Saturday night for an hour-long dance and fire show. Turn up early for happy hour from 5-7pm, and order local mud crab and lobster delivered fresh that morning, or curry cooked by a local Indo-Fijian chef.\n\nQueens Highway, Sigatoka, Viti Levu. Phone: +679 652 0200. See facebook.com/GeckosResort Waitui Bar & Grill (Sofitel Fiji Resort & Spa)\n\nAdvertisement\n\nSeafood and meat chargrilled at a beachside setting\n\nDenarau Island has multiple dining options. One of the best options amongst an array of offerings at five-star resorts is Sofitel Resort & Spa’s exclusive adults-only restaurant, Waitui Bar & Grill. There’s a colonial feel to the open-air, multi-level restaurant beside the beach, with its weatherboard slats and big timber bar (the perfect spot for sunset drinks). Meat and seafood is cooked on a house-built charcoal grill – most ingredients are sourced locally. The lobster’s a house specialty, and the cocktail list is overwhelming. Dishes are designed with sharing in mind.\n\nDenarau Island, off Viti Levu. Phone: +679 675 1111. See sofitel-fiji.com Indigo Indian Asian Restaurant The best Indian food on Viti Levu\n\nWith nearly 40 per cent of Fiji’s population having Indian heritage – Indo-Fijian flavours are almost as big a part of the diet as indigenous flavours. And some of the best Indo-Fijian flavours are available at centrally located Indigo Indian Asian Resort on the waterfront at Port Denarau. Try the local masala crab or the musallam of lamb with chillies and spices grown at the restaurant’s own organic farm. There are two separate menus – Indian and South-East Asian – so it’s like having two restaurants in one. Get there early for a sunset over the ocean.\n\nPort Denarau, Denarau Island, Viti Levu. Phone: +679 675 0026. See www.indigofiji.com VANUA LEVU\n\nAdvertisement\n\nNamale Resort & Spa Romantic fine dining on another level\n\nYou’re going to have to stay to eat here – and kids aren’t welcome – but Namale Resort & Spa offer foodies the ultimate Fijian dining experience. There are two restaurants on-site, but you can dine out where you like – from a candlelit cave, to a table on the beach, or a table set beside a private waterfall. All produce comes from the resort’s own organic farm and a local market. Located on Fiji’s second-largest island, Vanua Levu, the resort is built along its stunning northern coastline, called Hibiscus Highway. There’s a weekly Indian and lovo (underground oven) night.\n\n1 Hibiscus Highway, Savusavu, Vanua Levu. Phone: +679 885 0435. See namalefiji.com\n\nSign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Fiji\n\nOceania\n\nFoodie travel Craig Tansley is a Gold Coast-based freelance travel writer with a specialty in adventure, and a background in the South Pacific.\n\nTraveller Guides",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/katoa-suffering-seizures-after-hia-chaos-20251103-p5n7bj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Katoa suffering seizures after HIA chaos",
    "publish_date": "Mon, 03 Nov 2025 12:06:45 +1100",
    "category": "finance",
    "authors": [],
    "text": "Katoa suffering seizures after HIA chaos\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-age-when-pay-equality-for-women-gets-much-worse-20251031-p5n6v1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The age when pay equality for women gets much worse",
    "publish_date": "Mon, 03 Nov 2025 12:00:26 +1100",
    "category": "finance",
    "authors": [
      "Millie Muroi"
    ],
    "text": "Pay imbalances accelerate for Australian women once they hit their mid-30s, as a landmark report shows the country has made scant progress on workplace gender equality in the last decade.\n\nAn index developed by researchers at Sydney University shows women were still more likely to carry a bigger domestic work load and to be working below their skill level, despite the figures showing a 3-point improvement in the index from 2014 to 2024.\n\nOn its scale from 0 to 100 (with 100 indicating total equality), Australia was still 17 points away from achieving perfect gender equality at work. It is the first comprehensive, national snapshot of the problem over a period of 10 years – and the first of its kind globally.\n\nThe research team, led by professors Elizabeth Hill and Rae Cooper, gave Australia a score of 92 for gender equality in hourly pay. But because men earn higher bonuses and overtime, “women make 76 cents for every dollar men make”, they found.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/racing/she-broke-her-back-in-her-fourth-race-now-celine-gaudray-will-ride-in-the-melbourne-cup-20251030-p5n6fc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "She broke her back in her fourth race. Now Celine Gaudray will ride in the Melbourne Cup",
    "publish_date": "Mon, 03 Nov 2025 11:59:05 +1100",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "Trainer Paul Preusker has Geelong Cup-winner Torranzino ready for the Melbourne Cup. Credit: Jason South On Tuesday, just five years after her first race ride in a maiden at Moe in June 2020, she will ride in her first Melbourne Cup aboard the Paul Preusker-trained Torranzino. When the gates open, Gaudray will become just the 11th woman to ride in the Cup’s history. “She’s gifted in a lot of ways on horseback. She has a good understanding of horse movement, is incredible at riding horses over jumps and jumping big fences on horses bareback,” Carey said. “For a girl her age she was pretty fearless and ready to advance her riding at an early age. She was a bit daring.” Gaudray has a winning laugh too.\n\nIt lands as regularly as her mounts on raceday (30 per cent of her rides have finished in the placings) and emerges as soon as she recalls the education she had working with Carey and his wife Cheryl as she learnt the skills needed to become a jockey. Carey paired her up with a former racehorse I Maximus, a stable favourite who was smart enough to be reliable but in the trainer’s words, “not bombproof”. It meant whoever was riding him needed to be on their game when on his back. Gaudray as an apprentice in 2021. Credit: Getty Images “He was a strong, older horse, but he still knew what a racetrack was and he did bolt off on me a few times and made me a stronger rider,” Gaudray said. Underneath the smile is a tough sportswoman, a person who had a long apprenticeship due to a number of injuries at both track work and in races, finally out-riding her claim this time last year.\n\nIn just her fourth race ride she suffered a fracture in her back and injured her knee when she tumbled off Midas Man on the dirt at Pakenham. Loading Three months later she got right back on the horse, literally, when she rode her first winner on the Carey-trained Tippitywichit at Traralgon. “I had a rough start to my apprenticeship. I had quite a few injuries at track work. Pat had a few scary horses and I would hold on for dear life,” Gaudray said. “During that [fourth] race I fractured my back and my knee but before that I did my foot, my knee, my wrist, my coccyx, the list goes on.”\n\nThe run of injuries had nothing to do with her riding ability. Nor did they deter Gaudray, who revelled in the environment and never felt an attack of nerves. “I am super, super competitive. I love winning, I just love going out there and giving my horse every chance to win the race,” Gaudray said. Carey has taught multiple apprentices. He knew Gaudray had what it would take to make it in the often brutal, relentless world of being a jockey.\n\n“From the time she started to ride she had polish, she was a good rider. She had to learn about racing. She did not have the racing smarts, but she was a natural for the competition, and she had great style, and she knew horses well,” Carey said. “[She is a] natural lightweight, incredible balance and acrobatic ability, [on the] trampoline, [doing] somersaults and tumbles and very good core strength.” Gaudray at home. Credit: Luis Enrique Ascui That strength was on display one day at apprentice school under former jockeys Alf Matthews and Darren Gauci’s tutelage, when she was challenged to an arm wrestle alongside eight of her peers – a bunch of male and female apprentices. “I wrestled one and beat one and they all wanted to have a go and I beat them all,” Gaudray said.\n\nThe giggle returns as she tells the story. It feels like the laugh is never far away. Loading Her positive outlook has helped her work through the inevitable bumps along the way, her name finding headlines for the wrong reasons before she had really started. She was suspended for three months in 2021 after being part of the now infamous jockeys’ party at a Mornington Airbnb during Victoria’s COVID-19 lockdown, an incident Carey suspects helped Gaudray recognise where the limits were to what she could and couldn’t do in a highly regulated industry. Gaudray doesn’t shy away from the incident but says it’s more the business itself than the incident that has influenced her approach to life.\n\n“In general this industry ensures you mature quickly just because you are with professional people and there is a lot of money involved and you have to be in top form to get around it all,” Gaudray said. “I would not say that particular event matured me but just racing in general.” Rider Emily Brown takes Torranzino for a run on a bush track. Credit: Jason South Cup-winning rider Michelle Payne is a fan. She was rapt to see Gaudray land a ride in the Cup. “She is a very good rider. She’s very likeable as a person and a rider so that helps obviously to gain opportunities and then you just need a bit of luck on your side. I was the same age when I had my first ride for Bart Cummings [in 2009 on Allez Wonder] and all those feelings came back,” Payne said.\n\nThose who know Gaudray well say she is quiet and happiest with her showjumping horses such as Felix and her fiance Ethan Brown, who will ride Ciaron Maher’s Middle Earth in the Cup. That laugh returns when asked whether that is true as Gaudray admits she is not sure Brown is happiest around her horses. “Ethan doesn’t really like it, but he will come wherever I drag him to,” Gaudray said. Such cheekiness has probably helped her to connect with Torranzino, a lightweight Cup chance that can be difficult to ride. Gaudray says Preusker, who trained Surprise Baby into fifth place in the 2019 Cup and 13th in 2020, has done a remarkable job to unlock the six-year-old gelding’s talent.\n\n“He was not an easy horse early doors … this time in, he has got rid of all those bad habits and I feel like I have formed a really good relationship with the horse and I feel like we get on really well,” Gaudray said. Carey says many people at Racing Victoria, the apprentice school and her peers have helped Gaudray realise her talent. He is an admirer and proud that the apprentices who pass through his stable can still walk in the back door of his house and make themselves at home. Gaudray remains grateful and connected to those who have helped along the way. “Pat was the ultimate best master I could have had. I always pop in and have a cup of coffee with him,” she said. Carey remains in her corner, his family a solid base for the young people as they mature. But as Tuesday beckons he knows Gaudray will handle the moment.\n\n“It’s great to pat them on the back when they are winning but the most important thing is to be there to support them when it all falls apart,” Carey said. Loading “It is a mentally tortuous business where you are getting heat from a lot of different areas. One thing about Celine is she is mentally tough and able to cope. She is not phased by the enormity of the task.” Payne remains the only woman to have ridden a Melbourne Cup winner but Gaudray, Jamie Melham and Rachel King are as good a chance as any heading to the barriers on Tuesday. “I’m so excited,” Gaudray said.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/trump-has-just-exposed-america-s-weakness-20251103-p5n77l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump has just exposed America’s weakness",
    "publish_date": "Mon, 03 Nov 2025 11:57:52 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "He was surrounded by hardline China hawks in that first term. They wanted to cut off access to leading-edge US technology, notably advanced semiconductors, to try to hobble China’s rapid development of 21st century technologies. They saw Trump’s tariffs through a national security lens. When that trade stoush ended in 2020 with Trump’s “first phase” deal – with China agreeing to buy more US products, notably oil and soybeans – some of Trump’s tariffs and trade restrictions were left in place. There’s now a level of global mistrust in the US that will outlive the Trump presidency. Credit: Getty Images The Biden administration maintained them and significantly tightened the restrictions on semiconductor exports in a “small yard, high fence” policy stance that was far more heavily tilted towards national security than the trade balance. In Trump’s second term, threats of even tighter technology restrictions appear less driven by national security concerns than by Trump’s fixation with US trade deficits, his suspicion that those deficits reveal something sinister (rather than a US savings rate that is lower than it needs to be to finance American living standards) and his desire to use his beloved tariffs as leverage to do commercial deals. He does love a deal.\n\nHe got one last week, one that injects a pause of at least 12 months into the US-China trade conflict. The US got a promise of some soybean purchases by China, Xi’s pledge to try to throttle the supply of precursor chemicals used in fentanyl production and an agreement that China wouldn’t implement its tighter controls of rare earth and magnet exports while the truce is in place. Loading China won a winding back of the extension of America’s “black list” of Chinese companies to cover subsidiaries, which would have expanded the number of companies prohibited from acquiring advanced US technologies from about 1300 to more than 20,000. It was only the announcement of the vastly increased list – in breach, China thought, of a standstill agreement reached earlier this year – that caused it to toughen its restrictions on rare earths and magnets.\n\nThe US has agreed to halve the 20 per cent tariff on China’s exports related to its role in fentanyl production and also to halt the imposition of steep port fees on Chinese ships docking at US ports. (China has similarly removed its retaliatory duties on US-financed ships using its ports.) What the deal struck last week highlights is the imbalance in power within the trade relationship. Trump thought access to America’s vast consumer marketplace gave him unmatchable leverage –until Xi responded by threatening to use its near-monopoly on the rare earths and rare earth magnets to almost instantly cripple US manufacturing and its defence capabilities. By slashing China’s purchases of soybeans from farmers in Trump’s midwestern political strongholds to zero in the current harvest season, Xi also showed he understands how to exploit the vulnerability of politicians in a democracy. Those soybean farmers were becoming increasingly desperate and angry.\n\nIt will take the US and its allies up to a decade to build the mines and processing infrastructure that would shield them from China’s stranglehold over critical minerals. Meanwhile, Xi has a far more potent weapon in his trade arsenal than anything Trump can call on; one he can roll out anytime the US tries to flex its muscles. It’s not the only one. China has an equally dominant position in, for instance, some key pharmaceutical products and ingredients and has the best part of a decade, and the advantages provided by a state-directed economy that is less concerned about productive uses of national capital than in its geopolitical ambitions, to develop other areas of dominance. What began as an attack on China’s exports to the US, along with an effort to stifle its technological advancements, also developed into a trade war on everyone else. China might have agreed to buy 12 million tonnes of soybeans from the US this season (though it has already secured supplies into the first part of next year) and 25 million tonnes a year for three years, but it bought about 22.5 million tonnes in the same harvest period last year. Before Trump’s 2018-19 trade war, China used to buy more than 40 per cent of the US crop. If it makes good on last week’s commitments, it will buy less than 25 per cent.\n\nChina has demonstrated that it can acquire all the beans it needs from Brazil, where it helped develop soybean production and the infrastructure to export it after the 2018-19 trade war, and more recently Argentina. Where its soybeans once represented trade leverage for the US, the roles have now been reversed. After Trump’s truly great deal with China, China still has an effective average tariff rate of about 47 per cent, though most of that relates to tariffs imposed during Trump’s 2018-19 trade war. Loading Leaving those aside, it still has a 10 per cent fentanyl-related tariff, a 10 per cent “reciprocal” tariff and exposures to Trump’s global sectoral tariffs which, relative to where it stood when Trump regained office, actually leaves it better positioned against other trading nations, who generally face US tariffs of 15 to 20 per cent (though some are 50 per cent) than it was back in February. This week, the US Supreme Court will start hearing a case brought against Trump’s reciprocal tariffs, which could force the unwinding of his reciprocal tariffs and potentially the return of billions of dollars of duties already collected.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-eliza-owen-from-cotality-on-the-rbas-impact-on-the-property-market/p8a5j3qei",
    "title": "INTERVIEW: Eliza Owen from Cotality on the RBA's impact on the property market",
    "publish_date": "Mon, 3 Nov 2025 01:40:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/optus-boss-rejects-calls-to-resign-midday-news-bulletin-3-november-2025/xsea9222g",
    "title": "Optus boss rejects calls to resign | Midday News Bulletin 3 November 2025",
    "publish_date": "Mon, 3 Nov 2025 00:57:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Optus CEO to focus on changes at company\n\nCoalition fallout over ongoing net zero debate\n\nIndia takes out cricket women's world cup title\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe chief executive of Optus has rejected calls for his resignation, saying he has the support of the Board to continue with a company-wide transformation.\n\n\n\n\n\nStephen Rue has been in the firing line from coalition and crossbench senators during a Senate inquiry into the outage for taking more than six hours to tell the communications minister and industry regulator about a massive increase in the scale of the September outage.\n\n\n\n\n\nThe company says it is adding 300 people to its Australian call centres who are focused on Triple Zero customers, and that it will onshore its network operations from offshore contractors.\n\n\n\n\n\nMr Rue has told the first day of public hearings of the inquiry that the company's investigation into what happened is ongoing.\n\n\n\n\n\n\"Let me say on behalf of Optus, the board, the executive team - and the thousands of people across Australia who work at Optus what happened on the 18th of September is unacceptable. As the CEO, I am accountable for Optus' failings. And I am deeply sorry. We are all deeply sorry. The tragic events. The tragic deaths of people will stay with us an individual’s - and as a company, as we investigate the incident.\"\n\n\n\n---\n\n\n\n\n\nAustralian Prime Minister Anthony Albanese says he has written to Turkish President Tayyip Erdogan to resolve the issue of who will host next year's COP31 summit.\n\n\n\n\n\nMr Albanese says Australia is continuing to engage with Türkiye's President to find a solution.\n\n\n\n\n\nAustralia and Türkiye have both submitted bids in 2022 to host the United Nations climate conference - and both countries have refused to concede to the other ever since.\n\n\n\n\n\nThe hosting rights are granted by consensus, not a vote - which means if the deadlock remains, the hosting rights for the event would default to the German city of Bonn.\n\n\n\n---\n\n\n\n\n\nLiberal frontbencher Andrew Bragg says he thinks the Coalition will be able to reach an agreement to retain some form of net zero policy, despite the Nationals position.\n\n\n\n\n\nOver the weekend, the Nationals voted in party room meeting to abandon net zero as a policy.\n\n\n\n\n\nIf the two parties cannot reach an agreement on climate policy, some Liberals say MPs should be prepared to end the Coalition arrangement.\n\n\n\n\n\nMr Bragg says net zero can be a part of the Coalition form, but it would need some revisions.\n\n\n\n\n\n\"You have to have net zero in some form. There is no doubt that Australia has very serious treaty obligations. Now the question of how you get to net zero is something for each country to make up their own mind on. My point is we're a serious country. We're a trade exposed nation. We're not going to walk away from international agreements. Never. We have to work harder to maintain Australia's international obligations. But do it in a way that suits the Australian economy and the Australian society.\"\n\n\n\n---\n\n\n\n\n\nSix months after being elected, the Prime Minister says his government is strengthening Medicare by lifting the number of people who can receive free GP treatments.\n\n\n\nNew changes have come into effect from November 1, making it easier to see a GP for free.\n\n\n\n\n\nThe financial incentives for GPs to bulk-bill has now expanded beyond concession card holders - or children aged 16 years and under - to include any patient eligible for Medicare.\n\n\n\n\n\nAnthony Albanese says the changes will benefit many.\n\n\n\n\"When you get sick you will get the care that you need. Not on the size of your wallet or your bank balance, you will get it on the basis of need. That is a fundamentally proud element of who we are.\"\n\n\n\n\n\nMental health consultations conducted via telehealth are now no longer exempt from the established clinical relationship requirement.\n\n\n\n---\n\n\n\n\n\nRemote and rural First Nations communities across Australia experience an average 49 disconnections from their energy retailer each year - or nearly one power cut a week.\n\n\n\n\n\nThese communities have only one option for energy - and that is prepaid or upfront payments, to connect to small local suppliers that service their area.\n\n\n\n\n\nAccording to research by the Aboriginal community and clean energy organisation, Original Power, 65-thousand First Nations Australians are impacted by this in the Northern Territory, Western Australia, South Australia and Queensland.\n\n\n\n\n\nReport co-author, Lloyd Pigram, is a researcher at the University of Notre Dame's Nulungu Research Institute.\n\n\n\n\n\nHe told SBS, the findings are eye-opening.\n\n\n\n\n\n\"The challenges of being on prepaid meters that I was first introduced when visiting family that I didn't take notice until I went and did the survey. Things that came out of the survey (include) food spoilages, old people (experiencing) chronic illnesses, running out of power as we doing it.\"\n\n\n\n---\n\n\n\n\n\nIn cricket, India has won its first-ever Women's World Cup title.\n\n\n\n\n\nThe team has held off South Africa by 52 runs in the final, in front of a sell-out home crowd at Mumbai’s DY Patil Stadium.\n\n\n\n\n\nIt is the side's third attempt at the title, after finishing as runners-up in 2005 and 2017.\n\n\n\n\n\nCaptain Harmanpreet Kaur says the win means so much.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-were-you-doing-optus-executives-grilled-over-17-hour-delay-during-triple-zero-outage/rpjblcn5c",
    "title": "'What were you doing?': Optus executives grilled over 17-hour delay during triple-zero outage",
    "publish_date": "Sun, 2 Nov 2025 20:54:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Optus executives have come under fire for delays in passing on critical information about a fatality linked to a triple-zero outage during a parliamentary inquiry.\n\n\n\n\n\nThe September outage, which stopped hundreds of Australians from making triple-zero calls, is linked to the deaths of three people.\n\n\n\n\n\nDuring a Senate investigation on Monday morning, Optus chief executive Stephen Rue was quizzed about when the telecommunications company first became aware that people had died.\n\n\n\n\n\nRue told the committee that Optus was advised of the first fatality at 8.43 pm on 18 September, and senior management were told after midnight.\n\n\n\nREAD MORE Calls mount for independent inquiry into Optus triple-zero failures\n\nRue became aware of the information around 8am on 19 Septermber, but did not contact either the government regulator or the Communications Minister until about 2.30pm.\n\n\n\n\n\n\"What on earth were you doing between 8am in the morning and 2pm?,\" Greens senator Sarah-Hanson Young asked Rue.\n\n\n\n\n\nRue said he had been in a \"series of meetings\" with his team, gathering information and completing welfare checks.\n\n\n\nOptus has come under fire for not informing Communications Minister Anika Wells about fatalities for 17 hours. Source: AAP / Mick Tsikas Hanson-Young said the 17-hour delay in communicating the severity of the outage was \"not good enough\".\n\n\n\n\n\n\"You were too busy putting your ducks in order, telling your board what was going on, contacting your executives, making sure your company's ducks were in order,\" she fired up.\n\n\n\n\n\n\"Meanwhile, the federal government, the regulator, and the minister were left in the dark.\"\n\n\n\n\n\nThe South Australian senator said the company had prioritised \"profits\" over \"people's safety\", a characterisation that Rue rejected.\n\n\n\n\n\n\"It was important to have the facts, so I had the information I could accurately provide to the ACMA and the federal government,\" he said.\n\n\n\nOptus CEO assures 'controls in place' to prevent failure\n\nAt the start of the inquiry, Rue said the September failure was \"unacceptable\" and personally apologised for the tragic event.\n\n\n\n\n\n\"I'm accountable for Optus' failings, and I'm deeply sorry. We are all deeply sorry,\" he said.\n\n\n\n\n\nHe attributed the failure to human error during a routine firewall upgrade.\n\n\n\n\n\n\"Australians can be assured we have those controls in place. People effectively didn't do their jobs,\" Rue told the committee.\n\n\n\nOffshore call centres received the complaint calls that notified Optus of the triple-zero outage. As a result of the September process failures, Rue revealed that complaint calls for triple zero, elderly and other vulnerable customers would now be handled by onshore call centres.\n\n\n\n\n\nRue defended his position at Optus, stating that a change in leadership would \"actually set back that plan, which would not be good for customers and the telecommunications sector\".\n\n\n\n\n\nOptus chairman John Arthur said Rue had been brought on the manage these sort of outages and ensure they didn't happen again. He backed him to stay on.\n\n\n\n\n\n\"There were, I think 10 failures here, 10 failures. And if you’re asking me whether I am alarmed at that, I can assure you I am,\" he said.\n\n\n\nREAD MORE Optus executives step down as triple-zero disaster fallout continues\n\n\"However, this man was brought into this company to make sure we became a company that didn’t have 10 failures like that. Now that’s his job, and I’m expecting him to finish it.\"\n\n\n\n\n\nWhen asked if anyone had been sacked as a result of the failures, both Rue and Arthur said they would \"deal with accountabilities\" after the conclusion of an independent review.\n\n\n\n\n\nThe Senate inquiry is also examining the effectiveness of emergency arrangements designed to shift customers to another network if a telco has an outage.\n\n\n\n\n\nThe communications watchdog and Optus are both running investigations into the outage.\n\n\n\n\n\nNew rules that took effect on Saturday require telcos to report outages to the communications watchdog and emergency services in real time.\n\n\n\n\n\n- with additional reporting by AAP\n\n\n\n",
    "source": "SBS",
    "cluster_id": 0
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/nationals-ditch-net-zero-as-liberals-ponder-their-own-climate-policy/v8bfx3mhi",
    "title": "Nationals ditch net zero as Liberals ponder their own climate policy",
    "publish_date": "Sun, 2 Nov 2025 19:45:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWhen the Nationals met for their Federal Council this past weekend, they made an important decision.\n\n\n\n\n\nCHAIR: \"I need to put this motion. All those in favour say aye. AYE.... ((applause))\"\n\n\n\n\n\nThe vote they took was to drop their support for Australia's net zero emissions by 2050 policy - which Nationals leader David Littleproud has maintained makes little sense.\n\n\n\n\n\n\"Domestically we've lost over seven million hectares of agricultural land and we'll lose another five million hectares of agricultural land on this trajectory that Labor is taking us... We need to understand that if there's a better way then we should explore it.\"\n\n\n\n\n\nA day later, at the full party room meeting, the Nationals made it official for their parliamentarians in Canberra.\n\n\n\n\n\n\"I'm proud to say that our party room has got to a unanimous position of scrapping net zero commitments by 2050.\"\n\n\n\n\n\nThe Nationals leader says that instead, the country's greenhouse gas emissions should be tied to an average of similar countries within the OECD.\n\n\n\n\n\n\"This is about bringing common sense back to climate and energy policy. This is about saying we're going to live up to our commitments internationally. We're going to do that sensibly - but we're going to do what they're doing - at their pace, not streak ahead.\"\n\n\n\n\n\nThe Nationals' decision has already attracted intense criticism from Labor.\n\n\n\n\n\nThe government is chasing an interim target of 62 to 70 per cent emissions cuts by 2035, and wants to achieve a target of 82 percent of electricity sourced from renewables by 2030 as part of that commitment.\n\n\n\n\n\nClimate Change Minister Chris Bowen has consequently called the Nationals' criticism of that approach monumentally shortsighted.\n\n\n\n\n\n\"The Nationals party is betraying future generations, but they're also betraying farmers and people in regional communities who can benefit from this massive transformation. They seem to be stuck in the past and despite any encouragement we can give them in the Parliament, they seem to determined to stay there.\"\n\n\n\n\n\nThe Prime Minister has also criticised the move.\n\n\n\n\n\nWhile the Nationals argue Australia's climate targets are driving up power prices and shutting down industry, Anthony Albanese has suggested any delay in reaching net zero would impose additional costs on the economy.\n\n\n\n\n\nThe regional party also argues Australia is doing more than its fair share to reduce carbon pollution - but the PM says Australia could always do more.\n\n\n\n\n\nHe says Australia also has a responsibility to act on climate change because the country - and its neighbours - are especially vulnerable to the impacts.\n\n\n\n\n\n\"We act nationally. We've submitted our NDC (nationally determined contribution) to the UN for 2035. It's an ambitious but achievable target. And it's in the interests of Australia for that to occur, just as it's in our interests to encourage global action.\"]]\n\n\n\n\n\nThe Greens Sarah Hanson-Young has also weighed in.\n\n\n\n\n\n\"The Australian people simply won't be copping such a ridiculous policy from a party that thinks they should be in government... And our Pacific neighbours are going to be furious that they hear that this type of ridiculous snake oil of a policy is being promoted by the National party - and indeed, the Coalition.\"\n\n\n\n\n\nAttention is now turning to whether the Liberals will follow suit when they meet on Friday.\n\n\n\n\n\nNet-zero policy has become a fractious issue within the federal coalition following its disastrous May election defeat.\n\n\n\n\n\nThere's speculation that the regional party's decision to walk away from formal emissions targets will anger some moderate Liberals who want to remain committed to net zero by 2050.\n\n\n\n\n\nMr Littleproud says there are similarities in terms of policy and intent between the positions of the Liberals and the Nationals, based on his conversations with energy spokesman Dan Tehan and the opposition leader Sussan Ley [[lee]].\n\n\n\n\n\nBut Coalition spokeswoman Angie Bell - who is a Liberal MP - has told Sky News that they intend to make up their own minds.\n\n\n\n\n\n\"We're not beholden to the National party. We are the Liberal party. I sit in the Liberal party room in Canberra, and we will go through our processes - which your viewers would understand would be different to the National party processes. And we will come to that in due course when we've done the work and we understand where our policy needs to be.\"\n\n\n\n\n\nThe Nationals' net zero decision could also have implications for the government's environment bill.\n\n\n\n\n\nLabor needs to secure a deal with either the Greens or the Coalition to pass these environment reforms in the Senate - and Sarah Hanson Young says the government should not be discussing the bill with the Coalition now.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-hotel-california-effect-and-how-australians-are-spending-more-on-subscriptions/tnrcf1fve",
    "title": "The 'Hotel California effect' and how Australians are spending more on subscriptions",
    "publish_date": "Sun, 2 Nov 2025 18:33:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "For Roya Raad, finding her favourite movies and music didn't come cheap, as she spent dozens of dollars a month on various subscriptions — a common experience for many Australians.\n\n\n\n\n\nBut now the 29-year-old Melburnian and her family have changed their approach by cancelling some of the subscriptions and only keeping the ones they use more regularly.\n\n\n\n\n\n\"We decided that we would just give it a break for some time, where it's Netflix and save some bucks for a couple of months,\" she told SBS News.\n\n\n\n\n\n\"We decided to cancel cause we felt like we were not getting the benefit out of it.\"\n\n\n\nRoya Raad only keeps the streaming subscriptions that she uses regularly. Source: SBS News / Supplied Now, Raad and her husband only pay for two subscriptions. Every month, they \"double check\" what they are paying and if they come to the conclusion that they are paying \"too much\" for a streaming service, they will cancel.\n\n\n\n\n\n\"We really budget very carefully. I feel like if that wasn't the case, which I assume for a lot of people that's not necessarily the case, then yes, it [the cost] definitely gets too much and it adds up,\" she said.\n\n\n\nThe subscription surge\n\nWhile Raad has managed to keep her subscription bills at a \"manageable\" rate, for many Australians, this is not the case.\n\n\n\n\n\nAccording to a new report, average monthly spending on subscriptions has increased to a record number, rising by 24 per cent from $63 to $78 in 2025, with each household having an average of 3.7 subscriptions.\n\n\n\n\n\nDeloitte’s annual Media & Entertainment Consumer Insights report shows that the number of subscriptions per household has risen by 12 per cent since last year and by 61 per cent since 2021.\n\n\n\nAccording to the survey of 2,000 Australian media consumers across five generations, 36 per cent of respondents reported that the money they spend on their subscription is over budget, and 78 per cent expressed concerns about the total cost.\n\n\n\n\n\nEighty-three per cent of respondents paid for video streaming platforms, more than half had a music streaming subscription, and one in four paid for sports.\n\n\n\n\n\n\"We live in a world now where we don't own anything, but we subscribe to everything,\" Chandni Gupta, deputy CEO and digital policy director at Consumer Policy Research Centre (CPRC), told SBS News.\n\n\n\n\n\n\"It's not surprising that those numbers are quite high and that we are paying a lot more than we probably were five or ten years ago.\"\n\n\n\nThe 'Hotel California effect'\n\nThe report said that the rise in spending is caused by a mix of shifts in market conditions and consumer behaviour.\n\n\n\n\n\nOver the past years, prices for platforms like Netflix and Spotify have increased multiple times.\n\n\n\n\n\n\"It should be really clear what you are paying for and if prices have gone up, why have they gone up,\" Gupta said.\n\n\n\n\n\n\"Because there's very little interoperability. It's really hard to suddenly move from one platform to another ... you are often locked in by the service.\"\n\n\n\nREAD MORE How much does it really cost to raise a child in Australia? Here are the numbers\n\nBut for those Australians like Raad who are trying to cancel their subscription, the process is not as easy as expected, as they find themselves in the \"subscription trap\".\n\n\n\n\n\nSubscription trap is a business tactic where a consumer is enticed into a recurring subscription by making it difficult to cancel.\n\n\n\n\n\nA 2024 CPRC report reveals that nearly half of Australians spend more time than planned trying to cancel their subscriptions, and one in ten give up while attempting to cancel a subscription.\n\n\n\n\"It's a really unfair system that's been designed very much for profit over people, and it does mean that you are holding onto subscriptions a lot longer than you probably need or want,\" Gupta said.\n\n\n\n\n\n\"It's also known as the Hotel California effect, which is based on the Eagles song. So you can check out anytime you like, but you can never leave.\n\n\n\n\n\n\"That is very much how these websites have been designed.\"\n\n\n\nAustralians 'learning to touch grass'\n\nOn the other hand, increased media and entertainment consumption is not among the reasons Australians are paying more for subscriptions.\n\n\n\n\n\nDeloitte’s report indicates that Australians spent two and a half hours less on media and entertainment compared to 2024, amounting to 42 hours and 45 minutes weekly.\n\n\n\n\n\nFor example, in 2025, Australians spent almost an hour less on streaming video services, according to the report.\n\n\n\nPeter Corbett, Deloitte Australia's telecommunications, media and technology lead partner, said: \"Time spent engaging with media and entertainment has fallen for a second year in a row, as Australians become increasingly choosy about what they consume.\"\n\n\n\n\n\n\"Australians are learning to touch grass or disconnect from technology.\"\n\n\n\n\n\nHe said the reasons for this \"isn’t quite clear\", but \"It could be a mix of factors, including — after a peak in screen time during COVID, consumers are choosing more 'in person' entertainment forms, or changing preferences for the content mix offered across media categories\".\n\n\n\nLess time scrolling, more desire for creating\n\nThe decline was not limited to the media and entertainment sectors. The report shows Australians now spend an average of five hours and 20 minutes on social media weekly, which is a 16 per cent decrease from the 6 hours and 20 minutes they spent scrolling in 2024.\n\n\n\n\n\nBoomers recorded the highest drop (27 per cent) in social media use, while Gen Z and Millennials also scrolled 14 per cent less.\n\n\n\n\n\n\"The decline in average social media use has eclipsed the broader media and entertainment consumption decline,\" Corbett said.\n\n\n\n\n\n\"Although the extent of this decline is inconsistent across demographics, as different age groups use social media in different ways for different purposes.\"\n\n\n\nAlthough social media is declining in popularity in Australia, the report shows that content creation has become more accessible and more popular than ever.\n\n\n\n\n\nAccording to the data, one in five Australians has considered becoming a content creator, with money, creative self-expression, and connection/community being their top three reasons for their desire.\n\n\n\n\n\nThe numbers are even higher for Gen Z, with 39 per cent of the generation showing a desire to be a content creator.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-is-net-zero-and-why-have-the-nationals-abandoned-it/lgsux43si",
    "title": "What is net zero, and why have the Nationals abandoned it?",
    "publish_date": "Sun, 2 Nov 2025 07:51:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "The year 2050 is planned to mark a turning point for Australia — when wind farms replace coal mines, and the country entirely erases its carbon footprint.\n\n\n\n\n\nHowever, the Nationals on Sunday announced that it will ditch the plan, after reaching a unanimous agreement in the party room meeting.\n\n\n\n\n\nThis means the party will formally abandon its previous commitment to net zero emissions by 2050, a long-standing goal of Australian governments across the political spectrum.\n\n\n\n\n\nAfter the meeting, Nationals Leader David Littleproud told the reporters: \"When you're only a bit over one per cent of total global emissions, you can hardly mitigate the world's emissions.\"\n\n\n\n\n\nThe net-zero target has also been a point of debate in the Liberal Party, following their defeat in the May Federal elections.\n\n\n\nREAD MORE Nationals abandon net zero after members vote to dump climate target\n\nOpposition energy spokesperson Dan Tehan has stated that the Liberals will likely decide on their position six to nine months after the federal election, between November and January.\n\n\n\n\n\nHere is what the net zero target exactly means, and why it has been at the centre of Australia's political debates in recent months.\n\n\n\nWhat is net zero?\n\nThe term \"net zero\" is a relatively recent scientific concept that was introduced in various research in the 2000s: humans not adding further greenhouse gases into the atmosphere and slowing down climate change.\n\n\n\n\n\nAssociate professor Ruth Morgan, director of the Centre for Environmental History at the Australian National University, told SBS News: \"The idea behind net zero is that ideally countries will be able to work towards ensuring that the amount of greenhouse gases that they emit will be offset or be countered by the amount of greenhouse gases that can be absorbed.\"\n\n\n\n\n\n\"So that we reach an equilibrium where we are not adding further greenhouse gases into the atmosphere.\"\n\n\n\n\n\nThe idea soon found its way into politics and climate diplomacy as a solution to global warming, and it was a crucial part of the 2015 Paris Agreement , a legally binding international treaty on climate change.\n\n\n\nThe agreement's aim was to limit global warming below 2 degrees, and ideally 1.5 degrees by 2050 — a goal that net zero was an important part of.\n\n\n\n\n\n\"The idea was that through cooperation, countries would ensure that they were not going to keep their economies going as business as usual,\" Morgan said.\n\n\n\n\n\n\"Now, reaching net zero is critical to doing that.\n\n\n\n\n\n\"Every country has nationally determined contributions to the Paris Agreement that they're trying to achieve ... and that's all part of trying to reach net zero, so that we are not adding more and more greenhouse gases.\"\n\n\n\n\n\nAccording to the Climate Action Tracker, an independent scientific project that tracks government climate action, as of October 2025, 145 countries have announced or are considering net zero targets.\n\n\n\nWhat does net zero mean for Australia?\n\nThe Australian government has committed to achieving net zero by 2050 and is pursuing an interim target of 62 to 70 per cent emissions cuts by 2035 compared to 2005 levels.\n\n\n\n\n\nAchieving 82 per cent of electricity from renewables by 2030 is essential for reaching Australia's climate targets.\n\n\n\n\n\nBut reaching these numbers can be challenging.\n\n\n\nREAD MORE No Australians immune: What 2050 and beyond will look like for your city\n\nFatemeh Salehi, the hub chair for the United Nations academic impact group from Macquarie University, said: \"Our economy has been tied to fossil fuels for decades. Coal and gas still make up around 65 per cent of electricity generation.\"\n\n\n\n\n\n\"The targets are ambitious but achievable, provided policy, infrastructure, and workforce development move in step.\n\n\n\n\n\n\"Meeting these goals requires a holistic approach that combines diverse renewable and low-emission solutions.\"\n\n\n\n\n\nMorgan added that the other solution that will help reach the target is \"trying to reduce the amount of land clearing\".\n\n\n\n\n\n\"That's another way in which we've traditionally added to greenhouse gases. So by trying to curb deforestation and limit the amount of vegetation that's cleared, we can also try to reduce impacts.\"\n\n\n\n\n\nWhy did the Nationals ditch the plan?\n\nSince the Coalition's historic loss in the federal elections, different factions of the opposition have criticised the net zero plan. But the Nationals' announcement on Sunday was the first official move against the target.\n\n\n\n\n\nIt is expected that the decision will likely anger some moderate Liberals who want to remain committed to achieving net zero by 2050.\n\n\n\n\n\nNationals Leader David Littleproud, however, has argued that walking away from net zero doesn't mean they are denying the existence of climate change.\n\n\n\n\n\n\"What we're saying is there's a better, cheaper, fairer way to address it,\" he said.\n\n\n\n\n\nThe regional party claims that Australia is contributing more than its fair share to reduce carbon pollution, and suggests that emissions targets should be based on the average of comparable OECD countries.\n\n\n\n\n\nLittleproud has also said the move will be welcomed by all voters because it will lead to lower energy bills.\n\n\n\n\n\nHowever, according to Morgan, abandoning the net-zero target will not benefit communities.\n\n\n\n\n\n\"It's really unfortunate because I think the Nationals are supposed to be the party of people that live in regional Australia, and yet we are seeing so often that they are representing the big mining bodies and they are not one and the same thing,\" she said.\n\n\n\n\n\n\"I don't think it's an either-or situation. We're seeing a lot of opportunities and money going into regional communities that want renewable energy to happen.\n\n\n\n\n\n\"We're seeing stonewalling, which is ultimately going to do their [the Nationals'] constituents a great disservice.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/infant-peanut-feeding-prevented-thousands-of-children-from-developing-allergies/osjtg7pg4",
    "title": "Infant peanut feeding prevented thousands of children from developing allergies",
    "publish_date": "Sun, 2 Nov 2025 04:50:04 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "A decade after a landmark study proved that feeding peanut products to young babies could prevent them from developing life-threatening allergies, a new US study has shown it's making a big difference in the real world.\n\n\n\n\n\nThe study found about 60,000 children in the United States have avoided developing peanut allergies after new guidance was issued in 2015 about when to introduce the allergen to youngsters.\n\n\n\n\n\nBefore the new guidelines, parents were warned to avoid exposing their children to potentially risky foods until they were three years old, in the hope of avoiding a full-blown allergy.\n\n\n\n\n\nPeanut allergy is one of the most common of these conditions, caused when the body's immune system mistakenly identifies proteins in peanuts as harmful and releases chemicals that trigger symptoms like hives, respiratory issues, and sometimes, life-threatening anaphylaxis.\n\n\n\n\n\nBut groundbreaking research, known as Learning Early About Peanut Allergy, or LEAP, published by professor Gideon Lack of King's College London, suggested earlier exposure might actually help children.\n\n\n\nLISTEN TO Peanut butter loving babies are licking allergies, study suggests SBS News 06:05 English\n\n\"The LEAP study ... showed that if we actually introduce that allergen to children by mouth, having them eat it, before they're introduced to it via their skin, we can reduce the risk that that child's going to go on to develop the food allergy itself,\" Dr David Hill, from the Children's Hospital of Philadelphia, told SBS News.\n\n\n\n\n\nHill has published a new study after analysing electronic health records from dozens of paediatric practices to track diagnoses of food allergies in young children before, during and after the new guidelines were issued.\n\n\n\n\n\nIt's found thousands of other children in the US have also avoided developing peanut allergies after their parents followed the dietary advice.\n\n\n\n\n\n\"What our data shows is that because of, or at least associated with those early introduction guidelines, there's about 60,000 less kids with food allergy today than there would have been. And that's a remarkable thing, right? That's the size of some cities,\" he said.\n\n\n\nAustralian research shows 'modest reduction'\n\nAssociate Professor Rachel Peters has been part of food allergy research at the Murdoch Children's Research Institute's National Allergy Centre of Excellence.\n\n\n\n\n\nShe said at least two major studies have been completed in Australia in the last decade to explore what might prevent such allergies in the first place — one before Australia adopted new infant feeding guidelines in 2016, and one after.\n\n\n\n\n\n\"We had two population-based studies recruited in the same region, which was Melbourne, Australia,\" she said.\n\n\n\n\"So we had two cohorts recruited with exactly the same methods, but 10 years apart.\"\n\n\n\n\n\nShe said the research measured what parents were doing in early feeding practices, which showed that nearly 90 per cent of babies were being fed peanut-containing products in the first year of life, as recommended by the guidelines.\n\n\n\n\n\nThe research showed a \"modest reduction\" in food allergy but not as much as researchers expected.\n\n\n\n\n\n\"Even though we are certainly starting to see a reduction in the rates of peanut allergy in Australia, they are still quite high, and higher than in some other countries around the world, and higher than what was shown in this American study as well,\" she said.\n\n\n\nLISTEN TO Australia - allergy capital of the world SBS News 06:23 English\n\nPeters says the Australian findings suggest much more study needs to be done to establish the various causes of food allergies.\n\n\n\n\n\nShe said some research — including exploration of whether less sunlight and vitamin D exposure increases the likelihood of developing allergies — has offered promising evidence.\n\n\n\n\n\n\n\n\"We even see that within Australia. We have higher rates of food allergy in Melbourne compared to what we see in Queensland,\" she said.\n\n\n\n\n\nAccording to the charity group Allergy and Anaphylaxis Australia, peanut allergy is one of the most common food allergies in childhood in Australia, affecting three per cent of infants up to the age of 12 months.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/genea-lawsuit-data-breach/y51bccpmv",
    "title": "Victims of IVF provider data breach seek compensation in complaint to national regulator",
    "publish_date": "Sun, 2 Nov 2025 04:49:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "Patients from Genea, one of Australia's largest IVF clinics, are seeking compensation after their sensitive medical information was published on the dark web earlier this year.\n\n\n\n\n\nThe representative complaint, a type of complaint lodged by an individual on behalf of two or more people, was sent to the Office of the Australian Information Commissioner on 20 October. Melbourne law firm Phi Finney McDonald is acting on behalf of affected patients.\n\n\n\n\n\nThe complaint alleges the company failed to take reasonable steps to protect information from misuse, interference, loss, and unauthorised access.\n\n\n\nIt also alleges Genea failed to destroy or remove information once it was no longer needed, and that it breached its obligations under the Privacy Act 1988 by not informing affected individuals sooner.\n\n\n\n\n\nGenea - one of Australia's largest IVF clinics — has 19 clinics across Australia, and one clinic in Thailand. It specialises in IVF, genetic testing, egg and sperm freezing, and fertility testing.\n\n\n\nCyber incidents are up 11 per cent from last year with large organisations being the main target, according to the Australian Signals Directorate. Source: AAP / Dominic Lipinski The complaint could pave the way for compensation for patients whose data was hacked.\n\n\n\nGenea apologises for incident\n\nIn February, Genea Fertility informed clients via email that personal data had been breached by cybercriminals and posted to the dark web.\n\n\n\n\n\nThe exposed data includes the medical histories, diagnoses, treatments, and prescription medications of those clients, as well as pathology and diagnostic test results.\n\n\n\n\n\nIn July, the clinic confirmed it had finished its investigation and was \"starting to communicate directly with individuals about the findings … relevant to them\".\n\n\n\n\n\nPrincipal lawyer for Phi Finney McDonald, Olivia McMillan, said hundreds of people had contacted them \"distressed that their personal information had been accessed by unauthorised parties\".\n\n\n\n\"Patients at Genea expected their highly sensitive medical, personal, and financial information on the company's systems to remain private and confidential,\" she said in a statement.\n\n\n\n\n\nA spokesperson for Genea told SBS News it has partnered with IDCARE, Australia's national identity and cyber support service, to provide counselling and other assistance at no cost for people who had been impacted, as well as opened a dedicated call centre and email.\n\n\n\n\n\n\"We thank our community for their understanding during our investigation into this cyber incident,\" the spokesperson said.\n\n\n\n\n\n\"We deeply regret that personal information was accessed and published and sincerely apologise for any concern this incident may have caused.\"\n\n\n\n'Like you're being punished'\n\nFormer Genea patients told SBS News they were concerned about the implications of the data breach.\n\n\n\n\n\nIsaac, who donated sperm through the company, expressed concerns he had shared extensive personal health and biological information using the clinic's services, and a breach of that data could impact not only them, but also children conceived through his sperm.\n\n\n\n\n\n\"This is some of the most sensitive information about me,\" he said.\n\n\n\nREAD MORE How a fertility clinic hack turned Isaac’s good deed into a privacy disaster\n\n\"It's supposed to be a good deed. It's almost like you're being punished because your information was held on a computer system.\"\n\n\n\n\n\nIsabel Lewis, who conceived her twin boys through IVF eight years ago, says she was informed by email in February that her personal data had been breached and posted on the dark web.\n\n\n\n\n\nLewis told SBS News in September the data breach had shaken her confidence in the industry, and she was considering legal action.\n\n\n\n\n\nIsabel Lewis had her twin boys through IVF eight years ago. Source: Supplied \"I'm not doing it for the money, although money is fine and all, but if there are damages that are significantly painful, hopefully — and maybe I'm deluded — the business will change their practices so that they don't have damages like that again.\"\n\n\n\n\n\nThe Australian Signals Directorate (ASD) revealed earlier in the month there had been an 11 per cent rise in cyber incidents compared to last year, with almost half of the incidents targeting organisations.\n\n\n\n\n\nClarification: This article has been updated to clarify when Genea started contacting those affected by the breach.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/addition-of-kidney-disease-medicine-to-pbs-expected-to-benefit-over-65-000-australians/i75n8la4w",
    "title": "Peter is part of Australia's 'silent epidemic'. A new initiative offers hope",
    "publish_date": "Sat, 1 Nov 2025 23:28:30 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "More than 65,000 Australians are expected to benefit from cheaper access to a medicine for chronic kidney disease recently added to the Pharmaceutical Benefits Scheme (PBS).\n\n\n\n\n\nJardiance, also known as Empagliflozin, is a medication that can slow kidney damage over time and help preserve kidney function for longer.\n\n\n\n\n\nHealth Minister Mark Butler says it's a life-changing drug for many Australians.\n\n\n\n\n\n\"Last year, we listed Jardiance for a limited group of Australians with a particular type of kidney disease. But from Saturday, we think another 70,000 Australians with kidney disease will become eligible for this life-changing drug,\" he said on Tuesday.\n\n\n\nAccording to the 2021 Census, around 1 per cent of the Australian population is living with kidney disease, with one in twenty Australians aged 75 and above being diagnosed with the disease.\n\n\n\n'It's gonna make a big difference'\n\nPeter Brown, who was diagnosed with kidney disease two years ago and has been relying on medication to improve his condition, said he was pleased to learn his upcoming medication bill can be cheaper\n\n\n\n\n\n\"It's gonna make a big difference, and the fact that $7.70 is a big difference when you work it out over 12 months,\" said Brown, referring to the concession-card rate for a single script of Jardiance.\n\n\n\n\n\nFor eligible patients without a concession card, a script now costs $31.60. From next year, the price will be further lowered to $25.\n\n\n\nHealth Minister Mark Butler says Jardiance, also known as Empagliflozin, is life-changing for many Australians. Source: AAP / Mick Tsikas Butler said kidney disease was a silent epidemic in Australia.\n\n\n\n\n\n\"We think more than two and a half million Australians have kidney disease, but less than 10 per cent of them know about it, because the signs and symptoms of kidney disease usually only become apparent when it's as much as 90 per cent of loss of kidney function has already taken place.\"\n\n\n\n\n\nProfessor Carol Pollock, the chair of Kidney Health Australia, also stresses the importance of conducting health checks to detect the asymptomatic disease.\n\n\n\n\n\n\"To pick up kidney disease, what we really need is a blood test, a blood pressure check and a urine test. And some people will have some of these tests done, but not always together, and we really need the three of them to be done,\" she said.\n\n\n\n\n\n\"And what we would like to see is a kidney health check that meant that people would have those things done and then have an understanding of what the risk the kidney disease could be and allow it to be appropriately treated.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-mary-wooldridge-ceo-of-the-workplace-gender-equality-agency/avdh8sd5t",
    "title": "INTERVIEW: Mary Wooldridge, CEO of the Workplace Gender Equality Agency",
    "publish_date": "Sat, 1 Nov 2025 22:31:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/england-introduces-new-law-to-make-social-housing-safe-after-toddlers-death/w5mmwwawe",
    "title": "England introduces new law to make social housing safe after toddler’s death",
    "publish_date": "Sat, 1 Nov 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nTikysha Thomas lives in social housing in the UK with her 14 year-old daughter.\n\n\n\n\n\ner home is covered in mould, with dirty water dripping down the walls, and mould spores embedded in almost every surface.\n\n\n\n\n\n\"Over the period of 2,3 years, it's become this where both, two ceilings have collapsed.\"\n\n\n\n\n\nMs Thomas says she's reported the condition of her home to the landlord numerous times, but there has been no improvement.\n\n\n\n\n\nMany housing associations say they don't have the money to carry out the renovations - but Ms Thomas is reaching the end of what she can cope with.\n\n\n\n\n\n\"It's really tough...sorry.\"\n\n\n\n\n\nTikysha's experience is not unique.\n\n\n\n\n\nThe BBC reports that 1.3 million dwellings across England - or five percent of total properties - had problems with damp in at least one room in 2023, which means more than a million children have lived in damp households.\n\n\n\n\n\nAmong them was the Abdullah family - and their experience was ultimately one that ended in tragedy.\n\n\n\n\n\nFaisal Abdullah's 2 year old son Awaab Ishak developed respiratory failure and ultimately died after inhaling the black mould in his parents' flat in Rochdale, Greater Manchester.\n\n\n\n\n\nFamily lawyer Kelly Darlington read a statement from the family after the inquest that said Faisal had been unable to get his housing association - Rochdale Boroughwide Housing - to act on the problems in his social housing several years ago.\n\n\n\n\n\n\"We felt like we were getting nowhere, and we weren't. Often our calls weren't even answered.\"\n\n\n\n\n\nAt the time of the inquest, coroner Joanne Kearsley had said there was little doubt that the tragic death of Awaab Ishak should be a defining moment for the housing sector.\n\n\n\n\n\nNow the UK government has enacted a new law that makes landlords responsible for investigating any potential emergency hazard within 24 hours of being made aware of it.\n\n\n\n\n\nChief Executive of the National Housing Federation, Kate Henderson, has said in a statement that her organisation fully supports it - and has already been making an effort to improve things.\n\n\n\n\n\n\"Since 2020 housing associations have increased spending on repairs and maintenance by 55%, with plans to spend a further £50bn over the next five years. This is why 90% of our homes meet the decent homes standard, more than all other tenures.\"\n\n\n\n\n\nThe law is named after Faisal's son.\n\n\n\n\n\nThe UK's Housing Secretary Steve Reed says the first phase of the law requires landlords to investigate other hazards and and confirm them within 10 days, while work to remedy the problem must begin within 12 weeks.\n\n\n\n\n\n\"(If) Landlords don't meet the requirements of the new legislation they'll find themselves in the dock in court. And they face enforcement action or a fine.\"\n\n\n\n\n\nFurther legislation is expected in the next couple of years to cover the safety of homes in the private rented sector.\n\n\n\n\n\nSteve Reed has told Sky News that more of Awaab’s Law will be phased in next year and in 2027 to make homes safer from more hazards, alongside work to build 1.5 million new properties, including what he has described as the biggest boost of social and affordable housing in a generation.\n\n\n\n\n\n\"We want everybody, whatever kind of property they're renting, to have the assurance that what happens to little Awaab cannot happen to anyone else... You know, Awaab's Law coming into force today is such an important step.\"\n\n\n\n\n\nStill, the Housing Ombudsman Richard Blakeley has already identified some issues - what he's called pinch points where there could be challenges as social landlords meet their obligations.\n\n\n\n\n\nHe says there must be an ethical internal complaints procedure that offers opportunities for genuine apologies, and clear and enforceable timeframes as issues are resolved.\n\n\n\n\n\nMeanwhile, in Wellingborough, a family is being moved back into their house which has been cleaned of mould.\n\n\n\n\n\nMAN 1: \"Are you happier now?\"\n\n\n\n\n\nMAN 2: \"Yeah, yeah.\"\n\n\n\n\n\nWhile the new law has come too late for his family, Abdullah still hope the first round of the new law will do some good, especially for families like these.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/sport/racing/danny-russells-tips-for-the-2025-melbourne-cup-20251103-p5n7cm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Danny Russell's Tips for the 2025 Melbourne Cup",
    "publish_date": "Mon, 03 Nov 2025 13:03:54 +1100",
    "category": "sports",
    "authors": [],
    "text": "Danny Russell's Tips for the 2025 Melbourne Cup\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-liberal-leaders-face-fresh-pressure-over-nationals-dumping-of-net-zero-11-injured-one-still-fighting-for-life-after-uk-train-mass-stabbing-20251103-p5n76y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Ley’s leadership in peril as senior Liberals move to dump net zero; Optus chair stands by CEO after Triple Zero outage",
    "publish_date": "Mon, 03 Nov 2025 12:57:17 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Earlier this year, this masthead’s Bidding Blind investigation revealed that prospective home buyers are being frequently misled by unrealistic price guides.\n\nThe project analysed more than 36,000 property sales in Melbourne and Sydney across 18 months and found that more than half of homes put up for auction in Australia’s two largest cities sold above the top end of the price guide (even when allowing for 10 per cent wriggle room in Sydney).\n\nA special investigation of 26,000 auctions reveals just how badly Melbourne’s property guide system misleads buyers. Credit: Mark Stehle\n\nOne of the ways agents get away with underquoting is by encouraging homeowners to allow them to advertise their properties at a lower price than they would be prepared to sell for, the investigation found.\n\n“The argument [from the agent] was, ‘You’ve got to create competition in the marketplace. If we go to auction, we would need to list for less so the auctioneer can build competition amongst the bidders,’” said Melbourne woman Maree.\n\nWe’re looking to speak to people who have recently sold a home about their experience of underquoting and price guides. You can contact journalist Aisha Dow on aisha.dow@nine.com.au or fill in the survey (leaving your contact details) below.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-man-stabbed-in-neck-with-fork-20251031-p5n6py.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Man ‘stabbed in neck with fork’; Premier promises e-bike crackdown; Beetlejuice the Musical coming to Brisbane",
    "publish_date": "Mon, 03 Nov 2025 12:42:56 +1100",
    "category": "finance",
    "authors": [],
    "text": "Do not be fooled by the patches of blue sky this morning, Brisbane is in for another muggy and stormy day.\n\nBrisbane avoided the worst of the storms this weekend and today’s storms are also expected to be less severe.\n\nIt is expected to begin raining across the city from 10am, with thunderstorms to roll in from 4pm.\n\nThe humidity level is currently at 79 per cent, making the temperature of 26 degrees feel more like 30 degrees.\n\nWhile it is hot and humid, at least it’s not a repeat of last Monday when Brisbane sweltered through its hottest October day in 21 years.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/business/banking-and-finance/westpac-profits-dip-to-6-9-billion-rams-home-loans-sold-20251103-p5n77h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Westpac boss says selling $21.4b RAMS loan book will help cut costs",
    "publish_date": "Mon, 03 Nov 2025 12:39:11 +1100",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "Westpac chief executive Anthony Miller says offloading the $21.4 billion RAMS home loan portfolio will help the bank’s long-term plan to streamline its technology and cut costs, even though the sale will reduce the bank’s market share.\n\nAs Westpac delivered a 1 per cent fall in full-year profits on Monday, it also announced it was selling the RAMS home loan portfolio to a consortium, a move that will result in Westpac losing a chunk of the mortgage market.\n\nWestpac has about 21 per cent of the home loan market at present, but its loans are spread across three different banking systems: one for Westpac–branded loans, one for St George and regional brands such as Bank of Melbourne, and one for RAMS.\n\n“In effect, I’ve got three small banks, three small bank cost challenges, three small bank compliance, three small bank risk challenges in managing the mortgage book,” Miller said.\n\nThe bank is undergoing a major technology project that will result in all its loans being moved onto one system, and this would have required significant spending for the RAMS loan book. Selling RAMS allowed the bank to achieve its goals faster and more efficiently, Miller said.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/technology/rue-refuses-to-resign-as-optus-unveils-triple-zero-overhaul-20251102-p5n73t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Savaged Optus boss faces claims of misleading Senate",
    "publish_date": "Mon, 03 Nov 2025 12:27:33 +1100",
    "category": "finance",
    "authors": [
      "David Swan"
    ],
    "text": "“It seems very clear that it was more important to you and to your executive team to make sure your corporate ducks were in order, that your profits will be in order, than people’s safety and transparency with government,” she said. “You didn’t give any further update... even when you knew on the Thursday night that it was worse than you had previously informed the government.” Pressed repeatedly on why he didn’t immediately provide updated information about the true number affected or deaths, Rue insisted he “wanted to provide accurate information” but admitted that his call to notify the regulator came nearly 18 hours after learning of the first fatality. Rue also conceded there were delayed welfare checks on at-risk customers as engineers scrambled to manually identify failed emergency calls. In his opening statement, Rue announced that Optus would add 300 people to its Australian call centres focused on Triple Zero customers and would on-shore its network operations from offshore contractors, in response to the catastrophic network failure.\n\nHe said Optus accepted full responsibility for the failures and said he “regretted reforms were not embedded earlier to prevent them”. Loading “We are all deeply sorry, the tragic deaths of people during this outage will stay with us as individuals and as a company, as we investigate and build on our response while progressing a sweeping transformation of Optus,” he said. “We will add around 300 people to our Australian call centres focused on Triple Zero and vulnerable customers, including our specialist care teams helping customers in rural areas, elderly customers or those with serious medical conditions. “In May this year, the board approved a management proposal to take back in-house network activities currently performed by Nokia, both onshore and offshore. At the time, the aim was to transition this work progressively to May 2027, but I have now asked the networks team to accelerate the move.\n\n“In addition to the on-shoring activities in call centres and networks, we are also recruiting 150 people to be part of a new Process Centre of Excellence in Australia, to accelerate the transformation and overall procedures across the business.” Loading Rue pushed back on calls for his resignation that have come from across the political spectrum. “I firmly believe that another change of leader at this time is not what Optus needs or what our customers need. The disruption and uncertainty could actually set back the transformation underway and create further risks,” he said. Optus chair John Arthur backed his chief executive, but promised future consequences for staff responsible for the Triple Zero outage.\n\n“That’s his job. Now, he’s partway through this job and I’m expecting him to finish it,” Arthur said. “Because I never in my life want to be in the position I’m in today where I have to answer these sorts of questions about a company I’m associated with.” He said once an internal Optus review, a review by the regulator, and the Senate inquiry were finalised, there would be consequences for both junior and senior staff. “I can assure you that there will be [accountabilities] when the dust settles. And what I mean by that is that when we have all of the facts… the board will deal with accountabilities.” The crisis stemmed from a botched firewall upgrade at Regency Park exchange in South Australia, where technicians failed to redirect traffic before locking down a critical “session border gateway”, according to Optus’ submission to the inquiry. Optus’ Paul O’Sullivan, former chairman, John Arthur, chairman, and Stephen Rue, CEO, at the Triple Zero service outage hearing at Parliament House in Canberra on Monday. Credit: Alex Ellinghausen\n\nThe submission reveals Nokia contractors used an outdated procedure document and incorrectly rated the change as “zero risk”, bypassing crucial engineering reviews. It states that Nokia personnel selected an “outdated Method of Procedure (MOP) document” for the change. This outdated document “did not include making changes... to ‘offload’ traffic from the Session Border Gateway” before applying the lock. Loading The work was also brought forward 24 hours without proper authorisation. Automated alarms for general call failures were generated within minutes of the outage starting. Those alerts, at 12.20am on September 18, were dismissed as routine maintenance activity, while five customer calls reporting Triple Zero failures between 10.13am and 2.57pm went unescalated – a “serious process issue” that Optus acknowledged was unacceptable.\n\nThe outage wasn’t identified until 1.17pm when South Australian Ambulance Service called Optus directly. Services were restored by 2.34pm, but the damage was done. Efforts to conduct welfare checks on affected customers were then delayed because the technical fault meant that standard Call Detail Records (CDRs) “showed no unsuccessful calls”. Engineers had to devise new methods to identify affected customers, with the first 100 identified by 7.50pm – more than five hours after services were restored. A further 524 customers were identified the next morning, followed by seven more days later. Welfare checks didn’t commence until 8.34pm on September 18, with Optus learning of the first fatality at 8.43pm. By Friday afternoon, three deaths had been reported, rising to four by Saturday. The company has appointed former Sydney Water chief executive Dr Kerry Schott to lead an independent review, and engaged consulting firm Kearney to oversee network management improvements. The inquiry continues.",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/sport/racing/melbourne-cup-2025-20251103-p5n7bt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Melbourne Cup 2025",
    "publish_date": "Mon, 03 Nov 2025 12:24:24 +1100",
    "category": "sports",
    "authors": [],
    "text": "The Melbourne Cup is almost upon us, and this is the easiest and best way to organise your home, party or office sweep. Enter the player names, get your picks and watch the race. Easy.\n\nNovember 1, 2025",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/india-wins-the-odi-world-cup-20251103-p5n7br.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "India wins the ODI World Cup",
    "publish_date": "Mon, 03 Nov 2025 12:16:40 +1100",
    "category": "sports",
    "authors": [],
    "text": "India wins the ODI World Cup\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/traveller/inspiration/fiji-s-best-places-to-stay-20230220-h29yh1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fiji’s best places to stay, whatever your budget",
    "publish_date": "Mon, 03 Nov 2025 12:12:59 +1100",
    "category": "finance",
    "authors": [
      "Craig Tansley"
    ],
    "text": "Advertisement\n\nInspirationFiji Fiji’s best places to stay, whatever your budget Craig Tansley Updated November 3, 2025 — 12:12pm , first published April 4, 2023 — 9:55am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThis article is part of Traveller’s Holiday Guide to the best of the Pacific. See all stories .\n\nKokomo has just 21 villas and all are located right on the beach with their own plunge pool. Kokomo Private Island Resort From rustic hostels and bures set on quiet beaches to private island retreats frequented by Hollywood stars, Fiji has somewhere to stay for every traveller and every budget. Wherever you choose, famously friendly service, and immersion in local culture and cuisine is guaranteed. VITI LEVU (MAIN ISLAND) Crowne Plaza Fiji Nadi Bay Resort & Spa\n\nAdvertisement\n\nPerfect for: Couples and families who like amenities as much as a sandy beach\n\nThis premium resort is located a convenient five kilometres from Nadi International Airport, so you can either use it as a convenient stopover for first or last nights, or spend your whole holiday here. Rebuilt on the site of a former Pullman resort on underrated Wailoaloa Beach, seven swimming pools link a variety of suites and rooms with 10 bar and dining options, including a cool speakeasy-style whiskey bar (something very different for the South Pacific). The property welcomed 60 new two-bedroom family rooms and 16 oceanfront suites at the start of 2025.\n\nCrowne Plaza Fiji Nadi Bay Resort & Spa; +679 670 0700. See fijinadibay.crowneplaza.com. From $430 a night. Fiji Beach House Perfect for: Budget travellers, adventurous families, groups\n\nHow’s this for Fiji’s best-kept secret; a beach retreat on the Coral Coast with its own beach with bungalows that cost less than the price of a round of drinks at some five-star resorts. Choose between bungalows ideal for couples or dorm rooms for groups of friends (or budget travellers) set in hectares of forest beside the beach, with a pool looking over the ocean. Fiji Beach House is the base for an aquatic adventure operation so you can choose between surf trips, paddle-boarding, snorkelling, fishing tours and more. Feast on fresh seafood and local produce at their on-site restaurant.\n\nQueens Highway, Coral Coast; +679 992 9500. See fijibeachhouse.com. From $160 a night. Fiji Marriott Resort Momi Bay\n\nAdvertisement\n\nPerfect for: Couples and families alike, which isn’t always the case in Fiji\n\nFiji Marriott Resort Momi Bay is both a romantic adults-only retreat for couples and a stylish family resort for parents who want to step beyond the typical family resort. Guests choose between adults-only overwater bungalows, or family-friendly rooms. There’s also an adult’s only bar and fine dining restaurant built on a cliff looking across the Mamanuca Islands. Families have a choice of four dining options. Set beside the sea and around a man-made lagoon surrounded by green grassy hills (and cows), it’s hard to believe you’re 25 minutes drive from Nadi International Airport.\n\nSavusavu Road, Momi Bay; +679 670 7000. See marriott.com. From $545 a night Matanivusi Beach Eco Resort Perfect for: Solo travellers, couples and families seeking water adventure\n\nYou don’t have to surf to stay here, but you’ll wish you did when you see the perfect uncrowded waves – but just being here is enough for anyone who likes the ocean. Off a secret road between the Coral Coast and Pacific Harbour, you’ll pass through a village to an eco-retreat built in coastal forest beside a stunning lagoon. Villas are connected by a boardwalk built above the forest, among 400-year-old fig trees. Meals are served communally with produce from an onsite organic garden – and there’s yoga and massage.\n\nVunaniu Road, Serua; +679 992 3230. See surfingfiji.com. From $415 a night.\n\nAdvertisement\n\nGrand Pacific Hotel Fiji Perfect for: Solo travellers and couples interested in history and culture\n\nIt’s a side of Fiji you mightn’t think of. Most of us rush to Fiji’s island resorts, but you could choose to look back at the South Pacific’s colonial-era times by sleeping at the South Pacific’s most iconic colonial-era hotel. Built in 1914, stay in the suite Queen Elizabeth has slept in four times. The hotel has housed every major dignitary to visit Fiji (Fiji’s parliament is across the road). Its walls record black-and-white memories of them all. Located in Suva, check out nearby historic botanic gardens, restaurants and bars and enjoy high tea on your private lawn.\n\nVictoria Parade, Suva; +679 3222 2000. See grandpacifichotel.com.fj. From $310 a night. Shangri La Yanuca Island\n\nAdvertisement\n\nPerfect for: Families and couples who may never leave the resort\n\nDrive 50 minutes south of Nadi International Airport and you’ll find Shangri La Yanuca Island connected by a causeway. It’s surrounded entirely by water, so you never have far to go to swim. There are four restaurants and two bars all on the waterfront, in a resort modelled on a traditional Fijian village. It’s perfect for families for its kids’ clubs, free activities and family-friendly amenities, but then couples also have the option of staying in its adults only Reef Wing or making use of its award-winning day spa, a short walk away.\n\nYanuca Island, Coral Coast; +679 652 0155. See shangri-la.com/yanucaisland/fijianresort. From $335 a night. YASAWA ISLANDS Waya Island Resort Perfect for: Couples who want a romantic retreat they won’t be paying off for years\n\nFiji’s latest couples-only private island retreat is a lot more accessible than some others spread across Fiji. It’s luxurious, but not over-the-top so. Chefs prepare meals in a home-style cooking format using ingredients grown on the island or caught from the sea. Built on an island in the less-explored Yasawa Islands, guests are surrounded by dramatic volcanic peaks and the kind of drop-dead perfect beach and calm blue water these islands are known for. Access is by way of ferry. Or blow the budget with a helicopter in and out.\n\nWaya Island Resort; +679 998 2288. See wayaisland.com. From $595 a night.\n\nAdvertisement\n\nYAUKUVE LEVU ISLAND Kokomo Private Island Resort Perfect for: Solo travellers and couples with an unlimited budget\n\nIt’s not cheap; but you’ll be staying on a 60-hectare island with no more than 50 guests surrounded by the Astrolabe Reef, one of the largest, most pristine coral gardens in the world (there’s 40 private dive sites off-shore). Only reachable by helicopter or seaplane, Kokomo Private Island Resort is in Fiji’s rarely visited Kadavu Islands. There are 21 seaside villas set beside some of the best beaches in Fiji. Despite its price tag, its piece de resistance is a bar/ restaurant cobbled together with driftwood and items from a Suva boatyard where guests watch baby black-tip reef sharks in an open-air eatery a metre above the sea.\n\nYaukuve Island, Kadavu; +679 776 441. See kokomoislandfiji.com. From $2100 a night. MAMANUCA ISLANDS\n\nAdvertisement\n\nCastaway Island Resort Perfect for: Families who don’t want to stray far\n\nThere’s nowhere safer for families to stay than Castaway Island Resort. Set on a 70-hectare island surrounded entirely by beaches and lagoons protected by coral reefs in the Mamanuca Islands, it’s a 90-minute ferry ride from Port Denarau. Stay in thatched bures set out like a traditional Fijian village. Guests congregate by the island’s best beach and swimming pools, to watch the sun setting. There are four restaurant/ bars to choose from (including one where you dine barefoot under the stars) or access nearby islands by speedboat.\n\nQalito Island, +679 666 1233, outrigger.com/fiji/castaway-island-fiji. From $790 a night. VANUA LEVU Jean-Michel Cousteau Resort Fiji\n\nAdvertisement\n\nPerfect for: Couples and families who adore the water\n\nEscape to Fiji’s second largest island, Vanua Levu, to find one of the South Pacific’s best combined family and couples luxury resorts. Located along a white-sand bay at the north of the island, you might guess that any resort owned by a relative of diving pioneer, Jacques Cousteau, is proud of its diving offering. Access some of the best dive sites on Earth at sites nearby, such as Namena Reef, which offers some of the most diverse fish and coral species in the world. Families have free kids’ club, dusk-to-dawn nanny service and a variety of activities, and couples have adults-only dining and luxury spas.\n\nLesiaceva Point Road, Savusavu; 03 9815 0379. See fijiresort.com. From $1737 a night. VOMO ISLAND Vomo Island\n\nAdvertisement\n\nPerfect for: Mums and dads who are couples too\n\nYou don’t have to go far in Fiji to escape to islands completely removed from its main island. Take a boat (or helicopter or seaplane) from main tourist hub, Denarau Island, and some of Fiji’s best islands – the Manamucas – are just there. The most removed is Vomo Island – a private island resort at the northern end of the archipelago. There’s no-one else on the island – though if you want more privacy, there’s a tiny islet you can reach with a two-minute boat ride. Couples love Vomo Island’s romantic restaurants and bars, but families have options with kids’ clubs, water activities and kids’ dining while parents escape to an adults-only restaurant.\n\nVomo Lai lai Island. Phone: +679 776 7955 or 1800 324 916. See vomofiji.com. From $1840 a night. Outrigger Fiji Beach Resort Perfect for: Families looking for an easy Fiji holiday\n\nPicture a Fijian family resort: staff greeting you with bula, kids playing in kids’ clubs by the beach, kava dished out by friendly locals, dance performances by night, nightly buffets, swim-up pool bars. That’s Outrigger Fiji Beach Resort. While it’s not for everyone (couples might be advised to steer clear), this is the ultimate South Pacific family resort. There is a free kids’ club, nanny services, complimentary beach activities like beach volleyball and paddle-boarding and eight bars and restaurants – but there’s also adult’s only restaurants and swimming pools to flee to when you drop the kids off. A multi-million revamp completed in 2023 introduced new waterslides, premium bures and upgraded recreation facilities.\n\nSydney Drive, Queens Highway, Sigatoka; +679 650 0044. See outrigger.com/fiji/fiji-beach-resort. From $358 a night Mantaray Island Resort\n\nAdvertisement\n\nPerfect for: Budget-minded adventurous families, couples and solo travellers\n\nThe Yasawa Islands remain one of Fiji’s best-kept secrets: 20 islands open to land-based tourism only since the late-’80s. While it’s home to some of Fiji’s most expensive private island retreats, why not stay beside the water for less than $150 per night? Take a catamaran from Port Denarau and sleep beside your own beach, close to some of the best diving and snorkeling in Fiji. Between May and October, these waters become the best spot on Earth to swim with manta rays. There’s a PADI dive school on site, and other activities such as fishing tours, guided snorkeling and village visits.\n\nNanuya Balavu Island, Yasawas; +679 776 6351. See mantarayisland.com. From $178 a night Wakaya Island Club & Spa Perfect for: Couples with unlimited budget to disappear\n\nEntrance is by propeller plane only, but that’s the whole point. There’s only 10 suites and two villas and with the dining and activities options available, chances are you won’t see any other guests. With that kind of privacy you might imagine the guests who’ve come before (did anyone say … Tom Cruise?). Everything is perfect here because you paid for it to be. Sleep beside a beach that fronts onto a Marine Protection Area where you snorkel or dive some of the most pristine reefs on Earth. Meals are served pretty much anywhere you like.\n\nWakaya Island; +679 344 8128. See wakayaresort.com. From $3870 a night.\n\nSign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now.\n\nTraveller Guides",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/traveller/inspiration/fiji-s-best-restaurants-and-bars-20230303-h2a8wy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fiji’s best restaurants and bars",
    "publish_date": "Mon, 03 Nov 2025 12:10:51 +1100",
    "category": "finance",
    "authors": [
      "Craig Tansley"
    ],
    "text": "Advertisement\n\nInspirationFiji Fiji’s best restaurants and bars Craig Tansley Updated November 3, 2025 — 12:10pm , first published April 4, 2023 — 10:01am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThis article is part of Traveller’s Holiday Guide to the best of the Pacific. See all stories .\n\nWith nearly 40 per cent of its population made up of those of Indian heritage, Fiji has one of the most diverse of all South Pacific cuisines. Combined with its indigenous cooking techniques and abundance of fresh produce and seafood, dining in Fiji is a big part of the reason for visiting. From fine dining beside the ocean to eating traditional dishes in rustic, inexpensive cafes, the dining choices in Fiji are out of this world. MAMANUCA ISLANDS\n\nAdvertisement\n\nMalamala Beach Club For a dining experience completely different to everything else in Fiji\n\nYou’d come for the novelty factor alone: Malamala Beach Club is the world’s first beach club on its very own island and it’s only half an hour by ferry from Port Denarau. Buy a day pass and hit the spa, and the island’s pools and stunning beaches. Its food offerings have been overshadowed; but this is a heck of a venue for a meal. There’s a choice between restaurants - dine pool-side or opt for the adult’s only area. The chicken curry is one of the best you’ll find in a country famous for them; though the loaded fries (with bacon and beef brisket) are legendary too.\n\nMalamala Island, Mamanuca Islands. Phone +679 999 5512. See malamalabeachclub.com/eat-drink Cloud 9\n\nAdvertisement\n\nWood-fired pizza and drinks in the middle of the ocean\n\nCloud 9 is one of Fiji’s most iconic dining and drinking options. It’s a floating two-level platform in the middle of the lagoons around the Mamanuca Islands, close to Fiji’s most legendary surf break, Cloudbreak. Take a boat transfer (or arrive by jet-ski or seaplane) from Port Denarau and enjoy a lunch of hand-made Italian pizza cooked in a wood-fired on-site oven. Eat on the sundeck or grab a day bed, and listen to DJs as you order cocktails from the bar and swim straight off the platform in some of the most pristine waters of Fiji.\n\nMamanuca Islands. Phone: +679 869 7947. See cloud9.com.fj VITI LEVU Broady’s Bar & Cafe Well-priced no-frills meals served for locals\n\nIt’s simple, inexpensive and it quickly became one of Fiji’s hottest eating venues – there’s live music here at nights and some of the best cocktails you’ll find in Melanesia. But owner Michael Broadridge wanted to make his bar/café a one-stop shop for everything from a hearty breakfast with Fiji’s best coffee, to dinners and nighttime entertainment. Situated just off the Queen’s Road in the Nadi suburb, Martintar, eating here is a great way to mix with Fijian locals away from the resorts. Don’t go past the grilled catch of the day with creamy ota (a local fern that is a Fijian delicacy).\n\nCnr Queens Road and Zahoor St, Nadi, Viti Levu. Phone: +679 672 2193. See facebook.com/BroadysBC\n\nAdvertisement\n\nTiko’s Floating Restaurant & Bar Where else should you eat seafood but on a boat?\n\nThis place has built itself a solid reputation among locals and more experimental tourists alike. Located on Suva Harbour, the nation’s capital is often overlooked. But getting here for a famous Tiko’s seafood feast as the sun sets over the harbour will make your holiday extra-special. Located on a two-storey boat whose lower deck is a bar and upper deck is a restaurant, the atmosphere is always charged. Try its iconic curried mud crab (qari) in coconut cream; not before a Margarita below.\n\nStinson Parade Road, Suva Harbour, Viti Levu. Phone +679 450 2959. See facebook.com/tikosfloatingrestaurant Wicked Walu Photo: Alamy\n\nAdvertisement\n\nSeafood delicacies on a private islet\n\nLocated within a resort (outside diners are welcome) easily accessible on Viti Levu’s Coral Coast, here’s another Fijian restaurant you can’t beat for location. Built on a tiny islet off the mainland, guests walk along a causeway lit up with flaming tiki torches to a restaurant on its own island. You can choose to dine by candlelight on the beach, or within an open-sided traditional Fijian-style pavilion. Seafood is the specialty here – the restaurant is Trip Advisor’s Top-Rated seafood restaurant in Fiji. Order a seafood platter for two – though children are welcome if you prefer to share the intimate experience.\n\nQueens Road, Warwick, Viti Levu. Phone: +679 653 0555. See warwickhotels.com Kanavata (Nunuku Resort) Personalised meals for couples in the treetops\n\nThere's a thousand romantic dining options across Fiji in its five-star resorts and hotels. But there's one option that really stands out – simply for its location. Travel to Pacific Harbour on Viti Levu's south coast and enjoy a romantic meal for two on a viewing platform built right up amongst the canopy of a local dilo tree overlooking a beach. A dedicated chef will cook for your tastes, with seafood caught in Beqa lagoon a specialty (with everything from lobster, octopus to snapper available). Consider a spa treatment on the platform after your meal. You don't have to be a guest.\n\n11 Nanuku Drive, Pacific Harbour, Viti Levu. Phone: +679 345 2100. See nanukuresort.com Baka Blues Cafe\n\nAdvertisement\n\nCelebrating USA’s Southern barbecue… in Melanesia\n\nThere’s always been something quirky about Pacific Harbour, the lesser-known tourist hub past the Coral Coast on Fiji’s main island, Viti Levu. Home to a collection of bars, restaurants and cafes that break the mould of what you’d expect to find in Fiji – Baka Blues Cafe is a New Orleans inspired blues bar which celebrates the American Deep South. You’ll find local musicians, photos from the South and a menu celebrating Southern barbecue, Creole and Cajun food (don’t go without trying the sizzling baby back ribs or Texas T-bone). It’s a sports bar too – though families are encouraged to sit where kids can play the giant Jenga blocks.\n\n1342 Hibiscus Drive, Port Harbour, Viti Levu. Phone: +679 992 7453. See restaurantsnapshot.com/BakaBluesCafe Ocean Terrace (Bedarra Beach Inn) Wholesome Fijian fare served in a cosy setting\n\nCentrally located on the Coral Coast, you won’t find better curries anywhere in Fiji (all are served with various home-made chutneys). And yet Ocean Terrace Restaurant is most famous for its local lobster – cooked in a bisque and laced with brandy. Sit outside on the veranda overlooking the pool to the lagoon beyond for either breakfast, lunch or dinner. Dinner includes candlelight and live music. Don’t go past their coconut pancake rolls with local fish, though their kokoda (raw local fish marinated with coconut milk and lime) shouldn’t be missed.\n\nSunset Strip, Korotogo, Sigatoka, Viti Levu. Phone: +679 6500 476. See bedarrafiji.com Bulaccino\n\nAdvertisement\n\nA casual farm-to-table cafe and restaurant\n\nThis was the café that kicked off Fiji’s café culture when it opened in 2006, making the country a genuinely legitimate destination for coffee aficionados. Though coffee’s just part of what you’ll get. Run by a local family, most ingredients come straight off the owners’ 12 hectare organic farm just outside Nadi (you can take a farm tour), making this a bona fide farm-to-table eatery. The setting’s casual but chic – art deco with an open-air bar set in a garden outside. Locals love it, so it’s a great way to immerse yourself into the Nadi community away from the resorts of Denarau Island. There’s also an outpost in Suva.\n\nQueens Road, Namaka, Nadi, Viti Levu. Phone: +679 672 8638. See bulaccino.com Geckos Resort Restaurant Great seafood and curries served with a weekend dance show\n\nGeckos Resort Restaurant is a Coral Coast dining institution – home to one of the most lively Polynesian dance and fire shows in Fiji. Located within a low-key 28-room resort set in an historic village, it’s only 500 metres from the Shangri La Resort, and a few minutes from Sigatoka Town. Visit on a Friday and Saturday night for an hour-long dance and fire show. Turn up early for happy hour from 5-7pm, and order local mud crab and lobster delivered fresh that morning, or curry cooked by a local Indo-Fijian chef.\n\nQueens Highway, Sigatoka, Viti Levu. Phone: +679 652 0200. See facebook.com/GeckosResort Waitui Bar & Grill (Sofitel Fiji Resort & Spa)\n\nAdvertisement\n\nSeafood and meat chargrilled at a beachside setting\n\nDenarau Island has multiple dining options. One of the best options amongst an array of offerings at five-star resorts is Sofitel Resort & Spa’s exclusive adults-only restaurant, Waitui Bar & Grill. There’s a colonial feel to the open-air, multi-level restaurant beside the beach, with its weatherboard slats and big timber bar (the perfect spot for sunset drinks). Meat and seafood is cooked on a house-built charcoal grill – most ingredients are sourced locally. The lobster’s a house specialty, and the cocktail list is overwhelming. Dishes are designed with sharing in mind.\n\nDenarau Island, off Viti Levu. Phone: +679 675 1111. See sofitel-fiji.com Indigo Indian Asian Restaurant The best Indian food on Viti Levu\n\nWith nearly 40 per cent of Fiji’s population having Indian heritage – Indo-Fijian flavours are almost as big a part of the diet as indigenous flavours. And some of the best Indo-Fijian flavours are available at centrally located Indigo Indian Asian Resort on the waterfront at Port Denarau. Try the local masala crab or the musallam of lamb with chillies and spices grown at the restaurant’s own organic farm. There are two separate menus – Indian and South-East Asian – so it’s like having two restaurants in one. Get there early for a sunset over the ocean.\n\nPort Denarau, Denarau Island, Viti Levu. Phone: +679 675 0026. See www.indigofiji.com VANUA LEVU\n\nAdvertisement\n\nNamale Resort & Spa Romantic fine dining on another level\n\nYou’re going to have to stay to eat here – and kids aren’t welcome – but Namale Resort & Spa offer foodies the ultimate Fijian dining experience. There are two restaurants on-site, but you can dine out where you like – from a candlelit cave, to a table on the beach, or a table set beside a private waterfall. All produce comes from the resort’s own organic farm and a local market. Located on Fiji’s second-largest island, Vanua Levu, the resort is built along its stunning northern coastline, called Hibiscus Highway. There’s a weekly Indian and lovo (underground oven) night.\n\n1 Hibiscus Highway, Savusavu, Vanua Levu. Phone: +679 885 0435. See namalefiji.com\n\nSign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Fiji\n\nOceania\n\nFoodie travel Craig Tansley is a Gold Coast-based freelance travel writer with a specialty in adventure, and a background in the South Pacific.\n\nTraveller Guides",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/katoa-suffering-seizures-after-hia-chaos-20251103-p5n7bj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Katoa suffering seizures after HIA chaos",
    "publish_date": "Mon, 03 Nov 2025 12:06:45 +1100",
    "category": "finance",
    "authors": [],
    "text": "Katoa suffering seizures after HIA chaos\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-age-when-pay-equality-for-women-gets-much-worse-20251031-p5n6v1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The age when pay equality for women gets much worse",
    "publish_date": "Mon, 03 Nov 2025 12:00:26 +1100",
    "category": "finance",
    "authors": [
      "Millie Muroi"
    ],
    "text": "Pay imbalances accelerate for Australian women once they hit their mid-30s, as a landmark report shows the country has made scant progress on workplace gender equality in the last decade.\n\nAn index developed by researchers at Sydney University shows women were still more likely to carry a bigger domestic work load and to be working below their skill level, despite the figures showing a 3-point improvement in the index from 2014 to 2024.\n\nOn its scale from 0 to 100 (with 100 indicating total equality), Australia was still 17 points away from achieving perfect gender equality at work. It is the first comprehensive, national snapshot of the problem over a period of 10 years – and the first of its kind globally.\n\nThe research team, led by professors Elizabeth Hill and Rae Cooper, gave Australia a score of 92 for gender equality in hourly pay. But because men earn higher bonuses and overtime, “women make 76 cents for every dollar men make”, they found.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/racing/she-broke-her-back-in-her-fourth-race-now-celine-gaudray-will-ride-in-the-melbourne-cup-20251030-p5n6fc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "She broke her back in her fourth race. Now Celine Gaudray will ride in the Melbourne Cup",
    "publish_date": "Mon, 03 Nov 2025 11:59:05 +1100",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "Trainer Paul Preusker has Geelong Cup-winner Torranzino ready for the Melbourne Cup. Credit: Jason South On Tuesday, just five years after her first race ride in a maiden at Moe in June 2020, she will ride in her first Melbourne Cup aboard the Paul Preusker-trained Torranzino. When the gates open, Gaudray will become just the 11th woman to ride in the Cup’s history. “She’s gifted in a lot of ways on horseback. She has a good understanding of horse movement, is incredible at riding horses over jumps and jumping big fences on horses bareback,” Carey said. “For a girl her age she was pretty fearless and ready to advance her riding at an early age. She was a bit daring.” Gaudray has a winning laugh too.\n\nIt lands as regularly as her mounts on raceday (30 per cent of her rides have finished in the placings) and emerges as soon as she recalls the education she had working with Carey and his wife Cheryl as she learnt the skills needed to become a jockey. Carey paired her up with a former racehorse I Maximus, a stable favourite who was smart enough to be reliable but in the trainer’s words, “not bombproof”. It meant whoever was riding him needed to be on their game when on his back. Gaudray as an apprentice in 2021. Credit: Getty Images “He was a strong, older horse, but he still knew what a racetrack was and he did bolt off on me a few times and made me a stronger rider,” Gaudray said. Underneath the smile is a tough sportswoman, a person who had a long apprenticeship due to a number of injuries at both track work and in races, finally out-riding her claim this time last year.\n\nIn just her fourth race ride she suffered a fracture in her back and injured her knee when she tumbled off Midas Man on the dirt at Pakenham. Loading Three months later she got right back on the horse, literally, when she rode her first winner on the Carey-trained Tippitywichit at Traralgon. “I had a rough start to my apprenticeship. I had quite a few injuries at track work. Pat had a few scary horses and I would hold on for dear life,” Gaudray said. “During that [fourth] race I fractured my back and my knee but before that I did my foot, my knee, my wrist, my coccyx, the list goes on.”\n\nThe run of injuries had nothing to do with her riding ability. Nor did they deter Gaudray, who revelled in the environment and never felt an attack of nerves. “I am super, super competitive. I love winning, I just love going out there and giving my horse every chance to win the race,” Gaudray said. Carey has taught multiple apprentices. He knew Gaudray had what it would take to make it in the often brutal, relentless world of being a jockey.\n\n“From the time she started to ride she had polish, she was a good rider. She had to learn about racing. She did not have the racing smarts, but she was a natural for the competition, and she had great style, and she knew horses well,” Carey said. “[She is a] natural lightweight, incredible balance and acrobatic ability, [on the] trampoline, [doing] somersaults and tumbles and very good core strength.” Gaudray at home. Credit: Luis Enrique Ascui That strength was on display one day at apprentice school under former jockeys Alf Matthews and Darren Gauci’s tutelage, when she was challenged to an arm wrestle alongside eight of her peers – a bunch of male and female apprentices. “I wrestled one and beat one and they all wanted to have a go and I beat them all,” Gaudray said.\n\nThe giggle returns as she tells the story. It feels like the laugh is never far away. Loading Her positive outlook has helped her work through the inevitable bumps along the way, her name finding headlines for the wrong reasons before she had really started. She was suspended for three months in 2021 after being part of the now infamous jockeys’ party at a Mornington Airbnb during Victoria’s COVID-19 lockdown, an incident Carey suspects helped Gaudray recognise where the limits were to what she could and couldn’t do in a highly regulated industry. Gaudray doesn’t shy away from the incident but says it’s more the business itself than the incident that has influenced her approach to life.\n\n“In general this industry ensures you mature quickly just because you are with professional people and there is a lot of money involved and you have to be in top form to get around it all,” Gaudray said. “I would not say that particular event matured me but just racing in general.” Rider Emily Brown takes Torranzino for a run on a bush track. Credit: Jason South Cup-winning rider Michelle Payne is a fan. She was rapt to see Gaudray land a ride in the Cup. “She is a very good rider. She’s very likeable as a person and a rider so that helps obviously to gain opportunities and then you just need a bit of luck on your side. I was the same age when I had my first ride for Bart Cummings [in 2009 on Allez Wonder] and all those feelings came back,” Payne said.\n\nThose who know Gaudray well say she is quiet and happiest with her showjumping horses such as Felix and her fiance Ethan Brown, who will ride Ciaron Maher’s Middle Earth in the Cup. That laugh returns when asked whether that is true as Gaudray admits she is not sure Brown is happiest around her horses. “Ethan doesn’t really like it, but he will come wherever I drag him to,” Gaudray said. Such cheekiness has probably helped her to connect with Torranzino, a lightweight Cup chance that can be difficult to ride. Gaudray says Preusker, who trained Surprise Baby into fifth place in the 2019 Cup and 13th in 2020, has done a remarkable job to unlock the six-year-old gelding’s talent.\n\n“He was not an easy horse early doors … this time in, he has got rid of all those bad habits and I feel like I have formed a really good relationship with the horse and I feel like we get on really well,” Gaudray said. Carey says many people at Racing Victoria, the apprentice school and her peers have helped Gaudray realise her talent. He is an admirer and proud that the apprentices who pass through his stable can still walk in the back door of his house and make themselves at home. Gaudray remains grateful and connected to those who have helped along the way. “Pat was the ultimate best master I could have had. I always pop in and have a cup of coffee with him,” she said. Carey remains in her corner, his family a solid base for the young people as they mature. But as Tuesday beckons he knows Gaudray will handle the moment.\n\n“It’s great to pat them on the back when they are winning but the most important thing is to be there to support them when it all falls apart,” Carey said. Loading “It is a mentally tortuous business where you are getting heat from a lot of different areas. One thing about Celine is she is mentally tough and able to cope. She is not phased by the enormity of the task.” Payne remains the only woman to have ridden a Melbourne Cup winner but Gaudray, Jamie Melham and Rachel King are as good a chance as any heading to the barriers on Tuesday. “I’m so excited,” Gaudray said.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/trump-has-just-exposed-america-s-weakness-20251103-p5n77l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump has just exposed America’s weakness",
    "publish_date": "Mon, 03 Nov 2025 11:57:52 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "He was surrounded by hardline China hawks in that first term. They wanted to cut off access to leading-edge US technology, notably advanced semiconductors, to try to hobble China’s rapid development of 21st century technologies. They saw Trump’s tariffs through a national security lens. When that trade stoush ended in 2020 with Trump’s “first phase” deal – with China agreeing to buy more US products, notably oil and soybeans – some of Trump’s tariffs and trade restrictions were left in place. There’s now a level of global mistrust in the US that will outlive the Trump presidency. Credit: Getty Images The Biden administration maintained them and significantly tightened the restrictions on semiconductor exports in a “small yard, high fence” policy stance that was far more heavily tilted towards national security than the trade balance. In Trump’s second term, threats of even tighter technology restrictions appear less driven by national security concerns than by Trump’s fixation with US trade deficits, his suspicion that those deficits reveal something sinister (rather than a US savings rate that is lower than it needs to be to finance American living standards) and his desire to use his beloved tariffs as leverage to do commercial deals. He does love a deal.\n\nHe got one last week, one that injects a pause of at least 12 months into the US-China trade conflict. The US got a promise of some soybean purchases by China, Xi’s pledge to try to throttle the supply of precursor chemicals used in fentanyl production and an agreement that China wouldn’t implement its tighter controls of rare earth and magnet exports while the truce is in place. Loading China won a winding back of the extension of America’s “black list” of Chinese companies to cover subsidiaries, which would have expanded the number of companies prohibited from acquiring advanced US technologies from about 1300 to more than 20,000. It was only the announcement of the vastly increased list – in breach, China thought, of a standstill agreement reached earlier this year – that caused it to toughen its restrictions on rare earths and magnets.\n\nThe US has agreed to halve the 20 per cent tariff on China’s exports related to its role in fentanyl production and also to halt the imposition of steep port fees on Chinese ships docking at US ports. (China has similarly removed its retaliatory duties on US-financed ships using its ports.) What the deal struck last week highlights is the imbalance in power within the trade relationship. Trump thought access to America’s vast consumer marketplace gave him unmatchable leverage –until Xi responded by threatening to use its near-monopoly on the rare earths and rare earth magnets to almost instantly cripple US manufacturing and its defence capabilities. By slashing China’s purchases of soybeans from farmers in Trump’s midwestern political strongholds to zero in the current harvest season, Xi also showed he understands how to exploit the vulnerability of politicians in a democracy. Those soybean farmers were becoming increasingly desperate and angry.\n\nIt will take the US and its allies up to a decade to build the mines and processing infrastructure that would shield them from China’s stranglehold over critical minerals. Meanwhile, Xi has a far more potent weapon in his trade arsenal than anything Trump can call on; one he can roll out anytime the US tries to flex its muscles. It’s not the only one. China has an equally dominant position in, for instance, some key pharmaceutical products and ingredients and has the best part of a decade, and the advantages provided by a state-directed economy that is less concerned about productive uses of national capital than in its geopolitical ambitions, to develop other areas of dominance. What began as an attack on China’s exports to the US, along with an effort to stifle its technological advancements, also developed into a trade war on everyone else. China might have agreed to buy 12 million tonnes of soybeans from the US this season (though it has already secured supplies into the first part of next year) and 25 million tonnes a year for three years, but it bought about 22.5 million tonnes in the same harvest period last year. Before Trump’s 2018-19 trade war, China used to buy more than 40 per cent of the US crop. If it makes good on last week’s commitments, it will buy less than 25 per cent.\n\nChina has demonstrated that it can acquire all the beans it needs from Brazil, where it helped develop soybean production and the infrastructure to export it after the 2018-19 trade war, and more recently Argentina. Where its soybeans once represented trade leverage for the US, the roles have now been reversed. After Trump’s truly great deal with China, China still has an effective average tariff rate of about 47 per cent, though most of that relates to tariffs imposed during Trump’s 2018-19 trade war. Loading Leaving those aside, it still has a 10 per cent fentanyl-related tariff, a 10 per cent “reciprocal” tariff and exposures to Trump’s global sectoral tariffs which, relative to where it stood when Trump regained office, actually leaves it better positioned against other trading nations, who generally face US tariffs of 15 to 20 per cent (though some are 50 per cent) than it was back in February. This week, the US Supreme Court will start hearing a case brought against Trump’s reciprocal tariffs, which could force the unwinding of his reciprocal tariffs and potentially the return of billions of dollars of duties already collected.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://au.news.yahoo.com/major-changes-every-aussie-today-203553883.html",
    "title": "Major changes for every Territorian",
    "publish_date": "2025-11-03T01:20:53Z",
    "category": "finance",
    "authors": [],
    "text": "Massive changes to how Territorians and millions of Aussies receive healthcare are now in place.\n\nThe changes impact Medicare and the Pharmaceutical Benefits Scheme (PBS), two core pillars of Australia’s healthcare system, and also aged care.\n\nHere’s everything you need to know.\n\nBULK BILLING\n\nBulk billing means a visit to the doctor is completely free.\n\nThe government pays the doctor a fee for your visit, called a Medicare rebate, rather than you paying the doctor.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBut a lot of GP clinics don’t operate on full bulk billing, which means Aussies sometimes have to shell out some money on their visit to a practice.\n\nThis is sometimes called a “gap fee” or an “out-of-pocket” cost.\n\nThat’s because clinics are businesses and some doctors don’t receive enough revenue from government bulk billing fees to cover their costs.\n\nBut now, the government is trying to change all that by ramping up incentives for doctors to provide bulk billing.\n\nIt’s called the Bulk Billing Practice Incentive Program.\n\nThe government is trying to encourage more doctors to bulk bill. Picture: Supplied\n\nWHAT IS CHANGING?\n\nSimply put, the government is increasing the Medicate rebate and incentive payments it pays to doctors, hoping more doctors will be incentivised to offer patients full bulk billing.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBelow is a table that shows the current rebate levels and the new total payments that a bulk-billing practice would receive under the scheme.\n\nNote, the totals include the Medicare rebate, the bulk-billing incentive item rebate and a 12.5 per cent bulk-billing practice incentive program payment.\n\nThe increases are substantial. For a standard consultation in a city, the payment has increased 62 per cent from $42.85 to $69.56.\n\nFor a remote area, standard consultation payments jump 103 per cent to $86.91.\n\nCommon GP Visits Current Medicare Rebate Cities and metro areas Regional centre Large and medium rural towns Small rural town Remote Standard Consultation (6-20 minutes) $42.85 $69.56 $80.71 $82.71 $84.86 $86.91 Long consultation (20 to 40 minutes) $82.90 $114.61 $125.76 $127.76 $129.91 $131.96 Longer consultation (40-60 minutes) $122.15 $158.77 $169.92 $171.92 $174.07 $176.12 Mental Health Plan (20 to 40 minutes) $81.70 $99.06 $102.71 $103.36 $104.11 $104.76\n\nSource: RACGP, Federal Department of Health\n\nThere’s a second, connected part to the government’s push to expand bulk billing.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIt involves expanding eligibility for the Medicare Benefits Schedule (MBS) bulk-billing incentives (BBIs).\n\nAt the moment, MBS BBIs are reserved for children under the age of 16 and Commonwealth concession card holders.\n\nNow, it is expanding to include all Medicare-eligible patients.\n\nBBIs are additional MBS payments the government makes to a doctor when they bulk bill a patient, on top of the standard Medicare rebate.\n\nWhat does this mean for you?\n\nIf GP clinics take up the offer to participate and become full bulk-billing clinics, it means more free doctor visits.\n\nCONTRACEPTION COSTS CUT IN HALF\n\nAlongside changes to the GP landscape, Aussies will now enjoy improved access to contraception health care.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe NuvaRing is now listed on the PBS.\n\nThe government subsidises medicines listed on the PBS, making them more affordable.\n\nNuvaRing is a flexible vaginal ring that comes in a pack of three. It releases a combination of oestrogen and progestogen to prevent ovulation and is used on a monthly cycle, offering an alternative to daily oral contraceptives.\n\nBefore the PBS listing, women might have paid more than $270 a year for the option.\n\nNow, they will pay $31.60 per script or $7.70 with a concession.\n\nEach script covers three months of contraception, so the listing essentially cuts the price of the conceptive by half.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nPrices will decrease further from January 1 to a maximum of $25 per script.\n\n“For too long, women’s health needs were sidelined, but the Albanese government is changing that and delivering more choice, lower costs and better health care,” Health Minister Mark Butler said.\n\n“Australia has one of the lowest uptake rates in the developed world of long-acting contraceptives, partly due to access and affordability.\n\n“These changes to MBS and expanded options though the PBS will remove cost and access barriers so that more women can choose the contraceptive option that works best for them.”\n\nAGED CARE\n\nLast year, the government passed the Aged Care Act 2024, changing how support for the elderly is funded.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe government will fully fund all clinical care for people in aged care homes, but older people will be required to make means-tested co-contributions for their non-clinical care and everyday living services, according to the Older Person Advocacy Network.\n\nEveryday services include meals, cleaning and laundry, while non-clinical care includes personal care and mobility assistance.\n\nContributions will be capped at $105.30 a day, or $135,318 over a lifetime, for non-clinical care.\n\nSupport for older people living at home also changes.\n\nA new Support at Home program replaces the older Home Care Packages program and the Short-Term Restorative Care program.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSupport at Home has eight funding classifications, ranging from about $11,000 a year to $78,000 a year, an OPAN fact sheet states.\n\nThe Aged Care Act 2024 changes how aged care is funded and also tries to improve protections for the elderly. Picture: Supplied\n\nRecipients receive a budget aligned with their assessed funding classification.\n\n“Recipients will work with their aged care provider to allocate their budget across three broad service categories, tailored to their needs,” the fact sheet states.\n\nClinical supports, such as nursing and physiotherapy\n\nIndependence services, including personal care, respite care, transport and social support\n\nEveryday living services, such as cleaning, gardening, and meal delivery\n\nThe government fill cover the cost of clinical supports, but older people will make contributions to the “independence” and “everyday living” buckets.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nContribution levels depend on income and asset assessments by Services Australia.\n\nAlongside changes to funding models, the Act tries to entrench safety and decision-making power for older people.\n\nFor one, the legislation enshrines protection for whistleblowers, including older people, families or aged care workers who report a person or organisation that has not followed the Aged Care law.\n\nWhistleblowers can make reports anonymously to the Aged Care Quality and Safety Commission, the federal health department, a registered provider or aged care worker, a police officer or an independent aged care advocate.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“If someone makes a report, they will be protected from any negative results that come from making the report,” the government states.\n\n“(And) Have their identities or identifying information protected, with some exceptions – for example, where it is necessary to share information with the ACQSC or a lawyer or to prevent a serious threat to a person or people.”",
    "source": "Yahoo",
    "cluster_id": 36
  }
]