[
  {
    "url": "https://www.9news.com.au/national/time-using-phone-on-toilet-increases-haemorrhoids-risk-study-finds/d8181d04-0e70-4b6d-b0b9-c9abe2dee70c",
    "title": "Using your phone on the toilet could bring a very painful result",
    "publish_date": "Thu, 04 Sep 2025 01:21:25 +0000",
    "category": "lifestyle",
    "authors": [
      "Sep"
    ],
    "text": "We can now add \"sitting on the dunny\" to the growing list of things smartphones and social media are helping to ruin.\n\nA new study out of the US found that people who used their phone while sitting on the toilet had a significantly higher risk of developing haemorrhoids.\n\n﻿Cethan Ramprasad and colleagues, from Beth Israel Deaconess Medical Centre, reported that out of their survey participants, 66 per cent reported using smartphones on the toilet, and they tended to be younger than non-users.\n\nSpending more time on the toilet - while scrolling on a phone, for example - can increase the risk of haemorrhoids. (Getty)\n\nAfter statistically accounting for other factors thought to possibly be linked with hemorrhoid risk – such as exercise habits, age, and fibre intake – the researchers found that participants who used a smartphone on the toilet had a 46 per cent higher risk of hemorrhoids than non-users.\n\nStrictly speaking, it's not the phone itself that's the issue, but the increased amount of time users spend on the porcelain throne while staring at the screen.\n\n\"It's incredibly easy to lose track of time when we're scrolling on our smartphones—popular apps are designed entirely for that purpose,\" study senior author Trisha Pasricha said.\n\n\"But it's possible that constantly sitting longer on the toilet than you intended because you're distracted by your smartphone could increase your risk of hemorrhoids.\n\n\"We need to study this further, but it's a safe suggestion to leave the smartphone outside the bathroom when you need to have a bowel movement.\"\n\n﻿Dr Jarrah Dowrick, research fellow with the Gastrointestinal Research Group at the Auckland Bioengineering Institute at the University of Auckland, was sceptical of the direct phone link but said the result was an \"important finding\".\n\n\"While the reality of modern screen addiction does make the smartphone narrative more compelling, the real story here is that spending longer on a seated toilet appears to be linked with haemorrhoid presentation,\" he said.\n\n\"Phone or no, this study suggests limiting each visit to the toilet to five minutes when possible﻿.\"\n\nVictoria University digital wellness expert Dr Alex Beattie﻿ said the study provided another example of how smartphones had infiltrated every corner of people's lives.\n\n\"It's quite telling that the study found men were more likely than women to use their phones on the toilet, though this difference wasn't statistically significant,\" Beattie said.\n\n\"Still, it reflects a broader truth of this digitally saturated era – that smartphones are often used as a form of escape: from parenting, from domestic routines, and sometimes from other people.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/what-happened-to-office-cubicles-open-plan-distractions/b59cf341-38f1-4cee-8f72-3b777cc15acb",
    "title": "The office cubicle once reigned supreme. Could it make a comeback?",
    "publish_date": "Wed, 03 Sep 2025 23:54:01 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Imagine having your own space at work. For most Australians working in corporate offices, it's a far-off dream.\n\nMore than 2.2 million Aussies aged 15 to 24 were employed in July 2025, most of whom have only ever known the chatter and distraction of open-plan offices.\n\nBut there was a time – one older members of the workforce still recall – when the cubicle reigned supreme in offices all over the country.\n\nCubicles made a comeback in the TV series Severance, but could they return to Aussie offices? (Apple TV+)\n\nA time before hotdesking and being exposed to every sight, sound and smell in the office was the norm, despite how detrimental it can be to our ability to actually work.\n\nBut as businesses try to coax ﻿employees back into offices after years of work-from-home (WFH) arrangements, could 2025 be the year Australia finally resurrects the cubicle?\n\nOne expert says it's not entirely out of the question.﻿\n\nThe death of the office cubicle\n\nOnce an Aussie office staple, cubicles were largely phased out by the 2000s.\n\nThey were meant to be an affordable alternative to private offices that still gave employees a sense of space and privacy.\n\nBut over time, some employees and employers came to view \"cubicle farms\" as oppressive and isolating.\n\nOnce an office staple, cubicles came to be seen as oppressive and isolating over time. (Getty)\n\nMany adopted ﻿open-plan layouts instead.\n\nPopularised by architect Frank Lloyd Wright﻿, egalitarian open-plan offices would ﻿encourage workers to communicate, collaborate, solve problems and generate ideas.\n\nOr so the theory went.﻿\n\n﻿\"Unfortunately, it hasn't actually worked out that way,\" MBA director and Associate Professor of Organisational Behaviour at Bond University, Dr Libby Sander told 9news.com.au.\n\n\"If we look at a big body of research over the last 15 years, what it shows conclusively is that just putting people together in one room doesn't make them do all those things.\n\n\"In fact, it can often do the opposite.\"\n\nThe open-plan problem\n\nTo work in an open-plan office is to be distracted.﻿\n\nAussie workers report the constant noise makes it significantly harder to get work done, with some saying they can be ﻿distracted 80 times in a single morning.\n\nIt doesn't even need to be a direct distraction, like being asked a question or roped into a conversation, either.\n\nAussie workers report that open-plan offices are rife with distractions, much like the Dunder Mifflin office in The Office TV series. (NBC)\n\n﻿A study Sander ran found that ﻿workers exposed to standard open-plan office noise, even over a short period of time, experienced a 34 per cent spike in physiological stress and a 25 per cent increase in negative mood.\n\n\"When you couple that with the interruptions and distractions of people actually coming up and talking to you, or having a meeting next to your desk ... it's very, very difficult for people to do focused and concentrated work,\" Sander said.\n\n\"They become more withdrawn, even hostile in some cases ... because they get very, very frustrated that they just can't concentrate.\"\n\nResearch also shows it can take up to 20 minutes to get back on task after being distracted – and that's bad for business.\n\nIt's part of why so many Aussies have latched onto WFH arrangements and refuse to let go, even years post-pandemic.﻿\n\nThe highest paid jobs that let you work from home View Gallery\n\nThe rise of ﻿hotdesking and \"activity-based working\" hasn't helped either.\n\nWhile it can work for some industries and roles, even Sander agreed \"a lot of people are very unhappy with\" having to share desks with colleagues that don't always clean up after themselves – if they can find a desk at all.﻿\n\n﻿Resurrecting the cubicle - or something like it\n\nWith many businesses still trying to coax﻿ workers back into the office, now seems like the perfect time to address the layout issues that make staff reluctant to return.\n\n\"Companies are starting to realise the impact that noise, distraction and interruption actually has on their employee, which is their biggest expense,\" Sander said.\n\n\"And that the savings you make in real estate by not giving everyone their own space, or cramming everyone into an open plan space, doesn't actually pay off in the long term.\"\n\nAccording to Sander, \"cramming everyone into an open plan space, doesn't actually pay off in the long term\". (Getty Images/iStockphoto)\n\nBut the solution isn't as simple as resurrecting cubicles in every office.\n\nInstead, Sander recommended businesses design office layouts specific to ﻿the work employees need to get done.\n\nThat could mean cubicles, private offices, or a well-designed open-plan ﻿layout with private spaces available.\n\nSome companies have already invested in small, free-standing office \"booths\" where staff can work without distraction.﻿\n\nIt may also mean allowing long-term WFH arrangements; whatever works best for staff just trying to get the job done.﻿\n\n\"There isn't a one-size-fits-all answer,\" Sander said.\n\n\"Because ultimately, you need to have a variety of options for people who have a variety of needs﻿.\"\n\nSmall, free-standing office 'booths' can allow staff to work without distraction. (Getty)\n\nAnd with a looming talent shortage, ﻿aging populations and declining birth rates, businesses that don't try to meet staff needs risk falling behind those that do.﻿\n\n\"As we understand more and more the impact of noise and distraction, we are going to see better-designed offices with better acoustics, more dividers, less open-plan space, so people can actually concentrate and get their work done,\" Sander said.\n\n\"If you're not doing that, your competitors are already doing it or going to do it, and you're going to get left behind.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/yacht-tips-over-in-water-on-maiden-voyage-turkey/0c694476-e035-4580-a163-dd198f5643c0",
    "title": "Disaster strikes luxury yacht minutes into maiden voyage",
    "publish_date": "Wed, 03 Sep 2025 21:42:14 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "The $1.5 million vessel was in the water off the coast of\n\nTurkey\n\nfor just minutes before it began to slowly tip over﻿.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/pancreatic-cancer-remember-september-danielle-ozolins-story-exclusive/3292398c-94da-4b23-b234-c9c5679a2eae",
    "title": "Danielle was given just months to live. Then came a glimmer of hope",
    "publish_date": "Wed, 03 Sep 2025 19:53:33 +0000",
    "category": "lifestyle",
    "authors": [
      "Sep"
    ],
    "text": "Danielle Ozolins never felt very comfortable asking for help.\n\nA terminal pancreatic cancer diagnosis has certainly changed her perspective on this.\n\nThe 49-year-old Sydney mum now feels more loved and supported than ever before after being told she had just months to live.\n\nDanielle and Greg Ozolins. (Supplied)\n\nOzolins told 9news.com.au her life-changing diagnosis began with a \"dull ache\" in her side.\n\nShe initially ignored the symptom.\n\nAfter all, her job in marketing was incredibly busy and she had a family to look after.\n\nSix months later, the ache returned.\n\n\"Then over the weeks, it got a bit worse, and I was like, 'OK, I've got to go to the doctor',\" Ozolins said.\n\n\"I woke up yellow with jaundice.\n\n\"So I got sent straight to emergency and went to the public hospital and it turned out that it was a blocked bile duct.\"\n\nA routine day surgery to have her gallbladder removed turned into a long day at the hospital and some unwelcome news: it was a tumour and it was cancerous.\n\nOzolins' husband Greg has just flown out on a surfing trip on a remote Indonesian island, her mum was away and her daughter was doing her HSC.\n\nThe timing couldn't have been worse – but as Ozolins attested, nobody is ever prepared for cancer.\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nThe Ozolins family. (Supplied)\n\nPancreatic cancer takes 75 lives every week in Australia and is the eighth most common cancer, according to ﻿Pankind.\n\nThe chance of surviving it after five years is just 13 per cent.﻿\n\nOzolins said her story is testament that it's not just an \"old person's\" disease.﻿\n\n\"It went zero to one hundred in six months. [Pancreatic cancer] never would even be on my radar that I would get at 48,\" she added.\n\nDoctors put her on a \"sledgehammer\" treatment plan including Whipple surgery, which removed her pancreas, and chemotherapy.\n\n\"They put me on the hardest dose. I was literally in bed for six months, just surviving,\" Ozolins said.\n\n\"It was horrible. But I thought we got it all and it was preventative.\"\n\nThe first scan after chemotherapy showed the cancer had spread to Ozolins' lungs.\n\nIt was a gut-punch after the torture of cancer treatment.\n\nHer doctor said she had nine to 12 months to live – unless she could be placed on a drug trial.\n\nA stroke of luck and support from her oncology team meant Ozolins could be put on a targeted therapy clinical trial.\n\n\"The doctors, for the first time in a while, are happy with my results,\" Ozolins said.\n\n\"But it will come down to the scan in a few weeks to see if my tumour is shrinking and the trial is working.\"\n\nSadly, restricted trial numbers meant another cancer patient missed out on a spot.\n\nOzolins said this fact breaks her heart.﻿\n\nIt will be a long road ahead but Ozolins and her family have been given the gift of hope.\n\nThe 49-year-old Sydney mum is undergoing a drug therapy trial. (Supplied)\n\n\"My husband and I have been together since we were 19. We've got the most amazing marriage and it's put a toll on us at times\" she said.\n\n\"We've got an amazing community around us of friends.\"\n\nThese same friends are rallying behind the Ozolin family as they take part in Remember September, an initiative to raise money and awareness for pancreatic cancer research.\n\nGreg has committed to walking 75km in September for his wife and so many others like her.\n\nShe said her diagnosis and fundraising has reconnected her with friends and loved ones.\n\n\"I've never asked for help for anything in my life, but now people are taking me to appointments because they want to feel like they're helping and it takes the pressure off my husband and my sister,\" Ozolins explained.\n\n\"And that took like 10 months for Greg and I to be comfortable with accepting that.\"\n\nOzolins also took the vulnerable step of sharing her cancer experience on social media.\n\nRemarkably, it led to an old friend discovering she had pancreatic cancer, too.\n\n\"She privately messaged me and said, 'I didn't even think about my pancreas. And I went and got tested and I've got pancreatic cancer',\" she said.\n\nThe mum-of-two is feeling hopeful and positive.\n\nHer stoic exterior belies her fear – but Ozolins wants to find purpose in her pain.\n\n\"If it's a five-year survival rate, then that's a win. And then we go from there,\" she added.\n\n\"I'm hoping my personal story will trigger people to actually put their money where their mouth is.\n\n\"Every drip makes a lake and makes this possible.\"\n\nLearn more or donate to Remember September here.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/plover-eggs-football-field-jerrabomberra-queanbeyan-palerang-regional-council/fab5dd3e-7509-4b6c-896c-141e637bc03c",
    "title": "Council forced to step in after protected bird lays egg on halfway line of football field",
    "publish_date": "Wed, 03 Sep 2025 00:53:47 +0000",
    "category": "sports",
    "authors": [
      "Sep"
    ],
    "text": "A sporting field near Canberra has been closed for up to a month after a native bird decided to lay an egg on the halfway line.\n\nThe egg appeared in the middle of a field at ﻿Jerrabomberra Regional Sports Complex over the weekend.\n\nIt was laid by a plover, a protected native bird known for their aggressive temperament, especially when it comes to their young.\n\nREAD MORE: Trump says he was unaware of theories that he was dead\n\nA plover laid an egg on the centre line of a soccer field near Canberra. (Facebook/Tim the Yowie Man)\n\nNSW National Parks and Wildlife Service (NPWS) initially advised that the egg should not be moved, forcing the field to be shut down.\n\nGames that were supposed to be played there over the weekend had to be moved to alternative fields.\n\nNow players will be unable to use the field until the egg hatches – or until council is able to carefully move it, with NPWS approval.\n\nREAD MORE: Military specialists join manhunt for Dezi Freeman\n\n\"NPWS have granted us a licence to move the nest in incremental small distances,\" a Queanbeyan-Palerang Regional Council spokesperson told 9news.com.au.\n\nThe process could take days or even weeks, depending on one important factor: the plovers responsible for the egg.﻿\n\n\"The advice and process we are following aims to ensure the parents remain with the nest,\" the spokesperson said.\n\n\"We are monitoring the nest each day, and if it looks like the parents are not moving with the nest, it will be returned to the previous location.\"\n\nThe task of moving the nest got a little trickier when, shortly after the first egg appeared, the plover lay two more.﻿\n\nBut the spokesperson seemed confident, confirming to 9news that games scheduled to be played on the affected field this coming weekend have not been moved.\n\n\"Finals are not expected to be affected,\" ﻿they added.\n\nTwo more eggs appeared soon after the first. (Facebook/Tim the Yowie Man)\n\nPlovers can be found across Australia and typically flock to large grassy areas, especially those near lakes or other bodies of water.\n\nAdult birds like to nest in open areas like fields or even on top of flat roofs so they can watch for predators.\n\nThey're protective of their eggs and young and will swoop at people or animals who get too close.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/guzman-y-gomez-battery-in-burrito-bowl-ripley-queensland/58003730-2a29-4de5-97c1-84d6ec58d051",
    "title": "Aussie diner horrified to find battery in meal from popular chain restaurant",
    "publish_date": "Wed, 03 Sep 2025 01:13:43 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "A Queensland woman was gobsmacked when she discovered what appeared to be a battery in her takeaway dinner from ﻿a popular Mexican chain.\n\nStephanie Weston ordered a beef mince burrito bowl from Guzman y Gomez at Ripley, south-west of Brisbane, last Friday.\n\nHer partner picked it up at the drive-through and brought it home to Weston, who dug in before she spotted something small and metallic in the meal.\n\nREAD MORE: Trump says he was unaware of theories that he was dead\n\nWhat appears to be a button battery in a Guzman y Gomez burrito bowl. (Facebook/Stephanie Weston)\n\nUpon closer inspection, it appeared to be a button battery.\n\nIf ingested, they can cause severe chemical burns and internal injuries﻿ that can turn life-threatening.\n\nWeston told the ABC she \"panicked\" when she realised what it was.﻿\n\nHorrified, ﻿she snapped a photo while her partner returned to the fast food restaurant to show staff the battery.\n\nREAD MORE: Military specialists join manhunt for Dezi Freeman\n\nA Guzman y Gomez assistant manager told her the battery had come from a food thermometer.\n\nWeston's partner was offered a refund and two burrito vouchers as compensation.﻿\n\nUnimpressed with the restaurant's response, ﻿Weston posted a photo of her meal to Facebook with the caption: \"Well I'm not eating Guzman y Gomez Ripley again, I found a battery in my burrito bowl and they think voucher makes up for almost posioning myself.\"\n\nA ﻿Guzman y Gomez spokesperson told 9news.com.au they were aware of the photo \"displaying a foreign object in a meal from our Ripley restaurant\" doing the rounds online.\n\nThe Guzman y Gomez restaurant at Ripley, southwest of Brisbane. (Guzman y Gomez)\n\n\"We have been in contact with the guest who was involved,\" they said.\n\n\"GYG immediately initiated a full investigation into this matter and confirmed that the object came from a food-grade thermometer.\n\n\"This is an isolated incident, there is no alert or recall that is required on this matter.\"\n\nThe spokesperson said ﻿Guzman y Gomez had \"undertaken urgent actions to ensure that this does not happen again\".\n\nThat includes replacing the model of thermometer involved in the incident, training crew and running ﻿additional checks of equipment across all restaurants\n\n\"Food safety is our absolute priority at GYG, and we take incidents of this nature extremely seriously,\" the spokesperson said.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-04/how-age-verification-tools-work-australia-social-media-ban/105720526",
    "title": "The age verification technologies under-16s could face amid social media ban",
    "publish_date": "Thu, 04 Sep 2025 01:45:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Handing over identification documents to big tech companies, or being screened for facial structure, features and gestures.\n\nHow will the teen social media ban work? Photo shows A graphic showing a hand holding a phone. It is superimposed on a drawing of Australia and surrounded by social media apps Australia is months away from implementing its world-first social media ban for teens. But questions still remain around how the restrictions will work.\n\nThese are some of the ways young people could be assessed when trying to set up or hold onto social media accounts from December.\n\nWith the federal government's social media ban for under-16s looming, a range of age-assurance technologies have been trialled to see whether it can be done effectively while also protecting privacy.\n\nA user's age could be determined to a reasonable degree of confidence in a variety of ways, according to a recent study.\n\nBut it also found every way included risks and shortcomings, adding that companies might need multiple \"fallback options\".\n\nHere's what young people might be required to do.\n\nNo 'single ubiquitous solution'\n\nThe government commissioned a survey by a British consultancy firm, testing more than 60 technologies from 48 age assurance vendors.\n\nLandmark study of age verification warns of risks Photo shows An iPhone screen The study, which will inform the government's impending social media ban for under-16s, found several methods were viable, but no method was foolproof, with concerns over both accuracy and privacy.\n\nTheir report found \"age assurance [could] be done in Australia privately, efficiently and effectively\", adding there was \"a plethora\" of choices.\n\n\"But we did not find a single ubiquitous solution that would suit all use cases,\" the report said.\n\nThe study presented several methods that could be used and grouped them into three main categories.\n\n1. Age verification\n\nThe first approach involved traditional age verification tools, which relied on official documents such as passports to verify a user's date of birth.\n\nA user would need to upload their ID, which would then be analysed for validity, often through third-party identity verification service providers.\n\n\"Age verification represents the most direct and high-assurance form of age assurance and is already in widespread use across many regulated industries,\" the report said.\n\nExisting social media accounts owned by children under the age of 16 will be deactivated under the ban. (ABC News: Mary Lloyd)\n\nConcerns have been raised about the risks associated with the process.\n\nLa Trobe University's director of AI strategy Daswin De Silva said age verification methods had \"low privacy protection\".\n\nHe said formal identification documents were usually assigned to high-trust institutions such as governments and banks, not low-trust services like social media companies.\n\n\"Given the sensitive nature of any information related to children, they can be exposed to subsequent harms and risks,\" he said.\n\nFormal personal data could be used alongside other forms of unverified data collection to paint a broad picture of a person and their interests, he added.\n\n\"If we use a bit more AI, we can actually predict their behaviours in the next few months, few years,\" he told the ABC.\n\nThis kind of information could be gathered at scale and used for advertising, online gambling or other commercial interests, and put those people at risk of a data breach, he said.\n\n2. Age estimation\n\nAge estimation uses AI and machine learning to conduct biometric analysis — via data on facial features, voice and motion — to predict a person's age.\n\n\"Unlike age verification, which relies on known and validated dates of birth, age estimation applies biometric or statistical techniques … to predict age without the need for formal identity documents,\" the report said.\n\nThe process generally involves a person taking a photo or recording audio or video of themselves.\n\nThat content is then analysed by an AI language model to determine someone's age.\n\nAge-checking tech for social media ban mistakes kids for 37-year-olds Photo shows A video stream on a laptop, showing a women with green lines and dots all over her face Children as young as 15 were repeatedly misidentified as being in their 20s and 30s during government tests of age-checking tools, sowing new doubts about whether the teen social media ban is viable.\n\nThe information is then communicated to a third party, and the photo or recording is deleted.\n\n\"You'd use a few of these combinations. Face, voice and motion data in combination to determine a signature for age,\" Professor Da Silva said.\n\n\"We use lots of past data of similar situations and then train the AI to recognise age or age groups: the simplest scenario would be adults versus child.\"\n\nAge estimation is considered to have a lower privacy risk.\n\nIt could also be used for people who do not have access to formal documents, Justine Humphrey, senior lecturer in Digital Cultures at The University of Sydney, said.\n\nHowever, there can be issues with inaccuracies.\n\n\"It was found that there were variations in accuracy, particularly for some groups, although there were relatively high levels of accuracy overall,\" Dr Humphrey told the ABC.\n\nOften, older people, \"non-whites and girls, or female-presenting individuals\" were among those experiencing variations of accuracy, she said.\n\nThe ABC reported earlier this year that face-scanning technology tested on school students could only guess their age within an 18-month range in 85 per cent of cases.\n\nThe report also noted false negatives were \"inevitable\".\n\nA false negative is when someone over 16 is deemed to be underage, and false positives would be those who are under 16 but deemed to be over-age.\n\nThe report said alternative methods of verification would be required to correct them.\n\n3. Age inference\n\nThe trial also examined age inference technologies, which do not require age verification such an ID.\n\nInstead, they use third-party sources to analyse online behavioural patterns and activity, and online account data, to estimate age.\n\n\"Age inference draws reasonable conclusions about age by analysing facts such as school enrolment, financial transactions, content barring settings, service usage or participation in age-specific activities,\" the report said.\n\nA third-party age inference provider scans for records from a trusted source, such as an electoral status, and once that is confirmed, common sense is used to assume an age or age range.\n\nLoading Instagram content\n\nDr Hassan Asghar, a senior lecturer in computer science at Macquarie University, said age inference was among the more \"concerning approaches\".\n\n\"Age inference works by watching what we do online over long periods to guess our age — essentially encouraging tech companies to constantly monitor our digital behaviour,\" he said.\n\n\"That's a pretty significant shift toward surveillance.\"\n\nProfessor De Silva said the risks were similar to age verification.\n\n\"For example, if someone posted [online], 'I received my driving licence today' in 2017, that is the equivalence of having access to the information on the drivers licence, specifically the date it was issued,\" he said.\n\nParental consent and controls were also flagged as options.\n\nThose controls involved parents and guardians in the process, using a set of tools that allowed them to restrict or monitor a child's access to digital content.\n\nOnus is still on tech giants\n\nThe ban on under-16s creating or holding their own social media accounts covers a wide range of platforms, including Facebook, Instagram, TikTok, Snapchat, X and YouTube.\n\nThe federal government will soon reveal \"reasonable steps\" platforms will be required by law to take to comply with the ban, such as standards for accuracy or certain safeguards for privacy.\n\nBut they will not be required to use a specific method to verify the age of their users.\n\nDr Asghar from Macquarie University said it was \"worrying\" the government was not specifying which technologies social media companies should use.\n\n\"They could potentially use any combination of these methods,\" he said.\n\n\"This means our data could end up scattered across numerous systems, and we know from countless data breaches that the more places our information sits, the higher the chance it gets compromised.\"\n\nSocial media companies have already started to utilise age assurance tests.\n\nThe report noted both Meta and Snapchat had started using facial age estimation technology, while Apple announced its own trial on age identification.\n\nLoading...\n\nDr Humphrey said she held reservations as to how strict compliance would be on social media companies that did not take the \"reasonable steps\" outlined by the government.\n\n\"We're yet to find out what forms of methods of compliance will be put in place to ensure that providers implement age assurance reliably and responsibly,\" she said.\n\n\"We're yet to see how those regulators [will enforce it], what methods they'll use to enforce or provide oversight.\n\n\"But we know that tech companies are often — if not antagonistic, they're not necessarily responsive to those sorts of requests and compliance orders.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-04/robodebt-victims-get-compensation-from-class-action/105734030",
    "title": "Hundreds of thousands of Robodebt victims could benefit from compensation payout",
    "publish_date": "Thu, 04 Sep 2025 01:38:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "The federal government has agreed to pay $475 million in compensation to the thousands of victims of the Morrison government's Robodebt scandal.\n\nRobodebt was an automated government scheme that used a faulty algorithm to incorrectly demand tens of thousands of welfare recipients pay debts they did not owe.\n\nThe scandal pushed some of Australia's poorest people further into debt, with many taking out loans they could not afford to make the urgent repayments.\n\nAttorney-General Michelle Rowland said if approved by the court, the payout would be the largest class action settlement in Australian history, covering hundreds of thousands of victims.\n\nA previous class action in 2020 resulted in the refunding of incorrect debts with interest and wiping of other debts accrued through the illegal system, but did not provide compensation for associated losses, including distress and suffering.\n\nIn a statement, Ms Rowland said the royal commission described Robodebt as a \"crude and cruel mechanism, neither fair nor legal\".\n\n\"Settling this claim is the just and fair thing to do,\" she said.\n\nLaw firm Gordon Legal said class actions had now resulted in more than $2.4 billion of financial redress in total.\n\nLoading",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-04/extra-aged-care-packages-a-good-start/105732518",
    "title": "Extra aged care packages 'a good start', national peak body says",
    "publish_date": "Thu, 04 Sep 2025 01:19:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "For 20,000 older Australians who have been patiently waiting for assistance to help them live at home, Wednesday's announcement that the government will immediately fund more packages is \"very significant\".\n\nThat is according to independent aged care expert and former acting inspector general of aged care, Ian Yates, who says the help will go to people who have been waiting many months, often in \"quite desperate\" circumstances.\n\nThe packages were part of 83,000 already promised by the government. The change announced on Wednesday was to bring forward the release of 20,000.\n\nAged care reforms delayed after sector raised survival issues Photo shows Elderly patient The biggest reforms to aged care in three decades have been delayed until November.\n\nAged Care Minister Sam Rae described the move as a \"huge win\" for older people, despite earlier resisting pressure to alter the timing of the rollout.\n\nThe reason there was such pressure, from not only across parliament but the aged care sector as well, was because all the packages were originally due to start being rolled out from July, but that was pushed back to November, alongside the rest of the aged care reforms.\n\nThat left a four-month gap in the release of any new packages, while the waitlist for people waiting for their approved support grew.\n\nWhile the government said there were some \"caveats\" around the accuracy of the new data, Shadow Aged Care Minister Anne Ruston revealed on Wednesday that more than 108,000 older people were waiting for at-home help they had been approved for.\n\nAnother 121,000 people were in the queue for an assessment.\n\n'A good start,' says Ageing Australia\n\nGiven the length of the two waitlists, there was widespread acknowledgement that the earlier release of these packages was just the start.\n\nThe chief executive of Ageing Australia, Tom Symondson, welcomed the move, but said a continual need for more packages would remain.\n\n\"They make a really good start on clearing that waiting list,\" he said.\n\n\"We know that the number of people requiring home care is going to massively expand over the next 10 and 20 years.\"\n\nThe latest data shows 108,000 older people are waiting for at-home help they have been approved for, and another 120,000 are waiting to be assessed. (AAP: Glenn Hunt)\n\nMr Yates said recommendations from the 2021 Aged Care Royal Commission also insisted the waitlist should be expeditiously eliminated, and should not be allowed to recur.\n\nTo ensure that, Mr Yates said the government needed to continue to increase its funding for at-home help.\n\n\"It's very important that the government review its budget provision in light of the numbers confirmed on the waitlist,\" he said.\n\nWhat happens beyond the 83,000 packages?\n\nMr Rae said that with an ageing population, the program's growth was an \"absolute given\", insisting that it would not be a one-in, one-out system beyond mid-next year, when all the new packages were rolled out.\n\n\"There will have to be ongoing growth in the program — the program is designed to better fit with an ageing population,\" he said.\n\nMr Rae said the system had already grown from 120,000 people in 2020 to more than 300,000 people today.\n\nAged Care Minister Sam Rae described the move as a \"huge win\" for older people (ABC News: Matt Roberts)\n\nQuestioned about it readiness on Friday, the sector assured a parliamentary inquiry into the delayed aged care reforms that it had the capacity to provide more at-home support to older people.\n\nThe department also conceded there was no technical reason it could not release more packages, other than a decision made by the government.\n\nMr Symondson said for \"months and months and months\" the sector was ready to ramp up, which was partly possible because the majority of support workers were not full-time and were keen to increase their hours.\n\nPlus, the most acute workforce shortage was among nurses, he said, whereas the bulk of assistance required was for domestic support with cleaning and meals.\n\nWhat's the difference between the old system and the new?\n\nAlong with the name change — from Home Care Packages to Support at Home — there are big practical changes for those receiving the help.\n\nAll recipients will transition to the new program, but there is a \"no worse off\" guarantee for those on, or approved for, a package before September 12, 2024.\n\nMore than 120,000 older Australians waiting to be assessed for help at home Photo shows An elderly man in silhouette sitting in a chair looking at trees. The government promised to release 83,000 packages to help clear the lengthy waitlist for at-home supports in July, but the extra packages have been pushed back to November.\n\nOthers, however, will have to pay contributions based on their income and assets for services other than \"clinical supports,\" which include nursing, physiotherapy and occupational therapy.\n\n\"There will be significantly higher co-payments in the support at home program for people across the board, basically,\" Mr Yates said.\n\nBecause of that, the impact of those changes needed to be closely monitored, Mr Symondson said.\n\n\"We are already hearing from older people that they're concerned they won't be able to afford those co-contributions,\" he said.\n\nThere will also be eight levels of support, instead of the current four.\n\nThe separate Commonwealth Home Support Program, or CHSP, which provides lower-level help, will remain until at least July 1, 2027, when it is set to fold into the new scheme.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-04/town-of-cambridge-overcharges-ratepayers-after-admin-error/105732568",
    "title": "Affluent Perth council apologises after overcharging ratepayers $1 million",
    "publish_date": "Thu, 04 Sep 2025 00:58:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "An affluent Perth council will refund almost $1 million to ratepayers after an administrative oversight incorrectly inflated their rates.\n\nThe Town of Cambridge said it recently identified two errors in the rates for the 2025-26 financial year, approved by councillors in June.\n\nThe rates were due for payment last Tuesday.\n\nThe main error applied to some properties in Floreat and City Beach, within what is known as the 'Endowment Lands Area'.\n\nAn incorrect rate, which was off by 0.000141, resulted in an overcharge of $999,739 across 4,633 properties.\n\nThe Town of Cambridge is located in Perth's leafy western suburbs. (ABC News: Glynn Jones)\n\nNo impact on services\n\n\"Refunds or credits will be issued to affected property owners with adjustments ranging from $8.75 up to $2,437 (for our largest commercial property), depending on property value,\" a Town of Cambridge statement to the ABC said.\n\nGovernment welcomes increased power over councils Photo shows A blonde woman name Hannah Beazley being interviewed in a television studio. The often mundane cogs of local government usually turn without much scrutiny, because the vast majority function as they should. But maybe we all need to pay more attention, writes Courtney Withers.\n\n\"Impacted ratepayers will be notified directly regarding their refund or credit.\n\n\"The Town will not increase rates to recover the shortfall and no impact on service levels is expected.\n\n\"Instead, the budget will be adjusted using surplus funds, and additional unbudgeted income from the previous financial year.\"\n\nTown of Cambridge chief executive Lisa Clack apologised for the error and said the council had confirmed only properties in the Endowment Lands Area were affected.\n\n\"I'd also like to directly apologise to the Town's council,\" she said.\n\n\"The budget process this year was a strong team effort from both employees and elected members and for this issue to be identified after that process is deeply regrettable.\n\n\"I want to confirm to our community that the error originated during the early modelling stages of the calculation, with a rating quirk specific to the Town of Cambridge.\"\n\nMistake prompts external review\n\nMs Clack said the error was not picked up in internal reviews and it would not have been possible for elected members to spot the error during the budget process.\n\nThe Town of Cambridge takes in Lake Monger. (ABC Radio Perth: Emma Wynne)\n\n\"I know the mayor and council committed many hours to interrogating budget data to achieve the best outcome for their community, including the rates modelling they were presented during the budget development as part of their commitment to transparency and accountability,\" she said.\n\nA spokesperson said the town would conduct an external review into its rates calculation process.\n\nThe town's previous rates were quashed by the State Administrative Tribunal on Tuesday, with an urgent council meeting held on Wednesday to approve the corrected rates.\n\nThe re-approval also corrected a separate technical error in the rates, which did not affect the amount charged to ratepayers.\n\nLoading...",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-04/nominating-a-superannuation-beneficiary-when-single-without-kids/105706712",
    "title": "Single without kids? Leaving your super to someone isn't straightforward",
    "publish_date": "Thu, 04 Sep 2025 00:18:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Death and money are tough topics to think about. It's why many of us haven't planned for who will receive our superannuation when we die.\n\n\"So many people don't want to think about their own mortality,\" says estate planning lawyer Melisa Sloan, based in Melbourne/Naarm.\n\nThere are also a lot of misconceptions around nominating a beneficiary for our superannuation, explains Ms Sloan.\n\nAnd for single people without kids, there is an added layer of complexity.\n\nNew research shows at least 6.5 million Australians will not have a say in who inherits their superannuation because of the way super members are prompted to inform funds of who they wish to receive their savings after their death.\n\nWhile this news has highlighted the importance of understanding the difference between making a \"non-binding\" or \"binding\" nomination, knowing who you can leave your super to — and how — is also critical.\n\nFor people who are not married or in a de facto relationship, and don't have children, choosing someone such as a parent or sibling isn't straightforward, as they most often don't meet the criteria for a binding nomination.\n\n\"Being empowered with the knowledge of who you can leave super to, and the tax implications, can make a significant financial difference of how super will be paid to beneficiaries,\" says Ms Sloan.\n\nWhat is a super beneficiary and who can you nominate?\n\nA superannuation beneficiary nomination is a formal way to tell your super fund who you want to receive your super death benefit when you die.\n\nWhy it's time to review your will Photo shows A woman holds a white pen while reviewing a document bound in a leather case. We should be reviewing our wills and estate plans every two to three years, estates lawyer Gillian Hunter says\n\nNatasha Janssens, a financial educator and behavioural money coach, says many people mistakenly believe you can nominate anyone to inherit your super.\n\nBut a beneficiary can be a spouse, children, someone who is in an interdependency relationship with you, someone who is financially dependent on you, or your estate or legal representative.\n\nYou have the option of making a \"non-binding\" nomination — a quick process that can often be completed online — or a \"binding\" nomination, which is a more complex process.\n\nMs Janssens says a binding nomination must be followed by the trustee of your super fund, providing it's a valid nomination (properly signed and naming a valid beneficiary).\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\n\"A non-binding nomination does not have to be followed — it is merely a statement of your preferences, but the ultimate decision resides with the trustee of your super fund.\"\n\nMore than a third of Australians surveyed by Super Consumers Australia had no death benefit nomination registered with their super fund — and a further 25 per cent did not know if their nomination was binding.\n\nMs Sloan says another common assumption is that super forms part of a will, but super is not an asset of someone's estate.\n\n\" It's alarming the amount of people who don't know that. \"\n\nYour options when you have no spouse or dependants\n\nIf you want to leave super to someone such as a parent, friend, or sibling, you'll need to complete a beneficiary nomination and appoint your legal personal representative, Ms Janssens explains.\n\n\"The situation may be different for an 18-year-old living at home who may have an interdependency relationship with her parents, and so could nominate her parents as beneficiaries for super.\n\n\"On the other hand, a woman living independently wouldn't be able to nominate her parents and as such would have to nominate her estate if she wished for her parents or a sibling or friend to receive the super.\"\n\nWho can inherit your superannuation? Photo shows A golden egg in a nest symbolising superannuation. Consumers are being urged to make 'binding' death benefit nominations to avoid lengthy legal disputes between family members and loved ones.\n\nMs Sloan says when someone nominates a legal personal representative (executor of their estate), the money will be paid to them and they can distribute the money in accordance with the will.\n\nYou will need to have a will in place to achieve this.\n\n\"It's a roundabout way to get it to them,\" Ms Sloan says.\n\nOur experts say people without a spouse or dependents should seek legal advice before making a nomination and deciding whether it's best to make a binding nomination for a specific person or handle it through the estate.\n\n\"There are numerous considerations to be made here including tax implications as well as risks of challenges to the estate should your super be handled in that manner,\" Ms Janssens says.\n\nRevisit to reflect changes to your relationship status\n\nMs Janssens says people should make sure nominations are up to date when their relationship status changes.\n\nAdd to your watchlist Photo shows Mystery Road Origin ABC iview with young detective Jay Swan in the bush. The critically acclaimed Mystery Road: Origin returns as Detective Jay Swan (Mark Coles Smith) and Mary (Tuuli Narkle) uncover dark secrets in a haunted timber town, where the past threatens to tear them apart.\n\n\"[People] often don't consider how changes in their relationship status could impact their super,\" she says.\n\n\"Perhaps a single woman in a de facto relationship would want the super to go to her parents instead of the new partner.\n\n\"Or perhaps you nominate your spouse but are in the process of a separation, meaning your wishes might have changed, yet the paperwork doesn't reflect that.\"\n\nThis article contains general information only. You should consider obtaining independent professional advice in relation to your particular circumstances.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-04/lgbtqia-event-mardi-gras-regional-victoria-mp-river-mildura/105480660",
    "title": "Mildura considers hosting Murray River mardi gras",
    "publish_date": "Wed, 03 Sep 2025 23:31:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "In the vast Sunraysia in north-west Victoria, a community campaign is gaining momentum for a Murray River mardi gras.\n\nThere are currently few public LGBTQIA+ celebrations in Mildura, and now state Nationals MP Jade Benham and the Mildura Rural City Council have thrown their support behind the idea of a mardi gras in the town.\n\nMs Benham said the safety of LGBTQIA+ residents was a \"real concern\" in her electorate and a major event would help people feel welcome and represented.\n\n\"How amazing would a Murray River mardi gras with a flotilla along the river be?\" she said.\n\n\"We have such an amazing platform, our region is absolutely stunning, so why not?\"\n\nJade Benham says Mildura should apply for a share of the Victorian government's LGBTQIA+ events funding. (Supplied: Jade Benham)\n\nMurray mardi gras floated\n\nMildura Rural City Council community development officer Jarrod Lehman said council would support a mardi gras on the Murray River in Mildura.\n\n\"I would totally love to see it,\" he said.\n\n\"There is nothing else like that around in Australia, I believe, a mardi gras on the river.\"\n\nJarrod Lehman says Mildura Rural City Council would support a mardi gras in Mildura. (ABC Mildura Swan Hill: Timu King)\n\nHe said there were opportunities for growth in the LGBTQIA+ events space and believed Mildura could head in the direction of Broken Hill, which was home to the successful Broken Heel Festival.\n\nThe festival, which ran from 2015 to 2024, celebrated the classic Australian drag queen film The Adventures of Priscilla, Queen of the Desert.\n\nThousands of people flock to Broken Hill for the annual Broken Heel Festival. (ABC Broken Hill: Aimee Volkofsky)\n\n\"The amount of people that [the Broken Heel Festival] actually brings into Broken Hill is amazing. It's really lifted the economy,\" Mr Lehman said.\n\n\"The Broken Hill people actually really embrace it every year. It is great to see a mining town can do that, so I can't see why Mildura can't do that as well.\"\n\nMs Benham said the event was as much about LGBTQIA+ safety as it was about tourism.\n\n\"In Broken Hill, partly because of Priscilla [Queen of the Desert], those that are part of the community feel safe and included to walk down the street,\" she said.\n\n\"But … they tell me that they don't feel the same way in Mildura.\"\n\nHowever, for the idea to get off the ground, Mr Lehman said local groups needed to step forward.\n\n\"We really need the LGBTQ+ community to come out and to show their support and to drive this,\" he said.\n\nLack of events 'isolating'\n\nAccording to the Australian Bureau of Statistics, three in four lesbian, gay, bisexual or otherwise non-heterosexual Australians had experienced a mental disorder, and almost half of the community had thought about taking their own life.\n\nThe National LGBTQIA+ Mental Health and Suicide Prevention Strategy said one of the contributing factors was a lack of connection.\n\nMore than 10,000 people attended the Sydney Mardi Gras this year. (ABC News: Victoria Pengilley)\n\nMildura LGBTQIA+ community member Johnny McDermott hoped more events would be held to improve community acceptance.\n\n\"When you're in a place like Mildura, it's very closeted, it's the most plain way I can say it,\" Mr McDermott said.\n\n\" Even if you're out, you're still having to hide in this little closet. \"\n\nMr McDermott said Mildura could feel isolating for people of diverse backgrounds and he wanted that to change.\n\n\"It's disheartening when the rest of the world and the rest of the country, for the most part, get to express themselves and share online about their experiences and how happy they are to be out and proud,\" he said.\n\nRegional funding announced\n\nThe Victorian government has not confirmed whether it would support a mardi gras in Mildura.\n\nHowever, last week, Minister for Equality Vicki Ward announced a string of events funded under the Regional Activation Program, which would be delivered as a part of the annual Midsumma Festival in Melbourne.\n\nVicki Ward says Victoria is one of the most LGBTIQA+ friendly states in the world. (ABC Gippsland: Georgia Lenton-Williams)\n\nEvents included the Thursgay Bellarine Pride Fest, Gippsland Ranges Roller Derby Pride Cup and Oceanside Pride in Portland.\n\nFriends of Comedy, a touring queer comedy showcase to be held in Mildura in November, was also funded, alongside several arts workshops and exhibitions held in regional Victoria.\n\nMs Ward said Victoria, now more than ever, needed to strengthen and celebrate its inclusiveness.\n\n\"These events bring communities together, showcasing the pride, importance and talents of LGBTQIA+ people across our regions,\" she said.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-04/roy-jones-jr-given-olympic-gold-medal-south-korean-who-beat-him/105733378",
    "title": "Boxing great receives Olympic gold — from man who controversially beat him",
    "publish_date": "Wed, 03 Sep 2025 23:16:26 +0000",
    "category": "sports",
    "authors": [],
    "text": "Roy Jones Jr has the gold medal from the 1988 Olympics — thanks to a gift from the South Korean fighter who defeated him in the controversial boxing match.\n\nPark Si-hun travelled to Jones's ranch in Pensacola, Florida, two years ago and gave the Hall of Famer the medal that Jones seemed to have earned in a bout most observers outside of the judges believed he dominated.\n\nThe news was revealed in a video posted on Jones's YouTube page.\n\nJones went to his gym on May 30, 2023, believing it was for an on-camera interview. Instead, he found Park in the ring and both fighters' families were there.\n\n\"I had the gold medal, but I wanted to give it back to you. It belongs to you,\" Park said through his son, who translated.\n\nPark was awarded a 3-2 decision in the light middleweight title bout in Seoul, South Korea, lifting the stunned Jones into the air in the ring after the result was announced.\n\nHe has said the criticism he received and the depression he felt sometimes led to suicidal urges.\n\nThe International Olympic Committee in 1997 concluded it had found no evidence to support bribery allegations against the judges who voted in favour of Park.\n\nSouth Korean boxer Park Si-Hun lifted favourite Roy Jones Jr of the US in the air after beating him in a controversial gold medal bout in Seoul. (Getty Images: Sports Illustrated/John Iacono)\n\nThe US Olympic Committee had called for an investigation in 1996 after documents belonging to East Germany's Stasi secret police revealed reports of judges being paid to vote for South Korean boxers.\n\nDespite not winning gold, Jones was awarded the Val Barker Trophy for the best boxer in the Games. He went on to win titles in four weight classes, from middleweight to heavyweight, and went 66-9 as a professional.\n\nPark retired from boxing after the Olympics but later became a coach.\n\nAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-04/luke-bateman-booktok-nrl-gambling-addiction/105730690",
    "title": "'I couldn't buy groceries': Luke Bateman admits 'debilitating' gambling addiction",
    "publish_date": "Wed, 03 Sep 2025 22:57:09 +0000",
    "category": "sports",
    "authors": [],
    "text": "When Luke Bateman was at the peak of his NRL career in 2019, his life outwardly exemplified the dream of many young Australian men.\n\nAt 24, earning hundreds of thousands of dollars a year to play the sport he loved, he said his days — and nights — were packed with excess.\n\nBut the reality was much grimmer.\n\n\"I don't really look back on it very fondly,\" he told triple j hack.\n\n\"I was struggling with addiction and depression and I don't remember a lot of it because I was on autopilot every day.\n\n\"I just had this construct of, as long as everybody else around me thinks that I'm still holding it together … still leading a normal life, then it's all good.\"\n\nThe addiction was gambling.\n\nBateman, like many young men, was caught in a cycle that contributes to Australians losing more than $25 billion a year on legal forms of gambling — the largest per capita losses in the world.\n\nThe former Canberra Raiders player stressed that his impressive pay packet did not save him from desperation.\n\nHe estimated he lost $500,000 to gambling over just a couple of years.\n\n\"I was earning $400,000 a year and I was broke,\" he said.\n\n\"My mum was paying my mortgage because I had no money and I couldn't buy groceries.\"\n\nBateman described his battle with gambling addiction as \"debilitating,\" but admits he wasn't alone.\n\n\"I would say half the football team had gambling addictions.\n\n\"Probably not to the same severity that I had, but … that's what we did as a football team.\n\n\"When we had spare time, it was like 'let's go to the races' or 'let's get out of the pub and have a beer and a bet.'\"\n\nFighting a daily battle\n\nIt was the convenience of gambling that Bateman said drove his addiction.\n\n\"My biggest problem was that I had a bookie on my phone,\" he said.\n\n\"It made it super easy for me to be very secretive about it as well because I could have been at an event … a wedding … and I could be sitting at the table … and putting a bet on.\n\n\"Someone might think you're just sending a text or whatever, and you just put a $10,000 bet on.\"\n\nLuke Bateman (centre) says he wasn't able to buy groceries, despite his huge NRL salary, because of his gambling addiction. (Getty Images: Mark Nolan)\n\nBateman described the shame he felt, especially as someone who many saw as a role model.\n\n\"You're someone who should be wealthy, and you've got no money,\" he said.\n\n\"What are people going to think of me?\"\n\n'Me in a coffin or I get help'\n\nIt was a career-ending knee injury in 2019 that the former player credits with helping him take hold of his life — but not before a severe struggle with depression.\n\n\"I actually got to the point where I said, 'No, this goes sort of one of two ways.'\n\n\"It ends with me in a coffin or I get help … I've ridden this train to the end of the track.\"\n\nLuke Bateman's TikTok account exploded after he joined the platform to share his love of fantasy books. (Supplied: Simon & Schuster Australia)\n\nBateman checked into rehab, and six years later, he said he was now free from addiction.\n\nLoading...\n\nHe wants to see more done by the federal government to crack down on Australia's gambling problem, although he is unsure about what specifically needs to change.\n\nThe Albanese government continues to face pressure to crack down on gambling ads, after stalling on its promise to take action in the face of resistance from wagering firms, sporting codes, and media companies.\n\n\"Should there be reforms in the space? Absolutely,\" Bateman said.\n\nWinning at all costs\n\nNow 30, Bateman said he reflects on his NRL career with more maturity.\n\nWhile he does not blame football for everything and he has taken \"ownership and responsibility\" for his struggles, he will not defend the sport.\n\n\"It's not a culture or industry that really develops mature, wholesome, integrated men, in my opinion,\" he said.\n\n\"There are a lot of parts that are very corrosive to young men … especially once you get to the professional level.\n\n\"The main point is win at all costs, and any price you have to pay to win — be that cheating, breaking rules, lying — whatever you have to do to win is justified.\"\n\nOn BookTok, criticism and moving forward\n\nThe latest chapter in Bateman's career is an unexpected return to his biggest passion.\n\nAfter a brief stint as a reality TV star on The Bachelor, the farmer has rebuilt his life as a book influencer, sharing his joy of reading with his hundreds of thousands of followers on TikTok.\n\n\"I have been known for a few different things throughout my life, but it's really meaningful to be most well-known for the one thing that I am actually passionate about,\" he said.\n\n#BookTok has created a space for readers on TikTok to share their love of literature. (Source: TikTok)\n\nHis recent announcement that he had signed a two-book deal for a fantasy series drew a mixed response on #BookTok, with some questioning whether he deserved the opportunity over more established or diverse writers.\n\n\"All these people were saying things about me without knowing anything about me,\" he said.\n\n\"I've written since I was a kid … I started writing my book before any sort of online traction.\"\n\nBut Bateman said he can appreciate the frustration from fellow book lovers.\n\n\" I was kind of like, 'hey, I understand this anger and even though you're angry at me, I'm one of you.' \"\n\nAs for what is next, he hopes it will be something that will give him the chance to give back.\n\n\"I'm not exactly sure what the future holds, but whatever it is, I know that it'll be helping people.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-04/us-open-tennis-2025-amanda-anisimova-upsets-iga-swiatek/105733308",
    "title": "American upsets champion Świątek, will face Osaka in US Open semifinals",
    "publish_date": "Wed, 03 Sep 2025 22:50:36 +0000",
    "category": "sports",
    "authors": [],
    "text": "American Amanda Anisimova has upset Iga Świątek 6-4, 6-3 in the US Open quarterfinals, less than two months after losing to the six-time grand slam champion in the Wimbledon final 6-0, 6-0.\n\nThe number eight-seeded Anisimova reached her third major semifinal and first at Flushing Meadows.\n\n\"To come back from Wimbledon like that is really special to me,\" said Anisimova, a 24-year-old who was born in New Jersey and grew up in Florida.\n\n\"I feel like I worked so hard to try and turn around from that … Today is really special.\"\n\nThe powerful strokes and poise she displayed in Arthur Ashe Stadium against number two Świątek — the 2022 US Open champion — were such a striking contrast to what happened at the All England Club's Centre Court on July 12.\n\nThat title match lasted just 57 minutes, and Anisimova only managed to win 24 points that day, a total she eclipsed about midway through the first set this time.\n\nAnisimova cried during her runner-up speech during the trophy ceremony at Wimbledon; after this match, though, she was all smiles while addressing thousands of supportive spectators who kept interrupting her on-court interview with cheers.\n\n\"Playing here is so freaking special,\" Anisimova said.\n\nDemon's US Open run ends in quarters Photo shows Alex de Mianur playing a backhand tennis shot, with one hand, outstretched It is heartbreak for Alex de Minaur once again at the US Open, as the Australian fails to break through to the semifinals at a major for the first time in his career.\n\n\"And I've been having the run of my life here.\"\n\nAnisimova served first and got broken immediately when she lost three points in a row by missing forehands — one into the net, one wide, one long.\n\nBut Anisimova broke right back and soon was the one dictating points with her strong, flat groundstrokes that wound up contributing to 23 total winners, 10 more than Świątek accumulated.\n\nAnisimova also played quite cleanly, making just 12 unforced errors.\n\nIn the second set, Anisimova fell behind again, this time 2-0.\n\nBut she again regrouped and quickly gained the upper hand. Świątek was the one looking increasingly frustrated, shaking her head or slumping her shoulders between points, spreading her arms wide and looking to her coach for advice, and leaning back in her changeover chair as if pondering what, exactly, she could do differently.\n\nWhen Świątek double-faulted to trail 5-3 in the second set, that allowed Anisimova to serve out the victory.\n\n\"From the get-go, I was trying to fire myself up,\" Anisimova said.\n\n\"She is one of the toughest players I've ever played. I knew I was going to have to dig deep.\"\n\nAnisimova to face Osaka in last four\n\nNaomi Osaka took 109 minutes to beat Karolína Muchová and reach the US Open semifinals. (Getty Images: Clive Brunskill)\n\nAnisimova will try to reach a second consecutive major final when she faces four-time grand slam champion Naomi Osaka in the semifinals.\n\nOsaka defeated Karolína Muchová 6-4, 7-6 (7/3) in a match that should have been straightforward but wasn't, despite the player from Czechia being hampered by injury for much of the match.\n\nSome of Osaka's forehands were simply exceptional, but the Japanese star failed to take full advantage of her opponent's limitations after she had a medical timeout and received attention on her left thigh.\n\nDespite obvious discomfort, Muchová held things together to force a second set tie-break, but when she went 3-1 down the end was near.\n\nShe came close to grabbing the mini-break back, but her almost-winner was 1 millimetre out.\n\nOsaka held four match points, and although she gave away the first, she forced the error from Muchová that ended the match.\n\nWhenever Osaka has previously made it to the quarterfinal of a major tournament, she has gone on to win.\n\nShe has two Australian Opens and two US Open titles to her name, and she is now two matches away from a third crown at Flushing Meadows.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP/ABC",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-04/no-vuelta-stage-11-winner-after-protesters-disrupt-finish-line/105733070",
    "title": "'Putting us in danger isn't going to help your cause': Vuelta stage finish called off due to protests",
    "publish_date": "Wed, 03 Sep 2025 22:15:25 +0000",
    "category": "sports",
    "authors": [],
    "text": "Stage 11 of the Vuelta a España ended with no winner after organisers ordered a finish 3 kilometres from the line due to pro-Palestinian protesters causing disruption in Bilbao.\n\n\"Due to some incidents at the finish line, we have decided to take the time at 3 kilometres before the line,\" was the announcement made by the race director on Radio Vuelta.\n\n\"We won't have a stage winner. We will give the points for the mountain classification and the intermediate sprint, but not on the finish line.\"\n\nDisruptions began early when the race was stopped in the neutral zone after protesters carrying a banner gathered on the road before they were ushered to the side by police.\n\nLate in the race, protesters pulled a banner across the road in front of the peloton, which got past without any problems. Basque and Palestinian flags were waved all along the route.\n\nBasque Minister of Security Bingen Zupiria told reporters that three people were arrested, another five identified and that four members of the regional police were injured during the protests.\n\nThe 157.4km stage, which began and ended in Bilbao, was into the final 20 kilometres when the announcement came, while the main general classification riders were battling it out ahead of the peloton.\n\nRace leader Jonas Vingegaard (Visma-Lease a Bike) and Britain's Tom Pidcock (Q36.5 Pro Cycling Team) broke away from their rivals in the final kilometres to come to the premature finish first.\n\nVingegaard moved further clear in the general classification and has a 50-second lead over João Almeida (UAE Team Emirates-XRG) while Pidcock moved into third spot, a further 6 seconds back, with one-time leader Torstein Træen (Bahrain Victorious) dropping to fourth.\n\nPidcock made his move on the final climb, Alto de Pike, and Vingegaard was the only rider able to go with him, leaving Almeida, who began the day third overall and 38 seconds off the leader, trailing.\n\nAfter the peloton foiled any early breaks, a 12-man group that included most of the GC contenders left the peloton behind close to the summit of El Vivero, 24 kilometres from the finish line.\n\nThe race had already passed through the finishing stretch earlier in the stage, and it was clear that police were struggling to contain the hundreds of Palestinian-flag-waving protesters.\n\n\"We went through the finish line, we saw them already there kind of on the road, I think the police kept them off there,\" Vingegaard said.\n\n\"There was one time when they tried to block us on the second-last climb but we just went through.\"\n\nThere was a surreal end to the race, with Vingegaard and Pidcock unsure of where exactly the new finish line was.\n\n\"It's hard to describe the disappointment, to be honest,\" Pidcock said.\n\nThomas Pidcock and Jonas Vingegaard were leading stage 11 of the Vuelta but did not have the chance to race for the stage win. (Getty Images: Dario Belingheri)\n\n\"I felt like today was my day. I feel like there should always be a finish line.\"\n\nThe Briton also had a message for the protesters.\n\n\"Putting us in danger isn't going to help your cause,\" he said.\n\nVingegaard was also disappointed, with the Dane having a special reason to go for the stage win.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It's my son's birthday, he's one year old today so I wanted to win for him,\" Vingegaard said.\n\n\"We worked all day for it and to not get the chance is obviously a big shame.\"\n\nBefore the stage, the Professional Cyclists' Association (CPA) had called for better security at the Vuelta after a number of incidents involving protesters had already brought concern over rider safety, with the Israel-Premier Tech team the main target.\n\nThere were incidents on Tuesday's stage 10 that caused a rider to crash, and also during stage five's team time trial when the Israel-Premier Tech team were stopped on the road by a group of protesters holding Palestinian flags.\n\nStage 12 on Thursday is scheduled to take place over 144.9km from Laredo to Los Corrales de Buelna.\n\nReuters/ABC",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/gus-admits-concern-over-strange-souths-call-20250904-p5msef.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gus admits concern over 'strange' Souths call",
    "publish_date": "Thu, 04 Sep 2025 11:46:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "Gus admits concern over 'strange' Souths call\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/barking-orders-cronulla-s-training-strategy-to-deal-with-rowdy-dogs-fans-20250904-p5mscl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Barking orders: Cronulla’s training strategy to deal with rowdy Dogs’ fans",
    "publish_date": "Thu, 04 Sep 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Loading\n\nCronulla are doing everything possible to prepare for their potential top-four shootout against Canterbury this weekend by blasting the ‘Bulldogs’ chant over the loudspeakers at training on Wednesday.\n\nFootage of the Sharks simulating what they expect the atmosphere to be like on Saturday night was posted to TikTok by a Bulldogs’ supporter, and had already been viewed more than 200,000 times by Thursday morning.\n\nIt’s not uncommon for sporting teams to train with crowd noise and music blaring through speakers to re-create a game-day atmosphere.\n\nPlayers are encouraged to use a louder voice when communicating with each other on the field.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-xi-and-putin-discuss-immortality-in-hot-mic-moment-with-kim-jong-un-albanese-to-visit-starmer-as-part-of-aukus-talks-20250904-p5msak.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: $475 million settlement agreed for robo-debt victims in largest class action appeal in Australian history; Howard lashes PM’s ‘dangerous’ Palestine call",
    "publish_date": "Thu, 04 Sep 2025 11:35:34 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "The government has agreed to pay $475 million in compensation to robo-debt victims after settling what will be the largest class action appeal in Australian history.\n\nThe Morrison government’s robo-debt scheme had illegally chased more than 500,000 people for debts they did not owe.\n\nAttorney-General Michelle Rowland said the settlement addresses the harms from the former government’s “disastrous” policy. Credit: Alex Ellinghausen\n\nAttorney-General Michelle Rowland said the settlement, which requires approval from the Federal Court, demonstrated Labor’s commitment to addressing the harms from the former government’s “disastrous” policy.\n\n“The Royal Commission described robo-debt as a ‘crude and cruel mechanism, neither fair nor legal’. It found that ‘people were traumatised on the off chance they might owe money’ and that robo-debt was ‘a costly failure of public administration, in both human and economic terms’,” Rowland said in a statement.",
    "source": "SMH",
    "cluster_id": 7
  },
  {
    "url": "https://www.smh.com.au/national/nsw/sydney-s-most-fabulously-ugly-building-is-about-to-get-a-glow-up-20250820-p5mogk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney’s most fabulously ugly building is about to get a glow-up",
    "publish_date": "Thu, 04 Sep 2025 11:30:00 +1000",
    "category": "entertainment",
    "authors": [
      "Julie Power"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Adorned with “indecent” sculptures, Sydney’s idiosyncratic Reader’s Digest building has confounded the public since it was unveiled in 1967 as an idealistic Mad Men-esque workplace. It was conceived as art as architecture. Or architecture as art. And its fans say it may just be the most fabulously ugly thing you’ve ever seen. SJB director Adam Haddow loves the way its architect John James married an obsession with Gothic architecture with Brutalism. “I call it Beaut-alism,” Haddow said. Haddow’s SJB and architect Matthew Byrnes of Design 5 – Architects have unveiled plans for a $23 million adaptive reuse project to start later this year. It will turn the 4200-square-metre heritage-listed building in Waterloo Street into a “honey pot for creative activity” in Surry Hills. The Reader’s Digest building in Surry Hills. Credit: “It should become the Surry Hills Town Hall, emotionally at least, because there isn’t one – unless you count the Clock Hotel,” said Haddow, who lives a five-minute walk away. Built to house the Reader’s Digest’s state-of-the-art $1 million computer that was the size of a small home, and its ground-floor printing presses, the offices were designed to give employees a sense of modernity and spaciousness.\n\nAdvertisement\n\nByrnes said James believed an office space should look and feel like home: “A place where you wanted to spend your day, rather than a glass box with little sense of the human scale.” Adam Haddow of SJB architects with Matthew Byrnes of Design 5 – Architects inside the Reader’s Digest building on Waterloo Street in Surry Hills. Credit: Kate Geraghty To achieve that, James collaborated with sculptor Douglas Annand and landscape architect Bruce Mackenzie, who designed what is thought to be Australia’s first rooftop garden on a commercial building. Byrnes said the approved new works would build on James’ original vision. The architects planned to restore warmth, light and amenity to the building, now owned by the Barana Group, and avoid “the sterile, impersonal feel associated with commercial architecture”. An article about the new Reader’s Digest Building in 1967. Credit: Reprinted with permission of Reader’s Digest November 1967. The project will finally install a large pile of Annand’s original anthropomorphic sculptures that Byrne discovered had been banished to the building’s undercroft because they were too lewd. In a self-published book on the project, architect James recalled a 5am call from a visiting Reader’s Digest manager who had just flown in from the US and taken a taxi direct to the almost completed site.\n\nAdvertisement\n\n“The man was in a towering rage,” James wrote. “Doug’s cast iron railings, just installed on the verandas, were ‘indecent, with a hideous sexuality’ and ‘gross insult to decent people’. They were ‘perverted’.” James wrote that the executive threatened: “I want them removed from the building before I have showered, breakfasted and back in the building, or you are fired. I will dismiss you on the spot if those gross horrors are not removed at once.” The project will also replace the rooftop garden and failing waterproof membrane. Other internal features, including those synonymous with mid-century architecture, such as the original copper artichoke pendant lights, and lift panels with chrome circular ashtrays on every floor, will be retained. A sculpture by Douglas Annand on the exterior of the Reader’s Digest building in Sydney’s Surry Hills. Credit: The bespoke balustrades and beautifully crafted timber handrails curled like a shepherd’s crook will be polished, and the building will be updated to meet accessibility guidelines.\n\nAdvertisement\n\nThe project’s goal of bringing life back to this part of Surry Hills seems direct from the pages of the Reader’s Digest article about its sparkling new home in November 1967. The editors wrote that they hoped the Digest’s new home would fulfil the then-mayor of Sydney’s goal of bringing new life to Surry Hills, and encouraged their 610,000 Australian subscribers to visit. One of the unusual aspects of James’ design was his use of the Fibonacci sequence to ensure its proportions were human in scale. Byrnes said the application of this system had been rigorous and extraordinary. “This principle formed the basis of the design and configuration of the new glazing, which are consolidated in the central three bays on Cooper and Adelaide streets, where glazing already exists.” A cafe will operate on the ground floor of Cooper Street. For Haddow, the project realises an ambition and fascination with the building since he arrived in Sydney as a young architect.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/sharks-prepare-for-bulldogs-fans-20250904-p5mse2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sharks prepare for Bulldogs fans",
    "publish_date": "Thu, 04 Sep 2025 11:22:48 +1000",
    "category": "sports",
    "authors": [],
    "text": "Sharks prepare for Bulldogs fans\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/culture/movies/the-aussie-stranger-things-star-who-was-fired-for-chasing-his-indie-dreams-20250729-p5mir8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Aussie Stranger Things star who was fired for chasing his indie dreams",
    "publish_date": "Thu, 04 Sep 2025 11:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Garry Maddox"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The obsessive compulsive disorder. The panic attacks. The anxiety that comes from being bullied as a child. On a rainy Wednesday afternoon at an old-style pub, tucked away in a former bottle shop lined with grimy band posters for the likes of the Whitlams, Silverchair and Powderfinger, Australian actor Dacre Montgomery – of Stranger Things fame – is talking very personally. “I get stuck in a channel of thought where I’m locking and unlocking the door five or six times because it isn’t right”: Dacre Montgomery Credit: Jessica Hromas “I have the lowest self-esteem ever,” he says. “I’m scared of everything.” Once mental health was a taboo subject for just about anyone, let alone a young actor talking about a new film. It’s especially unexpected given Montgomery’s image since he broke through playing Billy Hargrove – an abusive student at Hawkins High and flirtatious lifeguard – in the hit Netflix series eight years ago. His moody good looks and dapper moustache made the Perth-raised actor a teen heart-throb whose Instagram fan pages have such swooning names as “lovelydacre” and “dacremontgomeryseyes”. (His first name, by the way, rhymes with “acre” and is an old family surname.) He was on magazine covers and in fashion ads with a cool young actor image, only enhanced when he turned up on red carpets with then-model girlfriend Liv Pollock, and released a podcast setting his own beat poetry to music.\n\nAdvertisement\n\nHis Year 12 classmates at Mount Lawley Senior High seemed to be on the money when they voted him “the most likely student to become a Hollywood star”. Loading But like so much in entertainment, the image belies the reality. Montgomery didn’t like where his career was heading, so he stepped back from acting for the best part of five years. After the third season of Stranger Things, when Billy becomes possessed by the malevolent Mind Flayer, he was in the 2020 romcom The Broken Hearts Gallery. He had a 2022 guest role as a hallucination in the fourth season of Stranger Things. The same year, he had a small part as concert movie director Steve Binder in Baz Luhrmann’s Elvis. But Montgomery turned down so many well-paid commercial opportunities that his Hollywood agent fired him. Instead, he wanted to work on arthouse projects with auteur directors that mattered to him. “A lot of real world Dacre stuff crossed the line into Jack and Elizabeth”: Dacre Montgomery and Vicki Krieps in Went up the Hill. Credit: Kirsty Griffin\n\nAdvertisement\n\nWhat he calls re-engineering his career - with a more supportive agent - seems to have worked. At 30, Montgomery is returning to the limelight with two new films this month: Australian-based Kiwi director Samuel Van Grinsven’s intense drama Went up the Hill (opening in cinemas) and American Gus Van Sant’s true crime drama Dead Man’s Wire (premiering at the Venice International Film Festival). He has also shot two more arthouse American films and, once the last piece of the financing puzzle is in place, will make his directing debut with The Engagement Party, which he will also produce and star in. Rather than play into his former image, Montgomery wants to be upfront about exactly who he is. That means being open about his mental health. “I suffer from really, really debilitating OCD,” he says, tucked into a black puffer jacket under a black cap in the Old Clare Hotel on Sydney’s Broadway. It’s so debilitating that Montgomery has every light bulb in his home in the eastern suburbs with a geolocated timer for sunrise and sunset to control the light levels. “I’m really specific about light, about space, about colour,” he says. “Every single skirting board, ceiling and wall is painted the same colour so I can focus. I’m just very spectrum … I get stuck in a channel of thought where I’m locking and unlocking the door five or six times because it isn’t right.” It’s ironic that his Stranger Things character is a bully, because Montgomery was bullied for being heavyset as a boy. It didn’t help that he was interested in drama, encouraged by parents who worked in the film industry. His dad, Scott, was a sound recordist; his mum, Judith, was a first assistant director and production co-ordinator who switched careers to become, like her father, a psychologist. Montgomery’s younger sister, Saskia, is also studying to be a psychologist. “I had a lot of energy and I didn’t know where to funnel it, and it left me being a very unhappy kid,” Montgomery says. “I had a hard time. I failed drama at high school. I failed media.\n\nAdvertisement\n\n“I went home every day, locked myself in my bedroom and just watched movie after movie, TV show after TV show, and it was my escape. I knew I wanted to be an actor but I didn’t have clarity in myself and it led me to be very unhappy and very anxious a lot of the time.” Montgomery now sees this anxiety is a positive in his life. “It fuels my work ethic and my ambition as a kid,” he says. Dacre Montgomery as Billy in Stranger Things. Credit: Netflix I first interviewed Montgomery with Van Grinsven at the Adelaide Film Festival before the Australian premiere of Went up the Hill last year. He plays Jack, who goes to a remote home in New Zealand for the funeral of his estranged mother, Elizabeth; Vicky Krieps (The Phantom Thread) plays Jill, his mother’s lover. As they get to know each other, they are alternately possessed by Elizabeth. Van Grinsven calls it a ghost story – “a three-hander told with two actors”. Atmospheric and poetic, it’s a film about grief. Montgomery mentioned in Adelaide that shooting the film was so raw and confronting that he had a panic attack entering the brutally stark house where most of the film is set for the first time. He jumped in his car and drove to Christchurch – a response, he said, to going deep into Jack’s character, playing an Australian for the first time since the start of his career and revisiting a “complicated” relationship with his father’s side of the family in New Zealand.\n\nAdvertisement\n\n“I have a lot in common with Jack,” he says. “Going to New Zealand – I have Kiwi family – was a bit of a pilgrimage to confront some stuff that I’ve gone through … a lot of real world Dacre stuff crossed the line into Jack and Elizabeth and Went up the Hill. That led to a lot of panic attacks, a lot of meltdowns, a lot of turmoil”. Van Grinsven (Sequin in a Blue Room) says he was taken aback by Montgomery’s “vulnerability and his honesty and how raw he was as a person” in their first phone call about the film. “There’s a lot Dacre the person in this character,” he says. “He really is such a remarkable talent but he works from a place that’s very personal to him. When the character is going through something as intense as they do in the film, sometimes understandably it gets a bit overwhelming.” Dacre Montgomery, centre, with Ludi Lin, Naomi Scott, RJ Cyler and Becky G in Power Rangers. Credit: AP Van Grinsven made sure his two stars decompressed after intense scenes. A fire pit at the back of the house was where they hung out to “talk about what we were dealing with in the scene and slowly come back to ourselves and what’s actually happening right now”. Even before Montgomery finished studying at Western Australian Academy of Performing Arts (WAAPA), whose famous graduates include Hugh Jackman, Francis O’Connor, Jai Courtney, Lisa McCune and Tim Minchin, his Hollywood career was under way. A self-tape for another project attracted interest during casting for the 2017 reboot Power Rangers. “They flew me to LA and I tested for the lead of this big franchise – four picture deal, $US100 million film – and booked the role,” he says. “I was very lucky. I came home, turned 21, graduated university then a couple of months later got on a plane to Canada and started my first film.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/politics/queensland/lnp-threat-forces-scrapping-of-private-funded-pill-test-clinic-return-20250904-p5msb8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "LNP threat forces private-funded clinic to scuttle return",
    "publish_date": "Thu, 04 Sep 2025 10:54:05 +1000",
    "category": "finance",
    "authors": [
      "Matt Dennien"
    ],
    "text": "The news\n\nThe short-lived Brisbane pill testing clinic, defunded by the LNP after it came to power but planning to reopen this week with philanthropic funding, has had to delay its plans.\n\nThe Loop Australia chief executive Cameron Francis, who oversaw the CheQpoint testing program, said government threats had forced their hand.\n\nThe threats have not been followed by any direct contact from the government, which the organisation claimed had declined multiple meeting requests ahead of Friday’s planned service restart.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/swiateks-spicy-clash-with-reporter-20250904-p5msd9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Swiatek's spicy clash with reporter",
    "publish_date": "Thu, 04 Sep 2025 10:41:27 +1000",
    "category": "finance",
    "authors": [],
    "text": "Swiatek's spicy clash with reporter\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/lifestyle/health-and-wellness/want-to-avoid-haemorrhoids-why-you-should-leave-your-phone-outside-the-loo-20250904-p5msba.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Want to avoid haemorrhoids? Why you should leave your phone outside the loo",
    "publish_date": "Thu, 04 Sep 2025 10:25:43 +1000",
    "category": "lifestyle",
    "authors": [
      "Sabrina Malhi"
    ],
    "text": "Prolonged smartphone use on the toilet could be linked to a higher risk of haemorrhoids, not because of increased straining, but because of how much longer people sit, according to research published on Wednesday.\n\nA cross-sectional analysis of 125 patients undergoing screening colonoscopies found that smartphone users in the group spent significantly more time on the toilet, the study published in PLOS One from Beth Israel Deaconess Medical Centre in Boston said. About 37 per cent of people who were part of the study and reported using smartphones on the toilet spent more than five minutes per bathroom visit compared with 7 per cent of non-users.\n\nAfter adjusting for age, sex, body mass index (BMI), fibre intake, physical activity and straining, smartphone use was associated with a 46 per cent higher risk of haemorrhoids.\n\nSitting on the toilet scrolling through your phone for prolonged periods can place you at a higher risk of developing haemorrhoids. Credit: Getty Images\n\nChethan Ramprasad, one of the study authors who specialises in gastrointestinal motility, says haemorrhoids are often overlooked because they are “not taken as seriously”, even though millions of dollars of healthcare expenditure go to treating haemorrhoids.",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-billionaire-s-super-yacht-docks-ahead-of-riverfire-globemaster-plane-to-fly-low-over-city-for-riverfire-rehearsal-liz-truss-heading-to-brisbane-20250903-p5ms4f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Billionaire’s super yacht docks ahead of Riverfire | Globemaster plane to fly low over city for Riverfire rehearsal | Brisbane pill testing clinic cancels plans to reopen",
    "publish_date": "Thu, 04 Sep 2025 10:21:35 +1000",
    "category": "finance",
    "authors": [],
    "text": "A super yacht reportedly owned by mining magnate Clive Palmer has docked in a prime location ahead of this weekend’s Riverfire display.\n\nThe dark blue and white boat “Australia” was built in Italy and reportedly set the Queensland billionaire back about $40 million in 2021.\n\nClive Palmer’s super yacht “Australia”. Credit: William Davis\n\nTug boats helped tether the 56-metre vessel, which features a jacuzzi, two sundecks, and multiple bars, to a buoy between the Story Bridge and Kangaroo Bridge just after 10am on Monday.\n\nIt’s among the best locations in the city to view the Riverfire fireworks and jet display, which will start from 4.50pm on Saturday.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/wa-news-live-could-an-electrical-fault-be-behind-morley-markets-blaze-20250903-p5ms6x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Cockburn Sound ‘the most expensive parking garage in the state’ as jetty delays bite",
    "publish_date": "Thu, 04 Sep 2025 09:57:24 +1000",
    "category": "finance",
    "authors": [],
    "text": "West Australian businesses are copping nearly $70 million a year in fees paid to shipping companies because of delays at the Kwinana Bulk Jetty, according to a new report.\n\nThe report from the Kwinana Industries Council led to claims Cockburn Sound had become “the most expensive parking garage in the state” as the busy import jetty was at or near full capacity.\n\nAs part of the report, The Critical Case for Expanding Kwinana Bulk Jetty, the council tracked every vessel arriving at the jetty throughout 2024, and analysed port performance data, revealing shipping delays had risen to an average of 96 hours.\n\nThat was a sharp rise from the average of 12.5 hours in 2015-16.\n\nThe Kwinana Bulk Jetty. Credit: Fremantle Ports Authority\n\nMeanwhile, one company reported a 700 per cent increase in demurrage costs – fees paid to shipping companies for delays at a terminal – from 2018 to 2024.\n\nBoth berths at the jetty at close to capacity on average over the year, the report found – with one exceeding 90 per cent for seven months – while for nine months, 80 per cent of ships unloaded at the jetty experienced delays in accessing a berth.\n\nFor five months of the year, every ship was delayed, while one ship’s 67 days in port could have incurred a demurrage charge of as much as $4 million.\n\nCouncil chief executive David Harrison said the case for upgrading the jetty was compelling.\n\n“Cockburn Sound has gained the unwanted reputation of being the most expensive parking garage in the State,” he said.\n\n“On any even given day you can see a queue of ships in Cockburn Sound waiting to gain access to the port.”\n\nHarrison said “congestion and inefficiency” at the termional risked driving new investment in the area elsewhere.\n\n“Emerging industries in critical minerals, renewable energy and advanced manufacturing all depend on efficient bulk import capacity,” he said.\n\n“If companies cannot rely on Kwinana to deliver, they will take their projects — and their jobs — elsewhere.”\n\nThe Kwinana Industrial Area is home to a host of major businesses including Tianqi Lithium, Cockburn Cement and the Kwinana Nickel Refinery.\n\nThe council put the value of the annual activity of its members at almost $15 billion, and claimed the area generated nearly one per cent of the nation’s total GDP.\n\nThe area will soon also be home to WA’s premier container port, with plans afoot to shift the existing port from the Fremantle inner harbour down the coast.\n\nThe ports minister has been approached for comment.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/whats-the-future-for-australian-club-rugby-20250903-p5ms80.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What's the future for Australian club rugby?",
    "publish_date": "Thu, 04 Sep 2025 09:50:56 +1000",
    "category": "sports",
    "authors": [],
    "text": "What's the future for Australian club rugby?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/fan-steals-tennis-stars-hat-from-boy-20250830-p5mr41.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fan steals tennis star's hat from boy",
    "publish_date": "Thu, 04 Sep 2025 09:24:07 +1000",
    "category": "sports",
    "authors": [],
    "text": "Fan steals tennis star's hat from boy\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/funicular-derails-and-crashes-in-lisbon/00f1h0cmo",
    "title": "'Tragic day for our city': At least 15 people killed in Lisbon funicular crash",
    "publish_date": "Wed, 3 Sep 2025 20:35:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "At least 15 people have died and around 18 were injured when Lisbon's Gloria funicular railway car, which is popular with tourists, derailed and crashed, an emergency medical service spokesperson told reporters.\n\n\n\n\n\nAuthorities would not identify the victims or disclose their nationalities, but said some foreign nationals were among the dead.\n\n\n\n\n\n\"It's a tragic day for our city ... Lisbon is in mourning, it is a tragic, tragic incident,\" Carlos Moedas, mayor of the Portuguese capital, told reporters.\n\n\n\n\n\nFootage from the site showed the yellow tram-like funicular, which carries people up and down a steep hillside in Lisbon, destroyed, and emergency workers pulling people out of the wreckage on Thursday AEST.\n\n\n\n\n\nPortuguese President Marcelo Rebelo de Sousa lamented the tragic accident in a statement, expressing hope that authorities would soon determine the cause of the crash.\n\n\n\n\n\nThe line, which opened in 1885, connects Lisbon's downtown area near the Restauradores Square with the Bairro Alto (Upper Quarter), famous for its vibrant nightlife.\n\n\n\n\n\nIt is one of three funicular lines operated by the municipal public transportation company Carris and is used by both tourists and local residents.\n\n\n\n\n\nIts two cars are attached to opposite ends of a haulage cable, with traction provided by electric motors on both cars.\n\n\n\n\n\nPortugal, and Lisbon in particular, have experienced a tourism boom over the past decade, with visitors crowding the popular downtown area during the summer months.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/video/australian-family-could-lose-farm-in-global-race-for-rare-earth-minerals/sc4t8l42h",
    "title": "Australian family could lose farm in global race for rare earth minerals",
    "publish_date": "Wed, 3 Sep 2025 11:12:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian family could lose farm in global race for rare earth minerals\n\nPublished 3 September 2025, 9:12 am\n\nAustralia holds at least four per cent of the world's known rare earth reserves, the fourth largest in the world. As the Federal Government seeks to advance the industry, concerns over the cost of mining them is mounting. SBS reporter Shive Prema travelled to the Wimmera region in rural Victoria, which is becoming a flashpoint in the global race for rare earth minerals.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/video/youtuber-reveals-security-issue-by-major-gift-card-operator/sdcvhit4d",
    "title": "Youtuber reveals security issue by major gift card operator",
    "publish_date": "Wed, 3 Sep 2025 10:53:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "Youtuber reveals security issue by major gift card operator\n\nPublished 3 September 2025, 5:29 am\n\nAustralians love gift cards, billions of dollars are spent on them each year in Australia. However, a Melbourne content creator has found that some gift cards sold in supermarkets, could be at risk to opportunistic cyber criminals.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/asx-200s-worst-day-since-april-australian-economy-grows-faster-than-expected/xkhcq18co",
    "title": "ASX 200’s worst day since April; Australian economy grows faster than expected",
    "publish_date": "Wed, 3 Sep 2025 08:16:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/alone-australias-toughest-location-yet-as-show-set-for-return/vt6ppcprs",
    "title": "Revealed: Alone Australia's toughest location yet as show set for return",
    "publish_date": "Wed, 3 Sep 2025 06:30:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "SBS has unveiled its line-up for 2026, combining the biggest global events with daring homegrown storytelling across its distinctive multi-platform networks.\n\n\n\n\n\nFrom the FIFA World Cup 2026 to fearless documentaries, bold new Australian drama, and food that connects cultures, SBS continues to grow and tell stories that reflect the Australia of today while connecting with the world.\n\n\n\n\n\nSBS will remain a popular destination for food programming, while NITV will continue to elevate First Nations stories with a strong line-up of content that speaks to the heart and strength of community.\n\n\n\n\n\nSBS acting managing director Jane Palfreyman said 2026 will be \"our biggest year ever\".\n\n\n\n\n\n\"We're delivering a bold content slate that's proudly diverse and deeply engaging from global formats to bold, original storytelling that Australians won't find anywhere else,\" Palfreyman said on Wednesday.\n\n\n\nAlone Australia heads to the Arctic\n\nThe spectacular and intimidating wilds of the Arctic Circle are the new setting for the fourth season of smash-hit survival series Alone Australia.\n\n\n\n\n\nIn 2026, 10 new participants head to the Northern Hemisphere winter where subzero temperatures, deep snows, frozen lakes and icy forests await. Contestants will have to rely on their wits and ingenuity to be the last person standing and take home the $250,000 prize.\n\n\n\nThe first season of the survival reality show dropped contestants in the Tasmanian wilderness, while the second season moved across the Tasman to New Zealand's Fiordland National Park. After the third season returned to Tasmania, Alone Australia is taking on its most ambitious and intimidating location yet.\n\n\n\nSporting events that stop the world\n\nThe single largest sporting event in the world, the FIFA World Cup, will be shown exclusively on SBS. Next year, the Cup heads to Canada, Mexico, and the USA for a record-breaking 104 matches, all screened on SBS with world-class commentary from a trusted team of football experts.\n\n\n\n\n\nAs the exclusive broadcaster of the FIFA World Cup 2026, SBS will deliver over 550 hours of coverage, including every match live in HD, replays, and exclusive pitch-side crosses.\n\n\n\n\n\nSBS is also excited to announce exclusive access to the Tour de France Femmes through to 2030. As Australia's undisputed home of cycling, SBS will once again deliver the world's most iconic cycling events free and live to all Australians.\n\n\n\nSBS will once again deliver the world's most iconic cycling events, including the Tour de France, Tour de France Femmes and La Vuelta a España. Source: Supplied / Billy Ceusters\n\nDocumentaries that shift the conversation\n\nSBS will continue to push the envelope with documentaries that tackle some of our biggest and most provocative questions. Three-part series The People vs Robodebt spotlights the people who took on a powerful system in one of Australia's darkest chapters in recent history.\n\n\n\nThe People vs Robodebt is a political thriller at its core, telling the stories of individuals who took on the system over three episodes of the documentary-drama. Source: Supplied / Simon Morris Shut Your Big Fat Mouth John Safran will see the author and documentarian take on the heated topic of censorship.\n\n\n\n\n\nMeanwhile, two popular series will return for their second season:\n\n\n\nThe Hospital: In the Deep End\n\nThe Jury\n\nSBS will also continue to bring audiences premium international drama, unveil two new ambitious original SBS dramas and champion unmissable, bold and unapologetic Blak stories with NITV.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/gus-admits-concern-over-strange-souths-call-20250904-p5msef.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gus admits concern over 'strange' Souths call",
    "publish_date": "Thu, 04 Sep 2025 11:46:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "Gus admits concern over 'strange' Souths call\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/barking-orders-cronulla-s-training-strategy-to-deal-with-rowdy-dogs-fans-20250904-p5mscl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Barking orders: Cronulla’s training strategy to deal with rowdy Dogs’ fans",
    "publish_date": "Thu, 04 Sep 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Loading\n\nCronulla are doing everything possible to prepare for their potential top-four shootout against Canterbury this weekend by blasting the ‘Bulldogs’ chant over the loudspeakers at training on Wednesday.\n\nFootage of the Sharks simulating what they expect the atmosphere to be like on Saturday night was posted to TikTok by a Bulldogs’ supporter, and had already been viewed more than 200,000 times by Thursday morning.\n\nIt’s not uncommon for sporting teams to train with crowd noise and music blaring through speakers to re-create a game-day atmosphere.\n\nPlayers are encouraged to use a louder voice when communicating with each other on the field.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-xi-and-putin-discuss-immortality-in-hot-mic-moment-with-kim-jong-un-albanese-to-visit-starmer-as-part-of-aukus-talks-20250904-p5msak.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: $475 million settlement agreed for robo-debt victims in largest class action appeal in Australian history; Howard lashes PM’s ‘dangerous’ Palestine call",
    "publish_date": "Thu, 04 Sep 2025 11:35:34 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "The government has agreed to pay $475 million in compensation to robo-debt victims after settling what will be the largest class action appeal in Australian history.\n\nThe Morrison government’s robo-debt scheme had illegally chased more than 500,000 people for debts they did not owe.\n\nAttorney-General Michelle Rowland said the settlement addresses the harms from the former government’s “disastrous” policy. Credit: Alex Ellinghausen\n\nAttorney-General Michelle Rowland said the settlement, which requires approval from the Federal Court, demonstrated Labor’s commitment to addressing the harms from the former government’s “disastrous” policy.\n\n“The Royal Commission described robo-debt as a ‘crude and cruel mechanism, neither fair nor legal’. It found that ‘people were traumatised on the off chance they might owe money’ and that robo-debt was ‘a costly failure of public administration, in both human and economic terms’,” Rowland said in a statement.",
    "source": "TheAge",
    "cluster_id": 7
  },
  {
    "url": "https://www.theage.com.au/national/nsw/sydney-s-most-fabulously-ugly-building-is-about-to-get-a-glow-up-20250820-p5mogk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney’s most fabulously ugly building is about to get a glow-up",
    "publish_date": "Thu, 04 Sep 2025 11:30:00 +1000",
    "category": "entertainment",
    "authors": [
      "Julie Power"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Adorned with “indecent” sculptures, Sydney’s idiosyncratic Reader’s Digest building has confounded the public since it was unveiled in 1967 as an idealistic Mad Men-esque workplace. It was conceived as art as architecture. Or architecture as art. And its fans say it may just be the most fabulously ugly thing you’ve ever seen. SJB director Adam Haddow loves the way its architect John James married an obsession with Gothic architecture with Brutalism. “I call it Beaut-alism,” Haddow said. Haddow’s SJB and architect Matthew Byrnes of Design 5 – Architects have unveiled plans for a $23 million adaptive reuse project to start later this year. It will turn the 4200-square-metre heritage-listed building in Waterloo Street into a “honey pot for creative activity” in Surry Hills. The Reader’s Digest building in Surry Hills. Credit: “It should become the Surry Hills Town Hall, emotionally at least, because there isn’t one – unless you count the Clock Hotel,” said Haddow, who lives a five-minute walk away. Built to house the Reader’s Digest’s state-of-the-art $1 million computer that was the size of a small home, and its ground-floor printing presses, the offices were designed to give employees a sense of modernity and spaciousness.\n\nAdvertisement\n\nByrnes said James believed an office space should look and feel like home: “A place where you wanted to spend your day, rather than a glass box with little sense of the human scale.” Adam Haddow of SJB architects with Matthew Byrnes of Design 5 – Architects inside the Reader’s Digest building on Waterloo Street in Surry Hills. Credit: Kate Geraghty To achieve that, James collaborated with sculptor Douglas Annand and landscape architect Bruce Mackenzie, who designed what is thought to be Australia’s first rooftop garden on a commercial building. Byrnes said the approved new works would build on James’ original vision. The architects planned to restore warmth, light and amenity to the building, now owned by the Barana Group, and avoid “the sterile, impersonal feel associated with commercial architecture”. An article about the new Reader’s Digest Building in 1967. Credit: Reprinted with permission of Reader’s Digest November 1967. The project will finally install a large pile of Annand’s original anthropomorphic sculptures that Byrne discovered had been banished to the building’s undercroft because they were too lewd. In a self-published book on the project, architect James recalled a 5am call from a visiting Reader’s Digest manager who had just flown in from the US and taken a taxi direct to the almost completed site.\n\nAdvertisement\n\n“The man was in a towering rage,” James wrote. “Doug’s cast iron railings, just installed on the verandas, were ‘indecent, with a hideous sexuality’ and ‘gross insult to decent people’. They were ‘perverted’.” James wrote that the executive threatened: “I want them removed from the building before I have showered, breakfasted and back in the building, or you are fired. I will dismiss you on the spot if those gross horrors are not removed at once.” The project will also replace the rooftop garden and failing waterproof membrane. Other internal features, including those synonymous with mid-century architecture, such as the original copper artichoke pendant lights, and lift panels with chrome circular ashtrays on every floor, will be retained. A sculpture by Douglas Annand on the exterior of the Reader’s Digest building in Sydney’s Surry Hills. Credit: The bespoke balustrades and beautifully crafted timber handrails curled like a shepherd’s crook will be polished, and the building will be updated to meet accessibility guidelines.\n\nAdvertisement\n\nThe project’s goal of bringing life back to this part of Surry Hills seems direct from the pages of the Reader’s Digest article about its sparkling new home in November 1967. The editors wrote that they hoped the Digest’s new home would fulfil the then-mayor of Sydney’s goal of bringing new life to Surry Hills, and encouraged their 610,000 Australian subscribers to visit. One of the unusual aspects of James’ design was his use of the Fibonacci sequence to ensure its proportions were human in scale. Byrnes said the application of this system had been rigorous and extraordinary. “This principle formed the basis of the design and configuration of the new glazing, which are consolidated in the central three bays on Cooper and Adelaide streets, where glazing already exists.” A cafe will operate on the ground floor of Cooper Street. For Haddow, the project realises an ambition and fascination with the building since he arrived in Sydney as a young architect.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/sharks-prepare-for-bulldogs-fans-20250904-p5mse2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sharks prepare for Bulldogs fans",
    "publish_date": "Thu, 04 Sep 2025 11:22:48 +1000",
    "category": "sports",
    "authors": [],
    "text": "Sharks prepare for Bulldogs fans\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/culture/movies/the-aussie-stranger-things-star-who-was-fired-for-chasing-his-indie-dreams-20250729-p5mir8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Aussie Stranger Things star who was fired for chasing his indie dreams",
    "publish_date": "Thu, 04 Sep 2025 11:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Garry Maddox"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The obsessive compulsive disorder. The panic attacks. The anxiety that comes from being bullied as a child. On a rainy Wednesday afternoon at an old-style pub, tucked away in a former bottle shop lined with grimy band posters for the likes of the Whitlams, Silverchair and Powderfinger, Australian actor Dacre Montgomery – of Stranger Things fame – is talking very personally. “I get stuck in a channel of thought where I’m locking and unlocking the door five or six times because it isn’t right”: Dacre Montgomery Credit: Jessica Hromas “I have the lowest self-esteem ever,” he says. “I’m scared of everything.” Once mental health was a taboo subject for just about anyone, let alone a young actor talking about a new film. It’s especially unexpected given Montgomery’s image since he broke through playing Billy Hargrove – an abusive student at Hawkins High and flirtatious lifeguard – in the hit Netflix series eight years ago. His moody good looks and dapper moustache made the Perth-raised actor a teen heart-throb whose Instagram fan pages have such swooning names as “lovelydacre” and “dacremontgomeryseyes”. (His first name, by the way, rhymes with “acre” and is an old family surname.) He was on magazine covers and in fashion ads with a cool young actor image, only enhanced when he turned up on red carpets with then-model girlfriend Liv Pollock, and released a podcast setting his own beat poetry to music.\n\nAdvertisement\n\nHis Year 12 classmates at Mount Lawley Senior High seemed to be on the money when they voted him “the most likely student to become a Hollywood star”. Loading But like so much in entertainment, the image belies the reality. Montgomery didn’t like where his career was heading, so he stepped back from acting for the best part of five years. After the third season of Stranger Things, when Billy becomes possessed by the malevolent Mind Flayer, he was in the 2020 romcom The Broken Hearts Gallery. He had a 2022 guest role as a hallucination in the fourth season of Stranger Things. The same year, he had a small part as concert movie director Steve Binder in Baz Luhrmann’s Elvis. But Montgomery turned down so many well-paid commercial opportunities that his Hollywood agent fired him. Instead, he wanted to work on arthouse projects with auteur directors that mattered to him. “A lot of real world Dacre stuff crossed the line into Jack and Elizabeth”: Dacre Montgomery and Vicki Krieps in Went up the Hill. Credit: Kirsty Griffin\n\nAdvertisement\n\nWhat he calls re-engineering his career - with a more supportive agent - seems to have worked. At 30, Montgomery is returning to the limelight with two new films this month: Australian-based Kiwi director Samuel Van Grinsven’s intense drama Went up the Hill (opening in cinemas) and American Gus Van Sant’s true crime drama Dead Man’s Wire (premiering at the Venice International Film Festival). He has also shot two more arthouse American films and, once the last piece of the financing puzzle is in place, will make his directing debut with The Engagement Party, which he will also produce and star in. Rather than play into his former image, Montgomery wants to be upfront about exactly who he is. That means being open about his mental health. “I suffer from really, really debilitating OCD,” he says, tucked into a black puffer jacket under a black cap in the Old Clare Hotel on Sydney’s Broadway. It’s so debilitating that Montgomery has every light bulb in his home in the eastern suburbs with a geolocated timer for sunrise and sunset to control the light levels. “I’m really specific about light, about space, about colour,” he says. “Every single skirting board, ceiling and wall is painted the same colour so I can focus. I’m just very spectrum … I get stuck in a channel of thought where I’m locking and unlocking the door five or six times because it isn’t right.” It’s ironic that his Stranger Things character is a bully, because Montgomery was bullied for being heavyset as a boy. It didn’t help that he was interested in drama, encouraged by parents who worked in the film industry. His dad, Scott, was a sound recordist; his mum, Judith, was a first assistant director and production co-ordinator who switched careers to become, like her father, a psychologist. Montgomery’s younger sister, Saskia, is also studying to be a psychologist. “I had a lot of energy and I didn’t know where to funnel it, and it left me being a very unhappy kid,” Montgomery says. “I had a hard time. I failed drama at high school. I failed media.\n\nAdvertisement\n\n“I went home every day, locked myself in my bedroom and just watched movie after movie, TV show after TV show, and it was my escape. I knew I wanted to be an actor but I didn’t have clarity in myself and it led me to be very unhappy and very anxious a lot of the time.” Montgomery now sees this anxiety is a positive in his life. “It fuels my work ethic and my ambition as a kid,” he says. Dacre Montgomery as Billy in Stranger Things. Credit: Netflix I first interviewed Montgomery with Van Grinsven at the Adelaide Film Festival before the Australian premiere of Went up the Hill last year. He plays Jack, who goes to a remote home in New Zealand for the funeral of his estranged mother, Elizabeth; Vicky Krieps (The Phantom Thread) plays Jill, his mother’s lover. As they get to know each other, they are alternately possessed by Elizabeth. Van Grinsven calls it a ghost story – “a three-hander told with two actors”. Atmospheric and poetic, it’s a film about grief. Montgomery mentioned in Adelaide that shooting the film was so raw and confronting that he had a panic attack entering the brutally stark house where most of the film is set for the first time. He jumped in his car and drove to Christchurch – a response, he said, to going deep into Jack’s character, playing an Australian for the first time since the start of his career and revisiting a “complicated” relationship with his father’s side of the family in New Zealand.\n\nAdvertisement\n\n“I have a lot in common with Jack,” he says. “Going to New Zealand – I have Kiwi family – was a bit of a pilgrimage to confront some stuff that I’ve gone through … a lot of real world Dacre stuff crossed the line into Jack and Elizabeth and Went up the Hill. That led to a lot of panic attacks, a lot of meltdowns, a lot of turmoil”. Van Grinsven (Sequin in a Blue Room) says he was taken aback by Montgomery’s “vulnerability and his honesty and how raw he was as a person” in their first phone call about the film. “There’s a lot Dacre the person in this character,” he says. “He really is such a remarkable talent but he works from a place that’s very personal to him. When the character is going through something as intense as they do in the film, sometimes understandably it gets a bit overwhelming.” Dacre Montgomery, centre, with Ludi Lin, Naomi Scott, RJ Cyler and Becky G in Power Rangers. Credit: AP Van Grinsven made sure his two stars decompressed after intense scenes. A fire pit at the back of the house was where they hung out to “talk about what we were dealing with in the scene and slowly come back to ourselves and what’s actually happening right now”. Even before Montgomery finished studying at Western Australian Academy of Performing Arts (WAAPA), whose famous graduates include Hugh Jackman, Francis O’Connor, Jai Courtney, Lisa McCune and Tim Minchin, his Hollywood career was under way. A self-tape for another project attracted interest during casting for the 2017 reboot Power Rangers. “They flew me to LA and I tested for the lead of this big franchise – four picture deal, $US100 million film – and booked the role,” he says. “I was very lucky. I came home, turned 21, graduated university then a couple of months later got on a plane to Canada and started my first film.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/politics/queensland/lnp-threat-forces-scrapping-of-private-funded-pill-test-clinic-return-20250904-p5msb8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "LNP threat forces private-funded clinic to scuttle return",
    "publish_date": "Thu, 04 Sep 2025 10:54:05 +1000",
    "category": "finance",
    "authors": [
      "Matt Dennien"
    ],
    "text": "The news\n\nThe short-lived Brisbane pill testing clinic, defunded by the LNP after it came to power but planning to reopen this week with philanthropic funding, has had to delay its plans.\n\nThe Loop Australia chief executive Cameron Francis, who oversaw the CheQpoint testing program, said government threats had forced their hand.\n\nThe threats have not been followed by any direct contact from the government, which the organisation claimed had declined multiple meeting requests ahead of Friday’s planned service restart.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/swiateks-spicy-clash-with-reporter-20250904-p5msd9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Swiatek's spicy clash with reporter",
    "publish_date": "Thu, 04 Sep 2025 10:41:27 +1000",
    "category": "finance",
    "authors": [],
    "text": "Swiatek's spicy clash with reporter\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/lifestyle/health-and-wellness/want-to-avoid-haemorrhoids-why-you-should-leave-your-phone-outside-the-loo-20250904-p5msba.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Want to avoid haemorrhoids? Why you should leave your phone outside the loo",
    "publish_date": "Thu, 04 Sep 2025 10:25:43 +1000",
    "category": "lifestyle",
    "authors": [
      "Sabrina Malhi"
    ],
    "text": "Prolonged smartphone use on the toilet could be linked to a higher risk of haemorrhoids, not because of increased straining, but because of how much longer people sit, according to research published on Wednesday.\n\nA cross-sectional analysis of 125 patients undergoing screening colonoscopies found that smartphone users in the group spent significantly more time on the toilet, the study published in PLOS One from Beth Israel Deaconess Medical Centre in Boston said. About 37 per cent of people who were part of the study and reported using smartphones on the toilet spent more than five minutes per bathroom visit compared with 7 per cent of non-users.\n\nAfter adjusting for age, sex, body mass index (BMI), fibre intake, physical activity and straining, smartphone use was associated with a 46 per cent higher risk of haemorrhoids.\n\nSitting on the toilet scrolling through your phone for prolonged periods can place you at a higher risk of developing haemorrhoids. Credit: Getty Images\n\nChethan Ramprasad, one of the study authors who specialises in gastrointestinal motility, says haemorrhoids are often overlooked because they are “not taken as seriously”, even though millions of dollars of healthcare expenditure go to treating haemorrhoids.",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-billionaire-s-super-yacht-docks-ahead-of-riverfire-globemaster-plane-to-fly-low-over-city-for-riverfire-rehearsal-liz-truss-heading-to-brisbane-20250903-p5ms4f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Billionaire’s super yacht docks ahead of Riverfire | Globemaster plane to fly low over city for Riverfire rehearsal | Brisbane pill testing clinic cancels plans to reopen",
    "publish_date": "Thu, 04 Sep 2025 10:21:35 +1000",
    "category": "finance",
    "authors": [],
    "text": "A super yacht reportedly owned by mining magnate Clive Palmer has docked in a prime location ahead of this weekend’s Riverfire display.\n\nThe dark blue and white boat “Australia” was built in Italy and reportedly set the Queensland billionaire back about $40 million in 2021.\n\nClive Palmer’s super yacht “Australia”. Credit: William Davis\n\nTug boats helped tether the 56-metre vessel, which features a jacuzzi, two sundecks, and multiple bars, to a buoy between the Story Bridge and Kangaroo Bridge just after 10am on Monday.\n\nIt’s among the best locations in the city to view the Riverfire fireworks and jet display, which will start from 4.50pm on Saturday.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/wa-news-live-could-an-electrical-fault-be-behind-morley-markets-blaze-20250903-p5ms6x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Cockburn Sound ‘the most expensive parking garage in the state’ as jetty delays bite",
    "publish_date": "Thu, 04 Sep 2025 09:57:24 +1000",
    "category": "finance",
    "authors": [],
    "text": "West Australian businesses are copping nearly $70 million a year in fees paid to shipping companies because of delays at the Kwinana Bulk Jetty, according to a new report.\n\nThe report from the Kwinana Industries Council led to claims Cockburn Sound had become “the most expensive parking garage in the state” as the busy import jetty was at or near full capacity.\n\nAs part of the report, The Critical Case for Expanding Kwinana Bulk Jetty, the council tracked every vessel arriving at the jetty throughout 2024, and analysed port performance data, revealing shipping delays had risen to an average of 96 hours.\n\nThat was a sharp rise from the average of 12.5 hours in 2015-16.\n\nThe Kwinana Bulk Jetty. Credit: Fremantle Ports Authority\n\nMeanwhile, one company reported a 700 per cent increase in demurrage costs – fees paid to shipping companies for delays at a terminal – from 2018 to 2024.\n\nBoth berths at the jetty at close to capacity on average over the year, the report found – with one exceeding 90 per cent for seven months – while for nine months, 80 per cent of ships unloaded at the jetty experienced delays in accessing a berth.\n\nFor five months of the year, every ship was delayed, while one ship’s 67 days in port could have incurred a demurrage charge of as much as $4 million.\n\nCouncil chief executive David Harrison said the case for upgrading the jetty was compelling.\n\n“Cockburn Sound has gained the unwanted reputation of being the most expensive parking garage in the State,” he said.\n\n“On any even given day you can see a queue of ships in Cockburn Sound waiting to gain access to the port.”\n\nHarrison said “congestion and inefficiency” at the termional risked driving new investment in the area elsewhere.\n\n“Emerging industries in critical minerals, renewable energy and advanced manufacturing all depend on efficient bulk import capacity,” he said.\n\n“If companies cannot rely on Kwinana to deliver, they will take their projects — and their jobs — elsewhere.”\n\nThe Kwinana Industrial Area is home to a host of major businesses including Tianqi Lithium, Cockburn Cement and the Kwinana Nickel Refinery.\n\nThe council put the value of the annual activity of its members at almost $15 billion, and claimed the area generated nearly one per cent of the nation’s total GDP.\n\nThe area will soon also be home to WA’s premier container port, with plans afoot to shift the existing port from the Fremantle inner harbour down the coast.\n\nThe ports minister has been approached for comment.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/whats-the-future-for-australian-club-rugby-20250903-p5ms80.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What's the future for Australian club rugby?",
    "publish_date": "Thu, 04 Sep 2025 09:50:56 +1000",
    "category": "sports",
    "authors": [],
    "text": "What's the future for Australian club rugby?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/victoria/choose-a-uni-that-helps-you-make-a-real-impact-20250902-p5mrpm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Choose a uni that helps you make a real impact",
    "publish_date": "Thu, 04 Sep 2025 09:35:01 +1000",
    "category": "finance",
    "authors": [],
    "text": "An example of this is La Trobe’s Rural Health School. As the largest in Australia, the school drives local innovation and enhances rural healthcare through international collaborations, creating a broader global impact.\n\nIts state-of-the-art facilities include various multi-purpose skills laboratories offering interactive clinical learning environments, so you’re properly prepared for placements and full-time work.\n\nExperience is also essential when trying to get a job outside of uni. It’s important to assess whether the university you are considering can offer you the chance to connect with professionals in your field while you study. This can set you up for long-term success.\n\nSome universities offer industry placements as elective subjects, as well as work-based learning which can help you secure a great job once you finish your studies.\n\nAt La Trobe, placements and work-based learning is supervised by industry professionals and academic co-ordinators, giving students valuable experience and networking opportunities. The university helps you connect with a diverse range of industry partners, from local companies to multinationals, which often provide a valuable foot in the door for future employment.\n\nLa Trobe was the top university for undergraduate employability in 2023, according to the QILT (Quality Indicators for Learning and Teaching) survey.\n\nAlmost nine in every 10 undergraduates found a job within four months of graduating, while 93.7 per cent of undergraduates were in a full-time role three years after graduating. Employers recognise the value and quality of La Trobe graduates, with the university also ranked number one in Victoria for employer satisfaction in 2023.\n\nCast your net widely\n\nKeira Wills, the dean of learning futures at Strathcona Girls Grammar, says it’s vital for prospective students to consider the industry experience being provided by different universities.\n\n“Practical experience is crucial to prepare you for careers beyond university,” Wills says.\n\nWe encourage all our school leavers to attend university open days to get a feel for what each university offers. Keira Wills, Strathcona Girls Grammar\n\nBe sure to investigate the overall experience provided by your future uni. While studying is the main reason you’re at university, it’s also a great time to take advantage of the broad options available during this exciting phase of life.\n\n“Finding additional areas of passion while at university can really enrich your experience,” adds Wills.\n\nMaking the most of campus life\n\nLa Trobe offers access to great amenities, including The La Trobe University Sports Park precinct at the Melbourne campus in Bundoora. The Sports Park includes a new La Trobe Sports Stadium with six high-quality, multipurpose courts, as well as a central show court for basketball, netball, volleyball and futsal. It’s also the training grounds for the Australian women’s national soccer team, the Matildas.\n\nThe world-class Sports Park precinct was built for both students and the wider community to enjoy, supporting the university’s philosophy of making education and premium facilities more accessible to more people. Accessibility is another reason why La Trobe is made up of seven campuses, with the Melbourne City Campus, Sydney Campus and Bundoora Campus accompanied by regional campuses in Bendigo, Mildura, Albury-Wodonga and Shepparton.\n\nIf you can, it’s worth touring the campuses of each university that you’re considering before making a final choice. That way, you can get a feel for the university, the people that study there and the environment you’ll be in, which can get you excited about your adventurous first few years after finishing school.\n\nLastly, it’s important to remember that despite your ATAR results, there are a variety of pathways you can take to your dream course. Whether you take an extra year to work your way in or transfer from a different course, the doors to your future won’t close – even after you receive your year 12 results.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://au.news.yahoo.com/home-care-boost-pass-parliament-012405447.html",
    "title": "Home care boost to pass parliament after Labor backdown",
    "publish_date": "2025-09-04T01:24:05Z",
    "category": "finance",
    "authors": [
      "Zac De Silva"
    ],
    "text": "Thousands of older Australians are set to get earlier access to home care, with laws locking in changes expected to pass parliament after Labor bowed to opposition demands.\n\nThe laws will bring forward 20,000 home care places that were set to begin from November, and are expected to pass parliament on Thursday.\n\nThe additional places will be rolled out between September and the end of October, after revelations the waitlist for support had blown out to more than 200,000 people, with a person dying every two hours while waiting for the care they need.\n\nThe federal government had come under increasing pressure to release the aged care packages sooner, with Labor agreeing to demands from the coalition, Greens and crossbenchers.\n\nADVERTISEMENT\n\nAged care providers have welcomed the backflip.\n\n\"Providers are ready to act immediately and deliver more packages across Australia,\" Ageing Australia chief executive Tom Symondson said.\n\nMinister Sam Rae says finding highly skilled staff in the aged care sector is challenging. (Lukas Coch/AAP PHOTOS)\n\nBut Aged Care Minister Sam Rae claimed the industry has been giving \"mixed messages\" about whether it could deliver the extra support on time.\n\n\"We've had evolving advice from the sector about their ability to actually respond to these increased packages,\" he told ABC Radio on Thursday.\n\n\"We still have some concerns about the workforce dynamics. It is very challenging to find enough highly skilled, highly trained workers that can provide this care, but the sector are adamant that they think they can rise to that demand.\"\n\nOpposition Leader Sussan Ley said the government had been forced into a \"humiliating backdown\". (Lukas Coch/AAP PHOTOS)\n\nOpposition Leader Sussan Ley said she would keep up pressure on the government to make sure it delivers the promised 20,000 packages before the end of October.\n\nADVERTISEMENT\n\n\"The coalition will continue to fight for older Australians with one clear goal: no-one should have to wait for the care they have been assessed as needing,\" she told parliament.\n\n\"This is a moment where an arrogant government has been brought to heel... Labor has been forced into a humiliating backdown.\"\n\nAnother 20,000 home care spots will be released in November and December, and 43,000 more will be rolled out in the first half of next year.",
    "source": "Yahoo",
    "cluster_id": 8
  }
]