[
    {
        "url": "https://www.9news.com.au/national/synergy-overpayments-western-australia-electricity-customers-40-million/ef0d1625-314c-4cdd-b9be-38fc266fe37f",
        "title": "Synergy under fire after admitting to taking $40 million from customers",
        "publish_date": "Fri, 10 Oct 2025 13:28:35 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Synergy has come under fire for a second time this year after admitting to taking $40 million from Western Australia customers.\n\nThe state-owned utility is blaming a \"system failure\" for the error as they work to pay back hundreds of thousands of people.\n\n\"This isn't good enough, it's not acceptable and we've let our customers down,\" Synergy chief executive Kurt Baker said.\n\nREAD MORE: Son finds mum lifeless inside her North Melbourne home\n\nSynergy has come under fire for a second time this year after admitting to taking $40 million dollars from their Western Australia customers. (9News)\n\nThe provider collected overpayments from accounts that were meant to be closed, impacting 174,000 customers - both residential and business.\n\nThe payments date back to 2009 for amounts ranging from $1 to tens of thousands of dollars.\n\n\"Our systems and our processes should identify that, but they haven't, so our systems have let us down,\" Baker said.\n\nHe reassures customers they've now been stopped but wouldn't reveal exactly when Synergy discovered the blunder.\n\nSynergy chief executive Kurt Baker reassures customers they've now been stopped but wouldn't reveal exactly when Synergy discovered the blunder. (9News)\n\n\"We've only concluded that in recent times,\" he said.\n\nIt's expected to take several months for customers to be reimbursed but Synergy's CEO said the company had hired extra staff to speed up the process.\n\n\"It is completely unacceptable that this has happened and those people that have overpaid need to get their money back asap,\" state minister Reece Whitby said.\n\nPerson using microwave (9News)\n\nIt isn't the first time Synergy has slipped up.\n\nIn March, it was found that close to 3000 vulnerable customers using Centrepay had copped overpayments on closed accounts, with the automatic deductions taking out a total cost of $2.29 million.\n\n\"This is an issue of trust, the people of Western Australia have to be able to trust that their government departments are doing the right thing by them, and in this case, that trust is being lost,\" opposition energy minister Steve Thomas said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/michele-bullock-rba-governor-senate-estimates-nick-mckim-interest-rates-house-prices/4fc6abe2-bd9c-45d7-bd21-18d1641a5ee1",
        "title": "RBA boss denies housing crisis accusation in tense stand-off",
        "publish_date": "Fri, 10 Oct 2025 09:14:56 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "RBA Governor Michele Bullock has hit back at suggestions from the Greens that the central bank is responsible for Australia's skyrocketing house prices in a tense parliamentary hearing.\n\nIn an appearance at Senate estimates this morning, Bullock was questioned by Greens senator Nick McKim about the Reserve Bank's role in the housing crisis.\n\n\"The $400 billion that the RBA printed in the early year or two of COVID and effectively handed over to retail banks, who then turn around and lend it into the property market, do you accept that that played a role in the housing price bubble that we've seen over the last five years?\" McKim asked.\n\nMichele Bullock has hit back at suggestions from the Greens that the central bank is responsible for Australia's skyrocketing house prices. (Dominic Lorrimer/AFR)\n\n\"Certainly part of the way monetary policy works is through the housing market, but I would not accept that the Reserve Bank is responsible for the housing price issues in this country,\" Bullock, who wasn't appointed as governor until 2023, replied.\n\nWhen challenged on that by McKim, who put to her that the RBA \"doesn't accept any responsibility whatsoever in the housing price spike\", Bullock pointed to an oft-cited factor as the genuine culprit.\n\n\"The problem is the lack of supply relative to demand, and when monetary policy eases and housing demand picks up, supply can't pick up as quickly, and that's where you end up,\" she said.\n\n\"But it's not monetary policy's responsibility to look after housing prices.\"\n\n﻿ Having previously said that it would be at least two years before Australia started to see some relief from price surges , despite governments starting to focus on increasing supply, Bullock reiterated that fixing the country's housing stock was a long, slow process.\n\n\"It takes time to get approvals and one of the big things is higher density housing and that by its nature takes much longer,\" she said.\n\n\"It is not something that you can just turn the switch and say 'alright, now we're off and running', it really takes time.\"\n\nBullock also frustrated McKim by telling him investors weren't significantly exacerbating the housing crisis at the moment, and by refusing to be drawn on whether removing the capital gains tax discount for property would slow price rises.\n\nNick McKim was one of several senators to question Bullock in the hearing. (Dominic Lorrimer/AFR)\n\n\"I have done no particular analysis on what removal of the capital gains tax might do,\" she said.\n\n\"It's (not) my job to tell the government what they should do with the policy,\" she added.\n\nHowever, when asked by Liberal senator Andrew Bragg about the impact of the federal government's expanded first home guarantee scheme, Bullock said it was possible it would lead to house prices going \"a little higher\" in the short-term.\n\nBut as for the medium-term impacts, she said that would depend on – you guessed it – supply.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/alw-sydney-fc-recruit-amelia-cassar-likened-to-matildas-stars/105880668",
        "title": "Sydney FC teenager compared to Matildas stars ahead of ALW season",
        "publish_date": "Sat, 11 Oct 2025 01:44:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sydney FC coach Ante Juric says he has no hesitation in comparing 17-year-old recruit Amelia Cassar to Matildas stars Kyra Cooney-Cross and Caitlin Foord.\n\nCassar impressed Juric during the Sky Blues' preseason preparations after joining the club from cross-town rival, Western Sydney Wanderers.\n\nAlthough Cassar made four appearances for the Wanderers last season, she is yet to play a full A-League Women (ALW) match.\n\nKerr's Matildas return confirmed Photo shows Footballer Sam Kerr waves to the crowd Sam Kerr is back in the Matildas squad for the first time since late 2023, ahead of friendlies against Wales and England.\n\n\"I tried to get her last year when she went to the Wanderers,\" Juric said.\n\n\"She didn't play any minutes there, so I went and tried to get her again.\n\n\"She's a superstar in the likes of [Kyra] Cooney-Cross and [Caitlin] Foord.\n\n\"She's a really impressive player. She's going to be important for us and if I'm right, she's going to have a quick trajectory.\"\n\nJuric said his Sky Blues squad was a \"dream team\", despite losing captain Princess Ibini, Shea Connors and Kyah Simon in the off-season.\n\nThe Sky Blues, who are five-time ALW champions, endured a frustrating 2024/25 season and missed the finals for the first time in the competition's 17-year history.\n\nThey begin their campaign with a home clash against last season's premiers, Melbourne City, on November 1.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/rare-genetic-disorder-chops-syndrome/105648828",
        "title": "Isla Steed is your typical teen but a genetic anomaly sets her apart",
        "publish_date": "Sat, 11 Oct 2025 01:34:45 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Isla Steed is your fairly typical teenager, according to her mum.\n\nThe 14-year-old is \"a stubborn little person\" who loves technology and food, Kylie Steed says.\n\nAnd she has a favourite word — \"no\".\n\nBut what sets Isla apart from her peers is something she shares with just 34 other people in the world, and just three others in Australia.\n\nHer condition is so extremely rare, when she was born, it had not even been discovered yet.\n\nKylie Steed says her daughter Isla is the happiest person she knows. (ABC Eyre Peninsula: Duncan Bailey)\n\nIt is known by its acronym CHOPS, which stands for its signs and symptoms: cognitive impairment and coarse facial features; heart defects; obesity; pulmonary problems; and short stature and skeletal abnormalities.\n\nThe condition was not identified by researchers until 2015.\n\nIt would take another four years for Isla to be diagnosed, at the age of eight, with the genetic disease.\n\nUp until then, doctors had mistakenly diagnosed her with Cornelia de Lange syndrome, another genetic condition with similar features.\n\nThis is a common scenario for children who are later diagnosed with CHOPS, according to advocates for people with the disease.\n\n\"When Isla was born, she was quite unhealthy,\" Isla's mum said.\n\n\"She weighed 1,500 grams [1.5 kilograms] and spent the first 147 days in the Women's and Children's [Hospital in Adelaide].\n\nIsla required a feeding tube and, at one point, had to be resuscitated through CPR.\n\n\"There was no way we would have been able to live here [Port Lincoln] and keep her alive,\" Ms Steed said.\n\nIsla Steed was not diagnosed with CHOPS syndrome until she was eight years old. (Supplied: Kylie Steed)\n\nThe family had to temporarily relocate to Adelaide during the early years of Isla's life.\n\nBut eventually, when Isla was 11 years old, she was deemed well enough for the Steed family to return home to Port Lincoln on South Australia's Eyre Peninsula.\n\nDespite their regional city being under pressure from the same resources and staffing shortfalls as the public heath sector throughout regional and rural Australia, Isla has access to a \"full repertoire\" of support services in Port Lincoln, Ms Steed said.\n\nWhile she still needs frequent check-ups, her condition is also far more stable now than when she was a child, her mum added.\n\nConnecting through CHOPS\n\nWhile Isla's disease is rare, she's not alone.\n\nAdvocates across the globe have spent years trying to bring CHOPS syndrome into the spotlight and fundraise for research projects.\n\nIn Palermo, Italy, astrophysicist Manuela Mallamaci described her son Mario's diagnosis as \"a nightmare\" in 2023.\n\n\"But me and my husband said, 'OK, we need to do something, we cannot cry all the time,'\" Ms Mallamaci said.\n\nManuela Mallamaci felt inspired to advocate for CHOPS syndrome after her son Mario's diagnosis in 2023. (Supplied: Manuela Mallamaci)\n\nUnbeknown to her, across the ditch in the USA, there was a growing network of CHOPS families.\n\nLainey Moseley, a journalist in Philadelphia, founded CHOPS Syndrome Global after her daughter Leta became the first in the world to be diagnosed with the disease in 2015.\n\nAfter the two mothers connected online, Ms Mallamaci realised she could use her research background to try to find scientific answers.\n\nShe created Fondazione CHOPS, and began working alongside Ms Moseley's foundation to fundraise for research projects and connect CHOPS families across the world.\n\nManuela Mallamaci says it is important to know other families affected by rare diseases. (Supplied: Manuela Mallamaci)\n\n\"It was our starting point, meeting doctors and experts all over the world about this syndrome,\" Ms Mallamaci said.\n\n\"We are just a few people, but it is important to know other families.\"\n\nBeing a 'rare disease parent'\n\nLainey Moseley's daughter Leta, now 28 years old, was the first in the world to receive the CHOPS syndrome diagnosis.\n\nBut that didn't come until 18 years after her birth.\n\nThe intervening years were \"incredibly isolating\", Ms Moseley said, via Zoom from Philadelphia.\n\nLeta Moseley (left) was the first person in the world to be diagnosed with CHOPS syndrome. (Supplied: Lainey Moseley)\n\n\" But we're not unique, this is the story for thousands and thousands of families [with rare diseases] who are isolated and feeling like they're all alone and forgotten. \"\n\nMs Moseley felt she could not sit still after Leta was diagnosed, and spearheaded a campaign to bring CHOPS syndrome into the spotlight for the first time.\n\nIt led to the creation of CHOPS Syndrome Global in 2019.\n\n\"Because she was the first diagnosed in the world, I didn't really have a choice,\" Ms Moseley said.\n\nIt wasn't until Leta Moseley was 18 years old that she was diagnosed with CHOPS syndrome. (Supplied: Lainey Moseley)\n\n\"That's what you do as a rare disease parent when you get a diagnosis and you don't have a community.\n\n\"You don't have information about what the gene mutation is, and you can't even call doctors or scientists because they don't know either.\"\n\nChange in instruction gene\n\nBefore CHOPS had a name, Kosuke Izumi was studying a genetic anomaly alongside his former mentor, physician Ian Krantz, in the US.\n\nThe research was centred on better understanding Cornelia de Lange syndrome and involved studying hundreds of children.\n\nOf that large number, Dr Izumi recalled three children standing out — and one of them was Leta Moseley.\n\nKosuke Izumi is one of the leading researchers into CHOPS syndrome. (Supplied: Kosuke Izumi)\n\n\"We found three children with fairly similar medical problems but we thought they were a bit different with children from Cornelia de Lange syndrome,\" Dr Izumi said.\n\n\"This was around 2012 and we started thinking about whether these children may have a new genetic disorder.\"\n\nAround that time, a breakthrough in genetic testing called exome sequencing became available.\n\nDr Izumi said this allowed them to \"spellcheck\" genetic information in a comprehensive way.\n\nLainey Moseley believes a treatment for CHOPS syndrome will be found in her lifetime. (Supplied: Lainey Moseley)\n\n\"To test our hypothesis, which is that these children have a new genetic diagnosis, we used this new approach,\" he said.\n\n\"We identified a change in a gene called AFF4 and named it CHOPS syndrome as an acronym for their medical problem.\n\n\"Because this gene plays an important role in directing what kind of function the cell needs to do, as a consequence of dysfunction, children with CHOPS syndrome have many medical problems.\"\n\nNeed for more awareness\n\nDespite the odds against her, Isla's disease has not stopped her from loving people and loving life.\n\n\"She's one of the happiest people I know,\" Ms Steed said.\n\nToday, Isla is able to access most therapeutic services in Port Lincoln, but initially, a lack of awareness about the disease among the health sector made that challenging.\n\nIsla Steed lives in Port Lincoln with her mum Kylie, her dad Matt and her brother, Harry. (ABC Eyre Peninsula: Duncan Bailey)\n\n\"Therapy services have been tricky to find, we've been on lots of waitlists and finally have a full repertoire of speech [pathologists], occupational therapists and physios [physiotherapists],\" Ms Steed said.\n\n\"But no-one really knows much about it, so it can be really tricky.\n\n\" In terms of having a kid with a disability it can be super complex; your entire life is different to everybody else's and a lot of people don't understand what you go through. \"\n\nWhile Isla faces unique challenges in life, Kylie Steed says she loves people and life. (ABC Eyre Peninsula: Duncan Bailey)\n\nMs Mallamaci and Ms Moseley have not lost hope a treatment can one day be found for CHOPS.\n\n\"In my lifetime, we will have a treatment for CHOPS syndrome,\" Ms Moseley said.\n\n\"Whether it's a repurposed drug or gene therapy … we will have something to offer families and children who are born with CHOPS syndrome — an immediate treatment option for their child because that's what they deserve.\"\n\nDr Izumi said he too was hopeful.\n\n\"We are using a specialised cell called induced pluripotent stem cell, which can be generated from patient cells,\" he said.\n\n\"That can be differentiated into brain cells or muscle cells which the patient has symptoms on.\n\n\"We're trying to find a way to fix this abnormality, and have been using animal models to study what kind of drug could be useful.\n\n\"I may be too optimistic but there should be a way to do something.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/constitutional-challenge-considered-over-social-media-ban/105876686",
        "title": "The right teen could be key in brewing legal fight over social media ban",
        "publish_date": "Sat, 11 Oct 2025 00:48:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "A constitutional fight is brewing over Australia's world-first social media ban, according to top legal scholars.\n\nYouTube emerged as the most likely source of a challenge to the ban in July, when parent company Google first raised the prospect.\n\nBut experts in constitutional and media law told the ABC that doubts about the ban's constitutional validity extended well beyond the board rooms of the companies that would stand to gain from a victory.\n\nThey argue the policy could ultimately be overturned in the High Court because of its impact on the implied right to freedom of political communication, and believe that young climate activists such as 16-year-old Ivy Sheng showcase that risk.\n\nClimate campaigner Ivy Sheng is worried banning teens from social media will stunt their political education. (Supplied)\n\nThe year 10 student uses Instagram to promote her podcast about environmental justice, as well as sharing her political views with a wide network, including both adults and younger students.\n\nShe credits much of her \"political education\" to social media.\n\n\"There wasn't really one specific moment where I suddenly switched on [politically], but I was about 12,\" she said.\n\nIvy will scrape past the new social media age limit of 16 when it takes effect on December 10, but many of her peers are preparing to lose access to their accounts once platforms start checking ages, as required by Australian law.\n\n\"That's the first group that I'm reaching and so with this ban in place, that's going to be a group that we're losing,\" she said.\n\nThe social platforms that could be forced to ban under-16s Photo shows A person holding a mobile phone surrounded by icons from social media platforms WhatsApp, Roblox, Reddit and Discord are among an expanded list of platforms which may be covered by the teen social media ban, the ABC can reveal.\n\nIvy said social media had become the main place where young people developed their political views, and represented their best opportunity to be heard by people who were old enough to vote.\n\n\"Having young people step up and say, like, hey, this is going to impact my future — I think that's probably the most important thing that's going to bring more older people into the [climate] movement,\" she said.\n\n\"If people aren't able to access … social media, they won't be thinking about this when they go into their teens and when they [reach] voting age.\n\n\"And that's just not something that is beneficial for us, I think, as a society.\"\n\nMurmurs about a constitutional challenge began a week before the bill had even been passed, when top constitutional scholar Anne Twomey, from the University of Sydney, raised a similar argument in November 2024 on her YouTube channel.\n\n\"This law [is not] going to get kids off their devices and out into the back garden,\" Professor Twomey said in a subsequent video posted two months ago.\n\nA constitutional fight is brewing over Australia’s world-first social media ban. (ABC News)\n\n\"Nor is it going to do much to protect them from harm.\"\n\nOn the other hand, Professor Twomey argued the new law would likely \"burden\" their political communication.\n\n\"A young person could not make comments on videos on YouTube, indicate likes or dislikes for videos, or upload their own videos.\n\n\"This is likely to be where any burden lies because it would inhibit the person from engaging in political debate,\" she said.\n\nThe tech war quietly raging behind the social media ban Photo shows Images of 'old man' face used to bypass social media age bans. From December 10, social media platforms will be forced to block under 16s in Australia from holding accounts, but experts warn age checks can be easily bypassed in several ways, including a $22 \"old man\" mask.\n\nThe Human Rights Law Centre (HRLC) also raised the prospect of a constitutional challenge in its submission to an inquiry into the bill, right before it was passed.\n\n\"In the modern era, social media platforms are one of the primary tools for political communication,\" the submission stated.\n\n\"It is actually a legitimate objective of government to keep children, and indeed all people, safe online,\" said David Mejia-Canales, a senior lawyer at HRLC.\n\n\"But the legislation, as it is right now, is a really poor solution to a genuine problem.\"\n\nHow a High Court challenge may play out\n\nA constitutional fight over the teen social media ban would not be an easy case to win, experts said.\n\nThat is in part because the implied right to political communication in Australia's constitution is far weaker than its more famous American cousin, the First Amendment, also known as the right to free speech.\n\n\"A lot of Australians might think that we have something similar to a First Amendment,\" University of New South Wales associate professor Daniel Joyce said.\n\n\"But we don't have a bill of rights in our constitution.\n\n\"That's something that's been lamented by a lot of people.\"\n\nDaniel Joyce is from the University of New South Wales. (ABC News: Billy Cooper)\n\nIn order to succeed, a challenge on that basis will need to pass three key tests, according to Mr Mejia-Canales, starting with whether or not the law does in fact burden political communication.\n\n\"I would argue that it really clearly does,\" he said.\n\n\"It is a blanket ban on people under 16 from using social media — it actually just removes their ability to communicate about political matters across the board.\"\n\nThe second test is whether the law has a legitimate goal, which in this case is to keep young people safe from online harms.\n\n\"Which the Commonwealth has identified as including excessive screen time, social isolation, sleep interference, poor mental and physical health, and low life satisfaction,\" Professor Twomey said.\n\nAnne Twomey has raised concerns about the social media ban. (ABC News: David Sciasci)\n\n\"While a court would most likely accept that these are legitimate objects, it's much harder to tie them to what the law actually does.\"\n\nIn layman's terms, the third test is whether the law is proportionate to its purpose, and is seen as the most likely point of failure.\n\n\"That is, protecting young people from those harms in a way that has the least impact upon freedom of political communication,\" Professor Twomey said.\n\n\"This is where the trouble lies because there is such a disconnect between what the law is claimed to do and what it actually does.\"\n\nDr Joyce argued there were alternative approaches, such as the government's own proposal for a \"digital duty of care\", which would protect young people without blocking their access to online spaces.\n\n\"We don't know if the government has considered other, less intrusive ways of achieving the same outcome,\" Mr Mejia-Canales said.\n\nWhy we haven't seen a case in court yet?\n\nWhile experts agree there is a legitimate case to be heard about the ban's validity, there are many reasons why no such case has materialised.\n\n\"Having a constitutional case, particularly before the High Court, is expensive, time consuming … and incredibly stressful,\" Mr Mejia-Canales said.\n\n\"Particularly for any young people who might be a party to this case, and this is why I think we have not seen that challenge yet.\"\n\nDavid Mejia-Canales is a senior lawyer at the Human Right Law Centre. (ABC News: Billy Cooper)\n\nThere were also major administrative hurdles to consider, Dr Joyce said.\n\n\"It's quite a big endeavour,\" he said.\n\n\"In order to bring a constitutional case, you need to notify … all the attorneys-general in the states and territories and they might intervene.\"\n\nThe HRLC is considering a challenge of its own, but has not yet reached a point where it can proceed.\n\nHow will the social media ban work? Photo shows Graphic of child looking at a screen with the logos of all social media companies with squiggles in the background. The social media saga has produced its fair share of intrigue. But the latest big reveal on how the ban will work has left us with just another cliffhanger.\n\n\"At the moment, we're just working with others and taking instructions and, and speaking with [impacted] communities,\" Mr Mejia-Canales said.\n\nDespite its threats, Google is also yet to file a challenge and has not responded to media inquiries on the subject since July.\n\nMr Mejia-Canales said a challenge would become significantly more likely to emerge \"once all the moving parts of this legislation\" were actually in place.\n\n\"It's still a huge moving feast, which is why I'm not surprised that we haven't seen a challenge being mounted just yet,\" he said.\n\n\"But I wouldn't be surprised if one is already in the pipeline.\"\n\nYouTube may challenge its inclusion in the ban\n\nDocuments recently released under Freedom of Information laws reveal YouTube may yet try other legal avenues.\n\nIn its letter to Ms Wells in July, the platform repeated its claim that YouTube should be considered a video streaming platform, rather than social media, signalling it may challenge its inclusion in the ban on definitional grounds.\n\nWhat do you think about the social media ban for young people? Have Your Say. Photo shows Graphic of text bubbles with various comments around factors contributing to digital dilemma The ban on social media for under 16s is around the corner and could have wide-reaching impacts. Are you in favour? Will it work? Have Your Say.\n\nThe third legal option YouTube is considering is a challenge on the grounds of procedural fairness, arguing the government promised one thing, and delivered another, without a good enough reason.\n\n\"Given the legislation was passed on the express understanding that YouTube would be excluded, there is real doubt as to whether the removal of that exclusion is an appropriate exercise of the minister's power,\" the letter said.\n\nStaff from the Office of the eSafety Commissioner revealed in Senate estimates this week that Google and the regulator were still at 10 paces when it came to YouTube's inclusion, and neither was backing down.\n\n\"At this stage, Google and YouTube have conveyed to us that they don't consider that they're covered by the ban. We have a different view. We've advised them of that,\" eSafety head of enforcement Heidi Snell said on Wednesday.\n\nShe told the hearing Google was yet to say whether it would comply with the ban come December 10.\n\n\"That's probably a matter to wait and see closer to the time,\" Ms Snell said.\n\n\"If they choose to not comply then we will consider what next steps might be appropriate in terms of enforcing the legislation.\"\n\nIn developing the bill, the government did assess the impact on human rights, and determined the benefits would outweigh the negative impacts.\n\n\"Our world-leading social media laws are about protecting children from online harm, and giving them three more years to develop real-world connections and online resilience,\" the minister's office said in a statement.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/wwe-event-with-john-cena-to-attract-thousands-to-perth/105879262",
        "title": "Huge crowds flood Perth for WWE blockbuster featuring John Cena",
        "publish_date": "Sat, 11 Oct 2025 00:14:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "Pressed up against a metal barricade with a crowd of thousands behind him, wrestling super-fan Jarrod Richardson has flown across the country to attend a three-day World Wrestling Entertainment (WWE) spectacular in Perth's CBD.\n\nMr Richardson was joined by huge crowds in Forrest Chase in Perth on Friday night for the first of a series of shows to be held during the WWE's Crown Jewel spectacle.\n\nJarrod Richardson (centre) has travelled from Sydney to attend the event. (ABC News: Lauren Smith)\n\nHe made it front and centre for the weekend he spent a small fortune on.\n\n\"Five of us bought tickets, we've spent $15,000,\" he said.\n\n\"And then about another four-grand on merchandise.\"\n\nThousands of people have attended a launch event in Perth's CBD. (ABC News: Lauren Smith)\n\nWrestling star and Hollywood actor John Cena is set to appear in Perth for the event, along with other WWE superstars like Roman Reigns, Cody Rhodes, Seth Rollins, Tiffany Stratton, AJ Styles and Stephanie Vaquer.\n\nPowerhouse Aussies like Rhea Ripley and Bronson Reed will also be stepping into the ring throughout the weekend.\n\nMr Richardson had flownfrom Sydney for the event, but he said he had travelled further before to watch his favourites battle it out in the ring.\n\nJohn Cena, pictured with Cody Rhodes at WrestleMania this year, will headline the weekend. (Supplied: WWE)\n\n\"I went to the [United] States in the 90s with family,\" he said.\n\n\"I've been following them for a very long time since I was about five year old.\"\n\nOlivia Nicolaides, 16, said she was \"pretty obsessed\" with wrestling and had travelled from Melbourne to cheer on her favourite WWE superstar.\n\nOlivia Nicolaides, 16, is most excited to see Rhea Ripley in the ring. (ABC News: Lauren Smith)\n\n\"I feel like I'm a really big fan, I really love Rhea Ripley,\" she said.\n\n\" She's just so inspiring to me and I love her so much. \"\n\nBig business for WA\n\nIt is not the first time Western Australia has hosted an event like this, with people from across the globe flocking to the statefor the WWE Elimination Chamber held at Perth Stadium in February 2024.\n\nThe show featured wrestling figures like Ripley, Logan Paul and Randy Orton, and generated more than $36 million for the WA economy.\n\nPeople of all ages are flocking to the WWE events this weekend. (ABC News: Lauren Smith)\n\nPerth was announced as the host city for the event earlier this year during WrestleMania in Las Vegas — an event in which Cena competed that garnered global attention.\n\nThe WA Minister for Tourism Reece Whitby said he would not disclose the amount the government invested to secure Cena's attendance.\n\nReece Whitby says the event will boost WA's economy. (ABC News: Lauren Smith)\n\nPerth attracts global audience for WWE event Photo shows A woman wearing black clothing with purple shoulder spikes crouches on the outside of the ring mat glaring at the audience Thousands of fans, some who've travelled across the world, are eagerly anticipating the first World Wrestling Entertainment event in Perth since 2018.\n\n\"Any investment we make is confidential,\" Mr Whitby said.\n\n\"We want to be competitive in the future.\"\n\nMr Whitby said the profit from the event would exceed the cost and generate a significant boost to the state's economy.\n\n\"More than half of them [the crowd] are from outside of Western Australia,\" he said.\n\n\"They're coming here spending millions of dollars.\"\n\nMr Whitby says a large percentage of event attendees have come from outside WA. (ABC News: Lauren Smith)\n\nMr Whitby said events such as these helped put Perth on the map as a serious tourism destination.\n\n\"We want to be the destination for big events in south-east Asia all the time,\" he said.\n\nIn addition to the star-studded shows, there will be other activities held across Perth over the weekend, including a WWE pop-up store in Murray Street Mall.\n\nInteractive activities will be held at RAC Arena, and an onsite barber will offer WWE-inspired styles at the pop-up Netflix Sports Club at Northbridge Brewing Company on Saturday and Sunday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/bathurst-crash-sparks-safety-car-in-v8-superutes/105880434",
        "title": "Barrel rolling ute causes safety car at Bathurst",
        "publish_date": "Sat, 11 Oct 2025 00:04:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "Bathurst 1000's Saturday session has started with a bang, as V8 SuperUtes driver Dave Casey rolled his Mitsubishi Triton twice at Mount Panorama.\n\nCasey was tapped by Luke Webber down the hill on the way to Murray's corner with 10 minutes remaining in the 25-minute long race two.\n\nHe slid on the grass, crashing through a sign next to the pit entry, before being bounced into the air on the sand trap.\n\nThe V8 SuperUte race was at about half race distance. (Supplied: Fox Sports)\n\nThat sent the ute sideways into the sand where it dug in and flipped twice before landing on the home straight.\n\nIncredibly, Casey was able to drive the car off the racing line despite the considerable damage to the rear axle, but was unable to drive it into the pits.\n\n\"I got a tap from behind and that pushed me over onto the grass,\" the 34-year-old former off-road racer from Rockhampton told Speedcafe.\n\n\"I had the brakes locked on, but it then dug into the sand and went over.\n\nDave Casey went airborne through the sand trap. (Supplied: Fox Sports)\n\n\"My main concern was not staying on the track when it rolled back and possibly hit someone. I just wanted to get it out of the way.\"\n\nWhen is the Bathurst 1000, and will it be raining? Photo shows Will Brown drives his car with Mount Panorama sign in the background The 2025 Bathurst 1000 gets underway this weekend. Here's all you need to know before the 68th running of the iconic endurance race.\n\nCasey, who was able to walk away from the incident, still hopes to race in the next two races of the weekend.\n\nRace three is at 1:25pm (AEDT) and race four is at 6:55am on Sunday.\n\nCasey had finished in 13th place on Friday's race one, just behind Webber in 12th.\n\nWebber finished 19th, the last of the classified runners, in race two, after his shunt, not that Casey was sated.\n\n\"It cost [Webber] 30 seconds and its cost me 30 grand,\" he said.\n\nSupercars in the sand ahead of rainy Bathurst 1000\n\nAlthough there was no sign of the rain that is expected on race day on Saturday, that didn't stop a number of drivers in the Supercars from beaching their cards during the first practice session of the day.\n\nLochie Dalton was first to send his car Mustang into the sand at the exit of turn one, overcooking the entry.\n\nThen, veteran driver Jamie Whincup locked up his front right into the same corner and spun, ending up being marooned in the sand.\n\nIt has already been an eventful weekend in Bathurst, James Golding slamming his Chevrolet into the wall at Griffins (turn 2), not long after Anton De Pasquale and Macauley Jones both gave it a swipe on Friday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/synergy-billing-mistake-could-affect-other-companies/105879468",
        "title": "Synergy overcharged for 15 years, other companies have done similar",
        "publish_date": "Fri, 10 Oct 2025 23:59:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "A $40 million overcharging bungle by WA's largest energy retailer was a result of serious governance failures and other businesses may have also fallen foul, according to the state's economic watchdog.\n\nIt was revealed yesterday state-owned Synergy has taken $40 million from customers for non-existent bills since 2009.\n\nAccording to the company's CEO Kurt Baker, on many occasions this occurred because Synergy \"allowed customers to continue to pay to their closed account, even in the absence of a bill\".\n\nCustomers were debited for Synergy accounts that had already been closed. (ABC News: James Carmody)\n\nAlmost 175,000 customers were affected, with the overcharging ranging from less than a dollar, to tens of thousands of dollars.\n\nThe revelations come amid a review into Synergy after revelations from the Economic Regulation Authority of WA (ERAWA) the utility had overcharged disadvantaged customers $2.29 million over 15 years.\n\nERAWA chair Steve Edwell said payments were being automatically deducted from Centrelink payments from customers whose Synergy accounts were already closed.\n\nSteve Edwell is chair of Economic Regulation Authority of Western Australia. (ABC News: Cason Ho)\n\n\"We focused on the Centrepay cohort of customers because they were disadvantaged — the question on the table was the extent to which this is a broader issue,\" Mr Edwell told the ABC.\n\nMr Edwell said Synergy's $40 million bungle, affecting mostly residential customers, was the worst case of its kind he was aware of.\n\nAlmost 175,000 people were affected by the issue, dating back to 2009. (ABC News: Chris Gillette)\n\n\"There are around 13,000 accounts which have accrued in excess of $500, and there are 467 accounts which have accrued a credit balance in excess of $5,000,\" he said.\n\n'Very serious lapse'\n\nMr Baker said on Friday the company had been alerted by customers in the past of automatic payments being made to closed accounts, and those customers were refunded.\n\nMr Edwell said Synergy should have noticed those instances as red flags indicating there was a broader issue.\n\n\"That's why we have an issue with the governance around all this. We think there's been a very serious deficiency,\" Mr Edwell said.\n\nSynergy customers overcharged $40 million Photo shows A large illuminated Synergy sign on a wall. More than 170,000 customers have been overcharged a total of $40 million by WA's state-owned energy retailer Synergy since 2009, sparking an apology from its CEO.\n\n\" To be frank, it's a very, very serious lapse in Synergy governance. \"\n\nThe review into Synergy is part of a broader effort by the Economic Regulation Authority to understand the full extent of the issue across the industry.\n\nMr Edwell has flagged there are other businesses which have also overcharged customers in a similar fashion.\n\n\"It doesn't appear to be an endemic problem across the sector [but] that doesn't mean to say we won't be taking some form of action against some other retailers,\" he said.\n\nMr Edwell said he was unable to reveal details about the other businesses, or the full extent of the issue, until the review was complete.\n\nRefunds coming\n\nSynergy said on Friday it would contact all affected customers and issue cash refunds, or credit for future bills, but that process could take several months.\n\n\"On behalf of Synergy I'd like to say I'm sincerely sorry for the impact that we've had on our customers,\" Mr Baker said.\n\n\"I'm confident this will not happen again.\n\nKurt Baker says he's confident the issue won't be repeated. (ABC News: Cason Ho)\n\n\" We've done our own internal reviews, we've got the state government's independent review, we'll be taking our findings, the state government's findings, to improve our systems. \"\n\nMr Edwell said ERAWA had the ability to issue fines of \"over $100,000\" if businesses like Synergy failed to fix the issue.\n\n\"The penalty of that size is in nowhere near proportion to the damage that's done here,\" he said.\n\n\"The ERA is currently considering as part of this review, what we can say to Synergy, what we can say to government, about appropriate enforcement action.\"\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/femke-bol-steps-up-to-800m-jess-hull/105880298",
        "title": "Hull's 'side quest' gets new rival as hurdles world champ steps up",
        "publish_date": "Fri, 10 Oct 2025 23:41:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian middle distance runner Jess Hull described her foray into the 800m at the Tokyo World Championships as a \"fun little side quest\".\n\nTwo-time Olympic gold medallist Femke Bol merely calls it \"the next challenge\".\n\nDutch 400m hurdles superstar Bol announced in a social media video that she would make the step up to the 800m next season, adding another dimension to one of the sport's most thrilling events.\n\n\"It's time for a new chapter,\" Bol said in the video.\n\n\"It's going to be an extra lap. I'm moving to the 800m.\"\n\nBol is a two-time 400m hurdles world champion, defending her title in Tokyo last month.\n\nSydney McLaughlin-Levrone (centre) and Femke Bol (right) have both shifted away from the 400m hurdles. (Getty Images: BSR Agency/Andy Astfalck)\n\nShe also won bronze at the 2021 and 2024 Olympic Games in the event.\n\nIn both finals, she finished behind American superstar Sydney McLaughlin-Levrone, who won consecutive gold medals.\n\nThe pair have dominated the women's 400m hurdles event, running the nine fastest times in the history of the event between them.\n\nHowever, McLaughlin-Levrone has turned her attention to the 400m flat. She won world championship gold in Tokyo and threatened one of athletics longest-standing world records at the same time.\n\n\"I've learned so much from hurdling and really loved it, it will always have a special place in my heart,\" Bol said.\n\n\"But I'm ready for the next challenge, a new stimulus, a completely different kind of race.\n\n\"It's different from what I'm used to ... and I'm really excited to explore that.\"\n\nBol has won each of the past five Diamond League annual titles in the 400m hurdles, as well as spectacularly anchoring the mixed 4x400m relay to gold in Paris.\n\nRivals rejoice at Bol's step up\n\nKeely Hodgkinson (left) and Georgia Hunter-Bell were quick to praise Bol's decision. (Getty Images: NurPhoto/Pat Isaacs)\n\nOlympic 800m champion Keely Hodgkinson wrote a reply to the video saying, \"Can't wait to share the startline\" with two heart emojis.\n\nWorld championships silver medallist Georgia Bell has dropped down to the 800m from the 1,500m where she won bronze in Tokyo.\n\nShe wrote, \"So exciting Femke! Some serious global finals pending\".\n\nNew Zealand's Zoe Hobbs wrote, \"Love this! So excited for you!\" while Poland's Pia Skrzyszowska just wrote \"You craaaaazy\".\n\nWorld 100m and 200m champion Melissa Jefferson-Wooden said she was shocked to read the news but said she \"loved it\".\n\n\"I love it because it's her challenging herself. It's not like the 800m isn't already a very, very stacked event,\" she told Reuters.\n\n\"She's like 'I'm going to move up to the 800m, I'm going to see if I got what it takes to run with these girls.'\"\n\nAussies to comment on the post included pole vaulter Kurtis Marschall, who wrote \"let's go Fem!\", marathon runner Genevieve Gregson, who wrote \"so exciting!\" and sprint hurdler Liz Clay, who posted several emojis.\n\n\"I've always loved this quote, 'If your dreams don't scare you, they're not big enough',\" Bol said.\n\n\"And I think that's definitely the case here.\"\n\nBol's decision potentially puts her on a collision course with a number of rising Australian middle-distance runners.\n\nJess Hull is the Australian record holder and reached the world championship final in both the 800m and 1,500m. (Getty Images: Patrick Smith)\n\nHull is the current Oceania record holder in the 800m with 1:57.15, a time she set by becoming the first Australian woman to make the final of both the 1,500m and the 800m at the same world championships.\n\nHowever, she described the 800m as \"an extra bit of fun\" to help her top-end speed for the 1,500m, which remains her focus.\n\nAustralia had three runners alongside Hull line up in the 800m in Tokyo: Sarah Billings, Abbey Caldwell and former record holder Claudia Hollingsworth.\n\nNo modern historical precedent\n\nJarmila Kratochvílová (number 411) won the 400m/800m double at the 1983 world championships. (Getty Images: Allsport/Tony Duffy)\n\nAlthough switching between the 1,500m and 800m is relatively common throughout history, there have been far fewer instances of athletes having success changing between one and two lap events, outside of relays.\n\nAlberto Juantorena of Cuba is the only man to claim the 400m/800m double at the same Olympics, doing so in 1976.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nJamaica's Arthur Wint claimed gold in the 400m and silver in the 800m at consecutive Games in 1948 and 1952. South African Bevil Rudd won the 400 and finished third in the 800m in 1920.\n\nNo woman has won both events at the Olympics. The women's 400m was run for the first time only in 1964 and the 800m regularly appeared from 1960.\n\nHowever, British runner Ann Packer won silver in the 400m, behind Australia's Betty Cuthbert in 1964, while also winning gold in the 800m.\n\nCzech athlete Jarmila Kratochvílová, won both events in the 1983 World Championships and still holds the 800m world record set at that competition.\n\nBol and McLaughlin-Levrone are not the only athletes to have made the successful transition from the hurdles to the flat, with Australian Jana Pittman, British runner Sally Gunnell and American Edwin Moses among several to have done so.\n\nThe women's 800m provided one of the most intriguing finals at last month's World Athletics Championships in Tokyo.\n\nKenyan Lilian Odira claimed gold ahead of Olympic 1,500m bronze medallist Hunter-Bell, with Olympic champion and favourite Hodgkinson third after an injury-interrupted year post-Paris.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/borroloola-strikers-remote-aboriginal-womens-soccer-team-revived/105874590",
        "title": "The remote Aboriginal community where soccer reigns supreme",
        "publish_date": "Fri, 10 Oct 2025 22:41:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Aussie rules footy is the lifeblood of Aboriginal communities across the Northern Territory.\n\nBut in the East Arnhem Land community of Borroloola, the iconic goalposts synonymous with the home-grown sport are nowhere to be seen.\n\nHere, soccer is the word, and Jorja Miller has been kicking a round ball since she was a little girl.\n\nJorja Miller says soccer is one of the most popular sports in her hometown of Borroloola. (ABC News: Marcus Kennedy)\n\n\"Soccer was in our community for very long time,\" she says.\n\n\" It's the most popular sport in Borroloola, every kid enjoyed it, loved playing soccer. \"\n\nNow Jorja and her teammates are making history as part of the remote Aboriginal community's recently revived women's soccer team, the Borroloola Strikers.\n\nBarefoot games and big dreams\n\nAfter years in the wilderness, as what looks like a repurposed school bus ambles around the community's worn roads and red dirt tracks, the newly minted Strikers pile into the back.\n\nThe players range in age from 14 to their early 30s, and their connection stretches beyond the soccer field, with many taking to the field alongside close and extended family members.\n\nDenise Lalara says playing with her cousin-sisters makes the whole team better.\n\n\"I like playing soccer to make my family happy and proud,\" she says.\n\nDenise Lalara is a player for the Borroloola Strikers soccer team, who dreams of playing the sport professionally. (ABC News: Marcus Kennedy)\n\nLike many of her teammates, Denise wants to make it to the big leagues.\n\n\"I want to chase my dream,\" she says.\n\nBut for now, it's a bumpy, hour-long drive to the team’s training ground at the Macarthur River Mine outside town.\n\nAs the women and girls run onto the field, their cleats stay on the sidelines — the Borroloola Strikers do their best work barefoot.\n\nNeveah Dickson does not hesitate to give the soccer ball a strong kick while barefoot. (ABC News: Tilda Colling)\n\nThe players move quickly, manipulating the ball around each other with practised speed and skill.\n\nThe goals may have no nets, but the celebrations are still raucous when the ball flies through the metal frame.\n\nFor many of the girls these once-a-week training sessions are a chance to leave their problems behind and focus on their greatest passion.\n\n\"I like being around friends, making new friends, just going out there and enjoy more sports,\" Tonita Cooper says.\n\nThe Borroloola Strikers play on a pitch at the Macarthur River Mine which is an hour-long drive outside of town. (ABC News: Tilda Colling)\n\nReady to compete in First Nations Football Festival\n\nEarlier this year, the Strikers played their first match against established Darwin club the Mindil Aces.\n\nAnd despite their fledgling status, not only did the team from Borroloola win, they kept the other side goalless.\n\nBut their biggest challenge so far will come next week, when the Strikers compete against teams from across the nation at the NSW First Nations Football Festival in Dubbo.\n\nIt will be their first time playing in a registered competition and the first time travelling interstate for many players.\n\nThe Borroloola Strikers will be competing in the NSW First Nations Football Festival in Dubbo NSW next week. (ABC News: Marcus Kennedy)\n\nAfter one of their coaches pulls them into a post-training huddle in the middle of the pitch, there are smiles and laughter all round as each name is called to collect their new jersey, ready for the competition ahead.\n\n\"They're all connected in some way, but I think put them together and having something to look forward to like a competition and representing Borroloola but also the Northern Territory, I think is a great opportunity for them,\" coach Steve McAllan says.\n\n\" The problem is going to be putting the boots on them and keeping the boots on them, that's going to be the issue. \"\n\nMany of the players for the Borroloola Strikers prefer to play the game barefoot. (ABC News: Marcus Kennedy)\n\nLocal A-League icon inspires young players\n\nFor many of the women and girls, the dream of going professional doesn't feel so out of reach.\n\nWhen asked who their soccer hero is, only one name is spoken — Shadeene \"Shay\" Evans.\n\nShadeene Evans on the importance of Indigenous Football Week Photo shows Shadeene Evans wears a light blue soccer shirt with the number 17 on it, and looks into the camera while standing on a field. Indigenous Football Week is highlighting a program creating change in remote communities.\n\nThe A-League star and former member of the Young Matildas started her career on the same pitch, with some of the players on this team.\n\n\"There's no other young people in our community who inspired us like Shadeene Evans,\" Jorja says.\n\nEvans is a family member of a few of the present-day Borroloola Strikers and encouraged them to restart the team, with many now keen to follow in her footsteps.\n\nFootball NT chief executive Jamie Monteith says in the past, there haven't been enough pathways for remote players to make it big but he says that's changing.\n\n\"The reality is they enjoy what they do, we have 15 girls here, but we have a rich history of the community playing the game,\" he says.\n\nJamie Monteith says having good role models gives the young soccer players something to aspire to. (ABC News: Marcus Kennedy)\n\n\"First and foremost is making sure they still love the game and through that, identifying who can get to that next level.\n\n\"Using role models like Shay and many other athletes that have come before them to basically give them the platform to aspire to and to be the best they can be.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/socceroos-vs-canada-internatonal-friendly-live-blog/105880362",
        "title": "Live: Late Irankunda goal seals Socceroos win in Montreal",
        "publish_date": "Fri, 10 Oct 2025 22:36:13 +0000",
        "category": "sports",
        "authors": [
            "Dean Bilton"
        ],
        "text": "(Getty Images)\n\nThat is some sort of win for Tony Popovic and the Socceroos. They rode their luck at times and looked lost for periods in the first half, but were much improved in the second half and deserved their win.\n\nNestory Irankunda's goal was just rewards for a brilliant second half performance. He ran the Canadians ragged, got under their skin and could have been involved in a handful of goals. Jordy Bos coming on made a big difference too, but there was an aggression and bite to the Aussies after the break which was summed up by Nestory's goal.\n\nBut Australia's man of the match was goalkeeper Paul Izzo, who rose to the occasion with a series of sensational saves. He commanded his area when the aerial bombardment came in and pulled off at least one miracle stop from Jacob Shaffelburg.\n\nThe Socceroos are a work in progress, but a proper football team is being built here. Entertaining and resilient, and very easy to get behind.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/illawarra-hotel-renovation-refusal-protest-mocks-palm-tree-art/105870512",
        "title": "Hotel owner mocks council's palm tree art after renovation refusal",
        "publish_date": "Fri, 10 Oct 2025 22:16:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "A heritage-listed hotel situated just metres from Wollongong's controversial palm tree up-a-pole art installation is now the site of a bizarre protest.\n\nFive small, potted palm trees have been strapped to the top of street poles outside The Illawarra Hotel, in the city's CBD.\n\nThe installation is designed to mock the nearby permanent display of three cabbage tree palms bought by Wollongong City Council in 2017 at a cost of $620,000.\n\nThe art display including a living cabbage tree palm tied to a metal pole has been a huge talking point since 2017. (ABC Illawarra: Brooke Chandler)\n\nThe permanent exhibit in Crown Street includes a rock playground with a swing, two palms lying on ground level and one up a pole.\n\nThe unusual move by business owners Ryan and Nikki Aitchison came after the council knocked back their development application (DA) to repurpose disused areas of the three-storey building.\n\nThe permanent exhibit includes a rock playground, two palms lying on ground level and one up a pole. (ABC Illawarra: Brooke Chandler)\n\n\"Back when we were friends with council, we liked the palm trees up-the-pole,\" Mr Aitchison said.\n\n\"But after how we've been treated … all I can do now is make as much noise as possible.\"\n\nSmall, potted palm trees were strung up on street poles outside the hotel. (ABC Illawarra: Brooke Chandler)\n\nSo, what did council say no to?\n\nIn May 2024, The Illawarra Hotel lodged a development application to turn the ground floor into a TAB area and replace dilapidated accommodation on the first and second floors with a kitchen, bar and bistro.\n\n\"In the centre of the hotel, we would have fully restored the original staircase … and then on the western side we'd have a ballroom with fixtures that were period specific,\" Mr Aitchison said.\n\nThe Illawarra Hotel wanted to build a 1930s-style ballroom. (Supplied: Ryan Aitchison)\n\nThe Wollongong couple, who bought the nearly 100-year-old premises in 2019, also wanted to install a rooftop bar above the ballroom, creating an open-air void between the second and third floors.\n\n\"It was something that would meet the needs of the community because there is a shortfall in rooms that can accommodate 100 to 400 guests,\" Mr Aitchison said.\n\nThe Illawarra Hotel in Wollongong's CBD is best known for its ornate architectural facade. (Supplied: Ryan Aitchison)\n\nThe desired renovations were due to cost about $6 million and would have followed on from major works completed to the ground floor in 2020.\n\n\"We felt we have more than proven to Wollongong that our heart was in the right place and we had chosen to be custodians of this building,\" Mr Aitchison said.\n\nHeritage, structure concerns\n\nWollongong City Council last month rejected the development application, citing concerns about how the structural engineering solutions would affect the building, which was heritage listed in the Wollongong Local Environment Plan 2009.\n\nLoading...\n\n\"We required the works done in a way people could still interpret the building's original lay-out, that didn't impact any retained heritage detailing, and [could be] reversed … [to] the building's original structure,\" the council said in a statement.\n\nIt said the \"overriding concern\" was the building's structural integrity through the creation of the void between the second and third floors.\n\n\" Council is open to considering alternative design approaches to the void area, which may address potential heritage impacts. \"\n\nAfter stringing up his palm trees, Mr Aitchison launched legal action against the council in the NSW Land and Environment Court.\n\n\"Council haven't engaged a structural engineer, nor have they asked us to engage a structural engineer,\" he said.\n\nWollongong City Council said in a statement \"it is the responsibility of the proponent to demonstrates that issues can be addressed.\"\n\nPassersby said The Illawarra Hotel's take on Wollongong's palm tree up a pole was entertaining. (ABC Illawarra: Brooke Chandler)\n\nWollongong heritage consultant Andrew Conacher said heritage decisions were complicated and he suspected the council wanted more of the original character of the building maintained.\n\n\"The DA [development application] has been with council for 18 months, and sooner or later they have to make a decision and put in as many reasons as possible,\" he said.\n\nMr Conacher said the DA lodged by The Illawarra Hotel respected the building's intended use.\n\n\" It's not as if you are putting something completely different into the building; you're putting something similar to its current use. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/laurie-burgess-art-courier-delivery-driver-collector/105878528",
        "title": "Laurie works 16-hour days delivering artworks around Australia",
        "publish_date": "Fri, 10 Oct 2025 22:05:03 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Laurie Burgess is not just any courier.\n\nAbout 20 years ago, he made the decision to move only art across the country.\n\nThe back of his van is packed with paintings, drawings, sculptures and ceramics which he ferries to galleries, buyers, and art competitions around Australia.\n\nHe clocks up 1 million kilometres every four years, working 16-hour days.\n\nAlong the way, he's developed an appreciation and knowledge of the Australian art world few could rival.\n\n\"This is not me blowing my own trumpet, but there is no one person that sees as many galleries as myself or as many artists as myself,\" Mr Burgess said.\n\nMr Burgess has travelled millions of kilometres in his trusty van. (ABC News: Jordan Young)\n\nIt means gallery owners and artists are often calling him wanting to know what's happening in the world of contemporary art.\n\n\"There's a lot of emotion in art. A lot of artists can be rather anxious at times and so you've got to sort of help them to keep their spirits up,\" Mr Burgess said.\n\nWhen the pandemic hit, many feared art sales would dive.\n\n\" I said, 'Well, if people are going to sit there staring at the walls, maybe they're going to buy something to put on that wall', and as it turned out ... it was actually quite good. \"\n\nMr Burgess says the Covid19 pandemic was \"quite good\" for art sales. (ABC News: Jordan Young)\n\nOwner of Handmark Gallery in Hobart Allanah Dopson said it was essential for artists to be able to move their art across the country.\n\n\"It's really good for artists to enter interstate prizes and to get recognition and get their art out there. So, Laurie fills that void really well,\" she said.\n\n\" We are in awe of Laurie each time he comes and says, 'Oh, I've been across the Nullarbor' or, 'Yesterday I was in Sydney.' \"\n\nAllanah Dopson says artists often need works moved for interstate competitions. (ABC News: Jordan Young)\n\nSleeping in his van\n\nMr Burgess spends most of the year on the road driving between Perth and Hobart and up the east coast of Australia — as far north as Noosa — and back again.\n\nHe only takes time off during January and Easter.\n\nHe said while his lifestyle was \"not for everyone\", he was working hard to save enough money to buy a house and retire.\n\n\"It will be the first house I've ever bought, the only house I will ever buy,\" he said.\n\nMr Burgess has retrofitted his van with a sleeping area to save on hotel costs. (ABC News: Jordan Young)\n\nSaving for a home has come with some cost-cutting measures.\n\nHe's built a specially designed sleeping section in his van to save on staying at roadside motels.\n\n\"[I can] pull over, crawl into it, no time lost, no time wasted,\" he said.\n\nMr Burgess said a comfortable mattress, doonas and electric blankets were essential.\n\n\"[During winter] all I seem to be doing is driving around finding different places to freeze to death, such as out on the Nullarbor or Yass,\" he said.\n\nSome of Mr Burgess's delivery destinations. (ABC News: Magie Khameneh)\n\nArt appreciation\n\nMr Burgess's home ownership dream is taking longer to realise than he expected.\n\nNot only have house prices gone up, but his growing art collection is also getting in the way.\n\n\"I do end up buying a little bit [of art]. My accountant said to me I have to stop doing that or I will never have a house to hang them in,\" he said.\n\nMr Burgess has learnt a thing or two about art over the years. (ABC News: Jordan Young)\n\nMr Burgess said he never really knew much about art before he started moving it around the country.\n\nBut these days he knows what he likes.\n\n\"If I had to describe my taste, it's nickelodeon,\" he said.\n\nHandmark Gallery in Hobart is one of galleries Mr Burgess delivers to. (ABC News: Jordan Young)\n\n\"I'm all primary colours, bright colours, movement; and it can be glass, it can be ceramics, it can be paintings, pastels.\n\n\"I've even got a couple of little pencil drawings and some coloured pen drawings from an emerging artist in Robe, South Australia, which are perfect kitchen drawings.\"\n\nBut for now, Mr Burgess's collection is in storage until he is in a position to pull over for a while and take a break from delivering art.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/gfg-accused-of-failing-to-meet-loan-conditions/105879418",
        "title": "Tasmania gave GFG Alliance a loan for ore supply. But now the ore isn’t being used",
        "publish_date": "Fri, 10 Oct 2025 21:33:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Tasmanian government has accused the owner of a manganese smelter in the state's north of failing to meet the conditions of a $20 million loan that was meant to ensure its ongoing supply of ore.\n\nLiberty Bell Bay is owned by GFG Alliance and is Australia's only manganese alloy smelter. It has been in limited operations since May, which has placed uncertainty over the future of around 250 jobs.\n\nGFG required a 23,000-tonne shipment of manganese ore in order to restart, and the state government provided the loan in August.\n\nThe shipment arrived last week, but operations are yet to restart.\n\nThe $20 million loan paid for one shipment of manganese ore. (ABC News: Emily JB Smith)\n\nIndustry and Resources Minister Felix Ellis said the loan came with \"clear, enforceable conditions\".\n\n\"We have formally written to the company putting them on notice that they have not met the conditions of the loan,\" he said.\n\n\"The state holds security over the asset but our confidence in GFG's ability to meet its obligations has been severely undermined by its failure to restart operations.\n\nTrump tariffs, ore price cited as smelter announces 'limited operations' Photo shows Unidentified workers wearing hard hats and overalls. One of the biggest industrial manufacturing employers in Tasmania's north says a lack of ore supply and US tariffs have played a part in a decision to pause smelter operations.\n\n\"We will not rule in or out any options that protect Tasmanian workers and the future of the Bell Bay operation.\"\n\nThe loan included a condition that GFG take all steps to resume production by the end of September.\n\nA Liberty Bell Bay spokesperson said the ore was being unloaded and preparatory work was underway.\n\nThe company blamed \"ongoing challenges with ore supply\" caused by a cyclone for the initial period of limited operations.\n\nIt now says a collapse in ferroalloy prices is affecting the restart.\n\nThe smelter, owned by GFG Alliance, employs about 250 full-time workers. (ABC News: Owain Stia-James)\n\n\"Given sudden changes in market conditions, it is now prudent for Liberty Bell Bay to first gain clarity on its supply position in the US market before commencing a restart of the smelter,\" the company said in a statement.\n\n\"High carbon ferro manganese prices have fallen over 13 per cent in the US since June, with 9 per cent in the last week alone.\n\nLocals fear for jobs after Liberty Bell Bay limits operations Photo shows Three individuals wearing casual outdoor clothing photographed from the shoulders up. Liberty Bell Bay employs more than 250 full-time workers, mostly from the George Town area. Locals say they are worried about the impact of job losses as the smelter announces it's limiting operations.\n\n\"A team from Liberty Bell Bay will be meeting customers in the United States next week to take stock of the situation and gain clarity.\"\n\nGFG Alliance has been contacted for comment regarding whether it has failed to meet the conditions of the government loan.\n\nThe $20 million loan was recommended by the Tasmanian Development Board, and was welcomed at the time by all sides of state politics as providing certainty to workers.\n\nGFG facing financial troubles across its companies\n\nGFG Alliance operations have faced crises in multiple states — most notably its former Whyalla site — and its Liberty Bell Bay manganese smelter is no different.\n\nThis week, the Whyalla Ports administrators' report stated that Liberty Bell Bay had a $121.4 million capital deficiency as of June 30, and was operating at a net loss of $80.3 million.\n\nIt confirmed the Tasmanian government loan has first ranking security of Liberty Bell Bay assets.\n\nIn addition to this loan, Liberty Bell Bay would require a further capital facility to continue operating, the administrators' report said.\n\nThe report notes that, if the smelter closes, there would be a rehabilitation claim of about $200 million.\n\nGFG moves $200 million out of Liberty Bell Bay\n\nThe Tasmanian government has received advice from Deloitte that points out Liberty Bell Bay would likely require either private or government capital assistance, and that it was unclear if GFG would be able to contribute.\n\nIt disputes that the smelter's issues are primarily due to ore supply problems or soft sales markets.\n\nInstead, it states that GFG has moved about $200 million out of Liberty Bell Bay to related parties via inter-company loans, and paid a cash dividend to the UK parent company in 2022.\n\nGFG faced similar claims in relation to its Tahmoor colliery in New South Wales.\n\nRoll-on effects significant for troubled smelter\n\nThe government estimates that Liberty Bell Bay provides a further 400 indirect jobs.\n\nThe Liberty Bell Bay smelter is a major employer near George Town, in the state's north. (ABC News: Kate Nickels)\n\nThis includes workers at the Beams Brothers quarry at Flowery Gully in the West Tamar, which provides the smelter with limestone, dolomite and iron ore.\n\nCompany head Donald Beams told ABC Radio Hobart that the smelter provides up to 40 per cent of the quarry's business.\n\nHe said he only found out that the smelter would not be immediately restarting via ABC news.\n\nBell Bay Advanced Manufacturing Zone chief executive officer Susie Bower said the restart would need to wait until after Liberty Bell Bay representatives had secured US customers.\n\n\"If that's not an opportunity, then they will need to pivot to look at other markets,\" she said.\n\n\"Can't say with any certainty whether that money will be returned. But this is what happens, again, in free trade, global markets.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/new-sydney-fish-market-opening-january-next-year/105880252",
        "title": "New Sydney Fish Market to open in January after 'last hurrah' at old site",
        "publish_date": "Fri, 10 Oct 2025 21:17:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "The new $700 million Sydney Fish Market won't be open in time for Christmas.\n\nConstruction at Blackwattle Bay in Sydney's inner-west is set to be completed in mid-November, but customers won't be welcomed at the new facility until January 19 next year.\n\nSydney Fish Market CEO Daniel Jarosch said that would allow the new development to be able to \"open with a bang\".\n\n\"A January opening gives tenants the time to finish fit outs this year, and then train staff and prepare operationally, so that they are ready to deliver an incredible experience from day one,\" he said.\n\n\"We've been waiting for this new market for decades, and taking this extra time means that we will open at our best.\"\n\nConstruction of the new market is expected to be completeted by mid-November. (ABC News: Jak Rowland)\n\nSydneysiders will still be able to buy their seafood for the festive period at the existing site in Pyrmont with record numbers expected to attend its 36-hour seafood marathon to enjoy a \"last hurrah\".\n\n\"Traditionally over 150,000 people [come] for the 36-hour seafood marathon, and we expect a lot more to come and celebrate our final marathon at our current site,\" Mr Jarosch said.\n\nSneak peak inside new Sydney Fish Market Photo shows A low rise stair case going upwards with the underside of a roof visible, with wooden beams in a cross-like pattern. The new fish markets at Blackwattle Bay in Sydney's inner-west is expected to rake in more than 6 million visitors each year once it opens.\n\n\"We will celebrate one final Christmas in our current home, before we open the doors to Sydney's newest waterfront icon.\"\n\nOn Thursday, Mr Jarosch said he hoped the new fish market would open this year.\n\n\"You'll be buying your prawns for Christmas, I can say that with confidence,\" he said.\n\nPremier Chris Minns said earlier this week that the new building would become \"a magnet\" for tourists and a \"must-see destination\".\n\nThe new fish market is expected to rake in more than 6 million visitors each year.\n\nMr Jarosch said he hoped the new fish market would be a destination \"people will return to again and again\".\n\n\"It's the end of an exciting time and chapter at our existing fish market that everyone loves, but we're at the beginning of something extraordinary now,\" he said.\n\nTrading hours will be extended to 10pm, compared to the previous closing time of 4pm.\n\nThe longer opening hours are aimed at attracting visitors to stay for sunset, with a view of the Anzac Bridge from the fish markets.\n\nThe government-owned land at the old fish market site in Pyrmont has been slated for residential development, with up to 1,200 homes on the horizon.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/derek-gee-facing-damages-from-moving-from-israel-premier-tech/105880232",
        "title": "'Weighed heavily on my conscience': Cyclist faces $54m 'damages' bill",
        "publish_date": "Fri, 10 Oct 2025 21:02:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "Canadian cyclist Derek Gee says he is facing a damages claim of 30 million euros ($54 million) from his former team Israel-Premier Tech after ending his contract over what he described as \"personal beliefs\".\n\nThe 28-year-old finished fourth overall at this year's Giro d'Italia.\n\nBut he left Israel-Premier Tech shortly before September's Vuelta a España, which was subject to pro-Palestinian protests linked to the Israel-Gaza war.\n\n\"I terminated my contract with just cause, as is every person's right when they are unable to continue performing their work under the existing circumstances,\" Gee said in a statement on social media.\n\n\"This decision was not taken lightly — it followed an irreparable relationship with the team principal, as well as serious concerns related to racing for the team, both from a safety and personal-belief standpoint that weighed heavily on my conscience.\"\n\nIsrael-Premier Tech told Reuters it was unable to comment on the matter as the case was currently before the arbitral board of the UCI, the sport's governing body.\n\nReuters has also contacted the UCI for comment.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nGee said leaving Israel-Premier Tech meant being without a contract or protection if he were injured.\n\nBut he added that it was a risk he was willing to take as he could no longer continue racing for the team.\n\n\"I understand the team sees it differently… however, I am now facing what I understand to be a damages claim said to exceed approximately 30 million euros — for doing nothing more than exercising my fundamental rights as a professional and a person.\n\n\"It strengthens my belief that leaving the team was the right decision, regardless of the recent announcement of branding changes and cosmetic structural shifts.\"\n\nIt is unclear what the 30 million euro figure represents. Riders typically earn only a fraction of that amount.\n\nIsrael–Premier Tech announced on Monday that the team would undergo a full rebrand for the 2026 season, moving away from its Israeli identity after more than a decade.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-11/fashion-gender-equality-dior-chanel-misogyny/105858400",
        "title": "You might end up wearing fashion's misogyny problem",
        "publish_date": "Fri, 10 Oct 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "\"Does fashion Twitter have a misogyny problem?\"\n\nHo-hum, another day, another \"woman\" problem: replace the word fashion in that sentence with anything else you can think of from the manosphere internet and we can have a nice long chat about it.\n\nThat was the headline from Elle Australia last year, when the snarking and sniping from young, male commentators about fashion labels led by women creatives was almost universally critical.\n\nThis Paris fashion week, which has just concluded, we can see exactly what that claim really meant.\n\nVirginie Viard, at Chanel, was described by her predecessor Karl Lagerfeld as \"my right hand and my left hand\". (Reuters: Sarah Meyssonnier)\n\nTikTok celebrates\n\nThose female directors who endured years of online undermining have now gone, replaced by men — very well-credentialed and well-regarded male designers, just as the women were. And wouldn't you know it? TikTok and Insta are now ecstatic at the change, at the new dawn, at the freshness and the vision and thank God for the change!\n\nThere was Virginie Viard at Chanel, described by her predecessor Karl Lagerfeld as \"my right hand and my left hand\", whose runways were decried by the Tokkers as \"uninspired, basic … out of touch with what luxury should be\".\n\nYou could set your watch by the pursed lips and screwed-up faces of the mini-mic clutching commentators. There wasn't a runway by Viard that they would leave unclawed.\n\nThe reality is that Viard led Chanel to significant growth, with revenue increasing by 75 per cent from 2018 to $US19.7 billion in 2023. But cowed by the commentary, Viard was replaced, her tenure at the helm, after 30 years at Chanel, now described by company president Bruno Pavlovsky as an \"intermission\".\n\nHer replacement was Matthieu Blazy. The commentators all exploded in raptures at his show this week.\n\nAt Dior the hatred for the designs of Maria Grazia Chiuri was shocking. (Reuters: Guglielmo Mangiapane)\n\nAll the key labels run by men\n\nAt Dior the hatred for the designs of Maria Grazia Chiuri, which included one the greatest wedding dresses of all time for Australian model, Miranda Kerr, was shocking. The vitriol bore no relationship to the fun, beauty and incredible craftsmanship of her pleated, embroidered and sometimes ethereal work.\n\nOne show was described by commentator @Ly.as as \"by far the worst\" he had ever seen at fashion week.\n\nUnder Chiuri, Dior's annual revenues increased substantially, with figures suggesting they grew from $3.5 billion to around $16 billion during her nearly nine years as creative director. She was replaced by Jonathan Anderson.\n\nAnd yes, all the commentators now love Dior.\n\nWomen were buying what these women designers were selling.\n\nBut just like that, there are now no longer any women designing haute couture — none. All the key labels are led by men. Of the other major fashion labels that show at Paris fashion week, most of them are led by male creatives; the ones that are led by women are almost exclusively eponymous labels such as Stella McCartney, Victoria Beckham or Miuccia Prada at Prada.\n\nSarah Burton, who many hoped might land Dior after her brilliant turn at Alexander McQueen following the designer's tragic death, is an exception. (Reuters: Neil Hall)\n\nThe exceptions to the rule\n\nSarah Burton, who many hoped might land at Dior after her brilliant turn at Alexander McQueen following the designer's tragic death, is an exception at Givenchy, as is Louise Trotter at Bottega Veneta. Who knows for how long. Keep an eye on the TikTokkers to track their fate.\n\nWhat came before the key changes at the top can't be ignored, because while the devil still might wear Prada, nobody pays much attention to what the magazines say anymore: all the true influence is online on social media, on incredibly popular accounts mostly run by young, male fashion-adjacent commentators with varying degrees of fashion education and experience.\n\nAnd yet to read their commentary, you'd think they'd trained at the hand of Cristobal Balenciaga himself. (One of them, @hautelemode, actually managed to kid himself that a second hand jacket he'd picked up was a Balenciaga original \"related to the Austro-Hungarian Empire\" because of the coat of arms printed on its buttons. I think any seamstress could have told him they were just the standard metal-shank crest buttons that are used on any old jacket. His turned out to be any old jacket.)\n\nThere's also a particularly bitchy energy to the commentary and worldview that as a female fashion lover I feel I have had to be very aware of lest I fulfil the stereotype male commentators and designers seem to want women to be.\n\nThese were the commentators whose relentless criticism led fashion doyenne Mimma Viglezio, a former executive at Vuitton and Bulgari, to call out the misogyny of \"male influencers who tear down successful female designers … it's disrespect dressed up as critique\". Her account is worth a follow.\n\nSign up for Weekend Reads in your inbox Photo shows Virginia Trioli in a stylish suit on a set with lighting behind her Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\nFor context, do not kid yourself that this is an obscure issue: the \"cerulean blue\" theory certainly applies. These are billion-dollar companies we are talking about, both public and private, the influence of which filters down into a retail industry worth $28 billion in Australia alone. You, or someone you care for, is going to drop an annual average of $2,500 on clothing that derives from this one week.\n\nSo, if there's a misogyny problem at the top of that, you best know about it. You might end up wearing it.\n\nThis weekend, if you've read this far, congratulations. You're defying the trend and are clearly very smart. Here's how to keep on the right reading track.\n\nHave a safe and happy weekend and celebrate with the springtime hits that keep coming with British Canadian club singer Rochelle Jordan and her luxurious grooves. Go well.\n\nVirginia Trioli is presenter of Creative Types and a former co-host of ABC News Breakfast and Mornings on ABC Radio Melbourne.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/aflw-round-nine-players-gear-up-to-celebrate-pride-league-clarifies-holding-the-ball-rule-20251009-p5n1a5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFLW round nine: Bombers narrowly escape historic low; players gear up to celebrate pride",
        "publish_date": "Sat, 11 Oct 2025 12:48:02 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly"
        ],
        "text": "The Western Bulldogs thrashed Essendon by 57 points on Friday night to condemn the battling Bombers to their sixth straight defeat.\n\nBulldogs coach Tam Hyett made a statement at the selection table, dropping skipper De Berry, and her charges responded by keeping their faint finals hopes alive.\n\nThe Bulldogs kicked four goals in the space of seven minutes in the second term to seize control before kicking away to win their Pride Round clash 10.7 (67) to 1.4 (10).\n\nOnly a goal to Daria Bannister with six seconds left on the clock stopped the Bombers from registering their lowest-ever score and from being held goalless for the first time.\n\nNatalie Wood’s Bombers had few winners at Whitten Oval on Friday night as the Bulldogs outworked and killed them for speed around the ground.\n\nLed by dominant ruck Alice Edmonds (32 hitouts, 11 disposals and a goal), midfielders Ellie Blackburn (21 disposals, five clearances) and Isabelle Pritchard (20 disposals, six clearances, one goal) did the damage.\n\nSarah Hartwig (three goals) was excellent while young key forward Emma McDonald kicked two goals.\n\n“We focused on the little things this week and it just pulled through,” Hartwig told the Seven Network.\n\n“Which is just so relieving and so exciting.”\n\nBulldogs defender and former Carlton player Mua Laloifi finally made her club debut and played her first game in 706 days after an ACL tear.\n\nThe Bombers lacked structure in front of the football and their kicking let them down.\n\nBomber stalwarts Georgia Nanscawen (25 disposals), Maddi Gay (21 disposals) and Maddy Prespakis (19 disposals) battled hard.\n\nPrespakis was bleeding from her eyebrow after copping a stray elbow from Pritchard in the fourth term.\n\nThe Bulldogs led by the game’s only goal at quarter-time, then Hartwig snagged two goals in the rapid-fire burst that helped the Bulldogs claim a 29-point half-time lead.\n\nThe Bulldogs nudged their lead out to 51 at the final change and Essendon head of development Ben Brown told Seven the Bombers’ “workrate was off” in the third term.\n\nEssendon responded in the final quarter and salvaged some pride when Prespakis took a courageous mark then teed up Steph Alexander who handballed to Bannister to kick the goal in the dying seconds.\n\nHyett’s charges (12 points) move to 10th on the ladder, eight points outside the top eight like Essendon.\n\nEssendon host a resurgent Brisbane at Windy Hill next Sunday, when the Bulldogs face Gold Coast at Mackay’s Great Barrier Reef Arena.\n\nAAP",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/international-friendly-live-socceroos-take-on-2026-world-cup-co-hosts-canada-20251010-p5n1lt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "International friendly LIVE: Irankunda, Izzo star as Socceroos knock off World Cup co-hosts",
        "publish_date": "Sat, 11 Oct 2025 12:46:41 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "And after some utter madness in the final minutes - a frantic scramble in Canada’s attacking box, which saw the ball bounce off the woodwork, amid more strong goalkeeping from the unbeatable Paul Izzo - the whistle goes.\n\nAustralia wins 1-0, and Tony Popovic remains unbeaten as coach after 11 games. That’s their seventh win in a row, too. Amazing stuff.\n\nThat’s a really strong, gritty and overall impressive victory by the Socceroos. They were nowhere near it in the first half but recovered really well after half-time. Nestory Irankunda’s goal proved the difference, but Paul Izzo’s saves were just as crucial.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/meet-the-12-year-old-who-has-beat-cancer-twice-20251011-p5n1ql.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meet the 12 year old who has beat cancer twice",
        "publish_date": "Sat, 11 Oct 2025 10:11:13 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Meet the 12 year old who has beat cancer twice\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/motorsport/super-utes-driver-walks-away-after-massive-crash-20251011-p5n1qi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Super Utes driver walks away after 'massive' crash",
        "publish_date": "Sat, 11 Oct 2025 09:45:16 +1100",
        "category": "finance",
        "authors": [],
        "text": "Super Utes driver walks away after 'massive' crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/interview-with-magic-the-gathering-s-gavin-verhey-20251011-p5n1qh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Interview with Magic the Gathering’s Gavin Verhey",
        "publish_date": "Sat, 11 Oct 2025 09:43:22 +1100",
        "category": "finance",
        "authors": [],
        "text": "Interview with Magic the Gathering’s Gavin Verhey\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/harry-and-meghan-make-rare-joint-appearance-at-new-york-gala-20251011-p5n1qf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Harry and Meghan make rare joint appearance at New York gala",
        "publish_date": "Sat, 11 Oct 2025 09:35:17 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Harry and Meghan make rare joint appearance at New York gala\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/king-charles-hopes-his-nature-film-will-inspire-viewers-20251011-p5n1qg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "King Charles hopes his nature film will 'inspire' viewers",
        "publish_date": "Sat, 11 Oct 2025 09:35:17 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "King Charles hopes his nature film will 'inspire' viewers\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/league-and-union-aren-t-the-most-vulnerable-when-it-comes-to-r360-it-s-the-athletes-20251009-p5n1cg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "League and union aren’t the most vulnerable when it comes to R360. It’s the athletes",
        "publish_date": "Sat, 11 Oct 2025 09:33:00 +1100",
        "category": "sports",
        "authors": [
            "Darren Kane"
        ],
        "text": "Let’s revert to this mooted R360 competition. Sooner, and not later, scores of rugby union and rugby league players in Australia and elsewhere will have serious career decisions to make, and their own Rubicons to cross. The gravitational pull of being paid in US dollars is attractive, even if the 45th /47th President of the United States is off the leash with such magnificence that he can shift the value of the greenback with an utterance. The idea that players might relocate their tax residency status to Dubai or somewhere else within the United Arab Emirates, to end up paying minimal or no tax, is another lever that’ll be pulled. Payne Haas is on R360’s radar. Credit: Getty Images And consider both those factors in the context of players being offered salaries that NRL clubs, Super Rugby franchises, and national unions can’t hope to match. If Payne Haas wants $US5 million tax-free a season, then I kid you not, the R360 people will likely agree. In rugby league, Haas would be lucky to ever sign a contract for a third of that. In Australian dollars. And then he has to pay the Australian taxman a bit less than half of that.\n\nSo if you’re a middling Super Rugby player, or a professional NRL player devoid of much prospect of joining the ranks of the game’s elite within the next decade, what is actually restraining you, besides fear of the unknown? Sure, R360 could be a concept worth the value of a plastic toy at the bottom of a Corn Flakes box. But domiciling an NRL franchise smack bang in the middle of the capital city of a third-world country isn’t without risk either. If I were acting for a player, free from existing contractual obligations forbidding negotiations and legally able to accept an offer to play in the R360 competition, I’d demand a couple of showstoppers. First, a three-year contract, and not a day less.\n\nSecond, that the whole of the contracted salary amount, in US dollars, be put into a controlled monies account that can be operated only with the authority of the player, his agent and his employing franchise. Because that’s the only way to ensure the whole of the agreed monies will definitely be there each payday in 2028. Loading Signing a long-term agreement with untried organisers promising untold fortunes could end up like winning a sweepstakes that promises a million bucks a year for the rest of your life, but the company files for bankruptcy 55 years before your projected life expectancy ends (as happened in the US this year, when Publishers Clearing House went bust. Google it). Third, I’d demand a cast-iron tax indemnity, which operates so R360 must indemnify the player in all circumstances and for all taxation amounts payable, if it ever comes to pass that any part of the player’s salary is subject to taxation in their usual place of residence, or elsewhere. Because tax laws can change. Fourth, I’d insist that R360 takes out an insurance policy in my client’s name, that guarantees payment of all my client’s remuneration in the event the competition’s fortunes and financial backers vanish.\n\nI’ve acted for several professional coaches and players who’ve taken the bait and shifted their whole lives to play or coach in the “sporting Meccas” of Saudi Arabia and the UAE. Almost inevitably, they get stiffed financially sooner or later, forcing them to fight their employing clubs through FIFA’s judicial systems. Loading I won all those cases and got them their money. But that’s only because FIFA’s rules permit transfer bans and other footballing sanctions to be imposed on the non-paying clubs if they stonewall. R360 isn’t sanctioned by World Rugby; players and their agents won’t really know who they’re dealing with. Indeed, national unions, including Rugby Australia, have announced that R360 players will be banned from international and Olympic representation, which evinces the idea of the “world game” cutting ties. Note for completeness, however, that the Australian Rugby League tried the same tactic with Super League defectors 30 years ago. The tactic failed, legally. None of this is hypothetical scaremongering.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/princess-anne-announces-australian-tour-details-20251011-p5n1qe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Princess Anne announces Australian tour details",
        "publish_date": "Sat, 11 Oct 2025 09:30:27 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Princess Anne announces Australian tour details\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/peter-merretts-recipes-for-life-to-find-more-wonder-20251011-p5n1qd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Peter Merrett's 'recipes for life' to find more wonder",
        "publish_date": "Sat, 11 Oct 2025 09:21:10 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Peter Merrett's 'recipes for life' to find more wonder\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/potato-mop-top-virus-management/hsbsfzew1",
        "title": "Australia's potato capital is facing a threat never-before-seen in the country",
        "publish_date": "Fri, 10 Oct 2025 19:34:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Stuart Applebee has been growing potatoes in north-west Tasmania for decades.\n\n\n\n\n\nPotato mop top virus (PMTV) isn't the first disease he's dealt with but hearing it has made its way into his state was a blow.\n\n\n\n\n\n\"Like any new virus, it's quite concerning when you know you're probably the first state to be detected in the country with it,\" he told SBS News.\n\n\n\n\n\n\"Once we found out a little bit more out of New Zealand and a couple of other countries that are dealing with it, that probably relaxed my own thoughts a little bit.\"\n\n\n\n\n\nPotato mop top virus isn't a threat to human health but it can affect the skin and flesh of potatoes and impact crop yields.\n\n\n\nPotato mop top virus affects the skin and flesh of potatoes and impacts crop yields. Source: Supplied / Tasmanian Government It was first detected on a farm in north-west Tasmania in July, also marking the first time it's been found in Australia.\n\n\n\n\n\nTesting in Tasmania ahead of planting saw 1,700 tonnes of infected seed potatoes destroyed, with calls for a federal assistance package for affected farmers. Concerns also remain about how it got here.\n\n\n\n\n\n\"The most concerning thing about the mop top incursion into Tasmania is that this isn't just the first time the virus has been detected in Tasmania, but it's also the first time that it's been detected within Australia,\" TasFarmers CEO Nathan Calman said.\n\n\n\n\n\n\"Its presence here represents a failure of our national biosecurity protocols, but also our state biosecurity protocols.\"\n\n\n\n\n\nA spokesperson for the Department of Agriculture, Fisheries and Forestry told SBS the current government has committed an extra $2 billion to resourcing the country's biosecurity system since it came to power.\n\n\n\n\n\n\"Australia has a world-leading national biosecurity system, which is critical to our economy, environment and way of life,\" they said.\n\n\n\nHow did it get here?\n\nEfforts so far to trace the source indicate PMTV could have been in Tasmania for two years.\n\n\n\n\n\nAustralia's chief plant protection officer Gabrielle Vivian-Smith was questioned about the incursion by Tasmanian senator Richard Colebeck in estimates this week.\n\n\n\n\n\n\"It's not known exactly how it arrived in Australia, it potentially could have come in on a number of different pathways,\" she said.\n\n\n\nStuart with his dog Ziggy in a field where he will plant his potatoes. Source: SBS News A Biosecurity Tasmania spokesperson said PMTV has been detected across multiple sites, including growing sites, a research site and storage facilities.\n\n\n\n\n\nThe only detection of PMTV on the mainland to date is in seed potatoes in cold storage in Victoria.\n\n\n\n\n\nThat state, as well as NSW and South Australia, have placed restrictions on the movement of unprocessed potatoes and production equipment from the Apple Isle.\n\n\n\n\n\nThe National Management Group — the decision-making body for national exotic plant pest, animal disease and environment eradication programs — last month decided PMTV was not eradicable in Tasmania.\n\n\n\n\n\nZarmeen Hassan is the biosecurity manager for the peak representative body for the potato industry, AUSVEG.\n\n\n\n\n\nShe said if it's been in Tasmania for two years, there is a concern it's already spread to the mainland.\n\n\n\nREAD MORE Meet the Australian farmers Donald Trump has a beef with\n\n\"So far we know that it's only in Tasmania, right? We don't actually know whether it has spread to the mainland,\" she said.\n\n\n\n\n\n\"If it has not spread to the mainland, then obviously the industry and government want to work towards containing it.\"\n\n\n\nLearning from New Zealand\n\nAcross the Tasman, they've been dealing with PMTV for seven years, after it was found at a processing plant on the South Island in September 2018.\n\n\n\n\n\nNew Zealand also determined it could not be eradicated but management is going well — so far.\n\n\n\n\n\n\"We're not seeing lost yields, we're not seeing anything, but they do call it the sleeping disease,\" Potatoes New Zealand CEO Kate Trufitt said.\n\n\n\n\n\n\"So something for us to be aware of is that something could happen in the future.\"\n\n\n\n\n\nNew Zealand is looking into varieties of potatoes resistant to mop top.\n\n\n\n\n\nTrufitt said washing down of machinery when moving between farms, crop rotation and improving soil health were crucial in preventing the disease.\n\n\n\nThe vector: powdery scab\n\nA known vector of PMTV is another disease found in potatoes, powdery scab.\n\n\n\n\n\n\"That spreads the virus, and it allows it to take hold within crops,\" TasFarmers CEO Nathan Calman told SBS News.\n\n\n\n\n\nThe Tasmanian government is investing $200,000 into a research program looking into powdery scab and PMTV.\n\n\n\n\n\n\"We've looked to our friends across the ditch in New Zealand who've told us that the key to mop-top management is addressing Powdery Scab,\" Tasmania's primary industries minister, Gavin Pearce, said.\n\n\n\n\n\nHassan said powdery scab was prevalent in the majority of the growing regions.\n\n\n\n\n\n\"If that's the case, then [PMTV] may be further than Tasmania, we don't know that, it's a bit of an unknown right now.\"\n\n\n\n\"Developing a soil test to detect powdery scab and mop top is crucial, and work is underway.\n\n\n\n\n\n\"At this point, there isn't a soil testing protocol and methodology in place in Australia; it is being worked on.\n\n\n\n\n\n\"But planting season is starting now, so it won't be available for this planting season; it will be available for the next season.\"\n\n\n\n\n\nPlanting the next crop of potatoes is underway in Tasmania, but ongoing rain means for some, including Applebee, the ground is still too wet.\n\n\n\n\n\nDespite this and other challenges, he can't imagine doing anything different.\n\n\n\n\n\n\"There is no better feeling than growing a crop of whatever — it can be carrots, potatoes, peas — and knowing full well that it's of the highest quality,\" he said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australians-living-in-america-anxiety/p88o60wos",
        "title": "Saving money and packing 'go bags': How Australians in the US are preparing for the worst",
        "publish_date": "Fri, 10 Oct 2025 19:34:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Kate (not her real name) describes life as an Australian living in the United States as \"dire\" right now.\n\n\n\n\n\nA musical theatre performer and manager of fitness studios, she has been living in the US for nearly seven years and after marrying her husband this year, she acquired a green card, which grants her permanent residency and the right to work.\n\n\n\n\n\nKate says New York is \"home\" to her now. The couple owns an apartment in Brooklyn, they have two dogs and a wide network of close friends from musical theatre and the gym.\n\n\n\n\n\nBut she says the attitude towards foreign nationals under the current administration has made life in the US feel \"scary\". Kate says these fears were brought to the surface during her green card interview.\n\n\n\n\n\n\"They grilled me in the interview and asked me questions not even related to our marriage but about my previous visa and time in the US,\" she says.\n\n\n\nAdvice on the Australian government's Smartraveller website advises that a valid visa does not guarantee entry to the US. Source: Getty / Alexander Spatari \"I was terrified I wouldn't be approved and every time I travel in and out of the country, there is fear of being deported. \"\n\n\n\n\n\nKate says her husband has taken to waiting nervously outside customs whenever she flies back into the US, as he is \"unsure if I'll get through or not\".\n\n\n\n\n\nSome foreign nationals in Kate's social circle have already left the US due to political concerns but she also acknowledges the ability to leave is a privilege.\n\n\n\nMost of my friends are local and worry for their futures, their kids' futures.\n\nWhile she says it might sound \"extreme\", Kate and her friends have all made contingency plans in case of any sudden changes to the political climate or their safety.\n\n\n\nLast month, US President Donald Trump's administration added a US$100,000 ($151,000) fee to the high-skilled worker visa known as the H-1B. Source: Getty / Alex Wong \"My friends and I talk about 'to go' bags. We have a safe spot at one of our gyms that we will meet at if cellular service goes down; we have cars ready to go,\" she says.\n\n\n\n\n\n\"The unexpected could happen at any time and with this government making irrational decisions at the drop of a hat, it wouldn't surprise me if we need to move quick and get out of the country.\"\n\n\n\n'Changes within days'\n\nMany Australians living in the US are reporting experiencing high levels of anxiety and feelings of instability due to the possibility of rapid political change under US President Donald Trump.\n\n\n\n\n\nLike Kate, others interviewed by SBS News declined to be identified due to concerns that they could be deported for speaking negatively about the US to foreign media.\n\n\n\n\n\nAround 99,000 Australians live in the US, according to the most recent data from the United States Census Bureau.\n\n\n\n\n\nJosh Pugh, who runs the America Josh community for expats in the US, tells SBS News that while the first Trump administration held the same beliefs about limiting immigration, a sense of unease has grown in his community during Trump's second term about what the government is capable of doing — and how quickly.\n\n\n\n\"It feels like they've become more effective at executing what they want to do and that has meant more sweeping changes without checks and balances,\" he says.\n\n\n\n\n\n\"Changes aren't scheduled months in advance; they're scheduled to enact within days and hours.\"\n\n\n\n\n\nLast month, the Trump administration added a US$100,000 ($151,000) fee to the high-skilled worker visa known as the H-1B .\n\n\n\n\n\nThe administration later clarified that it is intended as a one-time fee that will not apply to current visa-holders.\n\n\n\n\n\nThe decision dealt a heavy blow to the tech sector, which relies on skilled workers from China and India but Trump said the change should incentivise American companies to hire US workers.\n\n\n\n\n\nWhile most Australians who apply to work in the US typically apply for an E-3 visa, which was introduced as part of a free trade agreement between the two countries in 2005, Pugh says the changes to the H-1B have heightened concerns about the E-3.\n\n\n\nREAD MORE Trump authorises deployment of 300 national guard troops to Chicago\n\n\"The question I get asked the most is 'Do you think there will be changes to visas, like the E-3?', which is not something I have been asked in my almost nine years,\" Pugh says.\n\n\n\n\n\nLike Kate's friends, Pugh says he's seeing more people making contingency plans, asking one another what it would take to leave the US and how they would plan on doing it.\n\n\n\n\n\n\"In most issues, the community is resilient to change and will work through issues as they come, but we're seeing preparedness increasing and more plans being made for what to do if there are more changes to visa statuses or actions that personally impact them,\" he says.\n\n\n\nVisas no longer a guarantee for entry\n\nSydney-based Stacey Tsui, a partner of immigration at Vialto Partners, which helps skilled workers with international relocation, tells SBS News changes to the E-3 may not be likely but Australians should \"expect the unexpected\".\n\n\n\n\n\n\"If Australia can keep good diplomatic relations with the US — you know, because we're generally a good ally and it's a small visa program, hopefully it just flies under the radar,\" Tsui says.\n\n\n\n\n\nHowever, recent changes mean Australians on E3 visas may also have to return to Australia every two years to renew their visas, according to a recent directive made by the US state department.\n\n\n\n\n\nFor those on H-1B visas, there has also been continued uncertainty around the freedom to travel outside US borders and return.\n\n\n\nWhile White House spokesperson Karoline Leavitt has said current visa holders can leave and re-enter the country as normal, this has not quelled anxieties about the fee. Earlier this month, Microsoft sent an email to staff saying H-1B visa holders should not leave the country for the foreseeable future.\n\n\n\n\n\nThe likelihood of gaining entry with any visa has also been diminished and Australians have reported being turned away at the border despite holding valid documents.\n\n\n\n\n\nAdvice on the Australian government's Smartraveller website advises that a valid visa does not guarantee entry to the US and \"US authorities have broad powers to decide if you're eligible to enter and may determine that you are inadmissible for any reason under US law\".\n\n\n\n\n\nUS resident Millie (not her real name) says the current scrutiny around visas is making her feel like a \"frog in warm water that is close to boiling\".\n\n\n\n\n\nOriginally from Australia, Millie tells SBS News she moved to New York in 2016 with a former partner.\n\n\n\n\n\nShe lives in the US on an O-1B visa, which requires \"sustained acclaim in arts\" but she's worried about potential rapid changes or expenses that could be applied to that visa that could upend her life.\n\n\n\n\"If they raised the price of my visa to $100,000 like they did the H1-B, I would not be able to pay that,\" she says.\n\n\n\n\n\n\"Also, it's ridiculous and even if I could pay it, I wouldn't.\"\n\n\n\n'Saving money in case we need to flee'\n\nOther Australians living in the US report a growing fear of persecution.\n\n\n\n\n\nKarina (not her real name) has been living in the US for four years and lives with her partner in New York.\n\n\n\n\n\nShe says that while recent changes to visas have caused a significant amount of anxiety – particularly while she was renewing her E3 in April this year – there are broader political changes that have caused her to consider leaving the country.\n\n\n\nLISTEN TO Hope and hate: how governments around the world are responding to 'illegal' immigration SBS News 17:52 English\n\nKarina's wife, whom she married last year, is trans and has had top surgery. Karina says she is \"terrified\" for her wife's safety in light of rhetoric that threatens LGBTQI+ rights in the US, as well as a number of executive orders signed by the president directing the government not to recognise transgender or nonbinary identities.\n\n\n\n\n\nThe Heritage Foundation, one of the US' most influential conservative policy groups and publisher of a set of ultra-conservative policy proposals known as Project 2025 (and its offshoot the Oversight Project) have pushed for the Federal Bureau of Investigation (FBI) to designate \"Transgender Ideology-Inspired Violent Extremism\" as a domestic threat category.\n\n\n\n\n\nThe US Supreme Court is also currently weighing up whether to take on a case that could potentially overturn the landmark ruling Obergefell v Hodges that extended marriage rights to same-sex couples.\n\n\n\n\n\nKarina says she is constantly finding herself \"glued to politics\" and that these political shifts have made her and her wife reconsider their life in the US, despite significant ties to their large friendship group and family close by in New York state.\n\n\n\n\n\n\"As a queer immigrant, it is hard to feel like the country wants you to stay,\" she says.\n\n\n\n\"We have been saving our money in case we need to change our plans and flee quickly.\"\n\n\n\n\n\nWhile she sees a lot of anxiety in her community, Karina says many of her friends are American and the decision to leave is more complicated for them.\n\n\n\n\n\n\"A lot of them are politically motivated and attend protests,\" she says.\n\n\n\nHowever, I personally do not feel safe to do so.\n\nThose who have already left\n\nClaire (not her real name), 36, says she anticipated the issues that would arise with visas and immigration and decided to leave the night of the US election in November.\n\n\n\n\n\nShe was working for a humanitarian organisation in Washington DC and had been based in the US since 2021 but decided to leave after Trump was re-elected.\n\n\n\n\"Every month since has confirmed it was the right decision,\" she says.\n\n\n\n\n\n\"My E3 [visa] was set to expire in September 2025 and so I would have had to renew or reapply. I was worried that because of my work and advocacy on humanitarian issues, it would get denied and I wouldn't be able to re-enter the US.\"\n\n\n\n\n\nClaire says she had an established life in the US, including an American partner, a cat, and a large community of friends but she felt she was given no choice but to leave.\n\n\n\n\n\n\"I didn't want access to my life to be down to the whims of a border officer every time I had to travel for work — which includes to places like Iraq and Sudan, which would not be looked at kindly,\" she says.\n\n\n\nNow living in Geneva, Claire says she is in a challenging situation with her partner, who has remained in the US and works in medicine. To join her and practice in Switzerland, he would need to attain EU qualifications.\n\n\n\n\n\nWhile she says she enjoys parts of the US, the \"lack of clarity\" about her future there as a foreign worker has made her resolute that she does not want to return in the immediate future.\n\n\n\n\n\nThe deployment of the National Guard to Washington DC in August made Claire even more confident in her decision to leave.\n\n\n\n\n\n\"The rise of hateful rhetoric, and actions from political leaders, and the suspension of basic legal norms doesn't make it a place I wanted to spend more time and energy investing in.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/pocock-banned-from-parliamentary-sports-club-after-criticising-gambling-link/vix00u50i",
        "title": "Pocock banned from parliamentary sports club after criticising gambling link",
        "publish_date": "Fri, 10 Oct 2025 08:37:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/silver-at-highest-since-1980-how-markets-are-reacting-to-gaza-peace-deal/629kn57mq",
        "title": "Silver at highest since 1980 & how markets are reacting to Gaza peace deal",
        "publish_date": "Fri, 10 Oct 2025 06:25:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australia-young-people-drinking-less/5evzgqh3h",
        "title": "How a 'deeply-embedded' part of Australian culture could change forever",
        "publish_date": "Fri, 10 Oct 2025 05:02:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "The pub might be losing its pull — at least for younger Australians .\n\n\n\n\n\nA new study has found gen Z is turning away from alcohol far more than older generations, a trend that could bring major public health gains and signal a shift in the nation's \"deeply embedded\" drinking culture.\n\n\n\n\n\nThe research from Flinders University analysed 23 years of data to track and model drinking habits across five generational groups: the silent generation, baby boomers, gen X, millennials, and gen Z.\n\n\n\n\n\nThe model found gen Z were 18 times more likely to abstain from drinking alcohol compared to baby boomers over the course of their lives.\n\n\n\n\n\nGen Z Australians were also found to be consuming significantly less alcohol per week than older generations.\n\n\n\nSource: SBS News Lead author Gianluca Di Censo, a research fellow at the National Centre for Education and Training on Addiction (NCETA), told SBS News the first-of-its-kind study in Australia also assessed whether the trend would have a lasting impact.\n\n\n\n\n\n\"It's a really good sign because it's showing that it's not just in a certain period of time they're drinking less, it's likely that it's going to persist across their whole lives,\" he said.\n\n\n\nREAD MORE From cheers to fears: This is what happens to your body when you have a hangover\n\nMillennials are also drinking less than the generations before them, and along with gen Z, are projected to abstain from drinking at much higher rates throughout their lives than the two oldest generations.\n\n\n\n\n\nDi Censo said things could change, and future societal or economic developments could throw the model off course — but for now, \"it does seem like this is a permanent shift\".\n\n\n\nWhat's driving young people away from drinking?\n\nWhile the study doesn't determine that, researchers suspect a number of factors are shaping this pattern.\n\n\n\n\n\nThese factors include the high cost of living, increased use of digital devices, rising consumption of health-related media, and a \"cultural shift towards denormalising alcohol consumption\".\n\n\n\n\n\n\"Gen Z feel as though they can go out and not drink and not seem like an outcast. There's also a normalisation of abstention and also a prioritisation of health and wellness,\" Di Censo said.\n\n\n\nSource: SBS News Michael Livingston is an associate professor of alcohol research at Curtin University's National Drug Research Institute.\n\n\n\n\n\nHe told SBS News there's a \"complex social pattern\" at play, including a \"fundamental shift\" in how young people interact, given how they spend so much time online, changes in parenting and more awareness of the health risks around alcohol.\n\n\n\n\n\n\"Young people are much more risk-averse now than they were 20 years ago,\" he said, pointing to research in other fields that shows declines in other risk-seeking acts among teens, such as those linked to road accidents, sexual behaviour and crime.\n\n\n\n\n\n\"Those risk-taking behaviours that used to be kind of a fundamental part of that transition into adulthood, they're not as prominent as they were.\"\n\n\n\nOther studies have found young people are more likely to have existential worries about the future, including climate anxiety and financial concerns.\n\n\n\n\n\nWhile a reduction in drinking is a public health win, Livingston said there are concerns that mental ill-health and anxiety are also on the rise in younger groups.\n\n\n\n\n\n\"One of the reasons people are drinking less is because they're worrying more, and that's obviously not a good outcome,\" he said.\n\n\n\nThe implications of a cultural shift\n\nThe study's co-author, Kirrily Thompson from NCETA, said: \"For decades, alcohol has been deeply embedded in social life, but that's changing.\"\n\n\n\n\n\n\"Younger Australians are redefining what it means to socialise and celebrate, and they're doing it with less alcohol,\" she said. \"That's something we should be paying attention to, not just as researchers, but as a society.\"\n\n\n\n\n\nAlcohol consumption is linked to a variety of health issues, including multiple forms of cancer, liver and heart disease. According to estimates from the World Health Organization, alcohol consumption contributed to around 2.6 million deaths globally in 2019.\n\n\n\nThe study's authors believe understanding the drivers of generational trends could help inform public health strategies.\n\n\n\n\n\nThey suggest policies such as minimum alcohol pricing, tighter restrictions on advertising, and targeted health campaigns could help support the downward trend.\n\n\n\nIs this happening anywhere else?\n\nChanging habits around drinking among Australians have been well documented.\n\n\n\n\n\nBack in 2001, 70 per cent of young people in Australia, aged between 14 and 17, said they had consumed alcohol in the past 12 months, according to the National Drug Strategy Household Survey. But that figure has dropped to about 30 per cent in recent years.\n\n\n\nSource: SBS News A similar trend exists across a number of high-income countries, including New Zealand, Canada, the United Kingdom and European countries like Sweden.\n\n\n\n\n\nLivingston said it's a common pattern across many countries, \"with similar historic drinking cultures\" to Australia.\n\n\n\nWill the trend last?\n\nIt's not clear whether the trend is here to stay, but researchers said they're optimistic.\n\n\n\n\n\n\"We're not very good at knowing what's going to happen in these big social changes in the future,\" Livingston said.\n\n\n\n\n\n\"I think certainly for this generation, the people in their 20s now, that cohort, will drink less through their life course than previous cohorts.\n\n\n\n\n\n\"But whether we continue to drive down teen drinking in the future is a mystery that we'll have to keep tracking.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/beginning-of-the-australian-second-tier-mens-championship-kicks-off-new-era-of-football/i09cxtrs8",
        "title": "Beginning of the Australian second-tier men's championship kicks off new era of football",
        "publish_date": "Fri, 10 Oct 2025 04:16:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "Beginning of the Australian second-tier men's championship kicks off new era of football\n\nPublished 10 October 2025, 3:54 am\n\nA new chapter in Australian football kicks off tomorrow with the inaugural second tier men's championship. The opening match is between South Melbourne and Sydney Olympic. The new tournament looks to better connect the Australian football pyramid for clubs and players.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-10-october-2025/ox4745edi",
        "title": "SBS News in Easy English 10 October 2025",
        "publish_date": "Fri, 10 Oct 2025 02:27:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWelcome to SBS News in Easy English, I'm Biwa Kwan.\n\n\n\n\n\nThe first phase of a Gaza peace plan has been formally approved by Israel's cabinet.\n\n\n\n\n\nIt's a crucial step to advancing the terms of the deal.\n\n\n\n\n\nThe first phase includes a ceasefire and the exchange of the remaining 48 hostages held by Hamas for hundreds of Palestinian prisoners.\n\n\n\n\n\nIsraeli troops would also begin to withdraw from parts of Gaza; and hundreds of aid trucks a day would start entering the enclave.\n\n\n\n\n\nPrime Minister Benjamin Netanyahu described the progress made so far as a \"momentous development\".\n\n\n\n\n\n\"A momentous development in the last two years. A central one these aims is to return the hostages - all the hostages, the living and dead. And we are about to achieve that goal. We couldn't achieve it, without the extraordinary help of President Trump and the team: Steve Witkoff and Jared Kushner.\"\n\n\n\n\n\n---\n\n\n\n\n\nThe Australian activists who were detained and deported by Israel have spoken about the conditions they experienced in detention.\n\n\n\n\n\nSeven Australians were part of the Gaza-bound aid flotilla [[the Global Sumud Flotilla]] that was intercepted by Israel's military in international waters last week.\n\n\n\n\n\nArriving in Sydney, after being deported to Jordan, Juliet Lamont says the conditions they faced included: being kicked, punched, spat at; while also being denied access to clean drinking water and menstrual pads.\n\n\n\n\n\nShe says it has been concerning to experience - and see firsthand - the conditions, detainees are being subjected to.\n\n\n\n\n\n\"There are 400 Palestinian children in jail at the moment, and in the prison that we will put in, in Ketziot, we could hear them crying at night as big Alsatian dogs were taken into those prison cells. These people wear, you know, semi-automatic machine guns, and they train their lasers on every one of our heads. Imagine what they're doing to the Palestinians.\"\n\n\n\n\n\nIsrael has denied the allegations of abuse.\n\n\n\n\n\n---\n\n\n\n\n\nThe federal government has introduced legislation into federal parliament that will require employers to complete superannuation payments for their staff more frequently.\n\n\n\n\n\nCurrently, employers have to complete the superannuation payment quarterly.\n\n\n\n\n\nThe so-called Payday Super Bill will require superannuation to instead be paid every wage cycle.\n\n\n\n\n\nThe bill has been welcomed by the industry, with the Association of Superannuation Funds of Australia saying the bill is long-overdue.\n\n\n\n\n\nTreasurer Jim Chalmers says the bill will see young workers benefit from earlier super contributions.\n\n\n\n\n\n\"Workers would benefit from more frequent and earlier super contributions that will grow and compound over their working life. For the average 25-year-old workers' retirement balance, this is the equivalent of receiving extra $6000 dollars in today's dollars.\"\n\n\n\n\n\n---\n\n\n\n\n\nYanyuwa and Wardaman singer-songwriter Dr Shellie Morris has won three awards at Australian Women in Music Awards in Brisbane.\n\n\n\n\n\nShe picked up the inaugural Aboriginal and Torres Strait Islander Cultural Legacy Award, shared with cultural songwomen from the Arrkula Yinbayarra project.\n\n\n\n\n\nShe also won the Lifetime Achievement Award and the Artistic Excellence Award.\n\n\n\n\n\nPioneering Aboriginal singer-songwriter Ruby Hunter was inducted into the Honour Roll.\n\n\n\n\n\n---\n\n\n\n\n\nAustralian Richard Robson is among three scientists to win the Nobel Prize in chemistry.\n\n\n\n\n\nAlong with Omar Yaghi and Susumu Kitagawa, the scientists were recognised for their development of a new type of molecular architecture that could eventually help reduce pollution and combat climate change.\n\n\n\n\n\nThe Nobel Committee said the trio are being awarded the prize for groundbreaking discoveries that may contribute to solving some of humankind’s greatest challenges.\n\n\n\n\n\nUniversity of Melbourne professor Robson says at the age of 88, he has mixed feelings about winning the prize.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/parliamentary-sports-club-drops-senator-over-cheap-shot-gambling-lobby-complaints/ni07m8rcy",
        "title": "Pocock won't rejoin parliamentary sports club despite ban reversal",
        "publish_date": "Fri, 10 Oct 2025 01:53:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "Independent senator David Pocock won't re-join a parliamentary sports club even after a repentant organiser invited him back after a spat over a gambling lobby sponsor.\n\n\n\n\n\nThe unlikely Canberra brouhaha on the social pick-up matches spiralled in intensity on Friday, even dragging in Prime Minister Anthony Albanese.\n\n\n\n\n\nAlbanese serves as the president of the Australian Parliament Sports Club, which hosts friendly games between MPs, their staff and journalists during parliamentary sitting weeks.\n\n\n\n\n\nPocock was an enthusiastic participant until he realised the group accepted funding from Responsible Wagering Australia, a peak group for gambling companies.\n\n\n\n\n\nThe former Wallabies captain, who said he was \"shocked to learn that the club was selling access to parliamentarians\", queried a $2,500 sponsorship before being booted by club chief executive Andy Turnbull.\n\n\n\n\"Being kicked out of the club for raising concerns around gambling lobbyists buying access to the club shows the influence vested interests have here in parliament,\" the ACT senator said.\n\n\n\n\n\nThe 37-year-old has campaigned against gambling ties to sport and is critical of the federal government's failure to respond to a landmark inquiry that recommended banning online betting advertising.\n\n\n\n\n\nIndependent MP Allegra Spender called the banning of Pocock \"an absolute disgrace\" and resigned her membership, with Sophie Scamps, another crossbench MP, reportedly joining her.\n\n\n\n\n\nAsked his opinion, Albanese told Nine newspapers he was \"not wasting any time on this issue\" but \"participation should be open to everyone\".\n\n\n\nAfter the prime minister weighed in, Turnbull opened his arms to Pocock.\n\n\n\n\n\n\"If the PM says Dave Pocock should be reinstated, who am I to argue,\" he said.\n\n\n\n\n\nBut Pocock declined the invitation, which was delivered to the media, and not to him.\n\n\n\n\n\n\"Even if the club reversed their decision, I wouldn't be rejoining the Parliamentary sports club unless they undertook a transparent, open process to consider the appropriateness of all current and future sponsorships,\" he said.\n\n\n\n\n\nThe episode has shed light on one of the lesser-known ways groups can attempt to influence politicians — though Turnbull denies lobbying or wrongdoing.\n\n\n\n\n\nThe club was on as a lobby register, but Turnbull said that was to be \"on the safe side\" and, following advice from the Attorney-General's department, he would seek to remove its listing.\n\n\n\n\n\nTurnbull had told the department the organisation had \"never been paid to make representations to government on behalf of others\".\n\n\n\nREAD MORE Fears new breed of influencers could worsen a $25 billion Australian problem\n\nSponsors include alcohol, pharmaceutical and financial companies and have been listed in the club newsletter since at least 2024.\n\n\n\n\n\nPocock said he had not read the newsletter and wasn't aware when signing up.\n\n\n\n\n\nHe took issue with the offer to deregister, saying it should be listed \"if there are paying corporate members who interact with parliamentarians\".\n\n\n\n\n\nTurnbull said he had no problem accepting gambling sponsors because the club had \"taken the view that it must be agnostic with respect to its corporate members\".\n\n\n\n'You left me with no choice'\n\nTurnbull fumed at Pocock on Thursday evening in a message, saying the Senator had \"become the first person ever to politicise the most apolitical operation in the parliament\" after the ACT representative raised the issue at a parliamentary hearing.\n\n\n\n\n\n\"I have, for the last 24 hours, just scratched my head in disbelief. It is inappropriate for you to remain a member of the club in these circumstances,\" he wrote.\n\n\n\n\n\n\"You chose a cheap shot that will have no effect on the outcome of your anti-gambling campaign.\n\n\n\n\n\n\"I am sorry it has reached this point but you left me with no choice.\"\n\n\n\n\n\nRWA chief executive Kai Cantwell said the group had complied with all disclosure and transparency requirements and parliamentary sports had never been about lobbying, which was done via proper channels and not on the field.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/aflw-round-nine-players-gear-up-to-celebrate-pride-league-clarifies-holding-the-ball-rule-20251009-p5n1a5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFLW round nine: Bombers narrowly escape historic low; players gear up to celebrate pride",
        "publish_date": "Sat, 11 Oct 2025 12:48:02 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly"
        ],
        "text": "The Western Bulldogs thrashed Essendon by 57 points on Friday night to condemn the battling Bombers to their sixth straight defeat.\n\nBulldogs coach Tam Hyett made a statement at the selection table, dropping skipper De Berry, and her charges responded by keeping their faint finals hopes alive.\n\nThe Bulldogs kicked four goals in the space of seven minutes in the second term to seize control before kicking away to win their Pride Round clash 10.7 (67) to 1.4 (10).\n\nOnly a goal to Daria Bannister with six seconds left on the clock stopped the Bombers from registering their lowest-ever score and from being held goalless for the first time.\n\nNatalie Wood’s Bombers had few winners at Whitten Oval on Friday night as the Bulldogs outworked and killed them for speed around the ground.\n\nLed by dominant ruck Alice Edmonds (32 hitouts, 11 disposals and a goal), midfielders Ellie Blackburn (21 disposals, five clearances) and Isabelle Pritchard (20 disposals, six clearances, one goal) did the damage.\n\nSarah Hartwig (three goals) was excellent while young key forward Emma McDonald kicked two goals.\n\n“We focused on the little things this week and it just pulled through,” Hartwig told the Seven Network.\n\n“Which is just so relieving and so exciting.”\n\nBulldogs defender and former Carlton player Mua Laloifi finally made her club debut and played her first game in 706 days after an ACL tear.\n\nThe Bombers lacked structure in front of the football and their kicking let them down.\n\nBomber stalwarts Georgia Nanscawen (25 disposals), Maddi Gay (21 disposals) and Maddy Prespakis (19 disposals) battled hard.\n\nPrespakis was bleeding from her eyebrow after copping a stray elbow from Pritchard in the fourth term.\n\nThe Bulldogs led by the game’s only goal at quarter-time, then Hartwig snagged two goals in the rapid-fire burst that helped the Bulldogs claim a 29-point half-time lead.\n\nThe Bulldogs nudged their lead out to 51 at the final change and Essendon head of development Ben Brown told Seven the Bombers’ “workrate was off” in the third term.\n\nEssendon responded in the final quarter and salvaged some pride when Prespakis took a courageous mark then teed up Steph Alexander who handballed to Bannister to kick the goal in the dying seconds.\n\nHyett’s charges (12 points) move to 10th on the ladder, eight points outside the top eight like Essendon.\n\nEssendon host a resurgent Brisbane at Windy Hill next Sunday, when the Bulldogs face Gold Coast at Mackay’s Great Barrier Reef Arena.\n\nAAP",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/international-friendly-live-socceroos-take-on-2026-world-cup-co-hosts-canada-20251010-p5n1lt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "International friendly LIVE: Irankunda, Izzo star as Socceroos knock off World Cup co-hosts",
        "publish_date": "Sat, 11 Oct 2025 12:46:41 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "And after some utter madness in the final minutes - a frantic scramble in Canada’s attacking box, which saw the ball bounce off the woodwork, amid more strong goalkeeping from the unbeatable Paul Izzo - the whistle goes.\n\nAustralia wins 1-0, and Tony Popovic remains unbeaten as coach after 11 games. That’s their seventh win in a row, too. Amazing stuff.\n\nThat’s a really strong, gritty and overall impressive victory by the Socceroos. They were nowhere near it in the first half but recovered really well after half-time. Nestory Irankunda’s goal proved the difference, but Paul Izzo’s saves were just as crucial.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/meet-the-12-year-old-who-has-beat-cancer-twice-20251011-p5n1ql.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meet the 12 year old who has beat cancer twice",
        "publish_date": "Sat, 11 Oct 2025 10:11:13 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Meet the 12 year old who has beat cancer twice\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/motorsport/super-utes-driver-walks-away-after-massive-crash-20251011-p5n1qi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Super Utes driver walks away after 'massive' crash",
        "publish_date": "Sat, 11 Oct 2025 09:45:16 +1100",
        "category": "finance",
        "authors": [],
        "text": "Super Utes driver walks away after 'massive' crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/interview-with-magic-the-gathering-s-gavin-verhey-20251011-p5n1qh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Interview with Magic the Gathering’s Gavin Verhey",
        "publish_date": "Sat, 11 Oct 2025 09:43:22 +1100",
        "category": "finance",
        "authors": [],
        "text": "Interview with Magic the Gathering’s Gavin Verhey\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/harry-and-meghan-make-rare-joint-appearance-at-new-york-gala-20251011-p5n1qf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Harry and Meghan make rare joint appearance at New York gala",
        "publish_date": "Sat, 11 Oct 2025 09:35:17 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Harry and Meghan make rare joint appearance at New York gala\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/king-charles-hopes-his-nature-film-will-inspire-viewers-20251011-p5n1qg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "King Charles hopes his nature film will 'inspire' viewers",
        "publish_date": "Sat, 11 Oct 2025 09:35:17 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "King Charles hopes his nature film will 'inspire' viewers\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/league-and-union-aren-t-the-most-vulnerable-when-it-comes-to-r360-it-s-the-athletes-20251009-p5n1cg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "League and union aren’t the most vulnerable when it comes to R360. It’s the athletes",
        "publish_date": "Sat, 11 Oct 2025 09:33:00 +1100",
        "category": "sports",
        "authors": [
            "Darren Kane"
        ],
        "text": "Let’s revert to this mooted R360 competition. Sooner, and not later, scores of rugby union and rugby league players in Australia and elsewhere will have serious career decisions to make, and their own Rubicons to cross. The gravitational pull of being paid in US dollars is attractive, even if the 45th /47th President of the United States is off the leash with such magnificence that he can shift the value of the greenback with an utterance. The idea that players might relocate their tax residency status to Dubai or somewhere else within the United Arab Emirates, to end up paying minimal or no tax, is another lever that’ll be pulled. Payne Haas is on R360’s radar. Credit: Getty Images And consider both those factors in the context of players being offered salaries that NRL clubs, Super Rugby franchises, and national unions can’t hope to match. If Payne Haas wants $US5 million tax-free a season, then I kid you not, the R360 people will likely agree. In rugby league, Haas would be lucky to ever sign a contract for a third of that. In Australian dollars. And then he has to pay the Australian taxman a bit less than half of that.\n\nSo if you’re a middling Super Rugby player, or a professional NRL player devoid of much prospect of joining the ranks of the game’s elite within the next decade, what is actually restraining you, besides fear of the unknown? Sure, R360 could be a concept worth the value of a plastic toy at the bottom of a Corn Flakes box. But domiciling an NRL franchise smack bang in the middle of the capital city of a third-world country isn’t without risk either. If I were acting for a player, free from existing contractual obligations forbidding negotiations and legally able to accept an offer to play in the R360 competition, I’d demand a couple of showstoppers. First, a three-year contract, and not a day less.\n\nSecond, that the whole of the contracted salary amount, in US dollars, be put into a controlled monies account that can be operated only with the authority of the player, his agent and his employing franchise. Because that’s the only way to ensure the whole of the agreed monies will definitely be there each payday in 2028. Loading Signing a long-term agreement with untried organisers promising untold fortunes could end up like winning a sweepstakes that promises a million bucks a year for the rest of your life, but the company files for bankruptcy 55 years before your projected life expectancy ends (as happened in the US this year, when Publishers Clearing House went bust. Google it). Third, I’d demand a cast-iron tax indemnity, which operates so R360 must indemnify the player in all circumstances and for all taxation amounts payable, if it ever comes to pass that any part of the player’s salary is subject to taxation in their usual place of residence, or elsewhere. Because tax laws can change. Fourth, I’d insist that R360 takes out an insurance policy in my client’s name, that guarantees payment of all my client’s remuneration in the event the competition’s fortunes and financial backers vanish.\n\nI’ve acted for several professional coaches and players who’ve taken the bait and shifted their whole lives to play or coach in the “sporting Meccas” of Saudi Arabia and the UAE. Almost inevitably, they get stiffed financially sooner or later, forcing them to fight their employing clubs through FIFA’s judicial systems. Loading I won all those cases and got them their money. But that’s only because FIFA’s rules permit transfer bans and other footballing sanctions to be imposed on the non-paying clubs if they stonewall. R360 isn’t sanctioned by World Rugby; players and their agents won’t really know who they’re dealing with. Indeed, national unions, including Rugby Australia, have announced that R360 players will be banned from international and Olympic representation, which evinces the idea of the “world game” cutting ties. Note for completeness, however, that the Australian Rugby League tried the same tactic with Super League defectors 30 years ago. The tactic failed, legally. None of this is hypothetical scaremongering.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/princess-anne-announces-australian-tour-details-20251011-p5n1qe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Princess Anne announces Australian tour details",
        "publish_date": "Sat, 11 Oct 2025 09:30:27 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Princess Anne announces Australian tour details\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/peter-merretts-recipes-for-life-to-find-more-wonder-20251011-p5n1qd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Peter Merrett's 'recipes for life' to find more wonder",
        "publish_date": "Sat, 11 Oct 2025 09:21:10 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Peter Merrett's 'recipes for life' to find more wonder\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/inside-drug-fuelled-world-jailed-232735261.html",
        "title": "Cox ‘bagged drugs before he could ride a bike’",
        "publish_date": "2025-10-11T01:22:39Z",
        "category": "sports",
        "authors": [],
        "text": "A former AFL player will spend at least eight years behind bars after his life spiralled into a deadly drug addiction that eventually claimed the lives of two women in a meth-fuelled car crash.\n\nShannon John Cox, 39, played with South Fremantle in the West Australia Football League (WAFL) before he was drafted to Collingwood in the AFL in 2006.\n\nCollingwood described Cox as a defender at first who showed positive signs as a winger and lead-up half-forward. He played 25 games with the club before he lost his place in 2009.\n\nFormer Collingwood player Shannon Cox will spend at least eight years behind bars for the manslaughter of two women who were killed in a meth-fuelled car crash.\n\nCox had a troubled upbringing and began using alcohol and drugs at just 13 years of age.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“He was bagging up drugs before he was taught how to ride a bike, it was a lonely and violent environment he was in,” his lawyer Paul Holmes told the WA Supreme Court on Wednesday.\n\nMr Holmes said his client left high school in year 9 and learnt to read when he played with Collingwood, but six years after his AFL career, Cox eventually succumbed to drug addiction and spent time in prison for drug offences.\n\n“Sport took him away from addiction. When he played at a high level he wasn’t using because of drug tests and scrutiny. When that went away he went straight back to drugs,” Mr Holmes said.\n\nCox was on a community-based order for drug-related offences when he made a fatal decision to drive 414km from Geraldton to Perth with his 12-year-old daughter to collect his wife from prison on June 7, 2024.\n\nCox had consumed meth in the days before and was sleep-deprived when he fell asleep behind the wheel of his Toyota Prado. Picture: 7News\n\nHe had consumed meth in the days before and was sleep-deprived when he fell asleep behind the wheel of his Toyota Prado on the Brand Highway near Cooljarloo about 8.55am that morning.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nChristian Owens was driving a prime mover and towing a trailer north when he saw Cox cross to the wrong side of the road into his path.\n\nMr Owens moved his truck to avoid colliding with Cox, but the Prado hit the side of his trailer, spun and then crashed head on into a Suzuki Ignis that was travelling north behind the truck.\n\nTwo women aged in their 80s were inside the vehicle on their way to a CWA Choir and Drama Festival at Badgingarra, just 40km from where the collision occurred.\n\nCoral Senior and Thelma Clausen were lifelong friends. Picture: 9 News\n\nCoral Senior, 83, and Thelma Clausen, 82, had been lifelong friends for 60 years and were life members of the CWA for more than five decades when Cox struck their car in his Prado.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe two women survived the impact but suffered significant injuries and deteriorated quickly, both dying at the scene.\n\nCox was taken to hospital for mandatory drug testing that revealed he had 0.77mg of methamphetamine and amphetamine in his system and had showed signs of someone who was sleep-deprived.\n\nWhile he was out on bail facing charges over the crash, he failed a drug test and was jailed while he awaited sentencing.\n\nHis lawyer said Cox’s drug addiction was so great that he breached his bail conditions, which was in contrast to wanting to reunite his family, the reason behind the fateful trip.\n\nDefence lawyer Paul Holmes told the court that Cox had a troubled upbringing and began using alcohol and drugs at 13. Picture: NewsWire/ Emma Kirk\n\nState prosecutor Michael Cvetkoski said Cox should not have been behind wheel and his decision changed the course of many lives.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“He chose to drive when he was severely intoxicated on meth. In that state, he was a significant danger to himself, his daughter and other road users on the Brand Highway,” he said.\n\n“An expert indicated a degree of meth intoxication rendered him incapable of operating a motor vehicle.\n\n“It is unsurprising he lost control of vehicle in the way he did and caused catastrophic events.\n\n“He was meant to be in the community doing the right thing and complying with conditions placed upon him. Instead, he decided to use drugs and drive on the road, taking two lives.”\n\nLeanne Clausen and Suzanne Senior pushed for a change in the law on driving with drugs in your system after their mothers were killed. Picture: NewsWire/ Emma Kirk\n\nJustice Stephen Lemonis said during sentencing that drugs had been a prevailing factor in Cox’s life since 2016 and the fatal crash came about because of his meth addiction.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“You had a significant concentration of meth in your blood, you had taken a significant amount that rendered you incapable of being in control and had a lack of sleep,” he said.\n\n“You posed a significant danger to yourself, other road users and your own daughter that eventuated into a tragic accident.”\n\nCox pleaded guilty to two counts of unlawfully killing another under such circumstances as not to constitute murder in the WA Supreme Court on Wednesday.\n\nHe was sentenced to 10 years and six months behind bars but will be eligible for parole after serving eight years and six months over the fatal crash.\n\nHis driver’s licence was also be suspended for four years from his prison release date.",
        "source": "Yahoo"
    }
]