[
    {
        "url": "https://www.9news.com.au/national/scott-morrison-walks-back-net-zero-target-of-2050-describes-it-as-just-ideology/33dd833c-c9d3-4491-ac56-558b182b6bc8",
        "title": "'Just ideology': Morrison walks back his own net zero target of 2050",
        "publish_date": "Thu, 30 Oct 2025 01:29:55 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Former Prime Minister Scott Morrison has labelled the Coalition's net zero goal as \"just ideology\" in a stunning reversal of his own government's position.\n\nMorrison orchestrated the net zero target alongside ex-Nationals leader Barnaby Joyce, but now said he no longer backed the commitment of hitting it by 2050, seemingly giving Opposition Leader Sussan Ley the thumbs up to walk back the party pledge.\n\n\"Net Zero at any cost on any rigid timetable is not policy, it's just ideology,\" Morrison said of his once-strict target.\n\nREAD MORE: Teen cricketer dies after training tragedy\n\nFormer Australian Prime Minister Scott Morrison said he no longer backs a net zero target of 2050. (AP)\n\n\"There is a practical and growing acceptance that 2050 is likely to push right, but that does not mean an abandonment of low and zero emissions technologies.\"\n\nThe former PM said his 2021 position on a net zero target was a \"practical direction\" and not a mandate.\n\nHe argued the landscape of climate change has changed drastically in the past four years, along with his opinion on how and when net zero could be reached.\n\nMorrison said he still backed a net zero aspiration but relented on his previous view that the Coalition should legislate its way to a 2050 target.\n\n\"Post COVID, energy demand is rising with AI needs and private capital is being deployed at scale to solve the affordability, reliability and emissions challenge in a way we have not seen before,\" Morrison added.\n\n\"In 2021 we were also facing a potential capital strike on Australia from OS investors as they responded to US policy under President Biden.\n\n\"This has also changed.\"\n\nMorrison pointed to Microsoft billionaire Bill Gates' recent change of approach to climate change.\n\nIn a recent post on his personal website , Gates said that the \"doomsday view\" – that it will \"decimate civilisation\" – is wrong.\n\n\"Emissions projections have gone down, and with the right policies and investments, innovation will allow us to drive emissions down much further,\" Gates wrote.\n\nREAD MORE: Major banks drop grim new forecast for interest rates\n\nJoyce had previously described the climate policy as a \"lunatic crusade\". (Alex Ellinghausen)\n\nMorrison said Gates continues to be \"relevant\" in the conversation around climate policy.﻿\n\n\"It's common sense to ensure our policy settings are right and practical for the world as it is, not as it was or what you would like to pretend it is,\" Morrison added in his post.\n\n\"That's where you find the national interest.\"\n\nMorrison unveiled Australia's plan to reach net zero emissions almost exactly four years ago.\n\nHe said the plan would focus on \"technologies not taxes\" and will include both Australians in cities and the regions.\n\n\"We knew you could not legislate or tax the world to lower emissions,\" Morrison added in his post.\n\n\"Private capital not politics was always going to be the answer. This remains the sensible approach.\"\n\nOpposition Leader Sussan Ley vowed to review the party's climate policy following the federal election. (Alex Ellinghausen)\n\nThere has been division among Coalition ranks over the feasibility of net zero by 2050.\n\nJoyce and Nationals MP Michael McCormack have jointly backed a private member bill to repeal net zero.\n\nIn July, Joyce – who has since snubbed the Nationals over its net zero position – described the climate policy as a \"lunatic crusade\".\n\nShadow ﻿education minister Jonno Duniam warned many would leave the frontbench if Ley supports the target,\n\nLey said she would review the party's climate policy after its historic defeat at the May federal election.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/technology/melbourne-cup-2025-weather-forecast-derby-day-flemington-track-conditions/a9f42f35-36b7-4620-97c2-bfbaef477f10",
        "title": "Deluge threatens to dampen racetrack on Melbourne Cup",
        "publish_date": "Thu, 30 Oct 2025 01:05:01 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Victorian racetracks over the Melbourne Cup long weekend may get a little soggy as rainclouds threaten to dampen celebrations over the public holiday.\n\nSpring weather is usually a little unpredictable﻿ in Victoria – and this year will be no different.\n\nGloomy conditions and possible showers are expected from tomorrow until Melbourne Cup day on Tuesday, with a brief hot spell on Sunday between Derby Day and the race that stops the nation.\n\nREAD MORE: Teen cricketer dies after training tragedy\n\nSpring weather is usually a little unpredictable﻿ in Victoria – and this year will be no different. (Bureau of Meteorology)\n\nHere's what the weather is forecast to look like over the long weekend in Victoria.\n\nSaturday – Derby Day\n\nThe sun might be fighting to make an appearance﻿ at Flemington during Derby Day this Saturday.\n\nIt is forecasted to be cloudy and quite cool in the morning, with temperatures only expected to reach a top of 21-degrees at around 4pm.\n\nBlue skies might peek through the clouds into the early afternoon.\n\n﻿But luckily for punters, there's no chance of a shower for Saturday.\n\nREAD MORE: Major banks drop grim new forecast for interest rates\n\nMelbourne Cup 2024 at Flemington Racecourse. (Justin McManus)\n\nSunday﻿\n\nIt is forecast to be a drastically different day on Sunday.\n\nTemperatures are expected to soar to 30 degrees in the afternoon in Melbourne following some afternoon﻿ showers.\n\nOnly 5mm is expected to fall on Sunday, and the Bureau of Meteorology forecasts the downpour will be mostly during the late afternoon and evening.\n\nTemperatures are likely to stay warm after the sun sets, still remaining at around 24 degrees by 8pm.﻿\n\nMonday﻿\n\nVictorians﻿ taking an extra day off to squeeze the most out of the long weekend might be disappointed as temperatures are predicted to plummet on Monday.\n\nThe BoM predicts it will reach a chilly top of 16 degrees across Melbourne.\n\nThere's also a possibility of between 4 and 25mm of rainfall too.\n\nREAD MORE: Mum claims she used recalled sunscreen for two years before skin cancer\n\nThe national rain forecast for Tuesday, November 4, 2025. (Weatherzone)\n\nTuesday - ﻿Melbourne Cup Day\n\nConditions aren't expected to be ideal at Flemington for Cup Day on Tuesday, November 4.\n\nIt will be a mostly overcast day and ﻿a deluge threatens to drench racegoers at the track with a 25 per cent chance of up to 20mm falling during cup celebrations.\n\nIt doesn't look like there will be much relief from the rain over the course of the day.\n\nThe BoM forecasts the light showers will stick around for when the race kicks off at 3pm.\n\n﻿Cloudy conditions with west to south-westerly winds up to 25km/h could also whip up some dreary weather throughout the morning.\n\nTemperatures are expected to only nudge 18 degrees.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/australian-man-admits-selling-pentagon-secrets-to-russia/b4632957-b6a5-45ce-93ed-5aab92d56854",
        "title": "Australian man admits selling hacking secrets to Russia in US court",
        "publish_date": "Wed, 29 Oct 2025 23:31:48 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "An Australian man has pleaded guilty in connection with a scheme to steal powerful hacking tools from an American defence contractor and sell them to a buyer in Russia, the US Justice Department said.\n\nThe tools were \"meant to be sold exclusively to the US government and select allies,\" but 39-year-old Peter Williams sold them to a Russian software exploit broker that touted its ties to Moscow and other foreign governments, the Justice Department alleged.\n\nProsecutors say the theft caused $US35 million ($53 million) in losses for the company, which is not identified in court documents.\n\nREAD MORE: Teen cricketer dies after training tragedy\n\nUS defence contractor L3Harris Technologies. (Phelan M. Ebenhack/AP via CNN)\n\nBut British business records list Williams as the former general manager of Trenchant, an intelligence firm owned by US defence contractor L3Harris Technologies.\n\nL3Harris' website describes Trenchant as a \"trusted, discreet partner furnishing security products, consultancy, training and integration services to allied governments, defence, security and law enforcement agencies\".\n\nA lawyer for Williams declined to comment today, as did a spokesperson for L3Harris.\n\nThe case shines a light on the private market for software exploits that bypass tech firms' security controls and can fetch millions of dollars from government and non-government buyers alike.\n\nUS Attorney Jeanine Pirro called online brokers that sell hacking tools \"the next wave of international arms dealers\".\n\nIn Williams' case, the theft and sale of the tools \"allowed non-allied foreign cyber actors to obtain sophisticated cyber exploits that were likely used against numerous unsuspecting victims,\" Pirro said in a statement.\n\nThe Justice Department did not identify any alleged victims.\n\nREAD MORE: Major banks drop grim new forecast for interest rates\n\nUS Attorney for the District of Columbia Jeanine Pirro. (AP)\n\nWilliams allegedly used the proceeds from the sale of software exploits to buy luxury watches and other items, according to prosecutors. He was promised \"millions of dollars\" in cryptocurrency payments, the Justice Department said.\n\nUS national security officials have long been concerned that hacking techniques that American or Western intelligence officers hone in government work will be commercialised and used against Americans.\n\nThe Justice Department in 2021 charged three former US intelligence or military operatives who allegedly helped build a hacking program for the United Arab Emirates government.\n\n\"America's national security is NOT FOR SALE, especially in an evolving threat landscape where cybercrime poses a serious danger to our citizens,\" Attorney-General Pamela Bondi said in a statement today.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sixfigure-warning-as-silver-tsunami-of-28-million-australians-race-towards-retirement/eba09da8-0629-4394-add9-47445d8843a9",
        "title": "Six-figure warning as 'silver tsunami' of 2.8 million Aussies head for retirement",
        "publish_date": "Wed, 29 Oct 2025 20:59:06 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "A typical new retiree could lose out on as much as $136,000 over the course of their retirement due to the bewildering complexity of Australia's superannuation system, according to a new report.\n\nThe staggering figure—equivalent to $6,500 a year—was highlighted in modelling released today by the Super Members Council, which found the system's \"daunting complexity\" is stopping everyday Australians from achieving their full financial potential in their post-work years.\n\nAustralia is on the cusp of a \"silver tsunami,\" with 2.8 million Australians racing towards retirement in the coming decade. This influx will effectively double the number of Australians retiring each year, jumping from 150,000 to 300,000.\n\nReform is needed to fix Australia's overly complex superannuation system, a new report has found. (iStock)\n\nThe amount of money in super held by these retirees will almost double, too, soaring from around $750 billion over the past decade to almost $1.5 trillion over the next.\n\nIn its report, the Super Members points to the current complexity and rigidity of the system as a significant barrier to a simple, seamless transition into retirement for many.\n\nOne critical finding reveals that about 700,000 Australians over 65 who aren't working full-time still have their super sitting in taxed savings-phase super accounts, which drastically lowers their disposable income in retirement.\n\nThe report calls for a series of urgent, short-term reforms to prepare the super system, including the need to:\n\nExpand access to simple, affordable financial advice and digital tools.\n\nEnable safe and effective data sharing with Government to allow funds to optimise incomes and offer retirement income dashboards.\n\nSupport Smart Retirement Pathways and suggest the best retirement income solution for members.\n\nFix issues that lead to dual super accounts for retirees.\n\nFor the longer term, the council proposes bolder directions, such as simplifying a transition to tax-free income—including considering automatically removing tax from accounts at age 65 for eligible members—and rethinking minimum drawdown requirements for poorer retirees. It also recommends strengthening consumer protection by applying a quality filter on all retirement products.\n\nDispelling a \"persistent myth\" that most retirees underspend their super, the report actually shows that drawdowns are typically higher than the minimums required. In 2024–25, approximately 64 per cent of tax-free retirement account holders (two in every three retirees) withdrew above the minimum. This proportion was even higher for those with less than $50,000 in super, at 77 per cent.\n\n\"We need to make the shift into retirement so much simpler, easier and more intuitive for everyday Australians,\" Super Members Council CEO Misha Schubert said.\n\n\"This challenge is now incredibly urgent as almost 3 million Australians start to race towards retirement in the coming years.\"\n\n\"Moving to a system of simpler, smarter pathways into retirement would mean every Australian could retire with confidence, knowing they're not missing out on money to pay the bills and enjoy life to the fullest.\"\n\nThe report's findings echo a report by the Grattan Institute, released in January, which found the complexity in Australia's superannuation system was leaving retirees stressed and lacking the confidence to spend their super savings.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/afr-reveals-australia-young-rich-list-for-2025/cb9fa810-70fb-4de4-ac07-38f86a7dd4c3",
        "title": "Australia's richest people under 40 revealed in new list",
        "publish_date": "Wed, 29 Oct 2025 23:05:09 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Canva co-founders Melanie Perkins and Cliff Obrecht remain at the top of the Australian Financial Review's Young Rich List for the sixth year running, and it doesn't look like their crown is going to be threatened any time soon.\n\nThe AFR's 2025 list, which ranks the wealthiest Australians under the age of 40, put the couple's estimated net worth at $18.5 billion.\n\nSecond on the list was Ed Craven, co-founder of online cryptocurrency casino site stake.com with an estimated $4.6 bill﻿ion.\n\nCliff Obrecht and Melanie Perkins top the AFR Young Rich list once again. (Louie Douvis)\n\nTo put that in perspective, the AFR estimates Perkins and Obrecht grew their fortune by $4.5 billion in just the past year.﻿\n\nRobbie and James Ferguson of cryptocurrency and blockchain company Immutable are in third with a combined net worth of $1.7 billion, followed by businessman Adrian Portelli with $1.4 billion.\n\nCombined, the fortunes of the top 10 hit $31.7 billion, up 9.7 per cent from $28.9 billion in 2024.\n\nRobbie and James Ferguson, founders of Immutable. (Louie Douvis)\n\nOutside the top 10, other familiar names appear.\n\nMargot Robbie remains Australia's richest entertainer under 40, listed at 36 with an estimated fortune of $193 million.﻿\n\nBasketball star Ben Simmons (20th) is Australia's richest young sports star, worth a tidy $260 million﻿.\n\nMargot Robbie is Australia's richest entertainer under 40. (AP)\n\nRetired F1 driver Daniel Ricciardo (35th with $194 million), ﻿golfers Cameron Smith (41st with $176 million) and Jason Day (42nd with $167 billion), and F1 driver Oscar Piastri (56th with $122 million) also appear.\n\nPiastri is one of 22 debutants on this year's list, a group collectively worth about $4 billion and which also includes The Block judge Marty Fox.\n\nTo qualify for the Young Rich List in 2025, people needed a fortune of at least $44 million, up from $38 million in 2024.\n\nBen Simmons is also on the list. (Getty)\n\nThe tech sector's dominance continued, contributing more than $28 billion, or 62 per cent, of the total net worth of the list in 2025.\n\n\"It's been another record-breaking year for the wealthiest Australians aged 40 and under, whose collective fortunes have risen 1700 per cent in the 22 years since the first Young Rich List was published by BRW,\" Rich List editor Yolanda Redrup said.\n\n\"When the list launched in 2003, the total net worth of the 62 people featured was only $2.5 billion.\"\n\nThe full list will be available on the AFR website tomorrow.﻿\n\nThe Financial Review Young Rich List 2025's top 10\n\nMelanie Perkins and Cliff Obrecht, 38 and 39, $18.5 billion – Canva Ed Craven, 30, $4.6 billion - Stake.com Robbie and James Ferguson, 33 and 28, $1.7 billion - Immutable Adrian Portelli, 36, $1.4 billion - LMCT+ Jack Zhang, 40, $1.3 billion - Airwallex Nick Molnar, 35, $1.1 billion – Block Andrew Tulloch, 35, $953 million - Thinking Machine Labs, Meta Paul Stovell, 39, $637 million - Octopus Deploy Jessica Sepel and Dean Steingold, 36 and 40, $486 million - JSHealth Nik Mirkovic and Alex Tomic, 30 and 32, $470 million each - Hismile﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/ai-chipmaker-nvidia-is-the-first-5-trillion-company/5995a1b7-a67d-4112-acab-fcec256c191a",
        "title": "This one company is now worth more than Japan, India and the UK",
        "publish_date": "Wed, 29 Oct 2025 21:11:47 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Nvidia has become the first $US5 trillion ($7.6 trillion) company, just three months after the Silicon Valley chipmaker was the first to break through the $US4 trillion barrier.\n\nIt has hit the incredible benchmark off the back of an artificial intelligence craze that’s widely viewed as the biggest tectonic shift in technology since Apple unveiled the first iPhone 18 years ago.\n\nApple rode the iPhone’s success to become the first publicly traded company to be valued at $US1 trillion, $US2 trillion and eventually $US3 trillion.\n\nJensen Huang, chief executive officer of Nvidia Corp, during the keynote address at the Nvidia AI summit in Washington, DC, earlier this week. (Bloomberg)\n\nBut there are concerns of a possible AI bubble , with officials at the Bank of England earlier this month flagging the growing risk that tech stock prices pumped up by the AI boom could burst. The head of the International Monetary Fund has raised a similar alarm.\n\nThe ravenous appetite for Nvidia’s chips is the main reason that the company’s stock price has increased so rapidly since early 2023. On Wednesday (Thursday AEDT), the shares closed at $US207.04 with 24.3 billion shares outstanding, putting its market cap at $US5.03 trillion.\n\nNvidia's value is now greater than the GDP of India, Japan and the United Kingdom, according to the International Monetary Fund.\n\nNvidia carved out an early lead in tailoring its chipsets known as graphics processing units, or GPUs, from use in powering video games to helping to train powerful AI systems, such as the technology behind ChatGPT and image generators.\n\nDemand skyrocketed as more people began using AI chatbots. Tech companies scrambled for more chips to build and run them.\n\nNvidia Chief Executive Jensen Huang has downplayed concerns of a bubble bursting. He said the generative AI chatbots that were merely “interesting” when they first took hold a few years ago were now becoming so useful they would become profitable.\n\nNvidia has entered uncharted territory in terms of its value. (Bloomberg)\n\nHuang was headed to South Korea this week as leaders from major Pacific Rim economies, including the United States, China and Japan, gathered for the annual Asia-Pacific Economic Co-operation summit that has long championed free trade but is now confronting sweeping US tariffs on technology and other products.\n\nThe multilateral gathering in Gyeongju is expected to be overshadowed by a sideline event — a face-to-face meeting between Trump and Chinese leader Xi Jinping — as their intensifying trade war leaves the South Korean hosts in a difficult balancing act.\n\nThis week, Huang disclosed $US500 billion in chip orders. The company also announced a partnership with Uber on robotaxis and a $US1 billion investment in Nokia, with the two planning to work together on 6G technology.\n\nIn addition, Nvidia is teaming with the US Department of Energy to build seven new AI supercomputers.\n\nLast month, Nvidia announced it would invest $US100 billion in OpenAI as part of a partnership that will add at least 10 gigawatts of Nvidia AI data centres to ramp up the computing power for the owner of the artificial intelligence chatbot ChatGPT.\n\nIn August, Huang said Nvidia was discussing a potential new computer chip designed for China with the Trump administration. Trump said on Air Force One that he would speak to Xi about Nvidia's chips on the sidelines of the APEC event that Huang is also attending.\n\nIn August, Trump announced a deal with chipmakers Nvidia and AMD to lift export controls on sales of advanced chips to China in exchange for a 15 per cent cut of the revenue, despite concerns from national security experts that such chips would end up in the hands of Chinese military and intelligence services.\n\nThat same month, Trump announced the US government had taken a 10 per cent stake in Intel worth around $US11 billion.\n\nThen, Nvidia announced last month it was investing $US5 billion in Intel and would collaborate with the struggling semiconductor company.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/commonwealth-bank-westpac-interest-rate-cut-forecasts-high-inflation/85ab1489-c06f-4e62-839e-c88ed18b34d4",
        "title": "Struggling Aussies to be denied any more rate cuts, major bank predicts",
        "publish_date": "Wed, 29 Oct 2025 18:46:06 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Australians struggling under the weight of high mortgage repayments now won't receive any more relief from the RBA, according to one of the nation's biggest banks.\n\nThe Reserve Bank has handed down three rate cuts this year, and most economists had been predicting another one or two were still to come by midway through 2026.\n\nIndeed, just a fortnight ago, the market had been pricing in a more than 80 per cent chance of a cut next week.\n\nCBA and Westpac have both changed their interest rate forecasts after Wednesday's inflation data. (Supplied)\n\nBut yesterday's scorching inflation data, with the CPI rising by 1.3 per cent in the September quarter , while the trimmed mean – the RBA's preferred measure of underlying inflation – rose by an even 1.0 per cent.\n\nMichele Bullock said on Monday that even a 0.9 per cent result on the latter measure ﻿would be a \"material miss\", and economists have been quick to push back their forecasts in the wake of yesterday's data.\n\nWestpac, which had previously been an outlier as the only member of the big four to be banking on a rate cut next week, scrapped that prediction yesterday, saying even February may be too soon for the RBA to reduce the cash rate again.\n\n\"Even a February cut is far from certain now, given the size of the upside surprise this quarter,\" chief economist Luci Ellis said.\n\n\"We are conducting a full reassessment for the cash rate outlook in light of both the inflation outcome and the evolving picture on domestic demand.\"\n\nThe more alarming new forecast, though, came from Commonwealth Bank, which now believes the RBA is finished cutting and will leave the cash rate at 3.60 per cent for the foreseeable future.\n\n\"Given the material upside surprise to the Q3 25 CPI, and the broad‑based nature of pricing pressures, we now expect the RBA to remain on hold from here,\" senior economist Belinda Allen said.\n\nSurging electricity prices was one of the main drivers of the unexpectedly high inflation result. (AP)\n\n\"Previously, we expected one last rate cut in February 2026 to bring the cash rate back closer to neutral.\n\n\"Higher inflation and the cyclical upswing in demand now underway, driven largely by consumption and housing, will see the RBA conclude that the economy needs the cash rate to remain in slightly restrictive territory.\"\n\nThe nation's biggest lender even cautioned that the Reserve Bank may be forced to raise interest rates next year.\n\n\"The latest data has tilted the risks to the upside, and the RBA will be closely watching the monthly inflation data,\" Allen said.\n\n\"If inflation remains elevated in 2026 as we expect it could, the RBA may need to act.\"\n\nEllis, though, had a silver lining for borrowers sweating on another rate cut, saying there could be more relief than expected next year because the chance of a pre-Christmas rate cut has been ended.\n\n\"Delay now adds to the chances of more cuts next year,\" the Westpac chief economist wrote.\n\n\"Over 2026, though, we expect the RBA to be surprised by the gradual softening in the labour market, and the resulting benign wages growth… easing in conditions should fade in 2027 assuming private sector demand growth does pick up as we are currently forecasting,\" she added.\n\n\"By that point, though, inflation could be below the target midpoint, which would point to scope for less restrictive monetary policy.\"\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/oasis-australia-tickets-dates-times-everything-to-know-explained/2c04eb80-6cd6-4433-8662-5dcf0e0683be",
        "title": "Everything you need to know about the Oasis Live '25 ﻿tour",
        "publish_date": "Wed, 29 Oct 2025 10:23:49 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "UK supergroup Oasis has touched down in Melbourne ahead of the band's hotly anticipated Australian tour.\n\nThe Gallagher brothers arrived in the Victorian capital separately today, ahead of the first show on Friday﻿.\n\nOasis has five shows across Melbourne and Sydney.\n\nHere is what you need to know about the band's Australian tour.\n\nREAD MORE: Minister to investigate after year 12s taught wrong subject for final exam ﻿\n\nUK supergroup Oasis has touched down in Melbourne ahead of the band's anticipated Australian tour. (Scott A Garfitt/Invision/AP)\n\nWhen is Oasis playing in Australia?\n\nThe Australian leg of the Oasis Live '25 ﻿tour will kick off at Marvel Stadium in Melbourne on Friday, October 31.\n\nThe band will play two more shows in the Victorian capital on Saturday, November 1 and Tuesday, November 4.\n\n﻿Oasis will then fly to Sydney for two shows at Accor Stadium, on Friday, November 7 and Saturday, November 8.\n\nWhen did Oasis last tour Australia?\n\nFans will have the chance to see Oasis in Australia for the first time in 20 years.\n\nThe band last performed in Australia on its Don't Believe the Truth tour in 2005.\n\nAre Oasis tickets still available in Australia?\n\nThere are limited tickets available to the Sydney and Melbourne shows.﻿\n\nBe sure to keep an eye on the ﻿Ticketmaster Resale website.\n\nTickets sold on resale are permitted at no more than 110 per cent of the price paid for tickets.\n\nAccording to Ticketmaster, tickets listed on third-party resale sites may be cancelled.\n\nHow much are Oasis tickets?\n\nAccording to the Ticketmaster website, tickets for the Melbourne show will start from $183.28 up to $407.57.\n\nA handling fee of $9.90 per order will apply.\n\nWho is the supporting act for Oasis on their Australian tour?﻿\n\nIndie rock band Ball Park Music have been confirmed as the support act for Oasis on their Australian tour.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/bill-gates-change-climate-change-approach/60f368e2-ff87-4e91-935a-84409aefff58",
        "title": "'Won't lead to humanity's demise': Bill Gates makes major climate call",
        "publish_date": "Wed, 29 Oct 2025 04:30:29 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Bill Gates has called for governments, investors, activists and scientists to change their approach to the climate crisis ahead of next month's COP30 summit in Brazil.\n\nIn a post on his personal website, the Microsoft founder said that the \"doomsday view\" of climate change – that it will \"decimate civilisation\" – is wrong.\n\n\"Although climate change will have serious consequences – particularly for people in the poorest countries – it will not lead to humanity's demise,\" he wrote.\n\nREAD MORE: Minister to investigate after year 12s taught wrong subject for final exam ﻿\n\nBill Gates has called for a change of approach to combating climate change. (AP)\n\n\"People will be able to live and thrive in most places on Earth for the foreseeable future.\n\n\"Emissions projections have gone down, and with the right policies and investments, innovation will allow us to drive emissions down much further.\"\n\nGates said that, because of that view, there was an overwhelming focus on short-term emissions reduction targets, which is diverting resources away from measures he claimed are more cost-effective at improving people's lives.\n\nPointing to a need for greater innovation – particularly to remove the \"green premium\", or the extra cost associated with using zero-emissions products – and to better measure the impact of climate initiatives, he wrote that next month's UN climate conference was a perfect opportunity to change approach.\n\nREAD MORE: Rate cut hopes dealt massive blow as inflation surges again ﻿\n\nThe multibillionaire said more focus needed to be placed on improving lives than cutting emissions. (via CNN Newsource)\n\n\"This is a chance to refocus on the metric that should count even more than emissions and temperature change: improving lives,\" he said.\n\n\"Our chief goal should be to prevent suffering, particularly for those in the toughest conditions who live in the world's poorest countries.\n\n\"Although climate change will hurt poor people more than anyone else, for the vast majority of them it will not be the only or even the biggest threat to their lives and welfare.\n\n\"The biggest problems are poverty and disease, just as they always have been.\n\n\"Understanding this will let us focus our limited resources on interventions that will have the greatest impact for the most vulnerable people.\"\n\nGates still said climate change was a crucial issue that needs to be urgently addressed. (Leigh Henningham)\n\nGates, who was previously the world's richest man and currently has a net worth of about $US122 billion ($185 billion), has invested more than $100 billion into charitable causes, and has previously pledged to give away the majority of his fortune before he dies.\n\nMuch of his philanthropic work has focused on initiatives such as malaria prevention and climate adaptation, and he stressed in his post that rising global temperatures was still a crucial issue that needs to be urgently addressed.\n\n\"It needs to be solved, along with other problems like malaria and malnutrition,\" Gates wrote.\n\n\"Every tenth of a degree of heating that we prevent is hugely beneficial because a stable climate makes it easier to improve people's lives…\n\n\"Climate change, disease, and poverty are all major problems. We should deal with them in proportion to the suffering they cause.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-30/south-korea-permission-to-build-nuclear-submarines/105951210",
        "title": "Trump says South Korea has approval to build nuclear-powered submarine",
        "publish_date": "Thu, 30 Oct 2025 01:26:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "US President Donald Trump says he has given South Korea approval to build a nuclear-powered submarine, a dramatic move that would admit Seoul to a small club of nations possessing such vessels.\n\nMr Trump, who has been meeting with South Korean President Lee Jae Myung and other regional leaders during his visit, also said Seoul had agreed to buy vast quantities of US oil and gas.\n\nThe submarine will be built in a Philadelphia shipyard, where South Korean firms have increased investment, Mr Trump wrote on social media.\n\nMr Trump and Mr Lee finalised details of a fraught trade deal at a summit in South Korea on Wednesday.\n\nMr Lee had also been seeking US permission for South Korea to reprocess nuclear fuel.\n\nNuclear restrictions easing?\n\nSeoul is barred from reprocessing without US consent, under a pact between the countries.\n\n\"I have given them approval to build a nuclear-powered submarine, rather than the old-fashioned and far less nimble, diesel-powered submarines that they have now,\" Mr Trump wrote on his Truth Social platform.\n\nSouth Korea's Industry Ministry said its officials had not been involved in any detailed discussions about building the submarines in Philadelphia.\n\nWhile South Korea has a sophisticated shipbuilding industry, Mr Trump did not spell out where the propulsion technology would come from for a nuclear-powered submarine, which only a handful of countries possess.\n\nThe US has been working with Australia and Britain on a project for Australia to acquire nuclear-powered submarines, involving technology transfers from the United States.\n\nThe US has so far only shared that technology with Britain, back in the 1950s.\n\nMr Lee said when he met Mr Trump on Wednesday that allowing South Korea to build several nuclear-powered submarines equipped with conventional weapons would significantly reduce the burden on the US military.\n\nHe also asked for Mr Trump's support to make substantial progress on South Korea being allowed to reprocess spent nuclear fuel, or on uranium enrichment.\n\nThis is not allowed under the nuclear agreement between the two countries, even though South Korea possesses nuclear reactors to generate power.\n\nApproval raises questions\n\nAustralia is all in on AUKUS. In Trump's America, it's more complicated In Washington on Monday, Anthony Albanese made something clear once again: Australia is all-in on the trilateral defence pact. Clarifying what US powerbrokers think remains a multi-billion-dollar question.\n\nMr Lee's predecessors had wanted to build nuclear-powered submarines, but the US had opposed this idea for decades.\n\nDaryl Kimball, executive director of the Washington-based Arms Control Association, said the issue of South Korea acquiring such submarines \"raises all sorts of questions.\"\n\n\"As with the AUKUS deal, (South Korea) is probably looking for nuclear propulsion services suitable for subs, including the fuel, from the US,\" he said.\n\nMr Kimball said such submarines usually involved the use of highly-enriched uranium and would \"require a very complex new regime of safeguards\" by the International Atomic Energy Agency, which has a key role in implementing the Treaty on the Non-Proliferation of Nuclear Weapons (NPT).\n\n\"It remains technically and militarily unnecessary for South Korea to acquire the technology to extract weapons-usable plutonium from spent fuel or to acquire uranium enrichment capabilities, which can also be used to produce nuclear weapons,\" he said.\n\n\" If the United States seeks to prevent the proliferation of nuclear weapons worldwide, the Trump administration should resist such overtures from allies as strongly as it works to deny adversary access to these dual-use technologies. \"\n\nJenny Town, who heads 38 North, a Korea-focused research group in Washington, said it was inevitable that South Korean demands for US cooperation on nuclear issues would grow, given recent allegations about Russian technical cooperation to help nuclear-armed North Korea make progress towards acquiring nuclear-powered submarines.\n\nKim Dong-yup, a North Korea studies professor at Kyungnam University, said the Lee-Trump summit had formalised a \"transaction scheme of security guarantees and economic contributions\" for maintaining the extended deterrence and alliance in exchange for South Korea's increased defence spending and nuclear-powered subs and US investments.\n\n\"In the end, this South Korea-US summit can be summarised in one word: the commercialisation of the alliance and the commodification of peace,\" he said.\n\n\"The problem is that the balance of that deal was to maximise American interests rather than the autonomy of the Korean Peninsula.\"\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-30/farmers-condemn-narrabri-gas-project-aquisition-threat/105950352",
        "title": "Farmers condemn threat of compulsory land acquisition for gas project",
        "publish_date": "Thu, 30 Oct 2025 01:20:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Landholders have condemned the NSW government for considering compulsory land acquisition for the Santos Narrabri Gas Project.\n\nIn a speech to the Australian Workers' Union yesterday, Premier Chris Minns said the government would consider acquisition to ensure it could proceed with getting energy into the manufacturing base of the Hunter region.\n\nSpeaking to media today, Mr Minns continued to defend those remarks, highlighting that after more than a decade, a definitive decision on the Santos project still hung in the air.\n\n\"All of the predictions that were made when the project was originally stopped — that it would put pressure on the industrial base of the state and lead to higher prices — have all come to fruition and ultimately a decision needs to be made,\" he said.\n\n\" The NSW government is serious when we say we need to press on with this, it's too important when it comes to jobs and opportunities, particularly manufacturing in the Hunter. \"\n\nContamination concerns\n\nThe Narrabri gas field expansion is a multi-billion-dollar project proposed for north-west New South Wales, on land governed by a native title agreement with the Gomeroi people.\n\nIf approved, the project would see a new coal seam gas field developed over 95,000 hectares, with plans for 850 wells to be drilled and 1,000 hectares of land to be cleared.\n\nSantos has gas facilities in Pilliga state forest. (ABC News: Brendan Esposito)\n\nNSW Farmers Association President Xavier Martin accused the premier of putting Santos ahead of families and farmers.\n\n\"We do strongly condemn Premier Minns's ill-advised threat of compulsory land acquisition to support a multi-billion-dollar mining corporation,\" he said\n\n\"There's an enormous amount of scientific evidence and lived experience that this sort of project risks contamination of groundwater.\n\n\"This water is relied [on] by not just farmers … but all our towns and villages.\"\n\nXavier Martin has condemned the NSW government for considering compulsory land acquisition. (ABC News: Lani Oataway)\n\nMr Martin referred to the Queensland Office of Groundwater Impact Assessment, released last week, which looked at how coal seam gas industry impacted groundwater pressure in the Great Artesian Basin.\n\n\"[It] came out with all the issues around contamination, subsidence and complete dewatering of many of the bores in the Artesian Basin in Queensland,\" he said.\n\n\" Surprise, surprise, we're on the same Artesian Basin. It covers nearly half the nation. \"\n\nPremier Minns said there had been a \"comprehensive scientific audit in relation to the fields\".\n\nEarlier this year, the National Native Title Tribunal ruled the NSW government could lease land to Santos for the Narrabri Gas Project.\n\nAt the time, Gomeroi woman and native title applicant Polly Cutmore said the decision was upsetting, but her people would continue to fight to protect their country.\n\nFacing a fight\n\nPresident of the Hunter Gas Landholder Rights Alliance Mick Fetch said Santos was trying to bully landholders.\n\n\"Santos is obviously leaning on the premier to in turn bully landholders, it's just a clear message that they're losing the fight,\" Mr Fetch said.\n\n\"They've only got 30 per cent of landholders signed up along this 800km route and that's been an approved survey route since 2009, so they're obviously desperate.\n\n\"They take out full-page ads saying that you can continue normal farming practices, but they hand us a contract that holds us over for the next seven years that says we have to get permission from them to use our land in a certain way.\n\n\"They're going to face a fight because we're just not interested.\"\n\nA significant project\n\nChief executive of Energy Quest, and former Santos executive, Rick Wilkinson said the Narrabri Gas Project should not be \"underestimated\".\n\n\"It's supposed to be supplying half of NSW gas in a few short years and if it doesn't get up, then it's almost certain in my opinion that LNG imports will be required,\" he said.\n\nHe said there needed to be goodwill with the community for any gas project to advance.\n\nRick Wilkinson says common ground needs to be found for a project to work. (ABC News: Dean Caton)\n\n\"Both parties have to listen and listen carefully to the other side, and this usually involves some concessions along the way,\" he said.\n\n\"You can start with very different points of view but generally there's a common ground and an accommodation can be met, that only works if you can get goodwill between the relevant farmers and the gas companies.\"\n\nSantos has been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-30/all-you-need-to-know-australia-vs-india-icc-world-cup/105946228",
        "title": "Can India find a way to upset Australia's staggering all-round depth?",
        "publish_date": "Thu, 30 Oct 2025 00:31:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia cantered into the semifinals of the 2025 One Day International Women's Cricket World Cup.\n\nSix wins and one washout from seven games meant that the defending champion finished the pool phase as the only undefeated team left in the tournament.\n\nBut in co-hosts India, the Aussies face a semifinal match-up with women's cricket's great stirring giant — a team that has come so far in the past decade, but one that still has so much left to give.\n\nCan India, buoyed by a parochial home-town crowd and familiar Mumbai conditions, reshape the fault lines of international cricket?\n\nIndian opening batter Smrti Mandhana scored three for centuries in the pool phase. (Getty Images: Alex Davidson)\n\nOr will Australia's steely serial winners — who look set to welcome back captain and dual centurion from the pool phase Alyssa Healy — continue their march towards yet another title?\n\nAnd could rain — the pantomime villain of the tournament so far — play spoilsport once again on Thursday?\n\nThis is how to watch, how to listen and what to expect from the pointy end of Australia's 2025 Women's ODI World Cup campaign.\n\nThe roads to the semifinals\n\nThursday's semifinal is between the pool phase's top ranked side, Australia, and its fourth ranked side, India. The winner will play South Africa in Sunday's tournament decider.\n\nWhile Australia breezed into the knockouts, India had to fight for its place in the top four.\n\nAustralia went unbeaten in the pool phase of the tournament. (Getty Images: Surjeet Yadav)\n\nAfter going down to England, South Africa and Australia and having its match with Bangladesh washed out, the tournament co-hosts only secured passage to Thursday's semifinal with a rain-affected win over New Zealand in the second last round.\n\nBoasting tournament top-scorers Smriti Mandhana and Pratika Rawal, and led by captain Harmanpreet Kaur, India has plenty of runs in them and has never been in a better position to claim a first ever Women's ODI World Cup.\n\nBut first, they must past a truly generational Australian side.\n\nAustralia's all-round team stands up in the pool phase\n\nAustralia's all-round abilities are unmatched in international cricket. (Getty Images: Matt Roberts/ICC)\n\nWomen's cricket features a higher proportion of all-rounders than men's cricket, but this Australian team takes it to another level.\n\nMegan Schutt and Darcie Brown are the only 'pure' bowlers to have played in the tournament for Australia, and wicketkeepers Alyssa Healy and Beth Mooney aside, Phoebe Litchfield and Georgia Voll the only specialist batters.\n\nThis means that Australia both bats very deep and has more bowling 'plan bs' than any team in world cricket.\n\nLeg spinner and player of the tournament so far King — who averages over 18 with the bat in ODIs — has batted at No. 10 in most matches and smashed a vital half-century against Pakistan.\n\nKing picked up 7-18 against South Africa in the final pool match. (Getty Images: Matt Roberts)\n\nSeam bowling all-rounder Kim Garth — who played international cricket for Ireland before making her Australian debut in 2022 — batted as low as No. 9 during the pool phase.\n\nShe was a regular No. 3 before switching international allegiances.\n\nThe obvious benefit of having such an over-qualified tail means neither a competitive score nor successful chase are ever off the cards.\n\nThe Aussies went from 5-128 to 8-308 against New Zealand, relied on Garth to help chase down 331 against India and leant on King's timely 50 as well as Mooney's load bearing century against Pakistan.\n\nHaving up to 10 capable batters in a side also clearly increases the chance of at least one player going big.\n\nAsh Gardner, Mooney and Healy have all scored key centuries, while almost everyone else have taken turns making important contributions.\n\nIn terms of bowlers, Australia is truly spoilt for choice, with eight legitimate bowling options playing in most games of the tournament so far.\n\nHowever, the excellent form of Australia's frontline bowlers has meant captains Healy and Tahlia McGrath haven't had to get too creative with their decision making.\n\nSeam bowling all-rounder Sutherland has bowled the most overs of any Australian at the tournament, two of pacers Megan Schutt, Darcie Brown and Kim Garth have generally opened an innings, while spinners King, Gardner and Sophie Molineux have been predictably excellent in sub-continental conditions.\n\nKing's bowling has been potentially the story of the tournament so far for Australia. She's taken 13 wickets including figures of 7-18 in the seven wicket trouncing of South Africa — the best figures ever in ODI cricket by an Australian woman and the best in tournament history.\n\nMeanwhile, Sutherland has quietly made her way to the top of the tournament's wicket taking charts with 15.\n\nThis excellence and consistency has meant that seam bowling all-rounder McGrath has bowled less than five overs throughout the tournament while Perry — although she has seldom bowled at international level in recent years — hasn't had to deliver a ball.\n\nSo, India's task is simple, if mammoth, on both fronts: somehow find a way through Australia's seemingly never-ending batting stocks and destabilise Australia's attack enough that Healy must throw the ball to a player outside of her best five or six options.\n\nA sodden World Cup and the forecast for the knockouts\n\nFour of the 11 pool games scheduled for Colombo were washed out. (Getty Images: Sameera Peiris)\n\nAustralia was denied a chance at a perfect pool phase by a washout against Sri Lanka in Colombo on match day two.\n\nRain was a consistent theme across the pool phase, with five of its 29 matches finishing without a result due to bad weather.\n\nColombo was a particularly sodden sight — four of the 11 matches played in the Sri Lankan capital didn't produce a result.\n\nThe International Cricket Council's (ICC) decision to schedule so many games in a notoriously wet city in the middle of its rainy season has received flack from across the cricketing world.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nNew Zealand, particularly, was hard done by.\n\nTwo consecutive Colombo washouts against Sri Lanka and Pakistan — both games the Kiwis would have expected to win — all but ensured they wouldn't qualify for the knockouts.\n\nKiwi legend Sophie Devine — who farewelled international cricket in New Zealand's final group game against England — was particularly bemused after the washout against Pakistan. That game was called off when the Kiwis had Pakistan 5-92 and in all sorts.\n\n\"You wait four years for a World Cup and to have rain play such a massive part in it is disappointing… you've waited for so long and you want to test yourself against the best and to be scuppered by rain, it's a real shame for me,\" Devine said after the match against Pakistan.\n\nKiwi legend Devine farewelled international cricket in New Zealand's final pool phase game against England. (Getty Images: ICC/Matthew Lewis)\n\nPakistan and Sri Lanka had it even worse than New Zealand — three of their seven group games met an unfortunate rainy demise.\n\nBut Colombo has seen its last cricket for the tournament. Australia's semifinal clash with India and Sunday's decider are both scheduled for Mumbai.\n\nOn Thursday, morning clouds and possible showers are predicted to clear in time for the beginning of the semifinal, but weather could play a role in the grand final on Sunday, with scattered showers forecast throughout the afternoon.\n\nHow to watch, listen and follow\n\nABC Sport will blog and broadcast live radio coverage of every ball of Thursday evening's ICC Women's Cricket World Cup semifinal between Australia and India. It will also be available to stream on Prime Video in Australia.\n\nPlay will begin at 3pm local time on Thursday October 30, which is:\n\n8:30pm in New South Wales, Victoria, Tasmania and the ACT\n\nin New South Wales, Victoria, Tasmania and the ACT 8pm in South Australia\n\nin South Australia 7:30pm in Queensland\n\nin Queensland 7pm in the Northern Territory\n\nin the Northern Territory 5:30pm in Western Australia\n\nABC Sport's live blog will begin at 7:30pm AEDT.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-30/mudgee-off-electricity-grid-winery-lowe-wines/105941576",
        "title": "Winery becomes Australia's largest to go off the grid",
        "publish_date": "Thu, 30 Oct 2025 00:27:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "A Mudgee winery has become the largest in Australia to operate its business entirely off the grid.\n\nLowe Wines operates its vineyard, winery, cellar door and restaurant on a solar and battery system.\n\nDirector and chief winemaker David Lowe said high electricity costs and supply issues drove the move, which had been transformative for the business.\n\nDavid Lowe says he loves his solar and battery system. (ABC Central West: Emily Middleton)\n\n\"Before, I was actually managing the power usage. You couldn't turn an oven on or a fridge on without something else being turned off,\" he said.\n\n\"It was really a day-by-day, seven-day-a-week monitoring of our power usage, but the trouble was that I didn't know how much power we were using, I only knew when it was a problem.\"\n\nMr Lowe said the business was now cash positive when it came to its monthly power bill.\n\nDavid Lowe celebrates the switching on of his off-grid system. (Supplied: Charlie Hodgkin)\n\nHe said the off-grid system could withstand even the most strenuous events on site.\n\nThis included watering systems for crops, lights, considerable refrigeration, heating, crushing and processing equipment, large motors and dishwashers.\n\n\"We had a wedding for 160 people on Friday night. We had 130 on Saturday night. We also … had about 300 paying customers to visit us. The restaurant was full, our bases were loaded, and I tell you what, I loved it. I love this machine,\" Mr Lowe said.\n\nThe solar and battery system copes with the business' high power use. (ABC Central West: Emily Middleton)\n\n\"We're not a small business — we employ 65 staff here, so we make this place work. It's a very, very important part of agritourism.\n\n\"The future's very bright, but without power, the whole place would have shut down.\"\n\nMr Lowe said the off-grid system was the final piece of the puzzle.\n\nThe system consists of 414 solar panels. (ABC Central West: Emily Middleton)\n\n\"We have our own factory, we have our own food processing plant, we have our own winery, we have our own restaurant. Now we have our own energy source,\" he said.\n\n\"I feel like I'm in control. I feel like we're managing our own business. Before, we were captive.\"\n\nEarly challenges\n\nIt has not been an easy process, however.\n\nAfter first installing some solar panels a few years ago, Mr Lowe found his energy costs were still $9,000 a month.\n\nHe eventually discovered that about 40 per cent of his panels had been installed incorrectly, and it was at that point that he decided to increase the number of panels to run off-grid.\n\nGreg Todd, director of SBS Solar and Water in Mudgee, the company that installed Lowe Wines's off-grid system, said it was clear Mr Lowe was exasperated.\n\nGreg and Kate Todd helped David Lowe come up with a solution. (ABC Central West: Emily Middleton)\n\n\"For years, David had problems with insufficient power to the property, and he'd been told the answer to that was bigger poles and wires,\" Mr Todd said.\n\n\"More money spent and then still paying a power bill, so we came up with a solution to create a full off-grid system.\"\n\nThe system consists of 414 solar panels at 265kW, as well as 1.2MWh battery storage.\n\nThe battery storage unit on the Mudgee property. (ABC Central West: Emily Middleton)\n\nA common trend\n\nVictoria University Victoria Energy Policy Centre director Bruce Mountain said more people were switching off the grid due to frustration with supply and rising electricity prices.\n\n\"The price of battery and solar has come down, and as a consequence, it's now economically attractive,\" he said.\n\n\"It started out just solar, and then it's become solar plus storage, and integrating solar plus storage and sometimes diesel backup is leading to individual customers going off-grid and often little micro-grids.\"\n\nBruce Mountain says solar and battery systems have become more attractive. (ABC News: Peter Garnish)\n\nProfessor Mountain said off-grid systems were immune to power outages caused by downed powerlines.\n\nBut he said up-front costs could turn some agricultural businesses off the option.\n\n\"They need to be able to ensure they have enough supply for sequences of dark days, possibly weeks in winter, and so they need to ensure they have adequate solar supply for that and then the power capacity in the backup battery,\" he said.\n\nMr Lowe said his biggest concern was his curious donkeys potentially damaging his solar panels.\n\nDavid Lowe says his donkeys can be a little too inquisitive. (ABC Central West: Emily Middleton)\n\nBut a simple paddock move could be the solution.\n\n\"I absolutely recommend this to anyone who's in agriculture … who's got lots of land, just to have the panels pointing in the right direction. And for me, the sun is still free,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-30/councils-may-hold-key-to-caravan-street-parking-solution/105943790",
        "title": "Storage businesses weigh in as councils battle caravans clogging streets",
        "publish_date": "Thu, 30 Oct 2025 00:00:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Private storage facilities say there is an easy fix to unlock the caravan street-clogging crisis, and local councils hold the key.\n\nThe Sunshine Coast and Gold Coast councils presented a joint motion at the Local Government Association Queensland (LGAQ) conference last week, calling for the state government to implement laws that restrict on-street parking for recreational vehicles.\n\nThe motion was passed and will now form part of the LGAQ's advocacy platform on behalf of councils.\n\nOwners with insufficient space may need to source private storage vendors who are already swamped with demand if laws are implemented.\n\nLocal laws require storage facilities to be located within industrial zones. (Supplied: Bionic Storage)\n\nMerryn Austin from Bionic Storage at Landsborough said there was an easy fix to the issue, but council zoning laws would not allow it.\n\n\"A few years ago, we were trying to get a zoning change on a block out at Caloundra to store caravans, which was a bit of a grey area in the planning scheme,\" she said.\n\n\"The state government did approve for us to have caravans there, but council really didn't want it because it would cause a change in zoning.\"\n\nSunshine Coast Council receives more than 700 complaints annually about caravan street parking. (ABC Sunshine Coast: Jake Kearnan)\n\nThe block of land was located near the Caloundra racecourse and was zoned as a rural property, not industrial.\n\n\"If they relaxed the laws a little bit and allowed people with acreage or rural properties to accommodate vans, instead of only allowing it for industrial zoning, that would help the problem,\" Ms Austin said.\n\n\"If people have got 70 acres, I don't understand why they can't store caravans there.\n\n\"A lot of people could make use of their land, but then it comes down to them running a commercial business on rural land, which becomes a whole new issue.\"\n\nBetter planning needed\n\nSunshine Coast Mayor Rosanna Natoli presented the motion at last week's LGAQ conference, and it was supported by an overwhelming majority.\n\n\"This is an issue impacting our council and others across the state, with residents complaining about safety concerns, a lack of available parking and neighbourhood streets that are clogged and ugly,\" she said.\n\n\"We receive 700 complaints a year plus thousands of signatures on petitions, and we are not alone.\n\nRosanna Natoli says caravan street parking is an issue in many areas. (ABC News: Amy Sheehan)\n\n\"We are calling for the state government to assist us with legislation to manage this for our communities.\"\n\nCaravan Trade and Industries Association of Queensland chief executive Jason Plant said councils needed to get strict on new housing developments.\n\n\"Some of these new housing developments don't allow a lot of space for vehicle movement down the streets, let alone the ability to park and store products within their property,\" he said.\n\n\"I think better planning needs to be considered when looking at these new developments to ensure that there is space to accommodate for the people that live there, for their lifestyle choice as well.\"\n\nJason Plant says he is hoping for a collaborative approach to any law changes. (ABC Sunshine Coast: Tara Cassidy)\n\nMr Plant said he was concerned about the potential impact on regional tourism.\n\n\"We acknowledge there are concerns about congestion and harmony that are genuine and deserve attention,\" he said.\n\n\"If they're forced to move those products to an off-site storage facility somewhere, costs come with that, accessibility challenges come with that, and we would hate to see that lead to a changing attitude towards recreational vehicle ownership.\n\n\"There would be far-reaching unintended negative consequences if that were to occur, as far as tourism goes.\"\n\nMarket concerns\n\nCaravan dealerships are concerned potential changes may dissuade people from buying caravans.\n\nCarvan HQ general manager Robbie Cochrane called for a compromise.\n\nRobbie Cochrane says van owners needed to be mindful of their neighbours. (ABC Sunshine Coast: Jake Kearnan)\n\n\"It's a bit of a tricky one really because, if we can park caravans [on street], it's better for our business,\" he said.\n\n\"You've also got to be mindful of the people around you and your neighbours.\n\n\"You've got to keep everyone happy — it's not a one-way street.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-30/greyhound-racing-new-south-wales-tracks-closing-broken-hill/105943456",
        "title": "Almost half of all NSW greyhound racing tracks to be permanently shut",
        "publish_date": "Wed, 29 Oct 2025 23:29:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Greyhound Racing NSW intends to close 11 of its 26 tracks throughout the state by June 30, 2026, following a decrease in demand.\n\nA report by Deloitte Australia commissioned by Greyhound Racing NSW (GRNSW) found that only 12 tracks were needed around the state.\n\nBut the organisation will instead close 11 and keep 15 open.\n\nChief executive Steve Griffin said GRNSW would reduce its racing footprint to 15 tracks over the next 10 months or so.\n\nGreyhound Racing NSW plans to close 11 tracks around the state. (Supplied)\n\nAmong the tracks slated for closure are seven non-TAB tracks: Coonamble, Potts Park, Wauchope, Young, Kempsey, Moree and Tamworth.\n\nSteve Griffin says the tracks will be closed over the next 10 months or so. (Supplied)\n\nThe TAB clubs to be closed are Maitland, Wagga Wagga and Broken Hill.\n\nRacing has also recently ceased at Dapto, bringing NSW's total number of still operational tracks to 26.\n\nGRNSW said it was awaiting a response from the state government in relation to its request for an extension to the lease at Wentworth Park.\n\nOnce the government’s intention is known a decision regarding the future of metropolitan racing will be made.\n\nMr Griffin said the report ranked the clubs according to a range of criteria, including suitability, areas of access, profitability, racing injuries and the costs involved to bring them up to minimum track standards if required.\n\nClubs have until November 14 to respond to the recommendation before the board makes a final decision.\n\nLocal club devastated\n\nThe Broken Hill Greyhound Club said it was devastated by the decision.\n\nThe local club has been running for more than 50 years in far west NSW.\n\nBroken Hill Greyhound Club has been operating for about 50 years. (Supplied )\n\nPresident Regan Edgecumbe said members were shocked and angry.\n\n\"As a club we felt like we haven't done anything wrong,\" he said.\n\n\"If something needs to be fixed or repaired, we do it.\n\n\"We make sure it's done as soon as something's not right.\n\n\"We make sure it's up and working for us for the next week.\"\n\nMr Edgecumbe said the track provided income for around 20 people.\n\nRegan Edgecumbe says the club employs about 20 staff. (ABC Broken Hill: Katherine Spackman)\n\n\"Whether it be the managers … the curators, through to the cleaners, through to our race day staff,\" he said.\n\n\"A lot of those people are semi-retired or retired or on pensions and it just tops up their back pocket every week.\"\n\nBroken Hill trainers Peter and Wendy Whitford said if the local track was axed it would be the end of dog racing for them.\n\n\"The closest track we have is Adelaide — so [we are] looking at a 10 to 12 hour round trip to go down and race,\" Mr Whitford said.\n\nPeter and Wendy Whitford with one of the pups they were about to start racing in Broken Hill. (ABC Broken Hill: Katherine Spackman)\n\nThe couple has about 12 dogs, including five pups they were about to start racing.\n\n\"The distance makes it very hard being like we are – hobby trainers,\" Mr Whitford said.\n\n\"It'd probably be the end of it for me and probably a lot of the other trainers in Broken Hill as well.\"\n\n'Greyhound racing shrinking'\n\nThe Coalition for the Protection of Greyhounds has welcomed the announcement by Greyhound Racing NSW.\n\nPresident Amy McMahon said it was a big boost for animal welfare, pointing to the 13 greyhound deaths and \"hundreds of injuries\" in NSW this year.\n\nAmy McMahon has welcomed the decision by NSW Greyhound Racing to close 12 tracks. (Supplied)\n\n\"There's no way to make a greyhound racing track safe,\" she said.\n\nMs McMahon said the announcement was likely made to shore up GRNSW's position and \"justify their existence\", before findings from the 2024 Drake Review into greyhound racing were released.\n\n\"Greyhound racing continues in part because of big donations from the gambling sector to major political parties and what they get in return is the continuation of greyhound racing,\" she said.\n\n\"We're seeing the continuation of gambling harm on everyday people … and meanwhile, these companies like Sportsbet, Tabcorp [and] Ladbrokes get to make big profits off the back of dead and injured greyhounds.\"\n\nDavid Harris was asked when the Drake Report would be made public during budget estimates in August. (Supplied: Youtube)\n\nA spokesperson for the NSW Minister for Racing David Harris said the state government supported a competitive, responsible and sustainable greyhound racing industry, \"with the highest standard of animal welfare\".\n\n\"It is important that, in considering any decisions around its track portfolio, GRNSW engages appropriately with industry stakeholders, given the impact of any closures on greyhound racing participants,\" the spokesperson said.\n\nEditor's note: An earlier version of this story incorrectly reported the number of greyhound racing tracks set to close, and that the Wentworth Park track would close. The story has been updated to accurately reflect the number of tracks closing, and note that a decision has not yet been made regarding Wentworth Park.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-30/ryan-papenhuyzen-release-from-melbourne-storm/105950764",
        "title": "Papenhuyzen granted release from Storm to consider future amid R360 talk",
        "publish_date": "Wed, 29 Oct 2025 23:28:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "Melbourne Storm premiership winner Ryan Papenhuyzen has been granted an immediate release from the club with one year still remaining on his contract.\n\nPapenhuyzen played 113 matches for the Storm, including being named the Clive Churchill medallist in Melbourne's 26-20 win over the Penrith Panthers in the 2020 NRL grand final.\n\nA statement from the Storm said the 27-year-old wanted to take time away from rugby league to consider his future.\n\nPapenhuyzen, along with other NRL stars, have been rumoured to be targets for rebel rugby union competition, R360.\n\n\"I've loved my time at Melbourne Storm. I've enjoyed close to a decade of incredible memories and experiences in the purple jersey. Playing in front of the Storm fans every week has made my time in Melbourne something I'll never forget,\" Papenhuyzen said.\n\n\"I want to thank the club for their understanding and support throughout this process. I also want to thank my teammates, coaches and staff for all their love and support, it's been a privilege playing footy and working with you.\"\n\nRyan Papenhuyzen was plagued by injury throughout his career, but was able to play consistently in 2024 and 2025. (AAP: Joel Carrett)\n\nMelbourne Storm chairman Matt Tripp said the club was disappointed to lose their fullback but said it respected Papenhuyzen's decision to take absence from the game.\n\n\"Ryan has shown great character and resilience throughout his time at our club and we've loved watching him develop into the player and person that he is today,\" Tripp said.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\n\"We're obviously disappointed that his time at Storm has come to an end, but we respect his decision to take some time away from professional sport.\"\n\nPapenhuyzen joined the Storm in 2017 after moving from Wests Tigers where he was a junior.\n\nHe made his NRL debut against the Canterbury Bulldogs in round four of the 2019 season.\n\nAfter winning the 2020 premiership, Papenhuyzen was plagued by injuries over the coming years.\n\nHe played just 30 matches from 2021 to 2023.\n\nPapenhuyzen played more regularly in 2024 and 2025, playing 20 and 21 matches respectively, helping the Storm reach the grand final in both years.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-30/drake-appeals-defamation-loss-over-kendrick-lamar-not-like-us/105950556",
        "title": "Drake appeals defamation loss over Kendrick Lamar's Not Like Us",
        "publish_date": "Wed, 29 Oct 2025 23:25:24 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Superstar rapper Drake has filed a formal notice of appeal in an effort to revive his defamation lawsuit against Universal Music Group (UMG) over Kendrick Lamar's Grammy-winning diss track Not Like Us.\n\nThe Canadian rapper, whose real name is Aubrey Drake Graham, will ask an appeals court in Manhattan to overturn the October 9 dismissal by a federal judge.\n\nUMG releases both Drake and Lamar's music.\n\nDrake and Lamar have been involved in a lengthy feud in which they both released diss tracks targeting one another.\n\nDrake's lawsuit over Kendrick Lamar diss track dismissed The judge says a reasonable listener could not have concluded that Not Like Us was conveying objective facts about Drake.\n\nWhile UMG Recordings is a defendant, Lamar is not.\n\nDrake sued UMG in January over its promotion of Not Like US, saying the song deceived listeners into believing the false accusations that he is a paedophile.\n\nBut US district judge Jeannette Vargas dismissed the case saying Lamar's lyrics, in which he targets Drake and his affiliates, were not defamatory because they amounted to non-actionable opinion.\n\n\"The artists' seven-track rap battle was a 'war of words' that was the subject of substantial media scrutiny and online discourse,\" Vargas wrote.\n\n\"Although the accusation that plaintiff is a paedophile is certainly a serious one, the broader context of a heated rap battle, with incendiary language and offensive accusations hurled by both participants, would not incline the reasonable listener to believe that Not Like Us imparts verifiable facts about plaintiff.\"\n\nDrake sues Universal for defamation Drake is suing his label, Universal Music Group, for defamation over Kendrick Lamar's track 'Not Like Us', a move the record company calls \"illogical\".\n\nNot Like Us won the record of the year and song of the year at this year's Grammys, and spent three weeks at the top of Billboard's Hot 100 charts.\n\nLamar also performed the song at this year's Super Bowl half-time show.\n\nIt could take over a year for the appeals process to run its course.\n\nUMG has told ABC News it has no comment at this stage.\n\nABC/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-30/queensland-social-housing-register-reaches-record-high/105946840",
        "title": "Families, single women join record high social housing waitlist",
        "publish_date": "Wed, 29 Oct 2025 22:58:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Following the death of her aunty, with whom she shared a home, Julie Kelly was forced to join Queensland's long queue for social housing.\n\nThe 62-year-old said the choice was either homelessness or accepting a one-bedroom unit in the rural North Burnett town of Gayndah, 150 kilometres away.\n\n\"They told me there was nothing available in Bundaberg for me and it got to a very stressful stage,\" she said.\n\n\"I was told that if I did not take the [unit] in Gayndah, that I would be homeless.\n\n\"I was left with no other option.\"\n\nJulie Kelly is living in a one-bedroom unit in Gayndah. (ABC News: James Taylor)\n\nThe disability pensioner said she had a history of cancer as well as other health concerns, and needed to travel almost two hours to see her regular doctor in Maryborough. But she said that did not seem to make a difference to the Department of Housing.\n\n\"I tried to explain to them the medical situation and with all my medical problems,\" she said. \"It just fell on deaf ears.\"\n\nShe estimated the fortnightly round trip was costing her $100 in fuel.\n\n\"The expense of travelling is getting astronomical,\" she said.\n\n\"It is taking a toll, financially and health-wise.\"\n\nJoining the queue\n\nAccording to the Queensland Council of Social Service (QCOSS), the social housing register has grown to a record high of 56,000 people.\n\nThat is higher than the government's data from August, which showed 53,874 people waiting for public housing.\n\nSome homeless are living in tents, such as this one set up at Alexandra Park in Bundaberg. (ABC News: Johanna Marie)\n\nQCOSS chief executive officer Aimee McVeigh said the housing crisis was worsening.\n\n\"We know that there are many families with children on the social housing register, people with disability and many First Nations households,\" she said.\n\n\"Across the state, we are seeing increasing levels of homelessness and that can be explained by the level of need represented on the social housing register.\n\n\"People are not able to be allocated housing quickly because there is not enough stock.\"\n\nShe said the private rental market had become completely unaffordable for many Queenslanders.\n\nQCOSS's Aimee McVeigh has warned that the housing crisis in Queensland is getting worse. (ABC News: Curtis Rodda)\n\n\"Not only are people unable to access social housing, but they're unable to afford rent in the private rental market,\" she said.\n\n\"In the Bundaberg area, we've seen increases of almost 80 per cent in the median rent across the last five years.\"\n\nThe average wait time for public housing is almost two and a half years, with vacancy rates less than 1 per cent.\n\nNot enough homes\n\nA spokesperson for the Department of Housing and Public Works said there were more than 5,600 social and affordable homes being delivered across the state, of which 1,000 were modular construction.\n\nThe modular units will be tenanted by the end of October. (ABC News: Johanna Marie)\n\nThe first two-storey modular social housing complex was recently completed in Bundaberg and is expected to be fully tenanted by the end of the month.\n\nThe complex includes 12 one-bedroom and two-bedroom units that were built in less than a year in a partnership between QBuild and Hutchinson Builders.\n\nMinister for Housing Sam O'Connor said it was a record pipeline but understood many more were needed.\n\n\"We need to make sure that it gets even bigger and our clear aim as a government is to get our social and community housing delivery up to over 2,000 a year,\" he said.\n\n\"We've said we will deliver by the end of this term. That is ambitious. It is quadrupling the amount that the former government managed to deliver on average per year during their 10 years in office.\n\nA kitchen inside one of the modular homes built for social housing. (ABC News: Johanna Marie)\n\n\"We're under no illusions about how big the scale of the challenges [are] to ramp up to that level, but we're confident we can get there.\"\n\nMs Kelly meanwhile said she remained hopeful the department would eventually find her a two-bedroom home in Maryborough or Bundaberg, closer to family and friends.\n\n\"It's on my paperwork that I need a two-bedroom, so at least I've got my granddaughters or a friend to come, you know, two or three nights a week,\" she said.\n\n\"It's like a waiting game … so I'll be waiting.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-30/abandoned-rottweilers-put-pressure-on-nsw-animal-shelters/105911124",
        "title": "Shelter for Rottweilers struggles to stay afloat amid 'disposable' culture",
        "publish_date": "Wed, 29 Oct 2025 21:52:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "As the owner of a shelter that specialises in large dog breeds, Sue Ebert is familiar with the temperament of Rottweilers.\n\nBut even she still gets nervous around some of her dogs.\n\n\"If I get too arrogant and think I can just handle a dog without any concern, I probably would find myself in a whole bunch of trouble,\" she said.\n\nSue Ebert says the lack of education among pet owners is a growing issue in NSW. (ABC News: Rachel Holdsworth)\n\nMs Ebert said a growing number of people were abandoning and surrendering Rottweilers, putting huge pressure on her shelter, Iron Dog Rescue, north-east of Wagga Wagga at Bethungra.\n\n\" They are a large breed dog that requires a lot of commitment, a lot of good nutrition as they are growing, and a lot of training. \"\n\nShe said Rottweilers were generally good-natured but there was a knack to caring for them and many owners were not up to the task.\n\n\"Rottweilers by nature are a very protective and guarding dog,\" she said.\n\n\"Unfortunately, some people don't understand that.\n\n\"I think life in general has become quite disposable and unfortunately, I think animals have been caught up in that web.\"\n\nPressure mounts\n\nIron Dog Rescue is one of just a handful of rescue organisations in Australia that specialise in Rottweilers, and takes in dogs from across the country.\n\nFrom 2021 onwards, Ms Ebert consistently cared for up to 100 dogs.\n\nBut this year, that number increased to 129 animals at any one time.\n\nShe has been able to re-home 134 dogs so far this year.\n\nSue Ebert says her shelter is frequently at full capacity. (ABC News: Rachel Holdsworth)\n\nMs Ebert said large dog breeds presented a \"safety issue\", making specialty organisations like hers crucial.\n\n\"We often get in very young, large dogs that could be anything from 40 to 60 kilos,\" she said.\n\n\" We need to make sure we've got the skills necessary to train those dogs. \"\n\nRSPCA senior manager of animal care Georgie Caspar said rehoming large dog breeds like Rottweilers could be difficult.\n\n\"They are always looking for homes and those homes can be quite hard to find,\" she said.\n\nMs Caspar said recent research suggested rehoming large dog breeds could \"take twice as long compared to smaller dogs\".\n\nRising costs\n\nIron Dog Rescue relies on donations from pet food companies and community members.\n\n\"Often our adoption fees don't cover the vet work even in a healthy animal,\" Ms Ebert said.\n\n\"Then we have our additional animals with high needs, such as ACL surgery … heartworm treatment.\"\n\nAdoption fees are not covering the cost of caring for the animals at Iron Dog Rescue. (ABC News: Rachel Holdsworth)\n\nIron Dog Rescue desexes, vaccinates and worms every animal in care and provides training to dogs that need it.\n\nMs Ebert said she did not make money.\n\nWith the number of Rottweilers increasing at the rescue organisation, Ms Ebert is in need of more than $100,000 to upgrade new kennels.\n\nFunding needed\n\nIron Dog Rescue is not alone when it comes to financial pressures.\n\nThe Smart Animal Sanctuary and Rehoming Centre, located near Batlow in the Snowy Valleys, has recently been forced to let go of three staff members.\n\n\"The adoptions have dropped off, so we haven't got a lot of money coming in,\" said owner Lorene Cross.\n\nLorene Cross says her rescue has had to cut staff, and its animal intake. (ABC News: Rachel Holdsworth)\n\nMs Cross said the situation was \"bad out there\", and her team was receiving up to 10 emails and phone calls a day from people trying to surrender their animals.\n\nShe said support from the state government was nowhere near where it should be.\n\n\"We have applied for quite a few [government grants] over the years. We've managed to get one,\" Ms Cross said.\n\nAnimal rescue and rehoming organisations face growing demand and financial pressures in NSW. (ABC News: Rachel Holdsworth)\n\nIn a statement to the ABC, a spokesperson for Minister for Local Government Ron Hoenig said the NSW government recently committed $6 million in funding for shelters and rehoming organisations and passed new laws banning puppy farming.\n\n\"These laws introduce stricter regulations for breeders, which will help address animal welfare concerns and oversupply issues,\" the spokesperson said.\n\nThe funding will be distributed over four years, with $1.5 million available for rescue organisations through a grant each year.\n\n\"Which sounds like a lot of money, but unfortunately, there's a lot of rescues that need help just like I do that are struggling to survive,\" Ms Ebert said.\n\nBoth organisations have applied for a grant of up to $100,000 and will soon find out whether they have been successful.\n\n\"It would help us with our vet bills and to keep the last of the staff I've got here employed,\" Ms Cross said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-30/microsoft-deploys-fix-for-azure-cloud-service-after-outage/105950166",
        "title": "Microsoft deploys fix for Azure cloud service after outage",
        "publish_date": "Wed, 29 Oct 2025 21:45:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Microsoft has deployed a fix to address an outage of its Azure cloud portal which left users unable to access Office 365, Minecraft and other services.\n\nThe tech company wrote on its Azure status page that a configuration change to its Azure infrastructure caused the outage and that a fix was being rolled out.\n\nMicrosoft did not immediately respond to a request for comment, but the company acknowledged issues with its Azure Front Door, a global content and application delivery network, service on its status page and social media accounts.\n\nWhy the AWS outage was such a big deal Millions of apps, websites and services rely on AWS, one of the world's largest cloud computing platforms. Here's what we know about the outage.\n\nAn outage like this can have a widespread impact because many sites and services use Microsoft's cloud service.\n\nOn Downdetector, a website that tracks online outages, users reported issues throughout the day with Office 365, Minecraft, XBox Live, Copilot, Costco, Starbucks, and many other services.\n\nAlaska Airline wrote on its X account that the outage was at the heart of problems affecting its systems, including check-in services.\n\nAir New Zealand, the national airline has warned of travel delays because it could not process payments or digital boarding passes.\n\nThe websites for New Zealand's police and parliament were also among those taken down by the outage.\n\nMicrosoft's Azure troubles came just hours before the company was set to release its quarterly earnings report.\n\nThe outage also came just over a week after a massive outage of Amazon's cloud computing service, Amazon Web Services (AWS), which took down a broad range of online services including social media, gaming, food delivery, streaming and financial platforms.\n\nAWS revealed in a lengthy statement that a string of events triggered the outage.\n\nIt said the problems stemmed from a \"latent defect\" in what is known as the domain name system, or DNS.\n\nThis prevented applications from finding the correct address for AWS's DynamoDB API, a cloud database that stores user information and other critical data.\n\nAmazon is the dominant provider of cloud computing services but Microsoft ranks second, ahead of Google, in most markets.\n\nAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/companies/the-wall-street-giant-that-s-twice-as-big-as-our-entire-sharemarket-20251030-p5n6dy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Wall Street giant that’s twice as big as our entire sharemarket",
        "publish_date": "Thu, 30 Oct 2025 13:02:15 +1100",
        "category": "finance",
        "authors": [
            "Elias Visontay"
        ],
        "text": "Nvidia became the first public company to reach a market capitalisation of $US5 trillion ($7.6 trillion) on Wednesday, as the value of the US chipmaker grows to dwarf even the GDP of advanced economies such as India, the United Kingdom and Japan.\n\nThe ravenous appetite for the Silicon Valley company’s chips is the main reason that its share price has increased so rapidly since early 2023, having first reached a company value of $US1 trillion in June of that year. It only reached $US4 trillion four months ago.\n\nHere’s what you need to know about Nvidia’s journey to be one of the world’s most prominent companies, its leather jacket-wearing chief executive, and the eye-watering numbers that illustrate the firm’s meteoric rise.\n\nWhat is Nvidia and what does it do?\n\nFounded in California in 1993, Nvidia is a manufacturer of chipsets known as graphics processing units, or GPUs. It was initially focused on making GPUs for computers and video games, but in recent years, it has become renowned for making the most advanced chips for use in artificial intelligence systems.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/crowded-house-sounded-immaculate-at-charming-deeply-funny-show-20251028-p5n601.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Crowded House sounded immaculate at charming, deeply funny show",
        "publish_date": "Thu, 30 Oct 2025 12:50:03 +1100",
        "category": "entertainment",
        "authors": [
            "Andrew Mcclelland"
        ],
        "text": "MUSIC\n\nCrowded House ★★★★★\n\nPalais Theatre, October 29\n\n“It’s good to be home,” Neil Finn opened on Wednesday night, and damn, it was good to welcome them back. Crowded House are a hit-making machine, yet they’ve somehow dodged the uncool stigma that follows bands like U2 or Coldplay. Maybe it’s because they don’t take themselves too seriously. They’re deeply funny live. The whole vibe was casual and charming, like finding an excellent little pub band, but with immaculate sound, seasoned crew, and a surprisingly large merch spread.\n\nNeil Finn said it was great for Crowded House to be home, much to the joy of the audience at the Palais on Wednesday night. Credit: Richard Clifford\n\nThe first set was acoustic, with the band play-acting as their own support act and renaming themselves “Crispy”. Not the finest band name, but “Crispy” delivered gorgeous versions of Pineapple Head, Four Seasons in One Day, and At the Station, featuring Vika and Linda Bull’s heavenly vocals.\n\nKeeping it playful, Neil debated bassist Nick Seymour about birds. “All Australian birds are loud and sound Australian; New Zealand birds are lovely and less self-confident.” This led to guitarist Liam Finn launching into a patriotic version of The Lord of the Rings theme, ending a timeless bit of stage banter. They also played a great new track, It Was a Small Detail, which deserves to be a hit.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/why-are-two-test-10s-at-one-club-20251030-p5n6j0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why are two Test 10s at one club?",
        "publish_date": "Thu, 30 Oct 2025 12:43:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Why are two Test 10s at one club?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/theatre/all-the-actors-are-naked-but-that-s-not-the-most-interesting-thing-about-this-play-20251030-p5n6h5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "All the actors are naked – but that’s not the most interesting thing about this play",
        "publish_date": "Thu, 30 Oct 2025 12:42:26 +1100",
        "category": "entertainment",
        "authors": [
            "Lenny Ann Low"
        ],
        "text": "Each night in the three-week run of new Australian play Naturism, cast members strip backstage to perform nude on stage. But that’s not what the play’s about.\n\nWritten by Ang Collins, the 80-minute work, part of Griffin Theatre’s 2025 season, is about climate anxiety. Set in a remote, off-grid bush eco-paradise founded 20 years ago by a group of Baby Boomer naturists, it’s a comedy about generations, humans and nature clashing, sparked by a Gen Z eco-influencer crashing the commune.\n\nFor cast member Fraser Morrison, nudity is his costume. Credit: Steven Siewert\n\nIts genesis came six years ago when Collins and her partner evacuated an area near Noosa in Queensland because of bushfire. The 2019-20 Black Summer bushfires followed and Collins, vividly affected by the fire’s physical proximity and media coverage of the resulting devastation, felt helpless.\n\n“My response to being incredibly anxious about that whole season and feeling powerless as an artist – why wasn’t I an ecologist? Why am I a stupid theatre artist? – was to write a comedy,” she says. “But just writing a play that increases people’s climate anxiety probably wouldn’t help.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-australian-man-pleads-guilty-to-stealing-us-trade-secrets-for-russia-trump-and-xi-set-to-meet-in-south-korea-today-hurricane-melissa-kills-dozens-in-jamaica-haiti-and-cuba-20251030-p5n6dw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Australian man pleads guilty to stealing US trade secrets for Russia; Hurricane Melissa kills dozens in Jamaica, Haiti and Cuba",
        "publish_date": "Thu, 30 Oct 2025 12:39:31 +1100",
        "category": "finance",
        "authors": [
            "Alexander Darling",
            "Emily Kaine"
        ],
        "text": "NSW Premier Chris Minns has launched a high-powered investment summit at the Sydney Opera House and revealed the state’s new Investment Delivery Authority has received 48 major investment proposals worth $136 billion.\n\nThe Citi A50 Sydney Investment Summit draws together global investors along with Australian political leaders and business leaders to promote investment in Sydney and across NSW.\n\nIt follows comparable events staged in the United States and hosted by Australia’s ambassador to the US, Kevin Rudd, who is also at the Sydney event.\n\nNSW Premier Chris Minns. Credit: Dominic Lorrimer\n\nMinns said the $136 billion in “potential deals” received by the Investment Delivery Authority was a sign of confidence in the NSW economy.\n\nBut he acknowledged planning system was often “too cumbersome.” The authority aims to speed the delivery of large-scale commercial projects.\n\n“We want to fast-track investment in Australia’s largest state,” Minns said.\n\nThe first round of submissions received by the authority include 23 projects for data centres and technology valued at $72 billion; 22 projects in renewable energy and energy security valued at $63 billion; and 3 projects for hotels valued at $860 million.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/investors-deliver-a-bloodbath-at-james-hardie-meeting-20251029-p5n68h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bloodbath not over for James Hardie as investors sack their chair",
        "publish_date": "Thu, 30 Oct 2025 12:25:05 +1100",
        "category": "finance",
        "authors": [
            "Colin Kruger"
        ],
        "text": "James Hardie investors have dumped chairwoman Anne Lloyd and two other board members in an unprecedented display of anger over the board’s disastrous $14 billion acquisition of US group Azek and its deliberate actions to avoid investor control.\n\nMore than 67 per cent of proxy votes were directed against the re-election of Lloyd, and the board lost a $US1 million ($1.52 million) pay rise they were seeking at the annual meeting in Dublin on Thursday morning.\n\nAnne Lloyd (left) was appointed chairwoman of James Hardie in late 2022, the year Aaron Erter (right) took over as CEO. Credit:\n\n“It appears that Rada Rodriguez, PJ Davis and I have not secured sufficient support to be re-elected, and if this position remains on final tabulation, we will each retire automatically at the conclusion of the AGM,” Lloyd told the meeting.\n\n“PJ Davis, Rada Rodriguez and I are honoured to have served on the James Hardie board. We have always acted in the long-term interest of all James Hardie stakeholders, shareholders, employees and customers alike.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Matt Golding",
        "publish_date": "Thu, 30 Oct 2025 12:18:38 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/the-rockpool-team-s-new-restaurant-serves-just-one-main-dish-steak-frites-20251030-p5n6hg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Rockpool team’s new restaurant serves just one main dish: steak frites",
        "publish_date": "Thu, 30 Oct 2025 12:12:19 +1100",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nThe only other items on the 7 Alfred menu are a side salad, and one dessert.\n\n1 / 5 Steak frites (steak and fries) with peppercorn sauce. Steven Woodburn 2 / 5 The upstairs bar at 7 Alfred. Kristoffer Paulsen 3 / 5 Chimichurri (pictured) is one of four sauce choices. Steven Woodburn 4 / 5 Inside 7 Alfred Melbourne. Kristoffer Paulsen 5 / 5 The steakhouse is housed in the building that was formerly home to the iconic Mietta’s restaurant, and later, Stokehouse City. Kristoffer Paulsen Previous Slide Next Slide\n\nSteakhouse$$$$\n\n7 Alfred is Melbourne’s first restaurant serving only steak frites as a main course – and only one side salad and one dessert. It comes to Alfred Place in the CBD after Hunter St. Hospitality – the group behind Rockpool Bar & Grill, Spice Temple, Sake and more –launched a Sydney version of the dining concept in July.\n\nNamed for its street address, the formula will be identical to that in Sydney: one main, one side and one dessert. The piece de resistance is steak and fries – the French bistro classic. The star at 7 Alfred is a 220-gram grass-fed scotch fillet with a marble score of two, sourced from Gippsland producer O’Connor and served with a sauce, and fries cooked in beef tallow, for $48.\n\nBut there are still a couple of choices to make. Medium or well done? And which sauce: chimichurri, peppercorn, veal jus or umami butter? The menu’s only extras are an $8 side salad, made with seasonal Victorian leafy greens, and a $12 New York-style cheesecake served with a scoop of vanilla ice-cream.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Simon Letch",
        "publish_date": "Thu, 30 Oct 2025 12:08:33 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Simon Letch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/bring-back-the-biff-what-popovic-can-t-fathom-about-the-modern-socceroos-20251028-p5n5yi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bring back the biff: What Popovic ‘can’t fathom’ about the modern Socceroos",
        "publish_date": "Thu, 30 Oct 2025 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "If anything, he’s disappointed that it took these Socceroos so long to show that side of themselves. Despite wins over Japan and Saudi Arabia in World Cup qualification, and in the two-match Soccer Ashes series against New Zealand, Popovic came away a little disappointed, feeling that they were missing what he described as a quintessentially Australian characteristic. Christian Pulisic was injured against the Socceroos. Credit: AP “We actually lacked what we’ve always had as a nation in football, and even in all codes: that we are tough, we are resilient, we are hard to beat, we are hard to play against,” he said. “We’ve tried to develop football, to play better football. But we can’t forget what makes us, what’s our DNA. And I think we’ve gone away from that. I thought the first game against New Zealand, to an extent, we almost got bullied in the game. And I can’t fathom that, how that can happen with Australians.”\n\nPopovic doesn’t want them to play recklessly, but believes a more hard-nosed approach can actually enhance those other, newer qualities. “We’re here to win, and we shouldn’t forget that side of us,” he said. Jordan Bos takes on two Americans. Credit: Getty Images “You can see through the whole country, from grassroots all the way through, we’re trying to develop a better style of play – but we can’t forget that. Because if you look at all the best teams in the world, when they lose a game, the coach will come out and say: ‘We didn’t win our duels, we didn’t win our second balls, so we couldn’t maintain momentum, or we couldn’t maintain the pressure. We’re too soft.’ “Really, it should be expected that we do that. So from now on, I expect to see that.”\n\nMore than a year on from assuming the role, Popovic has settled into it beautifully. As he held court in an hour-long press conference this week, there was no evasiveness and no defensiveness. He answered every question directly and expansively, covering off a range of topics: himself, the mistakes he’s made, Australia’s broader talent pool and their connection with mainstream audiences, his ambitions for the team and belief in it, what he wants to see from younger players, the structural factors in the domestic game that are holding them back, and his definition of leadership. ‘If they want to play at a World Cup ... their level needs to be the highest they’ve ever had. Any shorter than that will leave you out.’ Tony Popovic OK, maybe there was a bit of evasiveness when he was asked about his future, since his contract expires at the end of the World Cup – but even as he predictably described it as a bridge he’d cross when he comes to it, he also said he felt it was his “duty” to plan as if he would be there beyond that, to prepare for the 2027 Asian Cup and the next World Cup cycle. And you could tell how seriously he takes that duty. In his embrace of the pressure of the role, the gravitas with which he carries himself, and the magnitude of his vision, Popovic is Postecoglou-esque.\n\n“It’s not a burden for me,” Popovic said. “I don’t carry extra weight because I’m the Socceroos coach. I carry joy, and it’s a pleasure, and there’s nothing difficult about it for me. There are challenges, but there are challenges in every job. “I love this job. I’m honoured. I love the responsibility.” On the matter of his World Cup squad and the jostling for positions in it, Popovic is keeping an open mind, staying alive to the possibility that someone could come from the clouds and unseat an established star. Whoever makes the cut will know exactly what is expected of them: everything.\n\n“The key is that if they want to play at a World Cup, they have to understand that their level needs to be the highest they’ve ever had,” he said. “Any shorter than that will leave you out of the World Cup.” Loading His dream, he said, was for the Socceroos to be consistently mixing it with the world’s best. To no longer be considered underdogs. And he doesn’t want to wait until he’s an old man sitting on his couch to see it. “I keep saying it to the group: one day, Australia will go very far in the World Cup. Why not this group?” Popovic said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/direction-unknown-a-divided-fed-is-driving-in-the-fog-20251030-p5n6ev.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Direction unknown: A divided Fed is ‘driving in the fog’",
        "publish_date": "Thu, 30 Oct 2025 11:58:11 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Without data on inflation and unemployment – the two key metrics the Fed needs to manage with its dual mandate of maximising employment while maintaining stable prices – its policymakers are flying blind, which Powell conceded might influence the outcome of the December meeting. Loading “What do you do if you’re driving in the fog? You slow down,” he said. “I’m not committing to that. I’m just saying it’s certainly a possibility that you would say ‘we really can’t see. So let’s slow down’.” Even leaving aside the impact of the dearth of data for an institution that prides itself on being data-driven, there would be no certainty of a December cut.\n\nThe decision to trim the federal funds rate by 25 basis points, the second rate cut this year, wasn’t unanimous. Trump’s man inside the Fed, Stephen Miran, who may be warming the seat for Trump’s nominee to succeed Powell when he is scheduled to retire next May, voted for a 50-basis-point cut for the second time in the two meetings he has attended. Kansas City Fed president Jeffrey Schmid voted for no change, and Powell indicated there were others who would like the Fed to move cautiously. “For some part of the committee, it’s time to maybe take a step back and see whether there really are downside risks to the labour market, or see whether in fact, the stronger growth that we’re seeing is real,” he said. ‘A further reduction in the policy rate at the December meeting is not a foregone conclusion. Far from it.’ Fed chair Jerome Powell Complicating the Fed’s task is that, while America’s unemployment rate was rising (despite Trump’s draconian immigration policies that are shrinking the pool of available labour) before the shutdown’s data blackout, so is inflation, as the impact of his tariffs slowly bleeds through into prices that, since mid-year, have been steadily edging up with each release of the inflation data.\n\nA slew of big job cuts in recent days from companies such as Amazon, UPS, General Motors, Intel, Nestle, Target and ConocoPhillips isn’t going to help the jobs market, while the rundown of pre-tariff inventories should be almost exhausted and the impact of the tariffs on inflation should become progressively clearer. The government shutdown will also have an impact on the economy, with hundreds of thousands of government employees stood down without pay and the administration withholding funds from some programs where Congress had previously approved funding. Loading The Congressional Budget Office said this week that the shutdown could cost the US economy up to $US14 billion ($21 billion) and lower December quarter GDP by one or two percentage points. While some of those impacts will be reversed when government reopens, the longer the shutdown lasts the more permanent the losses will be. Those are the key elements that created the fog Powell referred to, but there are also the massive investments pouring into artificial intelligence that are propping up US growth while disguising what’s happening in the rest of the economy, where there’s an element of bifurcation: AI companies and wealthier households exposed to the sharemarket and favoured by the tax cuts within Trump’s One Big Beautiful Bill seem to be prospering, but lower-income households are experiencing increasing stress.\n\nThe levels of stress and the complexity of the settings that the Fed, which doesn’t have the tools to target different demographic groups, finds itself in will mount further as new health insurance premiums take effect from this weekend, with big price hikes as a result of the One Big Beautiful Bill’s cuts to healthcare funding – unless the Democrats force changes as the quid pro quo for ending the shutdown. Recent disharmony within the Fed, which has long tended to produce unanimous voting outcomes, adds another layer of uncertainty. It became evident at its September meeting that, leaving aside Miran’s obvious interest in advocating for the bigger rate cuts that Trump has consistently demanded, an unusual divergence of views has developed within the 19-member open market committee. At that meeting, about half the members (excluding Miran) expected two more 25-basis-point rate cuts this year, two expected only one and seven expected none. The hawkish tone Powell adopted when talking about the prospect of a rate cut in December suggests the size of the faction arguing for no further cuts this year might have swollen, which would displease Trump.\n\nIf, as foreshadowed, Treasury Secretary Scott Bessent hands to Trump the name of his recommended nominee to succeed Powell late next month, there will also be a larger political dimension to the Fed’s decision-making. Those on the shortlist – current Fed governors Christopher Waller and Michelle Bowman, the director of the White House economic council Kevin Hassett, former Fed governor Kevin Warsh and BlackRock executive Rick Rieder – would effectively become the shadow chair, with the capacity to distract and confuse as financial market participants try to determine what the Fed’s policies will look like next year. The key criteria Trump wants from Powell’s successor is a commitment to significantly lowering US rates, almost regardless of the economic circumstances. This week’s rate cut was the primary focus for financial markets, but the Fed also announced the end, from December 1, of its quantitative-tightening program, which allowed Treasury and mortgage-backed securities it had bought to boost liquidity and lower rates during the pandemic to mature without reinvesting the proceeds.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-wall-street-higher-as-fed-cuts-nvidia-starts-us5-trillion-club-20251030-p5n6dk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX retreats amid rate resignation; Retailers decline, miners gain",
        "publish_date": "Thu, 30 Oct 2025 11:47:53 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket has opened lower again, with retailers and tech companies declining as investors gave up hopes of further interest cuts this year after Wednesday’s shock inflation data.\n\nThe S&P/ASX 200 dropped 20.9 points, or 0.2 per cent, to 8905.30 as of 11.18am AEDT, extending the week’s losses after the local bourse fell 1 per cent on Wednesday. Eight of the market’s 11 industry sectors were in the red, with banks, energy stocks and the mining heavyweights the notable exceptions. The Australian dollar slid and was fetching US65.71¢ at 10.31am AEDT.\n\nThe ASX opened to its third morning of declines. Credit: Louie Douvis\n\nChances of an interest rate cut by Christmas have all but disappeared after inflation jumped to its highest level in more than a year with signs that price pressures are broadening across the entire economy. The Australian Bureau of Statistics revealed on Wednesday that inflation jumped by 1.3 per cent in the September quarter, taking the annual rate to 3.2 per cent.\n\n“It pretty much eradicates almost any chance of a rate cut before the end of the year, it would take something extraordinary to see it now,” said Capital.com market analyst Kyle Rodda.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/former-lion-says-bodybuilding-passion-gym-supplements-behind-positive-test-20251030-p5n6hl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Former Lion says bodybuilding passion, gym supplements behind positive test",
        "publish_date": "Thu, 30 Oct 2025 11:36:02 +1100",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Banned former Brisbane Lions midfielder Rhys Mathieson has taken responsibility for the positive test that cost him a three-year suspension from football, in his first public comments.\n\nBut speaking on the Rip Through It podcast with ex-teammate Mitch Robinson, the 28-year-old – who last played for the Lions in the 2022 preliminary final – said anyone who thought he did it to increase his football performance was off the mark.\n\nRhys Mathieson playing footy in 2024. Credit: Instagram\n\nMathieson’s anti-doping sanction, which the AFL confirmed in a statement on Thursday, was reduced from the maximum four years after extensive meetings, and in part because of his admission of guilt after he was tested on August 10 last year.\n\nAn in-competition sample while he was playing for Wilston-Grange in the QAFL detected the presence of banned steroid Oxymetholone in his system.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/dozens-dead-thousands-homeless-after-hurricane-melissa-batters-caribbean/sfpek691k",
        "title": "Dozens dead, thousands homeless after Hurricane Melissa batters Caribbean",
        "publish_date": "Thu, 30 Oct 2025 01:26:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nHurricane Melissa first made landfall as a Category 5 storm with sustained winds of around 295 kilometres per hour, the strongest ever recorded on the island of Jamaica.\n\n\n\n\n\nThe storm brought catastrophic flooding, storm surge, and landslides.\n\n\n\n\n\nGabrielle, a 31-year-old from the Catherine Hall neighbourhood of Montego Bay, recalls her horror in the midst of the hurricane.\n\n\n\n\n\n\"Yesterday was horrible, horrific, terrifying, the worst day of my entire life, the worst experience of my entire life. To see my place being flooded out, it was terrifying for me and my child. The water level reached me to my waist. I was stuck in my house. They had to break into my home to save me.\"\n\n\n\n\n\nInfrastructure collapsed in parishes like St Elizabeth, and roughly 77 per cent of electricity customers were left without power.\n\n\n\n\n\nThe National Works Agency says bridges and roads across the southern coast remain impassable, while emergency crews are struggling to reach isolated communities.\n\n\n\n\n\nThirty-three-year-old Sasha Hamilton says her home was flooded.\n\n\n\n\n\n\"Yesterday was absolutely catastrophic and life-threatening. We were totally inundated. The entire ground floors of all the houses in Catherine Hall and West Green have been flooded. Major asset loss to vehicles, furniture. We had to do rescue. Right now I have three children in my home that we rescued. We had to give them shelter, food and clothing and everything. And we had to rescue like people and stuff like that. And we are literally desperate for some help at this point.\"\n\n\n\n\n\nJamaica’s Prime Minister Andrew Holness has declared a state of emergency in several parishes, describing the storm as the most powerful natural disaster in living memory.\n\n\n\n\n\nHe says the Jamaica Defence Force has been deployed to assist with rescue and recovery.\n\n\n\n\n\nMeteorologists say Melissa’s explosive strength was driven by unusually warm Caribbean waters and slow movement, which allowed it to gather energy over several days, a pattern increasingly linked to climate change.\n\n\n\n\n\nBut it wasn't done yet - after ravaging Jamaica, Melissa struck eastern Cuba, but by then it had weakened to a Category 3 storm, with sustained winds of about 195 kilometres per hour.\n\n\n\n\n\nStill, Cuban authorities have reported at least 735,000 people were evacuated from vulnerable areas ahead of landfall.\n\n\n\n\n\nSantiago de Cuba resident Mario Arias says residents are surveying the wreckage, which includes fallen trees, power lines down, and roofs torn apart.\n\n\n\n\n\n\"We were very shocked and apprehensive, but it passed. There was a lot of wind, a lot of rain, this area was flooded - where you see now, the water reached almost knee-high. But the structures held up well because we prepared with plenty of time.\"\n\n\n\n\n\nAntonio Correso’s home also suffered severe damage.\n\n\n\n\n\n\"The impact was brutal. First, there was a strange calm, then suddenly it roared like a wild beast. I had to run for cover, there was nothing I could do. The roof was completely torn off, even though it was well-secured.\"\n\n\n\n\n\nThe storm’s trajectory is now pushing toward the Bahamas and possibly Bermuda, though forecasters at the US National Hurricane Center expect further weakening.\n\n\n\n\n\nThey're warning of life-threatening flash floods and landslides, especially in mountainous terrain.\n\n\n\n\n\nBut at least 27 people are already confirmed dead across Jamaica, Haiti, and Cuba, with early estimates suggesting hundreds of millions of dollars in damage.\n\n\n\n\n\nThe UN's Resident Coordinator in Jamaica, Dennis Zulu, says the cleanup will be extensive.\n\n\n\n\n\n\"From what we know thus far, there's been tremendous unprecedented devastation of infrastructure, of property, roads, network, connectivity, energy has been lost across its path. What we are seeing in preliminary assessments is a country that's been devastated to levels never seen before.\"\n\n\n\n\n\nAs the Caribbean counts its losses, airports remain closed, telecommunications patchy, and recovery efforts hampered by flooding.\n\n\n\n\n\nThe Atlantic hurricane season still has weeks to run, and forecasters warn Melissa may not be the last major storm this year.\n\n\n\n\n\nMeanwhile, Dennis Zulu says relief efforts are already being mobilised from hubs in Barbados and Trinidad and Tobago, with assistance from the World Food Programme, UNICEF, and CARICOM [[Caribbean Community]] states.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/new-environment-laws-due-to-be-introduced-parliament-midday-news-bulletin-30-october-2025/doflhc4fa",
        "title": "New environment laws due to be introduced into parliament |Midday News Bulletin 30 October 2025",
        "publish_date": "Thu, 30 Oct 2025 01:18:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nNew environment laws due to be introduced into parliament as the government looks for support\n\nBodies line the streets in Rio de Janeiro ahead of climate talks ...\n\nAustralia and India left disappointed by Twenty20 wash out.\n\nThe federal government has tabled its long-awaited overhaul of Australia's national environment laws - giving us the first full view of the fifteen-hundred page bill.\n\n\n\n\n\nWith Environment Minister Murray Watt speaking at the National Press Club today, the legislation was introduced by Home Affairs Minister Tony Burke.\n\n\n\n\n\n\"The truth is, our environment laws are broken. they're not working for the environment, for business, for the economy or for the community. that was a clear assessment delivered by Professor Graham Samuel when he handed down his independent review of the Environment Protection and Biodiversity Conservation Act.\"\n\n\n\n\n\nHe said the reforms are clearly in the national interest and framed criticism of the bill as political posturing by Labor's opponents.\n\n\n\n\n\nThere has been strong and widespread criticism of the government's environment law reform bill, which is expected to be the subject of a short Senate inquiry once it passes the lower house.\n\n\n\n\n\nThe Greens say the laws don't do enough to protect threatened species, while the Coalition says business is being put at risk by provisions outlining unacceptable impacts on the environment.\n\n\n\n\n\nLand councils in the Northern Territory have also expressed concerns at a lack of consultation with Aboriginal people.\n\n\n\n\n\nAustralian Conservation Foundation acting CEO Paul Sinclair says there are significant loopholes.\n\n\n\n\n\n\"As they stand, these bills fail nature and the jobs that depend on it. About half the Australian economy, about nine hundred billion dollars a year, is directly dependent upon nature. A strong nature law creates a strong Australia. These laws need to be strengthened to end deforestation. As they stand these laws have too many loopholes.\"\n\n\n\n\n\nThe opposition says the powers provided to a new environmental protection agency proposed by the government would be too wide-ranging and risk hurting business and productivity.\n\n\n\n\n\nShadow Environment Minister Angie Bell says the minister's discretionary powers would be hollowed out by the new statutory body, and the bill is unworkable as it stands.\n\n\n\n\n\nThe bill needs support in the Senate, either through the Coalition or Greens, but Ms Bell told the ABC there are limits to how much the opposition will compromise.\n\n\n\n\n\nAlbanese has arrived in South Korea's capital Seoul for the annual summit of the Asia-Pacific Economic Cooperation forum [[APEC]].\n\n\n\n\n\nMr Albanese has also visited war graves in Seoul, commemorating the deaths of 281 Australians in the Korean War while paying his respects to the roughly 17,000 Australian men and women who fought.\n\n\n\n\n\nHe says he will do his best to advance Australia's national interests by establishing stronger ties with APEC nations.\n\n\n\n\n\n\"One in four Australian jobs depends upon trade and 75 per cent of Australia's trade is with APEC Nations. This is the fastest growing region of the world in human history and this week will be an opportunity for me to advance Australia's national interests.\"\n\n\n\n\n\nPolice in Rio de Janeiro have defended a series of raids targeting drug trafficking in the city's poor neighbourhoods, which the state's public defender's office says killed at least 132 people.\n\n\n\n\n\nBrazilian President Luiz Inacio Lula da Silva is travelling to Rio, and has expressed shock at the death toll, with federal authorities saying they weren't fully informed of scale of the police operation.\n\n\n\n\n\nImages of corpses lining the streets have led to questions about police conduct, prompting this response from Rio de Janeiro's Secretary of Public Security, Felipe Curi.\n\n\n\n\n\n“What we did yesterday was a legitimate action by the state to enforce court orders, 180 search and seizure warrants, and about 100 arrest warrants. Those who chose to confront us were neutralised. The police's reaction depends on the criminal's actions. It's that simple. I also want to address those who have labelled or attempted to label this operation as a massacre in a malicious way. A massacre is the indiscriminate, illegal killing of several people at the same time, in a random manner.”\n\n\n\n\n\nIndia have been left frustrated after rain washed out the Twenty20 series opener against Australia at a cold and dreary Manuka Oval in Canberra on Wednesday night.\n\n\n\n\n\nThe visitors had started strongly, surging to 1-97 off 9.4 overs, when the heavens opened - denying a sold-out crowd the sight of fast bowling superstar Jasprit Bumrah.\n\n\n\n\n\nDespite winning the three-match one-day international series between the two sides 2-1, Australia will face a tough fight for victory in the remaining four matches against the reigning T20 world champions.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/deeply-cynical-politicking-health-minister-rejects-conflation-of-stillbirths-and-late-term-abortions/hybmork9f",
        "title": "Butler hits out at Coalition's 'cynical' late-term abortion claims in parental leave clash",
        "publish_date": "Wed, 29 Oct 2025 23:08:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Health Minister Mark Butler has condemned attempts by several backbench Coalition MPs to \"conflate\" stillbirths and late-term abortions in the context of proposed leave entitlements, as amounting to \"deeply cynical politicking\".\n\n\n\n\n\nAndrew Hastie, Tony Pasin, Henry Pike and Barnaby Joyce all used speeches in the federation chamber of parliament on Wednesday to suggest new laws ensuring women who experience a stillbirth or neonatal death will retain access to maternity leave could have \"unintended consequences\".\n\n\n\n\n\n'Baby Priya's Bill' was spurred by the case of a mother, who, after informing her employer of 11 years that her infant daughter Priya had died at just 42 days old, was faced with negotiating a return-to-work timeline she hadn't planned for — while simultaneously grieving her loss.\n\n\n\n\n\nIt introduces a new principle into the Fair Work Act that employer-funded paid parental leave must not be cancelled because a child is stillborn or dies, attracting bipartisan commitment before the last election.\n\n\n\nLISTEN TO New workplace laws aim to remove extra pain burden on parents arising from stillbirth SBS News 04:34 English\n\nEmployment Minister Amanda Rishworth said its purpose is to \"ensure there is greater clarity regarding employer-funded paid parental leave for parents dealing with the tragedy of stillbirth or the death of a child\" and give \"certainty to grieving parents at the most difficult time of their life\".\n\n\n\n\n\nIn 2022, more than 3,000 families lost a child to stillbirth or within the first 28 days of their birth, according to data by the Australian Institute of Health and Welfare released in July.\n\n\n\n\n\nHastie affirmed the \"intent\" of the bill in principle, but said he felt it necessary to question its potential \"unintended consequences\" — a claim also made against the Stillborn Baby Payment.\n\n\n\n\n\n\"This place is a place where we can come, and we can express views according to conscience. And it's no secret that I'm opposed to late-term abortions,\" he said.\n\n\n\n\n\n\"I think it's a noble and good thing and Baby Priya's Bill deserves our support for that reason … I note the sensitivity around this, but I do call upon the government to clarify that it does not apply to late-term abortions.\"\n\n\n\n\n\nPasin, as well as estranged Nationals backbencher Joyce , also expressed concern over its scope.\n\n\n\n\n\n\"It should be available to people who wish to be parents, but for the grace of God, have not become parents through that incident or outcome,\" Pasin said.\n\n\n\nREAD MORE Could abortion rights ever be reversed in Australia like in the US?\n\nJoyce said: \"The day after a child is born, no matter what medical conditions or impairments that may be there, you have no right to interfere in their life. And therefore, the day before, we believe, is the same.\"\n\n\n\n\n\nBut Butler has rejected the conflations, defending the definitions in the bill as \"very clear\" and noting a termination is \"very different\" to a stillbirth or neonatal death that occurs as a result of a \"natural spontaneous event\".\n\n\n\n\n\n\"To try to conflate the two things is, I think, a very cynical, deeply distressing political exercise,\" he told ABC's Afternoon Briefing on Wednesday.\n\n\n\n\n\n\"The men who are doing this — and they're all men — know the difference between stillbirth and abortion.\"\n\n\n\nREAD MORE The $920m plan for extra paid leave that could save Australia billions a year\n\n\"How often, when we're talking about constraining women's rights, constraining women's support through these incredibly important and at times distressing events in their life, it's men leading the charge? I haven't heard a Coalition woman go into the chamber and make these arguments,\" Butler said.\n\n\n\n\n\nLiberal senator Jane Hume said she hadn't heard her colleagues' contributions delivered in the chamber, but cautioned against the debate being turned into \"a political football\".\n\n\n\n\n\nAn Opposition spokesperson told SBS News that while \"members of the Liberal and National parties have always had the right to express a view ... the Coalition has agreed to the passage of this bill\".\n\n\n\n\n\n\"The bill has gone through its usual processes and had strong support from the party room.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/cost-of-raising-children-in-australia/u83g69rcz",
        "title": "How much does it really cost to raise a child in Australia? Here are the numbers",
        "publish_date": "Wed, 29 Oct 2025 19:02:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians are having fewer children than ever. At 1.5 babies per woman, the fertility rate is at a record low. Many attribute this to the cost of having and raising children.\n\n\n\n\n\nIf this is true, it raises questions of intergenerational fairness and future planning for governments. What do we do about the young would-be parents who are opting out because it’s simply too expensive?\n\n\n\n\n\nThe problem with this assumption is that while it may feel true that childbearing must have become more expensive over the decades, it’s not that simple.\n\n\n\n\n\nSo what do parents have to fork out to raise children, how do we measure it, and are kids really that much more expensive now than they used to be?\n\n\n\nCrunching the numbers\n\nCalculating the cost of raising kids is a complicated beast that raises many questions for academics to consider. Is a second child less expensive than a first child? Are older children more expensive than younger children? Do higher income families spend more on children than lower income families, and what share of that spending is necessary compared to discretionary?\n\n\n\n\n\nThese are debates in the literature for which there aren’t necessarily clear answers, in spite of much research.\n\n\n\n\n\nResearchers also contest whether we should talk about just the direct cost, or if we should also consider the indirect costs, such as the impact on hours in paid work or the loss of leisure time for busy parents. We focus here and in our paper for the Economic Inclusion Advisory Committee on the direct costs.\n\n\n\nAustralia's fertility rates have been on a downward trajectory over time. Source: SBS News One way, and probably the more intuitive, is the “budget standards” approach. This puts a value on the cost of a basket of goods and services for a family with and without children. The difference is the cost of children.\n\n\n\n\n\nThis seems simple, until it’s not. For example, do you need a fourth bedroom for a third child? Do you need a bigger car? A larger fridge? Private or public school? Childcare or at home care? What about hand-me-down clothes and toys?\n\n\n\n\n\nAnother approach, which is our focus, is a survey-based statistical method (or “iso-welfare” in technical terms) comparing living standards of different households. We ask how much more income (or spending) is required to ensure the same living standard between a family with children and a family without children.\n\n\n\nLiving standards are measured by what share of total household income or expenditure is spent on basic items, such as food or utilities.\n\n\n\n\n\nThe logic here is that a family that spends a lower share (on average) on basic goods has a higher standard of living than a family that spends a higher share on basic goods.\n\n\n\n\n\nThe latest high quality survey on expenditure in Australia is now ten years old, so in our latest research we’ve taken a new approach. We use financial stress as a measure of living standards instead.\n\n\n\nUsing Housing Income and Labour Dynamics in Australia (HILDA) data, we model financial stress against income and a range of other household variables and estimate how much extra disposable income a family with children needs to maintain the same living standard as a couple without children. That extra income is considered the cost of children.\n\n\n\n\n\nWhile there are many advantages to using this method, a major drawback is that it doesn’t give you an estimate for how much a family needs to spend, rather how much they do spend. Families may well spend more than what they strictly need to.\n\n\n\nSo, how much do families spend on children?\n\nWe estimate families spend about 13 per cent of their disposable income on the first child and a further ten percentage points for each child after that.\n\n\n\n\n\nFor a working-age couple earning the typical after-tax income (around $130,000 per year), that equates to about $17,000 per year for the first child and around $13,000 per year for each subsequent child.\n\n\n\n\n\nThat means to raise the eldest child to adulthood, the couple would spend about $300,000 over 18 years in today’s dollars. Subsequent children would be about $230,000 each.\n\n\n\n\n\nLower income families spend a higher share of their income on children, at around 17 per cent for the first child and 13 per cent for subsequent children. But these households spend a lower absolute amount on children.\n\n\n\nDoes age of the child change the cost? There is uncertainty around this, but our latest research indicates younger children and older children are moderately more expensive than middle aged (six to 12) children.\n\n\n\n\n\nThis finding contrasts with previous research and conventional wisdom that older children are the most expensive.\n\n\n\n\n\nThese estimates are not set in stone. There are different ways to estimate such numbers and they can differ depending on what definitions you adopt and methods you use to analyse the data.\n\n\n\nOk, do kids cost more now?\n\nThe HILDA dataset has been gathered over many years, so we can compare the cost of children through time, albeit not perfectly.\n\n\n\n\n\nSingle year samples are relatively small and subject to error, but that analysis suggests not a lot has changed with the cost of children since 2001.\n\n\n\n\n\nOur research doesn’t provide clues as to why fertility rates in Australia have dropped (as they have in most developed nations). Other data such as Australian Bureau of Statistics income survey and financial stress data suggest real incomes for couples with children have increased over the longer term (although not by much, if at all, in recent years).\n\n\n\nThe lack of evidence here likely points to other factors driving lower fertility rates. Families may be delaying having children to focus on other pursuits, such as employment or education. It’s also more acceptable for couples, and women in particular, to choose to not have children.\n\n\n\n\n\nAnother possible reason is people could be being deterred by the perception of higher costs, instead of the actual cost. Or perhaps people simply want to spend their money elsewhere.\n\n\n\n\n\nCalculating the cost of children is complex and imprecise, but it’s fair to say the evidence doesn’t show that the direct cost of kids is getting more expensive over time. Younger generations not having kids, or fewer kids, is likely related to many factors, but we can’t draw affordability down generational lines.\n\n\n\n\n\nBen Phillips is an associate professor at POLIS@ANU Centre for social policy research at Australian National University. Phillips through his role at the ANU provides consulting services on a range of areas in economic and social policy and has recently published work on a consulting basis for the Economic Inclusion Advisory Committee on the cost of children.\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/labor-faces-a-christmas-crossroads-over-its-environment-laws-reboot/2ycih0y6a",
        "title": "Labor faces a Christmas crossroads over its environment laws reboot",
        "publish_date": "Wed, 29 Oct 2025 18:34:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Labor is determined to deliver the largest reform to Australia's environmental laws in 26 years by Christmas, in the key test for Environment Minister Murray Watt.\n\n\n\n\n\nThe federal government is anticipating that the tranche of reforms, to be tabled in parliament on Thursday morning, will be sent to a Senate inquiry.\n\n\n\n\n\nHowever, it remains confident it can reach its Christmas deadline by striking a deal with the Coalition or the Greens, both of which remain viable options as discussions continue.\n\n\n\n\n\nWatt says suggestions on how to change the laws have been circulating parliament for five years, following a review by Graeme Samuel in 2020, since which \"we've seen our environment go backwards\".\n\n\n\n\"If we can't get a deal by Christmas, then I think that will be a real indictment on the Coalition and the Greens,\" he told SBS News, although he did not elaborate on what the government might do if it fails to pass them by then.\n\n\n\n\n\n\"It will be another demonstration that they haven't heard the message from the last election, which was that people wanted to see parties working together to produce outcomes rather than blocking progress.\"\n\n\n\n\n\nThe government estimates the reforms could inject up to $7 billion into the economy, according to analysis by the Department of Climate Change, Energy, the Environment and Water of Australia.\n\n\n\n\n\nHere's what we know about the laws and the key concerns around them.\n\n\n\nWhat's inside Labor's environment laws 2.0?\n\nIt's Labor's second attempt at reforming the Environment Protection and Biodiversity Conservation Act, after Watt's predecessor, Tanya Plibersek, failed to strike a deal last term.\n\n\n\n\n\nLabor says the overhaul, split into seven bills, will largely follow recommendations from the Samuel Review, tabled by then-environment minister and current Opposition leader Sussan Ley.\n\n\n\n\n\nThe introduction of national environmental standards will give clear parameters about what needs to be done to protect nature and receive project approval.\n\n\n\n\n\nThe proposed changes include an \"unacceptable impact\" test for high-polluting projects, requiring companies to disclose expected emissions and set up carbon abatement plans.\n\n\n\n\n\nThere will be stiffer penalties for environmental regulatory violations, including fines of up to $825 million.\n\n\n\nThe government says the reforms will create more efficient assessments, cutting down approval times from decades to years, years to months.\n\n\n\n\n\nThis is partially due to the new system of accreditation, where bilateral agreements will be struck with states and territories, allowing them the capacity to make assessments under the new national standards.\n\n\n\n\n\nSlow approval times for projects, including the duplication of processes across state and federal governments, have been partially blamed for holding up renewable energy projects as well as the mining of minerals that will allow Australia to compete with China.\n\n\n\n\n\nThe government plans to establish the nation's first-ever National Environmental Protection Agency (NEPA), tasked with ensuring compliance under the proposed new laws and greater accountability.\n\n\n\nThe environment minister will have the power to reject project developments if they are deemed to do serious damage to nature or push through projects in \"the national interest\".\n\n\n\n\n\nThere will be a 28-day time limit to challenge the minister's decision, during which work can continue.\n\n\n\n\n\nLabor has also committed to providing standards for engaging with First Nations people, ensuring they are consulted early on.\n\n\n\n\n\nThe government's only red line so far is a climate trigger proposed by the Greens, with the reforms instead opting to require an emissions disclosure as advised by the Samuel Review.\n\n\n\nWhat are the Coalition and Greens' concerns?\n\nThe Coalition argues that the reforms in their current form are unworkable.\n\n\n\n\n\nThey have raised specific concerns about the NEPA's authority, requesting that its CEO be accountable to the minister.\n\n\n\n\n\nThey are also seeking clarity around the net gain definition, which would require developers to show they've tried to avoid and mitigate impacts on nature before buying offsets.\n\n\n\n\n\nOpposition environment spokesperson Angie Bell is focused on ensuring reforms streamline approvals and give certainty to business, while \"improving environmental protections\".\n\n\n\nMeanwhile, the Greens argue the reforms are catering to big business and creating more loopholes that weaken environmental protections.\n\n\n\n\n\nThey are critical of the environment minister having power to fast-track projects in the national interest, with concerns that it's a loophole for more damaging coal, gas and logging projects.\n\n\n\n\n\nGreens leader Larissa Waters says the party is still open to negotiations with Labor as long as the reforms \"work for nature\", but warns they're \"riddled with loopholes\".\n\n\n\n\n\n\"Rather than fix those loopholes, the proposal by this environment minister under this government is to add additional loopholes and yet more fast-track mechanisms for coal and gas,\" she said.\n\n\n\n\n\nThey've also highlighted that the new laws do not address native forest logging, with deforestation a major driver of species extinction and carbon emissions.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/bureau-of-meteorology-ordered-to-overhaul-website-after-4-million-upgrade-sparks-flurry-of-complaints/3m8ey138c",
        "title": "Bureau of Meteorology ordered to overhaul website after $4 million upgrade sparks flurry of complaints",
        "publish_date": "Wed, 29 Oct 2025 09:40:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Bureau of Meteorology ordered to overhaul website after $4 million upgrade sparks flurry of complaints\n\nPublished 29 October 2025, 6:57 am\n\nThe Bureau of Meterology has been ordered to overhaul its website after a major upgrade led to a barrage of complaints during a major storm affecting the country 's east coast. The Bureau has apologised for the stress it has caused and is pledging to make quick improvements.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/coalition-challenges-government-over-inflation-as-treasurer-defends-cost-of-living-record/w6sx1a2xu",
        "title": "Coalition challenges government over inflation as Treasurer defends cost of living record",
        "publish_date": "Wed, 29 Oct 2025 08:57:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Coalition challenges government over inflation as Treasurer defends cost of living record\n\nPublished 29 October 2025, 6:56 am\n\nThe coalition has gone on the attack in question time in the wake of today's hotter than expected inflation data. Treasurer, Jim Chalmers, maintains the federal government has managed to rein in rising costs over time.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/albanese-lands-in-south-korea-for-apec-summit/6xdronq4a",
        "title": "Albanese lands in South Korea for APEC summit",
        "publish_date": "Wed, 29 Oct 2025 08:54:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/australias-new-feline-focused-program-keeping-cats-and-wildlife-safe/usco7fvkm",
        "title": "Australia's new feline focused program keeping cats and wildlife safe",
        "publish_date": "Wed, 29 Oct 2025 08:33:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's new feline focused program keeping cats and wildlife safe\n\nPublished 29 October 2025, 7:37 am\n\nCats are beloved by pet owners around the world. But in Australia they can have a detrimental impact on native wildlife. An educational pilot program is now being expanded with the aim of shifting how Australians care for their feline friends.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-satellite-evidence-reveals-rwanda-level-massacres-in-sudan/aqdyc3tpx",
        "title": "INTERVIEW: Satellite evidence reveals 'Rwanda-level' massacres in Sudan",
        "publish_date": "Wed, 29 Oct 2025 07:48:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/government-housing-affordability-scheme-under-pressure/3b16i6zgj",
        "title": "Government housing affordability scheme under pressure",
        "publish_date": "Wed, 29 Oct 2025 06:39:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAn audit has begun into the design and delivery of the Federal Government's Housing Australia Future Fund also known as H-A-F-F.\n\n\n\n\n\nEstablished in 2023, it's aim was to address Australia's housing crisis by providing funding to boost the supply of social and affordable homes.\n\n\n\n\n\nIt started off with $10 billion and was aiming to build 40,000 social and affordable rental homes over five years.\n\n\n\n\n\nThe fund is under pressure for spending the equivalent of only eight Sydney homes last year.\n\n\n\n\n\nShadow minister for housing and homelessness Andrew Bragg is calling it one of the biggest public policy disasters of his lifetime.\n\n\n\n\n\n\"It is wasting taxpayer funds, it is overpaying for houses, in some cases, it's going to be paying more than $1.3 million per house when the average cost of a house in Australia is about $500,000.\"\n\n\n\n\n\nAuditor-General Caralee McLiesh announced the nine-month audit is underway.\n\n\n\n\n\nThe audit increases pressure on the fund, whose Chair, Carol Austin, resigned this month amid a probe into allegations of bullying.\n\n\n\n\n\nAssistant Treasurer Ben Mulino backs the legislation.\n\n\n\n\n\n\"Australia Future Fund is a well designed scheme that has already seen a very significant number of housing projects approved. I've seen a number of those in my own electorate. I've been at events with the Minister for Housing, where I've seen very substantial developments which will provide homes for people in fantastic areas, social and affordable housing.\"\n\n\n\n\n\nHousing minister Clare O'Neil is blaming the Opposition and the Greens for delaying the fund.\n\n\n\n\n\nShe claims the 55,000 affordable homes were far better than the 373 social and affordable homes built by the Coalition in the last decade.\n\n\n\n\n\n\"The historic package that our government is implementing, is focused primarily on building more homes for Australians. We're doing that by building 55,000 social and affordable homes, something the Greens political party did everything to stop us doing.\"\n\n\n\n\n\n\n\nGreens Senator Barbara Pocock has welcomed the audit, arguing the fund has always been too complex and too slow.\n\n\n\n\n\n\"Why isn't the government investing directly in public and community housing? They should be directly putting their money into public and community housing. It's faster, cheaper, and it worked the last time Australia faced a housing crisis in the post war years. We know we can do it. We've done it before.\"\n\n\n\n\n\n\n\nKristin O'Connell from the Anti-poverty Institute agrees with the sentiment.\n\n\n\n\n\nShe warns, however, that the difference between public, community, and affordable housing may not be clear to people who don't need low-cost accommodation.\n\n\n\n\n\n\"Public housing is something that we used to have a lot of in this country, and lots of different types of people lived in it. It is owned by the government, rented from the government, and you pay rent, no matter who you are, if you live in it, when we look at community housing that is often being run by church organisations. We operation being run by church organisations and other corporate charities that are very large scale and operate in very similar ways to property developers. It's really focused on building up an asset portfolio, you have less security of tenure that means that the community housing landlord has more reasons and more ways they can evict you than your public housing, landlord.\"\n\n\n\n\n\n\n\nShe says the Housing Australia Future Fund is structured to incentivise maximum returns for developers.\n\n\n\n\n\nThis encourages them to build homes with market-tied, \"fake affordable\" rents instead of genuinely affordable, income-tied community housing.\n\n\n\n\n\nFor public housing, Ms. O'Connell believes the fund provides no incentive.\n\n\n\n\n\n\"There are zero incentives for anyone to build public housing, because the whole thing incentivises state governments to sell off and privatise their public housing and replace it with Community Housing instead. So not only are the people who are accessing the fund more likely to try and build things that will get them higher rent, we also have state governments advocating responsibility and public housing tenants across the country losing their homes with the help of the federal Government.\"\n\n\n\n\n\nShe also points out that affordable housing has income caps and is tied to market rents.\n\n\n\n\n\n\"Affordable housing isn't what they call it. It's not affordable if you live in a place like Sydney, where market rent for a one bedroom apartment is $600, your so called affordable housing is going to be $500 for a one bedroom apartment.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/no-more-interest-rate-cuts-inflation-sparks-bank-warning/8mf85t0x9",
        "title": "No more interest rate cuts: Inflation sparks bank warning",
        "publish_date": "Wed, 29 Oct 2025 06:16:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/bureau-of-meteorology-website/vya3xrizg",
        "title": "'Didn't make it lightly': BoM apologises for 'challenges' amid $4.1m website furore",
        "publish_date": "Wed, 29 Oct 2025 00:45:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Bureau of Meteorology (BoM) has responded to the intensifying storm around its $4 million website redesign as pressure for changes continues to mount.\n\n\n\n\n\nThe BoM unveiled its first website revamp in 12 years last week, but it quickly came under fire after savage storms left a trail of destruction across the eastern seaboard.\n\n\n\n\n\nUsers complained the new website did not indicate storm severity after wild weather wreaked havoc across Queensland and Victoria at the weekend.\n\n\n\n\n\nOn Wednesday afternoon, the BoM's acting CEO Peter Stone said he acknowledged community concerns and \"the significance of the change\".\n\n\n\n\n\n\"We didn't make the change lightly and we appreciate that it will take time for some to adjust. I sincerely apologise for the challenges the change has caused,\" he said in a statement.\n\n\n\n\"It's clear we need to do more to help people through the change, both by making adjustments to the website and by helping users to understand its new features,\" Stone said.\n\n\n\n\n\nIt follows Environment Minister Murray Watt's meeting with Stone on Tuesday.\n\n\n\n\n\nWatt said in a statement following that it was clear the new website wasn't meeting community expectations and that he had told the acting CEO needed to consider feedback and \"where appropriate, adjust the website's settings as soon as possible\".\n\n\n\n\n\nWatt has also been under pressure to push for change after Queensland treasurer David Janetzki wrote to him, saying the revamp, just before the start of the main storm season, can, \"at its best, be described as short-sighted\".\n\n\n\n\n\nAnd on Wednesday morning, Nationals leader David Littleproud also said he had written to Watt after he'd received complaints from locals in his regional Queensland electorate of Marnoa.\n\n\n\n\n\nHe said the locals complained the new website was difficult to navigate and lacked key tools, including the ability to enter GPS coordinates for specific property locations.\n\n\n\n\n\n\"As a result, families, business and farmers are unable to access vital localised data such as river heights and rainfall information,\" he said.\n\n\n\n\n\nLittleproud said he had asked Watt \"to review the functionality of the updated BoM website and consider restoring key tools relied upon by farmers and rural communities\".\n\n\n\n\n\nHe suggested BoM's management needed to improve and accused them of running a business model of \"fail and simply ask for more money\", and of poor forecasting that had, at times, caused confusion among farmers.\n\n\n\n\n\n\"They can't even manage to put a simple website together,\" Littleproud told reporters.\n\n\n\nAnthony Cornelius, managing director at forecasting company Weatherwatch, has also been critical. In a post on LinkedIn on Monday, he said there were three major issues users were finding: the new radar underestimated storm intensity, it lagged, and the new design made it difficult to find information when needed.\n\n\n\n\n\n\"It beggars belief that the BoM would roll out such a significant change to an essential infrastructure service just as the main storm season is about to start,\" Cornelius said.\n\n\n\n\n\nIn his statement on Wednesday afternoon, Stone said: \"The safety of Australians is our primary concern.\"\n\n\n\n\n\n\"We want to reiterate that observations, forecasts, warnings and severe weather updates continue to be readily available on our website, the app and our social media channels.\n\n\n\n\n\n\"There has been significant feedback about the radar on the new website. It's important to note that the website radar provides one view of the current weather situation. It is not intended to replicate or replace the Bureau's weather warnings which are created by our expert meteorologists and issued ahead of a severe weather event.\"\n\n\n\n\n\nStone said the BoM welcomed feedback on the new website and was \"moving quickly\" to act on that already received.\n\n\n\n\n\n\"I am confident the community will start to see more improvements in the coming weeks.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/companies/the-wall-street-giant-that-s-twice-as-big-as-our-entire-sharemarket-20251030-p5n6dy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Wall Street giant that’s twice as big as our entire sharemarket",
        "publish_date": "Thu, 30 Oct 2025 13:02:15 +1100",
        "category": "finance",
        "authors": [
            "Elias Visontay"
        ],
        "text": "Nvidia became the first public company to reach a market capitalisation of $US5 trillion ($7.6 trillion) on Wednesday, as the value of the US chipmaker grows to dwarf even the GDP of advanced economies such as India, the United Kingdom and Japan.\n\nThe ravenous appetite for the Silicon Valley company’s chips is the main reason that its share price has increased so rapidly since early 2023, having first reached a company value of $US1 trillion in June of that year. It only reached $US4 trillion four months ago.\n\nHere’s what you need to know about Nvidia’s journey to be one of the world’s most prominent companies, its leather jacket-wearing chief executive, and the eye-watering numbers that illustrate the firm’s meteoric rise.\n\nWhat is Nvidia and what does it do?\n\nFounded in California in 1993, Nvidia is a manufacturer of chipsets known as graphics processing units, or GPUs. It was initially focused on making GPUs for computers and video games, but in recent years, it has become renowned for making the most advanced chips for use in artificial intelligence systems.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/crowded-house-sounded-immaculate-at-charming-deeply-funny-show-20251028-p5n601.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Crowded House sounded immaculate at charming, deeply funny show",
        "publish_date": "Thu, 30 Oct 2025 12:50:03 +1100",
        "category": "entertainment",
        "authors": [
            "Andrew Mcclelland"
        ],
        "text": "MUSIC\n\nCrowded House ★★★★★\n\nPalais Theatre, October 29\n\n“It’s good to be home,” Neil Finn opened on Wednesday night, and damn, it was good to welcome them back. Crowded House are a hit-making machine, yet they’ve somehow dodged the uncool stigma that follows bands like U2 or Coldplay. Maybe it’s because they don’t take themselves too seriously. They’re deeply funny live. The whole vibe was casual and charming, like finding an excellent little pub band, but with immaculate sound, seasoned crew, and a surprisingly large merch spread.\n\nNeil Finn said it was great for Crowded House to be home, much to the joy of the audience at the Palais on Wednesday night. Credit: Richard Clifford\n\nThe first set was acoustic, with the band play-acting as their own support act and renaming themselves “Crispy”. Not the finest band name, but “Crispy” delivered gorgeous versions of Pineapple Head, Four Seasons in One Day, and At the Station, featuring Vika and Linda Bull’s heavenly vocals.\n\nKeeping it playful, Neil debated bassist Nick Seymour about birds. “All Australian birds are loud and sound Australian; New Zealand birds are lovely and less self-confident.” This led to guitarist Liam Finn launching into a patriotic version of The Lord of the Rings theme, ending a timeless bit of stage banter. They also played a great new track, It Was a Small Detail, which deserves to be a hit.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/why-are-two-test-10s-at-one-club-20251030-p5n6j0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why are two Test 10s at one club?",
        "publish_date": "Thu, 30 Oct 2025 12:43:07 +1100",
        "category": "sports",
        "authors": [],
        "text": "Why are two Test 10s at one club?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/theatre/all-the-actors-are-naked-but-that-s-not-the-most-interesting-thing-about-this-play-20251030-p5n6h5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "All the actors are naked – but that’s not the most interesting thing about this play",
        "publish_date": "Thu, 30 Oct 2025 12:42:26 +1100",
        "category": "entertainment",
        "authors": [
            "Lenny Ann Low"
        ],
        "text": "Each night in the three-week run of new Australian play Naturism, cast members strip backstage to perform nude on stage. But that’s not what the play’s about.\n\nWritten by Ang Collins, the 80-minute work, part of Griffin Theatre’s 2025 season, is about climate anxiety. Set in a remote, off-grid bush eco-paradise founded 20 years ago by a group of Baby Boomer naturists, it’s a comedy about generations, humans and nature clashing, sparked by a Gen Z eco-influencer crashing the commune.\n\nFor cast member Fraser Morrison, nudity is his costume. Credit: Steven Siewert\n\nIts genesis came six years ago when Collins and her partner evacuated an area near Noosa in Queensland because of bushfire. The 2019-20 Black Summer bushfires followed and Collins, vividly affected by the fire’s physical proximity and media coverage of the resulting devastation, felt helpless.\n\n“My response to being incredibly anxious about that whole season and feeling powerless as an artist – why wasn’t I an ecologist? Why am I a stupid theatre artist? – was to write a comedy,” she says. “But just writing a play that increases people’s climate anxiety probably wouldn’t help.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-australian-man-pleads-guilty-to-stealing-us-trade-secrets-for-russia-trump-and-xi-set-to-meet-in-south-korea-today-hurricane-melissa-kills-dozens-in-jamaica-haiti-and-cuba-20251030-p5n6dw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Australian man pleads guilty to stealing US trade secrets for Russia; Hurricane Melissa kills dozens in Jamaica, Haiti and Cuba",
        "publish_date": "Thu, 30 Oct 2025 12:39:31 +1100",
        "category": "finance",
        "authors": [
            "Alexander Darling",
            "Emily Kaine"
        ],
        "text": "NSW Premier Chris Minns has launched a high-powered investment summit at the Sydney Opera House and revealed the state’s new Investment Delivery Authority has received 48 major investment proposals worth $136 billion.\n\nThe Citi A50 Sydney Investment Summit draws together global investors along with Australian political leaders and business leaders to promote investment in Sydney and across NSW.\n\nIt follows comparable events staged in the United States and hosted by Australia’s ambassador to the US, Kevin Rudd, who is also at the Sydney event.\n\nNSW Premier Chris Minns. Credit: Dominic Lorrimer\n\nMinns said the $136 billion in “potential deals” received by the Investment Delivery Authority was a sign of confidence in the NSW economy.\n\nBut he acknowledged planning system was often “too cumbersome.” The authority aims to speed the delivery of large-scale commercial projects.\n\n“We want to fast-track investment in Australia’s largest state,” Minns said.\n\nThe first round of submissions received by the authority include 23 projects for data centres and technology valued at $72 billion; 22 projects in renewable energy and energy security valued at $63 billion; and 3 projects for hotels valued at $860 million.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/investors-deliver-a-bloodbath-at-james-hardie-meeting-20251029-p5n68h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bloodbath not over for James Hardie as investors sack their chair",
        "publish_date": "Thu, 30 Oct 2025 12:25:05 +1100",
        "category": "finance",
        "authors": [
            "Colin Kruger"
        ],
        "text": "James Hardie investors have dumped chairwoman Anne Lloyd and two other board members in an unprecedented display of anger over the board’s disastrous $14 billion acquisition of US group Azek and its deliberate actions to avoid investor control.\n\nMore than 67 per cent of proxy votes were directed against the re-election of Lloyd, and the board lost a $US1 million ($1.52 million) pay rise they were seeking at the annual meeting in Dublin on Thursday morning.\n\nAnne Lloyd (left) was appointed chairwoman of James Hardie in late 2022, the year Aaron Erter (right) took over as CEO. Credit:\n\n“It appears that Rada Rodriguez, PJ Davis and I have not secured sufficient support to be re-elected, and if this position remains on final tabulation, we will each retire automatically at the conclusion of the AGM,” Lloyd told the meeting.\n\n“PJ Davis, Rada Rodriguez and I are honoured to have served on the James Hardie board. We have always acted in the long-term interest of all James Hardie stakeholders, shareholders, employees and customers alike.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Matt Golding",
        "publish_date": "Thu, 30 Oct 2025 12:18:38 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/the-rockpool-team-s-new-restaurant-serves-just-one-main-dish-steak-frites-20251030-p5n6hg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Rockpool team’s new restaurant serves just one main dish: steak frites",
        "publish_date": "Thu, 30 Oct 2025 12:12:19 +1100",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nThe only other items on the 7 Alfred menu are a side salad, and one dessert.\n\n1 / 5 Steak frites (steak and fries) with peppercorn sauce. Steven Woodburn 2 / 5 The upstairs bar at 7 Alfred. Kristoffer Paulsen 3 / 5 Chimichurri (pictured) is one of four sauce choices. Steven Woodburn 4 / 5 Inside 7 Alfred Melbourne. Kristoffer Paulsen 5 / 5 The steakhouse is housed in the building that was formerly home to the iconic Mietta’s restaurant, and later, Stokehouse City. Kristoffer Paulsen Previous Slide Next Slide\n\nSteakhouse$$$$\n\n7 Alfred is Melbourne’s first restaurant serving only steak frites as a main course – and only one side salad and one dessert. It comes to Alfred Place in the CBD after Hunter St. Hospitality – the group behind Rockpool Bar & Grill, Spice Temple, Sake and more –launched a Sydney version of the dining concept in July.\n\nNamed for its street address, the formula will be identical to that in Sydney: one main, one side and one dessert. The piece de resistance is steak and fries – the French bistro classic. The star at 7 Alfred is a 220-gram grass-fed scotch fillet with a marble score of two, sourced from Gippsland producer O’Connor and served with a sauce, and fries cooked in beef tallow, for $48.\n\nBut there are still a couple of choices to make. Medium or well done? And which sauce: chimichurri, peppercorn, veal jus or umami butter? The menu’s only extras are an $8 side salad, made with seasonal Victorian leafy greens, and a $12 New York-style cheesecake served with a scoop of vanilla ice-cream.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Simon Letch",
        "publish_date": "Thu, 30 Oct 2025 12:08:33 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Simon Letch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/bring-back-the-biff-what-popovic-can-t-fathom-about-the-modern-socceroos-20251028-p5n5yi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bring back the biff: What Popovic ‘can’t fathom’ about the modern Socceroos",
        "publish_date": "Thu, 30 Oct 2025 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "If anything, he’s disappointed that it took these Socceroos so long to show that side of themselves. Despite wins over Japan and Saudi Arabia in World Cup qualification, and in the two-match Soccer Ashes series against New Zealand, Popovic came away a little disappointed, feeling that they were missing what he described as a quintessentially Australian characteristic. Christian Pulisic was injured against the Socceroos. Credit: AP “We actually lacked what we’ve always had as a nation in football, and even in all codes: that we are tough, we are resilient, we are hard to beat, we are hard to play against,” he said. “We’ve tried to develop football, to play better football. But we can’t forget what makes us, what’s our DNA. And I think we’ve gone away from that. I thought the first game against New Zealand, to an extent, we almost got bullied in the game. And I can’t fathom that, how that can happen with Australians.”\n\nPopovic doesn’t want them to play recklessly, but believes a more hard-nosed approach can actually enhance those other, newer qualities. “We’re here to win, and we shouldn’t forget that side of us,” he said. Jordan Bos takes on two Americans. Credit: Getty Images “You can see through the whole country, from grassroots all the way through, we’re trying to develop a better style of play – but we can’t forget that. Because if you look at all the best teams in the world, when they lose a game, the coach will come out and say: ‘We didn’t win our duels, we didn’t win our second balls, so we couldn’t maintain momentum, or we couldn’t maintain the pressure. We’re too soft.’ “Really, it should be expected that we do that. So from now on, I expect to see that.”\n\nMore than a year on from assuming the role, Popovic has settled into it beautifully. As he held court in an hour-long press conference this week, there was no evasiveness and no defensiveness. He answered every question directly and expansively, covering off a range of topics: himself, the mistakes he’s made, Australia’s broader talent pool and their connection with mainstream audiences, his ambitions for the team and belief in it, what he wants to see from younger players, the structural factors in the domestic game that are holding them back, and his definition of leadership. ‘If they want to play at a World Cup ... their level needs to be the highest they’ve ever had. Any shorter than that will leave you out.’ Tony Popovic OK, maybe there was a bit of evasiveness when he was asked about his future, since his contract expires at the end of the World Cup – but even as he predictably described it as a bridge he’d cross when he comes to it, he also said he felt it was his “duty” to plan as if he would be there beyond that, to prepare for the 2027 Asian Cup and the next World Cup cycle. And you could tell how seriously he takes that duty. In his embrace of the pressure of the role, the gravitas with which he carries himself, and the magnitude of his vision, Popovic is Postecoglou-esque.\n\n“It’s not a burden for me,” Popovic said. “I don’t carry extra weight because I’m the Socceroos coach. I carry joy, and it’s a pleasure, and there’s nothing difficult about it for me. There are challenges, but there are challenges in every job. “I love this job. I’m honoured. I love the responsibility.” On the matter of his World Cup squad and the jostling for positions in it, Popovic is keeping an open mind, staying alive to the possibility that someone could come from the clouds and unseat an established star. Whoever makes the cut will know exactly what is expected of them: everything.\n\n“The key is that if they want to play at a World Cup, they have to understand that their level needs to be the highest they’ve ever had,” he said. “Any shorter than that will leave you out of the World Cup.” Loading His dream, he said, was for the Socceroos to be consistently mixing it with the world’s best. To no longer be considered underdogs. And he doesn’t want to wait until he’s an old man sitting on his couch to see it. “I keep saying it to the group: one day, Australia will go very far in the World Cup. Why not this group?” Popovic said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/direction-unknown-a-divided-fed-is-driving-in-the-fog-20251030-p5n6ev.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Direction unknown: A divided Fed is ‘driving in the fog’",
        "publish_date": "Thu, 30 Oct 2025 11:58:11 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Without data on inflation and unemployment – the two key metrics the Fed needs to manage with its dual mandate of maximising employment while maintaining stable prices – its policymakers are flying blind, which Powell conceded might influence the outcome of the December meeting. Loading “What do you do if you’re driving in the fog? You slow down,” he said. “I’m not committing to that. I’m just saying it’s certainly a possibility that you would say ‘we really can’t see. So let’s slow down’.” Even leaving aside the impact of the dearth of data for an institution that prides itself on being data-driven, there would be no certainty of a December cut.\n\nThe decision to trim the federal funds rate by 25 basis points, the second rate cut this year, wasn’t unanimous. Trump’s man inside the Fed, Stephen Miran, who may be warming the seat for Trump’s nominee to succeed Powell when he is scheduled to retire next May, voted for a 50-basis-point cut for the second time in the two meetings he has attended. Kansas City Fed president Jeffrey Schmid voted for no change, and Powell indicated there were others who would like the Fed to move cautiously. “For some part of the committee, it’s time to maybe take a step back and see whether there really are downside risks to the labour market, or see whether in fact, the stronger growth that we’re seeing is real,” he said. ‘A further reduction in the policy rate at the December meeting is not a foregone conclusion. Far from it.’ Fed chair Jerome Powell Complicating the Fed’s task is that, while America’s unemployment rate was rising (despite Trump’s draconian immigration policies that are shrinking the pool of available labour) before the shutdown’s data blackout, so is inflation, as the impact of his tariffs slowly bleeds through into prices that, since mid-year, have been steadily edging up with each release of the inflation data.\n\nA slew of big job cuts in recent days from companies such as Amazon, UPS, General Motors, Intel, Nestle, Target and ConocoPhillips isn’t going to help the jobs market, while the rundown of pre-tariff inventories should be almost exhausted and the impact of the tariffs on inflation should become progressively clearer. The government shutdown will also have an impact on the economy, with hundreds of thousands of government employees stood down without pay and the administration withholding funds from some programs where Congress had previously approved funding. Loading The Congressional Budget Office said this week that the shutdown could cost the US economy up to $US14 billion ($21 billion) and lower December quarter GDP by one or two percentage points. While some of those impacts will be reversed when government reopens, the longer the shutdown lasts the more permanent the losses will be. Those are the key elements that created the fog Powell referred to, but there are also the massive investments pouring into artificial intelligence that are propping up US growth while disguising what’s happening in the rest of the economy, where there’s an element of bifurcation: AI companies and wealthier households exposed to the sharemarket and favoured by the tax cuts within Trump’s One Big Beautiful Bill seem to be prospering, but lower-income households are experiencing increasing stress.\n\nThe levels of stress and the complexity of the settings that the Fed, which doesn’t have the tools to target different demographic groups, finds itself in will mount further as new health insurance premiums take effect from this weekend, with big price hikes as a result of the One Big Beautiful Bill’s cuts to healthcare funding – unless the Democrats force changes as the quid pro quo for ending the shutdown. Recent disharmony within the Fed, which has long tended to produce unanimous voting outcomes, adds another layer of uncertainty. It became evident at its September meeting that, leaving aside Miran’s obvious interest in advocating for the bigger rate cuts that Trump has consistently demanded, an unusual divergence of views has developed within the 19-member open market committee. At that meeting, about half the members (excluding Miran) expected two more 25-basis-point rate cuts this year, two expected only one and seven expected none. The hawkish tone Powell adopted when talking about the prospect of a rate cut in December suggests the size of the faction arguing for no further cuts this year might have swollen, which would displease Trump.\n\nIf, as foreshadowed, Treasury Secretary Scott Bessent hands to Trump the name of his recommended nominee to succeed Powell late next month, there will also be a larger political dimension to the Fed’s decision-making. Those on the shortlist – current Fed governors Christopher Waller and Michelle Bowman, the director of the White House economic council Kevin Hassett, former Fed governor Kevin Warsh and BlackRock executive Rick Rieder – would effectively become the shadow chair, with the capacity to distract and confuse as financial market participants try to determine what the Fed’s policies will look like next year. The key criteria Trump wants from Powell’s successor is a commitment to significantly lowering US rates, almost regardless of the economic circumstances. This week’s rate cut was the primary focus for financial markets, but the Fed also announced the end, from December 1, of its quantitative-tightening program, which allowed Treasury and mortgage-backed securities it had bought to boost liquidity and lower rates during the pandemic to mature without reinvesting the proceeds.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-wall-street-higher-as-fed-cuts-nvidia-starts-us5-trillion-club-20251030-p5n6dk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX retreats amid rate resignation; Retailers decline, miners gain",
        "publish_date": "Thu, 30 Oct 2025 11:47:53 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket has opened lower again, with retailers and tech companies declining as investors gave up hopes of further interest cuts this year after Wednesday’s shock inflation data.\n\nThe S&P/ASX 200 dropped 20.9 points, or 0.2 per cent, to 8905.30 as of 11.18am AEDT, extending the week’s losses after the local bourse fell 1 per cent on Wednesday. Eight of the market’s 11 industry sectors were in the red, with banks, energy stocks and the mining heavyweights the notable exceptions. The Australian dollar slid and was fetching US65.71¢ at 10.31am AEDT.\n\nThe ASX opened to its third morning of declines. Credit: Louie Douvis\n\nChances of an interest rate cut by Christmas have all but disappeared after inflation jumped to its highest level in more than a year with signs that price pressures are broadening across the entire economy. The Australian Bureau of Statistics revealed on Wednesday that inflation jumped by 1.3 per cent in the September quarter, taking the annual rate to 3.2 per cent.\n\n“It pretty much eradicates almost any chance of a rate cut before the end of the year, it would take something extraordinary to see it now,” said Capital.com market analyst Kyle Rodda.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/former-lion-says-bodybuilding-passion-gym-supplements-behind-positive-test-20251030-p5n6hl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Former Lion says bodybuilding passion, gym supplements behind positive test",
        "publish_date": "Thu, 30 Oct 2025 11:36:02 +1100",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Banned former Brisbane Lions midfielder Rhys Mathieson has taken responsibility for the positive test that cost him a three-year suspension from football, in his first public comments.\n\nBut speaking on the Rip Through It podcast with ex-teammate Mitch Robinson, the 28-year-old – who last played for the Lions in the 2022 preliminary final – said anyone who thought he did it to increase his football performance was off the mark.\n\nRhys Mathieson playing footy in 2024. Credit: Instagram\n\nMathieson’s anti-doping sanction, which the AFL confirmed in a statement on Thursday, was reduced from the maximum four years after extensive meetings, and in part because of his admission of guilt after he was tested on August 10 last year.\n\nAn in-competition sample while he was playing for Wilston-Grange in the QAFL detected the presence of banned steroid Oxymetholone in his system.",
        "source": "TheAge"
    }
]