[
  {
    "url": "https://www.9news.com.au/world/prince-andrew-gives-up-duke-of-york-title/81be27be-2411-4712-8cd5-270ebd64d8d4",
    "title": "Prince Andrew gives up Duke of York title and honours",
    "publish_date": "Fri, 17 Oct 2025 19:18:57 +0000",
    "category": "lifestyle",
    "authors": [
      "Oct"
    ],
    "text": "Prince Andrew has announced that after consulting with King Charles he has given up his Duke of York title.\n\nThe move comes ahead of the posthumous release of Virginia Giuffre's memoir next week, which is speculated to include more accusations against the royal, all of which he denies.\n\n\"In discussion with The King, and my immediate and wider family, we have concluded the continued accusations about me distract from the work of His Majesty and the Royal Family,\" Andrew said in a statement released by Buckingham Palace on Friday evening (5am Saturday AEST).\n\nP﻿rince Andrew has announced that after consulting with King Charles he has given up his Duke of York title. (Getty)\n\n\"I have decided, as I always have, to put my duty to my family and country first. I stand by my decision five years ago to stand back from public life.\n\n\"With His Majesty's agreement, we feel I must now go a step further. I will therefore no longer use my title or the honours which have been conferred upon me.\n\n\"As I have said previously, I vigorously deny the accusations against me.﻿\"\n\nThe decision was made in consultation with not only the King but also the Prince of Wales and members of the wider royal family.\n\nKing Charles is believed to be glad about his 65-year-old brother's decision.\n\nPrince Andrew's other titles that have been relinquished include his knighthoods - as a Knight Grand Cross of the Royal Victorian Order (GCVO) and a knight of the Order of the Garter.\n\nThe decision was made in consultation with not only the King but also the Prince of Wales and members of the wider royal family. (Chris Jackson/Getty Images)\n\nIt's understood the changes will impact Andrew's ex-wife Sarah, Duchess of York, who will continue to be known in a personal and professional capacity as Sarah Ferguson.\n\nHowever, it's not expected to have any impact on the couple's daughters Princess Beatrice and Princess Eugenie﻿.\n\nRelinquishing his dukedom won't impact Andrew's living arrangements, with the prince to remain at Royal Lodge in Windsor.﻿\n\nWhile the royal has given up all of his titles and honours voluntarily, there's one that can't be taken away from him, and that is the title of prince.﻿\n\nOnce second in line for the British throne, Andrew was born in 1960 as a son of a monarch and as per the Letters Patent issued in 1917 by George V﻿, was born a prince.\n\nThe changes will impact Prince Andrew's ex-wife but not his daughter's Princesses Beatrice and Eugenie. (Getty)\n\nPrince Andrew first stepped back from his royal duties in 2019 following his car crash Newsnight interview about his relationship with convicted sex offender Jeffrey Epstein﻿.\n\nGiuffre was a victim of Epstein's who said she was sex-trafficked by the businessman.\n\nShe claims in her book to have had sex with Prince Andrew on three occasions, saying the royal thought it was his \"birthright\". Prince Andrew has denied all allegations made by Giuffre.\n\nAfter his Newsnight interview, Andrew was sued by Giuffre. Andrew has always denied Giuffre's allegations about him but settled the matter out of court in February 2022, reportedly for many millions of dollars.\n\nJeffrey Epstein was a notorious child sex trafficker and friend to many powerful people. (US Attorney of the Southern District of New York)\n\nThe court case resulted in Andrew being stripped of remaining military titles, charity patronages and the title of His Royal Highness. His mother, Queen Elizabeth II, was the monarch at the time.\n\nAndrew also ceased to be a Counsellor of the State as non-working royals are not included in the group of people who can act on the monarch's behalf in case they are incapacitated.﻿\n\nGiuffre took her own life in April, in Western Australia, where she was living with her husband and three children.﻿\n\nVirginia Roberts Giuffre, with a photo of herself as a teen — when she says she was abused by Jeffrey Epstein, Ghislaine Maxwell and Prince Andrew, among others. (TNS)\n\nRemembering Virginia Giuffre: The woman who helped bring down Jeffery Epstein (Nine)\n\nIt's understood the announcement today by Buckingham Palace was made not only to get ahead of the release of Giuffre's memoir but also to avoid distracting from King Charles and Queen Camilla's historic visit to The Vatican next week.\n\nExcerpts of Giuffre's Nobody's Girl: A Memoir Of Surviving Abuse And Fighting For Justice have been serialised in newspapers this week ahead of the book's full release and already brought the spotlight back on Prince Andrew's friendship with Epstein.\n\nSupport is available from the National Sexual Assault, Domestic and Family Violence Counselling Service at 1800RESPECT (1800 737 732) .",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/reforms-to-hit-australian-schools-as-bullying-crackdown-continues/a3027903-c84a-49e8-bad6-f86afd8e6a69",
    "title": "Sweeping reforms set to hit every school across Australia",
    "publish_date": "Sat, 18 Oct 2025 00:16:05 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "The Federal Government has put $10 million towards stamping out bullying at schools, as proposed new national standards will push schools to act on bullying complaints within 48 hours of being reported.\n\nMinister for Education, Jason Clare, announced the Anti-Bullying Rapid Review in February, aiming to examine what responses and prevention are working in the fight against bullying in schools and what needs to be strengthened.\n\nThe review came after reports to the eSafety Commissioner found that 53 per cent of young Australians reported experiencing cyberbullying.﻿\n\n53 per cent of young Australians reported experiencing cyberbullying. (Getty)\n\nA study by Bullying No Way also found that one in four students from ﻿year four to year nine reported being bullied every few weeks or more often.\n\nThe $10 million investment from the government as part of this review will be split evenly between an awareness campaign and resources for parents, teachers and students.\n\n\"We're going to allocate $5 million to provide some tools for teachers. While parents have told us they want action earlier, parents of teachers have told us that they need the tools and the training so that they can do the job,\" Jason Clare told Today.\n\n\"There are programs that are already being used by some schools. We're going to put all of those online in a hub, so that they can go to one place to get the best tools and the best programs to roll out in their schools.\"\n\nThe government will back a new national plan to address bullying in schools. (Sydney Morning Herald)\n\n\"Parents have told us that they think it's really important that we nip this in the bud, where there's a complaint that bullying has happened, the school needs action within the first 48 hours.\"\n\n\"And that involves talking to the children, but it also involves talking to the mums and dads, the parents of the child that's been bullied and the parents of the child that's been doing the bullying.\"\n\nOne of the main recommendations was the need for quick and clear action when a complaint or incident occurs.\n\n\"[Punishments] can involve suspension. It can involve expulsion in the most extreme circumstances.\n\nREAD MORE: Aussie jobseeker rejected from Woolies job after AI interviews\n\nJason Clare spoke about the reforms this morning. (Nine)\n\n\"What happens here is that if you act early, you can stop the harm from repeating. You can stop the action from recurring.\"\n\nThe review contained over 1700 submissions from parents, students, teachers and staff recommending ﻿that schools should respond to incidents within two school days.\n\n\"A lot of parents told us it was taking too long for some schools to act on bullying complaints,\" said Clare.\n\nThe Federal Government's under-16 social media ban is set to come into effect on December 10, which the review expects will also drastically help in reducing cyberbullying.﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/technology/are-we-in-an-ai-tech-bubble-what-happens-if-it-bursts-explainer/c11d1f63-a085-419d-bc62-030911459304",
    "title": "Are we in an AI tech bubble and what happens if it bursts?",
    "publish_date": "Fri, 17 Oct 2025 00:15:44 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "According to the valuations, the company behind ChatGPT is now worth more than what the entire state of Victoria produces in a year, and it's not far off NSW.\n\nArtificial intelligence, its builders say, has almost unlimited potential to radically transform – or maybe even destroy – the world.\n\nBut more and more finance, business and tech experts watching the staggering firehose of money pouring into the sector are starting to question whether the multitrillion-dollar industry is one big bubble. And what happens if it bursts?\n\nREAD MORE: Trump announces meeting with Putin after lengthy phone call\n\nIf you believe the valuations, the company behind ChatGPT is now worth more than what the entire state of Victoria produces in a year, and it's not far off NSW. (AP)\n\nThe Bank of England warned of an increasing risk of \"a sharp market correction\", Goldman Sachs CEO David Solomon said \"a lot of capital\" wouldn't deliver returns and the International Monetary Fund's chief economist, Pierre-Olivier Gourinchas, said after surging valuations and booming investments, \"markets could reprice sharply\".\n\nUsing simpler words, Amazon founder Jeff Bezos called it \"kind of an industrial bubble\".\n\nEven Sam Altman, the head of ChatGPT maker OpenAI, asked directly if investors were \"overexcited about AI\", flat out said \"yes\".\n\n\"When bubbles happen, smart people get overexcited about a kernel of truth,\" he told reporters at The Verge and some other tech publications in August.\n\n\"If you look at most of the bubbles in history, like the tech bubble, there was a real thing. Tech was really important. The internet was a really big deal. People got overexcited.\"\n\nREAD MORE: What La Niña declaration could mean for Australian weather\n\nEven Sam Altman, the head of ChatGPT maker OpenAI, asked directly if investors were \"overexcited about AI\", flat out said \"yes\". (AP)\n\nWhat even is a bubble?\n\nSo, are they right? And what happens if the AI bubble bursts?\n\nStanford Graduate School of Business Professor Anat Admati says the concept of a bubble is not well defined, and it's almost impossible to identify one in real time.\n\n\"Stock valuation and timing stocks is very difficult because the stock reflects the entire future and all lots and lots of factors,\" she tells 9news.com.au.\n\n\"So the notion that you're diagnosing a bubble as it's happening is often folly.\n\n\"People form beliefs and decide to trade, and it's a very dangerous game to play for investors, for pundits, journalists like yourself.\"\n\nThe OpenAI logo is seen on a mobile phone in front of a computer screen displaying output from ChatGPT. (AP)\n\nOxford Economics lead economist Adam Slater sees \"some symptoms of a bubble\", including rapid growth in tech stock prices and the fact tech stocks now comprise about 40 per cent of the S&P 500 stock market tracking the 500 leading US companies.\n\nHe also points to market valuations that appear \"stretched\" beyond their worth and \"a general sense of extreme optimism in terms of the underlying technology, despite the enormous uncertainties around what this technology might ultimately yield\".\n\nSome analysts suggest AI could lead to productivity gains not seen since Europe after World War II, while Massachusetts Institute of Technology economist Daron Acemoglu has predicted a 0.7 per cent gain in US productivity over a decade.\n\n\"You've got this incredibly wide range of possibilities,\" Slater says.\n\n\"Nobody really knows where it's going to land.\"\n\nOpenAI isn't the only player in the AI game. (Getty)\n\nIs this the dotcom boom 2.0?\n\nThe easy comparison, which even Altman and his Open AI chairman, Bret Taylor, have made, is with the dotcom boom, when the tech-heavy NASDAQ surged almost 600 per cent in the mid-to-late '90s before wiping off almost all of those games in about a year and a half.\n\nA swathe of start-ups were wiped out and even big hitters still around today such as Microsoft, Oracle and Intel took a battering on the markets.\n\nAdmati says it's too hard to predict whether a potential AI bubble bursting would do anything more than correcting the price of some companies, much less when it might happen.\n\nA swathe of start-ups were wiped out and even big hitters still around today such as Microsoft, Oracle and Intel took a battering on the markets. (AP)\n\n\"The internet bubble burst didn't change the entire world economy,\" she says.\n\n\"It was a price correction in a relatively narrow sector.\"\n\nTaylor puts a positive on the comparison, saying you could argue people pouring money into internet stocks in 1999 were broadly right.\n\n\"If you look at the internet bubble, a lot of people think about the flops, like Pets.com and Webvan,\" he tells The Verge.\n\n\"Through the lens of the past 30 years, though, we've now gotten most of the largest companies in the world, including Amazon and Google, two of the largest companies in the world.\"\n\nTaylor argues people pouring money into internet stocks in 1999 were broadly right. (AP Photo/Richard Drew FILE)\n\n'It's the fear of missing out'\n\nOpenAI is the most striking example of AI investment because it's come from nothing to be one of the world's most hyped companies in a few years based solely on the promise of its tech.\n\nIt is now valued at roughly $US500 billion ($771.9 billion), not too far below the GDP of Austria ($804.1 billion) or the 2023-24 GSP (gross state product) of NSW ($821 billion).\n\nBut the big boys are also shovelling money into their large language models and other AI research.\n\nGoogle is all-in on AI across its phones and even search and just this week announced another $US15 billion investment in an AI data hub, Amazon looks set to spend $US100 billion ($154.5 billion) on the technology this year, Apple boss Tim Cook told employees the AI revolution was \"as big or bigger\" as the internet, smartphones, cloud computing and apps.\n\nGoogle's Gemini AI assistant. (Google)\n\nChipmaker NVIDIA's surge to become the biggest company in the world by market capitalisation – overtaking even Apple – was so dramatic that it spurred a wave of articles about how the name is pronounced (en-VID-eeyah, by the way).\n\nIt was driven by a ravenous demand for the company's high-end GPUs, prized above all else in battle for the massive amounts of computing power it takes to sustain these huge companies' AI computing demands.\n\nSo when it invested $US100 billion in OpenAI, which, as well as being one of its main customers, has a 10 per cent stake in chip rival AMD, eyebrows were raised at this \"circular\" financing.\n\nAMD and OpenAI have agreed to a multibillion-dollar deal. (AP)\n\n\"A small group of companies is securing most of the major deals. News about multibillion-dollar investments from familiar companies such as OpenAI, Nvidia, CoreWeave, Microsoft, Google, and a few others is reported almost daily,\" Yale School of Management leadership expert Professor Jeffrey A Sonnenfeld and senior research fellow Stephen Henriques wrote in an opinion piece called This is how the AI bubble bursts.\n\n\"Should the bold promises of AI fall short, the dependence among these major AI players could trigger a devastating chain reaction, causing a widespread collapse similar to the 2008 Great Financial Crisis.\"\n\nHenriques tells 9news.com.au the risks are likely closer to those of the dotcom boom, where there is promise that \"will take a lot longer to materialise than people expect\".\n\n\"It's the fear of missing out,\" Sonnenfeld says.\n\n\"Everybody you know thinks that the costs of missing it are too high, enterprise wise and career wise, to look like you're an anachronism.\"\n\nMicrosoft is a major investor in OpenAI. (AP)\n\nIn their article, the researchers point out that in less than three years, OpenAI has \"gone from a parlour game to a pillar of the global economy\".\n\n\"After pillar, you wonder if you're going to wind up with a pile of rubble, and how to then rebuild out of the shakeout, where you see a lot of damage and carnage done,\" Sonnenfeld tells 9news.com.au.\n\nThe upside\n\nBezos argues the AI boom will be good for the world even if the bubble bursts, describing it as industrial, rather than financial or banking.\n\n\"The ones that are industrial are not nearly as bad. It could even be good because when the dust settles and you see who are the winners, society benefits from those inventions,\" Bezos said at a recent tech conference in Italy.\n\nHe compared it to a previous biotech bubble in the 1990s that resulted in new life-saving drugs.\n\n\"Every company gets funded, the good ideas and the bad ideas. And investors have a hard time in the middle of this excitement distinguishing between the good and bad ideas and so that's also probably happening today,\" he said.\n\nAltman last month predicted people would \"make some dumb capital allocations\", resulting in short-term ups and downs.\n\nBut he was confident it would drive \"a new wave of unprecedented economic growth\", scientific breakthroughs, improvements to quality of life and \"new ways to express creativity\".\n\nThe information provided on this website is general in nature only and does not constitute personal financial advice. The information has been prepared without taking into account your personal objectives, financial situation or needs. Before acting on any information on this website you should consider the appropriateness of the information having regard to your objectives, financial situation and needs.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/entertainment/original-kiss-lead-guitarist-ace-frehley-dead-at-74/f8c6652b-80f3-4c42-a3d5-0900bb91bd74",
    "title": "Rock legend dies aged 74",
    "publish_date": "Thu, 16 Oct 2025 22:49:32 +0000",
    "category": "entertainment",
    "authors": [
      "Oct"
    ],
    "text": "Ace Frehley, the original lead guitarist and founding member of the glam rock band KISS who captivated audiences with his elaborate makeup and smoke-filled guitar, has died. He was 74.\n\nThe American rock star died peacefully on Thursday (Friday AEDT )surrounded by family in the north-eastern state of New Jersey following a recent fall, according to his agent.\n\nFamily members said in a statement that they are \"completely devastated and heartbroken\", but will cherish his laughter and celebrate the kindness he bestowed upon others.\n\nAce Frehley, left, of the rock band KISS has died aged 74. (AP Photo/Chris Pizzello) (AP)\n\nIn this 2009 photo, former KISS lead guitarist Ace Frehley plays the national anthem before an NFL football game between the Kansas City Chiefs and the New York Giants in Kansas City, Mo. (AP Photo/L.G. Patterson, File) (AP)\n\nKiss, whose hits include Rock and Roll All Nite and Detroit Rock City , was known for its intense stage shows, which included fireworks, smoke and eruptions of fake blood performed by band members in black-and-white painted faces, platform boots and black wigs.\n\nFrehley and his band mates were inducted into the Rock and Roll Hall of Fame in 2014.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/woolworths-ai-job-interviews-jamie-rejected-exclusive/f3fc936d-4190-4f9b-b832-9648a8c8c9e7",
    "title": "Jamie wanted a job at Woolies. He claims he was rejected after two AI interviews",
    "publish_date": "Thu, 16 Oct 2025 21:46:01 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "Exclusive: A young Australian claims he was rejected from an entry-level job at Woolworths despite never speaking to a single human being in the hiring process.\n\n﻿Jamie, 24, said he applied to work part-time at his local Woolworths in NSW and was subjected to two \"odd\" AI interviews, only to be rejected six weeks later.\n\nHe called the whole experience \"dystopian\", especially coming from \"one of the most profitable companies in Australia﻿\".\n\nREAD MORE: Hero tradie foils alleged attempted armed robbery\n\nJamie, 24, from NSW applied for a job at Woolies and said he was rejected after two AI interviews. (TikTok/@jammy_dunk/Getty)\n\nWoolworths' profits in 2024-25 hit nearly $1.4 billion.﻿\n\n\"I find it really hard to believe the company that makes that much money every year couldn't afford to have a human interview me,\" Jamie told 9news.com.au.\n\nBut experts say this is what the future of job hunting looks like.\n\nJamie applied for a role at his local Woolworths in September and said the online application mentioned \"AI may be involved\" in the hiring process.\n\nHe didn't know what that meant at first.﻿\n\n\"Almost immediately, I got the invite to do the first AI interview,\" Jamie said.\n\nHe had to provide written answers to questions from a text-based AI chatbot within a time limit.\n\n\"It kind of made me wonder, who is actually looking over this after you've completed it?\" he said, calling the interview \"strange\".\n\nAustralia named the most 'AI-addicted' country. See how others ranked View Gallery\n\nA few days later, he got an email inviting him to another AI interview with a text-based chatbot.\n\nThis time he had to provide voice and video responses, which he wasn't entirely comfortable with.\n\n\"I'm not sure how I feel about this really massive company having access to my voice and video,\" he said.\n\nWoolworths declined to comment, however 9news.com.au understands Woolworths uses AI as part of its hiring process for store roles.\n\nJamie said he didn't hear back from Woolworths until about six weeks later, when he received a generic rejection email with no human feedback.\n\n\"That was really like a little kick in the guts,\" he said.\n\nHe's just grateful he was able to support himself financially while waiting to hear back.﻿\n\n\"If you're nearly destitute, or you're really struggling, living paycheck to paycheck or on Centrelink, that six-week wait could kill you,\" he said.\n\nHe shared his frustrations in a TikTok video which has since been viewed about 100,000 times.\n\nJamie applied for a role at his local Woolworths in September and was invited to two AI interviews. (Getty)\n\nMany Aussies like Jamie are resistant to the idea of AI job interviews but ﻿Associate Professor of workplace and business law at the University of Technology, Sydney Giuseppe Carabetta said we should probably get used to it.\n\n\"Larger organisations are using things like CV scanners, video interview analysis, and personality assessments or tests,\" he told 9news.\n\n\"This is generally about faster screening and processes – but there are problems, including the risk of biases where you have AI replicating historical discrimination by humans (algorithmic discrimination).\"\n\n﻿There is currently no legislation that directly regulates the use of AI in recruitment but anti-discrimination laws require employers to ensure that recruitment practices do not discriminate based on attributes like race, sex, and ability.\n\nThose laws technically apply to AI systems, but they often \"fall between the legal cracks\" in recruitment.\n\nFor example, an employer could land in hot water if an ﻿AI recruitment system automatically rejects applicants with feminine-sounding names (gender discrimination).\n\nBut even that could be hard for an employee to prove or pursue legally, as anti-discrimination law normally applies to the actions of a physical person.\n\nAnti-discrimination laws technically apply to AI systems but can be hard to enforce. (Getty Images/iStockphoto)\n\nCarabetta said that AI use in recruitment is an area ripe for reform but ﻿\"unfortunately the law is slow to adapt and legislative reform is not easy or quick\".\n\nAnd in the meantime, there's not much Aussies can do to avoid AI interviews.﻿\n\n\"There is no direct legal right for jobseekers to request a human interview instead of an AI one,\" he said.\n\nAussies with a disability can ﻿request \"reasonable adjustments\" under the Disability Discrimination laws, which could include asking for a human interviewer.\n\n\"But for other candidates – for example, those uncomfortable with AI – there is no formal right to opt out of AI interviews.\"\n\nJobseekers can try to take steps to secure ﻿a human interview, like asking early on if interviews will be conducted using AI and voicing a preference for human interaction.\n\nREAD MORE: Cause of crash under investigation as soldier remembered as leader and mentor\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nThey can also seek out ﻿employers that still emphasise 'traditional' recruitment methods, like handing in a physical resume, or reach out to hiring managers directly.\n\nBut there's no guarantee any of that will prevent jobseekers from having to deal with AI at some point in the hiring process.\n\nCarabetta encouraged Aussie jobseekers to learn how AI is used in modern hiring and try to adapt to it – because it's \"absolutely\" not going away.﻿\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/australia-post-missed-delivery-viral-post-reddit/e5eced7c-d49e-443a-aff5-ac2ff0a0cd8f",
    "title": "'Kidding me': Aussie's hopeful attempt to dodge post office visit backfires",
    "publish_date": "Thu, 16 Oct 2025 22:38:07 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "An Australia Post customer has been left scratching their head after missing an important parcel delivery - despite not only being home all day, but even putting up a sign to let the postie know.\n\nThe customer posted a photo earlier this week to Reddit showing them giving a thumbs-up after posting the sign on the mailbox.\n\n\"Auspost, I am home!\" it read.\n\nA Reddit poster was optimistic about getting their parcel delivered after putting up this helpful sign. (Reddit)\n\n\"I can help with my package if need be as it is heavy. Please feel free to knock and ask!\"\n\nThe customer said similar missed drop-offs had happened before.\n\n\"Very expensive and large package coming today … ain't no way in hell I'm driving to the airport to pick it up because of my area's driver!\" they wrote.\n\n\"He loves to just put in the 'we missed you' note and speed off, and that's if he even finds the motivation to leave a note at all!\"\n\nNo such luck. (Reddit)\n\nDespite their precautions, a predictable - if amusing - update soon followed.\n\n\"Are you f------ kidding me,\" they wrote, holding up a familiar red-and-white collection slip.\n\nOddly, despite the cu﻿stomer offering to help due to the package's weight, the \"heavy\" box was not checked on the card.\n\nThe customer's post sparked a long thread of replies, many of them featuring similar tales of woe.\n\nThe customer confirmed they were not following the matter up with Australia Post. (Getty)\n\nIn follow-up replies, the customer clarified their package had weighed about 9 to 10 kilograms, well within delivery limits.\n\nThey also said ﻿they had since taken possession of their package.\n\n\"Hell, I barely even lodged a minor complaint at the office and haven't even called up auspost (sic) to back it,\" they said.\n\n\"I don't plan on pursuing it because there's no point, it'd only create more negativity and I already have my package.\"\n\nAn Australia Post spokesperson said delivery drivers were subject to \"strict protocols\", which required them to knock three times and wait 30 seconds.﻿\n\n\"Drivers are also required to take a photo of the front door or intercom, and photos can be viewed through the Aus Post app,\" the spokesperson said.\n\n\"Customers with any concerns about their delivery are encouraged to contact Australia Post via our website ( auspost.com.au ) or calling 13 POST (13 76 78).\"",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/f1-max-verstappen-lando-norris-oscar-piastri-us-grand-prix/105907488",
    "title": "Verstappen turns up heat on Piastri, Norris at US Grand Prix",
    "publish_date": "Sat, 18 Oct 2025 01:39:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "Max Verstappen has turned up the heat on Formula 1 championship leader Oscar Piastri and Lando Norris by taking pole for Sunday's AEDT sprint race at the United States Grand Prix.\n\nRed Bull Racing's Verstappen clocked the fastest time of 1 minute and 32.143 seconds in qualifying at Austin's Circuit of the Americas, finishing ahead of the McLaren duo.\n\nHe beat Norris by a mere 0.071 of a second, with Piastri 0.380 behind the Dutch four-time F1 champion.\n\nPiastri will start third on the grid, ahead of German Nico Hulkenberg (1:32.645).\n\n\"I think [I drove] a pretty scruffy lap, to be honest,\" Piastri said.\n\n\"I just didn't really get it together. I feel a bit fortunate to be third, but I think the pace in the car is good.\"\n\nTeam orders are out of the window, Oscar can now play by 'Piastri rules' \"Papaya rules\" have dominated Formula 1 for two seasons, but with both McLaren drivers in the heat of a world championship battle, Oscar Piastri and Lando Norris may no longer prioritise what is best for the team.\n\nNorris had set a commanding pace in practice to throw down the gauntlet to Piastri, who leads his teammate by 22 points on the drivers' standings.\n\n\"I would've loved to have been on pole but it's not a surprise for us to be just a bit slower than the Red Bull, but still pretty happy,\" Norris told reporters.\n\nVerstappen is 63 points behind Piastri on the drivers' standings.\n\n\"It worked out well, but I still expect it to be a tough battle tomorrow in the sprint, but that's I think exactly what we want to see,\" Verstappen said.\n\n\"I'm excited for tomorrow and happy with today. I hope that we have good pace in the race, but we'll find out tomorrow.\"\n\nThere are 33 points up for grabs across the weekend in Austin, with the sprint followed by Monday's AEDT main race.\n\nAAP/wires",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/heavy-horsemen-keep-farming-traditions-alive/105887988",
    "title": "'Slow' farming brings benefits for heavy horse breeders",
    "publish_date": "Sat, 18 Oct 2025 00:18:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Sitting on a rusty horse-drawn scarifier, Aleks Berzins is farming the land in the same way his grandfather did.\n\nThe 36-year-old, from Exeter in the NSW Southern Highlands, breeds Australian draught horses, using them in every part of his farming operations.\n\n\"We really like to keep it traditional,\" Mr Berzins said.\n\n\"Everything from ploughing, harrowing paddocks, sowing, cutting hay and stripping-off a crop.\"\n\nAleks Berzins owns more than 50 drought horses. (ABC News: Sarah Moss)\n\nMr Berzins said a part of the farm was prepared for cropping using a single furrow plough.\n\n\"We do a section of the farm every year and if the conditions are right, it's a pretty nice, peaceful thing to do,\" he said.\n\nHe said the horses enjoyed the farm work as much as he did.\n\n\"They are herd animals, they do like to work together, and they really enjoy what they're doing,\" he said.\n\nAleks Berzins says using the heavy horses is slower than modern machinery but has other benefits. (ABC News: Sarah Moss)\n\nMr Berzins said using heavy horses and antique equipment was not as quick as modern day farming practices but believed it had other benefits.\n\n\"The way the soil is turned over with horses in general is slower and I think it's better for the soil,\" he said.\n\n\"You're using it more in an organic way, turning [the soil] over with a moldboard plough or scarifying the paddock to knock the weeds.\"\n\nInspired by childhood memories\n\nMr Berzins said working with a team of horses involved time and patience.\n\n\"They're not like a tractor — you can't just put a key in,\" he said.\n\n\"When you're working multiple, say a team of eight [horses], they've all got different personalities, so putting them in places where they are happy is important.\"\n\nMr Berzins developed his interest in heavy horses by working with his grandfather, Sidney Samuels.\n\nAleks Berzins learnt about heavy horses from Sidney Samuel. (Supplied: Aleks Berzins)\n\n\"It's nice to go out and plough a paddock that I remember him ploughing and it certainly keeps his memory alive,\" he said.\n\nMr Berzins is one of the wagon drivers, known as teamsters, behind a record-breaking event that involved 62 heavy horses being harnessed to pull a wagon at Barellan in the NSW Riverina.\n\nThe record team of 62 horses pulls a wagon at Barellan. (Supplied: Kim Woods)\n\nHe trained 30 horses in the mega-team, controlling the lead horses using voice commands from the wagon.\n\n\"Following behind a small horse team on the farm is different to seeing 62 horses out in front of you,\" Mr Berzins said.\n\n\"It's something I will never forget … I'm proud of the horses and what they have achieved.\"\n\nAleks Berzins begins preparing the horses for harness. (ABC News: Emily Doak)\n\nWorking with the heavy horses requires special equipment. (ABC News: Emily Doak)\n\nA horse focuses on its work. (ABC News: Emily Doak)\n\nWhen a hobby becomes a way of life\n\nAnother of the teamsters, Steve Johnson, also uses heavy horses on his farm near Lake Cargelligo in the Central West of NSW.\n\nSteve Johnson began working with heavy horses 50 years ago. (ABC News: Stuart Carnegie)\n\n\"It started off as a bit of a hobby, then it became a passion, and now it's a way of life,\" Mr Johnson said.\n\nHe cuts his crop using a horse-drawn reaper-binder and stacks the sheaves into a haystack before making chaff using a horse-driven machine.\n\n\"There's the whole cycle because the horses eat the chaff and then we start again the next season,\" he said.\n\n\"It's very time consuming … but if you were running a small place, I think it would be economical to have a couple of horses to do the work.\"\n\nSteve Johnson demonstrates using a horse-powered chaff cutter. (Supplied: Kim Woods)\n\nMr Johnson said he was motivated to produce crops in the old-fashioned way so he could work with his horses and share knowledge with the next generation.\n\n\"Not many people would know how to build a haystack, it's a dying art and I'm hoping to pass that knowledge on to my grandson,\" he said.\n\nSteve Johnson says the horses are his mates. (ABC News: Stuart Carnegie)\n\nMr Johnson, who has been working with heavy horses for 50 years, said establishing a connection with the animals was key to training.\n\n\"I don't even start training a horse until I can walk up and it's happy to see me, I can put the feed in and it put its chin on me as if to say 'thanks boss',\" he said.\n\n\"Then I know I've got a mate.\"\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/black-swans-rowers-take-on-head-of-the-charles-regatta/105840934",
    "title": "'A very dynamic race': Elite veteran rowers take on world's largest race",
    "publish_date": "Sat, 18 Oct 2025 00:07:47 +0000",
    "category": "sports",
    "authors": [],
    "text": "On a perfectly still Perth morning, an eight-man rowing boat cuts through the glassy Swan River.\n\nThe crew is doing sets of two minutes on, one minute off, as they put the finishing touches on years of preparation.\n\nThe men, aged in their 40s and 50s, are the Black Swans — a group of former high-level rowers who reunited five years ago, and are now off to America to compete in the world's biggest and most famous rowing race.\n\nThe Black Swans' pictured at their last training session in Perth before they set off for the US. (ABC News: Tom Wildie)\n\n\"The intention was just to row and be fit and healthy and get on the water,\" stroke Stuart Reside said of the crew's formation.\n\n\"The racing is a real secondary aspect of the crew, I suppose, as we've stayed together and we've wanted to get better and better along the way.\"\n\nNow, more than 20 years after Reside won bronze in the men's eight at the Athens Olympics, they are taking on the Head of the Charles Regatta in Boston.\n\nStuart Reside (front right) won bronze at the Athens Olympics in the men's eight. (Getty Images)\n\n\"We've done the Head of the Yarra in Melbourne a couple of times and we've raced in the state champs here several times so that's been good,\" he said.\n\n\"Then we thought we'd do this ... which is a really iconic international race.\"\n\nWhile it seems natural that a group of former elite rowers would want to compete at the top level again, it wasn't their intention.\n\nWhen Reside got a call from his friend Greg Carr about putting a crew together, he was initially reluctant.\n\nThe men's eight at the Athens Olympics in action on the way to winning bronze. (Getty Images)\n\nAfter the success of Athens, he'd barely been in a boat, and thought his days of early starts and gruelling hours on the water were behind him.\n\n\"You look back at rowing with lots of fond memories and sort of through rose coloured glasses,\" he said.\n\n\"You tend to forget the hard bits of it. So when I was asked to join in, I said 'Oh, I don't know if I've kind of got it in me.'\"\n\nBut once he found out who was in the crew, he was convinced.\n\nWhat a crew\n\nApart from Reside, three other members of the squad have won Olympic medals. Ron Snook claimed bronze in the men's quad at the 1996 Atlanta Olympics, Wesfarmers chief executive Rob Scott won silver in the coxless pair at the same Games and Glen Loftus won silver in the coxless four at Athens.\n\nRob Scott (left), won silver at the Atlanta Olympics in 1996, pairing with David Weightman in the men's coxless pairs. (AAP PHOTO / ROD TAYLOR)\n\nUnfortunately for Scott, a back injury will prevent him from taking part in the race.\n\nThere are also several former national and international rowers who make up the team, and a founding member of a platinum-selling band sits in the coxswain chair.\n\n\"The people that were involved that Greg mentioned to me, and the times that we shared before, and just the the common respect of those people, really was the main driver for me to get involved,\" Reside said.\n\n\"There was a lot of confidence that we were going to get together and the standard of rowing was going to be really good. It's a nice feeling when the boat runs well.\"\n\nWhat started out as rowing for fun and connection has culminated in a trip to Boston, where they will be one of 2,000 crews racing, with tens of thousands of spectators watching on the banks.\n\nThe race takes place on the Charles River, which separates Boston from Cambridge, and passes the Harvard University Boat Club, which has featured in several films.\n\nTaking part in the race will be reward for years of work, but Reside maintains they would have rowed together regardless of the goal.\n\n\"I think we all need diversity in our lives,\" he said.\n\n\" For me, it's about having lots of different strings to your bow. Rowing's one of those in my life. \"\n\n\"It offers a lot in terms of balance and experience and just clearing the head, clearing the pipes of the body, keeping the heart rate up.\"\n\nRowing and music intersect\n\nWhile Reside and the crew do the work of pulling the oars, they rely heavily on the guidance of their coxswain, Bourby Webster.\n\nBourby Webster, founder of the Perth Symphony Orchestra and a founding member of BOND, is the crew's coxswain. (ABC News: Tom Wildie)\n\nRowing has been a constant in Webster's life, even as she's pursued other passions such as founding the Perth Symphony Orchestra or being a founding member of the UK-based electric string quartet BOND.\n\n\"Music has always been a huge part of my life and it's always been a challenge, because music is at night and rowing is in the morning,\" she said.\n\n\"But there are unbelievable parallels between them. With rowing, you're constantly aiming for a competition. In music you're constantly aiming for a concert, there is no extension of a deadline.\n\n\"It's about delivering. Working towards something, being able to deliver at that point in time, but also both music and rowing are synchronised.\"\n\nThe coxswain is like the conductor of a symphony, keeping the rowers in time, and steering the boat.\n\nThe crew will need to place a lot of trust in cox, Bourby Webster, who will be responsible for avoiding other boats on the river. (ABC News: Tom Wildie)\n\nThe Head of the Charles race sees boats set off every 15 seconds to take on the winding three-mile (or roughly five kilometre) river course.\n\nFaster boats which start further down the order have to navigate choppy water and slower crews as they try to produce a competitive time.\n\n\"It's a hugely exciting race. It's a very dynamic race,\" Webster said.\n\n\"The whole crew is simmering. That's the only word I can feel. There's just an adrenaline in all of us.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/phoebe-litchfield-alyssa-healy-womens-cricket-world-cup/105907312",
    "title": "Skipper Alyssa Healy’s 7,000 runs an inspiration for Phoebe Litchfield",
    "publish_date": "Fri, 17 Oct 2025 23:46:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "Phoebe Litchfield may well go on to become an all-time batting maestro for Australia, but for the moment the young gun is simply enjoying the best view in the house as her fellow opener and skipper shows her the path to greatness.\n\nLitchfield watched in awe from the other end as Alyssa Healy first caned India on Sunday and then Bangladesh on Wednesday for thrilling back-to-back centuries that helped push the champions into the semifinals in their World Cup title defence.\n\nAt just 22, the elegant but thoroughly modern left-hander Litchfield — a player with all the shots and some more we doubtless have not yet seen — looks to be coming of age at this event.\n\nIndeed, she might have reached her first World Cup ton herself on Wednesday if, in the dazzling unbroken 202 stand with her captain, Healy had not turned on the after-burners with victory in sight.\n\nBut watching the skipper first go past 7,000 career international runs — only the third Australian to do so after Meg Lanning and Ellyse Perry — while also becoming the first woman to rack up back-to-back World Cup centuries in two separate tournaments, left Litchfield feeling she was getting a rare education.\n\nPhoebe Litchfield (left) had a front row seat for Alyssa Healy's ton against Bangladesh. (Getty Images: ICC/Alex Davidson)\n\n\"Seven thousand? That's an amazing achievement. That's a lot of runs,\" smiled Litchfield.\n\n\"But seeing that from the other end and at training, and just even being able to play with her, it's such a huge honour.\n\n\"Just to see how her brain clicks and how she goes about scoring runs, I look up to her a lot.\n\n\"Especially that mind-frame of going hard at the ball and being attacking, I learn a lot off that.\n\n\" Midge is in awesome form. Back-to-back hundreds? It reminds me of another tournament she did that in — so it's good signs. \"\n\nLitchfield had yet to make her Australia debut when she watched Healy crack 129 in the semifinals and 170 in the final to power the 2022 World Cup side to victory in New Zealand, so hopes the skipper's reprise in India could be an omen.\n\nIn the three years since she has taken to the stage so naturally, the 22-year-old has already amassed 1,738 international runs herself, but it is only really in the last couple of months that it has felt as though Litchfield is getting the best out of her rare gift on a consistent basis.\n\nSince August, while being crowned MVP of the Women's Hundred tournament in England, she has cracked 568 runs in 12 knocks at an average of 71. In the last month alone, since arriving in India, she has hit 338 runs at 67.6 per innings, spearheading Australia's charge.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nShe felt her unbeaten 84 against Bangladesh had not been her most fluent innings. \"But it's more meaningful to get through those kind of innings compared to when you're on a flattie,\" she said of the test.\n\n\"The challenges of adapting to conditions is probably the biggest thing I've learned, and it's put me in good stead for the next few fixtures.\"\n\nNext up it is England in Indore on Wednesday, with Australia safe in the knowledge a semifinal spot is already in the bag.\n\n\"To know in the back of our minds we're in the semis gives us confidence to go into that England game and put another good performance on the board,\" said Litchfield.\n\n\"We know that even though we came off the Ashes, winning 16-0, they'll come pretty hard in a few days time. So pretty excited for that.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/nt-judge-accuses-government-of-interfering-with-court-operations/105904858",
    "title": "Top judge accuses NT department of meddling in court media",
    "publish_date": "Fri, 17 Oct 2025 23:36:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Northern Territory's highest-ranking judge has written to the head of an NT government department asking them not to interfere with the Supreme Court's independence.\n\nChief Justice Michael Grant AO sent the email to Attorney-General's Department acting chief executive Leonique Swart on October 8, saying he had received advice the courts had been blocked from sending a press release to the media.\n\nIn the leaked email, Chief Justice Grant said he had \"been advised that you have recently and unilaterally directed the court's media liaison officer not to send a communication to The Australian newspaper, which I requested him to send\".\n\nHe also said he had been told there was a new, unwritten policy in place requiring the court to have all media communications approved by the department's chief executive.\n\nThe email was sent to Leonique Swart, the acting chief executive of the Attorney-General's Department. (Supplied: ANZSOG)\n\nThe chief justice said he was \"extremely disturbed that you have purported to interfere with the Court's independence and operations\", and called on Ms Swart to \"confirm without delay\" she would stop the alleged interference.\n\n\"The Supreme Court is not part of the Attorney-General's Department,\" he said.\n\n\"Rather, the Attorney-General's Department provides services to the Supreme Court.\n\n\" Until recently, the separation of powers issues were understood and respected. \"\n\nThe chief justice is currently on leave and was not available for comment.\n\nMichael Grant is the chief justice of the NT Supreme Court. (ABC News: Dane Hirst)\n\nHowever, in a statement, an NT Courts spokesperson told the ABC the leaked email \"was a result of something of a misunderstanding\" and there was no policy in place to moderate court communications.\n\n\"Once the chief justice was made aware of that, the matter was satisfactorily resolved,\" the spokesperson said.\n\nAsked to clarify what the misunderstanding was and how it was resolved, the Attorney-General's Department would not elaborate, and told the ABC the communications between Ms Swart and the chief justice were confidential and not for public release.\n\nMarie-Clare Boothby is the NT's attorney-general. (ABC News: Pete Garnish)\n\nThe email sent by the chief justice was originally published in Sydney-based law journal Justinian.\n\nIn a statement, Ms Swart said the email published in the journal was \"incomplete and does not include the resolution of the miscommunication that led to the correspondence\".\n\n\"The Department has always and continues to have full respect for the separation of powers, and I have never intended to intervene, alter or prevent the release of communications from the court,\" she said.\n\nThe chief justice's email came in the wake of media reporting on the sentencing of Darwin hit-and-run driver Jake Danby, who avoided prison time when he was sentenced by Supreme Court Justice Sonia Brownhill in September.\n\nNT prosecutors file appeal against fatal hit-and-run driver's sentence The NT's Director of Public Prosecutions has filed an appeal against the sentence of hit-and-run driver Jake Danby, who killed one Aboriginal man and injured another.\n\nDanby was sentenced to a 12-month community corrections order after hitting two Aboriginal pedestrians with his vehicle, one of whom died, and fleeing the scene.\n\nThe sentence drew widespread criticism from NT Aboriginal communities and has been appealed by the NT Director of Public Prosecutions.\n\nDanby is a relative of NT Attorney-General Marie-Clare Boothby.\n\nMs Boothby has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/north-melbourne-setting-aflw-standards/105905842",
    "title": "How North Melbourne are setting new AFLW standards in 2025",
    "publish_date": "Fri, 17 Oct 2025 22:36:47 +0000",
    "category": "sports",
    "authors": [],
    "text": "North Melbourne has not been beaten since the 2023 AFLW grand final, and the question on many lips is who, if anyone, can beat the reigning premier?\n\nCurrently on a winning streak of 21 games, and an undefeated streak of 23, the Roos are edging ever closer to the most consecutive victories across the VFL/AFL/AFLW — 23 wins (26 unbeaten) by Geelong in 1952-53.\n\nExactly how they are doing it, however, is fascinating.\n\nHaving developed the program, layer by layer, since joining the AFLW in 2019, their disciplined, professional style of footy is forcing the rest of the league to rise to their level.\n\nEverything starts with defence\n\nThe first part of North Melbourne's AFLW supremacy is its stingy defensive line.\n\nUnder Darren Crocker's tenure, defending the whole ground — not just down back — has been the main priority from which the rest of the game plan has been able to launch.\n\nThe Roos have conceded the fewest average points in the league in each of the last three seasons and have given up 40 or more points on just three occasions in that time.\n\nSeason Average points against 2025 22.2 (lowest in league) 2024 19.2 (lowest in league) 2023 22.9 (lowest in league) 2022 (S7) 24.2 2022 (S6) 28.9 2021 31.6\n\nResponsibility to defend falls on every player on the ground. Establishing layers of defence — in close at the contest, outside in space, deep in the backline, and higher up the ground — requires an incredible amount of discipline and understanding from the playing group.\n\nAs the AFLW begins to even out, one team remains untouchable North Melbourne claims its 20th win in a row as it looks to go undefeated for another season.\n\nAs the most experienced list in the AFLW this season, with an average of 51.2 games per player ahead of round 10, finding that chemistry with one another has been a slow burn over time.\n\nMeanwhile, with such a clear system, which calls for lengthening the ground and restraint to avoid being unnecessarily drawn up to the ball, they present repeat challenges for opposition forwards to break through if they are any chance of scoring.\n\nGoaling against North Melbourne is an example of a \"Swiss cheese model\" whereby specific barriers on many layers must break down in specific ways for the club to concede scores.\n\nGenerally, problems or errors in one layer are mitigated by several other layers of defence.\n\nNot even personnel shifts have created growing pains. Last year Libby Birch was added to the line and she slotted in with ease, helping the line adapt in the face of a long-term injury to Emma Kearney.\n\nThis year, Sarah Wright has been absent with personal issues, but replacement signing Tessa Boyd has filled the gap with aplomb.\n\nMaintaining control of the football\n\nThe most fascinating part of North Melbourne's powerful 2025 season to date has been just how efficiently it has controlled the footy.\n\nThis year the Roos are averaging 322.6 disposals per game — more than any other team in the history of the league — and are using those disposals at another record 67.4 per cent efficiency.\n\nWinning more footy than ever before, and using it better.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nSuch neat control of the ball means the Roos can play their way, keeping things on their terms for long periods of games.\n\nEven in the face of an impressive Essendon pressure game, and wild weather at Windy Hill, they still recorded a disposal efficiency of 63.3 per cent in round seven — although, that was their lowest efficiency of the season to date.\n\nThis is another example of chemistry within the playing group.\n\nYes, elite skill is required to use the ball with such control, but understanding of one another, and the system they are executing is just as important.\n\nFifteen of North Melbourne's 26 players who have run out for at least one game this season do so at an average efficiency of 65 per cent or above. The average efficiency across the AFLW this year is 61.6 per cent.\n\nFinishing off the hard work in front of goal\n\nThe last piece of North Melbourne's puzzle in recent seasons has been its own ability to score after stopping the opposition's attempts.\n\nLast year that pure scoring power was on show, with an average of 57.9 points per game, but this year it exploded.\n\nWith an AFLW record of 73.7 points per game, hitting a league high of 114 points in round three against Fremantle, it is the pure spread of goal kickers that has been most impressive.\n\nClub (season) Average points for North Melbourne (2025)* 73.7 Adelaide (2019) 59.1 Melbourne (2023) 58.9 Melbourne (2025)* 58.2 North Melbourne (2024) 57.9 Adelaide (2023) 57.6 Brisbane (2025)* 55.7 Hawthorn (2024) 52.2 Sydney (2025)* 51.9 Fremantle (2020) 51.0\n\n*Correct as of the conclusion of round nine, 2025\n\nThe league's equal-leading goal kicker, of course, hails from the Roos in Jasmine Garner, who enters round 10 with 96 goals to her name. A midfielder, no less.\n\nBut in the top five goal kickers for the 2025 season, three are from North Melbourne. Garner (18) is joined by Blaithin Bogue (17) and Tahlia Randall (16).\n\nWith 7.3 Roos goaling each week — another record — they are a side that is near-on impossible to defend, as there is such an array of attacking weapons.\n\nThose weapons are well-serviced, however, thanks to the aforementioned control of the footy and clear game style.\n\nIt has led to 13.3 marks inside 50 per game from 46.3 inside 50s, and those on the end of that delivery are holding up their end of the bargain, converting at a whopping 54.4 per cent goal accuracy.\n\nSo, when people say the Roos are on a record-breaking run, that might even be understating it.\n\nNorth Melbourne is setting the new standard of what the AFLW will become, and although no team in the league's history has ever gone back-to-back, that seems like yet another record set to tumble come November.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/wnbl-new-season-new-ownership-jennie-sager/105905322",
    "title": "Will the WNBL's new era live up to the hype?",
    "publish_date": "Fri, 17 Oct 2025 22:36:24 +0000",
    "category": "sports",
    "authors": [],
    "text": "The WNBL's new owners have made plenty of headline moves since taking over in April — from flashy rebrands, to increased player salaries, and a new broadcast deal.\n\nBut the real test comes now. For all the excitement and celebration of the \"new era\", will the product live up to hype?\n\nIt is an ambitious task, to breathe life back into Australia's longest standing elite women's competition in just six months, but after some initial caution, it now seems the players and clubs are willing to believe in the promises head office is making.\n\nLoading...\n\n\"We have a five-year strategy, we're absolutely not intending to walk away after five years if we don't get there,\" WNBL CEO Jennie Sager told ABC Sport.\n\n\"We're in this for the long haul. I think everybody is here every single day for the athletes, we want to get them the recognition that they deserve.\n\n\"It's been under-invested in, the athletes are incredibly successful locally and globally, but the average person doesn't know that.\n\nJennie Sager has a background in media, technology and marketing, and played college basketball. (Getty Images: Morgan Hancock)\n\n\"And so we want to get to the point where we see boys and girls wearing WNBL jerseys out on the street, the venues are full … and I think we can get there.\n\n\"It's just not all going to happen in year one.\"\n\nGrowing the game\n\nWollemi Capital Group Syndicate and the National Basketball League bought a majority stake in the league from Basketball Australia.\n\nIt came after years of financial struggles, complaints over broadcast quality and lack of marketing, and low crowd numbers, all somewhat masked by the Opals' continued success on the global stage.\n\nThe WNBL has rebranded with a new logo and colours. (Getty Images: Ian Hitchcock)\n\nThe consortium's first major announcement was a new four-year collective bargaining agreement, giving players a 104 per cent increase in minimum wages, and pro-rata minimum wage parity with the NBL from the third year of the deal.\n\n\"[We need to] keep our elite talent here in Australia for a bit longer so that we maintain the quality of the league that exists today, and making sure that they can have those great player conditions here in Australia,\" Sager said.\n\nThat talent includes Canberra Capitals guard Nyadiew Puoch.\n\nNyadiew Puoch could be one of the league's biggest drawcards this season. (ABC News: Stuart Carnegie)\n\nThe 21-year-old has already been drafted by the Atlanta Dream in the WNBA but wanted to stay here one more season to continue her development.\n\n\"We want more fans to be engaged in the games, we want people to watch us, we're so incredible out there,\" Puoch said.\n\n\"I'm really excited to be part of it and for the next generation … [to see that] it started somewhere and it can happen. It happens to other women's sports, why can't it happen to us?\"\n\nPerth Lynx co-captain Anneli Maley is also optimistic about the changes.\n\n\"The NBL has grown massively in the last couple of years, so to have the same governing body take over the women's league, it's just going to be a really positive thing.\n\n\"I think in the next couple of years women's sport is going to continue to grow, but also women's basketball is going to take a massive step up in this country.\"\n\nBallers on billboards\n\nWhile the quality of the product on the court has remained largely consistent over the years, visibility has been a bigger issue.\n\nLast year, the league averaged 1,500 fans a game, and most games were behind a paywall.\n\nA new broadcast deal means all games are now available on free to air TV/streaming.\n\n\"Broadcast is your first impression, but it's also the way that you can reach the most fans at once. And so we had to make it easier for people to find and to watch,\" Sager said.\n\nMarketing is another strategic priority — and the athletes say the WNBA sets the gold standard in that area.\n\nNyadiew Puoch with WNBA commissioner Cathy Engelbert after being selected 12th overall by the Atlanta Dream in the 2024 draft. (AP: Adam Hunger)\n\n\"They do a really good job with advertising the players and putting the players out there for people to love and engage … from the best player on the team to the 11th player,\" Puoch said, having recently spent time with the Dream in Atlanta.\n\n\"You can see people on billboards and you can see them everywhere. And I think that's a really cool thing.\n\n\"[Imagine] you're driving through traffic and you look up and you see Nyadiew Puoch, Jade Melbourne on the billboard.\"\n\nMaley, who has spent time in WNBA training camps, agrees.\n\nAnneli Maley was in a training camp with the LA Sparks earlier this year. (Getty Images: Ian Hitchcock)\n\n\"If the WNBL could take any anything from [the WNBA], is that they just need to put more eyes on us, because we have a great product and we have a lot of really talented athletes and great personalities in the WNBL,\" she said.\n\nSager says it is essential to build the profiles of the players on and off the court.\n\n\"If you want fans to keep coming back time and time again, they have to connect with that player, they have to see a reason why that player resonates with them,\" she said.\n\n\"And so it's really important that we get those player stories out there and that people understand they're a lot more than just the athlete who can shoot a lot of three pointers.\"\n\nThe Indiana Fever's Caitlin Clark is one of the biggest stars in the women's game. (Getty Images: Michael Hickey)\n\nFor all the WNBA's strengths with its recent record-breaking growth, thanks to the likes of Caitlin Clark, there are cautionary tales too.\n\nPlayers are still locked in tense CBA negotiations, wearing shirts at the All-Star game with the slogan \"pay us what you owe us\", and Napheesa Collier calling out commissioner Cathy Engelbert for \"the worst leadership in the world.\"\n\n\"I think the important learning out of what's happening in the US right now is putting the athletes first, making sure that you're listening to them,\" Sager said.\n\n\"Taking those pauses and getting that feedback, also [from] the clubs … and working with the Players Association, which we do work really closely with here in Australia.\n\n\"And I think that's maybe, at least from everything you read that's out there right now, where things got off the rails a little bit in the USA.\"\n\nEager to expand\n\nOne of the new owners' earliest hurdles was ensuring the survival of the Adelaide Lightning — stepping in with the SA government to keep the club alive.\n\nRebuilding a former basketball powerhouse The question of how to rebuild a once-proud club from scratch is one that's been at the forefront of the minds of the Adelaide Lightning's new coach, chief, players and owners.\n\nThey have since announced Tasmania will join next season and are now looking for a 10th franchise.\n\nFor a league that has sometimes teetered on the precipice of financial disaster, Sager insists it is viable.\n\n\"There's always a balance between 'are you expanding too quickly,' and you've seen that happen in the WNBA where they expanded, then they dialled it back, and now they're expanding again,\" she said.\n\n\"We feel really confident that taking the league to 10 teams next season is not pushing it too far.\n\n\"We just think there's no shortage of amazing talent to continue to pack this league.\n\n\"And then there's a future goal of can we expand beyond that? Maybe two years after that?\"\n\nBut for now, season 2025/26 awaits.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/october-movie-wrap-what-to-watch/105893300",
    "title": "Which movies to catch and which to avoid in October",
    "publish_date": "Fri, 17 Oct 2025 22:31:43 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Welcome to the ABC Arts October movie wrap.\n\nThis month our cinephile critics took in everything from an Australian comedy that revolves around a time-travelling tequila bottle to the highly anticipated Bruce Springsteen biopic starring The Bear's Jeremy Allen White.\n\nPlus, what happens when wrestler-turned-actor Dwayne \"The Rock\" Johnson sets his eyes on Oscar gold? Find out with Benny Safdie's sparkling new sports drama.\n\nHappy watching!\n\nSpringsteen: Deliver Me From Nowhere\n\nJeremy Allen White as Bruce Springsteen and Odessa Young as Faye in Deliver Me From Nowhere. (Supplied: Disney)\n\nFrom The Bear to the Boss, Jeremy Allen White swaps the kitchen apron for denim and leather in this enjoyable, music-heavy portrait of Bruce Springsteen at an artistic and commercial crossroads in the early 1980s.\n\nFast facts Starring: Jeremy Allen White, Jeremy Strong, Paul Walter Hauser, Odessa Young Director: Scott Cooper (Crazy Heart) Where: In cinemas October 23\n\nUnder pressure to deliver a hit but wrestling with depression and memories of his abusive father, Springsteen holes up in New Jersey — with a head full of American duo Suicide and Terrence Malick's Badlands — to obsess over the dark, cassette-recorded sounds that would become 1982's haunting Nebraska. At the same time, he's laying down early versions of the songs destined for 1984's blockbuster Born in the USA.\n\nDoing his own singing, Jeremy Allen White makes for a smouldering Boss (at the film's New York Film Festival premiere, a modest Springsteen praised the actor for playing a \"better looking version of me\"), but the real star of the movie is Jeremy Strong as Springsteen's long-time manager and producer Jon Landau. Decked out in turtlenecks, thick lenses and a Noo Yawk accent, the Succession alum locks in with a remarkably straight face, even when delivering lines like: \"I think the muse came down and kissed you on the mouth.\"\n\nFans of the Boss will be thrilled, while casual acquaintances just might emerge with a new-found love of the music.\n\nLuke Goodsell\n\nThe Smashing Machine\n\nDwayne Johnson as UFC legend Mark Kerr in The Smashing Machine. (Supplied: VVS Films)\n\nOscar-nominee The Rock? It's more likely than you might think. The Smashing Machine is the perfect awards ploy for Dwayne Johnson, playing real-life American MMA and UFC champion Mark Kerr, as inner demons surface amid his first-ever loss in the ring in 1999.\n\nFast facts Starring: Dwayne Johnson, Emily Blunt, Ryan Bader, Bas Rutten Director: Benny Safdie Where: In cinemas now\n\nThat's a big step for Johnson, who's previously negotiated \"can't lose\" clauses in action movie contracts; maybe it’s OK here, as he’s almost unrecognisable thanks to prosthetics and fuzzy head of hair. Either way, the action star disappears into Kerr.\n\nAt the film's core is a great unease underneath Kerr's relationship with girlfriend Dawn (Emily Blunt), emerging slowly as he fights against the cloud of addiction. Blunt is used to adding weight to sliver-thin wife roles, but Dawn's cocktail of insecurities and resentments is anything but. She's not a neat character, and neither is their relationship — mostly because the film takes little liberties with Kerr's life, pulling from the startling raw 2002 HBO documentary of the same name.\n\nDisarmingly simple and unflashy, The Smashing Machine is not exactly the first solo directorial feature fans expected from Benny Safdie, as his previous efforts with brother Josh (Good Time; Uncut Gems) have been tightly-wound descents to the bottom.\n\nBut even in losing, Kerr doesn't reach the bottom. This is a movie about settling for less than greatness — a strange, dulling minor note that elevates this above the standard biopic, with an irresolution that's far more interesting than it's getting credit for.\n\nJared Richards\n\nTRON: Ares\n\nAres is the third film in the TRON series, following on from 2010's TRON: Legacy. (Supplied: Disney)\n\nForty-three years after the groundbreaking original TRON — and 15 since TRON: Legacy at least gave us a great Daft Punk soundtrack — Disney has somewhat inexplicably gone back for a third crack at a digital grid whose allure is beginning to look a little dim.\n\nFast facts Starring: Greta Lee, Jared Leto, Jeff Bridges, Jodie Turner Smith, Evan Peters, Gillian Anderson Director: Joachim Rønning (Pirates of the Caribbean: Dead Men Tell No Tales) Where: In cinemas now\n\nRival CEOs Eve Kim (Greta Lee, inheriting the mantle of Jeff Bridges's original game designer Flynn) and Dillinger (Evan Peters, playing a blustery, grating variation on the tech-bro villain) are battling to obtain the \"permanence code\", software that will allow their creations from the digital environment to cross over into the real world.\n\nThough there's much talk of AI and its implications, TRON: Ares is mostly just a creaky variation on the previous two instalments, with lots of Terminator-style chases between the bad guys (Jodie Turner-Smith's femme-bot Athena) and familiar musings on technology developing a conscience and a soul.\n\nLee and Jared Leto, as the titular villain-turned-hero, steal some moments amongst the noise — and erstwhile American Psycho victim Leto gets to riff on Patrick Bateman, if the latter was a fan of Depeche Mode — but the performers are let down by rote, unimaginative storytelling, proving just how tired this concept has become after four decades of imitation.\n\nStill, cool lightcycles — and a banger soundtrack by Nine Inch Nails.\n\nLuke Goodsell\n\nOne More Shot\n\nMinnie (Emily Browning) literally changes the future via magical tequila in One More Shot. (Supplied: Stan)\n\nUnto every generation, an anarchic time loop movie is born. The 60s had Chris Marker's decidedly dystopian La Jetée. Harold Ramis delivered the rom-com-inflected classic Groundhog Day in the 90s. Christopher Landon leant into the funnier end of slasher movies with 2017's Happy Death Day.\n\nFast facts Starring: Emily Browning, Aisha Dee, Sean Keenan, Pallavi Sharda, Ashley Zukerman Director: Nicholas Clifford Where: Streaming on Stan now.\n\nWith One More Shot, Aussie director Nicholas Clifford admirably adds to local contributions, including 2014's trippy sci-fi, The Infinite Man. The film rests on the gifted shoulders of star Emily Browning, who plays loose cannon Minnie, determined to win back her ex, Sean Keenan's Joe, on New Year's Eve, 1999. Alas, the party crashes when she discovers he's engaged to Jenny (Apple Cider Vinegar actor Aisha Dee).\n\nCo-written by Alice Foulcher and Gregory Erdstein, the hilariously goofy film's loop amusingly hinges on an unopened bottle of Mexican tequila. Much to Minnie's surprise, one shot's enough to reboot the disastrous night again and again, until it runs dry. With this timer ticking down, Minnie gets seriously messy, increasingly going through the motions as each of her redos fizzles. Also featuring Succession guest star Ashley Zuckerman and The Office's Pallavi Sharda, it's heaps of fun with a great big heart of daftness.\n\nStephen A Russell\n\nRoofman\n\nChanning Tatum's latest film is based on the real life escapades of 'Rooftop Robber' Jeffrey Manchester. (Supplied: VVS films)\n\nWho'd have guessed that Channing Tatum and Kirsten Dunst would make for one of the year's sweetest movie romances? Maybe it's the lack of middle-aged couples taken seriously as love interests at the cinema; on the other hand, it's impossible not to get swept up in the inherent romance of the gentleman criminal.\n\nFast facts about Name of Movie Starring: Channing Tatum, Kirsten Dunst, Ben Mendelsohn, LaKeith Stanfield, Juno Temple. Director: Derek Cianfrance. Where: In cinemas now.\n\nBased off the true story of a real criminal on the run (not unlike Catch Me If You Can, or Robert Redford's late-career gem The Old Man and the Gun — rest in peace), Tatum's ex-soldier Jeff (no, not that one) is a deadbeat dad who resorts to robbing an impressive 45 McDonald's locations to provide for his family. When he's thrown into prison, he escapes and holes up in a Toys \"R\" Us (rest in peace, again), only to risk his safety when Dunst's kindly employee catches his eye.\n\nDirector and co-writer Derek Cianfrance (The Place Beyond the Pines) portrays Jeff as somewhat pathetic, though Tatum's callow energy and knack for physical comedy keeps him buoyant. Dunst is heartbreaking as Leigh, a kind but no-nonsense single mum who's refreshingly direct about her desires. The stakes inevitably rise, with Jeff's pacifist streak pushed to the brink — but Cianfrance coolly maintains the film's shaggy charm throughout.\n\nJamie Tram\n\nGood Boy\n\nGood Boy producer Kari Fischer and director Ben Leonbery with the film's star, Indy the dog. (Getty: Diego Donamaria)\n\nLow-budget indie horror Good Boy taps into the mystical power of dogs as protectors who can sniff out harm and presage future dangers.\n\nGood Boy is told almost entirely through the perspective of a dog named Indy, which may sound gimmicky, but first-time director Ben Leonberg expertly inhabits the canine's interiority, from his dreams and fears to his desires and visions. Through Wade Grebnoel's camera work, we witness everything that unfolds from Indy's eye level.\n\nFast facts Starring: Shane Jensen, Arielle Friedman, Larry Fessenden, Indy the dog Director: Ben Leonberg Where: In cinemas now\n\nLeonberg's very own retriever is Indy, the star of the show and companion to Todd (Shane Jensen), a youngish man who's contracted a terminal illness and decides to make a tree-change to his grandfather's terrifically spooky rural cottage.\n\nWe never see Todd's face, deliberately obscured to us until the very end. But there are plenty of close-ups of Indy's snivelling snout and cocked ears, as he becomes keenly aware of a malignant presence in the house.\n\nHorror film staples abound, from creaky doors and unexplained thumps to menacing eyes gleaming in the dark and looming shadows. Kelly Oostman's eerie sound design — full of incessant strings and thudding drumbeats — accentuates the impending sense of doom.\n\nGood Boy breathes new life into the horror genre and subverts the play of victimhood by centring its story on a dog in thrall to the whims of his gradually deteriorating owner. Whether Indy is responding to the clutches of death or a supernatural force is deliberately left ambiguous — Leonberg's debut masterfully plays with the unknowing.\n\nSonia Nair\n\nThe Mastermind\n\nJosh O'Connor as James in The Mastermind. (Supplied)\n\nOne of the finest filmmakers currently working in the US, writer/director Kelly Reichardt doesn't necessarily get the credit she's due for someone easily on a par with the likes of Scorsese. Perhaps that's because her thoroughly engaging films tend to be a good deal quieter, anchored to character beats over action-packed plot.\n\nFast facts Starring: Josh O'Connor, Alana Haim, Hope Davis, John Magaro Director: Kelly Reichardt Where: In cinemas October 23\n\nThe Mastermind stars Josh O'Connor, the eminently charming star of Challengers and The Crown, as James, a chunky knit jumper-wearing suburban dad plotting to swipe contemporary artworks from his local gallery. A dramatic way for an otherwise greige guy to get out from under the boot of his cantankerous dad (Bill Camp) and smothering mother (Hope Davis).\n\nOnly James hasn't thought through what happens next. Rather than enriching his family overnight, it brings the cops to his door, through which Terri (Alana Haim, ace if underused), his wife, promptly leaves, taking the kids with her. Instead, we sit in James' amusingly gormless company on the run. O'Connor ensures we remain rapt by his increasingly farcical scramble. But it's Gaby Hoffmann who steals the show as the eye-rolling wife of his best mate, who will not have a bar of him hiding out on their farm in this ruffled collar, Palme d'Or-nominated misadventure.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/western-australia-harvest-record-grain-crop-expected/105900332",
    "title": "A surprising winter has led to a 'cracker' grain harvest in WA",
    "publish_date": "Fri, 17 Oct 2025 22:14:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "West Australian farmers have begun harvesting one of the state's biggest ever grain crops, forecast to reach 25.4 million tonnes and expected to be worth $7.8 billion.\n\nThe WA harvest will account for potentially 40 per cent of Australia's total winter grain crop.\n\nSpring weather has been ideal, prompting the state's main grain handler, the CBH Group, to \"work furiously\" to build additional \"emergency\" storage for grain across the state.\n\nThe bulk of WA's grain growers span a 1,200-kilometre distance from Geraldton at the top and Esperance at the bottom and both regions are forecast to produce record-breaking crops, with some loads of canola and barley already delivered to CBH in Esperance and Kwinana port zones.\n\nMichael Lamond says this season has been one of the best on record in WA. (ABC Rural: Jo Prendergast)\n\nGrains Industry Association of WA (GIWA) crop report author Michael Lamond said warmer winter temperatures had fuelled crop growth.\n\n\"You couldn't have fathomed 25 million tonne in June, when a lot of the crop hadn't been sown,\" he said.\n\n\"It's a surprise for everyone, the season just got better in the second half of July.\n\n\" It's going to be a cracker of a year. \"\n\nWheat at Pindar in WA's north-eastern grain belt. (ABC Midwest Wheatbelt: Chris Lewis)\n\nPrices not so great\n\nIn 2022, Western Australia produced a record 25 million tonne crop, worth $10 billion.\n\nWhile this year's crop is a comparable size, Mr Lamond said falling grain prices meant this season's was worth about $7.8 billion.\n\nThe international benchmark for wheat prices, the Chicago Board of Trade (CBOT), is now hovering at a five-year low, due to an oversupply of grain in the northern hemisphere.\n\nCrop production in the Esperance region is on track to break tonnage records in 2025. (ABC Esperance: Tara De Landgrafft)\n\nGrain market analyst Nick Crundall said domestic prices had firmed in recent weeks, but it was a challenging time for many Australian grain growers.\n\n\"Profitability in broadacre cropping is going to be very challenged this year, input prices have not come down in line with what grain prices have done,\" he said.\n\n\"Unless something changes between now and over the next … six to eight months, they're going to be looking at a very challenging margin situation in their cropping program.\"\n\nA personal best\n\nMic and Marnie Fels, who farm at Wittenoom Hills 50 kilometres north-east of Esperance, began harvesting 2,000 hectares of canola this week.\n\nMic Fels says he has never seen better barley than this year. (ABC News: Emma Field)\n\n\"We are looking at a few personal best [for crop yields] this year if the wheels don't fall off,\" Mr Fels said.\n\n\"We've got the best barley I've ever grown or seen, it's amazing this year.\n\n\"I don't want to jinx myself though, let's see how we go.\"\n\nFarmers have begun harvesting barley and canola in the Esperance region. (Supplied: Monica Field)\n\nMr Lamond said there had been isolated patches of frost in some areas, and the central Wheatbelt had lost potential due to drier winter conditions.\n\n\"That's been annoying for those growers, but most should have a good year,\" he said.\n\nRain damage to crops before they are harvested is now the most serious concern for farmers.\n\nIn the northern end of the grainbelt, crops are late to ripen after ideal mild spring weather and a late start to the season.\n\nWA's grain harvest is about to get in full swing. (ABC Midwest Wheatbelt: Jo Prendergast)\n\nMark Flannagan expects to start harvesting 24,000 hectares of wheat next week at Pindar, 130km east of Geraldton.\n\n\"We think it looks really good, there's a lot more weight in the grain this year than last year, we're battling to find small grain when we rub heads out,\" he said.\n\nBut the 100 millimetres that fell during harvest last year, damaging grain and bogging machines, is fresh in his mind.\n\n\"It's looking good, but it ain't over till it's over,\" he said.\n\nRain damage to crops before they are harvested is now the most serious concern for farmers. (Supplied: Monica Field)\n\nNational crop a mixed bag\n\nAcross Australia, farmers were forecast to harvest 62 million tonnes of winter grains, in the Australian Bureau of Agricultural and Resource Economics and Sciences (ABARES) September crop report.\n\nThis would have been the nation's third largest harvest on record.\n\nBut finishing rains have failed to fall in parts of Victoria and South Australia, where some farmers have now cut struggling crops for hay.\n\nThe GrainCorp Capella site in Queensland has broken a record for the largest day of receivals. (Supplied: Mat Samin, GrainCorp)\n\nMeanwhile, strong crops are being harvested in Queensland, with GrainCorp telling ABC Landline, that its Capella site had broken its record for the largest day of receivals.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/tool-australia-tour-2025-maynard-james-keenan-interview/105865706",
    "title": "How Tool's Maynard James Keenan juggles metal, martial arts and making wine",
    "publish_date": "Fri, 17 Oct 2025 22:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "To their fans, an Australian tour from alt-metal titans Tool is treated with the kind of reverence typically reserved for the Dalai Lama or the royal family.\n\nIn the country for the first time since 2020, the band is headlining Good Things Festival on the east coast, as well as anticipated sideshows in Perth and Adelaide, where devotees have been waiting for a Tool concert since 2013.\n\nTo that same legion, frontman Maynard James Keenan is equally admired as something like a spiritual leader and well-respected institution.\n\nHis powerful vocals, surreal presence and cerebral lyrics are an indispensable element of a group who've always been stranger and more subversive than most of their peers.\n\nTool is a multi-platinum selling, festival-topping juggernaut whose music defies the conventions of commercial success: dark, labyrinthian songs roiling with primal, hypnotic grooves, devilishly tricky time signatures and challenging subject matter.\n\nMaynard James Keenan (left) with Tool band mates Justin Chancellor, Danny Carey and Adam Jones. (Supplied: Travis Shinn)\n\nThe Los Angeles quartet's painstaking collaborative process means they've produced just five full-length albums across 32 years, their complexity growing in tandem with increasingly longer waits between releases.\n\nThirteen years separated their last album, Fear Inoculum, and 2006 predecessor 10,000 Days. The album also dethroned Taylor Swift from the top spot on the US Billboard 200 Chart.\n\nIt demonstrates how, despite (or perhaps because of) their media-adverse attitude and difficult-to-categorise music, Tool breed cult-like adoration.\n\nAn Oral History of Tool Tuesday How one of triple j's greatest traditions happened, according to the people who lived it.Tool Fear Inoculum Review\n\nHere in Australia, that same fanatical dedication has spawned Tool Tuesday: a decades-long tradition by triple j listeners.\n\nAsked if he is aware of the hallowed tradition, Keenan deadpans: \"Is that like the band Tool? Or is it like, tool, as in idiot?\"\n\nHumour and heaviness\n\nHe's one of heavy music's most critically acclaimed and enigmatic vocalists, but Keenan is also one of its funniest.\n\nHe's an under-appreciated humourist who counts late stand-up legend Bill Hicks as an idol and made cameos in TV sketch series such as Mr. Show, Comedy Bang! Bang! and Tim and Eric Awesome Show, Great Job!\n\nConnecting to his video call with Double J's Dylan Lewis, Keenan jests about being an AI-generated body double.\n\n\"I'm the clone they send out to dodge the bullets.\"\n\nThese kinds of quips are standard tone-setting procedure in most interviews with Keenan, who also fronts rock supergroup A Perfect Circle and Puscifer, a solo project where he exercises his theatrical tendencies and twisted funny bone.\n\nLoading Instagram content\n\nHe's been painted by music publications as a difficult subject who loves toying with interviewers. In reality, Keenan just prefers to get to the point rather than pontificate.\n\nFor example: What's the hardest song vocally to sing live?\n\n\"The ones I can't sing anymore.\"\n\nWhy is Merkin Vineyards named after the term for a pubic wig?\n\n\"Because I think I'm funny.\"\n\nA grape vintage\n\nWhen Keenan isn't on tour or in the studio, he's found roasting beans with his wife, Jen, at the Queen B Vinyl Café, or running his winery Merkin Vineyards and the adjoining Caduceus Cellars.\n\nIn fact, all his musical commitments are scheduled to avoid clashing with the winery's crucial windows of harvesting and processing.\n\nOriginally dismissed as a celebrity hobby, Keenan's grape-growing operation in arid North Arizona has grown from industry underdog into an award-winning operation — as chronicled in 2010 documentary Blood Into Wine.\n\nA fan's collection of wine made by Maynard James Keenan's Caduceus Cellars. (Supplied: Grant Lutwyche)\n\nNow 20 years in the business, Keenan is a serious connoisseur who clearly knows his Merlot from a Cab Sav, let alone a bottle of Rockford Basket Press.\n\n\"I have a vertical of magnums in my cellar now, from mid-90s to late-90s,\" he notes of the legendary Barossa drop.\n\nAnd yes, he's also in the habit of playing music to his grapes.\n\nJudith Nebbiolo, a signature drop named after his late mother, whose ashes are spread across the vineyard, is treated to \"Blonde Redhead and Fever Ray [when] it comes in off the hillside,\" he says.\n\n\"Does it help? I have no idea. It helps me focus and get shit done,\" he clarifies.\n\nWhile his friends with cellars will pump \"thrash[y], super heavy, fast shit\", he can't do that.\n\n\"I love some of that music, but I can't play it while I'm on a forklift paying attention to the grapes. It's very distracting. I'm more B-52s or Devo or Gillian Welch.\"\n\nWhen Tool play South Australia, he's hoping to reconnect with old friends.\n\n\"It's been a long time but I used to come to Adelaide to work with winemakers during harvest.\n\n\"I haven't been in forever … but I generally hang out with the people from Ochota Barrels,\" he adds.\n\nHowever, Keenan is very much business first.\n\n\"I have to make sure I'm prepared for what's expected of me. I can't go tearing it up at wineries.\"\n\nWhat's expected of Keenan is playing enigmatic emcee between guitarist Adam Jones's drop-tuned riffs, Justin Chancellor's muscular bass and the octopus-limbed drum punishment of Danny Carey.\n\nTool's audio-visual quality has long made them a must-see live act among rock fans. (Supplied: Good Things)\n\nSince their 1990 debut, Tool's live show has developed into a full-scale production of immersive sound and psychedelic visuals. It's a spectacle that keeps fans coming back multiple times, even when there's no new material to promote.\n\nLike their music, their performances are simultaneously enigmatic, brutal and intellectual. A visceral experience that's all about — as Keenan poetically summarised in their signature hit Schism — \"finding beauty in the dissonance\".\n\nLoading Instagram content\n\nA world-class multi-tasker\n\nFamed for demanding performances spanning the melodic to the larynx-shredding, doubters have wondered if the 61-year-old has much Tool left in his voice.\n\n\"Plenty,\" he counters, because he's taking care of it.\n\n\"The big misconception,\" he begins, \"is there's some magic potion or tricky thing to do.\n\n\"There isn't, it's sleep and water and shut the f**k up.\n\n\"That's how you maintain your throat. And you know, vocal exercises: warm up before you're going to sing. Understand your limitations and don't push past them. Push the envelope but don't roast yourself out.\"\n\nKeenan developed that straight-shooting discipline from a young age. He was a keen wrestler in high school and enrolled as a US Army cadet in his 20s.\n\nHis strong physical regime extended to practising Brazilian jujitsu in the late 90s.\n\nHe once exhibited his black belts skills on a stage invader, and later co-founded his own studio, Verde Valley BJJ, where Mike Tyson began training for his fight with Jake Paul.\n\nLoading Instagram content\n\nThe polymath credits his productivity and sense of discipline to his father, Mike, who died earlier this year.\n\n\"My dad, he was my [high school] teacher, my wrestling coach. And his level of discipline rubbed off on me,\" he says.\n\n\"He was a person who could organise his day. Read papers at night over a cup of sassafras tea, quick work-out in the morning … Then we get to school and it's wrestling practice. In the summers it's working in the garden.\n\n\"You just organise your time and do what needs to be done. Don't take no for an answer even from yourself when it comes to getting the things done.\"\n\nThat same efficiency has clearly been passed down to Keenan's own son, Devo, who would occasionally join his father on stage playing cello.\n\n\"He did, he's now a lawyer. I made a lawyer,\" the rock star comically underscoring the irony of parenting a litigator who is now \"studying for his barre\".\n\nMaynard James Keenan preparing for a performance, being painted by artist Alex Grey, who is responsible for much of Tool's artwork and live visuals. (Facebook: Alex Grey)\n\nCurrently eyeing future albums for Puscifer, A Perfect Circle and — at some point — fresh Tool music, the winemaker and martial artist continues to juggle those commitments with his responsibilities as a business owner, husband, and father of two.\n\n\"It's all about focusing on the thing in front of you at the time. And don't be thinking about the other things while you're doing that one.\"\n\nTool play the Good Things Festival — and theatre shows in Adelaide and Perth — this December.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/poweroos-want-powerchair-football-included-in-paralympics/105900078",
    "title": "Powerchair footballers bid for sport's inclusion in Brisbane Paralympics",
    "publish_date": "Fri, 17 Oct 2025 21:53:36 +0000",
    "category": "sports",
    "authors": [],
    "text": "While his peers were busy studying for their year 12 exams, Jack Parry was on the court making his debut for Australia's national powerchair football team.\n\nThe 17-year-old was the youngest member of the Poweroos as they took out the championship at the Asia Pacific Oceania (APO) Powerchair Football Cup 2025 in Brisbane on Friday.\n\nPowerchair football is a modified version of the outdoor game, with players trying to pass an oversized football into a goal.\n\nThe game is played four-a-side on a basketball court-sized arena.\n\nPlayers spin 180 degrees in their powerchairs, which are specially designed wheelchairs with metal foot guards, to kick the ball, causing it to travel up to 50 kilometres per hour.\n\nJack Parry was the Poweroos's youngest player during the Asia Pacific Oceania cup. (ABC News: Sarah Richards)\n\nParry said the game's \"heart-pumping\" speed got him hooked after going to a come-and-try day when he was 10 years old.\n\n\"I love playing it,\" the Brisbane high school student said.\n\nHe said he had many mentors on the national team who showed him \"what you can do when you're not held back by your disability\".\n\nGrowing sport\n\nOne of those mentors, Tristram Peters, who has played powerchair football for more than 15 years, said it had been \"reassuring and empowering\" to see the next generation come through the sport.\n\nTristram Peters has been playing powerchair football for more than 15 years. (ABC News: Sarah Richards)\n\n\"They push me more than I would care to admit, but it's fantastic to see that the next generation is well and truly here,\" the 34-year-old said.\n\nThe Brisbane veteran player said he remembered the first time Parry attended a powerchair football event, and it was great to see him achieving his dream of playing for Australia.\n\n\"He's going to go very, very far,\" Peters said.\n\nLoading...\n\nParalympic hopes\n\nThis year's APO tournament brought together 35 para-athletes from Australia, Japan, South Korea and New Zealand.\n\nPowerchair Football World Cup build up begins Powerchair football is hoping to piggy-back off the excitement generated by the FIFA Women's World Cup ahead of its own tournament in Sydney in October, but people could find themselves hooked by this relatively new version of the sport.\n\nThe Australian Powerchair Football Association (APFA) said the competition represented an important step on the road for powerchair football to be included at the Brisbane 2032 Paralympics.\n\nPeters said he would \"give anything\" to see \"this beautiful sport\" taken to the next level.\n\nThe athlete said there were no dynamic team powerchair sports he could compete in at the Paralympics, and the event was \"in desperate need\" of one.\n\n\"It's one of the few times where I'm truly independent,\" he said.\n\n\"When I'm on the court, it's just me. I'm not reliant on family, friends, [or] support workers.\"\n\n'I've spent about $10,000 to get here'\n\nLike her teammates, Rebecca Evans said the game meant everything to her.\n\nRebecca Evans is the only female player on the national team. (ABC News: Sarah Richards)\n\n\"The community in powerchair football is amazing, and I really consider them my second family,\" she said.\n\nEvans, who has been playing powerchair football since 2018, said she also loved the game's \"competitiveness\".\n\nThe 27-year-old Melbourne player flew to Brisbane for the APO Cup.\n\nThe Poweroos receive no financial support from national or governing bodies. (ABC News: Sarah Richards)\n\nThe Poweroos are self-funded, which means they receive no financial support from national or governing bodies.\n\n\"For me to get to this tournament, I've spent about $10,000 to get here,\" she said.\n\n\"Sport is such a big part of my life … playing for the Poweroos is my passion,\" Evans said.\n\nMissed out on Paris\n\nAPFA president Kristy Yeadon said the organisation would apply for powerchair football to be a part of the 2032 games.\n\nShe said football was the \"world's sport\" and to have it included at the Paralympics would be a \"true example of equity\".\n\nPlayers compete using specially-modified wheelchairs which allow them to control the ball. (ABC News: Sarah Richards)\n\nThe International Paralympic Committee (IPC) ruled out powerchair football for the 2024 Paralympic Games in Paris.\n\nIn a statement in 2018, the IPC said the sport — along with golf, para dance sport, sailing and karate — \"failed to meet the inclusion criteria in a number of areas\".\n\nAt the time, the IPC said it would continue to work with each of the international sports federations in the ongoing development of their sports.\n\nA spokesperson for Brisbane 2032 told the ABC in a statement the organising committee had received strong interest from a range of sports wanting to be involved in the 2032 Olympic and Paralympic Games.\n\nOlympics set to bring $70 billion in economic opportunities to Queensland The analysis from Deloitte found south-east Queensland could see economic growth of almost $40 billion.\n\nThe spokesperson said it was focused on designing a sports program that reflected the values of the Olympic and Paralympic movements, as well as one that was \"operationally viable, and supports Brisbane 2032's commercial, sustainable, engagement, and experience objectives\".\n\nThe spokesperson said the IPC was responsible for confirming the initial sports program and approving any additional sports.\n\nApplications for sports to be included in the 2032 Paralympics close in mid-December, with the IPC Governing Board expected to decide which sports will be included in the program next year.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/hospital-in-the-home-northwest-tasmania-mental-health/105789004",
    "title": "Tom went from 'nature lover' to agoraphobia, but now he's getting help",
    "publish_date": "Fri, 17 Oct 2025 21:12:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tom French went from being a teenager who loved the outdoors to a young adult who could not leave the house.\n\nCrippling anxiety and agoraphobia led to an autism diagnosis later in his adolescence.\n\n\"He just cut himself off from the world,\" Mr French's mum, Fiona Archer, said.\n\n\" It's been really hard to watch the decline. I'm getting emotional now. \"\n\nTom French and his mother Fiona Archer at home at Turners Beach, near Devonport. (ABC News: Mackenzie Archer)\n\nMr French was referred to the Youth Mental Health Hospital in the Home (HiTH) program after years of not being able to access proper treatment due to his fear of leaving the home.\n\nThe program aims to help youth in Tasmania's north-west with complex and acute mental health concerns and, for the last five weeks, Tom has received in-home care from a range of mental health professionals.\n\nIn-home care boosting confidence\n\nMs Archer said Tom's favourite place in the world was Cradle Mountain and that many of his happiest childhood and adolescent memories took place there.\n\n\"He was a real nature lover, he loved being outdoors,\" Ms Archer said.\n\nTom French at Cradle Mountain around 2019. (Supplied: Fiona Archer)\n\n\"It's just been really hard to see someone who was always willing to be out and about and doing different things to just wanting to be on his own.\"\n\nMs Archer described HiTH as a \"glimmer of hope\" at a time when she no longer knew how to help her son.\n\n\"He couldn't leave the house, so that was the whole issue,\" she said.\n\n\"That's what's been the beauty of Hospital in the Home, that they've actually been able to come here.\"\n\nTom French and sister Meg, with their mother Fiona Archer. (ABC News: Mackenzie Archer)\n\nMr French said just before starting HiTH, he had hit breaking point.\n\n\"I was stuck,\" he said.\n\n\" I was not living, and I knew I wanted to start living my life again. \"\n\nPrior to accessing HITH, Mr French was unable receive care due to his agoraphobia. (ABC News: Mackenzie Archer)\n\nNow, he has gone from locking himself in his room when the program staff arrived, to greeting them at the door.\n\n\"It was uncomfortable at the start, but once I've got to know them, I've opened up more,\" he said.\n\n\" It has made me push myself and start trying new things. Start doing the things I used to do. \"\n\nSenior social worker Simon O'Kane and youth peer worker Hanna Blackburn meet with Mr French (centre). (ABC News: Mackenzie Archer)\n\nDelivering outcomes for the community\n\nHiTH is staffed by a multi-disciplinary team of mental health professionals, including psychiatrists, general practitioners, pharmacists, registered nurses, mental health nurses, social workers, allied health staff, youth workers, and people with lived experience.\n\nSince launching mid last year, the service has gone from operating three beds, five days a week to now operating 12 beds, seven days a week.\n\nThese kids fought back against a national health crisis — and won In the bush, 'burbs and on country, these teenagers are fighting a mental health crisis.\n\nChild and Youth Mental Health Service (CYMHS) North West team leader Dion Butler said there was an increasing need for youth mental health services in the region.\n\n\"There isn't a dedicated hospital mental health ward for young people, it's either the adult ward or the paediatric ward and these are often not appropriate to cater to the developmental needs of this age group,\" Mr Butler said.\n\nChild and Youth Mental Health Service north-west team leader Dion Butler and HITH nurse unit manager Susan Smith in Devonport. (ABC News: Mackenzie Archer)\n\nHe said the program had treated youth with a range of mental health concerns including severe anxiety and depression, first-episode psychosis, schizophrenia, bipolar, borderline personality disorder and eating disorders.\n\nClinical staff conduct full health assessments and develop tailored treatment plans for the patients in the program.\n\nThis includes doing baseline observations, mental health screening, assessing physical health, nutrition, diet, drug and alcohol use, and medication prescriptions.\n\nTom French's Hospital in the Home care plan. (ABC News: Mackenzie Archer)\n\nMr Butler said the program also considered the psychosocial aspect of recovery.\n\n\"Recovery for young people happens in a broader framework outside the standard medical model,\" he said.\n\n\"Our youth workers have helped some of our young people with resumes, job coaching, and getting back to school.\"\n\nHolistic approach to mental health\n\nHiTH senior social worker Simon O'Kane said the program was making a real impact on all levels.\n\n\"It's intensive, which is necessary,\" Mr O'Kane said.\n\nMr O'Kane said the program also treated the social symptoms from illnesses. (ABC News: Mackenzie Archer)\n\n\"We do twice daily visits [and] we're available for the really intensive support early on — which makes a big difference in terms of the outcome.\n\n\"We're not just treating an illness, we're treating the symptoms and all the kind of social deficits around the illness as well, which I feel is different from other services,\" he said.\n\nMental Health Council of Tasmania CEO Dan Vautin said research showed that health outcomes were better when people could receive care in their own environment.\n\nDan Vautin, Mental Health Council of Tasmania CEO. (Facebook: Mental Health Council of Tasmania)\n\n\"No-one wants to end up in hospital if they don't have to,\" Mr Vautin said.\n\nBut … for young Tasmanians experiencing mental health challenges, a hospital is often not the best environment for their care and recovery.\"\n\nTasmania's only large-scale private mental health clinic to close The Hobart Clinic, which employs 100 people, will close its inpatient site by the end of October, citing financial woes.\n\nThe program is calling on the Tasmanian government to secure funding beyond 2026.\n\nAnd with the potential closure of Hobart's last private mental health clinic, the Hobart Clinic, HiTH hopes to expand to other regions of Tasmania to support a growing number of young adults with complex mental health concerns.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-18/ai-camera-trial-rock-fishing-safety-nsw/105902900",
    "title": "AI cameras trialed to boost rock fishing safety",
    "publish_date": "Fri, 17 Oct 2025 21:11:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "One of the state's most dangerous rock fishing spots is the focus of a new Surf Life Saving NSW trial using artificial intelligence to help prevent drownings.\n\nThe 14-month project is underway at Kiama Blowhole, where powerful waves and unpredictable conditions have claimed 11 lives in the past 15 years.\n\nThe new cameras are designed to detect when someone is swept into the water and alert rescue crews within seconds.\n\nDanger spot chosen for trial\n\nSurf Life Saving NSW chief executive Steve Pearce said the technology could make a major difference in one of the state's deadliest coastal locations.\n\nLifesavers trial AI cameras to detect emergencies and improve coastal safety. (Supplied: SLSNSW)\n\n\"This is a really exciting project,\" he said. \"We're using artificial intelligence to improve how quickly we can respond when rock fishers get into trouble.\"\n\nHe said Kiama was chosen because of its history of tragedy.\n\n\"The Blowhole area is unfortunately well known for fatalities,\" he said.\n\n\"We also get so many rescues, and the local clubs at Kiama and Gerringong are constantly called out all year round.\"\n\nThe cameras are mounted overlooking the rock shelf and use high-resolution imaging to monitor the number of people standing on the rocks.\n\n\"The cameras scan the rock shelf every millisecond and count people on the rock shelf,\" he said.\n\n\"So, if ten people, for example, are standing there on the rock shelf fishing, and in a millisecond if it drops down to nine, the artificial intelligence is trained to identify that is one person in the water, and the camera can detect a person in the water.\n\n\"That then initiates an activation of an alarm back in the State Operations Centre in Sydney, and we can automatically plan a response from local life savers and lifeguards, and any of the other emergency services.\"\n\nSurf Life Saving NSW CEO Steve Pearce says the AI camera trial at Kiama Blowhole could transform how lifesavers detect and respond to rock fishing emergencies (Supplied)\n\nLifesavers train the technology by jumping in\n\nTo help train the system, lifesavers are running controlled exercises in calm conditions, jumping into the water to simulate real rescues.\n\n\"Locals will see — what they think looks pretty silly — but we will have groups of people standing there and jumping off into the into the water to train it,\" Mr Pearce said.\n\n\"Anything that can help save a life is worth it.\"\n\nHe said the trial would also strengthen local rescue capability, with jet skis and emergency response teams ready to react once the alarm sounds.\n\n\"People in the community should be proud,\" Mr Pearce said.\n\n\"Kiama is helping lead the way in lifesaving technology.\"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/racing/caulfield-cup-and-the-everest-live-updates-punters-in-melbourne-and-sydney-prepare-for-massive-race-day-20251017-p5n3b9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Caulfield Cup and The Everest LIVE: Ideal spring weather in Melbourne and Sydney on one of Australia’s biggest race days",
    "publish_date": "Sat, 18 Oct 2025 12:49:42 +1100",
    "category": "finance",
    "authors": [
      "Roy Ward",
      "Frances Howe",
      "Danny Russell",
      "Damien Woolnough"
    ],
    "text": "As racegoers are set for their first flutter of the day, on-course bookies accept a changing tide.\n\nAnthony Doughty has been an on-course bookie for 50 years, most of his clients are older and place their bets over the phone.\n\nBookmaker Anthony Doughty at Caulfield on Saturday. Credit: Nicole Precel\n\n“Go back 40 years, the bookmakers had 95 per cent of the market. No casino. No poker machines. If you want a bet you have to have a bookie,” he said\n\nBut now, they have less than 1 per cent.\n\n“It’s like the titanic, everyone is dress up, the food is alright, but as an on course bookie - I know what’s going to happen.”\n\n\n\nHe said the gambling market had changed, with the younger generation preferring tech.\n\n\n\n“Today in broad terms the football has finished, the suns out. Those are the main two things for us,” he said.\n\n“We have good horses - standard of horses this time is better, but that doesn’t mean a thing to a lot of be people.“\n\nBut he believed racing would always have on-course bookies.\n\n\n\n“Competition is good for any industry,” he said.\n\n\n\nMary Mulcahy flies down from the Gold Coast to work with bookies every spring racing carnival.\n\n\n\n“The suns out, the dollars are out,” she said.\n\n\n\n“Caulfield is steeped in tradition, which is good. Still standing. It’s good to have a bit of a mix. There are other courses who people feel are their favourites.\n\n“The Caulfield is steeped in history, it’s good it’s not overshadowed by what’s happening in Sydney today so hopefully we get a piece of the pie.“\n\nShe said they didn’t get 18-25 year olds, their clientele were older.\n\n“I’m sure there’s an element of bookmakers - who put their hands in the air and say I can’t collect any more,” she said",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/nsw/the-common-ground-at-sxsw-20251016-p5n2z3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Common Ground at SXSW",
    "publish_date": "Sat, 18 Oct 2025 12:06:57 +1100",
    "category": "finance",
    "authors": [],
    "text": "Series\n\nThe Common Ground at SXSW\n\nWe all have different ideas, beliefs and priorities, but we have plenty in common too. The Sydney Morning Herald helped SXSW attendees make connections and discover shared views.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/nsw/day-4-the-common-ground-at-sxsw-20251018-p5n3gh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Day 4: The Common Ground at SXSW",
    "publish_date": "Sat, 18 Oct 2025 11:58:37 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add galleries to your saved list and come back to them any time.\n\nWe all have different ideas and beliefs, but we have plenty in common too. The Herald helped SXSW attendees make connections and discover shared views.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/racing/mey-day-mey-day-this-is-the-horse-we-expect-to-win-the-caulfield-cup-20251017-p5n39v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mey day, mey day: This is the horse we expect to win the Caulfield Cup",
    "publish_date": "Sat, 18 Oct 2025 11:56:49 +1100",
    "category": "sports",
    "authors": [
      "Danny Russell"
    ],
    "text": "Meydaan is rated the runner most likely to topple Melham’s red-hot favourite Half Yours in Saturday’s 2400m handicap event on the back of his third in the group 3 September Stakes over 2412m at Kempton Park, England.\n\nMeydaan, an English horse with foreign form lines, looms as the biggest threat to Jamie Melham’s history-making bid to become the first woman to ride the winner of the $5 million Caulfield Cup.\n\nRace 9: $5m Group 1 Caulfield Cup (2400m), 5.15pm\n\nThe favourite: Half Yours catapulted into favouritism after winning the group 3 Naturalism Stakes last month and franked that form with a flashing-light fourth in the Turnbull Stakes. Drops to 52.5kg and has drawn gate two. A big chance for Jamie Melham to land a major group 1. The horse has been in work since March.\n\nThe threats: UK import Meydaan (56kg) has been targeted at this race on the back of solid UK form. Gate five is a big plus, the booking of international jockey Andrea Atzeni is a worry. Ciaron Maher-trained Royal Supremacy (52.5kg) has rocketed into contention after winning The Metropolitan and will be partnered by the singing jockey Robbie Dolan. Not sure about The Metrop as a form race. Punters have also supported Vauban (58.5kg), a former Irish stayer now in the hands of Gai Waterhouse and Adrian Bott, who ran fifth behind Royal Supremacy.\n\nThe roughies: If we think that the Turnbull Stakes is the best lead-up race, then consideration has to go to Deakin (54kg) and Middle Earth (56.5kg), who finished sixth and ninth in that race. Don’t discard Japanese mare Golden Snap (53.5kg), while Adelaide River (54kg) has the potential to lead and pinch the race.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/lifestyle/understanding-menopause-and-the-barriers-women-face-20251018-p5n3g3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Understanding menopause and the barriers women face",
    "publish_date": "Sat, 18 Oct 2025 10:21:18 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Understanding menopause and the barriers women face\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/nsw/day-3-the-common-ground-at-sxsw-20251017-p5n38h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Day 3: The Common Ground at SXSW",
    "publish_date": "Sat, 18 Oct 2025 10:00:53 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add galleries to your saved list and come back to them any time.\n\nWe all have different ideas and beliefs, but we have plenty in common too. The Herald helped SXSW attendees make connections and discover shared views.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/sweeping-reforms-coming-to-every-school-across-australia-20251018-p5n3fy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sweeping reforms coming to every school across Australia",
    "publish_date": "Sat, 18 Oct 2025 09:53:28 +1100",
    "category": "finance",
    "authors": [],
    "text": "Sweeping reforms coming to every school across Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 1
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/why-pat-cummins-stats-only-tell-half-the-story-when-it-comes-to-his-ashes-importance-20251017-p5n38o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Pat Cummins’ stats only tell half the story when it comes to his Ashes importance",
    "publish_date": "Sat, 18 Oct 2025 09:45:00 +1100",
    "category": "sports",
    "authors": [
      "Malcolm Knox"
    ],
    "text": "Of Cummins’s 25 wickets, only two were tailenders. He dismissed India’s top scorer four times in nine innings, and put paid to India’s biggest partnership three times. In another word: quality. “The Postman” delivered (actually, better than the post). The first two matches of last summer’s series perhaps best showed Cummins’s value through the colour of contrast. In Perth, despite having claimed Pant and Reddy, India’s top two scorers, in the first innings, Cummins was off his game. Yashasvi Jaiswal and Virat Kohli pounced, and India won. That second innings in Perth was the only time in the series Cummins did not bowl well, and it meant curtains for Australia. Pat Cummins celebrates after dismissing Rishabh Pant in last year’s Adelaide Test. Credit: Getty Images Cut to Adelaide. On the second day, India were entertaining hopes for a 2-0 lead until they met Cummins in a lean and hungry mood. He removed Rahul in his first spell, and came back when India were threatening a fightback. His dismissal of Rohit and top-scorer Reddy triggered a dramatic collapse, in which Cummins picked up two more wickets, that swung the momentum of the series to Australia. In other words: the timing of his contributions was as significant as the fact. When India were building a partnership, Cummins gave himself the ball. When momentum needed reversing, it was Cummins putting himself in India’s path and rolling them back to where they’d started.\n\nIn the field, he doesn’t drop catches, and he kept his head in the decisive moment of the Melbourne Test when Kohli and Jaiswal confused each other. The Postman delivered the ball soundly for the runout that sank India. Cummins was top of the world bowling tally, with 80 wickets at 23.48, in the last two-year Test championship cycle, but his batting has been an underrated element of Australia’s success. Against India, his 41 runs in Melbourne were critical to Australia’s eventual win. Cummins has increased his versatility with the bat, too. For some years, he was a rich man’s Glenn McGrath, diligent and earnest as the ball clinked off the sour spots on his blade. Recently, he has taught himself to slog, and his cameo of 22 off 10 balls set up Australia’s daring declaration in Brisbane.\n\nIndia have been Australia’s great rivals in recent Test cricket, but the other form guide to the coming Ashes series is the last one. It, too, reveals a lot about Cummins’s impact. England targeted his bowling, and when they got on top of Cummins in the first innings at Edgbaston, and again in the last days of the series, they also got on top of Australia. Cummins and Sam Konstas celebrate Australia’s victory over India in the Boxing Day Test last summer. Credit: Getty Images While Cummins’ Ashes return was 18 wickets at an expensive 37.72 apiece, 13 of his wickets were recognised batsmen, and his most frequent victim was Joe Root, followed by Ben Stokes and Harry Brook. Cometh the man, cometh the bigger man. He also had one of his best series with the bat, his 162 runs including his match-winning 38 and 44 not out at Edgbaston. This number crunching does not take into account what Cummins’ presence and leadership brings to any team he plays in. Teammates trust his character, and Mitchell Starc’s bowling in particular has benefited from having Cummins at his side. Starc’s resurgence as an attacking force in the past two years owes much to the steadiness of his partner.\n\nEvery Jeff Thomson has needed a Dennis Lillee, and every Brett Lee has needed a McGrath. It must be very reassuring to take the field knowing that there is one player who hardly ever has a bad day. Loading If this glowing résumé is beginning to sound like a grim prospectus for Australia, it is. It’s not that they can’t win the Ashes without Cummins; it’s that their margin for error gets considerably tighter. Without Cummins, a lot of other parts of Australia’s game have to go to plan. Runs from their top three, which would have been a nice bonus, now become a necessity. And Nathan Lyon, who only had to chime in when needed last summer, will be required to bowl long, tight spells and take English wickets. All achievable, but much harder without Cummins.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/afl/aflw-round-10-live-the-race-for-the-mcclelland-trophy-heats-up-between-hawks-and-lions-20251016-p5n312.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFLW round 10: Daisy Pearce’s Eagles close on debut finals slot",
    "publish_date": "Sat, 18 Oct 2025 09:21:14 +1100",
    "category": "sports",
    "authors": [
      "Hannah Kennelly"
    ],
    "text": "Daisy Pearce’s West Coast are potentially just one win away from securing a maiden AFLW finals berth after crushing Geelong by 31 points in Perth.\n\nFormer Eagles captain Emma Swanson performed an excellent shutdown job on Geelong star Georgie Prespakis and Lucia Painter kicked three goals as West Coast cruised to the 7.8 (50) to 2.7 (19) win on Friday night.\n\nThe result improved West Coast’s record to 6-4, and they finish their home-and-away campaign with games against Sydney (5-4) and Carlton (6-3).\n\nOne more win would probably be enough to seal a top-eight berth for the sixth-placed Eagles, who posted four wins under Pearce last season and have now recorded a club-record six wins this year.\n\nBut Geelong’s finals hopes are all but over after slumping to a 4-6 record.\n\nSuch were their struggles on Friday night, their second goal didn’t arrive until the final minute, despite winning the inside 50m count 33-28.\n\nPrespakis finished with 19 disposals and four clearances, but a lot of those came when the contest was already over.\n\nSwanson wore her like a glove for long periods of the match, with the Eagles veteran finishing with 19 disposals and one goal for herself.\n\nFirst-year revelation Painter was a force in attack for West Coast with three goals and 404m gained, while Ella Roberts tallied a team-high 25 disposals, eight tackles, three clearances and 380m gained.\n\n“Very confident,” Roberts told Fox Sports when asked how confident she is West Coast can make finals.\n\n“We’ve got top teams coming up, so to get the job done against Geelong tonight, we can carry that confidence into next week and know we can beat anyone.”",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/culture/music/everywhere-you-look-this-weekend-women-will-be-wearing-bald-caps-if-you-know-you-know-20251014-p5n2hv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Everywhere you look this weekend, women will be wearing bald caps. If you know, you know",
    "publish_date": "Sat, 18 Oct 2025 09:09:19 +1100",
    "category": "finance",
    "authors": [
      "Bronte Gossling"
    ],
    "text": "Pitbull, pictured here in Texas in April, says seeing fans dress as him en masse is “an honour”. Credit: Getty Images for 2025 NCAA March Madness Music Festival Pitbull fans went all out in Brisbane on October 17 for Fridayz Live’s first show. It’s the first time Pitbull has toured Australia since 2012. Credit: Mushroom Creative House/Jordan Munns @jordankmunns Mushroom Group and Southern Cross Austereo – the companies behind Fridayz Live – were quick to capitalise on this, offering bald caps for $20 as an add-on when tickets, starting at $199.90 plus fees, went on sale. Loading Although critics lambasted the event’s pricing (and Adelaide’s omission from the tour despite being RNB Fridayz Live’s birthplace), fans happily tacked on the extra expense, with the bald caps selling out almost immediately. Now, finding one that can be delivered in time, without paying an arm and a leg, is an almost Herculean task.\n\nLim was not taking any chances. She purchased hers in May when Fridayz Live announced its line-up. It’s understood Spotlight saw a spike in bald cap sales that same month. Search traffic for “bald caps” and related terms spiked in June, when tickets went on sale, and again in the three weeks before Fridayz Live’s October 17 opening night at Brisbane Showgrounds. “It is very much a community,” says 26-year-old Amber Kades, who will be wearing a bald cap when she attends Melbourne’s turn with her parents and friends. “It’s nice in this day and age, where a lot’s happening now, that you can take a minute and do something fun for yourself and not take yourself seriously.” It’s not just the bald caps that Kades, whose family is from Albania, feels unites the fans. It’s the music itself. Some songs are Spanish-language, others bilingual.\n\n“Even my grandparents who don’t speak English and don’t really understand, they just love the music,” says Kades. Her father introduced her to Pitbull’s music shortly before she went with her parents, cousins, aunties, uncles and grandparents to the Planet Pitt World Tour in 2012, Pitbull’s last trip Down Under. “We took up a whole row … they love the sound of it.” Elsewhere in Marvel Stadium will be 25-year-old Aneesha Dean, whose “obsession” with Pitbull has not wavered from the moment Hotel Room Service was unleashed in 2009. She says dressing up as Pitbull is a “rite of passage” for any true fan. “Dressing up in the bald cap feels almost empowering, feels like whatever men can do, women can do better,” Dean jokes. Amber Kades has been a fan of Pitbull since her father introduced her to his music, just before her whole family went to the 2012 Planet Pit World Tour in Melbourne. Credit: Eddie Jim Kades will be attending Fridayz Live in Melbourne with her parents and friends, but she says she’s the only one of the group who will be dressing up. Credit: Eddie Jim\n\nWould this have been possible without social media? Probably not. Fandom has changed, says University of Sydney senior research associate Dr Emily Baulch. Where deep knowledge of lore used to be valued – hunting down a rare comic was no small feat, and that created status and belonging – social media has lowered the barriers to entry. “Because information is instantly accessible, the value has shifted from knowing to doing,” says Baulch, who has a PhD in media communications. “It’s about performing fandom, being creative, and showing your connection through participation rather than expertise.” Aneesha Dean, 25, finds dressing as Pitbull fun and freeing. Credit: Penny Stephens Brands, such as Netflix with its recent Wednesday Island installation – a fan event in which Cockatoo Island was transformed into a gothic playground – and artists, such as Swift, invite this collaboration, building community and commerce (merchandising, streams and ticket sales) by encouraging the fan-created trends. “It’s a perfect collision of bottom-up and top-down forces,” says Baulch. “The relationship is reciprocal: grassroots creativity drives visibility, while institutional support turns it into a shared cultural moment and financial boon.”",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/ange-hits-back-at-critics-in-extraordinary-presser-20251018-p5n3fs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ange hits back at critics in extraordinary presser",
    "publish_date": "Sat, 18 Oct 2025 09:06:28 +1100",
    "category": "finance",
    "authors": [],
    "text": "Ange hits back at critics in extraordinary presser\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/breast-cancer-leaves-tattoo-battle-scars-but-with-a-little-help-louise-is-having-hers-removed-20251016-p5n36h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Breast cancer leaves tattoo ‘battle scars’, but with a little help Louise is having hers removed",
    "publish_date": "Sat, 18 Oct 2025 09:00:00 +1100",
    "category": "finance",
    "authors": [
      "Wendy Tuohy"
    ],
    "text": "Louise Schirmer would like to have followed the advice of fashion designer and breast cancer survivor Camilla Franks on how to navigate treatment for the most common cancer among Australian women.\n\nBut she did not have the luxury.\n\nLouise Schirmer was left with six permanent tattoos after her breast cancer treatment. Credit: Joe Armao\n\n“Camilla used to say, ‘When you go through breast cancer treatment, be the CEO of your medical plan’,” says Schirmer, a mother of three and Australian general manager for power procurement company AECO Energy.\n\n“But most people don’t have that choice. Because it happens so quickly, you just take the medical advice. Everything is out of your control, and you have no power over the situation. You do what you need to do.”",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/camper-says-he-didn-t-think-he-would-survive-after-going-missing-for-nine-days-20251018-p5n3fr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Camper says he didn’t think he would survive after going missing for nine days",
    "publish_date": "Sat, 18 Oct 2025 08:56:17 +1100",
    "category": "finance",
    "authors": [],
    "text": "Camper says he didn’t think he would survive after going missing for nine days\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-18-october-2025/knmeaqsib",
    "title": "Midday News Bulletin 18 October 2025",
    "publish_date": "Sat, 18 Oct 2025 01:03:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n\n\nTRANSCRIPT\n\n\n\nHamas transfers another hostage body to Israel\n\nAlbanese government investing $10 million in anti-bullying review\n\nMax Verstappen to start first in the sprint race at the Grand Prix\n\n—-\n\n\n\n\n\nHamas has transferred the body of another Israeli hostage to the Red Cross.\n\n\n\nThis was the 10th deceased hostage Israel has received out of 28 bodies held in Gaza.\n\n\n\nThe two sides have been casting blame at each other for failing to uphold terms of the ceasefire.\n\n\n\nHamas says it needed heavy machinery and excavating equipment to speed up the process of locating bodies buried under rubble.\n\n\n\nIsrael said on Thursday it was preparing for the reopening of Gaza's Rafah crossing with Egypt to allow Palestinians to move in and out, but has provided no date.\n\n\n\nOther unresolved elements of the peace plan include the disarmament of militants and Gaza's future governance.\n\n\n\n---\n\n\n\nUS President Donald Trump has confirmed he will meet with Chinese President Xi Jinping in two weeks in South Korea, following doubt over whether the meeting would go ahead.\n\n\n\nThe US President blames China for the latest impasse in trade talks, and says Beijing forced him to propose 100 per cent tariffs on goods from China, despite admitting that it wasn't sustainable.\n\n\n\n\"But with tariffs we've made hundreds of billions of dollars not only from China but from others. And China wants to talk and we like talking to China, so we have a very good relationship and we're going to be meeting in South Korea in a couple of weeks.\"\n\n\n\nTrump unveiled additional levies of 100 per cent on China's US-bound exports a week ago, along with new export controls on any and all critical software by November 1, nine days before existing tariff relief was set to expire.\n\n\n\nThe new trade actions were Trump's reaction to China dramatically expanding its export controls on rare earth elements.\n\n\n\n---\n\n\n\nTreasurer Jim Chalmers says he's encouraging US investors to engage in the Australian market for renewable energy.\n\n\n\nSpeaking from New York City, Dr Chalmers says he's been speaking with the biggest investors representing around $25 trillion of funds under management.\n\n\n\n\"Our pitch is that Australia can be a hub, a digital hub in Asia. That we can be an indispensable part of the net zero transformation, that our geography, the stability of our institutions, our solar macro foundations and fundamentals, these are all things we have going for us. So, there's a lot coming at us from around the world, but we have a lot going for us here in Australia.\"\n\n\n\n---\n\n\n\nThe Albanese government is investing $10 million to support anti-bullying review recommendations.\n\n\n\nThe review has support from education ministers across the country.\n\n\n\nTwo of the main recommendations of the review include a national awareness campaign, as well as resources for teachers, students and parents on how to stand up against bullying with evidence showing peer-based approaches can be powerful.\n\n\n\nEducation Minister Jason Clare said in a statement that bullying is cruel and dangerous, and says that is why the government has taken action with a national plan.\n\n\n\nMinister Clare spoke on Channel 9's Today Show.\n\n\n\n\"We're going to allocate $5 million to provide some tools for teachers. Parents have told us, sorry teachers have told us that they need the tools and the training so they can do the job properly.\"\n\n\n\nThere are also calls for schools to respond within two school days to a complaint or incident.\n\n\n\n---\n\n\n\nMax Verstappen will start first in the sprint race at the Grand Prix after upstaging both the McLarens in qualifying.\n\n\n\nThe defending champion clocked the fastest time of one minute 32.143 seconds on Friday, beating Lando Norris by a mere 0.071s and championship leader Oscar Piastri in the other McLaren.\n\n\n\nNorris appeared to have the edge on the Australian around the sweeping Texas circuit, backing up his blistering pace in the only practice session by topping the first two sessions of sprint qualifying.\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/champion-of-champions-remembering-dr-charles-perkins-25-years-after-his-death/hfxjo6lph",
    "title": "Champion of champions: Remembering Dr Charles Perkins 25 years after his death",
    "publish_date": "Fri, 17 Oct 2025 19:36:25 +0000",
    "category": "sports",
    "authors": [],
    "text": "This article contains references/and or images of a deceased Aboriginal person.\n\n\n\n\n\nTwenty-five years ago today, I was working at the Sydney 2000 Summer Paralympic Games with a team of other Indigenous media representatives — an unforgettable moment in our nation's sporting and cultural history.\n\n\n\n\n\nOn the way out to Homebush on the morning of 18 October, my phone rang.\n\n\n\n\n\nIt was my boss in Canberra with heartbreaking news — Aboriginal leader Dr Charles Perkins had passed away after a three-month illness.\n\n\n\n\n\nHe asked me to divert to a Sydney hospital to assist the Perkins family with the wave of media calls and enquiries that were already coming in.\n\n\n\n\n\nAt the time, Perkins was a Commissioner with the Aboriginal and Torres Strait Islander Commission (ATSIC), where I worked, although my family had known the Perkins family since the late 1970s.\n\n\n\nI met the family at the hospital, took over the media requests, and later that day we gathered at their inner-city home.\n\n\n\n\n\nOver the following hours, countless friends, extended family, community leaders and people from all walks of life came by to offer condolences and support to his wife Eileen and their children — Hetti, Rachel and Adam.\n\n\n\n\n\nPerkins' passing led the national news that day across print, television and radio.\n\n\n\n\n\nThe family decided to make a statement later that afternoon to the increasing number of media outlets now camped outside the family house.\n\n\n\n\n\nHetti, Rachel, Adam and I adjourned to the study to draft the words that would be shared publicly.\n\n\n\n\n\nIt was a moment heavy with emotion, as the family sought to honour their father with dignity while facing an overwhelming outpouring of grief and attention from across the country.\n\n\n\n\n\nHow does a short statement encapsulate his extraordinary life?\n\n\n\n\n\nPerkins was such a fearless spokesman and renowned activist for Aboriginal rights — many referred to him as Australia's Nelson Mandela for his similar fight against racial discrimination and for civil rights.\n\n\n\nThe handwritten note prepared by Perkins' family to announce his passing. Credit: John Paul Janke He was born at the Alice Springs Telegraph Station Aboriginal Reserve in the Northern Territory in 1936.\n\n\n\n\n\nAt the age of 10, he was sent to a home for boys in Adelaide, where he completed his schooling.\n\n\n\n\n\nA talented soccer player, Perkins played as a professional with English club Everton.\n\n\n\n\n\nOn his return to Australia, he played with the Croatian club, Adelaide and the Pan-Hellenic club, Sydney.\n\n\n\n\n\nWhile studying at the University of Sydney, Perkins became increasingly active in Indigenous rights issues.\n\n\n\n\n\nIn 1965 he gained notoriety by leading a group of fellow students on the Freedom Ride — a tour of rural NSW centres to highlight the discrimination that existed for Aboriginal and Torres Strait Islander peoples in many country towns.\n\n\n\n\n\nPerkins was one of the early leaders for Aboriginal rights and will be particularly remembered for leading the freedom rides in the 1960s.\n\n\n\nREAD MORE On the 60th anniversary of the Freedom Ride, Walgett locals reflect on its enduring legacy\n\nThe Foundation for Aboriginal Affairs in Sydney, which Perkins played a significant role in establishing in the 1960s, spawned a new generation of Aboriginal activists.\n\n\n\n\n\nPerkins combined activism and public service into one.\n\n\n\n\n\nHis appointment as the first Indigenous senior executive in the Australian Public Service in the 1970s, his leadership as a departmental head and chairperson of the Aboriginal Development Commission in the 1980s, and his work as ATSIC commissioner all confirmed his place in the forefront of modern Australian history.\n\n\n\n\n\nAt the age of 55, he was initiated as an Arrernte wadi, a man at the beginning of his journey.\n\n\n\n\n\nFor his children, his bureaucratic achievements spoke for themselves — they wanted their words to focus on the gift of a kidney that extended their dad's life.\n\n\n\n\n\nAt the time of his passing, Perkins was the longest post-transplant survivor in Australia.\n\n\n\n\n\nStatement in hand, we walked out to face the large media pack that had gathered outside their house.\n\n\n\n\n\nCameras, microphones, and reporters filled the street. Aboriginal leader Christine Williams, then deputy chair of ATSIC's Sydney Regional Council, spoke first.\n\n\n\n\n\nWilliams reflected on knowing Perkins since she was 11 years old, saying: \"He ruffled and plucked some feathers, whatever had to be done. He was listened to because he said it with a heart and he meant what he said — and he walked alongside his people, not above them.\"\n\n\n\nFor decades, Charles Perkins combined Indigenous activism and public service into one. Source: Supplied The Perkins children huddled together, standing side by side — stoic, proud, and with a quiet strength.\n\n\n\n\n\nThen his eldest daughter Hetti spoke.\n\n\n\n\n\n\"Dr Charles Nelson Perkins, Arrernte and Kalkadoon man, passed away today at about 10am from complications related to renal failure,\" she said.\n\n\n\n\n\n\"He was surrounded by his family and friends in Sydney.\n\n\n\n\n\n\"The last 30 years of his life were made possible by a kidney donation. This generous gift allowed him to continue his fight for justice for his people. All Australians can draw strength from his legacy to continue in striving towards achieving recognition for the rights of Indigenous people,\" she continued.\n\n\n\n\n\n\"Charlie's spirit remains with us, the Aboriginal and Torres Strait Islander people of Australia,\" Hetti concluded.\n\n\n\n\n\nCameras flashed as we returned to the house.\n\n\n\n\n\nTo this day, Perkins is still remembered as a man who dedicated his life to achieving justice for Aboriginal and Torres Strait Islander people in Australia, a renowned activist, fearless spokesperson; a man who loved his culture and his family.\n\n\n\n\n\nHe never backed down from his beliefs, nor compromised them.\n\n\n\n\n\nHe fought tirelessly for Indigenous rights, equality, and self-determination.\n\n\n\n\n\nHis courage, leadership, and vision helped transform Australia's understanding of justice and reconciliation, leaving a powerful legacy for future generations.\n\n\n\n\n\nPerkins was buried with a state funeral on 25 October at Sydney Town Hall.\n\n\n\n\n\nOn the inside of the service booklet from his state funeral was a quote that remains just as relevant today.\n\n\n\n\n\nIt read: \"My expectation of a good Australia is when white people would be proud to speak an Aboriginal language, when they realise that Aboriginal culture and all that goes with it, philosophy, art, language, kinship, is all part of their heritage. And that is the most unbelievable thing of all, that it's all there waiting for us all. White people can inherit 40,000 or 60,000 years of culture, and all they have to do is reach out and ask for it.\"\n\n\n\n\n\nThose words continue to resonate — a reminder of the enduring impact of Charles Perkins' fight for equality and justice, and of the unfinished work that still lies ahead.\n\n\n\n\n\nDr Charles Nelson Perkins AO — the champion of champions — was aged 64.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/video/sculpture-by-the-sea-showcasing-artists-from-australia-and-the-world/tflf50snm",
    "title": "Sculpture by the sea: Showcasing artists from Australia and the world",
    "publish_date": "Fri, 17 Oct 2025 09:12:59 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Sculpture by the sea: Showcasing artists from Australia and the world\n\nPublished 17 October 2025, 6:58 am\n\nIt was almost cancelled at the 11th hour, but the world's largest free outdoor sculpture exhibition has returned to Sydney. The art trail is expected to entice nearly half a million visitors from around the country and the world.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/gold-price-warning-as-some-traditional-buyers-tap-out-at-record-levels/pdtyehkrm",
    "title": "Gold price warning as some traditional buyers tap out at record levels",
    "publish_date": "Fri, 17 Oct 2025 06:30:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/is-australian-banking-becoming-less-inclusive-and-accessible/w2hi2lrci",
    "title": "The quiet creep that's making Australian banking less 'inclusive and accessible'",
    "publish_date": "Fri, 17 Oct 2025 05:25:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "New data showing a continued decline in the number of physical banking services around Australia has raised concerns among advocates who say banking needs to be inclusive and accessible.\n\n\n\n\n\nFrom June 2020 to June 2025, the number of bank branches across Australia fell by 33 per cent, with a 4.6 per cent drop in the last year alone, newly released data from Australia's chief financial industry regulator shows.\n\n\n\n\n\nOver the 2020-2025 timespan, the number of ATMs fell by 47 per cent, according to the Australian Prudential Regulation Authority's (APRA) annual Points of Presence report.\n\n\n\n\n\nThe report provides comprehensive data on banking services provided to Australians, including face-to-face branch services, other face-to-face points of service, banking services at Australia Post (Bank@Post), ATMs and EFTPOS machines.\n\n\n\nSource: SBS News Advocates say internet access, security concerns and challenges with technology mean face-to-face banking and cash remain essential.\n\n\n\n\n\nAngel Zhou, director of the Research, Regenerative Futures Institute at RMIT University, told SBS News that while technological advances in banking should be encouraged, they should be happening at a \"balanced speed\".\n\n\n\n\n\n\"On the one hand, we need to stimulate innovations in technology, but on the other hand, we need to ensure that our finance is inclusive and accessible to everyone,\" Zhou said.\n\n\n\nWhat happens when bank branches and ATMs close?\n\nChris Grice, CEO of National Seniors Australia, told SBS News that despite many older Australians transitioning to digital banking, many find digital systems challenging and some cannot afford or operate smart devices to use banking apps.\n\n\n\n\n\nFace-to face interactions with bank tellers can also be important for identifying older Australians who may be experiencing financial elder abuse, Grice said.\n\n\n\n\n\nIn the government's 2022 Survey of Older People snapshot, 2 per cent of people aged 65 and older living in the community reported experiencing financial abuse in the past year.\n\n\n\n\n\n\"Bank tellers have done a great job over time in actually flagging or identifying circumstances whereby a carer or family member, they've basically been pressuring or intimidating an older person in terms of their money situation,\" Grice said.\n\n\n\nGrice added that younger people must also rely on face-to-face banking in certain circumstances.\n\n\n\n\n\n\"If you're trying to sort out deceased estates, you can't do these things electronically. They need to see physical copies, they need to cite the copies, as in, original documents,\" he said.\n\n\n\n\n\nShortfalls in tech and internet coverage also sometimes necessitate physical services.\n\n\n\n\n\nCash and in-person banking can become crucial to all Australians when banking apps fail, Grice noted.\n\n\n\nAustralia's major banks — including CommBank, Bank Australia, Westpac and NAB — have all experienced online banking failures in the past two years.\n\n\n\n\n\nZhou said face-to-face banking can be essential for those living in regional and rural areas because digital banking relies on internet service, and internet infrastructure in such areas is \"relatively weaker, compared to the metro areas\".\n\n\n\nSecurity concerns and scams\n\nPatricia Sparrow, CEO of the Council on the Ageing Australia (COTA), told SBS News that face-to-face banking also remains important for those with security concerns.\n\n\n\n\n\n\"Any large financial transaction that you do, it's actually easier to go in and speak to a branch than having to do it all online,\" she said.\n\n\n\n\n\n\"I've spoken to people who have done a big financial transaction — that might be whether they've moved house or whatever it is — and they're very nervous about doing that online.\"\n\n\n\nSparrow said in-person banking can also feel more reassuring to older Australians, who are the demographic most likely to be targeted by and fall victim to scammers.\n\n\n\n\n\n\"If you've been the victim of a scam, you're going to be very uncertain and not confident to do something online. Going to somebody who can really help you is going to be important,\" she said.\n\n\n\n\n\nAccording to recent data from the Australian Competition and Consumer Commission, Australians are reporting fewer scams in 2025 compared to previous years, but reports of financial losses to the National anti-Scam Centre's Scamwatch service have increased significantly .\n\n\n\nBanks 'pivotal' to regional communities\n\nBoth Grice and Sparrow said there are flow-on effects for local communities when bank branches close.\n\n\n\n\n\nGrice said banks and Australia Post are \"pivotal and central to a community and maintaining the prosperity of those communities\".\n\n\n\n\n\n\"If Australia Post is shut down in a town or their bank is shut down in a town, that means people have to go to the next town to do that sort of stuff,\" he said.\n\n\n\n\n\n\"What happens therefore is that normal trade, people who might have a coffee or lunch or whatever, they don't buy it in their local town; they buy it when they have their trip 40 or 50 minutes down the road.\"\n\n\n\nLISTEN TO Regional bank closures halted for now; but there's an alternative SBS News 03:58 English\n\nSparrow said bank branches closing can make it more difficult for small businesses in regional areas to operate, and there is a loss of connection for people who need face-to-face banking services.\n\n\n\n\n\n\"We don't want to lose the human connection and what's important in the community. I know there's lots of jokes about bankers but it is an essential service and people actually do like going in and talking to a real person and not everything being automated,\" she said.\n\n\n\nGovernment mandate for accepting cash\n\nA list of recommendations published following a 2023 Senate inquiry into bank closures in regional Australia included the government adopting a policy to recognise access to financial services as essential, including a commitment to guaranteeing reasonable access to cash and financial services for all Australians.\n\n\n\n\n\nThe Senate committee also recommended a banking code of conduct or customer service code that included a \"robust branch closure process\" that would include meaningful consultation with communities before a branch is closed and ongoing support for access to cash and essential banking services.\n\n\n\n\n\nThis year, regional and remote areas experienced the smallest fall recorded since the APRA data series began, due to a moratorium on regional branch closures agreed between the federal government and major banks in February this year and running through to mid-2027.\n\n\n\n\n\nLast year, the Albanese government also pledged to mandate businesses to accept cash when selling essential items such as groceries and fuel, with a proposed start date of January 2026.\n\n\n\nOn Friday, Assistant Treasurer Daniel Mulino announced the government was releasing a draft of those regulations.\n\n\n\n\n\n\"We recognise that Australians are increasingly using digital payment methods, but there will be an ongoing place for cash in our society under the Albanese Government,\" Mulino said.\n\n\n\n\n\nGrice said a mandate is necessary to keep banks from closing branches.\n\n\n\n\n\n\"We need to make sure that there's a follow-through on this particular process; it's important. To have physical cash as a backup is important,\" he said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/ace-frehley-of-kiss-dies-at-74/ex1w3teta",
    "title": "KISS founding member and lead guitarist Ace Frehley dies at 74",
    "publish_date": "Fri, 17 Oct 2025 05:02:45 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Ace Frehley, the original lead guitarist and founding member of the glam rock band KISS, who captivated audiences with his elaborate makeup and smoke-filled guitar, has died. He was 74.\n\n\n\n\n\nFrehley died peacefully, surrounded by family, in Morristown, New Jersey, following a recent fall, according to his agent.\n\n\n\n\n\nFamily members said in a statement they are \"completely devastated and heartbroken\" but will cherish his laughter and celebrate the kindness he bestowed upon others.\n\n\n\n\n\nKISS, whose hits included Rock and Roll All Nite and Detroit Rock City, was known for its theatrical stage shows, with fireworks, smoking instruments and fake blood spewing from the mouths of band members in body armour, platform boots, wigs and signature black-and-white face paint.\n\n\n\n\n\nBandmembers took on the personas of comic book-style characters — Frehley was known as Space Ace and the Spaceman.\n\n\n\nAce Frehley performed at Brooklyn Bowl Las Vegas at The LINQ Promenade in 2016 in Las Vegas, Nevada. Source: AFP / Ethan Miller \"We are devastated by the passing of Ace Frehley,\" band members Gene Simmons and Paul Stanley said in a joint statement.\n\n\n\n\n\n\"He was an essential and irreplaceable rock soldier during some of the most formative foundational chapters of the band and its history. He is and will always be a part of KISS's legacy.\"\n\n\n\n\n\nThe band was extremely popular, especially in the mid-1970s, selling tens of millions of albums and licensing its iconic look to sell numerous products.\n\n\n\n\n\nFrehley and his bandmates were inducted into the Rock and Roll Hall of Fame in 2014.\n\n\n\nFrehley left the band in 1982, skipping the years when they took off the makeup and had mixed success. He performed both as a solo artist and with his band, Frehley's Comet.\n\n\n\n\n\nBut he rejoined KISS in the mid-1990s for a triumphant reunion and restoration of their original style that came after bands including Nirvana, Weezer and the Melvins had expressed their affection for the band and paid them musical tributes.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 3
  },
  {
    "url": "https://www.sbs.com.au/news/article/worker-compensation-australia-claims-report-2025/wwqkll5l9",
    "title": "Hundreds of claims a day: Are these Australia's most dangerous jobs?",
    "publish_date": "Fri, 17 Oct 2025 01:28:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "A third of jobs accounted for more than half of Australia's serious work injury claims in 2024, while only three in 10 injured workers across the entire workforce reported receiving workers' compensation.\n\n\n\n\n\nSafe Work Australia's Key Work Health and Safety Statistics Australia report for 2025, released on Friday, revealed 188 workers died from traumatic injuries while working in Australia in 2024, with a rate of 1.3 deaths per 100,000 workers.\n\n\n\n\n\nOver the past decade, that figure has decreased by 24 per cent, from a rate of 1.7 fatalities per 100,000 workers in 2014.\n\n\n\n\n\nWorkers aged 45 and over accounted for more than half of worker fatalities recorded.\n\n\n\n\n\nAustralia's peak body representing workers, the Australian Council of Trade Unions (ACTU), said while a fall in the fatality rate is welcome, 188 families still lost a loved one last year.\n\n\n\nVehicle incidents accounted for 42 per cent of worker fatalities in 2024. Source: SBS News ACTU assistant secretary Liam O'Brien said in a statement: \"Health and care workers, tradies, factory workers and the people who keep our communities safe are at the greatest risk.\"\n\n\n\n\n\n\"One death at work is one too many, and our job is far from done.\"\n\n\n\n\n\nThere were 146,700 serious workers' compensation claims involving at least one week or working time lost in 2023-2024 — more than 400 serious claims a day.\n\n\n\nWhat did the report find?\n\nSafe Work Australia's report found four sectors collectively made up more than half of the 146,700 serious workers' compensation claims in 2024.\n\n\n\n\n\nThose industry divisions were health care and social assistance (19.9 per cent), construction (12 per cent), manufacturing (10.1 per cent) and public administration and safety (9.2 per cent).\n\n\n\n\n\nHowever, those sectors only represented 36.3 per cent of filled jobs covered by a workers' compensation scheme.\n\n\n\n\n\nOverall, across all industries, three in 10 injured workers reported receiving workers' compensation, while the rest either did not lodge a claim or did not receive compensation.\n\n\n\n\n\nThe ACTU expressed alarm that seven in 10 injured workers were not receiving compensation, citing barriers in reporting and under-reporting that obscured the actual cost of workplace injuries across Australia.\n\n\n\n\n\nWhen it came to fatalities, machinery operators and drivers represented 61 worker deaths in 2024, with a rate of 6.7 fatalities per 100,000 workers. This was followed by labourers (50 fatalities), managers, technicians and trades workers (28 fatalities).\n\n\n\nIn 2024, machinery operators and drivers accounted for the highest proportion of worker fatalities (32 per cent) and also recorded the highest fatality rate at 6.7 fatalities per 100,000 workers, according to the report. Source: SBS News The agriculture, forestry and fishing industry had a rate of 13.7 fatalities per 100,000 workers in 2024, followed by transport, postal and warehousing (7.4 fatalities per 100,000 workers) and mining (3.4 fatalities per 100,000 workers).\n\n\n\n\n\nVehicle incidents were by far the most common cause of death at 42 per cent, and at least one vehicle was directly involved in the incident in 66 per cent of worker fatalities in 2024.\n\n\n\n\n\nOther causes of death included falls from a height (13 per cent), being hit by moving objects (9 per cent), being hit by falling objects (7 per cent), and being trapped by moving machinery or equipment or between stationary and moving objects (both 5 per cent).\n\n\n\n\n\nWorkers aged 45 and over accounted for more than half of worker fatalities recorded.\n\n\n\nMental health claims on the rise\n\nThe report also found that over the past decades, serious claims for mental health conditions have experienced the largest change across any major injury group, with a 161 per cent increase.\n\n\n\n\n\nMental stress is now the fourth most common cause of serious claims, at 11.5 per cent.\n\n\n\nREAD MORE The $3.8 billion reason Australian workers would leave their jobs\n\nThe median time lost from serious claims related to mental stress is about five times the median time lost across all serious claims and leads to significantly more time off work.\n\n\n\n\n\nMental health claims also represented the costliest form of workplace injury — leading to more than four times the median compensation paid across all serious claims.\n\n\n\n\n\nWhile men accounted for the vast majority of deaths (180) in 2024 and accounted for 58 per cent of all serious claims, the report found women's serious claims were more than twice as likely to involve mental health conditions as men's.\n\n\n\n\n\nOn average, women's claims also involved more time away from work. Median compensation paid for serious claims remains 20.4 per cent higher for men — $17,600 to $14,600.\n\n\n\n\n\nThe ACTU said unions were calling for greater legislative protection for workers who were exposed to psychosocial hazards on the job, such as violence and aggression, sexual harassment and discrimination.\n\n\n\n\n\nO'Brien said: \"Employers must treat work stress and intensification with the same seriousness as any other health and safety consideration.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/sport/racing/caulfield-cup-and-the-everest-live-updates-punters-in-melbourne-and-sydney-prepare-for-massive-race-day-20251017-p5n3b9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Caulfield Cup and The Everest LIVE: Ideal spring weather in Melbourne and Sydney on one of Australia’s biggest race days",
    "publish_date": "Sat, 18 Oct 2025 12:49:42 +1100",
    "category": "finance",
    "authors": [
      "Roy Ward",
      "Frances Howe",
      "Danny Russell",
      "Damien Woolnough"
    ],
    "text": "As racegoers are set for their first flutter of the day, on-course bookies accept a changing tide.\n\nAnthony Doughty has been an on-course bookie for 50 years, most of his clients are older and place their bets over the phone.\n\nBookmaker Anthony Doughty at Caulfield on Saturday. Credit: Nicole Precel\n\n“Go back 40 years, the bookmakers had 95 per cent of the market. No casino. No poker machines. If you want a bet you have to have a bookie,” he said\n\nBut now, they have less than 1 per cent.\n\n“It’s like the titanic, everyone is dress up, the food is alright, but as an on course bookie - I know what’s going to happen.”\n\n\n\nHe said the gambling market had changed, with the younger generation preferring tech.\n\n\n\n“Today in broad terms the football has finished, the suns out. Those are the main two things for us,” he said.\n\n“We have good horses - standard of horses this time is better, but that doesn’t mean a thing to a lot of be people.“\n\nBut he believed racing would always have on-course bookies.\n\n\n\n“Competition is good for any industry,” he said.\n\n\n\nMary Mulcahy flies down from the Gold Coast to work with bookies every spring racing carnival.\n\n\n\n“The suns out, the dollars are out,” she said.\n\n\n\n“Caulfield is steeped in tradition, which is good. Still standing. It’s good to have a bit of a mix. There are other courses who people feel are their favourites.\n\n“The Caulfield is steeped in history, it’s good it’s not overshadowed by what’s happening in Sydney today so hopefully we get a piece of the pie.“\n\nShe said they didn’t get 18-25 year olds, their clientele were older.\n\n“I’m sure there’s an element of bookmakers - who put their hands in the air and say I can’t collect any more,” she said",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/racing/mey-day-mey-day-this-is-the-horse-we-expect-to-win-the-caulfield-cup-20251017-p5n39v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mey day, mey day: This is the horse we expect to win the Caulfield Cup",
    "publish_date": "Sat, 18 Oct 2025 11:56:49 +1100",
    "category": "sports",
    "authors": [
      "Danny Russell"
    ],
    "text": "Meydaan is rated the runner most likely to topple Melham’s red-hot favourite Half Yours in Saturday’s 2400m handicap event on the back of his third in the group 3 September Stakes over 2412m at Kempton Park, England.\n\nMeydaan, an English horse with foreign form lines, looms as the biggest threat to Jamie Melham’s history-making bid to become the first woman to ride the winner of the $5 million Caulfield Cup.\n\nRace 9: $5m Group 1 Caulfield Cup (2400m), 5.15pm\n\nThe favourite: Half Yours catapulted into favouritism after winning the group 3 Naturalism Stakes last month and franked that form with a flashing-light fourth in the Turnbull Stakes. Drops to 52.5kg and has drawn gate two. A big chance for Jamie Melham to land a major group 1. The horse has been in work since March.\n\nThe threats: UK import Meydaan (56kg) has been targeted at this race on the back of solid UK form. Gate five is a big plus, the booking of international jockey Andrea Atzeni is a worry. Ciaron Maher-trained Royal Supremacy (52.5kg) has rocketed into contention after winning The Metropolitan and will be partnered by the singing jockey Robbie Dolan. Not sure about The Metrop as a form race. Punters have also supported Vauban (58.5kg), a former Irish stayer now in the hands of Gai Waterhouse and Adrian Bott, who ran fifth behind Royal Supremacy.\n\nThe roughies: If we think that the Turnbull Stakes is the best lead-up race, then consideration has to go to Deakin (54kg) and Middle Earth (56.5kg), who finished sixth and ninth in that race. Don’t discard Japanese mare Golden Snap (53.5kg), while Adelaide River (54kg) has the potential to lead and pinch the race.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/lifestyle/understanding-menopause-and-the-barriers-women-face-20251018-p5n3g3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Understanding menopause and the barriers women face",
    "publish_date": "Sat, 18 Oct 2025 10:21:18 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Understanding menopause and the barriers women face\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/sweeping-reforms-coming-to-every-school-across-australia-20251018-p5n3fy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sweeping reforms coming to every school across Australia",
    "publish_date": "Sat, 18 Oct 2025 09:53:28 +1100",
    "category": "finance",
    "authors": [],
    "text": "Sweeping reforms coming to every school across Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 1
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/why-pat-cummins-stats-only-tell-half-the-story-when-it-comes-to-his-ashes-importance-20251017-p5n38o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Pat Cummins’ stats only tell half the story when it comes to his Ashes importance",
    "publish_date": "Sat, 18 Oct 2025 09:45:00 +1100",
    "category": "sports",
    "authors": [
      "Malcolm Knox"
    ],
    "text": "Of Cummins’s 25 wickets, only two were tailenders. He dismissed India’s top scorer four times in nine innings, and put paid to India’s biggest partnership three times. In another word: quality. “The Postman” delivered (actually, better than the post). The first two matches of last summer’s series perhaps best showed Cummins’s value through the colour of contrast. In Perth, despite having claimed Pant and Reddy, India’s top two scorers, in the first innings, Cummins was off his game. Yashasvi Jaiswal and Virat Kohli pounced, and India won. That second innings in Perth was the only time in the series Cummins did not bowl well, and it meant curtains for Australia. Pat Cummins celebrates after dismissing Rishabh Pant in last year’s Adelaide Test. Credit: Getty Images Cut to Adelaide. On the second day, India were entertaining hopes for a 2-0 lead until they met Cummins in a lean and hungry mood. He removed Rahul in his first spell, and came back when India were threatening a fightback. His dismissal of Rohit and top-scorer Reddy triggered a dramatic collapse, in which Cummins picked up two more wickets, that swung the momentum of the series to Australia. In other words: the timing of his contributions was as significant as the fact. When India were building a partnership, Cummins gave himself the ball. When momentum needed reversing, it was Cummins putting himself in India’s path and rolling them back to where they’d started.\n\nIn the field, he doesn’t drop catches, and he kept his head in the decisive moment of the Melbourne Test when Kohli and Jaiswal confused each other. The Postman delivered the ball soundly for the runout that sank India. Cummins was top of the world bowling tally, with 80 wickets at 23.48, in the last two-year Test championship cycle, but his batting has been an underrated element of Australia’s success. Against India, his 41 runs in Melbourne were critical to Australia’s eventual win. Cummins has increased his versatility with the bat, too. For some years, he was a rich man’s Glenn McGrath, diligent and earnest as the ball clinked off the sour spots on his blade. Recently, he has taught himself to slog, and his cameo of 22 off 10 balls set up Australia’s daring declaration in Brisbane.\n\nIndia have been Australia’s great rivals in recent Test cricket, but the other form guide to the coming Ashes series is the last one. It, too, reveals a lot about Cummins’s impact. England targeted his bowling, and when they got on top of Cummins in the first innings at Edgbaston, and again in the last days of the series, they also got on top of Australia. Cummins and Sam Konstas celebrate Australia’s victory over India in the Boxing Day Test last summer. Credit: Getty Images While Cummins’ Ashes return was 18 wickets at an expensive 37.72 apiece, 13 of his wickets were recognised batsmen, and his most frequent victim was Joe Root, followed by Ben Stokes and Harry Brook. Cometh the man, cometh the bigger man. He also had one of his best series with the bat, his 162 runs including his match-winning 38 and 44 not out at Edgbaston. This number crunching does not take into account what Cummins’ presence and leadership brings to any team he plays in. Teammates trust his character, and Mitchell Starc’s bowling in particular has benefited from having Cummins at his side. Starc’s resurgence as an attacking force in the past two years owes much to the steadiness of his partner.\n\nEvery Jeff Thomson has needed a Dennis Lillee, and every Brett Lee has needed a McGrath. It must be very reassuring to take the field knowing that there is one player who hardly ever has a bad day. Loading If this glowing résumé is beginning to sound like a grim prospectus for Australia, it is. It’s not that they can’t win the Ashes without Cummins; it’s that their margin for error gets considerably tighter. Without Cummins, a lot of other parts of Australia’s game have to go to plan. Runs from their top three, which would have been a nice bonus, now become a necessity. And Nathan Lyon, who only had to chime in when needed last summer, will be required to bowl long, tight spells and take English wickets. All achievable, but much harder without Cummins.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/afl/aflw-round-10-live-the-race-for-the-mcclelland-trophy-heats-up-between-hawks-and-lions-20251016-p5n312.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFLW round 10: Daisy Pearce’s Eagles close on debut finals slot",
    "publish_date": "Sat, 18 Oct 2025 09:21:14 +1100",
    "category": "sports",
    "authors": [
      "Hannah Kennelly"
    ],
    "text": "Daisy Pearce’s West Coast are potentially just one win away from securing a maiden AFLW finals berth after crushing Geelong by 31 points in Perth.\n\nFormer Eagles captain Emma Swanson performed an excellent shutdown job on Geelong star Georgie Prespakis and Lucia Painter kicked three goals as West Coast cruised to the 7.8 (50) to 2.7 (19) win on Friday night.\n\nThe result improved West Coast’s record to 6-4, and they finish their home-and-away campaign with games against Sydney (5-4) and Carlton (6-3).\n\nOne more win would probably be enough to seal a top-eight berth for the sixth-placed Eagles, who posted four wins under Pearce last season and have now recorded a club-record six wins this year.\n\nBut Geelong’s finals hopes are all but over after slumping to a 4-6 record.\n\nSuch were their struggles on Friday night, their second goal didn’t arrive until the final minute, despite winning the inside 50m count 33-28.\n\nPrespakis finished with 19 disposals and four clearances, but a lot of those came when the contest was already over.\n\nSwanson wore her like a glove for long periods of the match, with the Eagles veteran finishing with 19 disposals and one goal for herself.\n\nFirst-year revelation Painter was a force in attack for West Coast with three goals and 404m gained, while Ella Roberts tallied a team-high 25 disposals, eight tackles, three clearances and 380m gained.\n\n“Very confident,” Roberts told Fox Sports when asked how confident she is West Coast can make finals.\n\n“We’ve got top teams coming up, so to get the job done against Geelong tonight, we can carry that confidence into next week and know we can beat anyone.”",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/culture/music/everywhere-you-look-this-weekend-women-will-be-wearing-bald-caps-if-you-know-you-know-20251014-p5n2hv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Everywhere you look this weekend, women will be wearing bald caps. If you know, you know",
    "publish_date": "Sat, 18 Oct 2025 09:09:19 +1100",
    "category": "finance",
    "authors": [
      "Bronte Gossling"
    ],
    "text": "Pitbull, pictured here in Texas in April, says seeing fans dress as him en masse is “an honour”. Credit: Getty Images for 2025 NCAA March Madness Music Festival Pitbull fans went all out in Brisbane on October 17 for Fridayz Live’s first show. It’s the first time Pitbull has toured Australia since 2012. Credit: Mushroom Creative House/Jordan Munns @jordankmunns Mushroom Group and Southern Cross Austereo – the companies behind Fridayz Live – were quick to capitalise on this, offering bald caps for $20 as an add-on when tickets, starting at $199.90 plus fees, went on sale. Loading Although critics lambasted the event’s pricing (and Adelaide’s omission from the tour despite being RNB Fridayz Live’s birthplace), fans happily tacked on the extra expense, with the bald caps selling out almost immediately. Now, finding one that can be delivered in time, without paying an arm and a leg, is an almost Herculean task.\n\nLim was not taking any chances. She purchased hers in May when Fridayz Live announced its line-up. It’s understood Spotlight saw a spike in bald cap sales that same month. Search traffic for “bald caps” and related terms spiked in June, when tickets went on sale, and again in the three weeks before Fridayz Live’s October 17 opening night at Brisbane Showgrounds. “It is very much a community,” says 26-year-old Amber Kades, who will be wearing a bald cap when she attends Melbourne’s turn with her parents and friends. “It’s nice in this day and age, where a lot’s happening now, that you can take a minute and do something fun for yourself and not take yourself seriously.” It’s not just the bald caps that Kades, whose family is from Albania, feels unites the fans. It’s the music itself. Some songs are Spanish-language, others bilingual.\n\n“Even my grandparents who don’t speak English and don’t really understand, they just love the music,” says Kades. Her father introduced her to Pitbull’s music shortly before she went with her parents, cousins, aunties, uncles and grandparents to the Planet Pitt World Tour in 2012, Pitbull’s last trip Down Under. “We took up a whole row … they love the sound of it.” Elsewhere in Marvel Stadium will be 25-year-old Aneesha Dean, whose “obsession” with Pitbull has not wavered from the moment Hotel Room Service was unleashed in 2009. She says dressing up as Pitbull is a “rite of passage” for any true fan. “Dressing up in the bald cap feels almost empowering, feels like whatever men can do, women can do better,” Dean jokes. Amber Kades has been a fan of Pitbull since her father introduced her to his music, just before her whole family went to the 2012 Planet Pit World Tour in Melbourne. Credit: Eddie Jim Kades will be attending Fridayz Live in Melbourne with her parents and friends, but she says she’s the only one of the group who will be dressing up. Credit: Eddie Jim\n\nWould this have been possible without social media? Probably not. Fandom has changed, says University of Sydney senior research associate Dr Emily Baulch. Where deep knowledge of lore used to be valued – hunting down a rare comic was no small feat, and that created status and belonging – social media has lowered the barriers to entry. “Because information is instantly accessible, the value has shifted from knowing to doing,” says Baulch, who has a PhD in media communications. “It’s about performing fandom, being creative, and showing your connection through participation rather than expertise.” Aneesha Dean, 25, finds dressing as Pitbull fun and freeing. Credit: Penny Stephens Brands, such as Netflix with its recent Wednesday Island installation – a fan event in which Cockatoo Island was transformed into a gothic playground – and artists, such as Swift, invite this collaboration, building community and commerce (merchandising, streams and ticket sales) by encouraging the fan-created trends. “It’s a perfect collision of bottom-up and top-down forces,” says Baulch. “The relationship is reciprocal: grassroots creativity drives visibility, while institutional support turns it into a shared cultural moment and financial boon.”",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/ange-hits-back-at-critics-in-extraordinary-presser-20251018-p5n3fs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ange hits back at critics in extraordinary presser",
    "publish_date": "Sat, 18 Oct 2025 09:06:28 +1100",
    "category": "finance",
    "authors": [],
    "text": "Ange hits back at critics in extraordinary presser\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/breast-cancer-leaves-tattoo-battle-scars-but-with-a-little-help-louise-is-having-hers-removed-20251016-p5n36h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Breast cancer leaves tattoo ‘battle scars’, but with a little help Louise is having hers removed",
    "publish_date": "Sat, 18 Oct 2025 09:00:00 +1100",
    "category": "finance",
    "authors": [
      "Wendy Tuohy"
    ],
    "text": "Louise Schirmer would like to have followed the advice of fashion designer and breast cancer survivor Camilla Franks on how to navigate treatment for the most common cancer among Australian women.\n\nBut she did not have the luxury.\n\nLouise Schirmer was left with six permanent tattoos after her breast cancer treatment. Credit: Joe Armao\n\n“Camilla used to say, ‘When you go through breast cancer treatment, be the CEO of your medical plan’,” says Schirmer, a mother of three and Australian general manager for power procurement company AECO Energy.\n\n“But most people don’t have that choice. Because it happens so quickly, you just take the medical advice. Everything is out of your control, and you have no power over the situation. You do what you need to do.”",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/camper-says-he-didn-t-think-he-would-survive-after-going-missing-for-nine-days-20251018-p5n3fr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Camper says he didn’t think he would survive after going missing for nine days",
    "publish_date": "Sat, 18 Oct 2025 08:56:17 +1100",
    "category": "finance",
    "authors": [],
    "text": "Camper says he didn’t think he would survive after going missing for nine days\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/lifestyle/prince-andrew-gives-up-royal-titles-after-king-charles-meeting-20251018-p5n3fn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Prince Andrew gives up royal titles after King Charles meeting",
    "publish_date": "Sat, 18 Oct 2025 08:37:13 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Prince Andrew gives up royal titles after King Charles meeting\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/national/victorian-premier-under-fire-for-comments-on-melbourne-s-safety-20251018-p5n3fo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victorian Premier under fire for comments on Melbourne’s safety",
    "publish_date": "Sat, 18 Oct 2025 08:36:17 +1100",
    "category": "finance",
    "authors": [],
    "text": "Victorian Premier under fire for comments on Melbourne’s safety\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 36
  }
]