[
  {
    "url": "https://www.9news.com.au/national/man-found-dead-in-river-in-doomadgee-queensland/a043a875-1bfd-48f2-834d-ef1f4853c133",
    "title": "Mystery after man found dead in outback river",
    "publish_date": "Thu, 14 Aug 2025 01:04:10 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "At about 1.15pm on Sunday, August 10, emerge﻿ncy services were called to the Nicholson River, Doomadgee, after reports of a man in the water.\n\nAt about 1.15pm on Sunday, August 10, emerge﻿ncy services were called to the Nicholson River, Doomadgee, after reports of a man in the water.\n\nThe crucial factor that could soon cost every Aussie $14,000 a year\n\nThe 43-year-old had last been seen in Doomadgee on August 5.\n\nThe 43-year-old had last been seen in Doomadgee on August 5.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/donald-trump-quad-meeting-in-brisbane-premier-david-crisafulli-anthony-albanese-support-bid/6f9529e2-9f53-4a4e-b718-0ca8af932a46",
    "title": "How one move could give Albanese the upper hand in his first Trump showdown",
    "publish_date": "Thu, 14 Aug 2025 00:08:25 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "T﻿he prime minister has backed a bid to host Donald Trump alongside other world leaders at the 2026 Quad summit in Brisbane .\n\nQueensland Premier David Crisafulli described it as a \"golden opportunity\" to bring the US president to Australia.\n\nIt would also provide a chance for Anthony Albanese and the US president to finally have a formal sitdown.\n\nREAD MORE: Early morning earthquake hits Victoria\n\nPrime Minister Anthony Albanese has thrown his support behind hosting the 2026 Quad summit in Brisbane. (Alex Ellinghausen)\n\nThe PM said he has spoken to Crisafulli and supports the pitch to have the annual foreign leaders' meeting in the Sunshine State.\n\nAlbanese vowed to work with the premier to \"make sure that happens\".﻿\n\n\"I want to showcase this great state of Queensland to the world, particularly in the lead-up to Brisbane 2032,\" he said.\n\nCrisafulli told Today that his Quad bid is not just about bringing Trump and his team to Australia.\n\n\"It's not about a president, it's about an economic opportunity across four nations,\" the premier said.\n\n\"If we want things, we can't sit back, we've got to go out and get them.\n\n\"I feel the way things are happening at the moment, this state is on the verge of going to the next level, and we're going to reach out and grab it.\"\n\nQueensland Premier David Crisafulli said he wanted to \"grab\" the opportunity to host the meeting. (Jamila Filippone)\n\nThe diplomatic meeting, which India is scheduled to host next month, brings leaders from the US, Australia, India and Japan to discuss security and prosperity for the Indo-Pacific region.\n\nHowever, ongoing trade tensions could threaten to derail the four-nation sitdown after Trump threatened to double tariffs on Indian exports to the US.\n\nThere are concerns Indian Prime Minister Narendra Modi may pull the plug on the meeting, further delaying any meeting between Albanese and Trump.\n\nThe PM had flagged the meeting, which was expected to take place in New Delhi, as a po﻿tential backdrop for his first in-person conversation with Trump.\n\nUS President Donald Trump and Anthony Albanese are yet to meet following the PM's re-election. (Getty)\n\nNo date has been confirmed for the Quad meeting this year or next.﻿\n\nAlbanese yesterday said he was not ruling out the chance of a Trump meeting at a UN summit in New York next month.﻿\n\n\"I'm available for a meeting with President Trump at very short notice, at any time,\" the PM told the media.\n\n\"We'll continue to engage. We engaged with our American colleagues on a ministerial level, and I've been engaged in constructive discussions with President Trump.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/earthquake-hits-mornington-peninsula-victoria/a97dcc43-0bd4-46c2-bfa9-a97d4ce00e6f",
    "title": "Early morning earthquake hits Victoria",
    "publish_date": "Wed, 13 Aug 2025 22:05:59 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/taylor-swift-life-of-a-showgirl-album-release-date/17acc7ff-137f-47bc-ad61-02c57f262d73",
    "title": "Taylor Swift reveals the image millions of people have been waiting for",
    "publish_date": "Thu, 14 Aug 2025 00:31:22 +0000",
    "category": "entertainment",
    "authors": [
      "Aug"
    ],
    "text": "After almost 24 hours of intense fanfare T﻿aylor Swift has revealed the cover and release date for her 12th studio album, The Life of a Showgirl.\n\nIt shows Swift, 35, lying in a pool of water dressed in a rhinestone-encrusted bodysuit and with her face partly submerged.﻿\n\nShe also announced the album's release date is October 3, 2025, just 50 days away.\n\nREAD MORE: Early morning earthquake hits Victoria\n\nTaylor Swift has revealed The Life of a Showgirl Album cover and track list. (Taylor Swift)\n\nDetails about the new album hit Swift's official website at 9am AEST after another online countdown like the one she used to tease the album announcement yesterday.\n\nPhotos from the site show Swift decked out in classic showgirl attire, from jewelled headdresses to feathered sleeves.﻿\n\nShe also released four limited edition deluxe versions of the CD for pre-sale﻿: the Sweat and Vanilla Perfume Edition, It's Frightening Edition, It's Rapturous Edition and It's Beautiful Edition.\n\n﻿The Life of a Showgirl will feature 12 tracks with titles like Elizabeth Taylor, Father Figure, Eldest Daughter and CANCELLED!.\n\nThe titular track will also feature ﻿popstar Sabrina Carpenter, who opened for Swift on the Australian leg of her mammoth Eras Tour in 2024.\n\nTaylor Swift poses for promotional material for her new album The Life of a Showgirl. (Instagram)\n\nHere's the full ﻿ The Life of a Showgir l tracklist:\n\nThe Fate of Ophelia Elizabeth Taylor Opalite Father Figure Eldest Daughter Ruin the Friendship Actually Romantic Wi$h Li$t Wood CANCELLED! Honey The Life of a Showgirl (Feat. Sabrina Carpenter) ﻿\n\nFans were surprised to discover the tracklist matched that of a leaked vinyl alleged to be an early copy of Swift's 12th album which circulated ﻿online earlier this year.\n\nSwift's album cover reveal also coincided with her appearance on New Heights , the podcast her boyfriend Travis Kelce co-hosts with brother Jason Kelce.﻿\n\nThere she revealed a physical copy of ﻿ The Life of a Showgirl vinyl, which she pulled out of a briefcase emblazoned with her initials.\n\nSwift's album cover reveal coincided with her appearance on her boyfriend's podcast. (Nine)\n\nSwift's new album will drop less than a year after she wrapped up her global Eras Tour, which ran from March 17, 2023 until December 8, 2024.\n\nShe played 49 shows across 21 months﻿ and five continents, and recorded her largest ever when she performed to 96,000 fans at the MCG in Melbourne.\n\nLess than six months after wrapping up the tour, Swift hit another milestone when she bought back the master recordings to her first six albums.\n\nIt meant she had control over her entire catalogue for the first time and would no longer need to re-record her self-titled debut album or her sixth album Reputation .\n\nSome fans had hoped that she would release previously unheard 'vault tracks'﻿ from those albums as bonus content with her latest record but so far those theories appear to be unfounded.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/finance/productivity-australia-what-is-it-why-its-important-goverment-roundtable-tax-explained/70c962e5-90da-4fed-9888-661ff0318a38",
    "title": "The crucial factor that could soon cost every Aussie $14,000 a year",
    "publish_date": "Wed, 13 Aug 2025 19:51:16 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Productivity: it's the crucial economic principle that has helped propel Australians into some of the best living standards in the world.\n\nBut ﻿even as politicians and economists discuss it more and more, ahead of the federal government's crucial upcoming roundtable, it's something that many people still don't quite understand.\n\nSo what actually is productivity, and why are experts so concerned with it at the moment? This is what you need to know.\n\nProductivity has driven the massive improvement in Australian living standards since mid-last century. (Edwina Pickles/SMH)\n\nWhat is productivity?\n\nThink of productivity as working smarter, not harder.﻿\n\nEconomically speaking, productivity is the amount of output you get from a set of inputs.\n\nInputs are things like labour – often measured as the number of employees or number of hours worked – and capital, while output is the amount of goods and services produced.\n\nFor a basic example, let's say a fast food outlet employs five staff, who work a combined 200 hours per week, and produces 5000 burgers over the course of that week. Its productivity would be 25 burgers per hour worked.\n\n﻿So, put super simply, productivity is how much stuff you get from a set amount of effort.﻿\n\nProductivity growth has been slowing in Australia and most other advanced economies. (Louie Douvis/AFR)\n\n﻿Is productivity falling in Australia?\n\nProductivity itself isn't falling, but productivity growth is most certainly on the decline in Australia.\n\n﻿The Australian Bureau of Statistics' (ABS) main, top-line measure of productivity growth has fallen substantially in recent years.\n\nIn 2022-23, the 20-year average annual growth rate had fallen to 0.9 per cent, down from 1.2 per cent the year before and just half of the 1.8 per cent it was in 2003-04.\n\nIt's important to note this problem isn't unique to Australia; just about every developed country is experiencing slowing productivity.\n\nWhy does that matter?\n\nImproved productivity is responsible for Australians' improved living standards.\n\nIt leads to higher wages, ﻿more (and cheaper and better-quality) goods and services available, bigger profits for businesses, and overall economic growth.\n\nIt also even paves the way for more leisure time; according to the Productivity Commission, the average Australian now spends five fewer hours at work every week than in 1960 due to better productivity.\n\nBut if growth continues to slow, it puts all those benefits at risk.\n\nImproved productivity has allowed companies to produce more goods that are both cheaper and better quality. (Getty)\n\n﻿To put a dollar figure on it, the Productivity Commission estimates that full-time workers will be $14,000 a year worse off by 2035 if Australia can't rediscover its previous growth and instead continues on its current trend.\n\n﻿\"The implications of that, I think, are already being felt,\" RBA Governor Michele Bullock said on August 12.\n\n\"Real wages are not rising by very much, because that's the implication of slow productivity growth is that real wages can't grow as quickly.\n\n\"If we can get productivity growth up, that will allow for more growth in real wages, which is ultimately good for Australians.\"\n\nArtificial intelligence has been touted as a potential productivity gamechanger. (Getty)\n\nSo why is everyone talking about it now?\n\nWhile economists ﻿have been discussing productivity for decades – the Productivity Commission was established in the late '90s – a few developments have thrust it very firmly into the public eye.\n\nMost recently, the Reserve Bank downgraded its productivity growth forecasts from 1 to 0.7 per cent per year over the medium term.\n\n﻿That came a week out from the federal government's productivity roundtable (officially the Economic Reform Roundtable), which was announced by Prime Minister Anthony Albanese in June.\n\nREAD MORE: National push for teachers to use AI in Aussie schools ﻿\n\nRBA Governor Michelle Bullock has warned Australians are already feeling the pinch of slowing productivity growth. (Dominic Lorrimer)\n\nWhat's the deal with the government's productivity roundtable?\n\nThe roundtable, to be held from August 19-21 in Canberra, will be a three-day discussion involving business and union leaders ﻿about how to address stagnating productivity growth.\n\nMany of the ideas put forward ahead of the summit have focused on tax (although AI, regulation, and even a four-day working week have also been discussed), following these comments made by Treasurer Jim Chalmers in June.\n\n\"No sensible progress can be made on productivity, resilience or budget sustainability without proper consideration of more tax reform,\" he told the National Press Club.\n\n\"I don't just accept that, I welcome it. Tax is one of many ways our three primary economic challenges are related﻿.\"\n\nTreasurer Jim Chalmers flagged the economic roundtable could lead to tax reform. (Rohan Thomson/AFR)\n\nWill anything come out of it?﻿\n\nThat's the trillion-dollar question.\n\nAlbanese has been giving mixed messages﻿, at one point ruling out any new tax reform (\"the only tax policy that we're implementing is the one that we took to the election\") and reminding everyone that he and his ministers get final say on any productivity solutions (\"governments make government policy\").\n\nBut the prime minister has also welcomed the glut of proposals he and Chalmers have been presented with, and has insisted he's \"up for big reform\" – although it might be something he takes to the next election in 2028.\n\n\"We're up for discussion, and one of the things I said very clearly was we weren't going to get into the rule-in, rule-out game,\" he told ABC radio.\n\n\"We have a big agenda. We were elected with a clear mandate on May 3. That's our priority, delivering on that.\n\n\"But we're also up for ideas and we're up for things that can be done immediately. If they will improve the economy, then of course we'll give it consideration.\"\n\nAnthony Albanese has ruled out any new tax reform but at the same time said he's open to big ideas. (James Brickwood)\n\nRespected economist Richard Holden, who along with independent MP Kate Chaney proposed a revised GST model for the roundtable , said it was crucial that proper reform does come out of the summit.\n\n﻿\"That's the question: is the upcoming August 19 roundtable going to be a moment for genuinely thinking about bold ideas?\" he said.\n\n\"Or is it going to be another one of these pro-forma﻿... we have three days, we'll put out a press release and we go back to normal?\n\n\"I hope it's the former.\"﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/aldi-australias-best-supermarket-canstar-awards/5585cf2a-e49c-4175-a7c6-7dd2fab9346c",
    "title": "Australia's favourite supermarket crowned as shopping costs surge",
    "publish_date": "Wed, 13 Aug 2025 22:36:16 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Customers have once again crowned Aldi as Australia's favourite supermarket, even as the cost of the weekly shop around the country continues to rise.\n\nCanstar Blue said a survey of customers gave Aldi the \"Most Satisfied Customer Award for Supermarkets\" after the major chains were rated across a series of categories.\n\nBut a huge range of shoppers are splitting their grocery bill between supermarkets and specialist shops like butchers, in an effort to find the best products for the best value.\n\nREAD MORE: Early morning earthquake hits Victoria ﻿\n\nAldi has been crowned Australia's favourite supermarket. (Getty)\n\nIt's the eighth consecutive time Aldi has netted the award, and the 13th overall, with customers giving it a five-star rating for overall satisfaction, value for money, product freshness, store and website presentation, and own-brand quality.﻿\n\nMeanwhile, IGA scored five stars for customer service and checkout experience, and Woolworths received top marks for its product range.﻿\n\nHowever, Aussies around the country are paying increasing amounts at the checkout, with the average weekly spend on groceries for a household of four﻿ hitting $240, up 11 per cent from $216 last year, and a $50-plus leap from $187 in the not-so-distant year of 2021.\n\nThe cost of the average weekly shop has surged. (The Age/Luis Enrique Ascui)\n\nThe leap in the past 12 months is the biggest annual increase Canstar Blue﻿ registered in the past five years.\n\nThe same average household thus spends $12,480 on groceries a year, up almost $3000 from the 2021 total of $9274.\n\nAs people seek the most from their money, shopping around between supermarkets has become an increasingly common practice, with 61 per cent of shoppers saying they visited two or more supermarkets each week.﻿\n\nEpic operation gives injured firefighter a new face View Gallery\n\nAnd outside of that, 41 per cent said they visited specialty stores like ﻿grocers and butchers, largely because they thought the products on offer were better quality.\n\nMore than 80 per cent of respondents said they had changed their shopping habits in the past year to try to keep costs down, including spending more time checking item prices, buying in bulk, buying marked-down products near their expiry date, sticking with seasonal fruit and vegetables, dropping treats like chocolate, and opting for frozen veggies over fresh.\n\n\"Consistently low prices are overwhelmingly what Australians want from their supermarket, far more than convenience, variety, or even rewards,\" Canstar Blue spokesperson Eden Radfors said.\n\n\"Every move, no matter how small, can make a difference, particularly when the average weekly spend for a household of four at the supermarket has climbed 11 per cent from the previous year to hit $240. That's a big jump for a non-negotiable purchase.\"",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/finance/kodak-camera-company/302dfbf6-9165-4634-9565-96fa59bc7d60",
    "title": "Why a once-giant camera company may soon cease operations",
    "publish_date": "Wed, 13 Aug 2025 22:08:10 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Eastman Kodak, the 133-year-old photography company, is warning investors that it might not survive much longer.\n\nIn its earnings report earlier this week, the company warned that it doesn't have \"committed financing or available liquidity\" to pay its roughly $500 million (AUD$763 million) in upcoming debt obligations.\n\n\"These conditions raise substantial doubt about the company's ability to continue as a going concern,\" Kodak said in a filing.\n\nKodak has been around for 133 years, but the once giant company may be in its final days. (AP)\n\nKodak aims to conjure up cash by ceasing payments for its retirement pension plan. It also said that it doesn't expect tariffs to have \"material impacts\" on its business because it manufactures many of its products, including cameras, inks and film in the United States.\n\n\"In the second quarter, Kodak continued to make progress against our long-term plan despite the challenges of an uncertain business environment,\" said Kodak CEO Jim Continenza in the earnings release.\n\nIn a statement to CNN, a Kodak spokesperson said that it's \"confident it will be able to pay off a significant portion of its term loan well before it becomes due, and amend, extend or refinance our remaining debt and/or preferred stock obligations.\"\n\nShares of Eastman Kodak (KODK) slumped more than 25 per cent in midday trading on Tuesday.\n\nRise and fall\n\nThe Eastman Kodak Company was incorporated in 1892, but the company traces its roots back to 1879, when George Eastman obtained his first patent for a plate-coating machine. In 1888, Eastman sold the first Kodak camera for $25.\n\nAt the time, photography was not a mass business because of the technical skills and equipment needed to do it, but the Kodak camera was designed to make photography more widely accessible. Eastman coined the slogan: \"You push the button, we do the rest.\"\n\nThe name was largely meaningless, with the word \"Kodak,\" according to the company, being invented by Eastman out of thin air: \"The letter 'K' had been a favorite with me — it seems a strong, incisive sort of letter.\"\n\nKodak had a century of success producing cameras and film. At one point in the 1970s, it was responsible for 90 per cent of film and 85 per cent of camera sales in the United States, according to The Economist. Paul Simon's hit song \"Kodachrome\" topped the charts in 1973.\n\nKodak tried and failed to keep up with the digital revolution. (Marina Oliphant)\n\nBut that powerful market position would not last because of the technology the company invented: Kodak introduced the first digital camera in 1975.\n\nKodak failed to capitalise on the rise of the digital technology. In 2012, it filed for bankruptcy. At the time of its Chapter 11 filing, it had 100,000 creditors and debts totaling $6.75 billion.\n\nIn 2020, Kodak had a brief moment of reprieve when the US government tapped it to transform into a pharmaceutical ingredients producer. Kodak's stock price rose so fast it tripped 20 circuit breakers throughout the trading session.\n\nDespite its recent losses, Kodak recently said it aims to expand that part of its business. The company continues to manufacture films and chemicals for businesses, including the movie industry, and it licenses its brand for a variety of consumer products.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/australian-company-hypetap-shuts-down-offices-every-three-months-recharge-day/c8cb5702-c2f6-4452-b50d-f30e0df5b4b6",
    "title": "'Shut everything down': Aussie boss offers unusual perk to staff",
    "publish_date": "Wed, 13 Aug 2025 19:11:12 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "An Australian boss is championing workplace flexibility by shutting down his company's three offices every three months for a quarterly \"recharge day\".\n\nFour-day work weeks are back on the public agenda after the Australian Council of Trade Unions (ACTU) suggested it as a way to increase productivity, however Bryce Coombe's team has introduced something a little different.\n\nHypetap, an influencer marketing agency with offices in Sydney, Melbourne and London, offers staff an extra, no-strings-attached day off every quarter.\n\nHypetap MD Bryce Coombe said recharge days are key to staff well-being. (Supplied)\n\nHypetap managing director Coombe told 9news.com.au that a regular \"recharge day\" on top of weekends, public holidays and annual leave helps his high-performing team to avoid burnout.\n\n\"The best sports stars in the world don't run 100 kilometres all day, every day and never rest,\" Coombe said.\n\n\"We thought, how do we take that principle and that learning and apply it to our team? Because our team is also high-performing.\"\n\nThe staff at Hypetap's Melbourne and Sydney offices are offered the same day off four times per year, while those in London prefer different days due to the different seasons.\n\nCoombes and the leadership team took a mathematical approach to when each quarter they should shut the offices down.\n\n\"We looked at the calendar and we calculated the biggest gaps and periods between public holidays,\" he said.\n\n\"Particularly in the middle of the year, it's very Melbourne-centric, but when it's dark and cold and miserable, where the next public holiday is a long way away.\"\n\nHyeptap also always makes the recharge day a Friday, giving staff an additional four three-day weekends every year.\n\nIt was a post-COVID idea the company introduced three years ago.\n\nHypetap shuts down its offices in Sydney, Melbourne and London every few months. (Supplied)\n\nCoombe said the nearly 40 staff members in his growing team \"love\" the extra time off.\n\n\"All of our clients are aware of it and know so it doesn't interrupt service in any way,\" he added.\n\n\"You need good processes and systems to allow you to do this kind of recharge day activity.\"\n\nAssociate professor at the ANU Research School of Management David Cheng has noticed Australian offices are rejecting rigid structure in ways that aren't just working from home or four day weeks.\n\nThese are top 10 'best' companies to work for in Australia View Gallery\n\nHe said extra benefits like this need to be backed up by a strong culture to actually impact well-being.\n\n\"If you have a recharge day but then work extra hard, you may lose the benefit of having the recharge day in the first place,\" Cheng explained.\n\nHe believes the same might be true for companies trialling the four-day week.\n\n\"Switching to four days a week, if you don't have the right/management culture may not lead to the same benefits and could lead to more stress,\" Cheng added.\n\n\"The research suggests that people who work four days can be as productive as five.\n\n\"That said, it's worth remembering that many of the companies that have done this so far, may have good managers who care about their workers and organisations with the right culture to try new things.\"\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nThe staff at Hyeptap's Melbourne and Sydney offices are offered the same day off four time per year. (Getty)\n\nCoombe said Hypetap's leadership team aims to cultivate a positive work-life balance outside of recharge days too.\n\nIt's not just about throwing in a free day off to avoid addressing core issues, he explained.\n\n\"Our team's well-being, avoiding burnout and making sure that we're delivering great results is really important to us,\" he said.\n\n\"It's a way of tangibly putting our money where our mouth is. It's not just like, hey, get one day off for your birthday.\n\n\"These are four set days where we're going to shut everything down, literally the building shuts down on those days.\n\n\"It's about exemplifying and being demonstrative about our beliefs.\"",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/world/mcdonalds-japans-pokemon-card-happy-meals-promotion-comes-to-an-unhappy-end/9293723c-a1a8-4e21-9217-db2b58681479",
    "title": "McDonald's Japan's Pokemon card Happy Meals promotion comes to an unhappy end",
    "publish_date": "Wed, 13 Aug 2025 18:05:59 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Fast-food chain McDonald's Japan has cancelled a Happy Meal campaign that came with coveted Pokemon cards, apologising after resellers rushed to buy the meals and then discarded the food, leaving trash outside stores.\n\nThe meals, called Happy Sets in Japan, were meant for children.\n\nThey came with a toy, such as a tiny plastic Pikachu, and a Pokemon card and sold out in a day, according to Japanese media reports.\n\nImages shared to X show the huge queues at McDonald's in Japan when the Pokemon specials went on sale. (X)\n\nMounds of wasted food were found near the stores.\n\n\"We do not believe in abandoning and discarding food,\" the company said in a statement.\n\n\"This situation goes against our longtime philosophy that we have cherished as a restaurant to 'offer a fun dining experience for children and families'.\n\n\"We sincerely accept that our preparations had not been adequate.\"\n\nMcDonald's said it was working on ways to prevent such a situation from happening again, such as limiting the number of meals each person can buy and ending online orders.\n\nMcDonald's Japan was forced to abruptly end the promotion, saying \"we do not believe in abandoning and discarding food\". (X)\n\nIt said it might deny service to customers who fail to abide by the rules.\n\n\"We vow to return to the basics of what lies behind the Happy Set, which is about helping to bring smiles to families so we can contribute to the wholesome development of the hearts and bodies of children, who are our future,\" the company said.\n\nCollecting Pokemon cards is popular among adults and children in many places, with the most popular cards selling for $US1000 ($1500) or more.\n\nUnusually large crowds were seen flocking to McDonald's stores when the meals with Pokemon cards went on sale.\n\nThe cards were later being resold for up to tens of thousands of yen online.",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.9news.com.au/national/maggie-beer-national-press-club-mission-to-transform-food-aged-care-sector-australia/2dd7d6a5-d563-46c6-9b1c-d75aac2a6649",
    "title": "Maggie Beer has an urgent financial deadline for her aged care mission",
    "publish_date": "Wed, 13 Aug 2025 05:34:55 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Maggie Beer has a financial deadline for her culinary mission to transform food at thousands of aged care homes .\n\nThe effusive celebrity chef, 80, is using her reputation and influence to head up the Maggie Beer Foundation and has been working to put delicious food onto the plates of vulnerable elderly Australians.\n\nSpeaking at the National Press Club in Canberra today, Beer said the government cash injection to her foundation for first-of-its-kind specialised chef training in aged care homes will run out in 2026.\n\nREAD MORE: National push for teachers to use AI in Aussie classrooms\n\nMaggie Beer, Founder of the Maggie Beer Foundation addresses the media at the National Press Club. (Getty)\n\n\"We simply have not got the capacity to meet demand and our current funding ends in September next year,\" Beer said.\n\n\"[We've had] 135 homes will be through this program. Every day, we get a new inquiry. 135 homes doesn't sound much, but believe you me, the filtering down effect is there.\n\n\"We, the foundation, myself, personally, are advocating fiercely for it to continue.\"\n\nBeer is building a roadmap for a future model of aged care and food is at the heart of it.\n\nPart of the mission is to bridge the training gap in cook and chef roles across the nearly 2700 Commonwealth-subsidised homes in Australia.\n\nHer message has been simple: lovingly-prepared, nutritious food equals better wellbeing.\n\nShe told the press club that an ageing population urgently demands more skilled chefs, kitchen hands and staff with a passion for food.\n\n\"Beautiful food will make such a difference to the wellbeing of residents and pride of the teams,\" she said.\n\n\"Without those equal amounts of flavour, goodness and pleasure, food becomes a commodity.\n\n\"Food becomes institutionalised, and leads to residents not eating well, or not eating enough. And that leads to malnutrition.\"\n\nBeer is building a roadmap for a future model of aged care and food is at the heart of it. (Getty)\n\nBeer said meals shouldn't be an \"afterthought\" in aged care homes.\n\nBut she acknowledged that underfunding is rampant. In 2021/22, an average of just $14.46 was spent on food per resident per day at aged care providers.\n\n\"Fresh real ingredients provide flavour that frozen never can, and we can show aged care homes that cooking fresh actually does not cost more,\" she added.\n\n\"However, only if supported by the skill set, passion and knowledge and support of management, it is all possible and because I know there's so little money to spare within aged care homes.\"\n\nAged care facilities are home to some of the most vulnerable members of Australia's elderly population.\n\nAccording to Dementia Australia, there are an estimated 433,300 Australians living with dementia in 2025.\n\nAnd over half of the 245,000 people in aged care were living with dementia as of 2022.\n\nBeer said good food can be a familiar, safe space for those enduring the sometimes traumatic transition of moving into care.\n\n\"One of the most evocative things is a sense of smell that stays with us and smell that links to good memories,\" Beer explained.\n\n\"Living with dementia is so hard but I can tell you those instincts are still there.\n\n\"It's never going to be easy, but all those things can make such a difference.\"\n\nThe celebrity chef said meals shouldn't be an \"afterthought\" in aged care homes. (Maggie Beer/Instagram)\n\nIn a submission on the Aged Care Bill 2024, The Maggie Beer Foundation Trainer Mentor Program asked for an extension to its funding beyond September 2026.\n\nThe Maggie Beer Foundation has petitioned for $15.3 million across three years to fund ﻿its program to improve food in aged care and solutions for older people recieving care at home.\n\nBeer also issued a plea to the Federal Minister for Ageing and Seniors Sam Rae, who was sitting in the room in Canberra today, for more funding.\n\n\"We run a very lean show. And there's no money for us to be funded,\" she said.\n\n\"I can't bear to think of it as being lost. It's so very valuable.\n\n\"So you can be sure I will be advocating fiercely again to the government to support the program.\"",
    "source": "9News",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/abs-labour-force-unemployment-rate-4-2pc-25k-jobs/105651886",
    "title": "Breaking: Unemployment rate improves as full-time jobs surge",
    "publish_date": "Thu, 14 Aug 2025 01:38:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's unemployment rate improved in July, edging lower to 4.2 per cent from 4.3 per cent in June, according to the latest figures from the Bureau of Statistics.\n\nEmployment increased by nearly 25,000 people, driven by 60,000 full-time jobs, and the number of unemployed people also fell in the month.\n\nThe ABS noted that female workforce participation hit a record high last month, as the number of full-time female workers grew by 40,000.\n\nThe overall participation rate, which is the proportion of people in work or looking for a job, remained steady at 67 per cent.\n\nOn Tuesday, the Reserve Bank maintained its forecast for the unemployment rate to sit at 4.3 per cent in December this year.\n\nThe Australian dollar rose to two-week highs following the data release, as the improvement in the jobs market saw expectations of an interest rate cut in September pared back.\n\nEconomists and traders are betting on a further reduction in rates by the RBA this year, with November considered the most likely timing, after this week's 0.25 percentage point cut took the cash rate to 3.6 per cent.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/failure-by-mercer-super-asic-alleges-death-benefits-insurance/105651442",
    "title": "'Systemic failure by Mercer Super,' ASIC alleges, as it takes $70b fund to court",
    "publish_date": "Thu, 14 Aug 2025 01:35:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's corporate watchdog has launched legal action against superannuation giant Mercer, alleging the fund failed to report serious issues whereby it charged members insurance premiums after they had died, created member accounts without default insurance cover, and failed to process updates to member information.\n\nThe $70 billion Mercer Super is the seventh-largest super fund in Australia with more than 950,000 members.\n\nThe Australian Securities and Investments Commission (ASIC) also alleged Mercer Super provided false or misleading information in reports to the corporate watchdog, which understated the number of members who were impacted.\n\nThe latest court action follows Australian Super being sued by ASIC for failing to process thousands of death benefit claims \"efficiently, honestly and fairly\" between July 2019 and October 2024.\n\nIt also comes after ASIC sued industry super fund Cbus last year for delays in processing more than 10,000 death and disability payments.\n\nIn new proceedings launched on Thursday in the Federal Court, ASIC alleged that between October 2021 and September 2024, Mercer Super had inadequate systems in place to comply with the reportable situations regime, which requires Australian financial services licensees to promptly report ongoing investigations into significant breaches of their core obligations.\n\nExamples of these system failures, ASIC alleged, included Mercer Super failing to report seven investigations at all, and another investigation being reported more than a year late.\n\nDo you know more? If you have more information about this story please contact Nassim Khadem at khadem.nassim@abc.net.au or nassimkhadem@protonmail.com\n\nThis included investigations into insurance premiums not being refunded correctly after members had died, member accounts not being created with default insurance, and updates to member information not being processed by the trustee.\n\nASIC also alleged Mercer Super provided false or misleading information in reports to ASIC, which understated the number of members who were impacted.\n\n\"We allege a pattern of longstanding and systemic failure by Mercer Super to comply with the law,\" ASIC deputy chair Sarah Court said.\n\n\"These aren't just technical breaches. Allowing investigations into significant issues to drag on for months or, in some cases, over a year without reporting them to ASIC demonstrates a lack of care for customers and can put more at risk.\n\n\"As one of Australia's largest super funds, Mercer Super should have had adequate systems in place to manage and monitor critical issues like this.\"\n\nSarah Court wants super funds to do better. (ABC News: Billy Cooper)\n\nSuper funds put on notice over how they respond to member complaints\n\nMs Court said ASIC's reportable situation regime was in place to ensure the corporate watchdog could identify misconduct early and take action to protect Australians.\n\nCathy was compensated just $29 for super fund's death benefit delay Photo shows A woman with long blonde hair sits in an armchair and looks over her right shoulder at a window. Australia's corporate watchdog calls on superannuation funds to overhaul the way they deal with death benefit claims.\n\n\"Customers expect their super funds to abide by the law,\" she said.\n\nShe said, aside from taking legal action against superannuation funds, ASIC has also issued 34 death benefit claims recommendations to super trustees and flagged its next phase of work focusing on how trustees respond to customer complaints.\n\nAustralia's corporate watchdog has repeatedly called on superannuation funds to overhaul the way they deal with death benefit claims, noting excessive delays, poor customer service, and ineffective claims handling are leaving Australians worse off at some of the most vulnerable times of their lives.\n\nIn a speech in June 2025, ASIC chair Joe Longo outlined that the next phase of ASIC's work in the superannuation sector will address how trustees learn from and respond to the complaints they receive.\n\nMs Court said Mercer Super's alleged conduct falls well below what ASIC expects of a trustee of its size and market position.\n\n\"There is work underway to review and simplify the regime, but that doesn't mean trustees can avoid their obligations,\" she said.\n\n\" Mercer Super's alleged failure to meet those obligations over several years is why we're taking action. \"\n\nASIC is seeking declarations and penalties from the court.\n\nMercer has been contacted for comment.\n\nASIC noted that in August 2024, in a separate case, Mercer Super was fined $11.3 million after it admitted making misleading statements about the sustainable nature and characteristics of some of its superannuation investment options.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/lismore-rowing-club-struggles-after-floods-cyclone-covid/105605224",
    "title": "Rowing club seeks 'new blood' as flood-prone city recovers from disasters",
    "publish_date": "Thu, 14 Aug 2025 01:19:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "In one of Australia's most flood-prone cities, a sporting club that used to be responsible for performing flood rescues is in need of rescuing itself.\n\nThe Lismore Rowing Club has trophies dating back to the late 1880s in its cabinet, and in the 1960s and 1970s was a powerhouse of NSW school rowing.\n\nIt also used to be called the Lismore Water Brigade and Rowing Club, and in the 1920s and 1930s, maintained up to 12 rescue boats, crewed by rowers from the club to perform flood rescues.\n\nThe Lirmore Rowing Club sheds beside the Wilsons River. (ABC North Coast: David Kirkpatrick)\n\nSadly, the club is now down to fewer than 20 active rowers, and most of those are aged between 60 and 80.\n\nLismore Rowing Club President Laurie Lynch said unless they could attract \"new blood\", the club was facing an uncertain future.\n\nThe club lost 20 boats during the 2022 floods, when water ripped through their shed at Loftville, beside the Wilsons River.\n\nBoats wrecked during the 2022 floods. (Supplied)\n\nThere is still debris from the floods stuck high in a tree near where they launch their boats on the river.\n\n\"It has been a very trying time for the Lismore Rowing Club since COVID, and then the 2022 floods, which had a devastating effect on our club,\" club president Laurie Lynch said.\n\n\"We lifted boats and equipment above the 2017 levels but still got caught out. It was a major flood and reached 3.5m inside the shed.\"\n\nLaurie Lynch points to the high water mark reached during the 2022 floods. (ABC North Coast: David Kirkpatrick)\n\nThe NSW rowing fraternity rallied around Lismore in the wake of the 2022 floods, with clubs like Sydney, Leichhardt, Nepean, Abbotsford, Drummoyne and UTS donating boats as replacements.\n\nBut having enough equipment has become the least of the club's problems.\n\n\"The river was unusable for many months after that because of the potential hazard due to pollution in the river,\" Laurie Lynch said.\n\nLismore Rowing Club's launch spot after the 2022 floods. (Supplied)\n\n\"More recently, with Cyclone Alfred and all the rain events, it made access to the river from our boat launching ramp fairly dangerous because of all the mud and sludge.\n\n\" Because the river was unusable, people just lost that part of their life schedule. \"\n\nSchool boats back on the water\n\nBut there are some signs of hope for the Lismore Rowing Club's future.\n\nA couple of the big schools in Lismore, Trinity and Richmond River High have recently returned to the water as part of their school sport program.\n\nQld premier dismisses concerns over Games venue Photo shows Four women in a rowing boat with barrage in the background David Crisafulli says his government remains committed to Rockhampton hosting rowing at the 2032 Olympics and Paralympics as experts back the Fitzroy River.\n\n\"At the moment the prospects for the club aren't brilliant because we don't have any senior rowers to go to regattas,\" club coach Peter Wallace said.\n\n\"If we can get some of these kids going that may attract some more older people to come to it.\"\n\nThe rowing club is one of the few organisations in Lismore that embraces the river and does not try to shut it out.\n\nOn a good day, the river's steep banks shelter the boats from the wind to create a perfectly smooth surface for rowing.\n\n\"The river when it is at its best is just magnificent,\" Laurie Lynch said.\n\n\"It is such a peaceful place and a great picturesque view you get of the river, which you don't get any other way, by walking the bank or sitting by the river.\n\n\"It is such a beautiful feeling to be working with a group of like-minded people who are enjoying that great waterway.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/macquarie-harbour-marine-farming-reaffirmed-commonwealth/105650836",
    "title": "Federal government rules in favour of Macquarie Harbour salmon farms",
    "publish_date": "Thu, 14 Aug 2025 00:58:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Federal environment minister Murray Watt has confirmed the continuation of salmon farming in Tasmania's Macquarie Harbour.\n\nEnvironmental groups had lodged a reconsideration request over a 2012 decision to allow for the expansion of salmon farming, over concerns for its impact on the endangered Maugean skate.\n\nThe Commonwealth had been considering the request since late 2023, before the Labor government passed legislation as one of its final acts of the last parliament in an attempt to allow salmon farming to continue.\n\nMurray Watt's decision has put an end to the legal battle against the 2012 verdict. (ABC News: Keane Bourke)\n\nIn a letter yesterday, Mr Watt said this law change had been used to end the reconsideration request.\n\nThe Bob Brown Foundation (BBF) took the legislation change to the Federal Court, which was due to hold a hearing next week.\n\nMr Watt's decision means this legal challenge will come to an end.\n\nRare fish numbers dropped by nearly 50 per cent\n\nThe decision reaffirms the 2012 expansion decision by then-environment minister Tony Burke.\n\nThis included a water-monitoring regime, limits to the amount of farmed fish biomass in the harbour, and requirements to clean up debris.\n\nThere are 11 marine fish farming licences in Macquarie Harbour.\n\nSalmon farming peaked in the harbour at 20,000 tonnes in 2014-15, when a decline in water quality was noticed, and there were two die-off events in 2019.\n\nTasmania's Environment Protection Authority (EPA) reduced stocking rates in 2017, and again in 2020, down to 9,500 tonnes, before setting dissolved nitrogen limits.\n\nBetween 2014 and 2021, estimates for numbers of Maugean skate — a stingray-like fish species found only in the harbour — had fallen by 47 per cent.\n\nEnvironmental groups fear salmon farming in the harbour is putting the Maugean skate at risk. (Supplied: Jane Ruckert)\n\nOne in 10 farmed salmon in Macquarie Harbour died in seven-month period Photo shows Aerial view of barge next to farmed salmon enclosure. Environmentalists have raised concerns after new data showed about 10 per cent of salmon farmed in Tasmania's Macquarie Harbour died during the process.\n\nAnother study stated that the population had stabilised after a period of decline in the decade leading up to 2020.\n\nThe BBF, Environmental Defenders Office and The Australia Institute then lodged a reconsideration request with the Commonwealth over the 2012 decision.\n\nThen-environment minister Tanya Plibersek had been considering the request — including conservation advice that the harbour should be further destocked of farmed salmon — before the federal government decided to amend federal environmental laws to protect farming.\n\nThis law change removed the environment minister's ability to reconsider previous decisions if they had been ongoing for at leave five years, and were approved with conditions that involve state-based regulations.\n\nEnvironmental groups were concerned that the law change could apply more broadly to other federal environmental matters, beyond salmon farming in Macquarie Harbour.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/meet-tup-forge-the-world-champion-bronc-rider-from-victoria/105635514",
    "title": "Bronc riding champion wants more women to take up daring sport",
    "publish_date": "Thu, 14 Aug 2025 00:52:07 +0000",
    "category": "sports",
    "authors": [],
    "text": "Tup Forge started learning how to ride a bucking bronco 18 months ago, with the hope of competing at a few Australian rodeos.\n\nA few weeks ago, she became the world champion at the biggest rodeo in the world.\n\n\"It's been amazing — I can't even explain it,\" Forge said.\n\n\"I don't think it's sunk in yet.\"\n\nTup Forge rides in Cheyenne, Wyoming, USA. (Supplied: Cheyenne Frontier Days)\n\nThe world championship finals were held in Cheyenne, Wyoming, in the \"wild west\" of the United States in July.\n\n\"Cheyenne Frontier Days is known as 'the daddy of them all,'\" Forge said.\n\nMs Forge won a gold buckle at the finals in the USA. (Supplied: Tup Forge)\n\n\"I had never been overseas before, but it was very cool.\n\n\"It's a real cowboy town.\"\n\nWomen from Australia, Canada, the United States and Mexico rode horses drawn at random and had to stay on their bucking broncos for eight seconds.\n\n\"I was the only girl to ride both of my horses for the final, so I had a good lead,\" Forge said.\n\n\" Eight seconds is a very long time for the buzzer to come around. \"\n\nThe Cheyenne Frontier Days rodeo is the biggest in the world, with more than half a million people attending over 10 days.\n\n\"The atmosphere was out of control, the arena was huge,\" Forge said.\n\n\"When I had won and I was running back behind the chutes, the crowd was roaring.\"\n\nTo qualify to go to Cheyenne, Forge spent 12 months competing around Australia, taking out the national titles.\n\nForge has won a national title belt buckle as well. (ABC Rural: Annie Brown)\n\nGrowing up 'on the back of a horse'\n\nThe 28-year-old grew up riding horses on her family's cattle farm in Oxley in north east Victoria.\n\n\"My mum and dad breed Hereford cattle and we use horses for mustering all the time, so I've grown up on the back of a horse,\" Forge said.\n\nTup Forge has been riding horses since she was small child. (ABC Rural: Annie Brown)\n\nHer parents, Anne Maree and Graham Forge, said they were very proud.\n\n\"It was exciting to see her fulfil her dream but also very nervous to watch her ride just hoping she wasn't going to get hurt,\" Mrs Forge said.\n\n\"She's made a big effort in the last 18 months and it's paid off,\" Mr Forge said.\n\nAnne Maree and Graham Forge are proud parents. (ABC Rural: Annie Brown)\n\nForge said she was very comfortable on a horse but only took up the sport of bronc riding a year and a half ago.\n\n\"I was following some girls in the US on Instagram and they were coming out here and put on a ranch bronc school,\" Forge said.\n\n\"I signed up immediately and thought it was just going to be a bit of fun.\n\n\"My first rodeo was in Tambo, Queensland, and I came second — I was chuffed.\"\n\nTup hopes to help teach and encourage more women to try ranch bronc riding. (ABC Rural: Annie Brown)\n\nEncouraging other riders\n\nAs part of her world title, Forge was awarded a gold belt buckle that she hoped would help inspire the next generation.\n\n\"It was the most beautiful thing I've ever seen, but unfortunately, I don't have it yet. They are going to engrave my name on it and post it over,\" Forge said.\n\nShe said she wanted to help more Australian women compete in the adrenaline-inducing sport, which has historically been dominated by men.\n\n\"I hope we can get more rodeos for girls to ride at,\" she said.\n\n\"It was only for that one ranch bronc school that I went to that I got a start and there's girls itching to go but nowhere for them to do it.\n\n\"Hopefully we can get some things organised for the girls.\"\n\nTup is short for Tuppence. (ABC Rural: Annie Brown)\n\nAfter reaching the top of the sport she loved, Forge's message was simple.\n\n\"If you've got a dream, just get after it because you never know where it will take you,\" she said.\n\n\"[It] just might take you to the world finals.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/nt-matt-wright-live-court-trial-jury-darwin-pilot-cross-examined/105650016",
    "title": "Live: Pilot admits 'trafficking' cocaine before fatal chopper crash",
    "publish_date": "Thu, 14 Aug 2025 00:34:35 +0000",
    "category": "finance",
    "authors": [
      "Jason Walls",
      "Annabel Bowles"
    ],
    "text": "The pilot who survived the fatal chopper crash at the centre of Matt Wright's criminal trial has admitted to trafficking \"very minimal\" amounts of cocaine to friends prior to the accident.\n\nSebastian Robinson — who was left a paraplegic after the helicopter accident — is being cross-examined in the Northern Territory Supreme Court today after two days of giving evidence.\n\nHe told jurors on Wednesday the celebrity crocodile wrangler visited him in hospital in the weeks after the crash and deleted notes and texts from Mr Robinson's phone.\n\nThe court also heard Mr Wright was not on the fateful crocodile egg-collecting mission because he was an \"anti-vaxxer\", barred from entering remote Arnhem Land due to being unvaccinated against COVID-19.\n\nMr Wright has pleaded not guilty to three counts of attempting to pervert the course of justice following the accident on February 28, 2022.\n\nThe charges relate to alleged events in the days, weeks and months after the crash.\n\nIf you missed yesterday's live coverage of the trial, catch up here.\n\nTo stay up to date with this story, subscribe to ABC News.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/high-flying-boomers-through-to-asian-cup-semifinals/105650854",
    "title": "Zero controversy as high-flying Boomers through to Asian Cup semifinals",
    "publish_date": "Wed, 13 Aug 2025 23:43:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia has coasted into the semifinals of the Asian Cup with an 84–60 victory over the Philippines in an incident-free clash devoid of any drama after their spiteful encounter seven years ago.\n\nThe infamous \"Basketbrawl in Bocaue\" in 2018 made headlines around the globe for all the wrong reasons.\n\nFour Aussies were ejected as a result of the all-in brawl, while the Gilas were reduced to just three players before two of them fouled out to forfeit the game.\n\nBut there were no such incidents at the more serene King Abdullah Sports City in Jeddah on Wednesday night, Australia instead comfortably sitting their opposition on the canvas without any controversy.\n\nAdam Caporn's men, who beat South Korea, Lebanon and Qatar on their way to the quarterfinals, stuck to their task from the start and finished the first quarter 29–12 in front.\n\nJaylin Galloway and Jack McVeigh were deadly accurate in three-point shooting, but the Pilipinas began the second quarter in bold fashion to reduce the deficit to 12 points at 31–19, forcing a timeout from the Australians.\n\nKevin Quiambao provided the ray of hope for the passionate and loud Gilas fans with his shooting from outside the arc but the Australians maintained control to extend their lead to 20 points (48–28) at half-time.\n\nThe Boomers went up a notch after half-time, but so did the Gilas. They reduced the deficit to 19 points by edging the quarter 22–21, allowing themselves to dream.\n\nCaporn's charges, however, were too big, too strong and too fast and saw out a 24-point win, the Boomers still the team to beat in the tournament.\n\nOwen Foxwell led the scoring for Australia with 15 points, with Galloway (15), McVeigh (12) and Xavier Cookes (10 points and seven rebounds) also contributing. Skipper Will Magnay, who was MVP, had 10 points and six rebounds.\n\nFor the Philippines, Quiambao had a game-high 17 points and was well backed up by Dwight Ramos (15 points, seven rebounds) and Justin Brownlee (10 points).\n\nAustralia will next meet Iran for a place in the final after they defeated Chinese Taipei 78–75, while in the other semifinal, the winner of China–South Korea will meet the victor of New Zealand and Lebanon.\n\nIn the distant horizon lies the 2027 World Cup in Doha and the Los Angeles Olympic Games in 2028, where the Boomers will list their most powerful line-up.\n\nBut for now, the young Boomers brigade, with an average age of 24, has preserved Australia's unbeaten record since joining the competition in 2017 without much fuss nor bother.\n\nAAP",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/margaret-river-wallcliffe-house-works-start/105642496",
    "title": "Traditional owner against 'dying site' being turned into luxury hotel",
    "publish_date": "Wed, 13 Aug 2025 23:06:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "There are calls for construction to stop at the site of an old settler's cottage in WA's South West, as Aboriginal representatives are called in to keep an eye on works near their cultural \"dying place\".\n\nThe hotel site, nestled between the Wallcliffe cliffs and the Margaret River, is where the region's second house stood from 1865 until it was destroyed by fire in 2011.\n\nSite works are underway on a five-star hotel after years of planning and a ministerial sign-off to proceed in an area of significance to Indigenous people.\n\nThe $21.5 million hotel will include 18 rooms, seven cottages and a spa for guests. (ABC South West WA: Anthony Pancia)\n\nCalls to stop work\n\nThe nearby Wallcliffe cliffs, a registered Aboriginal Heritage site, is known as Wainilyinup or \"dying place\" in cultural mythology and was a place of traditional burials.\n\nWardandi elder Vivian Brockman-Webb wants to see the wider area undisturbed.\n\n\"Maybe some things just don't need to be touched,\" she said.\n\n\" I would put it on par or maybe even more than Juukan Gorge … It was the pathway into the afterlife and all of a sudden the door is shut and nobody can get in. \"\n\nVivian Brockman-Webb has been calling for work to stop at the sacred site. (Supplied: Martine Perret)\n\nMs Brockman-Webb believes bodies would have been buried in the softer soil at the development site.\n\n\"I'd like to see a stop-work order until we can get in there to assess the damage that has been done … and they can carbon date the soil and estimate how many burials would have been there,\" she said.\n\n\"It's my job, my role, my responsibility to be able to do as much as I can to protect this sacred site.\"\n\nBecause of the area's significance, the development needed section 18 approval from WA's Indigenous affairs minister.\n\nThe controversial section of the state's Aboriginal Heritage Act came under fire after it paved the way for Rio Tinto's destruction of rock shelters at Juukan Gorge in WA's Pilbara region in 2020.\n\nMinisterial sign-off\n\nState approval for the Wallcliffe hotel was granted after a heritage survey and consultation with traditional owners.\n\n\"The findings found the burials were known to exist closer to the cliffs,\" a state government spokeswoman said.\n\n\"The majority of the traditional owners advised they supported the proponent seeking consent under section 18 to carry out the proposed works at Wallcliffe, as the works are predominantly located on land that has already been previously disturbed and would not impact upon the cultural heritage values.\n\n\" The Department of Planning, Lands and Heritage is not aware of any discoveries of an Aboriginal burial area as a result of the activities listed in the section 18 consent. \"\n\nThe local tourism association hopes the luxury resort will attract more international and interstate visitors to the region. (Supplied: Wallcliffe House Architectural Design Report)\n\nA Wallcliffe House Pty Ltd spokeswoman said Aboriginal representatives had been on site.\n\n\"[The works] include forward works such as replacement of existing overhead power lines with underground infrastructure, building of retaining walls, and some targeted vegetation removal,\" she said.\n\n\"A rotating team of monitors has been onsite at all appropriate times since works commenced in May.\n\n\"In addition, the project has engaged a qualified and experienced archaeologist to be present … and on call at all times.\"\n\nThe Indigenous corporation representing the South West Boojarah region has at times been critical of disturbances at southern cultural heritage sites, but in this case highlighted the company's \"gold-standard\" approach at a place of \"extraordinary cultural, spiritual, and historical significance\".\n\nThe Karri Karrak Aboriginal Corporation said the project set a new \"benchmark\" for South West developers.\n\nWallcliffe House was destroyed by bushfires that swept through the area in 2011. (Supplied: Christa Walsh)\n\nA 'homage' to heritage\n\nHad it not been destroyed by fire in 2011, the original Wallcliffe House, built for the Bussell family, would be more than 160 years old.\n\nThe ABC has spoken to a member of the Bussell family who said he supported the hotel.\n\nWallcliffe House was built for the Bussell family in the 1860s and was one of the first homes in the area. (Supplied: State Library of Western Australia)\n\nMargaret River Busselton Tourism Association CEO Sharna Kearney said she hoped the hotel would help bring more visitors to the region.\n\n\"We'll be really looking forward to it coming online,\" she said.\n\n\"It's very, very high-end luxury … [and] it does pay homage to the heritage and the past of our region in terms of restoring and rebuilding the original Wallcliffe House.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/taylor-swift-life-of-a-showgirl-album-roll-out/105648208",
    "title": "Taylor Swift, the showgirl? Her album launch has her labelled a 'marketing mastermind'",
    "publish_date": "Wed, 13 Aug 2025 23:03:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "Taylor Swift's new album might be called The Life of a Showgirl, but her ability to whip her fans into a frenzy ahead of the announcement has one expert calling her a \"marketing mastermind\".\n\nSwift announced the news of the album on the podcast hosted by her boyfriend, Kansas City Chiefs footballer Travis Kelce.\n\nKelce hosts the New Heights podcast with his brother, Jason Kelce, a former Philadelphia Eagles player.\n\n\"This is my brand new album, The Life of a Showgirl,\" Swift said, brandishing a blurred vinyl copy of her new album while Jason roared as if she had scored a touchdown.\n\nThe short clip was posted to Instagram ahead of the full episode's release and racked up more than 168 million views in a day.\n\nGraeme Hughes, a business and consumer expert at Griffith University, said Swift's announcement of her 12th album was \"a brilliant display of marketing genius, proving once more why she's at the top of the music game\".\n\nTaylor Swift has revealed the album art and release date of The Life of a Showgirl. (Instagram: @taylorswift)\n\nFirst, the New Heights podcast posted that it would have a very special guest joining its next episode.\n\nThen, Swift's social media kicked things up a notch by blatantly sharing that a new era was arriving imminently.\n\nFinally, a countdown clock appeared on her website.\n\n\"Swifties were sent into a frenzy after the singer's official social media team, Taylor Nation, dropped a series of cryptic 'Easter eggs',\" Dr Hughes told ABC News.\n\n\"A countdown clock, a change in social media profile pictures to a blurry orange and mint-green graphic, and a 12-photo carousel featuring Swift in orange outfits from her record-breaking Eras Tour all pointed to one thing: a new era.\"\n\nDr Hughes said Swift's \"strategic\" move to announce the new album on her partner's podcast, thereby blending her personal life with her professional career, \"generated massive buzz across both music and sports media\".\n\n\"Swift's playbook is a masterclass in modern marketing, using fan engagement, scarcity with limited-edition vinyl and cassettes, and a drip-feed of clues to build anticipation to a fever pitch,\" he said.\n\n\" It's a strategy that turns album releases into global events and solidifies her place as not just a musician, but a marketing mastermind. \"\n\nTaylor Swift deployed a countdown clock to stir fans into a frenzy of what her latest announcement could be. (Getty Images: Kevin Winter/TAS24)\n\nGeorgia Carroll, a fan culture researcher, said the countdown clock was a new strategy for Swift.\n\n\"That gets everybody staying online, everybody focused, and it also allows her to direct the traffic to her own channels,\" Dr Carroll told ABC News.\n\n\"Obviously, everyone will be watching New Heights and their channels for the podcast, but the countdown led to a pre-order link on her store, so obviously that was a very clever way to keep people on that page.\"\n\n'Relationship-led' rollout\n\nBefore the pandemic, Swift traditionally released an album every two years, according to Dr Carroll.\n\n\"Obviously, we saw that shift during the pandemic with Folklore and Evermore, her surprise album drops,\" she said.\n\n\"Ever since then, it's been a bit more of, 'When is this going to happen? What are the clues? How are we hunting this down?'\n\n\"But I don't think anyone expected it to be released through the New Heights podcast, of all places.\"\n\nTravis Kelce embraced Taylor Swift after the Kansas City Chiefs won the Super Bowl last year. (AP: John Locher)\n\nWhile this album announcement might appear less glitzy than revealing the news on stage at the Grammys, Dr Carroll said the decision was just as savvy.\n\n\"It makes sense because it's a way that she can control her narrative and tell the story of the album in a way that she knows won't be twisted, while also revealing more of herself to her fans.\n\n\"We've never really seen her in conversation with her partner before.\n\n\" She's never really done podcast interviews before, and in recent years she hasn't really done that many interviews full stop. \"\n\nDr Carroll said the release of a Travis Kelce profile in GQ magazine, timed with Swift's album announcement, showed the couple were \"maximising these opportunities\".\n\nIn the article, Kelce spoke at length about how he and his girlfriend had a lot in common by both entertaining sold-out stadiums.\n\nDr Carroll said it had been a \"very clever, relationship-led build-up to the album dropping\".\n\n'Glitter gel pen album'\n\nThe Life of a Showgirl will be Swift's 12th album and is due to be released on October 3.\n\nIn the past, Swift has categorised her songs into different categories, with fun, happy love songs being classified as \"glitter gel pen songs\".\n\nWhile Taylor Swift has released the album's name, fans are left wondering what the album cover will look like. (Andreas Rentz/TAS24/Getty Images for TAS Rights Management)\n\n\"There's been a lot of glitter involved in this, so fans have been speculating that this is going to be a glitter gel pen album,\" Dr Carroll said.\n\nWhile tracks are yet to be released, Dr Carroll believes the album announcement hints at Kelce playing a bigger part on the record.\n\nTaylor Swift's Eras Tour has ended. These numbers show its impact Photo shows Taylor Swift smiles and waves on stage in a purple tinsel jacket and a blue sparkling bodysuit It's been a long time coming, but Taylor Swift's Eras Tour has come to an end. As the dust (and glitter) begins to settle, these numbers show how it became one of the biggest concert tours of all time.\n\n\"There's a lot of expectation that as much as it may also be musings on fame and life during the Era's tour, Travis was obviously a very big part of that,\" she said.\n\n\"I think the fact that we get him talking about the relationship in depth for the first real time today, and then her launching it in a podcast with his brother and giving them exclusivity — it's very much a big hint as to what we can expect.\n\nSwift has traditionally left the subjects of her songs up to interpretation — but Dr Carroll argues this launch tells a different story.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/venus-williams-gets-us-open-wildcard-at-age-45/105650528",
    "title": "Venus Williams gets US Open wildcard at age 45",
    "publish_date": "Wed, 13 Aug 2025 22:08:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "Venus Williams is set to return to Grand Slam tennis at the US Open after a two-year absence, having received a wildcard invitation to compete in singles at Flushing Meadows.\n\nThe 45-year-old American will be the oldest entrant in singles at the tournament since 47-year-old Renee Richards in 1981, according to the International Tennis Federation.\n\nThe US Tennis Association had already given Williams a wildcard entry for next week's mixed doubles competition.\n\nSingles matches begin in New York on August 25, Australian time.\n\nWilliams becomes oldest WTA winner since 2004 Photo shows Venus Williams clenches her fists and smiles after winning at the DC Open. Venus Williams bangs down nine aces as she beats Peyton Stearns, who is 22 years her junior, in straight sets at the DC Open.\n\nAfter three years away from the court, Williams made her return to professional tennis at this year's DC Open in Washington.\n\nWhen she defeated Peyton Stearns in Washington, she became the oldest winner of a match on the WTA Tour since Martina Navratilova, who won at age 47 in 2004.\n\nWilliams lost in the second round of the DC Open, and also played at a tour event in Cincinnati, losing in the first round.\n\nShe is the owner of seven major singles championships — including at the US Open in 2000 and 2001 — along with another 14 in women's doubles, all won with her younger sister, Serena, plus two in mixed doubles.\n\nSerena retired with 23 Slam singles trophies after playing at the 2022 US Open.\n\nAP/ABC",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/women-in-mining-industry-not-filling-top-level-positions/105619692",
    "title": "Women in mining say industry missing out on female leadership talent",
    "publish_date": "Wed, 13 Aug 2025 22:04:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "At this year's Diggers and Dealers conference, about 2,500 mining delegates touched down in WA's gold city of Kalgoorlie to hear from the very top of the industry.\n\nBut of the more than 40 directors, chief executives, and chairs who took to the panel stage, only one was a woman.\n\nThe annual event draws the best and brightest to showcase everything the industry has to offer. (ABC Goldfields: Robert Koenig-Luck)\n\nChief executive and managing director of Australian Strategic Materials (ASM) Rowena Smith said she was \"very pleased\" to have been invited to speak.\n\n\"I spent an enormous amount of time in the audience in the early years, and I didn't see any women on the stage,\" she said.\n\nMs Smith said the increase in women at the event was positive.\n\n\"Twenty years ago … there were [also] very few women in the audience,\" she said.\n\n\"As I stood there on the stage on Monday, I was looking out into so many women's faces.\"\n\nRowena Smith was the only female director who spoke at Diggers and Dealers this year. (ABC Goldfields: Katrina Tap)\n\nLack of women 'not good enough'\n\nThe 2025 Global Gender Gap Report from the World Economic Forum (WEF) shows the number of top-level management positions held by women in the oil, gas and mining industry is only around 16 per cent.\n\nIt is a fact author and gold expert Sandra Close knows all too well.\n\nShe was the first woman geologist in the field in Australia at a time when the industry looked very different.\n\n\"[When] I started, it was zero women with hands-on jobs in the mining industry,\" Dr Close said.\n\n\"It was quite a lot to break through.\"\n\nSandra Close has seen the industry change immensely since she started as a geologist in 1967. (ABC Goldfields: Jarrod Lucas)\n\nShe moved from geology to high-level resource financing, later becoming the senior executive at a multinational resources group.\n\nBut despite her accolades, including a nomination for Senior Australian of the Year, there is one part of the industry Dr Close never entered.\n\n\"The reality is in all those years I have never, ever once been asked to be a director of any company,\" she said.\n\nDEI backlash\n\nAccording the WEF, in 2024, only about 14 per cent of new hires to top leadership positions in the oil, gas and mining industry were women.\n\nIt is part of a steady global decline in women being hired to top-level management roles since the pandemic.\n\nJournalist and equality advocate Catherine Fox said it was \"just not good enough.\"\n\n\"The number of women at the decision-making table is … sadly either plateauing or going backwards,\" she said.\n\nCatherine Fox says increasingly conservative views of gender roles could affect the way women progress in the workplace. (Supplied: Catherine Fox)\n\n\" The supply is there, and they're getting to a certain point, but they're not getting right up to the top. \"\n\nMs Fox said she thought US President Donald Trump's dismantling of Diversity, Equity and Inclusion (DEI) laws in the US was starting to spread to Australia.\n\nShe believes changes are already happening \"under the surface\".\n\n\"I think that backlash that women [have] already gone far enough, in fact we might have gone too far, is gathering pace,\" she said.\n\n\"We fought for years to get the word 'diversity' taken seriously, now people are changing it to things like 'productivity.'\"\n\nCultural shift needed\n\nMs Smith said it was important the industry encouraged more women into leadership roles.\n\n\"One of the things that will encourage that is men seeing women do the job … seeing is believing,\" Ms Smith said.\n\nShe also said the industry needed to stop holding women to a higher standard than men.\n\n\"We're perceived to be a higher risk candidate, and therefore the benchmark seems to go up,\" she said.\n\n\"I don't think men have the same need [as women] to be exceptional.\"\n\nRowena Smith with Women in Mining founder Sabina Shugg AM. (ABC Goldfields: Macey Turner)\n\nDr Close said the mining industry could not afford to continue excluding women like herself from top roles.\n\n\"When you'd have the sort of experience that I've had … I think it would have been fascinating,\" she said.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/samuel-coleridge-taylor-a-black-composer-almost-lost-to-history/105637344",
    "title": "The forgotten black composer who is still inspiring musicians today",
    "publish_date": "Wed, 13 Aug 2025 22:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Late Victorian London wasn't an easy place to achieve musical success if you were mixed-race and born outside of marriage, like composer Samuel Coleridge-Taylor.\n\nDespite never setting foot in Africa, Coleridge-Taylor's music was often inspired by his African heritage, and he became one of Britain's foremost black composers.\n\n\"He was a composer who was really tapping into this idea of an African diaspora, which was pretty revolutionary for his time,\" says US-based harpist and music advocate Ashley Jackson.\n\nA prolific composer and early champion of the equal rights movement, Coleridge-Taylor's lifetime coincided with the heyday of the British empire and a golden age for British composers.\n\nHis contemporaries, such as Edward Elgar, Ralph Vaughan Williams and Gustav Holst are household names for classical music lovers today.\n\nIn contrast, for decades Coleridge-Taylor was consigned to history. But thanks to the work and advocacy of diverse musicians, Coleridge-Taylor's music is now being shared with new audiences.\n\nA talented musician from disadvantaged beginnings\n\nColeridge-Taylor was born in 1875 to a working-class family in London. His mother named him after the 18th century poet Samuel Taylor Coleridge.\n\nDespite never meeting his Sierra Leonian father, a medical student who lived in London for a time, Coleridge-Taylor's life was profoundly shaped by his African heritage.\n\nHow a new generation is invigorating classical music Photo shows Abel Selaocoe performing with the Australian Chamber Orchestra, seated onstage with his cello. Musicians like Abel Selaocoe, Jessica Cottis and Mindy Meng Wang are reimagining what classical music can be when we uplift diverse voices and traditions.\n\nHis mother's family recognised and nurtured Coleridge-Taylor's musical talents. His grandfather taught him the violin and later, the family found a way to send him to the Royal College of Music aged 17.\n\nColeridge-Taylor initially learnt composition from respected British composer Charles Villier Stanford, who also taught Ralph Vaughan Williams.\n\nBoth composers wrote a substantial amount of music for choirs, orchestras and small chamber music ensembles.\n\nVaughan Williams's music, such as Fantasia On A Theme by Thomas Tallis and The Lark Ascending, are still extremely beloved by classical music lovers today, including Australian audiences.\n\nBut until recently, Coleridge-Taylor was only famous for one lone piece of music.\n\nEnormous success and financial failure\n\nColeridge-Taylor's most famous composition is a trilogy of cantatas called The Song of Hiawatha. Based on an 1855 poem by Henry Wadsworth Longfellow, it follows a fictional Native American love story between Hiawatha, an Ojibwe warrior, and Minnehaha, a Decota woman who subsequently died during a famine.\n\nThe first cantata, Hiawatha's Wedding Feast, achieved critical acclaim in Britain and the US.\n\nPoster of the Hiawatha performances at the Royal Albert Hall from the 1930s. (Samuel Coleridge-Taylor Foundation)\n\nStanford conducted the world premiere in 1898. The concert was attended by the who's who of British composers, including Hubert Parry, whose music has been used in British coronations since 1902, Arthur Sullivan of Gilbert and Sullivan fame, and Edward Elgar, whose high opinion established Coleridge-Taylor's name.\n\nHiawatha's Wedding Feast, written for choir and orchestra, opened doors for Coleridge-Taylor, who was asked to write the sequels The Death Of Minnehaha and Hiawatha's Departure.\n\nColeridge-Taylor conducted Hiawatha's Wedding Feast on three tours to the US in 1904, 1906 and 1910. On his first visit, Coleridge-Taylor was received by President Theodore Roosevelt at the White House, a reportedly rare opportunity for someone of African descent.\n\nThe music's popularity endured after his death.\n\n\"In the years between the world wars, the Hiawatha's festival in Royal Albert Hall in London was an extremely popular affair,\" says Andrew Ford, presenter of The Music Show.\n\n\"World War II in 1939 put a stop to the festival, but even in the 1970s I remember posters for performances in England,\" Ford says.\n\nThe score for Hiawatha's Wedding Feast sold hundreds of thousands of copies, and was said to rival the popularities of Handel's Messiah and Mendelssohn's Elijah.\n\nBut Coleridge-Taylor didn't receive much financial benefit from the sales. He sold the music outright for an immediate sum of 15 guineas, equivalent to over $26,525 in today's money.\n\nEven though Coleridge-Taylor negotiated better deals for the subsequent cantatas, they weren't as commercially successful as Hiawatha's Wedding Feast.\n\nWhen Coleridge-Taylor died at the age of 37 in financial strife, his case catalysed other musicians to establish royalty payments.\n\nBecoming a champion for equal rights\n\nHis musical talent and success didn't spare Coleridge-Taylor from the effects of racism during his lifetime.\n\nColeridge-Taylor drew inspirations from his African heritage, writing music based on many African-American spirituals. (Wikimedia Commons: Adam Cuerden)\n\nColeridge-Taylor's father returned to Africa without knowing his son's existance because of slim prospects to practise as a doctor in London.\n\nColeridge-Taylor's marriage to fellow musician Jessie Walmisley was initially opposed by her parents because he was mixed-race.\n\n\"[He] knew at first-hand both of discrimination by 'race', and of the shared objective by others of a more even playing field for all,\" says sociologist and writer Hilary Burrage, one of the directors of the Samuel Coleridge-Taylor Foundation.\n\n\"Victorian London was more varied of skin colour than some imagine.\"\n\nColeridge-Taylor attended the 1900 First Pan-African Conference, a landmark event for equal rights. He befriended African-American poet Paul Laurence Dunbar, setting many of his poems to music.\n\nHe also incorporated influences from African diaspora into many of his compositions, including the 'Othello' Orchestral Suite, African Suite and Twenty-Four Negro Melodies which were inspired by African-American spirituals.\n\nColeridge-Taylor was reported to have said about the melodies:\n\n\"What Brahms has done for the Hungarian folk music, Dvořák for the Bohemian, and Grieg for the Norwegian, I have tried to do for these Negro Melodies.\"\n\nColeridge-Taylor's legacy for musicians today\n\nOne of the problems with forgotten classical music figures is that often, there are complex reasons for their neglect.\n\n\"In a way, the success of Hiawatha's Wedding Feast coupled with Coleridge-Taylor's early death contributed to the neglect of his music,\" Ford reflects. \"His popularity might even lead people to not take him seriously.\"\n\nToday, Samuel Coleridge-Taylor is better known for his instrumental music and songs.\n\nIn 2021, pianist Isata Kaneh-Mason, who also has Sierra Leonian heritage, included Coleridge-Taylor's arrangement of Sometimes I Feel Like A Motherless Child in her album Summertime.\n\nIn 2022, London-based, ethnically-diverse orchestra Chineke! released a recording of Coleridge-Taylor's music, including his African Suite and Ballade In A Minor.\n\nHarpist Ashley Jackson found Coleridge-Taylor's Twenty-Four Negro Melodies while working on her previous album Ennanga, inspired by African-American spirituals.\n\nIn her most recent album Take Me To The Water, Jackson included Deep River from the same set of melodies.\n\nHarpist Ashley Jackson says music can bring people together when musical choices reflect people's diversity.\n\nColeridge-Taylor is often cited as an inspiration and role-model for diverse musicians alongside Florence Price, William Grant Still and others. His children, Hiawatha (Bryan) and Gwendalin (Avril) Coleridge-Taylor became composers and conductors in their own rights. It's a vindication for a composer who has been forgotten for decades.\n\nBut 150 years after Coleridge-Taylor's birth, some in the classical music world are still asking: does classical music have a diversity problem?\n\nJackson, who is an advocate for diversity and inclusion in classical music, says there's still a lot of work to do to honour the contributions of diverse musicians from past and present.\n\nIn a 2023 paper, Jackson cites historian Kira Thurman, who remarks:\n\n\" Classical music, like whiteness itself, is frequently racially unmarked and presented as universal — until people of colour start performing it. \"\n\nChineke! orchestra founder, Chi-chi Nwanoku, experiences this conundrum firsthand.\n\n\"This is the 21st century. It should not be a novelty when there is more than one black face on the stage,\" she told ABC Classic during the group's visit to Australia in 2022.\n\nJackson says rather than celebrating the milestones of being the first or the only musician of colour on stage, we should instead focus on diversifying voices of composers and performers in the music world. And one way to do this is by intentionally diversifying our musical choices.\n\n\"We have a responsibility to [feature] pieces of music that reflect the diversity of humanity,\" Jackson says.\n\nThis is how music's power to bring people together can be demonstrated, she says.\n\nGet the latest classical music stories direct to your inbox",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/asx-markets-business-live-news-14-august/105650562",
    "title": "Live: September rate cut odds ease as unemployment falls back to 4.2pc",
    "publish_date": "Wed, 13 Aug 2025 21:49:46 +0000",
    "category": "finance",
    "authors": [
      "Stephanie Chalmers",
      "David Taylor",
      "Michael Janda"
    ],
    "text": "Re the income gap between home owners and renters Really? I’m paying $1500 a week on my mortgage I’d be lucky to rent it out for $1000-$1200. I have no doubt it’s hard out there for renters but the grass isn’t always greener on the other side - Martha\n\nHi Martha.\n\nThe point you make is true in the short-term ... i.e. now.\n\nBut think about what happens over the long term.\n\nYour mortgage payment is likely to decline a bit more as interest rates fall back to neutral levels.\n\nEven if it doesn't, inflation means your income should rise over time, so the $1,500 a week you are paying becomes smaller in real terms.\n\nThat's why the first few years of a mortgage are generally the hardest.\n\nNow think about the renter.\n\nSure, they might only pay a $1,000 a week in rent now, but their rent will rise broadly in line with inflation.\n\nEven if rents only rise 2.5% per year, their rent will get to $1,500 a week in 15 years and your mortgage repayment will still probably be about $1,500 a week.\n\nBy the time you get close to paying off your 25-30 year mortgage, the renter will be paying a lot more in rent than you are in repayments.\n\nNot only that, but once you have paid your mortgage off, then you are living in your home for \"free\" — sure there are rates and maintenance costs, etc, but you are not paying a mortgage or rent.\n\nBy contrast, the renter is still paying the now much higher (in nominal terms) rent.\n\nSiminski and Wilkins are looking at lifetime incomes, and when you think about it this way you can see how they came to the conclusion that home owners end up, on average, 86% better off.",
    "source": "ABC",
    "cluster_id": 22
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/us-open-tennis-talia-gibson-and-tristan-schoolkate-wildcard-spot/105650534",
    "title": "Rising stars earn US Open wildcard spots to build on Aussie contingent",
    "publish_date": "Wed, 13 Aug 2025 21:25:02 +0000",
    "category": "sports",
    "authors": [],
    "text": "Emerging talents Tristan Schoolkate and Talia Gibson have been rewarded for breakout years with wildcards into the main draw of the US Open, bringing the Australian tally to 14.\n\nThe final major of the year gets underway on Sunday, August 24, with qualifying starting next Monday.\n\nBut the young guns can skip that phase after getting direct entry into the New York City tournament, with world No.8 Alex de Minaur leading the Australian charge.\n\nWest Australian Schoolkate broke into the ATP top 100 for the first time last week following a string of strong results, including a stand-out victory over world No.47 Joao Fonseca at the Toronto Masters — his first win over a top-50 opponent.\n\nTristan Schoolkate has also earned a spot in the US Open via a wildcard. (Getty Images: Mert Alper Dervis /Anadolu)\n\nNow ranked 97, the 24-year-old just missed direct entry, ranked No.110 at the July 14 entry deadline.\n\nReaching the second round of the 2024 US Open, Schoolkate also made three Challenger finals this season, claiming titles in Brisbane and Ilkley, UK.\n\n\"It's such an amazing experience to play in the main draws of the grand slams — it's what we as players work towards, week in, week out so I'm excited and ready for the challenge in New York,\" Schoolkate said.\n\nGibson, 21, has also enjoyed a breakthrough year, peaking at world No.107 last month.\n\nAlso from WA, Gibson recently captured her 10th ITF singles title at the W75 event in Granby, Canada.\n\nAfter securing her first grand slam main-draw win at the Australian Open, coming from a set down in a memorable debut at Melbourne Park, Gibson made her maiden Wimbledon main-draw appearance this year achieved by winning three rounds of qualifying.\n\n\"This is an incredibly rewarding acknowledgement for all the hard work my team and I have been putting in and for the results I've had this year,\" Gibson said of the Tennis Australia wildcard.\n\n\"I can't wait to get out there and give it my very best and make everyone proud.\"\n\nSchoolkate and Gibson will join 12 other Australians — eight men and four women — in the main draw.\n\nA further seven men and nine women will represent Australia in qualifying.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 23
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/wa-footy-wrap-dockers-soaring-as-eagles-languish/105647068",
    "title": "Dockers to test premiership credentials while Eagles eye unwanted history",
    "publish_date": "Wed, 13 Aug 2025 21:11:47 +0000",
    "category": "sports",
    "authors": [],
    "text": "When Fremantle run out against Brisbane on Friday night, the sense of opportunity among the purple haze will be palpable.\n\nEleven wins from the Dockers past 12 games has them in fourth on the AFL ladder, and has instilled a belief they can win from any position.\n\nFremantle has trailed at three-quarter time in four of its past five games, and gone on to win all of them.\n\nTwo of those teams, Collingwood and Hawthorn, are considered finals sides, with the Magpies a premiership contender up until recently.\n\nAlex Pearce (centre) kicked the winning goal for Fremantle against Port Adelaide on Saturday night. (AAP Image: Matt Turner)\n\nThe Dockers meet the Lions at an ideal time — the reigning premiers have lost two of their past three matches and one of those was an 11-goal thrashing by Gold Coast.\n\nThey are also missing dual-Brownlow Medallist Lachie Neale, forward Kai Lohmann and defender Connor McKenna.\n\n\"Gold Coast got them, but then they bounce back really, really well,\" Fremantle coach Justin Longmuir said.\n\n\"Their form on the road's been really strong this year. You know their game, much like ours, is built on contest and stoppage.\n\n\" It's going to be a good head-to-head battle. \"\n\nDockers dialled in\n\nDuring their recent run of form, the Dockers have managed to keep a lid on distractions to their process-driven mantra.\n\nThey've contended with a long-term injury to star midfielder Hayden Young and a frustrating lay-off for captain Alex Pearce, as well as the retirements of two of the greatest to pull on purple in Michael Walters and Nat Fyfe.\n\nWhere Nat Fyfe ranks among WA's AFL greats Photo shows A mid shot of Dockers captain Nat Fyfe handballing a football wearing his white Fremantle jersey. As Nat Fyfe announces his retirement, Tom Wildie examines whether the Fremantle Dockers champion gets a spot on the Mount Rushmore of AFL-era players from WA.\n\nLongmuir's response to whether winning a flag would be the perfect send-off for Fyfe encapsulated how dialled in the Dockers are.\n\n\"Some of that talk is the talk that probably takes you away from what you need to do,\" he said.\n\n\"I think Fyfey summarised it really well the other day in his speech ... you just need to live in the moment and win every day.\"\n\nFremantle fans could be forgiven not getting ahead of themselves despite the Dockers lofty ladder position.\n\nBurned into the psyche is last year's capitulation, which saw them fall from third to 10th in the final four games of the season, which understandably has fans a little distrustful.\n\nMathematically, and certainly not beyond the realms of possibility, the Dockers could still miss finals in 2025.\n\nJustin Longmuir has copped plenty of criticism this season, but the Dockers are in fourth spot with two rounds to play. (AAP Image: James Ross)\n\nTheir final two matches pit them against the Lions and the Western Bulldogs, who are ninth and still scrapping for a spot in September.\n\nBut this young Dockers squad, and yes they are still young despite a lot of games played, has shown a steel and resolve they haven't previously.\n\nFinals, and top four, is theirs to lose, but current form suggests they have the mettle to get the job done.\n\nA win at home in front of a packed house will go a long way to sealing the deal.\n\nUnwanted history beckons\n\nWhile Fremantle looks upwards, so does West Coast, and not because they are close to the top.\n\nBecause there are no other clubs to look down on.\n\nAndrew McQualter's first full season as a head coach looms as being one of the worst seen in the AFL era. (AAP Image: Richard Wainwright)\n\nThe Eagles were gutsy in their loss to Adelaide at Perth Stadium, but it was a blip rather than a trend.\n\nWith two games remaining the Eagles have posted just one win for the season, and it's doubtful they will add a second.\n\nDockers great shares ideas on how AFL's worst performing team can rebuild Photo shows West Coast Eagles players standing following a match, as a presentation goes on West Coast should consider spending beyond the club's salary soft-cap to fast track its rebuild, according to former Fremantle captain Peter Bell.\n\nSince the AFL era began in 1990, only three teams have finished with just one win — Sydney in 1993, Fitzroy in 1996 and GWS in 2013.\n\nThrough the middle of the season, the wooden-spooners showed signs Andrew McQualter's method was getting through to the playing squad.\n\nDespite just the one win, the Eagles hung in against Geelong, pushed Collingwood and Carlton, and fell just short of beating fellow strugglers North Melbourne.\n\nBut the wheels have since fallen off — thrashed by Richmond, Fremantle and Melbourne in consecutive weeks.\n\nThe Eagles have challenges across the board, including the likely departure of co-captain Oscar Allen, and the uncertain future of emerging star Harley Reid.\n\nAdd to that the suspension of the other co-captain Liam Duggan for the remaining two games, and the season can't finish fast enough.\n\nMcQualter must already be planning for next season, in which he'll be hoping Jake Waterman is fit, Reid is firing, and his youngsters have put in a big off-season.\n\nThe Eagles have won just one game all season, against St Kilda in round 10. (AAP Image: Richard Wainwright)\n\nThere could also be a hint to who may lead the club in 2026 — Liam Baker, in his first season at the club and hot favourite to be best and fairest, will captain the side for games against the Western Bulldogs and Sydney.\n\nThe Eagles could do worse then put him in the role full-time next year.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
    "source": "ABC",
    "cluster_id": 24
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-14/mount-gambier-soccer-player-bae-verace-signs-montenegro/105638372",
    "title": "Country soccer star cracks European field with Montenegro signing",
    "publish_date": "Wed, 13 Aug 2025 21:06:29 +0000",
    "category": "sports",
    "authors": [],
    "text": "A regional South Australian soccer player has made the rare leap onto the European stage, signing a professional contract at the age of 18.\n\nMount Gambier midfielder Bae Versace has signed with FK Budućnost Podgorica in the capital of Montenegro, after several years in Adelaide United's system.\n\nThe European club's senior team has won six Montenegrin First League championships, with its youth side taking part in the UEFA Youth League alongside the continent's best teams including Barcelona, Liverpool and Real Madrid.\n\nVersace said heading over to Europe had been more of a dream than a goal for him.\n\n\"I was just focused on playing at Adelaide United and trying to make my debut there,\" he said.\n\n\" But when an offer comes from Europe you don't want to turn it down because you might not get that opportunity again. \"\n\nVersace started his career with Inter SC in Mount Gambier when he was 8. (Supplied: Mark Versace)\n\nVersace said he was settling into life in the Balkans.\n\n\"Food and language are definitely the main two I'm getting used to,\" he said.\n\n\"I came here and had people greeting me out the front of the club and had meetings with the club. And the boys have all been very good to me.\"\n\nLong path to Europe\n\nVersace played a season as a junior at International Soccer Club in Mount Gambier before moving to MetroStars in Adelaide and being selected in United's junior teams.\n\nMelbourne-based coach Neb Stojkovic worked with Versace from a young age and helped him secure trials in Europe.\n\n\"For them, football is a way of living … so they do it with a purpose and everyone is fighting for that next level, and that contract, in the seniors,\" he said.\n\n\"For Bae it's a great opportunity to measure himself.\"\n\nNick Morony was one of Versace's coaches when he played for Inter's under-12s at just eight years old.\n\n\"He lived and breathed everything soccer,\" he said.\n\n\" When he wasn't doing homework he was out kicking the soccer ball or working on some of the drills we used to do. \"\n\nInter SC players Nick Morony, Matthew Bueti and Caleb Casey at the club's home, Casadio Park. (ABC South East SA: Josh Brine)\n\nImproving opportunities for regions\n\nVersace is thought to be the second Mount Gambier-born player to crack the European game after ex-Socceroo Josip Skoko, who started playing in the town before moving to Geelong at the age of nine.\n\nVersace said his young career showed country athletes had paths to become professionals.\n\n\"I don't think they have to look up to me in any way, but I don't see why they can't make the high levels,\" he said.\n\nVersace developed in Adelaide United's youth system. (Supplied: Mark Versace)\n\nMr Stojkovic said federations and coaches should work together to improve talent identification for regional players.\n\n\"We should go out and dig for them, they should not be short of opportunities,\" he said.\n\nFootball SA Limestone Coast regional development officer Nathan Koopman said federations were working to improve the pathways.\n\n\"If we find a player that's of a level to go higher we know we can have them [initiating] conversations and building relationships with coaches in the city,\" he said.\n\n\"When they do make that call to relocate they can then do it with a bit of confidence.\n\n\"Of course it's very exciting to look at the best players in the world and their stories as inspiration, but I think it's just as valuable — if not more so — to be able to speak to someone who came from your town, that they can see this is possible.\"",
    "source": "ABC",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/afl/tom-morris-trade-period-update-on-stars-20250814-p5mmy1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tom Morris' trade period update on stars",
    "publish_date": "Thu, 14 Aug 2025 12:09:44 +1000",
    "category": "finance",
    "authors": [],
    "text": "Tom Morris' trade period update on stars\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/afl/aflw-weekly-live-round-one-blues-pies-name-teams-for-season-opener-20250813-p5mmlw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFLW weekly update round one: Blues, Pies name teams; Coach’s ‘irrelevant’ call",
    "publish_date": "Thu, 14 Aug 2025 12:06:03 +1000",
    "category": "sports",
    "authors": [],
    "text": "Dual AFLW premiership coach Matthew Clarke is downplaying attention on his final season as Adelaide’s mentor as “irrelevant”.\n\nClarke will step down as the Crows’ coach at the end of a season starting with the perennial powerhouse taking on St Kilda on Sunday.\n\nAdelaide coach Matthew Clarke with the 2022 AFLW premiership cup. Credit: AFL Photos\n\nThe 51-year-old has been Adelaide’s women’s coach since 2018 and delivered two of the club’s three flags, but says nothing feels different entering his last season.\n\n“Not at all, to be fair,” he told reporters on Thursday.\n\n“Obviously it has given us something to talk about in the off-season which is nice. But internally, it has honestly been business as usual.\n\n“Your focus always is really quite narrow ... I’m really focused on what’s happening now.”\n\nClarke said his feelings were mirrored by his players, including co-captain and seven-time All Australian Ebony Marinoff.\n\n“I saw Noffy the other day and she goes: ‘I keep getting asked about that’,” he said. “And she goes: ‘Really, I just want to say I don’t care’.\n\n“I said, good answer. They should just be wanting to play because we’ve finally got the opportunity to play after nine months. It’s really irrelevant, genuinely irrelevant.”\n\nThe Crows, beaten preliminary finalists last season, again loom as a force.\n\nAAP",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-washington-warns-albanese-on-china-european-leaders-raise-deal-with-trump-to-stop-ukraine-war-20250814-p5mmsx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Washington warns Albanese on China; European leaders raise deal with Trump to stop Ukraine war",
    "publish_date": "Thu, 14 Aug 2025 12:04:18 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "The Australian Securities and Investments Commission (ASIC) is taking legal action against superannuation giant Mercer, alleging it failed to tell the regulator about investigations it was doing into serious problems including incorrect refunds for members who had died.\n\nAs part of a wider push to lift the standards of member service from superannuation funds, ASIC has launched Federal Court action against Mercer. It alleges the fund did not have the right systems in place to comply with laws that require funds to promptly tell ASIC about investigations into major breaches of their obligations.\n\nASIC deputy chair Sarah Court. Credit: Alex Ellinghausen\n\nASIC said some of the investigations in question included one probe by Mercer into insurance premiums that were not refunded correctly after members had died.\n\n“We allege a pattern of longstanding and systemic failure by Mercer Super to comply with the law,” ASIC deputy chair Sarah Court said.\n\n“These aren’t just technical breaches. Allowing investigations into significant issues to drag on for months or, in some cases, over a year without reporting them to ASIC demonstrates a lack of care for customers and can put more at risk.”",
    "source": "SMH",
    "cluster_id": 11
  },
  {
    "url": "https://www.smh.com.au/business/companies/alan-joyce-left-qantas-two-years-ago-now-he-s-defending-his-record-20250813-p5mmq2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Alan Joyce left Qantas two years ago. Now he’s defending his record",
    "publish_date": "Thu, 14 Aug 2025 11:58:21 +1000",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "Former Qantas boss Alan Joyce is expected to defend the airline’s cost-slashing strategy during the COVID crisis, while laying out the challenges for Australia’s aviation industry in a speech to be delivered on Thursday afternoon.\n\nAcknowledging the “hard and painful decisions” made by Qantas management during the pandemic lockdowns, the outspoken former airline chief executive will underscore the importance of “resilience” for the industry, according to his speech sent to reporters ahead of delivery.\n\nThe address will be Joyce’s first major public comments since leaving the airline after months of controversy in late 2023.\n\nQantas ex-CEO Alan Joyce is breaking his silence on his time at the helm of the airline. He’s looking ahead too. Credit: Jean Chung\n\n“It’s easy to forget now, but in 2020, global aviation didn’t just stumble. It collapsed,” Joyce will say.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/culture/music/what-we-learnt-from-taylor-swift-s-appearance-on-boyfriend-travis-kelce-s-podcast-20250813-p5mmo2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What we learnt from Taylor Swift’s appearance on boyfriend Travis Kelce’s podcast",
    "publish_date": "Thu, 14 Aug 2025 11:44:30 +1000",
    "category": "entertainment",
    "authors": [
      "Nell Geraets"
    ],
    "text": "Speaking about the record on the podcast, Swift said it was like “catching lightning in a bottle”. She produced it in Europe during the Eras Tour, as a way to capture what was happening behind the scenes during the tour – what her “inner life” was like off-stage. It consists of some of her favourite songs she has ever recorded, she said. “I was in Europe on the Eras Tour ... I’d have three days off, I’d fly to Sweden, and go back to the tour while actually working on this. I was physically exhausted at this point in the tour, but I was so mentally stimulated and so excited to be creating,” she said. “I wanted the album to feel like how my life felt. Every single song is on this album for hundreds of reasons, and you couldn’t take one out, and it be the same album. It’s just right. That kind of focus and discipline, keeping the bar that high, is something I’ve wanted to do for a long time.”\n\nReclaiming her masters Beyond the album news, she also touched on another momentous moment in her life recently: the reclamation of her masters in May, a moment that “changed her life”. Travis Kelce and Taylor Swift appear on the New Heights podcast. Credit: YouTube “It’s always been a huge thing for me. Since I was a teenager, I’ve been actively saving up money to buy my music back,” she said, adding that she “dramatically fell to the floor” when she found out she had finally managed to take ownership of her discography. “This will affect the rest of my life, and I think about this every day. But now, instead of it being like an intrusive thought that hurts me, it’s: ‘I can’t believe this happened. How lucky am I?’”\n\nShe then shifted to the epic experience that was the Eras Tour, the highest-grossing concert tour in history during which she travelled to 51 cities across more than 600 days. The singer said she wouldn’t change a thing about the tour – one where she was able to physically and mentally prepare for more than any of her previous global tours. “I wanted it to [include] references that, I thought, were really high-concept and really high-value for fans, and for them to see things they hadn’t necessarily seen before all in one concert,” she said. Another promotional image for The Life of a Showgirl. Credit: Instagram “But I wanted to do it at the highest intensity, rapid fire – you’re seeing something new every 15 to 30 seconds. So, it feels like you’re scrolling in an algorithm, right? “When I heard reports of people saying that they got actual amnesia after the concerts, I was like: ‘Oh, I think we did it. I think we nailed it.’”\n\nAustralia and the Eras Tour One of her favourite parts of the Eras Tour, she said, was the unplanned moments and fan-led traditions. Taylor Swift performing at the Eras Tour in Melbourne. Credit: Getty For example, during the European leg, her audience collectively decided to bring in balloons, which they illuminated with their phone torches during the Willow segment, reflecting the orbs held on-stage. “Was there a group text? How did you guys even do this? It was so special. It felt like we were all part of something together in a way that couldn’t be planned. As much as I love and relish in planning, it was really fun that they would do things to delight me,” Swift said.\n\nLoading Australia also got a direct mention, with the pop juggernaut describing the country as “amazing”. Despite how fulfilling the tour was, the pop star admitted she’s now enjoying a break – time she is apparently using to bake endless loaves of sourdough bread and watching otter videos with her boyfriend. An FYI on Easter eggs Before the official announcement of the new album, fans scoured a litany of Easter eggs carefully planted by the star, including cryptic photo galleries and intentionally timed social media posts.\n\nSwift touched on the very puzzles she used to share the recent news on the podcast, joking that the “Easter egg thing is getting a little Zodiac Killer at this point”. “I’m never going to plant an Easter egg that ties back to my personal life – it’s always going to be towards music,” she said. The singer is famed for dropping cheeky hints for her fans to deduce. Credit: Instagram “I want Easter eggs to be a certain thing where if you are part of the fandom, and you want to experience music in a normal way, then you don’t even see these – you don’t even care what that thing is above that doorway, under that dimly lit, flickering light over there that’s upside-down, backwards in Braille. But if you want to look at that, you can. If you know, you know.” Despite general excitement around the album itself, Swift’s decision to share the news on the Kelce brothers’ podcast divided fans. On one hand, some Swifties applauded the podcast approach, arguing that it was the ideal way for the singer to reveal the news on her own terms, rather than those of powerful, large-scale media or entertainment organisations.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/something-good-is-coming-man-utd-primed-to-bounce-back-from-horror-season-says-fernandes-20250813-p5mmle.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Something good is coming’: Man Utd primed to bounce back from horror season, says Fernandes",
    "publish_date": "Thu, 14 Aug 2025 11:38:25 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Though Fernandes noted that no player on the eve of the season would describe his manager in anything other than glowing terms – much less him with a fellow Portuguese – he seems completely genuine in his praise. The 30-year-old says he sees the game in the same way as Amorim, credits him with improving his personal output, and is grateful he has the “big balls” needed to make the decisions that could shape the club’s future. “I can see something good coming for the team,” he said. Bruno Fernandes after Manchester United’s Europa League final defeat. Credit: Getty Images This season is a fresh start in a number of ways. Firstly, it’s the first full one for Amorim, who took over in November after a disastrous start led to Erik ten Hag’s sacking. Amorim could not arrest the slide which led to United’s 16th-placed finish, their worst since 1989-90. He did get them into the Europa League final, but they lost the chance at a shortcut into the UEFA Champions League when they fell 1-0 to Tottenham Hotspur, on a night when their limitations in attack were clear for all to see.\n\nThat’s hopefully been addressed. Amorim has used his first true opportunity to dive into the transfer market by bringing in a new frontline: two wingers with plenty of EPL experience in Mathias Cunha, from Wolverhampton Wanderers, and Bryan Mbuemo, from Brentford, either side of big Benjamin Šeško – one of Europe’s most exciting young strikers – from RB Leipzig. “Putting them three together with everything we had already from last season will give big competition to everyone, and everyone will be fighting for their position into the team,” Fernandes said. “You just have to start strong again. At Manchester United, time doesn’t exist. You have to do it now.” Bruno Fernandes And Fernandes is still around, too. He was the subject of an eye-watering offer from Al Hilal, who were reportedly prepared to pay over $200 million to get him – a huge transfer fee for a player his age – and almost triple his $500,000-per-week wages. “I know numbers matter the most in football,” he said.\n\n“Obviously it was a big number that the club could get for me. So I know how tough it was for the club. When I spoke with the president of Al Hilal, I spoke with him once and I told him, ‘I’ve never thought about leaving, I appreciate your call. Whatever you want to do or not, you can talk with the club,’ because I’ve always said if the club wanted to sell me, then yes, I had to make a decision. But if the club doesn’t, I don’t have to make a decision, because my aim is to stay here. “It’s a lot of money for me, too, but it is what it is. People make decisions in their lives. I won’t regret it because this is the place I want to be and this is the place where I want to be successful also.” Manchester United’s renovated training facility underlines the sense of a fresh start this season. Credit: Getty Images Last week, renovations of United’s training facilities were completed. When the Carrington Training Complex first opened in 2000, they were state of the art – but as the years ticked by, they became dark, dingy and outdated, and a metaphor for how their standards had slipped. Three years ago, in his infamous interview with Piers Morgan, Cristiano Ronaldo described them as frozen in time; according to reports, he wouldn’t even use the main swimming pool because it had chipped and cracked tiles he deemed a hazard to player safety. Now, thanks to a $100 million redevelopment, Carrington is best-in-class again, and the most tangible manifestation of part-owner Sir Jim Ratcliffe’s ambitions for the club. The slick new facility includes the latest technology to assist player recovery (altitude chambers, underwater treadmills and the like), plus some pretty cool lounges for the team to hang out in (including a barber shop and an F1 simulator), which all adds to the sense of a new beginning, and of a club seeking to regain its rightful place on top of the pile – although for Fernandes, it’s the little things that could make the biggest difference.\n\n“One of the things that Sir Jim spoke about was the natural light into the building,” he said. “I know it’s a small detail, a small thing that could make such a big difference for the people that work here, because they have to be here for a very long time and for them to be closed in a space where they can’t see natural light is very difficult. People that work in the office, they always talk about this, that brings more sadness and not as a good environment to work [in]. Also for our physios, for our staff, it’s going to be a much nicer space for them to be working with.” So that’s the building sorted. What about the rebuild of the team? That’s ongoing and, at the same time, overdue. It’s no longer possible for a fallen giant like United to return to the top of the Premier League without enduring a period of pain on the ascent. But how can they do that in a world of unrealistic expectations and supporter impatience, at a club that still holds global attention like no other? “Expectations at this club are always high,” Fernandes said. “It doesn’t matter if you rebuild or not. Manchester United has no time to rebuild. You just have to start strong again. That’s all. No one will be saying that you need to rebuild. At Manchester United, time doesn’t exist. You have to do it now.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/business/companies/telstra-lifts-dividend-after-profit-jumps-31-per-cent-20250813-p5mml1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Telstra shares fall after mobile miss",
    "publish_date": "Thu, 14 Aug 2025 11:31:01 +1000",
    "category": "finance",
    "authors": [
      "David Swan"
    ],
    "text": "Shares in telco giant Telstra dropped by 2 per cent on Thursday morning, with investors unimpressed by lower than expected mobile numbers.\n\nIn its full-year results on Thursday, Telstra posted bumper profits and raised its dividend after slashing costs and selling the majority of its cloud computing unit to Indian tech giant Infosys.\n\nTelstra chief executive Vicky Brady on Thursday morning. Credit: AFR\n\nThe nation’s biggest telco reported an annual net profit of $2.34 billion – up 31 per cent year-on-year – and said it had cut operating expenses by 6 per cent. Telstra has cut around 3200 jobs over the past financial year, including 500 announced last month.\n\nAlongside the earnings release, the company announced the sale of a 75 per cent in Versent Group, its cloud computing business, to Infosys in a deal worth $233 million. Telstra will retain a 25 per cent stake, and about 650 staff will move to Infosys as part of the transaction.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/sport/afl/10-reasons-to-watch-aflw-in-its-10th-season-20250809-p5mloh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "10 reasons to watch AFLW in its 10th season",
    "publish_date": "Thu, 14 Aug 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [],
    "text": "4. Fountain of youth A decade of AFLW has built a genuine pipeline for talent. Girls who once dreamed of playing footy can now start in Auskick, progress through junior pathways and land on an AFLW list. The difference is clear – these players arrive at the elite level hardened, skilled and fearless. Watch Ash Centra at Collingwood or Havanna Harris at Gold Coast, and you’ll see ready-made footballers. Then there are the rising stars who’ve already made their mark – Matilda Scholz (Port Adelaide), last year’s mark of the year winner, and Montana Ham (Sydney), whose presence and game-winning ability grow every season. These players aren’t just the future – they’re already reshaping the present. When I was growing up, I looked to St Kilda’s Lenny Hayes as my childhood hero, but now you and your family can have a genuine female superstar to follow from any of the 18 clubs. 5. It starts at the top This season’s coaches are a fascinating mix of tactical nous and lived experience. Former AFL names such as Rhyce Shaw (Gold Coast), Toby McLean (Bulldogs), Ben Brown (Essendon), and Brendan Fevola (Richmond) bring with them the sharpness and strategy of the men’s game – Fevola even declaring Ellie McKenzie the best kick he’s seen in either competition. There’s also the influence of AFLW pioneers now moving into coaching, such as Daisy Pearce at West Coast and Lauren Arnell at Port Adelaide. And don’t forget Darren Crocker at North Melbourne, who knows a thing or two about winning, having played in a premiership side in 1996. These voices are shaping a faster, more sophisticated brand of AFLW footy.\n\n6. Fastest-growing female sport The numbers tell the story: since the AFLW began, female participation in footy has exploded by nearly 200 per cent, from 42,000 players to more than 125,000. More than 2500 new women’s and girls’ teams have sprung up around the country, and the AFL is now the largest employer of female athletes nationwide. Every girl who laces up her boots today has a clearer, straighter path to the elite level than ever before, and AFLW is the stage where those dreams can become reality. When you watch, you’re not just seeing a game – you’re seeing the result of a generational shift. Our newest draftees started their pathway when they were eight or nine years old — 10 years ago! The Vic Country team heads out to play South Australia during the under 18s national championships. Credit: AFL Photos 7. Community heartbeat AFLW still has something the men’s competition has mostly lost: the community feel that makes you feel part of the game, not just a spectator. Many games are played at local grounds, where you can stand on the boundary, hear the on-field calls, and be close enough to see the players’ facial expressions. It’s football in its purest form – close to the action, surrounded by families and fans, with a post-match kick-to-kick on the oval. For those who love the romance of suburban footy, AFLW is a time machine back to the game’s grassroots charm. Head down to Arden Street, back to the Kennel, or off to Moorabbin to take a time warp in the best possible way.\n\n8. Milestones with meaning This year, some of the league’s trailblazers are closing in on 100 games, all consecutive. In the men’s competition, 100 games is a solid achievement; in AFLW, it’s monumental. Shorter seasons mean it has taken almost a decade to reach, and these players have carried the league through its formative years – playing in the heat of summer, the chill of winter, and often in front of smaller crowds before the momentum built. Every milestone game this season will be a celebration not just of individual endurance, but of the resilience of the entire competition. Watch out for Ebony Marinoff (Adelaide) and Ally Anderson (Brisbane Lions) to be the first ones to hit it. Me and Bre Koenon (Brisbane Lions) are currently two games behind them on 91. This is the equivalent of a man playing 250 consecutive games in the AFL – a feat only reached by greats such as Jim Stynes and Jack Crisp. AFLW star Ebony Marinoff. Credit: AFL Photos 9. A welcoming, family-friendly atmosphere At AFLW games, the footy is fierce, but the atmosphere is warm. Tickets are affordable, seating is relaxed, and the stands are filled with people of all ages and backgrounds. It’s a space where kids can see their heroes up close, where parents don’t have to worry about rowdy crowds, and where first timers are embraced as quickly as long-time members. It’s the game you love, wrapped in a sense of community and belonging that’s hard to find anywhere else. There are always plenty of activities for kids to enjoy, and the surroundings are really intimate.\n\nLoading 10. Every supporter helps grow the game AFLW is still building, and every eyeball, every ticket, every shout from the boundary line matters. Growth in crowds and TV audiences directly strengthens the league’s ability to push for longer seasons, better pay and greater exposure. The current target is moving from 12 games a year to 14, and eventually to a full home-and-away fixture. The more support we give now, the sooner that vision becomes reality – for today’s players and for every young girl dreaming of one day pulling on an AFLW jumper. What’s exciting is that many of our men’s heroes now have children, often girls, and many of these will play for your club under the father-daughter rule. Imagine watching a mini Matthew Richardson kick a goal for the Tigers after a lace-out kick from one of Trent Cotchin’s daughters! Ten reasons are more than enough. Now it’s over to you to vote with your feet and by watching on TV. This season is shaping up to be the best we’ve ever seen, and we want you there with us. Come and watch us play, follow your team’s journey, and join in the fun from the first bounce to the final siren. Every cheer from the stands, every clap, every new face in the crowd helps us grow the game and inspire the next generation. It’s not the intimidating noise of 100,000 bullish people at the MCG, but it doesn’t need to be.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/culture/books/the-cult-author-who-refuses-to-play-by-the-book-world-s-rules-20250811-p5mm3w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The cult author who refuses to play by the book world’s rules",
    "publish_date": "Thu, 14 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Melanie Kembrey"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size For Rebecca F. Kuang, the easiest way to resist the internet is to carry a phone that won’t cooperate. It doesn’t glow, buzz, or beg for her attention – and she prefers it that way. It’s a statement of defiance against the glowing promise that apps would make us more connected and productive. Instead, Kuang says, they’ve shredded attention spans and left us more alone than ever. “My phone’s basically a brick. It can’t access most apps,” she says. “People can’t send me TikTok links. I can never see them. Of course, a lot of stuff is going to get caught in the net, but on the whole, it’s great because I spend so much more time reading and writing and cooking and being grounded in the world around me and very little time online.” No X, no TikTok, no doom spiral of headlines – a notable abstinence, given the starring role the internet played in her bestselling 2023 novel Yellowface, a razor-edged literary satire about a struggling white writer who swipes the manuscript and identity of her dead Chinese friend, only to face the wrath of the online mob. Rebecca Kuang photographed at the Boston Public Library. Credit: Ben Sklar “That was my internet novel. It was really me getting the internet out of my system. I’m actually pretty extreme about digital minimalism,” Kuang, who publishes as R.F. Kuang, says. “I knew I was never going to write a book like Yellowface again because that just was not a sustainable way for me to be in the world, so I felt like this freedom to do whatever I wanted with the next book. It will probably appeal to a different set of readers, and that’s exciting to me, like I’m tired of talking about Yellowface.” Kuang is in her husband Bennett Eckert-Kuang’s study in their Boston home when we speak over video – not her natural habitat. Enclosed spaces, she explains, feel stifling; she prefers to work somewhere open, where the air can move and the light can spill in. But today, the fading light cuts across her face, artfully preparing us for the shadows of her new novel.\n\nAdvertisement\n\nYellowface looks down on delegates at the publisher’s stand during the first day of the London Book Fair in 2023. Credit: In Pictures via Getty Images If you haven’t read Yellowface, you’ve almost certainly seen it – the bold, winking yellow cover staring back at you from bookshop tables and BookTok. Inside, Kuang skewers the publishing industry and the chronically online mindset with a scalpel and a smirk: taking on how technology has rewired the way we consume art, perform outrage, and weaponise accountability. It’s been optioned for a scripted television series with Karyn Kusama (The Invitation, Yellowjackets, Girlfight) attached to direct. While Yellowface was strikingly topical and opened the door to a wider readership, Kuang had already been forging her path through the searing landscapes of historical fantasy with The Poppy War trilogy (2018–2020) and Babel (2022). Drawing on mid-20th-century Chinese history and begun when she was just 19, The Poppy War was no overnight success – Kuang admits she initially felt “sick to my stomach” every time she thought about sales – but word of mouth gradually built momentum. Meanwhile, Babel, set in 1830s England, became a BookTok hit. This steady rise meant, Kuang says, the sudden attention from Yellowface never “messed me up”. Rebecca Kuang attends the 2023 TIME100 Next in 2023. Credit: Getty Images As she critiqued publishing’s pigeonholing of authors in Yellowface, Kuang herself refuses to be confined by genre or expectation. Almost as soon as she penned the novel, Kuang admits she was bored with the frenetic, internet-fuelled tone that is omnipresent in today’s literary landscape – eager instead to explore new territories, both thematically and stylistically, in her work. “I feel like I’m still very young, and I want room to grow, so to be typecast now would feel stifling and murderous to me,” she says. “I think there is this sort of resistant delight to defying categorisation because when you are pretty overtly racialised or gendered, as so many people are, you do always want to be acting out against expectation.\n\nAdvertisement\n\n“That resentment of expectation is not what drives me. It’s just something I find psychologically interesting about myself. What drives me is wanting to evolve as an artist with every project.” I think it never got to my head or messed me up because I’m really good at moving on to the next project. She’s also grown wary of publishing’s other obsession – youth. In a recent piece for Time headlined Olivia Rodrigo and the Impossible Pressure to Stay a Prodigy, Kuang, 29, reflects on the pressure of being “young” in the literary world. The scepticism that has met her, the interest in her age rather than work, and the anxiety that the apex of her career might have come and gone. “It’s really stupid, I think, that we are so obsessed with young authors in literature. Literature is one of the one things that you only get better at as you get older,” Kuang says. “I hope I’m not in my prime. I hope that my prime is decades away.” Kuang might not realise it yet, given her self-imposed social media ban, but her readers are already gearing up for her sixth novel out this month. Roll your eyes at BookTokers if you like, but they’re busily assembling reading lists heavy with Homer, Virgil, Ovid, and Dante as they prepare for the release of Katabasis – a richly layered, genre-bending dive into the underworld. (The title comes from the Greek word meaning “descent”). Rebecca Kuang’s new novel, Katabasis, plays with classic texts about the afterlife. Credit: Ben Sklar In Katabasis, Cambridge doctoral student Alice Law and her nemesis Peter Murdoch wield pentagram magic to descend into the Eight Courts of Hell, all in a desperate bid to rescue their professor’s soul – without him, their crucial recommendation letter is lost. The novel deftly plays with the classical stages of the underworld journey – the descent, the ordeal, and the return (anabasis) – while tipping its hat to Alice in Wonderland, T.S. Eliot’s The Waste Land, and even drawing from the surreal dreamscapes of Dali.\n\nAdvertisement\n\nIf you’re counting subgenres, it’s a clever mashup of dark academia and historical fantasy, with an enemies-to-lovers twist. And while this might seem underworlds apart from Yellowface, Kuang is as critical as ever, cutting through the pretension, privilege, and politics of academia. If Babel’s Oxford setting allowed an examination of the institution’s historical role as a facilitator of imperial projects, Katabasis focuses on the interpersonal – the inflated egos, the skewed priorities and values, and the fraught, often toxic, relationships between students and teachers. “I think of them as a duology that deals with why I love the academy so much and can’t step away but why I am increasingly uncomfortable with it,” Kuang says, perfectly placed to say so, having roamed some of the world’s most elite academic halls. From her undergraduate years at Georgetown University to graduate degrees at Cambridge and Oxford, she’s now teaching and finishing a PhD in sinology at Yale. Her research spans Chinese-language literature and Asian American writing, focusing on Chinese American and Chinese diaspora authors and their explorations of travel, language, geography, and storytelling. Kuang – who was born in Guangzhou, China, moved with her parents to Dallas, Texas, when she was four – grew up in a household that valued literature highly and was always drawn to fantasy. Rebecca Kuang says she enjoys defying expectations when it comes to genres and styles. Credit: Ben Sklar She started her PhD the same year as her husband, who’s pursuing philosophy at MIT, started his. They recently celebrated their first anniversary. While some couples spend their evenings arguing over whether a potato is too far gone to cook for dinner, theirs seems to involve lively debates on logic paradoxes and the quirks of rational decision-making, conversations about which inspired Katabasis. “I just fell in love with the idea of logic paradoxes, especially paradoxes of rational decision-making, which feels very pertinent to how we live our lives,” Kuang says. “There are so many paradoxes where you make a series of decisions that seem like you’re better off at every stage, and then suddenly you find yourself in a far worse position than you anticipated, with no way to claw out of it. And that seemed like a lovely way to describe being in a PhD program.” Rebecca Kuang has been writing novels since she was 19.\n\nAdvertisement\n\nKuang’s academic and creative worlds have never been separate – they flow into one another. Her novels are set on campuses or in educational institutions, and weave in her scholarly pursuits. Her advisors often remind her to rein in her signature point of view, reminding her she’s writing an essay, not fiction. “I find it very difficult to keep the creative voice from seeping into my academic work. I’m always having conversations with my advisor about how my academic writing needs to be a little less opinionated and have a little less of that spunk and flair that I like to bring to my fiction prose.” Having reached new heights after Yellowface, Kuang could now write full-time. When asked why she hasn’t stepped away from academia, the answer is simple: “I like it.” I feel like I’m still very young, and I want room to grow, so to be typecast now would feel stifling and murderous to me. “I wish I had a more sophisticated answer than that, but I think I’m in a lucky position where I have multiple career options. I could be a full-time author, I could be a full-time academic, and I just enjoy both too much to give either of them up. I always tell myself, the moment it stops being engaging, I’ll step away,” Kuang says. “For all that is frustrating and broken about academia, I’m still committed to this core promise of inquiry and curiosity and sharing it with others, and I do still regularly feel that when I step into a classroom.” She didn’t feel the weight of expectation after Yellowface – no sudden compulsion to chase its sharp success or bottle its biting style. Instead, she slipped quietly into her next chapter, boarding a flight to Taipei to plunge straight into research for a new book.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/national/nsw/how-an-underground-marvel-will-reshape-the-way-sydney-moves-20250811-p5mm4n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How an underground marvel will reshape the way Sydney moves",
    "publish_date": "Thu, 14 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Matt O'Sullivan"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Entering Sydney’s largest underground rail cavern, you are struck by a mass of blue-coloured waterproof lining that covers its walls and ceiling. At 28 metres wide and 180 metres long, the size of the cavern built beneath the northern end of central Sydney for the $25.3 billion Metro West line is breathtaking. Yet what is not obvious is how close it comes to buildings, existing rail tunnels and critical power cables for the CBD. Illustrating the challenge for contractors, the top of the cavern sits just six metres below the foundations of a 169-year-old heritage hotel built from sandstone. Once opened in 2032, the Hunter Street metro station will become the hub for train travel in and out of the northern part of the CBD. It will connect existing heavy rail and metro stations at Martin Place to Wynyard, allowing people to switch between multiple lines without setting foot above ground. The size of the cavern for the Metro West station beneath Hunter Street is breathtaking. Credit: Steven Siewert It will be bigger than both Victoria Cross station in North Sydney and the Martin Place metro station, which is the busiest on the M1 line between the city’s north-west and Sydenham. The reason for its size is simple. While it is forecast to handle 10,000 passengers an hour when it opens in 2032, the only station in the CBD for Metro West is being built for a staggering 40,000 people an hour. Sydney Metro chief executive Peter Regan said the station was being built to be bigger than others to cater for the “very large volume of people” entering and exiting at the same time, and major growth over coming decades.\n\nAdvertisement\n\n“The complexity of what you’re seeing down in that cavern is like nothing we’ve done before in terms of the scale of what is being built under the city. It will become the biggest rail cavern in Australia,” he said. “Hunter Street will be a very busy station because it’s the end of the line, and it’s the only station in the CBD [for Metro West].” In comparison, the M1 line has four stations in the central city – Barangaroo, Martin Place, Gadigal and Central – which means passenger loads during the peak periods are spread, instead of concentrated on one. Initially, six-carriage driverless trains will run on the 24-kilometre line between Parramatta and the CBD every four minutes in each direction. However, the 180-metre-long stations on the Metro West line allow for trains as long as eight carriages to eventually be operated. “It’s designed very much to grow as a station,” Regan said. A tunnel that will connect the existing Martin Place metro station to the new Hunter Street station for Metro West. Credit: Steven Siewert Hunter and Pyrmont stations construction manager Dave Maytom said one of the challenges was the wide span of the cavern and the fact that it was, on average, only about 10 metres beneath the surface. “That is very shallow. To create a large hole, you need a body of rock to support itself above that cavern,” he said, explaining that to provide support a type of concrete known as shotcrete up to half a metre thick was applied. “Working in that city environment is hugely challenging.” About 28,000 tonnes of concrete have been poured to form the cavern floor, leaving more than a third of its construction completed. Excavation of the cavern and most of the connecting tunnels was finished in May.\n\nAdvertisement\n\nTwo giant boring machines are due to break through into the cavern by the end of the year, which will complete twin tunnels between the Bays precinct at Rozelle and the CBD. It will mark a shift for the mega project from digging tunnels and giant holes to building and fitting out stations, as well as the laying of rail tracks and installation of vital equipment. At the western end of the cavern beneath Hunter Street, three giant concrete pillars serve as structural supports for the roof, and will be where three tunnels each about eight metres wide will enter, one of which will be for passengers. Saint Barbara, who is patron saint of tunnellers and engineers, has watched over excavation of the subterranean cathedral-like cavern. Credit: Steven Siewert At the eastern end, a giant shaft is being dug from street level into the cavern. It will serve as the other entrance to the station. Passengers will make their way down via banks of escalators and lifts to a concourse level, before taking another set of escalators to the platforms. The forecast volume of passengers is such that Sydney Metro, a government agency, is considering widening a pedestrian link under George Street between Wynyard station and the western end of Hunter Street station. A direct pedestrian link will be built between the Hunter Street station concourse and the platform level at the existing Martin Place metro station. Importantly, passengers will not need to pass through ticket gates to walk between the two. Transport Minister John Graham said the station would be at the middle of an underground spiderweb of connections in the CBD. “It will open up direct connectivity to every metro line and every train line without ever having to go above ground to cross a street,” he said. “[It] is an engineering feat of which the numbers tell the story of its scale.”\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/national/inside-the-botox-black-market-leaked-messages-reveal-illegal-trading-network-20250812-p5mm9e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside the Botox black market: Leaked messages reveal ‘illegal’ trading network",
    "publish_date": "Thu, 14 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Clay Lucas",
      "Henrietta Cook"
    ],
    "text": "An investigation by this masthead has unearthed hundreds of WhatsApp messages showing nurses subscribed to Fresh Clinics asking their peers to buy, borrow, or swap prescription-only anti-wrinkle medications, including Botox, Dysport and Xeomin.\n\nIt was not an isolated exchange. It’s also illegal.\n\nThe post was shared to a WhatsApp group for nurses and clinics using the services of injectables company Fresh Clinics, and it triggered swift offers of help. One nurse in South Melbourne replied nine minutes later, offering to supply the drug that day.\n\n“Very unethical, I know,” she wrote. “But I am open over the Christmas/New Year period and have been left with nothing as the past week we have been inundated. I thought I had enough stock. Please don’t judge me.”\n\nThe owner of a Geelong skin clinic was frantically trying to buy anti-wrinkle drugs from her peers, an act prohibited under Australian medication laws.\n\nAt 7.48am on Christmas Day in 2020, a desperate plea pinged in a WhatsApp group for nurses subscribing to Australia’s largest cosmetic injectables telehealth company.\n\nAdd articles to your saved list and come back to them any time.\n\n“Does anyone have two vials of Botox I could buy off them? I have 3 days left in clinic before going away for 3 months and don’t want to leave anything sitting in my fridge,” said another in an April 2023 exchange.\n\nReplies arrived within minutes – offers to help out from Melbourne suburbs Frankston, Williams Landing and Blackburn.\n\n“Hey guys! Anyone have a spare vial (Dysport or Botox) I can grab asap?” a Melbourne-based nurse wrote in December 2023. “I’m willing to travel anywhere in Melbourne. I’ve already ordered but it didn’t come on time for my patients tomorrow! Would appreciate it heaps.”\n\nRequests were often met with near-instant offers, highlighting how quickly supply could be sourced through the informal networks.\n\nThe WhatsApp messages used varied terminology — buy, borrow, sell, grab – but the effect was the same: restricted drugs changing hands outside formal supply channels, arranged via encrypted group chats.\n\nUnder Australian law these Schedule 4 drugs can only be supplied by licensed wholesalers to authorised prescribers or pharmacists, to safeguard patient safety and control the movement of drugs.\n\nFresh Clinics does not directly employ the nurses working in the injectables clinics. The clinics are independent businesses which pay a subscription to Fresh Clinics to access doctors and medicines.\n\nA NSW Health spokesman likewise said the medications could only be obtained by an authorised practitioner and could not be resupplied.\n\nAsked to respond to the messages, a Victorian Health Department spokeswoman said: “The trading of Schedule 4 medicines between clinics is not lawful.”\n\nAs telehealth fuels the expansion of Australia’s booming $4 billion injectables industry, regulators are scrambling to roll out changes to protect patients.\n\nOther nurses offered to sell stock they no longer needed: “I made an order in error – would anyone like to buy some Botox?” a nurse wrote in June 2023. “I can grab some off you,” another replied. “Yes pls!” added a third quickly.\n\nIn one November 2023 exchange, a nurse asked: “Hi team, does anyone stock [cosmetic filler] Sculptra? Can I buy one off you please?” The co-owner of Fresh Clinics, John Holbrook, responds: “You can’t on-sell it. But we can assist to move it across clinics.”\n\nUnder the Fresh Clinics model, nurses, operating as independent businesses, consult with clients, then request a remote video review by a Fresh Clinics doctor, who issues a script. The nurse administers the treatment.\n\n“These communications illustrate an unlawful black market for prescription-only cosmetic medicines,” he said. “The system loses integrity, meaning that any harmed patients will struggle to obtain a remedy.”\n\nDr Christopher Rudge, a lecturer in health practitioner law at the University of Sydney, reviewed the WhatsApp messages and said they illustrated unlawful trading and created an untraceable supply chain.\n\n“Fresh Clinics ensures that all stock transfers between clinics comply with the latest federal and state regulations,” a spokeswoman said.\n\nThere is no suggestion Fresh Clinics has broken the law, and in a statement it said it had done nothing wrong.\n\nFresh Clinics staff were aware of this. In March 2022 the company’s clinical director replied to a nurse post: “These can’t be onsold … onselling of a schedule medication is illegal.”\n\nFederal law prohibits the unauthorised sale or transfer of Schedule 4 medicines. Prescription-only drugs must be distributed by licensed wholesalers to authorised practitioners, not traded peer to peer.\n\nIn March this year, this masthead revealed that some Fresh Clinics doctor consultations lasted as little as 52 seconds before a script was approved. Following that investigation, new rules released in June by Australia’s health practitioner watchdog included tighter rules for first-time patients and restrictions on issuing high-speed telehealth scripts.\n\nThe model was designed for flexibility. But many doctors who practise in-person medicine argue it removes critical points of clinical oversight.\n\nFresh charges a per patient fee – usually $25 – and also leaves nurses to handle ordering, storage and administration of the medication.\n\nCo-founder John Delaney was more direct when fielding questions via a different WhatsApp forum in April this year: “Wholesalers can only sell to a doctor, nurse practitioner or pharmacist.”\n\nYet elsewhere, other staff advised workarounds. In 2021, co-founder John Holbrook wrote to one nurse: “Hi [name removed], it’s not legal for you guys to onsell medication. But [Fresh Clinics staffer] can help out seeing if there’s somewhere that Dysport can be borrowed and replaced from.”\n\nThat “borrow and replace” system was sometimes formalised, other times not. In one message, the company’s head of clinical training advised a nurse: “Let us know who you end up getting product from and we will invoice you and send out replacement to the nurse who loans the product.”\n\nThe nurse responded: “Thanks so much, for sure ‘sell’ was probably the wrong word to use as I know you guys reimbursed the lender with product.”\n\nAirtasker driver, Kmart Esky\n\nIt was May 2021, and a senior Fresh Clinics manager was on the hunt for a new delivery driver. She proposed the company “load a new job every day onto Airtasker with the anticipated jobs for the day”.\n\nThen, she posted a job on Airtasker for a driver to deliver for an “aesthetic supply company” at $840 per week. “Own vehicle necessary,” the ad said.\n\nThe job went to Shah, a part-time driver who also delivered auto spare parts. He told this masthead he didn’t know what was in the boxes he would drop off to clinics, just that they were packed professionally.\n\n“Some of them were very urgent, some weren’t,” said Shah, who declined to give his surname. “I just put extra ice inside the Esky. So I had to get the ice … and I just put it in my car.”\n\nA staff message to Shah from that time reads: “Have you bought the Esky?” Shah replied: “Buying it now in Kmart Broadway.”\n\nApproached about this and other issues raised in WhatsApp messages, the Therapeutic Goods Administration declined to comment, saying responsibility rested with states and the Australian Health Practitioner Regulation Agency. That agency, in turn, referred queries to state health authorities.\n\nCosmetic physician Ronald Feiner, the medical dean of the Australasian College of Cosmetic Surgery and Medicine, said transporting botulinum toxin, commonly known by the brand name Botox, in an Esky put patient safety at risk.\n\nHe said the substance must be stored at stable, cold temperatures – usually between 2 to 8 degrees – in order to be effective. Improper handling could compromise product quality and increase the risk of infection and tissue damage, Feiner said.\n\n“It is way below standard and unacceptable,” he said of the Esky transportation. “I wouldn’t accept products transported in that manner and I wouldn’t inject it into my patients. It is completely substandard.”\n\nFeiner is also a co-ordinator at the International Master Course on Ageing Science, which hosts the world’s leading cosmetic dermatology and plastic surgery meeting and reviews cosmetic complications lodged by doctors from around the world.\n\nHe said the group reviewed a complication linked to botulinum toxin around once a week, and always questioned whether the substance was stored and transported correctly.\n\n“Improper storage may lead to product degradation, which can cause infections and tissue damage,” he said. “This damage can lead to depressions in the skin like little finger compressions.”\n\nThis GIF of US TV host Stephen Colbert was posted in a chat between Fresh Clinics workers. Credit: Marija Ercegovac\n\nIn addition, he said botulinum toxin stored at incorrect temperatures might be ineffective or wear off more quickly.\n\nOther messages seen by this masthead showed Fresh Clinics staff sometimes also adopted a tone that minimised the seriousness of their work.\n\nIn a 2021 thread, the company’s head of training posted a meme of American TV host Stephen Colbert waving oversized syringes, alongside a text discussing Fresh’s $25 telehealth consults now possible via the company’s app. Her caption: “And we don’t take any liability LOL.”\n\nIn another exchange in one of the WhatsApp groups, when a nurse asked if unmixed Botox left out of the fridge could still be used, co-founder Holbrook responded: “It’s good for use on yourself/family at a minimum.”\n\nFresh Clinics goes political\n\nAs scrutiny of the injectables industry has intensified in recent years, Fresh Clinics has become more politically active. In May federal lobbying firm Barton Deakin registered as its lobbyist, followed in June by Hawker Britton. In July, PR agency Sling & Stone registered as its third Canberra lobbyist.\n\nResearcher Maddison Johnstone, from advocacy group Operation Redress, said the industry had undercut its own arguments about professionalism.\n\n“It seems the industry has dabbled in the very thing it purports to be against when it suits their commercial interests. Patients deserve better – they pay through the nose and trust licensed clinics are prioritising their safety.”\n\nResearcher Maddison Johnstone. Credit: Paul Harris\n\nIn response to detailed questions from this masthead, a Fresh Clinics spokeswoman said the company’s “well-connected network of nurses and doctors” included “a private WhatsApp community where we share industry insights, tips, trends and regulatory updates and requirements”.\n\nShe said nurses co-ordinating stock transfers with doctor oversight “is consistent with long-standing medical practices, with some stock transfers co-ordinated via private messaging platforms. Fresh Clinics ensures that all stock transfers between clinics comply with the latest federal and state regulations.”\n\nShe said while some of the transfers appeared to be selling, swapping and trading, they were in fact not. “While some members may use varying degrees of terminology, Fresh Clinics monitors this channel and corrects any misused language where possible.”\n\nA NSW Health spokesman said that under the state’s Poisons and Therapeutic Goods Act, cosmetic medicines like botulinum toxin can only be bought by an authorised practitioner, such as a doctor or nurse practitioner.\n\nLoading\n\nHe stressed that these drugs “cannot be resupplied to another clinic or authorised practitioner”.\n\nThe NSW regulator warned that anyone suspected of breaking these laws would be investigated.\n\nAnd, just as in Victoria, which said trading Schedule 4 medicines between clinics was not lawful, a Queensland Health Department spokeswoman said: “‘swapping’ or ‘borrowing’ Schedule 4 medicines amounts to ‘buy’ and ‘supply’, which is not permitted in Queensland unless authorised”.\n\nDr Christopher Rudge, who also reviewed the messages, said the behaviour constituted professional misconduct that could lead to a tribunal revoking a practitioner’s registration.\n\nA system built for speed – not scrutiny\n\nThe hundreds of WhatsApp screenshots seen by this masthead show clinic owners and nurses often operating with a sense of urgency to maintain supply.\n\nLoading\n\nAnd while senior staff at Fresh Clinics can be seen intervening on some exchanges to remind nurses not to on-sell products, the messages are otherwise devoid of references to bodies like the TGA and state health laws, or consulting pharmacists.\n\nThe Christmas Day message at the start of this story from the Geelong clinic owner, who this masthead attempted unsuccessfully to contact, still stands out: “Very unethical, I know … Please don’t judge me.”\n\nStart the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Thu, 14 Aug 2025 11:25:20 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 36
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/agents-driving-r360-rebel-league-20250814-p5mmx5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Agents driving R360 rebel league",
    "publish_date": "Thu, 14 Aug 2025 11:17:07 +1000",
    "category": "finance",
    "authors": [],
    "text": "Agents driving R360 rebel league\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 37
  },
  {
    "url": "https://www.smh.com.au/national/queensland/masterclass-on-how-not-to-run-an-incident-response-runcorn-train-crash-delays-passengers-20250814-p5mmvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Masterclass on how not to run an incident response’: Runcorn train crash delays passengers",
    "publish_date": "Thu, 14 Aug 2025 11:16:23 +1000",
    "category": "finance",
    "authors": [
      "Courtney Kruk",
      "Catherine Strohfeldt"
    ],
    "text": "Rail service on the Gold Coast and Beenleigh lines was brought to a halt after a collision between a truck and a train bound for Brisbane carrying about 300 passengers on Thursday morning.\n\nEmergency services were called about 6.55am to the Bonemill Road level crossing, near Runcorn station, after reports a Beenleigh line train clipped a truck.\n\nThe scene at Runcorn after the train and truck crash on Thursday morning. Credit: Nine\n\nParamedics assessed the truck driver and passengers onboard the train, with no injuries reported.\n\nOne passenger described hearing a “loud bang” while waiting for their train at Fruitgrove Station, about 750 metres from the collision site.",
    "source": "SMH",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/prime-minister-refutes-reports-of-hamas-support-midday-news-bulletin-14-august-2025/btlke1w7w",
    "title": "Prime Minister refutes reports of Hamas support | Midday News Bulletin 14 August 2025",
    "publish_date": "Thu, 14 Aug 2025 02:04:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Prime Minister issues warning about Hamas \"propaganda\"\n\nTreasurer does not want to limit ideas ahead of productivity roundtable\n\nConcerns test cricket is becoming increasingly unviable\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAnthony Albanese has denounced reports Hamas, which governs parts of Gaza and is listed as a terrorist organisation by the Australian Government, has welcomed his decision to recognise Palestinian statehood.\n\n\n\n\n\nThe prime minister today repeated his assertion that Hamas would be opposed to the decision, which is also dependent on the future Palestinian government recognising an Israeli state.\n\n\n\n\n\nAustralia's recognition of Palestinian statehood will still be dependent on Hamas having no role in a future state, he says, despite the terror organisation apparently praising the government's move in the past day.\n\n\n\n\n\n\"I notice in the statement it has made today, they say the alleged statement from someone yesterday was someone who has been in prison in Israel since October 2023 and has no means of communication. What that should be is a warning to the media to be very careful about the fact that Hamas will engage in propaganda.\"\n\n\n\n---\n\n\n\n\n\nThe Productivity Commission has released a number of proposals, including reformation of construction investment, a transition to cleaner energy and the use of Artificial Intelligence [[A-I]] to help ease teachers' workloads and improve education equality.\n\n\n\n\n\nUnemployment data will be released tomorrow, which is used as a key indicator of the economy's performance.\n\n\n\n\n\nMr Chalmers says he does not want to limit the scope of discussions next week.\n\n\n\n\n\n\"This is a genuine attempt to try and build consensus around the suggestions that people might have for us, to agree on some reform directions for the government to do more work on.\"\n\n\n\n---\n\n\n\n\n\nAs telecommunications giant, Telstra, reports a major profit boost, its leadership are backing calls for a national digital infrastructure plan.\n\n\n\n\n\nTelstra's CEO, Vicky Brady addressed investors today, referencing recent Productivity Commission recommendations for the use of A-I, as she called on the Federal Government to coordinate its approach on the issue.\n\n\n\n\n\n\"We need the right policy and regulatory settings to make sure we can roll out large scale digital infrastructure projects more quickly and efficiently.\"\n\n\n\n\n\nTelstra has posted a 2.34-billion-dollar profit for the past financial year, over thirty per cent higher than the previous 12 months.\n\n\n\n\n\nThe company made major savings with thousands of job losses since mid-2024, including 5,500 job cuts announced in recent weeks.\n\n\n\n---\n\n\n\n\n\nAllegations of sexual offences in the childcare sector have increased by almost 50 per cent, with advocates blaming cultural and regulatory failures in the sector.\n\n\n\n\n\nBody Safety Australia, which promotes childhoods free from violence, says there is a growing safety crisis in New South Wales, where more than 400,000 children attended a care service.\n\n\n\n\n\nIt cited a 47 per cent increase in sexual offence notifications to the New South Wales Office of the Children's Guardian between 2023-2024.\n\n\n\n---\n\n\n\n\n\nBody Safety Australia lists several gaps offenders had taken advantage of, including workforce instability, inadequate training and qualifications, inconsistent oversight and confusing reporting frameworks.\n\n\n\n\n\nA warning that the following story contains the name of an Aboriginal person who has died, used with permission of his family.\n\n\n\n\n\nA funeral is being held today in Cowra for Wiradjuri Elder, activist and lawyer Paul Coe, who passed away in late July.\n\n\n\n\n\nHe is being remembered for his dedication to improving the lives of First Nations people.\n\n\n\n\n\nBorn in 1949, he grew up at the Erambie Mission in Cowra in central NSW on Wiradjuri Country before moving to Sydney in the 1960s.\n\n\n\n\n\nMr Coe was instrumental in establishing the Aboriginal Legal Service and was the first Aboriginal person to study law at the University of New South Wales becoming one of the first Indigenous barristers in Australia.\n\n\n\n\n\nHe was 76 years old.\n\n\n\n---\n\n\n\n\n\nCricket Australia chief executive Todd Greenberg has warned some nations will go bankrupt if they continue to play the longest format of the game, stressing he sees a future with less Test nations.\n\n\n\n\n\nGreenberg is calling for a lighter Test game schedule, to ensure the format remains viable.\n\n\n\n\n\nThe comments come after The International Cricket Council recently set up a working party to look at the Test format and ways to make it more viable.\n\n\n\n\n\nGreenberg says less is more.\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-who-stands-to-gain-what-from-the-alaska-summit/pkntxqqqn",
    "title": "INTERVIEW: Who stands to gain what from the Alaska summit?",
    "publish_date": "Wed, 13 Aug 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/video/federal-investment-in-social-enterprises-helping-to-change-lives/0vp8fgoo6",
    "title": "Federal investment in social enterprises helping to change lives",
    "publish_date": "Wed, 13 Aug 2025 10:42:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/video/police-weapon-discharged-during-arrest-at-sydney-airport/i6buiwytq",
    "title": "Police weapon discharged during arrest at Sydney Airport",
    "publish_date": "Wed, 13 Aug 2025 10:27:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/article/mcdonalds-japan-cancels-pokemon-card-promotion-amid-food-wastage-online-resales/6b01iiqjd",
    "title": "McDonald's Japan cancels Pokémon card promotion as resellers throw away food",
    "publish_date": "Wed, 13 Aug 2025 08:58:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "Fast-food chain McDonald's Japan has cancelled a Happy Meal campaign that came with coveted Pokémon cards, apologising after resellers rushed to buy the meals and then discarded the food, leaving rubbish outside stores.\n\n\n\n\n\nThe meals, called Happy Sets in Japan, were meant for children. They came with a toy, such as a tiny plastic Pikachu, and a Pokémon card.\n\n\n\n\n\nThey sold out in a day, according to Japanese media reports. Mounds of wasted food were found near the stores.\n\n\n\n\n\n\"We do not believe in abandoning and discarding food. This situation goes against our longtime philosophy that we have cherished as a restaurant to offer a fun dining experience for children and families,\" the company said on Monday.\n\n\n\n\n\n\"We sincerely accept that our preparations had not been adequate.\"\n\n\n\nMcDonald's said it was working on ways to prevent such a situation happening again, such as limiting the number of meals each person can buy and ending online orders.\n\n\n\n\n\nIt said it might deny service to customers who fail to abide by the rules.\n\n\n\n\n\nPokémon cards are extremely popular among children but also adult superfans and collectors, with billions printed. Popular cards can sell thousands of dollars.\n\n\n\nCertain rare Pokemon cards can go for hundreds or thousands of dollars. Source: AFP / Alessandro Bremec/NurPhoto There have even been cases of shops that sell the cards — which represent monsters and their attributes, and can be used to play a tabletop game — being broken into and physical fights breaking out in low-crime Japan.\n\n\n\n\n\nUnusually large crowds were flocked to McDonald's stores when the meals with Pokémon cards went on sale.\n\n\n\n\n\nThe cards were later being resold for up to tens of thousands of yen (hundreds of dollars) online.\n\n\n\n\n\nMcDonald's has been selling Happy Meals for more than 40 years. In Japan, they usually sell for 510 yen ($5.30).\n\n\n\n",
    "source": "SBS",
    "cluster_id": 8
  },
  {
    "url": "https://www.sbs.com.au/news/article/many-millennials-are-expecting-to-receive-a-hefty-inheritance-will-they-get-one/0ocd3bnxo",
    "title": "Millennials are expecting a $500,000 inheritance on average. Will they get one?",
    "publish_date": "Wed, 13 Aug 2025 08:32:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Young Australians may be vastly overestimating the amount of inheritance they expect to receive.\n\n\n\n\n\nA new survey from wealth management firm Colonial First State (CFS) found that younger Australians between the ages of 18 and 29 anticipate an inheritance of around $525,000.\n\n\n\n\n\nThe survey, which spoke to 2,250 Australians over the age of 18, found that young people's expectations were in line with those aged 40 to 49, who expected to inherit around $547,667.\n\n\n\n\n\n\"Young people are hopeful about receiving financial support in the form of an inheritance due to rising living costs, stagnant wage growth and housing pressures ,\" CFS chief executive Kelly Power said.\n\n\n\nThe survey found that more younger people are expecting an inheritance, as housing affordability means many struggle to get onto the property market. Source: AAP / Dan Himbrechts However, the sum is nearly double the amount that older generations expect to receive, with the 65 to 74 age bracket anticipating around $167,624.\n\n\n\n\n\n\n\nWith trillions of dollars expected to be transferred via intergenerational wealth over the coming years, the data on who will receive that inheritance shows that younger Australians' expectations may not match up to the reality.\n\n\n\nWhere will 'the great wealth transfer' go?\n\nA Productivity Commission report from 2021 found that $1.5 trillion in wealth had been transferred in Australia in the past two decades, with around 90 per cent of that total in the form of inheritance. Some estimates suggest that $3.5 trillion more could be handed down in the coming decades .\n\n\n\n\n\nEconomists call this 'the great wealth transfer'.\n\n\n\n\n\nHowever, younger generations aren't always the beneficiaries. Melbourne University's HILDA survey of household, income and labour dynamics found that most recipients of inherited wealth are over 55, receiving an average inheritance of $275,619.\n\n\n\n\n\nMatt Grudnoff, senior economist at the Australia Institute, says that young people are relying on an inheritance to get into the property market, a need \"born out of desperation\" .\n\n\n\nBaby boomers hold $4.9 trillion in assets according to CoreData analysis. Source: SBS News \"In the past, inheritance was a way of redistributing wealth, but increasingly wealth is being concentrated in smaller and smaller groups, so effectively this is going to flow to a very small minority of people,\" he said.\n\n\n\n\n\nGrudnoff said it's true that people tend to overestimate their inheritance, making guesses \"based on hope and not reality\".\n\n\n\n\n\nThe Australian Council of Social Service 2024 Inequality Report found that income inequality is growing in Australia as the wealthiest 10 per cent of households possess 44 per cent of total wealth. Further, older households are more likely to have more wealth, with households aged 65+ being four times wealthier than households aged 35 and under .\n\n\n\nAdjusting inheritance expectations\n\nWhile there is no official data to confirm just how much wealth is being passed down, the Productivity Commission estimates the average inheritance is around $125,000.\n\n\n\n\n\nThe HILDA survey also found that inheritances tend to be smaller for younger generations. It estimated that only 1.5 per cent of Australians between the ages of 25 and 34 received an inheritance, at an average amount of $50,508.\n\n\n\n\n\n\"Inheritances are not going to be that large for most people,\" Grudnoff said.\n\n\n\n\n\n\"It might help you in your retirement, but I don't think it's going to radically change whether or not you can buy a house or help you through most of your life.\"\n\n\n\nThe CFS survey also found 82 per cent intended to leave an inheritance but only 38 per cent have a will.\n\n\n\n\n\nCFS head of technical services Craig Day said it's important that expectations are discussed openly among family members.\n\n\n\n\n\n\"By having these conversations early, families can ensure that everyone is on the same page and can make informed decisions that align with their values and goals,\" he said.\n\n\n\n\n\n\"It's not just about passing on wealth — it's about passing on clarity. Families need to talk about their intentions, their needs, and their plans.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/grants-for-social-enterprises-look-to-break-cycles-of-disadvantage/mqrja41is",
    "title": "Grants for social enterprises look to break cycles of disadvantage",
    "publish_date": "Wed, 13 Aug 2025 08:19:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nRoya Moeen never saw herself being a head chef of a popular restaurant.\n\n\n\n\n\nFleeing the Taliban from her home in Afghanistan, she came to Australia in 2014.\n\n\n\n\n\nHer experience working was mainly as a housewife for her family.\n\n\n\n\n\nBut then, three years ago, she found an opportunity to work at Kabul Social.\n\n\n\n\n\n\"I can, because I'm [a] good chef at home and [then I] come here, after that, I started work. First time I'm very scared. You know, after that, slowly, slowly, I'm better.\"\n\n\n\n\n\nNow the head chef, she says it's been an empowering experience.\n\n\n\n\n\nShe leads a kitchen which donates meals to those in need, one in Sydney and one in Afghanistan for every meal sold.\n\n\n\n\n\n\"I can look after my family and I work outside and independent. You know, I feel independent. It's so good for everyone.\"\n\n\n\n\n\nThis kind of initiative has been backed by the federal government and is now receiving a $120,000 grant.\n\n\n\n\n\nMinister for Social Services Tanya Plibersek even had her own go at Afghan cuisine.\n\n\n\n\n\nPlate it Forward, which runs Kabul Social, is just one of the organisations receiving funding aimed at helping marginalised communities.\n\n\n\n\n\nMs Plibersek says it's hoped social enterprises like this will have a long-lasting impact.\n\n\n\n\n\n\"We want to invest a small amount of money so these terrific organisations can help more people help themselves. We know the impact of intergenerational disadvantage, and we want to stop it by investing with refugee women, with First Nations communities, people with a disability. By investing early, helping them become financially self-sustaining, we know that we'll change their lives and we'll change the trajectory of their families' lives.\"\n\n\n\n\n\nDavid Hetherington is the CEO of Impact Investing Australia.\n\n\n\n\n\nHe says better employment outcomes help address the disadvantages experienced by marginalised communities.\n\n\n\n\n\n\"We want to see the funders and the kind of supporting ecosystem, who makes it possible, get stronger and deeper and ultimately, the goal is to address that disadvantage, that marginalisation that exists in the Australian community, and bring more and more and more people into mainstream employment and the mainstream economy.\"\n\n\n\n\n\nShaun Christie-David is the CEO of Plate it Forward Hospitality.\n\n\n\n\n\nWith four other restaurants as well, he says this is an opportunity for Plate it Forward to grow even further.\n\n\n\n\n\n\"This represents so much to us. I think where we're seeing is the incredible strength and talent of our team, accelerating in ways that are beyond what we would have dreamt of. So this allows us to move into more venues, more impact, more employment and great opportunities and outcomes for our incredible people from the under-represented communities that we serve.\"\n\n\n\n\n\nFor Roya, cooking is deeply meaningful to her.\n\n\n\n\n\nAnd it's a career she hopes to pursue further.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/ceo-series-cbas-matt-comyn-on-record-profits-ai-productivity-and-the-consumer/aoujiz6jy",
    "title": "CEO Series: CBA's Matt Comyn on record profits, AI, productivity and the consumer",
    "publish_date": "Wed, 13 Aug 2025 08:03:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/article/when-paul-wanted-to-have-kids-he-was-forced-to-go-overseas-he-says-reform-is-past-due/8d3mno664",
    "title": "When Paul wanted to have kids, he was forced to go overseas. He says reform is 'past due'",
    "publish_date": "Wed, 13 Aug 2025 05:30:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Western Australians have left the state — and even gone overseas — to pursue their dreams of having children due to laws that prevent gay couples and single men from becoming parents.\n\n\n\n\n\nThe WA government is now planning to bring in legislation to overhaul the state's surrogacy and in vitro fertilisation (IVF) laws, eight years after it first promised reforms.\n\n\n\n\n\nThe changes would allow same-sex male couples, single men, transgender and intersex people access to altruistic surrogacy. Currently, only heterosexual couples and single women can pursue altruistic surrogacy.\n\n\n\n'Monumental legislation'\n\nGay father of two Paul Hadfield-Jia said the legislation would be life-changing for many if passed. He knows first-hand how hard it can be for same sex couples in WA to have children.\n\n\n\nREAD MORE Cambodia banned surrogacy. An Australian couple smuggled out the woman carrying their twins\n\nHadfield-Jia told SBS News the laws that restrict IVF and surrogacy are \"archaic\", and led to him travelling to the United States to become a parent, as he and his husband were not able to do so in Perth.\n\n\n\n\n\n\n\nWestern Australia is the only Australian state where same sex couples and single men are not allowed to access surrogacy.\n\n\n\n\n\nAfter finding an egg donor and surrogate in the US state of Idaho, Hadfield-Jia had the first of his two children, his daughter Samantha.\n\n\n\n\n\nBringing her back to Australia was another \"challenging\" process.\n\n\n\nPaul Hadfield-Jia with his daughter Samantha, surrogate Dianna and egg donor Mariah. Credit: Supplied \"Once you're in Australia, it's really hard trying to get your children into the system with Medicare and Centrelink, and a lot of these systems are not set up to care for or take care of people and families like my own or other heterosexual couples that have had children through surrogacy,\" Hadfield-Jia said.\n\n\n\n\n\n\"It's a whole process and it's so challenging, and there's so much more than just having to care and love for a child that's just been born.\"\n\n\n\n\n\nHe said he felt fortunate that overseas travel and surrogacy were an option for him, but for many, the associated costs remain a barrier to parenthood.\n\n\n\n\n\n\"This is the most monumental life-changing legislation that we've had in years from a gay community perspective,\" he said.\n\n\n\nREAD MORE How a fertility clinic hack turned Isaac’s good deed into a privacy disaster\n\n\"In 2017, there was marriage equality, but it was only half the job. You're allowed to marry who you love, but you are not allowed to create a family because of who you love,\" Hadfield-Jia said.\n\n\n\n\n\nHe's hopeful the legislation would pass the state's parliament.\n\n\n\n\n\n\"Why would our MPs not want to support legislation which will allow Western Australians to have their children and families safely here in WA?\"\n\n\n\nGay couples have felt 'not welcome' in WA\n\nSarah Jefford, a family creation lawyer and a surrogate herself, told SBS News she has had clients leave WA to become parents.\n\n\n\n\n\n\"I have had lesbian couples who haven't been able to do egg sharing in WA, so they have also travelled interstate to access treatment elsewhere,\" she said.\n\n\n\n\n\n\"I know of several clients that are now living in Melbourne and Sydney because they didn't feel like they were welcome and thought this is supposed to be a progressive country, but actually the rainbow flag waving is bollocks because we're not even welcome here.\"\n\n\n\nJefford said if the legislation is passed, it would help more people become parents, saying the state had become \"less diverse\" due to the restrictions.\n\n\n\n\n\n\"Many people have had kids interstate but been afraid to return to WA out of fear of stigma or shaming,\" she said.\n\n\n\n\n\n\"I think in the future reforms will grow the availability and accessibility of surrogacy, particularly for gay couples and single men, but also for fertility treatments generally.\"\n\n\n\n'Well past due'\n\nWA Premier Roger Cook said many people have been waiting for the Assisted Reproductive Technology and Surrogacy Bill 2025 to pass.\n\n\n\n\n\nHe acknowledged there have been \"long-standing barriers\" to accessing IVF and surrogacy in the state.\n\n\n\n\n\n\"This legislation delivers on my government's commitment to modern, inclusive and evidence-based laws that reflect the needs of our community,\" he said.\n\n\n\nREAD MORE Alana felt good about donating her eggs until she realised her sexuality was an issue\n\nThe reforms would bring WA in line with the rest of the country, which Jefford said was a long-awaited change.\n\n\n\n\n\n\"It's well past due and I'm not going to give them a pat on the back for doing something they should have done 10 years ago,\" she said.\n\n\n\n\n\nHadfield-Jia urged the state government to continue to consult with the LGBTIQ+ community.\n\n\n\n\n\n\"It is just so important that our MPs understand and connect with people that have got lived experiences. It's so important that they connect with people to understand why this is so important before they make their decision.\n\n\n\n\n\n\"Because there are hundreds and hundreds of people, gay or straight, that want to have kids. And I've been waiting for a long time for this legislation to come through, and I think it's truly important.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 43
  },
  {
    "url": "https://www.theage.com.au/sport/afl/tom-morris-trade-period-update-on-stars-20250814-p5mmy1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tom Morris' trade period update on stars",
    "publish_date": "Thu, 14 Aug 2025 12:09:44 +1000",
    "category": "finance",
    "authors": [],
    "text": "Tom Morris' trade period update on stars\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/afl/aflw-weekly-live-round-one-blues-pies-name-teams-for-season-opener-20250813-p5mmlw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFLW weekly update round one: Blues, Pies name teams; Coach’s ‘irrelevant’ call",
    "publish_date": "Thu, 14 Aug 2025 12:06:03 +1000",
    "category": "sports",
    "authors": [],
    "text": "Dual AFLW premiership coach Matthew Clarke is downplaying attention on his final season as Adelaide’s mentor as “irrelevant”.\n\nClarke will step down as the Crows’ coach at the end of a season starting with the perennial powerhouse taking on St Kilda on Sunday.\n\nAdelaide coach Matthew Clarke with the 2022 AFLW premiership cup. Credit: AFL Photos\n\nThe 51-year-old has been Adelaide’s women’s coach since 2018 and delivered two of the club’s three flags, but says nothing feels different entering his last season.\n\n“Not at all, to be fair,” he told reporters on Thursday.\n\n“Obviously it has given us something to talk about in the off-season which is nice. But internally, it has honestly been business as usual.\n\n“Your focus always is really quite narrow ... I’m really focused on what’s happening now.”\n\nClarke said his feelings were mirrored by his players, including co-captain and seven-time All Australian Ebony Marinoff.\n\n“I saw Noffy the other day and she goes: ‘I keep getting asked about that’,” he said. “And she goes: ‘Really, I just want to say I don’t care’.\n\n“I said, good answer. They should just be wanting to play because we’ve finally got the opportunity to play after nine months. It’s really irrelevant, genuinely irrelevant.”\n\nThe Crows, beaten preliminary finalists last season, again loom as a force.\n\nAAP",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-washington-warns-albanese-on-china-european-leaders-raise-deal-with-trump-to-stop-ukraine-war-20250814-p5mmsx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Washington warns Albanese on China; European leaders raise deal with Trump to stop Ukraine war",
    "publish_date": "Thu, 14 Aug 2025 12:04:18 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "The Australian Securities and Investments Commission (ASIC) is taking legal action against superannuation giant Mercer, alleging it failed to tell the regulator about investigations it was doing into serious problems including incorrect refunds for members who had died.\n\nAs part of a wider push to lift the standards of member service from superannuation funds, ASIC has launched Federal Court action against Mercer. It alleges the fund did not have the right systems in place to comply with laws that require funds to promptly tell ASIC about investigations into major breaches of their obligations.\n\nASIC deputy chair Sarah Court. Credit: Alex Ellinghausen\n\nASIC said some of the investigations in question included one probe by Mercer into insurance premiums that were not refunded correctly after members had died.\n\n“We allege a pattern of longstanding and systemic failure by Mercer Super to comply with the law,” ASIC deputy chair Sarah Court said.\n\n“These aren’t just technical breaches. Allowing investigations into significant issues to drag on for months or, in some cases, over a year without reporting them to ASIC demonstrates a lack of care for customers and can put more at risk.”",
    "source": "TheAge",
    "cluster_id": 11
  },
  {
    "url": "https://www.theage.com.au/business/companies/alan-joyce-left-qantas-two-years-ago-now-he-s-defending-his-record-20250813-p5mmq2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Alan Joyce left Qantas two years ago. Now he’s defending his record",
    "publish_date": "Thu, 14 Aug 2025 11:58:21 +1000",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "Former Qantas boss Alan Joyce is expected to defend the airline’s cost-slashing strategy during the COVID crisis, while laying out the challenges for Australia’s aviation industry in a speech to be delivered on Thursday afternoon.\n\nAcknowledging the “hard and painful decisions” made by Qantas management during the pandemic lockdowns, the outspoken former airline chief executive will underscore the importance of “resilience” for the industry, according to his speech sent to reporters ahead of delivery.\n\nThe address will be Joyce’s first major public comments since leaving the airline after months of controversy in late 2023.\n\nQantas ex-CEO Alan Joyce is breaking his silence on his time at the helm of the airline. He’s looking ahead too. Credit: Jean Chung\n\n“It’s easy to forget now, but in 2020, global aviation didn’t just stumble. It collapsed,” Joyce will say.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/culture/music/what-we-learnt-from-taylor-swift-s-appearance-on-boyfriend-travis-kelce-s-podcast-20250813-p5mmo2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What we learnt from Taylor Swift’s appearance on boyfriend Travis Kelce’s podcast",
    "publish_date": "Thu, 14 Aug 2025 11:44:30 +1000",
    "category": "entertainment",
    "authors": [
      "Nell Geraets"
    ],
    "text": "Speaking about the record on the podcast, Swift said it was like “catching lightning in a bottle”. She produced it in Europe during the Eras Tour, as a way to capture what was happening behind the scenes during the tour – what her “inner life” was like off-stage. It consists of some of her favourite songs she has ever recorded, she said. “I was in Europe on the Eras Tour ... I’d have three days off, I’d fly to Sweden, and go back to the tour while actually working on this. I was physically exhausted at this point in the tour, but I was so mentally stimulated and so excited to be creating,” she said. “I wanted the album to feel like how my life felt. Every single song is on this album for hundreds of reasons, and you couldn’t take one out, and it be the same album. It’s just right. That kind of focus and discipline, keeping the bar that high, is something I’ve wanted to do for a long time.”\n\nReclaiming her masters Beyond the album news, she also touched on another momentous moment in her life recently: the reclamation of her masters in May, a moment that “changed her life”. Travis Kelce and Taylor Swift appear on the New Heights podcast. Credit: YouTube “It’s always been a huge thing for me. Since I was a teenager, I’ve been actively saving up money to buy my music back,” she said, adding that she “dramatically fell to the floor” when she found out she had finally managed to take ownership of her discography. “This will affect the rest of my life, and I think about this every day. But now, instead of it being like an intrusive thought that hurts me, it’s: ‘I can’t believe this happened. How lucky am I?’”\n\nShe then shifted to the epic experience that was the Eras Tour, the highest-grossing concert tour in history during which she travelled to 51 cities across more than 600 days. The singer said she wouldn’t change a thing about the tour – one where she was able to physically and mentally prepare for more than any of her previous global tours. “I wanted it to [include] references that, I thought, were really high-concept and really high-value for fans, and for them to see things they hadn’t necessarily seen before all in one concert,” she said. Another promotional image for The Life of a Showgirl. Credit: Instagram “But I wanted to do it at the highest intensity, rapid fire – you’re seeing something new every 15 to 30 seconds. So, it feels like you’re scrolling in an algorithm, right? “When I heard reports of people saying that they got actual amnesia after the concerts, I was like: ‘Oh, I think we did it. I think we nailed it.’”\n\nAustralia and the Eras Tour One of her favourite parts of the Eras Tour, she said, was the unplanned moments and fan-led traditions. Taylor Swift performing at the Eras Tour in Melbourne. Credit: Getty For example, during the European leg, her audience collectively decided to bring in balloons, which they illuminated with their phone torches during the Willow segment, reflecting the orbs held on-stage. “Was there a group text? How did you guys even do this? It was so special. It felt like we were all part of something together in a way that couldn’t be planned. As much as I love and relish in planning, it was really fun that they would do things to delight me,” Swift said.\n\nLoading Australia also got a direct mention, with the pop juggernaut describing the country as “amazing”. Despite how fulfilling the tour was, the pop star admitted she’s now enjoying a break – time she is apparently using to bake endless loaves of sourdough bread and watching otter videos with her boyfriend. An FYI on Easter eggs Before the official announcement of the new album, fans scoured a litany of Easter eggs carefully planted by the star, including cryptic photo galleries and intentionally timed social media posts.\n\nSwift touched on the very puzzles she used to share the recent news on the podcast, joking that the “Easter egg thing is getting a little Zodiac Killer at this point”. “I’m never going to plant an Easter egg that ties back to my personal life – it’s always going to be towards music,” she said. The singer is famed for dropping cheeky hints for her fans to deduce. Credit: Instagram “I want Easter eggs to be a certain thing where if you are part of the fandom, and you want to experience music in a normal way, then you don’t even see these – you don’t even care what that thing is above that doorway, under that dimly lit, flickering light over there that’s upside-down, backwards in Braille. But if you want to look at that, you can. If you know, you know.” Despite general excitement around the album itself, Swift’s decision to share the news on the Kelce brothers’ podcast divided fans. On one hand, some Swifties applauded the podcast approach, arguing that it was the ideal way for the singer to reveal the news on her own terms, rather than those of powerful, large-scale media or entertainment organisations.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/something-good-is-coming-man-utd-primed-to-bounce-back-from-horror-season-says-fernandes-20250813-p5mmle.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Something good is coming’: Man Utd primed to bounce back from horror season, says Fernandes",
    "publish_date": "Thu, 14 Aug 2025 11:38:25 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Though Fernandes noted that no player on the eve of the season would describe his manager in anything other than glowing terms – much less him with a fellow Portuguese – he seems completely genuine in his praise. The 30-year-old says he sees the game in the same way as Amorim, credits him with improving his personal output, and is grateful he has the “big balls” needed to make the decisions that could shape the club’s future. “I can see something good coming for the team,” he said. Bruno Fernandes after Manchester United’s Europa League final defeat. Credit: Getty Images This season is a fresh start in a number of ways. Firstly, it’s the first full one for Amorim, who took over in November after a disastrous start led to Erik ten Hag’s sacking. Amorim could not arrest the slide which led to United’s 16th-placed finish, their worst since 1989-90. He did get them into the Europa League final, but they lost the chance at a shortcut into the UEFA Champions League when they fell 1-0 to Tottenham Hotspur, on a night when their limitations in attack were clear for all to see.\n\nThat’s hopefully been addressed. Amorim has used his first true opportunity to dive into the transfer market by bringing in a new frontline: two wingers with plenty of EPL experience in Mathias Cunha, from Wolverhampton Wanderers, and Bryan Mbuemo, from Brentford, either side of big Benjamin Šeško – one of Europe’s most exciting young strikers – from RB Leipzig. “Putting them three together with everything we had already from last season will give big competition to everyone, and everyone will be fighting for their position into the team,” Fernandes said. “You just have to start strong again. At Manchester United, time doesn’t exist. You have to do it now.” Bruno Fernandes And Fernandes is still around, too. He was the subject of an eye-watering offer from Al Hilal, who were reportedly prepared to pay over $200 million to get him – a huge transfer fee for a player his age – and almost triple his $500,000-per-week wages. “I know numbers matter the most in football,” he said.\n\n“Obviously it was a big number that the club could get for me. So I know how tough it was for the club. When I spoke with the president of Al Hilal, I spoke with him once and I told him, ‘I’ve never thought about leaving, I appreciate your call. Whatever you want to do or not, you can talk with the club,’ because I’ve always said if the club wanted to sell me, then yes, I had to make a decision. But if the club doesn’t, I don’t have to make a decision, because my aim is to stay here. “It’s a lot of money for me, too, but it is what it is. People make decisions in their lives. I won’t regret it because this is the place I want to be and this is the place where I want to be successful also.” Manchester United’s renovated training facility underlines the sense of a fresh start this season. Credit: Getty Images Last week, renovations of United’s training facilities were completed. When the Carrington Training Complex first opened in 2000, they were state of the art – but as the years ticked by, they became dark, dingy and outdated, and a metaphor for how their standards had slipped. Three years ago, in his infamous interview with Piers Morgan, Cristiano Ronaldo described them as frozen in time; according to reports, he wouldn’t even use the main swimming pool because it had chipped and cracked tiles he deemed a hazard to player safety. Now, thanks to a $100 million redevelopment, Carrington is best-in-class again, and the most tangible manifestation of part-owner Sir Jim Ratcliffe’s ambitions for the club. The slick new facility includes the latest technology to assist player recovery (altitude chambers, underwater treadmills and the like), plus some pretty cool lounges for the team to hang out in (including a barber shop and an F1 simulator), which all adds to the sense of a new beginning, and of a club seeking to regain its rightful place on top of the pile – although for Fernandes, it’s the little things that could make the biggest difference.\n\n“One of the things that Sir Jim spoke about was the natural light into the building,” he said. “I know it’s a small detail, a small thing that could make such a big difference for the people that work here, because they have to be here for a very long time and for them to be closed in a space where they can’t see natural light is very difficult. People that work in the office, they always talk about this, that brings more sadness and not as a good environment to work [in]. Also for our physios, for our staff, it’s going to be a much nicer space for them to be working with.” So that’s the building sorted. What about the rebuild of the team? That’s ongoing and, at the same time, overdue. It’s no longer possible for a fallen giant like United to return to the top of the Premier League without enduring a period of pain on the ascent. But how can they do that in a world of unrealistic expectations and supporter impatience, at a club that still holds global attention like no other? “Expectations at this club are always high,” Fernandes said. “It doesn’t matter if you rebuild or not. Manchester United has no time to rebuild. You just have to start strong again. That’s all. No one will be saying that you need to rebuild. At Manchester United, time doesn’t exist. You have to do it now.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/business/companies/telstra-lifts-dividend-after-profit-jumps-31-per-cent-20250813-p5mml1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Telstra shares fall after mobile miss",
    "publish_date": "Thu, 14 Aug 2025 11:31:01 +1000",
    "category": "finance",
    "authors": [
      "David Swan"
    ],
    "text": "Shares in telco giant Telstra dropped by 2 per cent on Thursday morning, with investors unimpressed by lower than expected mobile numbers.\n\nIn its full-year results on Thursday, Telstra posted bumper profits and raised its dividend after slashing costs and selling the majority of its cloud computing unit to Indian tech giant Infosys.\n\nTelstra chief executive Vicky Brady on Thursday morning. Credit: AFR\n\nThe nation’s biggest telco reported an annual net profit of $2.34 billion – up 31 per cent year-on-year – and said it had cut operating expenses by 6 per cent. Telstra has cut around 3200 jobs over the past financial year, including 500 announced last month.\n\nAlongside the earnings release, the company announced the sale of a 75 per cent in Versent Group, its cloud computing business, to Infosys in a deal worth $233 million. Telstra will retain a 25 per cent stake, and about 650 staff will move to Infosys as part of the transaction.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/afl/10-reasons-to-watch-aflw-in-its-10th-season-20250809-p5mloh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "10 reasons to watch AFLW in its 10th season",
    "publish_date": "Thu, 14 Aug 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [],
    "text": "4. Fountain of youth A decade of AFLW has built a genuine pipeline for talent. Girls who once dreamed of playing footy can now start in Auskick, progress through junior pathways and land on an AFLW list. The difference is clear – these players arrive at the elite level hardened, skilled and fearless. Watch Ash Centra at Collingwood or Havanna Harris at Gold Coast, and you’ll see ready-made footballers. Then there are the rising stars who’ve already made their mark – Matilda Scholz (Port Adelaide), last year’s mark of the year winner, and Montana Ham (Sydney), whose presence and game-winning ability grow every season. These players aren’t just the future – they’re already reshaping the present. When I was growing up, I looked to St Kilda’s Lenny Hayes as my childhood hero, but now you and your family can have a genuine female superstar to follow from any of the 18 clubs. 5. It starts at the top This season’s coaches are a fascinating mix of tactical nous and lived experience. Former AFL names such as Rhyce Shaw (Gold Coast), Toby McLean (Bulldogs), Ben Brown (Essendon), and Brendan Fevola (Richmond) bring with them the sharpness and strategy of the men’s game – Fevola even declaring Ellie McKenzie the best kick he’s seen in either competition. There’s also the influence of AFLW pioneers now moving into coaching, such as Daisy Pearce at West Coast and Lauren Arnell at Port Adelaide. And don’t forget Darren Crocker at North Melbourne, who knows a thing or two about winning, having played in a premiership side in 1996. These voices are shaping a faster, more sophisticated brand of AFLW footy.\n\n6. Fastest-growing female sport The numbers tell the story: since the AFLW began, female participation in footy has exploded by nearly 200 per cent, from 42,000 players to more than 125,000. More than 2500 new women’s and girls’ teams have sprung up around the country, and the AFL is now the largest employer of female athletes nationwide. Every girl who laces up her boots today has a clearer, straighter path to the elite level than ever before, and AFLW is the stage where those dreams can become reality. When you watch, you’re not just seeing a game – you’re seeing the result of a generational shift. Our newest draftees started their pathway when they were eight or nine years old — 10 years ago! The Vic Country team heads out to play South Australia during the under 18s national championships. Credit: AFL Photos 7. Community heartbeat AFLW still has something the men’s competition has mostly lost: the community feel that makes you feel part of the game, not just a spectator. Many games are played at local grounds, where you can stand on the boundary, hear the on-field calls, and be close enough to see the players’ facial expressions. It’s football in its purest form – close to the action, surrounded by families and fans, with a post-match kick-to-kick on the oval. For those who love the romance of suburban footy, AFLW is a time machine back to the game’s grassroots charm. Head down to Arden Street, back to the Kennel, or off to Moorabbin to take a time warp in the best possible way.\n\n8. Milestones with meaning This year, some of the league’s trailblazers are closing in on 100 games, all consecutive. In the men’s competition, 100 games is a solid achievement; in AFLW, it’s monumental. Shorter seasons mean it has taken almost a decade to reach, and these players have carried the league through its formative years – playing in the heat of summer, the chill of winter, and often in front of smaller crowds before the momentum built. Every milestone game this season will be a celebration not just of individual endurance, but of the resilience of the entire competition. Watch out for Ebony Marinoff (Adelaide) and Ally Anderson (Brisbane Lions) to be the first ones to hit it. Me and Bre Koenon (Brisbane Lions) are currently two games behind them on 91. This is the equivalent of a man playing 250 consecutive games in the AFL – a feat only reached by greats such as Jim Stynes and Jack Crisp. AFLW star Ebony Marinoff. Credit: AFL Photos 9. A welcoming, family-friendly atmosphere At AFLW games, the footy is fierce, but the atmosphere is warm. Tickets are affordable, seating is relaxed, and the stands are filled with people of all ages and backgrounds. It’s a space where kids can see their heroes up close, where parents don’t have to worry about rowdy crowds, and where first timers are embraced as quickly as long-time members. It’s the game you love, wrapped in a sense of community and belonging that’s hard to find anywhere else. There are always plenty of activities for kids to enjoy, and the surroundings are really intimate.\n\nLoading 10. Every supporter helps grow the game AFLW is still building, and every eyeball, every ticket, every shout from the boundary line matters. Growth in crowds and TV audiences directly strengthens the league’s ability to push for longer seasons, better pay and greater exposure. The current target is moving from 12 games a year to 14, and eventually to a full home-and-away fixture. The more support we give now, the sooner that vision becomes reality – for today’s players and for every young girl dreaming of one day pulling on an AFLW jumper. What’s exciting is that many of our men’s heroes now have children, often girls, and many of these will play for your club under the father-daughter rule. Imagine watching a mini Matthew Richardson kick a goal for the Tigers after a lace-out kick from one of Trent Cotchin’s daughters! Ten reasons are more than enough. Now it’s over to you to vote with your feet and by watching on TV. This season is shaping up to be the best we’ve ever seen, and we want you there with us. Come and watch us play, follow your team’s journey, and join in the fun from the first bounce to the final siren. Every cheer from the stands, every clap, every new face in the crowd helps us grow the game and inspire the next generation. It’s not the intimidating noise of 100,000 bullish people at the MCG, but it doesn’t need to be.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/culture/books/the-cult-author-who-refuses-to-play-by-the-book-world-s-rules-20250811-p5mm3w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The cult author who refuses to play by the book world’s rules",
    "publish_date": "Thu, 14 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Melanie Kembrey"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size For Rebecca F. Kuang, the easiest way to resist the internet is to carry a phone that won’t cooperate. It doesn’t glow, buzz, or beg for her attention – and she prefers it that way. It’s a statement of defiance against the glowing promise that apps would make us more connected and productive. Instead, Kuang says, they’ve shredded attention spans and left us more alone than ever. “My phone’s basically a brick. It can’t access most apps,” she says. “People can’t send me TikTok links. I can never see them. Of course, a lot of stuff is going to get caught in the net, but on the whole, it’s great because I spend so much more time reading and writing and cooking and being grounded in the world around me and very little time online.” No X, no TikTok, no doom spiral of headlines – a notable abstinence, given the starring role the internet played in her bestselling 2023 novel Yellowface, a razor-edged literary satire about a struggling white writer who swipes the manuscript and identity of her dead Chinese friend, only to face the wrath of the online mob. Rebecca Kuang photographed at the Boston Public Library. Credit: Ben Sklar “That was my internet novel. It was really me getting the internet out of my system. I’m actually pretty extreme about digital minimalism,” Kuang, who publishes as R.F. Kuang, says. “I knew I was never going to write a book like Yellowface again because that just was not a sustainable way for me to be in the world, so I felt like this freedom to do whatever I wanted with the next book. It will probably appeal to a different set of readers, and that’s exciting to me, like I’m tired of talking about Yellowface.” Kuang is in her husband Bennett Eckert-Kuang’s study in their Boston home when we speak over video – not her natural habitat. Enclosed spaces, she explains, feel stifling; she prefers to work somewhere open, where the air can move and the light can spill in. But today, the fading light cuts across her face, artfully preparing us for the shadows of her new novel.\n\nAdvertisement\n\nYellowface looks down on delegates at the publisher’s stand during the first day of the London Book Fair in 2023. Credit: In Pictures via Getty Images If you haven’t read Yellowface, you’ve almost certainly seen it – the bold, winking yellow cover staring back at you from bookshop tables and BookTok. Inside, Kuang skewers the publishing industry and the chronically online mindset with a scalpel and a smirk: taking on how technology has rewired the way we consume art, perform outrage, and weaponise accountability. It’s been optioned for a scripted television series with Karyn Kusama (The Invitation, Yellowjackets, Girlfight) attached to direct. While Yellowface was strikingly topical and opened the door to a wider readership, Kuang had already been forging her path through the searing landscapes of historical fantasy with The Poppy War trilogy (2018–2020) and Babel (2022). Drawing on mid-20th-century Chinese history and begun when she was just 19, The Poppy War was no overnight success – Kuang admits she initially felt “sick to my stomach” every time she thought about sales – but word of mouth gradually built momentum. Meanwhile, Babel, set in 1830s England, became a BookTok hit. This steady rise meant, Kuang says, the sudden attention from Yellowface never “messed me up”. Rebecca Kuang attends the 2023 TIME100 Next in 2023. Credit: Getty Images As she critiqued publishing’s pigeonholing of authors in Yellowface, Kuang herself refuses to be confined by genre or expectation. Almost as soon as she penned the novel, Kuang admits she was bored with the frenetic, internet-fuelled tone that is omnipresent in today’s literary landscape – eager instead to explore new territories, both thematically and stylistically, in her work. “I feel like I’m still very young, and I want room to grow, so to be typecast now would feel stifling and murderous to me,” she says. “I think there is this sort of resistant delight to defying categorisation because when you are pretty overtly racialised or gendered, as so many people are, you do always want to be acting out against expectation.\n\nAdvertisement\n\n“That resentment of expectation is not what drives me. It’s just something I find psychologically interesting about myself. What drives me is wanting to evolve as an artist with every project.” I think it never got to my head or messed me up because I’m really good at moving on to the next project. She’s also grown wary of publishing’s other obsession – youth. In a recent piece for Time headlined Olivia Rodrigo and the Impossible Pressure to Stay a Prodigy, Kuang, 29, reflects on the pressure of being “young” in the literary world. The scepticism that has met her, the interest in her age rather than work, and the anxiety that the apex of her career might have come and gone. “It’s really stupid, I think, that we are so obsessed with young authors in literature. Literature is one of the one things that you only get better at as you get older,” Kuang says. “I hope I’m not in my prime. I hope that my prime is decades away.” Kuang might not realise it yet, given her self-imposed social media ban, but her readers are already gearing up for her sixth novel out this month. Roll your eyes at BookTokers if you like, but they’re busily assembling reading lists heavy with Homer, Virgil, Ovid, and Dante as they prepare for the release of Katabasis – a richly layered, genre-bending dive into the underworld. (The title comes from the Greek word meaning “descent”). Rebecca Kuang’s new novel, Katabasis, plays with classic texts about the afterlife. Credit: Ben Sklar In Katabasis, Cambridge doctoral student Alice Law and her nemesis Peter Murdoch wield pentagram magic to descend into the Eight Courts of Hell, all in a desperate bid to rescue their professor’s soul – without him, their crucial recommendation letter is lost. The novel deftly plays with the classical stages of the underworld journey – the descent, the ordeal, and the return (anabasis) – while tipping its hat to Alice in Wonderland, T.S. Eliot’s The Waste Land, and even drawing from the surreal dreamscapes of Dali.\n\nAdvertisement\n\nIf you’re counting subgenres, it’s a clever mashup of dark academia and historical fantasy, with an enemies-to-lovers twist. And while this might seem underworlds apart from Yellowface, Kuang is as critical as ever, cutting through the pretension, privilege, and politics of academia. If Babel’s Oxford setting allowed an examination of the institution’s historical role as a facilitator of imperial projects, Katabasis focuses on the interpersonal – the inflated egos, the skewed priorities and values, and the fraught, often toxic, relationships between students and teachers. “I think of them as a duology that deals with why I love the academy so much and can’t step away but why I am increasingly uncomfortable with it,” Kuang says, perfectly placed to say so, having roamed some of the world’s most elite academic halls. From her undergraduate years at Georgetown University to graduate degrees at Cambridge and Oxford, she’s now teaching and finishing a PhD in sinology at Yale. Her research spans Chinese-language literature and Asian American writing, focusing on Chinese American and Chinese diaspora authors and their explorations of travel, language, geography, and storytelling. Kuang – who was born in Guangzhou, China, moved with her parents to Dallas, Texas, when she was four – grew up in a household that valued literature highly and was always drawn to fantasy. Rebecca Kuang says she enjoys defying expectations when it comes to genres and styles. Credit: Ben Sklar She started her PhD the same year as her husband, who’s pursuing philosophy at MIT, started his. They recently celebrated their first anniversary. While some couples spend their evenings arguing over whether a potato is too far gone to cook for dinner, theirs seems to involve lively debates on logic paradoxes and the quirks of rational decision-making, conversations about which inspired Katabasis. “I just fell in love with the idea of logic paradoxes, especially paradoxes of rational decision-making, which feels very pertinent to how we live our lives,” Kuang says. “There are so many paradoxes where you make a series of decisions that seem like you’re better off at every stage, and then suddenly you find yourself in a far worse position than you anticipated, with no way to claw out of it. And that seemed like a lovely way to describe being in a PhD program.” Rebecca Kuang has been writing novels since she was 19.\n\nAdvertisement\n\nKuang’s academic and creative worlds have never been separate – they flow into one another. Her novels are set on campuses or in educational institutions, and weave in her scholarly pursuits. Her advisors often remind her to rein in her signature point of view, reminding her she’s writing an essay, not fiction. “I find it very difficult to keep the creative voice from seeping into my academic work. I’m always having conversations with my advisor about how my academic writing needs to be a little less opinionated and have a little less of that spunk and flair that I like to bring to my fiction prose.” Having reached new heights after Yellowface, Kuang could now write full-time. When asked why she hasn’t stepped away from academia, the answer is simple: “I like it.” I feel like I’m still very young, and I want room to grow, so to be typecast now would feel stifling and murderous to me. “I wish I had a more sophisticated answer than that, but I think I’m in a lucky position where I have multiple career options. I could be a full-time author, I could be a full-time academic, and I just enjoy both too much to give either of them up. I always tell myself, the moment it stops being engaging, I’ll step away,” Kuang says. “For all that is frustrating and broken about academia, I’m still committed to this core promise of inquiry and curiosity and sharing it with others, and I do still regularly feel that when I step into a classroom.” She didn’t feel the weight of expectation after Yellowface – no sudden compulsion to chase its sharp success or bottle its biting style. Instead, she slipped quietly into her next chapter, boarding a flight to Taipei to plunge straight into research for a new book.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/national/nsw/how-an-underground-marvel-will-reshape-the-way-sydney-moves-20250811-p5mm4n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How an underground marvel will reshape the way Sydney moves",
    "publish_date": "Thu, 14 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Matt O'Sullivan"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Entering Sydney’s largest underground rail cavern, you are struck by a mass of blue-coloured waterproof lining that covers its walls and ceiling. At 28 metres wide and 180 metres long, the size of the cavern built beneath the northern end of central Sydney for the $25.3 billion Metro West line is breathtaking. Yet what is not obvious is how close it comes to buildings, existing rail tunnels and critical power cables for the CBD. Illustrating the challenge for contractors, the top of the cavern sits just six metres below the foundations of a 169-year-old heritage hotel built from sandstone. Once opened in 2032, the Hunter Street metro station will become the hub for train travel in and out of the northern part of the CBD. It will connect existing heavy rail and metro stations at Martin Place to Wynyard, allowing people to switch between multiple lines without setting foot above ground. The size of the cavern for the Metro West station beneath Hunter Street is breathtaking. Credit: Steven Siewert It will be bigger than both Victoria Cross station in North Sydney and the Martin Place metro station, which is the busiest on the M1 line between the city’s north-west and Sydenham. The reason for its size is simple. While it is forecast to handle 10,000 passengers an hour when it opens in 2032, the only station in the CBD for Metro West is being built for a staggering 40,000 people an hour. Sydney Metro chief executive Peter Regan said the station was being built to be bigger than others to cater for the “very large volume of people” entering and exiting at the same time, and major growth over coming decades.\n\nAdvertisement\n\n“The complexity of what you’re seeing down in that cavern is like nothing we’ve done before in terms of the scale of what is being built under the city. It will become the biggest rail cavern in Australia,” he said. “Hunter Street will be a very busy station because it’s the end of the line, and it’s the only station in the CBD [for Metro West].” In comparison, the M1 line has four stations in the central city – Barangaroo, Martin Place, Gadigal and Central – which means passenger loads during the peak periods are spread, instead of concentrated on one. Initially, six-carriage driverless trains will run on the 24-kilometre line between Parramatta and the CBD every four minutes in each direction. However, the 180-metre-long stations on the Metro West line allow for trains as long as eight carriages to eventually be operated. “It’s designed very much to grow as a station,” Regan said. A tunnel that will connect the existing Martin Place metro station to the new Hunter Street station for Metro West. Credit: Steven Siewert Hunter and Pyrmont stations construction manager Dave Maytom said one of the challenges was the wide span of the cavern and the fact that it was, on average, only about 10 metres beneath the surface. “That is very shallow. To create a large hole, you need a body of rock to support itself above that cavern,” he said, explaining that to provide support a type of concrete known as shotcrete up to half a metre thick was applied. “Working in that city environment is hugely challenging.” About 28,000 tonnes of concrete have been poured to form the cavern floor, leaving more than a third of its construction completed. Excavation of the cavern and most of the connecting tunnels was finished in May.\n\nAdvertisement\n\nTwo giant boring machines are due to break through into the cavern by the end of the year, which will complete twin tunnels between the Bays precinct at Rozelle and the CBD. It will mark a shift for the mega project from digging tunnels and giant holes to building and fitting out stations, as well as the laying of rail tracks and installation of vital equipment. At the western end of the cavern beneath Hunter Street, three giant concrete pillars serve as structural supports for the roof, and will be where three tunnels each about eight metres wide will enter, one of which will be for passengers. Saint Barbara, who is patron saint of tunnellers and engineers, has watched over excavation of the subterranean cathedral-like cavern. Credit: Steven Siewert At the eastern end, a giant shaft is being dug from street level into the cavern. It will serve as the other entrance to the station. Passengers will make their way down via banks of escalators and lifts to a concourse level, before taking another set of escalators to the platforms. The forecast volume of passengers is such that Sydney Metro, a government agency, is considering widening a pedestrian link under George Street between Wynyard station and the western end of Hunter Street station. A direct pedestrian link will be built between the Hunter Street station concourse and the platform level at the existing Martin Place metro station. Importantly, passengers will not need to pass through ticket gates to walk between the two. Transport Minister John Graham said the station would be at the middle of an underground spiderweb of connections in the CBD. “It will open up direct connectivity to every metro line and every train line without ever having to go above ground to cross a street,” he said. “[It] is an engineering feat of which the numbers tell the story of its scale.”\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/national/inside-the-botox-black-market-leaked-messages-reveal-illegal-trading-network-20250812-p5mm9e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside the Botox black market: Leaked messages reveal ‘illegal’ trading network",
    "publish_date": "Thu, 14 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Clay Lucas",
      "Henrietta Cook"
    ],
    "text": "An investigation by this masthead has unearthed hundreds of WhatsApp messages showing nurses subscribed to Fresh Clinics asking their peers to buy, borrow, or swap prescription-only anti-wrinkle medications, including Botox, Dysport and Xeomin.\n\nIt was not an isolated exchange. It’s also illegal.\n\nThe post was shared to a WhatsApp group for nurses and clinics using the services of injectables company Fresh Clinics, and it triggered swift offers of help. One nurse in South Melbourne replied nine minutes later, offering to supply the drug that day.\n\n“Very unethical, I know,” she wrote. “But I am open over the Christmas/New Year period and have been left with nothing as the past week we have been inundated. I thought I had enough stock. Please don’t judge me.”\n\nThe owner of a Geelong skin clinic was frantically trying to buy anti-wrinkle drugs from her peers, an act prohibited under Australian medication laws.\n\nAt 7.48am on Christmas Day in 2020, a desperate plea pinged in a WhatsApp group for nurses subscribing to Australia’s largest cosmetic injectables telehealth company.\n\nAdd articles to your saved list and come back to them any time.\n\n“Does anyone have two vials of Botox I could buy off them? I have 3 days left in clinic before going away for 3 months and don’t want to leave anything sitting in my fridge,” said another in an April 2023 exchange.\n\nReplies arrived within minutes – offers to help out from Melbourne suburbs Frankston, Williams Landing and Blackburn.\n\n“Hey guys! Anyone have a spare vial (Dysport or Botox) I can grab asap?” a Melbourne-based nurse wrote in December 2023. “I’m willing to travel anywhere in Melbourne. I’ve already ordered but it didn’t come on time for my patients tomorrow! Would appreciate it heaps.”\n\nRequests were often met with near-instant offers, highlighting how quickly supply could be sourced through the informal networks.\n\nThe WhatsApp messages used varied terminology — buy, borrow, sell, grab – but the effect was the same: restricted drugs changing hands outside formal supply channels, arranged via encrypted group chats.\n\nUnder Australian law these Schedule 4 drugs can only be supplied by licensed wholesalers to authorised prescribers or pharmacists, to safeguard patient safety and control the movement of drugs.\n\nFresh Clinics does not directly employ the nurses working in the injectables clinics. The clinics are independent businesses which pay a subscription to Fresh Clinics to access doctors and medicines.\n\nA NSW Health spokesman likewise said the medications could only be obtained by an authorised practitioner and could not be resupplied.\n\nAsked to respond to the messages, a Victorian Health Department spokeswoman said: “The trading of Schedule 4 medicines between clinics is not lawful.”\n\nAs telehealth fuels the expansion of Australia’s booming $4 billion injectables industry, regulators are scrambling to roll out changes to protect patients.\n\nOther nurses offered to sell stock they no longer needed: “I made an order in error – would anyone like to buy some Botox?” a nurse wrote in June 2023. “I can grab some off you,” another replied. “Yes pls!” added a third quickly.\n\nIn one November 2023 exchange, a nurse asked: “Hi team, does anyone stock [cosmetic filler] Sculptra? Can I buy one off you please?” The co-owner of Fresh Clinics, John Holbrook, responds: “You can’t on-sell it. But we can assist to move it across clinics.”\n\nUnder the Fresh Clinics model, nurses, operating as independent businesses, consult with clients, then request a remote video review by a Fresh Clinics doctor, who issues a script. The nurse administers the treatment.\n\n“These communications illustrate an unlawful black market for prescription-only cosmetic medicines,” he said. “The system loses integrity, meaning that any harmed patients will struggle to obtain a remedy.”\n\nDr Christopher Rudge, a lecturer in health practitioner law at the University of Sydney, reviewed the WhatsApp messages and said they illustrated unlawful trading and created an untraceable supply chain.\n\n“Fresh Clinics ensures that all stock transfers between clinics comply with the latest federal and state regulations,” a spokeswoman said.\n\nThere is no suggestion Fresh Clinics has broken the law, and in a statement it said it had done nothing wrong.\n\nFresh Clinics staff were aware of this. In March 2022 the company’s clinical director replied to a nurse post: “These can’t be onsold … onselling of a schedule medication is illegal.”\n\nFederal law prohibits the unauthorised sale or transfer of Schedule 4 medicines. Prescription-only drugs must be distributed by licensed wholesalers to authorised practitioners, not traded peer to peer.\n\nIn March this year, this masthead revealed that some Fresh Clinics doctor consultations lasted as little as 52 seconds before a script was approved. Following that investigation, new rules released in June by Australia’s health practitioner watchdog included tighter rules for first-time patients and restrictions on issuing high-speed telehealth scripts.\n\nThe model was designed for flexibility. But many doctors who practise in-person medicine argue it removes critical points of clinical oversight.\n\nFresh charges a per patient fee – usually $25 – and also leaves nurses to handle ordering, storage and administration of the medication.\n\nCo-founder John Delaney was more direct when fielding questions via a different WhatsApp forum in April this year: “Wholesalers can only sell to a doctor, nurse practitioner or pharmacist.”\n\nYet elsewhere, other staff advised workarounds. In 2021, co-founder John Holbrook wrote to one nurse: “Hi [name removed], it’s not legal for you guys to onsell medication. But [Fresh Clinics staffer] can help out seeing if there’s somewhere that Dysport can be borrowed and replaced from.”\n\nThat “borrow and replace” system was sometimes formalised, other times not. In one message, the company’s head of clinical training advised a nurse: “Let us know who you end up getting product from and we will invoice you and send out replacement to the nurse who loans the product.”\n\nThe nurse responded: “Thanks so much, for sure ‘sell’ was probably the wrong word to use as I know you guys reimbursed the lender with product.”\n\nAirtasker driver, Kmart Esky\n\nIt was May 2021, and a senior Fresh Clinics manager was on the hunt for a new delivery driver. She proposed the company “load a new job every day onto Airtasker with the anticipated jobs for the day”.\n\nThen, she posted a job on Airtasker for a driver to deliver for an “aesthetic supply company” at $840 per week. “Own vehicle necessary,” the ad said.\n\nThe job went to Shah, a part-time driver who also delivered auto spare parts. He told this masthead he didn’t know what was in the boxes he would drop off to clinics, just that they were packed professionally.\n\n“Some of them were very urgent, some weren’t,” said Shah, who declined to give his surname. “I just put extra ice inside the Esky. So I had to get the ice … and I just put it in my car.”\n\nA staff message to Shah from that time reads: “Have you bought the Esky?” Shah replied: “Buying it now in Kmart Broadway.”\n\nApproached about this and other issues raised in WhatsApp messages, the Therapeutic Goods Administration declined to comment, saying responsibility rested with states and the Australian Health Practitioner Regulation Agency. That agency, in turn, referred queries to state health authorities.\n\nCosmetic physician Ronald Feiner, the medical dean of the Australasian College of Cosmetic Surgery and Medicine, said transporting botulinum toxin, commonly known by the brand name Botox, in an Esky put patient safety at risk.\n\nHe said the substance must be stored at stable, cold temperatures – usually between 2 to 8 degrees – in order to be effective. Improper handling could compromise product quality and increase the risk of infection and tissue damage, Feiner said.\n\n“It is way below standard and unacceptable,” he said of the Esky transportation. “I wouldn’t accept products transported in that manner and I wouldn’t inject it into my patients. It is completely substandard.”\n\nFeiner is also a co-ordinator at the International Master Course on Ageing Science, which hosts the world’s leading cosmetic dermatology and plastic surgery meeting and reviews cosmetic complications lodged by doctors from around the world.\n\nHe said the group reviewed a complication linked to botulinum toxin around once a week, and always questioned whether the substance was stored and transported correctly.\n\n“Improper storage may lead to product degradation, which can cause infections and tissue damage,” he said. “This damage can lead to depressions in the skin like little finger compressions.”\n\nThis GIF of US TV host Stephen Colbert was posted in a chat between Fresh Clinics workers. Credit: Marija Ercegovac\n\nIn addition, he said botulinum toxin stored at incorrect temperatures might be ineffective or wear off more quickly.\n\nOther messages seen by this masthead showed Fresh Clinics staff sometimes also adopted a tone that minimised the seriousness of their work.\n\nIn a 2021 thread, the company’s head of training posted a meme of American TV host Stephen Colbert waving oversized syringes, alongside a text discussing Fresh’s $25 telehealth consults now possible via the company’s app. Her caption: “And we don’t take any liability LOL.”\n\nIn another exchange in one of the WhatsApp groups, when a nurse asked if unmixed Botox left out of the fridge could still be used, co-founder Holbrook responded: “It’s good for use on yourself/family at a minimum.”\n\nFresh Clinics goes political\n\nAs scrutiny of the injectables industry has intensified in recent years, Fresh Clinics has become more politically active. In May federal lobbying firm Barton Deakin registered as its lobbyist, followed in June by Hawker Britton. In July, PR agency Sling & Stone registered as its third Canberra lobbyist.\n\nResearcher Maddison Johnstone, from advocacy group Operation Redress, said the industry had undercut its own arguments about professionalism.\n\n“It seems the industry has dabbled in the very thing it purports to be against when it suits their commercial interests. Patients deserve better – they pay through the nose and trust licensed clinics are prioritising their safety.”\n\nResearcher Maddison Johnstone. Credit: Paul Harris\n\nIn response to detailed questions from this masthead, a Fresh Clinics spokeswoman said the company’s “well-connected network of nurses and doctors” included “a private WhatsApp community where we share industry insights, tips, trends and regulatory updates and requirements”.\n\nShe said nurses co-ordinating stock transfers with doctor oversight “is consistent with long-standing medical practices, with some stock transfers co-ordinated via private messaging platforms. Fresh Clinics ensures that all stock transfers between clinics comply with the latest federal and state regulations.”\n\nShe said while some of the transfers appeared to be selling, swapping and trading, they were in fact not. “While some members may use varying degrees of terminology, Fresh Clinics monitors this channel and corrects any misused language where possible.”\n\nA NSW Health spokesman said that under the state’s Poisons and Therapeutic Goods Act, cosmetic medicines like botulinum toxin can only be bought by an authorised practitioner, such as a doctor or nurse practitioner.\n\nLoading\n\nHe stressed that these drugs “cannot be resupplied to another clinic or authorised practitioner”.\n\nThe NSW regulator warned that anyone suspected of breaking these laws would be investigated.\n\nAnd, just as in Victoria, which said trading Schedule 4 medicines between clinics was not lawful, a Queensland Health Department spokeswoman said: “‘swapping’ or ‘borrowing’ Schedule 4 medicines amounts to ‘buy’ and ‘supply’, which is not permitted in Queensland unless authorised”.\n\nDr Christopher Rudge, who also reviewed the messages, said the behaviour constituted professional misconduct that could lead to a tribunal revoking a practitioner’s registration.\n\nA system built for speed – not scrutiny\n\nThe hundreds of WhatsApp screenshots seen by this masthead show clinic owners and nurses often operating with a sense of urgency to maintain supply.\n\nLoading\n\nAnd while senior staff at Fresh Clinics can be seen intervening on some exchanges to remind nurses not to on-sell products, the messages are otherwise devoid of references to bodies like the TGA and state health laws, or consulting pharmacists.\n\nThe Christmas Day message at the start of this story from the Geelong clinic owner, who this masthead attempted unsuccessfully to contact, still stands out: “Very unethical, I know … Please don’t judge me.”\n\nStart the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Thu, 14 Aug 2025 11:25:20 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/agents-driving-r360-rebel-league-20250814-p5mmx5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Agents driving R360 rebel league",
    "publish_date": "Thu, 14 Aug 2025 11:17:07 +1000",
    "category": "finance",
    "authors": [],
    "text": "Agents driving R360 rebel league\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 37
  },
  {
    "url": "https://www.theage.com.au/national/queensland/masterclass-on-how-not-to-run-an-incident-response-runcorn-train-crash-delays-passengers-20250814-p5mmvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Masterclass on how not to run an incident response’: Runcorn train crash delays passengers",
    "publish_date": "Thu, 14 Aug 2025 11:16:23 +1000",
    "category": "finance",
    "authors": [
      "Courtney Kruk",
      "Catherine Strohfeldt"
    ],
    "text": "Rail service on the Gold Coast and Beenleigh lines was brought to a halt after a collision between a truck and a train bound for Brisbane carrying about 300 passengers on Thursday morning.\n\nEmergency services were called about 6.55am to the Bonemill Road level crossing, near Runcorn station, after reports a Beenleigh line train clipped a truck.\n\nThe scene at Runcorn after the train and truck crash on Thursday morning. Credit: Nine\n\nParamedics assessed the truck driver and passengers onboard the train, with no injuries reported.\n\nOne passenger described hearing a “loud bang” while waiting for their train at Fruitgrove Station, about 750 metres from the collision site.",
    "source": "TheAge",
    "cluster_id": 38
  },
  {
    "url": "https://au.news.yahoo.com/jobs-figures-help-rba-understand-173000340.html",
    "title": "Unemployment falls, 25,000 jobs added in July",
    "publish_date": "2025-08-14T01:41:22Z",
    "category": "finance",
    "authors": [
      "Jacob Shteyman"
    ],
    "text": "Australia's jobless rate has fallen to 4.2 per cent, but the Reserve Bank is unlikely to be overly concerned that the jobs market is tightening further.\n\nThe 0.1 per cent drop in July, as reported by the Australian Bureau of Statistics on Thursday, was in line with market expectations.\n\nAbout 25,000 jobs were added to the economy, slightly higher than expected, while the number of unemployed people decreased by 10,000.\n\nGrowth in unemployment was driven by full-time jobs, which increased by 60,000, while part-time employment fell 36,000.\n\nThe underlying trend in employment growth has been faster than the rise in population for most of the past year, but in recent months the two were growing at roughly the same rate, said ABS head of labour statistics Sean Crick.\n\nADVERTISEMENT\n\nThe unemployment rate aligns with the Reserve Bank's forecast for the June quarter, which was released on Tuesday.\n\nAfter a surprise 0.2 per cent jump in unemployment in June, economists noted the rise was partly due to a sub-sample with a higher-than-average unemployment rate being rotated into the survey.\n\nSo while the modest reversal in Thursday's print is a further sign of the resilience of Australia's labour market, it doesn't necessarily indicate conditions are tightening again.\n\nIndeed, RBA governor Michele Bullock noted various indicators suggest conditions in the labour market had eased in recent months.\n\nGovernor Michele Bullock explains the Monetary Policy Board's decision to lower the cash rate to 3.60 per cent\n\n\n\nYou can read the full statement here: https://t.co/Rh1csz80wY pic.twitter.com/vkimPiSkE6 — Reserve Bank of Australia (@RBAInfo) August 12, 2025\n\n\"There's some sense in which the labour market is easing. There are some indicators that we think suggest that things are still a little bit on the tight side,\" she told reporters after the central bank cut interest rates by 25 basis points on Tuesday.\n\nADVERTISEMENT\n\n\"If we can maintain where we are I don't think that's a bad thing.\"\n\nThe participation rate remained at a relatively high 67 per cent.\n\nFemale full-time workers grew by 40,000, double the amount of new male full-time workers, with the female participation rate reaching a record high.\n\nTreasurer Jim Chalmers said Australia's economy was making encouraging progress, with inflation down, interest rates falling and the labour market in good health.\n\n\"Under the Albanese Labor government, we have seen the lowest average unemployment rate of any government, in the last 50 years,\" Dr Chalmers said ahead of the ABS release.",
    "source": "Yahoo",
    "cluster_id": 10
  }
]