[
    {
        "url": "https://www.9news.com.au/world/pope-francis-death-faithfuls-pay-final-respects-to-pope-francis-as-public-viewing-begins/eceeb809-990f-43ac-935b-fb7b9b913526",
        "title": "Faithfuls pay final respects to Pope Francis as public viewing begins",
        "publish_date": "Wed, 23 Apr 2025 20:55:24 +0000",
        "category": "entertainment",
        "authors": [
            "Apr"
        ],
        "text": "Thousands of people have filed through St Peter's Basilica to pay their final respects to Pope Francis at the start of three days of public viewing ahead of his funeral.\n\nThrongs of the faithful made their way to the 16th century basilica's main altar where Francis' open wooden casket was perched, as Swiss Guards stood at attention.\n\nOver the coming days, tens of thousands of people are expected to pass through, and the Vatican said it could extend the viewer hours even longer due to high turnout.\n\nREAD MORE: How the Pope spent his final hours and his last touching words to nurse\n\nThrongs of the faithful made their way to the 16th century basilica's main altar where Francis' open wooden casket was perched. (AP)\n\nIn the first eight-and-a-half hours, 19,430 people paid their respects to the pope.\n\nFrancis was laid out in red robes, clasping a rosary and wearing a bishop's miter, the traditional pointed headdress.\n\nWho are the contenders to be the next pope? View Gallery\n\nMourners waited hours to reach the casket, which was behind a cordon. Some held their mobile phones aloft as they neared to snap photos in what has become a modern ritual.\n\n\"It gave me chills,\" said Ivenes Bianco, as she left.\n\nShe was in Rome from the southern city of Brindisi for medical care, and came to pay her respects.\n\n\"He was important to me because he encouraged co-existence. He brought many people together.''\n\nREAD MORE: At least 26 dead after gunmen open fire on tourists in disputed Himalayan region\n\nThe body of Pope Francis is carried through St. Peter's Square to St. Peter's Basilica at the Vatican. (AP)\n\nFrancis' casket wasn't put on an elevated bier — as was the case with past popes — but placed on a ramp, facing the pews.\n\nIt was in keeping with his wishes for the rituals surrounding a papal funeral to be simplified to reflect his belief that the pope's role is that of simple pastor, not world leader.\n\nCardinals, meanwhile, met in private to finalise preparations for Saturday's funeral and plan the conclave to elect Francis' successor.\n\nFrancis died on Monday at age 88, capping a 12-year pontificate characterised by his concern for the poor and message of inclusion, but also some criticism from conservatives who sometimes felt alienated by his progressive bent.\n\nFrancis first lay in state in the hotel where he lived, in a private viewing for Vatican residents and the papal household.\n\nImages released by the Vatican on Tuesday showed the pope in an open casket, his hands folded over a rosary.\n\nFrancis was laid out in red robes, clasping a rosary and wearing a bishop's miter, the traditional pointed headdress. (AP)\n\nA nun cries as the body of Pope Francis is carried into St. Peter's Basilica at the Vatican. (AP)\n\nWednesday opened with the bells of St Peter's tolling as pallbearers carried Francis' body into the basilica, in a procession through the piazza where he had delivered his final goodbye.\n\nFrancis had made a surprise \"popemobile\" tour through the faithful on Easter Sunday, after his nurse assured him he could despite his frail health from a bout of pneumonia and long hospitalization.\n\nCardinal Kevin Farrell, who is running the Vatican until a new pope is elected, led the procession to the altar, with clouds of incense and the choir chanting the Litany of Saints hymn.\n\nIn pairs, cardinals approached the casket, bowed and made a sign of the cross, followed by bishops, ushers, priests and nuns.\n\nREAD MORE: Eight men sought by police over attack outside Melbourne club\n\nCardinal Kevin Farrell, who is running the Vatican until a new pope is elected, led the procession to the altar. (AP)\n\nThen the doors were opened to the public. There was the squeak of sneakers, the rustling of kneeling nuns, the murmur of quiet prayers. A cough, a child's cry.\n\n\"We knew there were many people, so we approached this with calmness,\" said Rosa Morghen from Naples, adding: \"It's the feeling one experiences when a family member passes away, as he is a father, a grandfather who has gone.\"\n\nThe public viewing ends Friday at 7 pm (3am AEST), after which Francis' casket will be closed and sealed.\n\nThe funeral has been set for Saturday at 10 am (6pm AEST) in St Peter's Square.\n\nIt will be attended by world leaders, including US President Donald Trump and Ukrainian President Volodmyr Zelenskyy.\n\nAfter the funeral, the conclave\n\nFrancis' death and funeral will usher in a carefully orchestrated period of transition in the 1.4 billion-strong Catholic Church, with cardinals gathering over the coming days before entering a conclave, the secretive ritual voting in the Sistine Chapel to elect a new pope.\n\nThe public viewing ends Friday at 7 pm, after which Francis' casket will be closed and sealed. (AP)\n\nThere are 133 cardinals who are under 80 years old and eligible to vote, after two bowed out for health reasons, and the new pontiff will likely come from within their ranks. The conclave is not expected to begin before May 5.\n\nSouth Korean Cardinal Lazarus You Heung-sik, who heads the Vatican's office for priests, predicted a short conclave but acknowledged the transition is full of uncertainties.\n\n\"We'll see what the Holy Spirit says,\" he said on Wednesday. Asked if the next pope could come from Asia, where the Catholic Church is growing, he insisted: \"For the Lord, there's no East or West.\"\n\nPapua New Guinea's first and only cardinal, John Ribat, prepared on Wednesday to leave for Rome to participate in the vote, pleased to represent the South Pacific island nation of 12 million people and more than 800 languages in a College of Cardinals that Francis greatly diversified.\n\n\"To have a representative from here to be in the conclave, it is a big thing,\" Ribart told the Australian Broadcasting Corp.\n\nItalian police have tightened security for the events, carrying out foot and horse patrols around the Vatican. (AP)\n\nHe said he hoped the next pope would be someone who could lead the church in \"a way that is truthful and binds everyone together.\"\n\nItalian police have tightened security for the events, carrying out foot and horse patrols around the Vatican, where pilgrims continued to arrive for the Holy Year celebrations that Francis opened in December.\n\n\"The death of a pope is not a small thing, because we've lost our leader,'' said Julio Henrique from Brazil.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/ute-brand-taken-to-court-for-alleged-misleading-advertising/ee880c84-7ea5-4ed7-b296-8bdb5019ff39",
        "title": "ACCC alleges ute brand's claims of 'durable and tough' cars were misleading",
        "publish_date": "Wed, 23 Apr 2025 23:48:08 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Australia's consumer watchdog has launched legal action against a major Chinese car manufacturer, accusing the brand of misleading advertising about the durability of its vehicles.\n\nThe Australian Competition and Consumer Commission (ACCC) alleges LDV Automotive Australia, a brand that makes utes and vans, claimed that several of their models were \"durable and tough\" and that they were suitable for use in off-road terrain and harsh conditions.\n\nInstead, the ACCC alleges the brands' T60 and G10 models \" had a propensity to rust or corrode within five years of being manufactured\".\n\nThe ACCC alleges that LDV Automotive Australia, a brand that makes utes and vans, claimed that several of their models were \"durable and tough\", and that they were suitable for use in off-road terrain and harsh conditions. (Supplied/ACCC)\n\nIn a statement to 9news.com.au, LDV Australia said the company would be \"defending the ACCC's allegations in court\".﻿\n\nAdvertisements from the company that drew the ACCC's attention included images of LDV T60 utes charging through mud, gravel and flowing creeks.\n\nThe ACCC alleges LDV's claim that the ute \"turns the toughest tracks into a walk in the park\" was misleading.\n\n\"Who needs roads when you're driving a T60?\" was another tag the ACCC alleged was misleading.\n\n\"Therefore, the advertised LDV vehicles, including those in which rust or corrosion occurred, were not durable and tough,\" the ACCC said.\n\nThe watchdog said between 2018 and 2024, the company received more than 5000 complaints from customers about the rust.\n\nAdvertisements from the company that drew the ACCC's attention included images of LDV T60 utes charging through mud, gravel and flowing creeks. (Supplied/ACCC)\n\n\"We allege that despite being aware of the propensity for the vehicles to rust, LDV continued to make representations for a number of years that the T60 and G10 vehicles were durable and suitable for use in a variety of terrains,\" ACCC Chair Gina Cass-Gottlieb said.\n\n\"As a result, we allege that LDV's conduct is likely to have caused harm to affected consumers, including because the propensity for rust or corrosion lowered the value of their vehicles, and because consumers lost the opportunity to make an informed decision that may have involved purchasing an alternative vehicle that did not carry the same risks.\"\n\nThe ACCC will seek penalties and \"consumer redress,\" among other orders when the case goes before the Federal Court.\n\nLDV Australia general manager Dinesh Chinnappa said the company acknowledged﻿ yesterday's announcement of the legal proceedings.\n\n\"﻿For 18 months LDV Australia has been engaged in good faith discussions with the commission in an attempt to resolve its concerns, and to provide remedies to consumers,\" he said.\n\n\"It is disappointing this process has ended in these legal proceedings.\"\n\n\"LDV Australia takes its obligations under Australian Consumer Law seriously, and we look forward to defending the ACCC's allegations in court.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/transfer-of-pope-francis-coffin-to-st-peters-basilica-begins/8d0f0074-817b-48e0-8973-32b25d968529",
        "title": "St Peter's Basilica opens for public to pay respects to Pope Francis",
        "publish_date": "Wed, 23 Apr 2025 09:55:48 +0000",
        "category": "lifestyle",
        "authors": [
            "Apr"
        ],
        "text": "The Vatican has opened St Peter's Basilica to the general public to pay their final respects to Pope Francis, with thousands of people filling the central aisle and Swiss Guards standing at attention.\n\nThe bells of St Peter's tolled earlier today as his body was transferred from the Vatican hotel where he lived into the basilica, escorted by a procession of solemn cardinals and Swiss Guards through the same piazza where the pontiff had greeted the faithful from his popemobile just days before in what became his final good-bye.\n\nREAD MORE: Pope Francis was a source of controversy and spiritual guidance in his Argentine homeland ﻿\n\nCardinal Camerlengo Kevin Joseph Farrell, centre right, spreads incense around the body of Pope Francis inside St Peter's Basilica at the Vatican, Wednesday, April 23, 2025, where he will lie in state for three days. (AP Photo/Alessandra Tarantino)\n\nPallbearers carried the simple wooden coffin on their shoulders through the Vatican's archway gates, out into St Peter's Square and into the basilica, the cardinals in their scarlet cassocks, bishops in their purple robes and the Swiss Guards in their golden and blue uniforms processing slowly behind.\n\nCardinal Kevin Farrell, who is running the Vatican temporarily until a new pope is elected, led the procession, with clouds of incense preceding him as the church choir began chanting the Litany of Saints hymn. In pairs, the cardinals approached the casket, bowed and made a sign of the cross, followed by small groups of bishops, ushers, priests and nuns.\n\nHeads of state are expected for Francis' funeral on Saturday, but the three days of public viewing in the basilica will allow ordinary Catholics to grieve the 88-year-old pope, who died on Monday after suffering a stroke.\n\nThe basilica was being kept open until midnight to accommodate the crowds, a mourning period that will end on Friday at 7pm (3am Saturday AEST), when Francis' casket is closed and sealed.\n\nMourners in the piazza watched as Francis' casket passed them by, along the same path the pope had travelled just days before, on Easter Sunday, in what became his final popemobile tour through the faithful. It was a surprise salute, which Francis decided at the last minute after being assured by his nurse he could do it despite his continued frail health from pneumonia.\n\nPontifical Swiss guards stand in St Peter's Square before the arrival of the body of Pope Francis. (AP)\n\nSimplified rituals reflect Francis' wishes\n\nFrancis' death and funeral inaugurates a carefully orchestrated period of transition in the 1.4-billion strong Catholic Church, with cardinals gathering over the coming week before entering into a conclave, the secretive ritual voting in the Sistine Chapel to elect a new pope. There are 135 cardinals under age 80 and eligible to vote in the conclave, and the new pontiff will likely come from within their ranks. The conclave is not expected to begin before May 5.\n\nFrancis first lay in state in the Domus Santa Marta hotel in a private viewing for Vatican residents and the papal household. Images released by the Vatican on Tuesday showed Francis lying in an open casket, wearing the traditional pointed headdress of bishops and red robes, his hands folded over a rosary. The Vatican's No.2, Cardinal Pietro Parolin, was pictured praying by Francis.\n\nOnce inside the basilica, Francis' casket wasn't put on an elevated bier — as was the case with past popes — but was just placed on an inclined ramp the main altar of the 16th-century basilica, facing the pews, with four Swiss Guards standing at attention by its side. It was in keeping with Francis' own wishes for all the rituals surrounding a papal funeral to be simplified and reflect the pope's role as a simple pastor, not a world leader.\n\n\"Look kindly, Lord, on the life and works of your servant, our Pope Francis,\" Farrell said from the altar.\n\nThe life of Pope Francis View Gallery\n\n\"Welcome him into the dwelling of perpetual light and peace and grant that your faithful people may follow fervently in his footsteps, bearing witness to the Gospel of Jesus.\"\n\nItalian police have tightened security for the viewing and the funeral, carrying out foot and horse patrols around the Vatican, where pilgrims continued to arrive for the Holy Year celebrations that Francis opened in December. The faithful who walk through St Peter's Holy Door are granted indulgences, a way to help atone for sins.\n\n\"For me, Pope Francis represents a great pastor, as well as a great friend to all of us,'' said Micale Sales, visiting St Peter's Basilica from Brazil.\n\n\"I think he spread a positive message around the world, saying there shouldn't be any violence, there should be peace around the world,'' said Amit Kukreja, from Australia.\n\nPeople gather in St Peter's Square as they await the arrival of the body of Pope Francis. (AP)\n\nPlanning for the conclave is now under way\n\nThe funeral has been set for Saturday at 10am (6pm AEST) in St Peter's Square, and will be attended by leaders including US President Donald Trump and Ukrainian President Volodmyr Zelenskyy.\n\nCardinals are continuing their meetings this week to plan the conclave to elect Francis' successor, make other decisions about running the Catholic Church as world leaders and the ordinary faithful grieve the pontiff's death.\n\nHistory's first Latin American pontiff charmed the world with his humble style and concern for the poor but alienated many conservatives with critiques of capitalism and climate change.\n\nHe last appeared in public on Sunday with an Easter blessing and popemobile tour through a cheering crowd in St Peter's Square.\n\nWho are the contenders to be the next pope? View Gallery\n\nHe had some reservations about looping through the square packed with 50,000 faithful, Vatican News reported on Tuesday, but overcame them — and was thankful that he had greeted the crowd. He died the next morning.\n\n\"The death of a pope is not a small thing, because we've lost our leader,'' said Julio Henrique from Brazil.\n\n\"But still, in a few days, we will have a new leader. So … the thing of hope remains. Who will assume Peter's throne?\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/anzac-day-2025-nsw-trading-hours-alcohol-retailer-shutdown-shops-push-back/f5d61189-8c74-48ce-840e-d5dc2e803942",
        "title": "Bottle shops slam state's new Anzac Day trading shutdown",
        "publish_date": "Wed, 23 Apr 2025 05:07:22 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "For the first time, strict retail trading restrictions will apply across New South Wales this Anzac Day , forcing most bottle shops to be closed for the entire day in a move that has been slammed as \"anticompetitive\" by a peak body.\n\nNew legislation passed in the state last year forces major retailers such as supermarkets, shops, bottle shops and alcohol retailers to close for the entire day on April 25, marking a major shift from previous years when trading was allowed after 1pm.\n\nHowever, Retail Drinks Australia has slammed the move by the NSW government, calling it \"unfair, discriminatory, and anticompetitive\".\n\nMost bottle shops won't be allowed to open at all on Anzac Day in NSW. (Louie Douvis/AFR)\n\n\"As a key sector within the broader liquor industry, our members have retailed responsibly and respectfully on this day for decades, servicing their local communities – they respect the significance and importance of Anzac Day,\" chief executive Michael Waters said.\n\nHe said alcohol retailers want to continue operating from 1pm, as they have done in the past. ﻿\n\n\"People taking part in Anzac Day should be able to commemorate however they choose, whether attending community ceremonies, joining family and friends at a BBQ, or having a quiet drink remembering old mates,\" Waters said.\n\nHe called on the government to \"be fair and balanced when making laws\", claiming the changes discriminate against bottle shops \"at a time when individuals and businesses alike are struggling to make ends meet\".\n\nThe NSW government has justified the move, stating that new restrictions on trading hours are intended to \"better represent the deep significance of Anzac Day\"﻿.\n\nWestern Australia is the only other state with full restrictions on alcohol trading for Anzac Day.\n\nThe Shop, Distributive and Allied Employees' Association (SDA) has long advocated for the change, arguing Anzac Day should \"commemorate the sacrifices of Australia's service men and women\".\n\nThe NSW government says the restrictions on trading hours allow citizens to focus on the significance of Anzac Day. (Nine)\n\n\"We owe our veterans and current serving ADF personnel a debt of gratitude for their sacrifice 365 days a year. We can all stop shopping for one whole day to commemorate that sacrifice\", NSW SDA secretary Bernie Smith said.\n\nRSL NSW president Mick Bainbridge has also backed the new laws, saying \"it's important that every Australian has the opportunity to pause, reflect and honour those who have served and who continue to serve\".\n\nShould bottle shops be open on Anzac Day? Yes 3269 No 1972\n\nAnzac Day alcohol trading across Australia ﻿\n\nNSW : All bottle shops and supermarkets selling alcohol must remain closed, unless exempt.\n\nThe only exceptions are liquor stores attached to hotels and takeaway alcohol sales from pubs, which are not subject to the new restrictions.\n\nACT: No restrictions. All retailers, including bottle shops, can remain open as usual.\n\nNorthern Territory: No restrictions. All retailers, including bottle shops, can remain open as usual.\n\nTasmania : Retailers, including bottle shops, can open from 12.30pm﻿.\n\nVictoria: Retailers, including bottle shops, can ﻿open from 1pm.\n\nSouth Australia: Retailers, including bottle shops, can remain open between 12pm and 5pm in Adelaide CBD only.\n\nStores in other areas, such as metropolitan shopping districts and Glenelg, will remain closed. Exemptions apply﻿.\n\nWestern Australia: ﻿All bottle shops and supermarkets selling alcohol must remain closed, unless exempt.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/kyneton-afl-review-womens-footy-teams-folding/105201074",
        "title": "Women's footy sides fold amid claims of a lack of support and understanding",
        "publish_date": "Thu, 24 Apr 2025 01:34:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "AFL Victoria is set to review the circumstances that led to Kyneton Football Netball Club's (KFNC) women's side breaking away to form their own entity following allegations of a \"volatile environment\".\n\nKFNC has denied the allegations from departing women's players.\n\nThe review will be assisted by Taryn Lee, a strategic advisor who was involved in the Collingwood Football Club's \"Do Better\" review and its implementation.\n\nWhy Kyneton's women's side left their club Photo shows Kyneton Football and Netball Club players in a huddle Kyneton Football and Netball Club's women's team decided to break away from the club in the wake of what players describe as a \"horrible, volatile environment\".\n\nIt comes as women's teams across the country struggle to field sides at long-standing clubs, which players attribute in part to cultural differences and inequitable treatment.\n\nLeaders and players within women's footy argue that bringing female teams into systems that have been long male dominated is often unsustainable without cultural change, given the different needs of women and girls.\n\nThis follows claims of poor treatment, inequitable access to resources and a lack of club support from players around Victoria.\n\n'Why are we still fighting to play football?'\n\nFollowing the introduction of AFLW in 2017, women's and girls' participation surged with about 600,000 now playing across the country. This is compared to about 600 in 2015, according to figures from the AFL.\n\nBut across the country, concerns are being raised about the health of women's clubs, particularly in regional areas, and several have folded due to a lack of participation.\n\nPlayers from Kyneton Women's Club during training. (Supplied: Sophie McLeod)\n\nKate Tellefson, who plays at Frankston Football Club Womens, has been a part of three women's sides that have folded.\n\nThe latest being Seaford Football Netball Club (SFNC), which axed its women's teams this year after not having enough players to field a single team for the 2025 season, despite fielding two teams in 2024.\n\nThe others were Mount Eliza, which failed to field a team past its inaugural season in 2016, and the Frankston Bombers, who struggled to get a women's team back up after the COVID years.\n\nTellefson, who was also the women's football director at SFNC before resigning mid-2024, was among several former players who told the ABC they felt women were not treated equally to men at the club and felt the club did not adequately address their issues.\n\nKyneton women's team players have made claims of inequitable treatment. (Supplied: Kyneton Women's Football Club)\n\nOne former player, who wanted to remain anonymous so she could speak freely without fear of repercussions within the community, said the situation at Seaford was \"really heartbreaking\".\n\nShe said after several discussions with key club people, many players got to the point where they were in meetings asking themselves: \"Why are we still fighting to play football in 2024?\"\n\nIn a statement provided to the ABC, SFNC acknowledged some players expressed dissatisfaction, particularly with coaching approaches, but said claims that players' concerns were ignored were not accurate.\n\n\"Right up to our season launch, we were hopeful that new or returning players would help us reach numbers. Sadly, this did not eventuate. Our intention is to relaunch the women's football program at Seaford in 2026 with renewed energy and support,\" the statement read.\n\n\"We acknowledge the challenges of the past season and are committed to rebuilding a vibrant and supportive women's program. We remain deeply proud of our female athletes and volunteers and are determined to see women's football thrive again at Seaford in 2026 and beyond.\"\n\n'Ongoing devaluing of women who play football'\n\nSeaford is one of many Mornington Peninsula Football Netball League clubs that have struggled with women's participation numbers, including Sorrento, Devon Meadows, Hastings, Rosebud, Frankston Bombers, Pines and Mount Eliza.\n\nCerberus had to merge with Crib Point, and so did Balnarring and Red Hill, to continue to play.\n\nWomen's football worries Photo shows An action shot of women playing football Concerns are being raised about whether women's football clubs are being appropriately supported as clubs across regional Victoria are forced to fold.\n\nIn Tasmania, Evandale, one of the oldest women's teams in the state, went into recess for the 2025 season and Brighton withdrew from the Southern Football League citing a lack of players.\n\nMeander Valley looked headed for a similar fate before a public outcry saved them for another season.\n\nIn the Change Our Game — State of Play Survey, almost one third (28 per cent) of women who played community sport said they had considered leaving their club due to inequitable treatment.\n\nIn the report released in July 2023, of the 670 Victorians canvassed, more than half reported gendered discrimination in community sport and 55 per cent said they had experienced or seen sexist language and jokes.\n\nClubs across the country are struggling to field women's teams. (Supplied: Kyneton Women's Football Club )\n\nKellie Sanders is a lecturer at La Trobe University who has researched barriers to women's sport across Aussie rules, rugby, soccer and American football across the globe.\n\nShe said women often received \"second-class treatment\", including in accessing resources or grounds.\n\n\"But the cultural one is this ongoing devaluing of women who play football,\" Dr Sanders said.\n\n\"So what my data would suggest is that there's something about the values and beliefs of those in positions of authority that impacts how women's teams are supported or not.\"\n\n'We don't want to be bottom rung'\n\nPioneer of elite women's football and AFLW commentator, Chyloe Kurdas, has been involved in women's footy since she played for Parkdale and Melbourne Uni in the late 90s and early 2000s.\n\nSince the introduction of AFLW, she said there had been a real haste and a lot of enthusiasm to set up women's teams at existing clubs but without an understanding of how to make them sustainable.\n\nKurdas says female-only or female-run clubs have been the most enduring. (Getty: Jonathan DiMaggio/AFL Photos/via Getty Images)\n\nThe clubs she has found to have been the most enduring have been female-only and female-run clubs, such as Melbourne University, Darebin and St Kilda City.\n\nDiamond Creek and Western Spurs started as teams integrated into men's club structures, but eventually left to stand on their own, which then supported their significant success.\n\nKurdas said these clubs made decisions top down with the needs of women and girls at the fore.\n\nWhereas, in existing clubs, women have had to integrate into systems already there, often with a mentality of: \"We'll give you some footies, we'll give you a coach, we'll give you some jumpers, we'll give you a ground to train on, as long as it doesn't impact the boys.\"\n\nWomen's teams are often diverse and inclusive. (Getty: Kelly Defina/AFL Photos)\n\nShe said when cracks started to show at clubs that had added women's teams on, things could become difficult.\n\n\"Then there's this unspoken, perceived hierarchy of what's the most important at a club, who gets prioritised,\" she said.\n\n\"And so what you end up with is the women say, 'This doesn't feel great. It's unsafe now for us to stay here.\n\n\" 'We don't feel valued and respected, we don't want to play, we don't want to be bottom rung [of the ladder]. We want to just be treated fairly.' And that's the issue. \"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nFurthermore, Kurdas added, there could often be a clash of culture as women's footy was particularly queer-friendly and forward.\n\n\"Women are already using a lot of social courage to come and play footy and then are coming into these footy clubs, which are the epitome of that traditional masculinity,\" she said.\n\n\"And so the psychological and the emotional transition, the cultural transition that needs to occur, it's probably the most important bit … because the needs of women and girls are really different.\n\n\"And people have really underestimated how important that investment is in that cultural transition and adaptation for both entities — the women's and men's clubs coming together and saying: 'What does it mean for us to have an integrated club?.'\"\n\nThe AFL has been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/motorcyclist-clocked-allegedly-riding-at-200km-hr-in-townsville/105210474",
        "title": "Motorcyclist clocked allegedly riding at nearly 200kph",
        "publish_date": "Thu, 24 Apr 2025 01:33:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "A motorcyclist clocked allegedly riding at a \"disturbing\" 198 kilometres per hour in Townsville over the Easter weekend has had his licence suspended.\n\nThe 34-year-old from Brisbane's West End was allegedly going 118kph over the speed limit when he was pulled over just before 9pm on Sunday on University Road at Annandale.\n\nHe's also been fined $1,854 and lost eight demerit points. His license has been suspended for six months.\n\nActing Chief Superintendent Chris Lawson said it was \"extremely disturbing\" and disappointing.\n\n\"It's not just your licence at risk when you travel at such a dangerous speed, you are putting yourself and other road users at risk of death or serious injury,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/federal-government-to-help-wa-buy-back-state-rail-network/105210388",
        "title": "Federal support promised to help WA Labor buy back freight rail network",
        "publish_date": "Thu, 24 Apr 2025 01:22:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Federal Labor has promised to help the WA government in its bid to buy back the state's freight rail network if re-elected, and has raised the prospect of the Commonwealth taking control of some of the line.\n\nThe 5,500 kilometres of freight rail stretching from Perth to the state's mining and agricultural regions was part of the freight rail network which was privatised in 2000, and which later resulted in a significant amount of freight being trucked instead.\n\nBefore the state election, WA Labor announced negotiations with the network's owner ARC Infrastructure to bring the network back into government hands.\n\nA freight train at Parkeston on the outskirts of Kalgoorlie-Boulder. (Supplied: Graham Duncan)\n\nSpeaking in Perth on Thursday morning, Prime Minister Anthony Albanese said a re-elected Labor government would fund a $2.5 million feasibility study.\n\n\"Farmers and the WA economy can't afford to wait another 25 years for the end of the lease before something is done,\" he said.\n\n\"We're prepared to take direct control of those parts of the network that the Liberals privatised, including the Eastern Goldfields Railway.\"\n\nMr Albanese said the network had been neglected despite growing demand for freight.\n\nPrime Minister Anthony Albanese says WA's rail freight network has been neglected for too long. (ABC News: Bridget McArthur)\n\n\"Key freight lines have simply been closed, meaning farmers and growers and producers are paying more for road transport, and those trucks are now part of the morning traffic in Perth suburbs,\" he said.\n\nLabor said part of that study would consider how the network could be integrated with the national rail network, which the party said could be achieved by the Commonwealth taking direct control of the rail line between Fremantle and Kalgoorlie.\n\nHuge freight demand\n\nThe WA government said demand on the network was at record highs, driven in particular by bumper grain harvests and new mining developments.\n\nInland port would improve freight movement with fewer trucks on the road Photo shows A politician in a white business shirt on a train platform as freight train passes in background. Western Australia's premier says plans to transform Kalgoorlie-Boulder into an inland port are unlikely to happen unless the state's rail freight network is back in government hands.\n\nIt argued doing so would allow for greater investment into the rail infrastructure, improvements in road safety and cost savings by having a more efficient link for commodities to reach Perth’s port.\n\nIt comes as the WA government is pushing ahead with its multi-billion dollar Westport plan.\n\nThat would see the city’s main container port in Fremantle dismantled and relocated south to the heavy Kwinana industrial zone, which would be serviced by an upgraded freight rail and road network.\n\nHow will it work?\n\nIn January, the government wrote to Arc Infrastructure to raise its intention to enter negotiations to return the freight rail network back into public hands.\n\nThe government said after those talks it would make a final decision if it was economically and financially responsible to do so, and that it would be open to a staged return to public ownership.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/meat-off-menu-for-norwegian-athletes-in-china-over-doping-fears/105210038",
        "title": "Meat off the menu for Norwegian athletes in China over doping fears",
        "publish_date": "Thu, 24 Apr 2025 01:00:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Norwegian athletes have been advised by the organisation responsible for training the country's elite competitors not to eat any type of meat while competing in China due to fears it could cause a positive doping test.\n\nOlympiatoppen, which is part of the Norwegian Olympic and Paralympic Committee, stated that consuming meat could lead to the unintentional ingestion of banned substances, posing a small but real risk of testing positive.\n\nThe 2025 World Athletics Relays will take place in early May at the Guangdong Olympic Stadium in Guangzhou, while the Diamond League event in Shanghai is scheduled for May 3, where several Norwegian athletes are set to compete.\n\n\"Studies have shown that athletes have inadvertently ingested clenbuterol when eating meat in China, as some animals are fed hormones to promote growth.\n\n\"If a meat-based meal is consumed before a doping test, the athlete may test positive,\" Olympiatoppen stated in its guidelines, as seen by Reuters.\n\n\"Therefore, Olympiatoppen advises athletes to avoid all types of meat while in China.\"\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nReuters has contacted World Athletics, the sport's governing body, and the Chinese Athletics Association for comment.\n\nNorwegian athlete Henriette Jaeger, a bronze medallist in the 400 metres at the World Athletics Indoor Championships this year and who will soon compete in China, confirmed she will follow the guidelines.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\n\"I really enjoy eating meat, and it's very good for the body when you're going to compete. But you have to listen to the professionals and trust them,\" she told Norwegian state broadcaster NRK.\n\nFellow athlete Josefine Tomine Eriksen is also taking the advice seriously.\n\n\"I don't want to be a 'veggie', (vegetarian) but you do need a bit of protein, so I'll bring some protein bars from Norway. Maybe a bit of beef jerky too.\"\n\nOlympiatoppen also warned against poor food hygiene in general and recommended eating at high-quality restaurants and hotels while in China.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/the-struggle-of-ivf-when-you-re-neurodivergent/105144942",
        "title": "The struggle of IVF when you're neurodivergent",
        "publish_date": "Thu, 24 Apr 2025 00:56:53 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Liz Bancroft spent 13 years trying to conceive before giving birth to her son two years ago.\n\nHer journey to motherhood included a gruelling six years of IVF.\n\nIt was difficult for many of the reasons you'd expect or may know intimately yourself. But for Liz, a diagnosis after becoming a mother shed further light on why she found infertility treatment so tough.\n\n\"I didn't realise that I was autistic until about 12 months post-childbirth when I realised my son was showing signs of autism,\" the 39-year-old from Perth/Boorloo says.\n\n\"In terms of my IVF journey, it annoyed me that I didn't know sooner because I would have made some changes … [which might have had an impact on] my ability to cope, potentially the outcomes, or advocating for myself more than I already did.\"\n\nLiz, who works as a clinical and counselling psychologist, has been motivated by her experience to develop a program helping neurodivergent women navigate IVF.\n\nWe spoke with Liz about her IVF experience, and what would have helped her as an autistic person.\n\nThese are her words.\n\nA quick note, this story mentions pregnancy loss.\n\nI lost every one\n\nLiz Bancroft works with other neurodivergent women navigating fertility treatment. (Supplied)\n\nI had a natural pregnancy 13 years ago after I got married, which resulted in a miscarriage.\n\nThen I wasn't able to conceive naturally — that's when I started looking into IVF.\n\nThe first clinic I went to wouldn't treat me because of my BMI. So I had gastric lap-band surgery, which was then revised and turned into a gastric sleeve.\n\nI lost 55 kilograms overall.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nI went back to a different clinic and had a few rounds that didn't work out. They weren't interested in trying different protocols, so I found a third clinic [with] a slightly different approach.\n\nAt first we tried ovulation induction. I fell pregnant naturally three times in a row, three months in a row, and I lost every one.\n\nAt that point I switched to IVF. But beforehand, I pushed for a laparoscopy as I was certain I had endometriosis. They found some mild endo, and a cyst attached to my uterus, and removed all of that.\n\nWe implanted the only two embryos I had. One of them took, and that is what resulted in my son.\n\nIf you or someone you know needs help: Red Nose Grief and Loss 24/7 Support Line on 1300 308 307\n\nGrief and Loss 24/7 Support Line on 1300 308 307 Pregnancy, Birth and Baby (advice from maternal child health nurses) on 1800 882 436\n\n(advice from maternal child health nurses) on 1800 882 436 PANDA (Perinatal Anxiety and Depression Australia) on 1300 726 306\n\n(Perinatal Anxiety and Depression Australia) on 1300 726 306 Bears of Hope (infant loss support for families) on 1300 114 673\n\nI went back last year to start all of this again, but the first round resulted in no embryos out of 30 collected eggs.\n\nThe second resulted in one, but unfortunately that embryo didn't implant.\n\nI'm now almost 40 and too financially stretched for more IVF.\n\nThe plan is to try naturally in the coming months, but if it doesn't happen, I'll have to accept that I am only able to have just the one.\n\nAll roads led back to myself\n\nI work with a lot of neurodivergent clients and am very good at early diagnosis and non-stereotypical presentations.\n\nBut I always assumed I was neurotypical.\n\nWhen I saw clear signs of autism in my son, he had to get that from somewhere, and it wasn't my husband.\n\nAll roads linked back to myself.\n\nLiz's son is now aged two. (Supplied)\n\nSome professionals might have assumed what I was experiencing was post-natal anxiety, but what I was struggling with was lack of control in my everyday routine.\n\nI was usually a very structured, controlled person, so my symptoms or sensitivities were never aggravated.\n\nAll that went out the window with a baby.\n\nI got therapy and worked through all the possibilities, for example childhood attachment issues and trauma.\n\nBut when I screened myself, I saw that many symptoms were just very borderline clinical levels of autism, and some surpassed.\n\nWhen I ran it past a few colleagues and friends, they were all like, 'Yeah Liz. We've known this for a while.'\n\nDoes stress impact fertility? Photo shows A woman wearing a red singlet sits down cross legged, her hands resting on knees, in a leafy park. It's not uncommon for couples to be told that if they could \"just relax\", becoming pregnant would be easy.\n\nIt was a huge relief, looking back over my life and reframing everything through a neurodivergent lens.\n\nIt made so much sense to me.\n\nAll those horrible labels I'd been given like anal retentive, bossy, dramatic, high maintenance.\n\nIt helped repair some of those self-esteem wounds.\n\nI was about to have a meltdown\n\nOne of the pinnacle examples of how autism shaped my experience with IVF would be egg collection.\n\nIt's a very intense procedure and a pivotal point in treatment which will determine potential outcomes following that.\n\nThere is some research that shows chronic and acute stress can potentially have a negative impact on outcomes at egg collection.\n\nYou have to show up at a very specific time. Then there is a window they need to operate within to get results, as you've taken medication beforehand to stimulate this process.\n\nOn one occasion, we weren't greeted at the waiting room.\n\nThey were running late.\n\nNobody updates you on anything.\n\nThe lights are very bright, people are making noise.\n\nYou have some wishy-washy instructions from your last appointment.\n\nFor an autistic person who needs structure and routine, it can be quite stressful.\n\nThe environment started to grate on me, and I was becoming more stressed and overstimulated.\n\nIt got to the point I felt I was about to have a meltdown, so I had to leave.\n\nPacing is a stimming behaviour for me, so I paced outside for 40 minutes before I was seen.\n\nMy nervous system had been activated, and I wonder how much of that stress response could have impacted my egg collection.\n\nDealing with IVF debt when you're childless Photo shows couple hugging and looking out window Any debt linked to fertility treatment can be a painful reminder for childless people that life didn't go as they planned. And it's often not just financial debt they are left with, either.\n\nHelping neurodivergent women through IVF is my new baby\n\nOffering to slow down verbal explanations, especially if processing speed is a concern for the patient.\n\nHaving more clear written instructions and visual aids.\n\nDimming lighting in waiting rooms.\n\nAddressing sensory issues around temperature in theatres.\n\nOptions for weighted blankets. Noise-cancelling headphones.\n\nThese are things that could have helped me.\n\nNeurodivergent patients may have some greater needs, and we know an autistic woman is more likely to placate, passively comply, or shut down than they are to speak up for themselves.\n\nHelping women with my program is essentially my new baby.\n\nLiz is sharing her personal story for advocacy purposes. For individual and detailed information, you should see a qualified medical practitioner who knows your medical history.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/trump-says-tariffs-reduction-depends-on-china/105209942",
        "title": "Trump says China tariff cuts depend on Beijing's actions",
        "publish_date": "Thu, 24 Apr 2025 00:11:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "US President Donald Trump says that any reduction in tariffs placed on China will depend on the actions of its leaders.\n\n\"It depends on China how soon the tariffs can come down,\" he said speaking in the Oval Office on Wednesday.\n\nTrump could be fighting a losing battle in a US-China trade war Photo shows A close up shot of Donald Trump looking at Xi Jinping. There are no winners in a US-China trade war. The question is which country can endure the most pain and emerge with the least damage.\n\nHe added that he expected to strike a deal and set the final tariff figure on China over the next two or three weeks.\n\nEarlier this week, he signalled that he would cut his 145 per cent tariff on Chinese imports substantially, but did not clarify by how much.\n\nMr Trump placed import taxes of 145 per cent on China, which countered with 125 per cent tariffs on US goods.\n\nChina responded saying the Trump administration should stop trying to bully and blackmail its trading partner.\n\nIt said US tariffs defied \"basic economic laws and common sense\".\n\nThe White House is open to discussing a significant rate cut on Chinese imports in order to advance negotiations with Beijing but will not do so alone, according to a person familiar with the conversations.\n\nChina says the Trump administration should stop trying to bully its trade partner. (Reuters: Athit Perawongmetha)\n\nThat person would not say how low the White House might be willing to go, but the Wall Street Journal reported the figure could be as low as 50 per cent.\n\nA White House spokesperson dismissed any reports as \"pure speculation\" and said news on tariffs would come from Trump himself.\n\n\"We are going to have a fair deal with China,\" Mr Trump said.\n\nClarity on tariffs might take months\n\nUS Treasury Secretary Scott Bessent said that high tariffs between the United States and China were not sustainable.\n\nMr Trump confirmed to reporters on Wednesday that he was in direct contact with China and President Xi \"every day\".\n\nDespite that, there remains little clarity on a deal being struck between the two nations.\n\nMr Bessent said the third quarter of this year was a \"reasonable estimate\" for achieving clarity on the ultimate level of Trump's tariffs.\n\nIn addition to the steep tariffs on China, Mr Trump has also imposed a blanket 10 per cent tariff on all other US imports and higher duties on steel, aluminium and autos.\n\nUS Treasury Secretary Scott Bessent says clarity on the tariffs could take months. (Reuters: Elizabeth Frantz/File)\n\nHe has suspended targeted tariffs on dozens of other countries until July 9 and floated additional industry-specific levies on pharmaceuticals and semiconductors.\n\nThat has roiled financial markets and raised fears of recession.\n\nThe International Monetary Fund said on Wednesday the tariffs would slow growth and push debt higher across the globe.\n\nS&P Global found that US business activity slowed to a 16-month low in April while prices charged for goods and services soared.\n\nThe Federal Reserve said it found economic activity in the United States to be steady over the past month, despite \"pervasive\" uncertainty around trade.\n\nThe central bank's survey found a drop in international visitors in some areas, and the outlook in several of the Fed's 12 regional districts \"worsened considerably.\"\n\nUS states sue Trump administration\n\nA dozen states have sued the Trump administration in the US Court of International Trade in New York to stop its tariff policy, saying it has brought chaos to the American economy.\n\nThe lawsuit said the policy put in place by President Trump had been subject to his \"whims rather than the sound exercise of lawful authority\".\n\nIt challenged Mr Trump's claim that he could arbitrarily impose tariffs based on the International Emergency Economic Powers Act.\n\nArizona's attorney general has called Trump's tariff scheme \"insane\". (AP: Jenny Kane)\n\nThe suit asks the court to declare the tariffs to be illegal and to block government agencies and its officers from enforcing them.\n\nThe states listed as plaintiffs in the lawsuit were Oregon, Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, Nevada, New Mexico, New York and Vermont.\n\nIn a release, Arizona Attorney General Kris Mayes called Trump's tariff scheme \"insane\".\n\nShe said it was \"not only economically reckless — it is illegal\".\n\nReuters/AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/bhp-to-demolish-port-hedlands-pier-hotel-to-make-park/105205390",
        "title": "'Toughest pub in the world' to be demolished to make way for a park",
        "publish_date": "Wed, 23 Apr 2025 23:00:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Once dubbed the world's toughest pub, an iconic hotel in Western Australia's Pilbara will soon be demolished and turned into a park.\n\nMining giant BHP announced plans on Tuesday to turn the 130-year-old Pier Hotel at Port Hedland into a community space with picnic tables and native vegetation, set to open early next year.\n\nThe pub closed its doors for the last time in July 2024 and was bought by BHP soon after.\n\nBHP's plans have been described as \"underwhelming\" by residents of the town, 1,630 kilometres north of Perth.\n\nAnd the hotel's undeniable place in Port Hedland's history suggests any new development will have big shoes to fill.\n\nThe Pier Hotel was one of the first businesses in Port Hedland, captured here in 1937. (Supplied: Norman Henry James/State Library of WA)\n\n'Very big reputation'\n\nThe Pier Hotel was first constructed in the 1890s.\n\nAccording to the Town of Port Hedland's heritage inventory, it was one of two hotels in a town that had just a blacksmith's shop and a jetty at the time of settlement.\n\nOver the years, it was frequented by station owners, commercial travellers, and pilots.\n\nThe pub was reconstructed by the 1960s and became a meeting place for local workers and visitors.\n\nAnd in the 1970s, it was reportedly described as the \"toughest pub in the world\" by a journalist working for a UK publication.\n\nWhen asked about their memories of the pub, many locals replied with a cheeky chuckle.\n\nArnold Carter, 98, who has lived in Port Hedland since 1962, was no exception.\n\nArnold Carter, pictured in his Port Hedland office, has lived in the town since 1962. (ABC Pilbara: Amelia Searson)\n\nHe said the hotel had a \"very, very big reputation\" and would sometimes get rough.\n\nAccording to unfounded rumours among locals, the pub once had 86 stabbings in one night — but that did not stop them spending time there.\n\n\"You'd only be down there about half an hour and your troubles would disappear,\" Mr Carter said.\n\nLearning maths at the pub\n\nLong-time Port Hedland resident George Dann worked on the town's waterfront for 45 years and said he started going to the hotel as a teenager.\n\n\"It was always packed to the max,\" he said.\n\nIn the 60s, he said a jug of beer cost just $1.20, and people would be involved in darts competitions, live music, karaoke, boxing, and indoor hockey at the hotel.\n\nThe hotel had a reputation of as one of the town's toughest pubs. (Supplied: State Library of WA)\n\nMr Dann even credits counting darts scores at the Pier Hotel with improving his maths.\n\n\"If you didn't know your maths properly, somebody might be able to give you their numbers,\" he said.\n\nDespite the venue's rough reputation, he said \"everybody had respect for everybody\".\n\n\"You could have cigarettes and money sitting on the bar, go for a dance, come back, and your beer and all your money and smokes were still there,\" he said.\n\nPort Hedland resident Gloria Jacobs agreed it was \"a tough pub\" for many people but said it could also be a great space for gathering.\n\nLocal Gloria Jacob says the hotel has \"iconic status\" in Port Hedland. (ABC Pilbara: Susan Standen)\n\nLocals disappointed with plans\n\nBHP said Pier Park would be a community space that paid homage to the history of the hotel through a \"walk down memory lane\".\n\nMr Carter said he wanted to see something constructed that would provide more benefit to locals.\n\nSimilarly, Ms Jacobs said it was a \"little underwhelming\" to turn the space into a park.\n\nBut she acknowledged the land had development restrictions.\n\n\"It looks like … that's going to attract people but I think the loss of history is what is upsetting the community,\" she said.\n\nMs Jacobs said she would prefer to see it turned into a backpackers' or tourism centre.\n\n\"We're not ungrateful for it — we're just saying that something like that, with such an iconic status, has high value of history to the community,\" she said.\n\nBHP said demolition would begin this month, and the community and relevant stakeholders would be updated as the plan progressed.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/maga-hats-sell-out-after-trump-victory/105175002",
        "title": "Anti-woke or a bit of fun? Where MAGA hats are hot items in Australia",
        "publish_date": "Wed, 23 Apr 2025 22:09:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "The number of Australians donning Make America Great Again (MAGA) hats has risen, with experts pointing to shared values between the Australian and American MAGA faithful as the catalyst for their spike in popularity.\n\nThe bright red hat has been a signature of Trump's presidency since he first ran for office in 2016, and has been adopted by others throughout his administration, including US billionaire Elon Musk.\n\nDespite contrasting political systems, MAGA hats have found popularity in pockets of Australian society where Trump's core message of voter neglect has resonated.\n\nTobe Mcgill bought his MAGA hat from Trump Tower in New York. (Supplied: Tobe Mcgill)\n\nSymbol of 'anti-woke sentiment'\n\nTobe Mcgill is a farmer from Wyening, 150 kilometres north-east of Perth in Western Australia's Wheatbelt, who last year travelled through North America on a working holiday with two friends.\n\nHe brought back a red MAGA hat he bought from Trump Tower in New York.\n\n\"The Make America Great Again hat, to me, that just represents making the country that that man Donald Trump loves and is proud to be an American, just making it great again,\" he said.\n\n\"It's also a sort of anti-woke sentiment.\n\n\"I think these days there are a lot of people who are too afraid to speak their opinion.\"\n\nThe MAGA hat has been a staple of Trump's iconography since 2016. (AP: Evan Vucci)\n\nMr Mcgill said he supported Trump's policy of increased domestic manufacturing and the administration's tough stance on illegal immigration, but thought Trump's policy of assimilating Greenland was misguided.\n\nThe WA grain farmer said while reactions to the hat were largely positive in the US, people in Australia were indifferent.\n\n\"There hasn't really been too much of a reaction to it be honest,\" he said.\n\n\"People who don't like it won't say anything, which I think is common nowadays, but people who do like it will come up and say something.\"\n\nDe Williams says Hurly Burley had sold out of MAGA hats since Trump was re-elected. (ABC Great Southern: Andrew Chounding)\n\nTrump hats selling out\n\nA costume store in Perth City said demand for MAGA hats had surged after the 2024 election.\n\nHurly Burly general manager De Williams said the store had sold out of stock on four occasions.\n\n\"Our MAGA caps have indeed sold out recently,\" she said.\n\n\"Based on our observations and customer feedback, many purchases appear to be made in a playful, ironic spirit, often as a novelty for themed parties or humorous events, rather than as a straightforward political endorsement.\"\n\nGordon Flake says Australian politicians trading off Trump's name are unlikely to find success. (Supplied: Perth USAsia Centre)\n\n'Declaration of commonality'\n\nPerth USAsia Centre chief executive Gordon Flake said there was likely a subset of hat wearers who shared MAGA ideology.\n\n\"Knowing the Australian personality, part of it is a bit ironic and just kind of, you know, poke you in the eye, kind of good fun, but part of it would probably be a little bit more serious,\" he said.\n\nCoalition senator says she didn't mean to echo Trump Photo shows A middle-aged Indigenous woman wearing white speaks in front of blue signage The Coalition's spokesperson for government efficiency, Jacinta Nampijinpa Price, told a crowd of supporters the party would \"make Australia great again\". Less than an hour later she said she didn't realise she had echoed Donald Trump's rallying cry.\n\n\"A declaration of commonality.\"\n\nThat commonality has been pounced on by some politicians in the recent WA state election and by federal politicians such as Clive Palmer and Jacinta Price, ahead of May's federal election.\n\nHowever, Professor Flake said Australia's political system and voter behaviour were unlikely to result in Trump-like wins for those trading off his name.\n\n\"The Australian body politic, primarily because of our mandatory voting right, doesn't really reward extremist politicians to the same degree that the US system does,\" he said.\n\n\"If you think about the last month of the federal election campaign, they've been competing for the middle.\n\n\"I don't see a red MAGA hat as competing for the middle even in the United States, and certainly not in Australia.\"\n\nProfessor Flake said in some cases the hat also emboldened wearers to expose \"views which are generally considered to be not acceptable\".\n\n\"That is something that obviously in Australia is not nearly to the extent it is in the United States,\" he said.\n\n\"But we pretend at our peril that it doesn't exist.\"\n\nSteve Mcguire says people should take Donald Trump seriously. (ABC Great Southern: Andrew Chounding)\n\n'Take him seriously, not literally'\n\nKojonup farmer and tentative Trump supporter Steven Mcguire said he was drawn to the president's policies, rather than ideology.\n\n\"I don't like everything, or the way he operates, but there's that famous saying from his first term, where they said, 'Some people take Trump literally, but not seriously', whereas people who understand what he's doing take him seriously, but not literally,\" he said.\n\n\" I take him seriously, but not literally. \"\n\nHe said Trump's Department of Government Efficiency (DOGE), headed by billionaire Elon Musk, was one Trumpism he would support in Australia.\n\nBut he did not believe either major party would be willing to implement an Australian equivalent.\n\nElon Musk gestures as he speaks in the US last year. (Reuters: Rachel Wisniewski)\n\n\"We need a leader who has the imprimatur to go ahead, and like Trump, has the political currency in the bank to make the changes that are going to be unpopular, but will do the right thing in the long term,\" he said.\n\n\"John Howard did bring in a GST and he lost a lot of skin over it.\"\n\nWhile he agreed a rise in MAGA sentiment among some Australian voters was unlikely to materialise politically, Mr Mcguire said it had emboldened sections of the community who had felt left behind.\n\n\"[People] are expressing a confidence to say, 'Here I am, these are my beliefs and if you don't like it, too bad', whereas in the past they probably haven't had that confidence,\" he said.\n\n\"That's what Trump has done, he's given people — some people — confidence to publicly say, to publicly express, what they think.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/arsenal-crystal-palace-draw-liverpool-premier-league-title/105209552",
        "title": "Arsenal blunder makes life easier for Liverpool to claim Premier League title",
        "publish_date": "Wed, 23 Apr 2025 21:58:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "Arsenal has kept Liverpool's Premier League title-winning champagne on ice but only just as it was twice pegged back to draw 2-2 at home by Crystal Palace.\n\nFirst-half goals by Jakub Kiwior and Leandro Trossard looked like being enough for a lacklustre Arsenal against a lively Palace side which earlier equalised with an Eberechi Eze volley.\n\nBut there was a late twist as Palace substitute Jean-Philippe Mateta pounced on a lazy pass at the back from William Saliba, leaving intended recipient Martin Ødegaard sprawled on the turf as Mateta produced a superb chipped finish over Arsenal keeper David Raya from outside the box in the 83rd minute.\n\nThe draw left second-placed Arsenal on 67 points with four games remaining, meaning it can only match the 79 of Liverpool, which still has five games to play.\n\nHad Arsenal lost, Liverpool would have won the title but they can now seal it with just a draw against Ange Postecoglou's Tottenham Hotspur at Anfield on Sunday (Monday morning AEST).\n\nBoth Arsenal and Palace have huge cup semifinal games looming: Arsenal in the Champions League at home to Paris St Germain next Tuesday and Palace this Saturday against Aston Villa in the FA Cup.\n\nTwelfth-placed Palace could have been excused if they were distracted by what will be the biggest game of their season.\n\nInstead, it was Arsenal who were off the pace as they drew for the 13th time in the league this season and fifth time in eight — a statistic that has allowed Liverpool to all but mathematically wrap up a record-equalling 20th English title.\n\nPalace, who left key players Mateta and Ismaila Sarr on the bench but still fielded Eze, will have taken great heart from their display as they prepare for Villa.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\nEze took his goal brilliantly, connecting with Adam Wharton's corner to bounce a volley in off the post past Raya.\n\nBut the best was saved to last as Mateta, still wearing the protective covering on his ear badly gashed in the FA Cup fifth-round tie against Millwall, swooped after Saliba missed captain Ødegaard's direction for a back pass to the goalkeeper and the Palace man lofted a sensational shot over Raya.\n\nIf Liverpool can avoid losing to Spurs, they will lock up their first title since breaking a 30-year drought in 2020 and end Manchester City's run of four straight.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/asx-markets-business-live-news-24-april-24/105209536",
        "title": "Live: Global markets, ASX rally on softer Trump stance",
        "publish_date": "Wed, 23 Apr 2025 21:48:22 +0000",
        "category": "finance",
        "authors": [
            "Stephanie Chalmers",
            "Gareth Hutchens"
        ],
        "text": "The Australian share market has opened higher for a second consecutive session, putting it on track for a weekly gain.\n\nThe drivers of optimism on the ASX yesterday have spilled over to global markets, with Wall Street and Europe finishing with strong gains.\n\nFollow the day's financial news and insights from our specialist business reporters on our live blog.\n\nDisclaimer: this blog is not intended as investment advice.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/how-is-australias-northern-coastline-being-defended/105201488",
        "title": "Fears of a 'glaring hole' in Australia’s defence",
        "publish_date": "Wed, 23 Apr 2025 21:34:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Western Australia's expansive and largely barren north is often in the headlines as the \"engine room of the nation's economy\".\n\nBut that value, combined with its proximity to the Indo-Pacific, also makes it significant to Australia's defence interests.\n\nIt's why the Defence Strategic Review (DSR), a generational assessment of Australia's defence forces, called for bases in northern Australia to be \"urgently and comprehensively remediated\" in 2023.\n\n\"The bases to the north are important because it's our first line of defence,\" University of Western Australia Defence and Security Institute research fellow Troy Lee-Brown said.\n\nDr Lee-Brown says bases like Curtin and Learmonth are highly important. (Supplied: UWA)\n\nThe need for that defence has grown, Dr Lee-Brown said, because of \"changes in the security structure\" of our region, led by China's military build-up.\n\nRecent reports of Russia's interest in basing aircraft in Indonesia have also raised questions about what that future structure could look like, despite Australia receiving assurances our close neighbour would not grant a request along those lines.\n\nA Defence spokesperson said its latest Integrated Investment Program included between $14 and $18 billion over the next decade for \"a logistically connected and resilient set of bases, ports and barracks across Australia's north\".\n\nA plane on the tarmac at RAAF Base Learmonth, more than 1,200km north of Perth. (ABC News: Rebecca Parish)\n\n\"The government has already approved more than $1 billion in north Western Australia infrastructure upgrades over the forward estimates, including over $700 million for airfield upgrades at RAAF Base Learmonth, to widen and strengthen the runway and taxiway,\" the spokesperson said.\n\n\"Construction will commence shortly and [is] expected to be completed in 2027.\"\n\nDr Lee-Brown said works were \"overall … tracking in the right direction\".\n\n\"Whether it's quick enough is another matter entirely,\" he said.\n\nPriorities need to shift\n\nChair of the US-Asia Centre Kim Beazley has a firm answer to that question of timing.\n\n\"We're not completely unprepared but we don't have yet enough, and the government is undertaking to ensure that we start to get enough,\" the former Labor defence minister and ambassador to the US said.\n\n\"We are going to have to, over the next few years, shift priorities to get there.\n\nKim Beazley says defence policy is in the right area, but resourcing will be key. (Four Corners)\n\n\"It does cost money and it does take people and all has to be provided in order to be able to do it.\n\n\"I think we're now much better focused on the defence of our northern approaches, at least policy-wise, than we have been for quite some time.\n\n\" The plans are there. The question is to get the resources in to do it and starts have been made. \"\n\nDefence spending pledges\n\nPart of that could come from the Coalition's pledge yesterday to increase defence spending from 2.04 per cent of Australia's gross domestic product, where it sits now, to 2.5 per cent by 2030.\n\nThat is more ambitious than Labor's plan to lift spending to 2.3 per cent of GDP by 2033.\n\n\"This announcement today, which is a record announcement into defence of $21 billion, is not only going to get us to 2.5 per cent of GDP … it's going to allow us to invest in our defences across the north,\" Mr Dutton said in Perth on Wednesday.\n\nPeter Dutton spoke alongside Shadow Defence Minister Andrew Hastie (left) at a defence manufacturing facility in Perth. (ABC News: Ian Cutmore)\n\nPrime Minister Anthony Albanese said Labor had \"put in $57 billion additional funding over 10 years\" and would \"make budget decisions every year\".\n\nIt's unclear though how much either party will invest in strengthening defences in northern WA, or the rest of northern Australia.\n\n'Glaring hole' in defence\n\nOne area where one of the people who worked on the DSR hopes future funding is directed is a \"glaring hole\" in Australia's integrated air and missile defence.\n\nDefence review identifies WA's north as key area of concern Photo shows Woodisde's Scarborough gas project includes expanding the current Pluto facility on the Burrup Peninsula Australia's first major defence force review in a generation says the nation's geographical benefits are \"radically reduced\", with WA's north now a \"primary area of military interest\".\n\n\"Fundamentally, to protect the northern part of Australia, and particular parts of the northern parts of Western Australia where we have key military bases … we need ground-based air defence,\" the director of foreign policy and defence at the University of Sydney's US Studies Centres, Peter Dean, told ABC Radio Perth.\n\n\"At the moment there is a sort of a commitment that we identified in the Defence Strategic Review that there should be a medium-range surface-to-air missile capability.\n\n\"But there's yet to be any dedicating funding towards this and there's yet to be a clear program of how we're going to deliver this quickly and that is an urgently needed area.\"\n\nProfessor Dean estimated that project would cost between $6 and 8 billion.\n\nNorthern bases at minimal staffing\n\nAnother issue to grapple with is the staffing of bases in northern WA.\n\nCurrently, both Learmonth and Curtin are considered \"bare bases\" with minimal regular staffing but the ability to handle an influx of troops at short notice.\n\nRAAF Base Learmonth is one of the bases that needs to be running at a higher capacity, according to Dr Lee-Brown. (ABC News: Alistair Bates)\n\n\"As the region becomes more fractious and strategic warning time has evaporated … it's strategically important for Australia to have its northern bases running at a greater capacity than they currently are,\" Dr Lee-Brown said.\n\nBut neither major party would commit to that.\n\nAsked if bases in northern WA should be permanently staffed, the opposition leader said he would \"look at the advice from Defence at the time\".\n\nThe US Air Force and RAAF run joint training exercises over Curtin airbase. (Supplied: U.S. Air Force Tech. Sgt. Dylan Nuckolls)\n\n\"But I've been very strongly supportive of us increasing our fuel reserves and making sure that our capabilities are as strong as they can be in our northern and our north-western approaches,\" Mr Dutton said.\n\n\" So we should look more closely with the United States and see what further investment can be made by the US in the top-end. \"\n\nThat was despite his shadow defence minister later that day saying Australia cannot take the US alliance for granted under President Donald Trump.\n\nStaffing levels considered\n\nWhen asked, Defence Minister Richard Marles agreed the bases were important but would not say what Labor was committing to.\n\n\"We need a defence force that can project, because the location of Australia's national security is not the coastline of our continent, in fact [it] lies much further out,\" he said in Perth on Tuesday.\n\nRichard Marles says Australia's defence strategy needs to be considered past the coastline. (ABC News: Courtney Withers)\n\n\"And in order to be able to project it is really important that we have a strong line of northern bases, including the northern part of WA. That is literally the platform from where we project.\n\n\"Upgrading those bases is a really important part of what we are doing in terms of restructuring our defence force and building a defence force which can project.\"\n\nPrime Minister Anthony Albanese indicated staffing was being considered.\n\nDefence force shifts posture as Australia enters 'missile age' Photo shows A missile being fired in the desert. The federal government announces a major shift in Defence's posture as the world enters the \"missile age\", warning Australia's natural defences have been radically reduced.\n\n\"One of the things that the Defence Strategic Review indicated was the need for our posture, our defence force posture, to be located towards the north,\" he said in WA on Wednesday.\n\n\"That's a program that's being worked out through the Department of Defence with the Defence Minister, Richard Marles.\"\n\nWA Premier, Roger Cook, suggested he was content with current levels.\n\n\"Every Western Australian premier would say we'd want a bigger military presence in the north-west,\" he told ABC Radio Perth.\n\nPremier Cook says significant work has been done to relocate defence assets into WA. (ABC News: Ian Cutmore)\n\n\"We believe that there's a lot of strategic economic assets there. We believe that it is a point of vulnerability because it's such a vast coastline.\n\n\"I do believe that the Albanese Labor government, through the Defence Strategic Review, has done some significant work to relocate a lot of defence assets into Western Australia and that's a very pleasing development.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/maya-joint-ajla-tomljanovic-chris-oconnell-madrid-open/105209382",
        "title": "19yo Maya Joint betters Ash Barty record on Madrid Open debut",
        "publish_date": "Wed, 23 Apr 2025 21:04:45 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian teenage tennis star Maya Joint has eclipsed one of Ash Barty's records as she achieved another significant landmark in her burgeoning career by earning her first WTA 1000 match triumph at the Madrid Open.\n\nOn her tour-level clay-court main draw debut in the Spanish capital, the 19-year-old Queenslander outlasted local wildcard Carlota Martinez Cirez 6-2, 2-6, 6-4 for a third win in three days.\n\nJust five days after her 19th birthday, it meant Joint became the youngest Australian to win a WTA match at 'Masters' level since the system was introduced in 2009, surpassing Barty who won at the Miami Open in 2017 when she was 20 years and 330 days old.\n\nIt was her second WTA 1000 match, after losing in the opening round of Indian Wells to Romanian's Sorana Cirstea in March.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nAlready having earned notable wins over the experienced duo of Sara Errani and Jil Teichmann in qualifying, the US-born Joint, who has made massive strides over the past two seasons since throwing in her lot with the nation of her Australian dad, came through a roller-coaster first-round affair.\n\nIt was the Brisbane-based youngster's first match in a tour-level clay event, but she showed why her record in smaller clay-court tournaments has been so encouraging as she overcame a second-set lapse to dominate the impressive Spanish tour debutant Martinez Cirez.\n\nJoint, who was ranked 269 in the world this time last year, eked out her victory in two hours and seven minutes, setting up the chance to make even more waves when she faces American world number 10 Emma Navarro in the second round.\n\nAjla Tomljanović's hopes of joining Joint in the last 64 ended with a disappointing 6-3, 1-6, 7-5 defeat to world number 153 Rebeka Masarova, who is ranked 74 places below the Australian.\n\nWith Kim Birrell having been beaten by American Peyton Stearns, it leaves just Joint and Daria Kasatkina, set to take on American Alycia Parks in her second competition as an Australian competitor, flying the flag in the women's draw.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nOn the men's side, Chris O'Connell earned himself an inviting shy at Taylor Fritz, hoping to conjure up a sensation in the 'Magic Box' with the American world number four a potentially vulnerable target after his 2025 injury woes.\n\nThe indefatigable O'Connell, one of the busiest Australians on tour in his 10th tournament of the year, earned a handy win in the first round of the ATP 1000 event at the Spanish capital's famous Caja Magica venue, beating Argentinian world number 59 Camilo Ugo Carabelli 6-3, 6-4.\n\nThe 30-year-old O'Connell, ranked 87, converted all three of the break points he earned and saved seven of the eight he faced to join compatriots Alex de Minaur and Alexei Popyrin, who both had byes, in the second round.\n\nThere he'll face US Open and ATP finals runner-up Fritz, the third seed who's competing in his first clay-court tournament of the season after a 2025 campaign dogged by an abdominal injury that's prevented him playing anywhere near his best.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-24/federal-election-2025-live-blog-albanese-dutton/105209352",
        "title": "Live: Dutton insists there's been no EV policy reversal",
        "publish_date": "Wed, 23 Apr 2025 21:03:57 +0000",
        "category": "finance",
        "authors": [
            "Nicole Hegarty",
            "On The Trail With Albanese",
            "Courtney Gould",
            "Joshua Boscaini"
        ],
        "text": "(ABC News: David Sciasci)\n\nWhile Peter Dutton was holding his press conference, Anthony Albanese addressed a business breakfast in Perth.\n\nDuring the Q & A portion of the event, the prime minister was asked what the worst moment of the campaign had been.\n\nHe responded when he fell off the stage at an event in Cessnock in the New South Wales' Hunter region.\n\nThe PM has previously disputed whether it was in fact a fall. The Coalition jumped on that labelling it a lie.\n\nToday he says that \"I didn't fall\" line, said in an interview with the ABC, was in response to a question suggesting he fell on his butt.\n\nHe goes on to congratulate the West for having better workplace health and safety and points to a white line on the stage.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/bears-to-be-reborn-in-western-australia-20250424-p5ltvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bears to be reborn in Western Australia",
        "publish_date": "Thu, 24 Apr 2025 11:45:36 +1000",
        "category": "finance",
        "authors": [],
        "text": "Bears to be reborn in Western Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/surfing-s-great-survivor-sally-fitzgibbons-upsets-world-no-1-in-bells-beach-boilover-20250424-p5ltxb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Surfing’s great survivor Sally Fitzgibbons upsets world No.1 in Bells Beach boilover",
        "publish_date": "Thu, 24 Apr 2025 11:45:13 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "Four underwhelming returns to start 2025 had her ranked 15th and staring down the same fate before she was drawn to face 19-year-old Simmers at Bells Beach on Thursday.\n\nFor the past three seasons, Fitzgibbons’ 12th and 13th place finishes have consigned her to the WSL’s gruelling requalification process in far-flung places around the world.\n\nSally Fitzgibbons with a young local surfer before keeping her season alive at the Bells Beach Pro. Credit: World Surf League via Getty Images\n\nTwo-time Bells champion Fitzgibbons has been the most recognisable victim of the WSL’s mid-season cut since it was introduced in 2022 , which reduces the permanent women’s competition from 18 competitors to 10, and the men’s from 36 to 22, at the world tour’s halfway point.\n\nAustralian surfing’s great survivor Sally Fitzgibbons has kept her season alive by beating world No.1 Caity Simmers in a Bells Beach Pro boilover.\n\nFitzgibbons’ “home ground” advantage against the reigning world and Bells champion instead triggered a 12.73 to 10.10 upset and quarter-final passage for the oldest surfer on tour.\n\nThe 34-year-old was overcome with emotion when the hooter sounded.\n\n“I’ve already done a few laps of the world this year, and not been able to score any real points or get any traction in the [rankings], or have my best surfing come out,” Fitzgibbons said.\n\n“That’s a lot of 40-hour trips just sitting in a plane seat just thinking about the whole scenario, and you’re planning your days and whole life around those 30-minute heats.\n\n“It all compounds and becomes so meaningful, so that’s where the emotion came from. It’s been a tough run of results, but I couldn’t be any more excited. I’m so pumped for the challenge of keeping myself going with the cut. It’s such a heavy scenario – you can really go from zero to hero.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/brisbane-eating-out/is-this-sanger-brisbane-s-best-hangover-cure-20250424-p5lty8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is this sanger Brisbane’s best hangover cure?",
        "publish_date": "Thu, 24 Apr 2025 11:44:37 +1000",
        "category": "finance",
        "authors": [
            "Matt Shea"
        ],
        "text": "Advertisement\n\nEating outSandwich Watch Is this sanger Brisbane’s best hangover cure? Lashings of Bangalow Sweet Pork ham and a to-die-for bechamel sauce make this one to seek out. Matt Shea April 24, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThere’s a croque craze going on. No, not the ugly-fashionable footwear. We’re talking the ugly-delicious sandwich. And Mitch & Antler’s croque madame is particularly ugly, particularly delicious. Hence why co-owner Chewie Choo wonders aloud if his sandwich started the trend. Mitch & Antler’s croque madame. Morgan Roberts “After we launched it, I think it was about three or four months later that I seemed to start noticing them everywhere,” he says. Perhaps. Perhaps not. Either way, Mitch & Antler’s variation on the classic French toasted sandwich proved so popular after the cafe’s opening in 2023 that Choo and his brother and co-owner Tze-Huei Choo then built an entire second venue, James & Antler (now sold), around the concept.\n\nAdvertisement\n\nThe creation of Mitch & Antler Full-service cafes are hard in 2025. They’re expensive to staff and run, and if you’re going to pass some of that on to the diner, you need to make it worth their while. “We wanted to do something different to the traditional breakfast menu items,” Chewie says. “Everyone can make, like, an eggs Benedict.” Related Article Flash new supper club hides in plain sight on James Street So, Mitch & Antler’s menu is full of interesting variations on the classics, or the kind of thing you might’ve glimpsed on Instagram. Omurice with wagyu mince and edamame. Korokke with sautéed kale and poached eggs. Brown butter croffles. That kind of thing.\n\nAdvertisement\n\nBut the star item for the Mitchelton cafe since opening is its croque madame. Despite all it has going on, the croque madame is still surprisingly simple to eat. Morgan Roberts Mitch & Antler’s croque madame You might think the croque madame (basically, a fancy French toastie) is the kind of thing you could make at home. And you’re probably right, but according to the Choos it would be messy and expensive. “Everyone can do a croque but no one can do the leek bechamel we do,” Tze-Huei says. “And I don’t think most people are crazy enough to buy the amount of manchego cheese that we tend to shave over the top.”\n\nAdvertisement\n\nWhat else goes into this thing? Two slices of Cordelia sourdough baked to Mitch & Antler’s specs, lashings of thick-cut smoked ham from Bangalow Sweet Pork, and Egmont cheese. Then, on top, goes the seeded mustard and leek bechamel, a fried egg, chives and the manchego – the whole thing given a dash of flame before it hits the plate. Introducing Brisbane’s best hangover cure Mitch & Antler buzzes with punters on weekends. Morgan Roberts On the plate, the croque is a fabulous slice (or two slices) of organised mess. You might be tempted to tackle this thing with a knife and fork. Don’t bother.\n\nAdvertisement\n\nDespite everything going on with this sandwich, it holds together well and the toasted Cordelia sourdough is soft on the inside, meaning you avoid any mouth-shreddings. It would almost be a one-hander but for the wibbly-wobbly fried egg on top. Our favourite play is to order it takeaway to enjoy on a park bench somewhere nearby. Mitch & Antler co-owner Tze-Huei Choo. Morgan Roberts There’s a lot to love about this sandwich – the perfectly specced bread, the smokey goodness of the chunky ham, that gooey egg. Still, it’s the tangy bechamel that makes it, with the sweetness and texture of the leek and acidity of the mustard. “It’s a bit like tomato adding acidity to a toasted sandwich,” Tze-Huei says. “That’s the mustard. Then, the leek adds that sweetness.”\n\nAdvertisement\n\nIt’s a sizeable sanger, but you’ll still destroy this thing within a few minutes, the only signs of its previous existence the yolk and bechamel left on your fingers. Where to get it Mitch & Antler’s croque madame is $21. You can get one at 62 Suez Street in Mitchelton. We recommend hitting it on the weekend to make the most of the croque’s truly magical hangover-curing properties.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/set-up-to-fail-levi-s-world-cup-bid-in-jeopardy-as-agent-raises-issue-of-animosity-among-players-20250424-p5ltwp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Set up to fail’: Levi’s World Cup bid in jeopardy as agent raises issue of ‘animosity’ among players",
        "publish_date": "Thu, 24 Apr 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Australian sevens star Maddison Levi is being “set up to fail” and her switch to play XVs would only fuel further animosity if she entered Wallaroos camp ahead of the Women’s Rugby World Cup.\n\nThat’s the view of Levi’s agent and former Wallaby Mat Rogers, who has expressed concerns about his client’s mooted switch from sevens to XVs this year.\n\nThe Wallaroos are planning for Levi to make herself available next month to play Tests before the World Cup, starting in August, but might need to re-evaluate after Rogers’ latest remarks.\n\nRogers, a dual international for Australia in league and union, said he had serious reservations about Levi being parachuted into the Wallaroos program with limited preparation or game time in the 15-a-side format.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/i-love-my-flower-sprinkles-even-though-they-were-mocked-meghan-says-20250424-p5ltvc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I love my flower sprinkles even though they were mocked, Meghan says",
        "publish_date": "Thu, 24 Apr 2025 11:37:20 +1000",
        "category": "entertainment",
        "authors": [
            "Daniel Bates",
            "Victoria Ward"
        ],
        "text": "Meghan, the Duchess of Sussex, has defended her passion for edible flower sprinkles, joking that she had been portrayed like a “little fairy tossing them around all the time”.\n\nIntroduced as “the founder of As Ever”, the duchess appeared on stage at the fifth annual Time100 summit in New York, ahead of a 15-minute session called “Her Journey”.\n\nMeghan said she was the “happiest that I’ve ever been”, thanks to the support of Prince Harry, who was in the live audience, and her “joyful” children.\n\nMeghan, the Duchess of Sussex, on her Netflix show With Love, Meghan. Credit: Netflix\n\nShe said: “Of all the things that happened, I never would have imagined at this point I’d be so happy and free, and I really do.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/coalition-denies-backflipping-on-plans-to-scrap-labors-ev-tax-break-20250424-p5ltyi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Coalition denies backflipping on plans to scrap Labor's EV tax break",
        "publish_date": "Thu, 24 Apr 2025 11:34:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Coalition denies backflipping on plans to scrap Labor's EV tax break\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/albo-can-t-steal-our-day-the-couples-saying-i-do-on-election-day-20250417-p5lsmt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Albo can’t steal our day’: The couples saying ‘I do’ on election day",
        "publish_date": "Thu, 24 Apr 2025 11:30:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Politics was the last thing on Catherine Buck and Joel Morgan’s minds when they locked in May 3 as their wedding date just over a year ago. They had found the perfect venue in Sorrento on Port Phillip Bay near Melbourne, and were excited about their autumn nuptials.\n\nBut just over a month before their ceremony, their big day’s date was overshadowed. After hours upon hours of planning and a few hefty non-refundable deposits, there was no way around it – the couple would announce their commitment to each other while the nation committed to its leaders.\n\nHaving a wedding the same day as the federal election? Catherine Buck and Joel Morgan aren’t worried. Credit: Simon Schluter\n\nFor some, sharing the date with the federal election could have spelt disaster. Can family members put political disagreements aside? Will guests be distracted? Can everyone vote and make it to the wedding on time? But for Buck and Morgan, who are more or less on the same political page, it was nothing to panic about.\n\n“The election is obviously very important, but we’re only getting married once,” Buck says. “So, it will be on our minds, but we won’t be completely obsessed with it.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-critics-came-for-collingwood-but-this-might-be-their-biggest-weapon-20250420-p5lt08.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The critics came for Collingwood, but this might be their biggest weapon",
        "publish_date": "Thu, 24 Apr 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [],
        "text": "You can’t find a metric for this on the stat sheet, but you can see it in their ability to control tempo and momentum. It might be how their players pull back off the mark to give the game time to reset ahead, or how, when they spot they have their opponents outnumbered up forward, they flick the switch with speed and a running handball-receive. This Collingwood side has been elite at closing games out over the past two or three seasons. But now, that same situational clarity is showing up across four quarters. They’re making the right decisions consistently – a skill that only comes with experience. Forward line cohesion Every player in Collingwood’s forward line is a threat. They work for each other. There’s chemistry, a sixth sense about the way they move together. Everyone knows their role and plays it. No one is chasing stats – they’re chasing moments.\n\nBrody Mihocek, Tim Membrey and Jamie Elliott are helping form a deadly Collingwood forward line. Credit: AFL Photos via Getty Images The Pies’ tall forwards – Brody Mihocek, Dan McStay, Tim Membrey and Mason Cox – are all giving strong aerial contests, working in tandem. One offers a link-up, one provides depth. And the key? Any one of them can kick two or three goals on a given day. There aren’t many forward lines where you can say that. It makes it difficult for opponents to decide who their best defender should go to. Then there’s the smalls. The speed and pressure they bring is elite. Take Bobby Hill’s rundown tackle on Dayne Zorko in the third quarter last week – textbook desperation. It led to a Nick Daicos goal and summed Collingwood’s intent. And when a Collingwood player gets the ball in a tough spot, they don’t blaze away. They centre it. It’s unselfish, smart footy.\n\nTough on the inside, polish on the outside Yes, contested possession still matters, but our game has a new layer now – it’s about execution and efficiency. You need players who are not only tough inside but also clean and sharp on the outside. Loading Melbourne and Carlton are among the teams who’ve so far been great on the inside but lacked the polish to connect going forward. The Pies? They’re cutting teams up on turnover. Their transitional offence hurts opponents who can’t reset quickly enough. They create chains through the corridor, knowing exactly where the numbers are. One kick or handball inside can open up the overlap, and suddenly, they have a wave of players surging forward. They have outscored opponents from that source in all five wins. It’s a key number that has a strong correlation to premiership success. The Magpies rank third now (+18.2 points).\n\nTheir clearance work and selfless set plays are all about getting each other free – constantly shifting the focus and keeping the opposition guessing. It makes it tough for rival midfields to lock in on a single threat because the danger can come from anyone at any moment – much like their forward line. And that’s not just when they attack; the same workrate flows into Collingwood’s defence. When their defenders push high, they trap teams in, shrink the ground, and deny their opponents ball movement. It’s why they’re dominating time in forward-half differential – winning that stat every week and ranking second in the competition overall. Where teams fall down is when their lines lose connection – when their backs hold too deep under pressure and midfielders surge ahead. That leaves dangerous gaps. But the Pies? They’re staying connected. It’s why their turnover defence has been so strong. Their shape holds up. That’s structure. That’s system.\n\nDefensive game Experience matters here too. After conceding 104 points to GWS in the opening round, Collingwood have since restricted the Power, Dogs, Blues, Swans, and Lions – all finalists last season – to 78\n\npoints or fewer. They kept Brisbane to their slowest ball-movement game since 2019 and just 37 inside 50s. Ruckman Darcy Cameron is an asset to Collingwood’s defence with his desire to push back and take intercept marks. Credit: Getty Images They’re playing the pressure and territory game, and it’s working. Early in the season, the Pies’ midfielders and wingers were getting sucked into the contest too often, leaving the outside exposed. But now they’re holding their width.\n\nThere’s a discipline to the way they structure around the contest – players hunting in numbers, but with purpose. They close off outlets while still supporting the inside heat. Because they’re getting the balance right, they’re able to defend their own turnovers better, too. They’re not taking risks that leave them vulnerable. That’s experience showing again. The best part? It’s not just left to the defenders. Everyone’s committed to slowing the opposition down.\n\nLoading There’s trust – if one player presses, another will fill the gap behind. That kind of coverage takes organisation, awareness, and belief in the system. And then you’ve got Darcy Cameron. The best intercepting ruckman in the comp right now, he’s averaging 2.6 intercept marks per game and consistently dropping into the hole to shut down long kicks. Massive. You’ll often notice Collingwood’s off-ball small forwards pushing right up onto the opposite wing, creating a release for players such as Steele Sidebottom to slide back into the defensive 50m. It gives the backline extra support while also setting up a clean outlet for transition after a turnover or intercept.\n\nThe Daicos factor Nick Daicos is arguably the best player in the AFL at transitioning from inside a contest to outside. He’s tough to tag because he makes opposition teams pull apart their own structure to follow him. And he knows it. He moves himself around – half-back, forward line, midfield – just to shift the magnets and pull defenders out of their comfort zones. Nick Daicos is giving opponents headaches with his ability to get the ball in contests and burst away into open space. Credit: Getty Images Whoever is on him must have body contact on him at all stoppages. He’ll get the ball – that’s a given – but the damage comes when he slices through the congestion and delivers with precision.\n\nThen there’s his brother Josh. He holds his width perfectly on the wing, becoming a key metres-gained player. By five minutes into the second quarter last week against the Lions, he had over 330 metres gained. That’s massive in a territory-based game. The verdict Collingwood are experienced, well-drilled and fully locked in on the way the game is evolving. Their list profile, once seen as a potential weakness, has become their point of difference. They’ve got the system, the structure, and the smarts. Age won’t weary them. It might just carry them all the way again.\n\nA day of meaning There’s a deep sense of responsibility that comes with honouring the Anzac spirit. On Anzac Day, players aren’t just representing their club – they’re representing the fallen, their families, and every Australian who made sacrifices for the freedoms we enjoy today, including the joy of footy. You can feel the emotion in the air during the pre-game ceremonies – shoulders squared, arms linked, eyes ahead—as the anthem rings out and the weight of history settles in. Libby Birch’s great-grandfather James Donald Kennedy (top row, second from right] with his St Kilda teammates in 1927. Credit: Birch family This year, I sat down with my Nana over a quiet cup of tea to talk about her father—my great-grandfather – James Donald Kennedy. Hearing her memories reminded me how deeply\n\nANZAC Day echoes through Australian families. But it also left me wondering: how can the women’s game honour that legacy too?\n\nAIF Sergeant James Donald Kennedy, at 34 years old while serving in World War II after a stint earlier in his life at St Kilda Football Club. Credit: Birch family Born in 1907, James was a talented young footballer who played for St Kilda in the 1920s. He had dreams, drive, and a passion for the game. But when World War II began, like so many others, his path changed. Though too old to be conscripted, he volunteered without hesitation. He was first stationed in Darwin before boarding a troop train to Townsville, and then the SS Taroona to New Guinea. There, he served as a linesman on the front line – laying and repairing vital communication lines under fire. It was work that demanded immense bravery and resilience. Hearing his story filled me with pride, but also a sense of connection. Anzac Day isn’t just about honouring names in history books; it’s about remembering the people we come from. People like James Donald Kennedy, who didn’t seek glory, but stood up when it mattered most.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/shameless-editor-shreds-pm-in-front-of-him-20250424-p5ltya.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Shameless': Editor shreds PM in front of him",
        "publish_date": "Thu, 24 Apr 2025 11:11:56 +1000",
        "category": "finance",
        "authors": [],
        "text": "'Shameless': Editor shreds PM in front of him\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/how-the-dolphins-will-be-built-around-the-nrl-s-brightest-young-half-20250423-p5ltte.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How the Dolphins will be ‘built around’ the NRL’s brightest young half",
        "publish_date": "Thu, 24 Apr 2025 11:00:13 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Dolphins chief executive Terry Reader has declared his intent to make Isaiya Katoa a one-club player, as the side sets about avenging a horror start to the 2025 season.\n\nThe 21-year-old was the mastermind of his side’s shock demolition of the Melbourne Storm, coming up with three try assists and two try contributions, and registering 85 running metres and 430 kick metres, in Friday night’s 42-22 triumph.\n\nIsaiya Katoa in action for the Dolphins. Credit: NRL Photos\n\nKatoa is already contracted until the end of 2028, but Reader stressed he would remain the focal point of the Dolphins’ long-term planning – despite links between them and champion off-contract No.7 Daly Cherry-Evans.\n\n“He’s one of the most exciting young players in the game. We’ve signed him through to ’28 and our club is going to be built around Izzy,” Reader said.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/coalition-reveals-its-cuts-to-skilled-migration-humanitarian-intake/rg4r03dbb",
        "title": "Peter Dutton forced to clarify Coalition's migration cuts after frontbencher misstep",
        "publish_date": "Wed, 23 Apr 2025 23:50:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Opposition leader Peter Dutton has distanced himself from comments made by his immigration spokesperson Dan Tehan on Australia's skilled migration intake.\n\n\n\n\n\nTehan told ABC's Radio National that in order to reach its migration objectives, the Coalition would need to slash the permanent program from 185,000 to 150,000 — with the skilled migration stream to make up the bulk of these cuts.\n\n\n\n\n\nBut the current skills migration intake is set at 132,200 places for this financial year, a point that Dutton was questioned about during a press conference in Hobart on Thursday.\n\n\n\n\n\nDutton was asked whether he was, in fact, proposing an increase in migration.\n\n\n\n\n\n\"No, what we've said is that we cut migration by 25 per cent,\" he replied.\n\n\n\nBut Dutton admitted he hadn't seen Tehan's comments on immigration.\n\n\n\n\n\nTehan said the Coalition would cut Australia's intake of humanitarian visas to 12,000 and slash skilled migration, as it seeks to meet its target of lowering permanent migration by 25 per cent.\n\n\n\n\n\nHis comments came after Dutton confirmed on Monday the Coalition would not cut parent visas — capped at 8,500 places per year.\n\n\n\n\n\nTehan said on Thursday that partner visas, capped at 40,500 places per year, would not be affected either.\n\n\n\n\n\n\"So even though we brought in nearly a million migrants in those first two years [under Labor], we then asked and did the research as to how many of those one million were actually in the trades area, and it was less than 10,000,\" Tehan told ABC's RN program.\n\n\n\n\n\n\"Now we've said we want to prioritise those trades areas to complement our plumbers, our electricians, our builders, and we will focus on that.\"\n\n\n\n\n\nTehan said the migration program would continue at a rate of 150,000 places in the subsequent two years.\n\n\n\n\n\nHe said the Coalition would change the settings for other in-demand skill sets, including hospitality and aged care.\n\n\n\nTehan also confirmed the Coalition would slash Australia's temporary migrant intake by 100,000 places, primarily by reducing international student numbers.\n\n\n\n\n\n\"We'll have a review of the temporary graduate visa. We're going to tighten enforcement of visa rules to minimise the scope for abuse at visa hopping,\" he said.\n\n\n\n\n\nThe Coalition will reduce foreign student commencements by at least 30,000 fewer places than Labor's plan if elected in May.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/cost-of-living-secrets-how-to-ask-for-a-pay-rise/8p2bwbl61",
        "title": "Cost of Living Secrets: How to ask for a pay rise",
        "publish_date": "Wed, 23 Apr 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/who-is-the-national-party/xovhtawy0",
        "title": "Who is the National Party?",
        "publish_date": "Wed, 23 Apr 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe National Party of Australia.\n\n\n\n\n\nAlso known as the Nationals or the Nats.\n\n\n\n\n\nThey're known for their big hats and focus on regional Australia.\n\n\n\n\n\nBut where did the Nationals come from? And who are they now?\n\n\n\n\n\nThe Nationals were originally known as the Country Party.\n\n\n\n\n\nWhen they were formed in 1920 they largely set out to be the voice for rural Australians, particularly given the importance, at the time, of farming to the Australian economy.\n\n\n\n\n\n\"The idea was that it was only those people who represented those country communities who would be part of the party.\"\n\n\n\n\n\nThat's the National President of the National Party, Kay Hull.\n\n\n\n\n\nShe says the focus of the party hasn't changed much over the years.\n\n\n\n\n\n\"The mandate for the party has always been to deliver security and opportunity, prosperity, equity for rural, regional, and remote Australians and to have their value recognized and respected for the contribution that we make. It sits probably more conservative in its values and its principles.\"\n\n\n\n\n\nSo the party is focused on regional Australia.\n\n\n\n\n\nSenior Lecturer at the Australian National University Dr Jill Sheppard says that includes regional businesses.\n\n\n\n\n\n\"They want protection for certain industries, they do not want free trade for the most part, they've had to really been dragged kicking and screaming to free trade agreements or to the removal of tariffs. But also, the Nationals don't like trade unions, and that's where they fundamentally diverge from the Labor Party. So the Nationals support agricultural industries, but they really support the people who control those industries, the large scale farmers.\"\n\n\n\n\n\nMs Hull says extends to improving the overall communities.\n\n\n\n\n\n\"To be competitive in the global environment, you need a strong, resilient, robust, well resourced, rural, regional, remote communities, right? It cannot happen without that happening. So our objective is to ensure that we have the competitive edge in communications, transport, road infrastructure, bridge infrastructure, etc, okay. It's also important that you need to have people that will settle there. They will not come unless you have quality education opportunities. You have quality access and affordable access to health and general services, community services, strong and safe communities.\"\n\n\n\n\n\nWhilst the National Party has never formed government on its own, they have been a part of a lot of governments.\n\n\n\n\n\nThe first coalition was with the now non-existent Nationalist Party in 1922, and they have entered similar deals since then.\n\n\n\n\n\nIn 1946 the Nationals teamed up with the Liberal Party, a partnership which continues to this day. This is why you often hear the pair being referred to as the coalition.\n\n\n\n\n\nBy being in a coalition, the two parties have an agreement on how they work together.\n\n\n\n\n\nThe leader of the party with more seats gets to be the overall leader, whilst the leader of the smaller party is the deputy leader.\n\n\n\n\n\nA mix of members from both parties get to be ministers.\n\n\n\n\n\nIn the case of the federal Liberal-National coalition, it's always the been the Liberal party with more seats, with Liberal party leaders as Prime Ministers.\n\n\n\n\n\nDr Sheppard says the National Party's achievements are sometimes quiet.\n\n\n\n\n\n\"When the Nationals have had the most power in Australian politics, it's been by working closely with a Liberal Prime Minister. The Nationals will never form government in their own right. They're just not big enough. So they work in coalition with the Liberal Party, and they help them to form government when without the Nationals, Labor Party would form government much more than they do. It doesn't mean that the relationship between the Liberals and the Nationals is very happy, because apart from both being vaguely pro business, one party really likes free trade and the other party hates free trade. And when that's a big part of your platform, that can be really difficult. So I think the Nationals key achievements have been in holding the Liberal Party back on what they would do otherwise. And that's not always visible.\"\n\n\n\n\n\nBy working together as a coalition, the two parties can attract a broader voter base.\n\n\n\n\n\nThe Liberal Party can focus on big city issues, and the National Party can almost exclusively champion for regional ones.\n\n\n\n\n\nBut Dr Sheppard says there's still a few local contests.\n\n\n\n\n\n\"They do still contest some seats. There's about five seats across the country where Liberal Party and National Party candidates run against each other. There's no reason why they should. It's strategically very bad. But they continue to do that, mostly because deep down, they really don't like each other. And so if they can have a little pressure valve, you know, a few contests around the country where they can compete head to head, that seems to be all they need at the moment to, you know, be sort of happy partners, happy colleagues 99% of the time.\"\n\n\n\n\n\nCurrently, David Littleproud is National's leader which makes him deputy leader of the coalition.\n\n\n\n\n\nIf the coalition wins the election he will be the Deputy Prime Minister of Australia.\n\n\n\n\n\nAnother notable face is Barnaby Joyce, who is still in Parliament and has led the party twice.\n\n\n\n\n\nThey've merged with the Liberal Party in Queensland and the Northern Territory, known as the LNP and the Country Liberal Party respectively.\n\n\n\n\n\nThe election, the Nationals are running on policies aimed at improving regional Australia, including:\n\n\n\n\n\n- Decreasing energy costs by increasing gas supply\n\n\n\n\n\n- Building more homes in the regions\n\n\n\n\n\n- Overturning the ban on live sheep exports\n\n\n\n\n\n- And improving the way farmers are treated by big businesses like supermarkets.\n\n\n\n\n\nSo how does the party stack up to its original manifesto?\n\n\n\n\n\nPretty well, says Dr Sheppard.\n\n\n\n\n\n\"The Nationals have stayed really true to their original idea of what they wanted their party to be. Now there'd be people in the Nationals who disagree with me vigorously on that, but in terms of just having a clear sense of purpose, these are the industries that we represent, they have not changed it a bit.\"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/gold-rush-why-are-people-flocking-to-this-useless-commodity/g2put3goy",
        "title": "Gold rush: Why are people flocking to this 'useless' commodity?",
        "publish_date": "Wed, 23 Apr 2025 19:42:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "The price of gold has surged to its highest value on record amid volatile stock markets and global economic uncertainty, as investors move their money to what they hope is a \"safe haven\".\n\n\n\n\n\nThe price of gold per ounce rose to US$3,500 ($5,477) on Tuesday, the highest value it has reached since records began. It later dropped back to around US$3,280 ($5,165).\n\n\n\n\n\nMeanwhile, the International Monetary Fund is predicting global economic growth will fall by 0.5 per cent , as the economies of the United States and China weaken.\n\n\n\n\n\nDr Pramod Kumar Yadav, a lecturer in finance at the University of Sydney Business School, earlier told SBS News the recent stock market crashes are due to the uncertainty that economic measures like trade tariffs can create, making stock markets risky for investors.\n\n\n\n\n\n\"There are also going to be people moving money from risky assets like the stock market to safer assets like cash, gold, and government bonds,\" he said.\n\n\n\nREAD MORE Why the IMF is slashing Australia's economic growth forecast\n\nGold has historically been considered a reliable commodity for investors, immune to stock market crashes and government decisions.\n\n\n\nDoes gold have any real value?\n\nHonorary professor Andrew Stoeckel, an economist from the Australian National University, told SBS News gold has no \"intrinsic\" economic value.\n\n\n\n\n\n\"How would having a bucket of gold on a desert island help you? It would be useless, you can't eat it, you can't plant crops with it. But people like shiny stuff,\" he said.\n\n\n\nSource: SBS News Much like the stock market, which is perceived as a value rather than physical cash, there is a belief that gold is scarce and precious, which gives it a valued status in society, Stoeckel said.\n\n\n\n\n\nHe likened gold to silver, saying that while they are both precious metals, silver has physical applications and uses, such as being a good conductor, which gold lacks.\n\n\n\n\n\nHe said the appeal of gold over the centuries is that it is a physical, tangible object that people believe governments and institutions will continue to \"honour and value\".\n\n\n\nHow would having a bucket of gold on a desert island help you? It would be useless, you can't eat it, you can't plant crops with it. But people like shiny stuff. Andrew Stoeckel, Australian National University\n\n\"There have been periods of high uncertainty, and people have flocked to gold, but again, gold has no intrinsic value. Just the belief that it does,\" Stoeckel said.\n\n\n\n\n\nPeter Swan, a professor of finance from the University of NSW Business School, told SBS News gold, like any commodity, is based on supply and demand, and that the supply of gold is unlikely to spike.\n\n\n\n\n\n\"Unless another explorer like Columbus comes across a big bucket of gold in the Americas, we're unlikely to see a change,\" he said.\n\n\n\nLISTEN TO Gold returns to a record as investors digest tariff outlook SBS News 11/04/2025 10:52 Play\n\nHow does investing in gold work?\n\nSwan said investing in gold is no different from other forms of investment, as you still get a return for your money.\n\n\n\n\n\n\"They all exist on a spectrum and have different proportions of cash or earnings in returns. Shares have a dividend yield of around 4 or 5 per cent, while investing in housing gives a lower yield of around 2 per cent,\" he said.\n\n\n\n\n\n\"Gold has zero cash component because the expected appreciation is far higher.\"\n\n\n\nThere are several ways to invest in gold, including buying physical gold, such as jewellery or bullion, directly from the Royal Australian Mint.\n\n\n\n\n\nYou can also buy shares in a gold exchange-traded fund, where gold is bought on behalf of shareholders.\n\n\n\nWould the gold prices continue to rise?\n\nSwan predicted the popularity of gold and its value would continue to rise.\n\n\n\n\n\n\"The beauty of gold is that the supply is relatively fixed, and that's going to continue, and political and economic uncertainty are probably going to get a lot worse. So we're going to see the price of gold, I think, rise even higher,\" he said.\n\n\n\n\n\nHe pointed to US President Donald Trump's \"rocky\" relationship with Federal Reserve chair Jerome Powell as just one reason investors were losing faith in the stock market.\n\n\n\n\n\nThere could be more economic \"chaos\" when Trump's 90-day pause on tariffs is over, Swan said.\n\n\n\n\n\n\"There may be a resurrection of these crazy tariff arrangements, which would kill the global economy, in which case gold, of course, would be seen as a very safe haven in such turbulent times.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-does-boosting-australias-defence-spending-to-3-per-cent-look-like/ja6gsd1l3",
        "title": "What does boosting Australia's defence spending to 3 per cent look like?",
        "publish_date": "Wed, 23 Apr 2025 08:28:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Coalition has unveiled plans to boost Australia's defence spending to 3 per cent of gross domestic product (GDP).\n\n\n\n\n\nIt says it will spend an extra $21 billion on defence over the next five years , which would see expenditure increase to 2.5 per cent of GDP by 2029/30 — reaching an estimated $87.5 billion. Over the next decade it will boost this even further.\n\n\n\n\n\nIn contrast, according to the March federal budget, Labor's spending is estimated to be $79.1 billion by 2029/30, making up 2.26 per cent of GDP.\n\n\n\n\n\nAustralia's current defence spending is roughly 2 per cent of GDP, or $56 billion in 2024/25.\n\n\n\n\n\nLabor plans to grow this to 2.35 per cent — or a projected $100 billion by 2034 — according to its national defence strategy .\n\n\n\n\n\nThe Coalition says it will grow spending more quickly. It plans to reach 2.5 per cent by 2029/30, reaching 3 per cent by 2034/35.\n\n\n\nHow much is 3 per cent of GDP?\n\nGDP, which measures the value of goods and services produced within a country's borders, can change every year, but the March budget predicted Australia's GDP would grow to $4.5 trillion in the next decade.\n\n\n\n\n\nBased on these estimates, the Coalition would spend roughly $135 billion on defence by 2034-35. Its spending is estimated to be $30 billion more than Labor's in that financial year, according to the current trajectory.\n\n\n\n\n\nExperts warn against using GDP as a measure for predicting spending, given it goes up and down depending on whether the economy is moving through periods of growth or recession.\n\n\n\n\n\nBut the expected spending on defence would be slightly higher than the amount spent on health this year ($124 billion), and double the $54 billion the government spends on education.\n\n\n\nWhere will the additional funding go?\n\nIt remains unclear exactly where the extra defence spending will go.\n\n\n\n\n\nOpposition leader Peter Dutton said drones, guided weapons, munitions and cyber capabilities are all on the Coalition's wish list.\n\n\n\n\n\n\"But we're not announcing procurement contracts from Opposition, which would be something we're not able to do without that advice. But they're the capabilities that we need to invest in,\" he told reporters in Perth on Wednesday.\n\n\n\n\n\nWhat is certain, is that $3 billion will be spent on 28 extra fighter jets, increasing Australia's fleet of F-35s from 72 to 100.\n\n\n\n\n\nHowever that leaves an additional $18 billion in spending over the next five years.\n\n\n\n\n\nThe Coalition could afford roughly another 125 guided multiple launch rocket systems — valued at $145 million each.\n\n\n\n\n\nOr they could acquire three to four extra Virginia class submarines, costing $5 billion each, according to the Australian Naval Institute.\n\n\n\n'We need to keep our country safe'\n\nDutton said keeping Australians safe was the \"single most important task for the Australian government\" as he made the announcement.\n\n\n\n\n\n\"It will be an important expenditure, because we need to keep our country safe, and if we're to preserve peace and stability in our region, if we're to be a good ally with our partners, then Australia needs to invest in defence,\" he said.\n\n\n\nREAD MORE The billion-dollar problem that neither Albanese nor Dutton wants to become a big issue\n\nJennifer Parker, defence expert at the ANU's National Security College, said an increase in funding is important amid growing global uncertainty.\n\n\n\n\n\n\"It's not just about preparing us for conflict, but a stronger defence force means the chances of conflict are less likely,\" she told SBS News.\n\n\n\n\n\nUS President Donald Trump has called for NATO members to lift their defence budgets to 3 per cent. When quizzed by reporters, Dutton refrained from stating this informed the Coalition's policy.\n\n\n\nDefence Minister Richard Marles is critical of the Coalition's promised defence splurge, querying where the funding will come from. Source: AAP / Tertius Pickard Defence minister Richard Marles accused the Opposition of \"plucking a number out of thin air\".\n\n\n\n\n\nThe Coalition hasn't revealed exactly how it will pay for the ongoing increase but pointed to $17.1 billion in savings over forward estimates from repealing Labor's tax cuts, if elected.\n\n\n\n\n\nAdditional reporting by Rania Yallop.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/us-funds-flowing-to-australian-markets/ips0ybi96",
        "title": "US funds flowing to Australian markets",
        "publish_date": "Wed, 23 Apr 2025 07:40:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "And you can find more On the Money podcasts by subscribing to On the Money\n\n, or wherever you get your podcasts.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australian-catholics-preparing-for-weekend-services-to-honour-pope-francis/7q2p05lsl",
        "title": "Australian Catholics preparing for weekend services to honour Pope Francis",
        "publish_date": "Wed, 23 Apr 2025 06:00:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/bears-to-be-reborn-in-western-australia-20250424-p5ltvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bears to be reborn in Western Australia",
        "publish_date": "Thu, 24 Apr 2025 11:45:36 +1000",
        "category": "finance",
        "authors": [],
        "text": "Bears to be reborn in Western Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/surfing-s-great-survivor-sally-fitzgibbons-upsets-world-no-1-in-bells-beach-boilover-20250424-p5ltxb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Surfing’s great survivor Sally Fitzgibbons upsets world No.1 in Bells Beach boilover",
        "publish_date": "Thu, 24 Apr 2025 11:45:13 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "Four underwhelming returns to start 2025 had her ranked 15th and staring down the same fate before she was drawn to face 19-year-old Simmers at Bells Beach on Thursday.\n\nFor the past three seasons, Fitzgibbons’ 12th and 13th place finishes have consigned her to the WSL’s gruelling requalification process in far-flung places around the world.\n\nSally Fitzgibbons with a young local surfer before keeping her season alive at the Bells Beach Pro. Credit: World Surf League via Getty Images\n\nTwo-time Bells champion Fitzgibbons has been the most recognisable victim of the WSL’s mid-season cut since it was introduced in 2022 , which reduces the permanent women’s competition from 18 competitors to 10, and the men’s from 36 to 22, at the world tour’s halfway point.\n\nAustralian surfing’s great survivor Sally Fitzgibbons has kept her season alive by beating world No.1 Caity Simmers in a Bells Beach Pro boilover.\n\nFitzgibbons’ “home ground” advantage against the reigning world and Bells champion instead triggered a 12.73 to 10.10 upset and quarter-final passage for the oldest surfer on tour.\n\nThe 34-year-old was overcome with emotion when the hooter sounded.\n\n“I’ve already done a few laps of the world this year, and not been able to score any real points or get any traction in the [rankings], or have my best surfing come out,” Fitzgibbons said.\n\n“That’s a lot of 40-hour trips just sitting in a plane seat just thinking about the whole scenario, and you’re planning your days and whole life around those 30-minute heats.\n\n“It all compounds and becomes so meaningful, so that’s where the emotion came from. It’s been a tough run of results, but I couldn’t be any more excited. I’m so pumped for the challenge of keeping myself going with the cut. It’s such a heavy scenario – you can really go from zero to hero.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/brisbane-eating-out/is-this-sanger-brisbane-s-best-hangover-cure-20250424-p5lty8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is this sanger Brisbane’s best hangover cure?",
        "publish_date": "Thu, 24 Apr 2025 11:44:37 +1000",
        "category": "finance",
        "authors": [
            "Matt Shea"
        ],
        "text": "Advertisement\n\nEating outSandwich Watch Is this sanger Brisbane’s best hangover cure? Lashings of Bangalow Sweet Pork ham and a to-die-for bechamel sauce make this one to seek out. Matt Shea April 24, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThere’s a croque craze going on. No, not the ugly-fashionable footwear. We’re talking the ugly-delicious sandwich. And Mitch & Antler’s croque madame is particularly ugly, particularly delicious. Hence why co-owner Chewie Choo wonders aloud if his sandwich started the trend. Mitch & Antler’s croque madame. Morgan Roberts “After we launched it, I think it was about three or four months later that I seemed to start noticing them everywhere,” he says. Perhaps. Perhaps not. Either way, Mitch & Antler’s variation on the classic French toasted sandwich proved so popular after the cafe’s opening in 2023 that Choo and his brother and co-owner Tze-Huei Choo then built an entire second venue, James & Antler (now sold), around the concept.\n\nAdvertisement\n\nThe creation of Mitch & Antler Full-service cafes are hard in 2025. They’re expensive to staff and run, and if you’re going to pass some of that on to the diner, you need to make it worth their while. “We wanted to do something different to the traditional breakfast menu items,” Chewie says. “Everyone can make, like, an eggs Benedict.” Related Article Flash new supper club hides in plain sight on James Street So, Mitch & Antler’s menu is full of interesting variations on the classics, or the kind of thing you might’ve glimpsed on Instagram. Omurice with wagyu mince and edamame. Korokke with sautéed kale and poached eggs. Brown butter croffles. That kind of thing.\n\nAdvertisement\n\nBut the star item for the Mitchelton cafe since opening is its croque madame. Despite all it has going on, the croque madame is still surprisingly simple to eat. Morgan Roberts Mitch & Antler’s croque madame You might think the croque madame (basically, a fancy French toastie) is the kind of thing you could make at home. And you’re probably right, but according to the Choos it would be messy and expensive. “Everyone can do a croque but no one can do the leek bechamel we do,” Tze-Huei says. “And I don’t think most people are crazy enough to buy the amount of manchego cheese that we tend to shave over the top.”\n\nAdvertisement\n\nWhat else goes into this thing? Two slices of Cordelia sourdough baked to Mitch & Antler’s specs, lashings of thick-cut smoked ham from Bangalow Sweet Pork, and Egmont cheese. Then, on top, goes the seeded mustard and leek bechamel, a fried egg, chives and the manchego – the whole thing given a dash of flame before it hits the plate. Introducing Brisbane’s best hangover cure Mitch & Antler buzzes with punters on weekends. Morgan Roberts On the plate, the croque is a fabulous slice (or two slices) of organised mess. You might be tempted to tackle this thing with a knife and fork. Don’t bother.\n\nAdvertisement\n\nDespite everything going on with this sandwich, it holds together well and the toasted Cordelia sourdough is soft on the inside, meaning you avoid any mouth-shreddings. It would almost be a one-hander but for the wibbly-wobbly fried egg on top. Our favourite play is to order it takeaway to enjoy on a park bench somewhere nearby. Mitch & Antler co-owner Tze-Huei Choo. Morgan Roberts There’s a lot to love about this sandwich – the perfectly specced bread, the smokey goodness of the chunky ham, that gooey egg. Still, it’s the tangy bechamel that makes it, with the sweetness and texture of the leek and acidity of the mustard. “It’s a bit like tomato adding acidity to a toasted sandwich,” Tze-Huei says. “That’s the mustard. Then, the leek adds that sweetness.”\n\nAdvertisement\n\nIt’s a sizeable sanger, but you’ll still destroy this thing within a few minutes, the only signs of its previous existence the yolk and bechamel left on your fingers. Where to get it Mitch & Antler’s croque madame is $21. You can get one at 62 Suez Street in Mitchelton. We recommend hitting it on the weekend to make the most of the croque’s truly magical hangover-curing properties.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/set-up-to-fail-levi-s-world-cup-bid-in-jeopardy-as-agent-raises-issue-of-animosity-among-players-20250424-p5ltwp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Set up to fail’: Levi’s World Cup bid in jeopardy as agent raises issue of ‘animosity’ among players",
        "publish_date": "Thu, 24 Apr 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Australian sevens star Maddison Levi is being “set up to fail” and her switch to play XVs would only fuel further animosity if she entered Wallaroos camp ahead of the Women’s Rugby World Cup.\n\nThat’s the view of Levi’s agent and former Wallaby Mat Rogers, who has expressed concerns about his client’s mooted switch from sevens to XVs this year.\n\nThe Wallaroos are planning for Levi to make herself available next month to play Tests before the World Cup, starting in August, but might need to re-evaluate after Rogers’ latest remarks.\n\nRogers, a dual international for Australia in league and union, said he had serious reservations about Levi being parachuted into the Wallaroos program with limited preparation or game time in the 15-a-side format.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/i-love-my-flower-sprinkles-even-though-they-were-mocked-meghan-says-20250424-p5ltvc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I love my flower sprinkles even though they were mocked, Meghan says",
        "publish_date": "Thu, 24 Apr 2025 11:37:20 +1000",
        "category": "entertainment",
        "authors": [
            "Daniel Bates",
            "Victoria Ward"
        ],
        "text": "Meghan, the Duchess of Sussex, has defended her passion for edible flower sprinkles, joking that she had been portrayed like a “little fairy tossing them around all the time”.\n\nIntroduced as “the founder of As Ever”, the duchess appeared on stage at the fifth annual Time100 summit in New York, ahead of a 15-minute session called “Her Journey”.\n\nMeghan said she was the “happiest that I’ve ever been”, thanks to the support of Prince Harry, who was in the live audience, and her “joyful” children.\n\nMeghan, the Duchess of Sussex, on her Netflix show With Love, Meghan. Credit: Netflix\n\nShe said: “Of all the things that happened, I never would have imagined at this point I’d be so happy and free, and I really do.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/coalition-denies-backflipping-on-plans-to-scrap-labors-ev-tax-break-20250424-p5ltyi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Coalition denies backflipping on plans to scrap Labor's EV tax break",
        "publish_date": "Thu, 24 Apr 2025 11:34:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Coalition denies backflipping on plans to scrap Labor's EV tax break\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/subscriber-exclusive-discount-good-food-events-20231101-p5ego1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Subscriber exclusive discount: Good Food Events",
        "publish_date": "Thu, 24 Apr 2025 11:31:23 +1000",
        "category": "finance",
        "authors": [],
        "text": "An event for food lovers, home cooks of all levels looking for inspo to elevate their midweek meals at home, and those who appreciate a long lunch done right. Held on the weekend of Mother’s Day, you are sure to secure brownie points with mum or any loved one by treating them to a memorable long lunch, because nothing says “I appreciate you” like delicious food, fine wine and great company.\n\nCelebrity cook Justine Schofield will be at the helm, curating a menu that embodies relaxed elevated food with a nod to contemporary mid-week-meal culture. While Justine is the Director of Food, MasterChef alumni and Melbourne local Conor Curran is the Director of Vibes. Setting the energy and tone of the lunch, Conor will meet and greet guests, create a bespoke cocktail, and co-host Justine’s Q&A with Good Food’s Melbourne eating out and restaurant editor, Emma Breheny.\n\nPlus! There will be many prizes to be won throughout the afternoon, including Good Food Events gift vouchers, luxe picnic sets featuring Justine Schofield’s new cookbook Cook Ahead or a double pass to Alba Thermal Springs, in Mornington Peninsula.\n\n“Deli Lane is all about embracing food that feels nostalgic yet fresh – bringing people together over familiar flavours with a modern twist. Think laid-back, long-table dining but with a touch of refined playfulness.” - Justine Schofield\n\nWhen: Saturday, 10 May 2025, 12pm - 3pm\n\nWhere: Canvas House, South Melbourne\n\nPrice: $139pp\n\nTicket Inclusions: A three-course meal with shared entrées and mains, individual plated dessert, curated cocktail on arrival followed by matched wine pairings.\n\nSubs offer: 20% off to the first 10 subscribers to use the code DELILANEAGESUBS when purchasing tickets here*\n\n*Terms and Conditions: This 20% discount is available to Age digital and print subscribers with 2+ days of home delivery. This offer is only valid for tickets to Deli Lane presented by Birds Eye Deli when using the code ‘DELILANEAGESUBS’ through the link provided on this page. The discount is only available for the first 10 subscribers to redeem the offer. The offer must be redeemed online and cannot be redeemed for cash.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/albo-can-t-steal-our-day-the-couples-saying-i-do-on-election-day-20250417-p5lsmt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Albo can’t steal our day’: The couples saying ‘I do’ on election day",
        "publish_date": "Thu, 24 Apr 2025 11:30:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Politics was the last thing on Catherine Buck and Joel Morgan’s minds when they locked in May 3 as their wedding date just over a year ago. They had found the perfect venue in Sorrento on Port Phillip Bay near Melbourne, and were excited about their autumn nuptials.\n\nBut just over a month before their ceremony, their big day’s date was overshadowed. After hours upon hours of planning and a few hefty non-refundable deposits, there was no way around it – the couple would announce their commitment to each other while the nation committed to its leaders.\n\nHaving a wedding the same day as the federal election? Catherine Buck and Joel Morgan aren’t worried. Credit: Simon Schluter\n\nFor some, sharing the date with the federal election could have spelt disaster. Can family members put political disagreements aside? Will guests be distracted? Can everyone vote and make it to the wedding on time? But for Buck and Morgan, who are more or less on the same political page, it was nothing to panic about.\n\n“The election is obviously very important, but we’re only getting married once,” Buck says. “So, it will be on our minds, but we won’t be completely obsessed with it.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-critics-came-for-collingwood-but-this-might-be-their-biggest-weapon-20250420-p5lt08.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The critics came for Collingwood, but this might be their biggest weapon",
        "publish_date": "Thu, 24 Apr 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [],
        "text": "You can’t find a metric for this on the stat sheet, but you can see it in their ability to control tempo and momentum. It might be how their players pull back off the mark to give the game time to reset ahead, or how, when they spot they have their opponents outnumbered up forward, they flick the switch with speed and a running handball-receive. This Collingwood side has been elite at closing games out over the past two or three seasons. But now, that same situational clarity is showing up across four quarters. They’re making the right decisions consistently – a skill that only comes with experience. Forward line cohesion Every player in Collingwood’s forward line is a threat. They work for each other. There’s chemistry, a sixth sense about the way they move together. Everyone knows their role and plays it. No one is chasing stats – they’re chasing moments.\n\nBrody Mihocek, Tim Membrey and Jamie Elliott are helping form a deadly Collingwood forward line. Credit: AFL Photos via Getty Images The Pies’ tall forwards – Brody Mihocek, Dan McStay, Tim Membrey and Mason Cox – are all giving strong aerial contests, working in tandem. One offers a link-up, one provides depth. And the key? Any one of them can kick two or three goals on a given day. There aren’t many forward lines where you can say that. It makes it difficult for opponents to decide who their best defender should go to. Then there’s the smalls. The speed and pressure they bring is elite. Take Bobby Hill’s rundown tackle on Dayne Zorko in the third quarter last week – textbook desperation. It led to a Nick Daicos goal and summed Collingwood’s intent. And when a Collingwood player gets the ball in a tough spot, they don’t blaze away. They centre it. It’s unselfish, smart footy.\n\nTough on the inside, polish on the outside Yes, contested possession still matters, but our game has a new layer now – it’s about execution and efficiency. You need players who are not only tough inside but also clean and sharp on the outside. Loading Melbourne and Carlton are among the teams who’ve so far been great on the inside but lacked the polish to connect going forward. The Pies? They’re cutting teams up on turnover. Their transitional offence hurts opponents who can’t reset quickly enough. They create chains through the corridor, knowing exactly where the numbers are. One kick or handball inside can open up the overlap, and suddenly, they have a wave of players surging forward. They have outscored opponents from that source in all five wins. It’s a key number that has a strong correlation to premiership success. The Magpies rank third now (+18.2 points).\n\nTheir clearance work and selfless set plays are all about getting each other free – constantly shifting the focus and keeping the opposition guessing. It makes it tough for rival midfields to lock in on a single threat because the danger can come from anyone at any moment – much like their forward line. And that’s not just when they attack; the same workrate flows into Collingwood’s defence. When their defenders push high, they trap teams in, shrink the ground, and deny their opponents ball movement. It’s why they’re dominating time in forward-half differential – winning that stat every week and ranking second in the competition overall. Where teams fall down is when their lines lose connection – when their backs hold too deep under pressure and midfielders surge ahead. That leaves dangerous gaps. But the Pies? They’re staying connected. It’s why their turnover defence has been so strong. Their shape holds up. That’s structure. That’s system.\n\nDefensive game Experience matters here too. After conceding 104 points to GWS in the opening round, Collingwood have since restricted the Power, Dogs, Blues, Swans, and Lions – all finalists last season – to 78\n\npoints or fewer. They kept Brisbane to their slowest ball-movement game since 2019 and just 37 inside 50s. Ruckman Darcy Cameron is an asset to Collingwood’s defence with his desire to push back and take intercept marks. Credit: Getty Images They’re playing the pressure and territory game, and it’s working. Early in the season, the Pies’ midfielders and wingers were getting sucked into the contest too often, leaving the outside exposed. But now they’re holding their width.\n\nThere’s a discipline to the way they structure around the contest – players hunting in numbers, but with purpose. They close off outlets while still supporting the inside heat. Because they’re getting the balance right, they’re able to defend their own turnovers better, too. They’re not taking risks that leave them vulnerable. That’s experience showing again. The best part? It’s not just left to the defenders. Everyone’s committed to slowing the opposition down.\n\nLoading There’s trust – if one player presses, another will fill the gap behind. That kind of coverage takes organisation, awareness, and belief in the system. And then you’ve got Darcy Cameron. The best intercepting ruckman in the comp right now, he’s averaging 2.6 intercept marks per game and consistently dropping into the hole to shut down long kicks. Massive. You’ll often notice Collingwood’s off-ball small forwards pushing right up onto the opposite wing, creating a release for players such as Steele Sidebottom to slide back into the defensive 50m. It gives the backline extra support while also setting up a clean outlet for transition after a turnover or intercept.\n\nThe Daicos factor Nick Daicos is arguably the best player in the AFL at transitioning from inside a contest to outside. He’s tough to tag because he makes opposition teams pull apart their own structure to follow him. And he knows it. He moves himself around – half-back, forward line, midfield – just to shift the magnets and pull defenders out of their comfort zones. Nick Daicos is giving opponents headaches with his ability to get the ball in contests and burst away into open space. Credit: Getty Images Whoever is on him must have body contact on him at all stoppages. He’ll get the ball – that’s a given – but the damage comes when he slices through the congestion and delivers with precision.\n\nThen there’s his brother Josh. He holds his width perfectly on the wing, becoming a key metres-gained player. By five minutes into the second quarter last week against the Lions, he had over 330 metres gained. That’s massive in a territory-based game. The verdict Collingwood are experienced, well-drilled and fully locked in on the way the game is evolving. Their list profile, once seen as a potential weakness, has become their point of difference. They’ve got the system, the structure, and the smarts. Age won’t weary them. It might just carry them all the way again.\n\nA day of meaning There’s a deep sense of responsibility that comes with honouring the Anzac spirit. On Anzac Day, players aren’t just representing their club – they’re representing the fallen, their families, and every Australian who made sacrifices for the freedoms we enjoy today, including the joy of footy. You can feel the emotion in the air during the pre-game ceremonies – shoulders squared, arms linked, eyes ahead—as the anthem rings out and the weight of history settles in. Libby Birch’s great-grandfather James Donald Kennedy (top row, second from right] with his St Kilda teammates in 1927. Credit: Birch family This year, I sat down with my Nana over a quiet cup of tea to talk about her father—my great-grandfather – James Donald Kennedy. Hearing her memories reminded me how deeply\n\nANZAC Day echoes through Australian families. But it also left me wondering: how can the women’s game honour that legacy too?\n\nAIF Sergeant James Donald Kennedy, at 34 years old while serving in World War II after a stint earlier in his life at St Kilda Football Club. Credit: Birch family Born in 1907, James was a talented young footballer who played for St Kilda in the 1920s. He had dreams, drive, and a passion for the game. But when World War II began, like so many others, his path changed. Though too old to be conscripted, he volunteered without hesitation. He was first stationed in Darwin before boarding a troop train to Townsville, and then the SS Taroona to New Guinea. There, he served as a linesman on the front line – laying and repairing vital communication lines under fire. It was work that demanded immense bravery and resilience. Hearing his story filled me with pride, but also a sense of connection. Anzac Day isn’t just about honouring names in history books; it’s about remembering the people we come from. People like James Donald Kennedy, who didn’t seek glory, but stood up when it mattered most.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-mums-warning-after-horror-camping-accident-leaves-daughter-with-severe-burns-215600391.html",
        "title": "Aussie mum's warning after horror camping accident leaves daughter with severe burns",
        "publish_date": "2025-04-23T21:56:00Z",
        "category": "finance",
        "authors": [],
        "text": "Aussie mum Ashlea Hodder has hit out at those who don't do one vital thing when they leave their campsites.\n\nAn Aussie mum is urging others to be mindful of the dangers of campfires after an Easter weekend camping trip ended in disaster for her family. Ashlea Hodder was packing up her campsite on Sunday after spending the long weekend with friends and family when she asked her children to look out for koalas while they packed up their area.\n\nA short time later, she heard her daughter Coral scream out — the seven-year-old had inadvertently stepped onto the remnants of another group's fire at Keelbottom Creek near Mingala, west of Townsville.\n\nThe little girl dropped to the ground in searing pain and in doing so, burned her hands as well. The youngster, whose birthday is next week, now faces a long road to recovery from her third-degree burns.\n\n\"We told the kids to go and explore and [my daughter] walked straight through the fire,\" Ashlea told Yahoo News. The mum raced to her aid and recalled the gut-wrenching feeling of finding her child \"screaming\" in pain.\n\nADVERTISEMENT\n\n\"I was so overwhelmed, I didn't know what to do,\" she said.\n\nThe family dropped everything and raced her to the nearest hospital, which was over an hour away. Coral suffered third-degree burns on her right foot and her fingers, and the family now has an anxious wait to see if she needs to have skin grafts.\n\nThe seven-year-old faces a long recovery after the painful injury. Source: Supplied\n\nCamping family say putting out fires is 'common sense'\n\nSeasoned camper Ashlea has hit out at the neighbouring campsite who \"left their fire\" still simmering.\n\n\"It's common sense to put out your fire,\" she told Yahoo News, adding that she's been left \"angry and upset\" at the ordeal. \"It could have happened to anyone, or it could have caused a bushfire.\"\n\nShe pointed out the campsite was \"right next\" to a creek and the water could have been used to put out the fire. \"My kids know not to touch or go anywhere near the fire,\" she said.\n\nADVERTISEMENT\n\nAshlea said Coral is in \"a lot of pain\" and the ordeal has been \"very traumatising\" for the young girl.\n\n\"She said she doesn't want to go camping again and has called herself stupid because she didn't look where she was going,\" the mum said. \"I've told her that it's not her fault. It could have happened to anyone.\"\n\nWhile Ashlea concedes her daughter was barefoot at the time, she believes her children deserve the opportunity to \"be kids and get dirty\".\n\n\"Just make sure you put out your fires with water, don’t stomp them out or cover them with sand, take extra water with you because you never know what’s going to happen,\" she urged other campers.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]