[
    {
        "url": "https://www.9news.com.au/national/australia-free-solar-power-solar-saver/0e4e34e2-2537-4ebd-86d0-0e461c44f94f",
        "title": "Australian households to get free electricity for three hours a day",
        "publish_date": "Mon, 03 Nov 2025 23:22:28 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Australians will get three hours of free solar power per day, even if they don't have solar panels, the Albanese government has announced today.\n\nFrom July next year, a plan called Solar Sharer will require retailers to offer free electricity to households for at least three hours in the middle of the day when solar generation is at its peak.\n\nThe initiative will eventually be open to all Australian houses and apartments, as long as they have a smart meter and move their electricity use to the middle of the day when the scheme is in operation.\n\nMELBOURNE CUP LIVE BLOG: Astonishing $500k bet swings Melbourne Cup to new favourite\n\nAussies will reportedly benefit, even if they don't have solar panels. (Getty)\n\nThe offer will initially be available to states and regions under the Default Market Offer (DMO), which acts as a limit to what retailers can charge for electricity.\n\nThese are NSW, south-east Queensland and South Australia, with consultations to extend the offer to the rest of the country by 2027.\n\nClimate Change and Energy Minister Chris Bowen said the move would benefit all Australians.\n\n\"Free daytime power for families across Australia is proof that what's good for the planet is good for your pocket,\" he said.\n\n\"People who are able to move electricity use into the zero cost power period will benefit directly, whether they have solar panels or not and whether they own or rent.\n\n\"The more people take up the offer and move their use, the greater the system benefits that lower costs for all electricity users will be.\"\n\nElectricity prices are rising, with the Australian Bureau of Statistics showing they have jumped nine per cent in the last quarter, subsequently having an impact on inflation.\n\nREAD MORE: Trump plummets to a stunning new low\n\nChris Bowen has claimed the Solar Saver scheme will help millions of Aussies cut their power bills. (Alex Ellinghausen)\n\nBowen said the government would reform the DMO to make it cheaper for Australians.\n\n\"Australians deserve a fairer go when it comes to their energy bills,\" he said.\n\n\"Reform to the DMO will strip out unnecessary costs and expand protections to all standing offer customers and small customers in embedded networks, including renters and apartment dwellers.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/interest-rates-reserve-bank-of-australia-november-decision/d70c56a3-161f-43ef-9e66-9286cdd459be",
        "title": "Long odds on Cup Day interest rate cut as RBA board meets",
        "publish_date": "Mon, 03 Nov 2025 19:45:33 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Homeowners hoping for a Cup Day interest rate cut are expected to be left frustrated today with the Reserve Bank expected to keep the cash rate on hold in its November meeting.\n\nThis year, the RBA has slashed interest rates from ﻿4.35 per cent to 3.6 per cent and until recently, hopes were high for another cut by the end of 2025.\n\nBut stubborn inflation and a relatively steady labour market offer little incentive for the bank to push further ahead after leaving rates on hold in the board's September meeting.\n\nHomeowners hoping for a Cup Day interest rate cut are expected to be left frustrated today with the Reserve Bank expected to keep the cash rate on hold. (Nine)\n\nA Finder survey released at the end of October found that the vast majority of experts expected the bank to keep its finger on the pause button in November, and even likely in December.\n\nThat's after the consumer price index rose 1.3 per cent ﻿in the September quarter, according to Australian Bureau of Statistics data.\n\nBut the verdict isn't universal.\n\nLIVE UPDATES: Melbourne Cup results as they happen ﻿\n\nScott O'Neill, chief executive﻿ of property investment services company Rethink Group is predicting a 0.25 per cent cut to 3.35 per cent.\n\n\"It's a line-ball decision, but I'm backing a cut,\" O'Neill said.\n\n\"Inflation has landed squarely in the target range at 2.1 per cent headline (2.7 per cent trimmed mean), and with the economy showing clear signs of softening, the RBA has room to move.\"\n\nREAD MORE: New US poll deals major blow to Donald Trump ﻿\n\nHomeowners will have to keep tightening their belts. (Dion Georgopoulos / Australian Financial Review)\n\nThe RBA board's decision will be handed down at 2.30pm AEDT.﻿\n\nThe bank's final board meeting for the year will take place in December.\n\nHowever, most experts are now predicting a rate cut to be delayed until partway through 2026.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/wedding-kookaburra-lands-on-brides-head-during-wedding-ceremony/cdccdac8-2e0e-4305-8dc4-08fd0b7bd3ef",
        "title": "Kookaburra lands on bride's head during wedding ceremony",
        "publish_date": "Mon, 03 Nov 2025 04:19:55 +0000",
        "category": "lifestyle",
        "authors": [
            "Nov"
        ],
        "text": "There's been an unexpected wedding guest at a ceremony on the Gold Coast.\n\nA couple called Marc and Maxine were sharing their vows in the Currumbin Valley, when all of a sudden a Kookaburra landed on the bride's head.\n\n\"It's OK,\" the surprised groom could be heard saying as the bride looked up in shock.\n\nThe Instagram caption theorised it may have been a heavenly blessing from Maxine's late father and Marc's late mother.\n\nIt said the Aussie bird symbolises laughter, healing, and family connection.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-04/eli-katoa-shaun-johnson-reaction-scary-incident/105969198",
        "title": "'I feel a bit angry': Ex-player condemns handling of Katoa concussion",
        "publish_date": "Tue, 04 Nov 2025 01:21:44 +0000",
        "category": "sports",
        "authors": [],
        "text": "Former New Zealand star Shaun Johnson has called out the circumstances that led to Eli Katoa's frightening injury scare in Sunday's New Zealand vs Tonga Pacific Championships clash at Eden Park Stadium.\n\nKatoa suffered seizure activity on the bench and required oxygen as he was stretchered from the field.\n\nThe Melbourne Storm forward was immediately taken to hospital where he had surgery and is now recovering.\n\n\"It was scary scenes,\" Johnson, who was working at the game for the media, told The Play On Sport Show podcast.\n\n\"I feel a bit angry about the situation … I don't get how it can even get to that point.\n\n\"There's going to be fallout over this, there's going to be some heads that will roll because I do not know how Eli Katoa was actually even allowed to take the field.\"\n\nKatoa suffered his first head knock in the pre-game warm-up after colliding with Lehi Hopoate.\n\nShaun Johnson says Eliesa Katoa should not have even taken to the field. (Getty Images: Hannah Peters)\n\nHe was assessed by staff on field but was deemed to have passed his HIA, something that Johnson finds incredulous.\n\n\"In warm-up he [gets] a shoulder to the head, like, smack bang to the face and like, loose body to the ground. He's not sleeping on the ground, he sort of rolls over … but it's a limp body to the ground,\" Johnson explained.\n\n\"Now all I thought, straight away when I saw that was, OK, if that happened in a game or if that happened at training during the week, he's done.\n\n\"It's done … they probably even go cat one on it … you're just done bro, like, come on, player welfare, we're looking after you.\n\n\"But then it comes through the head piece that he's passed his HIA and me and Richie, we look at each other and we go, 'No way.'\n\n\"You want to see the best players playing, but when you [were watching] you felt sick over the incident. He's not right. It was a bad one, it wasn't a mediocre one, it was a bad one in warm-up.\"\n\nKatoa went on to suffer two more head knocks in the match, with Johnson increasingly concerned about the impact.\n\n\"He takes another one in the first half and he's pulled off [the pitch] now I'm like, 'OK, you've just had your second head knock, it's, bro, we're going to take the decision out of your hands now.'\n\n\"Don't even give him the possibility, don't give him the chance of passing this.\n\n\"But they do it, and he passes.\n\n\"Sure enough, he rolls back out there … but then I see him take a third one.\n\n\"I actually felt proper sick. It was yuck.\n\n\"They pull him off, I don't even know, I don't want to speculate, I don't know if that was his HIA pull off. But what we see from the sideline is really alarming.\"\n\nEliesa Katoa was taken to the bench before suffering \"seizure\" activity. (Getty Images: Hannah Peters)\n\nJohnson said that every player would want to keep playing, no matter what the circumstances, but it was the duty of the medical staff to take the decision out of their hands.\n\n\"I hope it never gets to that point again for any of our players again,\" Johnson said.\n\n\"I don't like our players not being looked after.\"\n\nTonga coach Kristian Woolf defended the Tongan medical staff pitchside, saying that it was not his job to question their judgement.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\n\"We have two very experienced doctors there, they have done the usual [tests]. He has passed all that and passed it well,\" Woolf said.\n\n\"My job is not to question doctors.\n\n\"They were both comfortable with that and comfortable with him coming back on to the field.\"\n\nSamoan player Junior Paulo said players' health being put first was the most important thing.\n\n\"We as footy players will probably never say no to turning up for your country and getting out there and playing,\" Paulo said.\n\n\"There are protocols around that and should be followed — and they probably were followed.\n\n\"In terms of putting your health before your job, that's probably the main outcome that we really want to take out of it.\n\n\"This is not to put pressure on anyone who is in that role to make a call, but I think that's what probably their role is to do to look after the health and safety of the player first.\n\n\"There are protocols in place for why you probably shouldn't be allowed to return to the field, and that's for the health concerns.\"\n\nThe NRL has launched an investigation into the circumstances of Katoa being allowed to play on, while the Rugby League Players Association said it would run its own enquiries into the incident.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-04/worlds-oldest-olympic-gold-medallist-charles-coste-dies/105969014",
        "title": "World's oldest Olympic gold medallist dies, aged 101",
        "publish_date": "Tue, 04 Nov 2025 00:01:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "French cyclist Charles Coste, who had been the world's oldest living Olympic gold medallist, has died aged 101.\n\nCoste, who won Olympic gold in track cycling's team pursuit alongside Pierre Adam, Serge Blusson, and Fernand Decanali in 1948, died on Thursday.\n\nFrench Sports Minister Marina Ferrari confirmed his death on Monday, calling it a great loss for France.\n\n\"It is with great sorrow that I learned of the death of Charles Coste, Olympic champion in London. At 101 years old, he leaves behind an immense sporting legacy,\" she said in a post on X.\n\nCharles Coste won gold alongside his teammates in the 1948 London Games. (Reuters: Stephanie Lecocq)\n\nHe had been the world's oldest living Olympic gold medallist after the death of Hungarian artistic gymnast Agnes Keleti at the age of 103 in January.\n\nCoste got another chance to shine as one of the torchbearers during the opening ceremony of the 2024 Paris Olympics.\n\n\"It was with great emotion and pride that I passed the torch to two great Olympic champions, Teddy Riner and Marie-José Pérec,\" he told Olympics.com during a visit earlier this year.\n\nHis record also includes the 1949 Grand Prix des Nations, a 140-kilometre time trial in which he beat Italian Fausto Coppi, a Tour de France and Giro d'Italia champion.\n\nABC/Wires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-04/queer-spaces-disappearing-australian-nightlife/105958852",
        "title": "By the end of the year, three capital cities will have no queer clubs",
        "publish_date": "Mon, 03 Nov 2025 23:23:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Jaden does not want us to use his full name in this story.\n\nHe is worried it will be a beacon for homophobic trolls to harass him online and in real life.\n\nHe is concerned because he was punched by a stranger in a homophobic attack in Canberra while on a night out with his friends nine months ago.\n\nHe still gets anxious about returning to the party strip.\n\nLoading...\n\nThe one exception to that rule is Cube, an icon in Canberra's nightlife scene and safe haven for the LGBTQIA+ community.\n\nBut at the end of this year, after 20 years in business, Cube is closing, ending an era that the venue says \"helped define Canberra's nightlife and LBGTQIA+ culture\".\n\n\"I have plenty of friends — including myself — who are just far less likely to go out now because it doesn't feel like I'll be able to guarantee a safe night,\" Jaden said.\n\nCube is not the only club shutting down. In Darwin and Hobart, there have been no dedicated queer venues for more than two years.\n\nThe Bearded Tit, a queer venue in Sydney, held a funeral procession to mark its closure after running for 11 years. (Supplied: Joseph Mayers)\n\nLast month, the Sydney suburb Redfern hosted an unconventional funeral procession as loyal followers eulogised \"living queertopia\", The Bearded Tit, which \"pushed through a plebiscite, licked out lock-out laws, and pounded through a pandemic\".\n\nIn major cities such as Sydney — sometimes controversially — other venues targeting queer partygoers are cropping up.\n\nBut in Darwin, Hobart and now Canberra, permanent, dedicated queer venues have disappeared from the nightlife scene altogether.\n\nWhat is filling the void?\n\nEffulgent queer dance party in Canberra is a safe event where attendees can experience \"healing and joy\". (Supplied: Alison Wong)\n\nDespite Canberra's reputation as Australia's most progressive city, Jaden said he regularly experienced and witnessed homophobic and transphobic discrimination on nights out.\n\nHe said that included being denied entry into (non-queer) clubs for wearing sleeveless tops, crop tops and tight-fitting outfits like those of his female friends.\n\n\"I have been catcalled many a time when I've gone out … both in a traditional sense and also in a very intentionally bigoted, almost humoristic catcalling as a way to try to humiliate people in a very public way,\" he said.\n\nIn recent years, Australia's nightlife has been hit hard by pandemic-era lockdowns, skyrocketing costs and changing consumer behaviours.\n\nAlison Wong thinks queer venues have been hit particularly hard.\n\nEffulgent queer dance party in Canberra. (Supplied: Alison Wong)\n\nThey said nightlife was an intrinsic part of LGBTQIA+ culture.\n\n\"OK, history lesson: historically queer culture has been pushed to the outside of society because maybe people aren't out yet, maybe they don't feel safe dressing outside of social gender constructs and expectations,\" Alison said.\n\n\"Queer people have carved out their own spaces for that in nightlife — that's how we get drag culture, that's how we get ballroom culture.\"\n\nEarlier this year, Alison co-founded a semi-regular queer party night called Effulgent to help raise funding for transgender Canberrans to receive gender-affirming surgeries.\n\nGuests at the Peachy Party in Darwin could write messages of support to trans prisoners held in male prisons. (triple j hack: Lillian Rangiah)\n\nBut they can only afford to run that night because the venue, a local cafe, donates its space and the DJs and performers donate their time.\n\nDarwin also has a semi-regular queer party night.\n\nMads McIntyre co-founded Peachy Party with their business partner Chloe because there were almost no other queer spaces in Darwin.\n\nMads believes part of the appeal is the organic, community-led nature of party nights.\n\nJaden pole-dancing. (Supplied: Jaden)\n\n\"There's this deep culture here [in Darwin] around queerness that we learn from the Tiwi sistergirls and brotherboys as well,\" they said.\n\n\"It's all local performers, local DJs, local queer community — it's a community event, that's why it's so special,\" Mads said.\n\nBut Mads believes party nights alone can not replace permanent queer venues.\n\n\"Peachy's only every three months — where do we go in between?\n\n\"I can't do more than that, I'd be too tired — where can we just go when we're not even planning to go out to feel good and feel like this is our space?\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-04/china-extends-visa-freee-policy-to-2026-australia-included/105968854",
        "title": "China extends visa-free entry for 45 countries, including Australia",
        "publish_date": "Mon, 03 Nov 2025 23:06:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "China will extend its visa-free entry policy for 45 countries, including Australia, France, Germany and Sweden, to December 31, 2026.\n\nThe policy will be effective on November 10, the foreign ministry said on Monday.\n\nThe extension covers 32 European countries as well as several nations in South America and the Gulf region, a statement released by the foreign ministry's consular affairs department showed.\n\nThe policy was scheduled to expire at the end of this year for many countries.\n\nBid to boost tourism\n\nChina has offered visa-free entry to citizens from dozens of countries in recent years as part of efforts to woo foreign visitors, revive a tourism sector battered by years of strict COVID-19 controls, and boost foreign engagement.\n\nThe United States, Canada and Britain are not part of the scheme.\n\nUnder it, visitors from eligible countries can enter China for business, tourism, family visits or transit for up to 30 days without a visa.\n\nTravel companies are bracing for a bigger influx in anticipation of summer holiday-makers coming to China. (AP: Andy Wong)\n\nChina is also expanding its outreach to the European Union, a key trading partner, at a time of fraught trade ties.\n\nBeijing confirmed that its one-year suspension of expanded rare earth export controls, announced after a meeting between President Xi Jinping and US President Donald Trump in South Korea last week, would also apply to the EU, the bloc said after officials met in Brussels last week to alleviate tensions.\n\nThe two sides agreed to continue communication and exchanges to promote the stability and smooth operation of China-EU industrial and supply chains, Beijing's commerce ministry said on Monday.\n\nMore than 20 million foreign visitors entered without a visa in 2024 — almost one-third of the total and more than double from the previous year, according to the National Immigration Administration.\n\nWhile most tourist sites are still packed with far more domestic tourists than foreigners, travel companies and tour guides are now bracing for a bigger influx in anticipation of summer holiday-makers coming to China.\n\nTrip.com Group, a Shanghai-based online travel agency, said the visa-free policy had significantly boosted tourism.\n\nAir, hotel and other bookings on their website for travel to China doubled in the first three months of this year compared with the same period last year, with 75 per cent of the visitors from visa-free regions.\n\nABC/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-04/melbourne-cup-2025-live-updates-flemington/105965384",
        "title": "Live: New Melbourne Cup favourite as rain continues to threaten at Flemington",
        "publish_date": "Mon, 03 Nov 2025 22:35:55 +0000",
        "category": "sports",
        "authors": [
            "Michael Doyle",
            "Andrew Mcgarry"
        ],
        "text": "What a your thoughts on why Al Riffa has seen so much money come for it? Top weight with no exposed form in Oz still a risk for mine. Surely can't just be the soft track as many others have decent form with the sting out, including Half Yours? - Sean5\n\nSean5,\n\nIt is fair to say that many fancied European runners have come to Australia for the Melbourne Cup and found weight — or the race itself — to be beyond them.\n\nDual Ascot Gold Cup winner Yeats was highly touted, but he only finished seventh in 2006 for Aidan O'Brien.\n\nAl Riffa is another who is coming out to Australia to race in the Cup without a lead-up run. The knock on the horse is that it has 59kg, which would be the biggest winning weight since Rain Lover carried 60.5kg in 1969.\n\nThe reason that everyone is going mad for Al Riffa is his four-length demolition of a solid field in the Irish St Leger (2,816m), carrying 61.5kg and previously bursting clear to win the Curragh Cup (2,816m) by five lengths, carrying 62kg.\n\nHe gets a weight drop from those runs, and has good soft form — there is a query over the distance, but considering how strong he was over 2,816m, it seems like a good chance he will get the 3,200m.\n\nAlso, he is a great middle-distance horse with a strong turn of foot, rather than a traditional dour stayer.\n\nThe comparison that a few pundits have been making has been Gold Trip, who had raced in high-class middle-distance fields in Europe before winning the Melbourne Cup in 2022.\n\nAlso, two words: Mark Zahra. He has the most in-form jockey at the carnival on board.\n\nAl Riffa may not win, he may not end up getting the trip. But all things being equal, he's a VERY good chance.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-04/nsw-weather-aftermath-storm-cell-sydney/105968348",
        "title": "Fast-moving storm cell leaves trail of destruction overnight in Sydney",
        "publish_date": "Mon, 03 Nov 2025 21:33:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "A driver has been freed after becoming trapped by a fallen tree during a fast-moving storm cell that left a trail of destruction across parts of Sydney overnight.\n\nEmergency services were called to Burwood Road in Croydon Park on Monday evening after a car was crushed by an uprooted tree and fallen powerlines.\n\n\"We had live powerlines to deal with, we also had a ruptured gas main,\" Fire and Rescue NSW Superintendent Adam Dewberry said.\n\n\"The occupant was trapped in the vehicle for quite some time, just over an hour.\"\n\nThe NSW State Emergency Service (SES) said it received more than 400 calls for help overnight, mostly related to wind damage, fallen trees and debris.\n\nSES spokesperson Samuel Corby said both Liverpool in Sydney's south-west and the Sutherland Shire bore the brunt of destructive weather.\n\nSES volunteers are on the ground on Tuesday to assist with clean-up after the storm. (ABC News.)\n\n\"Our volunteers were quickly out on the field. We mobilised around 500 SES volunteers to support the operational response,\" Mr Corby said on Tuesday.\n\n\"We'll have more volunteers out on the field today as we clear up those remaining jobs.\"\n\nOn Monday afternoon, there were wind gusts of up to 100 kilometres per hour recorded at Wattamolla, while large hailstones and heavy rain also affected areas including Sutherland, Sydney Olympic Park and Dural.\n\nAt Sydney Airport intense rain and hailstones affected flights and caused damage to parts of the international terminal.\n\nIn a statement, Sydney Airport said it remained open and operational throughout the weather.\n\n\"The heavy rain, hail and strong winds also caused some leaks and ceiling damage in parts of the terminal, and contractors are on site working to resolve this.\"\n\nFlights are expected to operate as normal throughout Tuesday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-04/wa-avocado-growers-expect-record-crop-push-for-exports/105965972",
        "title": "WA avocado growers eye 'record' crop as industry targets exports to China",
        "publish_date": "Mon, 03 Nov 2025 21:28:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "West Australian avocado growers are eyeing the Chinese export market as the \"green gold rush\" of the fruit shows no sign of slowing.\n\nOrchardists have begun harvesting what could be a record-breaking crop in the South West region.\n\n\"We're shaping up to have WA's largest season on record,\" Bendotti Avocados' Trevor Bendotti said.\n\n\" The previous record was set two seasons ago and we're well on track to smash that. \"\n\nWA avocado exporter Trevor Bendotti says a record season is on the cards. (ABC South West WA: Pip Waller)\n\nHe said high yields and strong export demand had driven an influx of new growers.\n\nWA produced 36,889 tonnes in the 2024/25 financial year, contributing to national output of 131,385 tonnes.\n\nThe national record of 150,913 tonnes was set in the 2023/24 financial year.\n\nAustralia's annual output is projected to hit 171,163 tonnes within the next two years.\n\nThe Bendotti Avocados packing shed in Pemberton. (ABC South West WA: Pip Waller)\n\nAvoiding an avocado glut\n\nAs production booms, concerns about oversupply and market saturation have resurfaced.\n\nFour years ago WA avocado growers were dumping produce amid a supply glut.\n\nClint De Campo planted his first avocado block in Pemberton about nine years ago.\n\nHe weathered some turbulent seasons and said it was a relief to see the market finally finding its balance.\n\nClint De Campo has been growing the fruit for almost a decade. (ABC South West WA: Pip Waller)\n\n\"This year things are looking pretty good,\" Mr De Campo said.\n\n\"Yields are up, the fruit's clean and the prices are OK.\"\n\nMr Bendotti believes careful planning will be key to ensuring the industry's long-term success.\n\n\"Growing and picking without proper planning will be detrimental to everyone,\" he said.\n\n\"Managing the flow of fruit through the domestic market while increasing export opportunities becomes even more critical with the additional volumes we're seeing.\"\n\nExport markets crucial\n\nAvocado industry leaders are placing a heavy emphasis on expanding exports in order to keep supply and demand in check.\n\nIn the past financial year, Australia exported about 14,000 tonnes out of the approximately 130,000 tonnes grown nationally.\n\nThe year before about 20,000 tonnes were exported.\n\nBrad Rodgers says China will be the industry's next major target for exports. (ABC South West WA: Pip Waller)\n\nAvocados Australia WA director Brad Rodgers said securing access to new markets was crucial to ensuring the industry's growth.\n\n\"We're rewriting our national strategy plan and export will be a big focus,\" he said.\n\n\"We're working hard to secure new market access, particularly to China.\"\n\nDue to its pest-free status, WA already has trade access to the Japanese and Thai markets, but China remains the coveted prize.\n\n\"We've done a lot of groundwork there as an industry,\" Mr Rodgers said.\n\n\"We've signed MOUs [memorandum of understanding] with Shanghai markets worth around $250 million in Australian avocados, which shows just how strong their interest is.\"\n\nFormal approval to export Australian avocados to China is still being negotiated between Canberra and Beijing.\n\nIndustry leaders are confident WA growers will be ready to ship as soon as the green light is given.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-04/andrew-forrest-traditional-owners-in-sat-ashburton-river-plan/105966594",
        "title": "Billionaire Forrest begins fresh legal bid to alter sacred river in WA's north",
        "publish_date": "Mon, 03 Nov 2025 21:16:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mining billionaire Andrew Forrest's controversial plan to alter the natural river system on his large outback WA cattle station is under renewed legal scrutiny, with his lawyers arguing the intervention is needed to help solve the region's water shortages.\n\nMr Forrest had planned to build 10 specialised weirs along a section of the Ashburton River, which flows through his Minderoo Station in the state's Pilbara.\n\nThe weirs would capture an estimated 8.4 gigalitres of water per year, with the precious resource in short supply across the region.\n\nThe Ashburton River has been deemed a sacred site by Aboriginal traditional owners. (Supplied: Buurabalayji Thalanyji Aboriginal Corporation)\n\nThe plan was initially rejected by the State Administrative Tribunal (SAT) in 2023, when it was decided the primary benefit of the project would not benefit the overall general interest of the community.\n\nIn that decision, Justice Janine Pritchard also found the entirety of the Ashburton River was of spiritual significance to the Thalanyji people.\n\nThe river runs through Mr Forrest's Minderoo Station, near the Pilbara town of Onslow. (Lucie Bell)\n\nBut last year, an appeal by the Forrest family in the Supreme Court on procedural grounds led to a fresh hearing, a move that was described by the Buurabalayji Thalanyji Aboriginal Corporation (BTAC) as \"extremely disappointing\".\n\nNeed for water paramount\n\nProceedings are now underway in the SAT with barrister for Forrest and Forrest Pty Ltd Ken Pettit SC telling the tribunal the irrigation system was needed to address the \"enormous need for water\" on Mr Forrest's station.\n\nHe said a February report by the Department of Water and Environmental Regulation suggested weirs were essential, due to limited groundwater supply across the Pilbara region.\n\nThe State Administrative Tribunal previously blocked Andrew Forrest's proposal due to cultural heritage concerns. (ABC News: Andrew Williams)\n\nThe SAT had previously found the benefit of the proposed water capture project would primarily be a private one for the Forrests.\n\nMr Pettit said if the project went ahead, roughly a quarter of the water captured per year would go to Hastings Technology Metals (HTM) for its Yangibana rare earths project in the Gascoyne.\n\nThe water would be used for a hydrometallurgical plant, to be built near Onslow, to process materials from a mine located about 300 kilometres to its south-east.\n\nWyloo Metals, also owned by the Forrests, took ownership of 60 per cent of the Yangibana project in a joint venture with HTM earlier this year.\n\nMr Pettit pointed to the support from both the state and federal governments for the Yangibana project and its role in decarbonisation as evidence of the broader benefit of the project.\n\nSacred site at risk, traditional owners say\n\nIn the previous SAT decision, it was found the entirety of the Ashburton River was of spiritual significance to traditional owners.\n\nThis was because the river, from its mouth near Onslow to inland near Nanutarra, was a registered Aboriginal heritage site where the Thalanyji people believed the water serpent Warnamankura lived.\n\nThe Thalanyji people believe the Warnamankura water serpent lives in the Ashburton River. (Supplied: Bill Lawrie)\n\nWarnamankura created the river, according to Thalanyji belief, and still travels up and down it to protect the country.\n\nTraditional owners feared the weirs could kill the water serpent spirit in the river.\n\nA sheet of rocks breaking the surface of the Ashburton River on Andrew Forrest's Minderoo property marks where the mining magnate has developed his prototype upside-down weir. (ABC: Robert Koenigluck)\n\nIn coming days, the tribunal is expected to hear from representatives from BTAC and others, including agricultural workers, anthropologists and archaeologists.\n\nThe hearing continues.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-04/ashes-cricket-marnus-labuschagne-australia-england-century/105968514",
        "title": "Labuschagne enjoying best form in six years ahead of Ashes",
        "publish_date": "Mon, 03 Nov 2025 20:46:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "Marnus Labuschagne says he has struck his best form with the bat in six years, as the men's Ashes series fast approaches.\n\nLabuschagne posted his fifth century in eight innings for Queensland this season when he helped the Bulls record a 96-run win over NSW in their One-Day Cup match on Monday.\n\nHis 101 (111 deliveries) against the Blues in Sydney took his domestic-season average to 84.87 across all formats.\n\nLabuschagne's glut of runs comes at the right time, with the first Ashes Test beginning in Perth on November 21.\n\nHe said his form matched his performances for Glamorgan in English County cricket early in his professional career.\n\n\"The only one I can think of is probably 2019 at Glamorgan as a period of time,\" Labuschagne told reporters on Monday.\n\nLabuschagne throws hand up to open batting in bid to claim Ashes spot Marnus Labuschagne is prepared to do whatever it takes to get back into Australia's Test side, even if that means batting in a non-preferred opening slot.\n\n\"But probably not across both formats.\n\n\"With both formats I feel like batting is in a really nice place, just trusting my skills and trusting myself out there … It's all coming together.\"\n\nLabuschagne's 2019 hot streak prompted him to be included in Australia's Ashes squad that year, before he made his mark replacing a concussed Steve Smith at Lord's.\n\nWhat followed was one of the quickest ascensions to the top of the world Test batting rankings in history, with Labuschagne reaching the summit by 2021.\n\nLabuschagne said history had taught him there was no such thing as wasting form this early in the season.\n\n\"I feel like whenever you're batting badly, you just need to get that rhythm and that feel,\" he said.\n\n\"And once you've got it, you protect it like it's gold.\n\n\"You know how to manage the situation of the game, you know when to take a risk or when not to. If you score runs, it's a habit.\"\n\nDropped earlier this year after a run of low scores, Labuschagne will return to the Australian team when an extended group for the first Ashes Test is named this week.\n\nLabuschagne is willing to open or bat number three, with Sam Konstas expected to be cut from the top of the batting order.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-04/aged-care-reforms-overlook-stolen-generations-elders/105966520",
        "title": "Stolen Generations elders worried about aged care reforms",
        "publish_date": "Mon, 03 Nov 2025 20:28:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sitting in his home in Balga, Western Australia, Uncle Wayne Garlett reflects on a life-changing injury that left him with a damaged spinal cord.\n\nAt nine years old, he was hit by a car and sent to hospital.\n\nHe managed to recover but was forced to overcome another challenge brought by the Western Australian government.\n\n\"I spent about 18 months in hospital and then got taken away to a mission,\" the proud Ballardong man and Stolen Generations survivor said.\n\nAboriginal children in Western Australia were then under the control of the Native Welfare Act, which was used to \"assist in their economic and social assimilation\".\n\nIt would be decades before Uncle Wayne reunited with his family, but the injury that separated him from his loved ones returned to haunt him.\n\n\"When I got to about 46, I just kept falling over and falling down. I didn't know what was wrong,\" Uncle Wayne, now 71, said.\n\n\"They did a check on me and said my spinal cord was touching the bone.\"\n\nTwo operations later and with steel rods in his neck, he now relies on a walker, and for the past seven weeks has been receiving home care services to live in the house he proudly owns.\n\n\"I'm really enjoying my life at the moment, but they say when you're on a good wicket, they change the boundary, they change rules, and that's been happening all my life,\" he said.\n\nOn November 1, the government transitioned to a new aged care system, requiring full-time pensioners, part-pensioners, and self-funded retirees to make a co-contribution for services, whether they live at home or in residential care.\n\nThe changes apply to those who were approved for home-based care after September 12, 2024, or entered residential care after November 1, 2025.\n\nThe government says clients will not be out of pocket for clinical services such as nursing and physiotherapy.\n\nBut help for in-home everyday tasks — like cleaning the house or preparing meals — will attract some of the highest contributions.\n\nUncle Wayne said that without aged care help, he would need support from a full-time carer.\n\nFor him, the alternative of returning to an institution like an aged care home was unfathomable.\n\n\"I wouldn't want to be back in one of them places because without your independence, you might as well lay down and die,\" he said.\n\n'Discriminatory' changes\n\nThe new co-contributions are calculated using an asset and income test.\n\nLast year, the government announced that recipients of the National Redress Scheme for Institutional Child Sexual Abuse would not have to count their compensation as an \"asset\" when being means-tested for residential aged care.\n\nHowever, state-based reparations paid to Stolen Generations survivors did not receive the same treatment.\n\nProfessor Steve Larkin, chairperson of Stolen Generations advocacy body the Healing Foundation, said it was unjust that compensation for government-inflicted trauma could leave elders struggling.\n\nSteve Larkin says Stolen Generations survivors are feeling \"vulnerable\" and \"intimidated\". (ABC News: Daniel Taylor)\n\n\"I don't understand the logic as to why one is exempt and the other is not … on the face of it, it's discriminatory,\" he said.\n\n\"For people who are some of the sickest and poorest, in their elderly years, having to go through further hardship … it's callous disrespect.\n\n\"Survivors would feel very vulnerable, very intimidated, and probably worry about what the immediate future holds.\"\n\nThe ABC asked the Minister for Aged Care and Seniors, Sam Rae, if state-based Stolen Generations redress payments were exempt from means testing.\n\nSam Rae says the new act will deliver \"high-quality, safe, respectful and sustainable\" care for First Nations elders. (ABC News: Matt Roberts)\n\nIn a statement, Mr Rae did not answer the question directly but said: \"Every First Nations elder deserves access to aged care that is culturally sensitive and suitable for them, which is why redress payments under the Commonwealth Redress Scheme for Institutional Abuse are already exempted from means testing under the new Act.\"\n\nThe minister's office also said it was considering feedback from Indigenous stakeholders about other redress schemes and their impact on co-contributions.\n\nBetween one in 10 and one in three First Nations children were forcibly removed from their families between 1910 and 1970.\n\nAll jurisdictions except Queensland have established Stolen Generations redress schemes to acknowledge the grave injustice, loss and trauma to those who were forcibly removed, with hopes it will start a new chapter for healing.\n\n\"The compensation that they did receive in recognition of the institutionalisation and removal is now not exempt under the new act, so that money is now going to be spent on basic home living expenses,\" Professor Larkin said.\n\n\" It's not really compensation, is it? \"\n\nConcerns co-payments could push elders into residential homes\n\nAdvocates are also concerned about how Stolen Generations survivors will be able to afford the co-payments for services delivered in the home.\n\nPart-pensioners who received Stolen Generations compensation could pay anywhere from 17.5 per cent to 80 per cent of the bill for basic needs, such as showering.\n\n\"My fear is that Aboriginal and Torres Strait Islander elders may forgo care on the basis that the co-contributions will cost too much,\" Inspector-General of Aged Care Natalie Siegel-Brown said.\n\nNatalie Siegel-Brown has \"deep concerns\" about how aged care changes will affect First Nations people. (ABC News: West Matteeussen)\n\nShe was also concerned that survivors would be pushed into residential homes earlier because they could not afford the care to remain at home.\n\n\"I have grave concerns about the way residential aged care is mainstreamed for Aboriginal and Torres Islander people, and those institutional settings can be very triggering of trauma from past institutionalisation,\" she said.\n\n'Actively choosing to ignore' Royal Commission report\n\nThe Royal Commission into Aged Care Quality and Safety recommended a \"new approach\" for Aboriginal and Torres Strait Islander aged care that would be co-designed with Indigenous stakeholders.\n\nThe report found \"[t]he current aged care system does not ensure culturally safe care for Aboriginal and Torres Strait Islander people.\"\n\nIts recommendations included flexible funding to expand Indigenous aged care facilities and help providers cover costs, as well as increasing the First Nations workforce.\n\nBut there were \"deep concerns\" that the reforms would do the opposite, as Indigenous organisations were forced to collect new co-payment fees.\n\n\"What we see here is a situation where we are actively choosing to ignore the Royal Commission's recommendations,\" Ms Siegel-Brown said.\n\n\"Not being funded to provide that spiritual, emotional, social care that is so core to the way they do business might alienate them from remaining within the sector.\"\n\nThe ABC spoke with a community-controlled organisation, which did not wish to be named, that said it would not be charging elders for basic care — something that carries the risk of being found non-compliant.\n\nMr Rae said, since 2022, the government had invested $2 billion \"to support First Nations Elders … to have better access to aged care services to meet their physical and cultural needs.\"\n\nHe said the new act put \"First Nations elders at the centre of their own care, now and into the future\".\n\nAfter a spinal cord injury, Wayne Garlett finds it difficult to walk and complete everyday tasks. (ABC News: West Matteeussen)\n\nIn Western Australia, Uncle Wayne was looking forward to his next elders' gathering and hoped they would still be affordable under the new aged care reforms.\n\n\"Everyone needs to talk to someone because you go 48, 50 hours and you don't see anyone, but you go along to a group, and you talk your head off or some people just listen,\" he said.\n\n\"It's friendship. It's healing.\n\n\"Without the funding, they'll cease, and we'll just go back to watching TV 15 hours a day, sitting in a chair.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nfl/how-us-raider-sport-transcends-local-bids-for-brisbane-2032-20251103-p5n7e2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How US raider sport ‘transcends’ local bids for Brisbane 2032",
        "publish_date": "Tue, 04 Nov 2025 12:33:20 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "The incentives While Australia had high hopes entering the Asia-Oceania Flag Football Championships in their bid to qualify for the World Cup, Stegman sensed their rivals had largely written them off. It made the triumph all the sweeter. “The moment itself was pure jubilation,” he said. Jared Stegman in action for Australia at the Asia-Oceania Flag Football Championships.\n\n“The women’s team was there as well and have been a big factor in our lead-up, so they came onto the field and everyone was getting around each other. “It was unexpected, from our own expectations and training it was expected, but no one thought in their wildest dreams we’d be gold medallists.” Stegman has been involved in American football for 18 years. The 35-year-old has plied his trade around the globe – playing in Australia, Turkey, Sweden, Japan and Germany. But never had an Olympics tilt crossed his mind.\n\nLoading “It’s definitely given me a new purpose. I’m a high school head of department for English and playing football for fun, and this has started a new fire,” Stegman said. “I always wanted to play for the challenge, which is why I went overseas, because American football is not well regarded, funded and overly competitive here, so this new opportunity is amazing. “The chance is crazy, it’s unbelievable, and we’ve achieved the first step.” This year, the NFL announced it would release its players to make them available for selection at the LA Games, opening the door for Australian prospects to take on the best of the best on their home turf, such as three-time Super Bowl champion Patrick Mahomes.\n\nPathways through the National Collegiate Athletic Association (NCAA) in the US also present study and travel opportunities. “We’ve had people trying to get into the Australian team because they see this as a shot to go to the Olympics, and particularly to play the US guys in LA,” Kelly said. “It transcends a lot of sports.” Rival code raid Kelly had previously declared Australian stars such as Sydney Rooster-turned-Wallaby Joseph-Aukuso Suaalii and rugby sevens weapon Maddison Levi would be tailor-made for flag football.\n\nNow, he said, “you could name 1000”. Those to make the jump included former Wallabies star Quade Cooper, Essendon Bombers Victorian Football League talent Jacob Atley and St George-Illawarra Dragons under-21s winger Caine Barnes. Cooper did not feature at the oceania championships, having returned to Japan where he plays for the Kintetsu Liners rugby union side. Kelly said his impact at a training camp in the US was profound. Quade Cooper is “in the mix” for the flag football World Cup. Credit: Getty “He was phenomenal. The one thing Quade brings is preparation – the guy is meticulous with his preparation and thought process, and that was really beneficial for our young guys and girls,” Kelly said.\n\n“He’s in the mix for the World Cup next year, but it’s a very hard team to get into on the back of that performance.” Stegman said the transferable skills with other football codes would make the shift appealing, with Aussie rules athletes in particular blessed with the attributes needed to thrive. “Their skill set is perfect for flag football, they’re just so trained to catch and trap the ball, and every route you run you’re leading for the ball,” he said. Transferable skills include line running, catching ability and aerial prowess, while being able to respond to 360-degree opposition pressure.\n\nGrowing Australian presence Since flag football’s inclusion on the Sporting Schools program, Kelly revealed more than 50,000 juniors had come through the ranks across just five terms. In his words, “it’s exploded”. Loading When the Philadelphia Eagles conquered Kansas City in this year’s Super Bowl, 2.6 million people in Australia watched. As Melbourne prepares to host an LA Rams game in 2026 at the MCG, Kelly anticipated the game’s popularity would hit new heights.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/money/planning-and-budgeting/i-use-all-the-money-hacks-so-why-have-my-finances-stalled-20251104-p5n7li.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I use all the money ‘hacks’. So why have my finances stalled?",
        "publish_date": "Tue, 04 Nov 2025 12:29:14 +1100",
        "category": "finance",
        "authors": [
            "Paridhi Jain"
        ],
        "text": "I’ve been fixing my finances for the last few years, with the help of podcasts and books. I have a few savings buckets set up for things like travel, and I try to stick to a budget. I have some ETFs, I think my super is doing OK, and I try to make extra contributions. My problem is, I feel like I’ve stalled. I don’t know what I’m missing or whether there’s more I should be doing. I feel like I could be doing more, but I don’t know what.\n\nIn a scenario like this, what I tend to see is that you’ve implemented lots of different “tips”. You hear that a high-growth super fund is a good idea, so you switch your portfolio. You hear about buckets, so you divide up your savings. It’s a piecemeal approach to incremental changes. It’s a great start, but often what’s missing is the structures, systems and strategies that tie everything together.\n\nJust taking money advice piece by piece won’t get you where you want to be. Credit: Simon Letch\n\nStrategy\n\nDo you have a clear financial strategy? That means having a clear destination (where are you going) and a plan (how are you getting there). Without this, there’s a higher probability of making random decisions that seem like a good idea at the time, but don’t move you forward.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/paulo-loses-his-voice-after-leading-samoan-siva-tau-20251104-p5n7mx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Paulo loses his voice after leading Samoan Siva Tau",
        "publish_date": "Tue, 04 Nov 2025 12:28:54 +1100",
        "category": "finance",
        "authors": [],
        "text": "Paulo loses his voice after leading Samoan Siva Tau\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/trump-s-tariffs-face-judgement-day-and-there-s-a-lot-at-stake-20251104-p5n7ju.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s tariffs face judgment day, and there’s a lot at stake",
        "publish_date": "Tue, 04 Nov 2025 12:25:53 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The judgment day for most of Donald Trump’s tariffs looms this week, with the US Supreme Court set to hear an appeal against a lower court’s ruling that they are illegal.\n\nShould the Supreme Court rule against his administration’s reciprocal and baseline tariffs, the “Liberation Day” import levies of between 10 per cent and 50 per cent against all the countries the US trades with – and perhaps the trade and investment deals that have been struck using them as leverage – would have to be withdrawn, and the $US90 billion ($137 billion) or so in revenue the tariffs have generated so far might have to get refunded.\n\nDonald Trump said the Supreme Court hearing is “one of the most important cases in the history of our country”. Credit: Getty\n\nTrump could still have his tariffs, but he’d have to use different legislation that would involve extensive and time-consuming investigations, and couldn’t be imposed at the presidential whim. Or he’d have to resort to another law that puts a 15 per cent ceiling on tariffs, can only be used against countries with substantial trade surpluses with the US and sets a 150-day limit on the tariffs’ duration.\n\nTrump used Section 232 of the Trade Expansion Act of 1962 – which required Commerce Department investigations – for his sectoral tariffs on steel, aluminium and cars, among other products. Those tariffs haven’t been challenged.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/all-three-of-katoas-head-knocks-20251104-p5n7n1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "All three of Katoa's head knocks",
        "publish_date": "Tue, 04 Nov 2025 12:25:28 +1100",
        "category": "finance",
        "authors": [],
        "text": "All three of Katoa's head knocks\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/lexus-melbourne-cup-day-race-3-tab-trophy-20251104-p5n7mw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lexus Melbourne Cup Day: Race 3 - TAB Trophy",
        "publish_date": "Tue, 04 Nov 2025 12:22:09 +1100",
        "category": "sports",
        "authors": [],
        "text": "Lexus Melbourne Cup Day: Race 3 - TAB Trophy\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/celebrity-sitters-and-competing-artists-in-tv-series-that-lifts-lid-on-portrait-painting-20251016-p5n2yu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Celebrity sitters and competing artists in TV series that lifts lid on portrait painting",
        "publish_date": "Tue, 04 Nov 2025 12:21:04 +1100",
        "category": "entertainment",
        "authors": [
            "Kerrie O'Brien"
        ],
        "text": "On screen, Miranda Tapsell can usually be found hiding behind a character or “at least heightened version of myself”, but not this time. The much-loved actor best-known for The Sapphires and Top End Wedding makes her debut as a host in the new ABC series Portrait Artist of the Year.\n\n“That kind of guerilla television was very new to me,” says Tapsell, who had to quickly adjust to trusting her instincts and speaking her mind instead of following a script. “I can only just look at a painting and tell you what I feel.”\n\nLuke McGregor and Miranda Tapsell are the hosts of Portrait Artist of the Year on the ABC.\n\nThe five-part series, which Tapsell co-hosts alongside comedian Luke McGregor, pits professional artists against amateurs over four hours as they complete a portrait of a well-known Australian. Three subjects are painted each episode, with celebrity sitters including comedian Celia Pacquola, Gardening Australia’s Costa Georgiadis, actor Mark Coles Smith and film critic Margaret Pomeranz.\n\nThe works are then judged by National Portrait Gallery of Australia director Bree Pickering, seven-time Archibald Prize finalist Abdul Abdullah and Robert Wellington, an associate professor of art history at the Australian National University. The overall winner receives a commission for a work that will hang in the National Portrait Gallery in Canberra.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/movies/diane-ladd-triple-oscar-nominee-and-mother-of-laura-dern-dies-at-89-20251104-p5n7js.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Diane Ladd, triple Oscar nominee and mother of Laura Dern, dies at 89",
        "publish_date": "Tue, 04 Nov 2025 12:14:04 +1100",
        "category": "entertainment",
        "authors": [
            "Lindsay Bahr"
        ],
        "text": "Diane Ladd, a three-time Academy Award nominee and actor of rare timing and intensity whose roles ranged from the brash waitress in Alice Doesn’t Live Here Anymore to the scheming parent in Wild at Heart, has died at 89.\n\nLadd’s death was announced Monday by daughter Laura Dern, who issued a statement saying her mother and occasional co-star had died at her home in Ojai, California, with Dern at her side. Dern, who called Ladd her “amazing hero” and “profound gift of a mother”, did not immediately cite a cause of death.\n\nDiane Ladd in 2010, when she was awarded a star on Hollywood’s Walk of Fame. Credit: AP\n\n“She was the greatest daughter, mother, grandmother, actress, artist and empathetic spirit that only dreams could have seemingly created,” Dern wrote. “We were blessed to have her. She is flying with her angels now.”\n\nA gifted comic and dramatic performer, Ladd had a long career in television and on stage before breaking through on the big screen in Martin Scorsese’s 1974 release Alice Doesn’t Live Here Anymore. She earned an Oscar nomination for supporting actor for her turn as the acerbic, straight-talking Flo, and went on to star in the TV spin-off Alice.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/married-jockeys-to-make-melbourne-cup-history-20251104-p5n7mo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Married jockeys to make Melbourne Cup history",
        "publish_date": "Tue, 04 Nov 2025 12:06:41 +1100",
        "category": "sports",
        "authors": [],
        "text": "Married jockeys to make Melbourne Cup history\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/skybus-closer-to-going-all-electric-after-operator-scores-4b-deal-20251104-p5n7jg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "SkyBus closer to going all-electric after operator scores $4b deal",
        "publish_date": "Tue, 04 Nov 2025 11:56:26 +1100",
        "category": "finance",
        "authors": [
            "Simon Johanson"
        ],
        "text": "Australia’s SkyBus owner and operator, Kinetic, is planning a rapid expansion of its global electric bus fleet as it beds down a $4 billion-plus deal with private equity firm TPG and takes over running Stockholm’s metro train service.\n\nAfter starting the SkyBus service to Tullamarine Airport in 2015 with 50 vehicles, Melbourne-based Kinetic now runs a global fleet of buses and trains that has attracted TPG Capital to get behind the wheel of a 70 per cent stake valuing the company at more than $4 billion.\n\nThe SkyBus terminal at Southern Cross Station in Melbourne. Credit: Luis Ascui\n\nTPG bought its majority holding through its Rise Climate Fund, one of the world’s largest private markets climate platforms specialising in investing in electrification and green mobility.\n\nIn the UK, Kinetic is the largest operator of London’s iconic red double-decker buses, providing just under a third of services in the network.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/climate-change/no-australia-is-not-streaking-ahead-of-other-nations-on-climate-20251103-p5n7ck.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "No, Australia is not ‘streaking ahead’ of other nations on climate",
        "publish_date": "Tue, 04 Nov 2025 11:56:17 +1100",
        "category": "finance",
        "authors": [
            "Nick O'Malley",
            "Caitlin Fitzsimmons"
        ],
        "text": "In explaining the Nationals’ decision to abandon the policy of pursuing net zero emissions by 2050, leader David Littleproud said the party was not opposed to reducing emissions, but that it was unfair that Australia was reducing emissions so much faster than its peers.\n\n“We believe that we can peg ourselves to the rest of the world. We’re not going to be a laggard, but we’re not going to streak ahead,” Littleproud said, with direct reference to nations in the OECD.\n\nNationals leader David Littleproud said his party was not opposed to emissions reductions cuts, but Australia should not lead the pack. Credit: Alex Ellinghausen\n\nNationals senator Matt Canavan, who led a party review into net zero with his colleague Ross Cadell and the Nationals-aligned Page Research Centre, said Australia was reducing its greenhouse gas emissions at twice the rate of other rich nations, a figure that would grow to three times the rate in the coming years.\n\nIs Australia doing more than comparable countries to reduce emissions?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/tonga-we-wouldn-t-have-let-katoa-play-if-we-d-seen-this-footage-of-warm-up-clash-20251104-p5n7k3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tonga: We wouldn’t have let Katoa play if we’d seen this footage of warm-up clash",
        "publish_date": "Tue, 04 Nov 2025 11:55:45 +1100",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Tonga officials say they would have prevented Eli Katoa from playing in Sunday’s Pacific Championships match against New Zealand had they seen the damning TV footage of him being floored in a heavy collision during the warm-up.\n\nKatoa was flattened by teammate Lehi Hopoate while contesting a high ball before kick-off at Eden Park.\n\nTV commentators immediately questioned whether Katoa would be fit to play against the Kiwis, and viewers were shown replays of the sickening impact early in the game. However, the first time the Tongans were made aware of the vision was after full-time.\n\nSources with knowledge of the situation not authorised to speak publicly said Tonga staff were disappointed nobody at the ground had alerted them to the pre-game footage. The same source said they would have quickly taken action and brought in a replacement player had they seen it.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/lexus-melbourne-cup-day-race-2-ma-services-grand-handicap-20251104-p5n7md.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lexus Melbourne Cup Day: Race 2 - MA Services Grand Handicap",
        "publish_date": "Tue, 04 Nov 2025 11:49:46 +1100",
        "category": "sports",
        "authors": [],
        "text": "Lexus Melbourne Cup Day: Race 2 - MA Services Grand Handicap\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/free-power-labor-solar-sharer/hnternt0d",
        "title": "Will you benefit? Here's how Labor's three hours of free power will work",
        "publish_date": "Mon, 3 Nov 2025 23:54:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian households will be able to tap into an abundance of rooftop solar to lower their power bills under a new Labor energy proposal.\n\n\n\n\n\nThe changes, announced by Energy Minister Chris Bowen on Tuesday, will give consumers free access to electricity for three hours each day.\n\n\n\n\n\nSolar panels are installed on over four million rooftops across Australia. The scheme aims to access solar power generated throughout the day and incentivise Australians to change their habits, shifting some energy use from the busy evening period to the free block.\n\n\n\nREAD MORE Why your energy bills could be getting higher and what you can do about it\n\nAnalysis from the federal energy department showed that a single-person household could save 9 per cent on bills by shifting 10 per cent of its energy use to the free period.\n\n\n\n\n\nIt comes a month after renewable energy surpassed coal as the major source of power generation in Australia, amid ongoing political debate over the nation's energy future.\n\n\n\nHow will it work?\n\nThe Solar Sharer program will be introduced to the default market offer, which acts as a minimum standard for plans and prices offered by electricity retailers.\n\n\n\n\n\nFree electricity will be provided during the middle of the day when solar power generation peaks, Bowen said, and would deliver benefits across the network.\n\n\n\nEnergy Minister Chris Bowen says the scheme will be accessible to all Australians, whether they own or rent. Source: AAP / Lukas Coch \"People who are able to move electricity use into the zero-cost power period will benefit directly, whether they have solar panels or not and whether they own or rent,\" he said.\n\n\n\n\n\n\"The more people take up the offer and move their use, the greater the system benefits that lower costs for all electricity users will be.\"\n\n\n\n\n\nOther changes proposed for the default offer include restricting marketing and competition costs embedded in prices.\n\n\n\nHow do you access the Solar Sharer scheme?\n\nTo access the program, Australians will need to sign up through their energy providers and have a smart meter installed.\n\n\n\n\n\nFor properties with solar panels, smart meters are part of the existing installation costs.\n\n\n\n\n\nIt is unclear how energy providers will navigate charging the installation cost, roughly $100 to $200, for homes without solar.\n\n\n\nREAD MORE Labor to offer discounts for home batteries in solar energy pledge\n\nHouseholds in NSW, south-east Queensland and South Australia will have access to the scheme from June 2026.\n\n\n\n\n\nIt will follow consultation with the Australian Energy Regulator (AER), to start on Wednesday.\n\n\n\n\n\nThe government is negotiating with other states and jurisdictions to extend the program by 2027.\n\n\n\n'Unintended consequences' of the free energy proposal\n\nRetailers including AGL, OVO and Red Energy offer free access to electricity during specified hours, and an AGL spokesperson said it would work with the government \"on the detailed design of the proposed reform policy\".\n\n\n\n\n\nHowever, often plans that include free hours charge higher supply charges or energy use rates at other parts of the day.\n\n\n\n\n\nThe AER is expected to oversee the Solar Sharer scheme and ensure Australians get a good deal.\n\n\n\n\n\nLouisa Kinnear, CEO of the Australian Energy Council, the peak body for electricity retailers, says the energy sector was caught by \"surprise\", with the lack of consultation risking \"damaging industry confidence, as well as creating the potential for unintended consequences\".\n\n\n\n\n\n\"In developing energy products such as those that offer free energy for a period of time, retailers, and in particular, smaller retailers, need to carefully consider their exposure to the market, their hedging strategy, the impact of network costs, and a range of other factors,\" she said in a statement.\n\n\n\nREAD MORE Powerless: The hidden crisis of prepaid energy and First Nations communities\n\n\"These factors are not identical for all retailers, and universal access to a product places material risks on retailers that in some instances might only be mitigated by them exiting a market.\"\n\n\n\n\n\nAER chair Clare Savage said the changes could help to address peak demand on Australia's energy network.\n\n\n\n\n\n\"Shifting more demand to the middle of the day would lower the cost of the electricity system for all consumers as we don't need to build as much generation or poles and wires to meet the evening peak,\" she said.\n\n\n\n\n\nRenewable energy contributed 48.8 per cent of Australia's power during September, according to research company Rystag Energy, while coal represented 47.6 per cent.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/new-concussion-guidelines-launched-to-help-patients-get-the-right-care/qf7c6wjso",
        "title": "New concussion guidelines launched to help patients get the right care",
        "publish_date": "Mon, 3 Nov 2025 23:09:33 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nGrowing up in a sporting nation can come with its share of head-knocks.\n\n\n\n\n\nEvery year, nearly a quarter of a million people in Australia and New Zealand require medical attention for concussions, at an estimated annual cost of $100 million.\n\n\n\nConcussion is a challenge that has followed 19-year-old Megan Butner on and off the pitch. She's still living with the lasting symptoms of repeated concussions.\n\n\n\n\"Concussions I've had have been a lot of injuries because of running into things, because of symptoms I've had along the way. I've had a lot of balance and coordination issues; I've had headaches. I've had memory loss. I've had sleep issues and mood issues.\"\n\n\n\nThe local GP or emergency department is often the first place people go when they're in a daze.\n\n\n\nBut research suggests up to half of those who sustain a concussion don't get the care they need.\n\n\n\nProfessor Karen Barlow is an academic paediatric neurologist at the University of Queensland, specialising in acquired brain injury in children and adolescence.\n\n\n\n\n\nShe says the knowledge gap needs to be addressed.\n\n\n\n\"We found that a lot a people do fall through the cracks. So community sport, or just simple falls and bad luck, and (they) were given information such as don't do anything, stay at home, don't be in a dark room, don't do any exercise. Actually all those things we know now are the wrong things to do after a concussion.\"\n\n\n\nProfessor Barlow is the author of the report published in the Medical Journal of Australia which describe initial diagnosis and assessment as a critical first step.\n\n\n\n\n\nUniversity of Queensland researchers led the development of the guidelines, which say patients should then receive clear, age-appropriate, advice on what symptoms to look out for, as well as when to follow up with a healthcare professional, if they persist.\n\n\n\nProfessor Barlow again:\n\n\n\n\"Patient education is really important; so that the people who have experienced concussion know what to expect. What's recovery, what's normal symptoms after a concussion and how long should these symptoms last? And what can the clinician recommend to help them recover more speedily. And then, following on from that, say a person has really severe headaches, what can they do to manage those headaches, to manage dizziness, to manage those mood problems. To make sure people get the care that they need in a timely fashion.\" The new model of care, called 'Mind the Gap', states that patients can be advised to \"safely and gradually\" resume normal activity as early as 24 hours post-injury.\n\n\n\nThis includes light physical activity.\n\n\n\nBut advice on returning to sport should be individualised - and based on a patient's symptoms.\n\n\n\nLeft untreated, these can have serious effects on a person's work, school performance and social function.\n\n\n\nNow a university student, Megan Butner is no longer playing sport.\n\n\n\nBut she's learnt to juggle the demands of a full life, with the help of specialist concussion care.\n\n\n\nShe hopes this will be made more accessible because of these guidelines.\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/when-power-isnt-guaranteed-indigenous-families-in-northern-australia-face-deadly-risks-in-extreme-heat/ax4dvkwbk",
        "title": "When power isn’t guaranteed: Indigenous families in northern Australia face deadly risks in extreme heat",
        "publish_date": "Mon, 3 Nov 2025 20:21:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nBernadette Angus lives in the remote Western Australian community of Ardyaloon on the Dampier Peninsula, more than two and a half thousand kilometres from Perth.\n\n\n\n\n\nThe first thing she does when she wakes up in the morning isn’t check her phone, or the weather.\n\n\n\n\n\n\"Hello; this is our typical house, in Ardyaloon.\"\n\n\n\n\n\nIt's the small digital screen fixed to her wall: her electricity meter.\n\n\n\n\n\nWhen the number on the meter hits zero, the lights go dark.\n\n\n\n\n\nThat's because here, and in many remote Indigenous communities across northern Australia, households don’t receive electricity bills.\n\n\n\n\n\nInstead, they prepay for power, topping up credit much like a mobile phone - and when the money runs out, the power cuts off almost instantly.\n\n\n\n\n\n\"All depends like if you've got a job, if you are on the dole, or if you just have to live from week to week... Because $20 it will only last maybe one day. All depends on what you got. You got a deep freezer, you got a fridge, and air conditioning. But when my kids come I would have all three going.\"\n\n\n\n\n\nA day’s worth of power can cost twenty to forty dollars, sometimes even more during the summer heat.\n\n\n\n\n\nBernadette says she’s constantly rationing her usage, especially when her three kids are home.\n\n\n\n\n\nBack on the road, about twenty-seven kilometres south, in the neighbouring Indigenous community of Djarindjin,\n\n\n\n\n\n\"I go to the shop and buy $20 power\"\n\n\n\n\n\nAudrey Shadforth has a similar story.\n\n\n\n\n\nAudrey says her power ran out just the night before we interviewed her.\n\n\n\n\n\n\"We had power all night then about 9pm it go off. By 8.40 we have to hurry look for power, look for some money to pay for power. That only gave me like what, few minutes.\"\n\n\n\n\n\nAcross Australia, around fifteen thousand First Nations households use prepaid electricity.\n\n\n\n\n\nFor most, it’s not a choice; it’s the only option their retailer offers.\n\n\n\n\n\nA report by Original Power, together with Notre Dame’s Nulungu Research Institute and Western Sydney University, reveals just how widespread the issue is.\n\n\n\n\n\nIt found some sixty-five thousand First Nations people live under mandatory prepayment systems — with homes disconnected on average more than thirty times a year.\n\n\n\n\n\nLloyd Pigram is from the Broome Nulungu Research Institute.\n\n\n\n\n\nHe's one of the researchers who conducted interviews in remote communities to help deliver the report, called The Right to Power.\n\n\n\n\n\n\"Old people with chronic illnesses running out of power as we were doing the survey, to people actually needing top up as we were doing the interviews... It's hard not to get emotional or angry because it is like the power's off and they've actually got not long left to live. They are struggling to you know, they know the power on.\"\n\n\n\n\n\nThe reason for this is that in remote parts of Australia, many communities were never connected to the main power grid and relied on small local systems, which made billing and payments hard to manage.\n\n\n\n\n\nSo power companies introduced prepaid meters, ensuring bills were covered upfront, but also creating a system where regulators have focused more on collecting payments than protecting people’s right to power.\n\n\n\n\n\nDr Josie Douglas from the Central Land Council says without stronger consumer protections, communities will continue to fall behind national Closing the Gap targets.\n\n\n\n\n\n\"Out of the four jurisdictions, the Northern Territory fairs the worst. This is outrageous. Aboriginal people in remote communities are experiencing 59 disconnections per year. We know the disconnections have a very strong correlation with heat. When the temperature rises, disconnections increase.\"\n\n\n\n\n\nThe report warns that with extreme heat becoming more frequent, the consequences of power loss can be deadly.\n\n\n\n\n\nThe CEO of Energy Consumers Australia Brendan French says that no electricity means no refrigeration for food or medication, no cooling, and no access to safety alerts during heatwaves or cyclones.\n\n\n\n\n\n\"There are tens of thousands of households living without the consumer protections that you and I enjoy. And also none of the opportunities as an irony, that in centre of Australia a hundred days over 35 degrees, people can't get access to solar power to reduce their bills. The brilliance of this report though, is that it doesn't just focus on history or injustice and equality. It focuses on the roadmap.\"\n\n\n\n\n\nIn a statement, Climate and Energy Minister Chris Bowen said the government has received the report and appreciates the information about energy security in remote communities — but has stopped short of any firm commitment, saying energy delivery remains the responsibility of states and territories.\n\n\n\n\n\nA Western Australian government spokesperson said it will consider the report’s recommendations, highlighting Horizon Power’s rollout of advanced metering and solar programs to improve reliability and energy equity in remote communities.\n\n\n\n\n\nThe Northern Territory government also says it would also review the report and consider any recommendations to improve coordination or simplify access to relief programs, while Horizon Power added that it provides hardship support and energy coaching, but that wider policy decisions rest with government.\n\n\n\n\n\nWith extreme weather events like heatwaves predicted to become more frequent, keeping the power on has never been more important.\n\n\n\n\n\nBack in Ardyaloon, Bernadette Angus says her community has learned to look after one another.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-these-skincare-products-with-a-banned-ingredient-are-still-being-sold-in-australia/6zz7tsa7t",
        "title": "Why these skincare products with a banned ingredient are still being sold in Australia",
        "publish_date": "Mon, 3 Nov 2025 18:36:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Six skincare brands have been ordered to withdraw their products from shelves across NSW after being found to contain microbeads — tiny plastic particles banned under state law.\n\n\n\n\n\nThe NSW Environment Protection Authority (EPA) has issued compliance notices to six companies, including Coles Group and Natio, ordering them to stop supplying the products.\n\n\n\n\n\nOne expert says the finding is a sign that \"stronger\" government regulation is needed to outlaw microbeads, particularly on a federal level.\n\n\n\n\n\nAnother worries that inconsistent bans and definitions mean consumers could still be exposed to microbeads, even in everyday items like toothpaste.\n\n\n\nREAD MORE The tiny particles infiltrating our bodies and causing big problems for Australia\n\nWhat products have been pulled from shelves?\n\nSix beauty brands have been ordered to pull their products from NSW shelves after it was found they contained microbeads, which have been banned in the state since 2022.\n\n\n\n\n\nThe brands (across eight products) are:\n\n\n\n\n\n- Aesthetics Skincare Pty Ltd — Aesthetics Bio Fermented Triple Action Scrub\n\n\n\n- Coles Group Ltd — KOi For Men Cleansing Face Scrub Oat & Desert Lime\n\n\n\n- Frostbland Pty Ltd — Alya Skin Pomegranate Exfoliator Facial Scrub and Exfoliating Sorbet\n\n\n\n- JMSR Australia Pty Ltd — Jan Marini Bioglycolic Resurfacing Body Scrub and Jan Marini Cranberry Orange Exfoliator\n\n\n\n- McPherson’s Consumer Products Pty Ltd — Dr LeWinn’s Essentials Gentle Exfoliant Weekly Facial Polishing Gel\n\n\n\n- Natio Pty Ltd — Natio Men’s Purifying Face Scrub and Natio Ageless Skin Renewal Exfoliator\n\n\n\n\n\nThe NSW Environment Protection Authority has ordered six beauty brands to pull products from shelves after it was found they contained banned microbeads. NSW EPA CEO Tony Chappel said microbeads come at a significant environmental cost and said they \"don't belong in skincare or our waterways\", adding that they can \"threaten marine life and people's health\".\n\n\n\n\n\nChappel said several of the banned items used \"bioplastics such as polylactic acid (PLA) and cellulose acetate\", both bioplastics made from natural, renewable sources. However, Chappel said they \"don't readily break down in the environment and are still defined as plastic\" under NSW's Plastic Reduction and Circular Economy Act 2021.\n\n\n\n\n\nHe added that companies were quick to remove the product from shelves once notified and that the EPA was working with major retailers, including Chemist Warehouse and Priceline, to get affected products off shelves.\n\n\n\n\n\nBut the order only extends within NSW — meaning some of the same products can still be sold elsewhere in Australia.\n\n\n\nWhat are microbeads and why are they banned?\n\nMicrobeads are tiny pieces of plastic used in cosmetics and personal care products, usually for exfoliation.\n\n\n\n\n\nThey were once common in cosmetics and personal care products to add texture, exfoliate or extend shelf life.\n\n\n\n\n\nBecause they aren't biodegradable, when they're washed down drains and enter waterways, they can be ingested by fish and other marine life.\n\n\n\n\n\nTara Jones from the Australian Marine Conservation Society says microplastics like microbeads are a \"huge problem\" for the ocean and its wildlife.\n\n\n\n\n\n\"Microplastics are almost impossible to remove once they enter the environment,\" Jones told SBS News. \"These microplastics don't disappear once they're washed down the drain — they persist in the environment, continuing to harm marine animals and plants.\"\n\n\n\n\n\n\"Animals of all sizes ingest microplastics, from tiny plankton to whales.\"\n\n\n\nThey're also turning up inside human bodies, something that worries Dr Karen Raubenheimer, a senior lecturer at the University of Wollongong.\n\n\n\n\n\n\"Whenever we look in the body and the environment, we find microplastics,\" Raubenheimer told SBS News. \"Different shapes of microplastics seem to collect in different places — including the gut and brain.\"\n\n\n\n\n\nShe said the plastics themselves can cause harm, but they can also leach chemicals absorbed from the products they're in. \"It's not just an environmental thing, it's a human health thing. It's water quality, food security, it's all in the soils,\" she said.\n\n\n\nA patchwork of bans\n\nAustralia doesn't have a national ban on microbeads.\n\n\n\n\n\nInstead, several states and territories have implemented their own rules targeting \"rinse-off\" personal care products — such as face scrubs and body washes — as part of broader single-use plastic restrictions.\n\n\n\n\n\nRinse-off microbeads are banned in:\n\n\n\n\n\n- NSW (since November 2022)\n\n\n\n- ACT (since July 2023)\n\n\n\n- WA (since September 2023)\n\n\n\n- QLD (since September 2023)\n\n\n\n\n\nThe Northern Territory has also proposed banning rinse-off microplastic products, set to be implemented in 2025.\n\n\n\n\n\nVictoria, South Australia, and Tasmania have not outlawed microbeads.\n\n\n\n\n\nJones said that while a voluntary phase-out of microbeads in rinse-off products had been \"quite successful\", the EPA's recent enforcement shows a need for \"stronger government regulation\".\n\n\n\n\n\nShe said identifying microbeads can also be difficult for consumers: \"Customers shouldn't need a degree in polymer science to know whether the product they're using has plastic intentionally added to it.\"\n\n\n\nThere's no federal ban on microbeads. Instead, each state and territory sets its own rules. Source: SBS News\n\nWhy regulation remains murky\n\nRaubenheimer said the current bans are narrow in scope and inconsistently applied.\n\n\n\n\n\nShe explained that most state bans only apply to \"rinse-off\" products, which leaves room for interpretation. \"Toothpaste could be interpreted as a rinse-off product because you rinse your mouth,\" she said.\n\n\n\n\n\nMicrobeads can also be found in products like sunscreens, makeup and glitter, which often fall outside the definitions used in current bans.\n\n\n\nRaubenheimer said this patchwork approach makes it difficult for industry to comply. \"If it's in one state and not the other, often these products creep across the border. It's very hard to police,\" she said.\n\n\n\n\n\nShe added that more transparency is needed: \"For us on plastics, it's all about disclosure and traceability. Every time you regulate something, you're almost legitimising something that falls outside of that definition or that regulation, so trying to get them to disclose what's in the property is key so that we can track things.\"\n\n\n\n\n\nJones said while the current bans were a \"great start\", more needed to be done.\n\n\n\n\n\n\"Banning intentionally-added microplastics in rinse-off personal care is a great start, but there are so many other products that contain microbeads that don't fit this category — cleaning products, makeup, moisturisers and deodorants often have microplastics in them, but these aren't covered by the state bans or voluntary phase-out,\" she said.\n\n\n\nLISTEN TO Environmentalists say plastic decision is the final straw SBS News 03:57 English\n\nHow to check if a product has microbeads\n\nTo figure out if a product has microplastics in it, you'll need to look at the ingredients list.\n\n\n\n\n\nCommon microbead ingredients include:\n\n\n\n\n\n- ​​Polyethylene (PE)\n\n\n\n- Polyethylene terephthalate (PET)\n\n\n\n- Polypropylene (PP)\n\n\n\n- Polymethyl methacrylate (PMMA)\n\n\n\n- Nylon (PA)\n\n\n\n\n\nYou can also download the Beat the Microbead app, which allows you to scan a product's barcode to see if it contains microbeads.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/traditional-owners-call-for-iconic-saltwater-crocodile-old-faithful-to-be-returned/pkuxmo8x1",
        "title": "Traditional owners call for iconic saltwater crocodile Old Faithful to be returned",
        "publish_date": "Mon, 3 Nov 2025 08:38:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Traditional owners call for iconic saltwater crocodile Old Faithful to be returned\n\nPublished 3 November 2025, 6:19 am\n\nTraditional owners are calling for an iconic saltwater crocodile to be returned to country. The reptile was re-homed at the weekend following concerns over aggressive behaviour. But Indigenous leaders say proper consultation needs to occur.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/new-national-guidelines-aim-for-greater-consistency-in-the-treatment-of-concussions/9px9kxbhy",
        "title": "New national guidelines aim for greater consistency in the treatment of concussions",
        "publish_date": "Mon, 3 Nov 2025 08:37:48 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "New national guidelines aim for greater consistency in the treatment of concussions\n\nPublished 3 November 2025, 6:16 am\n\nNew national guidelines for the treatment of concussion have been released. They are aimed at helping healthcare professionals treat patients with greater consistency, with fears some are not receiving the right care.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/senate-inquiry-reveals-optus-left-government-in-the-dark-for-hours-about-triple-zero-outage/gnxtnwtr6",
        "title": "Senate inquiry reveals Optus left Government in the dark for hours about triple zero outage",
        "publish_date": "Mon, 3 Nov 2025 08:28:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "Senate inquiry reveals Optus left Government in the dark for hours about triple zero outage\n\nPublished 3 November 2025, 6:04 am\n\nThe chair of embattled telco, Optus, has vowed there will be repercussions from September's triple-zero outage that's linked to three deaths. A Senate Inquiry has heard Optus kept the government in the dark for hours.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/urgent-calls-for-reform-of-pre-paid-electricity-system-in-remote-first-nations-communities/wrj8cdf8t",
        "title": "Urgent calls for reform of pre-paid electricity system in remote First-Nations communities",
        "publish_date": "Mon, 3 Nov 2025 08:14:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Urgent calls for reform of pre-paid electricity system in remote First-Nations communities\n\nPublished 3 November 2025, 6:01 am\n\nCalls are growing for urgent reforms of electricity supply in remote areas of Australia, where access is provided through a pre-paid system. A report by community-based First Nations group, 'Original Power' has been given to the federal government, outlining the hidden toll of such arrangements. SBS WA Correspondent Christopher Tan reports from the Dampier Peninsula in Western Australia's Kimberley region.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/ceo-series-westpac-ceo-anthony-miller-on-results-rates-outlook-restructure-and-ai/dzgvgbffy",
        "title": "CEO SERIES: Westpac CEO Anthony Miller on results, rates outlook, restructure and AI",
        "publish_date": "Mon, 3 Nov 2025 08:06:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/rush-to-extract-resources-from-celestial-bodies/lhnvtu9nw",
        "title": "Rush to extract resources from celestial bodies",
        "publish_date": "Mon, 3 Nov 2025 06:14:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Rush to extract resources from celestial bodies\n\nPublished 3 November 2025, 5:37 am\n\nFrom exploring the depths of the ocean to the final frontier, are we on the verge of a gold-rush in space? Commercial players are increasingly exploring the possibility of space mining and the opportunities it could create, both in space and on Earth.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-the-rba-decision-means-for-the-sense-of-urgency-in-the-property-market-this-spring/i8zqcbq8n",
        "title": "What the RBA decision means for the 'sense of urgency' in the property market this spring",
        "publish_date": "Mon, 3 Nov 2025 05:43:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "The number of new property listings historically peaks in spring, and a combination of rising prices and stagnant interest rates could mean the market continues to \"heat up\".\n\n\n\n\n\nDespite an increase in the number of people looking to sell their homes, data shows that low housing stock remains an issue for first home buyers across Australia.\n\n\n\n\n\nMeanwhile, the Reserve Bank of Australia (RBA) is expected to hold the cash rate target at 3.6 per cent at its Tuesday meeting.\n\n\n\n\n\nThe 'big four' banks are predicting there won't be another rate cut until at least February, after last week's inflation figures were above the RBA's target range.\n\n\n\nWhy is the Reserve Bank expected to hold rates steady?\n\nDavid Bassanese, chief economist at Betashares, told SBS News he does not expect a rate cut tomorrow, following \"higher than expected inflation\".\n\n\n\n\n\nIn its latest quarterly data for September, the Australian Bureau of Statistics measured the consumer price index at 3.2 per cent, above the RBA's inflation target of 2 to 3 per cent.\n\n\n\nLISTEN TO INTERVIEW: Eliza Owen from Cotality on the RBA's impact on the property market SBS News 05:48 English\n\nAnnual trimmed mean inflation — a metric that smooths out certain volatile price movements and the RBA's preferred measure — rose to 3 per cent, up from 2.7 per cent in the June quarter.\n\n\n\n\n\nIt’s the first time annual trimmed mean inflation has risen since December 2022.\n\n\n\n\n\nBassanese expected this spike to delay a rate cut until next year, as the annual trimmed mean \"eases back \" to the middle of the RBA's target range.\n\n\n\n\n\n\"I see little risk of a rate hike in the coming year, given rates are still restrictive and inflation should eventually ease,\" he said.\n\n\n\n\n\nThe big four banks are also predicting the cash rate will remain unchanged for the rest of the year.\n\n\n\nSource: SBS News ANZ predicts the next cut will be in February, whereas NAB and Westpac expect a reduction in May.\n\n\n\n\n\nCBA has not predicted any rate cuts in the immediate future.\n\n\n\n\n\nEliza Owen, head of research at property data firm Cotality, told SBS News the group has ruled out a rate cut, adding it would only \"add fuel to the fire\" of ever-increasing property prices.\n\n\n\nHow has the property market responded to rate cuts?\n\nOwen said that the property market has been \"very responsive\" to the rate reductions so far this year.\n\n\n\n\"The reason for that essentially is that it's making debt cheaper,\" she said.\n\n\n\n\n\n\"The cheaper debt is, the more it is demanded and the more that debt is flowing through to property prices.\n\n\n\n\n\n\"So generally lower interest rates lead to a faster increase in property prices.\"\n\n\n\nSource: SBS News As the cash rate target is anticipated to remain steady until at least February, this could lead to a slowing down of the market towards the end of the year, Owen added.\n\n\n\n\n\nOwen predicted the market would also cool off in the summer, following the annual spring \"bump\" in sales and listings.\n\n\n\nA springtime 'sense of urgency'\n\nThe highest numbers of new listings in Australia typically come in spring (September to November) as people look to sell their homes when the climate helps their properties look \"at their best\" as \"gardens are in full bloom\".\n\n\n\n\n\nThere have been around 43,000 listings added to the market in the last few weeks, Owen said, which is down around 1,000 homes compared to previous years.\n\n\n\n\n\nWhile lower than usual, it is still the highest number of listings predicted for the year.\n\n\n\nHousing stock is also 18 per cent below the historic average, with around 129,000 properties across Australia currently for sale.\n\n\n\n\n\n\"There are just more buyers than there are people listing their property. And that depletes total stock, creates a sense of urgency and leads to the situation we have now, where property values are rising,\" Owen said.\n\n\n\nA 'tight market' that still holds opportunity\n\nChris Lewis, director of Lyric Finance, told SBS News the underlying issue with the Australian property market is supply.\n\n\n\n\n\n\"There is not enough stock in the housing market,\" he said.\n\n\n\n\n\n\"Typically, when there are more buyers than sellers, prices are going to increase.\"\n\n\n\n\n\nLewis described the property market as looking \"particularly tight\", but said it's \"never been a better time for first-time buyers.\"\n\n\n\nSource: SBS News He said the newly introduced 5 per cent deposit scheme for first home buyers is a \"good opportunity\" to get into the market.\n\n\n\n\n\n\"You can save on that large deposit for starters,\" he said.\n\n\n\n\n\nFor first home buyers looking to access the scheme or make the most of the bump in spring listings, Lewis recommended getting pre-approval from a lender.\n\n\n\n\n\n\"Whenever you're looking to take on a transaction of buying property, the first step is talking to a mortgage broker and understanding what's possible and getting that re-approval in place for the bank, so you can start making offers on property with confidence.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/optus-ceo-berated-at-parliamentary-inquiry-evening-news-bulletin-3-november-2025/vt455pu3m",
        "title": "Optus CEO berated at Parliamentary Inquiry | Evening News Bulletin 3 November 2025",
        "publish_date": "Mon, 3 Nov 2025 05:02:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Optus CEO accused of “putting ducks in order before alerting government of major outage”\n\nBaby Priya’s bill passes parliament to protect paid parental leave after bereavement\n\nArsenal leads English Premier League scoreboard, Manchester City in second spot\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nGreens Senator Sarah Hanson Young has condemned the CEO of Optus at a parliamentary inquiry, which is examining the telco's triple zero outage linked to three deaths.\n\n\n\n\n\nA committee hearing today has revealed that senior management failed to inform the minister or the regulator, ACMA, about the outage until 2:30pm the next day.\n\n\n\n\n\nThat was after fatalities had already occurred.\n\n\n\n\n\nMs Hanson-Young has accused Mr Rue of being more concerned with protecting the company than informing the government of the severity of the failure.\n\n\n\n\n\n\"You were too busy putting your ducks in order, telling your board what was going on, contacting your executives, making sure your companies ducks were in order.\"\n\n\n\n---\n\n\n\n\n\nA bill that bans employers from cancelling workers' paid parental leave due to stillbirth or the early death of a child, has passed the Senate.\n\n\n\n\n\nThe bill is named after baby Priya, who died 42 days after her birth.\n\n\n\n\n\nHer mother's employer of 11 years subsequently cancelled her pre-approved paid parental leave, and she had to negotiate a return-to-work timeline while still grieving the loss.\n\n\n\n\n\nEmployment and Workplace Minister, Amanda Rishworth, says she hopes the bill will not only guarantee grieving parents' right to access their parental leave, but also help create a more compassionate working environment in Australia.\n\n\n\n\n\n\"This is a good day for parents, and I hope it not only gives people right in this circumstance but brings out of the shadow our conversation about stillbirth and earth death (of a child).\"\n\n\n\n---\n\n\n\n\n\nSouth Australia's government has opened a ballot for a cashback program that authorities hope will boost businesses impacted by the algal bloom.\n\n\n\n\n\nThe ballot will select a group of South Australian diners for the Summer Plan Dining Cashback program, to be used when they spend money at seafood retailers and coastal hospitality businesses.\n\n\n\n\n\nThe first ballot draw will give out 60,000 cashbacks, with over 265 businesses across the state participating in the program.\n\n\n\n\n\nSouth Australian Premier Peter Malinauskas says the initiative will help the hospitality sector to remain resilient.\n\n\n\n\n\n\"50,000 vouchers a month, 300,000 vouchers throughout the cause of daylight saving, will really stimulate a lot of people to go and enjoy our coastline and support businesses that support South Australians in and around summer on our coast.\"\n\n\n\n---\n\n\n\n\n\nDonald Trump has doubled down on a threat to take military action in Nigeria but the West African nation is playing down the possibility.\n\n\n\n\n\nIn the latest development, presidential adviser Daniel Bwala has said his government is familiar with Mr Trump's personal style on social media, and therefore don't take his warning of sending U-S troop to Nigeria literally.\n\n\n\n\n\n“We don't take (his comment on social media) literally because we know Donald Trump thinks well of Nigeria. Donald Trump was the first American president to lift the embargo on the sale of arms, use the executive order, and then authorise the sale of arms to Nigeria in 2017 or so when he came.”\n\n\n\n\n\nNigeria says it would welcome the U-S support for fighting Islamist insurgents as long as its territorial integrity is respected.\n\n\n\n\n\nThe country of more than 200 million people and around 200 ethnic groups is divided between the largely Muslim north and mostly Christian south.\n\n\n\n---\n\n\n\n\n\nResearchers at the University of Queensland have developed Australia's first national guideline on managing the aftermath of a concussion.\n\n\n\n\n\nThe University says that around 240,000 people in Australia and New Zealand require medical attention for concussions every year , at an estimated annual cost of $100 million.\n\n\n\n\n\nProfessor Karen Barlow is a paediatric neurologist who has led the development of the national guideline.\n\n\n\n\n\nShe says many GPs are confident in diagnosing concussions but may not feel the same when it comes to managing the care.\n\n\n\n\n\n\"What these guidelines do is they give us a roadmap for what the GP can do. How do they assess tools that they need to assess them, what are the diganoses could be clouding the issues, and what they can do to help.\"\n\n\n\n---\n\n\n\n\n\nTo sport and in football,English Premier League leaders, Arsenal, have extended their advantage with a 2-nil win against Burnley.\n\n\n\n\n\nFirst-half goals from Viktor Gyokeres [[yaw-keh-ress]] and Declan Rice were enough to make it nine wins in a row for the Gunners and put further distance between them and the chasing pack.\n\n\n\n\n\nMeanwhile, Manchester City have comfortably beat Bournemouth 3-1 and provided the perfect response to last week's defeat at Aston Villa, a win that moves them into second place in the league table.\n\n\n\n\n\nBut Manchester City manager, Pep Guardiola, says the team has a lot of work to do yet.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/what-on-earth-optus-defends-fatal-outage-response-at-senate-inquiry/o7muelt2u",
        "title": "'What on earth?': Optus defends fatal outage response at Senate inquiry",
        "publish_date": "Mon, 3 Nov 2025 04:59:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nA Senate inquiry has kicked off into Optus's September outage where hundreds of people were not able to call triple 000, and was ultimately linked to three deaths.\n\n\n\n\n\nPrime Minister Anthony Albanese welcomed its beginning.\n\n\n\n\n\n\"Ah look.. Optus failed the common sense test of delivering for their customers and the committee inquiry today is an opportunity for those issues to be pursued.\"\n\n\n\n\n\n\n\nCoalition senator Sarah Henderson, who is on the committee, has condemned Optus for the outage.\n\n\n\n\n\nHowever, her sticking point was with the government and the Australian communications and media authority (A-C-M-A), which is yet to testify at the inquiry.\n\n\n\n\n\nShe says there was a six-month delay in implementing rules that compel telcos to advise emergency services and the regulator of an outage in real time.\n\n\n\n\n\n\"The regulator in charge of this matter is like putting Dracula in charge of the blood bank. That is simply not good enough. We know the regulator also made a number of big mistakes including imposing a range of rules to improve the triple 000 service, but waiting 6 months for that to come into effect - they were made in April and they didn’t come into effect until the first of November - they are really important rules like advising the telco carriers to advise emergency services in real time when there is a triple zero outage.\"\n\n\n\n\n\nGreens senator Sarah Hanson-Young has been leading the senate inquiry.\n\n\n\n\n\nThe focus is on the timeline of when Optus CEO Stephen Rue learned deaths were linked to the outage.\n\n\n\n\n\nMr Rue has told the inquiry that senior management were informed in an email after midnight, a message that they read the next morning.\n\n\n\n\n\nThe chief executive says he himself learned the news at about 8:15 am on September 19 — 12 hours after Optus was aware.\n\n\n\n\n\n\"And that was not until the following day, and the following day was when we were aware of the events that had unfolded and the information was fast coming to light. But it was fast coming to light as they do in these kind of circumstances unfortunately.\"\n\n\n\n\n\nDid Mr Rue call the regulator? No.\n\n\n\n\n\nDid he call the Communications Minister Annika Wells? No.\n\n\n\n\n\nHe says he called the watchdog chair at 2:30 pm - and he called Minister Wells at 4:00 pm.\n\n\n\n\n\nMs Hanson-Young put it to Mr Rue that the delay shows he was more concerned with protecting the company than informing the government of the severity of the failure.\n\n\n\n\n\n\"It took you 6 hours to inform the federal government… you were too busy putting your ducks in order, telling your board what was going on, contacting your executives, making sure your companies ducks were in order. Meanwhile, the federal govt, the regulator, the minister were left in the dark. The information you told them the day before was wrong. You let it sit there, being wrong, deadly wrong.\"\n\n\n\n\n\nMr Rue has argued the delay was to ensure \"accuracy,\" rejecting Ms Hanson's characterisation that he was making sure his corporate ducks were in order.\n\n\n\n\n\n\n\nMr Rue argued that the delayed communication had minimal public impact as Triple Zero calls were operational beforehand.\n\n\n\n\n\n\"The network issue had been resolved. The triple zero calls were operating and there was, there was no danger to the public in the sense that they weren’t able to make 000 calls…The outage had been informed the day before…accepting the fact that we thought it was fewer missed calls. The judgement I had was that it was best to get the information accurately together and then inform the regulator, the department and minister’s office.\"\n\n\n\n\n\nLiberal Senator Sarah Henderson has asked how Optus never detected the outage on its own - and why the telco had not been testing its triple zero calls during a firewall upgrade.\n\n\n\n\n\nShe has also asked why Mr Rue should keep his job.\n\n\n\n\n\nOptus chairman John Arthur says that Rue was hired to fix these failures and expects him to finish the job.\n\n\n\n\n\nMr Rue has stood by his leadership.\n\n\n\n\n\n\"I do believe that another change of leadership would actually set back that plan which would not be good for customers and the telecommunications sector.\"\n\n\n\n\n\nThe issue of compensation has also arisen during the hearing, and whether or not it has been offered to the families.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nfl/how-us-raider-sport-transcends-local-bids-for-brisbane-2032-20251103-p5n7e2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How US raider sport ‘transcends’ local bids for Brisbane 2032",
        "publish_date": "Tue, 04 Nov 2025 12:33:20 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "The incentives While Australia had high hopes entering the Asia-Oceania Flag Football Championships in their bid to qualify for the World Cup, Stegman sensed their rivals had largely written them off. It made the triumph all the sweeter. “The moment itself was pure jubilation,” he said. Jared Stegman in action for Australia at the Asia-Oceania Flag Football Championships.\n\n“The women’s team was there as well and have been a big factor in our lead-up, so they came onto the field and everyone was getting around each other. “It was unexpected, from our own expectations and training it was expected, but no one thought in their wildest dreams we’d be gold medallists.” Stegman has been involved in American football for 18 years. The 35-year-old has plied his trade around the globe – playing in Australia, Turkey, Sweden, Japan and Germany. But never had an Olympics tilt crossed his mind.\n\nLoading “It’s definitely given me a new purpose. I’m a high school head of department for English and playing football for fun, and this has started a new fire,” Stegman said. “I always wanted to play for the challenge, which is why I went overseas, because American football is not well regarded, funded and overly competitive here, so this new opportunity is amazing. “The chance is crazy, it’s unbelievable, and we’ve achieved the first step.” This year, the NFL announced it would release its players to make them available for selection at the LA Games, opening the door for Australian prospects to take on the best of the best on their home turf, such as three-time Super Bowl champion Patrick Mahomes.\n\nPathways through the National Collegiate Athletic Association (NCAA) in the US also present study and travel opportunities. “We’ve had people trying to get into the Australian team because they see this as a shot to go to the Olympics, and particularly to play the US guys in LA,” Kelly said. “It transcends a lot of sports.” Rival code raid Kelly had previously declared Australian stars such as Sydney Rooster-turned-Wallaby Joseph-Aukuso Suaalii and rugby sevens weapon Maddison Levi would be tailor-made for flag football.\n\nNow, he said, “you could name 1000”. Those to make the jump included former Wallabies star Quade Cooper, Essendon Bombers Victorian Football League talent Jacob Atley and St George-Illawarra Dragons under-21s winger Caine Barnes. Cooper did not feature at the oceania championships, having returned to Japan where he plays for the Kintetsu Liners rugby union side. Kelly said his impact at a training camp in the US was profound. Quade Cooper is “in the mix” for the flag football World Cup. Credit: Getty “He was phenomenal. The one thing Quade brings is preparation – the guy is meticulous with his preparation and thought process, and that was really beneficial for our young guys and girls,” Kelly said.\n\n“He’s in the mix for the World Cup next year, but it’s a very hard team to get into on the back of that performance.” Stegman said the transferable skills with other football codes would make the shift appealing, with Aussie rules athletes in particular blessed with the attributes needed to thrive. “Their skill set is perfect for flag football, they’re just so trained to catch and trap the ball, and every route you run you’re leading for the ball,” he said. Transferable skills include line running, catching ability and aerial prowess, while being able to respond to 360-degree opposition pressure.\n\nGrowing Australian presence Since flag football’s inclusion on the Sporting Schools program, Kelly revealed more than 50,000 juniors had come through the ranks across just five terms. In his words, “it’s exploded”. Loading When the Philadelphia Eagles conquered Kansas City in this year’s Super Bowl, 2.6 million people in Australia watched. As Melbourne prepares to host an LA Rams game in 2026 at the MCG, Kelly anticipated the game’s popularity would hit new heights.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/money/planning-and-budgeting/i-use-all-the-money-hacks-so-why-have-my-finances-stalled-20251104-p5n7li.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I use all the money ‘hacks’. So why have my finances stalled?",
        "publish_date": "Tue, 04 Nov 2025 12:29:14 +1100",
        "category": "finance",
        "authors": [
            "Paridhi Jain"
        ],
        "text": "I’ve been fixing my finances for the last few years, with the help of podcasts and books. I have a few savings buckets set up for things like travel, and I try to stick to a budget. I have some ETFs, I think my super is doing OK, and I try to make extra contributions. My problem is, I feel like I’ve stalled. I don’t know what I’m missing or whether there’s more I should be doing. I feel like I could be doing more, but I don’t know what.\n\nIn a scenario like this, what I tend to see is that you’ve implemented lots of different “tips”. You hear that a high-growth super fund is a good idea, so you switch your portfolio. You hear about buckets, so you divide up your savings. It’s a piecemeal approach to incremental changes. It’s a great start, but often what’s missing is the structures, systems and strategies that tie everything together.\n\nJust taking money advice piece by piece won’t get you where you want to be. Credit: Simon Letch\n\nStrategy\n\nDo you have a clear financial strategy? That means having a clear destination (where are you going) and a plan (how are you getting there). Without this, there’s a higher probability of making random decisions that seem like a good idea at the time, but don’t move you forward.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/paulo-loses-his-voice-after-leading-samoan-siva-tau-20251104-p5n7mx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Paulo loses his voice after leading Samoan Siva Tau",
        "publish_date": "Tue, 04 Nov 2025 12:28:54 +1100",
        "category": "finance",
        "authors": [],
        "text": "Paulo loses his voice after leading Samoan Siva Tau\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/trump-s-tariffs-face-judgement-day-and-there-s-a-lot-at-stake-20251104-p5n7ju.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s tariffs face judgment day, and there’s a lot at stake",
        "publish_date": "Tue, 04 Nov 2025 12:25:53 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The judgment day for most of Donald Trump’s tariffs looms this week, with the US Supreme Court set to hear an appeal against a lower court’s ruling that they are illegal.\n\nShould the Supreme Court rule against his administration’s reciprocal and baseline tariffs, the “Liberation Day” import levies of between 10 per cent and 50 per cent against all the countries the US trades with – and perhaps the trade and investment deals that have been struck using them as leverage – would have to be withdrawn, and the $US90 billion ($137 billion) or so in revenue the tariffs have generated so far might have to get refunded.\n\nDonald Trump said the Supreme Court hearing is “one of the most important cases in the history of our country”. Credit: Getty\n\nTrump could still have his tariffs, but he’d have to use different legislation that would involve extensive and time-consuming investigations, and couldn’t be imposed at the presidential whim. Or he’d have to resort to another law that puts a 15 per cent ceiling on tariffs, can only be used against countries with substantial trade surpluses with the US and sets a 150-day limit on the tariffs’ duration.\n\nTrump used Section 232 of the Trade Expansion Act of 1962 – which required Commerce Department investigations – for his sectoral tariffs on steel, aluminium and cars, among other products. Those tariffs haven’t been challenged.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/all-three-of-katoas-head-knocks-20251104-p5n7n1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "All three of Katoa's head knocks",
        "publish_date": "Tue, 04 Nov 2025 12:25:28 +1100",
        "category": "finance",
        "authors": [],
        "text": "All three of Katoa's head knocks\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/lexus-melbourne-cup-day-race-3-tab-trophy-20251104-p5n7mw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lexus Melbourne Cup Day: Race 3 - TAB Trophy",
        "publish_date": "Tue, 04 Nov 2025 12:22:09 +1100",
        "category": "sports",
        "authors": [],
        "text": "Lexus Melbourne Cup Day: Race 3 - TAB Trophy\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/celebrity-sitters-and-competing-artists-in-tv-series-that-lifts-lid-on-portrait-painting-20251016-p5n2yu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Celebrity sitters and competing artists in TV series that lifts lid on portrait painting",
        "publish_date": "Tue, 04 Nov 2025 12:21:04 +1100",
        "category": "entertainment",
        "authors": [
            "Kerrie O'Brien"
        ],
        "text": "On screen, Miranda Tapsell can usually be found hiding behind a character or “at least heightened version of myself”, but not this time. The much-loved actor best-known for The Sapphires and Top End Wedding makes her debut as a host in the new ABC series Portrait Artist of the Year.\n\n“That kind of guerilla television was very new to me,” says Tapsell, who had to quickly adjust to trusting her instincts and speaking her mind instead of following a script. “I can only just look at a painting and tell you what I feel.”\n\nLuke McGregor and Miranda Tapsell are the hosts of Portrait Artist of the Year on the ABC.\n\nThe five-part series, which Tapsell co-hosts alongside comedian Luke McGregor, pits professional artists against amateurs over four hours as they complete a portrait of a well-known Australian. Three subjects are painted each episode, with celebrity sitters including comedian Celia Pacquola, Gardening Australia’s Costa Georgiadis, actor Mark Coles Smith and film critic Margaret Pomeranz.\n\nThe works are then judged by National Portrait Gallery of Australia director Bree Pickering, seven-time Archibald Prize finalist Abdul Abdullah and Robert Wellington, an associate professor of art history at the Australian National University. The overall winner receives a commission for a work that will hang in the National Portrait Gallery in Canberra.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/movies/diane-ladd-triple-oscar-nominee-and-mother-of-laura-dern-dies-at-89-20251104-p5n7js.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Diane Ladd, triple Oscar nominee and mother of Laura Dern, dies at 89",
        "publish_date": "Tue, 04 Nov 2025 12:14:04 +1100",
        "category": "entertainment",
        "authors": [
            "Lindsay Bahr"
        ],
        "text": "Diane Ladd, a three-time Academy Award nominee and actor of rare timing and intensity whose roles ranged from the brash waitress in Alice Doesn’t Live Here Anymore to the scheming parent in Wild at Heart, has died at 89.\n\nLadd’s death was announced Monday by daughter Laura Dern, who issued a statement saying her mother and occasional co-star had died at her home in Ojai, California, with Dern at her side. Dern, who called Ladd her “amazing hero” and “profound gift of a mother”, did not immediately cite a cause of death.\n\nDiane Ladd in 2010, when she was awarded a star on Hollywood’s Walk of Fame. Credit: AP\n\n“She was the greatest daughter, mother, grandmother, actress, artist and empathetic spirit that only dreams could have seemingly created,” Dern wrote. “We were blessed to have her. She is flying with her angels now.”\n\nA gifted comic and dramatic performer, Ladd had a long career in television and on stage before breaking through on the big screen in Martin Scorsese’s 1974 release Alice Doesn’t Live Here Anymore. She earned an Oscar nomination for supporting actor for her turn as the acerbic, straight-talking Flo, and went on to star in the TV spin-off Alice.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/married-jockeys-to-make-melbourne-cup-history-20251104-p5n7mo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Married jockeys to make Melbourne Cup history",
        "publish_date": "Tue, 04 Nov 2025 12:06:41 +1100",
        "category": "sports",
        "authors": [],
        "text": "Married jockeys to make Melbourne Cup history\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/skybus-closer-to-going-all-electric-after-operator-scores-4b-deal-20251104-p5n7jg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "SkyBus closer to going all-electric after operator scores $4b deal",
        "publish_date": "Tue, 04 Nov 2025 11:56:26 +1100",
        "category": "finance",
        "authors": [
            "Simon Johanson"
        ],
        "text": "Australia’s SkyBus owner and operator, Kinetic, is planning a rapid expansion of its global electric bus fleet as it beds down a $4 billion-plus deal with private equity firm TPG and takes over running Stockholm’s metro train service.\n\nAfter starting the SkyBus service to Tullamarine Airport in 2015 with 50 vehicles, Melbourne-based Kinetic now runs a global fleet of buses and trains that has attracted TPG Capital to get behind the wheel of a 70 per cent stake valuing the company at more than $4 billion.\n\nThe SkyBus terminal at Southern Cross Station in Melbourne. Credit: Luis Ascui\n\nTPG bought its majority holding through its Rise Climate Fund, one of the world’s largest private markets climate platforms specialising in investing in electrification and green mobility.\n\nIn the UK, Kinetic is the largest operator of London’s iconic red double-decker buses, providing just under a third of services in the network.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/climate-change/no-australia-is-not-streaking-ahead-of-other-nations-on-climate-20251103-p5n7ck.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "No, Australia is not ‘streaking ahead’ of other nations on climate",
        "publish_date": "Tue, 04 Nov 2025 11:56:17 +1100",
        "category": "finance",
        "authors": [
            "Nick O'Malley",
            "Caitlin Fitzsimmons"
        ],
        "text": "In explaining the Nationals’ decision to abandon the policy of pursuing net zero emissions by 2050, leader David Littleproud said the party was not opposed to reducing emissions, but that it was unfair that Australia was reducing emissions so much faster than its peers.\n\n“We believe that we can peg ourselves to the rest of the world. We’re not going to be a laggard, but we’re not going to streak ahead,” Littleproud said, with direct reference to nations in the OECD.\n\nNationals leader David Littleproud said his party was not opposed to emissions reductions cuts, but Australia should not lead the pack. Credit: Alex Ellinghausen\n\nNationals senator Matt Canavan, who led a party review into net zero with his colleague Ross Cadell and the Nationals-aligned Page Research Centre, said Australia was reducing its greenhouse gas emissions at twice the rate of other rich nations, a figure that would grow to three times the rate in the coming years.\n\nIs Australia doing more than comparable countries to reduce emissions?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/tonga-we-wouldn-t-have-let-katoa-play-if-we-d-seen-this-footage-of-warm-up-clash-20251104-p5n7k3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tonga: We wouldn’t have let Katoa play if we’d seen this footage of warm-up clash",
        "publish_date": "Tue, 04 Nov 2025 11:55:45 +1100",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Tonga officials say they would have prevented Eli Katoa from playing in Sunday’s Pacific Championships match against New Zealand had they seen the damning TV footage of him being floored in a heavy collision during the warm-up.\n\nKatoa was flattened by teammate Lehi Hopoate while contesting a high ball before kick-off at Eden Park.\n\nTV commentators immediately questioned whether Katoa would be fit to play against the Kiwis, and viewers were shown replays of the sickening impact early in the game. However, the first time the Tongans were made aware of the vision was after full-time.\n\nSources with knowledge of the situation not authorised to speak publicly said Tonga staff were disappointed nobody at the ground had alerted them to the pre-game footage. The same source said they would have quickly taken action and brought in a replacement player had they seen it.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/lexus-melbourne-cup-day-race-2-ma-services-grand-handicap-20251104-p5n7md.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lexus Melbourne Cup Day: Race 2 - MA Services Grand Handicap",
        "publish_date": "Tue, 04 Nov 2025 11:49:46 +1100",
        "category": "sports",
        "authors": [],
        "text": "Lexus Melbourne Cup Day: Race 2 - MA Services Grand Handicap\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    }
]