[
    {
        "url": "https://www.9news.com.au/national/minimum-wage-paid-parental-leave-superannuation-everything-changing-for-australians-july-one-explained/499f957b-565b-4fe5-90d4-ce381ac3f664",
        "title": "Higher pay, better parental leave and more super: Everything that's changing on July 1",
        "publish_date": "Fri, 27 Jun 2025 21:05:12 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "The lives of millions of Australians are going to change next week.\n\nTuesday, July 1, marks the start of a new financial year and will see the introduction of sweeping changes from state and federal governments.\n\nFor some, these changes will mean more cash in the back pocket.﻿﻿\n\nThe lives of millions of Australians are going to change this week, meaning more cash for some. (Getty Images/iStockphoto)\n\nMany of the changes – which include ﻿increasing minimum wage, extending paid parental leave and providing energy bill relief – are aimed at reducing cost-of-living pressures for everyday Australians.\n\nNew road rules will also be rolled out across the country this week, including harsher penalties in several states.﻿\n\nHere's everything you need to know about the changes being introduced on July 1.\n\n﻿Minimum wage\n\nThe National Minimum Wage will increase by 3.5 per cent on July 1, jumping from $24.10 per hour or $915.90 per week to $24.95 per hour or $948 per week.\n\nAward wages will also increase by 3.5 per cent, meaning about 2.9 million Aussies currently on low and award wages will receive a pay rise.\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nCentrelink indexation\n\nCentrelink payments and thresholds will increase by 2.4 per cent on July 1 in keeping with regular indexation.\n\nIt's a small increase but one that will be welcomed by about ﻿2.4 million Centrelink recipients.\n\nSuperannuation﻿\n\nThe minimum amount employers are ﻿required to contribute to employees' superannuation accounts will also rise, jumping from 11.5 per cent to 12 per cent.\n\nSuperannuation will also now be paid on all government paid parental leave.﻿\n\nPaid parental leave﻿\n\nSpeaking of paid parental leave, this will increase to 24 weeks (or 120 days) from July 1 so parents can spend more time with new children.\n\nAll ﻿individual and family income limits on paid parental leave will also increase.\n\nREAD MORE: How to maximise public holidays and make the most of your annual leave in 2025\n\nClose-up of father holding his little new born baby. (Getty)\n\nSupport for students and apprentices\n\nOn top of slashing student loan debts by 20 per cent, the government is increasing the minimum income Australians must earn before ﻿they're required to start paying back their loans to $67,000 (subject to the passage of legislation).\n\nEligible nursing, midwifery, teaching and social work students will be able to $319.50 per week in Commonwealth Prac Payments from July 1.\n\nNew tradies can also expect a financial boost, with those who take up ﻿apprenticeships in housing construction set to receive $10,000 in incentive payments on top of wages.\n\nEnergy bill relief﻿\n\nAustralian households will receive another $150 in energy bill relief from July 1, as will about one million small businesses.\n\nThe government will also ﻿cover about 30 per cent of the cost of installing a battery system alongside solar energy for households and businesses looking to slash their energy bills under the Cheaper Home Batteries program.\n\nSurprising state where households fork out most for electricity View Gallery\n\nAged pension﻿\n\nFrom July 1, Australians receiving the age pension will benefit from adjusted income and asset thresholds designed to better keep up with inflation.\n\nThe cut-off point has been lowered from ﻿$481,500 to $470,000 for couples and from $321,500 to $314,000 for singles.\n\nAs a result, couples who are asset-tested will receive a ﻿$34.50 fortnight increase to their age pension payments, while singles will receive an extra $22.50 per fortnight.\n\nNational disability insurance scheme\n\nThe ﻿NDIS will introduce a number of changes this week, such as lowering the maximum rates providers can charge some NDIS participants, and removing establishment fees for participants.\n\nDisability support workers will be pleased to hear they'll also get a 3.95 per cent pay increase from July 1.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/hepatitis-a-outbreak-in-several-european-countries/8aa9a75c-def5-4950-ba34-06f739f5f3b6",
        "title": "Hepatitis A outbreak in several European countries",
        "publish_date": "Fri, 27 Jun 2025 23:13:06 +0000",
        "category": "lifestyle",
        "authors": [
            "Jun"
        ],
        "text": "A﻿ussies travelling to Europe have been urged to get vaccinated after an outbreak of Hepatitis A in several popular tourist spots.\n\nThousands of cases have been confirmed across Austria, ﻿Czechia, Hungary, Slovakia and Germany, primarily in people living in poor sanitary conditions, people who inject drugs and adults experiencing homelessness.\n\nHowever, tourists have been advised that anybody can contract the illness.\n\n﻿Czechia reported 600 confirmed cases of hepatitis A with 63 per cent being men. (Getty)\n\nPeople below 40 have a moderate risk of falling very ill from the disease, while the risk is high for people over 40, with risk increasing with age.\n\nThe risk is also very high for people with predisposing liver disease and older adults.\n\nThe risk for the broader population in these countries is assessed as low to moderate.\n\nWhat is hepatitis A?﻿\n\nPeople who contract hepatitis A do not usually report symptoms until several weeks later.\n\nInitial symptoms include tiredness, weakness, sudden nausea and diarrhoea, abdominal pain, loss of appetite, fever, dark urine, joint pain, intense itching and the yellowing of the skin.\n\nThe Mayo Clinic said symptoms may be mild and pass in a few weeks.\n\nBut hepatitis A can be more serious, long-lasting and sometimes fatal.\n\nThe virus causes liver inflammation and can impact the organ's ability to function.﻿\n\n﻿Getting vaccinated or receiving an injection of immunoglobin within two weeks of contracting the virus may prevent you from developing the disease.\n\nThe most common ways of catching the virus are from contaminated food and water or close contact with someone who has it.﻿\n\nEuropean countries experiencing Hep. A outbreak\n\nAustria : Austria has reported ﻿87 confirmed cases of hepatitis A, with another 44 non-confirmed cases under investigation.\n\n43 cases were in Vienna, where three deaths were reported.\n\nThe number of cases in 2025 has already surpassed 2024 case numbers.\n\nHepatitis virus HBV, HCV causes chronic disease, liver inflammation. Antiviral antibody treatments diagnose infection, cirrhosis, fibrosis. Biology, genotype of hepatotropic viruses affect health. 3D (Getty)\n\nCzechia: ﻿Czechia reported 600 confirmed cases of hepatitis A with 63 per cent being men.\n\nChildren aged one to nine years old were the most affected age group followed by adults aged 24-44﻿.\n\nSix deaths were reported.﻿\n\nHungary: Hungary reported 530 confirmed cases and 641 suspected cases under investigation.\n\nCases were mainly adults, ﻿with one cluster affecting 57 adults.\n\nNo deaths were reported﻿.\n\nSlovakia has seen a significant spike in hepatitis A cases since the end of 2022. (Getty)\n\n﻿Slovakia: Slovakia has seen a significant spike in hepatitis A cases since the end of 2022.\n\nA total of 850 cases have been reported with no associated deaths; 60 per cent were men.\n\nNearly half were associated with the Roma community.\n\n﻿Germany: Germany has reported three cases of hepatitis A.\n\nThe three cases involved two women and one man who reported drug use.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/lewis-capaldi-uk-singer-makes-emotional-return-to-iconic-festival-after-tourettes-struggle/bb554fe7-10d8-46aa-9f5f-381235f85940",
        "title": "UK singer makes emotional return to iconic festival after health struggle",
        "publish_date": "Sat, 28 Jun 2025 00:52:24 +0000",
        "category": "entertainment",
        "authors": [
            "Jun"
        ],
        "text": "U﻿K singer Lewis Capaldi has made an emotional return to the iconic Glastonbury music festival after taking two years off due to his struggle with Tourette's syndrome.\n\nTears and cheers overcame the crowd at Glastonbury when Capaldi walked onto the stage for his surprise performance on the festival's Pyramid Stage.\n\nIt's the first public concert the singer has performed in two years.\n\nTears and cheers overcame the crowd at Glastonbury when Capaldi walked onto the stage for his surprise performance on the festival's Pyramid Stage. (Getty)\n\nHe last played Glastonbury in 2023, but was overcome by tics and was unable to finish singing his songs. The crowd of over 200,000 then began echoing his lyrics back to him as he stood and watched in tears from the stage.\n\nUpon his return today, he ﻿again held back tears as the crowd enthusiastically greeted him.\n\n\"Glastonbury. It's so good to be back,\" the singer said from the stage.\n\n\"I'm not going to say much up here today because if I do, I think I'll probably start crying.\n\n\"But it's just amazing to be here with you all and I can't thank you all enough for coming out and coming and seeing me.\"\n\nLewis Capaldi has made an emotional return to the iconic Glastonbury Music festival after taking two years off due to his struggle with tourettes syndrome. (Getty)\n\nITV reporter ﻿Rishi Davda was in the crowd when he came on stage, telling the Today Show that Capaldi made a triumphant return.\n\n\"When Lewis Capaldi's name was put up on the big screen and he walked out, it was not like anything I've ever experienced in a number of years at Glastonbury Festival,\" he said.\n\n\"He sang every song with so much passion, but when he said that first note, you could see he was back doing what he loved.\n\n\"That kind of radiated throughout the hundred thousand people potentially, that may have been watching. It was a really, really beautiful moment.﻿\"\n\nSinger songwriter Lewis Capaldi walks onto the Pyramid Stage during day three of Glastonbury festival 2025 at Worthy Farm, Pilton on June 27, 2025 in Glastonbury, England. Established by Michael Eavis in 1970, Glastonbury has grown into the UK's largest music festival, drawing over 200,000 fans to enjoy performances across more than 100 stages. In 2026, the festival will take a fallow year, a planned pause to allow the Worthy Farm site time to rest and recover. (P (Getty)\n\nCapaldi took a two-year break from all public performances following the Glastonbury performance in 2023 to work on his physical and mental health.\n\n﻿His return to the stage was supposed to be a secret, but there were some hints around the festival grounds leading up to the show, including lyrics from his songs plastered on a billboard nearby.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/nsw-budget-2025-housing-guarantee-what-is-it-explained/0e1242d6-1920-4c10-bc86-d8646604b8ff",
        "title": "This $1 billion housing guarantee plan is being touted as 'world-leading'. How does it work?",
        "publish_date": "Fri, 27 Jun 2025 06:11:45 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "A $1 billion \"world-leading\" and \"Australian first\" pre-sale finance guarantee policy is hoped to streamline more housing in New South Wales, but how exactly does it work?\n\nTreasurer Daniel Mookhey unveiled the scheme in his third budget this week, targeting the private sector to deliver more housing. ﻿\n\nThe state will guarantee the pre-sale of up to 5000 apartments or units over five years for residential developments that require a certain number of dwellings to be sold before construction can begin.\n\nA $1 billion \"world-leading\" and \"Australian first\" pre-sale finance guarantee policy is hoped to streamline more housing in New South Wales. (Getty)\n\nThe state claims this ﻿will unlock a total of 15,000 new homes.\n\nMookhey said this cuts the red tape around one of the biggest financing bottlenecks for developers - securing enough pre-sales to qualify for funding from banks and lenders.\n\nHe added that this was contributing to the housing crisis by causing months to years-long delays to housing projects. ﻿\n\n\"These are the projects that will add more low-to-medium density housing in neighbourhoods people love to live in,\" he said.\n\nHere is a breakdown of how exactly the plan will work.\n\nTreasurer Daniel Mookhey during a press conference before handing down the budget this week. (Dominic Lorrimer)\n\nThe state government has approved a $1 billion revolving fund, which will be used to provide each low-to-medium density housing project with pre-sale guarantees of between $5 million and $50 million.\n\nDevelopers with planning approval and at least 50 per cent pre-sales can apply.\n\nTypically, banks require 80 per cent pre-sales.\n\nAfter assessments and approval, they have to begin construction within six months.\n\nIf the homes are sold, the guarantee is extinguished and poured back into the $1 billion fund to be used again for other projects.\n\nIf the homes remain unsold, the developer can call on the guarantee, which means the state will buy the homes at a discounted price.\n\nThe government ﻿can then sell these homes to buy or rent, or keep them as affordable or social housing.\n\nTenants' Union of NSW chief executive Leo Patterson Ross. (Tenants' Union of NSW)\n\nAccording to Tenants Union ﻿of NSW chief executive Leo Patterson Ross, the guarantee partly addressed the financial issues that prevent housing from being built.\n\n\"The guarantee acknowledges that the private market is not well suited to delivering the community's housing needs as opposed to investment returns,\" he said.\n\n\"The financial arrangements needed either prevent housing being built at all, or passes on risks and their financial and non-financial costs to the consumer﻿.\"\n\nBut, Ross said, the scheme failed to directly influence the size or type of dwelling, including encouraging affordability. ﻿\n\n\"The government suggests the guarantee may fast-track 5000 dwellings, though not necessarily through direct expenditure,\" he said. ﻿\n\n\"We were disappointed that the government did not continue to directly fund the delivery of genuinely affordable, publicly funded housing of which we need many hundreds of thousands, so every billion counts.\"\n\nMeanwhile, other industry groups hailed the scheme as a \"real breakthrough\". (Getty)\n\nMookhey admitted the plan was not a \"silver bullet\" but denied that it was a \"drop in the ocean\".\n\n\"It is a canny use of our state's balancing sheet that is carefully calibrated to bring on 15,000 new dwellings,\" he said at a press conference this week.\n\n\"What this means is that industry can spend less time and resources having to convince their banks that there are buyers of these apartments and more time building them.\"\n\nMeanwhile, other industry groups hailed the scheme as a \"real breakthrough\".\n\n\"Projects that tick all the boxes, planning approval, market demand, sound delivery partners, are unable to proceed because developers can't meet unworkable pre-sale thresholds,\" Property Council NSW executive director Katie Stevenson said.\n\n\"The pre-sale finance guarantee responds directly to that issue.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/thailand-cannabis-crackdown-tourists-warned-australia-smartraveller/0dbd898b-bdfb-4a9a-8cae-517ac1031b21",
        "title": "Aussies warned over holiday hotspot's tough new drug laws",
        "publish_date": "Thu, 26 Jun 2025 22:56:12 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "It will take effect when it is published in the\n\nRoyal Gazette\n\n, although it was unclear when that would happen.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/deep-sleep-helps-problem-solving-eureka-moments-study-finds/234ffdd1-d678-4329-bb8f-4e774dd181df",
        "title": "'Sleeping on it' really does help solve problems, study finds",
        "publish_date": "Thu, 26 Jun 2025 20:27:42 +0000",
        "category": "lifestyle",
        "authors": [
            "Jun"
        ],
        "text": "\"Sleeping on it\" really does help people solve problems, a new study has found.\n\nIt's long been theorised that sleep can help bring on \"eureka\" moments of insight or realisation, but now a group of scientists have put it to the test.\n\nParticipants in a study, published in PLOS Biology , were asked to track a series of dots across a screen.\n\nDeeper sleep has been linked to problem-solving breakthroughs. (Getty)\n\nThey were all given instructions that involved responding to the dots on a keyboard, but were not told about a trick that could make the task easier.\n\nAfter four sets of trials, all the participants took a 20-minute nap, while scientists tracked their slee﻿p patterns.\n\nAfter their nap, the subjects were tested again, and 70.6 per cent of them were able to figure out the unmentioned \"trick\" that made their task easier.\n\nA study showed \"aha\" moments were linked to deeper sleep. (Getty Images/iStockphoto)\n\nThe study found that 85.7 per cent of those who had achiev﻿ed the first deeper sleep phase – or N2 sleep – had their \"aha\" moment, compared to 55.5 per cent of those who stayed away, and 63.6 per cent of those who dropped into lighter, N1 sleep.\n\nIn a group given the same task, but who did not get a chance to nap, only 49.6 per cent had a \"breakthrough\" moment.﻿\n\n\"It's really intriguing that a short period of sleep can help humans make connections they didn't see before,\" study co-author Nicholas Schuck said.\n\n\"The next big question is why this happens.\"\n\nFellow co-author Anika Löwe said it was good to establish solid data around what had been a subjective, if widely known, experience.\n\n\"What really struck me when telling people in my environment - particularly creatives - about these findings was how much they resonated with people,\" Löwe said.\n\n\"Many of them could relate to our results with a personal experience of having a (creative) breakthrough after a nap.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/trump-abruptly-cuts-off-trade-talks-with-canada/105472360",
        "title": "Trump abruptly cuts off trade talks with Canada",
        "publish_date": "Sat, 28 Jun 2025 01:50:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "US President Donald Trump has abruptly cut off trade talks with Canada over its tax targeting US technology firms, calling it a \"blatant attack\".\n\nThe move on Friday, local time, plunged US-Canada relations back into chaos after a period of relative calm that included a cordial G7 meeting in mid-June where Mr Trump and Canadian Prime Minister Mark Carney agreed to wrap up a new economic agreement within 30 days.\n\nIt also came just hours after US Treasury Secretary Scott Bessent struck an upbeat tone on trade, touting that progress had been made with China on reviving the flow of critical minerals for the US manufacturing sector, and in other key tariff negotiations.\n\nThe often-chaotic rollout of Mr Trump's import levies since his return to office this year has frequently whipsawed financial markets, and have begun to weigh on consumer spending, the bedrock of the US economy.\n\nDonald Trump says he will set a new tariff rate for Canada. (AP: Mark Schiefelbein)\n\nUS stocks were briefly batted lower by his broadside against Canada, but the S&P 500 and Nasdaq managed to close out the week at record highs.\n\nMr Trump's action comes ahead of Canada's plans to begin collecting on Monday a previously enacted digital services tax on US technology firms, including Amazon, Meta, Alphabet's Google and Apple, among others.\n\nThe tax is 3 per cent of the digital services revenue a firm takes in from Canadian users above $US20 million ($30 million) in a calendar year, and payments will be retroactive to 2022.\n\nMr Trump, in a post on his Truth Social media platform, called the tax \"a direct and blatant attack on our country\" and said Canada was a \"very difficult country to TRADE with\".\n\n\"Based on this egregious Tax, we are hereby terminating ALL discussions on Trade with Canada, effective immediately,\" he said.\n\n\"We will let Canada know the Tariff that they will be paying to do business with the United States of America within the next seven-day period.\"\n\nSpeaking to reporters at the White House, Mr Trump said that the negotiations with Canada would not resume \"until they straighten out their act,\" adding that the US holds \"such power over Canada\".\n\nCanada is the second-largest US trading partner after Mexico, and the largest buyer of US exports. It bought $US349.4 billion of US goods last year and exported $US412.7 billion to the US, according to US Census Bureau data.\n\nMr Carney's office responded to Mr Trump's announcement by saying: \"The Canadian government will continue to engage in these complex negotiations with the United States in the best interests of Canadian workers and businesses.\"\n\nMr Bessent sought to downplay the US-Canadian dispute in a CNBC interview, saying US Trade Representative (USTR) Jamieson Greer would likely open a Section 301 probe into Canada's digital tax that would clear the way for tariff retaliation in the amount of harm to US firms, which he said was roughly $US2 billion.\n\nThe US has prepared similar retaliation against European countries that have imposed digital taxes. A USTR spokesperson did not immediately respond to a request for comment.\n\nWrapped up by Labor Day\n\nEarlier on Friday, Mr Bessent said the Trump administration's various trade deals with other countries could be done by the September 1 Labor Day holiday, citing talks with 18 top trade partners and another revision to a deal with China to reopen the flow of rare earth minerals and magnets.\n\nAfter a week where tariffs took a back seat to the US strike on Iran's nuclear facilities and the massive tax and spending bill in the US Congress, the Trump administration's trade negotiations have picked up.\n\nThe US sent a new proposal to the European Union on Thursday and India sent a delegation to Washington for more talks.\n\n\"So we have countries approaching us with very good deals,\" Mr Bessent said on Fox Business Network.\n\n\"We have 18 important trading partners. … If we can ink 10 or 12 of the important 18, there are another important 20 relationships, then I think we could have trade wrapped up by Labor Day,\" Mr Bessent said.\n\nHe did not mention any changes to a July 9 deadline for countries to reach deals with the US or see tariffs spike higher, but Mr Trump said at the White House that he could extend the tariff deadline or \"make it shorter\".\n\nMr Trump said that he would notify countries of their tariff rates within the next week and a half, adding: \"I'd like to just send letters out to everybody: Congratulations. You're paying 25 per cent.\"\n\nNew US-China export revisions\n\nMr Bessent said the US and China had resolved issues surrounding shipments of Chinese rare earth minerals and magnets to America, further modifying a deal reached in May in Geneva.\n\nUS and China confirm trade deal framework Photo shows Trump and Xi shake hands with the American and Chinese flags in the background China has confirmed the details of the framework will include Washington looking at \"restrictive measures\", while Beijing will \"review and approve\" items under export control.\n\nAs part of its retaliation against new US tariffs, China suspended exports of a wide range of critical minerals and magnets, up-ending supply chains central to automakers, aerospace manufacturers, semiconductor companies and military contractors around the world.\n\nDuring US-China talks in May in Geneva, Beijing committed to removing the measures imposed since April 2, but those critical materials were not moving as fast as agreed, Mr Bessent said, so the US put countermeasures in place.\n\n\"I am confident now that … as agreed, the magnets will flow,\" Mr Bessent said, adding that these materials would go to US firms that had received them previously on a regular basis.\n\nHe later said that the US would begin shipping withheld materials to China when the rare earths shipments resumed.\n\nChina's Commerce Ministry said on Friday the two countries have confirmed details on the framework of implementing the Geneva trade talks consensus.\n\nIt said China will approve export applications of controlled items in accordance with the law. It did not mention rare earths.\n\nTrump administration officials also held trade talks on Friday with India and Japan, two other countries in advanced negotiations with the US\n\nThe Japanese government said in a statement that the two sides will continue to work to \"reach an agreement that benefits both Japan and the United States\".\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/kalyn-ponga-out-of-origin-decider-knights-foot-injury/105472402",
        "title": "Ponga out of Origin decider as Knights confirm serious foot injury",
        "publish_date": "Sat, 28 Jun 2025 01:30:32 +0000",
        "category": "sports",
        "authors": [],
        "text": "Kalyn Ponga is out of the State of Origin series decider after scans confirmed the Queensland superstar has suffered a Lisfranc injury.\n\nNewcastle said on Saturday morning Ponga was set for a lengthy stint out, less than 12 hours after picking up the foot injury in the loss to Canberra.\n\nPonga's injury will potentially open the door for Reece Walsh to return to the Queensland number one jersey, after his own return to form for Brisbane.\n\nThe Maroons' other option would be to shift Hamiso Tabulation to fullback, after the Dolphins full-back played centre and wing in the first two games.\n\nTabuai-Fidow's move would not be simple, given back-up centre Jack Howarth is out with appendicitis and Selwyn Cobbo has been dropped by Brisbane.\n\nReece Walsh could earn a recall for the decider. (AAP: Dave Hunt)\n\nPonga's injury is a serious blow to the Maroons, given their game-two win in Perth had offered Billy Slater the prospect of keeping the team intact for Sydney.\n\nNewcastle said in a statement on Saturday that Ponga would begin rehabilitation, \"with the view to returning to play in the back end of the season\".\n\nPonga limped from the field during the second half of the Knights' 22-18 loss, with the injury suffered on the opposite foot to the one he suffered Lisfranc damage to last year.\n\nOn that occasion, he missed seven games for the Knights. A similar timeframe would mean Ponga does not return until the eve of the finals this year.\n\nAlmost immediately after the match on Friday night, Newcastle officials had feared the worst.\n\n\"Kalyn's tough. He doesn't come off for much,\" coach Adam O'Brien said.\n\n\"You have to drag him off the field with a tow truck normally, so it's probably not a good sign.\"\n\nPonga played in the first two games of the Origin series, which is tied at 1-1. (AAP Photos: Dave Hunt)\n\nPonga's injury also comes as a significant setback for Newcastle and O'Brien, after the Knights had shown signs of turning their season around in the past month.\n\nFive-eighth and back-up full-back Fletcher Sharpe is unlikely to return again this year after suffering a lacerated kidney and spleen damage last week.\n\nFletcher Hunt could now be the man to fill in for Ponga.\n\nFor Queensland, it is also a mega blow.\n\nDespite being one of the best full-backs in the competition, Ponga has been restricted to eight games starting for the Maroons since first wearing the jersey in 2019.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/penshurst-community-rallying-to-buy-towns-last-remaining-pub/105449188",
        "title": "Victorian community rallies to buy town's last remaining pub",
        "publish_date": "Sat, 28 Jun 2025 01:03:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Surely there could be no worse fate than a country town losing its last pub in the middle of a drought.\n\nThat's why a south-west Victorian community is banding together in the hope of raising $1 million to buy the town's last remaining watering hole.\n\nSo far, the 670 residents of Penshurst, a rural town about 300 kilometres west of Melbourne, have raised $250,000 to bring the Penshurst Hotel into community hands.\n\nBut the group still has hundreds of thousands of dollars left to raise, with little time left.\n\nPubs 'critical' for communities\n\nAt the turn of the century, there were six pubs in Penshurst, but now only the Penshurst Hotel remains.\n\nThe pub went on the market in April 2025, and the community has tried to buy it out of fear it will be shut down or turned into something else by new owners.\n\nThe group's offer for the property has been accepted by the owners, but sales contracts are yet to be signed.\n\nThe ABC understands there have been four other offers on the property from potential buyers across the state, including from Melbourne and Ballarat.\n\nThe Penshurst Hotel is the last remaining pub in town. (ABC South West Victoria: Jean Bell)\n\nRay Allan moved to Penshurst eight months ago and is spearheading the campaign to buy the historic bluestone pub.\n\n\"Pubs are critical things in small towns,\" he said.\n\n\" Towns around the district that have lost their last [pub] have just basically died and fizzled away. \"\n\nThe pub is open a few nights a week, but only for drinks after the bistro closed in January 2024.\n\nThe closest pubs are a half-hour drive away.\n\nMr Allan, who is also a member of the Penshurst Progress Association, said the pub was vital for locals' mental health.\n\n\"This is not about saving the pub,\" he said.\n\n\" This is about saving a critical community asset that's holding the community together. \"\n\nOne shot, one opportunity\n\nAcross the state, a growing number of pubs have been taken over by community groups.\n\nJust this month, 83 community members pitched in to buy the Maroona Hotel near Ararat after the owner put it up for sale.\n\nMr Allan said about 40 Penshurst residents met in April to discuss collective ownership of the Penshurst Hotel, with people invited to buy a unit share worth $5,000 each.\n\nIn six weeks, Mr Allan said about 30 shareholders committed a total of $250,000.\n\nSurrounded by farmland in south-western Victoria, Penshurst is home to about 670 people. (ABC South West Victoria: Jean Bell)\n\nOnce the sales contract is signed, the group has about six weeks to raise a further $200,000 to close the deal.\n\nMr Allan said he was feeling confident the necessary funds would be raised, but there was \"also a bit of a niggle\" of doubt.\n\nIf successful, the group hopes to raise yet another $650,000 for repairs to the 1850s-era building, including refurbishing the kitchen and dining areas to reopen the pub for meals.\n\nThe Penshurst Hotel would initially be operated by the community, with the option of leasing it to a third-party operator down the line.\n\nThe pub, pictured here in 1908, is deemed to be of historical and architectural significance. (Supplied: State Library of Victoria)\n\nBuzzing with energy\n\nPenshurst resident Kate Orchard said many of the people who had contributed were farmers who were battling the drought.\n\n\"They are doing it so tough with feed costing what it does, but they realise how important this was and [found] that little bit of money,\" Ms Orchard said.\n\nLocals hope bringing the pub back to its glory days will help revitalise the town. (ABC South West Victoria: Jean Bell)\n\n\"The front street looks like a smile with the front teeth gone.\n\n\"This is a one-shot go … if this fails, we probably won't ever get it off the ground again.\"\n\nEileen Copeland operates the local post office and is among those who contributed to the fund.\n\nShe said she hoped a successful pub would bring more people to town.\n\nEileen Copeland owns the local post office and has pitched in to help buy the pub. (ABC South West Victoria: Jean Bell)\n\n\"The more people who stop in the town, the more likely they're going to wander in here and buy something from me,\" she said.\n\nCan it work?\n\nAustralian Hotels Association chief executive Paddy O'Sullivan said community-owned pubs that pitched themselves as a tourist destination, as well as being a local hotspot, were best placed to succeed.\n\nMr O'Sullivan said communities needed to be prepared for the challenges involved in running a pub, such as staffing and the long hours, and ensuring it was financially viable.\n\nBut he said he believed the trend of more establishments entering public ownership would continue.\n\n\"It's great to see,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/jeff-bezos-wedding-in-pictures/105471466",
        "title": "Jeff Bezos and Lauren Sanchez's Venice wedding in pictures",
        "publish_date": "Sat, 28 Jun 2025 00:40:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "The sky itself is no limit for billionaire Jeff Bezos and fiancée Lauren Sánchez, who have travelled into space — and expectations were about as high ahead of their wedding in Venice.\n\nOne of the world's most enchanting cities as a backdrop? Check.\n\nStar-studded guest list and tabloid buzz? Of course.\n\nLocal flavour? You bet.\n\nLauren Sanchez and Jeff Bezos at their wedding. (Instagram: laurensanchezbezos)\n\nAnd then, time to tie the knot. The couple held their wedding ceremony on Friday night, local time, and the now Mrs Sánchez Bezos posted to Instagram a photo of herself beaming in a white gown as she stood alongside a tuxedo-clad Mr Bezos, the world's fourth-richest man.\n\nBefore the nuptials, Ms Sanchez, 55, wearing a short-sleeved, cream, fitted skirt suit, with sunglasses and a head scarf to protect her from the blistering summer sun, boarded a motor boat for the small island of San Giorgio where the couple would exchange rings.\n\nLauren Sanchez ahead of the anticipated wedding celebrations. (AP: Antonio Calanni)\n\nKisses from the future Mrs. (AP: Antonio Calanni)\n\nAbout two hours later, Mr Bezos, 61, wearing a black tuxedo and bow tie over a white shirt, made the same short trip across the lagoon, accompanied by singing from Matteo Bocelli, son of Italian tenor Andrea Bocelli.\n\nJeff Bezos during preparations. (AP: Antonio Calanni)\n\nResidents try to catch a glimpse of Jeff Bezos leaving his hotel. (AP: Luca Bruno)\n\nBoats for all\n\nLauren Sanchez climbs onto one of many boats. (AP: Luca Bruno)\n\nIt's not a celebrity wedding without the Kardashians, Khloé and Kim came prepared for the Italian sun. (AP: Antonio Calanni)\n\nBusinesses have welcomed the glitz and glamour but it is opposed by a local protest movement whose members resent what they see as Venice being gift-wrapped for ultra-rich outsiders. Mr Bezos is No 4 on Forbes' global billionaires list.\n\nUsher (left) and his wife Jennifer Goicoechea needed extra help getting onto the boat with her high heels. (AP: Luigi Costantini)\n\nJeff and Lauren were on boats plenty of times over the weekend. (AP: Luca Bruno)\n\nThe boats took the scenic route by the San Giorgio Maggiore Church. (AP: Luca Bruno)\n\nJeff Bezos waves to the cameras. (AP: Antonio Calanni)\n\nThe anti-Bezos front is planning a march on Saturday, and its activities have already led authorities to step up security and move the location of the closing party to a more secluded part of Venice, the Arsenale former shipyard.\n\nThe wedding has been divisive, with some protesting over the initial plans for the wedding taking over too much of the resort. (Reuters: Guglielmo Mangiapane)\n\nBut politicians, hoteliers and some other Venice residents are happy about the wedding, saying such events do more to support the local economy than the multitudes of day-trippers who normally overrun the city.\n\nFamous friends\n\nBill Gates, Leonardo DiCaprio, Orlando Bloom, Tom Brady, the queen of Jordan, Oprah Winfrey, Kris Jenner and Kim and Khloe Kardashian as well as Ivanka Trump and Jared Kushner, and Domenico Dolce from Dolce & Gabbana, are among the 200-250 guests.\n\nA starry-eyed Ellie Goulding. (AP: Luigi Costantini)\n\nLeonardo DiCaprio is still recognisable despite shielding his face. (Reuters: Guglielmo Mangiapane)\n\nAmid tight security, there have been glimpses of the celebrities moving around town, the women in summer dresses and high heels, stepping gingerly off boats ferrying them around the city's canals.\n\nUsher and Tom Brady looking sharp. (AP: Luigi Costantini)\n\nIvanka Trump opted for a glittering pink dress. (Reuters: Guglielmo Mangiapane)\n\nCelebrations began on Thursday evening in the cloisters of Madonna dell'Orto, a medieval church in the central district of Cannaregio that hosts masterpieces by 16th-century painter Tintoretto.\n\nKylie Jenner's dress was awfully close to white, and looks very difficult to sit in. (AP: Luigi Costantini)\n\nKim Kardashian gives a peace sign as she poses for a picture. (Reuters: Guglielmo Mangiapane)\n\nBill Gates was among Jeff Bezo's tech friends. (AP: Luigi Costantini)\n\n\"This magical place has gifted us unforgettable memories,\" the bride and groom said on their wedding invitation, in which they asked for \"no gifts\" and pledged charity donations for three Venetian institutions.\n\nTheir donations are worth 3 million euros ($5.8 million).\n\nLord of the Rings actor Orlando Bloom dashes into a car, while giving a peace sign to the camera. (Reuters: Guglielmo Mangiapane)\n\nOprah Winfrey, in a crowd of glitz and glamour. (AP: Luigi Costantini)\n\nAP/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/esperance-woman-and-long-search-for-cause-of-chronic-pain/105427264",
        "title": "'I want my life back': Woman struggles for solution to chronic pain",
        "publish_date": "Sat, 28 Jun 2025 00:11:29 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Jayde Guest spends most evenings in extreme pain.\n\nFor almost a year, the mother of two from Esperance, 700 kilometres south-east of Perth, has barely been able to work or socialise.\n\nShe feels as though her life has been stripped of all its best parts.\n\n\"By night time, most of the time, I'm on the couch crying,\" she said.\n\n\"I'm at the end of my tether right now.\n\n\"Day-to-day life is a real challenge.\"\n\nWhile she has turned to Western Australia's health system numerous times for help, she said the process had only compounded her suffering.\n\nMs Guest is grieving her old life, after battling chronic pain for almost a year. (Supplied: Jayde Guest)\n\n'The too-hard basket'\n\nThe pain, which \"feels like her chest wall is caving in\", arrived out of the blue on a normal winter's morning.\n\nIt has returned each day since, intensifying the more active she is and often becoming unbearable by night.\n\nHer doctor's first suspicion was cancer, as she had been in remission from an aggressive form called osteosarcoma for about 20 years.\n\nBut the medical system was at a loss when tests ruled out cancer.\n\nMs Guest survived bone cancer in her early 20s. (Supplied: Jayde Guest)\n\nShe made the journey to Perth, seeing five different specialists on separate occasions, none of whom could produce the answers she sought.\n\nMs Guest said she was then twice rejected from the WA Health Department's central referral service — designed to triage and allocate cases — and the hospital stopped calling her back.\n\n\"I [was] in the too-hard basket,\" she said.\n\n\" So I decided to take it into my own hands. \"\n\nMs Guest says her current battle with chronic pain is more isolating than her cancer experience. (ABC Esperance: Emily Smith)\n\nAn answer at last\n\nMs Guest said she turned to support groups on social media and sought out experts in London, America, Melbourne and Sydney.\n\nFinally, she found someone who might have an answer to her pain.\n\nDuring her previous bone cancer battle, she had five ribs removed and replaced with a Gore-Tex mesh.\n\nA doctor in Sydney believes the 20-year-old mesh is now shrinking and pulling against her chest wall.\n\nThe doctor, who specialises in mesh removal, told Ms Guest they were confident of being able to remove hers but is still working out how to rebuild her chest wall.\n\nMs Guest is relieved to have a way forward, but the wait continues as they work on a solution.\n\nMs Guest believes mesh inserted in her chest following cancer treatment could be causing the pain. (Supplied: Jayde Guest)\n\nShe said the uncertainty of her experience felt harder than the 16 rounds of chemotherapy she endured in her 20s.\n\n\"The lack of communication from the medical system has been really disappointing,\" she said.\n\n\"And I think that's what makes people feel really alone.\n\n\" I was pretty much depressed because I was searching for an answer that no-one was giving. \"\n\nWhile Ms Guest can manage small tasks like getting coffee in the morning, she is generally in severe pain by night. (ABC Esperance: Emily Smith)\n\n'It's not ideal'\n\nClare Mullen, executive director at WA's Health Consumers Council, said experiences like Ms Guest's happened \"too often\".\n\nBut Ms Mullen said cases involving regional patients and chronic pain could be particularly difficult.\n\nShe said this was due to the disconnect between country GPs and metropolitan health professionals and the scepticism that could follow chronic pain.\n\n\"Unfortunately, it's one of the areas where we see a lot of people having to convince the clinicians … that their pain is real.\"\n\nMs Mullen said anyone feeling like their case was not progressing or who had been rejected from the service should contact the GP who made their first referral.\n\n\"It's not ideal, particularly in a case like this [where] someone is living with chronic pain,\" she said.\n\n\"It's a time-consuming process.\"\n\nMs Mullen said if they still had no luck, they should contact the Health Consumers Council.\n\nAbout 3.7 million Australians suffer through chronic pain. (Pexels: Karolina Grabowska)\n\nMonika Boogs, chief executive of Pain Australia, said the number of Australians suffering chronic pain was about 3.7 million and growing.\n\nBut Ms Boogs said there were only about 200 pain specialists in the country, with access proving particularly difficult for regional residents.\n\nShe said a national action plan for pain management was done six years ago, but many programs were still unfunded.\n\n\"Pain is like mental health was 20 years ago. It's something that's growing. It's impacting so many people,\" she said.\n\n\" We need to help because if we do nothing, it's going to cost our community even more in the future. \"\n\nWA Health Minister Meredith Hammat said the health system aimed to provide world-class care to all West Australians.\n\n\"We will never stop working to advance the care our health system provides,\" she said.\n\nA WA Health spokesperson said initiatives were in progress to improve access to public specialist outpatient services.\n\nSharing her journey\n\nTo help others, Ms Guest started blogging about her experience.\n\nShe said she was a big believer in documenting experiences and helping others to advocate within the medical system.\n\n\"By me sharing it, I've had people open up to me and hopefully I've helped them to see that they're not alone.\n\nMs Guest has a supportive family to keep her going. (ABC Esperance: Emily Smith)\n\n\"And Facebook groups, as much as they can be a little bit negative sometimes, I've found some great people and great friends going through similar things to me.\n\n\"And that's definitely helped.\"\n\nMs Guest said it also kept her sane, as the wait for a cure continued.\n\n\"I really, really want my life back,\" she said.\n\n\"I think it's hard for people to understand because I look kind of normal, I don't walk around going, 'Oh, my gosh, I'm in so much pain.'\n\n\"I just have to carry on.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/west-indies-vs-australia-first-test-day-three-catching/105471704",
        "title": "Australia's class shines through as horror drop sets sad tone for West Indies",
        "publish_date": "Fri, 27 Jun 2025 23:59:47 +0000",
        "category": "sports",
        "authors": [],
        "text": "For a match that appeared evenly poised at the end of day two, Australia's crushing 159-run Test victory over the West Indies was remarkable in its scale.\n\nMid-way through day two of the first Test in Barbados, the hosts held a 10-run first innings lead.\n\nAustralia had been bowled out for just 180 on the first day having won the toss and batted.\n\nIn the second innings, the visitors were 4-65 after another woeful top order batting display.\n\nA thrilling Test match was assured, wasn't it?\n\nAlas, Test match cricket does nothing if not exploit and expose the inadequacies between the very best and the rest — and Josh Hazlewood is very much among the best.\n\nThe 34-year-old was absolutely unplayable on a wearing, minefield of a pitch.\n\nHis five-over second spell was almost mythical, a fitting addition to the tapestry that is the Kensington Oval, one of the world's most storied Test grounds.\n\nBut the game was in the balance — a couple of quick wickets and Australia would have been defending a far more modest score than the 301 runs they managed to accrue.\n\nThe hardest thing for the West Indies to accept may well be that the chance to take that early wicket presented itself in the fourth over of the day.\n\nTravis Head, on 21, gifted an edge to second slip off the bowling of Alzarri Joseph.\n\nHead was dropped early on day three. (AP: Ricardo Mazalan)\n\nJustin Greaves at second slip did what too many of his teammates had done throughout the Test — he dropped it cold.\n\nThe West Indies were, unfortunately, found lacking in the basic skills of the game, catching.\n\nIt's a troubling issue and one that is not unknown to the West Indies.\n\nThe host broadcaster showed a graphic before the start of play on day three that highlighted that the West Indies were the worst catchers in Test cricket at slips and gully, snaring just 65.6 per cent of their chances in Tests since 2023.\n\nIn this Test they caught a truly woeful 36 per cent of their chances in that area.\n\nIn a game where the hosts put seven catches down, how does one determine which was the defining drop of the contest?\n\nThe first? That one shelled by Brendon King no doubt set the tone for the shambles that followed.\n\nBut realistically it was the one on that third morning.\n\nAustralia was 4-107 at he time, their lead under 100.\n\nHead went on to score 61, his second half century of the match as part of a 102-run partnership with Beau Webster.\n\nBeau Webster scored his third Test half century. (AP Photo: Ricardo Mazalan)\n\nWhile Head continued where he left off with his first innings, Webster's half century was just a continuation of the norm for what has been a superb start to Test cricket.\n\nVictim to a brute of a ball in the first innings to be out for 11, in this second stint he was immense.\n\nIn what was just his eighth Test match innings, the 31-year-old Tasmanian scored his third half century and did so with impressive composure.\n\nHis height allows him to easily get down the pitch and his timing through the covers was simply sublime.\n\nWith two crucial wickets in the West Indies batting innings on day two already under his belt, the man from Snug is looking increasingly secure in that all rounder role.\n\nAlex Carey also impressed with a well-paced counter attacking display that saw him shift roles three times throughout his stay.\n\nAlex Carey played a sublime innings. (AP Photo: Ricardo Mazalan)\n\nAfter playing the supporting role to Webster early and stepping back into that familiar tail end hand holder at the end of his stay, he still blasted a 40-ball half century — his fastest in Tests — with the final 40 runs coming in 15 balls, including a monstrous six back over Jayden Seales' head that crashed into the sightscreen.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nIt was a brutal display of power that illustrated just how valuable he is down at number seven, the Jekyll and Hyde position that has to adapt and shift to the circumstances in front of him.\n\nBut the impetus Australia managed to gain still, arguably, came from that dropped catch in the first hour.\n\nAfter day two, coach Daren Sammy rightly pointing out that his team were \"shooting ourselves in the foot\" more than anything else.\n\nThe 38-Test capped Saint Lucian may have hoped that by vocalising the issue his team would holster their self-destructive weapons for day three.\n\nInstead, they loaded them right back up and continued to aim at their own boots.\n\nThe honour board of West Indian catching incompetence for this Test is lengthy and frustrating, a blight on the heroes of 1975 who were being honoured on the 50th anniversary of the West Indies' Cricket World Cup triumph in 1975 at the ground on the opening day.\n\nBrandon King, on debut, had three entries in the first day: Cameron Green (0), Usman Khawaja (45) and Nathan Lyon (3).\n\nFortunately for him, those particular drops cost the West Indies just 11 runs.\n\nThe skipper, Roston Chase, was not so lucky — Khawaja added 41 more runs after he was dropped on 6 by him at first slip.\n\nOn day two, add John Campbell at third slip and Justin Greaves at second both dropped Sam Konstas in a single Shamar Joseph over while he was on 0.\n\nAgain, to the West Indies' relief, Konstas failed to capitalise, only managing another 5 runs before being bowled.\n\nHead was a different story.\n\n\"Holding onto that catch could have changed the game,\" former West Indies player Carlos Brathwaite said on ESPN.\n\nSo was it the catching that has cost the West Indies the match?\n\nIt's clearly not the only thing given Australia's bowling brilliance.\n\nStarc removed Braithwaite in the first over of the West Indies chase. (AP: Ricardo Mazalan)\n\nAs the Kensington Oval pitch began to crumble, Hazlewood came to the fore.\n\nHazlewood's recent susceptibility to injury has given Australia a look ahead to a near future where this brilliant pace-bowling trio will no longer be around.\n\nBut his phenomenal five-over spell of 4-5 showed that Australia still needs him.\n\nMitch Starc and Pat Cummins also claimed wickets among the seamers, but the strength of this pace triumvirate is its ability to work together.\n\nBut it was that brilliant burst from the Tamworth tearaway that caught the eye most.\n\nOn a pitch offering plenty of assistance, its erratic nature was exploited by the kind of unerring accuracy that has become this seam attack's signature characteristic.\n\nShould the West Indies first innings lead have been more?\n\nUndoubtedly, the desperately poor third umpiring decisions made by Adrian Holdstock that may yet result in the West Indies issuing a formal complaint against the South African no doubt cruelled any prospect that the West Indies had of turning that narrow lead into one that was far more substantial.\n\n'Flabbergasted': The decisions that went against the West Indies Photo shows Shamar Joseph bites his white jersey with his hands on his hips. The West Indies have every right to feel aggrieved after a number of third umpire decisions went against the home side during the first Test against Australia at the Kensington Oval.\n\n\"Me and Shai Hope, we were having a good partnership and then, obviously a few calls set us back a bit,\" Chase said at the post-match presentation.\n\n\"I still thought we did well to get the lead, but we couldn't put any batting innings together.\"\n\nThat much is true, but the West Indies must also take ownership of their own frailties — such a woeful catching display will rarely lead to Test victories against a team of Australia's calibre.\n\nThe second Test in Grenada gets underway on July 4.\n\nNot a long enough break to cure the catching woes.\n\nBut perhaps short enough to get back on the horse and make things right through their own actions.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/five-quick-hits-west-indies-australia-day-three/105471638",
        "title": "Five quick hits: Hazlewood's rapid-fire five and Shamar's special fireworks",
        "publish_date": "Fri, 27 Jun 2025 23:10:45 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia completed a massive 159-run first Test victory over the West Indies on an action-packed third day.\n\nA wearing pitch, another terrible West Indies drop in the slips and Josh Hazlewood's rapid-fire \"five-fa\" all combined for a memorable day's cricket.\n\nHere are five quick hits from day three in Barbados.\n\n1. Head dropped again\n\nHead was dropped early on day three. (AP: Ricardo Mazalan)\n\nAlthough the West Indies had dropped seven catches over the first two days in Barbados, none of them had proved to be too consequential.\n\nSooner or later, however, one was bound to come back to bite them.\n\nAnd when, during just the fourth over of the day, Justin Greaves shelled yet another chance in the cordon, that moment had finally come.\n\nTravis Head hung his bat out to a wide Alzarri Joseph delivery, looping one in the direction of a diving Greaves at a comfortable speed and height.\n\nThe ball went in, and then out, and Head was given a life on 21.\n\nFrom there he went on to score 61 as part of a 102-run partnership with Beau Webster, Australia's lead 157 and well on the way to being enough to secure victory on a pitch showing increasingly variable bounce.\n\n2. Bouncy bouncy\n\nTravis Head was trapped LBW to a ball that barely bounced. (AP Photo: Ricardo Mazalan)\n\nJoseph has had rotten luck this Test.\n\nA questionable third umpire call robbing him of a five-fa in the first innings, and five dropped catches off his bowling costing both him and the West Indies plenty more.\n\nHe's had to do it all himself at times, as was the case when Head eventually fell for 61.\n\nJoseph's delivery was a peach but, crucially, virtually unplayable, barely bouncing and cleaning up Australia's best batter.\n\nIt was far from the only time the pitch played a role in taking a wicket.\n\nMitch Starc was cleaned up by a ball that jagged in a huge distance from outside off, again Joseph the bowler.\n\nYes, it was a crucial breakthrough that the West Indies desperately needed.\n\nBut it made Australia's bowlers sit up a little straighter as they contemplated bowling on a wearing and cracking pitch.\n\n3. Carey's rapid-fire 50\n\nAlex Carey played a sublime innings. (AP Photo: Ricardo Mazalan)\n\nBatting at number seven, you often have to be everything to everyone.\n\nJoining an established upper-order player in the middle, your role is to sit quietly and make sure your partner is confident they won't have to worry about farming the strike, and just continue to bat as they were.\n\nBatting with the tail, you have to show composure with one hand to farm the strike and extend the innings as long as possible, while also flashing any loose deliveries away to keep the scoreboard ticking over.\n\nIt's Jekyll and Hyde.\n\nAlex Carey showed he was perfectly adapted to it.\n\nStarting with Webster, Carey made 10 runs in 25 balls.\n\nAfter his dismissal he scored 40 in 15, blasting the ball to all corners of the ground to record his fastest ever Test half century.\n\nAs Pat Cummins and Starc fell, Carey went back into his shell, masterfully steering the ball around the field, selecting his running options and shielding Nathan Lyon as much as possible — while also ramping Joseph for a one-bounce four.\n\n4. Shamar Joseph hits out\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nThe game was very much gone.\n\nBut Joseph sure wasn't going to go quietly.\n\nAt one stage he was on track to score the fastest ever Test half century as he smashed Hazlewood, Starc and Lyon to all corners of the famous Kensington Oval.\n\nHaving already taken 9-133 in the match with the ball, Shamar's fireworks were astonishing — especially given the West Indies were 8-86 and facing a monster defeat.\n\nHe hit four 4s and four 6s in his 22-ball innings but ultimately fell just short of a maiden Test half century.\n\nBut it was fun while it lasted.\n\n5. Hazlewood breaks it open\n\nJosh Hazlewood took two wickets in two balls to start a brilliant flurry of wickets. (AP Photo: Ricardo Mazalan)\n\nAll it took was two Hazlewood deliveries.\n\nThe West Indies, a first over Starc strike aside, had made a promising start to their run chase.\n\nJohn Campbell had played expressively for his 23, but he took things a step too far when he got down to scoop Hazlewood over the slips on one knee in the 11th over.\n\nThe ball glanced off the glove, looping high into the air but, crucially, not far.\n\nCarey cantered back a couple paces and took an easy catch.\n\nThen, the very next ball, Brandon King edged onto his pads only to see the ball balloon to Cameron Green at gully.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/tougher-biosecurity-control-illegal-thai-food-import/105467700",
        "title": "Industry aghast as black marketeer avoids jail for 62-tonne food import",
        "publish_date": "Fri, 27 Jun 2025 23:04:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's agriculture industry is calling for stronger penalties for breaching biosecurity controls after a woman avoided jail for illegally importing more than 62 tonnes of meat and produce from Thailand to distribute on Sydney's black market.\n\nThe items, including raw and cooked pork, frogs, edible insects, beef, chicken, fish, raw prawns and insect-infested fruit, were intercepted at the border in 2021 after a tip-off.\n\nThe woman failed to accurately declare the products and on June 11 was sentenced by a District Court judge to a 24-month intensive corrections order and 150 hours of community service.\n\nDAFF intercepted the illegal imports after a tip-off. (Supplied: Department of Agriculture, Fisheries and Forestry)\n\nTests on the goods showed positive results for diseases, including African swine fever, Newcastle disease and white spot disease, raising concerns across the Australian agricultural industry.\n\nAustralian Pork Limited CEO Margo Andrae said the introduction of African swine fever could cost the Australian industry $2.5 billion.\n\n\"Australia has incredibly strict biosecurity laws for a very good reason. We don't have the diseases that are out there globally,\" she said.\n\nMargo Andrae says biosecurity breaches pose a huge threat to Australian producers. (Supplied: Cattle Council of Australia )\n\nThe Department of Agriculture, Fisheries and Forestry (DAFF) said the items were tested for trace presence of diseases and positive results did not necessarily indicate a viable presence.\n\nInsect-infested fruit was also seized and subjected to cold storage treatment before inspection.\n\nDAFF's Compliance and Enforcement Division first assistant secretary Anna Brezzo said the detections did not indicate broader outbreaks within Australia.\n\nPrawn industry concerned\n\nThe detection of white spot disease in the items also worried the Australian prawn industry.\n\nAustralian Prawn Farmers Association executive officer Kim Hooper said white spot, while harmless to humans, had the potential to decimate Australia's prawn industry.\n\nKim Hooper has renewed calls to ban prawn imports. (ABC News: Tom Forbes)\n\nWithin Australia, the movement of raw prawns from locations where white spot has been detected is banned, but raw prawns can be imported with a permit from countries with white spot disease.\n\nMs Hooper described the regulations as a \"double standard\" and called for a consistent approach to imported prawns.\n\n\"Fishers and farmers are doing all the right things in that containment area,\" she said.\n\n\"They're not moving raw product out of that containment area. It has to be cooked.\n\nThe white spot virus doesn't harm humans but is deadly to prawns. (Supplied: DigsFish services)\n\n\"But we're not seeing that same level of biosecurity at the border — we're not seeing only cooked [prawns] coming across the Australian border.\n\n\"So it just beggars belief about how this is actually happening and why our own businesses in Australia are being treated differently to what importers are.\"\n\nCalls for stronger penalties\n\nMs Hooper said the penalties for the woman did not \"reflect the scale of the threat\" from the illegal importation.\n\n\"This was a calculated operation involving false documentation and product substitution. The consequences should be equally serious,\" she said.\n\n\"The government needs to step up. There needs to be increased penalties for deliberate breaches such as this.\n\nRaw prawns were among the items intercepted. (Supplied: Department of Agriculture, Fisheries and Forestry)\n\n\"They need to close the regulatory gaps that allow these black market operations to exploit our system and they need to modernise the border protection systems.\"\n\nMs Andre agreed stronger penalties were needed to deter further illegal import attempts.\n\n\"We need a really strong deterrent for these people. They're putting our industries at risk,\" she said.\n\n\"[It's] great to see that DAFF caught them, but now we need the judicial systems to actually really put the full strength of the penalties in place.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/surrogacy-laws-review-commercial-surrogacy-in-australia/105431798",
        "title": "Should Australia have a babies-for-profit industry? Some think so",
        "publish_date": "Fri, 27 Jun 2025 22:41:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "For Daniel and Michael Montgomery-Morgan, becoming parents wasn't easy.\n\nIt took four years and hundreds of thousands of dollars to bring their daughter Spencer into the world.\n\n\"We really questioned whether we're meant to be parents. It's not a quick process,\" Daniel said.\n\nSpencer, now seven months old, was born via an altruistic surrogate in Canada.\n\n\"We didn't expect it would take us four years to have Spencer in our arms. [There were] lots of different things that we needed to do to accommodate the financial aspect of it.\"\n\nHer parents say the bumps along the road are forgotten now they have Spencer. (ABC News: Danielle Bonica )\n\nAfter initially looking in Australia, the couple had to go abroad to find their surrogate.\n\nThey said they were happy with the altruistic surrogacy process they did in Canada, but it wasn't without it's challenges.\n\n\"Unfortunately, we had three failed transfers, so we had to start again after two years of trying to have a baby,\" Michael said.\n\nHe said there were times when they thought it would have been easier if their surrogate was in Australia.\n\n\"When you're going through such an emotional journey … it's human nature to want to connect,\" Michael said.\n\n\"That was a challenge for us and that's what was missing with us not being able to do this like we wanted to in Australia.\"\n\nFor Bendigo couple Josh Paredes and Michael Vallejos, their one-year-old surrogate baby Elijah Miguel Paredes-Vallejos was a miracle.\n\nMichael's sister donated her eggs to make their IVF baby. (ABC Central Victoria: Shannon Schubert)\n\n\"Elijah is the love of our life. He is the blessing from above. We are very thankful,\" Mr Vallejos said.\n\nSome of the Filipino couple's gratitude is for close friend Helyn Joy Lagman, who offered to carry their baby after one round of IVF.\n\n\"We initially thought she was joking, so we ignored it. It took her three offers, then we thought, oh, she is actually serious,\" Mr Vallejos said.\n\n\" Helyn is heaven-sent to us. She is a blessing to everyone. \"\n\nElijah Miguel is one of a small number of Australian babies born through altruistic surrogacy. (ABC News: Shannon Schubert)\n\nMs Lagman already had two children of her own and said surrogacy was something she had always wanted to do and had offered to others.\n\n\"I really wanted to bring something good to the world,\" she said.\n\nMore couples go overseas for surrogacy\n\nState surrogacy laws Qld and NSW: I ntended parents must have a social or medical need, surrogate minimum age of 25, couples are not allowed to engage in commercial surrogacy overseas\n\nntended parents must have a social or medical need, surrogate minimum age of 25, couples are not allowed to engage in commercial surrogacy overseas Vic: Intended parents must have a social or medical need, surrogate minimum age of 25\n\nIntended parents must have a social or medical need, surrogate minimum age of 25 Tas: Intended parents must have a social or medical need, surrogate minimum age of 25, each party to the arrangement must be in the state\n\nIntended parents must have a social or medical need, surrogate minimum age of 25, each party to the arrangement must be in the state SA: Intended parents must have a medical or social need, surrogate minimum age of 25\n\nIntended parents must have a medical or social need, surrogate minimum age of 25 ACT: Same-sex couples allowed to find a surrogate, surrogate minimum age of 18, couples are not allowed to engage in commercial surrogacy overseas\n\nSame-sex couples allowed to find a surrogate, surrogate minimum age of 18, couples are not allowed to engage in commercial surrogacy overseas WA: Intended parents must have a medical need, same-sex couples are not allowed to find a surrogate, surrogate minimum age of 25, residents not allowed to engage in commercial surrogacy overseas\n\nIntended parents must have a medical need, same-sex couples are not allowed to find a surrogate, surrogate minimum age of 25, residents not allowed to engage in commercial surrogacy overseas NT: Anyone can be an intended parent, residents are not allowed to engage in commercial surrogacy overseas, surrogate minimum age of 25\n\nA growing number of Australian couples are going overseas to find a surrogate.\n\nAccording to the Australia and New Zealand Assisted Reproduction Database, 131 surrogacy babies were born in Australia and New Zealand in 2022.\n\nPeople working in the sector say the number could be higher.\n\nAccording to the Department of Home Affairs, 361 children born through international surrogacy arrangements acquired Australian citizenship in 2023-24, up from 222 in 2021-22.\n\nIn Australia, commercial surrogacy — when a surrogate is paid — is illegal.\n\nEvery state and territory has different laws relating to surrogacy but they all allow altruistic surrogacy, which means the surrogate's expenses are covered but no other profit or payment is made.\n\nAccording to the Department of Home Affairs, the United States is the most popular country for Australian couples to source surrogates, followed by Georgia, Canada, Colombia, Ukraine and Mexico.\n\nThe Australian Law Review Commission is reviewing the nation's surrogacy laws and will consider how to reduce barriers to domestic altruistic surrogacy arrangements in Australia.\n\nEthics of commercial surrogacy\n\nSurrogacy lawyer Sarah Jefford believes commercial surrogacy should be allowed in Australia.\n\n\"Everyone else is paid, including the lawyers, the counsellors and the clinicians,\" she said.\n\n\" I wonder why the surrogates have to do all of the work and take most of the risk, without being compensated. \"\n\nMs Jefford thinks commercial surrogacy should be allowed in Australia. (ABC News: Scott Jewel )\n\nMs Jefford, who has been a surrogate, wants Australia's \"patchwork\" surrogacy laws managed under federal legislation.\n\n\"I think uniform laws are crucial for making it more accessible but also making sure we don't have medical tourism within our own country,\" she said.\n\nHowever, some researchers and legal groups believe commercial surrogacy is unethical.\n\nMargaret Somerville, a professor of bioethics and law at the University of Notre Dame, Sydney, has researched surrogacy for decades.\n\nShe said allowing commercial surrogacy in Australia would inevitably lead to exploitation.\n\n\"The women who become a surrogate, they'll do it because they need the money,\" she said.\n\n\" Worldwide, women who are surrogates do it because they're desperate. \"\n\nBioethicist Margaret Somerville says commercial surrogacy is unethical. (ABC News: Liam Patrick )\n\nIn 2023, at a surrogacy clinic in Greece used by Australians, police arrested senior staff on charges of human trafficking, falsifying records and mistreating hundreds of women who had agreed to act as surrogates.\n\nTen years earlier, commercial surrogacy laws in India were reversed after the discovery of so-called baby farms where 100 women were housed together for the duration of their pregnancies.\n\nA snap ban on commercial surrogacy was announced in Cambodia in 2016, resulting in the arrest of Australian nurse Tammy Davis-Charles and two Khmer associates.\n\nMs Somerville acknowledges growing demand for surrogates, but fears introducing commercial surrogacy to Australia would put vulnerable women and children at further risk.\n\n\"It's like slavery,\" she said.\n\n\" It's wrong to buy a person and then use them. \"\n\nThe Montgomery-Morgans are close to Spencer's surrogate mother, who is coming to Australia to spend Christmas with them. (ABC News: Danielle Bonica )\n\nReview underway\n\nThe Australian Law Reform Commission's (ALRC) review is considering issues like the complexity of surrogacy arrangements, inconsistencies in legislation and barriers to accessing surrogacy and gaining Australian citizenship for babies born abroad.\n\nThis month, Queensland police confirmed they would not lay charges against a Brisbane couple who entered a $140,000 commercial surrogacy arrangement with an overseas company.\n\nInquiries into the regulation and legislation of international and domestic surrogacy arrangements, including a 2016 House of Representatives standing committee, recommended commercial surrogacy remain illegal.\n\nNew South Wales and South Australian reviews in 2018 also supported continued prohibition.\n\nThe ALRC is taking submissions for its review of surrogacy laws until mid-July.\n\nThe Montgomery-Morgans would love to see surrogacy more accessible in Australia. (ABC News: Danielle Bonica)\n\nThe Montgomery-Morgans would love to see surrogacy become more accessible in Australia so more couples can become parents.\n\n\"I think commercial surrogacy does have a place, with the right governance and controls,\" Daniel said.\n\nBut they would want safeguards to prevent exploitation.\n\n\"I would hate to see people exploited,\" he said.\n\n\"There is a real risk of that.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/ross-willis-relives-modelling-memories-from-the-1950s/105433288",
        "title": "'He was a very handsome guy': Back to the days when Grandad was hot",
        "publish_date": "Fri, 27 Jun 2025 22:24:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "At the back of a Lake Macquarie office, hidden under a stamp and coin collection, lies a time capsule of sorts.\n\nIt's a collection of magazines dating back to the late 1950s, which feature a fresh-faced 18-year-old Ross Willis modelling for various Newcastle suit tailors.\n\nWhen Mr Willis rediscovered them during a spring clean more than 65 years later, he showed his daughter Stephanie.\n\n\"When he said to me he was 18, I just couldn't believe it,\" Ms Willis said.\n\n\" I thought, 'Wow, look at him'; he was a very handsome guy. \"\n\nMr Willis found the magazines during a spring clean. (Supplied: Ross Willis)\n\nMs Willis said it was a \"time warp\" seeing her now 85-year-old father modelling.\n\n\"It's like what my kids once said to me: you forget your parents have had a whole life before you even came along.\"\n\nModelling memories\n\nIn 1958, Mr Willis was picked from a group of university students to model for a handful of suit-tailoring businesses in Newcastle.\n\n\"I think they looked for the best-looking people that would be able to be models,\" he said.\n\n\"There must have been about 10 of us [university students] altogether who came up and did shoots around the place.\"\n\nMr Willis was studying at Avondale University, known as Avondale College at the time, for his \"leaving certificate\", the equivalent of a Higher School Certificate today.\n\nMr Ross says seeing images of him modelling was a \"thrill\". (ABC Newcastle: Keely Johnson)\n\nNever having modelled before, he jumped at the chance.\n\n\"Looking back on the photos, it's a thrill,\" he said.\n\n\"Though I was paid nothing at all.\n\n\" Just enough to thank you for the good looks that you had. \"\n\nFinding the business\n\nIn the 1950s, dozens of suit-tailoring businesses lined Hunter Street in Newcastle.\n\nMr Willis said that was a sign of the times, when men wore suits for regular outings.\n\nHis daughter was curious to find out if any of them were still open.\n\nShe found just one.\n\nOpened in Newcastle in 1908, Rundle Tailoring is a fourth-generation family business still operating in the CBD.\n\nIt was one of Australia's largest suit manufacturers from the 1950s until the 90s.\n\n\"I said [to Dad], 'Next time I visit, I'll take you down there' and a few months later we did it,\" Ms Willis said.\n\nThe old Rundles building on Hunter Street in 1976. (Supplied: Rundle Tailoring)\n\nThe pair was given a tour of the facility, bringing back a range of memories.\n\n\"It amazed me that the tailoring is still done there,\" Mr Willis said.\n\nAndrew Rundle is the fourth generation to take over the family business. (ABC Newcastle: Keely Johnson)\n\nShop owner Andrew Rundle said it was the only suit tailor left in the region.\n\n\"When my great-grandfather Richard Thomas Rundle started in 1908, there would have been probably 50 or 100 tailors [in Newcastle],\" he said.\n\n\"Now, there's us … there hasn't been another tailor that can make a suit from scratch in this area for 20, 30 years.\"\n\nWhere suits are made and altered at the back area of the Newcastle shop. (ABC Newcastle: Keely Johnson)\n\nRundle Tailoring has had its ups and downs, surviving the Great Depression, World War II, tariffs and COVID-19.\n\n\"The history of the business is so rich,\" Mr Rundle said.\n\n\"This [the magazine] was something I didn't even know about until Ross came in and we discussed it.\n\n\" It's great that we can reflect on it and it's great that Ross can come in and relive his glory days when he was a great model. \"\n\nMr Willis modelling for Rundles in 1958 (left). Mr Rundle and Ross Willis recreate the shot in 2025 (right). (ABC Newcastle: Keely Johnson)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/school-canteen-volunteer-shortages-rising-costs/105449428",
        "title": "School canteen orders may be thing of the past as rising costs bite",
        "publish_date": "Fri, 27 Jun 2025 22:19:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "For many Australians their school canteen order is a lasting memory.\n\nMerryn Bailey remembers writing hers on a brown paper bag.\n\n\"I would have a pie with sauce and chocolate milk,\" she said.\n\nGabe Hanmer remembers ordering pizza pockets or chicken and rice curry.\n\nAmanda Sinclair grew up in the Northern Territory.\n\n\"We had school canteen once a week on Mondays. You put your $2 in your brown paper bag and you get to choose between a meat pie and a sausage roll, and either a little carton of choccy milk or orange juice,\" she said.\n\nMerryn Bailey (left), Gabe Hanmer (centre) and Amanda Sinclair (right) each have fond memories of the school canteen. (ABC News: Maren Preuss)\n\nFor decades, canteens or tuckshops have held a special place in Australian school life.\n\nLeanne Elliston from the Federation of Canteens in Schools (FOCIS) said the nostalgia around school canteens is unsurprising.\n\nShe said for many children it's the \"sheer excitement\" of being able to choose what food they buy and eat, often for the first time in their lives.\n\n\"Food connects us, brings us joy and lightens up our day,\" she said.\n\nFOCIS, established in 1992, is a not-for-profit charity representing school canteens in Australia. (ABC News: Isaac Nowroozi)\n\nCanteens can also provide a safety net for busy parents who don't have time to prepare a lunch box.\n\nSome school canteens still thriving\n\nThe canteen at Kingston Primary School in southern Tasmania is run by paid staff and volunteer parents.\n\nPretty much everything on the menu is made from scratch, including lasagne, vegetable korma, salad wraps, toasties and apple chips.\n\nUnlike the canteens of old, party pies are only served on special occasions.\n\nThe lunch rush at Kingston Primary School's canteen. (ABC News: Maren Preuss)\n\nKingston Primary School's canteen coordinator, Wendy Thomson, said the canteen was a magnet for students.\n\n\"They love the time to come in and count their own money, make their own choices. They all get a say in what's going into the menu, they come in and help us prepare it,\" Ms Thomson said.\n\n\" It's the heart of the school. \"\n\nMs Thomson's love of food dehydration and preservation is reflected in the tuck shop menu. (ABC News: Maren Preuss)\n\nThe Kingston canteen does more than just sell food, it also runs a breakfast and lunch program for kids who need it.\n\n\"We have free lunches for sections of the school. They come in and sit at the table and have a hot meal,\" Ms Thomson said.\n\nToasties are on hand for kids who forget their lunch or who need to eat before taking medications.\n\nThere is also a constant supply of free apples from a nearby orchard.\n\nThe school sells dehydrated fruit for 50c per bag. (ABC News: Maren Preuss)\n\nJen Lea, a project officer from not-for-profit organisation School Food Matters said the group had been actively trying to promote healthier lunch options.\n\n\"We have been working with canteens for about 30 years trying to improve the fare and encouraging schools to cook from scratch and use fresh and local seasonal produce.\"\n\n\"We've realty seen that change over the years with positive improvements in nutrition,\" she said.\n\nMs Lea has connected with Kingston Primary School as part of her work with School Food Matters. (ABC News: Maren Preuss)\n\nCanteens in need of support\n\nDespite their popularity, some school canteens are struggling to survive.\n\nThe rising cost of food and a shortage of volunteers means many are cutting back the days they open or closing altogether.\n\n\"This shouldn't go on and we really need to step up and support our school canteens so children and families have access to that food,\" Ms Elliston said.\n\nFOCIS advocates for having healthy food and drinks in every school community in Australia. (ABC News: Maren Preuss)\n\nMany Tasmanian schools — with the exception of public, Catholic and independent schools — do not provide funding for school canteens.\n\nThey're often managed by parent volunteer groups or the school might outsource the running of the canteen to an external business.\n\nThe federation is calling on state and federal governments to provide money for staffing and equipment in school canteens.\n\n\"Many canteens [are] quite dated and are very much based on how canteens ran in the '70s and '80s,\" Ms Elliston said.\n\nMs Elliston says many school canteens would benefit from a revamp. (ABC News: Maren Preuss)\n\nThe federation would also like to see canteens have better access to cheaper food through bulk purchasing arrangements.\n\n\"Well-fed children contribute to better educational and long-term health outcomes,\" Ms Elliston said.\n\n\" A well-supported, funded and resourced canteen can make a huge difference. \"\n\nMs Elliston has worked in and with school canteens for the past 15 years. (ABC News: Maren Preuss)\n\nIn a statement, federal Education Minister Jason Clare said an agreement with every state and territory would see a $16.5 billion investment in public education over the next decade.\n\n\"This is a game changer for public education and it's a life changer for our kids at school today, kids that will be at school in the next few years, and children that aren't even born yet,\" he said.\n\n\"This funding isn't a blank cheque. It will be tied to reforms to help kids catch up, keep up and finish school. The sort of thing that all parents expect.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/act-opposition-leader-first-budget-reply-speech-upstaged-greens/105471324",
        "title": "ACT budget week sees opposition leader's first reply speech upstaged",
        "publish_date": "Fri, 27 Jun 2025 22:02:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Despite her long career in show business, Leanne Castley may never have been upstaged quite like she was in the ACT Legislative Assembly on Thursday.\n\nBut the last week may have provided material for some new country songs.\n\nThe Canberra Liberals leader rose to her feet for her first budget reply speech; a major set piece event for someone who admits she's not a \"typical politician\".\n\nAt the conclusion, she left the chamber with an easy smile, embraced by supporters congratulating her on a job well done.\n\nYet it was the speech that followed — from ACT Greens Leader Shane Rattenbury — that left the biggest mark on budget week.\n\nGreens flex crossbench muscle\n\nACT Greens Leader Shane Rattenbury says his party won't support the government's proposed health levy. (ABC News: Adam Kennedy)\n\nThe Greens' decision to oppose the government's $250 health levy is a sign that, when it comes to passing bills in this assembly, the Animal Farm theory applies; some MLAs are more equal than others.\n\nThe Liberals can but oppose, while the Greens — flexing their crossbench muscle — are the ones the government must pay attention to.\n\nThis is arguably the most significant political fight the minor party has picked with its former coalition partner so far.\n\nThe question now is how the fight ends.\n\nNegotiations began yesterday, with no clear resolution.\n\nThe Greens have indicated they're open to means-testing the levy, if it can't be removed from the budget entirely.\n\nBut if either side makes the political calculation they should play hard ball, its fate could hang in the balance for months, with the assembly not sitting again until September.\n\nShock levy and 'magic pudding economics'\n\nBefore handing down his first budget Treasurer Chris Steel flagged that it would include some \"tough decisions\". (ABC News: Matt Roberts)\n\nGreater costs for ratepayers may have been foreshadowed when Treasurer Chris Steel said there would be \"tough decisions\" at his mid-year budget update.\n\nThe levy, however, shocked many — and stands in stark contrast to the pre-election budget we got last year which contained few, if any, surprises.\n\nFive key takeaways from the ACT budget Photo shows A notepad with a list of household Bills, with cash laying on one side of the sheet. Treasurer Chris Steel has used his first ACT budget to deal Canberrans a tough set of cards.\n\nIt's not unusual for governments to get the tough budget out of the way in the first year of a term.\n\nBut this is also not Labor's first term.\n\nBy bringing down a budget of this nature after 24 years in office, the government is setting a high bar for itself to have made significant improvements by the time voters next go to the polls.\n\nPart of why Labor was successful last year even after six terms was the ability to stake a claim as the superior economic managers.\n\nThe chief minister famously accused the opposition of \"magic pudding economics\" during the leaders debate.\n\nHe might have been wishing for his own magic pudding this week.\n\nShadow minister's resignation takes attention from opposition leader\n\nCanberra Liberals MLA Peter Cain resigned from the party's shadow cabinet last week. (ABC News)\n\nThe events of the last few days have taken some of the attention away from an opposition leader, who could have used an unobstructed moment in the spotlight.\n\nEver since Peter Cain's departure from shadow cabinet last week, Leanne Castley has struggled for clear air, with an ongoing dispute about exactly how his resignation came about.\n\nHer budget reply was the ideal opportunity, but through no fault of her own, it failed to provide the kind of moment she was after.\n\nAttention now turns to the forthcoming announcement of the revised shadow cabinet, which may provide another reset moment.\n\nIf there is any lesson from a budget week, it is surely that nobody gets everything they want.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/act-support-providers-struggle-make-sense-ndia-pricing-review/105469646",
        "title": "NDIS pricing changes 'devastating', Canberra therapy providers say",
        "publish_date": "Fri, 27 Jun 2025 22:02:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "When physiotherapist Kate Caldow was asked how she's feeling about the future, her eyes welled up with tears.\n\n\"We're all feeling a bit down, a bit deflated, a bit under-valued,\" Ms Caldow said.\n\n\"And we're having to make really tough decisions.\"\n\nMs Caldow is one of a number therapy support providers in Canberra struggling to make sense of the National Disability Insurance Agency (NDIA's) latest annual pricing review.\n\nFrom July 1, the fee for physiotherapy services will be capped at $183.99 per hour, marking a $10 reduction.\n\nDietitian and podiatry appointments will be capped at $187.99 per hour, marking a $5 reduction.\n\nAnd travel subsidies for allied health professionals will be cut in half.\n\nRegular therapy support difficult in regional towns\n\nHayden Traynor was diagnosed with cerebral palsy after having a stroke at three months old. (Supplied)\n\nMs Caldow opened Country Children's Physiotherapy in Belconnen almost a decade ago with the goal of ensuring children living in regional towns surrounding the ACT had access to good quality care.\n\nHayden Traynor fits that exact bill.\n\nThe six-year-old, who lives in Booroowa, was diagnosed with cerebral palsy after having a stroke at just three months old.\n\n\"For the last six years, he's been a right hemiplegic and faced struggles every day,\" his mother Laura Moorby said.\n\nRegular physiotherapy has been key to helping Hayden overcome those challenges and has helped him to learn to walk, dress himself and make his own breakfast.\n\nIn order to see his occupational therapist, Hayden and his family have to travel from Boorowa to Canberra. (ABC News: Matt Roberts)\n\nOnce a week, a physiotherapist or allied health assistant from Ms Caldow's team visits Hayden at home or at school.\n\nHis speech pathologist also travels to Booroowa for appointments, and he sees an occupational therapist in Canberra.\n\n\"I think he'd be completely [incapacitated] without all of the intervention we've done,\" Ms Moorby said.\n\n\"We were lucky enough to get streamlined on to the National Disability Insurance Scheme (NDIS) early.\"\n\n'Heartbreaking, gut-wrenching' decision\n\nHayden's physiotherapy visits are now seriously in doubt, with Ms Caldow grappling with the prospect of scaling back her team's travel on account of the looming pricing changes.\n\nNDIS participants currently make up around 75 per cent of her clinic's clients.\n\n\"We travel to Booroowa, Gunning, Gundaroo, Harden, Collector — all the areas around Canberra,\" she said.\n\nThe looming changes have left Kate Caldow forced to consider scaling back her team's travel. (ABC News)\n\n\"For some parents, especially those with children with high needs, it's so hard to come and see us and there are no providers in these areas.\n\n\"Now, we have to make a decision whether we continue to see children by travelling and put our business at huge financial risk or whether we say, 'No sorry, we can't see these clients'.\n\n\"That's an awful decision to be making. It's heartbreaking, gut-wrenching.\"\n\nThe risk for Hayden, if he were to go without regular physiotherapy, is significant.\n\n\"If there's no intervention, he's likely to end up in a ball due to tightening muscles,\" Ms Caldow said.\n\n\"That will impact his ability to function, his ability to walk and his ability to use his arm.\"\n\nConstant battle for adequate support exhausting\n\nLaura Moorby says with her family already missing out on so much living in a regional town, the potential loss of travelling providers is devastating. (ABC News: Matt Roberts)\n\nMs Moorby will do whatever it takes to prevent her son from missing out — including making the three-hour round trip to Canberra — but admitted the constant battle for adequate support was exhausting.\n\n\"I'd do anything for my children, but it's been an uphill battle from the beginning with Hayden so to find out we have another challenge in front of us, it's just really hard,\" she said.\n\n\"It's honestly devastating, a real kick in the guts.\n\n\"And it's like it's targeted at us. We already miss out on so much living in a country town and now they're taking this away from us as well.\"\n\nIn a statement to the ABC, a spokesperson for the NDIA described the caps to hourly rates as \"modest\".\n\nAn NDIA spokesperson said the changes to travel claims were in direct response to feedback from NDIS participants. (AAP: Mick Tsikas)\n\n\"It's important that NDIS participants are paying prices that are fair and in line with industry standards,\" the spokesperson said.\n\n\"In some cases, NDIS price limits exceeded the market rate by up to 68 per cent.\"\n\nThe spokesperson also said the changes to travel claims were in direct response to feedback from NDIS participants.\n\n\"We heard from participants that excessive travel claims for therapy-related services were draining participant's plans faster than expected,\" they said.\n\n\"The updated travel therapy claiming rules encourage more efficient scheduling by providers and provide clear cost expectations for participants to help them get better value from their funding.\"\n\nSeventh year without occupational therapy pricing increase\n\nLike most five year olds, Jon Beit loves Bluey, trains and playing in playgrounds.\n\nBut unlike most other children his age, Jon requires an array of equipment to do the things he loves.\n\nFive-year-old Jon Beit lives with a genetic condition called spinal muscular atrophy. (Supplied)\n\nHe also relies on equipment to move, eat, sleep and shower.\n\n\"Jon lives with a genetic condition called spinal muscular atrophy,\" his mother Megan Beit said.\n\n\" It's a muscle-wasting condition and it means he needs support for basically everything he does. \"\n\nIt's occupational therapist Kat Senger who has been there every step of the way — picking the appropriate equipment and ensuring it's correctly fitted at home and school.\n\nHer Canberra clinic, Little Hands OT, is focused on children with high, complex needs, with NDIS participants accounting for 95 per cent of her client base.\n\nThe latest NDIA pricing review delivered her an unwelcome blow.\n\n\"Before these changes, I would say we were surviving, not thriving,\" Ms Senger said.\n\nAlthough occupational therapy won't see a reduction in pricing caps, it will endure a seventh year without a pricing increase from $193.99.\n\nHalved travel subsidies increase pressure\n\nOccupational therapist Kat Senger (left) says she's now considering introducing a gap fee to cover travel costs. (ABC News: Matt Roberts)\n\nVisits to a client's home, school or work as well as experiences in the community, such as supermarkets and on public transport, are foundational for occupational therapy.\n\nGiven that, the cut to travel claims will also put additional pressure on Ms Senger's business.\n\n\"Ultimately, occupational therapy is about life skills, so we practice those in our clinic but if we don't go into the environment, there's no way of knowing if those skills are transferring,\" Ms Senger said.\n\n\"And for some of our families, they just can't come here — they're financially strapped or they're single parents with four children who all require care — so we go to them.\"\n\nMs Senger is now considering introducing a gap fee to cover travel costs.\n\n\"We wouldn't change anything in terms of the hourly rate,\" Ms Senger said.\n\n\"For us, the gap fee would be the 50 per cent travel that the NDIS has taken away.\n\n\"Anything more, we will do our hardest to avoid.\"\n\nMegan Beit (left) says a gap fee for travel could mean her son Jon's occupational therapy is too expensive for the family. (ABC News: Matt Roberts)\n\nIt's a price Jon's mother, Megan, is not confident her family can afford to pay.\n\n\"Having a gap fee would mean either we miss out, we can't afford it therefore Jon misses out,\" she said.\n\n\"Or something else gets missed in order to pay for it — maybe that's takeaway one night or a night out at the movies.\n\n\"I think it's really heartbreaking that you have to make those choices.\"\n\n'It's a pretty big kick in the guts'\n\nMs Senger and Ms Caldow are still considering workforce changes, but both have made the decision to let go of their therapy assistants, who are typically university students.\n\n\"I was really hopeful this time around that with all the cost of living increases, wage increases, superannuation increases, the NDIA would see the numbers weren't adding up,\" Ms Senger said.\n\n\"I can't believe that's not been recognised and instead we're being portrayed as money hungry, price-gouging, fraudulent allied health professionals because of a few bad eggs, which are in every profession.\n\n\"All I want is to provide the best care for my kids and these new changes really stop us from being able to do that.\"\n\nDisability Intermediaries Australia CEO Jess Harper says plan managers and financial intermediaries are also reeling from the upcoming changes. (Supplied)\n\nIn Australia, more than 65 per cent of NDIS participants have their funds managed by a financial intermediary or plan manager.\n\nJess Harper, the chief executive of Disability Intermediaries Australia, said those working in that sector are also reeling.\n\n\"It's a pretty big kick in the guts,\" he said.\n\n\"It will now be seven years of systemic price freezes.\n\n\"And on top of that, the NDIA has also made the decision to pretty significantly cut the amount and the type of service plan managers can claim for.\"\n\nFrom July 1, a one-off establishment fee of $232 will be scrapped and some loading charges will also be removed, with a nationally consistent price introduced.\n\n\"In the last 12 months, we've seen more than 600 providers close their doors because they just can't keep the lights on and we expect that number will be significantly more this year,\" Mr Harper said.\n\n\"In the ACT, we've had 22 providers close their doors in the past 12 months, and we've had a further four give notice that they'll be closing come July 1.\n\n\"Ultimately, what we're seeing is a race to the bottom on quality and so for participants, that means they're getting less — less choice, less access, less availability.\"\n\nIndependent pricing 'makes a lot of sense'\n\nMr Harper said introducing an independent pricing approach was vital.\n\n\"The sector has been calling for this for years,\" he said.\n\n\"It is beyond belief that a government agency that is ultimately the payer gets to set the prices.\"\n\nNational Disability Services chief executive Michael Perusco says it would be valuable to introduce an independent pricing approach to the NDIS. (ABC News: Billy Draper)\n\nIt's a view shared by Michael Perusco, the chief executive of National Disability Services, an organisation that advocates for disability service organisations.\n\n\"Like aged care, like health, we think it makes a lot of sense for pricing in the NDIS to be independent,\" Mr Perusco said.\n\n\" That ensures people get the support they need and providers are compensated for the level of complexity of their work. \"\n\nHe said he was \"deeply concerned\" that providers of therapy support were going to leave the market.\n\n\"Organisations are looking at their finances and are going to make very difficult decisions about what they can continue and what they can't,\" Mr Perusco said.\n\n\"For some of those organisations, it means they won't continue at all.\n\n\"If that occurs, participants suffer and particularly those with the most complex needs who need the NDIS the most.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/tga-takes-action-over-b6-toxicity/105470210",
        "title": "'Far too much B6': Supplements likely headed off Australian shelves",
        "publish_date": "Fri, 27 Jun 2025 21:57:02 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Major changes have been proposed to restrict access to a common over-the-counter vitamin linked to a growing number of poisoning cases.\n\nVitamin B6 — often listed as pyridoxine, pyridoxal, or pyridoxamine — is present in thousands of products in Australia as an additive, including medicines, multivitamin and mineral supplements, energy drinks and weight loss shakes.\n\nMore than 170 reports of peripheral neuropathy, peripheral sensory neuropathy, small fibre neuropathy or chronic polyneuropathy for products containing B6 have been reported to the medicines regulator, the Therapeutic Goods Administration (TGA), though medical practitioners predict the true number is significantly higher.\n\n\"There are likely hundreds of thousands of Australians who are taking far too much vitamin B6,\" Michael Bonning from the Australian Medical Association said.\n\n\"While most of them have no side effects, if you are taking large doses of B6 your risk of peripheral neuropathy goes up.\n\n\"We know that reported cases of peripheral neuropathy are a massive underestimate of the problem in the community because so many people are unaware that vitamins can cause these symptoms.\"\n\nMichael Bonning says most people get all the vitamins they need from their daily diet. (ABC News: Rahni Sadler)\n\nIn a new development to improve public safety, several recommendations have been handed down in a report penned by a senior TGA medical officer known as \"the delegate\".\n\nCalled the \"Interim Decision\", the report acts on the advice of the government's Advisory Committee on Medicines Scheduling.\n\nMost notably, it calls for the TGA to reclassify supplements containing more than 50mg of B6 as Schedule 3 (Pharmacist Only), by February 2027.\n\nThe move would affect about 100 products, requiring pharmacists to first speak with consumers before approving a purchase.\n\n\"Currently, preparations providing up to 200 mg of [B6] … are available for self-selection without any professional guidance or oversight,\" the report states, adding \"almost 80 per cent of these products provide a dose of more than 2 mg/day, which is above the RDI for pyridoxine, pyridoxal or pyridoxamine.\n\n\" The daily requirement of vitamin B6 can be easily obtained from the usual Australian diet, and the use of supplemental vitamin B6 provides limited benefit except in people who have a clinically diagnosed vitamin B6 deficiency. \"\n\nA TGA spokesperson told 7.30 that the decision, if implemented, \"will reduce the maximum amount of vitamin B6 allowed in oral products than currently available for general sale\".\n\nSupplements take up major space in pharmacies. (ABC News: Jerry Rickard)\n\n\"The interim decision balances the risks and benefits of using vitamin B6, including the risk of peripheral neuropathy, acknowledging its potential for irreversible harm at higher doses and variability in individual metabolism,\" the spokesperson said.\n\nBut, as detailed in the report, the proposed changes only account for about 7 per cent of supplements containing B6 — there are more than 1,500 vitamins listed on the Australian Register of Therapeutic Goods, the majority of which are unscheduled and available over the counter.\n\nThe report also recommended supplements exceeding 200mg should be reclassified as prescription medicines or \"schedule 4\".\n\nCaroline Diamantis has warned of the dangers of complementary medicines. (ABC News: Jerry Rickard)\n\n\"It's a good thing that pharmacists will be able to have a really good counselling session with a patient to make sure the item they're taking doesn't interact with other medications,\" said Caroline Diamantis, vice-president of the Pharmaceutical Society of Australia.\n\n\"People used to think that complimentary medicines were completely safe, but the more we delve into it, the more we understand they do have unwanted side effects or interference with other medications,\" she told 7.30.\n\nLabel changes needed\n\nThe interim decision also recommends tightening labelling rules, calling for clearer identification of vitamin B6 on packaging and stronger warnings to help consumers avoid accidental overexposure.\n\nSupplements containing too much Vitamin B6 have been known to cause nerve damage. (ABC News: Jerry Rickard)\n\n\"Use of ingredient names in labelling is inconsistent and confusing for consumers … and not always described as vitamin B6,\" the report said.\n\n\"Of concern is that there are several products on the market where the front of the label provides no indication that vitamin B6 is an ingredient.\"\n\nIt suggested changing the language on warning labels to be more direct.\n\n\"Excess consumption of vitamin B6 can cause nerve damage. Stop use and see a doctor if you experience tingling, burning or numbness,\" was a suggestion.\n\nThe report also calls on the multi-billion-dollar complementary medicines sector to take greater responsibility for educating consumers and reducing the risk of vitamin B6 overexposure, noting current labelling places too much burden on consumers to calculate total B6 intake.\n\n\"Estimating the total daily vitamin B6 intake … is likely to be beyond the health literacy capability of the typical consumer,\" it said.\n\nLoading...\n\nThe CEO of Complementary Medicines Australia, John O'Doherty, told 7.30: \"We'll be carefully reviewing the interim decision and the recommendations of the Advisory Committee on Medicines Scheduling.\"\n\nMr O'Doherty argued adverse events relating to the use of vitamin B6 are \"extremely rare\".\n\n\"Based on a comparison of sales data with the TGA's public Database of Adverse Events, the chance of a reaction is less than one in half a million — this is extremely rare,\" he said.\n\nHowever, previous 7.30 investigations have found dozens of Australians have had issues from B6 toxicity, with many only becoming aware of their illness after seeing our reports.\n\nThe TGA delegate also warns the prevalence could be much higher.\n\nSupplements with high levels of B6 in them have caused cases of B6 toxicity. (ABC News: Tom Hartley)\n\n\"The true rate of occurrence of an adverse event cannot be determined from spontaneous adverse event reporting systems due to both general under-reporting and a lack of usage data,\" its report read.\n\n\"A low number of spontaneous adverse event reports cannot be considered evidence of the absence of a safety issue.\"\n\nMr O'Doherty however agreed with some of the labelling recommendations, telling 7.30 his organisation has \"been calling on the TGA to implement changes that allow labels and advertising to use terminology and ingredient names that consumers better understand\".\n\n\"At CMA's request, this is now under internal review at the TGA\", he said.\n\nClass action investigation progressing\n\nMedical negligence lawyer Nick Mann said the interim decision is a \"small step in the right direction\" but argued the TGA \"can and should\" go further.\n\nNick Mann says his law firm has launched a class action against Blackmores. ((Supplied))\n\nMr Mann told 7.30 his legal firm, Polaris, is pursuing a class action lawsuit against one of the largest companies in the complementary medicines industry, Blackmores, \"as a matter of public interest and safety\".\n\n\"We continue to investigate the potential class action, and given the response, the support and the evidence that's been pouring in … with over 140 people contacting us to date,\" Mr Mann said.\n\n\"Each of them had heartbreaking stories about how their lives have been affected by B6 toxicity, and sadly, many of them continue to be affected long after ceasing supplements containing Vitamin B6.\n\n\"We've also had at least 10 doctors contact us to tell us about their own experiences with B6, and to let us know that they have discovered B6 toxicity in several of their patients, after taking supplements containing higher than the RDI of the vitamin over weeks and months,\" he said.\n\nThe interim decision recommends the changes be made by February 1 2027 — offering an 18-month implementation period.\n\nWatch 7.30, Mondays to Thursdays 7:30pm on ABC iview and ABC TV",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/women-s-clubs-in-queensland-to-connect-outdoors-for-non-runners/105427680",
        "title": "Women turn to alternatives to running for 'outdoorsy' group exercise",
        "publish_date": "Fri, 27 Jun 2025 21:25:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Social run clubs have grown in popularity in recent years, offering a chance to make friends, get outside and exercise.\n\nBut what about women who don't enjoy pounding the pavement?\n\nA growing number say they want community, physical activity and time outdoors — just without the gasps for air that come with trying to chat mid-run.\n\n\"An activity alone is often not enough to keep people coming,\" said Dr Tarli Young, a research fellow in psychology at the University of Queensland.\n\n\"It's the sense of social group connection that makes the difference.\"\n\nPil Lattes social club gathers every second Sunday morning in Brisbane's New Farm Park or Orleigh Park. (Supplied: Ang Lewis Photography)\n\nOutdoor experiences can feel out of reach\n\nEvery second Sunday morning, group fitness instructor Keisha Love rolls out her mat and leads a free outdoor pilates class in Brisbane's New Farm Park or Orleigh Park.\n\nIt was created for people who love the social and movement aspects of run clubs but don't actually want to run.\n\nDespite only launching Pil Lattes social club a few weeks ago, the club saw over 320 people show up to their most recent session. (Supplied: Ang Lewis Photography)\n\nAmid the cost-of-living crisis, Ms Love said inclusive and low-cost fitness options were filling an important gap.\n\n\"I think people are searching for connection and ways to feel good that don't cost an arm and a leg,\" she said.\n\nAmid the cost-of-living crisis, Ms Love said inclusive and low-cost fitness options were filling an important gap. (Supplied: Brave Babes Australia)\n\nWhile some are working out in the park at sunrise, others are seeking more adventurous ways to move outdoors.\n\nBut they can often face barriers that make these experiences feel out of reach.\n\nDr Lauren Pearson, a research fellow at Monash University, said safety concerns, knowledge gaps and a lack of confidence were key factors.\n\n\"There are real concerns around personal safety, especially on isolated trails or shared paths,\" she said.\n\n'Doing it in a group felt way safer'\n\nFounded on the Sunshine Coast, Brave Babes creates beginner-friendly outdoor experiences designed specifically for women trying to meet like-minded people.\n\n\"When I moved to [the Sunshine Coast], I was super determined to make new friends … especially ones who also loved getting outdoors,\" said co-founder Kate Bradley.\n\n\"I think as a woman it's kind of very important to make sure that you've got all your ducks in a row … so I think doing it in a group felt way safer.\"\n\nWomen's running changes once the sun sets Photo shows A group of people running under trees. An increasing number of women are signing up to local run clubs, even tackling their first marathon. But safety fears once the sun sets are hampering their training efforts.\n\nCatered to women in their 20s and 30s, the program operates across six different states and territories, offering an opportunity to connect through activities like rock climbing, kayaking and swimming.\n\nAttendee Michelle Purkhart came across the group after searching for a run club alternative and decided to try her hand at a mountain e-biking event.\n\n\"Being on e-bikes meant you didn't have to pedal as hard, so you could actually talk to everyone while doing something outdoorsy and fun,\" she said.\n\nBrave Babes creates beginner-friendly outdoor experiences for women such as kayaking alongside dolphins and swimming with whales. (Supplied: Brave Babes Australia)\n\nPractical skills such as choosing the right gear or understanding local trails are often passed down informally within male-dominated groups, Dr Pearson said, making it harder for women to find reliable advice and build confidence.\n\n\"These kinds of programs … they're so important because it kind of breaks that barrier of being able to ask these small questions,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/cost-effective-ways-heat-your-home-winter-tips/105381088",
        "title": "Cost-effective ways of heating your home this winter",
        "publish_date": "Fri, 27 Jun 2025 21:17:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "As Australia's east coast braces for chilly nights this weekend, that means many of us will be cranking up the heaters and bracing for an eye-watering power bill.\n\nA rise in power prices from July 1 for people in three states also doesn't make things easier.\n\nBut there are ways to keep your electricity bill down during winter — while staying warm.\n\nHere are some tips recommended by ABC readers.\n\nBe smart with your thermostat\n\nNo, this doesn't mean setting your air conditioner to 28 degrees Celsius.\n\nYou want to avoid the temptation to heat a room any more than you need to, or you'll end up hurting your hip pockets.\n\nEnergy Australia recommends setting your temperature between the sweet spot of 18-20C in winter.\n\nEvery extra degree increases your heating energy use by up to 10 per cent.\n\nAnd don't forget to only heat the rooms you are actually using and shut the doors to the others. This concentrates the heat where you need it most.\n\nDon't have a heater?\n\nThat's okay! There are still some easy, low-cost changes you can implement to keep warm.\n\nHere is what experts and some ABC readers suggest, based on their own experiences.\n\nLayer up It may seem obvious, but wrapping up in fluffy sweaters and thick socks can be an easy way to stay comfortable. Jackie from the Central Coast in NSW swears by the 3B's: Beanie, Blanket and Bed socks. \"I managed to get through last winter without using any powered heating,\" she says. \"I've lived in a cold area for years and found that dressing properly works really well. \"I wear thermal clothing when necessary, put a dressing gown on and always wear socks or slippers.\" Michael from Canberra uses one particular mantra when winter comes: \"There's no such thing as cold weather, just poor clothing choices.\" Blankets After you have layered on the appropriate clothing, the next step would be to cosy up with some blankets. This could include your standard blanket, but also an electric one or a heated throw. Energy Australia says: \"On average, electric blankets cost about four cents an hour, compared to some space heaters which can cost around 15 cents an hour.\" Lee from South Australia says her heated throw blankets are \"lovely and warm\", and for under $100 each, \"a very good investment\". Thermal curtains Up to 40 per cent of heating can be lost through windows. So the key here is to lock the warmth in. Let in the free heat by opening curtains and blinds on sunny days. As the Sun starts to dip, close them up to help reduce the amount of air exchange between a cold window and the rest of the room. Essentially, you want to trap the cold air behind the curtain. For this to be as effective as possible, you will want to invest in quality thermal curtains and blinds such as honeycomb blinds. But if you do not have thermal curtains, that's OK. You can still take advantage of the winter sunshine by opening and closing them at the right time. Reverse ceiling fans Did you know that reversing your ceiling fans can make a room feel warmer in winter? That is because warm air rises, and you want to get the warmer air back down to floor level where the people are. A fan spinning clockwise on reverse or 'winter mode' will push down warm air that has drifted upwards. This redistribution of warm air can dramatically change the overall ambient temperature of a room and make it a few degrees warmer than it otherwise would be. You can check your remote control for a reverse function button. If you don't have a remote control, most fans have a switch on the side of their motor labelled forward/reverse or summer/winter. Just flick the switch to change the rotation. Adjust hot water system temperature Water heaters account for around 29 per cent of the average household's energy use. You can cut down on the energy your hot water system uses by adjusting the temperature. If you've got a storage hot water system, you want to set the temperature to 60C, according to Green Building Council Australia. That is because you need it to be at least 60C to stop the growth of Legionella bacteria, but any higher than that means energy is being used unnecessarily. A continuous flow, or instantaneous system does not need to be set as high as it does not store the water, so it should be no higher than 50C. Michael from the Northern Rivers region of NSW, who has solar panels, turns his hot water off at the meter box overnight and back on in the morning. \"All my water heating is essentially done by the Sun's rays,\" he says. \"I have learnt that I only need to heat water every second day over winter, whereas in summer I only heat my water once or twice a week.\" Also consider insulating the exposed pipes running from the hot water system and your hot water storage tank if you have one. If you are heading on holiday over the winter period, turn the hot water system off. But when you return, you will need to ensure that the water is heated and stored above 60C before use. This could take several hours. Draught proof cracks and gaps Sealing unintended openings in your home can save you up to 25 per cent on your heating bills. And this is one of the cheapest options to implement. During COVID, Carina Turner made several \"door sausages\" to stop drafts coming into her Victorian home. She places them up against all the doors, ensuring they sit snugly against the gap between the door and floor. To find out if you have any gaps or cracks, feel for moving air, visible light and/or whistling wind in the following areas: Windows and skylights\n\nWindows and skylights Floorboards\n\nFloorboards Walls\n\nWalls Doors\n\nDoors Appliances that connect to walls\n\nAppliances that connect to walls Unused fireplaces One easy way to check for drafts in your home is to light an incense stick or candle and look for the flutter that indicates there is air movement. Even if you have seals around your windows, remember that these can degrade over time. So regularly inspect them to make sure they are in good condition. Window sealing kits are also available from your local hardware store. Unplug vampire appliances Generally, most electronic appliances — think TVs, computers and gaming consoles — tend to enter a stand-by mode rather than fully powering down. So while you are asleep or away from home, they are working behind the scenes, sucking your electricity and cash. According to Canstar Blue estimates, appliances on stand-by mode could cost you up to 10 per cent of your electricity bill. That's more than $100 annually. Use your local council's energy efficiency kits Many councils and libraries across Australia offer energy efficiency kits that residents can borrow for free to identify areas of energy waste and take steps to reduce their consumption and lower their bills. These kits typically include tools like: Thermal cameras to help you locate draughts and gaps in insulation\n\nThermal cameras to help you locate draughts and gaps in insulation Plug-in energy monitors for measuring energy consumption and the running costs of appliances\n\nPlug-in energy monitors for measuring energy consumption and the running costs of appliances Water flow measuring cups to determine the water flow rate of your taps\n\nWater flow measuring cups to determine the water flow rate of your taps Thermometer for measuring the temperature of rooms, fridges and freezers\n\nUpgrades on the pricier side\n\nIf you are looking for longer-term investments, here are a couple of home upgrades you could do.\n\nInsulation\n\nLet's start off with the savings you could make from installing insulation:\n\nCeiling: 45 per cent or more on heating costs\n\n45 per cent or more on heating costs Walls: up to 25 per cent\n\nup to 25 per cent Floors: 20 per cent\n\nCSIRO senior experimental scientist Michael Ambrose says insulation, particularly ceiling, provides \"excellent bang for buck\". But expect to pay between $1,800 to $2,800.\n\nTry and heat the person first — think socks, dressing gowns and jumpers. ( )\n\nDouble-glazed windows\n\nAccording to the Victorian government, double-glazed windows retain up to 30 per cent more heat and conditioned air than single-glazed windows.\n\nThat is because the gap between the two panes of glass acts as a barrier, slowing down the transfer of heat.\n\nIt can cost anywhere from $300 to $1,500 per square metre.\n\nIf this is out of your budget, there are some other options to consider. This includes thermal film or secondary double glazing that you can attach to existing window fittings.\n\nOne ABC reader, Eric, has done exactly this, using perspex and magnetic tape to double glaze the front of his unit, which he says cost him $1,500.\n\nTry switching providers\n\nDon't assume your current energy provider is offering you the best deal available.\n\nGive them a call to find out what they will offer to keep you as a customer, and then ring up some competitors to compare the prices.\n\nOne ABC reader says every time they receive a utilities bill, they upload it to one of the comparison websites to see if there is a cheaper alternative.\n\n\"Often I find that there is [a cheaper alternative], and occasionally it's even from the same provider I'm currently with,\" they said.\n\n\"In the past, I've called up my energy or gas provider and asked for a discount, and while this can sometimes be successful, it's often much more hassle than simply connecting to a new company.\n\n\"I imagine I have saved hundreds.\"\n\nWhen it comes to insulation, it's important to ensure coverage in ceilings, walls and under floor. ( )\n\nLast December, the Australian Competition and Consumer Commission found as many as four in five households could be paying less for electricity by shopping around.\n\nThe report showed customers on flat rate market offers that are two or more years old experience average annual prices $317 higher than those on new offers.\n\nOne ABC reader who has switched to save on their power bill is Chris O'Neill from Victoria.\n\nLast year, he signed up to OVO's Free 3 plan which gives customers three hours of free electricity every day during the peak solar times between 11am-2pm.\n\nDuring that period, he switches on four heaters that use 6 kilowatt total, an oven that uses 2kW and the water heater that uses 2.4kW.\n\nSwitching electricity providers is one of the easiest ways to save money. ( )\n\nThat is a total of 10.4kW an hour, or 31.2 kWh per day of free heating.\n\n\"I get OVO to charge me $97 per month which is close to what we use but my credit keeps building up when the government puts a credit on my account,\" Mr O'Neill says.\n\n\"My average bill from May to October inclusive in 2023 with Powershop/Nectr energy was $139, so just on electricity alone OVO has saved about $42 per month or $248 in six months.\"\n\nOther ABC users also spoke about using the three-hour deal.\n\nIf you are looking to compare suppliers, this government website can help you find which has the best rate.\n\nIf you live in Victoria, visit Victorian Energy Compare.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-28/age-biological-age-test-veracity-metabolic-activity/105469080",
        "title": "People are spending hundreds on 'biological age' tests. Are they worth it?",
        "publish_date": "Fri, 27 Jun 2025 21:14:27 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "We all like to imagine we're ageing well. Now a simple blood or saliva test promises to tell us by measuring our \"biological age\". And then, as many have done, we can share how \"young\" we really are on social media, along with our secrets to success.\n\nWhile chronological age is how long you have been alive, measures of biological age aim to indicate how old your body actually is, purporting to measure \"wear and tear\" at a molecular level.\n\nThe appeal of these tests is undeniable. Health-conscious consumers may see their results as reinforcing their anti-ageing efforts, or a way to show their journey to better health is paying off.\n\nBut how good are these tests? Do they actually offer useful insights? Or are they just clever marketing dressed up to look like science?\n\nHow do these tests work?\n\nOver time, the chemical processes that allow our body to function, known as our \"metabolic activity\", lead to damage and a decline in the activity of our cells, tissues and organs.\n\nBiological age tests aim to capture some of these changes, offering a snapshot of how well, or how poorly, we are ageing on a cellular level.\n\nOur DNA is also affected by the ageing process. In particular, chemical tags (methyl groups) attach to our DNA and affect gene expression. These changes occur in predictable ways with age and environmental exposures, in a process called methylation.\n\nResearch studies have used \"epigenetic clocks\", which measure the methylation of our genes, to estimate biological age. By analysing methylation levels at specific sites in the genome from participant samples, researchers apply predictive models to estimate the cumulative wear and tear on the body.\n\nLoading Instagram content\n\nWhat does the research say about their use?\n\nAlthough the science is rapidly evolving, the evidence underpinning the use of epigenetic clocks to measure biological ageing in research studies is strong.\n\nStudies have shown epigenetic biological age estimation is a better predictor of the risk of death and ageing-related diseases than chronological age.\n\nEpigenetic clocks also have been found to correlate strongly with lifestyle and environmental exposures, such as smoking status and diet quality.\n\nIn addition, they have been found to be able to predict the risk of conditions such as cardiovascular disease, which can lead to heart attacks and strokes.\n\nTaken together, a growing body of research indicates that at a population level, epigenetic clocks are robust measures of biological ageing and are strongly linked to the risk of disease and death.\n\nLoading...\n\nBut how good are these tests for individuals?\n\nWhile these tests are valuable when studying populations in research settings, using epigenetic clocks to measure the biological age of individuals is a different matter and requires scrutiny.\n\nFor testing at an individual level, perhaps the most important consideration is the \"signal to noise ratio\" (or precision) of these tests. This is the question of whether a single sample from an individual may yield widely differing results.\n\nFive ways to improve your health and extend your lifespan Photo shows A photo of a woman wearing grey racerback top stretching, shot from behind There are no quick fixes or short cuts to living longer and healthier lives, but the science is clear on the key principles. Here are five things you can do to extend your lifespan and improve your health.\n\nA study from 2022 found samples deviated by up to nine years. So an identical sample from a 40-year-old may indicate a biological age of as low as 35 years (a cause for celebration) or as high as 44 years (a cause of anxiety).\n\nWhile there have been significant improvements in these tests over the years, there is considerable variability in the precision of these tests between commercial providers. So depending on who you send your sample to, your estimated biological age may vary considerably.\n\nAnother limitation is there is currently no standardisation of methods for this testing. Commercial providers perform these tests in different ways and have different algorithms for estimating biological age from the data.\n\nAs you would expect for commercial operators, providers don't disclose their methods. So it's difficult to compare companies and determine who provides the most accurate results — and what you're getting for your money.\n\nA third limitation is that while epigenetic clocks correlate well with ageing, they are simply a \"proxy\" and are not a diagnostic tool.\n\nIn other words, they may provide a general indication of ageing at a cellular level. But they don't offer any specific insights about what the issue may be if someone is found to be \"ageing faster\" than they would like, or what they're doing right if they are \"ageing well\".\n\nSo regardless of the result of your test, all you're likely to get from the commercial provider of an epigenetic test is generic advice about what the science says is healthy behaviour.\n\nLoading...\n\nAre they worth it? Or what should I do instead?\n\nWhile companies offering these tests may have good intentions, remember their ultimate goal is to sell you these tests and make a profit. And at a cost of around $500, they're not cheap.\n\nWhy 88 -year-old Graham’s swimming group keeps him alive Photo shows Five men in swim-wear stand at the end of an outdoor swimming pool looking in different directions and smiling. This group of men, whose oldest member is 91, meet for a swim every day. They say the routine keeps their mental and physical health in check as they age.\n\nWhile the idea of using these tests as a personalised health tool has potential, it is clear that we are not there yet.\n\nFor this to become a reality, tests will need to become more reproducible, standardised across providers, and validated through long-term studies that link changes in biological age to specific behaviours.\n\nSo while one-off tests of biological age make for impressive social media posts, for most people they represent a significant cost and offer limited real value.\n\nThe good news is we already know what we need to do to increase our chances of living longer and healthier lives. These include:\n\nimproving our diet\n\nincreasing physical activity\n\ngetting enough sleep\n\nquitting smoking\n\nreducing stress\n\nprioritising social connection.\n\nWe don't need to know our biological age in order to implement changes in our lives right now to improve our health.\n\nHassan Vally is an associate professor of epidemiology at Deakin University. This piece first appeared on The Conversation.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/banking-and-finance/jeff-bezos-and-lauren-sanchez-marry-in-venice-ceremony-20250628-p5mayl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jeff Bezos and Lauren Sanchez marry in lavish Venice ceremony",
        "publish_date": "Sat, 28 Jun 2025 11:14:19 +1000",
        "category": "finance",
        "authors": [
            "Sara Rossi",
            "Alvise Armellini"
        ],
        "text": "Venice: Amazon founder Jeff Bezos and journalist Lauren Sanchez have married in an extravagant wedding ceremony, the centrepiece of a three-day gala featuring dozens of stars but also protests by local activists.\n\nSanchez, 55, waved and blew kisses to onlookers as she boarded a sleek motorboat outside the Aman hotel to head to the ceremony, wearing short-sleeved, cream, fitted skirt suit, with shades and a headscarf to protect her from the blistering summer sun.\n\nLauren Sanchez and Jeff Bezos at their wedding in Venice, Italy. Credit: Instagram/Lauren Sanchez Bezos\n\nAround two hours later Bezos, 61, wearing a black tuxedo and bow tie over a white shirt, made the same short trip across the lagoon to the small island of San Giorgio where the couple exchanged rings, accompanied by singing from Matteo Bocelli, son of Italian tenor Andrea Bocelli.\n\nThe bride shared a picture of the happy married couple in a garden setting surrounded by guests.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/joint-qualifies-for-eastbourne-final-20250628-p5maze.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Joint qualifies for Eastbourne final",
        "publish_date": "Sat, 28 Jun 2025 11:11:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "Joint qualifies for Eastbourne final\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/hepatitis-a-outbreak-in-several-european-countries-20250628-p5maz4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hepatitis A outbreak in several European countries",
        "publish_date": "Sat, 28 Jun 2025 10:01:50 +1000",
        "category": "finance",
        "authors": [],
        "text": "Hepatitis A outbreak in several European countries\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/afl-teams-and-expert-tips-for-round-16-with-their-season-on-the-brink-blues-swing-the-axe-20250624-p5m9v9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL round 16 teams and expert tips: Two changes for Richmond",
        "publish_date": "Sat, 28 Jun 2025 09:58:18 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "NORTH MELBOURNE B: L.McDonald, T.Pink, G.Logue HB: F.O’Sullivan, C.Daniel, H.Sheezel C: D.Stephens, L.Davies-Uniacke, J.Simpkin HF: J.Konstanty, N.Larkey, C.McKercher F: P.Curtis, J.Darling, C.Zurhaar FOLL: T.Xerri, G.Wardlaw, T.Powell I/C: Z.Fisher, R.Hardeman, W.Dawson, L.Parker, R.Hansen jnr EMG: C.Coleman-Jones, W.Phillips, C.Harvey IN: W.Dawson OUT: C.Comben (injured)\n\nHAWTHORN B: J.Battle, T.Barrass, K.Amon HB: J.Impey, J.Weddle, H.Morrison C: S.Butler, C.Nash, D.Moore HF: B.Hardwick, J.Gunston, N.Watson F: M.Ramsden, M.Chol, J.Ginnivan FOLL: L.Meek, J.Newcombe, J.Ward I/C: S.Mitchell, C.Mackenzie, M.D’Ambrosio, C.Macdonald, C.Jiath EMG: S.Frost, F.Maginness, L.Breust IN: C.Mackenzie OUT: H.Hustwaite (omitted)\n\nCOLLINGWOOD\n\nB: C.Dean, J.Howe, D.Houston\n\nHB: J.Daicos, D.Moore, H.Perryman\n\nC: J.Crisp, S.Pendlebury, S.Sidebottom\n\nHF: B.Hill, T.Membrey, J.Elliott\n\nF: D.McStay, C.West, B.Mihocek\n\nFOLL: D.Cameron, N.Long, N.Daicos\n\nI/C: P.Lipinski, I.Quaynor, E.Allan, W.Hoskin-Elliott, L.Sullivan\n\nEMG: W.Parker, O.Markov, W.Hayes\n\nIN: C.Dean, C.West (debut)\n\nOUT: B.Frampton (injured), B.McCreery (injured)\n\n\n\nWEST COAST\n\nB: R.Maric, H.Edwards, S.Brock\n\nHB: L.Duggan, R.Ginbey, L.Baker\n\nC: J.Hutchinson, B.Hough, C.Hall\n\nHF: J.Cripps, J.Shanahan, J.Graham\n\nF: E.Hewett, J.Williams, L.Ryan\n\nFOLL: M.Flynn, T.Kelly, H.Reid\n\nI/C: J.Hunt, T.Brockman, B.Allan, B.Williams, T.McCarthy\n\nEMG: J.Petruccelle, A.Reid, R.Bazzo\n\nIN: B.Hough, J.Shanahan (debut)\n\nOUT: O.Allen (injured), T.Dewar (injured)\n\nRICHMOND\n\nB: B.Miller, N.Balta, N.Broad\n\nHB: S.Banks, T.Brown, N.Vlastuin\n\nC: H.Ralphsmith, D.Prestia, L.Trainor\n\nHF: S.Campbell, J.Ross, S.Green\n\nF: R.Mansell, T.Lynch, J.Faull\n\nFOLL: T.Nankervis 25, T.Taranto, J.Hopper\n\nI/C: T.Sonsie, K.McIntosh, J.Blight, M.Lefau, J.Alger\n\nEMG: J.Trezise, T.Sims, K.Smith\n\nIN: J.Blight, M.Lefau\n\nOUT: K.Smith (omitted), T.Sims (omitted)\n\nB: B.Miller, N.Balta, N.Broad\n\nHB: S.Banks, T.Brown, N.Vlastuin\n\nC: H.Ralphsmith, D.Prestia, L.Trainor\n\nHF: S.Campbell, J.Ross, S.Green\n\nF: R.Mansell, T.Lynch, J.Faull\n\nFOLL: T.Nankervis, T.Taranto, J.Hopper\n\nI/C (from): T.Sonsie, K.McIntosh, K.Smith, T.Sims, J.Alger, J.Trezise, M.Lefau, J.Blight\n\nIN: J.Trezise, M.Lefau, J.Blight\n\nOUT: Nil.\n\n",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/why-woolf-is-poised-to-break-the-bennett-curse-and-build-his-empire-20250627-p5matf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dolphins star ‘not up for sale’ as Cobbo bombshell builds Woolf’s empire",
        "publish_date": "Sat, 28 Jun 2025 09:38:31 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size It did not take long for Dolphins chief executive Terry Reader to know Kristian Woolf was the man to spearhead the NRL’s newest outfit into the future. Even though the shadow of Wayne Bennett was going to loom over whoever took the reins, they knew they had their man. “He was the number one target for us at the start,” Reader declared. “Even with Wayne as our coach, we still had a lot of questions. He said ‘we’ll do it together, let’s find the best coach, and he’ll be the assistant and take over at the end’. “I don’t think there’s ever been a better transition of NRL coaches than what’s happened. We weren’t building a house of cards, we were setting up a club for the future.” Kristian Woolf was identified as the Dolphins’ long-term coach early in the piece. Credit: NRL Photos Thus far, Woolf has dared to orchestrate a miracle – overcoming four-straight defeats in the first month to have his side one-point shy of the top eight.\n\nAdvertisement\n\nHe has done so amid a concerning injury toll – one which has claimed stars Tom Gilbert, Thomas Flegler, Daniel Saifiti, Max Plath and Jack Bostock for the rest of the season. Felise Kaufusi will also be sidelined with a knee concern, while Ray Stone has been playing with two busted shoulders. Loading Given their season even began with a last-minute relocation to Sydney due Cyclone Alfred, Reader did not hesitate to claim “I don’t think a first-year coach has ever gone through what Kristian has”. And yet, as he plots a boilover of his former mentor against South Sydney on Saturday, Woolf turned his nose up at excuses. “I’ve never seen anything like what we’ve had, particularly with season-ending injuries. That’s footy, we’re not going to get frustrated or whinge about it,” Woolf said. “We need to go out with a mindset that we’ll be at our best, be hard to beat and give ourselves a really good chance.\n\nAdvertisement\n\n“I know how hard they worked in pre-season, I know how hard they work for each other. They haven’t given me any indication that they’re going to change anything because we’ve lost a couple of players. “If anything, they’re more committed to working hard for each other.” Building his empire Barely 24 hours before the Dolphins announced Selwyn Cobbo would join the fold in 2026, Reader hinted the Broncos’ flyer was not in their sights. How things can change quickly in rugby league. “He’s one of those blokes that can do things other people can’t. He’s a guy you want in your team rather than the opposition,” Woolf said.\n\nAdvertisement\n\n“I don’t think it was ever no interest, it’s about availability, spots and things like that. A fair bit has changed in 24 hours … there’s a bit of movement all over the place and both ways for us.” That movement suggests those off contract face uncertain futures, but points to Woolf assembling the squad he believes can deliver a premiership. Cobbo will be joined by St Helens lock Morgan Knowles, while Francis Molo and Sebastian Su’A arrived mid-season. Flegler, Gilbert, Bostock, Plath, Saifiti, Isaiya Katoa, Jeremy Marshall-King, Hamiso Tabuai-Fidow, Kulikefu Finefeuiaki and Kurt Donoghoe are signed until at least 2027, while Herbie Farnwort expressed his desire to remain. Reports also emerged England halfback George Williams could be signed, and even swapped with Kodi Nikorima. Woolf dismissed the notion. “Kodi Nikorima is not up for sale or going to be swapped – that’s not going to happen,” he said.\n\nAdvertisement\n\n“He’s playing his best footy at the moment. That’s one thing we wouldn’t entertain.” Breaking the curse Woolf tasted success before taking over from Bennett – guiding St Helens to three Super League titles while transforming Tonga into a global force. But given the history of Bennett’s successors, the question was asked: could he break the Bennett curse? “Coming into the NRL and the expectations and toughness of the competition, there are nerves anyway,” Woolf admitted. “That [replacing Bennett] can certainly add to it. I thought about all that well before I came, [but] my two years working with Wayne gave me some confidence.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/aussies-clinch-first-test-20250628-p5mayx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussies clinch first Test",
        "publish_date": "Sat, 28 Jun 2025 09:34:46 +1000",
        "category": "finance",
        "authors": [],
        "text": "Aussies clinch first Test\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/pork-chop-delivery-but-lions-boss-had-a-point-and-wallabies-have-a-point-to-prove-20250627-p5mapw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Pork chop’ delivery but Lions boss had a point, and Wallabies have a point to prove",
        "publish_date": "Sat, 28 Jun 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "The drip-by-drip release of Wallabies players back to their franchises must be a form of water torture for British and Irish Lions chief executive Ben Calveley.\n\nArmed with a rock-solid argument, as expressed here, Calveley somehow managed to lose the moral high ground earlier this week with his heavy-handed demand that Joe Schmidt release all his Wallabies.\n\nCalveley may quickly want to acquaint himself with the Australian phrase, ‘carrying on like a pork chop’.\n\nFollowing his outburst, Schmidt has subsequently released Ben Donaldson, Hunter Paisami and Matt Faessler to the Force and Reds respectively, with Donaldson replacing the injured Kurtley Beale.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/funeral-home-owner-who-stashed-nearly-190-decomposing-bodies-sentenced-to-20-years-prison-20250628-p5mayd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Funeral home owner who stashed nearly 190 decomposing bodies sentenced to 20 years prison",
        "publish_date": "Sat, 28 Jun 2025 09:15:57 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "The morbid discovery revealed to many families that their loved ones weren’t cremated and that the ashes they had spread or cherished were fake. In two cases, the wrong body was buried, according to court documents.\n\nMany families said it undid their grieving processes. Some relatives had nightmares, others have struggled with guilt, and at least one wondered about their loved one’s soul.\n\nAmong the victims who spoke during Friday’s sentencing was a boy named Colton Sperry. With his head poking just above the lectern, he told the judge about his grandmother, who Sperry said was a second mother to him and died in 2019.\n\nHer body languished inside the Return to Nature building for four years until the discovery, which plunged Sperry into depression. He said he told his parents at the time, “If I die too, I could meet my grandma in heaven and talk to her again.”\n\nHis parents took him to the hospital for a mental health check, which led to therapy and an emotional support dog.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/west-indies-set-301-to-win-first-test-after-head-webster-and-carey-make-half-centuries-20250628-p5may3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hazlewood rips through West Indies as Australia take 1-0 series lead",
        "publish_date": "Sat, 28 Jun 2025 08:33:22 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Bridgetown: Test captain Pat Cummins has lauded Australia’s “brilliant” middle order and Josh Hazlewood’s ability to exploit an up-and-down pitch on the final day of a resounding 159-run win in Barbados.\n\nA five-wicket haul from Josh Hazlewood and some ordinary West Indies batting helped Australia secure a 1-0 series lead inside three days at Kensington Oval, which gives the team a five-day break before the second Test in Grenada.\n\nAfter two days of mediocre batting from their top order, Australia finally got their act together with the game in the balance, making light work of a West Indies outfit who produced what locals call a “Calypso Collapso” in the last innings of the match to be bowled out for 141 in 33.4 overs.\n\nPlay ended one hour and 13 minutes after the official 5pm finish time as officials allowed extra overs to be bowled given a result was a live option.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/jake-paul-walks-out-on-piers-morgan-20250628-p5mayr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jake Paul walks out on Piers Morgan",
        "publish_date": "Sat, 28 Jun 2025 08:01:23 +1000",
        "category": "finance",
        "authors": [],
        "text": "Jake Paul walks out on Piers Morgan\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/hazlewood-goes-bang-bang-20250628-p5mayo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hazlewood goes bang-bang",
        "publish_date": "Sat, 28 Jun 2025 07:47:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "Hazlewood goes bang-bang\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/its-about-power-how-sexual-harassment-affects-those-on-the-margins/dohhse9ks",
        "title": "'It's about power': How sexual harassment affects those on the margins",
        "publish_date": "Fri, 27 Jun 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Warning: this story contains elements that may distress some people.\n\n\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFor many people, reporting sexual harassment at work is not as easy as simply making a complaint.\n\n\n\n\n\nWhile laws are in place to prevent and eliminate sexual harassment at work, experts and victim survivors say there are still significant gaps between policy and practice.\n\n\n\n\n\nNow, the Australian Human Rights Commission says more needs to be done to support those most vulnerable to harassment at work.\n\n\n\n\n\nDr Anna Cody is Australia's Sex Discrimination Commissioner.\n\n\n\n\n\nShe tells SBS that for real change to occur, leaders have to take action.\n\n\n\n\n\n\"What we need to see is leaders stepping up. So that's CEOs, directors of boards, managers, supervisors, but everyone within a workplace to make sure that people are safe and respected at work. And how we can then create a culture where it's not okay to not be respectful within a workplace. We need to ensure that our workplaces are diverse, that there is cultural diversity, people with disability at all levels within an organisation.\"\n\n\n\n\n\nThe Commission's new report, called Speaking From Experience, aims to address gaps in understanding about what workers from diverse backgrounds think needs to change to make workplaces safer.\n\n\n\n\n\nSexual harassment at work is a complex matter and extends beyond gender discrimination, occurring most often to those who experience various forms of overlapping disadvantage or discrimination.\n\n\n\n\n\n\"Harassers definitely do choose who they are harassing though they'll choose the person who's on a temporary visa or who really needs this job and who can't afford to let it go. So they use that vulnerability as a way of protecting themselves. So workplaces and bosses and supervisors need to be conscious of that, particularly where there are systems in place or locations within a workplace. You can create safety within a workplace through systems as well as through the way in which you deal with the person who's experienced workplace sexual harassment.\"\n\n\n\n\n\nThe Australian Human Rights Commission says one in three Australians report being sexually harassed at work.\n\n\n\n\n\nThis figure was far higher for some, with almost half [[48%]] of people with a disability experiencing harassment at work and 56 per cent of Aboriginal and Torres Strait Islander people.\n\n\n\n\n\nThose in insecure employment, LGBTIQ+ people, culturally or linguistically diverse people, and people with a disability, are not only more likely to experience sexual harassment, but less likely to feel safe enough to report it.\n\n\n\n\n\nPrabha Nandagopal is an award-winning human rights lawyer and founder of Elevate Consulting Partners, a firm that works with businesses to create safe, respectful and inclusive workplaces.\n\n\n\n\n\nShe says leaders must be able to address their own blind spots and centre the voices of those affected.\n\n\n\n\n\n\" We know that sexual harassment isn't just about gender, it's about power. And people who do sit at that intersection of racism, sexism, ableism, for example, are often more exposed and less protected. And as a woman of colour, I've seen how these layers of discrimination compound when it comes to leaders, it starts with really listening even when it's uncomfortable. So I'm briefing board directors and leaders and middle management almost every day in my day job, and it's very easy for me to talk about workplace sexual harassment. But the moment you start talking about racism in the workplace, that's when there's a bit of discomfort.\"\n\n\n\n\n\nWhile acknowledging changes to the national approach over the past decade and the greater responsibility placed on employers, experts say policy and practice gaps still exist.\n\n\n\n\n\nDrawing from the experience of over 300 victim-survivors of workplace sexual harassment, the report emphasises the need for people to feel safe enough to report.\n\n\n\n\n\nIn 2022, a legal obligation called Positive Duty was added to the Sex Discrimination Act.\n\n\n\n\n\nUnder the obligation, employers have a duty to eliminate and prevent, as far as possible, unlawful acts of sexual harassment at work.\n\n\n\n\n\nPrabha Nandagopal says she supports recommendations to impose civil penalties for companies failing to comply.\n\n\n\n\n\n\"The positive duty regime under the Federal Sex Discrimination Act doesn't have civil penalties attached to it. So if someone doesn't comply with the commission's compliance notice that organization can be taken to the federal court. Where the federal court can make any order it sees fit. But unlike say your work health and safety regime, the commission's enforcement powers are quite limited.\"\n\n\n\n\n\nWorkplace sexual harassment also extends beyond the physical workplace: it's not only harmful psychologically but can isolate individuals.\n\n\n\n\n\nDr Shih Joo Tan is a professor of criminology at the University of Melbourne and has co-authored a series of reports on the experiences of migrant and refugee women with workplace harassment.\n\n\n\n\n\nShe says aside from uncertainty around their rights, people from diverse cultural backgrounds are often dismissed as misunderstanding Australian culture.\n\n\n\n\n\n\"For example, some migrant and refugee women might be on an employer-sponsored visa, which would sit very hard for them to even report or think about reporting because they would then have to consider the consequences that it could have on their visa status or which also links to their right to remain in a country. So there's that. And also the other issue that was also mentioned in the report was that a lot of times when they do try to say that this is what happened to me, or this person had said this really horrible thing to me, often the response that they could get is that this is just a joke or this is part of the Australian culture, learn how to, you just need to learn Australian culture in that way. So it was seen as a problem on their part that there was a lack of understanding.\"\n\n\n\n\n\nAnother issue raised in the report was the lack of knowledge around different forms of harassment.\n\n\n\n\n\nOften mistaken as only the most blatant forms of harassment, sexual harassment in the workplace can be covert and is often dismissed as something more lighthearted.\n\n\n\n\n\nDr Anna Cody says without proper understanding of what sexual harassment is, employers can't properly address it.\n\n\n\n\n\n\"There have been significant changes over the last decade coming out of the Me Too movement and a greater understanding of workplace sexual harassment. But we still need to build our understanding of what constitutes workplace sexual harassment. So while many people understand touching, unwanted sexual touching, to be workplace sexual harassment, we need to think about messaging of sexual content or of leering or staring at someone in a sexual way or suggesting sexual acts with that person. All of those things also constitute workplace sexual harassment.\"\n\n\n\n\n\nThe report offers policymakers and organisations eleven key recommendations.\n\n\n\n\n\nAll of the recommendations centre around reducing barriers - barriers to information, to safety, to being heard, to accessing support, and to justice and accountability.\n\n\n\n\n\nDr Tan says while many people never make a formal complaint, there were certain things people say made it easier when they did.\n\n\n\n\n\n\"In the very first instance, most of them felt comfortable and secure with their direct supervisors. So there was immediate support from management level. The other thing was also assurance that this would not impact on their visa status or their financial security, or that they would not have to face small talk in the office, which was another thing that women had talked about as impacting on their mental wellbeing and things that they would consider as impacting on their positions. They felt like they were punished on a social level for speaking up or for complaining.\"]]\n\n\n\n\n\nMs Nandagopal says employers need to take the time to understand the problems specific to their workplace.\n\n\n\n\n\n\"So firstly, it's about really understanding the nature and prevalence of sexual harassment in their workplace by speaking to their workers and consulting, particularly those from marginalised groups, not only about what they're experiencing, but asking what they need to feel safe. Then investing in real quality education and training for leaders and workers. And then ensuring their policies and reporting processes are trauma informed and culturally safe. So going beyond that tick-a-box approach to really investing in quality effective measures to prevent and respond to sexual harassment.\"\n\n\n\n\n\nCommissioner Anna Cody says the landmark report is a crucial final step in the Commission's Respect at Work agenda.\n\n\n\n\n\nAnd while there is still a long way to go as the recommendations are considered, she says it's important to appreciate the work of victim survivors in telling their stories.\n\n\n\n\n\n\"The people that we heard from, how strong and determined they were in trying to make our workplaces fairer and safer for everyone, that they wanted to share their stories so that we could act on them and ensure that other people didn't have to go through what they had gone through.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/i-didnt-sleep-at-all-one-mothers-terrifying-wait-for-news-from-a-war-zone/rlyjc4ter",
        "title": "‘I didn’t sleep at all’: One mother’s terrifying wait for news from a war zone",
        "publish_date": "Fri, 27 Jun 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nNayran Tabiei keeps busy in the kitchen making traditional Syrian dishes for her catering business in Melbourne.\n\n\n\n\n\nBut this week, her thoughts were far away, worrying about her three sons in Iran’s capital Tehran.\n\n\n\n\n\n\"The mobile is cut, the line they cut - no news at all. My heart started to beat. I didn't sleep at all. I tried every night, every day I'm trying to message and you see 100 message in my mobile but no answer.\"\n\n\n\n\n\nAs bombs rained down on the city, Ms Tabiei could only hope her boys - aged in their 20s – had survived.\n\n\n\n\n\n\"I'm boiling from inside because the thing - when nothing in your hand and nothing you can do. You just, y’know you want to help. My heart start like where we go, what do we do? And I cannot give them any money. I cannot give them any support, even call.\"\n\n\n\n\n\nMs Tabiei is married to an Iranian man and the couple fled Syria in 2012 with their young daughter, leaving three young sons with their grandmother in Tehran.\n\n\n\n\n\n\"I make bad decision. I felt so bad. I cannot believe 14 years gone I didn't see them and it's hard for a mum to see them grown up without them beside me.\"\n\n\n\n\n\nArriving in Australia as an asylum seeker, Ms Tabiei later opened a small café called Flavours of Syria, offering work and training to many, like herself, who were forcibly displaced.\n\n\n\n\n\n\"Hundreds and hundreds of asylum seekers, I help them open their business and start up. It makes me proud. I'm so happy in Australia and sharing my food and culture.\"\n\n\n\n\n\nFinally, just days ago, Ms Tabiei had the phonecall she hoped for – from her sons who are alive and well, having fled Tehran.\n\n\n\n\n\n\"My boy called me, my heart beating - yeah good! They stay in the mountain. They took a room with their friend and when they called I am like ‘Oh thank God, they are alive!’\"\n\n\n\n\n\nMs Tabiei wants to reunite her family but says every effort to bring her sons here has so far failed.\n\n\n\n\n\n\"From the day I heard that crisis in Iran I sent all the parliament that I need help. My hearts shaken and I need my children beside me. In this moment we need help. And 14 year I didn't see them.\"\n\n\n\n\n\nIn a further loss, rising costs have also forced her to close her Syrian café in Melbourne’s St Kilda.\n\n\n\n\n\n\"It's hard to pay the rent and the cost so high. Before we had plenty of girls in the kitchen, but now I cannot afford to hire.\"\n\n\n\n\n\nAnd she’s not alone.\n\n\n\n\n\nRecent data from credit reporting agency CreditorWatch shows that 10 per cent of all Australian hospitality businesses closed down over the past year.\n\n\n\n\n\nCEO Patrick Coghlan explains:\n\n\n\n\n\n\"They are being hit from all sides. Obviously, consumer discretionary spend is down, cost of labour, cost of goods, et cetera, all increasing.\"\n\n\n\n\n\nFrom next week, a raft of new costs will add to the pressures, according to Luke Achterstraat, CEO of the Council of Small Business Organisations, or COSBOA.\n\n\n\n\n\n\"As of one July, the award rate goes up three and a half percent. The super guarantee increases by 0.5 per cent. So that's 4 per cent already on the wage stack. And don't forget, on top of that you have payroll tax.\"\n\n\n\n\n\nMr Achterstraat says more help is needed.\n\n\n\n\n\n\"It's the toughest operating environment in recent memory. For a small business with revenue of up to $20 million per year, we are calling for the corporate tax rate to be slashed from 25 per cent to 20 per cent.\"\n\n\n\n\n\nThe most recent Consumer Price Index ,or CPI, shows inflation sitting at 2.1 per cent in the 12 months to May.\n\n\n\n\n\nCreditorwatch CEO Patrick Coghlan says the new figure offers fresh hope.\n\n\n\n\n\n\"We've seen two rate cuts already. They're the biggest drivers of economic activity, of GDP, of spending both from consumer and commercial. And we're expecting a couple of more of those this year as well. So, the trend is certainly heading in the right direction.\"\n\n\n\n\n\nAny interest rate relief is too late for Ms Tabiei, who shut her café to focus on a lower-cost catering business.\n\n\n\n\n\nKeeping busy is a labour of love, she says, and cooking distracts from other worries.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/asx-flatlines-but-volatility-to-continue/btt2m3anq",
        "title": "ASX flatlines but volatility to continue",
        "publish_date": "Fri, 27 Jun 2025 08:40:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/former-cdc-staffers-ring-alarm-bells-over-decisions-of-new-us-vaccine-panel/obp1wx7v1",
        "title": "Former CDC staffers ring alarm bells over decisions of new US vaccine panel",
        "publish_date": "Fri, 27 Jun 2025 06:16:40 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nEvery week for a number of weeks, current and former employees of the US Centres for Disease Control and Prevention have been blowing whistles and banging drums at a street intersection near the group's headquarters in Atlanta, Georgia.\n\n\n\n\n\nThey're protesting changes to the US Department of Health now led by Robert F Kennedy Jr, saying that he has brought his long history of vaccine scepticism into his role as the nation's top health official.\n\n\n\n\n\nAmong the demonstrators is infectious diseases physician Peter Cegielski.\n\n\n\n\n\n\"There have been rallies here every Tuesday maybe since March... The public needs to mobilise because, I mean, there's a clown show running this country and DHHS.\"\n\n\n\n\n\nThe CDC protesters' appearance on the Atlanta corner this week was timed to coincide with the first meeting of the reconstituted US panel known as ACIP or the Advisory Committee on Immunisation Practices.\n\n\n\n\n\nKennedy abruptly fired all 17 previous members earlier this month after accusing them without evidence of conflicts of interest, replacing them with seven handpicked others.\n\n\n\n\n\nAmong them is new Committee chair Dr Martin Kulldorff, a biostatistician and epidemiologist who publicly criticised COVID-19 lockdowns and was fired from Harvard for refusing to take a COVID vaccine.\n\n\n\n\n\nDr Kulldorff was one of five members at the meeting to vote for a recommendation that people aged 6 months and older get a flu vaccination only using a single dose formula which is thimerosal-free.\n\n\n\n\n\n\"Even if the amount available in the vaccine, maybe that amount is safe - but does not amount for exposed to be exposed to mercury from other sources. So it's cumulative and there is a need. And if we care about public health we should try to minimise exposure to mercury.\"\n\n\n\n\n\nThe reason why that's important is because the panel's recommendations influence the official US immunisation schedule, determine insurance coverage for vaccines, and act as an encouragement for people to get vaccinated.\n\n\n\n\n\nThimerosal is widely used in lower income countries because they are more likely to use lower cost multidose containers that must be punctured repeatedly, raising the risk of contamination which thimerosal helps to prevent.\n\n\n\n\n\nBut the preservative has also been at the centre of controversies and myths about vaccines for decades, with Robert F Kennedy involved in some of that debate.\n\n\n\n\n\nIn 2014, when Kennedy was an environmental lawyer, he appeared on Fox 5 New York to promote a book he had published called 'Thimerosal' that alleged evidence had been covered up showing it could cause brain problems, including autism.\n\n\n\n\n\n\"You know I've had all six of my children vaccinated. I want to see everybody taking their vaccines. We need full coverage. People don't take them (vaccines) because they no longer believe in the CDC. They can see the science.\"\n\n\n\n\n\nThe CDC says it conducted nine separate studies since 2003 that found no link between thimerosal-containing vaccines and ASD or Autism Spectrum Disorder, and that multiple scientific studies have found no evidence of a link either.\n\n\n\n\n\nThe CDC was not given an opportunity to present evidence before the committee's vote - but Lyn Redwood, the former president of what is now known as Children’s Health Defense, an antivaccine group founded by Secretary Kennedy - did air her concerns about thimerosal.\n\n\n\n\n\n\"Thimerosal is recognised as a developmental and reproductive toxicant, and is listed as a chemical in the California Proposition 65 list since 1990.\"\n\n\n\n\n\nSecretary Kennedy has maintained he has always just asked questions that are justifiable and necessary, arguing that the public's trust in vaccines has waned because those questions have not been answered satisfactorily.\n\n\n\n\n\n\"We're living now in a time of upheaval, a time of popular revolt against established institutions that have lost the public trust - and that includes medicine. President Trump and I are committed to earning it back.\"\n\n\n\n\n\nBut at least two CDC staff members have left over the changes, and major medical experts and former members of the panel have also expressed concern over its reconstitution.\n\n\n\n\n\nGeorgia State Senator for District 42 Elena Parent says the panel is essentially embedding false information and vaccine scepticism into national policy.\n\n\n\n\n\n\"This is the very body that has guided our nation's policies for vaccines for over 60 years. And by the way, this is what everyone said when they said 'do not confirm him'. Do not confirm him as the secretary of health. Anyone who knew anything about public health and vaccines said 'no'. These guy has peddled disinformation for years. And what did they do? Fell in line behind Trump and all the rest of them and put him in. And the worst fears are now coming true with this assault on the ACIP.\"\n\n\n\n\n\nThe Secretary's views have also received a cool reception at a Brussels fundraising dinner for the GAVI global vaccine alliance, a group that facilitates immunisations in lower-income countries.\n\n\n\n\n\nIn a video recording played to the gathering, Kennedy cast doubt on the diphtheria, tetanus and pertussis vaccines — which the World Health Organisation and other agencies have long deemed to be safe and effective.\n\n\n\n\n\nHe also announced the US will be cutting its funding to GAVI, on the basis that they have allegedly silenced dissenting views and what he has described as legitimate questions about vaccine safety.\n\n\n\n\n\n\"Consider the best science available even when the science contradicts established paradigms. Until that happens, the United States won't contribute more to GAVI.\"\n\n\n\n\n\nGAVI says that's ridiculous.\n\n\n\n\n\nChairman of the Board Jose Manuel Barroso says the organisation has multiple safeguards and processes in place to prioritise the health and safety of children.\n\n\n\n\n\n\"Gavi is indeed a unique organisation in global health with a public-private model that has brought together national governments, donors, vaccine manufacturers, scientific institutes and grassroot organisations to vaccinate more than 1 billion children in low income and middle income countries. And I have to say that Gavi has done it always following the best scientific advice.\"\n\n\n\n\n\nDoctors Without Borders is among the medical groups to say they believe countless children will die from vaccine-preventable diseases as a result of the U-S withdrawing support for Gavi.\n\n\n\n\n\nThe charity’s global health advocacy director, Mihir Mankad, has called it cruel and reckless to invoke misleading and inaccurate claims about vaccine safety as the pretext for cutting all global vaccine funding.\n\n\n\n\n\nBut GAVI says it will be able to continue much of its work, and has plenty of other willing donors.\n\n\n\n\n\nAustralia's Foreign Minister Penny Wong has said in a statement that Australia is sending $386 million over five years, while European Union President Ursula von der Leyen has also committed money.\n\n\n\n\n\n\"Today I am pleased to pledge 360 million Euros to GAVI at this summit, and this is part of a total Team Europe pledge of 2 billion Euros or even more.\"\n\n\n\n\n\nMeanwhile, back in the US, some doctors are taking matters into their own hands.\n\n\n\n\n\nThe influential American Academy of Paediatrics boycotted A-C-I-P's first meeting in protest, saying it will now publish its own vaccine schedule for children and do so independently of the vaccine panel, calling it “no longer a credible process.”\n\n\n\n\n\nAnd the CDC demonstrators - which include former Division of Overdose Prevention public servant, Abby Tighe - say they will keep ringing their protest bells on that Atlanta corner for as long as they can.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/iran-israel-ceasefire-nato-daddy-armenias-pantless-politics/075j10u8r",
        "title": "Iran-Israel ceasefire, NATO ‘daddy’ & Armenia's pantless politics",
        "publish_date": "Fri, 27 Jun 2025 05:46:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-27-june-2025/hag5c69vu",
        "title": "SBS News In Easy English 27 June 2025",
        "publish_date": "Fri, 27 Jun 2025 04:09:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nThis is SBS News in Easy English. I'm Biwa Kwan.\n\n\n\n\n\nPrime Minister Anthony Albanese has defended the government's position on defence spending, dismissing calls from the US to lift spending to 3.5 per cent of GDP - or gross domestic product.\n\n\n\n\n\nLeaders at the NATO summit this week agreed to raise their defence spending to 5 per cent of GDP.\n\n\n\n\n\nWhite House Press Secretary Karoline Leavitt says the US expects countries in the Asia-Pacific, including Australia, to match the target of 5 per cent.\n\n\n\n\n\nMr Albanese says Australia is sticking to the current plan to lift defence spending to 2.3 per cent of GDP by 2034.\n\n\n\n\n\n\"We have increased our defence investment. We have increased it by $57 billion over the medium-term; and by more than $10 billion in the short-term as well. I am not going to comment on things between Spain and the United States. My job is to look after Australia's national interest - that includes our defence and security interests. And that is precisely what we're doing.\"\n\n\n\n\n\n+++\n\n\n\n\n\nAustralia has increased its funding commitment to the global vaccine group Gavi, as the US says it is withdrawing all of its funding over vaccine safety concerns.\n\n\n\n\n\nUS Health Secretary Robert F Kennedy Jr, a vaccine sceptic, did not provide any evidence to support his claim that Gavi, had \"ignored the science\" in immunising children around the world.\n\n\n\n\n\nThe Chair of the Board of Gavi, Jose Manuel Barroso, says the organisation has multiple processes in place to prioritise the health and safety of children.\n\n\n\n\n\n\"Gavi is indeed a unique organisation in global health - with a public-private model that has brought together national governments, donors, vaccine manufacturers, scientific institutes and grassroot organisations to vaccinate more than 1 billion children in low income and middle income countries. And I have to say that Gavi has done it always following the best scientific advice, the best science in the world - putting as a high priority vaccine safety.\"\n\n\n\n\n\nAt a summit in Brussels, donors pledged A$13.75 billion in funding to cover the five years until 2030.\n\n\n\n\n\nAustralia has announced it will provide A$26 million more than what was requested, for a total contribution of A$386 million over five years.\n\n\n\n\n\n+++\n\n\n\n\n\nA violent online extremist group called Terrorgram has been listed as a terrorist organisation by the Australian government.\n\n\n\n\n\nTerrorgram uses encrypted platforms to distribute racist and nationalist propaganda designed to provoke terrorist attacks.\n\n\n\n\n\nThe listing means anyone found to be a member - or associated with the group - could face up to 25 years in jail.\n\n\n\n\n\nMinister for Home Affairs Tony Burke says such extremist hatred has no place in Australia.\n\n\n\n\n\n+++\n\n\n\n\n\nTraditional owners of a region in Western Australia will travel to Paris next week to raise concerns with the United Nations, about a draft decision to deny a World Heritage listing for an ancient rock art collection.\n\n\n\n\n\nThere are more than 1 million rock carvings at the Pilbara site, which is next to a Woodside gas plant.\n\n\n\n\n\nLast month, the UN agency UNESCO indicated it would not be approving a World Heritage listing for the rock art collection, because of damage from nearby industry.\n\n\n\n\n\nThe state and federal governments have given Woodside permission to extend its North West Shelf gas plant for another 40 years.\n\n\n\n\n\n+++\n\n\n\n\n\nThe composer who wrote the theme for Mission: Impossible and more than 100 other arrangements for film and television has died.\n\n\n\n\n\nLalo Schifrin died of complications from peneumonia.\n\n\n\n\n\nHe was 93.\n\n\n\n\n\nThe Argentine won four Grammys and was nominated for six Oscars.\n\n\n\n\n\nHe also arranged the grand finale musical performance for the World Cup in Italy in 1990, in which the Three Tenors: Placido Domingo, Luciano Pavarotti and Jose Carreras, sang together for the first time.\n\n\n\n\n\n(Excerpt from the performance)\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/pm-defends-decision-on-defence-spending-goal-midday-news-bulletin-27-june-2025/6181eavt8",
        "title": "PM defends decision on defence spending goal | Midday News Bulletin 27 June 2025",
        "publish_date": "Fri, 27 Jun 2025 02:18:10 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\nThe Prime Minister defends decision on defence spending goal\n\nTerrorgram formally listed as terrorist organisation by the Australian government\n\nthe Matildas prepare for their second game against Slovenia\n\nPrime Minister Anthony Albanese has defended the government's position on defence spending, dismissing calls from the Trump administration to lift spending to 3.5 per cent of GDP.\n\n\n\n\n\nLeaders at the NATO summit this week agreed to raise their defence spending to 5 per cent of GDP, although Spain secured an exemption allowing it to limit the increase to 2.1 per cent.\n\n\n\n\n\nWhite House Press Secretary Karoline Leavitt says the US expects its allies in the Asia-Pacific, including Australia, to match the target of 5 per cent.\n\n\n\n\n\nMr Albanese says Australia will stick to its current plan to lift defence spending from 2 per cent to 2.3 per cent of GDP by 2034.\n\n\n\n\n\n\"We have increased our defence investment. We have increased it by $57 billion over the medium-term; and by more than $10 billion in the short-term as well. My job is to look after Australia's national interest - that includes our defence and security interests. And that is precisely what we're doing.\"\n\n\n\n\n\n+++\n\n\n\n\n\nAustralia has increased its funding commitment to the global vaccine group Gavi, as the US says it is withdrawing all of its funding over vaccine safety concerns.\n\n\n\n\n\nUS Health Secretary Robert F Kennedy Jr, a vaccine sceptic, did not provide any evidence to support his claim that Gavi, had \"ignored the science\" in immunising children around the world.\n\n\n\n\n\nThe Chair of the Board of Gavi, Jose Manuel Barroso, says the organisation has multiple safeguards and processes in place to prioritise the health and safety of children.\n\n\n\n\n\n\"Gavi is indeed a unique organisation in global health - with a public-private model that has brought together national governments, donors, vaccine manufacturers, scientific institutes to vaccinate more than 1 billion children in low income and middle income countries. And I have to say that Gavi has done it always following the best scientific advice, the best science in the world - putting as a high priority vaccine safety.\"\n\n\n\n\n\nAt a summit in Brussels , a record number of donors have pledged funds to Gavi, with more than A$13.75 billion secured until 2030.\n\n\n\n\n\nAustralia has announced it will provide $26 million more than what was requested, for a total contribution of A$386 million over five years.\n\n\n\n\n\n+++\n\n\n\n\n\nA violent far-right online extremist group called Terrorgram has been listed as a terrorist organisation by the Australian government.\n\n\n\n\n\nTerrorgram uses encrypted platforms, mainly Telegram, to distribute racist and nationalist propaganda designed to provoke terrorist attacks, and has successfully inspired terrorist attacks in the United States, Europe and Asia.\n\n\n\n\n\nThe listing means anyone found to be a member or associated with the group could face up to 25 years in jail.\n\n\n\n\n\nHome Affairs Minister Tony Burke says such extremist hatred has no place in Australia.\n\n\n\n\n\n+++\n\n\n\n\n\nState and territory education ministers are meeting in Adelaide to discuss reforms to the childcare and early education sector.\n\n\n\n\n\nIt comes after New South Wales announced new laws to improve child safety, after a report by Deputy Ombudsman Chris Wheeler found a lack of transparency in the childcare sector compared to some other states.\n\n\n\n\n\nThe changes include the installation of security cameras inside centres, and a requirement for providers to notify families if they are investigated for serious breaches.\n\n\n\n\n\nOperators found to be in breach of safety rules will also face bigger fines.\n\n\n\n\n\nNew South Wales Acting Minister for Education and Early Learning, Courtney Houssos says she will be sharing insights on the new measures with her state and territory counterparts at today's meeting.\n\n\n\n\n\n\"We believe parents have the right to make sure when they make sure that when they drop off their kids each day, they are going to be safe and in a quality environment. And that is at the forefront of our minds, so giving parents information, giving the community information is really important.\"\n\n\n\n\n\n+++\n\n\n\n\n\nIn football, Matildas coach Joe Montemurro says the team's win against Slovenia in Perth was the perfect game.\n\n\n\n\n\nHolly McNamara achieved her first international goal, and Hayley Raso added to the score in the 87th minute when she unleashed a strike from outside the box.\n\n\n\n\n\nThe under-strength Matildas were error-prone throughout the game, especially in defence where they attempted to play their way out of trouble at every chance.\n\n\n\n\n\nIt is Montemurro's first match in charge.\n\n\n\n\n\nHe says it is a process, and the team will have the chance to showcase further improvements when facing Slovenia again in Perth on Sunday.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/anna-wintour-to-step-down-us-vogue-editor-in-chief/8eux49giy",
        "title": "Anna Wintour to step down as US Vogue editor-in-chief",
        "publish_date": "Fri, 27 Jun 2025 00:34:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "Anna Wintour has stepped down as editor of US Vogue after 37 years, during which she was often hailed as the single most influential figure in the fashion world.\n\n\n\n\n\nShe will no longer run day-to-day editing of the fashion bible, but magazine group owner Condé Nast was quick to deny suggestions of retirement.\n\n\n\n\n\nShe will continue to hold senior roles at the group and remain Vogue's global editorial director.\n\n\n\nWho is Anna Wintour?\n\nWintour became editor-in-chief of US Vogue in 1988 and transformed it into a powerhouse that set trends, and could often make or break designers, celebrities and brands.\n\n\n\n\n\nKnown to some as \"Nuclear Wintour\" for her decisive leadership, such as axing work without discussion, she was also a fixture in the front row at catwalk shows with her unchanging bob haircut and sunglasses.\n\n\n\nREAD MORE 2025 Met Gala: Nicole Kidman and Sarah Snook among stars arriving in New York\n\nFor many years, she has also run the Met Gala, an extravagant Manhattan charity event that attracts an A-list of stars from across fashion, film, politics and sports.\n\n\n\n\n\nJoe Biden awarded her the Presidential Medal of Freedom, the top US honour, before leaving office in January.\n\n\n\n\n\nWintour was made a British dame in 2017 and in February this year became a companion of honour — an elite recognition.\n\n\n\nIs Anna Wintour retiring?\n\nWintour is not expected to retire, but will continue as Condé Nast's chief content officer. She will continue to oversee publications including Vogue, Wired, Vanity Fair, GQ, Condé Nast Traveler and Glamour.\n\n\n\n\n\nWintour announced at a staff meeting in New York that US Vogue would seek a new head of editorial content.\n\n\n\n\n\nIn remarks reported by the New York Times, she called it a \"pivotal decision\" but stressed she would not be moving out of her office.\n\n\n\n\n\n\"I'll be turning all my attention to global leadership and working with our team of brilliant editors around the world.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/national-hiv-crisis-declared-in-papua-new-guinea/3s5f4dm4x",
        "title": "National HIV crisis declared in Papua New Guinea",
        "publish_date": "Thu, 26 Jun 2025 22:30:09 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "As transmission rates soar, Papua New Guinea has declared a national HIV crisis to try and galvanise action to prevent the spread of the virus.\n\n\n\n\n\nUNAIDS and the World Health Organization estimate the Pacific nation recorded 11,000 new cases last year alone.\n\n\n\n\n\nThat's equivalent to 30 new positive tests a day, including seven newborns, who can be prevented from contracting HIV through antiretroviral therapy.\n\n\n\n\n\nPNG health minister Elias Kapavore said the trend was \"deeply concerning\" when declaring the national crisis at a press conference.\n\n\n\nEmergency response activated\n\nThe declaration activates a national emergency response plan, enabling cross-sector coordination and investment in HIV services.\n\n\n\n\n\nAdding to the anguish at the figures is the advancement of treatment and prevention options for HIV.\n\n\n\n\n\nMost crucial is improving testing rates, so that more of the estimated 120,000 in Papua New Guinea with HIV can seek treatment.\n\n\n\n\n\nActing PNG health secretary Ken Wai said testing every pregnant woman can allow them to know their status and then access medication that prevents transmitting the virus to their child.\n\n\n\n\n\n\"We must scale up access to HIV testing and treatment, particularly for groups most at risk. These priority initiatives should be offered at health facilities nationwide, and will require community leadership and support,\" he said.\n\n\n\n'A disease of inequality'\n\nKapavore called HIV a \"disease of inequality\" and said it was \"time for all of us to step up\".\n\n\n\n\n\n\"I personally commit to raising this issue with my fellow ministers and parliamentarians and ensuring the urgent allocation of resources to protect our people — especially the next generation of Papua New Guineans,\" he said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/banking-and-finance/jeff-bezos-and-lauren-sanchez-marry-in-venice-ceremony-20250628-p5mayl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jeff Bezos and Lauren Sanchez marry in lavish Venice ceremony",
        "publish_date": "Sat, 28 Jun 2025 11:14:19 +1000",
        "category": "finance",
        "authors": [
            "Sara Rossi",
            "Alvise Armellini"
        ],
        "text": "Venice: Amazon founder Jeff Bezos and journalist Lauren Sanchez have married in an extravagant wedding ceremony, the centrepiece of a three-day gala featuring dozens of stars but also protests by local activists.\n\nSanchez, 55, waved and blew kisses to onlookers as she boarded a sleek motorboat outside the Aman hotel to head to the ceremony, wearing short-sleeved, cream, fitted skirt suit, with shades and a headscarf to protect her from the blistering summer sun.\n\nLauren Sanchez and Jeff Bezos at their wedding in Venice, Italy. Credit: Instagram/Lauren Sanchez Bezos\n\nAround two hours later Bezos, 61, wearing a black tuxedo and bow tie over a white shirt, made the same short trip across the lagoon to the small island of San Giorgio where the couple exchanged rings, accompanied by singing from Matteo Bocelli, son of Italian tenor Andrea Bocelli.\n\nThe bride shared a picture of the happy married couple in a garden setting surrounded by guests.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/joint-qualifies-for-eastbourne-final-20250628-p5maze.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Joint qualifies for Eastbourne final",
        "publish_date": "Sat, 28 Jun 2025 11:11:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "Joint qualifies for Eastbourne final\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/hepatitis-a-outbreak-in-several-european-countries-20250628-p5maz4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hepatitis A outbreak in several European countries",
        "publish_date": "Sat, 28 Jun 2025 10:01:50 +1000",
        "category": "finance",
        "authors": [],
        "text": "Hepatitis A outbreak in several European countries\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/afl-teams-and-expert-tips-for-round-16-with-their-season-on-the-brink-blues-swing-the-axe-20250624-p5m9v9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL round 16 teams and expert tips: Two changes for Richmond",
        "publish_date": "Sat, 28 Jun 2025 09:58:18 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "NORTH MELBOURNE B: L.McDonald, T.Pink, G.Logue HB: F.O’Sullivan, C.Daniel, H.Sheezel C: D.Stephens, L.Davies-Uniacke, J.Simpkin HF: J.Konstanty, N.Larkey, C.McKercher F: P.Curtis, J.Darling, C.Zurhaar FOLL: T.Xerri, G.Wardlaw, T.Powell I/C: Z.Fisher, R.Hardeman, W.Dawson, L.Parker, R.Hansen jnr EMG: C.Coleman-Jones, W.Phillips, C.Harvey IN: W.Dawson OUT: C.Comben (injured)\n\nHAWTHORN B: J.Battle, T.Barrass, K.Amon HB: J.Impey, J.Weddle, H.Morrison C: S.Butler, C.Nash, D.Moore HF: B.Hardwick, J.Gunston, N.Watson F: M.Ramsden, M.Chol, J.Ginnivan FOLL: L.Meek, J.Newcombe, J.Ward I/C: S.Mitchell, C.Mackenzie, M.D’Ambrosio, C.Macdonald, C.Jiath EMG: S.Frost, F.Maginness, L.Breust IN: C.Mackenzie OUT: H.Hustwaite (omitted)\n\nCOLLINGWOOD\n\nB: C.Dean, J.Howe, D.Houston\n\nHB: J.Daicos, D.Moore, H.Perryman\n\nC: J.Crisp, S.Pendlebury, S.Sidebottom\n\nHF: B.Hill, T.Membrey, J.Elliott\n\nF: D.McStay, C.West, B.Mihocek\n\nFOLL: D.Cameron, N.Long, N.Daicos\n\nI/C: P.Lipinski, I.Quaynor, E.Allan, W.Hoskin-Elliott, L.Sullivan\n\nEMG: W.Parker, O.Markov, W.Hayes\n\nIN: C.Dean, C.West (debut)\n\nOUT: B.Frampton (injured), B.McCreery (injured)\n\n\n\nWEST COAST\n\nB: R.Maric, H.Edwards, S.Brock\n\nHB: L.Duggan, R.Ginbey, L.Baker\n\nC: J.Hutchinson, B.Hough, C.Hall\n\nHF: J.Cripps, J.Shanahan, J.Graham\n\nF: E.Hewett, J.Williams, L.Ryan\n\nFOLL: M.Flynn, T.Kelly, H.Reid\n\nI/C: J.Hunt, T.Brockman, B.Allan, B.Williams, T.McCarthy\n\nEMG: J.Petruccelle, A.Reid, R.Bazzo\n\nIN: B.Hough, J.Shanahan (debut)\n\nOUT: O.Allen (injured), T.Dewar (injured)\n\nRICHMOND\n\nB: B.Miller, N.Balta, N.Broad\n\nHB: S.Banks, T.Brown, N.Vlastuin\n\nC: H.Ralphsmith, D.Prestia, L.Trainor\n\nHF: S.Campbell, J.Ross, S.Green\n\nF: R.Mansell, T.Lynch, J.Faull\n\nFOLL: T.Nankervis 25, T.Taranto, J.Hopper\n\nI/C: T.Sonsie, K.McIntosh, J.Blight, M.Lefau, J.Alger\n\nEMG: J.Trezise, T.Sims, K.Smith\n\nIN: J.Blight, M.Lefau\n\nOUT: K.Smith (omitted), T.Sims (omitted)\n\nB: B.Miller, N.Balta, N.Broad\n\nHB: S.Banks, T.Brown, N.Vlastuin\n\nC: H.Ralphsmith, D.Prestia, L.Trainor\n\nHF: S.Campbell, J.Ross, S.Green\n\nF: R.Mansell, T.Lynch, J.Faull\n\nFOLL: T.Nankervis, T.Taranto, J.Hopper\n\nI/C (from): T.Sonsie, K.McIntosh, K.Smith, T.Sims, J.Alger, J.Trezise, M.Lefau, J.Blight\n\nIN: J.Trezise, M.Lefau, J.Blight\n\nOUT: Nil.\n\n",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/why-woolf-is-poised-to-break-the-bennett-curse-and-build-his-empire-20250627-p5matf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dolphins star ‘not up for sale’ as Cobbo bombshell builds Woolf’s empire",
        "publish_date": "Sat, 28 Jun 2025 09:38:31 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size It did not take long for Dolphins chief executive Terry Reader to know Kristian Woolf was the man to spearhead the NRL’s newest outfit into the future. Even though the shadow of Wayne Bennett was going to loom over whoever took the reins, they knew they had their man. “He was the number one target for us at the start,” Reader declared. “Even with Wayne as our coach, we still had a lot of questions. He said ‘we’ll do it together, let’s find the best coach, and he’ll be the assistant and take over at the end’. “I don’t think there’s ever been a better transition of NRL coaches than what’s happened. We weren’t building a house of cards, we were setting up a club for the future.” Kristian Woolf was identified as the Dolphins’ long-term coach early in the piece. Credit: NRL Photos Thus far, Woolf has dared to orchestrate a miracle – overcoming four-straight defeats in the first month to have his side one-point shy of the top eight.\n\nAdvertisement\n\nHe has done so amid a concerning injury toll – one which has claimed stars Tom Gilbert, Thomas Flegler, Daniel Saifiti, Max Plath and Jack Bostock for the rest of the season. Felise Kaufusi will also be sidelined with a knee concern, while Ray Stone has been playing with two busted shoulders. Loading Given their season even began with a last-minute relocation to Sydney due Cyclone Alfred, Reader did not hesitate to claim “I don’t think a first-year coach has ever gone through what Kristian has”. And yet, as he plots a boilover of his former mentor against South Sydney on Saturday, Woolf turned his nose up at excuses. “I’ve never seen anything like what we’ve had, particularly with season-ending injuries. That’s footy, we’re not going to get frustrated or whinge about it,” Woolf said. “We need to go out with a mindset that we’ll be at our best, be hard to beat and give ourselves a really good chance.\n\nAdvertisement\n\n“I know how hard they worked in pre-season, I know how hard they work for each other. They haven’t given me any indication that they’re going to change anything because we’ve lost a couple of players. “If anything, they’re more committed to working hard for each other.” Building his empire Barely 24 hours before the Dolphins announced Selwyn Cobbo would join the fold in 2026, Reader hinted the Broncos’ flyer was not in their sights. How things can change quickly in rugby league. “He’s one of those blokes that can do things other people can’t. He’s a guy you want in your team rather than the opposition,” Woolf said.\n\nAdvertisement\n\n“I don’t think it was ever no interest, it’s about availability, spots and things like that. A fair bit has changed in 24 hours … there’s a bit of movement all over the place and both ways for us.” That movement suggests those off contract face uncertain futures, but points to Woolf assembling the squad he believes can deliver a premiership. Cobbo will be joined by St Helens lock Morgan Knowles, while Francis Molo and Sebastian Su’A arrived mid-season. Flegler, Gilbert, Bostock, Plath, Saifiti, Isaiya Katoa, Jeremy Marshall-King, Hamiso Tabuai-Fidow, Kulikefu Finefeuiaki and Kurt Donoghoe are signed until at least 2027, while Herbie Farnwort expressed his desire to remain. Reports also emerged England halfback George Williams could be signed, and even swapped with Kodi Nikorima. Woolf dismissed the notion. “Kodi Nikorima is not up for sale or going to be swapped – that’s not going to happen,” he said.\n\nAdvertisement\n\n“He’s playing his best footy at the moment. That’s one thing we wouldn’t entertain.” Breaking the curse Woolf tasted success before taking over from Bennett – guiding St Helens to three Super League titles while transforming Tonga into a global force. But given the history of Bennett’s successors, the question was asked: could he break the Bennett curse? “Coming into the NRL and the expectations and toughness of the competition, there are nerves anyway,” Woolf admitted. “That [replacing Bennett] can certainly add to it. I thought about all that well before I came, [but] my two years working with Wayne gave me some confidence.”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/aussies-clinch-first-test-20250628-p5mayx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussies clinch first Test",
        "publish_date": "Sat, 28 Jun 2025 09:34:46 +1000",
        "category": "finance",
        "authors": [],
        "text": "Aussies clinch first Test\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/pork-chop-delivery-but-lions-boss-had-a-point-and-wallabies-have-a-point-to-prove-20250627-p5mapw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Pork chop’ delivery but Lions boss had a point, and Wallabies have a point to prove",
        "publish_date": "Sat, 28 Jun 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "The drip-by-drip release of Wallabies players back to their franchises must be a form of water torture for British and Irish Lions chief executive Ben Calveley.\n\nArmed with a rock-solid argument, as expressed here, Calveley somehow managed to lose the moral high ground earlier this week with his heavy-handed demand that Joe Schmidt release all his Wallabies.\n\nCalveley may quickly want to acquaint himself with the Australian phrase, ‘carrying on like a pork chop’.\n\nFollowing his outburst, Schmidt has subsequently released Ben Donaldson, Hunter Paisami and Matt Faessler to the Force and Reds respectively, with Donaldson replacing the injured Kurtley Beale.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/funeral-home-owner-who-stashed-nearly-190-decomposing-bodies-sentenced-to-20-years-prison-20250628-p5mayd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Funeral home owner who stashed nearly 190 decomposing bodies sentenced to 20 years prison",
        "publish_date": "Sat, 28 Jun 2025 09:15:57 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "The morbid discovery revealed to many families that their loved ones weren’t cremated and that the ashes they had spread or cherished were fake. In two cases, the wrong body was buried, according to court documents.\n\nMany families said it undid their grieving processes. Some relatives had nightmares, others have struggled with guilt, and at least one wondered about their loved one’s soul.\n\nAmong the victims who spoke during Friday’s sentencing was a boy named Colton Sperry. With his head poking just above the lectern, he told the judge about his grandmother, who Sperry said was a second mother to him and died in 2019.\n\nHer body languished inside the Return to Nature building for four years until the discovery, which plunged Sperry into depression. He said he told his parents at the time, “If I die too, I could meet my grandma in heaven and talk to her again.”\n\nHis parents took him to the hospital for a mental health check, which led to therapy and an emotional support dog.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/west-indies-set-301-to-win-first-test-after-head-webster-and-carey-make-half-centuries-20250628-p5may3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hazlewood rips through West Indies as Australia take 1-0 series lead",
        "publish_date": "Sat, 28 Jun 2025 08:33:22 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Bridgetown: Test captain Pat Cummins has lauded Australia’s “brilliant” middle order and Josh Hazlewood’s ability to exploit an up-and-down pitch on the final day of a resounding 159-run win in Barbados.\n\nA five-wicket haul from Josh Hazlewood and some ordinary West Indies batting helped Australia secure a 1-0 series lead inside three days at Kensington Oval, which gives the team a five-day break before the second Test in Grenada.\n\nAfter two days of mediocre batting from their top order, Australia finally got their act together with the game in the balance, making light work of a West Indies outfit who produced what locals call a “Calypso Collapso” in the last innings of the match to be bowled out for 141 in 33.4 overs.\n\nPlay ended one hour and 13 minutes after the official 5pm finish time as officials allowed extra overs to be bowled given a result was a live option.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/jake-paul-walks-out-on-piers-morgan-20250628-p5mayr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jake Paul walks out on Piers Morgan",
        "publish_date": "Sat, 28 Jun 2025 08:01:23 +1000",
        "category": "finance",
        "authors": [],
        "text": "Jake Paul walks out on Piers Morgan\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/hazlewood-goes-bang-bang-20250628-p5mayo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hazlewood goes bang-bang",
        "publish_date": "Sat, 28 Jun 2025 07:47:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "Hazlewood goes bang-bang\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/council-urges-residents-to-dob-in-neighbours-over-growing-caravan-and-boat-issue-234922320.html",
        "title": "Council urges residents to dob in neighbours over growing caravan and boat issue",
        "publish_date": "2025-06-27T23:49:22Z",
        "category": "finance",
        "authors": [],
        "text": "As multiple Sydney councils continue to grapple with the contentious problem, one is seeking a more formal way for residents to call it out.\n\nOne council is seeking more formal ways to discourage long term parking of caravans, boats and trailers. Source: North Sydney Council\n\nThe battle for our streets is heating up with one major city council now urging locals to dob in residents for leaving trailers, caravans and boats on the side of the road for extended periods of time.\n\nFor months, Sydney's Northern Beaches Council has been grappling with the issue, launching a months long investigation last last year about how best to crack down on the practice, including the potential of introducing new parking signage and rules enforcing vehicle only areas.\n\nCouncillors say residents continue to complain about boats, caravans and trailers clogging up backstreets in their suburbs, prompting them to unanimously pass a new motion at a council meeting this month to address their concerns.\n\nThe council is also preparing a submission to the NSW state government and is asking it to review the current penalties and offences under the Road Rules 2014 and Road Transport Act 2013 to enable a new permit system \"to further discourage boats and trailers being parked on residential streets\".\n\nADVERTISEMENT\n\nThe council also wants to implement a more formal system to encourage residents to report hotspots for \"inappropriate parking of trailers, boats and caravans\" such as creating a specific online form that would be promoted in a community newsletter and social media.\n\nMultiple local government areas around Sydney are struggling with the issue. Source: Supplied\n\nAccording to councillor Vincent De Luca, who introduced the latest motion at the council meeting, the issue has become a danger by impeding visibility for road users. \"We see large craft, obstructing vision causing accidents,\" he told the meeting.\n\nIt's been an issue simmering in the community for some time. In 2023 a boat legally parked on the street was spray-painted with the words \"f*** off\", prompting the owner to respond with a note outlining their right to leave the boat there.\n\nThe neighbours' feud began when the boat trailer was regularly parked in the 'high density' area. Source: Reddit\n\nA Northern Beaches Council spokesperson recently told Yahoo News it is one of the most complained about issues it deals with, after receiving some 288 complaints last year. In response, more streets have been fitted with \"No Parking - Motor Vehicles Excepted\" signs – which initially confused some motorists when they were first rolled out.\n\nADVERTISEMENT\n\nNeighbouring councils have also struggled with the issue. Last year Randwick City Council announced it will ban parking for almost five kilometres along a busy nature strip that's become \"increasingly popular for storage of boats, caravans and trailers\".\n\nMeanwhile in the nearby suburb of Cremorne, one resident (who doesn't have a garage and has to rely on street parking) has become so fed up she started a petition calling for stricter parking rules for non cars. \"The road is there for people to use and not to store, and that is the distinction that needs to be made,\" she told Yahoo in February.\n\nIn NSW, and most other states and territories, it is legal for boats, trailers and caravans to be stationed on the street in the same spot for up to 28 days. After this, the owner will be notified and they need to be moved or risk a $660 fine.\n\nThe new location needs to be \"at least as far as a different block section of the same street\", according to guidelines.\n\nADVERTISEMENT\n\nThe issue has been been exacerbated by the fact that caravan and campervan registrations across the nation have steadily grown over the part decade with more than 900,000 currently on our roads.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/inside-the-airport-chaos-the-moment-missiles-began-to-fly-outside-doha-international-airport-205950746.html",
        "title": "Inside the airport chaos the moment missiles began to fly outside Doha International Airport",
        "publish_date": "2025-06-27T20:59:50Z",
        "category": "finance",
        "authors": [],
        "text": "Passengers were given mixed messages and forced to delete videos as people scrambled to find a new flight home this week.\n\nAfter Qatar airspace was shut down, passengers were told contradictory things as they tried to get a new flight. Source: Nick Whigham\n\nSitting at my boarding gate doomscrolling social media, I saw the worst possible alert appear in my feed.\n\nAfter Googling my flight out of Madrid the previous night to learn it was cancelled, I had already scrambled to get a new flight to Barcelona to begin my journey back home to Australia. But things were about to get really bad.\n\nSitting in Doha International Airport in Qatar with about 30 minutes left to board my Sydney-bound flight, I read a tweet saying the Qatari government had just closed the country's airspace due to imminent missile launches from Iran targeting US military bases in the country.\n\nNone of the passengers around me knew it yet – and there was certainly no announcement over the loud speaker at the airport – but we were about to find ourselves in the middle of what the airline would later call \"one of the most severe and complex operational challenges in modern aviation history\".\n\nADVERTISEMENT\n\nThe airport is one of the world's busiest and most connected global aviation hubs. At the time, over 90 Qatar Airways flights carrying more than 20,000 passengers to Doha, were forced to divert immediately. Inside the airport, there was some 10,000 passengers with the airline now in complete limbo.\n\nSlowly it became clear no one was going anywhere. And nobody had any answers about when we could or how exactly that would happen.\n\nRELATED: Advice to Aussie travellers heading to Europe and Middle East\n\nAt one point, passengers trying to get back to Sydney queued for hours for nothing. Source: Nick Whigham\n\nQatar Airways said it deployed extra staff to deal with the massive disruption but at the same time some of the flight crews had timed out of legal operating hours.\n\nAt one point, myself and countless other trying to get back to Sydney queued for hours on hopes of being issued a new boarding pass only for that queue to be told to disband and move further down the terminal empty handed.\n\nADVERTISEMENT\n\n\"Someone had to step up.\"\n\nAs people grew increasingly agitated by the lack of information, things started unravelling and passengers were forced to help take control of the situation. I soon found myself standing behind the desks of frantic airline staff as a Danish passenger (who was moving to Sydney for two years) and I passed along new boarding tickets from a nearby desk where they were slowly being spat out down to the counter where a sole Qatar Airways employee was processing each new traveller.\n\nAn Australian woman, who had taken it upon herself to make a list of passenger details and bring some order to the chaos, stood next to worker at the desk facilitating the whole thing. She later told me she has such a bad back that she sometimes requires a wheelchair.\n\n\"Someone had to step up,\" she said.\n\nAs I waited for my boarding pass behind the staff desks watching the queues of desperate travellers, at one point I accidentally lent up against the door setting off an alarm. It spoke to the craziness of the moment that most people barely seemed to notice the extra noise.\n\nPassengers forced to delete videos from inside the airport\n\nWhile the Qatar Airways staff member did an incredible job, there was a severe lack of leadership on the ground and zero proactive communication to stranded customers. Some airport staff appeared more concerned about instructing passengers to delete videos they witnessed them taking of the chaotic scenes inside the airport.\n\nOnce airspace reopened shortly after midnight on Tuesday (local time) diverted aircraft began returning to the hub. In the words of Qatar Airways CEO Badr Mohammed Al-Meer in a self-congratulatory statement on Thursday, \"each arrival [was] a step towards reassembling our operation.\"\n\nADVERTISEMENT\n\nAbout 36 hours after arriving in Doha, I touched down in Sydney after being one of the lucky passengers to get on the next available flight.\n\nAccording to reports, the missiles that brought the global travel hub to a halt were largely a symbolic act of retribution from Iran against US president Trump's air strikes on nuclear facilities in the country.\n\nFor some, it was another example of how perhaps no one is immune to the vicissitudes of Donald Trump's return to power and the newly unpredictable nature of the White House and its foreign policy.\n\nDue to the Trump administration's brutal border regime which is detaining and deporting people, including an Australian journalist recently, travellers have been warned about preparing themselves for difficulties when entering the US, but those travelling elsewhere can still feel his impact.\n\nIt must be said the man likes a tax. Usually on his own consumers in the form of a tariff. Trump also wants to tax foreign holders of US assets with a new law contained in the so-called 'big beautiful bill' (something that could hit your superannuation account, although Trump appeared to back away from that on Friday).\n\nADVERTISEMENT\n\nAnd as missiles continue to fly in the Middle East and Iran on Friday threatened to keep attacking US bases, perhaps you could call this current airspace instability a kind of Trump travel tax. Myself and countless others paid it in full this week.\n\nMany questioned how Trump's Iran bombings were compatible with his 'America first' style rhetoric. Source: Reuters\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/the-silent-roadside-threat-thats-killing-our-kangaroos-a-shocking-way-to-die-065733742.html",
        "title": "The silent roadside threat that's killing our kangaroos: 'A shocking way to die'",
        "publish_date": "2025-06-27T06:57:33Z",
        "category": "finance",
        "authors": [],
        "text": "It's hiding in plain sight and while it may look unassuming, rescuers say there are more deaths than ever before.\n\nThe invasive grasses are a huge problem, especially in drought-stricken areas of the country. Source: Murrindindi Ranges Wildlife Shelter\n\nWARNING – DISTRESSING VIDEO: Chances are you've seen it by the roadside. Tall, dry grass that blends into its surroundings, particularly in rural parts of Australia.\n\nBut this invasive weed, known as phalaris aquatica, is having a devastating impact on kangaroos — leaving them so sick they need to be euthanised. Roos develop what's known as the \"phalaris stagger\", a neurological condition that gives them tremors, makes them lose their balance and collapse.\n\nWildlife rescuers told Yahoo News they're seeing more cases than ever before, and are calling for more to be done.\n\n\"This is the worst phalaris season I've ever seen,\" Kate Turner, founder of Murrindindi Ranges Wildlife Shelter, said. She calls it the \"cockroach of the grass world\".\n\nADVERTISEMENT\n\nKate recently found a roo and her joey suffering from 'phalaris stagger' on the side of a road. The mum was so afflicted she could barely walk and needed to be euthanised. The joey is now in Kate's care, and while she's missing her mum, she's \"doing well\".\n\nKate said the current drought conditions in the Hume region have resulted in a takeover of phalaris, as it's more hardy and will \"outgrow\" native grasses.\n\n\"That's why it's the worst this season, because it's the only grass they've got access to,\" she said.\n\nFellow rescuer Leonie Sorrentino from Wildlife Rescuers agreed that there have been \"a lot more\" cases this year.\n\nShe told Yahoo the kangaroos also get more aggressive than usual when they're affected by phalaris, which can make rescues harder and more dangerous.\n\nADVERTISEMENT\n\n\"They seem to have like a superhuman strength,\" she said.\n\n\"There seems to be a ferocity to them. They're just very sensitive to touch. They growl a lot more. It's completely different to a normal rescue.\n\n\"It's really very sad and depressing to see. And of course, sometimes if we can't get close enough, we have to actually wait [to euthanise] until they get a lot worse.\"\n\nLeonie said without intervention, the roos would eventually succumb to the disease and become “fox bait” as they would no longer be able to outrun the predators.\n\n\"Practically everyone we attend to, we have to euthanise. It's horrific. It's a shocking way to die.\"\n\nPhalaris can grow up to 150cm tall, and easily overshadows native grasses. Source: Victorian Government/Trees for Life (SA)\n\nPhalaris widely used as a pasture crop\n\nPhalaris aquatica is commonly used as a pasture crop to feed livestock. And while the phalaris staggers can also affect farm animals, giving them cobalt or spraying it on the grass helps to protect them from the effects of the toxins.\n\nADVERTISEMENT\n\nWeed science professor at the University of Queensland Bhagirath Chauhan said phalaris is a fast-growing, resilient weed with seeds that can take a long time to germinate.\n\n\"So it means even if you can stop the seed production in this season, you will get these plants in the next three to four years, definitely,\" he said.\n\nPhalaris can grow up to 150cm tall, and it's their height that gives them an advantage over native grasses by blocking out sunlight.\n\nHe said the seeds are usually spread through water, wildlife or even by machinery used to cut the grass.\n\nBecause of its popularity in agriculture, Chauhan believes phalaris will never be eradicated but said it would make a huge difference to focus on managing its spread.\n\n\"I think we need to emphasise that we need to stop allowing it to go out of the fenced area, because otherwise it becomes a real problem,\" he said.\n\nThe joey that Kate saved has been taking a bottle and getting to know other orphans at the shelter. Source: Murrindindi Ranges Wildlife Shelter\n\nWhat's being done about the spread of phalaris?\n\nVictoria's Department of Energy, Environment and Climate Action [DEECA] works with a number of agencies across the state, like VicRoads, Parks Victoria and local councils to help control phalaris.\n\nADVERTISEMENT\n\nDEECA Chief Biodiversity Officer and Director of the Arthur Rylah Institute James Todd told Yahoo each location needs to be assessed to decide how best to manage the weed.\n\n“DEECA partners with Traditional Owners and government agencies to target invasive weeds including Phalaris aquatica on public land across Victoria using a range of techniques including herbicide spraying, slashing and ecological burning,\" DEECA Chief Biodiversity Officer and Director of the Arthur Rylah Institute, James Todd told Yahoo.\n\n“Given the sensitivity of some native species to spraying and inability of some sites to be treated with burning there is no one-size-fits-all approach to treating weeds on public land.”\n\nHow can you help?\n\nMost of the carers in Australia are volunteers who give their own time, money and petrol into saving injured wildlife.\n\nIf you would like to donate to the rescuers mentioned in this story you can find their details below.\n\nMurrindindi Ranges Wildlife Shelter\n\nAccount Name: Murrindindi Ranges Wildlife Shelter\n\nAccount Number: 159658038\n\nBSB: 633-000\n\nWildlife Rescuers\n\nTo donate to Wildlife Rescuers, click here.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]