[
  {
    "url": "https://www.9news.com.au/world/pope-francis-funeral-mighty-and-meek-attend-mass-where-he-is-remembered-as-peoples-pope/d5c3c556-13cd-477a-87ab-2af64a7829ce",
    "title": "World leaders and prisoners bid farewell to 'pope among the people'",
    "publish_date": "Sat, 26 Apr 2025 10:01:06 +0000",
    "category": "entertainment",
    "authors": [
      "Apr"
    ],
    "text": "World leaders and Catholic faithful have bidden farewell to Pope Francis in a funeral highlighting his concern for the \"most peripheral of the peripheries\" and reflecting his wishes as pastor.\n\nThough presidents and princes attended the mass in St Peter's Square today, prisoners and migrants welcomed him at the basilica across town where he will be buried.\n\nSome 250,000 people flocked to the funeral, held on a brilliant spring day that was supposed to have been a special Holy Year celebration for adolescents.\n\nAS IT HAPPENED: World leaders join huge crowds to farewell Pope Francis ﻿\n\nArchbishop Diego Giovanni Ravelli (front, left) kneels next to the closed coffin at the funeral mass for the late Pope Francis in St Peter's Square. (dpa/picture alliance via Getty I)\n\nPerhaps because so many young people were on hand, the somber ceremony still had a festive mood, with mourners taking selfies amid the hymns as Francis' simple wooden coffin was brought out of St Peter's Basilica at the start of the Mass.\n\nCardinal Giovanni Battista Re, the 91-year-old dean of the College of Cardinals, delivered a lengthy, spirited and highly personal homily, or sermon. He eulogised Francis as a pope of the people, a pastor who knew how to communicate to the \"least among us\" with an informal, spontaneous style.\n\n\"He was a pope among the people, with an open heart towards everyone,\" Re said.\n\nHe drew applause from the crowd when he recounted Francis' constant concern for migrants, including when he celebrated Mass at the US-Mexico border and travelled to a refugee camp in Lesbos, Greece, and brought 12 migrants home with him.\n\n\"The guiding thread of his mission was also the conviction that the church is a home for all, a home with its doors always open,\" Re said.\n\nThe Argentine pontiff choreographed the funeral himself when he revised and simplified the Vatican's rites and rituals last year. His aim was to emphasise the pope's role as a mere pastor and not \"a powerful man of this world\".\n\nFuneral of Pope Francis: World leaders and royals pay their respects View Gallery\n\nIt was a reflection of Francis' 12-year project to radically reform the papacy, to stress priests as servants and to construct \"a poor church for the poor\".\n\nHe articulated the mission just days after his 2013 election and it explained the name he chose as pope, honouring St Francis of Assisi \"who had the heart of the poor of the world\", according to the official decree of the pope's life that was placed in his coffin before it was sealed on Friday night.\n\nDespite Francis' focus on the powerless, the powerful were out in force at his funeral. US President Donald Trump and former President Joe Biden, Ukrainian President Volodymyr Zelenskyy, UN Secretary-General António Guterres, and British Prime Minister Keir Starmer joined Prince William and European royals leading more than 160 official delegations.\n\nArgentine President Javier Milei had the pride of place given Francis' nationality, even if the two didn't particularly get along and the pope alienated many Argentines by never returning home.\n\nTrump and Zelenskyy met privately on the sidelines of the funeral. A photo showed the two men sitting alone, facing one another and hunched over on chairs in St Peter's Basilica.\n\nUS President Donald Trump and Ukrainian President Volodymyr Zelenskyy meet in St Peter's Basilica on Saturday, April 26, 2025. (Ukrainian Presidential Press Office)\n\nAfter the Mass, Francis' coffin left the Vatican en route to his burial place in St Mary Major Basilica.\n\nThe white facade of St Peter's glowed pink as the sun rose and hordes of mourners rushed into the square. Giant television screens were set up along the surrounding streets for those who couldn't get close.\n\nThe Mass and funeral procession across town — with Francis' coffin carried on the open-topped popemobile he used during his 2015 trip to the Philippines — were also broadcast live around the world.\n\nPolice helicopters whirled overhead, part of the massive security operation Italian authorities mounted, including more than 2500 police, 1500 soldiers and a torpedo ship off the coast, Italian media reported.\n\nThe coffin is displayed during the funeral of Pope Francis. (Getty)\n\nMany mourners had planned to be in Rome anyway this weekend for the now-postponed Holy Year canonisation of the first millennial saint, Carlo Acutis, and groups of scouts and youth church groups nearly outnumbered the gaggles of nuns and seminarians.\n\n\"He was a very charismatic pope, very human, very kind, above all very human,\" said Miguel Vaca, a pilgrim from Peru who said he had camped out near the piazza.\n\n\"It is a very great emotion to say goodbye to him.\"\n\nThe poor and marginalised welcome him\n\nFrancis, the first Latin American and first Jesuit pope, died on Easter Monday at age 88 after suffering a stroke while recovering at home from pneumonia.\n\nFollowing his funeral, preparations can begin in earnest to launch the centuries-old process of electing a new pope, a conclave that will likely begin in the first week of May.\n\nIn the interim, the Vatican is being run by a handful of cardinals, key among them Re, who is organising the secret voting in the Sistine Chapel.\n\nPrince William arrives at the funeral of Pope Francis in St Peter's Square. (Getty)\n\nFrancis is breaking with recent tradition and will be buried in St Mary Major, near Rome's main train station, where a simple tomb awaits him with just his name: Franciscus.\n\nAs many as 300,000 people are expected to line the Six-kilometre motorcade route that will bring Francis' coffin from the Vatican through the centre of Rome to the basilica after the funeral.\n\nForty special guests, organised by the Vatican's Caritas charity and the Sant'Egidio community, will greet his coffin at the basilica, honouring the marginalised groups Francis prioritised as pope: homeless people and migrants, prisoners and transgender people.\n\n\"The poor have a privileged place in the heart of God,\" the Vatican quoted Francis as saying in explaining the choice.\n\nClergy during the funeral of Pope Francis in St. Peter's Square at the Vatican. (AP)\n\nA special relationship with the basilica\n\nEven before he became pope, Francis had a particular affection for St Mary Major, home to a Byzantine-style icon of the Madonna, the Salus Populi Romani, to which Francis was particularly devoted.\n\nHe would pray before it before and after each of his foreign trips as pope.\n\nThe choice of the basilica is also symbolically significant given its ties to Francis' Jesuit religious order.\n\nSt Ignatius Loyola, who founded the Jesuits, celebrated his first Mass in the basilica on Christmas Day in 1538.\n\nCandles illuminate a picture of the late Pope Francis outside the Cathedral in Buenos Aires, Argentina, Saturday, April 26, 2025, as his funeral takes place in Rome. (AP Photo/Natacha Pisarenko) (AP)\n\nCrowds waited hours to bid farewell to Francis\n\nOver three days this week, more than 250,000 people stood for hours in line to pay their final respects while Francis' body lay in state in St Peter's Basilica.\n\nThe Vatican kept the basilica open through the night to accommodate them, but it wasn't enough. When the doors closed to the general public at 7pm yesterday (3am today AEST), mourners were turned away in droves.\n\nBy dawn Saturday, they were back and ready to say a final farewell, some recalling the words he uttered the very first night of his election and throughout his papacy.\n\n\"We are here to honour him because he always said 'don't forget to pray for me,'\" said Sister Christiana Neenwata from Biafrana, Nigeria.\n\n\"So we are also here to give to him this love that he gave to us.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/sydney-news-unexpected-humpback-whale-sighting-sets-off-shark-alarm/25072167-18f5-4723-b236-b934ecd26b04",
    "title": "Unexpected humpback whale sighting sets off shark alarm at Sydney beach",
    "publish_date": "Sat, 26 Apr 2025 13:30:09 +0000",
    "category": "sports",
    "authors": [
      "Apr"
    ],
    "text": "Residents in Sydney 's Northern Beaches woke to a surprise visitor this morning, with a juvenile humpback whale swimming off Little Manly Cove.\n\nThe unique sighting of the younger marine mammal comes ahead of the peak migration season.\n\nThe sight left witnesses gobsmacked.\n\nREAD MORE: Sporting club apologises after Welcome to Country confusion\n\nResidents in Sydney's Northern Beaches woke to a surprise visitor this morning, with a juvenile humpback whale swimming off Little Manly Cove. (9News)\n\nThe unique sighting of the younger marine mammal comes ahead of the peak migration season. (9News)\n\n\"I've never seen a whale come this close or up that close, it was truly something special,\" Alex Smith told 9News.\n\nLocals treated to the unique sighting after the adolescent male likely took a wrong turn on his early journey north to migrate and mate.\n\n\"Maybe it got chased in here by an orca, maybe it was chasing a feed or it simply just wanted to come and explore our great harbour,\" Steve Trikoulis from Orrca told 9News.\n\nThe whale had several obstacles to avoid as he searched for a way out, including line from anchors of boats moored in the area, as well as swimmers and kayakers.\n\nGetting back on track wasn't all smooth sailing for the young humpback as he set off the shark alarm passing by North Curl Curl. (9News)\n\nThe young marine mammal safely made its way outside the heads into the open ocean, leaving behind a very timely message for migration season.\n\n\"When you do see a whale out in the wild maintain at least 100 metres away from it,\" Trikoulis said.\n\n\"If you do see a calf with it, extend that distance to 300 metres.\"\n\nGetting back on track wasn't all smooth sailing for the young humpback as he set off the shark alarm passing by North Curl Curl.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/labubu-blind-box-pop-mart-craze-australia/61223e72-7c3d-4274-bacf-a87af4486baf",
    "title": "Aussie had to travel 6600km to get her hands on one of these 'creepy' little things",
    "publish_date": "Sat, 26 Apr 2025 07:06:17 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "From a distance, the fluffy figures on ﻿Ottilie Vaughan's bag look like children's toys.\n\nGet a little closer and you'll spot the sharp-toothed grins and intense expressions that mark them as something altogether different: a little \"monster\" named Labubu.\n\nDesigned by Hong Kong-born artist Kasing Lung and sold by Chinese toy company Pop Mart, Labubu is the latest viral obsession Gen Zs and Millennials can't get enough of.\n\nREAD MORE: How the Pope spent his final hours and his last touching words to nurse\n\nThese little \"monsters\" are Labubus, the latest viral obsession Gen Zs and Millennials can't get enough of. (Edward Berthelot/Getty )\n\nThe most popular toys are the keychain size, which typically retail for $32 at Pop Mart﻿ but can go for more than $100 on some resale sites because they're so hard to get.\n\nMassive lines form outside Pop Mart stores before they even open when new Labubu stock is due in, the online store is almost always sold out of the toys, and customers must adhere to a strict purchase limit to limit resale.\n\nAnd Australians who manage to get their hands on one of the \"creepy\" toys ﻿won't even know which one they've purchased until they open it, as Labubus are sold in a blind box format.\n\nEach one comes sealed in a box that could contain one of several \"normal\" versions of the toy or a very rare \"special\" version, which are coveted among collectors.\n\nThe blind box toy market is growing and its global value was estimated to be more than $21 ﻿billion in 2024, according to Cognitive Market Research.\n\nThe Australian market alone made up more than $260 million of that figure, suggesting that Aussies are more than willing to spend their hard-earned cash on the collectibles.\n\nTikTok videos of shoppers \"unboxing\" Labubu blind boxes can rack up hundreds of thousands of views. (TikTok)\n\nVideos of shoppers \"unboxing\" the toys can amass hundreds of thousands of views on social media, where 23-year-old Vaughan first discovered Labubus late last year.\n\nShe first spotted the toys on the handbags of fashion influencers, K-pop stars, and celebrities, then videos of the little monsters started popping up on her TikTok For You Page.\n\nThere are currently more than 1.2 million posts with the hashtag #labubu on the app and after watching just a fraction of them, ﻿Vaughan decided she \"needed\" a Labubu too.\n\nShe just had to find one.﻿\n\n\"I went looking for them all around Sydney city [but] I had no luck,\" she told 9news.com.au.\n\n\"I wasn't keen on buying second-hand, it's not as fun and also can be so expensive.\"\n\nEbay vendor wants $10,500 for this Aussie coin - is it worth it? View Gallery\n\nThere's also no guarantee that resold or second-hand Labubus are legitimate and fake toys – Lafufus, as they're sometimes called by fans –﻿ are common.\n\nLocal collectors reported that ﻿imitation Labubus were being sold at the Sydney Royal Easter Show﻿ this year, where local influencer Annie Nguyen recorded footage of what she claimed was a stall selling fake collectibles.\n\nTwo toys purchased at the stall for $35 each and sighted by 9news.com.au appeared to be imitation Labubus and featured details that didn't match the authentic product.\n\nREAD MORE: At least 26 dead after gunmen open fire on tourists in disputed Himalayan region\n\n﻿Imitation Labubus were allegedly being sold at the Sydney Royal Easter Show﻿ this year. (Instagram/@anniesbucketlist)\n\nVaughan's hunt for an elusive Labubu finally came to an end more than 6600km away in Malaysia, where she bought two for about $40 each from a store in Kuala Lumpur while on holiday.\n\n\"I couldn't resist,\" she said.\n\n\"They're hard to get, so even if you don't have a lot of money, if you can find one it feels necessary to buy.\"\n\nAnd she's not the only Australian who feels that way.﻿\n\nPop Mart, which is known for selling Labubu and other collectable blind box toys, has exploded across the country in the almost four years since it first arrived in Australia.\n\nIts Australian website and online store went live in October 2021, ﻿followed by a robo-shop (a retail location stocked with vending machines) in November and a pop-up store in December.\n\nThe first ﻿physical store opened in August 2022 and less than three years later, Pop Mart boasts 11 retail stores and 19 robo shops across the country.\n\nSelling everything from $20 Labubu phone charms to $1500 collectible statues of the monster, Pop Mart has done well by cashing in on the collectible craze Down Under.\n\nVaughan currently has two Labubu collectibles and a Cry Baby charm on her bag. (Supplied)\n\nAnd ﻿Vaughan doesn't see it dying down any time soon either, adding that she's not surprised young Australians are spending their cash on the viral toys even in a cost-of-living crisis.\n\n\"Everyone has given up on saving lots of money so we just buy trinkets for fun,\" she said.\n\nWith three Labubus currently adorning her favourite bag, ﻿the 23-year-old isn't actively searching for the toys anymore but hasn't ruled out buying more.\n\n\"If I saw one in a vending machine, I would probably buy it.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/pope-francis-death-farewell-to-pope-francis-australian-tourists-among-thousands-queuing-to-say-goodbye/178577f8-ec82-4c65-9b59-1bd5fd0bf7c7",
    "title": "Solemnity and anticipation among thousands queuing to say goodbye to Pope Francis",
    "publish_date": "Fri, 25 Apr 2025 21:33:13 +0000",
    "category": "entertainment",
    "authors": [
      "Apr"
    ],
    "text": "As the sun sets over the Vatican City mere days after the death of Pope Francis , St Peter's Square is abuzz with pilgrims from all corners of the globe gathering to pay their respects to the late pontiff, who died on Easter Monday at the age of 88.\n\nA curious blend of solemnity and anticipation fills the air as I weave my way through the dense throng of Catholic mourners, tourists, and media from around the world.\n\nConversations in multiple languages hum in the background as the stoic crowd stands united in a shared moment of history, grappling not only with the loss of a deeply cherished spiritual leader, but also with the gravity of witnessing a moment that will echo through time.\n\nSt Peter's Square is abuzz with pilgrims from all corners of the globe. (Getty)\n\n\"It's a once-in-a-lifetime experience,\" Linda Coorey, who's travelling with fellow Australian Bernadette Lahood, says.\n\nThe pair, currently on holiday from Sydney, adjusted their itinerary to visit the Vatican in recognition of the impact Pope Francis had on their community.\n\n\"I think he was a particularly great pope, and certainly for our families, this is really important to pay our respects,\" Lahood adds.\n\n\"They wish they could also be here, but they're really glad that we're here and able to experience this and share that experience with them back home.\"\n\nREAD MORE: ﻿ Faithfuls pay final respects to Pope Francis as public viewing begins\n\nCrowds gather for procession of Pope's body View Gallery\n\nCrowds are enduring waits of up to six hours for a glimpse of Pope Francis's body, now lying in state beneath the majestic dome of St Peter's Basilica.\n\nThe basilica's great bell, Campanone, tolls solemnly, honouring the late pontiff in accordance with centuries-old tradition.\n\nThe sacred site remains open to the public day and night until the funeral tonight (AEST), allowing mourners from around the world to pay their final respects.\n\n\"It's worth it,\" Coorey says without hesitation.\n\nTo her, Pope Francis represented a leader who embraced everyone, regardless of their background.\n\n\"He was a people person - he loved being among ordinary people, not just dignitaries and politicians.\"\n\nFaithful are seen inside St Peter's Basilica to pay homage to the body of Pope Francis in Vatican City. (Getty)\n\nSimilarly for Lahood, the Pope's inclusive nature set him apart, bridging a gap between generations.\n\n\"For young Catholics in their formative years he's been a really good influence and been connected to all people, not just traditionalists, he's had a lot of appeal to the broader community, both Catholic and non-Catholic and I think he's been really vocal about issues that really represent how Christians should behave.\"\n\nInside the Basilica, I'm told it's an atmosphere of deep reverence and beauty as crowds silently shuffle past the open casket, rosaries in hand, to honour the man who led the Catholic Church for over a decade.\n\n\"Waiting outside was anxious and exhausting, but once I got in, it was beautiful,\" New Yorker Nancy Jiang says.\n\n\"I was just in St Peter's on Easter Saturday.\n\n\"Now going back in the evening and seeing everything lighten up, it was beautiful.\n\n\"Definitely worth the wait and lifetime experience.\"\n\nREAD MORE: ﻿ How the Pope spent his final hours and his last touching words to nurse\n\nCrowds are enduring waits of up to six hours for a glimpse of Pope Francis's body. (Claire Knight)\n\nRenowned for his humility, compassion, and reformist vision, Pope Francis — born Jorge Mario Bergoglio on December 17, 1936, in Buenos Aires — was the first Latin American and the first Jesuit to ascend to the papacy.\n\n\n\nAmong the many gathered in Rome today are South American Catholics, devoted followers of the late pontiff.\n\n\"The church is not just a European church, it's a world church,\" Brazilian Aducci Correia Kenig shares.\n\nHe's confident the same sense of diversity will continue with the next leader, who will be decided by an inner sanctum of cardinals in the coming weeks.\n\n\"It was very important for the church… Because we had this South American pope from another continent so people from China, Australia and other places, they think 'why not?\"\n\nREAD MORE: The youngest man to vote for a new pope is a Melbourne priest ﻿\n\nJung Nuns wait in St Peter's Square to pay their respects to Pope Francis. (Getty)\n\nThe pope's funeral will take place this Saturday, April 26, at 10am local time (6pm in Australia) in St Peter's Square, with global leaders including US President Donald Trump and Prince William expected to attend.\n\nTrue to his wishes for simplicity, Pope Francis will be buried in the Basilica of St Mary Major - a quieter, more humble resting place than some of his predecessors chose.\n\nAs the Vatican mourns, Catholics like Correia Kenig are hopeful that it's not the end, but an exciting new beginning for the church.\n\n\"The faith is reborn… believers are coming back to the church, new believers, I hope this new pope will make the faith stronger so those far away from the church can return.\"\n\nWhile a new pope is expected to be elected by mid-May, the focus for now remains on remembering a leader who touched lives across continents with a message of mercy, dignity, and hope.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/she-knew-something-was-wrong-mums-warning-as-survival-rates-for-certain-cancers-stagnate/3c905b2d-03c5-4096-bfc4-872187e31d70",
    "title": "Jaime's tumour grew to 7cm before her doctors listened to her",
    "publish_date": "Fri, 25 Apr 2025 00:45:15 +0000",
    "category": "lifestyle",
    "authors": [
      "Apr"
    ],
    "text": "The mother of a NSW woman who died of cervical cancer has told how her daughter spent more than a year trying to get doctors to listen to her concerns.\n\nAmanda Ne'Roi is speaking out about her daughter Jaime's devastating case as three peak research organisations - the Australian New Zealand Gynaecological Oncology Group, Ovarian Cancer Australia and the Ovarian Cancer Research Foundation - join forces to call on the government to commit $100 million in funding towards gynaecological cancer.\n\nAround 19 Australian women a day are diagnosed with a gynaecological cancer, according to December 2024 statistics from the Australian Institute of Health and Welfare (AIHW).\n\nJaime Ne'Roi, pictured with her daughter Indiana. Jaime died in 2023 when Indiana was aged one. (Supplied)\n\nHowever, survival rates for gynaecological cancers have stagnated and fallen well behind improvements for other cancers, such as breast cancer.\n\nIn the 15 years between 1991–1995 and 2016–2020, the five-year survival rate for women with gynaecological cancers increased by just 6 per cent, compared with 13 per cent for breast cancer, the AIHW data shows.\n\nNe'Roi said Jaime knew something was not right a few months after she gave birth to her second child, Indiana, in May 2020.\n\n\"She was having spotting, discharge, and an upset stomach. She felt sick. She just knew something was wrong,\" Ne'Roi said.\n\nJaime went to her GP, who referred her to a gynaecologist she had seen a decade earlier, when abnormal cells were detected on her cervix.\n\nAt the time, the gynaecologist decided against a hysterectomy because she was yet to have children.\n\nNe'Roi said the gynecologist dismissed her daughter's symptoms because she had recently given birth.\n\n\"He said it was just because she had a baby. He didn't even give her a pap smear test,\" Ne'Roi said.\n\nIt took her daughter Jaime more than a year for doctors to listen to her concerns, her mother Amanda Ne'Roi said. (Supplied)\n\nJaime then went to another gynaecologist, who also attributed the symptoms to her having had a baby and put her on the contraceptive pill, Ne'Roi said.\n\n\"She kept saying to them, there's something very wrong.\"\n\nNe'Roi said she remembered having conversations with Jaime, who was very worried, and telling her to go back to the gynaecologist.\n\nAfter another visit, the gynaecologist agreed to do an internal examination via a laparoscopy in August 2021, which revealed Jaime had stage 3 cervical cancer at the age of 37.\n\n\"By the time she actually got a doctor to listen, she had a seven-centimetre tumour and it was inoperable,\" Ne'Roi said.\n\nJaime underwent radiation and chemotherapy, and briefly received good news in December 2021, when a scan showed up clear.\n\nHowever, by February 2022 the cancer was back and had spread to her uterus and lymph nodes.\n\nA hysterectomy and more chemotherapy and radiation followed, but Jaime's health was deteriorating fast.\n\nThe last option presented by Jaime's doctors was immunotherapy, however, the family was told it would need to foot the bill at a cost of $6000 a fortnight.\n\n\"My husband and I were looking at selling up our property, everything - so were her brothers,\" Ne'Roi said.\n\nWith the money needed immediately, however, the family started an online fundraiser, which allowed Jaime to start the treatment.\n\nThe treatment was not unsuccessful and Jaime died in July 2023, just under two years after she was first diagnosed.\n\nShe left behind her partner and two children, Harrison, then aged six, and Indiana, aged one.\n\n\"The hardest thing I've had to do in my whole entire life was to tell my grandson his mum had gone,\" Ne'Roi said.\n\n\"He burst into tears and said, 'I just want my mommy back.'\"\n\nJaime Ne'Roi died two years after she was diagnosed with stage three cervical cancer. (Supplied)\n\nRates of cervical cancer have been increasing in Australia, despite the national rollout of the HPV vaccine in 2007, which provides some protection against the cancer-causing virus.\n\nBetween 2000 and 2024, incidence rates of cervical cancer have climbed from 5.5 cases per 100,000 people to 8, AIHW data shows.\n\nNe'Roi said Jaime had been vaccinated for HPV, which showed why women should not become complacent about the disease.\n\n\"I think the trouble is, people become very complacent about gynecological cancers, they aren't mentioned much. Breast cancer is huge,\" Ne'Roi said.\n\n\"I'm sharing this story to illustrate the hidden crisis impacting all Australian women, because it can hit any one of us at any time.\"\n\nMore money was desperately needed for research for all gynecological cancers, Ne'Roi said.\n\nProfessor Clare Scott, Australia New Zealand Gynaecological Oncology Group (ANZGOG) chair, said gynecological cancers had been left underfunded for decades and were a hidden crisis that was expected to grow.\n\nGynecological cancers - which include uterine, ovarian and cervical cancers - are predicted to surge by 21 per cent over the next 10 years.\n\n\"For too long, gynaecological cancers have been overlooked and underfunded, leaving women with limited treatment options and unacceptable survival rates,\" Scott said.\n\n\"These are not just statistics - they are our mothers, sisters, daughters, wives, and friends... we must do better.\"\n\nANZGOG, along with Ovarian Cancer Australia and the Ovarian Cancer Research Foundation, are seeking $100 million in federal government funding over four years to go towards more personalised treatments for patients, clinical education, a national research databank and drug trials.\n\n\"The survival rates for gynaecological cancers have barely changed in decades. That fact alone should be a wake-up call,\" Ovarian Cancer Research Foundation CEO Robin Penty said.\n\n\"We know that the answers are there – they lie in research and in better understanding of women's bodies and women's pain. To reveal them we need appropriate and proportionate investment.\"\n\nA spokesperson for Health Minister Mark Butler said he would continue discussions with the ANZGOG about their proposal.\n\n\"The Albanese Labor government is doing all we can to support patients, families, loved ones and carers on the cancer journey,\" the spokesperson said.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/coalition-puts-ev-drivers-on-notice-over-road-use-tax/105221034",
    "title": "Coalition puts EV drivers on notice over road use tax",
    "publish_date": "Sun, 27 Apr 2025 01:27:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "A Dutton government would consider making electric vehicle drivers pay for using roads, although the Coalition's transport spokesperson Bridget McKenzie could not say how this would be done and insisted it would not be a \"tax\".\n\nSenator McKenzie told the ABC's Insiders it was a \"pretty simple concept of equity\" that EV owners should contribute to road maintenance, given that other motorists do so through the fuel excise.\n\n\"What we've made very clear is everyone who uses our roads should contribute to making sure they're maintained to the proper standard,\" she said.\n\n\"When we get into government, that's something we have to look at.\"\n\nImpact of Coalition's vow to end EV lease discount Photo shows Four brand new cars on a production line are inspected by factory workers. The Coalition's promise to end electric vehicle subsidies could drive up prices for popular EVs by more than $15,000 under a typical novated lease and have an almost immediate effect on sales.\n\nThe issue has been sitting on the Albanese government's desk since the High Court decided that only the federal government could impose such a charge, vetoing a charge imposed by the Victorian government.\n\nWhile fuel excise revenue is not quarantined to be spent on road maintenance, it is often framed in that way, and the shifting towards EVs risks eroding a lucrative source of federal revenue, hauling in $23 billion last financial year.\n\n\"What the Labor Party is expecting is low- and middle-income earners in [outer urban] seats like McEwen, seats like Hawke, in Bendigo … they're effectively subsidising wealthier individuals in Kooyong, in Brighton and other areas who can afford to pay for an EV. We don't think that's fair,\" Senator McKenzie said.\n\nBut asked how EV drivers would be made to pay, such as a road use charge, she did not offer an answer, saying only that the Coalition was \"not proposing any new taxes\".\n\nThe admission comes in the same week as Peter Dutton backflipped on repealing Labor's fringe benefits tax concession for EVs purchased through novated lease, which he had earlier said he would leave untouched but now says is \"wasteful\".\n\n\"We didn't agree with the fringe benefit tax exemption, we've been really clear on that,\" Senator McKenzie said.\n\nThe Coalition will also water down the National Vehicle Efficiency Standard introduced by Labor.\n\nDon't touch backpacker visas, Nationals say\n\nSenator McKenzie, who represents junior Coalition partner the Nationals, said a Dutton government would not cut the number of working holiday-makers granted visas.\n\nThat exemption is not something that Mr Dutton or fellow Liberals have announced as their policy, and would make it harder to achieve the unspecified cuts to net migration the opposition says it intends.\n\nWhile the Coalition's calls to reduce net (temporary) migration have focused mainly on international students, the number of backpackers in the country on working holiday visas has surged since the pandemic thanks to a rule that allows British and Irish travellers to stay for three years rather than two.\n\nMigration falling despite election debate over 'surge' Photo shows Generic photos of apartments, balconies The migration \"surge\" is a major election issue, but official figures say numbers are already falling, with a big hit due in a couple of years.\n\nThe work of backpackers on farms, which is often a requirement of their stay, is regarded as essential by many regional employers, which is why the Nationals are highly protective of the migration stream.\n\n\"We need those backpackers out in our regions [for] tourism, hospitality and agriculture … We're not cutting that,\" Senator McKenzie said.\n\n\"International students — absolutely cutting that number.\"\n\nMr Dutton has also pledged to cut permanent migration by 25 per cent, but has not said how many family visas or skilled visas he will cut, detailing only a fraction of his pledge to be achieved by trimming refugee visas.\n\nDetails of the Coalition's migration policies are among many remaining loose ends less than one week from election day.\n\nSome of those details may be resolved when costings are released later this week, such as how the party will pay for its extra $21 billion in defence spending, and how it will cut the jobs of 41,000 Canberra-based public servants in non-frontline and non-security roles when official figures suggest there are not that many in the first place.\n\nLabor also faces questions about how it will pay for election commitments it has made in recent weeks, including its new housing supply subsidies and today's announcement of an expanded national medical hotline.\n\nFinance Minister Katy Gallagher told Sky News on Sunday that all new spending would be offset with savings or by re-prioritising other spending.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/nfl-draft-denver-broncos-punter-jeremy-crawshaw/105220962",
    "title": "Aussie punter Crawshaw drafted by Denver Broncos",
    "publish_date": "Sun, 27 Apr 2025 00:49:51 +0000",
    "category": "sports",
    "authors": [],
    "text": "Jeremy Crawshaw is set to join the ranks of Australian punters in the NFL after being drafted by the Denver Broncos.\n\nPetaia's NFL dream a step closer after signing deal with Los Angeles Chargers Photo shows Jordan Petaia holds an NFL ball in his right hand Jordan Petaia signs with the Los Angeles Chargers after impressing scouts from all 32 teams at a 10-week crash course in American football.\n\nThe 23-year-old from Emu Plains in Sydney's west was the first punter taken in the draft — going in the sixth round with pick number 216 — after being widely considered the best on offer following his five seasons with the University of Florida.\n\nHe averaged 45.8 yards for the Gators in 2024, with 25 punts downed inside the 20-yard line.\n\nIn the 2023 season, he set the single-season Gators record for punt average at 48.9 yards.\n\nCrawshaw is set to compete with veteran Matt Haack for the Broncos' starting job.\n\nHe is poised to join fellow Australian punters Tory Taylor (Chicago), Mitch Wishnowsky (San Francisco), Michael Dickson (Seattle) and Cameron Johnston (Pittsburgh) in the NFL.\n\n\"Crawshaw will likely move in and become an immediate NFL starter with the potential to become a genuine field-position weapon,\" Crawshaw's pre-draft scouting report read.\n\n\"The ability to execute multiple punt styles — from traditional bombs to rugby-style rollers — gives coordinators a versatile weapon for any situation.\n\n\"With his proven track record in high-pressure SEC (Southeastern Conference) environments and continued development throughout his college career, Crawshaw has positioned himself as the top punter in this draft class.\n\n\"His ceiling suggests a decade-plus career as a reliable NFL punter with Pro Bowl potential.\"\n\nCrawshaw was the sixth player drafted by the Broncos.\n\nAAP",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/live-sheep-export-ban-debate-federal-election-2025/105177746",
    "title": "Viral Facebook post sums up WA farmers' final push on live sheep export",
    "publish_date": "Sun, 27 Apr 2025 00:41:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Veteran sheep farmers Grant and Chrissie Smith never set out to achieve social media fame.\n\nBut a Facebook post from the couple, who farm at Kojonup in Western Australia's Great Southern, explaining the practical impact of the looming ban on live sheep exports has gained them unexpected attention.\n\nThe premise was simple — they wanted readers to go to their fridge and remove all the items they relied on farmers for, leaving it all but empty.\n\nThe post has been circulated thousands of times, leading them to join the campaign to overturn the Labor government and its impending ban on the live sheep trade from 2028.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\n\"Someone asked me to put into perspective if farmers were over-dramatising the ban,\" Ms Smith said.\n\n\"I went home to Grant and said, 'We need to answer this question as honestly and authentically as we can to give people an understanding of what we do.'\"\n\nThe Smiths say Australian farmers are leaders in animal welfare standards. (ABC South West: Kate Forrester)\n\nFarmers want to be heard\n\nA screen grab of the Smiths's Facebook post. (Supplied: Facebook)\n\nThe Smiths sell sheep directly to meat processors, relying on exporters to buy their surplus stock.\n\n\"Our passion is producing food, that's what it comes down to. All farmers — whether it's beef, lamb or grain —produce food and that's what we love,\" Mr Smith said.\n\n\" I think the general public and politicians have lost sight of the fact that's what we do. \"\n\nMr Smith said the viral post could be seen as a plea to Australians to think about how often they relied on a farmer.\n\n\" Did Albanese for a second think about how this is going to affect us and Australian farmers? \"\n\nThe couple say they want Australians to think carefully about their vote. (ABC South West: Kate Forrester)\n\nOne final push\n\nAfter delivering a majority government to Prime Minister Anthony Albanese in 2022, Western Australia could play a similar decisive role on Saturday.\n\nAfter a sharp swing against Labor at last month's state election, driven by the government's poor performance on regional issues, supporters of live exports have turned their attention and resources to critical electorates in Perth.\n\nKeep the Sheep is campaigning to overturn the current Labor government. (ABC South West: Kate Forrester)\n\nVeterinarian and Keep the Sheep campaigner Holly Ludeman said the campaign was encouraging country residents to lobby friends and family in key seats.\n\nHolly Ludeman says she is confident the Coalition will reverse the ban. (ABC South West: Kate Forrester)\n\n\"We are in the final quarter and we can't back down; this is one issue that is going to be on people's mind come election day,\" Dr Ludeman said.\n\n\"I'm really sad this is such an election issue — it just shouldn't be.\"\n\nSwingers: How to win an election Photo shows The word Swingers lit up as a neon sign followed by how to win an election. The ABC iview logo is below it. Australia has never had more swinging voters. Casey Briggs takes stock of how we vote and how that's changing politics. Stream now on ABC iview.\n\nThe vet, who contested Liberal preselection for the seat of Bullwinkel, said significant improvements had been made to animal welfare in recent years and opponents were relying on outdated arguments.\n\n\"It's a very simple argument to say ban the trade and use the heartstrings of outdated footage — the activist's argument is very simple,\" Ms Ludeman said.\n\n\" The reality of the trade is so complex. \"\n\n'This is law'\n\nAnti-live export campaigner Lisa Baker said she was not worried about the potential of the ban being overturned, since it was legislated in parliament last year.\n\nHowever, the former state Labor MP is still rallying to make sure the Australian public takes its vote seriously.\n\nLisa Baker has campaigned against the live export trade for over 40 years. (ABC South West: Kate Forrester)\n\n\"This is law. We are going to see the export trade finish in 2028 and I'm so grateful because that's what the Australian public wanted,\" Ms Baker said.\n\n\"What we are seeing at the moment is quite bizarre pushback from Liberals and Nationals parties threatening to overturn it, and it hasn't even started yet.\"\n\nSupporters of the live export ban have continued their campaign. (Supplied: Debra Edmonds)\n\nMs Baker said there was a particular audience anti-live export groups were targeting in the lead-up to next week's election.\n\n\"I think the generation that is voting for the first time, the 18–35 year olds, that group of people understand much more about the market into the future,\" she said.\n\n\" We need to stick with what we've been promised. It's the right thing to do. \"\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/unlikely-china-president-xi-called-us-president-trump/105219448",
    "title": "Analysts say it's 'highly unlikely' Xi called Trump over tariffs",
    "publish_date": "Sun, 27 Apr 2025 00:22:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "As the world watches tariff brinkmanship unfold between the US and China, analysts have cast doubt on the truth of US President Donald Trump's claim in a magazine interview that China's President Xi Jinping called him.\n\nMr Trump told Time magazine that tariff talks were taking place between the US and China, an assertion he repeated to reporters as he was leaving the White House to attend the funeral of Pope Francis in Rome.\n\nTrump says Xi called, China denies there are tariffs talks Photo shows U.S. President Donald Trump holds up a chart with numbers showing tax rates changed to trading partners The US president said his Chinese counterpart called him and it was not a \"sign of weakness\" as Beijing quietly exempted some US good from import levies.\n\nBeijing denied any talks were taking place.\n\n\"China and the US are NOT having any consultation or negotiation on #tariffs,\" China shot back in a statement posted by the Chinese Embassy in Washington.\n\n\" The US should stop creating confusion. \"\n\nIn response to Mr Trump's comments to Time, several China analysts told the ABC they did not think Mr Xi would have called his US counterpart.\n\nKing's College London business lecturer Xin Sun said it was \"highly unlikely\" Mr Xi called Mr Trump because to call him without invitation would imply Mr Xi would make concessions under pressure.\n\n\"For any political leader in China, this would have very serious consequences for their own political stability,\" Dr Sun said.\n\n\"It basically means that it signals weaknesses and vulnerability to possible political opponents.\"\n\nChina imposed 125 per cent tariffs against US imports in response to the Trump administration's policies. (AP: Ju Peng/Xinhua)\n\nScott Kennedy, a senior adviser on Chinese business and economics at the Centre for Strategic and International Studies in the US, agreed with that assessment.\n\n\"I don't think the two have communicated directly with each other since they spoke on January 17,\" said Dr Kennedy, referring to a Chinese Foreign Ministry statement that confirmed the pair spoke when Mr Trump was re-elected as US president.\n\n\"The US president recently has made several comments implying momentum in talks with China and others in order to reassure markets,\" he added.\n\n\" There may be low-level communications, but very unlikely to be ongoing negotiations. \"\n\n'A preventative move'\n\nChina responded to Mr Trump's imposition of 145 per cent import taxes by placing 125 per cent tariffs on American goods.\n\nMr Trump claims to have made hundreds of trade deals with other countries. (Reuters: Carlos Barria)\n\nWhile there is little clarity on what if any deals and negotiations are underway between the two countries, there have been some signs of some de-escalation in recent days after China quietly exempted some US goods from the import levies.\n\nMr Trump has also imposed a raft of tariffs on other countries, which have been scrambling to come to agreements with the US.\n\nJD Vance calls on India to buy more F-35 fighters Photo shows Four women in traditional attire stand next to a portrait of JD Vance Despite warm relations with India's leader, Donald Trump has slammed the South Asian country as a \"tariff abuser\".\n\nIn the Time magazine interview, Mr Trump also said the US had made 200 tariff deals and expected to have them signed off in three or four weeks.\n\n\"We're meeting with China. We're doing fine with everybody. But ultimately, I've made all the deals,\" he said.\n\nHowever, Dr Sun pointed out that not a single major trading partner had confirmed such deals had been signed.\n\n\"Given those unsubstantiated claims Trump and his administration has made over the past few weeks, I think there is a strong political incentive for the Trump administration to make the claim that China is in negotiation with the US,\" he said.\n\n\"Doing so would probably constitute a preventative move in case Trump would need to make further retreats regarding tariffs on China.\"\n\nThe Australian Strategic Policy Institute's Bethany Allen said Chinese authorities would be unlikely to deny a call took place between the two leaders if that was true.\n\n\"Trump is known for off-handed comments that may be somewhat less than precise,\" she said.\n\n\"Messaging on the Chinese side, however, is always extremely precise and controlled. I think it is possible that Trump may be referring to some kind of contact — perhaps substantive, perhaps not — between US and Chinese officials.\"\n\nOn Saturday, China's Foreign Minister Wang Yi said Beijing stands on the side of international rules regarding US-imposed tariffs and opposes protectionism.\n\nMr Wang said Beijing would seek solidarity with other countries on the tariff situation and exposes \"extreme egoism\" and the bullying of certain countries, a veiled reference to the US.\n\nLoading...\n\nABC/wires",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/your-election-trash-is-the-national-library-s-treasure/105205760",
    "title": "Election pamphlets may be 'annoying' but they tell a story of Australia",
    "publish_date": "Sat, 26 Apr 2025 23:50:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian political history is littered with well-known and well-worn slogans.\n\n\"It's Time\", the catch-cry of Gough Whitlam's campaign in 1972, is a notable moment in time.\n\nThe phrase, like many election slogans, appeared on T-shirts among other merchandise.\n\nAnd paraphernalia like this from elections gone by might seem like rubbish, tossed into the recycling bin, but to the National Library much of it is part of history.\n\nClive Palmer won the seat of Fairfax in 2013 for his party the United Australia Party. (ABC News: Simon Beardsell)\n\nThey have been collecting this material — dubbed \"ephemera\" — since 1983, including flyers dating back to the 1900s that suggested voters place them \"in their hat\".\n\nThey are asking for Australians to send in items that fit this description to become part of future exhibitions.\n\nFrom Federation to 'It's Time'\n\nThe material from Australia's first federal election is very delicate, and reveals a polite and well-mannered way of speaking than we've become accustomed to in modern times.\n\nCollection curator Catherine Aldersey says while she understands the material people have been finding in their letter boxes can be \"annoying\" it provided an insight into the political environment of the time.\n\nCatherine Aldersey said the material can offer an insight into the past. (ABC News: Simon Beardsell)\n\n\"The material was designed to be given to people to pass on or as one item charmingly put; 'Put this in your hat and pass it on', so it was person to person,\" Ms Aldersey said.\n\nAt the time, the sudden influx of different parties and confusion on how to vote steered the conversation.\n\n\"There's evidence of a newly Federated Australia and a sense of strong competing voices in an environment where it was wide open, who we were, a new nation at that time,\" Ms Aldersey said.\n\n\"And there's that consciousness that comes through in that material.\"\n\nIn 1949 everything changed when Sir Robert Menzies campaigned across the country and won the election for the Liberals.\n\nMs Aldersey said material before the 50s tended to be more formal and less colourful than modern materials. (ABC News: Simon Beardsell)\n\nMenzies would lead the country for the next 17 years, with his party holding the reins for 23 years.\n\nThe campaign material of this time turned a corner.\n\n\"Election material became a lot more like advertising material that was disseminated publicly and through the 50s,\" said Ms Aldersey\n\nThe 70s saw the rise of Gough Whitlam's \"It's Time\" jingle than could be heard on the radio, TV and worn on people's backs.\n\nFormer Prime Minister Gough Whitlam won the election in 1972, bringing to an end 23 years of Liberal government. (ABC News: Simon Beardsell)\n\nFrom then on the material has been unavoidable every three years.\n\n\"It's really persuasive, it shouts at you, and it can be sort of seen in a negative light, but with the passage of time, it becomes really fascinating window into the past,\" Ms Aldersey said.\n\n'Every electorate, every candidate'\n\nThe library collects the material from all over the country, and much like those seeking election, they're interested in every town and city, from Broome to Brisbane, from Cape York to Hobart.\n\nThe Australian Sex Party was founded in 2009 and was led by Fiona Pattern, former CEO of an adult industry lobby group. (ABC News: Simon Beardsell)\n\n\"Election ephemera is a term that we use to refer to original campaign material that's used as part of the federal election campaign, and we collect campaign material like this from all over Australia, from every electorate for every candidate,\" said Ms Aldersey.\n\nSo before putting that flyer for Alicia Payne, Will Roche or Senator David Pocock in your yellow bin, they're asking you to consider putting it in the post.\n\nThis year, curators are particularly keen for donations from marginal and remote communities — where budgets aren't as big as other parties and they're less likely to mass-produce campaign materials — as well as culturally and linguistically diverse communities.\n\nSubmissions should be undamaged, authorised and originals, but can be authorised with graffiti.\n\nPyne's Pizza signs were used by Nick Xenophon in the 2016 election. (ABC News: Simon Beardsell)\n\n\"We keep it, preserve it and make it available for research, it is a really informative, valuable primary resource for understanding our past and also understanding where we're at,\" Ms Aldersey said.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/wrexham-championship-ryan-reynolds-rob-mcelhenney/105220826",
    "title": "Reynolds, McElhenney and Wrexham one step closer to ‘impossible dream’",
    "publish_date": "Sat, 26 Apr 2025 23:47:46 +0000",
    "category": "sports",
    "authors": [],
    "text": "When Ryan Reynolds floated the idea of buying British football club Wrexham to fellow Hollywood A-lister Rob McElhenney, he says it felt like an \"impossible dream\".\n\nReynolds had an idea for a documentary and the ultimate goal was reaching the Premier League.\n\nFour years after Reynolds and McElhenney purchased the north Wales outfit, Wrexham is one league away from achieving its lofty goal following a 3-0 win over Charlton Athletic, which saw the club promoted for a record third consecutive time.\n\nThe Wrexham players show off the silverware after defeating Charlton Athletic. (Getty Images: Kya Banasko)\n\n\"It just seemed like an impossible dream,\" Reynolds told Sky Sports after the match.\n\n\"And when you're a storyteller, you look as much as you can at the sort of macro view of this history.\n\n\"We were standing there doing a press conference four years ago, and said our goal is to make it to the Premier League.\n\n\"There was understandably a lot of titters and laughter and giggles, but it starts to feel like a real, tangible thing that could actually come to fruition in this moment.\"\n\nThe Red Dragons will play in the second-tier Championship next season, a feat that seemed unthinkable four years ago when Wrexham was a non-league team going nowhere.\n\nAsked about being just one league below England's vaunted top-flight, McElhenney laughed and said: \"That's for tomorrow to think about. Today is just enjoying the moment.\"\n\nReynolds replied: \"We have to wait 'til tomorrow? I'll erase the whiteboard I put up at half-time.\"\n\nWrexham's popularity has skyrocketed on both sides of the Atlantic due to the North American owners and the Welcome to Wrexham documentary.\n\nWhile many sports teams have celebrity absentee owners, Reynolds and McElhenney are anything but absent.\n\nReynolds and McElhenney enjoyed the moment with Wrexham supporters. (Getty Images/AMA: Robbie Jay Barratt)\n\nReynolds, whose wife and fellow actor Blake Lively was also at Saturday's match, told reporters this week in New York the stress was \"like an eight-inch ulcer in my stomach\".\n\nMcElhenney had delivered a pre-match speech to the players before their key 2-1 victory over Blackpool last Monday and then spent this past week in Wales with the club.\n\nThe Racecourse Ground crowd showed their appreciation in the dying minutes of Saturday's thriller, turning to applaud the two, who were both down on the celebratory pitch soon after the final whistle, wrapping players in giant hugs.\n\n\"Ryan and I have the easiest job in the world, which is to show up and watch this incredible football team and this incredible story continue to unfold,\" said McElhenney, an American best known for his role in the sitcom It's Always Sunny in Philadelphia.\n\nReynolds added: \"And if you want to see what it means to them, you go into that dressing room after a loss and there's nothing that can console them.\n\n\"That's where you see the grit and the metal that these players have. It means everything to them.\"\n\nReuters",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/singapore-orders-foreigners-facebook-posts-removed/105220762",
    "title": "Singapore orders Facebook to take down post by Australian",
    "publish_date": "Sat, 26 Apr 2025 23:28:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Singapore has ordered Facebook parent Meta to block Singaporeans' access to posts made by foreigners ahead of a national election, under rules restricting their social media posts.\n\nThe Infocomm Media Development Authority issued the orders after some posts by foreigners were deemed as \"intended to promote or prejudice the electoral success or standing of a political party or candidate\".\n\nThe South-East Asian Singapore dissolves parliament ahead of general election , the first under the social media rules put in place by the government in 2023, is almost certain to be dominated by the People's Action Party, which has won the most seats in every vote since independence in 1965.\n\nThe rules bar foreigners from publishing online election advertising, which it defines as online materials that could help or hurt any political parties or candidates.\n\nThe Ministry of Home Affairs identified the foreigners as Iskandar Abdul Samad, national treasurer of the Islamist party Parti Islam Se-Malaysia and Mohamed Sukri Omar, the party's youth chief in the Malaysian state of Selangor.\n\nIt also identified Zulfikar bin Mohamad Shariff, an Australian who renounced his Singapore citizenship in 2020.\n\nMr Samad had expressed support for the opposition Workers' Party's Faisal Manap in a social media post.\n\nSupporters of the Workers' Party attend a rally in Singapore. (Reuters: Edgar Su)\n\nThe authorities said Mr Shariff had accused Malay-Muslim members of parliament of failing to represent Muslim interests, saying Singapore did not need another Malay MP who did not represent their views.\n\nThe government said the posts interfered with domestic politics and influenced citizens to vote on racial and religious lines.\n\nMalays, who are recognised as the indigenous population of ethnic Chinese-majority Singapore, account for 13.5 per cent of the population.\n\nMr Shariff, responding to the takedown request, posted on Facebook that the action showed the ruling PAP and its supporters were \"scared\" and that \"desperation reeks\".\n\nHe said he was creating a WhatsApp channel and another website to advocate for issues.\n\nThe opposition Workers' Party said in a statement it did not have control over foreign parties who expressed support for its candidates.\n\nIt said Mr Manap had spoken about how religion needed to be \"kept aside, or apart from politics, so that religion will not be used to gain personal benefit or to benefit any political party\".\n\nSingapore's general election will be held on Saturday May 3.\n\nLoading...\n\nWhile Singapore has flourished as one of the world's wealthiest nations, it has also become one of the most expensive cities to live in.\n\nThe PAP has been criticised for tight government control and a government-knows-best stance, media censorship and the use of oppressive laws against dissidents.\n\nIssues like widening income disparity, increasingly unaffordable housing, overcrowding caused by immigration and restrictions on free speech have also loosened the PAP's grip on power.\n\nReuters/AP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/retro-house-and-newman-history-project-celebrates-wa-mining-life/105070466",
    "title": "'Retro house' celebrates outback town's mining history",
    "publish_date": "Sat, 26 Apr 2025 23:27:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "The mining town of Newman, 1,170-kilometres north-east of Perth, is an iron-ore powerhouse.\n\nToday, the mines that surround it are worth more than $24 billion a year in revenue.\n\nBut like many towns in WA's remote Pilbara, it does not have a local museum.\n\nAnd it means there's nowhere that publicly celebrates the human stories behind the immense mineral wealth.\n\n\"When I walk down the street of this town, when I walk past buildings; they're full of stories, they're full of history,\" local historian Lisa Rickert said.\n\n\"And they're worth preserving.\"\n\nThe 'snake man'\n\nTwelve years ago, Ms Rickert, who has lived in Newman almost her whole life, decided to do just that.\n\nLisa Rickert has recorded more than 100 interviews with current and former Newman residents. (ABC Pilbara: Charlie Mclean)\n\nUsing more than 100 interviews with current and former residents, and an ever-growing collection of archival photos, she built a website outlining the events and people that shaped Newman.\n\nOne of her favourites is the late Charlie Snell, a man who came to Newman in 1966, when it was just a collection of tents supporting the construction of the Mt Whaleback mine.\n\n\"He was known as the 'snake man,'\" Ms Rickert said.\n\n\"Back then there were two men to a tent but no-one would share with Charlie because he usually had a reptile on his person.\n\n\"He, along with the help of the local First Nations people, collected seedlings and started Newman's first nursery ... to grow plants in the town.\"\n\nCharlie Snell (right) was known as the \"snake man\" for his love of the reptiles. (Supplied: Lisa Rickert/Newman History 6753)\n\nFrom an early age, Mr Snell had helped his grandfather, in south-west WA, grow flowers and vegetables for the Perth market and he used that knowledge in Newman.\n\nPhotos of Mr Snell are now hung on the walls of an original, \"1968\" home Ms Rickert has restored for her latest project: the Newman \"retro house\".\n\nJoint effort to create 'retro house'\n\nAt the end of the \"tent city\" era of the 1960s, Mt Newman Mining Company (bought out by BHP in the early 90s) built a series of identical cottages for its workers.\n\nIn 1966, Newman was a tent city as the country's biggest open-pit iron-ore mine was being established. (Supplied: Lisa Rickert/Newman History 6753)\n\nMs Rickert bought and restored one of the first homes built in the remote mining town, to celebrate the formative years of WA's mining industry.\n\nShe has set up the home exactly as it would have looked in the late 60s by sourcing original furniture and other common items from her childhood.\n\nBut she hasn't had to do it alone, with past and present Newman residents donating old belongings for the project.\n\n\"I've even had people bring things back from out of town,\" Ms Rickert said.\n\n\"Other people have posted things up [online] when they've found them.\n\n\"They think, 'Oh, will I throw this out? Or will I donate it to the history project?'\"\n\nIn 2022, Ms Rickert bought a worker's cottage built in 1968 and has recreated its original interior design. (Supplied: Darren Field Photography)\n\nEarlier this year, Ms Rickert made the home's three bedrooms available to travellers or workers on short-term contracts needing a place to stay.\n\n\"[When] they are ex-residents of Newman, they will go crazy for these old 70s or 80s pieces of furniture because they have that connection with it,\" Ms Rickert said.\n\n\"It brings back memories of their time here.\"\n\nLove-letter to mining life\n\nMs Rickert hopes the stories laid out in the house and on the website challenge the view that mining towns are places only to work, not to live.\n\nShe said right from the town's opening, its isolation and extreme temperatures bonded people together.\n\nMs Rickert's collection of archival photos capture the spirit of Newman's formative years. (Supplied: Lisa Rickert/Newman History 6753)\n\n\"I think it was an exciting time [in the 60s] for those young people and they looked upon it as a challenge.\n\n\"Being so isolated back then and so far away from family, which we are today … the people, the friends that you make in town, they sort of become your family.\n\n\"The bond between Newman people is so strong they actually have an annual reunion every year in March.\"\n\nSome of Ms Rickert's items poke fun at Newman's isolation and reputation for being a tough place to live. (ABC Pilbara: Charlie Mclean)\n\nBut she recognises not everyone is up for the \"challenge\".\n\n\"There's the other side,\" Ms Rickert said.\n\n\"When Dad first came to town in March of 1970 the average stay was two weeks.\n\n\"So a lot of the men that came here took one look around and just said 'No, I'm not bringing my family here' and jumped on the next flight home.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/madrid-open-alex-de-minaur-novak-djokovic/105220738",
    "title": "De Minaur thrives at Madrid Open as Djokovic slumps again",
    "publish_date": "Sat, 26 Apr 2025 22:35:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "Alex de Minaur has begun his Madrid Open campaign in style, but 24-time major winner Novak Djokovic has crashed out in straight sets.\n\nDe Minaur's clinical 6-2, 6-3 victory over Italian Lorenzo Sonego in the round of 64 on Saturday was overshadowed by another dismal first-round defeat for Djokovic.\n\nThe former world number one lost his third match in a row, succumbing tamely to Italy's Matteo Arnaldi 6-3, 6-4.\n\nDjokovic, 37, pondered after the match whether he would be back in Madrid next year.\n\n\"I'll come back, maybe not as a player,\" Djokovic said.\n\n\"I've had a few of these this year where I lose in the first round, unfortunately.\n\n\"My level of tennis is not where I would like it to be.\"\n\nMatteo Arnaldi (left) is congratulated by Novak Djokovic following his upset win. (Getty Images/Eurasia Sport: Alberto Gardin)\n\nDe Minaur's clay court prowess, though, is clearly on the up.\n\nThe world number seven is now looking at the prospect of a big run in the Masters 1000 event on the fast Madrid courts.\n\n\"I was very happy with how I settled mentally and was able to bounce back straight back after losing my serve first game,\" de Minaur said.\n\n\"I really ended up playing some great tennis. So very happy with that.\"\n\nDe Minaur faces Denis Shapovalov in the third round after the Canadian outplayed Kei Nishikori 6-1, 6-4.\n\nAAP",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/act-families-being-squeezed-by-cost-of-living-seek-food-relief/105219298",
    "title": "Canberra families are being pushed to the brink",
    "publish_date": "Sat, 26 Apr 2025 22:23:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Skylee Taylor never wanted to turn to charity to put food on her family's table.\n\n\"I was scraping by to feed everyone,\" the 24-year-old said.\n\n\"I think I probably would have been in hospital from being malnourished myself, putting all the kids first and not feeding myself.\"\n\n\" It's a scary place to think of. \"\n\nSkylee Taylor has risked her own health to ensure her children are fed. (ABC News: Lily Nothling)\n\nPregnant with a toddler, the single mother from Canberra was also caring for her two teenage sisters.\n\nThe extra mouths came at an added cost, and last year she started accepting donations from local food pantries.\n\n\"It was hard to reach out for the help,\" Ms Taylor said.\n\n\"I felt like I couldn't do it on my own, which isn't a great feeling being a mum and a sister.\n\n\"But the support I got … they made it feel like it was OK to reach out for help because things are very hard to afford these days.\"\n\nNew face of poverty\n\nLike many households across Australia, Ms Taylor is under pressure by the rising cost of living.\n\nA survey of frontline charities, conducted by food rescue organisation OzHarvest, showed 77 per cent had experienced an increase in people seeking food in the past year.\n\nOzHarvest estimates 50,000 people are being turned away every month because charities cannot keep up with demand.\n\nFood relief from OzHarvest is in high demand across the country. (ABC News: Lily Nothling)\n\nIn Canberra, the number of people requesting food support for the first time was 37 per cent — the highest rate in the country.\n\nChristine Scott from OzHarvest Canberra said the demographic of people in need had shifted away from stereotypes.\n\n\"It's families … it's people who have mortgages, it's people who have double incomes,\" she said.\n\n\"I think in Canberra the general wealth that we experience here often means that we don't notice this layer of need in our community.\"\n\nOzHarvest Canberra's Christine Scott said the cost of living is now impacting those not previously considered vulnerable. (ABC News: Lily Nothling)\n\nTo address Australia's \"food crisis\", OzHarvest is calling for a dedicated Minister for Food and ongoing funding for food rescue and relief.\n\nA widespread crisis\n\nJust over the ACT border in Queanbeyan, crowds queue each week at the St Benedict's Community Centre to get their hands on donated groceries.\n\nIt also offers hot meals four days a week.\n\n\"In the last 18 months with the housing crisis but also with the cost of living, we are finding that there are people that we wouldn't necessarily have seen beforehand,\" coordinator Elaine Lollback said.\n\n\" We're starting to see people who have got permanent jobs and are probably on a moderate income rather than a low income. \"\n\nElaine Lollback coordinates food relief at St Benedict's Community Centre in Queanbeyan. (ABC News: Lily Nothling)\n\nMs Lollback said people travelled from Canberra, Yass, Braidwood and Goulburn to access the community centre.\n\n\"Poverty and disadvantage doesn't see the state border,\" she said.\n\nNot-so lucky country\n\nAs the CEO of the Canberra PCYC, Cheryl O'Donnell sees the impact of food insecurity on young people every day.\n\nPCYC ACT CEO Cheryl O'Donnell said famlies are being forced to choose between paying rent and feeding themselves. (ABC News: Lily Nothling)\n\n\"The kids come in and you can see they're undernourished or malnourished, they're not healthy looking, they're not alert,\" she said.\n\n\"Whereas as soon as you put something in their stomach, it's just a totally different young person to deal with.\"\n\nThe organisation receives frozen meals and fresh produce from organisations including OzHarvest, but is finding food quickly disappearing from its shelves.\n\n\"Families are having to make decisions as to whether to pay the rent, pay the electricity or feed the family,\" Ms O'Donnell said.\n\nCharities like the PCYC offer pantry supplies to clients. (ABC News: Lily Nothling)\n\n\"You've got families where the parent may be going without food, just to ensure that their children are being fed — it's just atrocious.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/disability-advocates-call-for-footpath-funding/105188764",
    "title": "Dodgy footpaths wreaking havoc for people living with disability",
    "publish_date": "Sat, 26 Apr 2025 22:18:37 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Travelling along the footpath should be a relatively simple exercise, but for many people poorly maintained pathways pose a challenge, especially in regional centres.\n\nMount Gambier resident Kit Cooper said when she was able-bodied she was unaware of the issue but that changed when she was diagnosed with postural orthostatic tachycardia syndrome (POTS) last May.\n\nThe genetic condition causes her heart rate to increase abnormally and can lead to dizziness, light-headedness and fainting.\n\nKit Cooper struggles to navigate the footpaths in Mount Gambier. (ABC South East SA: Sam Bradbrook)\n\n\"It's easy to miss the things until it's affecting you,\" Ms Cooper said.\n\n\"As a part-time wheelchair user, I have become aware that a lot of the places that I used to frequent are … inaccessible without support from a carer or a partner.\"\n\nSharon Morgan, a Port Lincoln resident who had a leg amputated in 2011, said she had been forced to use the road because of badly maintained footpaths and poorly designed ramps.\n\nSharon Morgan is often forced to use the road because of poorly planned and maintained footpaths. (ABC Eyre Peninsula: Tim McGlone)\n\n\"A lot of people who can get around normally can't see there being a problem,\" she said.\n\nDozens of people told the ABC of recurring issues regarding inaccessible ramps, damaged paths and concrete slabs lifted by tree roots.\n\nDisability advocate Cyanne Westerman said such problems could increase the isolation of those living with mobility issues.\n\nCyanne Westerman says more needs to be done to make footpaths accessible for those with mobility issues. (ABC North and West SA: Arj Ganesan)\n\nMs Westerman, who lives with limb girdle muscular dystrophy, struggles to find a usable footpath for her motorised wheelchair even when she is just outside her Whyalla home.\n\n\"I often go on the road where it's a lot smoother, but it's also dangerous because of the cars,\" she said.\n\nWho is responsible?\n\nFootpath maintenance is the responsibility of local government.\n\nThe City of Port Lincoln and Whyalla City Council both have disability access and inclusion plans that highlight footpath and ramp access as issues.\n\nWhyalla Council's 2020-24 plan showed that almost 60 per cent of people living with a disability had difficulty accessing footpaths and ramps.\n\nPatches of unsealed footpaths are a common sight in regional cities. (ABC North and West SA: Arj Ganesan)\n\nPort Lincoln mayor Diana Mislov said footpath upgrades were often tied to larger projects, which made them more likely to meet the criteria for grant funding.\n\n\"Whereas roads and footpaths and even stormwater [maintenance], to some degree, are just less attractive,\" she said.\n\nCr Mislov said there were not enough major projects to ensure the city's footpaths were adequately maintained.\n\nState funding needed\n\nMs Westerman's twin sister Zia, a Whyalla councillor who shares her disability, says local governments are often tied up in \"red tape\" and have limited budgets.\n\n\"Local councils are doing their best,\" she said.\n\n\"I think it's time for someone else to step in and help them do more.\"\n\nShe is one of many disability advocates calling on the state government to fund upgrades to footpaths.\n\nWhyalla City Council Mayor Phill Stone says councils are in need of state government support. (Supplied: Whyalla City Council)\n\nWhyalla Mayor Phill Stone said the council spent about $600,000 a year on footpath maintenance.\n\n\"If governments could establish a particular fund to give us access to extra funding, that would be a move in the right direction,\" he said.\n\nA spokesperson from the Department for Infrastructure and Transport said councils were responsible for footpath maintenance, but there were various state and Commonwealth infrastructure grants they could apply for.\n\nCouncils could also access financial assistance grants by the Local Government Grants Commission, the spokesperson said.\n\nThe Local Government Association and the City of Mount Gambier Council were both contacted for comment.\n\nPublic consultation on the draft state disability inclusion plan commenced earlier this month and will close on May 15.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/diamond-league-china-eleanor-patterson-lachlan-kennedy/105220712",
    "title": "Aussie Patterson second at Diamond League opener, Kennedy fifth on debut",
    "publish_date": "Sat, 26 Apr 2025 21:59:25 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian Olympic medallists Eleanor Patterson and Nicola Olyslagers finished second and third respectively in the women's high jump at the opening Diamond League meet in Xiamen, China.\n\nIn the men's events, Australia's Liam Adcock was second in the long jump and rising sprint star Lachlan Kennedy placed a credible fifth in the 100m on his Diamond League debut.\n\nPatterson and Nicola Olyslagers (both 1.94m) finished behind Ukraine's Paris Olympics gold medallist and world record holder Yaroslava Mahuchikh.\n\nMahuchikh claimed the win with a first-attempt clearance at 1.97m, before having three unsuccessful cracks at 2.03m.\n\nThe much-improved Adcock was a close second behind local favourite Zhang Mingkun in the men's long jump.\n\nWorld indoors bronze medallist Adcock (8.15m) looked the likely winner for much of the night, only for Zhang to secure victory with a leap of 8.18m in the penultimate round.\n\nSprinter Kennedy arrived in Xiamen in career-best form, having claimed silver in the 60m at last month's world indoor titles in Nanjing.\n\nHe also moved to second on the Australian 100m all-time list with a run of 10.00 seconds at the national championships in Perth a fortnight ago.\n\nThe 21-year-old held his own against a world-class field on Saturday night, crossing the line in 10.18.\n\nSouth African Akani Simbine won in 9.99 ahead of Kenyan Ferdinand Omanyala (10.13) and Great Britain's Jeremiah Azu (10.17).\n\nOnly seven-hundredths of a second separated the next six runners across the line behind Simbine.\n\nAustralian Abbey Caldwell broke the Oceania record in the non-championship women's 1,000m with a time of 2:32.94.\n\nCaldwell was second behind legendary Kenyan Faith Kipyegon, with another Australian, Sarah Billings, in third spot in 2:33.45.\n\nKipyegon clocked 2:29.21 to come within striking distance of Svetlana Masterkova's world record of 2:28.98 set in 1996.\n\nRose Davies broke her Australian women's 5,000m record, clocking 14:40.83 when finishing ninth in a race won by Olympic gold medallist Beatrice Chebet from Kenya in 14:27.12.\n\nDavies's previous national mark of 14:41.65 was set last year in Tokyo.\n\nAAP",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/port-augusta-coalition-nuclear-plan-mixed-reaction/105206676",
    "title": "Nuclear power is earmarked for Port Augusta, but reactions are mixed",
    "publish_date": "Sat, 26 Apr 2025 21:47:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "June Lennon had a simple response when asked about the Coalition's plan to bring nuclear power generation to Port Augusta.\n\n\"Never again,\" she said.\n\nThe Yankunytjatjara and Antikirinya elder was four months old when her parents covered her with a tarpaulin to protect her from nuclear weapons testing at Emu Field, in outback South Australia, in 1953.\n\nThe impact on her family was significant.\n\nIn the aftermath they experienced vomiting and seizures, while later on, there were rashes and lasting mental health issues.\n\nJune Lennon was covered by a tarpaulin during nuclear weapons testing at Emu Field in 1953. (ABC News: Brant Cumming)\n\n\"I've experienced … the loss of our family members, who were young when they passed on and should be still with us today,\" she said.\n\nMore than 70 years after the \"black mist\" set in over the Great Victoria Desert, Ms Lennon is steadfastly opposed to the proposal to build a nuclear reactor in Port Augusta.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\n\"Our families lived through it, they didn't like it. Why would anyone else like it?\" she said.\n\n\" It's not worth it — it wasn't worth it back in 1953, and it's definitely not worth it today. \"\n\nA monument marks ground zero at Emu Field. (Supplied: Burrinja Cultural Centre/Rosemary Laing)\n\nTown's roots in power generation\n\nPort Augusta is one of seven locations across the country earmarked to host nuclear power plants if the Coalition wins the federal election.\n\nThe plant would be built on the site of the town's old coal-fired power station, which was decommissioned in 2016 and later demolished.\n\nNearly 200 workers lost their jobs when the plant shut down, and the region looked to a future in renewable power generation — but the results have been mixed.\n\nThe former coal-fired power station was decommissioned in 2016 and later demolished. (ABC News: Brant Cumming)\n\nThe Port Augusta City Council said the community has experienced \"announcement fatigue\" in the years since the plant closed.\n\n\"Despite multiple project announcements for the area following the closure of the former stations, only a few wind and solar projects have come to fruition,\" the council said.\n\nGary Rowbottom, who spent 17 years working as a mechanical technical officer at the plant, joined the push for renewables after he was made redundant.\n\nGary Rowbottom says the Coalition's nuclear plan is not practical. (ABC News: Brant Cumming)\n\nHe said nuclear power would be too expensive, take too long to implement, and would not be a good fit for the electricity grid.\n\n\"I'd like to think that the Port Augusta public will look beyond the superficial jobs aspect and ask themselves: 'Is this what the electricity system really needs? Is this what the long-term health of the planet really needs?'\" he said.\n\nThe Coalition has presented modelling that suggests its nuclear policy would cost more than $300 billion, and said it could have the first reactors working by 2035 — but those claims have been disputed by the government.\n\nPort Augusta is one of seven sites earmarked by the Coalition for nuclear power. (Four Corners: Ryan Sheridan)\n\nEconomic boost a selling point\n\nFor others in Port Augusta, the prospect of more jobs is a more appealing selling point.\n\nSmall business owner Tony Mitchell has ridden the economic highs and lows of recent decades and said nuclear would bring renewal.\n\nTony Mitchell says nuclear power would bring jobs and economic rejuvenation to Port Augusta. (ABC News: Brant Cumming)\n\n\"Trying to keep some of the kids in the region and some of the people that are doing professional development and those sort of higher studies, I think that's sort of the bigger benefit for the town,\" he said.\n\n\" We had the coal-fired power station that employed hundreds … I think this is another transition. \"\n\nBut Mr Mitchell said there was a fear of nuclear among parts of the town, and residents were not fully across the details of the Coalition's plan.\n\n\"It came out of the blue for us,\" he said.\n\nTown, and household, divided\n\nThe nuclear plan has divided Port Augusta since it was announced nearly a year ago.\n\nNeil and Julie Dedman live at Commissariat Point, across the Spencer Gulf from where the plant would be located.\n\nNeil and Julie Dedman have opposing views on the Coalition's plan to build a nuclear reactor in Port Augusta. (ABC News: Brant Cumming)\n\nThey have opposing views on the proposal.\n\n\"I believe it's the way of the future with energy requirements,\" Mr Dedman said.\n\n\"If we want industry, this is the sort of power we need.\"\n\nFor trusted election coverage Photo shows The Words ABC News Daily with the ABC Listen logo beside it. Blue and pale green striped background. Submit your election questions and tune in for a weekly explainer of the latest election news. Listen to ABC News Daily on ABC listen.\n\nBut Ms Dedman said the plant would only bring a significant number of jobs to the region during the construction phase.\n\n\"Then it will be down to minimal staff,\" she said.\n\nShe also feared South Australia would \"end up becoming a dumping ground for the waste\".\n\n\"I can't see Victoria or New South Wales or any other state wanting it in their backyard, it will end up in South Australia,\" she said.\n\nNuclear among a range of issues\n\nOn the streets of Port Augusta, a range of topics are on the minds of voters.\n\nThe influence of the nuclear policy on the outcome of the May 3 poll remains to be seen.\n\nOther election issues raised with ABC News included cost-of-living, housing and crime rates.\n\nSwinging voter Trevor Paynter, another former power station worker, says he supports the nuclear proposal — but it won't sway his vote.\n\n\"I think there's way more pressing issues in the short-term than a nuclear power station in Port Augusta,\" he said.\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/cheap-regional-property-prices-queensland-town-cracow/105040916",
    "title": "Tiny town with properties under $100k keeps home ownership dream alive",
    "publish_date": "Sat, 26 Apr 2025 21:44:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "As property prices continue to skyrocket across most of Australia, there are still pockets of cheap homes in regional communities.\n\nThe small town of Cracow is off the beaten track between Eidsvold and Theodore in the Banana Shire, 500 kilometres north-west of Brisbane.\n\nFour homes sold in the township last year for between $83,000 and $170,000.\n\nMs Newall and her partner enjoy an off-grid lifestyle. (ABC Capricornia: Vanessa Jarrett)\n\nGeraldine Newall moved with her partner to Cracow in 2023, looking for somewhere to settle after travelling in a caravan for the better part of the past two decades.\n\n\"It was just the place I wanted. It's quiet, there's not a lot of people,\" Ms Newall said.\n\nSnatching up the property for under $100,000, it's a stark difference from the city of Rockhampton, three hours away.\n\nRockhampton's median home value in 2024 was $410,000, according to CoreLogic data.\n\nWhile Cracow property prices might be keeping the dream of home ownership alive, it comes with a different kind of cost.\n\nA bit of preparation needed\n\nThe only operational business in the township is the local pub.\n\nAfter years of travelling on the road, Ms Newall can finally have chickens. (ABC Capricornia: Vanessa Jarrett)\n\nThe closest town to buy a bottle of milk and bread is Theodore, 50km down the road, which has a small independent grocery store.\n\nMs Newall said she did top-up shops in Theodore and visited Rockhampton every two to three months.\n\nIt's not too different from when she was caravanning and would travel with a month's supply of food.\n\n\"We're used to that,\" Ms Newall said.\n\nGetting trades out to Cracow can also be a challenge, and it was only when an electrician's van was parked at another resident's house that Ms Newall was able to snag him to return to her place weeks later.\n\n\"When we first came here, we needed an electrician and we'd heard that locals had been trying for two years to get someone to come out here,\" Ms Newall said.\n\nThe couple enjoy the serenity in Cracow. (ABC Capricornia: Vanessa Jarrett)\n\nThe closest doctors are also in Theodore.\n\nBut despite some of the challenges, Ms Newall, like most other locals, isn't swayed to leave any time soon.\n\nPub the heart of town\n\nThe local pub, filled with quintessential country pub relics and memorabilia, puts on events to entertain the small community.\n\n\"We have lots of events throughout the year. We just had a big Australia Day and probably had about 70 people here for the day,\" pub owner Nikki Burke said.\n\n\"A lot of motorbike groups come through during the year and Variety Bash car rallies.\"\n\nThere's also a local park, museum with artefacts from the mine and a short drive away is what locals call \"Cracow Beach\", a sandy area on the banks of the Dawson River out of town.\n\nNikki and Stuart Burke and their children Chilli and Brophy took over the Cracow Hotel in 2021. (ABC Capricornia: Vanessa Jarrett)\n\nMs Burke moved to Cracow in 2002 to work as a barmaid for boxing identity Fred Brophy who had bought the local pub.\n\n\"There were 15 locals and about half a dozen drill rigs with the drillers in town, so it was pretty wild days,\" she said.\n\n\"I think I owned the only registered car in town in those days.\"\n\nCracow is off the beaten track between Theodore and Eidsvold. (ABC Capricornia: Vanessa Jarrett)\n\nAt its peak in the 1930s, the town was once home to an estimated 4,000 people who flocked to the region in the hopes of finding gold.\n\nThe mine was wound down and closed in the 1970s.\n\nIt was reopened in 2004 but has a regimented workforce with a mining camp on the outskirts of town and most workers fly or drive in and out.\n\nThese days, the population is 114, according to the latest Census in 2021.\n\nTownship of Cracow, believed to be taken in the 1940s. (Archives: taken by Arthur Sleep. )\n\nWith rural properties surrounding the town, Ms Burke estimates the actual township is about 50 people.\n\nAccording to the latest real estate listing, there are currently three properties on the market for sale, all under $170,000.\n\nMs Burke said most people moved to the community in search of a peaceful lifestyle.\n\n\"Some people don't mix, they move out here because they like the quiet. Others are really involved in community, but someone will always put up their hand and help you here if you need it,\" she said.\n\nStuart Burke has been renovating the old Cracow Hall. (ABC Capricornia: Vanessa Jarrett)\n\nMs Burke, along with her husband, Stuart, ended up buying the pub off Fred Brophy in 2021.\n\n\"It's quiet, it's peaceful, there's a good community here, we pretty much get left alone most of the time,\" Mr Burke said.\n\n\" We haven't got services, but that's a negative to positive for me anyway. It [the peaceful lifestyle] outweighs it. \"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/a-league-men-auckland-fc-wins-premiership/105220686",
    "title": "Auckland FC wins A-League Men premiership in first season",
    "publish_date": "Sat, 26 Apr 2025 21:19:19 +0000",
    "category": "sports",
    "authors": [],
    "text": "Auckland FC has claimed the A-League Men premiership in its first season after second-placed Melbourne City was held to a 0—0 draw by Adelaide United.\n\nA City victory in Melbourne on Saturday night would have kept pressure on Auckland FC at the top.\n\nInstead, Auckland FC is celebrating claiming the Premiers Plate ahead of hosting Perth Glory at home on Sunday.\n\nThe Black Knights, who are the first New Zealanders to win the premiership, picked up the silverware with two matches to play.\n\nThey sit atop the standings on 50 points, leading City (45), Western Sydney Wanderers (43), Melbourne Victory (42) and Western United (41).\n\nMelbourne City could yet let second place slip and with it an Asian Champions League Elite berth and a week off in the first week of finals.\n\nThe club plays Sydney FC at home next Saturday.\n\nMeanwhile, the scoreless draw on Saturday is a hammer blow to Adelaide United's finals hopes.\n\nThe sixth-placed Reds (38 points) do not play again in the regular season and require Sydney FC (seventh, 37 points) to lose their next two matches.\n\nAAP",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-27/inside-lives-polyamory-ethical-non-monogamy-enm-ethics/105216136",
    "title": "Polyamory is becoming more common, but it can still carry stigma and shame",
    "publish_date": "Sat, 26 Apr 2025 21:14:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Ten years ago, author Rochelle Siemienowicz threw a \"bomb\" into her relationship.\n\nShe was married to David, the father of her child, and loved him dearly.\n\nBut for her, their partnership wasn't \"enough\".\n\n\"I'd had a few affairs that all came out because I decided I wanted to be radically honest,\" Rochelle tells ABC TV's Compass.\n\nIt's a period she now refers to, half-jokingly, as \"the crisis\".\n\n\"I was wracked with guilt and shame… but the thing that sustained me through that period was the knowledge that I was going to live in truth … instead of trying to lead some kind of double life where I had the security and harmony of a partnership, while also having the odd fling outside of that.\"\n\nRochelle had fallen for another man, but she didn't want to break up her marriage.\n\nWas there a way she could continue loving both?\n\nMore than sex\n\nIn recent years, polyamory and open relationships have well and truly entered the cultural Zeitgeist.\n\nWe've seen the ups and downs of these romantic configurations discussed on TV shows like Couples Therapy and in Esther Perel's hit podcast Where Should We Begin?\n\nBut away from therapist couches, polyamory is viewed by many as an experimental phase.\n\nPolyamory and, more broadly, ethical non-monogamy (ENM) is becoming increasingly common among younger generations. ENM is a preference you can set on certain dating apps.\n\nDefinitions: Polyamory: Having consensual romantic or sexual relationships with two or more people at the same time. Ethical non-monogamy or ENM: An umbrella term for any relationship style or structure that includes more than two people, romantically or sexually. All individuals must be informed and consenting. Throuple: A romantic or sexual relationship between three people. Polycule: A group of people who are all connected through polyamorous relationships.\n\nBut this phenomenon isn't new or limited to those under 30.\n\nAnd despite assumptions, polyamory or ENM are about far more than sex.\n\nIt's about consciously designing a way of living and loving that questions societal norms around loyalty and marriage.\n\n\"I think a lot of good relationships end because someone wants to have more sex or romance, or they've met somebody else that they'd like to get to know,\" says Rochelle.\n\n\"And maybe there are other ways of evolving and transitioning a relationship, [rather] than just divorcing and starting the whole thing again with somebody new.\"\n\nRochelle recalls feeling \"guilt and shame\" when she told her husband David (left) she was also in love with another man. (Compass: Daniel Gallagher)\n\nIn Rochelle's case, \"the crisis\" put a huge strain on her marriage.\n\nIn the end, her husband David realised he was comfortable with staying married, and knowing that his wife was entering a relationship with another man.\n\n\"It was tough,\" recalls Rochelle.\n\n\"But I also know that [David] looks at that time now as the best thing that could have happened for our relationship.\n\n\" It was a generative conflict that allowed for us to grow something new in the ruins … a trust that was built around honesty. \"\n\nConfronting jealousy and fear\n\nRochelle's \"nesting partner\" David and her other partner Markus get along well.\n\nWithin a few weeks of \"the crisis\" they'd met and liked each other immediately.\n\nBut this new dynamic still cast drama into the relationship.\n\n\"All three of us would hang out together socially … we'd go to the movies, we'd have dinner, we'd go out for cocktails,\" says Rochelle.\n\n\"Sometimes it would go really well, and sometimes it would be awkward and suddenly a lot of feelings would come up.\n\n\"Anyone who tries non-monogamy for the first time might be surprised by how much drama and emotional turmoil it can involve.\"\n\nRochelle and her partners Markus and David enjoy hanging out as a trio. (Compass: Daniel Gallagher)\n\nSelina Nguyen, a Sydney-based sex and relationship therapist, says non-monogamy is definitely not for the light-hearted.\n\n\"There is a lot of self-reflection, self-growth and self-awareness that goes into it, if you're doing it well, with good intentions,\" she explains.\n\nWithin these relationships, insecurities, fears and feelings of jealousy will invariably arise.\n\n\"It's often a very common story for people … to start to question how important they are to their partner if their partner starts dating or having sex with other people,\" she says.\n\nOpening up doesn't change your worth, she says, but it could change how your partner spends their time.\n\nYet, in a society where monogamy is the norm, it can be difficult to separate sexual or romantic exclusivity from relationship security.\n\nDespite this, Ms Nguyen believes there's value in wrestling with — rather than avoiding — our deepest relationship concerns.\n\nTherapist Selina Nguyen says it can be confronting when couples start questioning monogamy. (Compass: Sissy Reyes)\n\n\"We can place so many rules on our sexual relationships or romantic relationships for the sake of trying to protect ourselves, but also to avoid the sticky feelings of jealousy or insecurity,\" she says.\n\n\"But the reality is they're not necessarily emotions to run away from, they're just emotions.\"\n\nShe views jealousy as somewhat of a canary in a coal mine. It can indicate that you're needing more in your relationship — monogamous or otherwise.\n\n\"It's a time for you to slow down, check in, see what's going on for you and maybe what you're wanting more of in your life, in your relationship, and [then] ideally communicating that to your partner,\" she says.\n\n\"You know, 'Do I need a phone call or a date night at the end of the week to just remind ourselves that we're good and we love each other?'\"\n\nMonogamy: Blessing or burden?\n\nFor some Australians, the notion of polyamory challenges deeply held moral beliefs.\n\nIn many faiths and cultures, sex is viewed as something that should only take place within a marriage.\n\nFor Justine Toh, senior fellow at the Centre for Public Christianity, monogamy also carries significant societal benefit.\n\n\"I think monogamy is really important to lifelong relationships because it creates a protective factor … where you can be at your worst, as well as your best, and know that there is a safe, secure relationship [and] that you don't have to prove yourself constantly,\" she says.\n\nJustine Toh believes there's beauty in knowing your partner will stick by you through good times and bad. (Compass: Kim Akhurst)\n\n\"It's a good that that spills over into the wider community as well, because … you don't have to worry necessarily about your spouse looking at someone else and going, 'I want to be in a relationship with them'.\"\n\nYet, Dr Toh understands that in our modern age — with longer life spans and more opportunities to meet people — lifelong monogamy can feel like a \"burden\" for some.\n\n\"The fact that polyamory is on the table for people, I think, shows the waning effect perhaps of Christian ideas in our world,\" she says. \"Some people will be absolutely happy about that.\"\n\nBut she acknowledges that aspects of ethical non-monogamy — namely the focus on honesty, intentionality and open communication — could have merit in all kinds of relationships.\n\n\"I wonder whether … this is something that the non-polyamorous community can learn from the polyamorous tribe?\" she posits.\n\n\"That they should be more intentional and open and communicative about their needs, wants and desires.\n\n\"I just don't think we need to, I guess, liberalise the marital relationship in order to achieve that. We could work on better communication as is, and that's going to be good for everyone.\"\n\nAn unexpected romance\n\nMelbourne-based dancer and choreographer Joel is all too familiar with the emotional work that goes into polyamorous arrangements.\n\nSeveral years ago, at a Mardi Gras party in Sydney, he met couple Nic and Chris.\n\n\"We danced a little bit, and then three minutes in — I've never done this before or since — I basically just said, 'Do you want to come back to mine at the end of this party?'\" Joel recalls.\n\n\"They kind of looked at each other and were like, 'Yeah, OK.' It was the simplest, easiest pick-up ever.\"\n\nNic, Chris and Joel met on the dance floor at a queer party during Mardi Gras. (Compass: Daniel Gallagher)\n\nBefore meeting Joel, Nic and Chris had been living together in a non-monogamous relationship.\n\nBut none of them expected that a fun night would morph into something far greater: a throuple.\n\n\"It was a romance,\" says Joel. \"With all the things that you expect.\"\n\n\" I remember the moment they bought a king-size bed, I was like, 'That's a major furniture purchase. That's a real commitment to this relationship.' I felt very touched. \"\n\nAfter about a year, the trio realised that they weren't all on the same page.\n\nChris and Joel had fallen for one another, while Nic and Joel realised they were incompatible.\n\n\"Getting into a throuple really challenged a lot of my attachment issues,\" recalls Nic, a writer and advocate.\n\nIntellectually, Nic knew Chris wasn't going to leave him for Joel, there was no real risk.\n\nYet, his body begged to differ. He began feeling physical manifestations of threat: rising temperature, sick in the stomach.\n\n\"It was just like, 'This is a bad thing.'\"\n\nJoel (right) describes Chris as \"the best person on the planet\". (Compass: Daniel Gallagher)\n\nJoel was also acutely aware of this change.\n\n\"I still have enormous affection for Nic … that's never wavered, but the romantic sexual thing kind of waned,\" he says.\n\n\"I didn't know how to parlay that into a friendship when I was also falling in love with his life partner [Chris].\n\n\"I thought I had to break-up with both of them.\"\n\nConsciously unthroupling\n\nChris was floored by the break-up.\n\n\"I [was] this hopeless, romantic, optimistic in the middle,\" recalls the Melbourne-based psychologist.\n\n\"I was hoping that Nic would just fall for Joel like I did … and it would all be okay. I was maybe in denial.\"\n\nGrieving the relationship, Joel confided in friends who had experience in polyamory. They told him there might be another option: could he break up with Nic, but stay together with Chris?\n\nThe trio talked things through. It became clear that Chris and Joel wanted to get back together, even though this was a pain point for Nic.\n\n\"[I told them,] 'I'm not exactly over the moon about it, but I also don't want to stand in your way,'\" Nic recalls.\n\nDeep down, he knew that if he put his foot down — barred the relationship — a seed of resentment could begin to grow in his own partnership with Chris.\n\n\"I knew that would essentially have a poisoning effect on [my] relationship,\" Nic says.\n\n\"And I knew it wasn't an actual threat to [my] relationship, just to my ego … or the soul.\"\n\nNic says polyamory helped him to process and accept his insecurities. ((Supplied))\n\nFor Chris, his reunion with Joel was bittersweet.\n\n\"I was doing something that was making Nic hurt and putting him in this pain,\" says Chris.\n\n\"What saved us, I guess, was this belief [Nic and I] always had in our relationship that we wanted to be together forever.\n\n\"Even in the worst fights and the worst conflict, we always said at the core of this was this idea that we knew we would be stronger if we could get through this.\"\n\nDespite the turmoil Nic experienced, he's now grateful for the throupling and unthroupling of it all.\n\n\"I have to be careful, because I'll be like, 'Yes, it was very hard on me … people should be in awe of my strength,'\" Nic laughs.\n\n\"But on the flip side of that, the experience of going through poly and opening up the relationship beyond consensual non-monogamy to a space where can fall in love with others … it's been such a gift.\n\n\"That really difficult process has actually improved my friendships, and my relationships with family members.\n\n\"Since that time I've also fallen in love with other people and had them join the 'polycule' so to speak.\"\n\n'The most extraordinary gift'\n\nChris, Nic and Joel have managed to talk and work through all of the complicated, messy and uncomfortable feelings that can arise in a polyamorous arrangement, like theirs.\n\nThey now pride themselves as being Naarm's \"most successful polycule\" and hope, one day, to live together in the country.\n\n\"Three old queens in a cottage,\" Joel quips.\n\nFor Joel, polyamory has never felt like a precarious way to love.\n\n\"I think a lot of people would be surprised to know that you can get that sense of safety and sense of belonging from a polyamorous relationship,\" he says.\n\n\"For me, [it's] this authentic way that we're supposed to be living, which is in broader extended family groups. I think of Nic, Chris and I as a queer family.\"\n\nChris (middle) says his relationships with Joel and Nic are different, but \"equal in terms of the love\". (Compass: Daniel Gallagher)\n\nWearing his psychologist hat, Chris points out that questioning traditional norms can be incredibly liberating.\n\n\"When you start questioning monogamy, these relationship structures, this way you thought you had to live … you then really start questioning everything,\" he says.\n\n\"You really get left with this complete freedom of not only, 'What do I want my relationship to look like?' but 'What do I want my life to look like?'\"\n\nChris — who recently married Nic and is still happily in a relationship with Joel — believes love is limitless.\n\nAnd for his life partner, and now husband, Nic, the ups and downs of polyamory have ultimately been worth it.\n\n\"Along this whole journey, [my] loyalty to that shared adventure through life [with Chris] has never wavered, even as we've redefined things,\" he says.\n\n\"I am so loyal to that shared life with him, and that now extends to a shared life with this wonderful person [Joel], who's a dear friend and a non-romantic, but deep lover as well.\n\n\"It's the most extraordinary gift.\"\n\nWatch Beyond Monogamy on Compass on tonight at 6:30pm on ABC TV, or stream now on iview.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/experienced-coach-backed-for-bears-job-20250427-p5luj9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Experienced' coach backed for Bears job",
    "publish_date": "Sun, 27 Apr 2025 11:59:47 +1000",
    "category": "sports",
    "authors": [],
    "text": "'Experienced' coach backed for Bears job\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/lifestyle/mothers-day-gift-ideas-for-2025-20250427-p5luj8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mother's Day gift ideas for 2025",
    "publish_date": "Sun, 27 Apr 2025 11:56:20 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Mother's Day gift ideas for 2025\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/basketball/buzzer-beater-ignites-nba-playoffs-20250427-p5luj5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Buzzer-beater ignites NBA playoffs",
    "publish_date": "Sun, 27 Apr 2025 11:29:01 +1000",
    "category": "sports",
    "authors": [],
    "text": "Buzzer-beater ignites NBA playoffs\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/politics/federal/federal-election-2025-live-updates-pm-to-spruik-204m-around-the-clock-medicare-hotline-dutton-s-better-budget-pledge-to-rely-on-cuts-20250426-p5lufj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Federal election 2025 LIVE updates: PM to spruik $204m around-the-clock Medicare hotline; Dutton’s better budget pledge to rely on cuts",
    "publish_date": "Sun, 27 Apr 2025 11:21:08 +1000",
    "category": "finance",
    "authors": [
      "Olivia Ireland"
    ],
    "text": "The biggest cheers at this morning’s Labor rally in Parramatta have been for Medicare. Many in the 300-person crowd wave Labor-branded “Albo” placards during the leaders’ speeches. But just as many here today are waving green and gold posters that say “more bulk-billing”, complete with the Medicare logo. It is another indication of how strongly Labor is seeking to tie its brand to Medicare at this year’s election.\n\nAlbanese whips out his Medicare card again. Credit: Alex Ellinghausen\n\nAlbanese, once again, whips out his own Medicare card – a near-daily campaign stunt at this point. “The fact that this card is green and gold is no accident. We take pride in it as Australians, just as we take pride in that other great Labor reform, the Pharmaceutical Benefits Scheme ... A vote for Labor is a vote for Medicare,” Albanese says.\n\n“Today, we add to the strengthening Medicare agenda. A re-elected Labor government will make free, urgent care available to all Australians, in every community, with the launch of 1800 MEDICARE. A 24/7 health advice line and after-hours GP telehealth service, backed by Medicare.\n\n“You’ll be able to call any time to get expert health advice from a registered nurse. If it’s something that can’t wait for your regular GP, you’ll be connected to a free GP telehealth consultation. Life isn’t 9 to 5. With 1800 MEDICARE, neither is healthcare.”",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/djoker-loses-in-straight-sets-20250427-p5luiq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Djoker loses in straight sets",
    "publish_date": "Sun, 27 Apr 2025 10:43:20 +1000",
    "category": "finance",
    "authors": [],
    "text": "Djoker loses in straight sets\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/nfl/nfl-s-love-affair-with-australian-punters-continues-with-jeremy-crawshaw-drafted-by-denver-broncos-20250427-p5luij.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NFL’s love affair with Australian punters continues with Jeremy Crawshaw drafted by Denver Broncos",
    "publish_date": "Sun, 27 Apr 2025 09:58:37 +1000",
    "category": "sports",
    "authors": [],
    "text": "Jeremy Crawshaw is set to join the ranks of Australian punters in the NFL after being drafted by the Denver Broncos.\n\nThe 23-year-old from Emu Plains in Sydney’s west was the first punter taken in the draft – going in the sixth round with pick No.216 – after being widely considered the best on offer following his five seasons with the University of Florida.\n\nJeremy Crawshaw in action for the Florida Gators. Credit: Icon Sportswire via Getty Images\n\nHe averaged 45.8 yards for the Gators in 2024, with 25 punts downed inside the 20-yard line. In the 2023 season, he set the single-season Gators record for punt average at 48.9 yards.\n\nCrawshaw is set to compete with veteran punter Matt Haack for the Broncos’ starting job. Haack signed a one-year, $US1.255 million ($1.96 million) contract with the club in March.",
    "source": "SMH",
    "cluster_id": 6
  },
  {
    "url": "https://www.smh.com.au/lifestyle/popular-kids-show-sparks-parent-screen-time-debate-20250427-p5lui4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Popular kids show sparks parent screen-time debate",
    "publish_date": "Sun, 27 Apr 2025 09:30:12 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Popular kids show sparks parent screen-time debate\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/fans-storm-field-as-wrexham-secure-third-straight-promotion-20250427-p5lui0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fans storm field as Wrexham secure third-straight promotion",
    "publish_date": "Sun, 27 Apr 2025 09:23:04 +1000",
    "category": "sports",
    "authors": [],
    "text": "Fans storm field as Wrexham secure third-straight promotion\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/wrexham-one-step-from-premier-league-as-hollywood-story-continues-20250427-p5luhr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wrexham one step from Premier League as Hollywood story continues",
    "publish_date": "Sun, 27 Apr 2025 09:03:14 +1000",
    "category": "sports",
    "authors": [],
    "text": "Canadian actor Ryan Reynolds said it felt like an “impossible dream” when he floated the idea of buying soccer club Wrexham to fellow Hollywood A-lister Rob McElhenney. He had an idea for a documentary. The ultimate goal was reaching the Premier League.\n\nFour years after they purchased the north Wales outfit, Wrexham are one league away from achieving their lofty goal after a 3-0 win over Charlton Athletic on Saturday saw them promoted for a record third consecutive time.\n\n“It just seemed like an impossible dream, and we do what we’re lucky to do is be storytellers,” Reynolds, best known for his role as superhero character Deadpool, told Sky Sports after the game.\n\n“And when you’re a storyteller, you look as much as you can at the sort of macro view of this history.",
    "source": "SMH",
    "cluster_id": 10
  },
  {
    "url": "https://www.smh.com.au/national/maxwell-fails-to-fire-again-20250427-p5luhu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Maxwell fails to fire again",
    "publish_date": "Sun, 27 Apr 2025 08:58:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "Maxwell fails to fire again\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/lifestyle/princess-lilibet-features-in-meghans-new-video-20250427-p5luhq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Princess Lilibet features in Meghan's new video",
    "publish_date": "Sun, 27 Apr 2025 08:38:48 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Princess Lilibet features in Meghan's new video\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/environment/weather/national-weather-forecast-for-sunday-april-27-20250427-p5luhh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "National weather forecast for Sunday April 27",
    "publish_date": "Sun, 27 Apr 2025 07:30:22 +1000",
    "category": "finance",
    "authors": [],
    "text": "National weather forecast for Sunday April 27\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/world/pope-s-coffin-arrives-at-final-resting-place-in-santa-maria-maggiore-20250427-p5luhf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pope’s coffin arrives at final resting place in Santa Maria Maggiore",
    "publish_date": "Sun, 27 Apr 2025 07:27:25 +1000",
    "category": "finance",
    "authors": [],
    "text": "Pope’s coffin arrives at final resting place in Santa Maria Maggiore\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-greens-could-hold-the-balance-of-power-in-parliament-so-what-do-they-stand-for/5bqp9f5wi",
    "title": "The Greens could hold the balance of power in parliament. So what do they stand for?",
    "publish_date": "Sun, 27 Apr 2025 01:04:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "In just three decades, the Greens have transformed from what was essentially an environmental protest movement to Australia's third largest party by vote.\n\n\n\n\n\nAt the 2022 election, the federal Australian Greens secured 12.2 per cent of the primary vote — an almost 2 per cent increase from the party's primary vote in 2019.\n\n\n\n\n\nThe Greens are looking to achieve even greater success on 3 May , capitalising on the bloc of generally more progressive Gen Z and millennial voters, who outnumber baby boomers for the first time this election.\n\n\n\n\n\nAs thousands flock to pre-polling centres, Greens leader Adam Bandt says the party is feeling confident.\n\n\n\n\n\n\"We're getting a terrific response on the doors, the streets and the polling booths to our plan to get dental and mental health into Medicare, finally tackle the housing and rental crisis, make child care free, and stop opening up new coal and gas mines in the middle of a climate crisis,\" the member for Melbourne says.\n\n\n\nWhat are the Greens' main policies?\n\nProfessor Rodney Smith from the University of Sydney says the Greens have been able to position themselves quite successfully as an alternative for disenchanted Labor voters who are looking for a more solid, leftist, or progressive policy package.\n\n\n\n\n\nKey promises from the Greens include:\n\n\n\nCancelling all student HECS debt;\n\nExpanding Medicare to cover dental;\n\nBanning new coal and gas projects; and\n\nIntroducing higher taxes on billionaires and big corporations.\n\nGreens leader Adam Bandt outside Melbourne's Luna Park earlier this month. The Greens have long campaigned for dental treatment to be covered by Medicare. Source: AAP / Nadir Kinani On the campaign trail, the party has also pledged to make HIV prevention medications PrEP and PEP free — a policy announced on the adult social media site OnlyFans , in a headline-grabbing move by Brisbane MP Stephen Bates.\n\n\n\n\n\nThey've also unveiled a national plan to provide free school meals.\n\n\n\n\n\nBut Greens MP Max Chandler-Mather, the party's housing and homelessness spokesperson, says housing is the \"defining issue\" of the election.\n\n\n\n\n\nThe party has put forward its own measures to tackle the housing crisis, including discounted mortgage rates and capping rents.\n\n\n\n\n\nIt will also scrap negative gearing and the capital gains tax discount for investors with more than one property.\n\n\n\n(From left) Ryan MP Elizabeth Watson-Brown, Greens leader Adam Bandt, Griffith MP Max Chandler-Mather and Brisbane MP Stephen Bates. Source: SBS News \"There's certainly a lot of people voting Greens for the first time in their lives because we're the only party with policies to make housing affordable,\" Mather says.\n\n\n\n\n\nMany voters have also voiced frustration with the major parties' handling of international issues, particularly the conflict in Gaza.\n\n\n\n\n\nThe Greens have taken a firm stance, pledging to continue calling for an end to the occupation of Palestinian territories and urging Israel to halt what they describe as an ongoing genocide in Gaza, a description backed by several prominent international organisations but repeatedly denied by Israel .\n\n\n\nHow powerful are the Greens?\n\nJill Sheppard, a professor of Australian Politics at the Australian National University, says the Greens' popularity in the Senate is particularly important.\n\n\n\n\n\nAs the Greens can't form government on their own, their policies are more an indication of how party members may vote on legislation, she says, and the number of seats they secure will determine how much power they'll wield over legislation in the upper house.\n\n\n\n\n\n\"Although we focus on the House of Representatives, particularly around an election because that's where government is won and lost, the Senate is still really important for passing legislation after the election,\" Sheppard says.\n\n\n\n\n\n\"There, the Greens have held the balance of power for quite a while. They are very experienced Senate negotiators, and so even if they are sidelined in some kind of independent-Labor minority government, they will still be strong in the upper house.\"\n\n\n\nPolls suggest the Greens are likely to retain the five Senate seats they are contesting in this election, meaning it's likely the party will retain its powerful 11-seat upper house voting bloc.\n\n\n\n\n\nIn the House of Representatives, Prime Minister Anthony Albanese has insisted he won't do a deal with the Greens to form government if Labor fails to win a majority.\n\n\n\n\n\nThe Coalition has frequently raised the prospect of a Labor-Greens alliance as a point of concern for voters, pointing out that the Greens and Labor usually recommend that voters put the other party in the second position on how-to-vote cards.\n\n\n\n\n\nSheppard says that, if Labor falls short of the 76 seats it needs for a majority, it will likely first look to independents to form government.\n\n\n\n\"They probably feel like they can work with [Independents] more easily ... without offering the Greens a spot in cabinet, which would be about the worst-case scenario for the ALP,\" Sheppard says.\n\n\n\n\n\n\"The major parties want you to think that a hung parliament is bad because they desperately want majority government for themselves. But a hung parliament isn't bad.\n\n\n\n\n\n\"We saw between 2010 and 2013 a minority government last the full term quite successfully.\"\n\n\n\n\n\nBandt has said that seeking a ministerial position would not be a priority for the party in the event of a hung parliament.\n\n\n\nThe Greens' relationship with Labor\n\nThe relationship between the Greens and Labor has also been fraught with tension, with both parties fighting to capture votes on the left side of politics.\n\n\n\n\n\n\"At the national level, the relationship between the Greens and Labor has never been a particularly happy one,\" Smith says.\n\n\n\n\n\n\"Initially, it was because there was a tension between Labor's union base and many of the environmental concerns and policies of the Greens.\n\n\n\n\n\n\"More recently, it's had to do with that trend of left voters moving their support away from the Labor Party to the Greens, and the Greens using their position to pressure Labor to shift its legislative agenda in a more progressive direction.\"\n\n\n\n'They didn't see us coming'\n\nThe Greens are defending their record number of lower house seats, three of which turned Green for the first time at the last election, shocking both major parties.\n\n\n\n\n\nAll three were inner-city Brisbane electorates. Griffith was won from Labor, while Brisbane and Ryan flipped from the Liberal National Party.\n\n\n\n\n\nRyan, once considered a rock-solid Liberal seat, is now a key battleground the Coalition is determined to reclaim.\n\n\n\n\n\n\"The LNP thinks they own that seat. I ousted them in 2022. They didn't see us coming then. They are certainly seeing us coming now,” Greens member for Ryan Elizabeth Watson-Brown says.\n\n\n\nLISTEN TO Climate Wars (Revisited): Party Time Ep 3 SBS News 17/04/2025 26:41 Play\n\nWatson-Brown says she's faced verbal abuse and her signs have been vandalised throughout her campaign.\n\n\n\n\n\nShe blamed far-right groups who \"want to oust [her] from the seat\" and said she's also concerned about the misinformation and disinformation that's being spread about her.\n\n\n\nGreens eyeing more seats\n\nThis year, the Greens are hopeful of picking up another Queensland seat — Moreton — located in Brisbane's south.\n\n\n\n\n\nMoreton's long-standing Labor MP Graham Perrett has held the seat since 2007 but is now retiring.\n\n\n\n\n\nGreens candidate Remah Naji, a tertiary education worker and mother-of-two, says people have told her they are fed up with the two major parties.\n\n\n\n\n\n\"They want action on the cost of living , groceries, childcare costs, rent increases, and mortgage stress,\" she said.\n\n\n\n\n\n\"People have told me that they're ready for change.\"\n\n\n\nGreens candidate Remah Naji says she's expecting a swing toward the party in the electorate where she's running. Source: SBS News Naji, who is the daughter of Palestinian refugees and grew up in Jordan before moving to Australia 12 years ago, also points to the Palestinian territories being a key issue, especially among the 7,000 Muslim voters in the electorate.\n\n\n\n\n\n\"They're traditionally Labor voters and they're switching to the Greens,\" she said.\n\n\n\n\n\nElsewhere in the country, the Greens have their eyes on five other electorates.\n\n\n\n\n\nThey are the safe Labor seats of Wills and Macnamara in Victoria, as well as Richmond in NSW and Perth in WA.\n\n\n\n\n\nAlso in their sights is the marginal Liberal seat of Sturt, South Australia.\n\n\n\nSheppard says the Greens are targeting seats with specific voter demographics, seeking to emulate their success in 2022.\n\n\n\n\n\nShe points to the Greens success in the seat of Ryan.\n\n\n\n\n\n\"Ryan has a really nice mix for the Greens of university students who are frustrated about job security, housing security, and concerned about the environment,\" she says.\n\n\n\n\n\n\"[It also has] wealthier people who are a little bit older, who have job security, quite a lot of wealth — and they are worried about the kinds of issues that affect their grandchildren, like access to education, health and climate change.\n\n\n\n\n\n\"It's that concentration of wealthy boomers and Gen X voters, alongside university students, that makes Ryan so perfect.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-shadow-foreign-affairs-spokesman-david-coleman/x1kyy27du",
    "title": "INTERVIEW: Coalition foreign affairs spokesman David Coleman",
    "publish_date": "Sat, 26 Apr 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-migrants-have-become-scapegoats-feccas-peter-doukas-voices-election-concerns/u36zmmrn0",
    "title": "INTERVIEW: 'Migrants have become scapegoats': FECCA's Peter Doukas voices election concerns",
    "publish_date": "Sat, 26 Apr 2025 21:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/morning-news-bulletin-27-april-2025/fwprd9tm7",
    "title": "Morning News Bulletin 27 April 2025",
    "publish_date": "Sat, 26 Apr 2025 20:30:57 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nHundreds of thousands of mourners join world leaders for Pope Francis' funeral\n\nLabor pledges a free Medicare telehealth service\n\nTyler Wright will take on Isabella Nichols in an all-Australian women's semi-final at the Rip Curl Pro\n\nLeaders from around the world have joined crowds of the faithful to pay their last respects during the funeral of Pope Francis.\n\n\n\n\n\nAccording to the Vatican, some 250,000 mourners filled the Vatican to watch the ceremony.\n\n\n\n\n\nA further 150,000 lined the motorcade route through downtown Rome to witness the first funeral procession for a pope in a century.\n\n\n\n\n\nThese two people were among them.\n\n\n\n\n\nVoxie 1: \"We’re very sad for Papa Francesco, and I think he did his best, but I would have liked to see more women in the church. Maybe they will come next time.\"\n\n\n\n\n\nVoxie 2: \"We're not personally religious. However, we came here to obviously see the Pope go past. It is quite upsetting, obviously, because he’s someone you see on the news, you see him on media all the time. So, yes, it's quite an emotional thing and it's amazing to see everyone come out, everyone clapping as he goes past.\"\n\n\n\n\n\nLasting just 90 minutes, Pope Francis' funeral was significantly shorter than Pope St John Paul II's in 2005, which lasted three hours.\n\n\n\n\n\nBreaking with tradition even further, Pope Francis has elected to be the first pope buried outside of the Vatican in over a century.\n\n\n\n\n\n**\n\n\n\n\n\nPrime Minister Anthony Albanese has paid his respects, as millions of people around the world tuned in to watch the funeral of Pope Francis.\n\n\n\n\n\nIssuing a statement, Mr Albanese says Pope Francis will be remembered as someone whose compassion embraced all humanity.\n\n\n\n\n\nAustralia's highest-ranking Catholic official, Melbourne-based cardinal Mykola Bychok, says Pope Francis led the church with love.\n\n\n\n\n\n\"He was a pope of mercy, not just in word but in action. He reached out to the poor, the excluded, the wounded. He taught us not to judge but to accompany. He reminded us again and again, that no one is beyond the reach of God's love.\"\n\n\n\n\n\nThe Catholic Church now begins nine days of official mourning for Francis.\n\n\n\n\n\nAfter the mourning, cardinals aged under 80 will elect a new pope.\n\n\n\n\n\n**\n\n\n\n\n\nUkrainian President Volodymyr Zelenskyy has met US President Donald Trump in their first face-to-face meeting since their Oval Office clash in February.\n\n\n\n\n\nBoth leaders met ahead of Pope Francis' funeral.\n\n\n\n\n\nIn a post on social media, following the meeting, Mr Trump says he now holds doubts that a peace deal can be finalised soon, saying things are complicated by Russia's actions over the last few days in shooting missiles into civilian areas.\n\n\n\n\n\nThe comments contrast with his earlier remarks to reporters about the outcome of a meeting between special envoy Steve Witkoff and Vladimir Putin.\n\n\n\n\n\nReporter: \"What do you hope Steve Witkoff will get out of his meeting with Putin today?\"\n\n\n\n\n\nDonald Trump: \"He'll be calling me. They just left the meeting. I haven't been briefed yet. But he had, I heard he had a pretty good meeting.\"\n\n\n\n\n\n**\n\n\n\n\n\nA re-elected Labor government would launch a free after-hours access to government-funded telehealth services.\n\n\n\n\n\nWith only a week to go before election day on the 3rd of May, the Prime Minister is set to formally announce today, that the plan for a 24-hour '1800MEDICARE’ service would involve committing $204.5 million over four years, to revamp the existing Healthdirect service, which is operated in conjunction with the states and territories.\n\n\n\n\n\nLabor says - as part of the pledge - the plan would be in place by the 1st of January 2026, and would ensure patients requiring urgent care between 6pm and 8am on weeknights or during weekends - had access to a bulk-billed consultation, with an after-hours GP via phone or video.\n\n\n\n\n\nMeanwhile, Opposition leader Peter Dutton will begin the final week of the election campaign in Melbourne.\n\n\n\n\n\nThe Coalition has signalled its aim to visit 28 seats before polls close on election day.\n\n\n\n\n\n**\n\n\n\n\n\nIran's Interior Minister, Eskandar Momeni, says an explosion at the country's largest commercial port has killed at least eight people and injured more than 750 others.\n\n\n\n\n\nHossein Zafari, spokesman for Iran’s crisis management organisation, blamed poor storage of chemicals at Shahid Rajaee port, saying prior warnings had been issued about potential dangers.\n\n\n\n\n\nA government spokesperson confirmed chemicals likely triggered the blast, but says the exact cause is still under investigation.\n\n\n\n\n\nVideo footage broadcast by state media showed thick black and orange smoke billowing from the port, and severe damage to nearby offices.\n\n\n\n\n\nShahid Rajaee is Iran’s largest container hub, handling the majority of the country's container traffic.\n\n\n\n\n\n**\n\n\n\n\n\nTo surfing now, two-time world champion Tyler Wright will take on Isabella Nichols in an all-Australian women's semi-final in the Rip Curl Pro at Bells Beach.\n\n\n\n\n\nWright edged past Bettylou Sakura Johnson in the last of four women's quarter-finals on Saturday.\n\n\n\n\n\nThe Hawaiian young gun had the highest-scoring single wave of the heat, 7.73-points, but 31-year-old Wright advanced with a winning heat total.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/young-voters-hold-the-power-this-election-these-are-the-people-they-listen-to/ep24rc8m9",
    "title": "'Self obsessed': Can influencers be trusted to inform Australians about the election?",
    "publish_date": "Sat, 26 Apr 2025 20:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Influencers were once confined to the squares on our social media pages and not considered serious players in the media industry, but as their power grows — so does their range.\n\n\n\n\n\nOnce associated with fashion, makeup and lighthearted lifestyle videos, Australians are also increasingly turning to them for their views on more serious issues.\n\n\n\n\n\nIt's a trend that politicians have also noticed. This year, for the first time, some influencers were flown to Canberra to cover the federal budget — an event that is typically the domain of political journalists and finance experts.\n\n\n\n\n\nCoverage of the budget was transformed at the hands of content creators like mental health advocate Milly Rose Bannister, Cheek media co-founder Hannah Ferguson and podcast host Daphne Berry.\n\n\n\nREAD MORE Influencers respond after revelations Labor paid for federal budget travel for some\n\nRather than writing articles about the budget, they posted TikTok videos and Instagram reels, and shared information with their followers via Instagram stories.\n\n\n\n\n\nIn the lead up to the election , many are encouraging their followers to engage with politics and policy — and it's working.\n\n\n\n\n\nBrisbane woman Emina is 29 years old and has never been interested in politics, but after following influencer and podcast host Abbie Chatfield, she was motivated to update her voting details and keep up to date with this year's election.\n\n\n\n\n\nChatfield first gained a public profile after appearing on TV show The Bachelor and is now a podcast host and media personality.\n\n\n\nAbbie Chatfield was once a contestant on The Bachelor, but is now a podcast host and media personality. Source: AAP / Darren England In the lead-up to the election, Chatfield has interviewed Prime Minister Anthony Albanese and Greens leader Adam Bandt, hosted a DJ event with Bandt and the Greens, and made regular posts about the election and policies.\n\n\n\n\n\n\"I've followed Abby since she was on The Bachelor, and she's always been really opinionated and I love her for that,\" Emina said.\n\n\n\n\n\n\"I've always found her to be making it engaging and bringing to the surface the things that are often not spoken about enough.\"\n\n\n\nREAD MORE A former Triple J host is hoping his Uber 'side-hustle' will help him unseat a Liberal MP\n\nEmina said she believes influencers speaking about politics can be empowering and educational for their followers.\n\n\n\n\n\nWhile Chatfield has openly said she personally supports the Greens, Emina said she hasn't felt pressured to vote the same way.\n\n\n\n\n\n\"I haven't found Abbie to be forceful to tell me who to vote for, so that's also something that I've really respected … her message has been one of empowerment,\" she said.\n\n\n\nIt's a 'responsibility' to be part of the conversation\n\nFor Holly Rankin, who also performs as a singer-songwriter and recording artist under the name Jack River, pop culture and policy have always been linked.\n\n\n\n\n\nAlongside her professional music career, Rankin has been involved in campaigns and activism for years. She is also the co-founder of Sentiment, a strategic communications and creative agency that aims to bridge the gap between politics and pop culture.\n\n\n\n\n\nRankin believes online content creators are often not taken seriously by older generations or traditional media and argues the term 'influencer' can be used to denigrate or dismiss their work and advocacy.\n\n\n\n\n\n\"At the end of the day, they're likely very good communicators who are passionate about something and they've grown an online community who have shared values with them,\" she said.\n\n\n\nSinger Jack River, whose real name is Holly Rankin, supports musicians and content creators who speak about politics and policy. Source: Supplied This election, Rankin believes young voters and social media are becoming more powerful.\n\n\n\n\n\nAccording to a 2024 report from the Australian Communications and Media Authority, 46 per cent of 18 to 24-year-olds nominated social media as their main source of news, and 31 per cent said celebrities and influencers were sources of their news content.\n\n\n\n\n\n\"The voting electorate is younger, and I think the world is in a really kind of frightening spot for a lot of younger people, so it's inspiring them to lean into politics,\" she said.\n\n\n\n\n\n\"Content creators are seeing not even an opportunity, more like a responsibility, to jump in and be part of the conversation.\"\n\n\n\n\n\nWith the election predicted to be close, Rankin said young voters could be the people who decide the results, particularly in marginal seats.\n\n\n\n\n\n\"So it's really important that they get good information and that they engage and also just learn about civics and politics,\" she said.\n\n\n\n\n\n\"If they're not getting it [from] politicians themselves, if they're not reading the news, how else are they going to get this information?\"\n\n\n\nREAD MORE From OnlyFans to Fortnite, politicians are exploring new avenues for attention in 2025\n\nYouth vote is transforming the election campaign\n\nWith millennials and gen Z voters now outnumbering baby boomers on the electoral roll, appealing to younger voters is becoming increasingly important to political parties.\n\n\n\n\n\nAccording to the Australian Electoral Commission (AEC), there are 1,831,800 voters aged 18 to 24 enrolled for the 2025 election.\n\n\n\n\n\nThe youth enrolment rate, which tracks eligible voters in this age group, is sitting at 92 per cent.\n\n\n\n\n\nDr Susan Grantham, a lecturer in communication at Griffith University, believes social media has become \"absolutely essential\" in politics.\n\n\n\n\n\nOn platforms like Instagram and TikTok, Grantham said influencers have a \"stronger hold over the audience\" and may have more sway than posts made by candidates or political parties, which politicians are starting to realise.\n\n\n\n\n\n\"There's always been influencers out there that have been politically aligned and have promoted politics during election campaigns previously,\" she said.\n\n\n\n\n\nBut she said this election, political parties and leaders were now doing joint posts and podcasts with influencers.\n\n\n\n\n\n\"That's going to be highly influential and far more influential than what we would expect from a politician directly,\" Grantham said.\n\n\n\nDr Susan Grantham says social media has become an essential tool in political campaigns. Source: Supplied / Susan Grantham Hannah Ferguson, founder and CEO of news commentary platform Cheek Media, told SBS News she believes political parties are beginning to recognise the power of social media and podcasts in driving change.\n\n\n\n\n\n\"A lot of influencers — and I say 'influencer' but content creators and new media — have really powerful engagement with their audience who may not know that much about politics,\" she said.\n\n\n\n\n\n\"Our ability to communicate directly with our audiences about the issues that matter to them is far more engaged and far more relevant than large parts of legacy media.\"\n\n\n\n'Demand' for influencers to have political opinions — and to talk about them\n\nFerguson also believes young audiences have an increased expectation that influencers or people with public profiles should be engaged in politics and social issues.\n\n\n\n\n\nShe said there is now a \"newfound interest and demand\" for content creators to make their values clear, with many viewers preferring to \"invest time and trust into the people that they see as resonating with them\".\n\n\n\n\n\n\"We expect the people that we look up to, the celebrities, the influencers, the people with public presences — to have political opinions and to talk about these things because we are very much a values-driven generation,\" she said.\n\n\n\n\n\n\"And we are the most powerful voting bloc in Australia in the lead up to the federal election.\"\n\n\n\nDaphne Berry is the host of Airing Your Dirty Laundry. Source: SBS News Fellow content creator Daphne Berry said she believes many young voters turn to new media platforms for more relatable discussions about politics.\n\n\n\n\n\nBerry, who hosts the music podcast Airing Your Dirty Laundry, told SBS News her platform is \"about learning\".\n\n\n\n\n\n\"I'm completely out of my depth in a lot of ways, but [I try] to come in and really learn and really listen to people who perhaps know a bit more than I do and ask questions,\" she said.\n\n\n\n\n\n\"[I then] explain it to people who ... don't fully understand what's going on in the country.\"\n\n\n\nCriticism of influencers and AEC investigation\n\nNot everyone is on board with new media and influencers becoming involved in politics\n\n\n\n\n\nWhen content creators were invited to the federal Budget lockup in March, critics labelled the influencers as \"self-obsessed\" and questioned whether they were paid to attend.\n\n\n\n\n\nClips of Chatfield's interviews with Bandt and Albanese were reviewed by the AEC after Liberal senator Jane Hume questioned if they had breached electoral rules by not including an authorisation statement.\n\n\n\nThe posts were cleared of breaching any laws, with the AEC finding no evidence the podcaster had been paid for any political posts, or that Albanese or Bandt had any creative control in the interviews.\n\n\n\n\n\nIn a post on Instagram, Chatfield accused the Liberal Party of trying to discredit influencers speaking on politics.\n\n\n\n\n\n\"I'm all for the AEC making sure that everything goes by regulations [so] that we have safe and fair elections,\" she said.\n\n\n\n\n\n\"But the reality is there was no reason to question the integrity of my posts because I repeatedly stated publicly that I was not paid.\"\n\n\n\n\n\nChatfield said she believed the Liberal Party was trying to \"minimise the impact of influencers and new media\" and discourage content creators from speaking about politics.\n\n\n\n\n\nAccording to Grantham, new media and influencers largely play a positive role in politics and education, but she acknowledged it is a \"tricky space\".\n\n\n\n\n\n\"We have to be careful that we don't let the traditional news media die; it still has a very solid place in politics,\" she said.\n\n\n\n\n\n\"What we do see is influencers taking on a similar role, and some of them are doing that very, very well, but they don't have to work to the same ethical codes or media law that go along with this sort of public commentary.\"\n\n\n\nWhile many content creators produce educational content, they do not have the same obligations that journalists do in terms of fact-checking and impartiality. This can allow misinformation, disinformation, or biased content to spread online .\n\n\n\n\n\nGrantham believes young people need to be taught how to question what they see and to think critically about social media and political commentary.\n\n\n\n\n\n\"But until we as a society are really good at doing that, there's obviously always going to be potential negatives,\" she said.\n\n\n\n\n\nIn a time of climate crisis, conflict, and global uncertainty, Rankin believes young voters and social media can ultimately play a part in creating a better future.\n\n\n\n\n\n\"I feel critically concerned [about the future], but I know we can write a new story.\n\n\n\n\n\n\"I feel optimistic, but there is a lot of work to do.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/coalition-attacks-labor-over-apparent-illegal-maritime-arrival-on-northern-coastline/gsbdqu4xx",
    "title": "Coalition attacks Labor over 'apparent illegal maritime arrival' on northern coastline",
    "publish_date": "Sat, 26 Apr 2025 09:09:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Coalition has seized on a video apparently showing a group of men stranded on a northern Australian beach, arguing that it's evidence of a Labor failure on border security.\n\n\n\n\n\nThe footage was filmed by a helicopter business in Northern Australia and posted via its Facebook account.\n\n\n\n\n\nSBS has confirmed with one of the company's pilots that his colleagues encountered a group of men, who they believed to be unauthorised maritime arrivals, on 24 April.\n\n\n\n\n\nThe men had scrawled an SOS message in the sand and did not speak English, the company said, adding that its employees had called Border Force to respond.\n\n\n\nThe agency — currently operating under caretaker conventions — would not comment or confirm the reports.\n\n\n\n\n\nWhen pressed on this issue this afternoon, Home Affairs Minister Tony Burke told SBS the government does not comment on operational matters, adding that any unauthorised arrivals would be detained and deported.\n\n\n\n\n\nThe Coalition was quick to seize on the video.\n\n\n\n\n\nOpposition Home Affairs spokesperson James Paterson said: \"Media reports of an apparent illegal maritime arrival are deeply concerning\".\n\n\n\n\n\n\"Regardless of whether they are people smugglers or illegal fishers, no one should be able to reach the Australian mainland undetected,\" Senator Paterson said.\n\n\n\n\n\n\"Once again, we have seen the Albanese government relying on private businesses alerting the government to serious security concerns,\" he said, citing a recent case in which a commercial airline pilot was the first to alert the government to live-fire exercises being conducted by the Chinese military in the Tasman Sea.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-housing-affordability-stumbling-block-being-ignored-by-both-major-parties/3o6h7ug0f",
    "title": "The housing affordability stumbling block being ignored by both major parties",
    "publish_date": "Sat, 26 Apr 2025 05:32:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's housing crisis has been a key focus in pitches to voters during the federal election campaign, with a particular emphasis on first-home buyers.\n\n\n\n\n\nBut whether you rent or buy, the Grattan Institute says the lack of housing affordability is exacerbated by one key issue: the lack of supply.\n\n\n\n\n\nBrendan Coates, program director of housing and economic security at Grattan Institute, said: \"We've not built enough housing to meet the needs of our growing population.\"\n\n\n\n\n\n\"That is largely because state land use planning regimes have made it too hard to build more homes in the established suburbs of our major cities,\" he told SBS News.\n\n\n\n\n\nLast year, Master Builders Australia said building the average house had blown out from nine months to 12.7 months — a 40 per cent increase — since 2010-11.\n\n\n\nIn areas closer to the city, it said the slow pace of development applications and height and density restrictions placed on big developments were part of the \"red tape\" slowing down construction.\n\n\n\n\n\nWhile the biggest levers for boosting construction sit with state and territory governments, which oversee planning and building regulations, Coates argues the Commonwealth still plays a role in increasing housing supply.\n\n\n\n\n\nExperts have weighed in on how the major parties are addressing bottlenecks in the industry and increasing supply, as well as what more needs to be done.\n\n\n\nWhat have the major parties pledged on housing?\n\nA quick recap of the main housing pitches to voters from the major parties:\n\n\n\n\n\nLabor\n\n\n\nWill expand the First Home Guarantee scheme and the Help to Buy shared equity loan scheme, both of which will allow first-time home buyers to buy a home with a deposit of 5 per cent or less. However, the latter gives the government a 30 to 40 per cent stake in your home.\n\nBuild 100,000 new affordable homes exclusively for first home buyers, with construction starting in 2026/27.\n\nProvide a $10,000 incentive for apprentices in housing construction — paid in instalments — in a bid to speed up the construction of homes.\n\nAim to deliver 55,000 social and affordable homes over five years under the Housing Australia Future Fund — which will be scrapped by the Coalition.\n\nCoalition\n\n\n\nFirst home buyers will be able to access $50,000 of their superannuation for a deposit.\n\nThey will also be able to claim tax deductions on interest payments against the first $650,000 of their mortgage in the first five years.\n\nA $5 billion fund to build infrastructure such as sewerage and water will be set up to support the construction of 500,000 new homes.\n\nBusinesses that employ apprentices in areas with a skills shortage can receive a payment of $12,000 per year for the first two years.\n\nThe Coalition believes cutting migration will alleviate pressure on the housing market, pledging to reduce net migration levels by 100,000 places.\n\nWhat effect will these policies have on supply?\n\nDr Liam Davies, a lecturer in urban planning and sustainability at RMIT University, said both major parties are tackling supply through different approaches.\n\n\n\n\n\nHe told SBS News the Liberal Party wants to ensure the right infrastructure is in place ahead of development, through its $5 billion fund.\n\n\n\n\n\nAlternatively, Labor would facilitate supply by actively intervening in the market, directly funding projects like 100,000 homes for first-time buyers.\n\n\n\nREAD MORE Australian federal election 2025 explained: Everything you need to know\n\nAre we on track to build enough homes?\n\nIn August 2023, the National Cabinet agreed on a target of building 1.2 million \"new, well-located homes\" across the country by 2029.\n\n\n\n\n\nTo achieve the target, 60,000 homes need to be built every quarter. In 2024, roughly 45,000 houses and units were built each quarter — a total of 181,789, according to the Australian Bureau of Statistics.\n\n\n\n\n\nThe Grattan Institute estimates the target is unlikely to be met, forecasting 900,000 homes will be built over the five years.\n\n\n\nIn 2024, roughly 45,000 houses and units were built each quarter — a total of 181,789, according to the Australian Bureau of Statistics. Source: SBS News Coates argues the Homes Accord target should be revised to incentivise states to build more. Currently, federal funding incentives for each home built are dependent on that jurisdiction reaching its individual target.\n\n\n\n\n\n\"There's not really a real incentive for the states to act to get more housing built, because even if they do, they will struggle to meet that baseline of one million homes, let alone the 1.2 million,\" he said.\n\n\n\n\n\n\"So we need to revise that target down, that baseline down, so that states start to qualify for the $15,000 [per home] if they do act.\"\n\n\n\nWhat else can government do to speed up development?\n\n\"There hasn't been a harder time to build more housing anytime in the last 20 years,\" Coates said, attributing this to a spike in construction costs, interest rates making financing projects more difficult, and shortages in skilled labour.\n\n\n\n\n\nHe said the federal government could \"speed the process up\" by getting more skilled migrants into the country and financing new construction — acknowledging the latter is part of Labor's pitch.\n\n\n\n\n\nDenita Wawn, CEO of Master Builders Australia, estimates the industry needs roughly 200,000 more workers to meet demand. She has repeatedly called for the fast-tracking of tradie visas, warning the gap cannot be met domestically alone.\n\n\n\n\n\n\"We know there's at least 20,000 skilled migrants in the country at the moment that are finding it difficult to get their skills recognised and undertake their gap training,\" she told SBS News.\n\n\n\nLabor has since announced it will fast-track the qualification of at least 6,000 tradies already in the industry through a $78 million program that will help recognise prior learning and identify gaps for further training, which will be offered for free.\n\n\n\n\n\nWawn said Labor's pilot program is not enough to compete with priority pathways offered by other countries, urging both parties to clearly lay out their skilled migration strategies to voters ahead of 3 May.\n\n\n\n\n\n\"Where both parties have let us down is [there's] really no policies on the issue around skilled migration,\" she said.\n\n\n\n\n\nOn Thursday, Opposition immigration spokesperson Dan Tehan said skilled migration would make up the bulk of a Coalition government's cuts to permanent migration.\n\n\n\n\n\nWawn did note that the Coalition were \"ahead\" of Labor when it came to apprentices, given they will provide $12,000 to employers if they hire apprentices in areas with a skills shortage; and will also back Labor's apprenticeship program that will provide $10,000 to apprentices directly if they complete their qualification.\n\n\n\nMaster Builders Australia says more skilled workers are key to expediting the building of houses. Other bottlenecks the industry faces are planning delays for things like development applications, title approvals and occupancy certificates — all of which reduce the capacity to build more homes quickly, although responsibility for these sits with local and state governments.\n\n\n\n\n\nWawn acknowledged Labor is the only party to mention working in collaboration with states and territories to address the issue of housing.\n\n\n\n\n\nHowever, she credits the Coalition with having a \"deregulation focus\". In March, Opposition Treasury spokesperson Angus Taylor committed to establishing a productivity taskforce to assess the cost of regulation and how to reduce red tape.\n\n\n\n\n\nWawn concludes the parties are \"neck-and-neck\" at the moment, but argues the 1.2 million build target is achievable if these issues are addressed.\n\n\n\nWhere should we be building homes?\n\nFrom a planning perspective, Davies said homes need to be built near infrastructure and utilities — including parks, schools, hospitals — and conducive to people having socially engaged lives.\n\n\n\n\n\nYou can achieve this by either developing areas near existing infrastructure, or by building infrastructure to allow easier access to greenfield sites, which are undeveloped plots of land typically on the outskirts of urban areas, he said.\n\n\n\n\n\n\"If you want to live in an urban area, the Labor policy may suit your lifestyle slightly better,\" he said.\n\n\n\n\n\n\"If you want to live in an outer suburban area, the Liberal Party policy may suit your lifestyle slightly better.\"\n\n\n\n\n\nHe argues while both are crucial, the government needs to focus on diversifying the type of homes being built. He highlights there is a gap for family homes — three or four-bedroom apartments — in urban areas.\n\n\n\nREAD MORE Australia is building a million new homes — but we may not want to live in them\n\nWhich party will boost home ownership?\n\nCoates said first home buyers on lower incomes will be able to buy homes they might not otherwise have access to, through Labor's first home buyer guarantee and shared equity schemes.\n\n\n\n\n\nBut high-income earners, who are more likely to be able to buy a home, will be the greatest beneficiaries of the Coalition's tax deduction on existing mortgages scheme.\n\n\n\n\n\n\"Labor is more likely to boost the rate of home ownership. The Coalition will allow wealthier people to buy bigger homes than otherwise.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/instagrammers-behind-aus-foodiee-revealed/f5n04ahwo",
    "title": "These Instagrammers want to try every Australian dish. Their favourite might surprise you",
    "publish_date": "Sat, 26 Apr 2025 01:09:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Aus Foodiee has become one of the more wholesome accounts on the internet. A narrator who seems to be a newcomer to Australia tries iconic dishes like a vanilla slice, pavlova, supermarket hot chook, Bubble O'Bill ice cream and a Bunnings 'sausage sizzle'.\n\n\n\n\n\nThe comment section is full of Australians praising the narrator's calm Korean commentary and sense of wonder at everyday foods, with fans offering recommendations for more classics, such as Arnott's Shapes and Milo.\n\n\n\n\n\nAfter feedback about how they prepared a hot cross bun \"wrong\", Aus Foodiee thanked fans and gave it another go in a second video, where they were judged to have prepared it properly — toasted with lots of butter.\n\n\n\n\n\nWhat fans don't know is that the account is actually the work of two Korean men — Mingoo Lee and Jungho Choi.\n\n\n\nAbout Aussie life and going viral\n\nIn their first-ever interview — where they revealed their faces and names — the Aus Foodiee creators spoke to SBS News about how life in Australia has been a surprising treat since arriving two months ago on working holiday visas.\n\n\n\n\n\n\"Some people don't use shoes here. I don't know why,\" Lee said, laughing.\n\n\n\n\n\n\"The traditional Aussie has a hairstyle like yours.\" He pointed to this author's mullet and laughed even harder.\n\n\n\n\n\nLee, who worked as a videographer in Korea, is typically the one who directs, films and edits the videos.\n\n\n\n\n\nBut he doesn't cook, leaving that job to Choi, who has worked as a chef in his day job for over seven years.\n\n\n\n\n\nThe reason they don't show their faces is that the videos are easier to edit if there are no shots of people, they said, half-joking.\n\n\n\n\n\nThe pair said they have been \"best friends for 20 years\".\n\n\n\n\n\nThey met as eight-year-olds and have maintained a close friendship despite moving to separate cities — Lee lived in Seoul and Choi lived in Busan.\n\n\n\n\n\nIt's a far cry from regional Victoria where they're living now, juggling foodie shoots in between work and travel to Melbourne to film at restaurants.\n\n\n\nLee said he created the account to help people understand and connect with other cultures, and said what he's learned along the way has helped him adapt to life in Australia.\n\n\n\n\n\n\"I didn't expect lots of people's interest, but I think I want to make a very helpful account. And I think food has a very special energy,\" he said.\n\n\n\n\n\n\"I didn't expect us to have an encouraging and powerful effect, but someday we are going to make this channel bigger and bigger and bigger.\"\n\n\n\nREAD MORE Is Indonesian the new Thai? Why the cuisine is having a moment in Australia\n\nThe sausage sizzle phenomenon\n\nTheir most popular video, with nearly a million views on Instagram and TikTok combined, is the homemade sausage sizzle.\n\n\n\n\n\nChoi caramelises onions, pan-fries a packet of sausages and serves them on white bread with ketchup.\n\n\n\n\n\nSpeaking in Korean with auto-generated English captions, Lee says in the video: \"This is said to be the national dish of Australians ... I think it's also called Bunnings sausage sizzle.\n\n\n\n\n\n\"How to make it is easier than you think.\"\n\n\n\nAs is often the case with their dishes, fans who frequently comment on their posts gave them another idea, so they filmed a trip to get a sausage in bread from Bunnings, describing it as \"meaningful food\".\n\n\n\n\n\nChoi and Lee said they weren't sure why so many people loved the sausage video in particular, but they thought the meal was one of the tastiest they've had.\n\n\n\n\n\nThe duo laughed, saying they were surprised the sausages were so thin.\n\n\n\n\n\nHaving also learned about it from the comments section, they will go to get a 'democracy sausage' on election day on 3 May .\n\n\n\nWhat are the duo's favourite dishes?\n\nSo what's Lee's favourite dish he discovered in two months in Australia?\n\n\n\n\n\nThe kebab.\n\n\n\n\n\nChoi's favourite is the hot cross bun, though he really enjoys Japanese food.\n\n\n\n\n\nThey said Australia's food scene should be described as multicultural.\n\n\n\n\n\n\"You can try every country's food, but some are not as good as others,\" Lee said.\n\n\n\n\n\nHe said the Korean food they tried in Melbourne was nice but not spicy enough.\n\n\n\n\n\nThe duo plan to make as many videos as they can while in Australia, most likely whatever their audience suggests Choi should cook.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/valerie-found-after-529-days-missing-dachshund-returns-fit-and-well/s36wfjca8",
    "title": "'Finally safe': Valerie the dachshund found 'fit and well' after 529 days on the run",
    "publish_date": "Sat, 26 Apr 2025 00:54:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "The long search for Valerie, the missing miniature dachshund, is over — and it has ended happily.\n\n\n\n\n\nAn incredible 529 days after the dog went missing on South Australia's Kangaroo Island, she was found by a volunteer-led Kangala Wildlife Rescue group.\n\n\n\n\n\n\"After weeks of tireless efforts by Kangala Wildlife Rescue volunteers and partner organisations Valerie has been safely rescued and is fit and well,\" the group said in a post on social media.\n\n\n\n\n\n\"Valerie is finally safe and able to begin her transition back to her loving parents.\"\n\n\n\n\n\nAccording to the group, the search involved 1,000 hours spent by volunteers, 5,000km travelled in private cars and the use of various cameras, traps, and technologies.\n\n\n\nWhat happened to Valerie the dachshund?\n\nIn November 2023, Valerie, wearing a pink collar, went missing while travelling with her owners, Georgia Gardner and Josh Fishlock, on Kangaroo Island.\n\n\n\n\n\nDespite a five-day search, the couple were unsuccessful in finding her, and they eventually returned home.\n\n\n\n\n\nEarlier this year, more than 12 months after Valerie was last seen, hopes were raised again after reports of a dachshund with a pink collar were spotted.\n\n\n\n\n\n\"Based on firsthand accounts and video evidence, we now know that Valerie is alive,\" Kangala Wildlife Rescue group said in mid-March.\n\n\n\n\n\n\"She runs at the first sign of humans or vehicles, and despite the best efforts of dedicated Island locals, Valerie has been impossible to catch.\"\n\n\n\n\n\nEarlier this month, another video of the dachshund was shared showing her near a trap.\n\n\n\nValerie had been missing for more than 500 days. Source: Supplied / Kangala Wildlife Rescue It was reported that Valerie frequently visited the site.\n\n\n\n\n\n\"She has become confident entering the large dog trap, which has been set up like her own little room with her toys and bed from home,\" the rescue group said.\n\n\n\n\n\nThe search has finally concluded with the group posting a video of Valerie on Friday.\n\n\n\n\n\n\"This successful outcome highlights the vital role that wildlife rescue organisations play in our community, extending their expertise and compassion to all animals in need,\" the group said.\n\n\n\n\n\n\"Valerie's story is a reminder that hope and determination can lead to incredible results.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/prevention-is-better-than-the-cure-fighting-the-tanning-trend/wv84mvm94",
    "title": "Prevention is better than the cure: fighting the tanning trend",
    "publish_date": "Fri, 25 Apr 2025 21:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n“Say these simple words: 'Slip, Slop, Slap! It sounds like a breeze when you say it like that. Slip, Slop, Slap! In the sun this summer say 'Slip, Slop, Slap!' Slip, Slop, Slap!'\n\n\n\n\n\nIn 1981, the famous Slip, Slop Slap campaign stormed our screens and airwaves.\n\n\n\n\n\nSid the Seagull was enlisted to encourage Aussies to seek protection from ultraviolet or U-V damage from the sun.\n\n\n\n\n\n44 years on and the Cancer Councils of Australia and Bureau of Statistics have done a study that shows while the song still slaps.. it seems the message has slipped.\n\n\n\n\n\nProfessor Anne Cust studies cancer in populations as an epidemiologist and Chair of the Cancer Council's National Skin Cancer Committee.\n\n\n\n\n\n\"One in five young Australians have tried to get a suntan in the past year and only about half of Australians are using adequate sun protection.\"\n\n\n\n\n\nThis alarming trend comes as the rate of melanoma continues to rise - 16,800 Australians will likely be diagnosed this year - one every thirty minutes.\n\n\n\n\n\nGeneration Z are educated on sun safety - so why aren't younger Australians following the rules?\n\n\n\n\n\nDoctor Stephen Dann - a marketing expert at the Australian National University - says social media is a big factor.\n\n\n\n\n\n\"The first thing is they are a young audience who are very driven by immediate outcomes. I get a tan, I look aesthetically pleasing to myself and the people around me. I look good. I feel great. I have a consequence coming to me in 35 years' time. That is future me's problem.\"\n\n\n\n\n\n2024 Australian of the Year, Professor Georgina Long, is the joint number one expert in the world in melanoma research.\n\n\n\n\n\nShe is frustrated by the rules around what influencers in Australia can advertise online.\n\n\n\n\n\nThey can't spruik products with an S-P-F rating including sunblock, but they can use their platforms to share information about non-therapeutic goods, like tan accelerants.\n\n\n\n\n\n\"So, people put these creams on to go in the sun and get a more accelerated tan more quickly. That is dangerous, that is a carcinogen, that is cancer causing. Do we need legislation about that? Do we need to free up guidelines around advertising good sunscreens. At the moment, good sunscreens, we're not able to advertise.\"\n\n\n\n\n\nSince 2022, the Therapeutic Goods Administration banned social media testimonials around products or devices that claim a medical or therapeutic benefit - including skincare and vitamins.\n\n\n\n\n\nThe rule can apply to any description of the qualities of a product with S-P-F protection, including sunblock.\n\n\n\n\n\nDr Dann says the rules that were designed to protect consumers, may have had the opposite effect.\n\n\n\n\n\n\"They were more worried about food contamination, or someone being offered a miracle cure for something that wasn't curable. That sunscreen got swept up as a consequence was one of those unfortunate outcomes of good policy, bad implementation.\"\n\n\n\n\n\nAs TikTok trends, including hashtag sunburnt tan lines gather hundreds of millions of views - the Cancer Council is fighting back with its End the Trend campaign.\n\n\n\n\n\nSix high profile Australian social media influencers have spent the past month staying out of the sun, rejecting fake tan and guiding their followers to the shade.\n\n\n\n\n\nOnline influencer Tayla Broad was motivated to end the trend, because she saw how skin cancer impacted loved ones.\n\n\n\n\n\n\"We can all be aware just how damaging the tanning culture can be, even with the likes of fake tanning. So, join me on this journey to challenge the way we view tanning and why we feel the need to tan to be beautiful.\"\n\n\n\n\n\nProfessor Cust sees the irony in tanning trending in an online space dominated by beauty.\n\n\n\n\n\n\"UV radiation that you get from the sun, there are different types of UV radiation. UVA is responsible for a lot of the ageing that we see from the sun exposure and the UVB is responsible for a lot of the burning. So, if you are concerned about beauty, it is much better to stay out of the sun.\"\n\n\n\n\n\nProfessor Long has pioneered and led research into immunotherapy treatments for melanoma that mean a diagnosis that was deadly in 2010, now has an above-fifty-fifty chance of a cure.\n\n\n\n\n\n\"There is a handshake that the cancer cell would give the immune system or the immune cells so that the immune cells would say 'this is my friend, this is my family, off I go, I won't kill you.' But these drugs, checkpoint inhibitors, interrupt that handshake and allow those immune T cells to kill the cancer cells, the melanoma cancer cells. So those drugs which we started working with around that 2010 period absolutely revolutionised how we later treated melanoma.\"\n\n\n\n\n\nIt is a monumental feat she and her colleagues have achieved.\n\n\n\n\n\nBut Professor Long is united with experts who agree prevention is the best cure - and the second line of defence is a skin check.\n\n\n\n\n\nAn online melanoma risk assessment tool is available at melanoma risk dot org dot a-u.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.theage.com.au/national/victoria/take-the-age-quiz-20230608-p5df2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Take The Age quiz",
    "publish_date": "Sun, 27 Apr 2025 12:04:32 +1000",
    "category": "finance",
    "authors": [],
    "text": "WHERE AM I?\n\nWhere is this popular bakery? Credit: Chris Hopkins\n\nQueues are a common sight in this Melbourne laneway as fans of baked goods patiently wait for their pastry fix. What is the name of this store, and where is it located? Check next week’s quiz for the answer.\n\nLast week’s WHERE AM I? The Yayoi Kusama exhibition was held at NGV International.",
    "source": "TheAge",
    "cluster_id": 41
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/experienced-coach-backed-for-bears-job-20250427-p5luj9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Experienced' coach backed for Bears job",
    "publish_date": "Sun, 27 Apr 2025 11:59:47 +1000",
    "category": "sports",
    "authors": [],
    "text": "'Experienced' coach backed for Bears job\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/lifestyle/mothers-day-gift-ideas-for-2025-20250427-p5luj8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mother's Day gift ideas for 2025",
    "publish_date": "Sun, 27 Apr 2025 11:56:20 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Mother's Day gift ideas for 2025\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/basketball/buzzer-beater-ignites-nba-playoffs-20250427-p5luj5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Buzzer-beater ignites NBA playoffs",
    "publish_date": "Sun, 27 Apr 2025 11:29:01 +1000",
    "category": "sports",
    "authors": [],
    "text": "Buzzer-beater ignites NBA playoffs\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-updates-pm-to-spruik-204m-around-the-clock-medicare-hotline-dutton-s-better-budget-pledge-to-rely-on-cuts-20250426-p5lufj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Federal election 2025 LIVE updates: PM to spruik $204m around-the-clock Medicare hotline; Dutton’s better budget pledge to rely on cuts",
    "publish_date": "Sun, 27 Apr 2025 11:21:08 +1000",
    "category": "finance",
    "authors": [
      "Olivia Ireland"
    ],
    "text": "The biggest cheers at this morning’s Labor rally in Parramatta have been for Medicare. Many in the 300-person crowd wave Labor-branded “Albo” placards during the leaders’ speeches. But just as many here today are waving green and gold posters that say “more bulk-billing”, complete with the Medicare logo. It is another indication of how strongly Labor is seeking to tie its brand to Medicare at this year’s election.\n\nAlbanese whips out his Medicare card again. Credit: Alex Ellinghausen\n\nAlbanese, once again, whips out his own Medicare card – a near-daily campaign stunt at this point. “The fact that this card is green and gold is no accident. We take pride in it as Australians, just as we take pride in that other great Labor reform, the Pharmaceutical Benefits Scheme ... A vote for Labor is a vote for Medicare,” Albanese says.\n\n“Today, we add to the strengthening Medicare agenda. A re-elected Labor government will make free, urgent care available to all Australians, in every community, with the launch of 1800 MEDICARE. A 24/7 health advice line and after-hours GP telehealth service, backed by Medicare.\n\n“You’ll be able to call any time to get expert health advice from a registered nurse. If it’s something that can’t wait for your regular GP, you’ll be connected to a free GP telehealth consultation. Life isn’t 9 to 5. With 1800 MEDICARE, neither is healthcare.”",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/djoker-loses-in-straight-sets-20250427-p5luiq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Djoker loses in straight sets",
    "publish_date": "Sun, 27 Apr 2025 10:43:20 +1000",
    "category": "finance",
    "authors": [],
    "text": "Djoker loses in straight sets\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/nfl/nfl-s-love-affair-with-australian-punters-continues-with-jeremy-crawshaw-drafted-by-denver-broncos-20250427-p5luij.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NFL’s love affair with Australian punters continues with Jeremy Crawshaw drafted by Denver Broncos",
    "publish_date": "Sun, 27 Apr 2025 09:58:37 +1000",
    "category": "sports",
    "authors": [],
    "text": "Jeremy Crawshaw is set to join the ranks of Australian punters in the NFL after being drafted by the Denver Broncos.\n\nThe 23-year-old from Emu Plains in Sydney’s west was the first punter taken in the draft – going in the sixth round with pick No.216 – after being widely considered the best on offer following his five seasons with the University of Florida.\n\nJeremy Crawshaw in action for the Florida Gators. Credit: Icon Sportswire via Getty Images\n\nHe averaged 45.8 yards for the Gators in 2024, with 25 punts downed inside the 20-yard line. In the 2023 season, he set the single-season Gators record for punt average at 48.9 yards.\n\nCrawshaw is set to compete with veteran punter Matt Haack for the Broncos’ starting job. Haack signed a one-year, $US1.255 million ($1.96 million) contract with the club in March.",
    "source": "TheAge",
    "cluster_id": 6
  },
  {
    "url": "https://www.theage.com.au/lifestyle/popular-kids-show-sparks-parent-screen-time-debate-20250427-p5lui4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Popular kids show sparks parent screen-time debate",
    "publish_date": "Sun, 27 Apr 2025 09:30:12 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Popular kids show sparks parent screen-time debate\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/fans-storm-field-as-wrexham-secure-third-straight-promotion-20250427-p5lui0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fans storm field as Wrexham secure third-straight promotion",
    "publish_date": "Sun, 27 Apr 2025 09:23:04 +1000",
    "category": "sports",
    "authors": [],
    "text": "Fans storm field as Wrexham secure third-straight promotion\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/wrexham-one-step-from-premier-league-as-hollywood-story-continues-20250427-p5luhr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wrexham one step from Premier League as Hollywood story continues",
    "publish_date": "Sun, 27 Apr 2025 09:03:14 +1000",
    "category": "sports",
    "authors": [],
    "text": "Canadian actor Ryan Reynolds said it felt like an “impossible dream” when he floated the idea of buying soccer club Wrexham to fellow Hollywood A-lister Rob McElhenney. He had an idea for a documentary. The ultimate goal was reaching the Premier League.\n\nFour years after they purchased the north Wales outfit, Wrexham are one league away from achieving their lofty goal after a 3-0 win over Charlton Athletic on Saturday saw them promoted for a record third consecutive time.\n\n“It just seemed like an impossible dream, and we do what we’re lucky to do is be storytellers,” Reynolds, best known for his role as superhero character Deadpool, told Sky Sports after the game.\n\n“And when you’re a storyteller, you look as much as you can at the sort of macro view of this history.",
    "source": "TheAge",
    "cluster_id": 10
  },
  {
    "url": "https://www.theage.com.au/national/maxwell-fails-to-fire-again-20250427-p5luhu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Maxwell fails to fire again",
    "publish_date": "Sun, 27 Apr 2025 08:58:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "Maxwell fails to fire again\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/lifestyle/princess-lilibet-features-in-meghans-new-video-20250427-p5luhq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Princess Lilibet features in Meghan's new video",
    "publish_date": "Sun, 27 Apr 2025 08:38:48 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Princess Lilibet features in Meghan's new video\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/environment/weather/national-weather-forecast-for-sunday-april-27-20250427-p5luhh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "National weather forecast for Sunday April 27",
    "publish_date": "Sun, 27 Apr 2025 07:30:22 +1000",
    "category": "finance",
    "authors": [],
    "text": "National weather forecast for Sunday April 27\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://au.news.yahoo.com/where-to-get-a-tasty-democracy-sausage-as-albanese-and-dutton-face-off-in-2025-election-224508449.html",
    "title": "Where to get a tasty democracy sausage as Albanese and Dutton face-off in 2025 election",
    "publish_date": "2025-04-26T22:45:08Z",
    "category": "finance",
    "authors": [],
    "text": "For over a decade, a group of Aussie friends have run a website detailing which voting booths offer the election day staple.\n\nAnthony Albanese and Peter Dutton are facing off. But the most important for many Aussies is where they can get a great-tasting democracy sausage. Source: AAP\n\nMany voters are facing a bigger question than policies announced by Labor, Liberal, Greens or Independent. They’re wondering where they can find the best democracy sausage on election day.\n\nWhile democracies around the world face mounting threats, Aussie voters generally approach polling booths with a light heart. And they're rewarded for their efforts with the chance to support a local community group by purchasing a snag with white bread, onions, and tomato sauce.\n\nOr controversially, maybe even mustard, barbecue sauce, or worse still, plain.\n\nAnnette Tyler was one of the founders of the Democracy Sausage website back in 2013. Today, it lists over 900 locations where voters can find themselves a snag. So if you're wondering where to find a tasty snag on election day, all you need to do is click here.\n\nADVERTISEMENT\n\n“The one thing that brings everyone together is the democracy sausage,” she told Yahoo News.\n\nThe website continues to be run by the group of mates, and now includes other offerings like cupcakes, vegetarian food, bacon and eggs, coffee, and halal. There’s also a handy column showing which locations are wheelchair accessible.\n\nThe democracy sausage website has received over 900 submissions for listing ahead of the federal election. Source: Democracy Sausage.\n\nWorst sausage eater of all time revealed\n\nThe team don’t own the slogan democracy sausage, and have never sought to commercialise it. But they do offer merchandise now that’s sold at a price that covers the costs of production.\n\nThis year, in what must be one of the first times a food company has released election-themed produce, Masterfoods is selling its own brand of democracy sauce.\n\n“That’s an independent thing. They did let us know about it,” Annette said.\n\n“But our principle is generally to stay non-partisan and to avoid commercial entanglements.”\n\nAccording to one expert, Bill Shorten is responsible for the worst-ever attempt at eating a sausage. Source: 7 News\n\nADVERTISEMENT\n\nOver the years, politicians have been roasted over their clumsy attempts to eat sausages. There’s one famous shot of Opposition Leader Peter Dutton eating a Dagwood dog at the 2022 Ekka show in Brisbane that often does the rounds on social media. And a couple of years ago, Prime Minister Anthony Albanese’s aids tried to shield him from the cameras using his jacket, but it didn’t stop photographers from getting a short clip of him wolfing down his snag.\n\nBut for Annette award for the most disastrous attempt to eat a sausage still goes to a now retired former Prime Ministerial hopeful. “Nothing is ever going to eclipse Bill Shorten, right? That's an all-time classic,” she said.\n\n“I feel like after that, they’ve all been trained in eating democracy sausages.”\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
    "source": "Yahoo",
    "cluster_id": 42
  },
  {
    "url": "https://au.news.yahoo.com/outback-duos-excellent-homemade-backyard-bbq-innovation-works-perfectly-033134731.html",
    "title": "Outback duo's 'excellent' homemade backyard BBQ innovation: 'Works perfectly'",
    "publish_date": "2025-04-26T03:31:34Z",
    "category": "finance",
    "authors": [],
    "text": "Tom Forrest and his grandfather Stephen, dubbed ‘Outback Grandad’, share glimpses into their life in Western Australia's Kimberley region.\n\nStephen Forrest and his grandson Tom have shared a step-by-step guide to how to make a backyard Korean Barbecue with recycled materials. Source: Tom Forrest/Outback Tom/TikTok\n\nFor the past few years, a popular Aussie duo have been entertaining millions around the world with videos of their bush adventures.\n\nFrom whipping up pizzas and cinnamon scrolls by a campfire, to clever DIY projects like turning old trees into bird boxes, Tom Forrest and his grandfather Stephen, 72, delightfully dubbed ‘Outback Grandad’, have garnered many fans with glimpses into their life in Western Australia's Kimberley region.\n\nMost recently, the pair debuted a handmade backyard Korean BBQ in their signature “bush style” and constructed entirely out of recycled materials. Viewers have praised the “excellent” idea.\n\nSpeaking to Yahoo News Australia, Tom said the pair designed the project after he moved back to the area from Sydney. “I’d never heard of Korean barbecue before until I’d essentially travelled to the city,” he said.\n\nADVERTISEMENT\n\nAfter dining at a few restaurants, not only did Tom become a fan of the food, but he enjoyed the inclusivity of having everyone gathered around a central grill, cooking and eating together.\n\n“When I think about backyard barbecues in the Outback or across the country, I sort of recognise that it separates the cook from the rest of the people,” he told Yahoo. “It’s typically one person’s responsibility to cook the barbecue and then bring the food over.\n\n“So I took inspiration from the Korean barbecue set-up and wanted to bring that to the Outback and basically create this 44-gallon drum contraption which could seat up to five people.”\n\nBackyard Korean BBQ crafted from recycled materials\n\nIn a video posted to TikTok, the pair took other Aussies through a step-by-step guide of how to create their own backyard Korean BBQ using items they may have stashed in the back of a shed.\n\nADVERTISEMENT\n\n“The foundation of the Korean barbecue is a 44 gallon drum. These are really popular in the Kimberley, so we have access to them relatively easy,” Tom said. The next key component is finding a “mini charcoal barbecue”, which can be found in most camping stores, and will sit inside a hole cut out of the top of the drum.\n\n“We then took a piece of plywood to use for our table and cut a hole in the interior part of the board so we could slide the board over the 44-gallon drum, and then we also cut a circle on the exterior part of the board so that we had a round table,” Tom explained. After then it’s just a matter of putting all the pieces together.\n\nHow can I make a Korean BBQ like Outback Grandad?\n\nCut a hole in the top of the of the 44-gallon drum so the mini charcoal barbecue sits flush on top.\n\nMake four steel L-shaped brackets to hold the plywood table. Drill them into the side of the drum, making sure they are “nice and level”.\n\nCut a hole in the interior part of a large piece of plywood so you can slide it over the drum.\n\nCut a circle on the exterior part of the board to form a round table with a hole in the centre.\n\nSmooth the edges of the wood using a sander and apply a coat of lacquer so it can be easily wiped with a cloth.\n\nPlace the drum in its desired location.\n\nPut the barbecue in the hole, place heated charcoals inside and the grill on top.\n\nSlide the table over the drum and rest it on the brackets.\n\nCook up a feast for friends and family.\n\nStephen and Tom created the backyard Korean BBQ using a 44-gallon drum, a mini charcoal barbecue, and a piece of plywood. Source: Tom Forrest/Outback Tom/TikTok\n\nOutback duo pleased as DIY project 'works perfectly'\n\nTom told Yahoo he and his grandad also added an airflow vent to help control the temperature, but it is probably not necessary.\n\nADVERTISEMENT\n\n“We also cut out a hole in the side of the drum, so we could reach our hand through to adjust the air flow of the charcoal barbecue. If we want more heat, we can open it up to allow more oxygen to come in, and if we need the charcoal grill less hot, we can close that and reduce the oxygen intake as well,” he said.\n\nThe vent is lined with a rubber seal the pair pulled off of an old car on the back of their rural property. It prevents any cuts or grazes from the sharp edges of the hole.\n\n“The concept and the design started off as a drawing, and then to finally have it in the backyard, get the charcoal barbecue cranking, have marinated meats and various side dishes on the table — I then invited the rest of the family out the back to join us — and it worked absolutely perfectly,” Tom said.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 43
  }
]