[
  {
    "url": "https://www.9news.com.au/national/skydiving-accident-queensland-narrow-escape-after-getting-caught-on-tail-of-plane/937e5755-8010-4af0-9161-eae37d6ccd3e",
    "title": "Skydiver's narrow escape after parachute deployed early",
    "publish_date": "Thu, 11 Dec 2025 01:19:36 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "A pilot and 17 skydivers were on board a Cessna Caravan flying over Tully Airport, about 142 kilometres south of\n\nCairns\n\n, on September 20, when the first parachutist's reserve chute accidentally deployed, dragging them backwards and getting caught on the plane's horizontal stabiliser.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/australian-jobless-and-underemployed-workers-total-more-than-three-million/b1cb8fbd-68f8-4a25-becc-48fc692467b4",
    "title": "Why more than 3 million Australians aren't finding enough work",
    "publish_date": "Thu, 11 Dec 2025 01:52:34 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "For 12 consecutive months the number of Australians either jobless or underemployed has totalled more than 3 million, according to a new study.\n\nMarket research company Roy Morgan has crunched the figures on people out of work or seeking more employment over the past year and found Australia's economy is struggling to create jobs.\n\nLast month the country's 'real' unemployment rate - a percentage of the workforce both employed and unemployed - was virtually unchanged at 1,628,000, or 10 per cent of the workforce.\n\nNew research suggests a combined total of more than 3 million Australians are either unemployed or underemployed (Photo by ROB HOMER) (AFR)\n\nBut factoring in 'shadow' workers - freelancers and part-time staff - shows a further 1.7 million are hungry for more work.\n\nRoy Morgan estimates for last month show overall unemployment and under-employment increasing 54,000 to 3,337,000, equivalent to 21 per cent of the workforce.\n\nChief executive Michele Levine says combined unemployment and under-employment is continuing at level of 3.3. million﻿.\n\n\"A look at the employment market over the last year shows little change in the overall picture with employment down from a year ago by 91,000 to 14,339,000,\" she said.\n\n\"Full-time employment is down 64,000 to 9,203,000, and part-time employment is down 27,000 to 5,136,000 from a year ago indicating the economy has struggled to create new jobs over this period.\"\n\nLevine says the low level of productivity in the economy is stifling growth and leading to the labour market stagnating.\n\nFigures released today by the Australian Bureau of Statistics showed the seasonally adjusted unemployment rate was steady at 4.3 per cent in November - roughly in line with market expectations.\n\nThe number of unemployed and employed people fell in November, by 2000 and by 21,000 respectively.\n\nThe underemployment rate rose by 0.4 percentage points to 6.2 per cent in November.\n\nThis was 0.1 percentage points higher than November 2024, and 2.6 percentage points lower than March 2020.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/finance/australian-dollar-rises-on-us-interest-rate-cut/d3dc38c6-fe95-4507-9fda-2e308de7f02a",
    "title": "Australian dollar spikes after cut to US interest rates",
    "publish_date": "Wed, 10 Dec 2025 23:14:34 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "T﻿he Australian dollar rose early today after the US Federal Reserve cut interest rates by 0.25 percentage points.\n\nAt 7am (AEDT) the Aussie dollar was trading at US66.63 cents. The Sydney Morning Herald.\n\nThe decision by the US central bank is expected to trigger a surge in the Australian share market today.\n\nUS Federal Reserve Chair Jerome Powell announced a cut to interest rates. (AP Photo/Jacquelyn Martin) (AP)\n\nThe US interest rate reduction on Wednesday (Thursday AEDT) to 3.6 per cent, marked the lowest it has been in nearly three years.\n\nChair Jerome Powell signalled at a news conference that the Fed would likely hold off on further rate cuts in the coming months while it evaluated the health of the economy.\n\nEconomists in Australia, meanwhile, are awaiting today's release of key employment figures, expected at 11.30am (AEDT).\n\n- With AP﻿\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play . ﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/teenager-diagnosed-with-measles-in-southern-tasmania/e75b9cd0-4ec9-4543-a160-240f36b69faf",
    "title": "Teenager diagnosed with measles in southern Tasmania",
    "publish_date": "Wed, 10 Dec 2025 23:56:06 +0000",
    "category": "lifestyle",
    "authors": [
      "Dec"
    ],
    "text": "A teenager has been diagnosed with measles in southern Tasmania .\n\n﻿The state's department of health said the young person tested positive for the illness on December 9.\n\nThe person is isolating and recovering at home.\n\nA teenager has been diagnosed with measles in southern Tasmania. (Getty)\n\nThe case resides in Southern Tasmania and spent time in the Huon Valley and Channel areas while infectious.\n\nContract tracing has identified the ﻿ measles case is likely to have acquired their infection from the recent measles case notified in late November after visiting a listed public exposure site.\n\nThe Department of Health is working to contact those who have had a known exposure.\n\nResidents and visitors are reminded to be aware of the signs and symptoms of measles and where to seek care if symptoms develop.\n\nSymptoms include fever, runny nose, red eyes and a cough.﻿\n\n﻿A red, blotchy rash usually starts a few days later, often spreading from the head to the rest of the body.\n\nAnyone who has had contact with a measles case or visited a public exposure location should monitor for symptoms of measles up to 18 days following exposure.\n\nIf symptoms develop, isolate and arrange to seek medical care as soon as possible.\n\nA list of exposure sites can be found on the Tasmanian department of health website .﻿",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/finance/unemployment-rate-australia-november-data-what-it-means-for-interest-rates/3bf8ec82-215e-420d-9b49-3655287be9a4",
    "title": "More than 56,000 Aussies leave work but jobless figure remains steady",
    "publish_date": "Thu, 11 Dec 2025 00:18:09 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "The nation's unemployment rate has remained steady at 4.3 per cent, adding little fuel to widespread speculation over the future movements of the Reserve Bank of Australia (RBA).\n\n﻿Full-time employment fell by 57,000 people in November, with 40,000 males and 16,000 females exiting the workforce.\n\nPart-time employment, perhaps bolstered by Christmas casual positions, rose by 35,000 people.\n\nREAD MORE: Shocking footage shows woman targeted in teen shopping centre brawl\n\nA boom in part-time Christmas jobs may have bolstered November's figures. (Kate Geraghty)\n\nABS head of labour statistics ﻿Sean Crick said despite sweeping changes to employment factors, the headline figure has remained largely stable.\n\n\"The unemployment rate has remained at 4.3 per cent in five of the last six months,\" he said.\n\n\"Both the number of unemployed and employed people fell in November, by 2000 and by 21,000 respectively.\"\n\nToday's unemployment result, which was largely forecast by financial markets and economists alike, does little ﻿to clear the clouds from the crystal balls of RBA watchers.\n\nUnemployment is steady and historically low, with many predicting﻿ there may be as little as one hike in 2026.\n\nMore to come.﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/best-christmas-lights-australia-2025-displays-decorations-where-to-find-them/dc4afa62-2ee3-46dd-9329-90351a9dfd43",
    "title": "Painstaking detail hidden in Queensland family's Christmas display",
    "publish_date": "Wed, 10 Dec 2025 23:28:13 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Some ﻿ C﻿hristmas fans are ignoring rising electricity prices this festive season, with twinkling lights draped across trees, lawns and homes across the country.\n\nThe beloved tradition of looking at Christmas light﻿s on a warm summer's evening certainly won't be missed this year – thousands of households have already painstakingly hung their colourful decorations and are spreading cheer in their communities.\n\nHere, we round up some of the best lights in Australia and where to find them﻿. From Mudgee in NSW and High Wycombe in WA to Burleigh Waters in Queensland and Roxby Downs in SA, the joyful festivities can be seen far and wide.\n\nIf you've decorated for Christmas, send your photos to contact@nine.com.au for a chance to be featured in our story.\n\nMudgee, NSW﻿\n\nThis couple from regional NSW﻿ captured their festive lights from the sky – and their house is the brightest on the block.\n\n\"Each year my hubby goes above and beyond,\" homeowner Tash told nine.com.au.\n\n\"He puts the lights up, I pass him the beer.\"\n\nA Christmas light display seen from above in Mudgee. (Supplied)\n\nTash said her husband spends hours putting up their lights. (Supplied)\n\nHigh Wycombe, WA\n\nOne Perth family﻿ has used the ABC hit Bluey as the theme of their Australian-themed Christmas decorations.\n\nYou can find these lights on Palmer Crescent in the suburb of High Wycombe.﻿\n\nBluey is the main character of this household's Christmas decoration. (Supplied)\n\nThe front lawn is chock-full of twinkling lights and fun surprises. (Supplied)\n\nBaulkham Hills, NSW﻿\n\nThere appears to be a two-storey house hiding underneath the spectacular decorations at this property in Baulkham Hills in Sydney's north-west.﻿\n\nYou can enjoy these decorations o﻿n Goodin Road.\n\nChristmas lights in Baulkham Hills in Sydney (Supplied)\n\nJamboree Heights, Queensland\n\nIt might be nudging 30﻿-degrees most days in Queensland during December, but this Brisbane family is helping their neighbours enjoy a white Christmas.\n\nThe display here on Mistral Street in Jamboree Heights comes complete with a blow-up Rudolph and his sleigh.﻿\n\nChristmas lights in Jamboree Heights in Brisbane. (Supplied)\n\nFake snow can be seen on the lawn at this home. (Supplied)\n\nSt Albans, Victoria﻿\n\nThe local community on Brown Avenue in St Albans in Melbourne's west loves to dress their homes in festive decorations each year.﻿\n\n\"The display is designed to bring joy and holiday spirit to families across the area,\" homeowner Claudia told nine.com.au.\n\nChristmas lights in St Albans, Melbourne. (Supplied)\n\nNeighbours in this suburb enjoy putting the lights up every year. (Supplied)\n\nCroydon Park, SA\n\nThis home in Adelaide's north-west is so decked out with lights, figurines and stuffed animals, you can hardly see the lawn.\n\nPassersby surely stop and marvel at these lights every evening on Days Road in Croydon Park, South Australia.\n\nChristmas lights in Croydon Park, SA. (Supplied)\n\nThe front lawn is filled with Christmas ornaments and figurines. (Supplied)\n\nSandstone Point, Queensland﻿\n\nThe owners﻿ of this home in the coastal Queensland town of Sandstone Point built a tree on their driveway using 3000 cans of VB.\n\nTheir magical Christmas display is also complete with a waterfall display, a gingerbread area and a nativity scene, which you can witness at the home on Clark Terrace.\n\n\"Continue through to our walk-through garage, where a singing Santa performs alongside angels, gingerbread characters, Mrs Claus and many other Christmas favourites,\" homeowner Jodie said.\n\nChristmas lights in Sandstone Point, Queensland. (Supplied)\n\nA highlight of this display is the tall Christmas tree made from 3000 VB cans. (Supplied)\n\nMount Martha, Victoria﻿\n\nVictorian man Rod and his neighbour both pulled out all the stops to decorate their homes on Florence Street in Mount Martha this Christmas.\n\nThe homeowners are also taking donations for the Royal Children's Hospital in Melbourne from visitors enjoying their lights.\n\nChristmas lights in Mount Martha, Victoria. (Supplied)\n\nFlinders View, Queensland﻿\n\nThere is a magical Christmas wonderland on display at this home on Pearwood Street in Flinders View, Queensland.﻿\n\nChristmas lights at Flinders View. (Supplied)\n\nHoppers Crossing, Victoria﻿\n\n﻿This home on Wildflower Crescent in Hoppers Crossing, in Melbourne's south-west, has so many decorations that the owners can't park in their driveway during Christmas time.\n\nChristmas lights in Hoppers Crossing, Victoria. (Supplied)\n\nGeebung, Queensland﻿\n\nQueensland mum Katie said her 15-year-old son began installing Christmas lights at their home in Geebung in ﻿Brisbane's north around October.\n\n\"My son, aged 15, has done the entire design and installation himself,\" Katie said proudly.\n\n\"He has always loved Christmas lights and this year has done a fantastic job.\"\n\nChristmas lights in Geebung, Queensland. (Supplied)\n\nKatie's 15-year-old son began putting up the lights two months in advance. (Supplied)\n\nGowrie, ACT﻿\n\nCan﻿berra man James has been collecting Christmas lights for 12 years to create this masterpiece.\n\nThe display, located on Ruthven Street in Gowrie, helps raise money for multiple sclerosis (MS) and has so far netted over $125,000 in donations.﻿\n\nChristmas lights in Gowrie, ACT. (Supplied)\n\nGregory Hills, NSW﻿\n\nYou can find this cheery display, complete with a Spider-Man surprise on the driveway, in ﻿Gregory Hills in Sydney's south-west.\n\nChristmas lights in Gregory Hills. (Supplied)\n\nWest Hobart, Tasmania﻿\n\nChristmas light fans come from around the neighbourhood to witness this glorious home on Molle Street in West Hobart.\n\nChristmas lights in West Hobart, Tasmania. (Supplied)",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/december-christmas-weather-forecast-australia-2025-state-by-state/6adafbf2-746f-44a7-a1da-730498c3a498",
    "title": "One city set to swelter on Christmas Day",
    "publish_date": "Thu, 11 Dec 2025 01:00:00 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Australians are set to soak up sunny days this Christmas, according to the latest weather predictions.﻿\n\nAccuweather has released a detailed forecast for this month in each of Australia's capital cities﻿.\n\nHere's what's in store for the central hubs of each state and territory.\n\n﻿ READ MORE: Australia Post reveals deadline for mailing Christmas parcels\n\nDarwin is in for a sweltering Christmas day. (Getty Images/iStockphoto)\n\nNSW\n\nThere will be plenty of sun in Sydney this December, with some cloudy conditions and showers predicted across the month.\n\nChristmas Day should be dry and mostly sunny with a low of 21 degrees and a high of 27 degrees.\n\nQueensland﻿\n\nIt's going to be hot in Brisbane this December.\n\nExpect plenty of sun with a few summer storms thrown in around the middle and end of the month.\n\nUnfortunately, Christmas Day is predicted to be cloudy and humid with a low of 22 and high of 30.\n\nChristmas day is looking cloudy and humid in Brisbane. (Getty)\n\nVictoria﻿\n\nDecember will be warm but cloudy in Melbourne.\n\nSome rain and thunderstorms are predicted towards the middle of the month.\n\nChristmas Day is expected to be ﻿sunny with a high of 26 and a low of 16.\n\n﻿ACT\n\nCanberra will enjoy a balmy December.\n\nThe skies will be a mix of sun and cloud cover for most of the month, with a smattering of showers.\n\nDecember 25 will be warm with an expected high of 29 degrees.\n\nCanberra is expecting a warm Christmas day. (Getty)\n\nSouth Australia\n\nDecember is looking like a mixed bag in Adelaide.\n\nMost of the month will be cloudy, with patches of rain and even fog.\n\nChristmas Day is expected to be mostly sunny with a high of 27 degrees.\n\nWestern Australia\n\nPerth will experience a sticky summer based on current predictions for December.\n\nMost of the month will be sunny with a few isolated patches of cloud, though they should pass in time for Christmas.\n\nChristmas Day is expected to be sunny with some cloud cover and a high of 24 degrees.\n\nEarly predictions are showing Perth will be sunny in the lead-up to Christmas. (Getty)\n\nNorthern Territory\n\nDecember in Darwin will be sweltering with rain and storms throughout ﻿the month.\n\nDespite thi, Christmas Day is currently predicted to be one of the few sunny days, with December 25 slated for a high of 35 degrees.\n\nREAD MORE: When double demerits apply over Christmas and New Year in every state and territory\n\nTasmania﻿\n\nHobart will enjoy a more temperate introduction to summer, with plenty of sun and a smattering of rainfall through the month.\n\nChristmas Day is expected to be mostly cloudy with some showers and a predicted high of 21 degrees.﻿",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/secrets-shhh-affordable-jeweller-goes-into-voluntary-administration/b5806122-cfd5-44c5-803d-423f89a75fa5",
    "title": "Jewellery chain collapses into administration",
    "publish_date": "Wed, 10 Dec 2025 23:00:20 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "An affordable jewellery chain has collapsed into administration but is continuing to trade while the company is assessed for a potential sale.\n\nKate Warwick, Kelly Trenfield, and John Park of FTI Consulting have been appointed joint and several administrators of Secrets Shhh﻿, which is owned by Secrets International.\n\nSecrets sells lab-grown diamonds and simulated alternatives online and in 23 stores around the country.\n\nSecrets Shhh has entered voluntary administration. (Secrets Shhh)\n\n﻿ \"The business is trading as usual as much as possible while the administrators undertake an urgent assessment of the company's operations, and have commenced a sales process and/or recapitalisation of the group,\" Park said.\n\nWhere stock is available, orders placed on or after the appointment of administrators will be filled and shipped as normal.\n\nHowever, the administrators cannot guarantee that orders placed before yesterday, December 10, will be filled.\n\nREAD MORE: Woman fighting for life after crash involving stolen ute in police chase ﻿\n\nThe jeweller specialises in lab-grown and simulated diamonds. (Secrets Shhh)\n\nCustomers can use a gift card or redeem store credit if they spend an equal or greater amount.\n\nThe administrators will next write to creditors, suppliers, and employees regarding ongoing trading information.\n\nThe first meeting of creditors, for which information will also be provided in those communiques, will be held on December 19.\n\nSecrets Shhh, Secrets International, and all the latter's other subsidiaries are all subject to the voluntary administration﻿.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/world/sophie-kinsella-author-of-shopaholic-novels-dead/0e464614-0fb6-482a-a8db-dd0d989bdadb",
    "title": "Sophie Kinsella, author of best-selling 'Shopaholic' novels, dies at 55",
    "publish_date": "Wed, 10 Dec 2025 19:15:07 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "British writer Sophie Kinsella, whose effervescent rom-com Confessions of a Shopaholic sparked a million-selling series, has died, her family said. She was 55 and had been diagnosed with brain cancer.\n\nThe family on Wednesday (Thursday AEDT) said in a statement on Kinsella's Instagram account that \"she died peacefully, with her final days filled with her true loves: family and music and warmth and Christmas and joy.\n\n\"We can't imagine what life will be like without her radiance and love of life,\" the family said.\n\nAuthor Sophie Kinsella has died from brain cancer aged 55. (AP Photo/Adam Butle, File) (AP)\n\nKinsella, who also published under her real name, Madeleine Wickham, announced in April 2024 that she had been diagnosed more than a year earlier with glioblastoma, an aggressive form of brain cancer.\n\n\"I did not share this before because I wanted to make sure that my children were able to hear and process the news in privacy and adapt to our 'new normal,'\" she said at the time.\n\nKinsella published 10 Shopaholic novels starting in 2000 with The Secret Dreamworld of a Shopaholic , titled Confessions of a Shopaholic in the US, as well as other fiction. Her books have sold more than 45 million copies worldwide and have been translated into dozens of languages.\n\nFrom journalism to fiction\n\nKinsella did not grow up intending to be a writer. One of three girls born to teachers in London, she played piano and violin as a child and also composed music.\n\nShe told author-publisher Zibby Owens on her podcast, Moms Don't Have Time to Read Books , that the idea of writing never crossed her mind.\n\n\"It wasn't my childhood ambition. I wasn't the child walking around saying, 'I'm going to write a novel one day.'\"\n\nSophie Kinsella's Shopaholic series of books sold more than 45 million copies. (AP Photo/Bebeto Matthews, File) (AP)\n\nKinsella enrolled at Oxford University to study music but switched to the politics, philosophy and economics course after one year.\n\nWhile at college, she met musician Henry Wickham and fell in love. The couple had four sons and a daughter.\n\nAfter graduating, Kinsella began working as a financial journalist and spent her commute reading. The idea to write fiction herself began to take shape on the train, and she worked on her first novel during her lunch hours.\n\nShe published her first novel, The Tennis Party , in 1995, as Madeleine Wickham. Soon after, she left her journalism job to focus on writing. Six other books, including The Gatecrasher and Sleeping Arrangements , followed.\n\n'Shopaholic' success\n\nAn otherwise normal shopping excursion sparked the idea for writing her first Shopaholic novel\n\n\"I remember looking around me and thinking... \"We all shop... We talk about it. We do it. We rejoice in it. We make bad decisions. Why hasn't anybody written about this?\" Kinsella said in 2019 on The Sunday Salon with Alice-Azania Jarvis podcast.\n\nIsla Fisher and Hugh Dancy in the film Confessions of a Shopaholic. (Touchstone Pictures/ YouTube)\n\nKinsella created a story about Becky Bloomwood, a 20-something financial journalist in debt from a shopping habit she can't (or won't) kick. The novel contained hilarious back-and-forth correspondence with bill collectors and banks, where she would make excuses for late payments. Kinsella said those letters were one of the most fun bits to write.\n\nThere was also a love story with a handsome businessman whom Becky met while on assignment. She went on to marry and have a mini-shopaholic daughter in future books.\n\nThe humorous tone of Confessions of a Shopaholic was a change from her earlier books, so she decided to submit it to her publishers under a pen name. Her middle name was Sophie and Kinsella was her mother's maiden name.\n\nThe publishers said yes, and Shopaholic was published in 2000 under her pseudonym. The novel, blending humour with a cautionary tale about getting in over your head with debt, was an immediate success.\n\nKinsella said Becky was a modern everywoman whose behaviour was \"what you wouldn't do yourself, but maybe you would if you were in absolute extreme circumstances. And that's what she finds herself in all the time.\"\n\nAuthor Sophie Kinsella said she never minded her works being described as \"chick lit\" by the media. (Photo by Stefania D'Alessandro/Getty Images) (Getty)\n\nBloomwood's further adventures followed in books including Shopaholic Takes Manhattan , Shopaholic Ties the Knot and Shopaholic & Sister .\n\nAlong with Bridget Jones author Helen Fielding and others, Kinsella's work was often branded \"chick lit\" by the media. She told the AP in 2004 she didn't mind the label, interpreting it as signalling a book that is \"fun, entertaining and might just have a happy ending.\"\n\nThe first two Shopaholic books were adapted into the 2009 film Confessions of a Shopaholic , starring Australian actor Isla Fisher.\n\nIllness and hope﻿\n\nIn November 2022, after experiencing symptoms including memory loss, headaches and balance troubles, Kinsella was diagnosed with glioblastoma, for which there is no cure.\n\nShe kept the news private until April 2024. In an interview with TV personality Robin Roberts aired a few months later, Kinsella said she was focused on living in the moment.\n\n\"I've already lasted more than the average. That's how we get through. We hope,\" she said.\n\nAfter her diagnosis, she wrote a novella, What Does It Feel Like , about a woman with five children who has brain cancer.",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.9news.com.au/national/jims-group-founder-jim-penman-secrets-to-success/17343ff8-e4ce-402a-92c3-0cdf2c894667",
    "title": "Jim turned $24 and a lawnmower into a billion dollar business",
    "publish_date": "Wed, 10 Dec 2025 19:03:31 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Exclusive: In this nine.com.au series, we'll be talking to some of Australia's smartest and sharpest ﻿entrepreneurs, founders and CEOs to find out what makes them tick - and what advice they'd have for anyone starting out.\n\nJim Penman invested $24 to start a mowing business back in 1982; now Jim's Group turns over about $1 billion annually.\n\nIt spans more than 50 brands and has over 5,500 franchisees in Australia, New Zealand, Canada and the United Kingdom, and Penman is still at the helm.\n\nThese are his secrets to success.\n\nJim Penman invested $24 to start a mowing business; now Jim's Group turns over about $1 billion annually. (James Davies)\n\nHow do you start the day to set yourself up for success?\n\nFirst I run for half an hour in the treadmill, I do weightlifting and have a cold shower.\n\nThe other thing I do first thing in the morning is drive my son to school. He's 16 and I've got a busy life I suppose you could say, but I think you should never neglect your family.\n\nThe time that I spend with Aaron, driving him to school and picking him up is incredibly important. He's a great kid, he's got a very lively mind. We discuss all kinds of different things ... but it's also time to bond with him and hopefully have a bit of an influence.\n\nWhat are three daily habits you always stick to?\n\nOne of them is exercise. I'm very, very strong on exercising every day for half an hour to 40 minutes. Running, weightlifting, then a cold shower. It's great for your mood, even in the middle of winter.\n\nI also walk as much as I can, probably another 5000 steps a day on average.\n\nAnd I clear my inbox. That's something that people don't recognise is very valuable. I deal with my inbox as efficiently as I can; I get an email, I file it somewhere, I deal with it.\n\nJim's Group now spans more than 50 brands and has over 5,500 franchisees. (9news)\n\nLots of Aussies are looking for a career change. What small action can help them get ahead of other candidates?\n\nIn terms of applying for a job, that's not something I'm very familiar with because I haven't actually worked for anybody else since I was 18.\n\nI can tell you what I look for in a in a candidate though; I look for character first, experience second, and qualifications last, if at all.\n\nI think a lot of people who are looking for a job should actually consider having their own business of some kind. To me, that's just so much better because when you're going for a job, you're totally in someone else's control. If you have your own business, then you're in charge. You're the boss.\n\nAnd the business doesn't have to be full time, you can start part-time. I started gardening for many years, and then I learned how to do it and got better at it. I suggest people look at a trade, look at the service industry [for a career change].\n\nWhat financial myth did you previously believe that you wish you never bought into?\n\nI wouldn't call it a financial myth, but the worst mistake I've made in business is to think that because you're good at one thing, you'll be good at other things too. It's classic with entrepreneurs.\n\nI know my own industry very well, but every time I've gone away from that into anything like trade, exchange, computers, tourism, I tend to come unstuck. I just don't know what I'm doing.\n\nI also never believe in buying anything based on the idea that someone's going to pay more for it, like crypto. Don't try and beat the market, don't buy something based on speculation. If you're going to invest in something, it should have real value.\n\nSurprise entrant to top 10 most trusted brands in Australia View Gallery\n\nWhat do you wish you could tell your 20 year old self?\n\nThere's a lot of money in grass!\n\nBut if I could go back in time and tell my 20-year-old self, \"this is going to be your future,\" my 20-year-old self would probably say, \"go away old man, you're an idiot. You don't know what you're talking about. There's no possible way this little gardening thing could ever amount to anything at all.\"\n\nI didn't recognise the potential when I was doing it full time, I didn't realise it even when I started franchising. I just didn't comprehend how brilliant the service industry is.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/isaac-council-investigates-complaints-civeo-coppabella/106128686",
    "title": "Mould, food safety complaints spark investigation into Queensland mining camp",
    "publish_date": "Thu, 11 Dec 2025 02:04:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "A Queensland mining camp that can house up to 3,000 fly-in, fly-out workers is being investigated by a local council after it received complaints of mould and poor food handling practices.\n\nIsaac Regional Council said it was examining two complaints about accommodation and food services at the Civeo Coppabella Village, south-west of Mackay, in May and July.\n\nBut a council spokesperson told the ABC it had so far received \"limited information\" from international workforce accommodation provider Civeo.\n\nCyrus Vudrag says he found black mould in his bathroom at the Civeo Coppabella Village. (Supplied: Cyrus Vudrag)\n\nThey said the council was \"seeking further clarification\" on a range of issues, including food handling, cleaning, pest management, laundry operations and mould and moisture management.\n\nCairns miner Cyrus Vudrag said he had made a separate complaint about what he believed were hygiene issues at the camp to his employer in November.\n\nCyrus Vudrag works at a coal mine near the Coppabella camp. (Supplied: Cyrus Vudrag)\n\nMr Vudrag said, like many workers, the camp was a home away from home because he lived there for nine days of every fortnight.\n\nHe said while many miners worked 12-hour shifts which made cleaning difficult, he now brought his own cleaning equipment to the camp.\n\n\"I'm afraid to look under the bed,\" he said.\n\n\"There's mould that's in the rooms, and the condition of the bathrooms … there's no drains in the floor ways.\"\n\nA patch of what appears to be black mould behind a sink in a Civeo Coppabella Village room. (Supplied: Cyrus Vudrag)\n\nOn its website, Civeo said it provided housekeeping and janitorial services in guest rooms along with laundry services including linen inspection and replacement.\n\nLetter of complaint\n\nIn a letter to his employer, Mr Vudrag said he wanted Civeo to add a hand-washing station in the camp's food hall.\n\nHe said he wanted the camp to ensure that mine workers washed their hands before using shared utensils in the communal dining rooms.\n\nThe Civeo Coppabella Village serves meals at Zest, a buffet-style eatery. (ABC Tropical North: Liam O'Connell)\n\nMr Vudrag said he had fallen sick with gastrointestinal viruses several times since he began living at the camp in 2022.\n\n\"It is a serious fatigue management and health issue that needs to be addressed,\" he said.\n\nHe said he felt illnesses that could come about because of hygiene practices could impact safety on mine sites.\n\nHe also raised concerns about mould in living spaces and instances of cleaning staff entering rooms without prior notice.\n\nCiveo investigates claims\n\nMr Vudrag said he had been approached by Civeo Coppabella Camp management after the letter.\n\nHe said they thanked him for his letter and advised that they would be looking for solutions to his concerns.\n\nThe Civeo Coppabella Village has more than 3,000 ensuite rooms. (ABC Tropical North: Liam O'Connell)\n\nThe ABC has been contacted by other residents about conditions at the camp but many chose not to speak publicly due to concerns about potential repercussions from their employers or the camp.\n\nMr Vudrag said he was speaking publicly to improve conditions at the camp.\n\n\"Everyone's got to take accountability,\" he said.\n\n\"The occupants of the camp … they have to speak up.\n\n\"[The] squeaky wheel gets the grease.\"\n\nCiveo also operates a village in Moranbah, about 50 kilometres from Coppabella. (ABC Tropical North: Liam O'Connell)\n\nIn response to questions about the Mr Vudrag's claims, Civeo said it maintained \"robust accommodation, food safety, housekeeping and maintenance processes across all villages\".\n\nThe company said in a statement that it encouraged any residents with complaints to contact their onsite village manager.\n\nCiveo also said it was not aware of an investigation by Isaac Regional Council or \"any associated investigations by any regulatory body\" and that it had not been aware of any other claims from thousands of guests that stayed at its villages.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/ac-milan-serie-a-perth-soccer-game-in-trouble-rita-saffioti-fifa/106129592",
    "title": "Perth's bid to host AC Milan Serie A soccer match in serious doubt",
    "publish_date": "Thu, 11 Dec 2025 01:31:57 +0000",
    "category": "sports",
    "authors": [],
    "text": "Plans to host seven-time European champions AC Milan in Perth for an Italian league game are in trouble, with growing concerns soccer's global governing body will not sign off on the event.\n\nThe landmark Serie A fixture between AC Milan and Como, scheduled to be played in February, has been pitched as a major tourism drawcard for Perth.\n\nIf approved, it would be the first time a major European league has hosted a game for points outside its home region.\n\nBut that requires approval from five different governing bodies, including the international governing body FIFA, along with the Union of European Football Associations (UEFA).\n\nWhile UEFA \"reluctantly\" gave the match its blessing in October, WA's Sport Minister and Deputy Premier Rita Saffioti said yesterday the plans had hit a roadblock with FIFA.\n\nPervis Estupinan is one of AC Milan's star players. (Getty Images: Paul Kane)\n\n\"A number of conditions have been placed on the sanctioning of the game, very late in the piece, conditions that we believe are extremely difficult to meet,\" she said.\n\n\"However, we are working through those with FIFA.\"\n\nThe ABC has been told part of the issue is getting FIFA to agree with conditions imposed by the Asian Football Confederation (AFC).\n\nIt is understood those conditions include that the match not be branded as 'Serie A' and that it use ARC-accredited referees and staff rather than Italians.\n\nAC Milan president 'worried'\n\nAC Milan president Paolo Scaroni has also reportedly expressed concern about the match.\n\n\"I haven't given up on this issue yet, but there are so many authorisations to obtain that I'm starting to get worried,\" he said, according to a translation of his comments in Italian media.\n\n\"If it falls through, it would be a missed opportunity for Serie A, because our goal is to make Serie A attractive around the world.\"\n\nSerie A game in Perth would have been laughable 10 years ago Italian heavyweights AC Milan look set to play a match, for actual Serie A points, in Perth. What will the state government pay to lure them here, and why are some football supporters unhappy?\n\nAC Milan had been looking to play the match in Perth because its home stadium will be out of action for the Winter Olympics opening ceremony.\n\nBut even one of AC Milan's own star players had expressed opposition to the idea, with midfielder Adrien Rabiot describing it as \"totally crazy\".\n\n\"It's crazy to travel so many miles for a match between two Italian teams in Australia,\" he said in October.\n\nPlans for a league clash to be played between Barcelona and Villarreal in Miami this month were also scrapped weeks before it was due to be played after pushback from fans and players.\n\nA protest against the planned Miami game was held at a recent match in Spain, with fans purposely leaving seats empty. (Supplied)\n\nMs Saffioti defended the time and money the government had spent trying to get the event off the ground — including meeting with AC Milan while in Europe in August — describing it as an \"incredible opportunity to market Perth and Western Australia to a global audience\".\n\n\"Our efforts to secure this world-first match have already generated hundreds of millions of dollars' worth of coverage in global media, highlighting how big this event would be for our state,” she said.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/italian-cooking-and-rituals-recognised-by-unesco/106129504",
    "title": "Italian cooking is now a part of the world's 'intangible' cultural heritage",
    "publish_date": "Thu, 11 Dec 2025 01:04:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "The United Nation's cultural agency has given foodies another reason to celebrate their pizza, pasta and tiramisu by listing Italian cooking as part of the world's \"intangible\" cultural heritage.\n\nItalian food is already loved around the world for its palate-pleasing tastes but UNESCO has now added the rituals surrounding Italian food preparation and consumption to its list of the world's traditional practices and expressions.\n\nIt is a designation celebrated alongside the more well-known UNESCO list of World Heritage sites, on which Italy is well represented with locations like the Colosseum and the ancient city of Pompeii.\n\nLoading...\n\nThe citation did not mention specific dishes, recipes or regional specialties, but highlighted the cultural importance Italians place on the rituals of cooking and eating.\n\nSome of those traditions include the Sunday family lunch, the tradition of grandmothers teaching grandchildren how to fold tortellini dough just so, even the act of coming together to share a meal.\n\n\"Cooking is a gesture of love, a way in which we tell something about ourselves to others and how we take care of others,\" said Pier Luigi Petrillo, a member of the Italian UNESCO campaign and professor of comparative law at Rome's La Sapienza University.\n\n\"This tradition of being at the table, of stopping for a while at lunch, a bit longer at dinner, and even longer for big occasions, it's not very common around the world,\" he said.\n\nPremier Giorgia Meloni celebrated the designation, which she said honoured Italians and their national identity.\n\n\"Because for us Italians, cuisine is not just food or a collection of recipes. It is much more: it is culture, tradition, work, wealth,\" she said in a statement.\n\nItaly's prime minister said the recognition honoured Italians and their national identity. (AP: Gregorio Borgia)\n\nMany cultures get recognition\n\nUNESCO meets every year to consider adding new candidates to its lists of \"intangible heritage\".\n\nThere are three types: One is a representative list, another lists practices that are in \"urgent\" need of safeguarding and the third is a list of good safeguarding practices.\n\nThis year, the committee meeting in New Delhi considered 53 nominations for the representative list, which already had 788 items.\n\nOther nominees included Swiss yodelling, the hand loom weaving technique used to make Bangladesh's Tangail sarees, and Chile's family circuses.\n\nIn Italy's submission, the country emphasised the \"sustainability and bio cultural diversity\" of its food.\n\nIts campaign noted how Italy's simple cuisine valued seasonality, fresh produce and limiting waste, while its variety highlighted its regional culinary differences and influences from migrants and others.\n\n\"For me, Italian cuisine is the best, top of the range. Number one. Nothing comes close,\" said Francesco Lenzi, a pasta maker at Rome's Osteria da Fortunata restaurant, near the Piazza Navona.\n\nThe campaign noted how Italy's simple cuisine valued seasonality and fresh produce. (Unsplash: Alexandra Gorn)\n\n\"There are people who say 'No, spaghetti comes from China'. Okay, fine, but here we have turned noodles into a global phenomenon,\" he said.\n\n\" Today, wherever you go in the world, everyone knows the word spaghetti. Everyone knows pizza. \"\n\nMr Lenzi credited his passion to his grandmother, the \"queen of this big house by the sea\" in Camogli, a small village on the Ligurian coast where he grew up.\n\n\"I remember that on Sundays she would make ravioli with a rolling pin,\" he said.\n\n\"This stayed with me for many years,\" he said in the restaurant's kitchen.\n\nAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/grand-designs-cheap-house-320k-how-couple-did-it/106102674",
    "title": "In the depths of a housing crisis, James and Rita built their home for $320k",
    "publish_date": "Thu, 11 Dec 2025 00:55:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Grand Designs Australia has a reputation for featuring the grandest of designs, often with price tags to match.\n\nThe latest season of the show includes the most expensive in the series' history: Lorilie and Gary's $10.3-million concrete behemoth, Horse Shoe Hill.\n\nRita and James, on the other hand, had a budget of just $230,000 and eight months set aside to build their architecturally designed three-bedroom house in NSW's Hunter Valley.\n\nStream Grand Designs Australia on ABC iview Architecture Professor Anthony Burke is back with a brand new series of Grand Designs Australia following some truly brave home builders taking on the challenge of a lifetime.\n\nThat budget blew out to $320,000 and the build took three times as long as anticipated.\n\nBut their home is still one of the cheapest ever on Grand Designs Australia.\n\nIf that wasn't enough, it's also a sustainable home, built using rubbish including old plastic bags, milk cartons and sawdust.\n\nIn the depths of the housing crisis, and with prices continuing to rise, we caught up with them to find out how they did it.\n\nCity living to an intentional community\n\nBack in 2022, Rita and James decided to leave their life in Newcastle behind and bought a block of land outside the city for just $118,000.\n\nPart of the reason the block was so cheap was because it was a share of land in an \"intentional community\".\n\nFor Rita and James, this community is a planned residential collective where members with similar values and a commitment to sustainable living each have their own private house, as well as access to shared spaces on a larger property.\n\nBefore Rita and James decided to settle in an intentional community outside of Newcastle, they lived in five countries together. (ABC/Fremantle Media)\n\nRita says this appealed as the couple \"didn't want to be isolated on a farm\".\n\nThey also wanted their kids to \"grow up in a place where they can see the stars, where they can interact with animals, [and] be around neighbours and friends\".\n\nBut it came with two catches.\n\nThe first was that they were unable to get a loan to finance the build, forcing them to rely on their savings and help from family and friends.\n\n\"Under the arrangement that covers this community, we're shareholders in the company that owns the property and we have a licence to build on a site, but we're unable to use any of that as collateral,\" James explains.\n\nThe second was that the residents of James and Rita's community are expected to build houses that are sensitive to the environment, as part of their broader shared goal of sustainable living.\n\nResidents of the community meet once a week to discuss local issues. (ABC/Fremantle Media)\n\n\"We've got this philosophy about building with materials that are recyclable or biodegradable and zero-toxin,\" James explains.\n\nThis was also partly how they intended to keep costs low while building their dream off-grid home.\n\nThe decision to go against the trend of building larger was another calculated call.\n\n\"Every additional square metre implies more materials and labour costs. So there can be great savings in designing a more modest footprint,\" James explains, adding a \"house with 140 square metres provides ample space for a family of four\".\n\n\"Our bathrooms and bedrooms are a little smaller than the average for a new build but they are definitely comfortable and we have a large enough living space,\" James says. (ABC/Fremantle Media)\n\nThe design for their home, by architect Morten Pedersen, began with eco-packed concrete strip footings with demolition material in the mix, to minimise environmental impact.\n\nThis was to be followed by an earthen floor made from granite, pumice and locally-sourced clay, to help keep the house warm in winter and cool in summer.\n\nThe couple opted for a recyclable steel frame rather than timber, which was to be insulated in biodegradable and breathable wood fibre panels made from waste sawdust, before being finished with clay plaster on the inside.\n\nFor the internal dividing walls, they decided to use panels made from used soft plastics and milk cartons.\n\nEvery off-grid house needs solar and rainwater tanks, and they planned to install a composting toilet and double-glazed windows, with the entire building clad in corrugated iron.\n\nBig savings and a big workload\n\nWork began in July 2023.\n\nDespite being a novice builder trialling experimental methods and materials, James did most of it himself while working part time and staying in a nearby neighbour's shed.\n\nJames and Rita's tips Where you can, do the work yourself\n\nSet up flexible working arrangements where possible\n\nShop around and compare prices\n\nLook for free, used and recycled materials\n\nBe honest about your budget with trades\n\nBuild a solid support system before starting your project\n\nMeanwhile, Rita took care of the children and their pets at a rental property in Newcastle while also working full time and helping out on site whenever she could.\n\nJames's retired builder dad Steve and Rita's father Italo were also heavily involved in the project, and some of the couple's future neighbours and friends helped out over several working bees.\n\n\"One of the biggest factors [in keeping costs low] was that we contributed most of the labour ourselves,\" James says.\n\nRita says building their family's dream house involved two years of \"big sacrifices\". (ABC/Fremantle Media)\n\nThey also saved money by doing their research, comparing prices and buying materials themselves, from second-hand marketplaces where possible.\n\n\"And we'd often ask people: 'Is that the best you can do?'\" Rita says.\n\n\" There were people along the way who we didn't even know who were willing to reduce prices for us. \"\n\nUsing clay from the building site, Rita made tiles for the kitchen inspired by the pottery of her home country, Ecuador, with the help of the couple's children. (ABC/Fremantle Media)\n\nIn a couple of instances, the pair ended up with freebies — from the wood they used to build their deck, to some of the doors in their house.\n\n\"We'd [also] talk to suppliers to ask if they knew of anyone who had over-ordered material, and a few times they did,\" James says.\n\nDads Italo (left) and Steve (right) helped with many elements of the build, including making bricks by compressing soil and clay from the site, mixed with cement and water. (ABC/Fremantle Media)\n\nThe pair say having access to experts they knew personally was another way they were able to pull off their build on a budget.\n\n\"Our architect went above and beyond what he had to do to help us, with talking about different materials, and he was really aligned with [our sustainable] values,\" James continues.\n\n\"And we knew a plumber and an electrician and were able to call and ask for advice on how to do things in a budget-friendly way.\"\n\n\"It was a lot of human contribution and good intentions … and all the small things adding up … that made this possible,\" Rita adds.\n\nTwo years later, it's done\n\nWhile James and Rita have only been in their new house for a few weeks, they've found living in an intentional community to be much the same as a traditional neighbourhood.\n\n\"Except we have a better relationship with our neighbours,\" Rita says.\n\nThe corrugated iron James and Rita's house is clad in wraps over the edges, which should help keep out everything from bugs to bushfires. (ABC/Fremantle Media: Sally Griffiths)\n\n\"It's a human thing, to want to be connected,\"James adds. \"It's very easy these days to be isolated and an intentional community is a nice way of balancing that out.\n\n\"There's so much stigma attached to intentional communities, and of course there are examples where they're not very healthy or a bit odd.\n\n\"But I think the positives far outweigh the negatives, especially if you have young kids.\"\n\nThe wood fibre panels the couple used for their ceiling were made using waste sawdust. (ABC/Fremantle Media: Sally Griffiths)\n\nJames thinks of their house as a dream come true. Rita describes it as even \"better than a dream\".\n\nBut now the adrenaline is out of their systems, they're just starting to come to terms with the true price of creating it.\n\nJames says the earthen floor was the \"most labour-intensive and time-consuming\" element of the build. (ABC/Fremantle Media: Sally Griffiths)\n\n\"We made a lot of big sacrifices to get here. For two years, we couldn't show up for things, for friends … this house was our whole life … it's so consuming,\" Rita says.\n\nAnd then, suddenly, it was over.\n\n\"You feel so flat … it was a really weird feeling.\n\n\"It's like when people are about to have a baby … no-one prepares you for what comes after.\"\n\nThe finished kitchen, featuring the tiles Rita and her children painstakingly made by hand. (ABC/Fremantle Media: Sally Griffiths)\n\nThe couple have a message for anyone contemplating a project such as theirs.\n\n\"Check if your support network is solid before getting into something like this,\" James says.\n\n\"Building a house is a really big undertaking, and it's good to have some people to fall back on when you need a bit of help.\"\n\nAnd Rita says there's a plus side to doing this.\n\n\" You might be surprised with the willingness people have to help contribute to your vision becoming a reality. \"\n\nWatch the new season of Grand Designs Australia free on ABC TV and ABC iview.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/australia-unemployment-rate-november-2025/106129300",
    "title": "Breaking: Australia's unemployment rate remains at 4.3 per cent, but underemployment surges",
    "publish_date": "Thu, 11 Dec 2025 00:51:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's unemployment rate held steady in November at 4.3 per cent, in seasonally adjusted terms.\n\nBut the underemployment rate jumped from 5.7 per cent to 6.2 per cent, its highest in more than 12 months.\n\n\"A nasty set of labour market figures gives the Reserve Bank a lot to think about over Christmas,\" Callam Pickering, APAC economist at global job site Indeed said.\n\nAustralian Bureau of Statistics (ABS) data show the number of employed people fell by 21,300 last month and the number of unemployed fell by 2,100.\n\nRBA board has 'appetite' for rate hikes The RBA keeps rates on hold in December at 3.6 per cent. The governor says it would be wrong to think the central bank isn't prepared to raise rates.\n\nThe size of the labour force shrank by 23,400 people and the participation rate fell by 0.2 percentage points to 66.7 per cent.\n\nFull-time employment declined by 57,000 people, but that was partially offset by part-time employment rising by 35,000.\n\nThe youth unemployment rate (15 to 24 years) also jumped from 9.7 per cent to 10.2 per cent.\n\nThe news comes after the Reserve Bank left interest rates on hold this week at 3.6 per cent.\n\n\"Labour market conditions still appear a little tight but further modest easing is expected,\" the RBA board said on Tuesday. \"The board therefore judged that it was appropriate to remain cautious, updating its view of the outlook as the data evolve.\"\n\nWhat do economists say?\n\nHarry Murphy Cruise from Oxford Economics Australia said the data suggests \"all is not rosy\" in Australia's labour markets.\n\n\"The picture is of a labour market that is gradually losing momentum: participation is edging lower, unemployment is creeping higher, and forward indicators such as job ads suggest firms are becoming more cautious about hiring,\" he said.\n\nForget AI. Here's a real Aussie bubble Amid global warnings of impending financial doom, APRA and the Reserve Bank are far more concerned about a home-grown bubble, one that's been taking in oxygen for almost three decades.\n\n\"Taken together, this points to unemployment drifting higher over the coming months,\" he said.\n\nAbhijit Surya from Capital Economics said the correction in employment was always a possibility given the strong rise in employment the month before.\n\nAnd he said he wasn't too concerned about the data, but if employment growth weakened more meaningfully from here \"it will be a cause for concern for the RBA\".\n\n\"It's also worth mentioning that despite the monthly decline in jobs, annual employment growth only fell from 1.6 per cent to 1.3 per cent which is no weaker than the RBA had predicted in its November Statement on Monetary Policy,\" he said.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/accc-opposes-sale-of-racwa-to-sydney-company-iag/106128754",
    "title": "Competition watchdog opposes sale of WA's biggest insurer to east-coast giant",
    "publish_date": "Thu, 11 Dec 2025 00:32:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's consumer watchdog has opposed the proposed sale of WA's biggest insurer to an east-coast industry giant, saying the deal would dramatically reduce competition and likely lead to higher premiums.\n\nThe Royal Automobile Club of WA (RAC WA) is looking to sell its entire insurance operations to Insurance Australia Group Ltd (IAG) in a $1.35 billion deal.\n\nFollowing an investigation, the Australian Competition and Consumer Commission (ACCC) found the proposal would lead to \"a substantial lessening of competition in the supply of motor vehicle insurance and the supply of home and contents insurance in Western Australia\".\n\nIf the deal went ahead, the ACCC said IAG would end up with a market share of about 55 to 65 per cent in motor vehicle insurance, and about 50 to 60 per cent in home and contents insurance in WA.\n\nHigher premiums\n\nACCC chair Gina Cass-Gottlieb said the deal \"would eliminate the significant competition\" between the two companies and \"reduce the competitive pressure they each place on rival insurance brands\".\n\n\"We concluded that the acquisition would be likely to allow IAG, after acquiring RAC Insurance, to increase premiums and reduce the quality of its suite of insurance products, with likely flow-on effects to the offerings of other insurers.\"\n\nThe ACCC says the deal would likely result in higher premiums for members. (ABC News: Jake Sturmer)\n\nThe ACCC found the merger would make it difficult for smaller insurers to remain competitive.\n\n\"Given the historical difficulties rivals have had growing their share in Western Australia, the ACCC is concerned that IAG would face insufficient competitive constraints post-acquisition,\" Ms Cass-Gottlieb said.\n\nRAC WA is Western Australia's largest insurer and IAG is the biggest in the nation, with a portfolio including major brands like NRMA and CGU.\n\nInsurers to fight decision\n\nBoth RAC and IAG released statements on Thursday saying they plan to lodge applications with the competition watchdog to reassess the deal under the new \"mandatory control regime\", a new system for reviewing large mergers and acquisitions that takes effect on January 1.\n\nRACWA sells insurance operations to IAG RACWA has announced a 20-year deal with insurance company Insurance Australia Group, handing over its entire insurance underwriting business.\n\n\"While we are naturally disappointed with this outcome, we acknowledge the role of regulators and the process undertaken,\" the RAC statement said.\n\n\"We still believe the proposed partnership has merit and would be beneficial for our teams and members.\n\n\"RAC remains committed to pursuing the partnership and supports this next step.\"\n\nThe deal would see RACWA sell off its insurance arm, which generated $290 million in net income last financial year, but it would retain the Roadside Assistance branch.\n\nIn an interview in September, RAC Group chief executive Rob Slocombe said IAG had agreed to maintain a WA workforce, at least initially.\n\n\"Over time that may change as more technology comes in and various things change, but IAG has committed to keeping a significant claims handling presence here in Western Australia,\" he told ABC Radio Perth.\n\nIAG Managing Director and chief executive Nick Hawkins said the acquisition would \"enhance the RAC member experience and ensure greater resilience to industry challenges\".\n\n\"IAG and RAC have proven track records of successful partnerships and are committed to delivering competitive and accessible insurance products for all Western Australians,\" he said.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/afl-collingwood-employee-resigns-alcohol-fuelled-incident/106128612",
    "title": "Collingwood staffer quits after alcohol-fuelled training camp incident",
    "publish_date": "Thu, 11 Dec 2025 00:29:09 +0000",
    "category": "sports",
    "authors": [],
    "text": "A Collingwood football department staffer has resigned after an alcohol-related incident during a club camp in the Northern Territory.\n\nThe unnamed male staffer quit after acting inappropriately when intoxicated on the final night of the trip in Alice Springs.\n\nCollingwood did not detail the specifics of the incident in its statement released on Thursday.\n\n\"Collingwood can confirm that an incident occurred during recent interstate travel that required investigation by the club,\" the Magpies said in the statement.\n\nLoading Instagram content\n\n\"As soon as the club became aware of the incident, it moved quickly to address the matter and during this process, the employee involved tendered their resignation, which the club accepted.\n\n\"Our focus remains on supporting all team members and ensuring our environments remain professional and consistent with the values we stand for.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe incident happened at the conclusion of Collingwood's recent cultural immersion program, which started in Tennant Creek before moving to Alice Springs.\n\nAll first-year AFL and AFLW players, plus staffers and board members, were understood to have attended the camp.\n\nIn a joint social media post by the Pies' AFL and AFLW accounts on November 29, the club published several images from the camp.\n\n\"A group of our athletes, staff, and board members spent the week training in unfamiliar conditions and learning about Country in Tennant Creek for our annual cultural immersion program,\" the post said.\n\n\"Tennant Creek is situated 500km north of Alice Springs, and lies within our Next Generation Academy (NGA) zone.\n\n\"Part of our annual induction for new players, the cultural immersion program focuses on fostering meaningful connection, deepening understanding and working side by side with the local community.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/super-fund-hesta-hit-with-extra-conditions-apra-governance-risk/106128664",
    "title": "Regulator acts against super fund HESTA after 'severe, prolonged disruption'",
    "publish_date": "Thu, 11 Dec 2025 00:25:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "One of Australia's largest superannuation funds HESTA has been hit with regulatory action, after a \"severe, prolonged disruption\" that left 1.1 million Australians unable to access their funds for weeks.\n\nThe Australian Prudential Regulation Authority (APRA) has imposed additional licence conditions on HESTA, raising concerns about the fund's risk management and board governance during its transition from one outsourced administration provider to another earlier this year.\n\nAPRA said the transition, which led to a seven-week planned outage and ongoing problems for some members even after full services were restored, \"resulted in a severe, prolonged disruption to member services and caused direct harm to members\".\n\n\"While some disruption is unavoidable when changing service providers, APRA expects that any transitions are well managed and do not result in any unnecessary impact on members' ability to access their accounts,\" APRA deputy chair Margaret Cole said.\n\nIn a damning assessment of HESTA, the regulator said it had identified deficiencies in the fund's board governance and management of risks which rendered it inadequately prepared to effectively oversee and manage the transition.\n\n\"APRA's imposition of licence conditions mean that HESTA is required to take prompt action to address deficiencies. APRA will utilise its powers to hold trustees accountable to meet their obligations to members,\" Ms Cole said.\n\nHESTA customers are unable to log in to their accounts until June. (ABC News: Stephanie Chalmers)\n\nIn a statement, HESTA chief executive Debby Blakey said the fund took the matters raised by APRA \"very seriously and are cooperating fully with the regulator to resolve them\".\n\n\"We apologise to members who experienced delays during our transition to a new administration provider.\n\n\"Since the transition we have worked closely with our administration provider to seek to deliver the level of service our members expect and deserve.\n\n\"We are committed to implementing any potential improvements identified so we can better support our members now and into the future.\"\n\nThe superannuation fund will now be required to conduct separate independent reviews of its risk management framework and board effectiveness, to comply with its extra licence conditions.\n\n'Should be a lesson for all funds'\n\nIn April this year, HESTA underwent a planned outage that affected its more than 1 million members, as it transitioned its administration services over to a new platform, GROW.\n\nMembers were unable to access most services, including online accounts.\n\nSuper contributions and investment switches were unable to be processed until after the outage, as well as withdrawals and insurance claims.\n\nThe planned outage was announced in February, with HESTA's chief executive Debby Blakey describing it as \"the largest technology project in HESTA's 38-year history\".\n\n'Just gobsmacked': HESTA super outage A consumer advocacy group has called for transparency around why the seven-week HESTA super fund outage was approved.\n\nDespite the fund's communications, dozens of members who contacted the ABC said they were not aware of the outage until it had begun, with some only finding out about it in reporting.\n\nOne HESTA member came close to losing his home deposit after struggling to access his super during the planned outage, while another woman said she had to cancel surgery because she couldn't draw down on her superannuation fund.\n\nAnother man was concerned his wife would lose her place at a nursing home because he could not access super to pay the deposit.\n\n\"It's always a concern in the back of my mind, I'm visiting her every day, and it would be nice to have this part of it finalised so we can keep going,\" Glynn Lewis told the ABC back in June.\n\nConsumer advocates were scathing of HESTA's communications with members and conduction during the period of disruption.\n\nOn Thursday, Super Consumers Australia welcomed the imposition of licence conditions by APRA.\n\n\"This raises serious concerns about the HESTA board and executive's ability to look after their members. HESTA caused serious harm by failing to deliver basic services, with many unable to contact their fund for months,\" the group's chief executive Xavier O'Halloran said.\n\n\"People lost access to their money, faced extreme uncertainty and wasted time because of these failures.\n\n\"We heard from one grandmother who was forced to pick up her grandchildren on a bike after she was unable to access her money at HESTA to pay for urgent costs after her car broke down.\"\n\nMr O'Halloran said it should be \"a lesson to all funds going through similar transitions, they need to put members' interests first and properly resource their customer service\".\n\nSuper Consumers called on the federal government to implement mandatory customer service standards in super, \"to send a clear message to funds that they need to lift their standards or face serious repercussions\".\n\nAPRA said the independent reviews HESTA will be required to carry out will be comprehensive in scope and will consider the fund's management of the transition.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/michigan-football-coach-sherrone-moore-fired-staffer-scandal/106128866",
    "title": "'Inappropriate relationship' with staffer sees $5.5m-a-year coach sacked",
    "publish_date": "Wed, 10 Dec 2025 23:21:51 +0000",
    "category": "sports",
    "authors": [],
    "text": "Michigan has fired football coach Sherrone Moore behaviour after finding evidence of an \"inappropriate relationship with a staff member\".\n\nIt has brought a stunning end to his short, up-and-down tenure that saw the Wolverines take a step back on the field after winning the national championship.\n\n\"This conduct constitutes a clear violation of university policy, and U-M maintains zero tolerance for such behaviour,\" athletic director Warde Manuel said.\n\nThe announcement did not include details of the alleged relationship.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nMoore, who was 8-5 in his debut season and 9-3 this year, did not return a message seeking comment left by The Associated Press.\n\nThe 39-year-old Moore signed a five-year contract with a base annual salary of $US5.5 million ($8.2 million) last year.\n\nAccording to the terms of his deal, the university will not have to buy out the remaining years of Moore's contract because he was fired for cause.\n\nCollege football's most successful program is suddenly looking for a third coach in four years, shortly after a busy cycle that included Lane Kiffin leaving playoff-bound Ole Miss for LSU.\n\nMoore, the team's former offensive coordinator, joined the program in 2018 and was promoted to lead the Wolverines after they won the 2024 national title to succeed Jim Harbaugh when he returned to the NFL to lead the Los Angeles Chargers.\n\nThe 18th-ranked Wolverines (9-3, 7-2 Big Ten) are set to play No.14 Texas on December 31 in the Citrus Bowl.\n\nMoore, in his second season, was suspended for two games in 2025 as part of self-imposed sanctions for NCAA violations related to a sign-stealing scandal.\n\nThe NCAA added a third game to the suspension, which were to keep Moore off the sideline for next year's opener against Western Michigan.\n\nMoore will now miss that game for another reason.\n\nHe previously deleted his entire 52-message text thread on his personal phone with former staffer Connor Stalions, who led the team's sign-sealing operation for the program. The texts were later recovered and shared with the NCAA.\n\nBiff Poggi, who filled in for Moore when he was suspended earlier this season, will serve as the team's interim coach.\n\nAP",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/nicole-kidman-beyonce-venus-williams-chair-met-gala/106128614",
    "title": "Nicole Kidman to co-chair Met Gala with Beyoncé and Venus Williams",
    "publish_date": "Wed, 10 Dec 2025 22:45:43 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Australia's Nicole Kidman has been announced as a co-chair of the Met Gala alongside Beyoncé, Venus Williams and Anna Wintour for the star-studded event next May.\n\nWilliams, who has never hosted before, takes the role seven years after her younger sister and fellow tennis champion, Serena, was co-chair.\n\nBeyoncé was honorary chair in 2013, and Kidman co-chaired in 2003 and 2005.\n\nWintour, of course, oversees the annual event, a fundraiser that last year brought a record $US31 million ($46 million) to the coffers of the Metropolitan Museum of Art's Costume Institute.\n\nThe museum on Wednesday also announced a gala host committee, chaired by designer Anthony Vaccarello and filmmaker Zoë Kravitz.\n\nIt includes musicians Sabrina Carpenter, Doja Cat, LISA, Sam Smith and Yseult; dancer Misty Copeland; actors Teyana Taylor, Elizabeth Debicki, Gwendoline Christie and Lena Dunham; basketball player A'ja Wilson; models Alex Consani, Paloma Elsesser and Lauren Wasser; Vogue editor Chloe Malle and artist Anna Weyant.\n\nBeyoncé was honorary chair in 2013. (Reuters: Eduardo Munoz)\n\nFor years, Beyoncé, a seven-time gala guest, has been one of the most-watched celebrities on the carpet, keeping everyone in eager anticipation of her (fashionably) late arrival.\n\nIn 2015, she made it worth the wait with a daring custom Givenchy gown that, with its strategically placed beading, gave new meaning to the term \"sheer\" and heralded the ubiquity of the naked dress trend.\n\nA year later, the superstar again wore Givenchy, this time in a gleaming, skin-tight latex gown.\n\nAnna Wintour oversees the star-studded event. (Reuters: Andrew Kelly)\n\nThe dress code for the May 4 event is yet to be announced, but it will dovetail with the theme of Costume Art, announced last month as the institute's next spring exhibit.\n\nThe exhibit aims to celebrate \"the dressed body\" as it appears in art through the centuries.\n\nIt will do that by pairing garments with objects from across the museum to show how fashion has long been intertwined with different art forms.\n\n\"It's a show that can really live in fascinating ways at the museum and can pull from all different areas of our collection — paintings, sculpture, drawings,\" the museum's CEO and director, Max Hollein, said in an interview last month.\n\nVenus Williams will host for the fist time in 2026. (AP: Evan Agostini/Invision)\n\nThe show, overseen as always by the Costume Institute's curator in charge, Andrew Bolton, will be organised thematically by different body types.\n\nIt will include the Naked Body and the Classical Body, for example, but also less traditional themes like the Pregnant Body and the Aging Body.\n\nThe new exhibit will also have a splashy new home.\n\nCostume Art will inaugurate new gallery space occupying 1,115 square metres, right off the museum's Great Hall — giving fashion a prominent space in the museum and also helping to control congestion at the heavily attended exhibits.\n\nThe new Conde M Nast galleries — created from what was formerly the museum's retail store — will house not only all spring Costume Institute exhibits, but other shows from different parts of the museum.\n\nBolton has said the gallery space \"will mark a pivotal moment for the department, one that acknowledges the critical role fashion plays not only within art history but also within contemporary culture\".\n\nCostume Art opens to the public May 10, 2026, and runs until January 10, 2027.\n\nAP",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/phillip-island-motogp-contract-extension-business-cowes-san-remo/105802952",
    "title": "Phillip Island's MotoGP contract expires next year and locals are campaigning to keep on track",
    "publish_date": "Wed, 10 Dec 2025 22:30:25 +0000",
    "category": "sports",
    "authors": [],
    "text": "Rosa Scarlato wears her passion for Phillip Island's iconic MotoGP race with pride.\n\nSo much so, that when the annual event comes to town, she says it becomes more important to her than her own family.\n\n\"The track brings a lot of business to the island. The MotoGP is so strong. I'm nearly 74, and whenever they come, I feel like a 20-year-old. My family doesn't exist, the bike is number one.\"\n\nMs Scarlato, whose family has operated Pino's Trattoria in Cowes since 1991, is worried the event could be lost interstate or even overseas when its 10-year contract expires in 2026.\n\nTourism and hospitality businesses in Cowes on Phillip Island rely on the MotoGP. (Supplied: Bass Coast Shire Council)\n\n\"Without the track, the island doesn't survive,\" she said.\n\nThe MotoGP has been held on Phillip Island since 1997 and is the island's biggest tourism event.\n\nLast year, it attracted 91,000 spectators.\n\nMarco Bezzecchi of Italy racing in the Australian Motorcycle Grand Prix at Phillip Island. (AAP: Joel Carrett)\n\nBut the Victorian government has not secured an extension to its contract with the Australian Grand Prix Corporation to host the race on Phillip Island, leading a group of businesses and the local council to lobby the government to help secure the event's future.\n\n\"The racetrack has been fantastic over the years. But with the business, you need a bit of support from the government,\" Ms Scarlato said.\n\nPhillip Island has been the home of MotoGP since 1997. (Supplied: Ading Attamimi)\n\nA fuel injection\n\nThe annual race injects an estimated $60 million into the local community each year.\n\nBass Coast Shire Council mayor Rochelle Halstead said the council has been pushing the Victorian government to secure the contract for the iconic race to stay on the island.\n\nRochelle Halstead wants the government to work hard to renew the contract for the MotoGP at Phillip Island. (Supplied: Jarrod Whittaker)\n\n\"Initially, racing started here in the 1920s. The community has poured its heart and soul into this, and it has a huge economic benefit,\" she said.\n\n\"Like any contract that comes available, there are people on the fringes who'd love to snatch it from us. And not just neighbours interstate, this event could be stolen to an international city.\n\n\"We want to get ahead of the game and ensure the government is doing everything it can to keep the event.\"\n\nCasey Stoner won the MotoGP on Phillip Island in 2011 to secure his second world championship. (Getty Images: Robert Cianflone)\n\nIn a statement a Victorian government spokesperson said the government was \"proud to back\" the event.\n\n\"The Australian Motorcycle Grand Prix is synonymous with Phillip Island — we are proud to back this much-loved, iconic event that showcases the best of the Bass Coast to a global audience,\" the spokesperson said.\n\nA spokesperson for the Australian Grand Prix Corporation said Phillip Island was an \"iconic destination\" and one of the most renowned circuits on the MotoGP calendar.\n\nThe ABC understands conversations in relation to the MotoGP beyond 2026 are ongoing and are commercial in confidence.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/wnba-studbudz-natisha-hiedeman-courtney-williams-sport-marketing/106090546",
    "title": "'The gays are here': How WNBA stars are revolutionising sports media",
    "publish_date": "Wed, 10 Dec 2025 22:25:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "It's Big Brother meets a late-night talk show, hosted by two of the WNBA's newest stars.\n\nIt might be slightly unconventional, but Natisha Hiedeman and Courtney Williams have built a platform that celebrates their unique personalities while giving behind the scenes insights into the WNBA.\n\nAnd the unexpected pair have highlighted what could be the future of marketing for female athletes in a digital age.\n\n'Representing the community'\n\nHiedeman and Williams are known as the \"StudBudz\" on Twitch, where they stream all aspects of their lives from the banal, including sleeping, to the ambitious 72-hour continuous marathon over WNBA All-Star weekend.\n\nLoading Instagram content\n\nAnd with their pink hair and infectious personalities, they've not only brought new fans to the league, but taken the term \"stud\" mainstream.\n\nBased in African American culture, it refers to lesbians, influenced by urban and hip-hop culture that mostly appear masculine or wear masculine clothes.\n\n\"We are representing the community, we got the gay community on our back, we are showing the world the gays are here,\" Williams said, speaking to SLAM Magazine.\n\nJust as Arsenio Hall revolutionised late-night television in the late 1980s and early 90s, the StudBudz are attempting to do the same in a very 2025 way.\n\nThe conversations are random, inappropriate at times, ranging from fashion to basketball to dating, and nothing seems to be out of bounds for the two.\n\nLoading Instagram content\n\nThey have found the perfect platform to reach their audience — Twitch.\n\nIt has existed for over 10 years, coinciding with the emerging esports landscape.\n\nIt is a live-streaming site mainly used by gamers and content creators who can broadcast and interact with the audience in real time, and it has developed into a space where everyone can find their niche.\n\nAccording to Mark Johnson, a senior lecturer in digital cultures at the University of Sydney, there is no limit to the content available on the platform.\n\n\"You can watch people making music, [playing] pool, climbing mountains or playing piano or tabletop games … pretty much anything as long as it's legal,\" Dr Johnson said.\n\nFinding an audience\n\nAthletes streaming is nothing new.\n\nNBA players have been doing it for years, through the likes of Kyrie Irving, Jaylen Brown and Karl-Anthony Towns.\n\nBut while most stream themselves playing a video game or sitting and chatting, Williams and Hiedeman bring something different.\n\nHiedeman and Williams have spent the past two seasons at the Minnesota Lynx. (Getty Images: Ellen Schmidt)\n\nThey have proven there is an audience for content driven by female athletes, particularly in sports which have been traditionally dominated by male athletes.\n\nDr Johnson said this could be the future for athletes.\n\nHe said a pre-established brand and audience could help cut through digital noise to create an online community by having a unique product.\n\n\"If you are a well-known sports person that could be you basically just being you,\" he said.\n\n\"People will be looking for you as the sports person to be much more your authentic everyday self than maybe the more curated self one might see in interviews.\"\n\nThe StudBudz stream started with a small audience and they have managed to grow it organically.\n\nThey had their breakout moment during the 2025 All-Star weekend, where they streamed non-stop for three days.\n\nWilliams was playing in the game, while Hiedeman was a spectator.\n\n\"All-Star was a movie, 72 hours, they had us booked and busy, to have everyone peek their head in and see how people are in their regular day, not just that competitive basketball lane,\" Williams told SLAM Magazine.\n\nWilliams said the WNBA was supportive of the duo, giving them behind-the-scenes access and highlighting their presence.\n\nThey took viewers into the dressing rooms, and all the parties where they danced and flirted with fellow WNBA players like Angel Reese, told world-renowned DJ Diplo what songs he should be playing and joked about how Caitlin Clark could get anything done with just a simple phone call.\n\nThey dominated the weekend and became the place to be.\n\nEven host broadcaster ESPN got in on the action, having the duo on one of their panels.\n\nHiedeman and Williams joined host broadcaster ESPN twice during their 72-hour live stream. (Getty Images: Steph Chambers)\n\nThe exposure saw them change from an \"if you know, you know\" account to \"you have to know\".\n\nWith 10,000 followers after two weeks, the pair jumped to over 70,000 followers after the All-Star weekend.\n\nBrand success followed with major endorsements rolling in, with everyone wanting to join the party.\n\nTheir success has not just been limited to brand sponsorships, with the duo creating their own line of clothing for the audience, generating another revenue stream.\n\nDr Johnson said newer social media and streaming platforms were a good way for female athletes to engage with an audience that was not already saturated with professional athletes.\n\n\"A good example here is the women's football World Cup and the Euros,\" he said.\n\n\"The fan base there is very young compared to the fan base for men's football, so those are going to be people that are much more tech-native and much more comfy with Twitch and streams … so I think it could be successful.\"\n\nBuilding beyond the court\n\nIt is something new Adelaide Lightning signing Sania Feagin is thinking about.\n\nShe hails from one of the biggest women's college basketball programs at South Carolina, also the school of four-time WNBA MVP A'ja Wilson.\n\nSania Feagin joined the Adelaide Lightning during the WNBA off-season. (Getty Images: Daniel Pockett)\n\nDrafted by one of the biggest WNBA teams in the LA Sparks, the 22-year-old is not only focused on her game, but the brand she wants to create.\n\nShe spent the past season with the Sparks at the same time the StudBudz found their groove.\n\n\"I know a lot more people are trying to get into content as in Twitch … but to see the inside world of WNBA players is actually very interesting,\" Feagin said.\n\n\"Maybe in a few years I'll probably get into streaming and stuff of that nature.\n\n\"It is fun to sit here and tell my story … if I have more opportunities to have digital ways of sharing my story, I would most definitely love to do it.\"\n\nAs for the StudBudz, they have no plans of slowing down, and have already shared dreams of going from the court to the Met Gala, the Grammys and beyond.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-11/tasmania-st-helens-stieglitz-fire-threat-eases-road-reopening/106128334",
    "title": "Firefighters hoping to let Stieglitz residents in soon, as blaze contained",
    "publish_date": "Wed, 10 Dec 2025 22:14:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "Firefighters are hoping to reopen the road to residents of a bushfire-struck community on Tasmania's east coast today, as the fire between Dianas Basin and Stieglitz is brought under control.\n\nThe blaze has been contained, and fire crews and emergency services are working to consolidate the fireground.\n\nA watch and act alert is currently in place for residents of Parkside, Parnella, Stieglitz, Dianas Basin and Flagstaff Hill.\n\nAll are being advised to monitor conditions.\n\nFor local alerts and advice on what to do before, during and after a bushfire, check ABC Emergency and listen to ABC Radio.\n\nTasmania Fire Service (TFS) incident controller David Casteller said conditions had eased overnight.\n\n\"There's minimal fire activity at the moment,\" he said.\n\nFirefighters protected houses near Stieglitz on Wednesday. (Supplied: Tasmania Fire Service)\n\n\"Our focus for today [Thursday] is just going to be to consolidate the containment lines to keep that fire within its current boundary.\n\n\"The weather conditions today are going to be favourable for our crews on the ground.\n\n\"Our other key focus is going to be dealing with some dangerous trees that were impacted by the fire on Tuesday night and clearing St Helens Point Road.\"\n\nSt Helens Point Road, near Stieglitz, was still closed on Thursday morning. (ABC News: Luke Bowden)\n\nCrews are targeting the western edge of the fire, which is running parallel to the Tasman Highway.\n\nTFS deputy chief Matt Lowe said teams would assess tree and power pole damage today, with tree fellers at the scene.\n\nSt Helens Point Road is currently closed.\n\n\"We're hoping to review that this afternoon in the hope of opening the road and allowing the community back into that area,\" he said.\n\nFirefighters were still working to contain the blaze on Wednesday. (Supplied: Tasmania Fire Service)\n\nFour helicopters, 22 appliances and 60 personnel from Tasmania Fire Service, Tasmania Parks and Wildlife, Sustainable Timber Tas and Tasmanian Aboriginal Centre will contribute to Thursday's efforts.\n\nThe fire ignited on Tuesday afternoon and quickly escalated to emergency level, before being downgraded overnight.\n\nIt jumped back to emergency level again on Wednesday, then was later downgraded to watch and act.\n\nLoading...\n\nMr Castella said two residential properties in the St Helens Point Road area had been destroyed, as well as numerous outbuildings and caravans.\n\n\"Considering the conditions that were faced on Tuesday night, it certainly could have been a lot worse,\" he said.\n\nMeanwhile, residents of Dolphin Sands, further down Tasmania's east coast, are advised they can return with caution.\n\nMr Lowe said there would be heightened fire danger on Friday in the south, and then into Sunday in the north and south.\n\n\"We'll manage those as we do, we'll stand up resources where required, and manage what comes,\" he said\n\nAbout 60 personnel will help with the firefighting effort on Thursday. (Supplied: Tasmania Fire Service)\n\nResidents anxious to assess homes\n\nStieglitz resident Paul Donaldson said residents who had evacuated were feeling \"a bit of anxiousness\".\n\n\"The emergency services are not taking any chances, and nor should they,\" he said,\n\n\"From what I understand from talking to different people around town, they appreciate that and they fully understand that.\n\n\"I've got the advantage of having some security cameras around home, so when the power went on late yesterday afternoon, I was able to log into my camera, and my house and shed is okay at this stage.\"\n\nRoads need to be cleared and dangerous trees and branches felled. (Supplied: Tasmania Fire Service)\n\nAlong with her brother and a friend, April Bosworth has been ferrying people and pets, and necessities like generators and food, to the Stieglitz boat ramp.\n\n\"I've had people messaging me asking if we've seen their house, which a lot of them I have seen … and they are mostly standing,\" she said.\n\n\"Basically, it's just been a very stressful 24 hours.\n\n\"A lot of people were frustrated, which I totally understand, to get in back to their house and checking what's happened, what's the damage and what's going into the new year.\n\n\"I haven't had much sleep.\"\n\nBushfire smoke seen behind a home on Parnella Drive, in Stieglitz, on Wednesday. (Supplied: Amanda Pritchard)\n\nThe TFS said carting supplies is not a risk, so long as people stay out of the active fire ground and meeting point at Steiglitz wharf.\n\nMs Bosworth said at the height of the fire she could see embers from her home in St Helens.\n\nLoading...\n\n\"We could see the glow from our house at night time, that's how big it was,\" she said.\n\n\"A fair few people did decide to stick around [Stieglitz] to try and fight it off, but a lot of people after that, they couldn't evacuate by road anymore.\n\n\"They went down to the boat ramp, there are a lot of caravans hanging around, large boats, classic cars that basically all just congregated down at the boat ramp there at Stieglitz.\"",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/business/consumer-affairs/skydiver-dangles-from-plane-tail-after-parachute-snags-20251211-p5nmti.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Skydiver dangles from plane tail after parachute snags",
    "publish_date": "Thu, 11 Dec 2025 13:06:42 +1100",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "A flight almost ended in tragedy in September when a skydiver’s parachute got caught on the tail of a plane over Far North Queensland.\n\nThe parachutist was climbing out of the Cessna Caravan plane’s side door, when the handle for their reserve parachute snagged on the wing flap, accidentally deploying the parachute in the process, according to a report released on Thursday by the Australian Transport Safety Bureau.\n\nOnce caught, the parachutist was left dangling from the plane’s tail, leaving his legs flapping in the winds at 15,000 feet.\n\nThe skydiver’s feet then struck the plane’s left horizontal stabiliser, which jolted the plane, making it hard for the pilot, unaware of the incident unfolding, to control.",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-more-parliamentarians-embroiled-in-expenses-scandal-teens-face-day-two-of-social-media-ban-20251211-p5nmpd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: More parliamentarians embroiled in expenses scandal; Teens face day two of social media ban",
    "publish_date": "Thu, 11 Dec 2025 13:03:36 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Prime Minister Anthony Albanese has clashed with reporters as he refused to concede to calls from his political opponents for reform to the parliamentary travel expenses.\n\n“These are rules that have been set for some period of time. They’re rules that are in place in terms of family reunion to enable people to actually engage with their partners,” Albanese told reporters in Canberra, where he was peppered with questions about whether the rules needed to be reviewed as ongoing revelations make headlines.\n\n“They’ve been in place for some time, and we haven’t changed the rules. We haven’t added to any entitlements. The rules have been there since they were put in place by the former government.”\n\nPrime Minister Anthony Albanese and Communications and Sport Minister Anika Wells address the media after meeting with students and staff during a visit to St John Paul II College in Canberra today. Credit: Alex Ellinghausen\n\nWhen it was put to the prime minister that parliament had the power to change the rules through legislation, he repeatedly said: “I haven’t changed the rules”, adding “I’m not the finance minister”.\n\nThe prime minister tried to return to the subject of the social media ban, which he was holding the press conference to promote, and became agitated as he kept getting asked about expense entitlements.\n\n“What I’m focused on today is an issue which is a revolution. You will talk about [the ban] for a lot longer than you talk about the issues which you are raising, which I accept are legitimate to be raised. I’ve answered multiple questions on it today,” he said.\n\n“My focus is not on entitlements and the finance minister’s rules.”",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/victoria/vce-2025-live-victorian-year-12-students-to-learn-of-exam-results-atar-scores-at-7am-20251209-p5nm3t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "VCE 2025 LIVE: Victorian Year 12 students receive exam results and ATAR scores",
    "publish_date": "Thu, 11 Dec 2025 13:02:12 +1100",
    "category": "sports",
    "authors": [
      "Caroline Schelle",
      "Ashleigh Mcmillan"
    ],
    "text": "Ahead of her VCE results coming through this morning, Sarah Irungu’s extended family nominated an ATAR they thought would pop up on the screen when she opened her results at 7am.\n\n“I was the most pessimistic,” the Heathdale Christian College student admits.\n\n“I was thinking 93, but my brother was the most confident and he said 99.”\n\nIn the end, her impressive ATAR of 96.6 saw her aunt Jess Mwenda, who guessed 96.5, take home the prize of a $15 gift voucher.\n\nWatch the celebration below:",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/50-million-olympic-funding-boost-announced-20251211-p5nmvy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "$50 million Olympic funding boost announced",
    "publish_date": "Thu, 11 Dec 2025 12:58:32 +1100",
    "category": "sports",
    "authors": [],
    "text": "$50 million Olympic funding boost announced\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/business/companies/locksley-taps-top-engineers-to-fast-track-us-antimony-push-20251211-p5nmvj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Locksley taps top engineers to fast-track US antimony push",
    "publish_date": "Thu, 11 Dec 2025 12:35:03 +1100",
    "category": "finance",
    "authors": [
      "James Pearson"
    ],
    "text": "The ASX-listed critical minerals player Locksley Resources has kicked off an expression of interest (EOI) process to recruit tier-one engineering firms in the US for scoping-stage engineering and pilot-plant designs at its Desert antimony mine in California.\n\nThe formal tender follows on from direct engagement earlier this year between its senior management team and leading US engineering groups, with early conversations now crystallising into a formal selection process.\n\nOld workings at Locksley Resources’ historic Desert antimony mine in California.\n\nAccording to the company, the response has been strong, with potential partners recognising both the quality of the project and how neatly it lines up with US federal priorities around rebuilding critical mineral capacity.\n\nManagement says proven local experience in San Bernardino County – home to Locksley’s antimony project - is non-negotiable, since smooth permitting, regulatory know-how and stakeholder relationships can often be the difference between shaving months off the schedule and losing them altogether.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/merry-and-bright-emelia-jackson-s-limoncello-tiramisu-is-your-new-make-ahead-dessert-20251014-p5n2j4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Merry and bright: Emelia Jackson’s limoncello tiramisu is your new make-ahead dessert",
    "publish_date": "Thu, 11 Dec 2025 12:30:00 +1100",
    "category": "finance",
    "authors": [
      "Emelia Jackson"
    ],
    "text": "This stunning limoncello tiramisu is crowned with slices of handmade candied lemon. Armelle Habib. Styling: Lee Blaylock\n\nThis limoncello tiramisu elevates the classic Italian dessert with layers of zesty mascarpone cream and ladyfingers saturated in limoncello syrup. Garnished with glimmering, home-made candied lemon slices, it’s a colourful centrepiece for your Christmas celebrations or any special occasion needing a showstopping finish.\n\nThe best part? You can prepare it the day before and add the final touches just before serving.\n\nI assemble this in a 3-litre dish (mine is a 35cm x 24cm oval), but any dish of similar capacity will work.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/politics/federal/teenagers-can-get-jobs-before-16-but-what-happens-now-to-those-who-rely-on-social-media-for-an-income-20251210-p5nmka.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Teenagers can get jobs before 16. But what happens now to those who rely on social media for an income?",
    "publish_date": "Thu, 11 Dec 2025 12:25:37 +1100",
    "category": "finance",
    "authors": [
      "Bronte Gossling"
    ],
    "text": "They’re not the only ones. Kat Clark, who was named TikTok Australia’s Creator of the Year in 2022, announced in April – five months after the Online Safety Amendment (Social Media Minimum Age) Bill 2024 received Royal Assent and became law – that she and her husband Jonathan Clark would be moving to Los Angeles with their youngest daughter, 14-year-old influencer Deja Clark. Their oldest daughter, 22-year-old Latisha Clark, remains on the Gold Coast. Loading Kat said the move to the United States was so the family could pursue more opportunities, including brand deals and a lifestyle change. The family has not said it is because of the social media ban, though Kat has previously criticised it on TikTok. “I know I’m going to get hate for this, but banning teenagers from social media is not the solution because they’re going to do it behind your back anyway,” Kat said in a November 2024 video. The Clark family’s move to the United States means they can access TikTok’s Creator Rewards Program, which is not available to content creators in Australia. The fund remunerates eligible creators for publishing engaging content, and while exact figures vary, it’s believed the platform pays between 40 cents to $1 per 1000 views.\n\nDeja’s most recent video has more than 1.5 million views at the time of publishing. Creators have to be at least 18 years old to access the rewards program, but Deja’s account is managed by her parents (all her public social media profiles have been since before the ban, for safety and privacy reasons). Parents managing a child’s social media account is a workaround that some prominent figures in Australia, including 14-year-old vocal social media ban critic Zoey of @_heyitszoeyandmark, have used to keep their public accounts active – and earning. (It also means they can livestream on TikTok, which prohibits that feature for under-18s). Loading Australia’s youngest Olympic gold medallist, 15-year-old skateboarder Arisa Trew, for example, has more than 190,000 followers on Instagram and 53,000 followers on TikTok.\n\nThe fact her father, Simon Trew, has been managing her public accounts since they started is perhaps why she can still post advertisements for her sponsor, chew lolly Zappos. While social media posts are not the only part of a sponsorship deal – for some competitions, athletes can be outfitted in branded clothing, for example – it is a critical element for brands who are trying to reach young audiences in particular, says Dr Adam Karg, a professor in sports management at Victoria’s Deakin University. “They’re financially absolutely worth less now for young athletes,” Karg says of sponsorship deals for athletes under 16 with the ban in effect. A core tenet of a contract nowadays, Karg says, is social media posting – and delivering on that is crucial for some athletes to be able to continue pursuing their sport. “If you’re an athlete from a low socio-economic background, the value provided by sponsorships is obviously really, really important,” says Karg. “A lot of athletes at the semi-professional and professional level, their full-time job is to train … this is an income stream for them. The sponsors essentially support them through the … day-to-day costs associated with their lives but also travel [to competitions].”\n\nAlthough a workaround could be parents managing their accounts, Karg says because audiences know the posts are filtered through a gatekeeper, in the view of a sponsor who is buying an authentic message to young people from a fellow youth, that can devalue the young athlete’s word. That personal connection is perhaps why, last week, 15-year-old Australian Olympic skateboarder Chloe Covell bid an emotional goodbye to her 325,000 Instagram followers who have “supported [her] from the beginning”. (Covell’s account is still visible at the time of publishing, indicating that it has not been deactivated or suspended). The Australian Sports Commission is in contact with the eSafety Commissioner regarding the commercial interests and obligations of athletes under the age of 16. Loading On December 9, Swimming Australia released guidance for their athletes. It noted that athletes who are under 16 and have sponsorship agreements obligating them to make social media posts “might seek to renegotiate the terms of their agreement to require posting on a platform that is not caught under the new framework”.\n\nHow plausible an option that is, the peak governing body says, remains to be seen, and it has advised affected athletes to “seek specialist advice tailored to their individual circumstances”. For some teenage social media stars, however, it’s not just about the money. Leo Puglisi, who is now aged 18 but was 11 years old when he founded 6 News Australia, says it’s clear from the online news channel’s comments section that some of its followers would be affected (no current members of his team of young journalists are impacted by the ban). “I’m absolutely concerned that the ban impacts young people from being informed about the world from any news source, although my main reasons for opposing the ban continue to be privacy concerns, lack of consultation and the negative impact it risks having on many teens,” Puglisi told this masthead in a statement. Musician Prashasti Jolly, 14, wants to create a solution for teenagers who use social media for professional purposes. Credit: Sitthixay Ditthavong Before Prashasti Jolly’s Instagram was deactivated due to the ban, the 14-year-old Sydney artist used it to share her music, and youth advocacy and wellbeing work.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-wall-street-steady-ahead-of-fed-rates-decision-20251211-p5nmom.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX steady after surprise jobs data; Solly Lew to join Myer board",
    "publish_date": "Thu, 11 Dec 2025 12:25:35 +1100",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "The Australian sharemarket remains in the green after the release of the latest unemployment data, while Wall Street rose after the Federal Reserve lowered its main interest rate and hopes strengthened for more cuts to come in 2026.\n\nThe S&P/ASX 200 was up 56.5 points, or 0.7 per cent, to 8635.9 at 12.20pm AEDT, with eight of its 11 industry sectors in positive territory. Myer shares rallied after the department store owner announced rag trade billionaire Solly Lew will join its board in April.\n\nThe latest jobs figures for November showed unemployment remaining steady at 4.3 per cent, even as 21,000 jobs were lost. The consensus view among market economists had unemployment ticking up to 4.4 per cent, with about 20,000 jobs added to the economy.\n\nWall Street is on the cusp of a fresh record. Credit: AP\n\nMiners bounced higher as the price of commodities strengthened. Iron ore giants Fortescue (up 2.1 per cent), Rio Tinto (up 2 per cent) and BHP (up 1.7 per cent) surged, while gold miners Evolution Mining and Newmont were both 2.5 per cent higher.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/politics/victoria/a-glimpse-into-the-world-of-vce-art-20251211-p5nmvb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A glimpse into the world of VCE art",
    "publish_date": "Thu, 11 Dec 2025 12:21:12 +1100",
    "category": "entertainment",
    "authors": [],
    "text": "The works displayed here are a small selection of artworks from students who completed VCE Art units 3 and 4 in 2024. They are among the works chosen for the Top Arts and Top Designs collections which were displayed this year at the NGV and Melbourne Museum with the support of the Victorian Curriculum and Assessment Authority.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/four-things-to-binge-this-summer-20251211-p5nmv8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Four things to Binge this summer",
    "publish_date": "Thu, 11 Dec 2025 12:14:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "Four things to Binge this summer\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/afl/collingwood-staff-member-resigns-after-interstate-incident-20251211-p5nmqv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Collingwood staff member resigns after incident at Alice Springs hotel",
    "publish_date": "Thu, 11 Dec 2025 12:12:36 +1100",
    "category": "sports",
    "authors": [
      "Jake Niall"
    ],
    "text": "A Collingwood football department staffer has resigned following an incident in an Alice Springs hotel last month.\n\nThe junior staffer, who is not a coach or former player, was found to have behaved inappropriately towards another person at the hotel, a senior club source familiar with the incident has told this masthead.\n\nA Collingwood staff member has resigned after a club investigation. Credit: Getty Images\n\nHe tendered his resignation last week, and it was accepted immediately by the Magpies. The club had conducted an investigation into the incident.\n\nCollingwood’s playing group and football staffers were in Alice Springs as part of their annual trip to the Northern Territory, where they have a next-generation academy zone.",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.sbs.com.au/news/article/new-covid-vaccine-available-in-australia-for-new-variant/11rd6kikx",
    "title": "New jab for new COVID-19 variant: Australians can now access additional vaccine",
    "publish_date": "Thu, 11 Dec 2025 00:09:03 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "The Therapeutic Goods Administration (TGA) has included a new COVID-19 vaccine for a variant that has been spreading globally in 2025.\n\n\n\n\n\nPfizer Australia and BioNTech have welcomed the TGA's move to register the companies' new COVID-19 vaccine in its public database for approved therapeutic goods in Australia.\n\n\n\n\n\nThe new Comirnaty LP.8.1 COVID-19 mRNA vaccine targets the LP.8.1 variant, which the World Health Organization (WHO) in January labelled a \"variant under monitoring\".\n\n\n\n\n\nIn March, the WHO said the LP.8.1 is one of the two COVID-19 variants \"with increasing prevalence globally\", but it assessed the additional health risk posed by the variant as \"low\" globally.\n\n\n\n\n\nThe vaccine can be used for persons who are six months old and above.\n\n\n\nAs of 27 November, 6,524 COVID-19 cases had been reported in Australia that month, according to the National Notifiable Disease Surveillance System, an almost 11 per cent decrease from October.\n\n\n\n\n\nThe federal health department's website states regular COVID-19 vaccinations are \"the best way\" to maintain protection against severe COVID-19 symptoms.\n\n\n\n\n\nIt recommends people aged 18 to 64 years who are not severely immunocompromised consider a dose every 12 months. All COVID-19 vaccinations are free for residents in Australia, regardless of whether they hold a Medicare card.\n\n\n\n\n\nPfizer said the new vaccine is already available in Australia.\n\n\n\n\n\nPaul Griffin, an infectious disease physician and clinical microbiologist from the University of Queensland, said while COVID-19 remains unpredictable, it is fairly likely we'll see another wave relatively soon, on the balance of probability.\n\n\n\n\n\n\"It's not necessarily predictable just yet, but we certainly should be prepared because it would seem likely,\" Griffin recently told SBS News .\n\n\n\n\n\nSince the start of the pandemic, Australia has experienced an increase in COVID-19 cases during the summer and winter months.\n\n\n\n\n\nData from the Critical Health Resources Information System (CHRIS) show that, since 2022, the number of COVID-19 cases in intensive care units has historically increased from December to January. CHRIS monitors intensive care unit activity.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/us-to-require-could-ask-foreign-tourists-to-submit-five-years-of-social-media-history/9clb4p6ym",
    "title": "US could ask Australian tourists to submit five years of social media history",
    "publish_date": "Wed, 10 Dec 2025 19:11:05 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Trump administration plans to require visa-exempt foreign tourists to disclose their social media history from the past five years before entering the country, according to an official notice.\n\n\n\n\n\nThe proposal laid out in a notice published on Tuesday in the Federal Register would apply to visitors from 42 countries, including the United Kingdom, France, Australia and Japan, who do not need a visa to enter the United States.\n\n\n\n\n\nCurrently, those travellers only need to apply for a waiver known as the Electronic System for Travel Authorisation (ESTA), which still requires them to provide certain personal details.\n\n\n\n\n\nLiberal senator James Paterson said people might delete negative social media posts about US President Donald Trump before arriving.\n\n\n\n\n\n\"The immigration policies of the United States government really are a matter for the United States, just as Australia's immigration policy is a matter for us,\" he told Sky News.\n\n\n\n\"It's not up to me to tell the US government what they can and can't do when they screen visa applicants,\" Paterson said.\n\n\n\n\n\nUnder the proposed new rules, the collection of social media data would become a \"mandatory\" part of ESTA applications.\n\n\n\n\n\nApplicants would need to provide their social media histories from the last five years, according to the notice.\n\n\n\n\n\nThey would also have to submit other \"high-value data fields\" including phone numbers from the last five years, email addresses from the past decade, personal details of family members and biometric information.\n\n\n\nThe public has 60 days to comment on the proposal.\n\n\n\n\n\nThe Trump administration has tightened restrictions on entry into the US, part of a sweeping crackdown on migration.\n\n\n\n\n\nAlong with Mexico and Canada, the country will host the 2026 World Cup, which is certain to attract large numbers of football fans from across the world.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/queensland-expands-crocodile-management-plan-to-the-anger-of-indigenous-and-environmental-groups/wfsulkumx",
    "title": "Queensland expands crocodile management plan to the anger of Indigenous and environmental groups",
    "publish_date": "Wed, 10 Dec 2025 08:32:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Queensland expands crocodile management plan to the anger of Indigenous and environmental groups\n\nPublished 10 December 2025, 6:06 am\n\nQueensland's government has expanded its crocodile management plan, aiming to improve public safety in the state's north. The plan will see a ramping up of patrols and removals of reptiles. Indigenous and environment groups say they are frustrated by the decision.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/video/pacific-islands-affairs-minister-pat-conroy-questioned-about-issues-in-palm-visa-scheme/zm9h90cdi",
    "title": "Pacific Islands Affairs Minister Pat Conroy questioned about issues in PALM visa scheme",
    "publish_date": "Wed, 10 Dec 2025 08:27:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Pacific Islands Affairs Minister Pat Conroy questioned about issues in PALM visa scheme\n\nPublished 10 December 2025, 6:06 am\n\nNow to our special series on disengaged PALM scheme workers - a Federal Government program which many say puts Pacific Island and Timorese workers at risk of exploitation in regional Australia. There are more than 7,000 workers who have disengaged from the Federal Government's Pacific Australia Labour Mobility scheme. Many have stayed working here either unlawfully or on bridging visas. Reporter Catalina Florez has today put the issues raised in our series to the Pacific Island Affairs Minister Pat Conroy.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-social-media-ban-day-one/q7hb3i0vg",
    "title": "Australia’s teen social media ban: How day one unfolded — and the world’s response",
    "publish_date": "Wed, 10 Dec 2025 08:09:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's \"world-leading\" social media ban is now in effect — but D-Day wasn't without wasn't without hitches.\n\n\n\n\n\nLauded by the federal government, world politicians and even Oprah, children aged under 16 woke up on Wednesday morning to find they had been locked out of their accounts — a year after legislation passed parliament with bipartisan support.\n\n\n\n\n\nBut perhaps not all of them.\n\n\n\n\n\nThere were reports that under-16s could still register for accounts on several of the 10 platforms required to comply with the restrictions.\n\n\n\n\n\nAnd some teenagers, purporting to have circumvented the ban, mocked Prime Minister Anthony Albanese as he took to TikTok to spruik it.\n\n\n\n\n\n\"Didn't work bud,\" one user commented.\n\n\n\n\n\n\"Just wait until were (sic) able to vote,\" another said.\n\n\n\nWhile many might feel frustrated, the federal government insists the changes — which have experts divided — will be difficult but ultimately for the best.\n\n\n\n\n\nAnd while some teenagers might be celebrating their way around the ban — it also insists that, while there have been challenges in the rollout, they will eventually be locked out.\n\n\n\n\n\nHere's how the first day of the ban played out.\n\n\n\nA 'proud day' with 'teething issues'\n\nOn what Albanese said was a \"proud day\" to be prime minister, the ban — which has captured global attention — made headlines across the world. It was covered in the New York Times, the BBC, and carried in news bulletins from India to Italy.\n\n\n\n\n\nInstead of their feeds or 'for you' pages, many affected teenagers found themselves locked out of some of their favourite apps and unable to create new accounts — for the most part.\n\n\n\n\n\nGuardian Australia reported three apps still allowed 14-year-olds to register accounts, although two had indicated they were in the process of implementing the new restrictions.\n\n\n\n\n\nThe ten platforms , including Instagram, Snapchat, and TikTok, have all said they will comply with the ban, which requires them to block anyone under 16 from holding an account, after X announced on Wednesday that it would too.\n\n\n\n\n\nOne teenager said he'd been kicked off platforms owned by Meta — which include Instagram, Facebook and WhatsApp — but still had access to Snapchat.\n\n\n\n\n\nOthers have spoken of trying to fool the age verification algorithm using makeup and other strategies.\n\n\n\nAlbanese, Communications Minister Anika Wells, and eSafety Commissioner Julie Inman Grant all conceded that, while the ban would not be perfect in its early stages and there would be \"teething issues\", it would change lives as they went on a media blitz from Wednesday morning to the early afternoon.\n\n\n\n\n\n\"Make no mistake — this reform will change lives,\" Albanese said in Sydney while at an event marking the ban.\n\n\n\n\n\n\"For Australian kids, and allowing them to just have their childhood. For Australian parents, enabling them to have greater peace of mind. But also for the global community, who are looking at Australia, and saying: 'well, if Australia can do it, why can't we?'.\"\n\n\n\n\n\nMore than 200,000 TikTok accounts had been deactivated, according to Wells, who said that while some may have circumvented the ban today, it did \"not mean they can avoid it in a week's time or a month's time\".\n\n\n\n\n\n\"Because these social media platforms have to go back and routinely check under-16s' accounts,\" Wells told reporters.\n\n\n\n\n\nTech companies are expected to use a range of methods to verify a user's age, including face scans with artificial intelligence, sophisticated analysis of people's posting patterns and language, and digital IDs.\n\n\n\n\n\nThey are required to take reasonable steps to block children from accessing their services or face fines of up to $49.5 million per breach.\n\n\n\nSome platforms, such as YouTube, will still be accessible without an account, but it will be harder for algorithms to target content to children.\n\n\n\n\n\nThe government says the onus is on social media companies, not parents, to enforce the ban.\n\n\n\n\n\nLittle-known social media apps Lemon8, Yope and Coverstar remain accessible and have shot to the top of Apple's App Store charts.\n\n\n\n\n\nBut the government has warned that the list of banned apps is dynamic and could expand to include others in the future.\n\n\n\nGlobal attention\n\nOther governments have said they are planning similar steps to Australia.\n\n\n\n\n\nMalaysia is among them, where the Asian nation's media outlets, including Focus Malaysia and the Malay Mail, referenced their government's own next steps.\n\n\n\n\n\nThe ban was leading a popular weekday afternoon program by United States broadcaster CNN, while being extensively covered by news sites.\n\n\n\nLISTEN TO Social media ban sparks creative evasion and digital ID security fears SBS News 06:01 English\n\nUSA Today wrote: \"Australia is the first nation to ban social media for kids. Is the US next?\"\n\n\n\n\n\nThe BBC had live blog posts of the ban, with affected Australian children sending in their experiences and thoughts on the new rules.\n\n\n\n\n\nAl Jazeera noted both parents and advocates rejoicing over the ban, while pointing to the looming High Court challenge the government's laws are facing.\n\n\n\n\n\nSingaporean daily The Straits Times considered whether Australia might set the precedent for other nations.\n\n\n\n\n\nIn Europe, French outlets France 24 and Le Monde covered the rules, while Germany's Deutsche Welle also reacted.\n\n\n\n\n\nIn the United Kingdom, John Nash — a Conservative Party minister from 2013 to 2017 — wrote in The Times of London newspaper that Australia was \"making a brave stand\".\n\n\n\n\n\nHe said Britain risked \"being left behind\", with the European Parliament and a number of European countries, including Spain, Italy and France, are considering similar measures.\n\n\n\n\n\nThe European Commission is developing a regional age-verification app with five member states to allow users to verify their age without handing personal data directly to platforms. Though critics have pointed out the policies wouldn't be binding like Australia's.\n\n\n\n\n\nRahm Emanuel, ex-chief of staff to former US president Barack Obama, said the US should follow Australia's lead on a similar social media ban.\n\n\n\n\n\n\"I think it's time for America to pick up its game and do the same. I think we need to help parents,\" he said in a video on Wednesday morning.\n\n\n\n\n\n\"Our kids are way too vulnerable. It's too addictive, too alluring.\"\n\n\n\nREAD MORE The global fault lines emerging over Australia's social media ban\n\nAmerican television star Oprah Winfrey has also hailed the ban while touring Australia. During her first show in Sydney on Thursday, she said: \"I think you’re going to change the lives of an entire generation of kids who are going to have better lives.\"\n\n\n\n\n\nThere has also been opposition in the US, most notably from the technology sector, where industry groups representing Meta, Netflix, Disney, Alphabet (Google's parent company) and others have lodged formal complaints with the US Trade Representative.\n\n\n\n\n\nSome experts have been divided over the ban, saying it will have positive and negative effects , while others have argued social media is an important tool for young people to have access to .\n\n\n\n\n\n— With reporting by the Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 22
  },
  {
    "url": "https://www.sbs.com.au/news/video/teenagers-impacted-by-the-social-media-ban-respond-to-the-restrictions/k6gd5akkv",
    "title": "Teenagers impacted by the social media ban respond to the restrictions",
    "publish_date": "Wed, 10 Dec 2025 07:57:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Teenagers impacted by the social media ban respond to the restrictions\n\nPublished 10 December 2025, 6:06 am\n\nAt the heart of the social media ban - the young people being impacted. Thousands of users who have not known a world without these platforms as primary forms of expression, communication and creativity have lost access. Many were quick to criticise, saying age verification tools can be easily duped. Others have already moved on to replacement platforms left unchecked.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/governments-under-16s-social-media-ban-now-in-effect/diivww9a2",
    "title": "Government's under 16's social media ban now in effect",
    "publish_date": "Wed, 10 Dec 2025 07:55:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "Government's under 16's social media ban now in effect\n\nPublished 10 December 2025, 6:04 am\n\nTwelve months after the Government legislated a social media ban for teenagers, it has come into force. From today those aged under 16 will be banned from having accounts on a raft of social media platforms. It's a move that is making international headlnes around the world as nations grapple with their own concerns over online safety.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/etfs-surge-in-popularity-markets-betting-on-an-rba-rate-rise-in-2026/f4yjw7bct",
    "title": "ETFs surge in popularity & markets betting on an RBA rate rise in 2026",
    "publish_date": "Wed, 10 Dec 2025 06:56:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "And you can find more On the Money podcasts by subscribing to On the Money\n\nhere\n\n, or wherever you get your podcasts.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/social-media-ban-sparks-creative-evasion-and-digital-id-security-fears/agu3wouvs",
    "title": "Social media ban sparks creative evasion and digital ID security fears",
    "publish_date": "Wed, 10 Dec 2025 05:25:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"Hi there, students. It's the prime minister here, and I want to speak to you directly about something very important, from December 10, if you're under 16, you're no longer allowed to have a social media account, you'll know better than anyone what it's like growing up with algorithms, endless speeds and the pressure that can come with that. That's why we've taken this step to support you. Above all, make the most of the school holidays coming up, rather than spending it scrolling on your phone, start a new sport, learn a new instrument, or read that book that has been sitting there on your shelf for some time, and, importantly, spend quality time with your friends and your family, face to face.\"\n\n\n\n\n\nThat's Prime Minister Anthony Albanese announcing the under 16's social media ban.\n\n\n\n\n\nThe ban currently includes Facebook, Instagram, TikTok, Snapchat, and six other social media platforms, with the list expected to grow.\n\n\n\n\n\nFrom now on, social media platforms will face penalties of up to $49.5 million if they do not take \"reasonable steps\" to prevent children and teenagers aged under 16 from holding a social media account.\n\n\n\n\n\ne-Safety commissioner Julie Inman Grant says there will be early challenges, but non-compliance won't be tolerated.\n\n\n\n\n\n\n\n\"There will be teething issues, and kids will be ingenuitive (ingenious), and they'll find their ways around it, but the way that we're looking at compliance and enforcement is around systemic failures, and I 100% believe that these companies have the technical capability to achieve this, and they may have come into this kicking and screaming, but now it's time for them to show us their stuff. We have to work with the platforms and make sure that they're continuing to innovate and improve. But again, if we see blatant non-compliance, or if we're challenged in court around our notices or any enforcement action we take, we'll take each step as it comes.\"\n\n\n\n\n\nShadow Minister for Communications Melissa McIntosh says the Coalition is loosely supportive of the ban but is concerned about the use of the Digital ID system.\n\n\n\n\n\nShe says they are concerned the biometric data within the digital ID framework is vulnerable to security breaches.\n\n\n\n\n\nMinister McIntosh finds it disappointing the government is proceeding with the digital ID system despite its earlier vagueness about adopting it.\n\n\n\n\n\n\"The Minister for Communications and the e-Safety Commissioner have started putting this sort of language in quite recently, around: messy. It won't be perfect. Please be patient. Well, they should actually just get it right. The platforms have to be held to account, and this is another part of the concern, and sorry, to put a bit of a damper on the day is around, they've told me that they will compel people to use digital ID and the minister saying they're not. But this is very personal information. Driver's licenses, birth certificates going into data centres offshore. So yes, we do support the intent, let's protect kids and let's get them off social media. But we can't forget all the mechanisms along the way, and ensuring that it does work the way it should do.”\n\n\n\n\n\nSo, how are teenagers feeling about the ban?\n\n\n\n\n\nVideos are already being disseminated by some kids on how to bypass the ban, offering tips such as squinting your eyes during the digital ID photo verification.\n\n\n\n\n\n\"If you're living in Australia and you're under 16, stay. Everybody else leave. Gone, shoo, shoo, get out of here. All right, they gone? Hi. So, what you got to do to get past the social media ban? When it finally comes around to get past the facial scan, all you got to do, just do this. I don't know why it worked, but it did. That worked for me for Snapchat. I'm not sure if the different apps use different use different facial scanning, but that did work for Snapchat, so hopefully it'll work for everything else. All right, good luck, everybody.\"\n\n\n\n\n\nSome kids, like Barika, are worried they won't be able to stay in touch with family and friends from around the world.\n\n\n\n\n\n\"I feel a bit upset about it, because now I can't communicate with relatives overseas, and this has deeply affected me and I feel like I use Snapchat and messenger a lot, and since they have both not being banned it's kind of like breaking my relationship up, and that kind of hurts my feelings. I talk to them on Snapchat and Messenger. I use Snapchat for my cousins and messenger for like, grandparents, uncles and aunties.\"\n\n\n\n\n\nTwelve-year-old Dorotea believes the ban will limit her creative expression because she uses social media platforms to make videos and art.\n\n\n\n\n\n\"I don't know how to explain it. It's just basically where you import, like, photos and videos, change the text, and it's like, then it then it kind of creates a video. I don't know how to explain it that well, without sounding weird.\"\n\n\n\n\n\nNot everyone is upset.\n\n\n\n\n\nFlossie, another twelve-year-old, says she spoke with neuroscientist Dr Lila Landowski who explained to her how malleable the adolescent brain is.\n\n\n\n\n\n\"It's a time when we're more likely to take risks, act on impulse and be shaped by the world around us. Social media is designed to take advantage of that. Every like, every notification, every short video releases dopamine. It keeps our brains hooked, even when it doesn't make us happier or healthier. For developing brains, that constant dopamine drip can actually change the pathways we rely on for focus, self-control and emotional resilience.\"\n\n\n\n\n\nCommunications Minister Anika Wells claims the number of deactivated accounts indicates the ban is already a success.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-renter-face-superannuation-gap-than-homeowner/h83ih05mv",
    "title": "'Impossible problem': The retirees who may need an extra $300k in super",
    "publish_date": "Wed, 10 Dec 2025 05:18:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "Renters starting their retirement will need an extra $300,000 in superannuation to maintain the same retirement standard as those who own a house, according to a new analysis by Super Consumers Australia (SCA).\n\n\n\n\n\nThe superannuation advocate group has found that a single retiree who rents will need $659,000 in superannuation if they want to enjoy the same living standard as those who own a home and have $322,000 in super.\n\n\n\n\n\nAn analysis from SCA earlier this month found that if a single Australian who has just started their retirement wants to keep their spending level at $1,690 per fortnight, they will need to have at least $322,000 in super by the time they turn 65.\n\n\n\n\n\nThe group then swapped the spending of homeowners on their house — such as maintenance — with rental costs for renters, to calculate the savings they will need.\n\n\n\n\n\n\"The high cost of rent actually means people who rent in retirement need to spend 30 to 47 per cent more than homeowners to have the same standard of living,\" the SCA analysis says.\n\n\n\nREAD MORE Calls for superannuation protections as some retirees could lose up to $205,000\n\nSCA deputy CEO Katrina Ellis, who authored the report, says the $300,000 gap reflects how much more it costs for a renter when they are retired compared to a homeowner.\n\n\n\n\n\nShe says this has become \"an impossible financial problem\" for renters to solve.\n\n\n\n\n\n\"We know that home ownership is getting less and less across Australia, so there will be more people reaching retirement who are renting,\" she told SBS News.\n\n\n\n\n\nThe analysis also found a retiree couple who rents will need $786,000 in superannuation for a dignified retirement, compared to $432,000 for a couple who owns a home.\n\n\n\nRetired renters in financial stress\n\nFiona York, CEO of Housing for the Aged Action Group, says she’s happy to see the retirement gap \"recognised\" by the SCA report.\n\n\n\n\n\n\"We’ve known for a long time that there’s a really big difference in renting as an older person compared to owning your own home,\" York told SBS News, adding that the issue is often overlooked in Australia’s retirement housing system.\n\n\n\n\n\n\"We know that older renters are living in really expensive housing, it's often of poor quality, and this is having real impacts on their mental and physical health.\"\n\n\n\n\n\nShe said older women can be disproportionately impacted by the retirement saving gap: \"We know that older women have got less superannuation than men. They are more likely to be living in poor quality and expensive housing.\"\n\n\n\n\n\nYork has called for \"targeted strategies\" from the government to support female retiree renters, and more public and community housing to be built.\n\n\n\n\n\n\n\nWhile the federal government updates the Commonwealth Rent Assistance Rate twice a year in line with the Consumer Price Index (CPI), Ellis says the rate rise doesn’t align with rapid rent increases, and suggested the government could raise it to ease rental stress.\n\n\n\n\n\nUnder the scheme, which can be available for people on certain welfare payments such as the Age Pension and Austudy, a single renter can receive the maximum fortnightly payment of $215.40 if their fortnightly rent is over $439.20.\n\n\n\n\n\nAccording to data from the Australian Institute of Health and Welfare, one in every three age pensioners who received the Commonwealth Rent Assistance in June 2025 still experienced rental stress, which means they spend over 30 per cent of gross income on rent.\n\n\n\nIssues won’t be solved by 'moving around'\n\nThe SCA report also compares renters across capital cities on how much they need to save to share the same standard of living with homeowners in their cities by the age of 65.\n\n\n\n\n\nIn Adelaide, a single person who rents a one-bedroom apartment will need $509,000 in retirement savings, while a Sydneysider in the same situation needs $794,000.\n\n\n\n\n\nEllis says the differences result from the varied rental prices. A single retiree who pays $380 per week for rent in Adelaide may have to pay $590 per week for an equivalent in Sydney, according to the report.\n\n\n\n\n\n\"Even in the cities that have cheaper rents, we’re seeing that renters still have more out-of-pocket costs than what homeowners do,\" she said.\n\n\n\n\n\n\"So it’s not like there’s a cheap place to rent where this problem goes away. It’s across all of Australia.\"\n\n\n\nFor those who are yet to reach retirement age, Ellis says it’s important to have a plan around superannuation.\n\n\n\n\n\nShe says while many young Australian workers will get at least 12 per cent of salary being put into superannuation, those who are retiring today would have received 9 per cent for much of their working life.\n\n\n\n\n\n\"So younger people are getting a larger contribution to super, which should help them save a decent superannuation balance by the time they retire,\" Ellis said.\n\n\n\n\n\n\"But hopefully by the time they retire, the government has also improved rent assistance and done the work to build more affordable housing, so that there's secure housing options for retirees who rent in the future.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/esafety-promises-to-enforce-new-social-media-age-ban-evening-news-bulletin-10-december-2025/i3dqnc5fk",
    "title": "Commissioner promises to enforce new social media age ban | Evening News Bulletin 10 December 2025",
    "publish_date": "Wed, 10 Dec 2025 05:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nAustralia's underage social media ban hailed as an example for the world;\n\nA Muslim civil rights group branded a foreign terrorist organisation in the United States;\n\nPat Cummins back in Australia's squad for the Ashes.\n\nAustralia's social media ban has been hailed a success - despite teenagers already finding ways to get around it.\n\n\n\n\n\nLittle-known social media apps Lemon8, Yope and Coverstar, which are not yet covered by the ban, have shot to the top of Apple's App Store charts, while some kids have reportedly tried strategies like using makeup to fool platforms using age verification algorithms.\n\n\n\n\n\nThere's also reports that underage users have been able to create new accounts on platforms that are covered by the ban - namely Reddit and Twitch.\n\n\n\n\n\nBut despite the apparent loopholes, Prime Minister Anthony Albanese has told Channel Nine it's an historic day.\n\n\n\n\n\n\"It's such a fantastic day and a proud day to be prime minister of Australia. This is world-leading legislation, this is families taking back ownership of what happens in their households. It is empowering parents to have those discussions with their children. It's about giving children back to their childhood.\"\n\n\n\n\n\n.\n\n\n\n\n\nMeanwhile, the E-Safety Commissioner has declared she expects tech companies to fully comply with the new social media ban.\n\n\n\n\n\nJulie Inman Grant says social media giants have the databases and bank balances to meet their new obligations.\n\n\n\n\n\nThe Commissioner says she doesn't expect flawless results, but her office will be able to understand quickly which companies comply.\n\n\n\n\n\nShe says enforcement will succeed in the long run - and set a world-leading example.\n\n\n\n\n\n\"It starts here, in Australia, today. The world will follow like nations once followed our lead on plain tobacco packaging, gun reform, water and sun safety. How can you not follow a country with clearly prioritising teen safety ahead of tech profits?\"\n\n\n\n\n\n.\n\n\n\n\n\nOne country already planning a social media measure is Denmark.\n\n\n\n\n\nThe country hopes to bring in their plans for a youth social media ban by mid 2026 - but some experts and school students in Denmark have expressed concerns about the proposal.\n\n\n\n\n\nUniversity of Copenhagen associate professor Anne Mette Thorhauge, says she worries about how the ban will be enforced, and how it could potentially impinge on the rights of young people.\n\n\n\n\n\n14-year-old Chloé Courage Fjelstrup-Matthisen says it should be up to both governments and social media platforms to make them safer.\n\n\n\n\n\n\"I definitely see the bad side of social media. But I think it's not the youths' responsibility to make sure there's no bad stuff on the internet. It's the people who created it, the government, they need to regulate what we young people see.\"\n\n\n\n\n\n.\n\n\n\n\n\nAnother high-profile Republican governor in the US has signed an executive order designating one of the country’s most prominent Muslim civil rights groups a foreign terrorist organisation.\n\n\n\n\n\nIn line with Texas, Florida Governor Ron DeSantis's order alleges the Council on American-Islamic Relations, or CAIR, has ties to militant Palestinian group Hamas - and he says there is more to come.\n\n\n\n\n\n\"The legislature is working on statutory laws that are going to impact this area. So I think our executive order is kind of the beginning. I think you're going to see statutory codification of how we handle different terror designations.”\n\n\n\n\n\nThe organisation itself has denied the allegations.\n\n\n\n\n\nDirector of the Council's Houston chapter, Imran Ghani, says the claims are based on conspiracy theories, and is being done to stoke fear.\n\n\n\n\n\n\"This kind of rhetoric is done to promote a certain white Christian nationalist agenda that is looking to usurp American history as a one-sided party and not a tapestry of diversity that America actually is.”\n\n\n\n\n\n.\n\n\n\n\n\nAustralia's Khmer community is urging the federal government to play a stronger diplomatic role in the renewed border conflict between Cambodia and Thailand.\n\n\n\n\n\nSeda Douglas is a Cambodian-born Australian citizen who spent time in a Thai refugee camp - and says it's very difficult to see the conflict reignited.\n\n\n\n\n\nShe has told SBS Khmer that Australia can and should help de-escalate the situation.\n\n\n\n\n\n\"Do something. Take a more active role to mediate and mitigate the flare up of the conflict as a middle player within the Asia- Pacific region. Because if we just look away, pretend that it's none of our business, and we don't want to interfere, sooner or later the conflict will flare and will escalate - and then can destabilise the whole region.\"\n\n\n\n\n\n.\n\n\n\n\n\nQueensland's parliament has passed tough new legislation to pave the way for crocodiles to be removed from popular swimming holes and waterways.\n\n\n\n\n\nThe new management measures are aimed at preventing potential attacks amid an explosion in crocodile numbers, and has been prepared in consultation with regional communities.\n\n\n\n\n\nKatter Australia party MPs like Shane Knuth, from North Queensland, say it's about time - but argues a culling program policy is also needed.\n\n\n\n\n\n.\n\n\n\n\n\nTo sport and in cricket news,\n\n\n\n\n\nPat Cummins is officially back in Australia's Ashes squad.\n\n\n\n\n\nThe captain has been named to return for the third Test against England in Adelaide.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/article/social-media-ban-comes-into-effect/f5l8fndl1",
    "title": "'It won't be perfect': Albanese hails social media ban as it faces 'teething issues'",
    "publish_date": "Tue, 9 Dec 2025 23:24:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prime Minister Anthony Albanese has acknowledged the social media ban \"won't be perfect\" but insists it will change lives, as the new restrictions appeared to face \"teething issues\" on their first day.\n\n\n\n\n\nThe new laws came into force on Wednesday and ban teenagers aged under 16 from holding accounts on some social media platforms, including Instagram, Snapchat, TikTok, and seven others. Other platforms could be added down the track.\n\n\n\n\n\nThere were reports under-16s could create accounts on some platforms, subject to the ban as it came into force. They are required to take reasonable steps to block children from accessing their services, or face fines of up to $49.5 million per breach.\n\n\n\n\n\nAlbanese told reporters at a press conference on Wednesday the \"world-leading\" legislation was \"Australia showing enough is enough\".\n\n\n\n\n\n\"This will make an enormous difference. It is one of the biggest social and cultural changes that our nation has faced,\" Albanese said.\n\n\n\n\n\nHe said it was a \"big change\" and the ban \"won't be perfect\", but there was \"success in the fact it's happening\".\n\n\n\n\n\n\"Make no mistake — this reform will change lives,\" he said. \"For Australian kids, and allowing them to just have their childhood. For Australian parents, enabling them to have greater peace of mind. But also for the global community, who are looking at Australia, and saying: 'well, if Australia can do it, why can't we?'.\"\n\n\n\nREAD MORE The global fault lines emerging over Australia's social media ban\n\nCommunications Minister Anika Wells and eSafety Commissioner Julie Inman Grant also conceded there would likely be issues during the early stages of the ban.\n\n\n\n\n\n\"They might have avoided it [the ban] today does not mean they can avoid it in a week's time or a month's time because these social media platforms have to go back and routinely check under-16s' accounts,\" Wells told reporters.\n\n\n\n\n\nShe said social media companies have years of data they can use to ascertain a person's age, including previous searches or the subjects of conversations children may have.\n\n\n\n\n\n\"Because you've had your older brother scan their face for you today which has bought you a bit of time, doesn't mean that these accounts aren't going to see you talking to other 14-year-olds,\" she said.\n\n\n\n\n\nWells said more than 200,000 TikTok accounts have been deactivated so far.\n\n\n\nInman Grant said some companies have come into the ban \"kicking and screaming\", but she believes they have the \"technical capability\" to enforce the ban.\n\n\n\n\n\n\"There will be teething issues, and kids are ingenious; they will be finding ways around it,\" she told ABC News on Wednesday morning.\n\n\n\n\n\n\"But the way that we are looking at compliance and enforcement is around systemic failures, and I 100 per cent believe that these companies have the technical capability to achieve this.\"\n\n\n\nLater, while speaking alongside the prime minister, Inman Grant compared the social media ban to gun and tobacco reform, predicting the world would follow suit.\n\n\n\n\n\n\"The world will follow like nations once followed our lead on plain tobacco packaging, gun reform, water and sun safety,\" she said. \"How can you not follow a country with clearly prioritising teen safety ahead of tech profits?\"\n\n\n\n\n\nSome experts have been divided over the ban, saying it will have positive and negative effects , while others have argued social media is an important tool for young people to have access to .\n\n\n\n\n\nAlbanese acknowledged it would be a \"difficult period\" for affected teenagers.\n\n\n\nIn a video posted to social media, Albanese encouraged teenagers to use the ban as an opportunity to \"spend quality time\" face-to-face with family and friends.\n\n\n\n\n\nTech companies are expected to use a range of methods to verify a user's age, including face scans with artificial intelligence, sophisticated analysis of people's posting patterns and language, and digital IDs.\n\n\n\n\n\nSome platforms, such as YouTube, will still be accessible without an account, but it will be harder for algorithms to target content to children.\n\n\n\n\n\nThe government says the onus is on social media companies, not parents, to enforce the ban.\n\n\n\n\n\nIt is also examining how to regulate artificial intelligence chatbots and bring in a \"digital duty of care\" next year.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.theage.com.au/business/consumer-affairs/skydiver-dangles-from-plane-tail-after-parachute-snags-20251211-p5nmti.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Skydiver dangles from plane tail after parachute snags",
    "publish_date": "Thu, 11 Dec 2025 13:06:42 +1100",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "A flight almost ended in tragedy in September when a skydiver’s parachute got caught on the tail of a plane over Far North Queensland.\n\nThe parachutist was climbing out of the Cessna Caravan plane’s side door, when the handle for their reserve parachute snagged on the wing flap, accidentally deploying the parachute in the process, according to a report released on Thursday by the Australian Transport Safety Bureau.\n\nOnce caught, the parachutist was left dangling from the plane’s tail, leaving his legs flapping in the winds at 15,000 feet.\n\nThe skydiver’s feet then struck the plane’s left horizontal stabiliser, which jolted the plane, making it hard for the pilot, unaware of the incident unfolding, to control.",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-more-parliamentarians-embroiled-in-expenses-scandal-teens-face-day-two-of-social-media-ban-20251211-p5nmpd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: More parliamentarians embroiled in expenses scandal; Teens face day two of social media ban",
    "publish_date": "Thu, 11 Dec 2025 13:03:36 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine",
      "Isabel Mcmillan"
    ],
    "text": "Prime Minister Anthony Albanese has clashed with reporters as he refused to concede to calls from his political opponents for reform to the parliamentary travel expenses.\n\n“These are rules that have been set for some period of time. They’re rules that are in place in terms of family reunion to enable people to actually engage with their partners,” Albanese told reporters in Canberra, where he was peppered with questions about whether the rules needed to be reviewed as ongoing revelations make headlines.\n\n“They’ve been in place for some time, and we haven’t changed the rules. We haven’t added to any entitlements. The rules have been there since they were put in place by the former government.”\n\nPrime Minister Anthony Albanese and Communications and Sport Minister Anika Wells address the media after meeting with students and staff during a visit to St John Paul II College in Canberra today. Credit: Alex Ellinghausen\n\nWhen it was put to the prime minister that parliament had the power to change the rules through legislation, he repeatedly said: “I haven’t changed the rules”, adding “I’m not the finance minister”.\n\nThe prime minister tried to return to the subject of the social media ban, which he was holding the press conference to promote, and became agitated as he kept getting asked about expense entitlements.\n\n“What I’m focused on today is an issue which is a revolution. You will talk about [the ban] for a lot longer than you talk about the issues which you are raising, which I accept are legitimate to be raised. I’ve answered multiple questions on it today,” he said.\n\n“My focus is not on entitlements and the finance minister’s rules.”",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/victoria/vce-2025-live-victorian-year-12-students-to-learn-of-exam-results-atar-scores-at-7am-20251209-p5nm3t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "VCE 2025 LIVE: Victorian Year 12 students receive exam results and ATAR scores",
    "publish_date": "Thu, 11 Dec 2025 13:02:12 +1100",
    "category": "sports",
    "authors": [
      "Caroline Schelle",
      "Ashleigh Mcmillan"
    ],
    "text": "Ahead of her VCE results coming through this morning, Sarah Irungu’s extended family nominated an ATAR they thought would pop up on the screen when she opened her results at 7am.\n\n“I was the most pessimistic,” the Heathdale Christian College student admits.\n\n“I was thinking 93, but my brother was the most confident and he said 99.”\n\nIn the end, her impressive ATAR of 96.6 saw her aunt Jess Mwenda, who guessed 96.5, take home the prize of a $15 gift voucher.\n\nWatch the celebration below:",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/50-million-olympic-funding-boost-announced-20251211-p5nmvy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "$50 million Olympic funding boost announced",
    "publish_date": "Thu, 11 Dec 2025 12:58:32 +1100",
    "category": "sports",
    "authors": [],
    "text": "$50 million Olympic funding boost announced\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/business/companies/locksley-taps-top-engineers-to-fast-track-us-antimony-push-20251211-p5nmvj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Locksley taps top engineers to fast-track US antimony push",
    "publish_date": "Thu, 11 Dec 2025 12:35:03 +1100",
    "category": "finance",
    "authors": [
      "James Pearson"
    ],
    "text": "The ASX-listed critical minerals player Locksley Resources has kicked off an expression of interest (EOI) process to recruit tier-one engineering firms in the US for scoping-stage engineering and pilot-plant designs at its Desert antimony mine in California.\n\nThe formal tender follows on from direct engagement earlier this year between its senior management team and leading US engineering groups, with early conversations now crystallising into a formal selection process.\n\nOld workings at Locksley Resources’ historic Desert antimony mine in California.\n\nAccording to the company, the response has been strong, with potential partners recognising both the quality of the project and how neatly it lines up with US federal priorities around rebuilding critical mineral capacity.\n\nManagement says proven local experience in San Bernardino County – home to Locksley’s antimony project - is non-negotiable, since smooth permitting, regulatory know-how and stakeholder relationships can often be the difference between shaving months off the schedule and losing them altogether.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/merry-and-bright-emelia-jackson-s-limoncello-tiramisu-is-your-new-make-ahead-dessert-20251014-p5n2j4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Merry and bright: Emelia Jackson’s limoncello tiramisu is your new make-ahead dessert",
    "publish_date": "Thu, 11 Dec 2025 12:30:00 +1100",
    "category": "finance",
    "authors": [
      "Emelia Jackson"
    ],
    "text": "This stunning limoncello tiramisu is crowned with slices of handmade candied lemon. Armelle Habib. Styling: Lee Blaylock\n\nThis limoncello tiramisu elevates the classic Italian dessert with layers of zesty mascarpone cream and ladyfingers saturated in limoncello syrup. Garnished with glimmering, home-made candied lemon slices, it’s a colourful centrepiece for your Christmas celebrations or any special occasion needing a showstopping finish.\n\nThe best part? You can prepare it the day before and add the final touches just before serving.\n\nI assemble this in a 3-litre dish (mine is a 35cm x 24cm oval), but any dish of similar capacity will work.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/politics/federal/teenagers-can-get-jobs-before-16-but-what-happens-now-to-those-who-rely-on-social-media-for-an-income-20251210-p5nmka.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Teenagers can get jobs before 16. But what happens now to those who rely on social media for an income?",
    "publish_date": "Thu, 11 Dec 2025 12:25:37 +1100",
    "category": "finance",
    "authors": [
      "Bronte Gossling"
    ],
    "text": "They’re not the only ones. Kat Clark, who was named TikTok Australia’s Creator of the Year in 2022, announced in April – five months after the Online Safety Amendment (Social Media Minimum Age) Bill 2024 received Royal Assent and became law – that she and her husband Jonathan Clark would be moving to Los Angeles with their youngest daughter, 14-year-old influencer Deja Clark. Their oldest daughter, 22-year-old Latisha Clark, remains on the Gold Coast. Loading Kat said the move to the United States was so the family could pursue more opportunities, including brand deals and a lifestyle change. The family has not said it is because of the social media ban, though Kat has previously criticised it on TikTok. “I know I’m going to get hate for this, but banning teenagers from social media is not the solution because they’re going to do it behind your back anyway,” Kat said in a November 2024 video. The Clark family’s move to the United States means they can access TikTok’s Creator Rewards Program, which is not available to content creators in Australia. The fund remunerates eligible creators for publishing engaging content, and while exact figures vary, it’s believed the platform pays between 40 cents to $1 per 1000 views.\n\nDeja’s most recent video has more than 1.5 million views at the time of publishing. Creators have to be at least 18 years old to access the rewards program, but Deja’s account is managed by her parents (all her public social media profiles have been since before the ban, for safety and privacy reasons). Parents managing a child’s social media account is a workaround that some prominent figures in Australia, including 14-year-old vocal social media ban critic Zoey of @_heyitszoeyandmark, have used to keep their public accounts active – and earning. (It also means they can livestream on TikTok, which prohibits that feature for under-18s). Loading Australia’s youngest Olympic gold medallist, 15-year-old skateboarder Arisa Trew, for example, has more than 190,000 followers on Instagram and 53,000 followers on TikTok.\n\nThe fact her father, Simon Trew, has been managing her public accounts since they started is perhaps why she can still post advertisements for her sponsor, chew lolly Zappos. While social media posts are not the only part of a sponsorship deal – for some competitions, athletes can be outfitted in branded clothing, for example – it is a critical element for brands who are trying to reach young audiences in particular, says Dr Adam Karg, a professor in sports management at Victoria’s Deakin University. “They’re financially absolutely worth less now for young athletes,” Karg says of sponsorship deals for athletes under 16 with the ban in effect. A core tenet of a contract nowadays, Karg says, is social media posting – and delivering on that is crucial for some athletes to be able to continue pursuing their sport. “If you’re an athlete from a low socio-economic background, the value provided by sponsorships is obviously really, really important,” says Karg. “A lot of athletes at the semi-professional and professional level, their full-time job is to train … this is an income stream for them. The sponsors essentially support them through the … day-to-day costs associated with their lives but also travel [to competitions].”\n\nAlthough a workaround could be parents managing their accounts, Karg says because audiences know the posts are filtered through a gatekeeper, in the view of a sponsor who is buying an authentic message to young people from a fellow youth, that can devalue the young athlete’s word. That personal connection is perhaps why, last week, 15-year-old Australian Olympic skateboarder Chloe Covell bid an emotional goodbye to her 325,000 Instagram followers who have “supported [her] from the beginning”. (Covell’s account is still visible at the time of publishing, indicating that it has not been deactivated or suspended). The Australian Sports Commission is in contact with the eSafety Commissioner regarding the commercial interests and obligations of athletes under the age of 16. Loading On December 9, Swimming Australia released guidance for their athletes. It noted that athletes who are under 16 and have sponsorship agreements obligating them to make social media posts “might seek to renegotiate the terms of their agreement to require posting on a platform that is not caught under the new framework”.\n\nHow plausible an option that is, the peak governing body says, remains to be seen, and it has advised affected athletes to “seek specialist advice tailored to their individual circumstances”. For some teenage social media stars, however, it’s not just about the money. Leo Puglisi, who is now aged 18 but was 11 years old when he founded 6 News Australia, says it’s clear from the online news channel’s comments section that some of its followers would be affected (no current members of his team of young journalists are impacted by the ban). “I’m absolutely concerned that the ban impacts young people from being informed about the world from any news source, although my main reasons for opposing the ban continue to be privacy concerns, lack of consultation and the negative impact it risks having on many teens,” Puglisi told this masthead in a statement. Musician Prashasti Jolly, 14, wants to create a solution for teenagers who use social media for professional purposes. Credit: Sitthixay Ditthavong Before Prashasti Jolly’s Instagram was deactivated due to the ban, the 14-year-old Sydney artist used it to share her music, and youth advocacy and wellbeing work.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-wall-street-steady-ahead-of-fed-rates-decision-20251211-p5nmom.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX steady after surprise jobs data; Solly Lew to join Myer board",
    "publish_date": "Thu, 11 Dec 2025 12:25:35 +1100",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "The Australian sharemarket remains in the green after the release of the latest unemployment data, while Wall Street rose after the Federal Reserve lowered its main interest rate and hopes strengthened for more cuts to come in 2026.\n\nThe S&P/ASX 200 was up 56.5 points, or 0.7 per cent, to 8635.9 at 12.20pm AEDT, with eight of its 11 industry sectors in positive territory. Myer shares rallied after the department store owner announced rag trade billionaire Solly Lew will join its board in April.\n\nThe latest jobs figures for November showed unemployment remaining steady at 4.3 per cent, even as 21,000 jobs were lost. The consensus view among market economists had unemployment ticking up to 4.4 per cent, with about 20,000 jobs added to the economy.\n\nWall Street is on the cusp of a fresh record. Credit: AP\n\nMiners bounced higher as the price of commodities strengthened. Iron ore giants Fortescue (up 2.1 per cent), Rio Tinto (up 2 per cent) and BHP (up 1.7 per cent) surged, while gold miners Evolution Mining and Newmont were both 2.5 per cent higher.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/politics/victoria/a-glimpse-into-the-world-of-vce-art-20251211-p5nmvb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A glimpse into the world of VCE art",
    "publish_date": "Thu, 11 Dec 2025 12:21:12 +1100",
    "category": "entertainment",
    "authors": [],
    "text": "The works displayed here are a small selection of artworks from students who completed VCE Art units 3 and 4 in 2024. They are among the works chosen for the Top Arts and Top Designs collections which were displayed this year at the NGV and Melbourne Museum with the support of the Victorian Curriculum and Assessment Authority.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/four-things-to-binge-this-summer-20251211-p5nmv8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Four things to Binge this summer",
    "publish_date": "Thu, 11 Dec 2025 12:14:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "Four things to Binge this summer\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/afl/collingwood-staff-member-resigns-after-interstate-incident-20251211-p5nmqv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Collingwood staff member resigns after incident at Alice Springs hotel",
    "publish_date": "Thu, 11 Dec 2025 12:12:36 +1100",
    "category": "sports",
    "authors": [
      "Jake Niall"
    ],
    "text": "A Collingwood football department staffer has resigned following an incident in an Alice Springs hotel last month.\n\nThe junior staffer, who is not a coach or former player, was found to have behaved inappropriately towards another person at the hotel, a senior club source familiar with the incident has told this masthead.\n\nA Collingwood staff member has resigned after a club investigation. Credit: Getty Images\n\nHe tendered his resignation last week, and it was accepted immediately by the Magpies. The club had conducted an investigation into the incident.\n\nCollingwood’s playing group and football staffers were in Alice Springs as part of their annual trip to the Northern Territory, where they have a next-generation academy zone.",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://au.news.yahoo.com/skydiver-hangs-plane-tail-snared-020413056.html",
    "title": "Skydiver hangs from plane tail, snared by own chute",
    "publish_date": "2025-12-11T02:04:13Z",
    "category": "finance",
    "authors": [],
    "text": "A skydiving adventure in late September nearly ended in disaster after a terrifying incident where a man was left dangling from the tail of a light aircraft.\n\nVideo released by the Australian Transport Safety Bureau showed the parachutist preparing to exit a Cessna Caravan over Tully in far north Queensland on September 20.\n\nHe was part of a 16-way formation jump from about 4500m with 17 other parachutists on board, including a camera operator who was to film the jump.\n\nBut as the man clung to the side of the aircraft's roller door, the handle of his reserve parachute caught on the wing flap, causing it to deploy prematurely.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe man was instantly dragged backwards, with his legs striking the tail's left horizontal stabiliser, damaging it. He was then suspended as the parachute wrapped around the stabiliser.\n\nThirteen of the remaining skydivers then quickly exited the aircraft, with two left watching as the snared parachutist frantically cut himself free with a knife.\n\nHe was able to land safely after his main parachute deployed, despite being entangled in the remaining lines and canopy of the reserve chute. He suffered minor injuries to his legs.\n\nIn the meantime, the pilot of the Cessna was left fighting for control of the damaged aircraft, with part of the reserve parachute still wrapped around the tail.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe pilot, who was also wearing an emergency parachute, briefly contemplated bailing out of the aircraft before regaining enough control to return to Tully, landing safely.\n\nThe man was part of a 16-way formation jump from about 4500m, with 17 other parachutists on board. (HANDOUT/ATSB)\n\nThe ATSB investigation found that while it did not contribute to this accident, the pilot and aircraft operator did not ensure the aircraft was loaded within its correct weight and balance calculations.\n\n\"Fatal parachuting accidents have occurred in the past due to aircraft being loaded outside centre of gravity limits,\" ATSB chief commissioner Angus Mitchell said.\n\nHe also said that while it was not a regulatory requirement, the parachutist's hook knife had been life-saving in the emergency that unfolded.",
    "source": "Yahoo",
    "cluster_id": 0
  },
  {
    "url": "https://au.news.yahoo.com/skydiver-fights-life-plane-drama-014451880.html",
    "title": "Skydiver fights for life in plane drama",
    "publish_date": "2025-12-11T01:44:51Z",
    "category": "finance",
    "authors": [],
    "text": "A skydiver fought for his life when his reserve chute accidentally deployed and became tangled around the tail of a plane, forcing a dramatic emergency landing during a jump in Far North Queensland.\n\nThe dramatic mid-air emergency unfolded on September 20, 2025, shortly after the Cessna Caravan departed Tully Airport with a pilot and 17 parachutists on board for a planned 16-way formation skydive from 15,000 feet, filmed by a camera operator.\n\nAccording to a newly released Australian Transport and Safety Bureau (ATSB) report, it was the third load of the day for the Far North Freefall Club (FNFF), with the incident occurring at about 10am.\n\nA jumper’s reserve parachute snagged the tail of a Cessna Caravan during a skydive in Far North Queensland. Picture: Jarrad Nolan/ ATSB\n\nAt altitude, the pilot slowed the Cessna to 85 knots and signalled for the jump to begin. But as the first skydiver moved through the roller door, the handle of their reserve parachute snagged on the wing flap, triggering an unintended deployment.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe reserve pilot chute was pulled free as the skydiver climbed to safety.\n\nThe sudden force dragged the skydiver backwards, slamming their legs into the aircraft’s left horizontal stabiliser and causing substantial damage before the reserve chute wrapped itself around part of the back of the plane, leaving the parachutist hanging beneath the aircraft.\n\nThe deployed chute also struck the on-board camera operator, dislodging them into freefall and causing a minor injury.\n\nThe incident occurred at about 15,000 feet when the first jumper’s reserve handle, known as a “pud,” snagged on the plane and triggered the reserve parachute to deploy. Picture: Jarrad Nolan/ ATSB\n\nATSB Chief Commissioner Angus Mitchell said the pilot recalled feeling the aircraft suddenly pitch up, and observed the airspeed rapidly decreasing.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Initially unaware of what had occurred, the pilot believed the aircraft had stalled, and pushed forward on the control column and applied some power in response. But upon being told there was a skydiver hung up on the tailplane, they reduced power again,” Mr Mitchell said.\n\nThe pilot reported violent control vibrations and said significant forward pressure and input were required just to keep the plane straight and level.\n\nThe bureau found the forward trim became jammed for the remainder of the flight.\n\nAs the crippled aircraft shuddered through the sky, 13 parachutists bailed out, while two stayed in the doorway watching the stranded skydiver fight to free themselves.\n\nThe skydiver used a hook knife to cut 11 lines and free himself from the tangled chute. Picture: Jarrad Nolan/ ATSB\n\nShocking footage captured during the emergency shows the moment the chute snags, the tailplane buckles, and the skydiver hangs beneath the aircraft as the pilot fights to keep it airborne.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nDangling in the slipstream, the parachutist used a hook knife to cut 11 lines from the reserve canopy, eventually freeing the tattered material from the tail.\n\nThe skydiver, an experienced jumper with more than 2000 skydives, cut the lines in just 50 seconds despite significant difficulty.\n\nDropping into freefall, they then deployed their main parachute, despite it becoming tangled in the remnants of the reserve, and incredibly landed with only minor injuries.\n\nThey later reported cuts and bruising to their lower legs.\n\nOne camera operator was dislodged into freefall and sustained a minor injury. Picture: Jarrad Nolan/ ATSB\n\n“With all parachutists out of the aircraft, the pilot assessed they had limited pitch control, given the substantially damaged tailplane, which still had a portion of the reserve parachute wrapped around it,” Mr Mitchell said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“With forward pressure they found they could achieve a gradual descent, and retracted the flap, which then allowed slightly more rudder, aileron and elevator control.”\n\nMaintaining about 120 knots, the pilot declared a mayday to Brisbane Centre, advising they had minimal control and prepared to bail out if the aircraft became unflyable.\n\nJump pilots are equipped with their own parachute in case of such emergencies.\n\nBut passing 2500 feet, they judged they could attempt a landing.\n\n“In difficult circumstances, the pilot managed to control the aircraft and land safely at Tully,” Mr Mitchell said.\n\nInvestigators noted the aircraft was not loaded within weight and balance limits, though this didn’t contribute to the accident. Picture: Jarrad Nolan/ ATSB\n\nHe said the incident highlights the need for skydivers to stay vigilant around their parachute handles when exiting the aircraft.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Carrying a hook knife, although it is not a regulatory requirement, could be lifesaving in the event of a premature reserve parachute deployment.”\n\nThe investigation also found the aircraft was not loaded within its weight and balance limits, though this did not contribute to the near-disaster.\n\nFNFF’s manifest software calculated weight, but not centre of gravity, meaning the aircraft departed outside its weight and balance ranges.\n\nThe pilot maintained control despite substantial tail damage and a partially wrapped parachute. Picture: Jarrad Nolan/ ATSB\n\nThe report also identified a second risk factor that the pilot did not use supplemental oxygen despite operating at or above Flight Level 140, as required by regulation, raising the threat of hypoxia.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Fatal parachuting accidents have occurred in the past due to aircraft being loaded outside centre of gravity limits, which highlights the importance of conducting aircraft weight and balance calculations prior to each load,” Mr Mitchell said.\n\nIn response to the near-disaster, FNFF has since mandated hook knives for all jumpers, updated its loadmaster checklist, revised safety procedures, and issued oxygen reminders to pilots.\n\nThe Australian Parachute Federation is now developing a comprehensive loadmaster guide and new emergency-response training resources.\n\nThe footage of the incident will be incorporated into new nationwide training material for parachutists and loadmasters.",
    "source": "Yahoo",
    "cluster_id": 0
  }
]