[
  {
    "url": "https://www.9news.com.au/national/sunshine-coast-maroochydore-hit-and-run-queensland-police/9681ec32-48ec-4dd1-bfff-1253f4ffdc4a",
    "title": "Woman fighting for life after alleged hit and run on Sunshine Coast",
    "publish_date": "Sun, 14 Dec 2025 00:32:03 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "A woman is fighting for life, and a man is in custody, after an alleged hit-and-run on the\n\nsaid a Toyota Yaris ploughed into eight pedestrians near the intersection of Aerodrome Road and Fourth Avenue in Maroochydore late last night.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/west-gate-tunnel-melbourne-open/a1fdcf09-2bf6-40a5-a438-85836c492e7b",
    "title": "The West Gate Tunnel finally opens after years of delays, but at what cost?",
    "publish_date": "Sun, 14 Dec 2025 01:34:54 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "The West Gate Tunnel in Melbourne is finally open after years of delay, promising to take trucks off local roads and to slash morning commutes.\n\nThe $10.2 billion project is designed to ease traffic congestion in the western suburbs of Melbourne and offer an alternative to the West Gate Bridge.\n\nThe first trips in the tunnel took place in the early hours of the morning as a fleet of Transurban cars drove through to mark its opening.\n\nThe tunnel will take 9000 trucks off of suburban roads, according to government figures. (Nine)\n\nIt is a toll road, with cars having to pay about $4 for a one-way trip, whilst trucks could pay up to $20 for a round trip in the tunnel.\n\nTravel time from the western suburbs into Melbourne could be slashed by 15-20 minutes if commuters use the tunnel.\n\nGovernment figures also claim about 9000 trucks will be taken off suburban roads due to the tunnel's opening, helping communities such as Williamstown and Yarraville.\n\nREAD MORE: ﻿ Flying tyre hits spectator at Victorian race event\n\nThe project has been beset by many delays, with an original opening date of 2022. (Nine)\n\n\"The West Gate Tunnel gives people real choice – the bridge or the tunnel – saving families time and reshaping travel across the west,\" Premier Jacinta Allan said.\n\nThe tunnel was initially proposed by the previous Premier Daniel Andrews, with a proposed opening date of 2022.\n\nHowever, it was hit with numerous delays, including the presence of toxic PFAS chemicals in the ground, which had to be dug up and disposed of safely.\n\nThe project is another major transport change in Melbourne, with the West Gate Tunnel opening to drivers just weeks after the opening of the Melbourne Metro Tunnel, a significant upgrade to the city's rail network.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/tyre-from-race-track-hits-volunteer-in-melbourne/7f7e4d8a-9deb-4fae-831f-41a4449d8f4e",
    "title": "Flying tyre hits spectator at Victorian race event",
    "publish_date": "Sat, 13 Dec 2025 21:51:53 +0000",
    "category": "sports",
    "authors": [
      "Dec"
    ],
    "text": "Footage has emerged on social media of a tyre flying into the air and striking a spectator at a racing event in Victoria.\n\nOver 100 people were attending the Fireball Derby, a﻿ Sprint C-Main event at Avalon Raceway, when a car's wheels detached and flew into the crowd about 9pm on Friday.\n\nThe tyre struck a volunteer who was standing in the crowd.\n\nREAD MORE: ﻿ Teenager falls to her death at popular lookout\n\nOver 100 people were attending the Fireball Derby when a tyre came loose. (9News)\n\nThe person was treated at the scene by aid crews.\n\nAnother person was hit but did not require treatment.﻿\n\nSocial media vision shows the tyre coming loose from the car before it soared through the barrier and into the crowd.﻿\n\nThe person was treated at the scene by aid crews on the ground. (9News)\n\nREAD MORE: Home sprayed with bullets while three people slept ﻿\n\nAvalon Raceway management said the tyre and wheel both disconnected due to a part failure.\n\nA review into track procedures is now under way.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/allegations-taxpayer-expense-parameters-were-altered-before-federal-election/a485230e-0ce9-4f96-be13-eb956102a01c",
    "title": "'It's outrageous': Pressure grows for Albanese to act on expense claims",
    "publish_date": "Sat, 13 Dec 2025 10:03:45 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Fresh questions are being asked about the expenses federal politicians are allowed to claim and what reviews should be implemented.\n\nDespite Prime Minister Anthony Albanese saying this week that the rules governing politicians' travel allowances were set by the previous government, documents reveal Labor's Special Minister of State Don Farrell made an alteration on February 12, just weeks before the federal election was called.\n\nThat change affected what classified as party political duties and seemingly broadened what politicians might be able to bill taxpayers for when it comes to travel expenses.\n\nPrime Minister Anthony Albanese and Minister for Communications and Minister for Sport Anika Wells. (Alex Ellinghausen)\n\n\"It's outrageous to change the rules so that the taxpayer can pay for campaigning and political party events,\" independent Senator David Pocock said.\n\n\"Clearly the rules are not in line with community expectations and we need to make sure they are in line with what Australians expect.\"\n\nEnergy Minister Chris Bowen defended the alterations, saying: \"My understanding is that that change was simply a clarification of the rules to make them simpler.\"\n\n\"There was no change to what is allowed or not allowed,\" Bowen said.\n\nIt has also emerged that a review into political expenses was meant to take place this year but was postponed by two years, and now won't take place until 2027.\n\nSenator David Pocock. (Alex Ellinghausen)\n\nSpecial Minister of State Don Farrell. (Alex Ellinghausen)\n\nThe government, at the time of postponing the review, cited disruptions from the federal election as the reason for the delay.﻿\n\nCentre for Public Integrity executive director Dr Catherine Williams said changes needed to be made.\n\n\"It's clear that the rules need to be reviewed so that members of parliament and the public can have confidence that when taxpayer money is being spent on parliamentarians' travel, it's meeting community expectations,\" she said.\n\nAlbanese has said he's seeking advice from the expenses watchdog regarding the legislation.\n\nBowen responded to questions about his colleagues' expenses during the unveiling of a shakeup of the government's home batteries subsidy.\n\nBowen said the subsidy scheme proved \"even more successful than the government originally anticipated\", meaning most of the $2.3 billion set aside for the four-year program would be exhausted within the next year.\n\nAs a result, the government has splashed an extra $5 billion ﻿into the program, but they're changing the parameters of the discounts.\n\nEnergy Minister Chris Bowen. (Nine)\n\nFrom May next year, only smaller batteries will receive the full 30 per cent discount.\n\nThat figure will taper down for larger batteries \"to make sure the program continues to be fair and sustainable\", Bowen said.\n\nEV benefits are also set to be reviewed.﻿",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/teenager-falls-to-her-death-moffat-beach-sunshine-coast/d0de78a5-2ca5-46a5-8ea6-6f87a023af0a",
    "title": "Teenager falls to her death while trying to take photo at lookout",
    "publish_date": "Sat, 13 Dec 2025 20:54:05 +0000",
    "category": "lifestyle",
    "authors": [
      "Dec"
    ],
    "text": "after slipping off a cliff while trying to take a photo.\n\nA 17-year-old girl fell 30-metres down a cliff at a lookout on Queen of Colonies Parade in Moffat Beach ﻿about 6.40pm (7.40pm AEDT) after reportedly jumping over a safety fence.\n\nA 17-year-old girl fell 30-metres down a cliff at a lookout on Queen of Colonies Parade in Moffat Beach ﻿about 6.40pm (7.40pm AEDT) after reportedly jumping over a safety fence.\n\nDespite the efforts of bystanders and paramedics, she died at the scene after suffering significant head injuries.\n\nDespite the efforts of bystanders and paramedics, she died at the scene after suffering significant head injuries.\n\nAnother woman sustained minor injuries as she tried to help the teenager.\n\nAnother woman sustained minor injuries as she tried to help the teenager.\n\nThe rough terrain even caused firefighters to slip as they attempted to reach her.﻿\n\nThe rough terrain even caused firefighters to slip as they attempted to reach her.﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/premature-baby-charlie-jones-queenslands-smallest-newborn-just-360g/cd61fc3b-11a4-436c-8a7f-ff2c4aa7f3df",
    "title": "Tiny newborn Charlie breaks record as Queensland's smallest baby",
    "publish_date": "Sat, 13 Dec 2025 23:12:02 +0000",
    "category": "sports",
    "authors": [
      "Dec"
    ],
    "text": "His minuscule weight is barely one-tenth of the average baby boy and is believed to be the state's\n\ntiniest newborn\n\n– breaking the record once held by the famous \"Coke can kid\", Jonathon Heeley,\n\nwho weighed 400 grams when he was born in 1992.﻿",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/perth-family-facing-deportation-granted-permanent-residency/313eced7-6aa4-41ac-9760-68f9039e9aad",
    "title": "Perth family's 14-year fight to escape deportation finally over",
    "publish_date": "Fri, 12 Dec 2025 20:08:45 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Exclusive: After 14 years of ﻿ denied visa applications and deportation notices, the Aldeiri family got the call they had been waiting so long for this week.\n\nMinister for Immigration Tony Burke had \"intervened\" in their decades-long fight to stay in Australia.\n\nThey were given an appointment at the immigration office on Wednesday and told nothing else.\n\nThe Aldeiri family have been fighting to stay in Australia for more than a decade. Now the fight is over. (Supplied: Rahma Aldeiri)\n\nRahma Aldeiri, 22, feared the worst.\n\n\"We didn't know what he was going to do, like, will he separate the family?\" she told 9news.com.au.\n\n\"Is he just going to grant me and my sisters the permanent residency, but my parents won't get it?\"\n\nInstead, her family got the news they'd waited 14 years for.\n\nEvery single one of them –﻿ dad Sultan, mum Reem, Rahma, and her twin sisters Hareer and Mesk – had all been granted permanent residency.\n\nTheir fight was finally over.\n\n﻿\"We were all just screaming and crying,\" Rahma said.\n\n\"We worked so hard this entire 14 years ... it was definitely worth it, but the process could have been easier.\"\n\nThe Aldeiri family came to Australia from Jordan in 2011, when Rahma was eight.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nRahma and her sisters, Mesk and Hareer, settled right into their new life in Australia. (Supplied: Rahma Aldeiri)\n\nThey were here to visit ﻿her maternal grandmother, an Iraqi refugee who had become an Australian citizen.\n\nWhile here, ﻿Rahma's parents Sultan and Reem applied for protection visas .\n\nThey wanted to stay in Australia and built a life in Sydney , where Rahma and sisters, then just five, started school.\n\nNeighbours called them a \"role model family\", and \"great citizens without being actual citizens\".\n\nBut their future was uncertain.\n\nThe family's protection visa applications made it all the way to the Federal Court but were denied.\n\nSo too were applications for child visas for Rahma and her sisters.\n\nScared for her future, ﻿Rahma started a Change.org petition in 2019 pleading to stay in Australia.\n\nShe was 15 and living in fear of being deported.\n\nREAD MORE: Actress Amanda Seyfried doubles down on Charlie Kirk comments\n\nRahma and her sisters spent most of their lives growing up in Australia, but their future was always uncertain. (Supplied: Rahma Aldeiri)\n\n\"That was a terrible time,\" she said.\n\n\"I'd almost be finishing high school, but I couldn't even celebrate that because I didn't know what would happen next week.\"\n\nThe following year, ﻿the family were given an official deportation notice. ﻿\n\nThey emptied their Sydney home, bought tickets to Jordan, and made one last trip to Perth to see relatives.\n\nThen the pandemic hit, borders slammed shut, and the ﻿Aldeiri family couldn't leave.\n\nSo their immigration lawyer, Simon Jeans, kept fighting for them to stay.\n\nHe made last-ditch applications for a ministerial intervention﻿ but it still took years for the family's case to be seen by Minister for Immigration Tony Burke in 2025.\n\nBy that time, the Aldeiri family had built a life in Perth.\n\nRahma had earned a nursing degree from Curtin University, and her twin sisters Hareer and Mesk had finished high school.\n\nRahma is now a university graduate and her twin sisters are planning careers of their own. (Supplied: Rahma Aldeiri)\n\nBeing sent back to Jordan, a country they could barely remember, was unthinkable.\n\n\"It just doesn't make any sense for us to go back, we have nothing there. This is our home, why would we leave our home?\" Rahma told 9news.com.au in February.\n\nWords can't describe the relief she felt when they were granted permanent residency.\n\nRahma called it the best news of her life in a Change.org update to the 40,000 strangers who backed her petition.\n\nShe also thanked two Nine reporters – Jayne Azzopardi and 9news.com.au's Emily McPherson – for bringing her family's fight into the spotlight over the last 14 years.\n\n\"You helped give our family a voice when we felt voiceless,\" she wrote.\n\n\"You kept us going when things felt impossible.\"\n\nNow she's looking forward to a stable future here in Australia.\n\n﻿As permanent residents, Rahma and her parents can finally get permanent work.\n\nRahma spent years fighting to stay in Australia. Now she can focus on her future. (Supplied: Rahma Aldeiri)\n\nHer younger sisters, both 19, can also start pursuing careers without fear of being deported.\n\n﻿Mesk is already studying engineering on a scholarship at the University of Technology, Sydney.\n\nBut Hareer, who had been unable to secure a scholarship, wasn't able to start a teaching degree due to high international student fees.\n\nThat won't be a problem now.\n\n﻿\"Now we can buy a house, now we can have a little holiday ... I still can't process it,\" Rahma said.\n\n\"No more applications, no more chasing up Medicare, no more stressing about waiting for a call, nothing.\n\n\"Just you wake up and it's nice, it's silent ... it's all over, and we can just live normally now.\"﻿",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/hot-days-power-grid-aluminium-smelter-air-conditioning/65973a00-6e45-4d49-ad2d-db157033a81c",
    "title": "Keeping homes powered on scorchers relies on shutting one industry down",
    "publish_date": "Fri, 12 Dec 2025 20:28:28 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Some days are made for air conditioning .\n\nOn those days where the mercury rises to the angry end of the 30s, those of us with air-con wondered what we did without it.\n\nBut it's on those days Australians stand the greatest risk of losing it all to an unwelcome blackout.\n\nAir conditioning is a major cause of a rise in household electricity use. (Getty)\n\nWhile the grid used to be under the most pressure on winter nights, things have changed, according to the Grattan Institute's Alison Reeve.\n\n\"The winter evening peak in the old days was just everyone coming home and putting the heating on at the same time,\" she said.\n\n\"Now what it's shifting to is everyone putting the air conditioning on at the same time.\"\n\nAdding more pressure on the grid is an ironic issue with coal generation.\n\nIf it gets too hot, coal plants start to struggle.\n\nAluminium smelters are asked to shut down temporarily rather than cause blackouts elsewhere. (Nine Archives)\n\n\"Coal generators are more likely to break down because they don't cope very well with high heat,\" Reeve said.\n\n\"So when that happens, that can also cause a blackout or a brownout, because you've got such high demand at the same time.\"\n\nWhat is saving most Australians from blackouts is an arrangement with some of the country's biggest users of electricity .\n\nWhen the grid is under too much strain, the major users are asked to switch off.\n\nThe biggest offenders are aluminium smelters.\n\nAustralia has four aluminium smelters that account for 10 per cent of the electricity used in the country.\n\nAluminium smelters are the biggest user of electricity in Australia. (Nine Archives)\n\nThe Tomago smelter on the NSW Central Coast uses as much power as a city of a million people.\n\nAnd high power bills has meant the smelter is now turning to the federal government to keep them open.﻿\n\nBut switching them off is an expensive endeavour.\n\nThe smelters run 24 hours a day, and any shutdown is problematic.\n\n\"It doesn't happen that often,\" Reeve said.\n\n\"It's there if we need it.\"\n\nAluminium smelters like this one in Portland use a massive amount of electricity. (Nine Archives)\n\nAnd while rooftop solar panels are helpful for the grid on hot days, it is taking the edge off rather than carrying the load.\n\nSolar panels generate the most electricity around 1pm, but the usual peak time for power usage is about 5pm. By then, the sun has started to set and less electricity is being generated.\n\nSo how can the average punter reduce the risk of blackouts on a hot summer's day?\n\nThe best options are to add a few degrees to the air conditioner, and, obliquely enough, make sure your aluminium cans are getting recycled.\n\nREAD MORE: How each Australian state is doing when it comes to renewable energy",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-14/coles-woolworths-hit-back-at-price-gouging-ban/106141094",
    "title": "Coles and Woolworths hit back at government's price gouging ban",
    "publish_date": "Sun, 14 Dec 2025 01:59:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's major supermarkets are furious they are being targeted with more regulations, with Coles crying poor about making about $2.50 for every $100 a customer spends.\n\nThe federal government has introduced rules to limit \"excessive pricing of groceries\", and Australia's major supermarkets are furious they are being targeted with more regulations.\n\nLower grocery bills are being promised within this new ban on price gouging, but giant retailers say they are the ones feeling the pinch.\n\nThe move against price-gouging, foreshadowed before a snap consultation period earlier in the year, takes effect on July 1.\n\nKey takeaways from the ACCC's supermarkets report Allegations of price gouging by the supermarket giants prompted an inquiry into the sector by the ACCC — but after a year of investigating, its final report hasn't been able to say whether it's taking place.\n\nIt will prohibit very large retailers from charging prices that are excessive when compared to the cost of the supply, plus a reasonable margin, the government said on Sunday.\n\n\"This is all about getting a fairer go for families in their weekly shop,\" Treasurer Jim Chalmers said.\n\nFrom July, supermarkets could face fines of $10 million per breach, three times the value of the benefit derived or 10 per cent of the company's turnover during the preceding 12 months.\n\nIn March, the Australian Competition and Consumer Commission found the near-duopoly enjoyed by Coles and Woolworths gave them little incentive to compete vigorously.\n\nThey were among the most profitable supermarkets in the world, an inquiry found.\n\nBut the report never directly accused the supermarkets of gouging customers, something both Coles and Woolworths have consistently denied.\n\nIt did not make a finding on, or seek to define whether supermarket prices were \"excessive\", since high margins are not prohibited under consumer laws.\n\nColes hit back, saying more regulations were not the answer to lowering grocery prices and would drive costs up for shoppers.\n\n\"At a time when the focus should be on easing cost-of-living pressures, these regulations risk doing the opposite,\" a Coles spokesperson said on Sunday.\n\n\"For every $100 customers spend at Coles, we make around $2.43 in profit — less than 3 cents in the dollar,\" they argued.\n\nColes said this ban could have the opposite effect than intended. (ABC News: Patrick Rocca)\n\nValued at more than $29 billion, the supermarket giant said higher energy, freight, labour, insurance and production costs were the key pressures to getting goods on shelves and selling them.\n\nWoolworths warned the ban would create a butterfly effect where shoppers would miss out on great deals, with the $36 billion public company saying it had delivered savings for consumers for seven quarters in a row.\n\n\"The law is unprecedented by targeting only two Australian-owned companies,\" a Woolworths spokesperson said, referring to it and its competitor Coles.\n\nThe retail giant said it would result in \"an uneven playing field which will see much larger, foreign-owned retailers free to charge customers whatever they want, without any of the new proposed restrictions\".\n\nThe Business Council of Australia also savaged the price gouging ban for being misplaced in its target.\n\n\"We all want lower prices for Australians, but regulation should be based on evidence,\" the council's CEO Bran Black said.\n\n\" If Australia wants lower prices and better outcomes for consumers, we need to focus on reducing unnecessary regulation and addressing the underlying cost pressures across supply chains. \"\n\nThe consumer watchdog's report found grocery prices rose at more than double the rate of wages between late 2022 and early 2023, attributing at least some of those rises to additional profits for Coles, Woolworths and Aldi.\n\nIn a statement, the Australian Retailers Association's chief executive Chris Rodwell said they \"strongly oppose\" the ban.\n\n\"These measures seek to address a problem for which there is no evidence and risk having the opposite effect — pushing grocery prices higher for Australian families,\" Mr Rodwell said.\n\nThe treasurer said the changes give the competition watchdog the powers it needs to hold supermarkets to account by policing the new regime.\n\n\"One of the best ways to ease the cost of living for Australians is to help people get fairer prices at the checkout and that's what this is all about,\" he said in a joint statement.\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-14/virtual-fencing-legalised-nsw/106128536",
    "title": "Farms go fence free with tech likened to an 'Apple Watch for cows'",
    "publish_date": "Sun, 14 Dec 2025 01:45:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Virtual fencing has been legalised in New South Wales, with users of the technology already labelling it a \"lifesaver\".\n\nIt allows livestock to be moved or confined without the need for physical fences or gates.\n\nThe technology involves the use of a collar on livestock that sends out noises and an electric pulse if an animal leaves the designated area.\n\nFarmers can change the boundaries and check in on an animal's individual data on a mobile app.\n\nAngus McIntosh is a mixed farmer from Molong. (Supplied: Angus McIntosh)\n\nVirtual fencing is already legal in some other states, where farmers have credited it as a success.\n\nHowever, some in NSW remain undecided.\n\n\"I see the advantage of virtual fencing … but the maintenance of the collars, or the technology, how reliable they are … they're the real concerns,\" farmer Angus McIntosh said.\n\nAnd with the electronics reliant on telecommunication towers and satellites, some farmers have questioned how they will perform during emergencies.\n\nVirtual fences have been made legal in NSW. (ABC Rural: Emily Middleton)\n\nWhat is the cost?\n\nMr McIntosh currently operates roughly 2,000 sheep and 100 cows on just over 1,400 hectares of grazing land in Molong in the state's central west.\n\nHe has been thinking about using the technology, but is worried about the cost.\n\n\"On our level, it needs to be affordable to do a couple hundred head of cattle at a time, so the price point will be the deciding factor of how well it gets taken up,\" he said.\n\nCollars use solar panels to charge. (Supplied: Halter)\n\nIn addition to the collars, which can cost several hundred dollars per cow, towers are needed on properties for farmers to set up their virtual fences.\n\nLivestock researcher for the Kondinin Group, Pamela Lawson, said one provider's towers cost about $6,000 each.\n\n\"Which depends on the topography of your land and how many towers you're going to need,\" she said.\n\nThe systems are then controlled via an app, which is charged at about $2 to $2.50 per cow per month.\n\nHow does the technology work?\n\nDirector of strategic relations at virtual fence manufacturer Halter, Brent Thomas, described the technology as an \"Apple Watch for cows\".\n\nBrent Thomas says the collars can give farmers lots of useful information. (Supplied: Brent Thomas)\n\nHe said Halter's solar-powered collars monitored animals as well as controlled their movements.\n\n\"The [collars] can tell the farmer if there's any health problems or any kind of fertility indicators,\" he said.\n\nThe technology for Halter's collars involves the installation of a tower on the property that connects to the individual farmer's internet or telephone service, which provides a backup if there is a fault.\n\nVirtual fencing relies on the use of telecommunication technology such as satellite and service towers. (Supplied: Halter)\n\nMs Lawson said virtual fencing was already being used in about 23 per cent of Tasmania's dairy herd, but the take-up in the beef sector may be slower.\n\n\"It's just a bit more questionable about the sort of more broadacre general beef farmers on more extensive grazing country, how it will all work, given the amount of collars they will need and the area they are covering,\" Ms Lawson said.\n\nHowever, Mr Thomas said the fences were currently used on \"really big ranches\" in Montana and Texas.\n\n\"They're able to work on really large properties,\" he said.\n\nMember for Orange, Phil Donato, and Minister for Agriculture, Tara Moriarty. (ABC Rural: Emily Middleton)\n\nCost savings?\n\nTraditional fencing costs about $12,000 per kilometre, with an average farmer expected to install around two to three kilometres of fencing every year.\n\nThe set-up costs of virtual fencing will vary depending on the number of animals it is used for and the topography of a property; however, it's estimated that the first year's costs could be comparable to a farmer's annual fencing budget, with costs after that reducing significantly.\n\nOrange MP, Phil Donato, who has been pushing for virtual fencing to be legalised in NSW for five years, said farmers in other states have reported cost savings.\n\n\"I spoke to a farmer in Tasmania who's been using it … his fuel bill went from $1,000 to $100 a month because he's not driving around on a quad bike early in the morning,\" Mr Donato said.\n\n\"He's got more time to spend with his kids and his wife.\"\n\nEmergency performance\n\nWhen it comes to emergencies like bushfires and flooding, farmers have expressed concern over how the technology will hold up.\n\nMr Thomas said the collars were put to the test during severe storms in Tasmania last year.\n\nThe technology allows farmers to define boundaries without physical fences. (Supplied: Halter)\n\n\"Farmers were able to move their animals remotely without sending out staff and putting them in danger in the middle of the night,\" he said.\n\nNSW Farmers Association Animal Welfare Committee chair Robert McIntosh said while virtual fencing will be a \"game changer\" in emergencies, there would be a problem if the technology were reliant on just mobile phone signals due to poor connectivity in rural communities.\n\nHowever, a lot of the technology also uses satellite navigation.\n\n\"That's a lot more consistent and more reliable for farmers,\" he said.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-14/brett-lee-backs-current-australian-bowling-attack-as-greatest/106141014",
    "title": "Lee backs current quartet as Australia's 'best ever'",
    "publish_date": "Sun, 14 Dec 2025 01:08:23 +0000",
    "category": "sports",
    "authors": [],
    "text": "Brett Lee has labelled Australia's current bowling attack the country's greatest ever, declaring Pat Cummins's men have now surpassed his group from the early 2000s.\n\nAustralia's attack will take one step closer to being reunited in Adelaide this week, with Cummins and Nathan Lyon back in the team alongside Mitchell Starc.\n\nJosh Hazlewood remains out, but Scott Boland has proven to be, arguably, the best back-up bowler in the game's history since his 2021 debut.\n\nCummins, Starc, Lyon and Hazlewood have now played 389 Tests between them and taken a total of 1,586 wickets.\n\nThree of the four have passed the 300-wicket milestone, while Hazlewood sits on 295 and will doubtless join them when he returns from injury.\n\nScott Boland (second right) is not a bad backup. (Getty Images: Cricket Australia/Morgan Hancock)\n\nOf the 35 Tests all four have played together, Australia have won 22, lost nine and drawn four.\n\nThe 567 wickets the quartet have taken in matches while playing in the same side is also a record.\n\nBoland is not included in those figures, but his 69 wickets at 18.17 means the Victorian still has the best Test average of any bowler in the past 90 years.\n\nAustralia's first-choice group from the early 2000s of Glenn McGrath, Shane Warne, Jason Gillespie and Lee is usually considered the yardstick of great attacks.\n\nThey won 10 of 16 Tests they played together, and were a key part of Australia's dominance of world cricket with a combined 1,842 Test wickets.\n\nThe formidable golden era crop of bowlers will take some beating. (Getty Images: PA Images/Chris Young )\n\nBut Lee said he believed the current group had now usurped them.\n\n\"They're the best ever, I reckon,\" said Lee, who is in commentary for Kayo this summer.\n\n\"It's different eras, and hard to compare, but I would put them above us.\n\n\"If you look purely on stats, everyone has taken over 250 Test wickets, and that's never been done before.\n\n\"Scott Boland, if he is included in that, is a bit like Michael Kasprowicz, didn't really get an opportunity but a wonderful bowler.\n\n\"These guys are so good that the Australian public won't recognise how good they are until they're gone.\"\n\nTold of Lee's remarks ahead of the summer, Cummins pointed to the differences in the quartet as a key component to their strength.\n\n\"That's pretty awesome for him to say,\" Cummins said.\n\nPat Cummins will return in Adelaide after missing the first two Ashes Tests. (Getty Images: PA Images/Robbie Stephenson)\n\n\"We've been lucky we've all had our careers coincide with each other. I wouldn't have had anywhere near the career I have had alongside other guys.\n\n\"Those guys push me and are the best coaches.\n\n\"You have the control Nath brings. Starcy is different as a left-armer. Josh has the bounce and swing. It opens me up to be a bit more creative.\n\n\"It feels like we can really dovetail nicely into each other.\"\n\nAs Starc points out, comparing eras is hard.\n\nCricket changes from one generation to the next, and in the past five years pitches in Australia have become easier to bowl on.\n\nBut with that has also come finer margins, with Australia's current group regularly needing to either keep their side in a game or dig them out of a hole.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Five or six years ago where Melbourne was a graveyard, that's changed completely now to being quite seamy,\" Starc said.\n\n\"Adelaide used to be flat, now it's often a pink-ball game and pretty even. We now play at [Perth Stadium] instead of the WACA, SCG you're not quite sure what you're getting.\n\n\"You just need to adapt as a team.\n\n\"But it's certainly not lost on us how special the group has been.\n\n\"It's very rare that you get four guys from the same state to have played so much together to the amount we have and have a fair bit of success along the way.\n\n\"Scotty has been a part of that group for a number of years now. We're very lucky.\"\n\nHow the attacks stack up\n\nGolden era:\n\nGlenn McGrath: 563 wickets at 21.64\n\nBrett Lee: 310 at 30.81\n\nJason Gillespie: 259 at 26.13\n\nShane Warne: 708 at 25.41\n\nTotal: 1,842 at 25.24\n\nCurrent era:\n\nPat Cummins: 309 wickets at 22.10\n\nMitchell Starc: 420 at 26.46\n\nJosh Hazlewood: 295 at 24.21\n\nNathan Lyon: 562 at 30.16\n\nTotal: 1,586 at 26.51\n\nAAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-14/west-gate-tunnel-opens-melbourne-western-suburbs/106140782",
    "title": "Melbourne's West Gate Tunnel opens, with promise to transform travel in city's west",
    "publish_date": "Sun, 14 Dec 2025 00:28:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "Melbourne's West Gate Tunnel has officially opened to the public, with drivers traversing its path for the first time — for a fee.\n\nThe project was initially costed at $5.5 billion with just $400 million of taxpayer investment, but that has since blown out to $10.2 billion with the state chipping in $4.2 billion.\n\nThe twin tunnels have been designed to provide an alternative route for freight trucks travelling through the city's west to the Port of Melbourne, reduce travel time for commuters and traffic on the West Gate Bridge, while also improving bike paths to enable cyclists to travel more safely into the city.\n\nThe road tunnel's opening comes a fortnight after the opening of the Metro Tunnel rail project drew thousands of curious first-time passengers.\n\n\"It's going to be a massive game-changer for the way people travel around this great city and state,\" Premier Jacinta Allan said.\n\n\"It means families can get home sooner, congestion will be slashed and most importantly too, for residents here in the western suburbs, it'll get trucks off local roads because they'll have that much-talked-about, long-needed alternative to the West Gate Bridge through the West Gate Tunnel, providing direct access to the Port of Melbourne.\"\n\nThe West Gate Tunnel opened in the early hours of Sunday morning. (Supplied: Victorian Infrastructure Delivery Authority)\n\nThe twin tunnels opened to travellers while most Victorians were sleeping, with the outbound tunnel opening at 12:10am, the inbound route at 2:15am and the Wurundjeri Way extension at 2:45am.\n\nTolls for the tunnel will be $6.54 for cars using the city exit during the morning peak — from 7am-9am on weekdays — and just over $4 to access other parts of the tunnel, and at off-peak times. Motorcylists will be charged less, while those driving light-heavy vehicles will be charged up to $10.47 per trip.\n\nThroughout January, the tunnel will be free for all drivers on weekends.\n\nMelburnians had the chance to walk through parts of the tunnel in November. (ABC News: Leanne Wong)\n\nAs well as cost overruns and the project overshooting its estimated completion date by three years, issues such as how and where to dispose of contaminated soil have also been sources of angst.\n\nThe premier defended the project running over budget.\n\n\"These are big and complex projects and they do come … along the journey, with some additional challenges and I will acknowledge with the delivery of the West Gate Tunnel project there were some additional challenges that came along as we were getting in and delivering the project,\" Ms Allan said.\n\n\"But ultimately we had a choice to make. Do you get on, address the challenges, roll up your sleeves and do the hard work, or do you turn away from these projects like the Liberal Party would have you do?\"\n\nEarly in 2018, the opposition and the Greens teamed up to temporarily revoke the project's planning approval, but months later the Liberals pledged support for building the West Gate Tunnel.\n\nA map showing the West Gate Tunnel project, which is officially open. (Supplied: Victoria's Big Build)\n\nWestern suburbs residents welcome 'better health'\n\nThe opening of the tunnel will see 9,000 fewer trucks on western suburbs roads daily, according to the state government.\n\nIn some areas, there will be zones where freight trucks are banned around the clock, while curfews will apply on key arterial routes in the west, including Williamstown Road.\n\nMartin Wurt, from community group the Maribyrnong Truck Action Group, which has long campaigned for measures to reduce the number of trucks travelling through residential areas in the western suburbs, said the tunnel would help improve living standards.\n\nHe said residents in the area were \"heavily impacted\" by air pollution.\n\n\"To get these trucks off our streets, away from our schools, away from our kindergartens, away from our shops, hopefully is going to lead to a better health outcome,\" Mr Wurt said.",
    "source": "ABC",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-14/ashleigh-gentle-t100-qatar-miscarriage/106140914",
    "title": "Ash Gentle competes in triathlon after 'incredibly isolating' miscarriage news",
    "publish_date": "Sun, 14 Dec 2025 00:06:04 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian triathlete Ashleigh Gentle has overcome the devastation of miscarriage to finish a brave sixth place at the season-ending Qatar T100 event.\n\nThe result secured Gentle fourth spot in the overall T100 standings, but pales into insignificance compared to what she had to deal with in the lead-up to the event.\n\n\"I'll be lining up at the T100 Grand Final here in Qatar after experiencing a miscarriage last week at around seven weeks pregnant,\" Gentle wrote on Instagram this week.\n\n\"It's not something I'd ever wish on anyone.\"\n\nLoading Instagram content\n\nTo make matters worse, partner Josh Amberger was away competing in Chile in what was to be his final professional triathlon at the Iron-distance Patagonman event.\n\n\"I've been overwhelmed with emotions while also trying to celebrate Josh's final triathlon in Chile. Honestly, I felt a little crazy still getting on my original flight to Doha,\" Gentle wrote.\n\n\"I have no idea whether I can be competitive on Friday (I wanted to be honest here) and I hope no one feels let down by this.\n\n\"I could so easily share a different story and pretend everything has been perfect, but it's exhausting, and the reality is that life doesn't always unfold the way we hope.\"\n\nAlthough the result was immaterial given what was happening away from the race, Gentle still performed superbly, running the fastest 18km split of anyone in the race (1:05:20) to run into sixth.\n\nAshleigh Gentle said there was no shame, but the news was still incredibly isolating. (Supplied: T100)\n\nAfter the race, Gentle posted that she would not have been happy with the performance at the start of the year, but was understandably \"walking away proud\" of her efforts.\n\n\"Inspired by so many women around me. We are stronger than we know,\" the 34-year-old wrote.\n\n\"I really didn't know how I would perform today and it's a result that I wouldn't be satisfied with at the start of the year, but today I'm walking away proud.\"\n\nMeanwhile, Amberger had raced from Chile, where he finished second, to watch Gentle compete in Qatar and was full of admiration for his wife.\n\n\"[Patagonman was] one of my most memorable days of my life, but also with the feeling of loss & helplessness playing out at home,\" he wrote.\n\n\"Very courageous of [Ash] to share the news of her miscarriage, which happened just days before [the race].\n\n\"I left her at home to see through my dreams in Chile, but she went on to experience a heartbreaking loss.\n\n\"It's a duality that still feels surreal, not having been there to support her or being able to properly process it abroad.\n\n\"Asha I'm in awe of your courage and also your spirit to finish off the season.\"\n\nAshleigh Gentle said the swim was \"one of the worst\" ever. (Supplied: T100)\n\nGentle was offered plenty of support on social media from athletes across the sporting spectrum.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBritish Olympic bronze medallist Beth Potter wrote: \"So sorry to hear this Ash, cheering for you on Friday and sending love and strength,\" while T100 rival Lucy Charles Barclay, Australian skier Britt Cox and former cyclist Grace Brown sent \"big hugs\" to her.\n\nFellow triathlete Milán Agnew simply wrote that she was \"in awe\" of her bravery, while Tokyo Olympic teammate Emma Jeffcoat thanked her for sharing the news.\n\nGentle, a two-time Olympian and record-breaking 11-time Noosa Tri champion, said there was no shame in experiencing a miscarriage, but it was still a tremendously tough thing to experience.\n\n\"There should be absolutely no shame in experiencing a miscarriage, so many women go through it, yet it can feel incredibly isolating,\" she said.\n\n\"I'm very grateful for the opportunities I have in this sport, and there is still so much I want to achieve. I also hope that one day I'll have the privilege of becoming a mum.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-14/first-nations-musicians-mentored-by-band-to-create-songs/106113948",
    "title": "The budding musicians 'staying proud' through Indigenous rap music",
    "publish_date": "Sat, 13 Dec 2025 23:29:25 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "The vocals are recorded in a cupboard, there is a drum kit in the bedroom and the lounge room is a makeshift studio.\n\nA house at Merimbula on the NSW far south coast has been turned into a music studio for three days so a group of First Nations teenagers could create songs about cultural connection.\n\nFor high school student Peter Longbottom, the experience of writing, recording and producing music for a week in has been a first.\n\n\"I think it's pretty cool. The way it all just works and all the engineering and software,\" said the 15-year-old, who has played drums for eight years.\n\nGrow the Music transformed a home in Merimbula into a recording studio. (ABC South East NSW: Floss Adams)\n\nPeter was involved in writing some of the lyrics, and one of his peers rapped in local Djiringanj language, which he said was \"pretty powerful\".\n\n\"The song is about staying black and staying proud. Don't be ashamed to show who you are,\" he said.\n\nFor Nevaeh Cunningham, the week solidified her passion for music.\n\n\"I started off on guitar and then went to keyboard and now I'm on drums,\" the 16-year-old said.\n\n\"I could start my own band at home because I've got all the instruments.\"\n\nLoading...\n\nMore First Nations music\n\nThe program was run by Grow the Music, an initiative trying to make music accessible for people from diverse backgrounds and First Nations communities.\n\nPeter Longbottom said he wanted to see more First Nations music make it to the mainstream.\n\n\"I just want to see more cultural music, more cultural songs,\" he said.\n\nBassist Isabella Cartwright said fostering young people to make the music themselves could help bring more Indigenous talent to the fore.\n\n\"I feel like if young people get to do stuff like this, it would inspire more ideas,\" she said.\n\nThe high school students say they want to see more First Nations music in the mainstream. (ABC South East NSW: Floss Adams)\n\nLizzy Rutten co-founded Grow the Music in 2012, and has since donated instruments and taught kids across Australia.\n\n\"Music is a language that connects us all and it's based on a vibration,\" the Coffs Harbour-based Ms Rutten said.\n\n\" It's really important that we hear Aboriginal music in this country because it's ancient. The art form is ancient here. \"\n\nMs Rutten said the kids grew in confidence over the course of the three-day program, and she hoped the skills they learnt would live on.\n\nLizzy Rutten wants to help kids believe that anyone can make music. (ABC South East NSW: Floss Adams)\n\n\"By the end we were just mates and experienced something super connected,\" she said.\n\n\"They shared vulnerable stories and they wrote those stories in their songs.\"\n\nMentored by Docker River Band\n\nThe high school students were also mentored by the Docker River band, from the remote community of Kaltukatjara in the Northern Territory.\n\nThe band travelled from the small desert community to the NSW far south coast to help mentor the kids, and play at the Giiyong Festival in late November.\n\nRoy Jugadai (left) and Thaddeus Mitchell from the Docker River Band. (ABC South East NSW: Floss Adams)\n\n\"We live differently than coast people. It's really new,\" Docker River Band keys player Thaddeus Mitchell said.\n\nThe band has opened a shed in its own community to inspire the next generation of musicians, and wanted that enthusiasm to spread to the far south coast.\n\n\"Music changes people, so we're hoping that it'll change the kids as well,\" Mr Mitchell said.\n\nThe First Nations high-schoolers found spending time with the band helped them see a potential in the music industry.\n\nGiiyong Festival is the largest Indigenous festival in southern NSW. (ABC South East NSW: Floss Adams)\n\n\"It's cool to see it because then it's like, maybe that can be us one day,\" 15-year-old Isabella Cunningham said.\n\n\" I would like to try and be in a band one day and let my stories go through lyrics and be out there for the world. \"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-14/michelle-rowland-to-repay-expenses-claim/106140868",
    "title": "Attorney-general to repay family travel expenses",
    "publish_date": "Sat, 13 Dec 2025 23:14:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "Attorney-General Michelle Rowland has been told to repay some of the expenses she claimed for a week-long family trip to Perth, after the independent watchdog found the spending was outside the official guidelines.\n\nMs Rowland referred the expenses to the Independent Parliamentary Expenses Authority (IPEA) last week, after the Australian Financial Review reported she had billed taxpayers more than $21,000 for the trip in 2023, including $16,050 in flights for her family.\n\nIn a statement on Sunday, Ms Rowland's office confirmed she would be repaying a \"portion\" of the trip following IPEA's advice.\n\n\"IPEA finalised its advice on Friday 12 December and conveyed a portion of the family reunion travel expenses were outside the guidelines,\" the statement said.\n\n\"The attorney-general has formally accepted that advice on Friday and commenced steps to make a repayment.\"\n\nThe spokesperson said the attorney-general had at least 10 official engagements during her week in Perth and on days with no official duties, it is understood Ms Rowland covered her own expenses and accommodation.\n\nExpenses scrutiny grows\n\nMs Rowland's cabinet colleagues were defending her on Sunday, with Transport Minister Catherine King rejecting suggestions the nation's chief law officer should resign.\n\n\"No, I do not think Michelle Rowland needs to resign,\" Ms King told reporters.\n\n\"I think Michelle has done exactly what she should do, she's referred her use of expenditure to the Independent Parliamentary Expenses Authority … and she's paying the money back.\n\n\"Members are accountable for the decisions they make.\"\n\nTreasurer Jim Chalmers also backed the attorney-general while acknowledging the \"substantial community concerns\" that have arisen about the use of travel entitlements.\n\n\"I think it's appropriate that colleagues have sought assurances from the independent body that these claims are within the rules. I'm confident that they are,\" he said.\n\n\"It's also appropriate that the prime minister has asked the organisation, at arm's length from the government, for advice on any changes which may be necessary.\"\n\nThe attorney-general is the second politician in the past week to have referred themselves to IPEA after Communications Minister Anika Wells, who sparked the travel expenses furore when it was revealed she had billed taxpayers nearly $100,000 for last-minute flights to New York to spruik the government's teen social media ban.\n\nAnika Wells has also referred her travel spending for review. (ABC News: Ian Cutmore)\n\nFurther scrutiny of her expenses found Ms Wells, as sports minister, had also spent thousands of dollars flying her family to Thredbo's ski resort, where she was attending a work event, and flying her husband to major sporting events including AFL Grand Finals, Boxing Day Test matches and the Formula 1 Grand Prix.\n\nMs Wells insists her spending is within the rules but referred herself to IPEA \"for the avoidance of doubt\".\n\nAfter initially dismissing calls for the rules to be tightened, Prime Minister Anthony Albanese has now asked IPEA to review whether the taxpayer-funded perks, including generous family reunion entitlements, should change.\n\nWhen can politicians charge the 'company card'? A spotlight on sports minister Anika Wells prompts fresh scrutiny of the rules about the expenses politicians can claim, including to attend big-ticket sporting events and concerts.\n\nParliamentarians are entitled to claim expenses for some family travel, including three Australia-wide business class return flights to where the politician is working and travel to Canberra from their home up to the value of nine return business class flights per year.\n\nMinisters Wells and Rowland are not the only politicians to have taken advantage of the entitlement, with an ABC investigation revealing MPs had spent more than $1.1 million under the family reunion provisions last financial year.\n\nTrade Minister Don Farrell topped the list of spending, at $48,178, with WA Senator Fatima Payman and Nationals MP Andrew Willcox not far behind.\n\nOpposition Leader Sussan Ley has repeatedly said she was open to \"looking at the rules\" and has written to Mr Albanese requesting a meeting to discuss how trust in the system can be strengthened, \"so community expectations are being met\".\n\nThe expenses authority is responsible for monitoring compliance with the rules and can make recommendations when it audits politicians, but the guidelines themselves are set by regulation, administered by the finance minister and special minister of state.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-14/truck-drivers-suggest-paying-to-improve-rest-stops/106130764",
    "title": "Truckies in regional Australia call for public toilet membership",
    "publish_date": "Sat, 13 Dec 2025 23:06:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "The cost of maintaining rest stops in regional Australia could be offset by road users paying an annual fee, under a scheme proposed by a group of Australian truck drivers.\n\nThe federal government has allocated about $140 million to upgrade heavy vehicle rest areas across Australia over 10 years.\n\nThe rest stops in some of the country's most remote areas are being built with toilets and showers to address a shortage of regional facilities.\n\nTruck drivers consulting with the federal government have suggested a pay-as-you-go system for people using the rest areas.\n\nHeather Jones says paying a fee to access rest stops is a small price for clean facilities. (ABC Pilbara: Karen Michelmore)\n\n'Just like a Qantas card'\n\nCommittee member Heather Jones suggested a membership program similar to those used at airports.\n\nRest stop bulldozed The West Australian roads authority has drawn fire for bulldozing and closing off a rest stop that illegal campers used as a dumping ground.\n\n\"You pay your annual fee or your once-off fee, and you get a fob card that's allocated to you, and that's yours to use for as long as you're using those facilities,\" she said.\n\n\"Just like a Qantas card.\"\n\nMs Jones, a truck driver and co-founder of the Pilbara Heavy Haulage Girls, said the fee would be put back into maintaining the difficult-to-clean remote bathrooms.\n\n\"I would absolutely pay a hundred bucks a year for a swipe card if I knew the toilets had toilet paper and were clean,\" she said.\n\n\" There's nothing worse than trying to find a clean toilet and shower to use on the road. \"\n\nThe latest round of funding for the project includes six rest areas across Australia.\n\nIt includes upgrades to rest stops in Central Darling and Narromine in NSW, upgrades to heavy vehicle rest areas in Rocky Gully and Cranbrook in WA, and new rest areas in Calingiri and Mundrabilla in WA.\n\nNelly Milo says vandalism and filthy conditions forced the roadhouse and shire to close their facilities. (ABC Great Southern: Andrew Chounding)\n\nRegional facilities closing\n\nThe pay-as-you-go scheme has been welcomed by other communities, which have struggled to maintain rest stop facilities.\n\nNelly Milo runs the Pingrup Roadhouse 360 kilometres south of Perth, and said the constant vandalism and filthy conditions forced the roadhouse to close its toilets to the public nine months ago.\n\n\"People kept throwing toilet rolls and rocks, sand, you name it, it went,\" she said.\n\n\"I had to keep calling the septic people to come out and try and unblock them, and it was costing heaps of money, so the easiest thing to do was to close them.\"\n\nPingrup Roadhouse closed its rest rooms nine months ago. (ABC Great Southern: Andrew Chounding)\n\nMs Milo said hygiene issues at the Pingrup Hall toilets across the street had also caused those facilities to close.\n\n\"Kids would jump on them [septic tanks], the lids would break and the kids go in … minutes later mum's taking them in the shire toilet, throws water over them, cleaning them up, and then just leaving everything on the ground,\" she said.\n\n\" If somebody told me to go and clean [them], I'd tell them where to go. \"\n\nThe Shire of Kent said it closed the public bathrooms about two years ago due to high cleaning costs and the availability of other facilities in the town.\n\nSigns on the roadhouse and shire-owned rest rooms direct travellers to the local caravan park.\n\nMore than 600 access fobs for a public bathroom in Leonora have been sold to members of the public. (ABC Esperance: Emily Smith)\n\nPay-as-you-go mixed response\n\nThe town of Leonora, 950 kilometres east of Perth, has been operating a pay-to-use toilet and shower facility since 2023.\n\nAccess to the rest rooms with toilets and showers costs a one-off fee of $28 with no expiry date.\n\nManager of business services, Kiara Lord, said since the facility opened, about 600 access fobs had been purchased.\n\nMs Lord said the fee paid was only to offset the cost of the fobs and did not offset the cost of cleaning the facility.\n\n\"[Cleaning] occurs two times a day, and the cleaner has not complained about excessive mess in this cleaning,\" she said.\n\n\"We do get regular feedback that it is of a high standard for the Goldfields.\"\n\nSome rest areas have little to no infrastructure. (ABC Great Southern: Andrew Chounding)\n\nOthers have criticised the scheme as an unfair cost on road users.\n\nJillian Wilkins, a pilot vehicle driver escorting oversized loads in WA's northern mining region, agreed upgraded rest stops were necessary, but said the cost to maintain them should not fall to the public.\n\n\"Some [trucking companies] are making big bucks, but some of them are just small; they might only have three or four trucks on the road,\" she said.\n\n\"I think that we pay for our taxes and our roads and all the rest of it, surely we're entitled to a toilet.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-14/decline-tree-coverage-bush-capital-canberra/106139714",
    "title": "Three quarters of the 'bush capital' sees decline in tree coverage",
    "publish_date": "Sat, 13 Dec 2025 21:25:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Canberra prides itself on being the bush capital, but new monitoring reveals a decline in tree coverage across the territory.\n\nIt is a blow for the ACT government, which wants to see 30 per cent of the urban environment covered by a tree canopy by 2045.\n\nThe latest government data shows tree coverage has dropped from 22.7 per cent to 21.8 per cent over the past five years.\n\nOf Canberra's 121 suburbs, 91 recorded a reduction in their tree canopies.\n\nThe government is hoping recently planted trees will flourish and lead to greener data in the future. (ABC News: Lily Nothling)\n\n\"We know despite thousands of plantings that have happened in the past five years, we have in fact gone in reverse,\" Greens climate adaptation spokesperson Andrew Braddock said.\n\n\"If we don't have enough trees, suburbs will become what's called an urban heat island — they will become hotter than the surrounding areas, and that can lead to heat stress for people.\"\n\nGreens climate adaptation spokesperson Andrew Braddock wants to see a plan for how Canberra will regain tree coverage. (ABC News: Lily Nothling)\n\nNewest suburbs hit hardest\n\nDenman Prospect, in Canberra's fast-growing Molonglo Valley, experienced the most significant decline in tree coverage, down 8.7 per cent since 2020.\n\nIn some of ACT's newest suburbs, including Throsby, Macnamara and Whitlam, less than 5 per cent of the land area is covered by a tree canopy.\n\nSenior director of urban treescapes Rachael Dawes says there is no reason for great concern yet, while newly planted trees take root. (ABC News: Lily Nothling)\n\nRachel Dawes, the senior director of urban treescapes at the City and Environment Directorate, said trees were only counted in the data once they reached three metres in height.\n\n\"I just don't want anyone to be too concerned just now,\" Ms Dawes said.\n\n\" We've just planted over 78,000 trees in the past five years and the majority of those are not yet appearing in the [data] capture. \"\n\nBut even well-established leafy parts of Canberra are experiencing losses, which are being attributed to new construction and natural attrition.\n\nSome of the declining tree rate has been attributed to natural attrition. (ABC News: Lily Nothling)\n\n\"Those older suburbs with trees that have been around for 80 to over 100 years, a lot of those trees are reaching the end of their useful life and some are starting to be removed and replaced,\" Ms Dawes said.\n\n\"You also have the urban densification program that is really looking to see more housing in the inner-city areas, so we're not continuing to push out into greenfield sites.\"\n\nMs Dawes said it was \"difficult\" to forecast whether the ACT would meet its tree canopy target by 2045, but said she expected to see greener results in 2030.\n\nCalls for a plan\n\nWhile tree coverage on leased land has dropped from 21 to 19 per cent over the past five years, it has increased on public land from 23 to 24 per cent.\n\nThe ACT Greens have called for the government to outline a plan to achieve its 30 per cent tree canopy goal.\n\nThe ACT government plans to have 30 per cent of the urban environment covered by a tree canopy by 2045. (ABC News: Toby Hunt)\n\n\"It needs to demonstrate that it is investing in our urban forest through planting, maintenance and protecting the existing trees so that we're actually able to achieve the target the government has set for itself,\" Mr Braddock said.\n\nBut not all Canberrans want trees outside their homes.\n\nThe government's tree planting program faced almost 550 rejections last financial year, with residents on narrow streets or smaller blocks prioritising parking space over shade.\n\n\"We know that it's better to have a very shaded city to make it the most liveable place for us,\" Ms Dawes said,",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-14/alpha-bakery-making-pies-again-family-supports-brother-dementia/106050182",
    "title": "When Chris started to forget his famous recipes, his brother stepped in to help",
    "publish_date": "Sat, 13 Dec 2025 21:22:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "For most of his life Chris Tilse has woken long before dawn and kneaded dough.\n\nThe rhythmic whirring of a mixer and comforting smell of yeast and sugar inside his rural Queensland bakery have kept him company.\n\nBut slowly his memory started to falter.\n\nLittle things, at first — a pinch of salt where sweetness should have been, a recipe he knew by heart slipping through his fingers.\n\nThe pies at Snow's Bakery are well known in central Queensland. (ABC Western Qld: Hannah Walsh)\n\nThe recipes were passed down from his dad, so Chris's younger brother Peter noticed when they didn't taste quite right.\n\nHe said it took a little while for the family to realise, but ultimately Chris was diagnosed with dementia.\n\n\"We sort of didn't realise it was happening until just things weren't quite right,\" Peter said.\n\n\"We had a few rough years; we had our mother and sister die within a month of each other,\" Peter said.\n\n\"Chris started forgetting to come down to the bakery some days.\"\n\nChris Tilse has worked in bakeries most of his life. (ABC Western Qld: Hannah Walsh)\n\nIt is at this point in the interview that Chris interrupts Peter to tell a story about a time he saw a snake in the bakery.\n\nThe younger brother smiles and waits for him to finish.\n\n\"We didn't enjoy seeing what was happening to Christopher, his livelihood and the business,\" Peter said.\n\n\"First things first, we had to try and get his health in order before we could do anything with the business.\"\n\nSo in 2023, the doors to Chris's bakery were pulled shut and the ovens turned off.\n\nSnow's bakery\n\nThey say in its heyday, the pies and bakery treats at \"Snow's\" reeled in travellers off central Queensland's Capricorn Highway with flaky crusts, flavourful fillings and a warm aroma.\n\nPeter has been able to step in and reopen the Alpha Bakery. (ABC Western Qld: Hannah Walsh)\n\nIt has been a while between bites, two years to be exact, but now the town of Alpha's bakery is producing pies once again.\n\nOperational duties have been taken over by Peter, with the guidance of Chris.\n\nPeter said they decided to reopen the bakery to keep the family brand alive and to help Chris feel connected to the town.\n\nFresh pies out of the oven. (ABC Western Qld: Hannah Walsh)\n\n\"There's a bit of family pride to uphold for sure, and to try and help Chris feel like he belonged to something so he could anchor to something and feel like himself again,\" he said.\n\nIt is a positive outcome for the town of about 500 people, which has struggled through a loss of industry and population.\n\nRuns in the family\n\nPeter says baking now runs in the family's blood, but the craft came about from hardship.\n\n\"Our family got into baking through tragedy,\" he said.\n\nIn 1945, his aunt was married to the baker in Mareeba, far north Queensland.\n\nSnow's has been on smoko. (ABC Western Qld: Hannah Walsh)\n\n\"She got run over by a US army truck … her husband's family had the bakery, and it went pear-shaped for them, so Dad's older brothers took it over,\" Peter said.\n\n\"Dad got into the trade that way.\"\n\nEventually Chris and Peter's dad, Monty Tilse, ended up in Alpha and opened a bakery.\n\nThere are lots of memories inside Snow's bakery for brothers Chris and Peter. (ABC Western Qld: Hannah Walsh)\n\nSnow's Pies, came from his nickname, Snow, because of his white hair as a young lad.\n\nIn 1976, when Chris was 18, the bakery burnt down.\n\nWith no money to rebuild, Chris went off to work in bakeries around Queensland.\n\nIn the early 90s, he returned to Alpha and bought a building to continue his father's legacy.\n\n\"I've got lots of recipes,\" Chris said.\n\n\"We made a lot of pies here, at least 100 every day, probably more, maybe 400 some days.\"\n\nOpen for business\n\nPeter also runs an entertainment venue, which he calls an old-time music and food hall, on the main street of Alpha.\n\nHe has been selling the bakery's goods from there, but is hoping to have the bakery storefront running by Easter next year.\n\nSnow's is loved for its pies and bakery treats. (ABC Western Qld: Hannah Walsh)\n\n\"My sister is going to be moving on in a month or two and that leaves the two of us here to keep things afloat,\" Peter said.\n\nThe brothers hope Snow's Pies will take off again thanks to tourists passing through the town in the busy season.\n\n\"It's one of those things you'll meet somebody from anywhere in Australia and they'll say, 'Oh Alpha, have you been to the bakery there?'\" Peter said.\n\n\"Dad obviously was known for making very good pies and those things were passed down to Chris and I kept one eye open while they were doing it.\n\n\"If someone tells you the bakery is shut, well, you can tell them otherwise.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/national/victoria/west-gate-tunnel-opens-after-decade-of-delays-toxic-soil-battles-20251214-p5nni4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "West Gate Tunnel opens after decade of delays, toxic soil battles",
    "publish_date": "Sun, 14 Dec 2025 13:10:26 +1100",
    "category": "finance",
    "authors": [
      "Ashleigh Mcmillan",
      "Patrick Hatch"
    ],
    "text": "The West Gate Tunnel – a major new toll road connecting Melbourne’s west to the city — opened to a trickle of traffic on Sunday morning, following a decade of turbulent planning, a doubling of its cost and years of delays caused by disputes over toxic soil.\n\nAfter a restricted opening just after midnight, the $10.2 billion project, which is made up of 6.8 kilometres of tunnels connecting Melbourne’s west with the CBD, officially opened at 7am.\n\nThe new tunnel was almost empty on Sunday morning at 8.30am, with a handful of cars and trucks using the new roadway between Dynon Road in West Melbourne and Millers Road in Altona North.\n\nAt its peak, the alternative to the West Gate Bridge is projected to cater for 67,000 vehicles a day, and remove 28,000 trucks from the bridge and suburban streets in Melbourne’s inner west. A month of free travel on weekends through the tunnel will begin in January.",
    "source": "SMH",
    "cluster_id": 1
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/not-feeling-the-christmas-vibe-this-show-will-fix-all-that-20251209-p5nm3j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Flashbacks haunt like ghosts of Christmas past amid family fallout",
    "publish_date": "Sun, 14 Dec 2025 13:06:07 +1100",
    "category": "entertainment",
    "authors": [
      "Millie Muroi",
      "Bernard Zuel"
    ],
    "text": "MUSIC\n\nSydney Philharmonia Choirs – Bach’s Christmas Oratorio\n\nOpera House, December 13\n\n★★★★\n\nReviewed by PETER MCCALLUM Bach’s Christmas Oratorio is replete with musical glories but presents a quandary for modern performance. Bach wrote the work as six cantatas for performance on separate Christmas Feast days, a mode of presentation which is only meaningful in a liturgical context. Yet the modern habit of presenting all six cantatas one after another creates a longish concert and sometimes dampens the concentrated focus that each deserves. The Philharmonia’s solution of splitting the oratorio over two separate Christmas seasons (2023 and 2025) and separating the cantatas with new Australian works was effective. After Deborah Cheetham Fraillon and Matthew Doyle’s Acknowledgement of Country, Tarimi Nulay – Long Time Living Here, conductor Elizabeth Scott led the opening chorus of Part IV, Fallt mit Danken, fallt mit Loben in a tempo of lilting complacency (using that word as Jane Austen did, rather than as a derogatory term). Tenor John Longmuir, who took the narrative role of the Evangelist, brought a sense of drama and robust strength to the part, opening out splendidly in Part VI, without making the role operatic. Baritone Christopher Richardson sang the recitatives with Chorale Immanuel, o susses Wort! and Wohlan dein Name with rounded pure vowels giving his tone an aura of poised dignity.\n\nIn the echo aria, Flosst, mein Heiland, soprano Jacqueline Porter projected a richly coloured, discreetly thrilling sound, blending with oboist Alexandre Oguey and organist David Drury to create refined chamber music, while the two ‘echo’ musicians, soprano Briar Babington and oboist Eve Osborn contributed distant imitations from behind the choir. Soprano Jacqueline Porter. Concertmaster Fiona Ziegler and sister Leone Ziegler played the concerto-like violin solos in Longmuir’s aria Ich will nur dir zu Ehren leben with persuasive rhythmic fluency. A characteristic of Part IV is the addition of French horns in the outer movements, which bathed the clear sound of the Philharmonia Chamber Singers in burnished warmth for the final chorale. Following this, Australian composer Phillip Cullen used Kipling’s poetry and quotations from Bach’s Part V for his new choral work A Nativity. With smoothly finished phrases and well-wrought traditional harmony, it began with a mournful plaint on cor anglais and ended with the choral lines haloed in high harmonics from solo violin. Scott’s leadership in the opening chorus of Part V was livelier than Part IV and drew neat articulation from chorus and orchestra and fluid rhythmic sprightliness from the pair of oboes that create Part V’s characteristic sound. Contralto Hannah Fraser sang the recitative with chorus, Wo ist der neugeborene Konig der Juden with wonderfully rounded pure sound.\n\nA highlight of the entire concert was the intimate musical interaction of the aria Terzetto Ach, wenn wird die Zeit erscheinen. Here Longmuir and Porter created brightly edged excitement alongside Fiona Ziegler’s animated violin figuration, while Fraser soothed the music with a warm admonitory phrase “be silent, he is already here”. A Prayer of Jesus by Australian composer Kayla Erin Hinton began the second half, articulating declamatory phrases accompanied by orchestration of confident radiance. Part VI, with its outer choruses laced with trumpet solos from Anthony Heinrichs, brought the concert’s choral highlights, the Philharmonia Chamber Singers articulating with energised rhythmic fluidity. The work ends with the so-called ‘Passion chorale’ set with elaboration instrumentation and exultant trumpet figuration. The Philharmonia followed this with a reprise of the opening chorus of Part 1, which, though a masterpiece, was unnecessary here. The actual close, a true Bachian ending, expresses collective joy through masterly musical detail and symbolism, and says all that needs to be said. THEATRE\n\nIRVING BERLIN’S HOLIDAY INN\n\nRiverside Theatres Parramatta, December 6\n\nUntil December 14\n\nReviewed by KATE PRENDERGAST\n\n★★★★\n\nIn the 1940s, the legendary Irving Berlin (who was, ironically, Jewish) dreamt of a little number called White Christmas. At Riverside Theatres, audiences dreamt of a Christmas that doesn’t sweat their entrails out, while being razzle-dazzled to distraction by the stage adaptation of Holiday Inn, a two-hour affair featuring a live band, a dizzying array of sparkle-heavy costumes, old-world charm and some vigorously inventive original choreography by Veronica Beattie George.\n\nIf you haven’t seen a tap-dancing ensemble perform synchronised jump-rope with green tinsel, are you even in the silly season? The show features a dizzying array of sparkle-heavy costumes. Credit: Robert Catto Holiday Inn is the film that launched the world’s best-selling single, which also starred musical history’s most dapper dynamic duo: Fred Astaire and Bing Crosby. Filling those enormous singin’ and dancin’ shoes just fine in this Well Done Creative production are Rob Mallet as Jim Hardy and Max Patterson as Ted Hanover – showbiz characters whose long friendship is put to the test when Jim’s domestic impulses and anxious sentimentality clash with Ted’s big-time ambitions. To put it another way: narrative conflict, thy name is woman. First it’s Lila (Pamela Renouf is a sensation and a hoot as the squawking, mega-talented, self-obsessed starlet). Then it’s Linda Mason, (Mary McCorry, of classically beautiful looks and ravishing vocals), an independent-minded schoolteacher who sold Jim the Mason farm in Connecticut, where he hopes to start a new chapter away from the insanity of “the lifestyle”. Getting festive: Matt Hourigan and Max Patterson. Credit: Robert Catto\n\nLife in the country bumpkin seat, however, turns out to be laborious, lonesome and financially challenging. With some sneaky manoeuvring from plucky farmhand Louise (Paige Fallu), he and his New York friends cook up a creative money-making ruse: to transform the property into a “Holiday Inn”, hosting extravagant ticketed shows (also charging guests for board) only on holidays. Cue Shaking the Blues Away! Loading There are some interesting (and essential) variations from the film. No blackface is one. There are also significant differences in narrative structure and character motivations (with Ted spared the moral grubbiness of “stealing the girl” romantically). Some songs are shuffled about to take on new meaning (a memorable moment comes when the otherwise silent drummer pipes up with his Cinderella plea to Ted: “I’m easy to dance with!”), with the best comic moments still when Jim lets jealousy undermine his own show. As with so many crowd-pleasing productions, this one would benefit from being more snappy, with less stuffing. Some added Berlin hits feel interstitial, and the invigorating theatrical bombast under director Sally Dashwood loses a little pizzazz in the second half. That’s not to say there isn’t a lot to be enjoyed, particularly given the robust technical skills of the actors, which are geared for delight and well-balanced with their acting chops. There’s a worthy takeaway, too, about freedom and autonomy. A line from French poet Guillaume Apollinaire that bookends the show reminds us what holidays are all about: “Now and then, it’s good to pause in our pursuit of happiness and just be happy.”\n\nMUSIC\n\nKendrick Lamar\n\nAllianz Stadium, December 10\n\nReviewed by BERNARD ZUEL\n\n★★★★ Kendrick Lamar doesn’t exactly want to be a pop star, but he doesn’t not want to be one either. Take the flames left and right and two huge screens, the sparkly-framed glasses and a posse of dancers, the giant furry dice with scented tree ornament and the scaled-up stairs on an otherwise bare stage, the crack of fireworks like cannons and a whispered start with Lamar muttering in the shadows backstage, and the powerful, crisp, clear and just-short-of-overwhelming sound. All point to production values of a mega-pop show. All simple but effective manipulations of an environment effectively inhabited by only one non-dancing, rarely-speaking, charismatic but undemonstrative man.\n\nBut then what is King Kunta but a knee-cracking pop song? Even, or maybe especially in, this condensed version, followed with the skittish, swirling cinematic noir of Element. How many hooks are as elemental as Squabble Up’s bare-bones lean/shuffle, brought to life by those dancers and given voice by the whole stadium, or the brass-bolstered TV Off, split into two parts, an hour apart? How many stiff-legged grooves are as welcome to people who can’t necessarily dance but can strut in their seats as that offered in Humble? Kendrick Lamar doesn’t want to be some generational spokesman, but he doesn’t not want to be one either. Sure, the lubricious Poetic Justice was primarily focused on matters horizontal but the same territory in the old-school soul groove of Dodger Blue was laced with unceremonial frankness, and Good Credit crept into darker corners. M.A.A.D City peeled back urban sheets and showed how everything runs on tension, and within the folding-in-on-itself progressive bass and counterweight keyboards of Reincarnated was a dense story that was always racing away with his delivery but still landed punch after punch about being that very modern creature, the uncertain adult in a childlike world. Speaking of which, one thing Lamar very much does want to be is Drake Disser-in-Chief. Still. See both the shot early in the show, Euphoria, and the stronger chaser to close the set, Not Like Us. Kendrick, that man is down, boxed up and posted already.\n\nWhile his voice is the lowest profile of the on-stage sounds, that’s ultimately irrelevant. If you don’t already know each word of these songs you aren’t serious and you aren’t meant to be here. Kendrick Lamar doesn’t want to be exclusive, but he doesn’t not want to either. Got a problem with that? To borrow from the man, “Put the Bible down and go eye for an eye for it.” Kendrick Lamar plays Allianz Stadium tonight (December 11) and the Spilt Milk Festival in Canberra on December 13 and Gold Coast on December 14. MUSIC\n\nSOMBR\n\nHordern Pavilion, December 9\n\nReviewed by MILLIE MUROI\n\n★★★★ For a young artist whose fame started with a viral song on TikTok just three years ago, Sombr is surprisingly smooth and unfazed on stage.\n\nOn his first Australian tour, the 20-year-old American singer could easily have you believe he is a seasoned pro (apart from a few too many disingenuous “I-love-yous” when he should be getting on with the show). The setlist begins on the front foot, running through songs from Saviour, showcasing his richer, deeper tones, to We Never Dated, which drifts into an ethereal falsetto. Sombr performs during the 2025 MTV Video Music Awards. Credit: Getty Images for MTV His range is impressive and, while he may not have an especially powerful voice, he has enough to make an impact as required. Technically, he is consistent and controlled while imbuing all of his songs with that characteristic teenage angst. The show is prety much bare bones - one man and a band with basic production. But it’s done well.\n\nAnd while it does drift at points in the second half, the setlist is not long enough to make it tedious. It’s also a comfortable sort of dip: one that still has you swaying to the music and enjoying the atmosphere. Sombre’s has some similarities to the work of The 1975’s frontman Matty Healy. Their songs share stylistic and thematic similarities and during numbers such I Wish I Knew How to Quit You and Do I Ever Cross Your Mind, the tortured poet bearing seem familiar. Sombr is, however, a bit softer and more palatable than Healy. Caroline - the song Sombr wrote when he was 16 and which catapulted him to fame - and Perfume, are tender, heartfelt and delivered with precision but also a mesmerising sweetness. And while most of his lyrics are despondent, devastating or dark, there are bouncy beats, catchy bass segments and playful riffs that keep the energy high. He also finishes strong with funky songs such as 12 to 12 and his biggest hit: Back to Friends. It may not be a concert for the ages, but it’s a seamless show with solid fundamentals.\n\nTHEATRE\n\nBEAUTIFUL THING\n\nQtopia Sydney, December 5\n\nUntil December 13\n\nReviewed by KATE PRENDERGAST\n\n★★★½ It’s a seasonally fitting, welcome thing to hear happy squeals and warm laughter in response to a queer drama told on stage. Often (unless it’s part cabaret), the audience’s reaction is grim, choked silence – trauma the legitimate yet scarifying seam from which a lot of LGBT+ stories are mined. Allowing a gay “coming-of-age” love story to have a relatively untroubled trajectory and happy ending was what made Liverpudlian dramatist Jonathan Harvey want to write Beautiful Thing. Opening in London in 1993, it went on to win a John Whiting Award, was adapted into a popular film, and had its Australian premiere at the 1998 Sydney Gay and Lesbian Mardi Gras. This CODA production brings it back with a uniformly excellent cast, with Finn Stannard making an impressive directorial debut to close Qtopia’s 2025 program.\n\nJamie (Jake Walker) and Ste (Max Dykstra). Credit: Yingying Zhang Harvey would go on to write for Coronation Street for two decades and counting, and there’s a lot of this and other British soaps’ recognisable tones and touchpoints here: a character-driven plot and working-class realism; young and old battling a hard-luck system with whatever’s at hand (in this story, the music of Mama Cass); a matter-of-factness about the realities they’re up against; violence acknowledged if not given too-graphic treatment; neighbours getting all up in each other’s business; and animated dialogue that plumbs its humour from cheek, colourful patois and bluntness. Willa King as tough-love mum and worn-down barwoman Sandra steals the show on that last one (though her relentless shaming of heroically impudent expelled schoolgirl Leah as “slag” might be a bit dated). Set in a South London council estate, an environment summed up by three sky-blue doors on a grey tenement wall, the “beautiful thing” in question is the tender relationship that forms between Hello! magazine-reading Jamie (Jake Walker) and much more athletic Ste (Max Dykstra), which begins when Ste takes refuge from an abusive father in his neighbour’s bedroom. It’s also how frowsy queen Sandra, her new boyfriend Tony (Michael Hogg) and “lost cause” Leah (Poppy Cozens) react. It’s not a big spoiler to say: pretty well! When Tony, a stand-in father figure, wraps trembling Jamie in a bear hug and says with a smiling reassurance “it’s OK” after the boy comes out to his mum, a widespread corneal leakage event was seen in the audience.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/victoria/andrew-won-t-be-able-to-use-these-new-tram-stops-it-s-illegal-20251208-p5nlrg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Andrew won’t be able to use these new tram stops. It’s illegal",
    "publish_date": "Sun, 14 Dec 2025 13:00:00 +1100",
    "category": "finance",
    "authors": [
      "Lachlan Abbott"
    ],
    "text": "Disability advocates have criticised state government plans to build new tram stops in North Melbourne that don’t allow wheelchair users to access trams, despite a legal requirement to do so.\n\nThe Department of Transport last week revealed proposed changes to stops on Victoria, Errol and Queensberry streets that are required for larger G-class trams to operate on route 57 to West Maribyrnong.\n\nAndrew Bretherton, an advocate for better public transport access for people with a disability, is disappointed with the government’s plans. Credit: Jason South\n\nThe plans do not include raised platforms that allow wheelchairs or prams to roll onto the new low-floor trams, which were designed to promote accessibility.\n\nA department spokesperson said level-access stops were still planned in the future after the North Melbourne stops were redesigned, but could not say when.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/business/companies/seven-group-s-gas-well-is-leaking-methane-into-ocean-off-victoria-20251212-p5nn9k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Seven Group’s gas well is leaking methane into ocean off Victoria",
    "publish_date": "Sun, 14 Dec 2025 13:00:00 +1100",
    "category": "finance",
    "authors": [
      "Nick Toscano"
    ],
    "text": "An offshore gas well owned by billionaire businessman Kerry Stokes’ Seven Group Holdings conglomerate has been leaking methane into the ocean off the Victorian coastline for more than two years.\n\nThe Longtom gas field lies 30 kilometres south-west of the Gippsland town of Marlo. It’s been mothballed since 2015 but is seeping gas from a minor leak detected at one of its shut-in wells and reported to the regulator in 2023.\n\nThe Bass Strait’s Longtom gas field, mothballed by Seven Group in 2015, has been leaking methane. Credit: Jessica Shapiro\n\nSeven Group, the gas field’s owner, pledged at the time it would fix the leak. However, the National Offshore Petroleum Safety and Environmental Management Authority (NOPSEMA) last week issued a notice saying the company has failed to comply with key commitments it gave in 2023 that required it remediate the leaking well and conduct monitoring of the field.\n\nFugitive leaks from oil and gas infrastructure, such as wells and pipelines, are major sources of methane emissions that are driving dangerous climate change. Methane is a potent greenhouse gas that warms the planet up to 80 times more than carbon dioxide over two decades, and is responsible for roughly a third of all planetary warming.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/a-little-bit-embarrassed-ugly-dismissal-shows-green-not-yet-finished-article-20251214-p5nngy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘A little bit embarrassed’: Ugly dismissal shows Green not yet finished article",
    "publish_date": "Sun, 14 Dec 2025 12:53:28 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "Cameron Green admits he was embarrassed by an ugly dismissal under lights during the Gabba Test match, as he braces for the extra bowling loads that will come his way in the final three games of the Ashes series.\n\nBacking away to hit what he expected to be yet another bouncer from Brydon Carse, Green could barely reach the full ball that the England fast man flung down for a change-up, and walked off chastened by the sight of stumps splayed and bails flying.\n\nCameron Green is bowled by Brydon Carse. Credit: AP\n\nFive years into his international career, Green is yet to make a hundred on home soil, and his Test record in Australia (680 runs at 30.90 from 17 matches with a top score of 84) reflects a talent that has not yet come to full flower here.\n\n“It looks quite bad when you get out, you walk off a little bit embarrassed, but they’re all really great learnings for future games,” Green said of losing his stumps. “It’s a really good plan on his end. The way we were going that was the best way I saw it, it’s not always going to pay off.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/wwe-champ-bloodied-by-young-gun-20251214-p5nnjf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WWE champ bloodied by young gun",
    "publish_date": "Sun, 14 Dec 2025 12:42:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "WWE champ bloodied by young gun\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/fans-riot-after-disaster-messi-appearance-20251214-p5nnjd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fans riot after disaster Messi appearance",
    "publish_date": "Sun, 14 Dec 2025 12:32:01 +1100",
    "category": "sports",
    "authors": [],
    "text": "Fans riot after disaster Messi appearance\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/technology/desperate-vibes-as-under-16s-crowd-into-yope-and-lemon8-20251210-p5nmiq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Desperate vibes as under-16s crowd into Yope and Lemon8",
    "publish_date": "Sun, 14 Dec 2025 12:05:02 +1100",
    "category": "finance",
    "authors": [
      "Tim Biggs"
    ],
    "text": "Previously little-known social media platforms are stuck at the top of app store charts as young Australians seek shelter from the social media ban in places they previously tended to ignore.\n\nSo, what are the vibes like inside these refuges?\n\nLemon8 is the most prominent of the alternative apps. It feels a lot like a TikTok take on Instagram, as it should, given it’s powered by TikTok parent company Bytedance. You have grids of images and videos posted by people you follow, as well as an endless scroll of algorithmic “for you” content. It has even more of a Wild West feel than Instagram, fairly innocuous skincare and food posts mixed with extreme sports, highly sexualised engagement bait, lewd jokes and plenty of fake news.\n\nLemon8 claims to have more lifestyle, fashion and wellness content than TikTok, but it’s very similar.\n\nI could feel the algorithm trying to grasp on to the kind of content I wanted over the course of the day I used it, and although I was mainly trying to find new Australian users escaping the social ban, I was also getting increasingly aggressive generic rants and gun, motorbike and military content.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/queensland/girl-dies-after-falling-off-cliff-while-trying-to-take-a-photo-20251214-p5nnj0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Girl dies after falling off cliff while trying to take a photo",
    "publish_date": "Sun, 14 Dec 2025 12:02:58 +1100",
    "category": "sports",
    "authors": [
      "William Davis"
    ],
    "text": "A teenage girl with her family has died after slipping off a cliff on the Sunshine Coast.\n\nThe 17-year-old fell about 30 metres from the rock face at Moffat Beach in Caloundra about 6.40pm on Saturday.\n\nNine News Queensland reported she had jumped the fence to take a photo when she slipped.\n\nBystanders rushed to the clifftop, and a second woman was injured while trying to help.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/racecar-tyre-hits-volunteer-during-victorian-event-20251214-p5nnh6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Racecar tyre hits volunteer during victorian event",
    "publish_date": "Sun, 14 Dec 2025 11:48:03 +1100",
    "category": "sports",
    "authors": [],
    "text": "Racecar tyre hits volunteer during victorian event\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 2
  },
  {
    "url": "https://www.smh.com.au/culture/art-and-design/major-push-for-the-key-change-that-led-to-record-audiences-in-london-s-west-end-20251211-p5nmyn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Major push for the key change that led to record audiences in London’s West End",
    "publish_date": "Sun, 14 Dec 2025 11:45:00 +1100",
    "category": "entertainment",
    "authors": [
      "Linda Morris"
    ],
    "text": "West End-style tax incentives to supercharge Australian theatre and live music will be a NSW “priority” as state governments across the country build a case for major federal arts tax reform.\n\nNSW claims it now has the support of the other five states and the two territories – after enlisting the Queensland Coalition government – to pursue a shake-up of the nation’s tax system and help Australia’s struggling culture sector.\n\nNSW Treasury is fleshing out and modelling a shortlist of five priority reforms to take to a February meeting of state cultural ministers and pursue these with the Albanese government.\n\nThese incentives include the abolition of taxes on arts and music prizes and the extension of current screen and digital gaming tax incentives to theatre and live music.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/bushfire-emergency-declared-in-wa-20251214-p5nnio.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bushfire emergency declared in WA",
    "publish_date": "Sun, 14 Dec 2025 10:58:44 +1100",
    "category": "finance",
    "authors": [],
    "text": "Bushfire emergency declared in WA\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/palmer-returns-to-form-against-everton-20251214-p5nnip.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Palmer returns to form against Everton",
    "publish_date": "Sun, 14 Dec 2025 10:58:44 +1100",
    "category": "sports",
    "authors": [],
    "text": "Palmer returns to form against Everton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/after-345-shows-this-modern-day-musical-genius-brings-his-epic-tour-to-an-end-20251214-p5nnig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After 345 shows, this modern-day musical genius brings his epic tour to an end",
    "publish_date": "Sun, 14 Dec 2025 10:56:12 +1100",
    "category": "entertainment",
    "authors": [
      "Martin Boulton"
    ],
    "text": "MUSIC\n\nJacob Collier | Djesse World Tour ★★★★\n\nMargaret Court Arena, December 13\n\nFour brightly coloured trees glowed on stage and amped up a festive mood in the air, as Jacob Collier bounded into view wearing loose-fitting multicoloured pants and a radiant orange jacket.\n\nMulti-instrumentalist Jacob Collier performs on stage at Margaret Court Arena in Melbourne during his Djesse World Tour on December 13, 2025. Credit: Richard Clifford\n\nThe lanky 31-year-old Londoner barely stopped bouncing about in his bright yellow Crocs for the next two hours, as his five-piece group shifted from silky jazz grooves to funky beats, classical flourishes and Collier’s self-styled gospel harmonies.\n\nIn the 345th and final performance of his epic Djesse World Tour, Collier frequently thanked the audience and showered affection on Melbourne, where he originally played in 2018 – the same year he released the first of four albums in the Djesse series.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/cyborg-locks-up-submission-victory-to-defend-crown-20251214-p5nnhq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cyborg locks up submission victory to defend crown",
    "publish_date": "Sun, 14 Dec 2025 10:42:32 +1100",
    "category": "sports",
    "authors": [],
    "text": "Cyborg locks up submission victory to defend crown\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/attorney-general-expenses/rxako6s0y",
    "title": "Attorney-General Michelle Rowland to repay 2023 family trip as expenses scandal grows",
    "publish_date": "Sun, 14 Dec 2025 00:10:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "Attorney-General Michelle Rowland will repay a portion of expenses claimed for a 2023 trip, while Treasurer Jim Chalmers says Rowland has \"done the right thing\" in self-reporting spending.\n\n\n\n\n\nRowland is the first MP to pay back expenses following growing scrutiny on politicians' spending, after she referred her travel to the Independent Parliamentary Expenses Authority (IPEA) for advice.\n\n\n\n\n\nA spokesperson for the attorney-general said in a statement Rowland referred a trip from 2023 to Perth during which she had \"at least 10 official engagements\".\n\n\n\n\n\nIt's understood the expense was related to a family trip in July 2023 which cost taxpayers more than $21,600.\n\n\n\n\n\n\"The IPEA finalised its advice on Friday 12 December and conveyed a portion of the family reunion travel expenses were outside the guidelines,\" the statement read.\n\n\n\n\n\n\"The Attorney-General has formally accepted that advice on Friday and commenced steps to make repayment.\"\n\n\n\nAustralian Prime Minister Anthony Albanese and Australian Communications Minister Anika Wells made a joint public appearance on Thursday during a school visit in Canberra. Source: AAP / Lukas Coch On Sky News on Sunday morning, Chalmers rejected calls for his colleague to step down.\n\n\n\n\n\n\"Michelle has done the right thing in asking the IPEA to take another look, as has Anika ... to make sure everything that's happened here is within the rules,\" he said.\n\n\n\n\n\nLast week, Communication and Sport Minister Anika Wells defended claiming expenses to attend major sporting events for herself and her husband under family reunion guidelines.\n\n\n\n\n\nThese include attending the Paralympics Australia Adaptive Festival where she claimed $3,000 for her husband and children to join her in Thredbo under the entitlements. The Guardian reported further family travel expenses to Melbourne for the AFL grand final in 2022, 2023, 2024 totalled $8,500.\n\n\n\n\n\nPrime Minister Anthony Albanese has asked for advice from the parliamentary expenses watchdog about travel spending, telling reporters on Friday that they'll take on the advice they receive.\n\n\n\n\"It's important that as parliamentarians we're not sort of deciding things for ourselves, because that would bring obvious criticism,\" he said.\n\n\n\n\n\nOpposition leader Sussan Ley has offered bipartisan support to reform the rules for politicians. Ley herself resigned in 2017 while serving as health minister after using taxpayer funds to fly to the Gold Coast to purchase property.\n\n\n\n\n\n— With additional reporting from the Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 13
  },
  {
    "url": "https://www.sbs.com.au/news/article/fine-supermarkets-for-excessive-pricing-of-groceries/yhmz3r7il",
    "title": "Supermarket giants face $10 million fines over price gouging",
    "publish_date": "Sat, 13 Dec 2025 22:47:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Consumers will be given added protection from price-gouging at the checkout, but Australia's major supermarkets have a six-month reprieve before the laws kick in.\n\n\n\n\n\nThe federal government has introduced rules to limit \"excessive pricing of groceries\" with changes to Australia's Food and Grocery Code of Conduct, which was made mandatory in April .\n\n\n\n\n\nThe move against price-gouging — foreshadowed before a snap consultation period earlier in the year — takes effect on 1 July.\n\n\n\n\n\nThe ban will prohibit very large retailers from charging prices that are excessive when compared to the cost of the supply, plus a reasonable margin.\n\n\n\n\n\n\"This is all about getting a fairer go for families and pensioners at the checkout,\" Treasurer Jim Chalmers told Sky News on Sunday morning.\n\n\n\n\n\n\"We're delivering what we promised when it comes to cracking down on price gouging.\"\n\n\n\n\n\nIn March, the Australian Competition and Consumer Commission found the near-duopoly enjoyed by Coles and Woolworths gave them little incentive to compete vigorously, noting they were among the most profitable supermarkets in the world .\n\n\n\nBut the report never directly accused the supermarkets of gouging customers, something both Coles and Woolworths have denied.\n\n\n\n\n\nIt did not make a finding on, or seek to define whether supermarket prices were \"excessive\", since high margins are not prohibited under consumer laws.\n\n\n\n\n\nFrom July, supermarkets could face fines of $10 million per breach, three times the value of the benefit derived or 10 per cent of the company's turnover during the preceding 12 months.\n\n\n\n\n\nThe commission will be responsible for policing the new regime.\n\n\n\nChalmers said the changes gave the competition watchdog the powers it needed to hold supermarkets to account.\n\n\n\n\n\n\"One of the best ways to ease the cost of living for Australians is to help people get fairer prices at the checkout and that's what this is all about,\" he said in a joint statement.\n\n\n\n\n\nThe consumer watchdog's report found grocery prices rose at more than double the rate of wages between late 2022 and early 2023, attributing at least some of those rises to additional profits for Coles, Woolworths and Aldi.\n\n\n\n\n\nA Woolworths Group spokesperson said in a statement to SBS News that they acknowledge the tabling of the regulation, however the law is \"unprecedented by targeting only two Australian-owned companies, creating an uneven playing field\".\n\n\n\n\n\nA Coles spokesperson also said that \"carving out large multinationals and other major players from this legislation does not reflect how Australians shop and risks weakening competition\".\n\n\n\n\n\nWhile the watchdog acknowledged the costs of doing business had risen, the supermarkets had increased their profit margins despite the disruption to supply chains caused by the COVID-19 pandemic, the report said.\n\n\n\n\n\nAldi's growth had acted as a handbrake on the duopoly, but the commission noted the German discount chain did not compete directly with them on all product lines.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 8
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/new-electric-air-taxi-prototype-released/ddntu8fkz",
    "title": "New electric air taxi prototype released",
    "publish_date": "Sat, 13 Dec 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWith its tinted wrap-around windscreen and multiple sky-bound rotors, it looks like a cross between a futuristic helicopter and an oversize drone.\n\n\n\n\n\nIn fact, it's an electric air taxi - called the Valo - freshly unveiled by British company Vertical Aerospace in London.\n\n\n\n\n\n\"So our mission at Vertical Aerospace is to deliver electric vertical take-off and landing to the masses. To provide point to point transportation.\"\n\n\n\n\n\nThat's Vertical Aerospace's chief engineer David King, laying out the company's ambitious vision behind its impressive prototype.\n\n\n\n\n\nThe Valo is just one version of what's called an Electric Vertical Take-Off and Landing aircraft - or evTOL.\n\n\n\n\n\nAs the name suggests, and a promotional video shows, it has the ability to take off vertically like a helicopter, but without the noise and pollution.\n\n\n\n\n\nThose in the industry, like Mr King, believe it could be the taxi of the future.\n\n\n\n\n\n\"One thing is now slower than it was ten years ago, 30 years ago, 50 years ago, and that's mobility. Mobility in and around populated areas just hasn't kept up. And the solution to that is to unlock the third dimension, it's air mobility, and to be able to provide that to the masses.\"\n\n\n\n\n\nThe Valo boasts luxury seating for up to six passengers and speeds of 240 kilometres an hour over distances up to 160 kilometres.\n\n\n\n\n\nVertical Aerospace test pilot Simon Davies says, it's a breeze to drive.\n\n\n\n\n\n\"Really it is super simple. You push forward on this lever. It makes you go forward. You pull back on the control stick. It makes you go up. And you just point using the tools you've got and looking out the window. And the aircraft works out how to make it all happen for you.\"\n\n\n\n\n\nIn Australia, the Civil Aviation Safety Authority CASA says it expects to see passenger transport services, or air taxis, up and running in urban areas between 2027 and 2029.\n\n\n\n\n\nClem Newton-Brown is the CEO of Skyportz, a Melbourne-based company that's developed a patented landing surface for electric air taxis that helps address practical concerns like noise and safety.\n\n\n\n\n\nHe says the era of air taxi travel is on its way, but the complex infrastructure and regulation required is still catching up.\n\n\n\n\n\n\"It's an evolution of the helicopter, which only becomes the revolution that they're talking about when there's a multitude of new landing sites, places such as shopping centers and offices and tourism destinations, things like that. And the problem with that is that landing aircraft in tighter urban locations produces a whole lot of issues around safety and amenity.\"\n\n\n\n\n\nThere is also scepticism from some about the commercial viability of the air taxi industry.\n\n\n\n\n\nRichard Aboulafia, from AeroDynamic Advisory, says it's a competitive market with limited funding.\n\n\n\n\n\n\"You know I want to live in a world where I can fly helicopters everywhere. I think most of society would check that box and say: 'Absolutely, get me above that traffic, get me there fast.' Unfortunately, the economics of flying vertically have been about the same for a really long time. And while Vertical has produced an interesting machine, a lot of impressive work going into it, the economics are about the same, maybe a little worse - we don't know - than flying in a helicopter. So it's the same challenges from a business perspective.\"\n\n\n\n\n\nVertical Aerospace, who has already received some 1,500 orders for its new Valo aircraft, is not deterred by the challenges.\n\n\n\n\n\nSkyportz CEO Clem Newton-Brown says China and the Middle East are moving rapidly on regulating air spaces for the growing industry.\n\n\n\n\n\nHe says while many aircraft will fail to get to market, developers at the forefront will soon make an impact.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/st-kilda-penguins-ticketing-system-forces-visitors-into-months-long-wait/9mkt4h4zk",
    "title": "St Kilda penguins 'weird' ticketing system forces visitors into months-long wait",
    "publish_date": "Sat, 13 Dec 2025 04:01:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "Melbourne's iconic St Kilda penguin colony has reopened for public viewing after four years — and the rush to see it has been so intense that free viewing tickets are now unavailable until 2026.\n\n\n\n\n\nPerched on the breakwater at the end of St Kilda Pier, the colony has returned to public access following a $53 million renovation project.\n\n\n\n\n\nViewings resumed on 29 October under a new online booking system, offering two one-hour sessions each night, capped at 150 visitors.\n\n\n\n\n\nBut within a single day of going live, more than five months' worth of sessions were fully booked. Tickets are now unavailable until the end of March 2026, with April bookings yet to be released.\n\n\n\nMelbourne resident Lisa Andrews said she had only just managed to secure her spots.\n\n\n\n\n\n\"I saw it come up on Facebook, and I logged straight in, and I booked three tickets straight away, and then I was telling friends, and I went back on, and there was nothing available,\" she told SBS News.\n\n\n\nFrustration over advance ticketing\n\nSBS News spoke to local residents and tourists at St Kilda Pier to gather their views on the new ticketing system.\n\n\n\n\n\nSt Kilda local Rhianna, who was visiting the pier with her family from the United Kingdom, said she was unable to secure tickets through what she described as a \"convoluted\" system.\n\n\n\n\n\n\"It was a bit confusing and it wasn't exactly clear when you could see what was available next,\" she said.\n\n\n\n\n\nItalian tourist Gabriele Tuccillo, in Melbourne on a working holiday visa, also had no tickets and said the booking system is \"weird\" for allowing reservations so far in advance.\n\n\n\n\n\n\"What if I actually did book it in March? And then at some point, you know, I'm not going to be in Melbourne,\" he said.\n\n\n\nSt Kilda's penguin viewing ticketing system has drawn criticism as visitors struggle to secure spots. Source: SBS News Cambodian international student Bon shared similar concerns.\n\n\n\n\n\n\"I don't think six months in advance is a good time frame. Maybe a week or a month is probably better,\" he said.\n\n\n\n\n\nThe St Kilda penguins have faced many issues over the year, including flash photography, selfie sticks, overcrowding and even physical attacks.\n\n\n\nWhy St Kilda's penguin viewing now requires tickets\n\nThe St Kilda penguins have long faced issues such as flash photography, selfie sticks, overcrowding and even physical attacks.\n\n\n\n\n\nLocal volunteer group Earthcare St Kilda has protected and researched the penguin colony since 1982, providing volunteer guides for daily viewings.\n\n\n\n\n\nThe group's vice president, Flossy Sperring, said they once dealt with crowds of up to 2,000 people, prompting them to request a dedicated viewing platform from Parks Victoria, a state government agency responsible for managing public land.\n\n\n\n\n\n\"People were sticking their selfie sticks into penguin nests, and back then people were allowed all over these rocks as well,\" she said.\n\n\n\n\n\n\"There were just people literally everywhere as penguins were coming up; there would just be people sitting on the rocks in front of their nests.\"\n\n\n\nThe penguins at St Kilda pier have long been a popular tourist attraction. Source: Supplied / Phillip Island Nature Parks The viewing platform was eventually built as part of the Victorian government's St Kilda Pier redevelopment. Because the platform has limited capacity, a ticketing system was introduced when the penguin colony reopened in October.\n\n\n\n\n\nSperring said Earthcare had initially hoped to help manage the penguin experience alongside Parks Victoria after the renovations.\n\n\n\n\n\n\"We had hoped that we would be able to manage the penguin viewing experience, because we have an understanding of what locals want,\" she said.\n\n\n\nPhillip Island Nature Parks responds to ticketing backlash\n\nHowever, the two-year ticketing contract was instead awarded to Phillip Island Nature Parks, the conservation organisation behind the Phillip Island Penguin Parade, where tickets cost $33 each.\n\n\n\n\n\nDuring the four years St Kilda's colony was closed for renovations, Phillip Island became the nearest place for visitors to see little penguins in the wild.\n\n\n\nPhillip Island Nature Parks has responded to criticism of the ticketing system.\n\n\n\n\n\nMark Anderson, general manager of tourism at Nature Parks, told SBS News, \"We had an overwhelming response for tickets in the first release\", which \"unfortunately meant that some people have missed out\".\n\n\n\n\n\n\"We plan to start releasing tickets more regularly in the new year, with a shorter booking window, and we are currently looking at ways to give priority access to local residents,\" he said.\n\n\n\n\n\nUntil these changes take effect, Nature Parks said visitors can either wait for the next ticket release or attempt to secure earlier tickets that may become available through cancellations.\n\n\n\n\n\nBut Sperring noted there is little incentive for people to cancel free tickets.\n\n\n\n\n\n\"Because it's free, what's happening is a lot of people aren't actually showing up, and so we're not at full capacity,\" she said.\n\n\n\n\n\n\"So, it would be really great if people could actually come in as walk-ins, if it's not busy.\"\n\n\n\nTickets for the penguin viewing experience at Melbourne's St Kilda Pier are now unavailable until the end of March 2026, with April bookings yet to be released. Source: SBS News Anderson said Phillip Island Nature Parks sends reminder emails urging visitors to cancel their tickets if they can no longer attend.\n\n\n\n\n\n\"We encourage people to cancel early if their plans change so they can be re-booked,\" he said.\n\n\n\n\n\nBut Sperring said people are \"a little bit annoyed\" they cannot cancel tickets online.\n\n\n\n\n\n\"They [ticketholders] have to phone Phillip Island to cancel up, and I think that means that a lot of people aren't doing that, and so then we're ending up with the boardwalk not being at full capacity,\" she said.\n\n\n\n\n\nDespite booking tickets online, ticketholders must call or email Phillip Island Nature Parks directly to cancel. The organisation said online cancellations are coming soon.\n\n\n\n\n\nSBS News observed some walk-in visitors were able to access the boardwalk when space allowed.\n\n\n\n\n\nAnderson confirmed there is \"some availability for walk-ins if numbers allow\".\n\n\n\nSBS News observed some walk-in visitors were able to access the boardwalk when space allowed. Source: SBS News To test how workable walk-ins really are, SBS News tried to enter the earlier session on two separate nights with similar weather, but was unable to get in.\n\n\n\n\n\nOn the third attempt, Phillip Island Nature Parks staff told us that tickets had become available, which could then be booked online at the gate.\n\n\n\nWill St Kilda penguin viewing experience stay free?\n\nPenguin viewing at St Kilda Pier has always been free.\n\n\n\n\n\nBefore the pier reopened in October, plans to introduce a $24 ticket fee were scrapped following public backlash.\n\n\n\n\n\nWhen asked whether the St Kilda Penguin Viewing Experience will be \"free forever\", Phillip Island Nature Parks CEO Catherine Basterfield could not confirm.\n\n\n\n\n\n\"I'm not in a place to answer that one, but it's free now,\" she said on ABC Radio Melbourne in October.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/king-charles-reveals-his-cancer-treatment-can-be-reduced-in-the-new-year/vfgtcduzr",
    "title": "'Personal blessing': King Charles reveals cancer treatment can be scaled back",
    "publish_date": "Fri, 12 Dec 2025 20:22:34 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles said on Friday that his doctors can reduce his treatment for cancer in the new year, describing the moment as a \"blessing\" and testament to remarkable medical advances.\n\n\n\n\n\nCharles, 77, was diagnosed with an unspecified form of cancer last February, and made the latest announcement in a televised broadcast as part of a national cancer awareness campaign in Britain.\n\n\n\n\n\n\"I am able to share with you the good news that thanks to early diagnosis, effective intervention and adherence to doctors' orders, my own schedule of cancer treatment can be reduced in the new year,\" he said.\n\n\n\n\n\n\"This milestone is both a personal blessing and a testimony to the remarkable advances that have been made in cancer care in recent years.\"\n\n\n\n\n\nA spokesperson for Buckingham Palace said his medical treatment will now \"move into a precautionary phase\" but doctors will continuously monitor his health.\n\n\n\nThe public remarks about his experience of cancer and his health condition are unusual for the royal family, which traditionally does not reveal much about the personal lives of its members.\n\n\n\n\n\nThe Buckingham Palace spokesperson said the advice from the cancer experts is that \"it is preferable that His Majesty does not address his own specific condition but rather speaks to those affected by all forms of the disease\".\n\n\n\n\n\nTests detected his cancer after a corrective procedure for an enlarged prostate, Buckingham Palace said in February 2024. At the time, the palace said it would not provide regular updates on his treatment, and did not give details about the cancer.\n\n\n\nREAD MORE Why some Australians stand by the royal family despite the Prince Andrew scandal\n\nAfter some time away from the spotlight, Charles, who ascended to the throne in 2022, returned to public duties in April this year with a busy schedule of ceremonies, appearances and foreign trips.\n\n\n\n\n\nIn March, Buckingham Palace said Charles was briefly hospitalised after suffering side effects from his cancer treatment, which were not specified.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-gift-of-mobility-how-des-has-changed-12-000-lives/d4fcej87x",
    "title": "The gift of mobility: How Des has changed 12,000 lives",
    "publish_date": "Fri, 12 Dec 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nThis story is a collaboration with SBS German .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nSparks are flying at a workshop on the Gold Coast where volunteers are turning out rough terrain wheelchairs.\n\n\n\n\n\nThe wheelchairs are destined for developing countries, where a wheelchair can be life changing for people with disability, as inventor Des La Rance explains:\n\n\n\n\n\n\"Oh, the reward. When you hand a child a wheelchair, it just takes my breath away.\"\n\n\n\n\n\nThe former cabinet maker first devised the plan to make and donate wheelchairs, after a trip to Fiji in 1996.\n\n\n\n\n\n\"I couldn't believe what the children there were going through without a wheelchair. And one of them that really sticks to my mind is a 14-year-old girl walking around on her hands. We've said, what are you going to do now? And she said, I'm going to town. I've never been to town.\"\n\n\n\n\n\nAlmost 30 years later Mr La Rance’s project still mass produces robust wheelchairs from dumped and unwanted bicycles.\n\n\n\n\n\n\"The bicycles come in, they get cut up and machined to what we want and then they're all passed down through the line with spray painting.\"\n\n\n\n\n\nAnd there’s no shortage of raw materials - with estimates up to half-a-million bicycles are discarded every year. Most end up in landfill. At the Surfers Sunrise Wheelchair Trust, skilled volunteers have turned out almost 12,000 wheelchairs, so far.\n\n\n\n\n\n\"We've delivered them to 31 different countries all over Asia, Africa, you name it, we've been there.\"\n\n\n\n\n\nThe latest shipment is bound for Sri Lanka, where catastrophic flooding creates extra hardship for people with limited mobility. Valluvan Thillairajah is a medical student and volunteer with Australian-based charity Vanni Hope, and currently delivering aid to flood victims there.\n\n\n\n\n\n\"With people who don't have mobility, they're literally unable to get away from it. And a lot of them unfortunately dying and being caught in the destruction, which is yeah really tough.\"\n\n\n\n\n\nWith many roads and paths destroyed in Sri Lanka, Mr Thillairajah says the generous gift of 121 wide-tyre wheelchairs is most welcome.\n\n\n\n\n\n\"They're rough terrain wheelchairs, which are really useful for us because especially in regions like the upcountry, you have to go uphill to get places.\"\n\n\n\n\n\nFor Trust chairman and Gold Coast local Geoff Croad it’s also about keeping unwanted bikes out of landfill.\n\n\n\n\n\n\"There was one building in Surfers [Paradise] that had like 40 to 50 bikes sitting in the basement. So, we're able to pick up 30 this morning, bring them back to the depot. We've probably put through the facility probably 40,000 bikes over the years. We use the back frame of the bike. We need two of those, two matching frames to form the basic wheelchair.\"\n\n\n\n\n\nThe design is so popular, Mr La Rance says the Rotary Club charity is swamped with orders.\n\n\n\n\n\n\"We just keep the containers rolling out. We've got people all over the world wanting these wheelchairs, so we're never going to fulfil the requests that are out there.\"\n\n\n\n\n\nThree decades and thousands of chairs later, Mr La Rance can hardly believe the impact.\n\n\n\n\n\n\"No, I never imagined that at all. You’d need to experience the effect it has on a person er that never been able to walk. You give them a wheelchair and wheel them to wherever they want to go. So, it combines the family back together again as well.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/covid-tracker-melbourne-man/uq72woqzq",
    "title": "'He's still the go-to': The Australian who's still counting our COVID cases",
    "publish_date": "Fri, 12 Dec 2025 19:33:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "While some people were building puzzles or baking sourdough to get through COVID-19 lockdowns, Mike Honey started tracking case numbers.\n\n\n\n\n\nHe told SBS News he wanted to have a good answer when his grandchildren asked him: \"So, what did you do [during the pandemic]?\"\n\n\n\n\n\nFour years later, the data analyst still translates global COVID-19 data into charts that help the public understand the risks of the disease — from national case numbers to the rise of variant strains worldwide.\n\n\n\n\n\nHis work has popped up in everything from news reports to academic research.\n\n\n\n\n\nAnd although case numbers are the lowest we've seen , epidemiologists told SBS News they still rely on Honey's work to fill an information void where state departments no longer have the time or resources to share data.\n\n\n\nFor the last four years, Mike Honey has spent several hours a week gathering and publishing vital information about COVID-19. Source: Supplied Paul Griffin, an infectious disease physician and clinical microbiologist from the University of Queensland, said: \"I think it's an incredibly valuable service he's provided.\"\n\n\n\n\n\nWhat's more, Honey does it all for free in his spare time.\n\n\n\nLooking at the big picture\n\nSoft-spoken and polite, Honey sat down with SBS News to talk about how he became scientists' go-to for COVID-19 information.\n\n\n\n\n\nHe explained that being from Melbourne's north-west suburbs meant he lived in one of the first places in Australia to be hit by lockdowns.\n\n\n\n\n\nAs an IT specialist stuck at home, he realised it was hard to get information about national case numbers.\n\n\n\n\n\n\"A lot of the states have a decent report that comes out ... but they are just for that state. There's nothing at the federal level,\" Honey said.\n\n\n\n\n\nSo he built a spreadsheet that brought all the case numbers from across the country together in one spot.\n\n\n\n\n\nThen, he posted it online — first on GitHub, an open-source code-sharing platform, and then \"pretty much everywhere\".\n\n\n\nThe graph shows estimated current COVID-19 case numbers across the country based on cases among aged care staff. Source: Supplied National case numbers aren't the only ones he keeps track of. He also monitors variants , vaccine uptake, and aged care case numbers, and posts case charts for New Zealand, the United States, the United Kingdom and Canada.\n\n\n\n\n\nIt wasn't long before epidemiologists started to take notice.\n\n\n\nAn 'incredibly valuable service'\n\nAdrian Esterman, professor of biostatistics and epidemiology at the University of South Australia, said during the pandemic he was asked to give talks to concerned community groups about variants.\n\n\n\n\n\nHe struggled to find enough detail from state health departments to satisfy his audience's questions.\n\n\n\n\n\n\"Then I came across a Tweet from Mike that led to his GitHub site, which provided exactly the information I was looking for,\" he said.\n\n\n\nHoney's variant tracker takes publicly available information on cases of people infected with COVID-19 mutations and brings it all together on a world map.\n\n\n\n\n\nThat way, it's much easier to see which variants are growing and where, compared to pages of text on sites like the World Health Organization's COVID-19 variants dashboard.\n\n\n\n\n\n\"I still give talks on COVID-19, and Mike's is still the go-to website,\" Esterman said.\n\n\n\n\n\nProminent American cardiologist Eric Topol, who founded the Scripps Research Translational Institute in California, told SBS News that Honey's work is a \"remarkable source\" of information.\n\n\n\n\n\n\"His diligence, strive for accuracy, and thoughtful sharing of data have been a welcome and important contribution to the biomedical community.\"\n\n\n\n\n\nGriffin agrees, and said he still refers to Honey's work \"a few times a week, to be honest\".\n\n\n\n\n\nHe said that while case numbers are low, the data Honey shares still helps to answer important questions.\n\n\n\n\n\n\"Like how we manage our hospitals and healthcare systems, and counsel our individual patients so they have an understanding of the risk,\" he said.\n\n\n\nA legacy in medicine\n\nHoney said his uncle's legacy has inspired him to help out where he can.\n\n\n\n\n\nHis late uncle, Dr Norman Honey, dedicated his life to treating leprosy patients and fighting the disease's stigma. He worked in West Africa before moving to Hong Kong, where he served as chief medical officer.\n\n\n\nNorman Honey (centre-right) after receiving a Member of the British Empire from Queen Elizabeth in 1994 for his work treating leprosy patients. Source: Supplied / Mike Honey Though much of the data is now gathered automatically, Honey said he still spends a few hours each week tracking COVID-19.\n\n\n\n\n\nAnd while he's taken a few nasty comments on social media here and there, he's been surprised by the public's overall response.\n\n\n\n\n\n\"There's a lot of people that say they're glad to see it, and they're hanging on it,\" he said.\n\n\n\n\n\nBut after four years, he admits he's looking forward to the day he doesn't have to post an update.\n\n\n\n\n\n\"It's a little bit of a weight on my shoulders,\" he said.\n\n\n\n\n\nHoney is hopeful the new Australian Centre for Disease Control, set to open on 1 January 2026, will take over his work.\n\n\n\nWhen asked if the government should pay him for his efforts, Honey laughed.\n\n\n\n\n\n\"That'd be nice.\"\n\n\n\n\n\nThen he quickly changed his mind.\n\n\n\n\n\n\"I'd probably prefer to keep it as my hobby.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/video/states-and-territories-reject-major-public-hospital-funding-boost/5rw4rddux",
    "title": "States and territories reject major public hospital funding boost",
    "publish_date": "Fri, 12 Dec 2025 09:49:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/national/victoria/west-gate-tunnel-opens-after-decade-of-delays-toxic-soil-battles-20251214-p5nni4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "West Gate Tunnel opens after decade of delays, toxic soil battles",
    "publish_date": "Sun, 14 Dec 2025 13:10:26 +1100",
    "category": "finance",
    "authors": [
      "Ashleigh Mcmillan",
      "Patrick Hatch"
    ],
    "text": "The West Gate Tunnel – a major new toll road connecting Melbourne’s west to the city — opened to a trickle of traffic on Sunday morning, following a decade of turbulent planning, a doubling of its cost and years of delays caused by disputes over toxic soil.\n\nAfter a restricted opening just after midnight, the $10.2 billion project, which is made up of 6.8 kilometres of tunnels connecting Melbourne’s west with the CBD, officially opened at 7am.\n\nThe new tunnel was almost empty on Sunday morning at 8.30am, with a handful of cars and trucks using the new roadway between Dynon Road in West Melbourne and Millers Road in Altona North.\n\nAt its peak, the alternative to the West Gate Bridge is projected to cater for 67,000 vehicles a day, and remove 28,000 trucks from the bridge and suburban streets in Melbourne’s inner west. A month of free travel on weekends through the tunnel will begin in January.",
    "source": "TheAge",
    "cluster_id": 1
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/not-feeling-the-christmas-vibe-this-show-will-fix-all-that-20251209-p5nm3j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Flashbacks haunt like ghosts of Christmas past amid family fallout",
    "publish_date": "Sun, 14 Dec 2025 13:06:07 +1100",
    "category": "entertainment",
    "authors": [
      "Millie Muroi",
      "Bernard Zuel"
    ],
    "text": "MUSIC\n\nSydney Philharmonia Choirs – Bach’s Christmas Oratorio\n\nOpera House, December 13\n\n★★★★\n\nReviewed by PETER MCCALLUM Bach’s Christmas Oratorio is replete with musical glories but presents a quandary for modern performance. Bach wrote the work as six cantatas for performance on separate Christmas Feast days, a mode of presentation which is only meaningful in a liturgical context. Yet the modern habit of presenting all six cantatas one after another creates a longish concert and sometimes dampens the concentrated focus that each deserves. The Philharmonia’s solution of splitting the oratorio over two separate Christmas seasons (2023 and 2025) and separating the cantatas with new Australian works was effective. After Deborah Cheetham Fraillon and Matthew Doyle’s Acknowledgement of Country, Tarimi Nulay – Long Time Living Here, conductor Elizabeth Scott led the opening chorus of Part IV, Fallt mit Danken, fallt mit Loben in a tempo of lilting complacency (using that word as Jane Austen did, rather than as a derogatory term). Tenor John Longmuir, who took the narrative role of the Evangelist, brought a sense of drama and robust strength to the part, opening out splendidly in Part VI, without making the role operatic. Baritone Christopher Richardson sang the recitatives with Chorale Immanuel, o susses Wort! and Wohlan dein Name with rounded pure vowels giving his tone an aura of poised dignity.\n\nIn the echo aria, Flosst, mein Heiland, soprano Jacqueline Porter projected a richly coloured, discreetly thrilling sound, blending with oboist Alexandre Oguey and organist David Drury to create refined chamber music, while the two ‘echo’ musicians, soprano Briar Babington and oboist Eve Osborn contributed distant imitations from behind the choir. Soprano Jacqueline Porter. Concertmaster Fiona Ziegler and sister Leone Ziegler played the concerto-like violin solos in Longmuir’s aria Ich will nur dir zu Ehren leben with persuasive rhythmic fluency. A characteristic of Part IV is the addition of French horns in the outer movements, which bathed the clear sound of the Philharmonia Chamber Singers in burnished warmth for the final chorale. Following this, Australian composer Phillip Cullen used Kipling’s poetry and quotations from Bach’s Part V for his new choral work A Nativity. With smoothly finished phrases and well-wrought traditional harmony, it began with a mournful plaint on cor anglais and ended with the choral lines haloed in high harmonics from solo violin. Scott’s leadership in the opening chorus of Part V was livelier than Part IV and drew neat articulation from chorus and orchestra and fluid rhythmic sprightliness from the pair of oboes that create Part V’s characteristic sound. Contralto Hannah Fraser sang the recitative with chorus, Wo ist der neugeborene Konig der Juden with wonderfully rounded pure sound.\n\nA highlight of the entire concert was the intimate musical interaction of the aria Terzetto Ach, wenn wird die Zeit erscheinen. Here Longmuir and Porter created brightly edged excitement alongside Fiona Ziegler’s animated violin figuration, while Fraser soothed the music with a warm admonitory phrase “be silent, he is already here”. A Prayer of Jesus by Australian composer Kayla Erin Hinton began the second half, articulating declamatory phrases accompanied by orchestration of confident radiance. Part VI, with its outer choruses laced with trumpet solos from Anthony Heinrichs, brought the concert’s choral highlights, the Philharmonia Chamber Singers articulating with energised rhythmic fluidity. The work ends with the so-called ‘Passion chorale’ set with elaboration instrumentation and exultant trumpet figuration. The Philharmonia followed this with a reprise of the opening chorus of Part 1, which, though a masterpiece, was unnecessary here. The actual close, a true Bachian ending, expresses collective joy through masterly musical detail and symbolism, and says all that needs to be said. THEATRE\n\nIRVING BERLIN’S HOLIDAY INN\n\nRiverside Theatres Parramatta, December 6\n\nUntil December 14\n\nReviewed by KATE PRENDERGAST\n\n★★★★\n\nIn the 1940s, the legendary Irving Berlin (who was, ironically, Jewish) dreamt of a little number called White Christmas. At Riverside Theatres, audiences dreamt of a Christmas that doesn’t sweat their entrails out, while being razzle-dazzled to distraction by the stage adaptation of Holiday Inn, a two-hour affair featuring a live band, a dizzying array of sparkle-heavy costumes, old-world charm and some vigorously inventive original choreography by Veronica Beattie George.\n\nIf you haven’t seen a tap-dancing ensemble perform synchronised jump-rope with green tinsel, are you even in the silly season? The show features a dizzying array of sparkle-heavy costumes. Credit: Robert Catto Holiday Inn is the film that launched the world’s best-selling single, which also starred musical history’s most dapper dynamic duo: Fred Astaire and Bing Crosby. Filling those enormous singin’ and dancin’ shoes just fine in this Well Done Creative production are Rob Mallet as Jim Hardy and Max Patterson as Ted Hanover – showbiz characters whose long friendship is put to the test when Jim’s domestic impulses and anxious sentimentality clash with Ted’s big-time ambitions. To put it another way: narrative conflict, thy name is woman. First it’s Lila (Pamela Renouf is a sensation and a hoot as the squawking, mega-talented, self-obsessed starlet). Then it’s Linda Mason, (Mary McCorry, of classically beautiful looks and ravishing vocals), an independent-minded schoolteacher who sold Jim the Mason farm in Connecticut, where he hopes to start a new chapter away from the insanity of “the lifestyle”. Getting festive: Matt Hourigan and Max Patterson. Credit: Robert Catto\n\nLife in the country bumpkin seat, however, turns out to be laborious, lonesome and financially challenging. With some sneaky manoeuvring from plucky farmhand Louise (Paige Fallu), he and his New York friends cook up a creative money-making ruse: to transform the property into a “Holiday Inn”, hosting extravagant ticketed shows (also charging guests for board) only on holidays. Cue Shaking the Blues Away! Loading There are some interesting (and essential) variations from the film. No blackface is one. There are also significant differences in narrative structure and character motivations (with Ted spared the moral grubbiness of “stealing the girl” romantically). Some songs are shuffled about to take on new meaning (a memorable moment comes when the otherwise silent drummer pipes up with his Cinderella plea to Ted: “I’m easy to dance with!”), with the best comic moments still when Jim lets jealousy undermine his own show. As with so many crowd-pleasing productions, this one would benefit from being more snappy, with less stuffing. Some added Berlin hits feel interstitial, and the invigorating theatrical bombast under director Sally Dashwood loses a little pizzazz in the second half. That’s not to say there isn’t a lot to be enjoyed, particularly given the robust technical skills of the actors, which are geared for delight and well-balanced with their acting chops. There’s a worthy takeaway, too, about freedom and autonomy. A line from French poet Guillaume Apollinaire that bookends the show reminds us what holidays are all about: “Now and then, it’s good to pause in our pursuit of happiness and just be happy.”\n\nMUSIC\n\nKendrick Lamar\n\nAllianz Stadium, December 10\n\nReviewed by BERNARD ZUEL\n\n★★★★ Kendrick Lamar doesn’t exactly want to be a pop star, but he doesn’t not want to be one either. Take the flames left and right and two huge screens, the sparkly-framed glasses and a posse of dancers, the giant furry dice with scented tree ornament and the scaled-up stairs on an otherwise bare stage, the crack of fireworks like cannons and a whispered start with Lamar muttering in the shadows backstage, and the powerful, crisp, clear and just-short-of-overwhelming sound. All point to production values of a mega-pop show. All simple but effective manipulations of an environment effectively inhabited by only one non-dancing, rarely-speaking, charismatic but undemonstrative man.\n\nBut then what is King Kunta but a knee-cracking pop song? Even, or maybe especially in, this condensed version, followed with the skittish, swirling cinematic noir of Element. How many hooks are as elemental as Squabble Up’s bare-bones lean/shuffle, brought to life by those dancers and given voice by the whole stadium, or the brass-bolstered TV Off, split into two parts, an hour apart? How many stiff-legged grooves are as welcome to people who can’t necessarily dance but can strut in their seats as that offered in Humble? Kendrick Lamar doesn’t want to be some generational spokesman, but he doesn’t not want to be one either. Sure, the lubricious Poetic Justice was primarily focused on matters horizontal but the same territory in the old-school soul groove of Dodger Blue was laced with unceremonial frankness, and Good Credit crept into darker corners. M.A.A.D City peeled back urban sheets and showed how everything runs on tension, and within the folding-in-on-itself progressive bass and counterweight keyboards of Reincarnated was a dense story that was always racing away with his delivery but still landed punch after punch about being that very modern creature, the uncertain adult in a childlike world. Speaking of which, one thing Lamar very much does want to be is Drake Disser-in-Chief. Still. See both the shot early in the show, Euphoria, and the stronger chaser to close the set, Not Like Us. Kendrick, that man is down, boxed up and posted already.\n\nWhile his voice is the lowest profile of the on-stage sounds, that’s ultimately irrelevant. If you don’t already know each word of these songs you aren’t serious and you aren’t meant to be here. Kendrick Lamar doesn’t want to be exclusive, but he doesn’t not want to either. Got a problem with that? To borrow from the man, “Put the Bible down and go eye for an eye for it.” Kendrick Lamar plays Allianz Stadium tonight (December 11) and the Spilt Milk Festival in Canberra on December 13 and Gold Coast on December 14. MUSIC\n\nSOMBR\n\nHordern Pavilion, December 9\n\nReviewed by MILLIE MUROI\n\n★★★★ For a young artist whose fame started with a viral song on TikTok just three years ago, Sombr is surprisingly smooth and unfazed on stage.\n\nOn his first Australian tour, the 20-year-old American singer could easily have you believe he is a seasoned pro (apart from a few too many disingenuous “I-love-yous” when he should be getting on with the show). The setlist begins on the front foot, running through songs from Saviour, showcasing his richer, deeper tones, to We Never Dated, which drifts into an ethereal falsetto. Sombr performs during the 2025 MTV Video Music Awards. Credit: Getty Images for MTV His range is impressive and, while he may not have an especially powerful voice, he has enough to make an impact as required. Technically, he is consistent and controlled while imbuing all of his songs with that characteristic teenage angst. The show is prety much bare bones - one man and a band with basic production. But it’s done well.\n\nAnd while it does drift at points in the second half, the setlist is not long enough to make it tedious. It’s also a comfortable sort of dip: one that still has you swaying to the music and enjoying the atmosphere. Sombre’s has some similarities to the work of The 1975’s frontman Matty Healy. Their songs share stylistic and thematic similarities and during numbers such I Wish I Knew How to Quit You and Do I Ever Cross Your Mind, the tortured poet bearing seem familiar. Sombr is, however, a bit softer and more palatable than Healy. Caroline - the song Sombr wrote when he was 16 and which catapulted him to fame - and Perfume, are tender, heartfelt and delivered with precision but also a mesmerising sweetness. And while most of his lyrics are despondent, devastating or dark, there are bouncy beats, catchy bass segments and playful riffs that keep the energy high. He also finishes strong with funky songs such as 12 to 12 and his biggest hit: Back to Friends. It may not be a concert for the ages, but it’s a seamless show with solid fundamentals.\n\nTHEATRE\n\nBEAUTIFUL THING\n\nQtopia Sydney, December 5\n\nUntil December 13\n\nReviewed by KATE PRENDERGAST\n\n★★★½ It’s a seasonally fitting, welcome thing to hear happy squeals and warm laughter in response to a queer drama told on stage. Often (unless it’s part cabaret), the audience’s reaction is grim, choked silence – trauma the legitimate yet scarifying seam from which a lot of LGBT+ stories are mined. Allowing a gay “coming-of-age” love story to have a relatively untroubled trajectory and happy ending was what made Liverpudlian dramatist Jonathan Harvey want to write Beautiful Thing. Opening in London in 1993, it went on to win a John Whiting Award, was adapted into a popular film, and had its Australian premiere at the 1998 Sydney Gay and Lesbian Mardi Gras. This CODA production brings it back with a uniformly excellent cast, with Finn Stannard making an impressive directorial debut to close Qtopia’s 2025 program.\n\nJamie (Jake Walker) and Ste (Max Dykstra). Credit: Yingying Zhang Harvey would go on to write for Coronation Street for two decades and counting, and there’s a lot of this and other British soaps’ recognisable tones and touchpoints here: a character-driven plot and working-class realism; young and old battling a hard-luck system with whatever’s at hand (in this story, the music of Mama Cass); a matter-of-factness about the realities they’re up against; violence acknowledged if not given too-graphic treatment; neighbours getting all up in each other’s business; and animated dialogue that plumbs its humour from cheek, colourful patois and bluntness. Willa King as tough-love mum and worn-down barwoman Sandra steals the show on that last one (though her relentless shaming of heroically impudent expelled schoolgirl Leah as “slag” might be a bit dated). Set in a South London council estate, an environment summed up by three sky-blue doors on a grey tenement wall, the “beautiful thing” in question is the tender relationship that forms between Hello! magazine-reading Jamie (Jake Walker) and much more athletic Ste (Max Dykstra), which begins when Ste takes refuge from an abusive father in his neighbour’s bedroom. It’s also how frowsy queen Sandra, her new boyfriend Tony (Michael Hogg) and “lost cause” Leah (Poppy Cozens) react. It’s not a big spoiler to say: pretty well! When Tony, a stand-in father figure, wraps trembling Jamie in a bear hug and says with a smiling reassurance “it’s OK” after the boy comes out to his mum, a widespread corneal leakage event was seen in the audience.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/victoria/andrew-won-t-be-able-to-use-these-new-tram-stops-it-s-illegal-20251208-p5nlrg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Andrew won’t be able to use these new tram stops. It’s illegal",
    "publish_date": "Sun, 14 Dec 2025 13:00:00 +1100",
    "category": "finance",
    "authors": [
      "Lachlan Abbott"
    ],
    "text": "Disability advocates have criticised state government plans to build new tram stops in North Melbourne that don’t allow wheelchair users to access trams, despite a legal requirement to do so.\n\nThe Department of Transport last week revealed proposed changes to stops on Victoria, Errol and Queensberry streets that are required for larger G-class trams to operate on route 57 to West Maribyrnong.\n\nAndrew Bretherton, an advocate for better public transport access for people with a disability, is disappointed with the government’s plans. Credit: Jason South\n\nThe plans do not include raised platforms that allow wheelchairs or prams to roll onto the new low-floor trams, which were designed to promote accessibility.\n\nA department spokesperson said level-access stops were still planned in the future after the North Melbourne stops were redesigned, but could not say when.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/business/companies/seven-group-s-gas-well-is-leaking-methane-into-ocean-off-victoria-20251212-p5nn9k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Seven Group’s gas well is leaking methane into ocean off Victoria",
    "publish_date": "Sun, 14 Dec 2025 13:00:00 +1100",
    "category": "finance",
    "authors": [
      "Nick Toscano"
    ],
    "text": "An offshore gas well owned by billionaire businessman Kerry Stokes’ Seven Group Holdings conglomerate has been leaking methane into the ocean off the Victorian coastline for more than two years.\n\nThe Longtom gas field lies 30 kilometres south-west of the Gippsland town of Marlo. It’s been mothballed since 2015 but is seeping gas from a minor leak detected at one of its shut-in wells and reported to the regulator in 2023.\n\nThe Bass Strait’s Longtom gas field, mothballed by Seven Group in 2015, has been leaking methane. Credit: Jessica Shapiro\n\nSeven Group, the gas field’s owner, pledged at the time it would fix the leak. However, the National Offshore Petroleum Safety and Environmental Management Authority (NOPSEMA) last week issued a notice saying the company has failed to comply with key commitments it gave in 2023 that required it remediate the leaking well and conduct monitoring of the field.\n\nFugitive leaks from oil and gas infrastructure, such as wells and pipelines, are major sources of methane emissions that are driving dangerous climate change. Methane is a potent greenhouse gas that warms the planet up to 80 times more than carbon dioxide over two decades, and is responsible for roughly a third of all planetary warming.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/a-little-bit-embarrassed-ugly-dismissal-shows-green-not-yet-finished-article-20251214-p5nngy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘A little bit embarrassed’: Ugly dismissal shows Green not yet finished article",
    "publish_date": "Sun, 14 Dec 2025 12:53:28 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "Cameron Green admits he was embarrassed by an ugly dismissal under lights during the Gabba Test match, as he braces for the extra bowling loads that will come his way in the final three games of the Ashes series.\n\nBacking away to hit what he expected to be yet another bouncer from Brydon Carse, Green could barely reach the full ball that the England fast man flung down for a change-up, and walked off chastened by the sight of stumps splayed and bails flying.\n\nCameron Green is bowled by Brydon Carse. Credit: AP\n\nFive years into his international career, Green is yet to make a hundred on home soil, and his Test record in Australia (680 runs at 30.90 from 17 matches with a top score of 84) reflects a talent that has not yet come to full flower here.\n\n“It looks quite bad when you get out, you walk off a little bit embarrassed, but they’re all really great learnings for future games,” Green said of losing his stumps. “It’s a really good plan on his end. The way we were going that was the best way I saw it, it’s not always going to pay off.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/wwe-champ-bloodied-by-young-gun-20251214-p5nnjf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WWE champ bloodied by young gun",
    "publish_date": "Sun, 14 Dec 2025 12:42:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "WWE champ bloodied by young gun\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/fans-riot-after-disaster-messi-appearance-20251214-p5nnjd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fans riot after disaster Messi appearance",
    "publish_date": "Sun, 14 Dec 2025 12:32:01 +1100",
    "category": "sports",
    "authors": [],
    "text": "Fans riot after disaster Messi appearance\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/technology/desperate-vibes-as-under-16s-crowd-into-yope-and-lemon8-20251210-p5nmiq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Desperate vibes as under-16s crowd into Yope and Lemon8",
    "publish_date": "Sun, 14 Dec 2025 12:05:02 +1100",
    "category": "finance",
    "authors": [
      "Tim Biggs"
    ],
    "text": "Previously little-known social media platforms are stuck at the top of app store charts as young Australians seek shelter from the social media ban in places they previously tended to ignore.\n\nSo, what are the vibes like inside these refuges?\n\nLemon8 is the most prominent of the alternative apps. It feels a lot like a TikTok take on Instagram, as it should, given it’s powered by TikTok parent company Bytedance. You have grids of images and videos posted by people you follow, as well as an endless scroll of algorithmic “for you” content. It has even more of a Wild West feel than Instagram, fairly innocuous skincare and food posts mixed with extreme sports, highly sexualised engagement bait, lewd jokes and plenty of fake news.\n\nLemon8 claims to have more lifestyle, fashion and wellness content than TikTok, but it’s very similar.\n\nI could feel the algorithm trying to grasp on to the kind of content I wanted over the course of the day I used it, and although I was mainly trying to find new Australian users escaping the social ban, I was also getting increasingly aggressive generic rants and gun, motorbike and military content.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/queensland/girl-dies-after-falling-off-cliff-while-trying-to-take-a-photo-20251214-p5nnj0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Girl dies after falling off cliff while trying to take a photo",
    "publish_date": "Sun, 14 Dec 2025 12:02:58 +1100",
    "category": "sports",
    "authors": [
      "William Davis"
    ],
    "text": "A teenage girl with her family has died after slipping off a cliff on the Sunshine Coast.\n\nThe 17-year-old fell about 30 metres from the rock face at Moffat Beach in Caloundra about 6.40pm on Saturday.\n\nNine News Queensland reported she had jumped the fence to take a photo when she slipped.\n\nBystanders rushed to the clifftop, and a second woman was injured while trying to help.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/racecar-tyre-hits-volunteer-during-victorian-event-20251214-p5nnh6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Racecar tyre hits volunteer during victorian event",
    "publish_date": "Sun, 14 Dec 2025 11:48:03 +1100",
    "category": "sports",
    "authors": [],
    "text": "Racecar tyre hits volunteer during victorian event\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 2
  },
  {
    "url": "https://www.theage.com.au/culture/art-and-design/major-push-for-the-key-change-that-led-to-record-audiences-in-london-s-west-end-20251211-p5nmyn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Major push for the key change that led to record audiences in London’s West End",
    "publish_date": "Sun, 14 Dec 2025 11:45:00 +1100",
    "category": "entertainment",
    "authors": [
      "Linda Morris"
    ],
    "text": "West End-style tax incentives to supercharge Australian theatre and live music will be a NSW “priority” as state governments across the country build a case for major federal arts tax reform.\n\nNSW claims it now has the support of the other five states and the two territories – after enlisting the Queensland Coalition government – to pursue a shake-up of the nation’s tax system and help Australia’s struggling culture sector.\n\nNSW Treasury is fleshing out and modelling a shortlist of five priority reforms to take to a February meeting of state cultural ministers and pursue these with the Albanese government.\n\nThese incentives include the abolition of taxes on arts and music prizes and the extension of current screen and digital gaming tax incentives to theatre and live music.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/bushfire-emergency-declared-in-wa-20251214-p5nnio.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bushfire emergency declared in WA",
    "publish_date": "Sun, 14 Dec 2025 10:58:44 +1100",
    "category": "finance",
    "authors": [],
    "text": "Bushfire emergency declared in WA\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/palmer-returns-to-form-against-everton-20251214-p5nnip.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Palmer returns to form against Everton",
    "publish_date": "Sun, 14 Dec 2025 10:58:44 +1100",
    "category": "sports",
    "authors": [],
    "text": "Palmer returns to form against Everton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/after-345-shows-this-modern-day-musical-genius-brings-his-epic-tour-to-an-end-20251214-p5nnig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After 345 shows, this modern-day musical genius brings his epic tour to an end",
    "publish_date": "Sun, 14 Dec 2025 10:56:12 +1100",
    "category": "entertainment",
    "authors": [
      "Martin Boulton"
    ],
    "text": "MUSIC\n\nJacob Collier | Djesse World Tour ★★★★\n\nMargaret Court Arena, December 13\n\nFour brightly coloured trees glowed on stage and amped up a festive mood in the air, as Jacob Collier bounded into view wearing loose-fitting multicoloured pants and a radiant orange jacket.\n\nMulti-instrumentalist Jacob Collier performs on stage at Margaret Court Arena in Melbourne during his Djesse World Tour on December 13, 2025. Credit: Richard Clifford\n\nThe lanky 31-year-old Londoner barely stopped bouncing about in his bright yellow Crocs for the next two hours, as his five-piece group shifted from silky jazz grooves to funky beats, classical flourishes and Collier’s self-styled gospel harmonies.\n\nIn the 345th and final performance of his epic Djesse World Tour, Collier frequently thanked the audience and showered affection on Melbourne, where he originally played in 2018 – the same year he released the first of four albums in the Djesse series.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/cyborg-locks-up-submission-victory-to-defend-crown-20251214-p5nnhq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cyborg locks up submission victory to defend crown",
    "publish_date": "Sun, 14 Dec 2025 10:42:32 +1100",
    "category": "sports",
    "authors": [],
    "text": "Cyborg locks up submission victory to defend crown\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://au.news.yahoo.com/fresh-minister-snared-growing-expenses-232058936.html",
    "title": "Rule-breaking AG to repay taxpayers for family holiday",
    "publish_date": "2025-12-14T02:07:35Z",
    "category": "finance",
    "authors": [],
    "text": "Attorney-General Michelle Rowland will pay taxpayers back after some expenses claimed for a family holiday were found to be a breach of the rules.\n\nMs Rowland used family reunion entitlements to take her children on a trip to Perth in 2023, which cost more than $21,600 including about $16,000 for business class flights.\n\nThe 15-year MP for Greenway, in Sydney's northwest, undertook the holiday on the side of a ministerial visit to WA.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Independent Parliamentary Expenses Authority (IPEA), which reviews politicians' spending, found some of the costs should not have been charged to taxpayers.\n\n\"During the trip to Perth, the attorney-general had at least 10 official engagements,\" a spokesperson for Ms Rowland said.\n\n\"IPEA finalised its advice ... and conveyed a portion of the family reunion travel expenses were outside the guidelines.\n\n\"The attorney-general has formally accepted that advice on Friday and commenced steps to make a repayment.\"\n\nHealth Minister Mark Butler claimed the allowance for family to join him at the Australian Open. (Lukas Coch/AAP PHOTOS)\n\nMs Rowland's decision - first reported by Sky News - followed a self-referral of her travel expenses for an independent audit, the same process undertaken by another embattled cabinet minister, Anika Wells.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHowever, the government's deepening entitlements concerns run deeper than the pair, with fresh revelations made by the Daily Telegraph on Sunday.\n\nThe newspaper revealed Health Minister Mark Butler claimed $5500 for family members to join him at the Australian Open and an SCG Test match.\n\nThose claims, which appear within the rules, are the latest example of family travel which fall short of community expectations.\n\nAs more ministers have become embroiled, Prime Minister Anthony Albanese has asked the expenses watchdog to look at changes to entitlements.\n\nMr Albanese batted away questions last week when pressed why the federal government won't overhaul entitlements, which wouldn't require parliament to reconvene.\n\nTreasurer Jim Chalmers rejected calls for Michelle Rowland to step down. (Mick Tsikas/AAP PHOTOS)\n\nTreasurer Jim Chalmers rejected calls for Ms Rowland to resign.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Michelle has done the right thing in asking the IPEA to take another look, as has Anika ... to make sure that everything that's happened here is within the rules,\" he told Sky News on Sunday.\n\n\"I think that's appropriate. I also think it's appropriate that the PM has sought advice.\n\n\"We'll get that advice in due course, and we'll consider it.\"\n\nOpposition Leader Sussan Ley previously resigned in 2017 as the then health minister after using a taxpayer-funded trip to buy property on the Gold Coast.\n\nMs Ley has offered bipartisan support to reform the rules for politicians.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe scrutiny began over flights for Ms Wells and two staff that cost almost $100,000.\n\nThe communications minister flew to New York to promote Australia's looming social media ban for under 16s at the United Nations, with last minute bookings bumping the fares to eye-watering amounts.\n\nIt later emerged Ms Wells charged taxpayers $1000 for a dinner in Paris, as well as several thousand dollars for her husband to attend AFL grand finals with her.\n\nAs sport minister, there is an understood need to be at many of Australia's biggest - and most desirable - events.\n\nHowever, her decision to ask a chauffeur to wait for seven hours while she attended the Australian Open in 2023 - costing almost $1000 - has raised eyebrows.\n\nOpposition communications spokeswoman Melissa McIntosh called for changes to the travel scheme. (Mick Tsikas/AAP PHOTOS)\n\nOpposition communications spokeswoman Melissa McIntosh said there had to be changes.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"It's this excessive use of taxpayer money for big events, and that started with the trip to New York and the $1000 dinner,\" she told Sky News.\n\n\"People don't think that attending sporting events with your husband coming down just for that event is work ... there's an expectation that's been broken with the Australian people.\"\n\nMs McIntosh again defended her decision to fly herself and her son to Queensland, where he was taking part in the Australian National Judo Championships on the Gold Coast.\n\nShe said she had work engagements every single day she was in the Sunshine state.",
    "source": "Yahoo",
    "cluster_id": 13
  },
  {
    "url": "https://au.finance.yahoo.com/news/budget-reveal-australias-fiscal-fortunes-010000776.html",
    "title": "Budget update to reveal Australia's fiscal fortunes",
    "publish_date": "2025-12-14T01:00:00Z",
    "category": "finance",
    "authors": [
      "Jacob Shteyman",
      "Ben Mckay",
      "Sat December At Pm",
      "Min Read"
    ],
    "text": "Extra spending is taking its toll on the federal budget's bottom line but a stronger-than-expected tax take should soften the blow when the treasurer releases his mid-year budget update.\n\nJim Chalmers has already revealed a $12.7 billion blowout in \"unavoidable\" spending, half of which was due to natural disaster relief proving more costly than anticipated.\n\nThe budget update on Wednesday will also spend billions on election promises the government wants to fulfil.\n\nThe majority of the $13 billion-odd set aside for campaign commitments will go to the states and territories to build up to 100,000 new homes exclusively for first home buyers.\n\nTreasurer Jim Chalmers warns there's a $12.7 billion blowout in \"unavoidable\" spending. (Mick Tsikas/AAP PHOTOS)\n\nTo help make ends meet, Dr Chalmers revealed on Sunday he had booked $20 billion in savings across the next four years.\n\n\"We've now found savings in every single one of our seven budgets and budget updates,\" he told Sky News.\n\n\"This mid-year budget update will be defined by economic responsibility, just like the government is.\"\n\nHe downplayed expectations of fresh announcements, saying it \"was not a mini-budget, there's not a lot of new stuff in there\".\n\nDr Chalmers has already ruled out extending energy rebates beyond the current year, while changes to deeming rates will give a haircut to the pension payments of asset-holding retirees.\n\nThe squeeze is also on federal department spending, leaving the central question how it impacts the bottom line of government books.\n\nAMP chief economist Shane Oliver predicts the budget deficit in 2025/26 will narrow from the $42.1 billion forecast in the March budget to about $37 billion, courtesy of company and personal income taxes continuing to exceed Treasury's expectations.\n\nMost money set aside for election commitments will go towards funding up to 100,000 new homes. (Dan Himbrechts/AAP PHOTOS)\n\nVeteran budget-watcher Chris Richardson has predicted a near-$10 billion improvement in the bottom line for the financial year, putting his expected deficit at $32.6 billion.\n\nMr Richardson expects the improvement to come from a $14 billion upgrade to revenue, driven by stronger tax takes on high-performing super funds and partly offset by a $4 billion increase in spending.\n\nHe predicts the headline deficit, which includes \"off-budget\" spending the government uses to squirrel away items loosely classed as investments, will come in at $55.7 billion.\n\nThe budget documents will also include Treasury's updated forecasts for economic indicators such as inflation, unemployment and GDP growth.\n\nThey should include upward revisions to price growth after the inflation dragon came back to life in the September quarter.\n\nRevisions to price growth are expected in the budget update following September inflation figures. (Dean Lewins/AAP PHOTOS)\n\nDr Chalmers has also said to expect an upward revision to business investment forecasts, from 1.5 per cent to three per cent growth this financial year, reflecting a stronger-than-expected build-out of data centres.",
    "source": "Yahoo",
    "cluster_id": 36
  }
]