[
  {
    "url": "https://www.9news.com.au/world/elon-musk-could-be-worlds-first-trillionaire-new-tesla-deal/3b6cc294-56e8-443b-84e7-9bd22e5858f5",
    "title": "Tesla proposes Elon Musk pay package that could make him the world's first trillionaire",
    "publish_date": "Fri, 05 Sep 2025 14:41:20 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Elon Musk, already the world's richest person, could become the first trillionaire after the Tesla board unveiled a massive new pay package for its CEO to keep his focus on the troubled EV maker.\n\nThe package would grant him additional shares of Tesla stock if the company is able to grow far beyond its current value, with a market capitalisation far greater than any company has ever approached. Musk's previous pay package, which added significantly to his massive wealth, also laid out ambitious growth plans that once appeared to be a reach – but which Tesla proved able to reach easily.\n\nThe new pay package could grant Musk 423.7 million additional shares of Tesla stock. Those shares would be worth $US143.5 billion ($218.6 billion) at today's stock value.\n\nElon Musk could become the world's first trillionaire if shareholders adopt a new proposal that would give him unprecedented sums of money if the company reaches certain ambitious milestones. (Andrew Harnik/Getty Images via CNN Newsource)\n\nBut Musk would get those shares only if the value of Tesla stock increases significantly in coming years. The company stock would need to reach an overall value of $US8.5 trillion ($12.95 trillion) for Musk to get all the shares, significantly above the current market capitalisation of $US1.1 trillion ($1.68 trillion).\n\nThose 423.7 million new shares that Musk would get under this package would be worth close to $US1 trillion ($1.52 trillion) should the company hit the increased valuation targets spelled out in Friday's proxy statement.\n\nIf Tesla shares are able to reach the $US8.5 billion market capitalisation value, it could become the most valuable company ever. It would be worth roughly double the current market value of Nvidia (NVDA), the current most-valuable company on the market. Tesla is already the most valuable automaker by a large margin, even though legacy automakers, like second-most valuable automaker Toyota, sell far more vehicles and now make more profits.\n\nProposal for Tesla in invest in xAI\n\nThe company's proxy statement that laid out Musk's payment plan also included a shareholder proposal that Tesla take a stake in privately-held xAI, the artificial intelligence company that Musk also owns. That could help Elon Musk further consolidate his growing business empire.\n\nXAI recently purchased X, the social media platform formerly known as Twitter, which Musk bought for $US44 billion of his own money in 2022. The company did not take a position for or against that shareholder proposal, which does not give any details of how large a stake Tesla should take in xAI, and what price.\n\nBut any such investment could further enrich Tesla since Musk is the primary owner of xAI.\n\nREAD MORE: Fears accused killer Dezi Freeman could be down a mine shaft\n\nIf Tesla shares are able to reach the $US8.5 billion market capitalisation value, it could become the most valuable company ever. (AP)\n\nMusk currently owns 410 million shares of Tesla shares, worth $US139 billion at Thursday's closing price. That stake, along with his stakes in xAI, rocket company SpaceX, and several other companies he has started and runs, have made him the richest person on the planet, worth $US378 billion according to Bloomberg's billionaire tracker.\n\nHe currently has options to buy an additional 304 million shares of Tesla, but a judge in Delaware has twice struck down that 2018 pay package that granted him those options as illegal. Those rulings came despite overwhelming approval by Tesla shareholders – twice. The company again has tried to grant those options to Musk this year, and adding in those options, he now owns 18 per cent of the company's shares.\n\nTesla shares nearly doubled in value to a record-high price for its shares between election day and mid-December 2024, as investors bet that his close ties to US President Donald Trump would be a boon for Tesla. But as Tesla faced protests and dropping sales and falling profits in backlash to those ties (before he had a falling out with Trump), all those things resulted in Telsa's stock losing those gains. The shares have recovered some of those losses, but they are still down 26 per cent from the December peak.\n\nStill, Musk and his fans on Wall Street have insisted the company is well positioned to grow even larger and more successful in the future. He has continued to predict that his plans for self-driving cars – including a robotaxi service – will create massive profits and value for shareholders. The robotaxis would provide rides to passengers and also allow Tesla owners to rent out their cars for driverless rides when not in use.\n\nTesla shares nearly doubled in value to a record-high price for its shares between election day and mid-December 2024, as investors bet that his close ties to US President Donald Trump would be a boon for Tesla. (AP)\n\nMusk has also promised a line of humanoid robots that could bring in even more sales than Tesla's car business.\n\nKeeping Musk focused on Tesla\n\n\"It's a big pay package but Tesla needs to keep its biggest asset in Musk as CEO,\" Wedbush Securities analyst Dan Ives told CNN on Friday. Ives is one of the bigger Tesla bulls on Wall Street.\n\n\"In this AI era Musk now will drive its next leg of growth,\" Ives added. \"The Board had a $1 trillion decision and made the right one.\"\n\nThe board's proxy statement spoke of the importance of keeping Musk focused on Tesla going forward. In addition to his many business interests, he remains active in politics, despite his falling out with Trump. He has announced plans to form a third political party.\n\nTesla, in its proxy statement, warned that it needed to incentivise Musk to focus his attention on growing the company. It said that during the negotiations on the pay package, \"Musk also raised the possibility that he may pursue other interests that may afford him greater influence if he did not receive such assurances.\"\n\nThe board said it \"believes that Mr Musk singularly possesses the leadership characteristics necessary to transform Tesla and realise its long-term mission at an unparalleled level\".\n\nMusk currently owns 410 million shares of Tesla shares, worth $US139 billion at Thursday's closing price. (AP)\n\nBut the company said it is also making plans for life after Musk, saying it is already working on succession plans. And it said that one of the terms of the employment package that Musk must meet to receive the final 70 million shares of stock is that he needs to have \"developed a framework for Chief Executive Officer succession\".\n\n\"The board regularly discusses management succession planning and leadership development,\" said the proxy statement. It said those succession plans are \"for both sudden, unanticipated events, in addition to longer-term planned succession for its executives\". It said it \"believes that management has developed a robust pipeline of seasoned leadership talent within Tesla,\" and that is also looking at possible external talent.\n\nMusk does not receive a cash salary from Tesla. All of his compensation comes from Tesla shares and options he has been granted in the past. Since there is still an ongoing court fight over the 304 million options, Musk has not received any compensation for nearly a decade, since a 2012 pay package made its last disbursement of options to him in 2017.\n\nBut not all tech billionaires receive additional stock options or grants as compensation, instead benefiting from the increased valuations of their existing stakes in their companies. That includes Amazon founder Jeff Bezos and Mark Zuckerberg, who co-founded Facebook. Both took large stakes in their companies as founders, but neither has received stock grants or options since those companies had initial public offerings in 1997 and 2012, respectively.\n\nTesla faced protests and dropping sales and falling profits in backlash to Musk's ties to Donald Trump. (Getty)\n\nIf Musk and his fans are right, Musk would become far wealthier even without any additional shares of Tesla stock. His current holdings of 410 million Tesla shares, even without the disputed 304 million options, would be worth nearly $US1 trillion more than today's valuation, should Tesla's market cap rise to $US8.5 billion.\n\nDespite promises, Tesla faces problems\n\nBut to achieve that target, it would have to start doing the things Musk is promising in terms of self-driving vehicles and its robotaxi. And that would mean meeting grand claims from a man and company that have often fallen short of their promises.\n\nTesla critics say that the stock has become grossly overvalued because of Wall Street's willingness to buy into Musk's vision of the future in terms of AI, self-driving vehicles and robots, despite its failures to deliver on past promises along those lines.\n\n\"Elon Musk has been saying since 2014 'we will have a fully autonomous car next year'. It hasn't happened, but that promise has been valued in the billions by Wall Street,\" said analyst Gordon Johnson, one of the harsher critics of Tesla. \"Elon Musk is a master manipulator. He's been able to keep the stock elevated. The reason the board is paying him is he's willing to say things that other CEOs aren't willing to say or get away with.\"\n\nThe richest man's relationship with the president eventually soured before he abandoned the administration. (AP)\n\nTesla is facing growing competition from Chinese EV makers. BYD, one of those Chinese automakers, is poised to pass Tesla for the most EV sales worldwide, even though it is not available for sale in the United States.\n\nTesla also faces competition from other companies that are ahead of it in providing robotaxi services, including Waymo, the autonomous vehicle unit of Google parent Alphabet, which has its own service and has partnered with Uber in some cities.\n\nAnd a change in US law is about to remove a $7500 tax credit for buyers of most electric vehicles, which could cause prices and sales of those vehicles to fall sharply.\n\nUS law also recently removed the billions of dollars in penalties that traditional automakers have had to pay if their gas-powered vehicles exceed emissions rules. The way that they avoided those payments in the past was by buying regulatory credits from an EV maker like Tesla. But the payments that brought billions in revenue to Tesla will now vanish.\n\nJohnson said that Tesla's stock price is therefore unlikely to hit the ambitious targets laid out in this Musk pay package.\n\nMusk has also promised a line of humanoid robots that could bring in even more sales than Tesla's car business. (AP)\n\n\"Things are going to get worse for them, not better,\" said Johnson. \"Is Tesla going to go to $8 trillion? Abso-f---ing-lutely not.\"\n\nShares of Tesla (TSLA) were up about 5 per cent in early trading on the news.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/finance/australia-house-prices-forecast-rise/4d279b6b-fd04-4235-b30e-c34c337abebd",
    "title": "Think house prices are bad now? They're about to get much worse",
    "publish_date": "Fri, 05 Sep 2025 05:53:57 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Australians wanting to buy their first home are about to find that already-tricky task even more difficult, with house prices set to rise by as much as $154,000 by the end of next year.\n\nWestpac has forecast that dwelling prices will increase by 6 per cent this calendar year before a further 8 per cent hike in 2026, thanks in part to the Reserve Bank's three recent interest rate cuts.\n\nAccording to Canstar, those increases would see Sydney's median house price rise by a little more than $154,000 between now and the end of next year, taking it up to about $1.67 million.\n\nHouse prices are set to continue rising sharply over the coming months. (Sitthixay Ditthavong)\n\n\"Sydney's median house price could rise by up to $154,000 by the end of next year if house prices rise in line with Westpac's dwelling price forecast,\" Canstar data insights director Sally Tindall said.\n\n\"For those already in the market, that's welcome news for their equity. For those still saving, the deposit hurdle is likely to get a whole lot steeper, not to mention the difficulty in clearing a bank's serviceability test.\n\nSix-figure price rises would also hit Melbourne and Perth if Westpac's forecasts play out, with the Victorian capital joining Brisbane and Sydney in breaking the $1 million median house price barrier. ﻿\n\n\"Melbourne is shaping up as the comeback city in 2026, with double-digit growth on the cards, according to Westpac,\" Tindall said.\n\nREAD MORE: Officer killed in Porepunkah shooting farewelled\n\nLower interest rates, coupled with low supply and high demand, have helped push prices up. (Joe Armao/The Age)\n\n\"This could see Melbourne's median house price go above the million-dollar mark, which for many first home buyers will be a psychological barrier that makes it feel like the goal posts keep moving further away.\"\n\nThe forecasts for price rises have been driven by easing interest rates, as well as the chronic undersupply and high demand that has been plaguing Australia for years.\n\nHowever, while the Reserve Bank is expecting to hand down at least one more cut this year, and potentially another in early 2026, ANZ today warned that the cash rate may be left where it currently stands following stronger-than-expected GDP figures this week.\n\n\"If evidence of consumer spending momentum continues and weakness does not emerge in the CPI or labour market data, the RBA may assess the cash rate as broadly neutral with no further cuts needed,\" the big four bank's head of Australian economics, Adam Boyton, said.\n\nTindall said unexpectedly high rates could throw something of a spanner in the housing price works.\n\n\"You don't have to look too far back to see how quickly market expectations can change when conditions do,\" she said.\n\n\"The danger is, Australians will borrow to the limit, banking on prices continuing to climb. If circumstances change – whether that's interest rates, job security or the economy – it could leave some households overexposed.\n\n\"The more households borrow, the more vulnerable they become to rate rises or shocks to employment.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/small-business-owners-forced-to-use-savings-loans-to-stay-afloat/af15df16-6de7-4f43-99d2-3e78e38a66fa",
    "title": "Businesses like Daniel's are struggling. It could make things more expensive for the rest of us",
    "publish_date": "Fri, 05 Sep 2025 02:39:19 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Australian ﻿small to medium businesses are stuggling, with more than three quarters having faced a cash flow crisis in the past 12 months.\n\nTariffs and a cost-of-living crisis have forced many owners to take out business loans or dip into their own personal savings just to stay afloat.\n\nAnd if nothing changes, it could put ﻿thousands out of business – and hurt everyday Aussies' hip pockets.\n\nDaniel Trkulja, 27, started his business ThreadLAB as a print shop in 2015. (Supplied)\n\nDaniel Trkulja, 27, started his business ThreadLAB as a print shop in 2015 and spent the last decade bulding it into a premium apparel printing business.\n\nHe should be riding the high of a job well done, but the last few years have been tough.\n\n\"A lot of trouble with tariffs and the trade war have come up, business has been tight, ﻿confidence in the market is down,\" he told 9news.com.au.\n\n\"And you're hearing more excuses when it comes to payment.\"\n\nAccording to new data from Airwallex, late payments are costing Australian ﻿small to medium businesses $24,000 annually on average.\n\n﻿Trkulja confessed the uptick in clients paying late or asking for extensions has put financial pressure on him and the business.\n\n\"The biggest killer for cash flow is just getting paid on time,\" he said.\n\nAnd that's provided he gets paid at all.\n\n\"In the last three months, we've had one client go bankrupt with over a million dollars of stock on the way to them, and another client do us for $200,000 because they decided to go bankrupt without telling anyone,\" Trkulja revealed.\n\nThreadLAB is now a premium apparel printing business, but times have been hard lately. (Supplied)\n\nThat kind of loss could quickly run a small to medium business into the ground.﻿\n\n﻿Especially when so many are also struggling with ﻿higher overhead costs due to wage growth, rent and utilities in recent years.\n\nAn Airwallex survey of 500 Australian small to medium business owners and decision-makers﻿ found that more than half had to dip into personal savings to cover ﻿operational costs in the last 12 months.\n\nSome industries have faced more hardship than others, ﻿especially those that are contract based like building and construction.\n\n\"It comes part and parcel for a small to medium business owner to dip in from time to time, but if it's increasing over time and is becoming more and more prevalent, that's concerning,\" Airwallex Head of Sales, SME and Growth Matt Patterson told 9news.com.au.\n\n\"If nothing changes, it's definitely going to be a period of sustained pressure.\"\n\nMore than a third of those surveyed took out business loans to manage shortfalls.\n\nBut for some small to medium businesses it's still not enough, and they're forced to shut up shop.\n\nAirwallex Head of Sales, SME and Growth Matt Patterson. (Supplied)\n\nThe number of businesses ﻿entering insolvency risen sharply over the past couple of years according to the Reserve Bank of Australia (RBA), many of them due to challenging economic conditions.\n\n\"The flow on effects of that will be dramatic to individual Australians through less competition, increased prices, whatever it might be,\" Patterson said.\n\n\"So we need to make sure that we're protecting them [small to medium businesses] and providing as much support as we can to them.\"\n\nTrkulja feels fortunate that his business is established enough to weather these financial challenges, especially with the support of financial technology companies.\n\nBut confessed that, had he faced this hardship earlier in his journey, it might have put ThreadLAB out of business.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/power-line-fault-detection-designed-to-prevent-bushfires/105684514",
    "title": "Device detects power line faults before disaster strikes",
    "publish_date": "Sat, 06 Sep 2025 00:29:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian inventors have developed technology that detects potential power line faults, like the one that sparked a deadly Black Saturday bushfire, before they happen.\n\nCreated by researchers at RMIT University, Early Fault Detection (EFD) has been trialled in Australia and overseas in a bid to prevent a repeat of the nation's worst bushfire disaster.\n\nIND Technology, which commercialised the invention, wants to see it rolled out nationally.\n\nBut there are limitations.\n\nThe Early Fault Detection system listens to radio frequencies on power lines to detect faults. (Supplied: IND Technology)\n\nAhead of the next disaster season, energy providers are weighing up the benefits against the $380 million installation bill.\n\nThe system\n\nOn February 7, 2009, a fire started in Kilmore East, 65 kilometres north of Melbourne, when a faulty power line was brought down in powerful winds on a hot, dry, 46 degree Celsius day.\n\nThe 2009 Victorian Bushfires Royal Commission found the Kilmore East blaze was caused by an ageing power line. (Supplied: Wade Horton)\n\nIt went on to merge with another fire before ravaging Victoria; 173 people died, and more than 400,000 hectares of land was burnt, destroying homes, infrastructure and farms.\n\nThe failure of the power line has been scrutinised by a Royal Commission and was the subject of a $500 million class-action lawsuit.\n\n\"That fire definitely would not have happened if EFD had been installed,\" IND Technology chairman Tony Marxsen said.\n\nTrained as an electrical engineer, Dr Marxsen worked for Victoria's government-owned electricity provider for 30 years before it was privatised in the early 1990s.\n\nHe then worked as a consultant and in academic research.\n\nA house is impacted by the Black Saturday fires at Kinglake in February 2009. (Supplied: April Harrison)\n\nHe said EFD was not connected to the network but listened to it, identifying defects like broken wires or vegetation across the line by the radio frequencies they gave off.\n\n\"It finds problems, locates them and allows the network owner to go directly to the site and fix the problem before it develops into a full-scale network fault,\" Dr Marxsen said.\n\nHe said it could detect the fault within 10 metres of accuracy.\n\n\"Picking up those radio frequency signals at more than one location, we can triangulate exactly where the problem is,\" he said.\n\nAlan Wong , Andrew Walsh and Tony Marxsen lead the IND team. (Supplied: IND Technology)\n\nHe said the idea was to fix the problem before the line broke, which could expose live wires that started fires if they hit power poles or the ground.\n\n\"If you're talking about very high fire risk weather, they always involve strong winds, so that's maximum strain on the wires on the network and that's when they break,\" he said.\n\n\"We find the problem before it happens and once again the utility can go out and fix it and prevent the fire.\"\n\nThe trials\n\nFallen power lines are not the leading cause of bushfires in Australia, but they are a common source of ignition.\n\nEFD was created as a result of the Black Saturday bushfires. (ABC News: Keely Johnson)\n\nThere are several types of power lines, including overhead and underground.\n\nTransmission lines carry high voltages from power generators to substations, which use lower voltage distribution lines to connect homes and businesses to the grid.\n\nEFD technology is designed for single wire earth return (SWER) powerlines, which in Australia are primarily used to distribute power in rural and remote areas, such as Kilmore East.\n\nIn the aftermath of that disaster, the Bushfires Royal Commission recommended Victoria's 28,000 kilometres of SWER lines be replaced.\n\nDistributor Powercor is responsible for 21,000 kilometres of them, which spokesman Jordan Oliver said were protected by several different technologies, including EFD.\n\n\"SWER makes up around a third of the Powercor network,\" he said.\n\nVegetation touching power lines can spark fires. (Supplied: IND Technology)\n\n\" It was rolled out from the 1950s as an efficient and fast way to provide power to remote and rural areas. \"\n\nSeveral electricity providers in other states have either trialled, or intend to trial the technology, including the largest electricity distributor on the east coast, Ausgrid.\n\nIn Queensland, which has about 65,000 kilometres of SWER powerlines, the state's government-owned electricity company decided not to proceed with a rollout.\n\nWhile the devices worked, a spokesperson said the cost to install them outweighed the benefits.\n\nEFD can detect small faults on powerlines that can not be seen by the naked eye. (Supplied: IND Technology)\n\nIn 2020, Endeavour Energy was the first of three energy distributors in New South Wales to trial EFD.\n\nHead of asset management, Edmund Li, said the trial had helped identify deterioration in hard-to-reach locations.\n\n\"The network goes through areas which aren't necessarily on the side of the road,\" he said.\n\n\"It's more difficult if we're purely relying on visual inspection techniques.\n\n\"We may not be able to find some of those issues.\"\n\nWho's paying for it?\n\nMost energy distributors send proposals to the Australian Energy Regulator outlining how they plan to operate, maintain and fund their networks every five years.\n\nThe EFD system uses radio frequencies to find small faults. (Supplied: IND Technology)\n\nMr Li said Endeavour Energy's latest submission included funding for EFD devices on about 1,000 kilometres of their network.\n\n\"We're being judicious in how we invest in our network and these sorts of technologies to provide ongoing benefits to our customers,\" he said.\n\nIn Victoria, network operator Ausnet has 310 EFD devices installed and included $20 million in its proposal for a broader rollout.\n\nPowercor's submission included $13 million to use EFD as part of safety improvements on the SWER network.\n\nLast year, the researchers behind the technology called for a national rollout, which Dr Marxsen estimated would cost about $380 million.\n\nEFD is being rolled out across New South Wales and Victoria. (ABC News: Adriane Reardon, ABC South East NSW: Adriane Reardon)\n\nIn the meantime, he said the technology had been embraced overseas.\n\n\"About 98 per cent of our production goes to North America, the US and Canada, but we are starting now we have installations in Asia and Europe,\" he said.",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/piastri-escapes-with-stewards-reprimand-at-monza-gp/105743126",
    "title": "Piastri escapes with stewards' reprimand at Italian F1 Grand Prix",
    "publish_date": "Sat, 06 Sep 2025 00:13:54 +0000",
    "category": "sports",
    "authors": [],
    "text": "Oscar Piastri has had a scare in first-day practice at the Italian Grand Prix, avoiding a potential grid penalty and escaping with a reprimand after a pit-lane incident at Monza.\n\nStewards investigated Australia's F1 world championship leader after he failed to follow the race director's instructions, leaving his pit box before being given the all-clear following a red flag period during Friday afternoon's second practice session.\n\nPiastri finished with just a reprimand and ended his afternoon, declaring it had been a \"good day\" after he finished fourth quickest in the second session, even though his McLaren teammate and main championship rival Lando Norris were fastest.\n\nPiastri did not take part in the morning session as McLaren took the chance to blood Irish youngster Alex Dunne as part of the team's young drivers commitment.\n\nBut in the second, the Victorian finished 0.181 seconds slower than Norris, who bounced back from crashing out at the Dutch Grand Prix by heading the timesheets with a 1 minute, 19.878 second lap on the \"Pista Magica\".\n\n\"Not doing P1 (practice session one), I had a bit of catching up to do in P2, but I feel like I hit the ground running,\" said the typically unflappable Piastri, who was also behind Ferrari's Charles Leclerc (1:19.961) and Williams's Carlos Sainz Jnr (1:19.974).\n\nThe concern for McLaren occurred when the team released Piastri 19 seconds too early from the pits out into the fast lane before race control had given the drivers official permission to restart following the red flag.\n\nYour guide to F1 and Oscar Piastri Photo shows A young white man in an orange cap and matching racing suit smiles and makes a 'number one' gesture with his right hand Formula 1 is having a moment — and so is Oscar Piastri, the Australian driver who is currently topping the leaderboard. As the race to the championship heats up, now is the perfect time to get up to speed.\n\nMcLaren admitted its mistake, with Piastri telling Sky Sports before being called up in front of the stewards: \"I think we just misjudged and got confused with the messaging and timing system. We went a little bit early but not concerned.\n\n\"It might be a warning or something, but I would be surprised if it's a sporting penalty.\"\n\nHe was right. Mercedes's George Russell and Kimi Antonelli were both handed one-place grid penalties during qualifying at the Bahrain Grand Prix for similar offences, but stewards took into account that Piastri's misdemeanour occurred only in free practice.\n\n\"No significant sporting advantage could potentially be gained as this happened in free practice and therefore we consider a reprimand to the competitor to be appropriate,\" the stewards ruled.\n\nNorris, 34 points behind Piastri in the title race, was delighted to put his engine blow-up in the Netherlands behind him as he led the way.\n\nLike his Aussie teammate, his only concern was a brief problem with their McLaren's right wing mirror.\n\nOf the challenge from the other teams as McLaren seek a sixth straight win, Norris admitted \"it's a little bit close for my liking, but we're not in a bad spot\".\n\n\"We've still got a few things to improve, but it's good we're still at the top of the timings despite that,\" he said.\n\nSeven-times world champion Lewis Hamilton was fifth. Making his first Monza appearance in the hallowed Ferrari red, he had delighted the tifosi in the opening session by leading home Leclerc in a surprise one-two.\n\nAAP",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/dr-peter-allely-warns-wa-emergency-departments-struggling/105736090",
    "title": "Senior doctor warns WA emergency departments run like 'disaster situation'",
    "publish_date": "Sat, 06 Sep 2025 00:05:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "A senior WA emergency department doctor has described his workplace as running in a \"disaster situation\", struggling within a health system which has an \"unhealthy fixation\" on ambulance ramping.\n\nThis winter has exposed deep issues with how Western Australia cares for its sick, with services swamped by demand.\n\nIt has resulted in ambulances spending a record 7,074 hours parked outside hospitals waiting to transfer patients last month and dozens of elective surgeries being cancelled.\n\n\"It's the worst it's been in the 18 years I've been in WA emergency departments,\" WA-based Australasian College for Emergency Medicine President-elect Peter Allely told Stateline.\n\nDr Peter Allely says emergency departments are being run as if in a \"disaster situation\". (ABC News: Keane Bourke)\n\nHe described a \"disheartening\" work environment, with many staff looking for a way out \"and checking their super balance\" with no end in sight.\n\n\"We've almost moved, on some days, from the traditional triage process of seeing people by order of priority to almost like a disaster situation where … we are triaging but in some respects, we're not, we're just sieving and sorting like you would in a disaster situation, where people who have obviously immediate life threats are still getting seen.\n\n\"And I don't want to put anyone off coming to emergency departments, you will still get excellent care if you've got immediate life threats.\n\n\"But it's the group that aren't immediate life threats, aren't obvious immediate life threats, you're getting put in our waiting room, that frighten us the most, because they might reveal themselves as having something horrible wrong with them while they're sitting in our waiting room.\"\n\nRamping 'fixation'\n\nDr Allely also said an \"unhealthy fixation\" on ramping metrics within upper ranks of the health department was putting patients at risk.\n\n\"Because we are getting phone calls on a daily basis to get people off the ramp who aren't fit to be got off the ramp and are being put in the waiting rooms, unsupervised … because there's not the resources to look after them,\" he said.\n\nWA public hospitals recorded a new ambulance ramping record last month. (ABC News: Keane Bourke)\n\n\"And then bad outcomes are happening, like the patient who suffers from dementia who comes in on an ambulance and gets put in a waiting room, even though they're not safe to be put there, and then has a fall and injures themselves.\n\n\"Those things are happening almost daily, I would say, in most emergency departments around the state and those incidents will increase.\n\n\" The risk in our waiting rooms, in particular in the emergency departments, is just rising and rising and rising. \"\n\nWA sets new ambulance ramping record Western Australia again breaks the state record for the amount of time ambulances spent ramped outside hospitals, despite more than 100 elective surgeries being postponed to ease pressure.\n\nThe state government has repeatedly pointed to a worse-than-usual flu season for recent pressures, combined with a growing number of older Australians unable to be cared for by the aged care system.\n\nPremier Roger Cook and Aged Care Minister Simone McGurk travelled to Canberra last week to discuss how to free up the hundreds of hospital beds they say are being taken up by people who should be in aged care, securing a trip west by the federal Aged Care Minister Sam Rae later this month.\n\nMs McGurk is also spearheading a state government move into the aged care space — which is traditionally the responsibility of the Commonwealth — to try and meet that demand.\n\nAgeing concerns\n\nDr Allely said the pressures of caring for an ageing population are only accelerating.\n\n\"The number of over 85s attending our emergency departments are conservatively predicted to increase by over 500 per cent between now and 2050,\" he said.\n\nDr Peter Allely says the risk in emergency departments will continue to rise unless something is done. (ABC News: Keane Bourke)\n\n\"We are just at the beginning of that exponential curve and you've seen how bad the data is from our emergency departments.\n\n\" That's very frightening. Something urgent needs to happen. \"\n\nThose urgent changes are complex, Dr Allely said, but include putting a greater focus on increasing hospital capacity — something he said had seemingly been de-prioritised in recent years, leaving the state \"10 to 15 years behind where we need to be\".\n\n\"All of my colleagues in Western Australia and emergency departments very much long and wish for the premier of Western Australia to be standing in front of a brand new hospital in seven years' time, opening a thousand-bed hospital for us,\" he said.\n\nDr Peter Allely says WA's ageing population will continue to put strain on emergency departments. (ABC News: Keane Bourke)\n\nThe government's only plans for a new hospital is the Women's and Babies Hospital, to replace the ageing King Edward Memorial Hospital.\n\nHospital upgrades\n\nIt also has emergency department upgrades planned, but not funded, at Midland and Royal Perth Hospitals.\n\nAbout $24 million has been allocated to open 60 extra beds at Joondalup Health Campus, with $8.6 million set aside to expand Sir Charles Gairdner Hospital's ICU, in addition to upgrades at a number of regional hospitals.\n\nA shell ward, to be fitted out over the next year, at Joondalup Health Campus. (ABC News: Keane Bourke)\n\n\"We've increased the workforce by 33 per cent, making sure we have doctors and nurses available to stand by the beds in which patients lie,\" Premier Roger Cook said on Friday.\n\n\"We've increased the number of beds since 2021 by 900. That's the equivalent of building a whole new tertiary hospital in just the last four years.\n\nWA patient devastated as complex surgery cancelled day before Photo shows A woman sits in her home, being interviewed A patient caught up in the immense pressure being placed on WA hospitals says her planned surgery being cancelled has put her under significant stress and eroded her trust in the health system.\n\n\"We know it's tough, but my government is up for the challenge of investing in our hospital system, providing diversified ways of providing healthcare and ensuring that we look after the people in our community.\"\n\nDr Allely and Health Consumers Council executive director Clare Mullen support the premier's ambition for increased investment in community and primary care, as well as prevention, to try and ease pressure on hospitals.\n\nMs Mullen pointed to the government's plans for 400 'hospital in the home' beds — which provides acute inpatient care in their homes — as a positive step in that direction.\n\n\"We urgently need to see more investment, and some radical investment, in new models of care, more community-based options and more access, better access, to primary care and community-based care,\" she said.\n\n\"I think we also need some urgent investment in preventative health.\n\n\"The challenge with prioritising investment in prevention is, frankly, the political cycle.\n\nClare Mullen is the Health Consumers Council's executive director. (Supplied)\n\n\"It's a challenge for any government to say we're going to invest in something today that we won't see potential benefit [from] for 15 to 20 years.\"\n\nDr Allely agreed political time frames were getting in the way of progress, leading him to fear what could lie ahead without major changes.\n\n\"You will see ramping figures over 10,000 hours in the very near future and you will see increased risk and increased bad outcomes in the emergency department,\" he said.\n\nLoading...",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/nt-alice-springs-regional-mini-paralympics-wheelchair-basketball/105741394",
    "title": "Alice Springs Mini Paralympics creates 'moments of joy' for athletes",
    "publish_date": "Fri, 05 Sep 2025 23:47:23 +0000",
    "category": "sports",
    "authors": [],
    "text": "A push to find and train budding Paralympians ahead of the Brisbane 2032 Paralympic Games has taken place in Alice Springs.\n\nThe town held its own Mini Paralympics, a day-long event featuring a range of sports including athletics, wheelchair basketball, boccia and badminton.\n\nAlice Springs 14-year-old Quade Stone, who has cerebral palsy, said he loved playing wheelchair basketball and hoped to make it to the Paralympics in seven years' time.\n\nQuade Stone wants to compete for Australia one day. (ABC News: Xavier Martin)\n\n\"It's pretty cool, seeing people [with] disabilities [here],\" he said.\n\n\" It's sort of saying, 'You're not alone in this situation, you've got other people around you to take care of you.' \"\n\nLoading...\n\nTalented athletes were connected to coaching, equipment and local pathways to support their sporting journey.\n\nIt was all part of the Para System Uplift program, which was funded by the Australian government to increase awareness of para sports.\n\nThe one-day event produced moments of joy for participants and organisers. (ABC News: Xavier Martin)\n\n\"The program we get to have in Alice Springs is really exciting,\" Nat Charlton from Paralympics Australia said.\n\n\"Not only do potential participants and athletes in metro regions have access to these programs, but we also can connect through to regional groups as well.\n\n\"[We can] show them what their potential pathway could be.\"\n\nNatalie Charlton says the event provides regional communities with more sporting opportunities. (ABC News: Xavier Martin)\n\nClare Humberstone from the Australian Institute of Sport said the federal government had \"basically doubled\" the funding for para sport in the past two years.\n\n\"We want to have the best games ever at Brisbane 2032, and so we need to find local talent all around the country,\" she said.\n\n\"This is a great initiative to kick start that off here in Alice [Springs].\"\n\nBringing the dream to life\n\nVinod Prasad, from Territory Care and Support Services, said he had been dreaming of a Mini Paralympics in town for years.\n\nVinod Prasad and Lucinda Moody worked together to deliver the Alice Springs event. (ABC News: Xavier Martin)\n\nHe spoke to Lucinda Moody, the NT sport and recreation manager at Reclink, who fought to make that dream a reality.\n\nLooking around the event on Thursday, Ms Moody said she \"had a heart full of pride\".\n\nVolleyball was one of the sports on offer at the Mini Paralympics event. (ABC News: Xavier Martin)\n\n\"If you can imagine sitting in a wheelchair all day, or a mobility device, and the freedom that you get [when you] get out and play sport,\" she said.\n\n\"Sport brings people together, sports gives you team, it gives you friends, it gives you positive mental health, it gives you physical health.\n\n\"It creates moments of joy and that's why we play sport — everybody should have the opportunity to play sport.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/sam-kerrs-womens-super-league-return-delayed/105742430",
    "title": "Kerr forced to wait for Women's Super League return as fellow Matilda shines",
    "publish_date": "Fri, 05 Sep 2025 23:04:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Sam Kerr will have a further frustrating wait to make her return to soccer after 20 long months, but she could savour a match-winning debut from her Matildas teammate Ellie Carpenter while watching from the Chelsea bench.\n\nAfter all the anticipation that the Australian superstar would burst back into action in the Women's Super League opener against Manchester City, it all felt a little anti-climactic as Kerr spent Friday evening (Saturday morning AEST) as an unused substitute at Stamford Bridge.\n\nBut there was nothing anti-climactic about the debut of Carpenter, who proved comfortably the game's outstanding player as she capped her livewire contribution by laying on Chelsea's first goal in the 2-1 home victory over one of their big title rivals.\n\nIt was not the most convincing start from the Blues as they began their bid for a seventh consecutive English title, but Carpenter, signed in the close season from Lyonnes where she had previously played under Sonia Bompastor when the Chelsea boss was at the helm of the French giants, looked a striking addition.\n\nIt was her burst down the right flank and a pinpoint low cross just after the half hour that allowed Aggie Beever-Jones, one of Chelsea's go-to strikers in Kerr's long-term absence with an ACL injury, to slot home the first goal of the new season from point-blank range.\n\n\"She's a world-class player, genuinely one of the quickest players ever, and just laid it on a plate for me,\" enthused Beever-Jones as Carpenter received the player-of-the match award for a performance that featured her putting in six crosses as she added a new dimension to Chelsea with her penetrating runs from wing-back.\n\nCarpenter returned the compliment.\n\n\"Aggie tapped it in, so [she] made me look good,\" Carpenter said.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\n\"It was really nice to create those relationships with the team, being new.\n\n\"I think we worked on those foundations, and we're really gelling as a team.\"\n\nCity, without their own injured Matildas star Mary Fowler, nearly equalised 6 minutes later when Alex Greenwood's left-foot free-kick curler thumped off the crossbar.\n\nThe visitors started brightly after the break too, but when Wieke Kaptein got away from Greenwood down the right in the 64th minute, just as Carpenter had done for the earlier goal, her cross allowed Maika Hamano to drill home Chelsea's second.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nChelsea's Niamh Charles netted an own goal 6 minutes later and, as City pressed for an equaliser, Bompastor decided it was not the right moment to bring on Kerr for her first game since December 20, 2023, when she scored her 99th goal for the club in a Champions League match at Swedish side BK Hacken.\n\n\"She was fit to come in the game. It was my decision not to make that call,\" Bompastor said.\n\n\"Maybe if the game had been 2-0, I would have done something different. But 2-1 where City was trying to push hard to score the second goal, I thought maybe I had other options on the bench.\"\n\nSo Kerr has to be patient to get the chance for goal number 100, her next opportunity surely coming at Aston Villa on September 14.\n\nAAP",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/nicholas-chevalier-mt-abrupt-painting-helps-replanting-grampians/105658064",
    "title": "Clues in 161-year-old painting help restore Grampians' native beauty",
    "publish_date": "Fri, 05 Sep 2025 22:53:06 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "There's an old proverb, its origins rooted in Greek and Indian history, that goes something like \"blessed is he who plants trees under whose shade he will never sit\".\n\nStanding at the foot of the Grampians/Gariwerd National Park, with Mount Abrupt looming large behind him, retired farmer Bill Weatherly offers his own, very Australian, version of the phrase:\n\n\"An old man planting trees, it says something.\n\n\"I just think it's a great pleasure to plant a tree and, yes, it's a statement of hope, I suppose,\" he said.\n\nBill Weatherly has lived most of his life in the Grampians region. (ABC News: Olivia Sanders)\n\nFormerly the president of The Friends of the Forgotten Woodlands, Mr Weatherly continues to volunteer with the group, which, over the past decade, has planted and distributed close to 50,000 trees across Victoria's western region.\n\nIn the bushy plains stretching from the base of Mount Abrupt, a 161-year-old painting is helping to guide their restoration efforts.\n\nNicholas Chevalier's famous 1864 oil painting of Mount Abrupt in the Grampians/Gariwerd ranges. (ABC News: Olivia Sanders)\n\nA landscape painted\n\nOff a gravel road in rural Dunkeld, through three farm gates, and past mobs of sheep, you'll find a large grassy clearing owned by Nature Glenelg Trust.\n\nHere, famed Russian-born artist Nicholas Chevalier sat to observe the landscape and sketch the green plains, the meandering creek, the imposing 400-million-year-old mountain range — before he headed back to his studio to capture the magnificence with oil paints.\n\nRussian artist Nicholas Chevalier was struck by the majesty of the Grampians mountain range. (Supplied: Wikipedia)\n\nThe artist created three versions of the image titled Mt Abrupt, The Grampians c.1864 oil on canvas — the most iconic of which is held by the Hamilton Gallery.\n\nThe gallery's curator, doctor of philosophy Samantha Happé, said Chevalier's realistic approach had made him an important figure among colonial Australian artists, many of whom would paint European-style landscapes, then \"modify\" them by adding bushland flourishes.\n\n\"They'd paint the same techniques and the same palettes and the same imagery as the English landscape, but then they'd throw something a little bit Australian in there,\" Dr Happé said.\n\n\" Whereas Chevalier … would go out of his way to try to actually show Australian trees and Australian scenery as it is. \"\n\nSamantha Happé says Chevalier painted the landscape as it truly was. (Supplied: Samantha Happé)\n\nShe said the striking nature of Chevalier's Mount Abrupt is due to the romantic tradition of painting in which he was working.\n\n\"The German and Russian Romantics believed in the power of the landscape and the emotions that a landscape can create,\" Dr Happé said.\n\n\"The style was very scientific and technical. They had to make sure they got the exact right type of soil, the exact right type of leaf on the tree.\"\n\nEmma Stuart's Mud-dadjug, a new view, is inspired by Chevalier's 1864 painting. (ABC News: Olivia Sanders)\n\nAs part of the Hamilton Gallery's current exhibition, Emma Stuart: One Land, Many Views, which ends on Sunday, September 7, Chevalier's masterpiece is reinterpreted.\n\nStuart's striking work — Mud-dadjug, a new view — depicts Chevalier's landscape in an entirely new way, using Gariwerd sand on wooden panels.\n\nAn exhibition of Emma Stuart's work ends on Sunday, September 7. (Supplied: Hamilton Gallery)\n\nPainting to planting\n\nThe specificity of Chevalier's work has been invaluable to the replanting efforts undertaken by The Friends of the Forgotten Woodlands.\n\n\"The paintings show quite clearly what species was growing in that spot — you've got artistic licence and all that to consider, but it does give a bit of a picture,\" Mr Weatherly said.\n\n\" It validated perhaps what we were trying to do — getting the trees back in the landscape. \"\n\nThe landscape has changed significantly in the past 160 years, with different types of plants and trees becoming more prominent than the colourful banksia, she-oak, and bursaria trees featured in Chevalier's painting.\n\nThe revegetation project is using the 1864 oil painting as a guide to which native species used to grow in the area. (ABC News: Ted O'Connor)\n\nAbout five years ago, the volunteers decided to restore the area to its former glory, with the help of Chevalier himself and his iconic painting.\n\n\"It didn't take many steps to think, well, it'd be interesting to … recreate that image,\" he said.\n\nThe group has now planted 400 banksia , she-oak, and bursaria trees in the area.\n\nTheir work doesn't stop there, though.\n\nThe group also collects seeds and propagates from remnant plant populations, with ecologists then mixing the genetics to establish new populations that can better overcome issues associated with inbreeding and changing environments.\n\nMount Abrupt is a popular destination among hikers. (ABC News: Ted O'Connor)\n\n'We're lucky to be here'\n\n\"It's been a great pleasure for me after my farming life to be part of something which I hope is worthwhile,\" Mr Weatherly said.\n\n\"Sharing that experience with other people who are like-minded — it's a real pleasure.\"\n\nStanding in the same spot where Chevalier once stood, Mr Weatherly says he often reflects on the beauty of the environment in which he has spent most of his life.\n\nBill Weatherly says planting trees is a \"statement of hope\". (ABC News: Olivia Sanders)\n\n\"We're lucky to be here … for these magnificent red gums, the river down below us, the banksias with their honeysuckle flowers ... we can still hear the pardalote birds in the trees and cockatoos,\" he said.\n\n\"It's still an attractive landscape, but what a rich landscape this would have been a couple of hundred years ago.\n\n\"And how striking that mountain is. It just stands over us. This is a pretty good spot to be.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/voluntary-assisted-dying-brings-joy-to-hilary-webster-last-days/105729964",
    "title": "Clarity in the face of death brings unexpected joy",
    "publish_date": "Fri, 05 Sep 2025 22:42:55 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Hilary Webster did not expect she would enjoy the last weeks of her life.\n\nBut after receiving a devastating diagnosis in July, she's making the most of every day.\n\nAbout six weeks ago, the 68-year-old was diagnosed with an aggressive primary central nervous system lymphoma in her brain, and was told she had a very low chance of survival.\n\nDoctors said patients with her particular form of cancer usually only live for about five weeks after being diagnosed.\n\nMs Webster knows she is already on borrowed time.\n\n\"I knew that on day one I would be looking at palliative care,\" she said.\n\nAs she lives on her own, Ms Webster has always planned for unexpected disasters.\n\nBut this disaster prompted a new plan.\n\nShe decided to forgo treating the cancer and register for voluntary assisted dying.\n\nLoading...\n\nDespite the grim reality of accepting death, Ms Webster told 702 ABC Radio Sydney she had found peace and felt she was now in control of the end of her life.\n\n\"When this came along and there was a very low rate of survival, it was easy for me to decide on end-of-life care,\" Ms Webster told Mornings show presenter Hamish Macdonald.\n\n\"Because I didn't really have a choice … I had to face either incredible pain or short-term death.\n\n\"Once you make the decision to go with short-term death, it's OK.\"\n\nMs Webster says she is not trying to convince anyone to make the same decision as her, but that it is important to have it as an option.\n\nHilary Webster says she has lived a wonderful and fulfilling life. (Supplied: Hilary Webster)\n\n\"I've got a substance I can take at any time, and that's terrific, and it's legal,\" she said.\n\n\" I'm not saying everybody should do it. But for me, in my situation, it's very powerful. \"\n\n'Like being at your own memorial'\n\nMs Webster announced her decision on social media, where she asked her friends to raise a glass to her instead of pitying her.\n\nMs Webster, who grew up in Tamworth and worked as a teacher in Sydney for 20 years, said her post brought well-wishes from many people she had lost contact with over the years.\n\n\"I thought I was an OK teacher. I thought I got on well with people — but the outpouring of emotion was really something else,\" she said.\n\n\"All these people came out and said, 'You taught me how to do this' or, 'You were an inspiration to do that, and I always looked up to you.' And that was the kind of [effect] I didn't realise I had.\n\n\" It was like being at your own memorial service. Nobody gets this validation when they're alive. \"\n\nHilary has split her money between her siblings, including her sister Anne (right), and her nieces. (Supplied: Hilary Webster)\n\nFeeling in control\n\nMs Webster says her decline could be gradual or sudden, but she feels relieved that she will be in control when the time comes to end her life.\n\n\"It could be in days and it could be in weeks,\" she said.\n\nBut her death will be at a time of her choosing.\n\nIf you or anyone you know needs grief support: Griefline: Phone support for all Australians Monday to Friday and 24/7 online forums. Call 1300 845 745 from 8:00am to 8:00pm AEDT\n\nfrom 8:00am to 8:00pm AEDT Kids Helpline: 24/7 phone support and WebChat for young people aged between five and 25. Call 1800 551 800\n\nHeadspace: Centres for young people in each state and territory or check out headspace for online or phone support\n\nLifeline: 24-hour support for all Australians on 13 11 14\n\nVoluntary assisted dying became legal in New South Wales in November 2023.\n\nTo access it in NSW, a person must have an illness or medical condition that is advanced, progressive or likely to cause death within six months.\n\nThe applicant must also show they are of sound mind.\n\nThe process involves four stages of approval, including sign-off from the Voluntary Assisted Dying Board, which comprises five legal and medical practitioners.\n\nIn the first seven months after voluntary assisted dying became legal in NSW, 1,141 people in the state made a first request to access the process.\n\nIn total, 398 people passed away as a result of assisted dying over that period.\n\n'I could find out what they spent it on'\n\nIn the six weeks since she was diagnosed, Ms Webster has been working out how to pass on her money.\n\nShe has split her $600,000 in superannuation and savings among her three nieces and three siblings, on the condition they don't use it on their mortgage.\n\nLoading Instagram content\n\nOne of her sisters says she will travel around Australia in a campervan, while her brother has bought a new motorbike.\n\nOne of her nieces has told her she will have a baby because she can now afford to do so.\n\n\"Because I knew I was going to die, I could give them the money,\" Ms Webster said.\n\n\" They could say thank you. I could find out what they spent it on. \"\n\nMs Webster says she is taking each day as it comes and starting each day by doing a daily Wordle to test her faculties.\n\nShe says using voluntary assisted dying is not for everyone, but she is glad to have the choice.\n\n\"I don't have children, which means I don't have that … commitment to staying on,\" she said.\n\n\"Everybody's case is different, and everybody has different circumstances.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/great-granddaughter-finds-postcard-from-america-years-later/105735674",
    "title": "A funky stamp led Georgia to buy an old postcard. She says it was fate",
    "publish_date": "Fri, 05 Sep 2025 22:29:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "There was nothing particularly noteworthy about the black and white postcard that occasional postcard collector Georgia Curry found while rummaging through a box at an op-shop.\n\nHad she read the cursive note on the back, she may have seen a clue to what has become a 79-year-old mystery she still can't quite figure out.\n\nBut, at the time, she didn't read the postcard. Instead, it was the old George Washington one-cent stamp that caught her attention.\n\nGeorgia Curry knows it might be old-fashioned, but she still loves putting pen to paper and writing letters. (ABC News: James Tugwell)\n\nMs Curry said the postcard itself featured \"a very boring, black and white photo of the Massachusetts Institute of Technology\".\n\n\"I didn't even know what it was when I bought it,\" she said.\n\n\"Nothing jumped out at me. It's just beautiful handwriting.\n\n\"I saw the date was very old — 1946.\n\n\"It's so bizarre I even took it home.\"\n\n'It blew my mind'\n\nThe Canberran considers herself an old-fashioned letter writer, who occasionally posts used postcards to friends and family for enjoyment.\n\nSo it was only when she read the postcard later, that Ms Curry noticed the name 'Ruge' in the address — her mother's maiden name, descended from American relatives.\n\nMs Curry sometimes flicks through old psotcards to pick out some to send to friends. (ABC News: James Tugwell)\n\nEventually, Ms Curry was able to confirm that the postcard had been sent by her great-aunt to her great-grandmother almost 80 years ago when they were both living in America.\n\n\"It blew my mind,\" Ms Curry said.\n\n\" I lost my nut. I was having kittens, going 'are you serious?' \"\n\nThe postcard discusses Ms Curry's great-uncle, who worked at the institute pictured on the front.\n\nThe old postcard had a black and white picture of the Massachusetts Institute of Technology on the front. (ABC News: James Tugwell)\n\nA mysterious journey\n\nExactly how the postcard came to sit in an op-shop in Canberra is a mystery.\n\nMs Curry's great-grandmother — who received the postcard — did come to Australia by ship sometime in the mid-1900s to visit her grandchild, Ms Curry's mum, in Minlaton, South Australia.\n\nMinlaton is 1,300 kilometres from Canberra.\n\nIt was only when Ms Curry took it home that she recognised her mother's maiden name in the address of the postcard. (ABC News: James Tugwell)\n\n\"It does my head in. How did it get to Australia? How did it get to Canberra? How did it get here?\" Ms Curry said.\n\n\"I've been trying to go through all the scenarios in my head.\n\n\"Somehow it found its way here.\"\n\nMs Curry's best theory is that the card was brought overseas by her great-grandmother to show her Australian family a photo of the institute and tell them about the American side of the family.\n\nNow it offers Ms Curry a small snapshot into the life of her ancestors, 79 years ago.\n\n\"Someone, in the same handwriting, had written 'I live here' at Massachusetts,\" Ms Curry said.\n\nOn that same day at the same op-shop, Ms Curry saw another postcard, with a map of America on it.\n\nShe didn't buy it and hasn't been able to find it again, but she now believes that postcard was also brought out to Australia by her great-grandmother.\n\nOn that same visit to the op-shop, Ms Curry found another postcard she now believes was also sent to her great-grandmother. (ABC News: James Tugwell)\n\n\"It was meant to be,\" Ms Curry said.\n\n\"For all these things to come together in permanent alignment — that I came in here at the exact right time when this was just sitting here in a pile of postcards, that I even took it home, that I had the curiosity to send it to my mum.\n\n\" It's a well-travelled postcard. Two laps of the globe for just one cent. \"\n\nA golden bygone era\n\nPresident of the Australian Postcards Society, David Figg, said Ms Curry's find was quite remarkable.\n\n\"I've heard of coincidences like that before, but they don't happen very often,\" he said.\n\n\" If an item could talk, it could tell you exactly what happened to it. But it can't — as to where it went and how it got there, who knows? \"\n\nMr Figg said the golden era of postcards was during the late 1800s to early 1900s, but that there were still many collectors around.\n\nDavid Figg (right) judging a postcard exhibit in Finland. He says the golden era of postcards is over. (Supplied: David Figg)\n\nThere are websites in Europe that have more than 50 million postcards for sale at any one time.\n\n\"Pick a subject and you'll find it on a postcard,\" Mr Figg said.\n\n\"But they've basically had their day.\"\n\nHe laments the loss of something tangible that are connected to memories.\n\n\"Jump forward another 80 years and [stories like Ms Curry's] are not going to happen because postcards won't be around,\" he said.\n\n\"You lose the nostalgia of it.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/future-of-tasmanian-skiing-destination-ben-lomond/105677780",
    "title": "Snow guns prove Ben Lomond ski field 'very viable' as park considers future",
    "publish_date": "Fri, 05 Sep 2025 22:14:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "Like many farmers, Ben Mock wants more water.\n\nBut rather than pump it on crops or pour it into troughs, he would spray it through freezing alpine air.\n\nIn the right conditions, he can turn a rocky mountain into a ski field.\n\n\"We see ourselves as snow farmers,\" Mr Mock said.\n\n\"With more snowmaking, we'll be able to open up more terrain, have more snow on the ground and have a longer season as well.\"\n\nLoading Instagram content\n\nBen Lomond National Park, about 50 kilometres east of Launceston or 200 km north of Hobart, is home to Australia's most southern commercial ski field.\n\nMr Mock, the director of Ben Lomond Alpine Resort, said the arrival of new snow machines two years ago sent tourism soaring.\n\nHe said sales were up 120 per cent this winter, after jumping 280 per cent in 2024.\n\nMr Mock says the ski field is \"very viable\". (ABC News: Emily Smith)\n\nEven on a Monday at the end of the season, skiers like Brian Yu, from Taiwan, were on the slopes.\n\n\"[It's] beautiful. I love it,\" Mr Yu said.\n\nBrian Yu says the ski slope is \"beautiful\". (ABC News: Emily Smith)\n\nDan McKay, from the Rovers Ski Club, had skied \"about 170 kilometres\" this year.\n\n\"I'm from Hobart, so I come up every Friday and go home every Monday,\" he said.\n\nThe mountain's other commercial operator, Ben Lomond Snow Sports, said visitation had been \"unprecedented\".\n\n\"It's been an awesome year,\" operations manager Abel Pickering said.\n\nBen Mock says almost 50 staff worked at his business this year. (ABC News: Emily Smith)\n\nThe boom comes at a critical juncture for the national park, with the state government set to write its first new management plan in almost 30 years.\n\nBoth operators hope it will lead to more snowmaking.\n\nBut others say the practice takes an environmental toll and should be questioned in the face of climate change.\n\nSki field operators at Ben Lomond National Park had a busy winter season. (ABC News: Hayden Smith)\n\nSnowmaking 'very viable'\n\nDespite hosting skiers for almost a century, Ben Lomond has long struggled for recognition among Tasmania's spectacular national parks.\n\nSnow-making won't make ski field viable in face of climate change, report finds Photo shows Snow man near a ski field. The economic viability of government money being spent to assist snow-making efforts at Tasmania's only commercial ski field is questioned in a new report that says climate change must inform investment decisions.\n\nMr Pickering said he spent most of his childhood never knowing it existed, despite growing up an avid skier and snowboarder in Hobart.\n\nA 2023 state government-commissioned report said unreliable snowfall \"challenges the commercial viability of operations\", with suitable snowmaking hours set to halve by 2050.\n\nIt recommended against funding snowmaking infrastructure as it would \"not provide a positive economic benefit to the Tasmanian economy\" due to high costs of power and water, and increasing climate change impacts.\n\nYet Mr Mock said his company saw immediate pay off after it bought four snow guns the same year.\n\nBen Lomond National Park is 50 kilometres east of Launceston, Tasmania. (Parks Tasmania: Dan Broun)\n\n\"It's viable. It's very viable,\" he said.\n\n\" We wouldn't be here if it wasn't. \"\n\nMr Mock plans to invest between $500,000 and $1 million next season, by doubling rental equipment and buying at least two more snow guns.\n\nEach of the commercial operators has four snow guns, to make snow out of cold air and water. (ABC News: Hayden Smith)\n\nEventually, he would like to install new T-bar lifts, upgrade diesel generators and expand snowmaking onto southern slopes.\n\nMr Pickering's company also operates four snow guns and hopes to work them harder in future.\n\nBut their plans hinge on securing better access to water through new storage infrastructure, such as tanks, pumps and dams.\n\nWater infrastructure needs approval\n\nThe Tasmanian government will consult stakeholders about the new Ben Lomond Management Plan over the coming months.\n\nMany tourists rely on shuttle buses to access the Ben Lomond plateau in winter. (Supplied: Dane Liepins)\n\nTasmania's Parks and Wildlife Service said the 2023 study would inform the new plan, which advised against funding water or power infrastructure for snowmaking.\n\nMr Mock hopes the position will shift in light of their success.\n\n\"If not, we're happy to fund that ourselves,\" he said.\n\nBut any new water storage infrastructure would require sign off from Tasmania's Parks and Wildlife Service.\n\nSkiers enjoy the tail end of the snow season at Ben Lomond National Park. (ABC News: Hayden Smith)\n\nTasmanian Parks Minister Nick Duigan said the management plan would consider the future of water storage facilities and the environmental impact.\n\nConcerns about snowmaking\n\nNick Sawyer is the president of the Tasmanian National Parks Association, a not-for-profit that advocates for the protection of the parks.\n\nHe is firmly against the idea of adding more snow machines.\n\nNick Sawyer doesn't want snowmaking to expand at Ben Lomond. (ABC News: Kate Nickels)\n\n\"It just seems wildly optimistic in the time of global warming to be trying to develop an area that's only ever been a marginal ski resort into a slightly less marginal ski resort,\" he said.\n\nHe said the association believed the practice used too much power and water, and would require extra infrastructure.\n\nBen Lomond National Park is home to the most southerly commercial ski field in the country. (Supplied: Udesh Madhusanka Photography)\n\nGriffith University Professor Catherine Pickering, an alpine ecosystems expert, said some water used for snowmaking would return to the environment when it melted.\n\nBut she said up between 7 and 75 per cent could be lost through evaporation and sublimation.\n\n\"It depends on things like wind speed, air temperature, relative humidity,\" Professor Pickering said, noting the wide variance.\n\nShe said taking water from dry alpine areas could also heighten bushfire risk.\n\nMany want to see more investment in hiking trails around Ben Lomond National Park. (Supplied: Glenda Williams)\n\nProfessor Pickering said the community should consider the risk of stranded assets, as climate change would put commercial infrastructure in national parks under threat.\n\nShe warned this could leave taxpayers liable and pointed to shuttered Great Barrier Reef resorts as an example.\n\n\"It is going to be an issue with ski resorts and that has been increasingly found overseas,\" she said.\n\nCommercial operators at Ben Lomond National Park plan to offer much more rental equipment next season. (ABC News: Emily Smith)\n\nBut Mr Mock said expert predictions around the industry's future often failed to reflect what he saw on the ground.\n\nHe said many others were optimistic, with Australia's ski field operators investing millions in recent years.\n\n'A year-round destination'\n\nThe Tasmanian government has allocated $2.8 million to the park over four years to prepare the new management plan and transform it into a \"year-round destination\".\n\nJacob's Ladder is the only road to the Ben Lomond ski field. (ABC News: Emily Smith)\n\nAlthough it is often called \"the most challenging road in Australia\" and is the only route to the ski field, there are no plans to alter the famous Jacob's Ladder, as gravel suits the alpine conditions.\n\nBut there are plans to replace and improve the lookout over it.\n\nMost parties agreed upgrades to the park's walking tracks should be a priority.\n\nAbel Pickering is operations manager of Ben Lomond Snow Sports. (ABC News: Emily Smith)\n\n\"There's a really great opportunity here for walkers and hikers,\" Mr Pickering said.\n\n\" We have really unique flora and fauna up here and I think Tasmanians deserve to see it and deserve access to it. \"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/us-open-carlos-alcaraz-beats-novak-djokovic/105742428",
    "title": "Alcaraz puts an end to Djokovic's dreams at US Open",
    "publish_date": "Fri, 05 Sep 2025 22:10:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "Novak Djokovic says it is too soon to say whether he will play a full grand slam season next year, as he feels the strain of his 38 years amid the newfound dominance of Jannik Sinner and Carlos Alcaraz.\n\nThe 24-time major winner lost to second seed Alcaraz 6-4, 7-6 (7/4), 6-2 in the US Open semifinal on Friday — the first time since 2017 that he has failed to reach a major final and the latest sign that his best days are behind him.\n\n\"I'm happy with my level of tennis but, you know, it's just the physicality of it,\" said Djokovic, who lifted the last of his four US Open titles two years ago.\n\n\"It will be very difficult for me in the future to overcome the hurdle of Sinner, Alcaraz, in the best-of-five on the grand slams. I think I have a better chance [in the] best of three, but best of five, it's tough.\"\n\nThe seventh seed's showdown with the Spaniard 16 years his junior on Friday was billed as the hottest ticket in New York, where a rapt, celebrity-packed Arthur Ashe Stadium urged on the Serb two decades after his Flushing Meadows main draw debut.\n\nHe put up a reasonably clean performance, pulling out a few nifty tricks at the net with his trademark creativity, but could not match his opponent's intensity.\n\nThe 22-year-old Alcaraz hit 30 winners to Djokovic's 15 and seemed to have the answers at key moments.\n\nOnce Djokovic failed to win the second set tie-break to level the match, it was only a question of when.\n\nA forehand error from Djokovic ended the match after 2 hours and 23 minutes.\n\n\"I'm not giving up on Grand Slams,\" said Djokovic, who lost to Sinner in the Wimbledon and Roland Garros semis after retiring in his semifinal clash with Alexander Zverev in the Australian Open this year.\n\n\"I'm going to continue fighting and trying to get to the finals and fight for another trophy at least. But, you know, it's going to be a very difficult task.\"\n\nNovak Djokovic spoke of the difficult physical nature of grand slam tennis after his loss to Carlos Alcaraz, and did not guarantee he would play the Australian Open in 2026. (AP: Seth Wenig)\n\nHis next stop on the ATP Tour will be in Athens but Djokovic said it was too soon to say whether he would play at Melbourne Park next year.\n\n\"At least at this stage of my career, I mean, I'm not thinking that far,\" he told reporters. \"I still want to play grand slams, grand slam season, full grand slam season next year. Let's see whether that's going to happen or not.\"\n\nThe second-seeded Alcaraz’s victory means he will face either world number one Jannik Sinner or 25th seed Felix Auger-Aliassime for the championship on Sunday.\n\nAlcaraz is seeking his sixth major title and second at Flushing Meadows. He beat Sinner at the French Open in June and lost to his rival at Wimbledon in July.\n\nAP/Reuters",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/giorgio-armani-simple-glamorous-designs-women-beautiful/105729572",
    "title": "Armani's philosophy of comfort and confidence sparked a style revolution",
    "publish_date": "Fri, 05 Sep 2025 22:00:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Such a deceptively simple act. Such a revolution in style.\n\nWhen the Italian fashion designer Giorgio Armani ripped the lining out of a man's jacket — and took the bulky shoulder pads with it for good measure — he created a look and a movement in fashion to which almost every designer of business, street, evening and casual wear still owes an eternal debt.\n\nThe shoulders that slip elegantly down the arm, lengthening the impression of the body; the linen that reveals the beauty of its texture by being released from its binding. The unbuttoned jacket of fine merino wool revealing something as shockingly casual as a t-shirt beneath. The guys from Miami Vice knew the power of this.\n\nDesigner Giorgio Armani, pictured here in September 2018, had women's backs. (AP: Luca Bruno)\n\nThat unorthodox, but brilliant juxtaposition of textures, of \"high\" and of \"low\" styles, became his hallmark, and for a young suburban girl like me his clothes became a touchstone of style. His definition of relaxed elegance, an unstructured sense of style, defined the 80s and 90s.\n\nGiorgio Armani, the shy son of an office clerk for the local Fascist party in northern Italy, has died at the age of 91, after missing several of his last shows due to illness. He was the sole shareholder of his vast fashion empire of fashion brands, perfume, homewares, hotels and more, and one of the very few to refuse to sell to the rapacious fashion conglomerates.\n\nFashion giant Giorgio Armani dies aged 91 Photo shows Giorgio Armani, a man with white grey hair and tan skin wearing a grey long sleeve shirt, smiling. The Italian founded a fashion empire that became synonymous with elegance and style.\n\nI have loved this designer since I first encountered him as a teenager, when I saw Diane Keaton accept her Oscar for Annie Hall, in a louche but elegant Armani suit and realised, with a shiver, that women didn't have to be done up in lurex and spangles to look sexy and beautiful.\n\nI remember first seeing one of his now-talismanic runway looks — a soft, cashmere sweater teamed with an extravagant evening skirt of silk or taffeta — and deciding for all time that this combination of casual and formal was the height of style. I still think it is. Push those knitted sleeves up and you've nailed the Armani look.\n\nArmani had our back\n\nIt's impossible to overstate the importance of the Armani suit for a woman, both the real thing and every label that followed in his path.\n\nFrom Gianni Versace to Jil Sander to here in Australia, where Carla Zampatti once spoke to me about the influence of Armani's unstructured elegance on her work. If you couldn't afford Armani as a young woman, you bought Zampatti's beautiful wool crepe designs and felt the direct line of his influence.\n\nArmani's high couture designs under the label Armani Privé were essays in beauty. (AP: Lewis Joly)\n\nDeborah Nadoolman Landis, the chair of the David C. Copley Center for Costume Design at the University of California, Los Angeles, told the New York Times that in the 60s, all the women of her generation were wearing jeans: \"But where do you go from Woodstock? How do you professionalise that look when those women start entering the work force? You professionalise it by wearing a feminised suit from Armani.\"\n\nA pair of long, elegantly cut shorts would inevitably appear in many of Armani's women's collections, sometimes culottes, sometimes even alluring bloomers, and while I imagine not many women were bold enough to try them, they made a point: you can dress comfortably and still be stylish. Armani had our back.\n\n(I fell for it one year and bought a pair of Armani black silk taffeta bloomers, cut long and tapered to the knee. It might be time to steel myself and drag them out again.)\n\nGiorgio Armani with Arnold Schwarzenegger and Maria Shriwer in Milan in 1998. (Reuters)\n\nIt's always been very clear to me who were the designers that really appreciated and cared for women, and those who I suspected didn't. It wasn't about their success: the French designer Christian Lacroix had a phenomenal career, despite what I always saw as a deep misogyny in designs that made women look foolish and absurd.\n\nBut the designers who put care into making women feel beautiful and effortless, who did not use women as reluctant frames for an exaggerated and sometimes nasty sense of femininity, were the ones I loved.\n\nThe ingenuity of a true designer\n\nArmani was the greatest exponent of this. His later high couture designs under the label Armani Privé were essays in beauty, with one breathtakingly lovely piece after the other, sloping down the runway in easy forms of column dresses, long skirts and lush blouses, velvets and draped trousers and the kind of embellishment that would make the wearer feel, for once, that they lived in pure glamour.\n\nHe also had the ingenuity of a true designer. I've never known quite how he does it, but he is the creator of a black velvet of such astonishingly deep pigment, as seen on Australian actor Cate Blanchett this week in Venice, that it looks like it could trap and hold gravity and light. And there is little that makes a woman feel more elegant than a classic black velvet outfit.\n\nLoading Instagram content\n\nArmani was regarded by some as too conservative, and repetitive with his limited palette of colours and styles. But as the notion of \"quiet luxury\" made a comeback in recent times, simple, well-cut designs by fashion favourites like The Row and Phoebe Philo can be seen as walking clearly in his path.\n\nArmani always said that his philosophy was \"to help women and men feel comfortable and confident through the clothes they wear.\" I think that's all I need to remember as I pull on that pair of glamorous shorts and walk like \"Gio\" has dressed me himself.\n\nArmani's definition of relaxed elegance, an unstructured sense of style, defined the 80s and 90s. (Reuters: Chris Helgren)\n\nThis weekend, apart from celebrating the dad in your life, you can read about beloved musician Ben Lee, and do read my chat with award-winning film composer John Powell.\n\nHave a safe and happy weekend, and here's some new music from Vance Joy. This might work well as your weekend soundtrack. Go well.\n\nVirginia Trioli is presenter of Creative Types and a former co-host of ABC News Breakfast and Mornings on ABC Radio Melbourne.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/calls-for-charles-bonnet-syndrome-diagnostic-guidelines/105679368",
    "title": "Rare condition of visual hallucinations affects people with vision impairment",
    "publish_date": "Fri, 05 Sep 2025 21:56:25 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Bernadette Glass said her \"biggest fear\" was not being believed when she started having visual hallucinations three years ago.\n\nThe 74-year-old retiree lives with glaucoma and said she saw disembodied faces, dogs and people in military uniform in her home.\n\n\"It wasn't in the least bit frightening,\" she said.\n\n\"I knew deep down that whatever I was going through, it was not a psychiatric illness.\"\n\nMs Glass said she was \"too frightened\" to tell her GP, and after six months of searching for answers online, she self-diagnosed with Charles Bonnet Syndrome.\n\nWhen she talked to her ophthalmologist about the condition, she said she was dismissed.\n\n\"All he says to me is, 'It's a very rare condition,' and that was it,\" she said.\n\n\"There isn't much in the way of education that was given to me, so you're left to … look it up yourself.\"\n\nScot Muirden wants universal guidelines to diagnose and treat Charles Bonnet Syndrome. (Supplied)\n\nScot Muirden, director of the Charles Bonnet Syndrome Foundation Australia, said the condition describes the \"co-existence of two visual worlds\" for people living with a vision impairment.\n\n\"They may be experiencing areas where there's blurriness, other areas of the visual field they can't see at all,\" he said.\n\n\"Then suddenly … phantom images will be superimposed on that baseline.\"\n\nFluorescent hair and storm clouds\n\nAccording to Mr Muirden, Charles Bonnet Syndrome hallucinations are colourful and detailed, but people \"rapidly\" understand what they're seeing is not real.\n\nHe said hallucinations commonly involve patterns and geometric shapes, as well as fully formed animals, vehicles, buildings and landscapes.\n\nVicky Hamilton said she has experienced visual hallucinations for years. (ABC News)\n\nGriffith University student Vicky Hamilton said she spent a decade searching for answers to her visual hallucinations.\n\n\"If I looked at people, their hair would change into very fluorescent colours,\" she said.\n\n\"I'd have storm clouds just appear in the sky even though it was a beautiful, clear day.\"\n\nShe said tests eventually revealed a brain aneurysm was pressing on her optic nerve, following an assault she experienced two decades ago.\n\nWhile one doctor agreed her symptoms aligned with Charles Bonnet Syndrome, she said another downplayed her concerns.\n\n\"She dismissed my visions, claiming, 'You are seeing them because you want to',\" she said.\n\n\"Before discovering the aneurysm, another doctor trivialised my symptoms by suggesting I watch a movie to feel better.\n\n\"I felt that he did not believe me.\"\n\nVicky Hamilton says she received mixed responses from doctors about her visual hallucinations. (ABC News)\n\nShe said discovering Charles Bonnet Syndrome made her visual hallucinations seem \"less scary\".\n\n\"It can be very beautiful too,\" she said.\n\nMs Hamilton said while her brain aneurysm had fully healed and her vision had improved, she still saw floating colours.\n\nBoth Ms Hamilton and Ms Glass said self-diagnosis brought great relief, after years of searching for the cause of their visual hallucinations and being turned away by numerous doctors.\n\nBut both felt frustrated doctors could not give them clear answers, instead dismissing their concerns.\n\nCondition is under-reported\n\nCharles Bonnet Syndrome was first described in the 18th century by Swiss scientist Charles Bonnet, but the term wasn't officially coined until the 1930s.\n\nAccording to Mr Muirden, a lack of awareness was causing a rise in self-diagnosis and misdiagnosis.\n\n\"Most [people] have never heard of CBS,\" he said.\n\n\"That's why it's so under-reported, because the patients are terrified to talk about it, and the medical practitioner is not … asking about it.\n\n\"They're not screening for it. They're not enquiring whether [patients] may be showing the symptoms.\"\n\nMeri Vukicevic says Charles Bonnet Syndrome was \"very under-reported\". (ABC News: Peter Drought)\n\nLa Trobe University Associate Professor of orthoptics Meri Vukicevic said the condition was \"very under-reported\" and under-recognition was common.\n\n\"The gap is big enough that RANZCO [Royal Australian and New Zealand College of Ophthalmologists] explicitly warns about it and recommends proactive screening,\" she said.\n\n\"Patients … are very reluctant to speak to anybody about it because of fear of being labelled insane or psychotic, which they aren't.\n\n\" They are hallucinations in psychologically normal people. \"\n\nMr Muirden said he was calling on peak medical bodies to create universal, evidence-based guidelines to diagnose and treat Charles Bonnet Syndrome, because none currently exist in Australia or internationally.\n\n\"This could cut out months, even years of unnecessary anxiety, suffering and silence that so many in the CBS world go through,\" he said.\n\nMs Vukicevic agreed guidelines for diagnosis were \"very important.\"\n\n\"The eye healthcare practitioners would have a large role to play here,\" she said.\n\n\"We could possibly all band together and put together some guidelines that would be of benefit to all of our patients.\"\n\nA spokesperson said RANZCO had developed a position statement on Charles Bonnet Syndrome in 2023, to provide guidance on the \"diagnosis, treatment and management\" of the condition.\n\nMs Vukicevic said the statement was the \"nearest thing\" to a guideline eye health professionals in Australia could use, but they weren't routinely screening their patients for hallucinations.\n\n\"I am not sure how frequently this position statement is being accessed by eye health practitioners,\" she said.\n\n\"I suspect not very often.\"\n\nTheo Blue says more awareness about Charles Bonnet Syndrome is needed. (Supplied: Theo Blue)\n\nA recent meta-analysis by Brain Research Bulletin of 49 Charles Bonnet Syndrome studies found the condition affects about 10 per cent of the vision impaired community globally.\n\nCanadian peer-support worker Theo Blue lives with glaucoma and said Charles Bonnet Syndrome was \"very manageable\", but elderly people may feel more vulnerable.\n\n\"Losing my vision is all I know,\" they said.\n\n\"It can be very jarring to have this come up … later in life, losing their vision for the first time.\n\n\"It's really important for the elderly and their doctors to be aware of what CBS is.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-06/brisbane-city-council-green-space-buyback-land-scheme/105728848",
    "title": "Hundreds of flood-prone properties bought back, opening more green space",
    "publish_date": "Fri, 05 Sep 2025 21:06:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Three years after a post-flood voluntary home buyback scheme was rolled out in south-east Queensland, dozens of hectares of new open spaces have been created.\n\nIt's raised the question of what could, and should, be done with those now-empty blocks.\n\nSince the 2022 floods, the Brisbane City Council has acquired 293 properties through the state and federal government-run program.\n\nThat adds up to more than 20 hectares of now-public land across the city, while surrounding councils have also acquired dozens of hectares themselves.\n\nCatherine Uroda decided to stay in her Oxley home after the floods. (ABC News: Mark Leonardi)\n\nOne of the suburbs with the highest number of buybacks is Oxley in the city's south, where Catherine Uroda has lived with her husband and their two daughters since 2008.\n\nTheir family home was hard hit by the devastating 2011 floods and was again inundated in 2022.\n\nMs Uroda's street in Oxley was hard hit in 2022. (Supplied: Catherine Uroda)\n\n\"In 2022, I woke up about three o'clock in the morning and saw lots of water in the street and got a huge shock,\" Ms Uroda said.\n\n\" I woke my husband up and we frantically moved everything from our basement downstairs to try and save as much as we could. \"\n\nMs Uroda's home was flooded in 2022, prompting a re-think of storage. (Supplied: Catherine Uroda)\n\nMs Uroda's family made some changes to prepare for future floods but ultimately decided to stay in their Oxley home, rather than applying for a voluntary resumption through the state and federal government's buyback scheme.\n\nHouses used to stand in this spot. (ABC News: Jack McKay)\n\n'Big change to the community'\n\nOthers in her street moved on and sold their homes through the buyback program, with the land now owned by the council.\n\nIt means there are big patches of open space and green grass where houses once stood.\n\nBefore: The suburb of Windsor, seen from the air in 2022. . . After: And the same area in 2025. (Supplied: Brisbane City Council) . . Instructions: Use left and right arrow keys to control image transition Before and after images SLIDE The suburb of Windsor, seen from the air in 2022. / And the same area in 2025. (Supplied: Brisbane City Council)\n\n\"In 2011, we were the highest house in the street and a lot of our neighbours were out for many, many months, so we were the only people living in the street for quite a long time,\" she said.\n\n\"And then people slowly moved back. This time, it's been very different with houses going and families moving away.\n\n\"So having all this open space is really different. It's made a big change to the community of the street. There's so few of us now.\"\n\nHouses used to stand in this spot. (ABC News: Jack McKay)\n\nMs Uroda said her children loved using the new green space in the street to play with other kids in the neighbourhood, but she'd like to see some work done to make it more usable.\n\nWhat do with the space?\n\nBesides Oxley, other suburbs with a significant number of buybacks include Rocklea, Windsor, Sherwood, and Graceville.\n\nThe council says it has since restored the vast majority of these sites by making them open space \"in keeping with the [buyback] program's objective\".\n\nThis involves demolishing the flood-impacted dwelling, re-turfing and levelling the block, and adding bollards.\n\nWhile some of the acquired blocks are grouped together, others are left surrounded by properties.\n\nHouses remain on eight of the 293 sites, but the council expects those lots will be remediated by the end of the year.\n\nBush choppers at the ready Photo shows A pilot stands at the door of a helicopter. From the cockpit of his chopper, Jedd Manning is dropping supplies to disaster-affected areas one day and rounding up rebellious cattle the next.\n\nThe council's environment, parks and sustainability chair Tracy Davis said the addition of park-related equipment on those sites could be considered in the future.\n\nBut she said the top priority was removing 293 dwellings on those blocks and for basic landscaping work to be done.\n\n\"It's important to remember why we are undertaking this work and that's to ensure that during a flood event that properties are at less risk of being damaged,\" Ms Davis said.\n\n\"We don't want to put anything on a property that increases that risk. We want people to be safe, we want space for water when these heavy flood events occur.\n\n\" We would be happy to look in the future to embellishing some of those sites if it's appropriate and it doesn't increase flood risk. \"\n\nHundreds of homes across Brisbane were damaged in the 2022 floods. (ABC News: Chris Gillette)\n\nMs Davis said she was sure many Brisbane residents were already enjoying the open space on the bigger blocks that had emerged through the buyback and encouraged people to use them.\n\n\"We've had no feedback from residents to date to say that they are unhappy with how their suburbs look,\" she said.\n\nIndependent Tennyson ward councillor Nicole Johnston says the blocks are a \"bit of an eyesore\". (ABC News: Mark Leonardi)\n\n'Bit of an eyesore'\n\nOthers were less sure.\n\nIndependent Tennyson ward councillor Nicole Johnston believed the council had taken a \"basic approach\" to rehabilitating the blocks — describing them as a \"bit of an eyesore\".\n\n\"They don't look like they're part of the community,\" she said.\n\n\"The residents that are left that weren't eligible for buybacks are still living in flood-prone areas and they really want to see this new parkland being integrated into the neighbourhood.\"\n\nInsurance claims remain outstanding after 2022 floods Photo shows A 2024, a 2022 comparison showing where floodwaters rose to The 2022 flood event was the costliest in Australia's history, with 244,000 insurance claims made — but almost two years on, more than 7,000 of those are outstanding.\n\nFollowing consultation with locals in her ward on Brisbane's southside, Ms Johnston is planning on planting trees on some vacant blocks, while leaving others with open space for playing or kicking a ball.\n\n\"Some of those blocks might be just one large specimen tree. Others, we might have a mini forest, so it's going to vary depending on the block,\" she said.\n\nShe said other ideas put forward by residents included playgrounds and skate parks, while students at a local school wanted active play facilities like a basketball court.\n\n\"But we need to make sure they're done in the places where there are larger parkland blocks now so they're not right on top of people and creating noise,\" Ms Johnston said.\n\nIn the Ipswich suburb of Goodna parcels of green space have popped up after buybacks. (ABC News: Jack McKay)\n\nIpswich residents want green space, sporting fields\n\nIn Ipswich, west of Brisbane, 204 properties – or 50 hectares – have also been acquired by the local council through the buyback scheme.\n\nMost of the sites have been remediated with the dwellings removed and sites re-turfed — with a lot of them patched across the city.\n\nIpswich Mayor Teresa Harding says council can't build on any of the vacant blocks. (ABC News: Mark Leonardi)\n\nIpswich Mayor Teresa Harding indicated rules from the buyback scheme made it difficult for the council to build facilities on the vacant sites, because if it flooded again, ratepayers would be responsible for remediating it.\n\n\"The land is now zoned so we can't build anything on there,\" she said.\n\n\"So, a lot of things we thought about … like playgrounds or community gardens, we won't be able to do because of that provision.\"\n\nBuybacks in Goodna have led to the creation of parks where bollards have been erected. (ABC News: Jack McKay)\n\nMs Harding said residents had responded to a consultation process saying they wanted more green space, as well as sporting fields and car parks near those fields.\n\n\"We're looking at how we can have more bushland reserves and make it nice green space for communities,\" she said.\n\n\"In Goodna, we have a lot of jacaranda trees in that area, so maybe we look at that.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/politics/queensland/no-dates-for-hearings-yet-but-cfmeu-inquiry-has-considerable-work-under-way-20250904-p5mshq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "No dates for hearings yet, but CFMEU inquiry has ‘considerable work’ under way",
    "publish_date": "Sat, 06 Sep 2025 11:40:00 +1000",
    "category": "finance",
    "authors": [
      "Matt Dennien"
    ],
    "text": "The news\n\nA powerful inquiry into Queensland’s CFMEU branch is preparing to detail its opening public hearing after “considerable work”, mostly done behind the scenes, in its first month of operation.\n\nThe commission of inquiry, led by conservative barrister Stuart Wood AM KC this week announced three experienced lawyers had been appointed as counsel assisting.\n\nKate Juhasz (left), Liam Kelly KC (second from right) and Polina Kinchina (right) have been named counsel assisting the Queensland CFMEU Commission of Inquiry, led by Stuart Wood AM KC (centre), with help from secretary Bob Gee (second from left). Credit: Lucas Chambers, file, LinkedIn, Murray Gleeson Chambers.\n\n“The commission has been undertaking a range of work consistent with its terms of reference with an opening public hearing to be announced in the near future,” a spokesperson told this masthead.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/afl/should-not-umpire-in-these-finals-again-afl-great-slams-rayner-free-kick-20250906-p5mswa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Should not umpire in these finals again’: AFL great slams Rayner free kick",
    "publish_date": "Sat, 06 Sep 2025 11:13:40 +1000",
    "category": "sports",
    "authors": [
      "Danny Russell"
    ],
    "text": "Loading\n\nPremiership captain Tony Shaw has called for the umpire at the centre of Friday night’s Cam Rayner free-kick debacle to be sidelined for the remainder of the finals series for a decision the AFL has conceded should not have been paid.\n\nAnother AFL great, Matthew Lloyd, believes Rayner could be fined for staging after the controversial moment at the MCG in which the Brisbane forward kicked two goals from two free kicks just before half-time.\n\nThe Cam Rayner moment. Credit: Fox Footy\n\nUmpire Brent Wallace awarded Rayner the first penalty in the Brisbane goal square after he was nudged in the back by opponent Mark O’Connor and hit the deck, a moment that sent the Geelong crowd apoplectic.\n\nIt happened while Cats forward Tyson Stengle was lining up for a shot at goal at the opposite end of the ground.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/alcaraz-makes-short-work-of-djokovic-20250906-p5mswe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Alcaraz makes short work of Djokovic",
    "publish_date": "Sat, 06 Sep 2025 10:56:32 +1000",
    "category": "finance",
    "authors": [],
    "text": "Alcaraz makes short work of Djokovic\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/carlos-alcaraz-beats-novak-djokovic-in-three-sets-to-reach-us-open-final-20250906-p5msvn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It comes with time and with age’: Djokovic falls again to athletic Alcaraz",
    "publish_date": "Sat, 06 Sep 2025 10:17:00 +1000",
    "category": "sports",
    "authors": [
      "Howard Fendrich"
    ],
    "text": "New York: Carlos Alcaraz used his youth, athleticism and creativity to assert himself against the much more accomplished, but also much older, Novak Djokovic and beat the 24-time major champion 6-4, 7-6 (4), 6-2 at the US Open on Friday (Saturday morning AEST) for a berth in his third consecutive grand slam final.\n\nBy the end, Djokovic was “gassed out,” as he described it afterward, and seemed resigned to the result. The 38-year-old from Serbia reached the semi-finals at all four slams this season but exited in that round each time, three via losses to No. 2 Alcaraz, 22, or No. 1 Jannik Sinner, 24.\n\nCarl;os Alcaraz’ athleticism shone through in his semi-final win over Novak Djokovic. Credit: Getty Images\n\n“It’s frustrating on the court when you are not able to keep up with that level physically, but at the same time, it’s something also expected, I guess,” Djokovic said. “It comes with time and with age.”\n\nAlcaraz will face either defending champion Sinner or No. 25 Felix Auger-Aliassime for the championship on Sunday, when President Donald Trump plans to attend. Sinner could become the first repeat men’s champion in New York since Roger Federer won the hard-court tournament five years in a row from 2004 through 2008.",
    "source": "SMH",
    "cluster_id": 12
  },
  {
    "url": "https://www.smh.com.au/national/victoria/pooch-perfect-a-dog-s-journey-from-the-outback-to-pampered-city-digs-20250828-p5mqk1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pooch perfect: A dog’s journey from the outback to pampered city digs",
    "publish_date": "Sat, 06 Sep 2025 10:00:00 +1000",
    "category": "finance",
    "authors": [
      "Carolyn Webb"
    ],
    "text": "Today, she’s a city dog, trotting along Melbourne pavements on a leash, but glimpses of Moana’s past life in an outback town remain.\n\nThe terrier hates being alone, says owner Paul Gosney, and won’t wear a coat. At the beach, she loves sand but not water.\n\nMoana the terrier in Melbourne with owner Paul Gosney, his mother, Irene, and Aussie Desert Dogs founder Gloria Morales. Credit: Chris Hopkins\n\nBut he says Moana is “an amazing soul” who is now a cherished family pet.\n\nMoana is among 1800 unwanted “camp dogs” from Yuendumu, in the Northern Territory, that have been sent to new homes across Australia, under the not-for-profit program Aussie Desert Dogs.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/the-one-panther-who-really-needed-a-break-20250825-p5mpni.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The one Panther who really needed a break",
    "publish_date": "Sat, 06 Sep 2025 09:33:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Loading\n\nOne player who would have welcomed the rest more than any other Penrith teammate last weekend was Dylan Edwards.\n\nEdwards has been one of the standout performers for the premiers for several years, is the NSW and Kangaroos’ fullback incumbent, but has struggled under the high ball and with handling errors in the past two games he has played.\n\nPenrith’s Dylan Edwards had a couple of rough weeks before enjoying a break. Credit: NRL\n\nThere was a loose carry at the start of golden point against the Storm before Harry Grant took full advantage of the field position to score a try.\n\nThen there was another dropped ball, which allowed Canberra’s Ethan Strange to score in regulation time, before the Raiders went on to win the Miracle in Mudgee in golden point.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/world/north-america/the-61-takeaway-lunch-that-just-proves-lobster-is-overrated-20250902-p5mro2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The $61 takeaway lunch that just proves lobster is overrated",
    "publish_date": "Sat, 06 Sep 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Michael Koziol"
    ],
    "text": "What in the World, a free weekly newsletter from our foreign correspondents, is sent every Thursday. Below is an excerpt. Sign up to get the whole newsletter delivered to your inbox.\n\nNew York: The late, great Christopher Hitchens once named champagne, picnics and lobster among the most over-rated pleasures in life. On the latter, I’d have to concur.\n\nEspecially when you’re paying $US40 ($61) for the privilege. That’s how much the Maine-style lobster roll from Red Hook Lobster Pound will set you back at the US Open in New York.\n\nChristopher Hitchens would not approve: the $US40 ($61) - each - Maine lobster roll at Flushing Meadows. Total for two = $122. Credit: Michael Koziol\n\nThe price tag didn’t seem to deter the punters, though, who were lined up to splash their cash at lunchtime on Tuesday between two big matches at the adjacent Arthur Ashe Stadium.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/waugh-chest-how-rugby-australia-should-spend-their-incoming-millions-20250905-p5msn6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Waugh chest: How Rugby Australia should spend their incoming millions",
    "publish_date": "Sat, 06 Sep 2025 09:30:00 +1000",
    "category": "finance",
    "authors": [
      "Paul Cully"
    ],
    "text": "Rugby Australia bosses Phil Waugh and Dan Herbert clearly didn’t come down in the last shower.\n\nGiven Australian rugby’s chequered track record with financial windfalls, the pair recognise that trumpeting wealth would be almost as dangerous as advertising financial distress.\n\nAfter paying off RA’s $60 million debt in one fell swoop with proceeds from the British and Irish Lions tour, they were at pains this week to emphasise that there’s still hard work ahead — signalling to all the hungry mouths out there (and player agents) that there would be no giveaways.\n\nBut they won’t be able to hide their robust position for long, and next year’s annual report will show how much they have banked after clearing the debt.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/will-dylan-brown-hand-his-next-team-the-knights-the-wooden-spoon-20250904-p5msb5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Will Dylan Brown hand his next team – the Knights – the wooden spoon?",
    "publish_date": "Sat, 06 Sep 2025 09:22:00 +1000",
    "category": "sports",
    "authors": [
      "Robert Dillon"
    ],
    "text": "He has signed the richest contract in rugby league history, ostensibly on the basis that he can help transform Newcastle into premiership contenders.\n\nBut before Dylan Brown clocks on for his first lucrative shift with the Knights, he has one last job at Parramatta, and it could leave his future employers in a world of pain.\n\nIn a remarkable irony, Brown has been recalled for his 142nd – and last – appearance for the Eels, which happens to be Sunday’s final-round clash with Newcastle at CommBank Stadium.\n\nFrom a Parramatta perspective, there is little riding on the outcome other than the chance to send Brown out on a winning note, end coach Jason Ryles’ rookie season with a third successive victory, and climb from 12th to 11th on the ladder, leapfrogging Wests Tigers.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/car-fire-in-sydney-s-west-overnight-20250906-p5msw0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Car fire in Sydney’s west overnight",
    "publish_date": "Sat, 06 Sep 2025 09:06:21 +1000",
    "category": "finance",
    "authors": [],
    "text": "Car fire in Sydney’s west overnight\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/wedding-venue-in-sydney-s-north-west-goes-up-in-flames-20250906-p5msvx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wedding venue in Sydney’s north-west goes up in flames.",
    "publish_date": "Sat, 06 Sep 2025 09:04:10 +1000",
    "category": "finance",
    "authors": [],
    "text": "Wedding venue in Sydney’s north-west goes up in flames.\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/lifestyle/duchess-of-kent-dies-aged-92-20250906-p5msvu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Duchess of Kent dies aged 92",
    "publish_date": "Sat, 06 Sep 2025 08:46:05 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Duchess of Kent dies aged 92\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/lifestyle/novotna-reflects-on-wimbledon-defeat-20250906-p5msvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Novotna reflects on Wimbledon defeat",
    "publish_date": "Sat, 06 Sep 2025 08:46:03 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Novotna reflects on Wimbledon defeat\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/racism-nursing-nsw-report/f3go0btpx",
    "title": "Loveness says she experienced racism while working as a nurse. She isn't the only one",
    "publish_date": "Sat, 6 Sep 2025 01:29:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Loveness Tsitsi Mauwa started her first job in a New South Wales hospital as a nurse, a colleague told her there was what she called a template for career success in the hospital.\n\n\n\n\n\n\"She told me to progress, you have to be young, Caucasian and beautiful. And at that time, it didn't make sense to me,\" Mauwa, who was born in Zimbabwe and came to Australia on a skilled worker visa, told SBS News.\n\n\n\n\n\nBut as she stayed in the sector for longer, she realised the template existed. In the following decade, Mauwa applied for various opportunities to progress her career, only to find she often didn't make it to the final stage.\n\n\n\n\n\n\"I did put out some applications, and in one of the applications, I was promised I was going to get an opportunity, but that opportunity never came. But everyone else who had applied who met the criteria was able to progress,\" she said.\n\n\n\n\n\nMauwa said the level of racism and discrimination she experienced from colleagues drove her out of working in nursing full-time.\n\n\n\n\n\nAs one of the critical sectors that face a labour shortage, the federal government has been prioritising visas for nurses in the skilled migration system.\n\n\n\n\n\nMauwa said that in the two decades she's lived and worked in Australia, she has seen the workforce become more diverse, but barriers still exist.\n\n\n\nTwo-thirds of nurses and midwives from culturally and linguistically diverse backgrounds in NSW have experienced racism at work, according to a new report by the New South Wales Nurses and Midwives Association.\n\n\n\n\n\nOver 3,000 nursing union members were surveyed for the report. 64 per cent said they had experienced direct racism from staff or patients.\n\n\n\n\n\nThe report calls on employers to ensure all staff complete bystander action education. Other recommendations include prioritising the elimination of institutional racism; policies and training on incident reporting; and monitoring the effectiveness of co-designed anti-racism training.\n\n\n\n\n\nAn anti-racism roundtable will now be held to form policies and address systemic racism.\n\n\n\n\n\nThe general secretary at NSW Nurses and Midwives' Association, Shaye Candish, says the union has launched a partnership to ensure progress is made.\n\n\n\nLISTEN TO Call for action after report details racism faced by nurses, midwives SBS News 04:30 English\n\n\"It will be chaired by the Human Rights Commission, and we will have participants from governments, from employers, from the union, from the advocacy groups, from all stakeholders involved in this collaborative,\" Candish said.\n\n\n\n\n\n\"The reality, unfortunately, is that racism is a pervert problem, and it is a really layered and complex problem. It's going to take a lot of work and commitment from organisations.\n\n\n\n\n\n\"But it's also going to take a collaboration from all of our organisations, because there is no one simple solution, and there is no one organisation that can fix this on their own.\"\n\n\n\n'Racism is making people sick'\n\nRace Discrimination Commissioner Giridharan Varanasi said the report shows racism is a public health emergency that must be dealt with urgently.\n\n\n\n\n\n\"Put simply, racism is making people sick. Racism is stopping people who are sick from getting better, and racism is making people who are sick get worse,\" he said.\n\n\n\n\n\nSivaraman says he launched a National Anti-Racism Framework last year, but hasn't seen governments put it into action.\n\n\n\nRace Discrimination Commissioner Giridharan Sivaraman says racism is a public health emergency. Source: AAP / Mick Tsikas He said that the nurses' union's report \"shows that the recommendations, and our framework, which align completely with the recommendations and their report, need to be implemented\".\n\n\n\n\n\nNSW Health Minister Ryan Park says there are robust anti-racism policies in place, but individuals need to work together to ensure they are implemented.\n\n\n\n\n\n\"When people don't feel safe, they don't feel culturally safe, within our settings, then the health outcomes are also worse,\" Park said.\n\n\n\n\n\n\"Racism is not just offensive, it can have serious detrimental impacts on people's health and wellbeing — both in terms of our staff, but also just as importantly our patients.\"\n\n\n\n\n\nFor Mauwa, an important step is eliminating the barriers she says are stopping culturally and linguistically diverse workers from moving up in their careers.\n\n\n\n\n\n\"I think the health system is happy if we (are) just working on the floor, but not wanting to progress into management or senior roles.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/cultural-pillage-writers-devastated-by-decision-to-close-iconic-literary-journal-meanjin/1fpasyqu5",
    "title": "'Cultural pillage': Writers devastated by decision to close iconic literary journal Meanjin",
    "publish_date": "Fri, 5 Sep 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAfter 85 years, one of Australia's oldest literary journals, Meanjin, will cease publication.\n\n\n\n\n\nFounded in 1940 in Brisbane, the journal is the country's second oldest literary journal after the Southerly.\n\n\n\n\n\nThe journal's name comes from the local Indigenous Yuggera language - and refers to the site where central Brisbane sits.\n\n\n\n\n\nFounding editor Clem Christesen said at the time, the name honours the importance of place in the development of culture.\n\n\n\n\n\nIn 1945, the journal's operations moved to Melbourne, after an invitation by the University of Melbourne.\n\n\n\n\n\nAnd then in 2008, Meanjin became an editorially independent imprint of Melbourne University Publishing.\n\n\n\n\n\nIn a statement, Melbourne University Publishing says the Board decided financial constraints mean the final issue will be released in December.\n\n\n\n\n\nThe statement goes on to say that the two part-time staff of Meanjin were not involved in the decision.\n\n\n\n\n\nThe decision to close Meanjin has been widely criticised by many, including award-winning writers and prominent literary figures, including Louise Adler and author Sophie Cunningham.\n\n\n\n\n\nAs of Friday (5 Sept), more than 700 people have signed an open letter to the vice-chancellor of the University of Melbourne, Emma Johnston, to sacrifice 10 per cent of her salary to save the literary magazine.\n\n\n\n\n\nSBS News has contacted Professor Johnston - and has not yet received a response.\n\n\n\n\n\nDr Jeanine Leane is a Wiradjuri writer, poet and academic, currently based in Melbourne.\n\n\n\n\n\nFor two-and-a half years, she was working as a poetry editor with Meanjin.\n\n\n\n\n\nShe says she has seen a vast number of diverse voices, in terms of poetry during her time at Meanjin.\n\n\n\n\n\n\"I found like I really had a free reign there to be adventurous, to cast out, and to make sure to cast my eye very, very broadly across and to publish a really diverse culturally linguistically, socially and politically diverse range of palettes in that space.\"\n\n\n\n\n\nDr Leane talks about the shift that happened in 1977 for First Nations communities.\n\n\n\n\n\n\"That first issue in 1977 did really evidence a shift, a cultural shift in the nation. And (Jim) Davidson put together this anthology in 1977, First Nations writing today, which was a collection from which the time was one of the early journals to showcase Aboriginal and Torres Strait Islander voices nationally.\"\n\n\n\n\n\nShe says its been an important space in historically and culturally for First Nations cultural expression.\n\n\n\n\n\n\"Meanjin has had that very strong commitment to First Nations writings, cultural and sociopolitical expression ever since that time. And arts and culture. Esther (Anatolitis) was a great arts and culture advocate, and when she became the 12th editor of Meanjin in late 2022, she established a literary and cultural advisory board.\"\n\n\n\n\n\nDr Jeanine Leane says the cultural advisory board was filled with Indigenous and culturally diverse writers and thinkers.\n\n\n\n\n\nIt centered on increasing First Nations writing and publication, as well as honouring elders and recognising the work that has been done historically, particularly in the early days of the publication.\n\n\n\n\n\nDr Jeanine Leane says the decision to close Meanjin will have serious and severe consequences for Australian writers and their audiences.\n\n\n\n\n\n\"It is cultural pillage. A real - it is a type, if you like - I deliberately use that word editing and national consciousness in a way. It's a way of enforcing, I suppose, shutting down a whole lot of voices. So in many ways it's a form of censorship. Shutting down an avenue for a lot of voices is a form of censorship.\"\n\n\n\n\n\nShe says the absence of the journal will also remove an important forum and community to develop and nurture Australian storytellers.\n\n\n\n\n\n\"And it's one less space; one more space taken away from us as a minority, but a minority but very prolific and very articulate community. It was one more safe space that we had that is now being taken away from us.\"\n\n\n\n\n\nCarody Culver who's the editor of the literary Journal, Griffith Review, says the contribution of the journal has been seminal in the development of Australia's literary scene.\n\n\n\n\n\n\"It's really devastating news. Griffith Review - we've had a long standing allyship with Meanjin Esther Anatolitis, the current editor, and what a wonderful advocate she is for arts and culture in Australia. And Meanjin, it's one of the country's most pre-eminent literary journals. It's the second oldest - was established in 1940, and over the last eight and a bit decades, it's published incredible work. I mean, the journal is responsible for giving us the phrase 'cultural cringe', which has become so embedded in the Australian lexicon. It's been an incredible platform for emerging and established writers and for First Nations writers as well.\"\n\n\n\n\n\nShe says the resource and benefits provided by the journal enriches the nation.\n\n\n\n\n\n\"Journals are wonderful platforms for writers at all stages of their careers. And in order to be able to run journals, having institutional support from somewhere like a university is incredibly valuable. So I know from my own experience of being editor of Griffith Review. We receive support from Griffith University as well as organisational funding from Creative Australia. And that's so vital to us. And this notion that some people have that literary journals should be expected to generate revenue - that's not what we're here for.\"\n\n\n\n\n\nMs Culver says she remembers the inspiration Meanjin provided when she was doing her PhD about 15 to 20 years ago.\n\n\n\n\n\n\"The expansiveness of the ideas that you would find in its pages and the fact that it had this incredibly rich, rich history and that it had contributed to our intellectual life, our intellectual culture over such a long period. So for the time that I was at my career at that stage, early on trying to establish a name to myself and trying to find the right career pathway for the editorial work that I wanted to do. Meanjin was quite a beacon for me.\"\n\n\n\n\n\nMs Culver says she has written a piece about the role and importance of literary journals in the upcoming 85th edition of Meanjin.\n\n\n\n\n\nShe says journals are really good at navigating the unpredictability and the complexity of contemporary publishing, which caters to dedicated audiences of readers and writers.\n\n\n\n\n\n\"My piece in Meanjin is really just a reflection on why journals are important and why it can sometimes feel - be a bit challenging to fearlessly or constantly having to justify the reason that journals should exist.\"\n\n\n\n\n\nShe says we have many wonderful publications in Australia that are helping to platform the work of new voices and established voices - but the absence of Meanjin will be felt.\n\n\n\n\n\n\"Knowing, knowing what I know now that Meanjin will no longer exist after this 85th edition has come out, it's, it's really heartbreaking.\"\n\n\n\n\n\nMs Culver says it's been really lovely to see the huge outpouring of support on social media, as well as news articles on the closure of Meanjin.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/anti-immigration-rallies-ignore-australias-economic-dependence-on-migration/gez59p6r5",
    "title": "Anti-immigration rallies ignore Australia's economic dependence on migration",
    "publish_date": "Fri, 5 Sep 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nOver the weekend, thousands rallied across Australia in anti-immigration marches.\n\n\n\n\n\nAt the heart of the rallies was a call to end what protest organisers called \"mass migration\" to Australia.\n\n\n\n\n\nScientia Professor at the Kaldor Centre for International Refugee Law Jane McAdam says the rhetoric at these marches focused on a key misconception- that migrants are to blame for a number of pressures impacting Australians.\n\n\n\n\n\nSeen on banners, chanted in slogans and speeches at the rallies was the idea that high migrant numbers are responsible for rising cost of living, housing shortages and job insecurity, among other issues.\n\n\n\n\n\n\"Unfortunately, there's a lot of misunderstanding and misinformation out there about the links between migration, housing shortages, cost of living pressures, infrastructure, all those sorts of things. And I think that that has been exploited by certain elements of the community, particularly on the far right to suggest that migrants are taking your houses, taking your jobs, these sorts of things.\"\n\n\n\n\n\nGlobal Migration expert and Associate Professor of Public Policy at the University of Sydney Anna Boucher says issues like the housing crisis and rising cost of living are undoubtedly impacting many Australians.\n\n\n\n\n\nHowever, she says the idea that the fix for these pressures is to curb migration is misdirected, and misses the vital role migrants play in the functioning of Australia's economy and society.\n\n\n\n\n\n\"I mean 50 per cent of the Australian population are either migrant background or have one parent who was, so we're actually talking about most of Australia. In essence, Australia couldn't function without migration. International student migration comprise is a big component of our gross domestic product. Migrants provide necessary labor into skill shortage areas that we can't meet through domestic supply and immigration is a central component of Australia's multicultural identity.”:\n\n\n\n\n\nThe most recent ABS data shows migrants make up nearly one-third of Australia's workforce.\n\n\n\n\n\nAustralia's migrant population is also one of the most skilled among OECD countries, with nearly six in ten migrants holding a university degree or higher, in contrast with around four in ten native-born Australians.\n\n\n\n\n\nMatt Grudnoff , Senior Economist at the Australia Institute says Australia relies on its skilled migrants to fill crucial gaps in the jobs market.\n\n\n\n\n\n\"So migrants tend to be younger than the average. Australian tend to be well-skilled and so they add a lot to Australia's economy. Australia's migration system in particular is very skills focused, so it tends to target migrants with skills that we have a shortage of. And so what they actually do is they enable us to continue to have access to goods and services that might otherwise be difficult to produce in Australia or would become far more expensive.\"\n\n\n\n\n\nMigrants make up a particularly large share of the workforce in key industries such as hospitality, health care, professional services, manufacturing and administrative services.\n\n\n\n\n\nAccording to 2021-2022 ABS jobs data, 15 percent of migrants in Australia work in the area of health care and social assistance, and the 2021 census shows more than 40 per cent of registered nurses and aged and disabled carers were born overseas.\n\n\n\n\n\nProfessor Boucher says with Australia's population aging, it's expected the country will rely heavily on migrant health workers in future.\n\n\n\n\n\nWith no current visa category for low-skilled migrants, she says changes may need to be made to enable more skilled and low-skilled migrants to fill gaps expected to grow in this industry.\n\n\n\n\n\n\"So yeah, it's clear that we won't meet the needs of our aging population exclusively through our domestic labor market... we will need to think quite carefully about how we bring in migrant labor whether that's forms of labor agreements as they're called, or whether there are changes to the visa structure to permit that to occur.”\n\n\n\n\n\nMr Grudnoff says one of the key messages voiced at the anti-immigration rallies over the weekend was a concern that mass migration numbers are to blame for the housing crisis Australia is experiencing.\n\n\n\n\n\nHe says there are a few key issues with this concern.\n\n\n\n\n\nFirstly, Australia is not experiencing the historic surge in migration protesters and rally organisers claim.\n\n\n\n\n\nWhile a slump in migration during the COVID-19 Pandemic was followed by an increase once borders re-opened, Mr Grudnoff says since 2024, population growth appears to have fallen back to pre-Covid rates.\n\n\n\n\n\nHe says the idea that the population is growing at a faster rate than housing is also not supported by the data.\n\n\n\n\n\n\"Over the last 10 years, the population has grown by 16%. So in order to just house that extra 16% of people, we'd need to increase the number of homes by 16%. But the number of homes has increased by more than 16%, it's increased by 19%. So we're actually building, so actually the number of homes is growing faster than the population.\"\n\n\n\n\n\nHe says lack of affordable housing Australians are experiencing is in part driven by tax laws which favor investors.\n\n\n\n\n\n\"There's been a big increase in demand for housing and in particular, investors demand for housing. So what's happened is the capital gains tax discount was introduced under the Howard government that has made making money out of housing very tax effective. It's encouraged lots of people to go out and buy an investment property. These people are outbidding first home buyers effectively and increasing price of housing and stopping people from getting into the housing market.\"\n\n\n\n\n\nAccording to Mr Grudnoff, a lack of low-cost government housing is also contributing to the crisis.\n\n\n\n\n\n\"So one of the problems in Australia with our housing is that the government has withdrawn from the housing sector. We used to be in the sixties, seventies and eighties, the government was heavily involved in supplying public housing and now they've largely vacated that they're not building nearly as much housing. And so consequently there is a lot less of that housing available and this is adding to the affordability crisis.\"\n\n\n\n\n\nProfessor Boucher says as with other concerns over pressures like cost of living, it's clear blame for the housing crisis is falling in the wrong place.\n\n\n\n\n\n\"It doesn't mean that there might not be an issue with housing, but that needs to be addressed separately. And I think that's maybe the answer is more densification. Maybe it is a speeding up the rate of construction. Maybe it is different methods of urban planning. We have a very low density city for its population size in Sydney, for instance, if you compare it with comparable cities overseas. But that's a product of our poor planning, not of migrants.\"\n\n\n\n\n\nProfessor McAdam says while concerns people have about housing, cost of living and infrastructure can't be ignored, migration should be considered an important part of the solution, rather than the problem.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/in-sydneys-little-india-locals-say-price-is-way-off-with-her-indian-migrant-remarks/cuvyjzcmb",
    "title": "In Sydney's 'Little India', locals say Price is 'way off' with her Indian migrant remarks",
    "publish_date": "Fri, 5 Sep 2025 20:42:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Some members of the Australian-Indian community have urged Liberal senator Jacinta Nampijinpa Price to apologise, after she claimed the government prioritises Indian migrants because many of them vote for Labor.\n\n\n\n\n\nEarlier this week, Price told ABC Radio Labor is accepting migrants who \"support their policies, their views and vote for them as well\", singling out \"the Indian community\" as an example.\n\n\n\n\n\nShortly after, she appeared to walk back her comments, saying she didn't think she had anything to apologise for and appeared to accuse the interviewer of pushing the topic.\n\n\n\n\n\nIn the western Sydney suburb of Harris Park — also known as Little India — some locals told SBS News the remarks have left them feeling unfairly targeted, coming just days after anti-immigration rallies that took place across the country.\n\n\n\n'It's not a thing'\n\nRitwik Singh, whose father migrated to Australia on a skilled visa, said the rallies have already unsettled many in the community.\n\n\n\n\n\n\"It was probably just a bit of a guise for some deeper stuff, like white supremacy,\" he told SBS News. \"A lot of people on my WhatsApp were saying that Indians were being called out and targeted in particular with this protest.\"\n\n\n\n\n\nSingh said friends overseas had reached out to check if he was safe. \"The reaction has not been positive. I had a friend from India reach out to me, saying, 'Are you guys alright?'\"\n\n\n\n\n\nSingh rejected Price's claim that Indians overwhelmingly vote Labor. \"I don't agree with her. She's way off with her comments,\" he said.\n\n\n\n\n\n\"Indian people tend to vote by looking at their backyard. They're looking at what's most important for them … They don't necessarily side each way, but both parties definitely try and get the vote because the size of the population is pretty meaningful.\"\n\n\n\nHarris Park resident Ritwik Singh said Liberal senator Jacinta Nampijinpa Price was \"way off\" with comments that claimed the government prioritises Indian migrants because many of them vote for Labor. Source: SBS News\n\n'National asset'\n\nAnother Harris Park resident, Nashih Fatima, who migrated from India seven years ago, also dismissed Price's claims about voting patterns.\n\n\n\n\n\n\"Everyone has different political parties and different views,\" she told SBS News. \"That's silly. It's not a thing.\"\n\n\n\n\n\n\"We left our country because we wanted to make this country good and better. Every immigrant has the right to live and work and be happy here.\"\n\n\n\nShail Wadhwa, president of the Council of Indian Australians Inc, said Price's remarks fuel division.\n\n\n\n\n\n\"We strongly reject any narrative that unfairly targets the Indian Australian community or misrepresents their contribution to Australian society,\" Wadhwa told SBS News. \"She should be apologising to the community.\"\n\n\n\n\n\nWadhwa pointed to a 2022 federal government report describing the Indian diaspora as a \"national asset\", highlighting its youth, high levels of education, and above-average earnings. People born in India now make up the second-largest overseas-born population in Australia, behind those from England.\n\n\n\n'Should have been voting Coalition'\n\nPrice cited polling from political research company RedBridge, showing around 85 per cent of Indian-Australians voted Labor in 2022.\n\n\n\n\n\nBut RedBridge director Kos Samaras said the numbers don't tell the full story.\n\n\n\n\n\n\"These communities should have been voting Coalition,\" Samaras said, noting that the Howard government had been responsible for introducing skilled migration pathways regularly used by Indian migrants.\n\n\n\n\n\n\"On paper, they should be voting conservative … but when we ask them why they don't, the answer is blunt: the Coalition does not like them,\" Samaras said.\n\n\n\nDamage to the 'Liberal brand'\n\nAustralian National University academic Frank Bongiorno, who specialises in political history, said Price's remarks were \"very damaging to the Liberal brand\" at a time when the party was already struggling for votes.\n\n\n\n\n\n\"All the indications are that it's electoral poison,\" he told the Australian Associated Press.\n\n\n\nREAD MORE Liberals distance themselves from Price's Indian migrant remark as backlash grows\n\nBongiorno said the comments were likely to have a lasting impact on how migrant communities viewed the Coalition. \"Those impressions stick and they can actually stick for years,\" he said.\n\n\n\n\n\n\"Many [migrants] do have quite conservative cultural values that probably are more in keeping with ideas that you find within the Liberal and the National Party but ... there's a sense this is a place that's hostile to them.\"\n\n\n\n\n\nWhile Singh believes anti-immigration sentiment is not widespread, he too warned it could have lasting consequences.\n\n\n\n\n\n\"It will become one of those reasons where people will stop wanting to send their kids [to Australia] for education, or you might have skilled migrants think that maybe Australia's not the best choice anymore,\" he said.\n\n\n\nLiberal MP side-steps calls for apology\n\nOpposition leader Sussan Ley was quick to stress the Coalition's support for Indian Australians, and said Australia's migration policy remained non-discriminatory.\n\n\n\n\n\nLiberal MP Leon Rebello, whose parents hail from the western Indian state of Goa, told SBS News he believes Price has \"walked back\" her comments and that the party must continue to support the community.\n\n\n\n\n\n\"The Indian community does so much and they've contributed so much to Australian society — I'm there with Jacinta in the party room, backing them every step of the way,\" he said.\n\n\n\n\"It's very disappointing that the marches were hijacked by neo-Nazis … However, the marches also had thousands of Australians from different backgrounds who wanted to communicate a very clear message … their concerns about the current migration problem,\" Rebello said.\n\n\n\n\n\nHe stopped short of calling Price to apologise to the community, saying: \"The fact that she has recognised or walked back those comments is an indication of her view.\"\n\n\n\n\n\nBut for locals in Harris Park, the damage is already done.\n\n\n\n\n\n\"Immigrants are always the first port of call — it's very easy to just point the finger,\" Singh said. \"This country has been built on immigrants … they tend to do a lot more good for the country than not.\"\n\n\n\n\n\n— With additional reporting by Rayane Tamer and the Australian Associated Press\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-rare-earth-mining-is-destroying-vital-rivers/5r0buyf12",
    "title": "Skin rashes, deformed fish: How rare earth mining is destroying vital rivers",
    "publish_date": "Fri, 5 Sep 2025 20:39:55 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "In the village of Tha Ton, nestled in the hills just 3km from Thailand's border with Myanmar, there is little to life without the Kok River.\n\n\n\n\n\nFor hundreds of years, it has provided fish for families in the village, water for their crops and, in the stifling summer heat, a place for their children to cool down.\n\n\n\n\n\nIt's where 42-year-old Gob Kotekham has been making rafts all his life. But he says, lately, something strange has been happening.\n\n\n\n\n\n\"Every year when I make the rafts, I might get a rash or two, but within a week it would go away,\" Kotekham says.\n\n\n\n\n\n\"I felt unusual because, this time, there were a lot of rashes and they kept spreading. It was itchy; I had never felt that before.\"\n\n\n\nGob Kotekham has been making rafts in the Kok River almost all his life. It's never made him sick until now. Credit: SBS News / Claudia Farhart He says initially he thought he was having an allergic reaction, but then others working on the rafts got sick too.\n\n\n\n\n\n\"My friend got cut, and his wound wouldn't heal,\" Kotekham says.\n\n\n\nAnother person went into the water and felt feverish. Then, after two months, it still hadn't gone away, so I went to see the doctor.\n\nBy that point, the Kok River had taken on a strange shade of orange, and the reports of illness were becoming difficult to ignore.\n\n\n\n\n\nTwo children — aged two and six years old — became sick after eating fish from the river. Test results showed abnormally high levels of arsenic in their bodies.\n\n\n\n\n\nFish began washing up dead, and fishermen were reporting odd deformities among their daily catch. Elephants that had long been bathed in the river started to develop unusual skin rashes and boils.\n\n\n\n\n\nOfficials from Thailand's Pollution Control Department came to test the water and discovered arsenic levels three times higher than the safe limit.\n\n\n\nGob Kotekham developed this rash across his body. He says it lasted more than two months. Credit: Supplied Local authorities ordered everyone in the village, which is in the Mai Ai district of Chiang Mai, northern Thailand, to stay out of the water, putting its largest source of income off-limits.\n\n\n\n\n\n\"When I made the rafts, I had to buy wood,\" Kotekham says.\n\n\n\n\n\n\"I invested around 50-60,000 baht [$2,300-$2,800], and this year, there is no one coming — not a single customer.\n\n\n\n\n\n\"So, we are all in debt. Not just me; the whole village.\"\n\n\n\nUnregulated mining thrives in war\n\nEight successive rounds of testing have now confirmed dangerously high levels of arsenic in the Kok River.\n\n\n\n\n\nAt first, it was widely blamed on mineral waste from gold mining, a long-known cause of arsenic contamination in nearby waterways.\n\n\n\n\n\nThat was until researchers at the Shan Human Rights Foundation (SHRF) discovered two rare earth mining sites over the border in Myanmar's southern Shan State, where the Kok River originates.\n\n\n\n\n\n\"We also compared them with the rare earth mining in Kachin [a state in northern Myanmar], and the layout of the leeching pools are the same,\" an SHRF spokesperson, Sai Hark Jet, says.\n\n\n\n\n\n\"So, we said that this is not just ordinary mineral extraction or mining; this must be tied up with rare earth mining in Kachin State.\"\n\n\n\nOne of the rare earth mining sites in Myanmar's Shan State in satellite images seen by the Shan Human Rights Foundation. Credit: Shan Human Rights Foundation The two sites are located just 2 and 3km from the river's banks in territory controlled by the United Wa State Army, which is widely considered the most powerful militia in Shan State.\n\n\n\n\n\nThe group did not respond to SBS News' requests for comment.\n\n\n\n\n\n\"Local people in Shan State have limited access to the areas around the mining sites, but we believe there is a huge impact, not just for the environment, but also for the community living beside the river,\" Jet says.\n\n\n\n\n\n\"We also have heard from local people that all the water is very brown and they cannot use it anymore, but they have to because they have no other water source. But the community in Shan State dare not speak up, because of the local authority.\"\n\n\n\n\n\nRare earth mining uses chemicals to separate the valuable minerals from their ore. The process leaves behind highly contaminated liquids that often find their way back into waterways if care is not taken to contain them.\n\n\n\nThai authorities say they are working on plans to urgently install sediment traps in the Kok River to stop the arsenic from flowing downstream.\n\n\n\n\n\nBut local leaders in Tha Ton fear that sediment traps alone will not solve this crisis. They want to see Bangkok engage directly with Myanmar's military leaders in the capital Naypyidaw to end all unregulated mining across the border.\n\n\n\n\n\n\"If we just try to solve the problem by reviving the river without closing the mines, we cannot solve the issue,\" local monk Phra Mahanikom tells SBS News.\n\n\n\n\n\n\"If it cannot be fixed, then the community will change. Our way of life will change.\"\n\n\n\nWhat's behind the surge in rare earth mining?\n\nMany of the rare earth mines identified by SHRF are close to Myanmar's border with China, which imported a record high of nearly 42,000 tonnes of rare earths from the country in 2023, according to Global Witness, an NGO that reports environmental and human rights abuses.\n\n\n\n\n\nBeijing's dominance over the valuable minerals is well-documented; China controls roughly 70 per cent of rare earth mining operations globally, and accounts for 90 per cent of processing.\n\n\n\n\n\nAnd global demand for the 17 chemical elements that comprise 'rare earths' is growing. Once processed, they can be used in a wide range of modern technologies, including smartphones, weapons systems and rechargeable batteries.\n\n\n\nEnvironmentalist Pianporn Deetes says Myanmar's internal conflict means rare earth mining is largely unregulated. Credit: SBS News / Claudia Farhart Thai activists believe Chinese investors are largely behind the surge in mining in Shan State and, by extension, the contamination coming from it.\n\n\n\n\n\n\"We've learned in Kachin State there are 300 rare earth mines, legal and illegal, with Chinese-speaking investors,\" says Pianporn Deetes, the Southeast Asia campaign director at global not-for-profit International Rivers.\n\n\n\n\n\n\"On our river headwaters, there are just a few. But there will be more and more coming if there is no action from governments.\"\n\n\n\n\n\nChina's embassy in Bangkok responded to accusations in June, writing on Facebook: \"China has instructed Chinese companies operating abroad to comply with the laws of the country and operate legally at all times.\"\n\n\n\n\n\nBut environmentalists argue that the mining sites identified are beyond the state's control, making it impossible to enforce environmental regulations.\n\n\n\n\n\n\"It's happening in an area where there are no laws or even rules on safety standards. They are exploiting the situation in Myanmar,\" Deetes says.\n\n\n\nThe costs are being paid by our rivers, our forests, our lands, and our futures.\n\nTesting shows the contamination has already spread beyond the Kok River. After it passes through Tha Ton, the river empties into the Mekong — Southeast Asia's most important waterway — where abnormally high levels of arsenic have now been detected.\n\n\n\nEnvironmentalists warn a regional crisis is coming\n\nSo far, Thai authorities have taken water samples from three locations spanning a roughly 20km stretch of the Mekong River.\n\n\n\n\n\nAll have shown arsenic levels exceeding the safe limit.\n\n\n\nSource: SBS News In the small village of Ban Sob Kok, about 15km downstream from the border with Myanmar, fishermen are now finding deformed fish in their daily catch.\n\n\n\n\n\n\"There were some fish with scars. We saw them, so we didn't eat them,\" local fisherman Somdet Thanatulayakul says.\n\n\n\n\n\n\"But they took them for testing, and when they came back, they had the arsenic.\n\n\n\n\n\n\"Buyers are now afraid to eat the fish because of the news. Before, I could earn more than 1000 baht [$48] per day, but now, we can't even get 300 baht [$14] in a week.\"\n\n\n\n\n\nThe arsenic levels detected in the Mekong are currently far lower than those found in three of its tributaries (smaller streams that flow from a larger river), which originate in Shan State: the Kok, Sai and Ruak rivers.\n\n\n\n\n\nBut scientists believe the full impact is yet to be revealed.\n\n\n\n\n\nAssociate professor at Thailand's Naresuan University, Tanapon Phenrat, explains: \"Pollutants take time to transport.\"\n\n\n\n\n\n\"When we say arsenic, lead, they are in particulate format — small sediments that form in the river. These things do not transport as fast as water,\" Phenrat says.\n\n\n\n\n\n\"But if upstream mining keeps discharging this in the same fashion, it will form more particulates, more sediment and will transport, wave by wave, there will be more impact for sure. This is not at a steady state yet.\"\n\n\n\nThai fishermen are reporting finding deformed fish in the Mekong River and its tributaries. Credit: Supplied Thailand, Laos and Myanmar all meet on the Mekong River. It then continues downstream into Cambodia and Vietnam, supporting 60 million people through fisheries, agriculture and drinking water before emptying into the South China Sea.\n\n\n\n\n\nThat is how far environmentalists are warning the contamination could spread if it is not contained.\n\n\n\n\n\n\"This is the largest environmental crime I have ever experienced,\" International Rivers' Pianporn Deetes says.\n\n\n\n\n\n\"You can do rare earth mining in an accountable manner. But this is open mining.\n\n\n\nThey are just allowing everything to spill into the waterways. It is unacceptable.\n\nStudies have shown long-term exposure to high levels of arsenic is linked to increased rates of cancer and skin disease.\n\n\n\n\n\nThe World Health Organization says in utero and early childhood exposure has also been associated with negative impacts on cognitive development and premature death.\n\n\n\n\n\n\"It is long-term violence,\" Deetes says.\n\n\n\nThe Mekong River supports 60 million people as it makes its way through Southeast Asia. Credit: SBS News / Claudia Farhart \"The result might not be seen within a year or two, but it might show itself in the next three, five or 10 years in newborn babies.\n\n\n\n\n\n\"Public health is the biggest issue for us. We don't want our future generations to be sick. So I think it is important for the government to recognise the level of the crisis as it is, and fix the problem immediately.\"\n\n\n\nMounting evidence of illegal mining\n\nThe Thai government denies it is ignoring the issue, and says it is engaging with Myanmar's military government to find a solution.\n\n\n\n\n\nIts own mapping also points to a recent surge in mining activity. Bangkok's Geo-Informatics and Space Technology Development Agency has now detected 60 disturbed earth sites across Shan State with suspected links to mining, 21 of which it says are newly active this year.\n\n\n\nIt doesn't distinguish between regular mines and rare earth mines, but mapping conducted by the SHRF has detected a total of 47 rare earth mining sites across Shan State.\n\n\n\n\n\nSamples taken from the Kok River by Naresuan University in a study commissioned by the Thai government, led by Phenrat, have only added to the weight of evidence that rare earth mining is behind the contamination.\n\n\n\n\n\n\"We took water, soil, sediment and some edible plants together with fish from five stations in Chiang Rai [Thailand's northernmost province],\" Phenrat says.\n\n\n\n\n\n\"We quantified around 15 types of elements or ions in water samples.\n\n\n\n\n\n\"Then we compared the 'fingerprints of chemicals' — which is the ratio of different elements — with water samples we got from rare earth mining in Kachin State in Myanmar. The concentration in Thailand is lower, but the ratio of chemicals is similar.\n\n\n\n\n\n\"This should lead to the conclusion, or at least the identification, that the contamination has to do mostly with rare earth mining.\"\n\n\n\nPhra Mahanikom was born and raised on the Kok River. He says the water is their way of life. Credit: SBS News / Claudia Farhart\n\nWay of life under threat\n\nPhra Mahanikom was born and raised in Tha Ton. After moving away to study, he returned to preside over Wat Tha Ton; a temple perched on a hilltop that overlooks the village and its river.\n\n\n\n\n\n\"I bathed in the Kok River on the day I was born,\" he says.\n\n\n\n\n\n\"When I heard the news, I went onto the bridge and I looked out onto the river. It was muddy, very muddy.\n\n\n\n\n\n\"That day, I felt like my mother was in the ICU and I was behind the glass doors. I couldn't speak to her, I couldn't touch her, I couldn't give her support – even one bit. That's how I felt.\"\n\n\n\n\n\nThat, Mahanikom says, is the reality of his community's connection to the river.\n\n\n\nLa Boonruang has lived in this house by the Kok River for more than 50 years. Credit: SBS News / Claudia Farhart Tha Ton is a village of less than 20,000 people. Almost all of them rely on the river in some way for their survival.\n\n\n\n\n\n\"They grow vegetables and they need the Kok River to water them. Now, we don't know for sure if these vegetables can be eaten,\" he says.\n\n\n\nSome people say they can, but if you can avoid it, you should avoid it. And what if they sell the vegetables and something bad happens afterwards? These are their worries.\n\nRight now, during the wet season, there is enough water running off the region's mountains to keep their crops watered. But soon, the village will once again need to rely on water from the river.\n\n\n\n\n\nLa Boonruang has lived in the same house right beside the Kok River for more than 50 years. He says farming and fishing are all he has ever known.\n\n\n\n\n\n\"Now, I feel like I cannot breathe properly, because when I wake up, I see this and I don't know what else will come,\" he says, pointing to the river.\n\n\n\n\n\n\"Before, if we didn't have enough water, we could just go get it from the river and carry it to our farms. But now, it is very dangerous.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/woolworths-and-coles-failed-record-keeping-obligations-as-underpayment-saga-continues/qmlkxphm3",
    "title": "Woolworths and Coles failed record-keeping obligations on overtime, court finds",
    "publish_date": "Fri, 5 Sep 2025 08:48:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "Allegations of rampant employee underpayment at Coles and Woolworths that affected almost 30,000 staff remain unresolved two years after a lengthy trial.\n\n\n\n\n\nOn Friday, the Federal Court handed down a judgment on four cases against the supermarket giants after a watchdog argued there was tacit approval of illegal conduct in many stores.\n\n\n\n\n\nWoolworths and Coles have repaid $330 million and $7 million respectively to managers who were not properly paid entitlements due to them as salaried employees, justice Nye Perram said.\n\n\n\n\n\nBut the Fair Work Ombudsman and former grocery store employees behind two class actions say the market leaders should be forced to pay more.\n\n\n\n\n\nThe watchdog argued the relevant award set out a 38-hour work week, but there was tacit approval to allow people to work overtime regularly.\n\n\n\n\n\nIt says there were failures in the use of \"informal\" rosters, time off in lieu and record-keeping on overtime, penalties and allowances.\n\n\n\n\n\nBut Woolworths said some employees were authorised to work up to 45 hours a week, and they were not required to do overtime beyond that.\n\n\n\nWoolworths has already repaid $300 million to managers who were not properly paid entitlements that were due to them. Source: AAP / Con Chronis Coles argued managers had autonomy over their hours, and the estimates of working hours and days were overestimated by the Fair Work Ombudsman.\n\n\n\n\n\nPerram found both supermarket chains did not comply with their obligation to keep accurate employment records.\n\n\n\n\n\nHe noted Coles failed to operate an overtime system for managers and its clocking records were unreliable.\n\n\n\n\n\nOne of the lead litigants, who mostly managed the customer service desk, likely worked on days when she was not rostered, so roster sheets were not indicative of the hours worked, the judge said.\n\n\n\n\n\nHer phone records could better demonstrate when she was at work, the judge found, while dismissing Coles' arguments she had not missed unpaid meal breaks.\n\n\n\n\n\nThe woman, whose pay was docked for Coles-branded clothing, was also entitled to a clothing and laundry allowance.\n\n\n\n'Unacceptably complex'\n\nThe judge used his 82,000-word judgment to criticise all sides, including the Fair Work Ombudsman, for making the case \"unacceptably complex\".\n\n\n\n\n\nThe parties mainly wanted answers about how the general retail award applied, but got bogged down presenting myriad case studies to the court.\n\n\n\n\n\nThe ombudsman's case against Woolworths involved 32 managers at five locations across Sydney, Melbourne and Brisbane from June 2015 to September 2019.\n\n\n\n\n\nThe case against Coles involved 42 managers, some of whom were employed in multiple shops, from 2017 to 2020.\n\n\n\nColes failed to operate an overtime system for managers and its clocking records were unreliable, justice Nye Perram said. Source: AAP / Con Chronis \"Whilst I would not wish to [be] definitive about how litigation of this kind might be handled in the future, I am confident that they should not be handled the way these four cases were,\" Perram said. \"This should not be done again.\"\n\n\n\n\n\nHe will conduct a case management hearing in October to determine the next steps and compensation for the affected 27,700 employees.\n\n\n\nColes and Woolworths respond\n\nIn a statement, Coles said that it has now paid $30 million in remediation to affected employees.\n\n\n\n\n\nsaid it hoped Perram's judgment would provide \"much-needed clarification\" on the industry award and Fair Work Act.\n\n\n\n\n\n\"We [have] introduced new processes and safeguards to ensure this won't happen again,\" a spokesperson said.\n\n\n\n\n\n\"We again apologise to our team members who were affected.\"\n\n\n\n\n\nWoolworths pointed to the remediation paid to affected employees and said further payments would need to be scrutinised carefully.\n\n\n\n\n\n\"We are focused on resolving these underpayment issues,\" chief executive Amanda Bardwell said.\n\n\n\n\n\n\"We are committed to ensuring that our team members are paid correctly.\"\n\n\n\n\n\nFriday's decision would also provide guidance to other employers and workers affected by the general retail award, particularly those on annualised salaries, the Fair Work Ombudsman said.\n\n\n\n\n\nThe watchdog is seeking both rectification of underpayment as well as penalties against Coles and Woolworths.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/aria-chart-changes-to-bring-diversity-of-artists-and-is-the-rba-done-with-cutting-interest-rates/7qp73zdz6",
    "title": "ARIA chart changes to bring diversity of artists - and is the RBA done with cutting interest rates?",
    "publish_date": "Fri, 5 Sep 2025 08:20:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/celebrating-the-life-and-legacy-of-giorgio-armani/7lrtqn8g0",
    "title": "Celebrating the life and legacy of Giorgio Armani",
    "publish_date": "Fri, 5 Sep 2025 03:18:44 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"A series of circumstances brought me into the world of fashion. I was unhappy about the world that was around me, because since I was very young, I realised that there were things that I didn't like, even sometimes when my mother would set up a table, I didn't like the way she did it, so I was somehow a victim of destiny.\"\n\n\n\n\n\nGiorgio Armani, the visionary designer who redefined modern elegance, has died in Milan at the age of 91.\n\n\n\n\n\nHis death leaves not only a void in fashion, but also raises questions about the future of the empire he built with unwavering independence.\n\n\n\n\n\nWomen's Wear Daily Style Director Alex Badia says his empire extended beyond fashion and perfumes.\n\n\n\n\n\n\"The idea that you not only wear Armani, but you eat on an Armani plate, you eat Armani chocolates, you sit in an Armani chair. It's a whole world. And then the fact that he opened even hotels that now it seems to be the thing to do, but he did it back then. He was the first.\"\n\n\n\n\n\nOn the streets of Rome, locals spoke of the man behind the brand.\n\n\n\n\n\nMaurizio Baldi says Mr Armani has left behind an undeniable legacy.\n\n\n\n\n\n\"I'm sorry, but his name will be remembered forever in the design and fashion world and as a symbol of Italy in the world, for sure.\"\n\n\n\n\n\nBorn in 1934, Giorgio Armani started in fashion while studying medicine.\n\n\n\n\n\nHe rose from window dressing to designing for Nino Cerruti in the mid-1960s, before launching his label with his romantic partner Sergio Galeotti in 1975, ushering in a relaxed, unstructured silhouette that became his signature.\n\n\n\n\n\nHis breakthrough came with Hollywood blockbuster film American Gigolo, where Richard Gere wore Armani.\n\n\n\n\n\nAlex Badia reflects that it placed Armani firmly amid fashion's global conversation.\n\n\n\n\n\n\"His legacy is obviously this idea of the new power suit that happened in the 1980s. Fluidities of shoulders for men and women. This idea that when you make it, you buy an Armani suit. But you have incredible historical moments like 'American Gigolo' or even 'Miami Vice'. You have Julia Roberts in 1990 wearing the Golden Globes, wearing a suit by Armani with ties. There is so many endless memories and milestones for Mr Armani and the brand.\"\n\n\n\n\n\nOutside an Armani store in Rome, Jenny O'Donnell was saddened by the news.\n\n\n\n\n\n\"I feel terrible, I didn’t know he died until I just got an alert on my phone - and it's just tragic actually. I'm very sad, I just love all of his clothing. The store is right here. Look at everything. It's beautiful, iconic.\"\n\n\n\n\n\nMr Armani’s rise reached not only Hollywood, but beyond.\n\n\n\n\n\nHis suits became staples in boardrooms and on red carpets, while his gowns defined understated glamour.\n\n\n\n\n\nBut he was also a shrewd businessman, keeping sole ownership of a company with annual revenues of around A$4 billion (2.3 billion euros).\n\n\n\n\n\nIn Milan, Giulia Falco, a fashion producer, has called him irreplaceable.\n\n\n\n\n\n\"It's a terrible loss for the international fashion community. We'll see what is going to happen with the brand. For sure, Giorgio Armani was a great visionary, one of the biggest designers from Italy who changed the international fashion industry forever.\"\n\n\n\n\n\nGiuseppe Coleen, a painter, says Mr Armani set the highest standard.\n\n\n\n\n\n\"Very bad news, Armani has been number one for over 50 years, the pinnacle of Italian fashion in the world. He had a unique skill, exceptional for men's but also for women’s fashion. There was no one like him and I think it will be a long time before anyone can reach the level of Armani.\"\n\n\n\n\n\nItaly's Prime Minister, Giorgia Meloni, has called him \"a symbol of the best of Italy\".\n\n\n\n\n\nTributes have poured in from around the globe.\n\n\n\n\n\nVictoria Beckham describes him as a true legend, while designer Valentino says he bowed to Armani’s immense talent.\n\n\n\n\n\nSamuel L Jackson thanked him for years of friendship, and Julia Roberts called him a true friend, a legend.\n\n\n\n\n\nIn London, Naomi Pike, the commissioning editor for Elle Magazine, spoke of Mr Armani's rise.\n\n\n\n\n\n\"It's a great loss. Mr Armani leaves such a legacy, quite a singular impact in the way that he changed the way that the world dresses, especially the way we consider tailoring and suiting, but also as a businessman with a huge empire that he started by selling his Beetle car. It's, you know, it's a fairytale story, which also speaks of a lot of hard work, graft, foresight, and being a visionary.\"\n\n\n\n\n\nAs Milan prepares to honour him with a public viewing at the Armani-Teatro this weekend and a private funeral to follow, the tributes continue for the man whose designs changed how the world dresses.\n\n\n\n\n\nSo what is to come of the Armani empire?\n\n\n\n\n\nIn 2016, Giorgio Armani created a foundation to safeguard his legacy and set bylaws to govern the business after his death.\n\n\n\n\n\nThese rules mandate a cautious approach to acquisitions and forbid any public listing for at least five years.\n\n\n\n\n\nLeadership is expected to remain with his sister Rosanna, nieces Silvana and Roberta, nephew Andrea Camerana, and trusted collaborator Pantaleo Dell’Orco, all of whom already hold senior roles.\n\n\n\n\n\nMr Armani himself described succession as an organic process, not a sudden rupture, ensuring the brand remains true to his vision of independence and elegance.\n\n\n\n\n\nAlex Badia, once again.\n\n\n\n\n\n\"His legacy is so, so strong. His vision's so unique that I don't think they need a new designer face. They just need to continue the brand, the legacy. There are very few companies that can do this. Ralph Lauren can do the same. There's such a strong identity done by years of repetition and always a very similar message and not following trends, not caring about hype.\"\n\n\n\n\n\nGiorgio Armani’s creations transformed how the world dresses. His business reshaped luxury fashion, and his values of simplicity and restraint became his signature.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/albanese-has-warm-and-constructive-call-with-trump/uejgn2k9k",
    "title": "Albanese hails 'constructive' talk with Trump amid calls for in-person meeting",
    "publish_date": "Thu, 4 Sep 2025 22:35:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prime Minister Anthony Albanese has held further talks with United States President Donald Trump on trade and security, but there's no word yet on when the pair will meet face-to-face.\n\n\n\n\n\nAlbanese revealed the leaders spoke in a social media post just before midnight on Thursday.\n\n\n\n\n\nIt was the fourth phone call between the pair, which Albanese said was \"warm and constructive\".\n\n\n\n\n\n\"We discussed our trade and economic relationship as well as areas for growth, including critical minerals,\" he said in the post on X.\n\n\n\n\n\n\"We also discussed shared US-Australia security interests.\"\n\n\n\nA readout of the meeting said Albanese discussed economic cooperation, as well as trade and critical minerals important to both countries.\n\n\n\n\n\n\"Leaders also discussed the strength of our relationship and the importance of our shared security interests,\" it said.\n\n\n\n\n\nBut there was no word on when the two leaders will hold their first face-to-face meeting, which Australia has been pursuing since Trump's return to the presidency in November.\n\n\n\n\n\nThe two were expected to have talks in June on the sidelines of a G7 summit in Canada, but the meeting was cancelled after Trump returned to the US early to deal with issues in the Middle East.\n\n\n\nREAD MORE Albanese defends cancelled Trump talks as new meeting opportunity emerges\n\nThe call took place just weeks ahead of a United Nations general assembly meeting, which Trump will also attend, at which Australia is expected to join the United Kingdom, France, Canada and others in pushing for the recognition of a Palestinian state.\n\n\n\n'Lots going on in the US-Australia relationship'\n\nAustralian ambassador to the US, Kevin Rudd, welcomed the phone call between the two leaders.\n\n\n\n\n\n\"Lots going on in the US-Australia relationship. And going from strength to strength,\" he said on X.\n\n\n\nThe phone call coincides with Australia's efforts to persuade the US to drop tariffs on its exports.\n\n\n\n\n\nTrump imposed a baseline tariff of 10 per cent on all Australian goods to the US and a 50 per cent tariff on steel and aluminium.\n\n\n\n\n\nAt the same time, the US is reviewing the AUKUS trilateral security alliance, under which Australia is expected to spend $386 billion on nuclear-powered attack submarines.\n\n\n\n\n\nThe US has been pushing Australia to raise its defence spending to 3.5 per cent of gross domestic product.\n\n\n\nThe government is currently spending 2.02 per cent with a view to increasing that sum to 2.33 per cent of GDP by 2033/34.\n\n\n\n\n\nEmployment Minister Amanda Rishworth said the phone call between the two leaders expanded on ties between the allies.\n\n\n\n\n\n\"We have the lowest trade tariffs of any country in the world when it comes to the US, but no doubt, this builds on what is already a warm relationship between the two of them,\" she told Seven's Sunrise program on Friday.\n\n\n\n\n\n\"As the prime minister has indicated, they'll meet when it's convenient for both parties.\n\n\n\n\n\n\"Clearly, there's a connection there with four phone calls,\" she said.\n\n\n\nBut Liberal senator Jane Hume told Seven's Sunrise program more work needed to be done to secure a face-to-face meeting with Trump.\n\n\n\n\n\n\"It's been 300 days now since President Trump has was elected, and still no meeting between our leaders, and that's a concern.\n\n\n\n\n\n\"We want Anthony Albanese to step up and represent Team Australia with President Trump, and particularly to secure our AUKUS agreements.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/politics/queensland/no-dates-for-hearings-yet-but-cfmeu-inquiry-has-considerable-work-under-way-20250904-p5mshq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "No dates for hearings yet, but CFMEU inquiry has ‘considerable work’ under way",
    "publish_date": "Sat, 06 Sep 2025 11:40:00 +1000",
    "category": "finance",
    "authors": [
      "Matt Dennien"
    ],
    "text": "The news\n\nA powerful inquiry into Queensland’s CFMEU branch is preparing to detail its opening public hearing after “considerable work”, mostly done behind the scenes, in its first month of operation.\n\nThe commission of inquiry, led by conservative barrister Stuart Wood AM KC this week announced three experienced lawyers had been appointed as counsel assisting.\n\nKate Juhasz (left), Liam Kelly KC (second from right) and Polina Kinchina (right) have been named counsel assisting the Queensland CFMEU Commission of Inquiry, led by Stuart Wood AM KC (centre), with help from secretary Bob Gee (second from left). Credit: Lucas Chambers, file, LinkedIn, Murray Gleeson Chambers.\n\n“The commission has been undertaking a range of work consistent with its terms of reference with an opening public hearing to be announced in the near future,” a spokesperson told this masthead.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/sport/afl/should-not-umpire-in-these-finals-again-afl-great-slams-rayner-free-kick-20250906-p5mswa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Should not umpire in these finals again’: AFL great slams Rayner free kick",
    "publish_date": "Sat, 06 Sep 2025 11:13:40 +1000",
    "category": "sports",
    "authors": [
      "Danny Russell"
    ],
    "text": "Loading\n\nPremiership captain Tony Shaw has called for the umpire at the centre of Friday night’s Cam Rayner free-kick debacle to be sidelined for the remainder of the finals series for a decision the AFL has conceded should not have been paid.\n\nAnother AFL great, Matthew Lloyd, believes Rayner could be fined for staging after the controversial moment at the MCG in which the Brisbane forward kicked two goals from two free kicks just before half-time.\n\nThe Cam Rayner moment. Credit: Fox Footy\n\nUmpire Brent Wallace awarded Rayner the first penalty in the Brisbane goal square after he was nudged in the back by opponent Mark O’Connor and hit the deck, a moment that sent the Geelong crowd apoplectic.\n\nIt happened while Cats forward Tyson Stengle was lining up for a shot at goal at the opposite end of the ground.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/alcaraz-makes-short-work-of-djokovic-20250906-p5mswe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Alcaraz makes short work of Djokovic",
    "publish_date": "Sat, 06 Sep 2025 10:56:32 +1000",
    "category": "finance",
    "authors": [],
    "text": "Alcaraz makes short work of Djokovic\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/carlos-alcaraz-beats-novak-djokovic-in-three-sets-to-reach-us-open-final-20250906-p5msvn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It comes with time and with age’: Djokovic falls again to athletic Alcaraz",
    "publish_date": "Sat, 06 Sep 2025 10:17:00 +1000",
    "category": "sports",
    "authors": [
      "Howard Fendrich"
    ],
    "text": "New York: Carlos Alcaraz used his youth, athleticism and creativity to assert himself against the much more accomplished, but also much older, Novak Djokovic and beat the 24-time major champion 6-4, 7-6 (4), 6-2 at the US Open on Friday (Saturday morning AEST) for a berth in his third consecutive grand slam final.\n\nBy the end, Djokovic was “gassed out,” as he described it afterward, and seemed resigned to the result. The 38-year-old from Serbia reached the semi-finals at all four slams this season but exited in that round each time, three via losses to No. 2 Alcaraz, 22, or No. 1 Jannik Sinner, 24.\n\nCarl;os Alcaraz’ athleticism shone through in his semi-final win over Novak Djokovic. Credit: Getty Images\n\n“It’s frustrating on the court when you are not able to keep up with that level physically, but at the same time, it’s something also expected, I guess,” Djokovic said. “It comes with time and with age.”\n\nAlcaraz will face either defending champion Sinner or No. 25 Felix Auger-Aliassime for the championship on Sunday, when President Donald Trump plans to attend. Sinner could become the first repeat men’s champion in New York since Roger Federer won the hard-court tournament five years in a row from 2004 through 2008.",
    "source": "TheAge",
    "cluster_id": 12
  },
  {
    "url": "https://www.theage.com.au/national/victoria/pooch-perfect-a-dog-s-journey-from-the-outback-to-pampered-city-digs-20250828-p5mqk1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pooch perfect: A dog’s journey from the outback to pampered city digs",
    "publish_date": "Sat, 06 Sep 2025 10:00:00 +1000",
    "category": "finance",
    "authors": [
      "Carolyn Webb"
    ],
    "text": "Today, she’s a city dog, trotting along Melbourne pavements on a leash, but glimpses of Moana’s past life in an outback town remain.\n\nThe terrier hates being alone, says owner Paul Gosney, and won’t wear a coat. At the beach, she loves sand but not water.\n\nMoana the terrier in Melbourne with owner Paul Gosney, his mother, Irene, and Aussie Desert Dogs founder Gloria Morales. Credit: Chris Hopkins\n\nBut he says Moana is “an amazing soul” who is now a cherished family pet.\n\nMoana is among 1800 unwanted “camp dogs” from Yuendumu, in the Northern Territory, that have been sent to new homes across Australia, under the not-for-profit program Aussie Desert Dogs.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/the-one-panther-who-really-needed-a-break-20250825-p5mpni.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The one Panther who really needed a break",
    "publish_date": "Sat, 06 Sep 2025 09:33:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Loading\n\nOne player who would have welcomed the rest more than any other Penrith teammate last weekend was Dylan Edwards.\n\nEdwards has been one of the standout performers for the premiers for several years, is the NSW and Kangaroos’ fullback incumbent, but has struggled under the high ball and with handling errors in the past two games he has played.\n\nPenrith’s Dylan Edwards had a couple of rough weeks before enjoying a break. Credit: NRL\n\nThere was a loose carry at the start of golden point against the Storm before Harry Grant took full advantage of the field position to score a try.\n\nThen there was another dropped ball, which allowed Canberra’s Ethan Strange to score in regulation time, before the Raiders went on to win the Miracle in Mudgee in golden point.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/world/north-america/the-61-takeaway-lunch-that-just-proves-lobster-is-overrated-20250902-p5mro2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The $61 takeaway lunch that just proves lobster is overrated",
    "publish_date": "Sat, 06 Sep 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Michael Koziol"
    ],
    "text": "What in the World, a free weekly newsletter from our foreign correspondents, is sent every Thursday. Below is an excerpt. Sign up to get the whole newsletter delivered to your inbox.\n\nNew York: The late, great Christopher Hitchens once named champagne, picnics and lobster among the most over-rated pleasures in life. On the latter, I’d have to concur.\n\nEspecially when you’re paying $US40 ($61) for the privilege. That’s how much the Maine-style lobster roll from Red Hook Lobster Pound will set you back at the US Open in New York.\n\nChristopher Hitchens would not approve: the $US40 ($61) - each - Maine lobster roll at Flushing Meadows. Total for two = $122. Credit: Michael Koziol\n\nThe price tag didn’t seem to deter the punters, though, who were lined up to splash their cash at lunchtime on Tuesday between two big matches at the adjacent Arthur Ashe Stadium.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/waugh-chest-how-rugby-australia-should-spend-their-incoming-millions-20250905-p5msn6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Waugh chest: How Rugby Australia should spend their incoming millions",
    "publish_date": "Sat, 06 Sep 2025 09:30:00 +1000",
    "category": "finance",
    "authors": [
      "Paul Cully"
    ],
    "text": "Rugby Australia bosses Phil Waugh and Dan Herbert clearly didn’t come down in the last shower.\n\nGiven Australian rugby’s chequered track record with financial windfalls, the pair recognise that trumpeting wealth would be almost as dangerous as advertising financial distress.\n\nAfter paying off RA’s $60 million debt in one fell swoop with proceeds from the British and Irish Lions tour, they were at pains this week to emphasise that there’s still hard work ahead — signalling to all the hungry mouths out there (and player agents) that there would be no giveaways.\n\nBut they won’t be able to hide their robust position for long, and next year’s annual report will show how much they have banked after clearing the debt.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/will-dylan-brown-hand-his-next-team-the-knights-the-wooden-spoon-20250904-p5msb5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Will Dylan Brown hand his next team – the Knights – the wooden spoon?",
    "publish_date": "Sat, 06 Sep 2025 09:22:00 +1000",
    "category": "sports",
    "authors": [
      "Robert Dillon"
    ],
    "text": "He has signed the richest contract in rugby league history, ostensibly on the basis that he can help transform Newcastle into premiership contenders.\n\nBut before Dylan Brown clocks on for his first lucrative shift with the Knights, he has one last job at Parramatta, and it could leave his future employers in a world of pain.\n\nIn a remarkable irony, Brown has been recalled for his 142nd – and last – appearance for the Eels, which happens to be Sunday’s final-round clash with Newcastle at CommBank Stadium.\n\nFrom a Parramatta perspective, there is little riding on the outcome other than the chance to send Brown out on a winning note, end coach Jason Ryles’ rookie season with a third successive victory, and climb from 12th to 11th on the ladder, leapfrogging Wests Tigers.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/car-fire-in-sydney-s-west-overnight-20250906-p5msw0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Car fire in Sydney’s west overnight",
    "publish_date": "Sat, 06 Sep 2025 09:06:21 +1000",
    "category": "finance",
    "authors": [],
    "text": "Car fire in Sydney’s west overnight\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/wedding-venue-in-sydney-s-north-west-goes-up-in-flames-20250906-p5msvx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wedding venue in Sydney’s north-west goes up in flames.",
    "publish_date": "Sat, 06 Sep 2025 09:04:10 +1000",
    "category": "finance",
    "authors": [],
    "text": "Wedding venue in Sydney’s north-west goes up in flames.\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/lifestyle/duchess-of-kent-dies-aged-92-20250906-p5msvu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Duchess of Kent dies aged 92",
    "publish_date": "Sat, 06 Sep 2025 08:46:05 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Duchess of Kent dies aged 92\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/lifestyle/novotna-reflects-on-wimbledon-defeat-20250906-p5msvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Novotna reflects on Wimbledon defeat",
    "publish_date": "Sat, 06 Sep 2025 08:46:03 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Novotna reflects on Wimbledon defeat\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  }
]