[
  {
    "url": "https://www.9news.com.au/national/richard-scolyer-australian-of-the-year-gives-update-in-battle-with-brain-cancer/4f9d1087-5463-48d3-a645-1d3fa8ab62f7",
    "title": "'Worried': Australian of the year gives update in battle with brain cancer",
    "publish_date": "Sat, 10 May 2025 00:13:05 +0000",
    "category": "lifestyle",
    "authors": [
      "May"
    ],
    "text": "Former Australian of the Year and pathologist Professor Richard Scolyer has given a health update in his battle with brain cancer.\n\nScolyer, aged 58, was diagnosed with an aggressive glioblastoma in 2023 and was given just eight months to live.\n\nScolyer and co-director of the Melanoma Institute, Georgina Long, used an experimental immunotherapy treatment for his glioblastoma and managed to keep it at bay for two years.\n\nAS IT HAPPENED: Vatican names first American Pope Leo XIV\n\nProf Richard Scolyer AO said he is worried about recent scans of his brain after his tumor returned in February (Instagram)\n\nHowever, after undergoing scans in February, Scolyer revealed his brain cancer had returned.\n\nHe underwent surgery in March to remove as much of the tumour as possible.\n\nThe doctor provided a health update to his Instagram yesterday, saying he was \"a bit worried\" after undergoing another scan.\n\n﻿\"I've had some different types of therapy to try and mop up what's left behind, trying to get rid of more of the tumour,\" he said in the video.\n\nScolyer, aged 58 was diagnosed with an aggressive glioblastoma in 2023 and was given just eight months to live. (Flavio Brancaleone)\n\n\"The problem with it is...there are little tentacles that go off at the periphery, so we've got to find a type of therapy that can mop up and cure those leftover wretched tumour cells that are there\n\n\"So, trying some different therapies, seeing if they'll work, and then depending on what their scan shows, I guess that'll help choose what the next forms of therapy that I can have.\n\nThe former Australian of the year said he was feeling \"a bit up and down\" after the scan.\n\n\"It's a tough journey at times, but other times I'm super happy,\" he said.\n\n\"Fingers crossed this operation won't be too bad, and we can move forward with the next form of therapy and hopefully push things along faster to try and get things opened up for many, many patients who've got glioblastoma﻿.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/pick-your-poison-showcase-football-clubs-join-forces-to-send-underprivileged-players-to-madrid-cup/c1c6f949-cce2-4317-97e3-dc6f84a4776d",
    "title": "Football clubs join forces to send underprivileged players to Madrid Cup",
    "publish_date": "Fri, 09 May 2025 22:38:02 +0000",
    "category": "sports",
    "authors": [
      "May"
    ],
    "text": "The saying \"follow your dreams\" never sat right with south-west Sydney local Enes Mohammad. What if you can't afford to follow them?\n\nMohammad is an organiser of the Pick Your Poison showcase, a coalition of grassroots football movements that have come together for one goal: to take a team of 16 ﻿men and teenagers to play in the Madrid Cup.\n\nThe coalition, including Project Volta, Field Invasion, Talente FC, and YB United, was created to \"address the systemic barriers\" facing young athletes in Sydney's lowest socio-economic areas.\n\nREAD MORE: Helicopter crashes into waters near Victorian peninsula\n\nEnes Mohammad grew up playing soccer in Bass Hill, in Sydney's south-west. (Supplied)\n\n\"Follow your dreams is a very cliche thing to say...we live in a country where there are systematic barriers in front of us,\" Pick Your Poison organiser and co-founder of Project Volta, Mohammad said.\n\n\"﻿Your level and your profession in football should not be dependent on your socio-economic level... just because you live in Bass Hill and someone else lives in Vaucluse, that person should not have a better likelihood of going professional than you.\n\n\"﻿It (should) all come down to your talent and drive, but that's not the case (in Australia).\n\n\"We have a very out-of-date, ridiculously shaped system...everything is pay to play... you don't have money for an academy? You can't play, (and) there are no scholarships.\" ﻿\n\n﻿Romeo Jambrek (Supplied)\n\nMohammad grew up playing soccer in Bass Hill, in Sydney's south-west. He says being able to be a part of an opportunity like this felt like \"his purpose\" in life.\n\n\"We used to have a lot of players that we grew up with, friends and family that you would see how good they are,\" Mohammad said.\n\n\"It would blow your mind the ridiculous talent that they had, but we didn't have these opportunities growing up.\"\n\n\"We knew well in our hearts that we have good enough footballers in Australia to at least go to Spain, whether or not they're successful is another story... as long as they are playing in front of the scouts.\n\n\"That's all that matters.\"\n\nThe team consists of men aged 16 to 19 from areas in Sydney like Casula, Arncliffe, Rockdale, Liverpool, Lurnea, Brighton and Penrith.\n\nREAD MORE: Helicopter crashes into waters near Victorian peninsula\n\nRomeo Jambrek is one of the hopefuls trying to make it to Spain.\n\nJambrek lives in Canberra, but says it's nearly impossible to find opportunities to \"go pro\" outside of his hometown.\n\n\"This opportunity doesn't come around often, I've travelled from Canberra to Sydney just to join and hopefully get the opportunity to play (in Madrid),\" Jambrek said.\n\n\"It would be a massive opportunity for me...all my life, since I was young, my dream and aspiration was to be a professional footballer.\"\n\n\"I'm of Croatian ethnicity… my grandma's favourite team is Dinamo Zagreb, she said if she saw me play for that team it would be amazing, that's the team I've dreamed of playing for.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/trump-floats-raising-taxes-on-the-rich-to-pay-for-his-sweeping-tax-and-spending-cuts-package/f39c9755-b2d0-4ecb-ab37-e4299e2488cd",
    "title": "Trump floats raising taxes on the rich to pay for his sweeping cuts",
    "publish_date": "Fri, 09 May 2025 22:56:12 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "President Donald Trump said he's open to hiking taxes on wealthy Americans to help pay for Republicans' sweeping tax and spending cuts package, but the idea remains hotly contested among GOP lawmakers on Capitol Hill.\n\nIn a Truth Social post Friday morning, Trump said that he would \"graciously accept\" even a \"TINY\" tax increase on the rich, while acknowledging that it could bring political risks for Republicans.\n\nHouse GOP lawmakers have been struggling to find $US1.5 trillion ($2.3 trillion) in spending cuts to help offset trillions of dollars of tax reductions.\n\nIn a Truth Social post Friday morning, Trump said that he would \"graciously accept\" even a \"TINY\" tax increase on the rich. (CNN)\n\n\"The problem with even a 'TINY' tax increase for the RICH, which I and all others would graciously accept in order to help the lower and middle income workers, is that the Radical Left Democrat Lunatics would go around screaming, 'Read my lips,' the fabled Quote by George Bush the Elder that is said to have cost him the Election.\n\n\"NO, Ross Perot cost him the Election!\" Trump wrote.\n\n\"In any event, Republicans should probably not do it, but I'm OK if they do!!!\" he continued.\n\nTrump also mentioned the possibility of letting tax cuts expire on top earners – targeting individuals who earn at least $US2.5 million ($3.8 million) or couples that make at least $US5 million ($7.7 million) — in a call with House Speaker Mike Johnson on Wednesday, a Republican source familiar with the matter told CNN's Dana Bash.\n\nThe White House has made the suggestion to Congress with the thought that not only would it help achieve much needed offsets, it could also help wipe away Democrats' argument about tax cuts for the rich, the source familiar said.\n\nTrump also mentioned the possibility of letting tax cuts expire on top earners – targeting individuals who earn at least $US2.5 million. (Bloomberg)\n\nThis is not the first time Trump has indicated that he supports raising taxes on the wealthy, even though throughout last year's presidential campaign, he repeatedly promised to cut their taxes.\n\nThe president recently told Time magazine, \"I actually love the concept,\" when asked about a proposal circulating to raise taxes for those earning more than $US1 million ($1.5 million) a year.\n\nThe idea, however, is not being warmly embraced among the House GOP and is far from guaranteed to make it into the president's final \"one big beautiful\" bill, which aims to make permanent the sweeping Trump 2017 tax cuts and incorporate the president's campaign promises to eliminate taxes on tips and certain other income.\n\nJust extending the 2017 individual tax provisions – which expire at the end of this year – could cost more than $US4 trillion ($6.2 trillion).\n\nRepublican lawmakers are also fractured on how deeply they'd have to cut spending – including on Medicaid and food stamps – to meet their targets.\n\nWithin the House Ways and Means Committee, members have discussed two ideas.\n\nOne is to let the tax breaks for the richest Americans expire, returning their top income tax rate to 39.6 per cent – which is what it was before Trump's 2017 tax overhaul – from the current 37 per cent.\n\nREAD MORE: Music megastar spotted among crowds celebrating new pope\n\nThe president recently told Time magazine, \"I actually love the concept,\" when asked about a proposal circulating to raise taxes for those earning more than $US1 million. (AP Photo/Jacquelyn Martin)\n\nThis has drawn some criticism, however, as some Republicans fear it could impact small business owners.\n\nBut it could hit roughly 1.5 million households and cut about $US409 billion ($636 billion) of the cost, as well as greatly limit potential economic growth from making the tax cuts permanent, according to the Tax Foundation, a right-leaning think tank.\n\nAnother idea is to create a brand-new tax bracket for the wealthy.\n\nThe proposal, though limited in scope, could contribute to offsetting costly tax provisions, such as restoring the state and local tax deduction – known as SALT – that has become another flashpoint in Congress' tax debate.\n\nThe new tax bracket would raise about $US59.3 billion ($92 billion) over a decade, according to the Tax Foundation.\n\nAnd it would affect between 150,000 and 200,000 households and would have a much smaller dampening effect on the package's economic growth potential.\n\nDespite Trump's apparent openness to raising taxes on the wealthy, his economic adviser said Friday that the president \"is not a strong advocate\" of the idea. (Bloomberg)\n\nLevying a higher income tax rate on the very wealthiest of Americans would raise less money because much of that group's earnings come from dividends and capital gains, which are taxed at lower rates, said Garrett Watson, the foundation's director of policy analysis.\n\nAlso, there are much fewer of them.\n\nOne of the considerations for Republicans is what the goal of such a provision would be – to limit how much of the benefit is going to the rich or to raise more money to offset other tax cuts, Watson said.\n\nDespite Trump's apparent openness to raising taxes on the wealthy, his economic adviser said Friday that the president \"is not a strong advocate\" of the idea.\n\nAsked whether Trump is seriously considering taxing the rich to pay for his budget bill, National Economic Director Kevin Hassett said: \"The president is not a strong advocate of that, but he is a strong advocate of many things like no tax on tips, no tax on overtime, and nice treatment for auto loans.\"\n\n\"He has cited his priorities, and he understands that in the end, the final bill will include some priorities of members of the House of the Senate.\n\nThat's how the democratic process works, and that's really what this conversation is about.\"\n\nWhen asked how the White House expects to pay for the bill Hassett argued Congress has already identified clear areas for cuts. (AP)\n\nWhen asked how the White House expects to pay for the bill, given a number of its stated priorities are expensive, Hassett argued Congress has already identified clear areas for cuts, without detailing what they are and whether they are achievable.\n\n\"Well, the budget rules in the House and the Senate are very clearly identified that include spending cuts and so on, and they don't include dynamic scores,\" he told CNN .\n\n\"And so in the fullest of time with the spending cuts that we're achieving ,and the dynamic score of the tax bill, we're highly confident that we're going to reduce the deficit that make bond markets celebrate.\"\n\nHouse Ways and Means Chairman Jason Smith is expected to meet with Trump at the White House on Friday, and Hassett earlier told CNBC that he expects Smith will outline the House's schedule for the tax bill at some point during the day.\n\nHassett has been meeting almost weekly with Johnson, Treasury Secretary Scott Bessent and others regarding Congress' budget.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/pope-leo-xiv-celebrates-first-mass-as-pope/639ed606-f1e2-4924-b6c7-1168cd691ac2",
    "title": "Pope Leo XIV celebrates first Mass as pope",
    "publish_date": "Fri, 09 May 2025 13:38:41 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Pope Leo XIV, history's first US-born pontiff, said on Friday that his election was both a cross to bear and a blessing as he celebrated his first Mass as the head of the Catholic Church.\n\nLeo spoke off-the-cuff in English in the Sistine Chapel to the cardinals who elected him to follow in the footsteps of Pope Francis , who put a commitment to social justice at the core of his papacy.\n\nHe acknowledged the great responsibility they had placed on him before delivering a brief but dense homily on the need to joyfully spread Christianity in a world that often mocks it.\n\nNewly elected Pope Leo XIV concelebrates Mass with the College of Cardinals inside the Sistine Chapel at the Vatican the day after his election as 267th pontiff of the Roman Catholic Church, Friday, May 9, 2025. (Vatican Media via AP)\n\n\"You have called me to carry that cross and to be blessed with that mission, and I know I can rely on each and every one of you to walk with me as we continue as a church, as a community, as friends of Jesus, as believers, to announce the good news, to announce the Gospel,\" he said.\n\nIt was in the same frescoed chapel that Leo, the Chicago-born Augustinian missionary Robert Prevost, was elected on Thursday afternoon as the 267th pope, overcoming the traditional taboo against a pontiff from the United States because of the secular power the country wields.\n\nLeo will be formally installed as pope at a Mass on May 18, the Vatican said Friday, and will preside over his first general audience May 21.\n\nA Mass that may suggest his priorities\n\nTwo women delivered the readings of Scripture at the start of the Mass, perhaps an indication of Leo's intention to continue Francis' focus on expanding women's role in the church. As a cardinal, Leo put into practice one of Francis' most revolutionary reforms by having three women serve on the Vatican board that vets bishop nominations.\n\nSpeaking in near-perfect Italian, Leo lamented that the Christian faith in many parts of the world is \"considered absurd,\" mocked or opposed in the face of temptations such as money, success and power. He complained that in many places Jesus is misunderstood, \"reduced to a kind of charismatic leader or superman.\"\n\nNewly elected Pope Leo XIV, second from left, concelebrates Mass with the College of Cardinals inside the Sistine Chapel at the Vatican the day after his election as 267th pontiff of the Roman Catholic Church, Friday, May 9, 2025 (Vatican Media via AP)\n\n\"This is true not only among non-believers but also among many baptised Christians, who thus end up living, at this level, in a state of practical atheism,\" he said.\n\n\"A lack of faith is often tragically accompanied by the loss of meaning in life, the neglect of mercy, appalling violations of human dignity, the crisis of the family and so many other wounds that afflict our society.\"\n\nThe cardinals applauded as the Mass concluded. Leo was seen wearing simple black shoes — eschewing, as Francis did, the red loafers of the papacy preferred by some traditionalist popes.\n\nShortly thereafter, the Vatican said Leo had asked all Vatican leaders, who technically lost their jobs when Francis died on April 21, to remain in their posts until he decides definitively on whether to confirm them.\n\nFrancis had his eye on the new pope\n\nFrancis, the first Latin American pope, clearly had his eye on Prevost and in many ways saw him as his heir apparent. He sent Prevost, who had spent years as a missionary in Peru, to take over a complicated diocese there in 2014.\n\nFrancis brought Prevost to the Vatican in 2023 to head of the Vatican's powerful Dicastery for Bishops, which vets bishop nominations around the world and is one of the most important jobs in church governance.\n\nNewly elected Pope Leo XIV, seated at the back left, concelebrates Mass with the College of Cardinals inside the Sistine Chapel at the Vatican the day after his election as 267th pontiff of the Roman Catholic Church, Friday, May 9, 2025 (Vatican Media via AP)\n\nSince arriving in Rome, Prevost had kept a low public profile but was well known to the men who count, and respected by those who worked with him.\n\n\"Even the bishops of Peru called him the saint, the saint of the north, and he had time for everyone,\" said the Rev. Alexander Lam, an Augustinian friar from Peru who knows the new pope.\n\nAn Augustinian pope\n\nThe last pope to take the name Leo was an Italian who led the church from 1878 to 1903. Leo XIII softened the church's confrontational stance toward modernity, especially science and politics, and laid the foundation for modern Catholic social thought. His most famous encyclical — a high-level papal teaching — addressed workers' rights and capitalism at the beginning of the industrial revolution and was highlighted by the Vatican in explaining the new pope's choice of name.\n\nWhile Vatican News said Leo XIV is the first Augustinian pope, the previous Leo had close ties to the order: He rebuilt an ancient Augustinian church and convent near his hometown of Carpineto, outside Rome, that is still in use by the order today.\n\nVatican watchers said Prevost's decision to name himself Leo was particularly significant given the Leo XIII's legacy of social justice and reform, suggesting continuity with some of Francis' chief concerns. Specifically, Leo cited one of Francis' key priorities of making the Catholic Church more attentive to lay people and inclusive.\n\n\"He is continuing a lot of Francis' ministry,'' said Natalia Imperatori-Lee, the chair of religious studies at Manhattan University in the Bronx. She added that his election could send a message to the US church, which has been badly divided between conservatives and progressives, with much of the opposition to Francis coming from there.\n\nMackenzie Magas and Kaylee Mellentine from Missouri, pose for a photo with a newspaper showing the new Pope Leo XIV on the front page, in front of the St. Peter Basilica at the Vatican, Friday, May 9, 2025. (AP Photo/Markus Schreiber)\n\n\"I think it is going to be exciting to see a different kind of American Catholicism in Rome,'' Imperatori-Lee said.\n\nLeo said in a 2023 interview with Vatican News that the polarisation in the church was a wound that needed to be healed.\n\n\"Divisions and polemics in the church do not help anything. We bishops especially must accelerate this movement towards unity, towards communion in the church,\" he said.\n\nLeo's brother, John Prevost, was so shocked that his brother had been elected pope that he missed several phone calls from Leo during an interview on Thursday with The Associated Press.\n\nJohn Prevost described his brother, a fan of Wordle, as being very concerned for the poor and those who don't have a voice. He said he expects him to be a \"second Pope Francis.\"\n\n\"He's not going to be real far left and he's not going to be real far right,\" he added. \"Kind of right down the middle.\"\n\nLooking ahead\n\nIn his first hours as pope, Leo went back to his old apartment in the Sant'Uffizio Palace to see colleagues, according to selfies posted to social media. Vatican Media also showed him in the moments after his election praying in the Pauline Chapel before emerging on the loggia of St. Peter's Basilica to greet Rome and the world.\n\nOn Sunday, he is set to deliver his first noon blessing from the loggia and attend an audience with the media on Monday in the Vatican auditorium.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/womens-health-women-seeking-care-vulvovaginal-disorders-giving-up-over-poor-treatment/7ee5ff16-52f5-47a8-a11d-e6a5766ab6dc",
    "title": "Lily spent 30 years trying to get doctors to take her pain seriously",
    "publish_date": "Sat, 10 May 2025 01:23:18 +0000",
    "category": "lifestyle",
    "authors": [
      "May"
    ],
    "text": "For 30 years, doctors have been telling Lily* that the excruciating pain she experiences during sex is all in her head.\n\nIt's actually vaginismus, a common ﻿vulvovaginal disorders which causes involuntary vaginal muscle spasms. But after decades of poor experiences with healthcare providers she's given up on finding treatment.\n\nLily isn't alone; ﻿new research from the US revealed than one in two women ﻿seeking care for vulvovaginal disorders (including vaginismus) consider giving up due to poor experiences with healthcare professionals.\n\nFor 30 years, doctors have been telling Lily* that her pain is in her head. (Getty)\n\nThe ﻿study found that one in four patients felt belittled by medical professionals, one in five said they were not believed, and nearly two in five were made to \"feel crazy\".\n\nAbout 40 per cent said they had been told to \"relax more\" by a healthcare professional and 20 per cent claimed they were told to drink alcohol to manage their condition.\n\nThey're lines Lily's heard before right here in Australia.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\n\"Usually they will say that there's nothing wrong with you, this is basically in your head [...] you just need to try to relax during sex,\" she told 9news.\n\n\"I would go away with no major support, no referral to other professionals.\"﻿﻿\n\nDespite the constant setbacks, she kept seeking treatment until a recent gynecologist appointment with a ﻿killed the last shred of hope she'd been hanging onto.\n\nAfter describing her pain to the female ﻿gynecologist, Lily was asked if her husband's genitals were simply \"too big\" for her.\n\n\"I've had this problem for 30 years [...] to just put it down to the size of my husband's anatomy is so unprofessional,\" she said.\n\n\"That gave me the feeling like I might as well just give up if I see an experienced female gynecologist and that's her answer to the problem.\"\n\nThe US study found that more than ﻿52 per cent of participants gave up on seeking treatment as a result of poor experiences with medical professionals and Australian experts wouldn't be surprised if the statistics were similar here.\n\nGynaecologist lead at Jean Hailes for Women's Health Dr Pav Nanayakka (centre). (Instagram/@drpav.migs)\n\nGynaecologist lead at Jean Hailes for Women's Health Dr Pav Nanayakka has heard many reports of women feeling dismissed, shamed and invalidated when seeking care for vulvovaginal disorders.\n\nShe told 9news that it often leads to a loss of trust in the healthcare profession and patients avoiding care altogether.\n\n\"There are definitely educational gaps in medical training,\" she said.\n\n\"Many providers have very little formal education about evolving vaginal disorders, especially the chronic or less common ones.\"\n\nA 2021 study of ﻿21 people who sought help for vaginismus in Australia uncovered that negative experiences when seeking help weakened their sense of self and increased their likelihood of giving up on getting help.\n\nConversely, ﻿positive experiences made women more likely to continue seeking help and treatment even when faced with setbacks.\n\nMore broadly, two in three women reported they experienced health care related gender bias or discrimination, according to the 2024 #EndGenderBias Report.\n\nExperiences of gender bias or discrimination were most common in relation to sexual or reproductive health care.\n\nAustralian Bureau of Statistics (ABS) data from 2024 also showed that women in Australia are significantly less likely to report positive experiences with ﻿hospital ED doctors, specialists, and nurses than men.\n\nREAD MORE: Biden launches bizarre attack on Trump\n\nWhere Australia ranks in countries with the greatest health freedoms View Gallery\n\nNanayakka encouraged patients who have had poor experiences to seek medical professionals with a special interest in women's health rather than giving up on treatment entirely.\n\n\"There can be some really, really important conditions that can be misdiagnosed and they can be potentially dangerous if they are missed,\" she said.\n\nBut affording specialist appointments, especially when you've already paid to seek care before, can be difficult in a cost of living crisis.\n\nLily has forked out thousands on medical appointments over the years and can't afford to keep up with the costs of seeking specialist care for her vaginismus.\n\n\"I would say at the moment, I feel like I've given up hope,\" she said.\n\n\"I just wonder if it was a man who had extreme physical pain every time they had sex, would they be so easily dismissed?\"\n\n*Name changed for privacy.﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/kittens-miraculous-escape-from-sydneys-m8-tunnel/ebc0a843-ee2e-4e19-a807-c37d83bbb0c9",
    "title": "Leo the kitten's miraculous escape from busy Sydney tunnel",
    "publish_date": "Fri, 09 May 2025 12:04:51 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "He's looking pretty relaxed now, nestled in the arms of his new human.\n\nBut last month, the only warmth Leo the stray kitten could find would be in the engine bay of a recently parked car.\n\nThat car started moving through Sydney's West Connex tunnel at 80km/h, throwing Leo to the roadway.\n\nREAD MORE: Big four bank jumps the gun on rate cut 11 days before RBA call\n\nKitten's miraculous escape from Sydney's M8 tunnel (Nine)\n\nThe snoozing kitten was left to dodge the quickly approaching tyres of oncoming traffic.\n\n\"Seeing that poor little cat running across the motorway, might have been the most heart-stopping moment that I've seen,\" West Connex Operations manager Jill Collins said.\n\nLeo would chew through a clutch of his nine lives in just a few seconds, missing moving engine parts as he fell from the bay to the cold concrete below.\n\nYou can watch the full story above.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/gold-coast-secluded-estate-popular-with-russell-crowe-for-sale-property-news/1623e471-fa6b-49da-86a5-7058c7d4a850",
    "title": "Secluded Gold Coast estate popular with celebrities hits the market",
    "publish_date": "Fri, 09 May 2025 10:16:29 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "A secluded estate in the hills of Upper Coomera on the Gold Coast is generating buzz due to its history of attracting high-profile residents.\n\nThe property, located on Jenkins Court, has reportedly hosted celebrities, including Russell Crowe, purportedly during the filming of Land of Bad .\n\nAccording to agent Alex Fleri, the mansion offers unique appeal.\n\nA secluded estate in the hills of Upper Coomera on the Gold Coast is generating buzz. (Nine)\n\n\"Where else could you get a Hollywood mansion on the Gold Coast?\"\n\nThe eight-hectare estate boasts a full-size tennis court, a fully equipped gym, and an infinity pool.\n\nThese features, combined with the property's secluded location, contribute to its allure for those seeking privacy.\n\n\"There are properties with views on the Gold Coast, but not 360 panoramic views perfect for privacy, seclusion and security.\"\n\nThe outdoor area is another key selling point, according to Fleri.\n\nThe property's proximity to Village Roadshow Studios further enhances its appeal to those in the entertainment industry.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/archibald-packing-room-prize-2025-revealed/2ce66a6e-c6b5-42e8-b517-8402db361eea",
    "title": "Archibald Prize winner revealed",
    "publish_date": "Fri, 09 May 2025 03:09:35 +0000",
    "category": "entertainment",
    "authors": [
      "May"
    ],
    "text": "2 of 17 Attribution: Art Gallery of NSW\n\nFlagship Mother Multiverse by ﻿Juli Fragar has won the Archibald Prize.\n\nThe painting depicts Brisbane artist Justene Williams.\n\n\"There is nobody like Justene. She thinks big and makes bigger, deploying everything from car bodies to opera singers to make work as fearless and feeling as she is,\" Fragar said.\n\n\"Justene says she learned to use materials in this wild way while growing up around her father's car wrecking yard in Western Sydney, and in later years, while working in visual merchandising for industrial retail.\n\n\"Her studio back catalogue – some of which is in this painting – is a multiverse of characters and events that confront the relentless weirdness we go through en route to the other side.﻿\"\n\nArtist Frager has﻿ won $100,000 as the winner.\n\nFrager has been a finalist four times.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/national/mothers-day-classic-ali-clarke/ed1fe98a-42cf-41cb-af89-0c9551a645bc",
    "title": "Popular radio host opens up on cancer journey ahead of Mother's Day Classic",
    "publish_date": "Fri, 09 May 2025 05:04:28 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "The annual Mother's Day Classic, scheduled for this Sunday across Australia, seeks to raise vital funds for cancer research and promote awareness of women's health.\n\nThe event, a series of fun runs and walks, anticipates surpassing last year's fundraising total of nearly $4 million.\n\nAli Clarke, a cancer survivor and ambassador for the Mother's Day Classic, is partnering with her mother, Mary Carle, to encourage participation and highlight the importance of early detection.\n\nAli Clarke, a cancer survivor and ambassador for the Mother's Day Classic, is partnering with her mother, Mary Carle, to encourage participation and highlight the importance of early detection. (Nine)\n\nClarke has spoken about her cancer journey, saying initially sharing the diagnosis with her mother was particularly challenging.\n\n\"Because you don't want to put more stress on them ... you know I could do something about it but you know they were having to rely on me being honest with them about what was going on,\" she said.\n\nNow cancer-free, Clarke emphasises the collective nature of the cause.\n\n\"It's not about me, this is about everyone that will go through it, everyone that has gone through it and let's face it, we need more money pumped into research,\" she said.\n\nMary expressed a poignant sentiment regarding her daughter's experience, saying: \"I regret in a way that it should be me going through it and not Ali, but I think on the same token I think she is doing a better job at recovery and helping others.\"\n\nBeyond fundraising, the Mother's Day Classic aims to remind women, particularly mothers, to prioritise their health.\n\nClarke highlighted a common tendency to neglect personal well-being, saying: \"We look after our kids, our family, our friends before we look after ourselves ... we even get our car serviced before we look after ourselves.\"\n\nShe emphasised the importance of early detection, adding: \"Because if you know about it and get it early you can do something about it.\"\n\nAs part of this message, Clarke is encouraging women to undergo regular mammograms.\n\nFor those unable to attend the events on Sunday, organisers have provided an alternative. \"If you can't make it this Sunday ... you can complete a run or walk on a different day ... anywhere you choose, and still help raise vital funds,\" a spokesperson said.",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.9news.com.au/national/the-bizarre-item-you-can-buy-on-facebook-marketplace/afc0207f-af1e-446b-855e-eb0b22f75973",
    "title": "The bizarre item you can buy on Facebook Marketplace",
    "publish_date": "Fri, 09 May 2025 04:25:56 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "In perhaps the weirdest solution to Sydney cemeteries running out of room, people have taken to selling burial plots on Facebook Marketplace\n\nDozens of posts have gone up on the site listing plots of land in cemeteries for sale, with prices ranging from $3000 to $64,000.\n\nSome sellers told 9News.com.au ﻿that they were selling their relatives' plots who had decided to be buried somewhere else or chose to be cremated instead.\n\nDozens of posts have gone up on the site listing plots of land in cemeteries for sale, with prices ranging from $3,000 to $64,000. (Facebook)\n\nPlots weren't the only thing for sale, entire family crypts are also up for grabs as well as plots already fitted with unmarked headstone﻿s\n\nPlots were listed for sale in cemeteries in Leppington, Liverpool, Minchinberry, Woronora, Macquarie Park, Penrith and more.\n\nAlthough a bit odd, it's completely legal for the owners of a burial plot to sell it in whichever way they see fit.\n\n﻿When someone buys a burial plot, they don't own the land, they own the interment right over the land, meaning they get to choose who is buried there.\n\nIn 2023, reports ﻿emerged that Sydney's cemeteries were running out of space, with the Orthodox and Muslim sections due to run out within four years. (Getty)\n\nThe ﻿interment rights owners can sell their plots in a private transfer after an application to the cemetery.\n\nIn 2023, reports ﻿emerged that Sydney's cemeteries were running out of space, with the Orthodox and Muslim sections due to run out within four years.",
    "source": "9News",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-10/melbourne-storm-welcome-to-country-vahs-partner/105277312",
    "title": "Welcome to Country snub costs Melbourne Storm major partner",
    "publish_date": "Sat, 10 May 2025 01:11:02 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Melbourne Storm's decision not to have a Welcome to Country ceremony before its Anzac Day clash has prompted a major partner to sever ties with the NRL club.\n\nThe Victorian Aboriginal Health Service (VAHS), which runs the Deadly Choices program in the state, said it was cancelling its campaign with the Storm.\n\nA statement posted on social media by VAHS said this was a direct result of the club's treatment of Wurundjeri elder Joy Murphy Wandin before the round eight game against South Sydney at AAMI Park.\n\nVAHS, which has been operating since 1973, said the decision \"was disrespectful to Aunty Joy and the Wurundjeri People … [and] had hurtful impact on Aboriginal people throughout Naarm and across the country\".\n\nAunty Joy Murphy delivered the Welcome to Country before the Storm's 2022 Indigenous Round game against Manly. (Getty Images: Daniel Pockett)\n\n\"This decision made by the Melbourne Storm board demonstrated a lack of respect and cultural sensitivity towards Aboriginal people and communities,\" VAHS said in a letter to Storm chief executive Justin Rodski.\n\n\"Such an action is inconsistent with our values of respect, cultural integrity and cultural safety. The decision has initiated poor well-being, including feelings of sadness and anger among our community and stakeholders.\"\n\nAunty Joy told Anzac Day Welcome to Country 'inappropriate' Photo shows Headshot of Aunty Joy wearing classes and a possum fur coat. Aunty Joy Murphy Wandin says she does not know if she could work with Melbourne Storm again after the NRL club cancelled her Welcome to Country ceremony on Anzac Day.\n\nAfter it became clear that the Welcome to Country had not been held before the Anzac Day game despite Aunty Joy being at the ground to deliver the address, the Storm said the club's \"board had not approved for it to be held on Anzac Day\".\n\nIt came hours after Bunurong and Gunditjmara man Uncle Mark Brown was booed and heckled by members of the crowd at the dawn service at Melbourne's Shrine of Remembrance.\n\nThe Storm said its decision was not related to the booing earlier in the day, but Aunty Joy said she was told it was.\n\nLoading...\n\nThe club chalked the decision up to a miscommunication over whether the ceremony had been approved to go ahead and chairman Matt Tripp told Nine: \"Once we understood the programming from management, we gave the green light to progress. By then, it was understandably too late for those who had already been informed of our earlier decision.\"\n\nThe Storm have held smoking ceremonies, traditional Aboriginal and Māori dances and numerous Welcomes to Country before games alongside the commemoration of the nations' military history at Anzac Day clashes in previous years.\n\nThe Storm officially partnered with Deadly Choices and VAHS in 2021.\n\nIn 2022, VAHS chief executive Michael Graham said the organisation was \"proud to be associated with the Melbourne Storm based on the club's own strong ties to the Aboriginal community\".\n\nThe Storm had a Welcome to Country before the 2021 Anzac Day game. (Getty Images: Robert Cianflone)\n\n\"We appreciate the opportunities we have had to work together with Melbourne Storm thus far and trust that future engagements will reflect a genuine, iron-clad commitment to honouring Aboriginal lore, people and place,\" VAHS said in announcing its split.\n\nThe Storm's website says the club celebrates its connection to and recognition of Indigenous people \"across a range of partnerships and programs\".\n\nAmong those partnerships is specialist Aboriginal family violence service Dardi Munwurro.\n\nDeadly Choices is listed as an \"official partner\" on the Melbourne Storm website.\n\nThe club has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-10/mount-barker-community-launches-community-book-project/105219764",
    "title": "Young illustrators help bridge cultures within their small town",
    "publish_date": "Sat, 10 May 2025 01:01:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Noongar woman Jeanice Krakouer says the story of how her great-grandfather found a missing child in the West Australian town of Mount Barker was only known within her family until recently.\n\nIndigenous readers are advised this article includes the names of people who have died.\n\nShe decided to share it as part of Mount Barker's Reading for Generations project that has published four children's books, telling stories from the local Hazara, an ethnic group originally from Afghanistan, and First Nations Menang-Noongar communities.\n\nLoading...\n\nMs Krakouer's book Little Boy Lost tells of how, in 1954, her great-grandfather Sammy Miller found a four-year-old boy who had wandered away from his home one winter morning.\n\nAfter hours of searching, including into the night, the boy was found in bushland 5 kilometres from his house.\n\nGiven the cold and wet conditions he had been in, the boy was taken to the hospital, and his family was grateful to be reunited with him.\n\nLocal history\n\nMs Krakouer said the historical context of the story was important.\n\n\"I think the story came because of the way that Aboriginal and non-Aboriginal people worked together [to find the missing boy] in 1954 and I think it's a great way to lead up to Reconciliation [Week].\n\n\"It wasn't until 1967 that things had changed, our people weren't allowed in town before 6am and after 6pm at night, yet, late at night, these Aboriginal guys were still out searching the district to find the little boy?\"\n\nFour children's books were written and illustrated by community members in Mount Barker. (ABC Great Southern: Rosemary Murphy)\n\nShe said, at first, it was difficult trying to decide whether to tell the story to the wider community.\n\n\"Then I started to do more and more and see the illustration from the kids and hearing the story they were asking, 'What did Sammy do?'\n\n\"It brought joy to your heart and you knew that you were doing the right thing.\n\n\" It's just one of those stories that you know when the right time is to tell it. \"\n\nYoung illustrators\n\nA group of primary school students from Mount Barker Community College illustrated the books for the project.\n\nMount Barker Community College students illustrated the books. (Supplied: Nicole Selesnew)\n\nEleven-year-old Maisie Hemmings said they worked on the artwork for two terms and it was great to see the final published book.\n\n\"It's crazy,\" she said.\n\n\" You wouldn't think that 10, 11, 12-year-olds could publish their work this young. \"\n\nMs Krakouer's book, as well as a story about the late Bella Kelly, a local Aboriginal artist who painted landscapes of the Great Southern region, both include a Menang-Noongar translation.\n\nSharing stories and culture\n\nAli Sina Azimi contributed the stories of The Farmer and the Snakes and Ali Baba and the Forty Thieves, both include a Hazaragi translation.\n\nThe former Mount Barker Community College student said it was a privilege to share the stories and their values, including with his younger brother.\n\nAli Sina Azimi wrote two of the books. (ABC Great Southern: Rosemary Murphy)\n\n\"When I was writing the book he was four years old and he was slowly starting to read,\" he said.\n\n\" I want him and his generation to have the ability to read our language and speak it fluently to preserve our culture. \"\n\nNicole Selesnew from the Shire of Plantagenet, which includes Mount Barker, was one of the main organisers of the project.\n\nShe said including an audio recording in both languages with each of the books was important to assist parents who wanted to help their children with their reading.\n\n\"We had an opportunity to talk to a Hazara family and they said that for their parents to read to the kids it was quite intimidating because not a lot of the parents could read English very well, so that's sort of when the ideas started,'\" Ms Selesnew said.\n\nThe Shire of Plantagenet has a population of approximately 5,700 people. About 4.5 per cent are part of the Hazara community.\n\nRhonda Oliver from Curtin University's school of education said it was great initiative.\n\n\"To foster cultural understanding across all kids, regardless of background, to see that we do have other ways of being and knowing and doing,\" Professor Oliver said.\n\n\"It's really good for the kids whose language background it is because it makes them feel good about who they are and and self-identity is really important for academic success.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-10/labor-decision-woodside-north-shelf-carries-risks/105267038",
    "title": "Can Labor keep everyone happy on gas? Its Woodside decision will reveal all",
    "publish_date": "Sat, 10 May 2025 00:07:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "While the Liberals' demolition at the recent WA and federal elections has dominated the headlines, another issue is bubbling away in the background — and it's all about gas.\n\nThe climate debate was animated by more than a dozen disruptions at energy giant Woodside's annual general meeting (AGM) in Perth on Thursday.\n\nIt's nothing new, but coming off WA Premier Roger Cook watering down his party's promise to introduce climate target legislation, the pressure being placed on Labor is mounting.\n\n'Frying our planet'\n\nWoodside's AGM has become a colourful affair in recent years with protesters using it to highlight climate concerns — both in and out of the room.\n\nClimate activists gathered outside Woodside Energy's AGM with a puppet representing WA Premier Roger Cook. (ABC News: Keane Bourke)\n\nThis year, climate activists greeted attendees at the main entrance with 'stop new gas' signs and an imposing puppet representing the premier as 'Roger the cook, frying our planet'.\n\nInside, CEO Meg O'Neill's speech was interrupted repeatedly by protesters blowing whistles before being escorted out.\n\nWoodside Energy CEO Meg O'Neill's speech at the AGM was repeatedly interrupted. (ABC News: Keane Bourke)\n\nThere was also shareholder backlash, with 20 per cent voting against the re-appointment of the company's sustainability chair Ann Pickard.\n\nAmong them, Norwegian asset manager Storebrand, which voted no because \"the company is not aligned with our expectations on net zero by 2050 targets and commitments\".\n\n\"Investors are continuing to escalate against Woodside's board for its persistent failure to manage climate risk,\" Australasian Centre for Corporate Responsibility said after the meeting.\n\n\"It's the second worst vote on Woodside's record for any director … so we think that continues the pattern of escalation from investors.\n\n\" Frankly, we're surprised that Woodside hasn't changed strategy yet. \"\n\nFiona Stanley speaking outside the Woodside AGM. (ABC News: Keane Bourke)\n\nProminent epidemiologist Fiona Stanley echoed those concerns.\n\n\"The science has been clear for years that global warming impacting health, wellbeing and the economy is caused by burning fossil fuels,\" the former Australian of the Year told the AGM.\n\nThe government's position\n\nDespite its opponents, the company has some significant supporters.\n\nWoodside's strategy that \"gas is a natural partner for renewables through the transition\", as CEO Meg O'Neill explained it, mirrors the stance of both the state and federal governments.\n\nWoodside Energy CEO Meg O'Neill says gas is a natural partner for renewables through Australia's energy transition. (ABC News: Keane Bourke)\n\n\"Both Labor and the Coalition recognise that gas is an important part of Australia's energy transition,\" she told media after the event.\n\n\"What we would like to see is real action to allow delivery of that strategy.\"\n\nGiven both state and federal Labor won overwhelming majorities with gas a priority in their policies, there could be cause for optimism among the company's ranks.\n\nWA gas plant becomes major election issue Photo shows Pilbara residents As the national debate over the future of Woodside's North West Shelf gas plant heats up, opinions among the people living and working next to it are mixed.\n\nLabor risks safe seats\n\nThe headache for Labor though is that its support for gas is not universally welcomed.\n\nWhile keeping the gas industry on side is no doubt politically expedient, it comes at a cost.\n\nJust 18 kilometres away from Woodside's headquarters, Labor has been given two stark warnings about the price it might have to pay.\n\nA protester outside Woodside Energy's annual general meeting in Perth on Thursday. (ABC News: Keane Bourke)\n\nAt the state election, independent Kate Hulett came within 450 votes of unseating Labor Minister and MP Simone McGurk in the traditionally safe seat of Fremantle.\n\nThis week, Hulett's crack at the federal seat fell short by a slightly larger margin.\n\nKate Hulett has come close to unseating both the state and federal Labor members for Fremantle. (ABC News: Courtney Withers)\n\nHulett campaigned heavily on gas, saying the issue she would have been \"raging about first\", had she been elected, was Woodside's application to extend the life of its North West Shelf project in the Pilbara.\n\nThe company wants it to continue operating until 2070, but climate groups say the project will emit billions of tonnes of pollution over its lifetime and jeopardise global efforts to reach net zero.\n\nCrunch time for North West Shelf\n\nAs it stands, whoever is the next federal environment minister will have until the end of the month to decide on the application.\n\nThe WA government approved it last year with some conditions, including monitoring air quality and reviewing emissions reduction measures.\n\nA decision on whether to extend the life of the North West Shelf gas project is expected by the end of May. (ABC Pilbara: Charlie Mclean)\n\nBut Greenpeace Australia Pacific CEO David Ritter was hopeful of more from the Commonwealth.\n\nHe believed the election outcome was a \"definitive statement by the Australian people for a future of cleaner renewable energy\" given the Liberals' defeat.\n\nWoodside is continuing to keep the pressure on for the project's approval, with O'Neill telling Thursday's meeting without the gas an extension would provide, WA's plans to get out of coal-fired power by 2030 would be under threat.\n\n\"It is a very clear proof that if we do not get approval to continue producing gas into the market, we will burn coal longer right here in Western Australia,\" she said.\n\nHow the thorny North West Shelf project is handled by the Albanese government could give some insight into whether that's how it sees the result too.\n\nLoading...\n\nPolitical fallout\n\nBeyond how Labor's stance on gas plays out amongst its own base, there's also the issue of what it means for its relationship with the Greens.\n\nIn both state and federal parliaments, Labor does not need to rely on upper house crossbenches — support from either the Greens or Liberals will be enough to pass its legislation.\n\nAnd there was already a clear sign the Greens' support will come at a cost.\n\nGreens MLC-elect Sophie McNeill was among those trying to whistle-out Woodside Energy CEO Meg O'Neill's speech. (ABC News: Keane Bourke)\n\nGreens MLC-elect, Sophie McNeill, was among those trying to whistle-out O'Neill's speech.\n\nIt's similar federally.\n\nGreens senator Dorinda Cox is strongly opposed to the North West Shelf. (ABC News: Keane Bourke)\n\nSenator Dorinda Cox said yesterday the North West Shelf project would be a key bargaining chip for the party and that it \"must not go ahead\".\n\n\"We are not going to allow a carbon bomb to be let off here at the North West Shelf,\" she said outside Woodside's AGM.\n\nThe ultimate question, which can't be answered until the next election, is whether Labor needs to be willing to sacrifice more left-leaning electorates like Fremantle to keep the hold it has over traditional Liberal strongholds, particularly in WA.\n\nShort of some spectacular political diffusing, Labor is left with the choice of releasing either a carbon or a political bomb.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-10/rebuilding-womens-wheelchair-basketball-for-paralympics/105264774",
    "title": "Paralympic medallists looking to rebuild women's wheelchair basketball",
    "publish_date": "Fri, 09 May 2025 23:42:37 +0000",
    "category": "sports",
    "authors": [],
    "text": "Making the Paralympic women's wheelchair basketball team in 2012 was one of the proudest and hardest journeys of Leanne Del Toso's life.\n\nBetween injury and illness, she said it was a fight just to be good enough for the squad, but it was worth it when she felt the silver medal around her neck.\n\n\"London feels like a lifetime ago, but it was one of the most incredible experiences,\" the 44-year-old told ABC Sport.\n\n\"I was really lucky that I got to enjoy every moment [and] that we were a highly successful team.\"\n\nThe squad, known as the Gliders, has a rich history in the sport.\n\nSince their debut at the Games in 1992, they have been one of the top teams in the world, winning four Paralympic medals.\n\nLeanne Del Toso was part of the silver medal winning squad at the 2012 Paralympics. (Getty Images: Brendon Thorne)\n\nBut since those London Games, women's wheelchair basketball in Australia has faced an uphill battle; the team missed qualification for Rio and Paris.\n\nDel Toso was part of the team that missed out on Rio in 2016, and as devastating as that was, it seemed to signal a series of ongoing issues for the sport.\n\nDel Toso believes women's wheelchair basketball dropped off the Australian delegation's priority list with the onset of the pandemic.\n\n\"The priority for women's wheelchair basketball maybe wasn't there,\" she said.\n\nAnd she still believes this is the case.\n\nDel Toso is concerned the sport won't have enough support for the Gliders to qualify for the upcoming Brisbane Games.\n\n\"My goal is that we're there, front and centre. And that we're capable of medalling,\" Del Toso said.\n\n\"It would destroy our program when it comes to 2032, if we don't feature.\"\n\nA lack of encouragement and an empty pipeline\n\nCurrent Glider and postdoctoral researcher Georgia Munro-Cook shares a similar sentiment.\n\nShe believes failing to qualify for Paris highlighted the difficulties the sport is facing, with the number one problem a lack of a grassroots pipeline for women coming in.\n\nGeorgia Munro-Cook is a Paralympian and research fellow at Griffith University. (ABC News: John Gunn)\n\nWhile she acknowledged that both the men's and women's teams have had problems accessing training venues, sessions, and equipment, women and girls face the additional prospect of being held back from sport in general.\n\nIt's a numbers game, with more men participating in the sport than women, at an elite level the men's team has a more robust talent pool to select from.\n\n\"Women in general aren't encouraged to play much sport, and I think that's especially true for women with disability,\" Munro-Cook said.\n\n\"A more long-term issue is that often at the junior level, women are having to play with men. They're not able to then develop themselves.\"\n\nWorking towards a solution with the Play On project\n\nDel Toso has a desire to see more women and girls participating in wheelchair basketball.\n\nIt began after she looked for a way back into the sport after giving birth to her son.\n\nHaving competed in the National League since 2007, she was shocked to find, since the pandemic, that Victoria didn't have a team anymore.\n\nDel Toso found only a handful of grassroots opportunities specifically for disabled women and girls to play, sparking the idea to create her own program with former teammate and current Glider Shelley Matheson.\n\nShelley Matheson has been a Glider since 2004, winning two silver and a bronze medal at the Paralympics. (ABC News: Scott Jewel)\n\nTogether they have faced several issues to get the Play On project off the ground, including the same lack of access to equipment and venues as Munro-Cook mentions, as well as difficulties sourcing funding.\n\n\"We had to work really hard to say we're here, we're not going anywhere,\" Del Toso said.\n\nJuggling life and professional para sport\n\nConcerns around funding encompasses many Para sports, including wheelchair basketball.\n\nFrom Del Toso and Matheson's Play On program to women playing in the National League, women and girls struggle to financially sustain their participation.\n\nCurrent Glider Georgia Munro-Cook believes more disabled women and girls should be encouraged to play sport. (ABC News: John Gunn)\n\nBeyond moving to Europe, where players can be paid to compete, Munro-Cook said many women playing wheelchair basketball must work or study and find balancing life with competitive sport hard.\n\n\"There's kind of an expectation that you're training like you're a professional athlete, but we obviously don't have the economic incentives to be doing that,\" she said.\n\nAdd children to the mix and it becomes even harder for mothers like Del Toso and Matheson to find that balance.\n\nMatheson describes coming back to sport after giving birth like \"riding a bike,\" but despite feeling supported by Basketball Australia and her teammates, it was still personally difficult to manage her commitments.\n\n\"Being a mum is number one for me, but having to reduce the amount of time and effort I put into basketball is really challenging,\" the 40-year-old said.\n\nIn a statement, Basketball Australia said it is \"committed to the long-term growth and success of women's wheelchair basketball\".\n\nIt also said: \"We recognise the challenges that exist in participation, development, and high-performance outcomes, and are proactively working closely with stakeholders including the Australian Sports Commission, Paralympics Australia, and the National Institute Network to strengthen our wheelchair programs.\"\n\nAustralia's national women's wheelchair basketball team, the Gliders, in action. (Supplied: Leanne Del Tosso)\n\n'It should be about equality'\n\nDel Toso understands what's at stake for the sport, to see it thrive, she said athletes need to be nurtured and recognised for the talent they have.\n\n\"I know what the sport gave to me, and I just want to give that back to any female who wants to play wheelchair basketball,\" she said.\n\n\"It shouldn't be about funding, it shouldn't be about access, it should be about equality.\"\n\nIt's an uphill battle that Del Toso believes in, as does Munro-Cook, who said programs like Play On are \"fantastic\" and needed across the country.\n\nLoading Instagram content\n\nAll three women also want to see a shift in leadership, with a pipeline to coaching for disabled women just as important as a pipeline for players.\n\n\"A key to the greatest future and being successful is having disabled women, people who know the program in and out, making decisions about where this program is going,\" Matheson said.\n\n\"We need to see more women coaching at all levels. I would love to see a disabled woman coaching Australia one day.\"\n\nMaking inroads with the Play On project\n\nThe Play On program now has more than 30 women participating each week, ranging from young girls to seniors in their sixties. Del Toso believes they have some future wheelchair basketball superstars in the mix.\n\nWhat makes the program so unique is that it has been created by, created for, and is run by women with disabilities who have an inherent passion for the sport. A passion Del Toso and Matheson hope to share.\n\nThe Play On program was created to encourage disabled girls and women to play wheelchair basketball. (Supplied: Leanne Del Toso)\n\nSince beginning the program, the group has gained access to a community grant, which has allowed them to purchase some equipment, like competition wheelchairs.\n\nWheelchair Basketball Australia has also announced that three new women's teams will be welcomed into the National League this year, including from Victoria.\n\nDel Toso said they want to make sure that women and girls can compete, just for fun, or to take it to the highest level.\n\n\"It's really important that women with disability can connect socially and have a safe place to belong,\" she said.\n\n\"I feel like it's a great space for women to be empowered, to then go off and be the best version of themselves.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-10/working-dogs-attract-international-attention-at-queensland-sale/105254208",
    "title": "Adorable Aussie border collie pup set for new work life on tropical island",
    "publish_date": "Fri, 09 May 2025 23:38:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "They are bred and trained to work on a farm where their skill, energy and commitment add enormous value.\n\nWorking dogs in Australia are becoming so popular that exceptionally well-bred border collie and kelpie pups are attracting international attention — and big bucks.\n\nA five-month-old female border collie was sold to cattle farmers from Vanuatu for $22,000 at a recent working dog sale in central Queensland.\n\nBorder collie pup Carrdoon Charm's has natural instincts on the farm. (Supplied: Carrdoon Genetics)\n\nThe top-priced pup, named Carrdoon Charm by its breeders, piqued the interest of her overseas buyer, Michael Lennon, who flew to Australia to inspect his new canine companion.\n\n\"I was impressed at just how cool-headed she was,\" Mr Lennon said.\n\n\"I've always loved [Australian working dogs] and had good dogs over the years.\"\n\nCharm was bred by breeder and trainer Gavin Carr in Mundubbera, about four hours north-west of Brisbane.\n\nDog breeder and cattle farmer Gavin Carr with his prized border collie pup Carrdoon Charm. (Supplied: JEM Photography)\n\n\"Gavin's dogs have got styles of work that I recognise as superior and not all dogs you get to work on stock have those qualities,\" Mr Lennon said.\n\n\"When they cover, when they step to the right and the left, they're mindful to give themselves enough room, and his dogs have that virtue.\"\n\nShe was the result of an artificial insemination program which involved his proven breeding female, Carrdoon Netty, and an American sire.\n\nCharm showcases her herding talent and ability. (Supplied: Carrdoon Genetics)\n\nThese pups could become Australia's priciest working dogs Photo shows A black and brindle border collie with nine puppies. Liz, who holds the record as the nation's most expensive border collie working dog, is adjusting well to her new role as doting muster mum.\n\nGlobal mission for superior genetics\n\nMany dog breeders believe this is just the start of exporting quality four-legged workers overseas.\n\nMr Carr travelled to the United States earlier this year on a 4,500-kilometre research trip across the country to find a unique bloodline and import the genetics back to Australia.\n\n\"We started in Mississippi and ended up over at Logan near Salt Lake City, and then flew to LA and then home,\" he said.\n\n\"I was looking for consistency, I was looking for a type of dog, and I was looking for the right-minded people that have the same traits that they concentrate on that I needed to bring home.\"\n\nWorking dog breeds, like border collies such as Charm, typically start learning to work with sheep around six months of age. (Supplied: Carrdoon Genetics)\n\nThe result of his global scouting mission was US sire J Crazy J Sam, a dog Mr Carr said ticked all the boxes.\n\nWhile Australian working dogs are sought after globally for their herding skills he said their genetics also had the potential for worldwide demand.\n\n\"I think, in time to come, Australia has a big offering,\" he said.\n\n\"We bring [genetics] in, but I can't see why we shouldn't be sending them out. I think we can actually help out other countries and work together.\"\n\nVanuatu's economy is primarily agricultural, as well as being a tropical island paradise. (Supplied: Warren Moore)\n\nThere's a 'good dog' for everybody\n\nThe South Pacific paradise of Vanuatu is made up of roughly 80 islands that stretch across 1,300 kilometres.\n\nBoth Mr Carr and Mr Lennon were confident Charm would adapt to the more tropical climate on one of the country's biggest islands, Espiritu Santo.\n\nCharm will earn her biscuits and pats in Vanuatu. (Supplied: Carrdoon Genetics)\n\nThe island is a major producer of beef with smallholder farmers like Mr Lennon driving the cattle industry.\n\n\"We do most of our work in the cool so it's not too harsh on [the working dogs],\" he said.\n\n\"I'll breed pups out of Charm but she'll be a working dog first.\"\n\nGavin Carr knows all too well the value well-trained working dogs bring to his farming operation. (Supplied: Carrdoon Genetics)\n\nAs graziers around the world struggle to fill workforce shortage gaps, Mr Carr said he relied heavily on working dogs in his Droughtmaster operation.\n\n\"It's an everyday job and we wouldn't do it without the dogs,\" he said.\n\nWorking dogs are essential in helping farmers collect and move cattle on large properties. (Supplied: Carrdoon Genetics)\n\nThe long-time cattleman said working dog sales in Australia would only continue to grow internationally, underlining the fact that there are still some things only a good dog can do.\n\n\"I'm already setting dogs now for three years [time], and moving forward I'd like to bring more international buyers to us,\" he said.\n\n\"There's a dog at every sale for everybody.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-10/bunbury-tornado-anniversary-and-slow-recovery-for-residents/105273680",
    "title": "Couple 'basically homeless' a year on from freak tornado",
    "publish_date": "Fri, 09 May 2025 23:01:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "Elaine Bartles and her husband Doug are marking a year since their home and belongings were destroyed in a \"freak\" tornado that tore through WA's second-biggest city.\n\nDespite the time since the incident, the retired couple remains \"basically homeless\", living in their caravan and waiting for their home to be rebuilt.\n\nThe tornado struck Bunbury, 170 kilometres south of Perth, on May 10, damaging 220 homes and destroying another nine in just 10 minutes.\n\nWhirlpool of rain and glass\n\nThe suburbs hit hardest were Withers and College Grove, where roofs were ripped from their frames, windows imploded and trees were torn down.\n\nThe tornado in Bunbury in May 2024 destroyed houses and ripped off roofs. (ABC South West: Anthony Pancia)\n\nThe Bunbury Regional Prison was badly damaged and 15 children were inside the local PCYC when part of the facility collapsed. Fortunately, no-one was injured.\n\nThe Bartles's home in College Grove was one of those destroyed.\n\nLoading...\n\nMrs Bartles said she heard a terrifying sound moments before her roof was suddenly ripped off.\n\n\"As I went to step out into my passageway, there was nothing left of my family room,\" she said.\n\n\"There was no roof left at all. There was just rain, glass, like a damn whirlpool.\"\n\nThe roof was ripped off Elaine and Doug Bartles's house. (ABC South West WA: Alex Govan)\n\nShe said the terror only lasted for what seemed like 10 seconds.\n\n\"There was stuff flying around, falling on me as I just stood in the door frame of the spare bedroom,\" Mrs Bartles said.\n\n\" I know I'm lucky to be alive. \"\n\nThe couple's insurance has been paying for interim accommodation, but that ends after 12 months.\n\nMrs Bartles said she now lived in her caravan until the home build was complete.\n\nElaine Bartles expects her home will be rebuilt in about nine or 10 months. (ABC South West: Jon Daly)\n\n\"We are just lucky that we do have a caravan,\" she said.\n\nMrs Bartles said the rebuild could take another nine-to-10 months.\n\nThe ABC has also spoken to other Bunbury residents yet to return to their homes because of long rebuilds amid the ongoing housing crisis.\n\nLessons for authorities\n\nEmergency services were in overdrive after the event, and City of Bunbury Mayor Jaysen Miguel said he was proud of the work agencies did to help the community.\n\n\"It was an evolving process which we had to try to be reactive to as news was coming through,\" he said.\n\nLoading...\n\nNot everything was perfect, however, with residents telling the city that communication should have been better.\n\nSome residents raised concerns about inconsistent communication on the risks of asbestos exposure from housing debris scattered throughout the city.\n\n“We thought we were doing every effort to get that communication out there,\" Mr Miguel said.\n\nMr Miguel said the city had learnt lessons from the event and had improved plans for communications to elderly, vulnerable residents, which included door-to-door visits and flyers.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-10/dewayne-everettsmith-performs-with-tso-in-palawa-kani/105200700",
    "title": "Dewayne's dream of singing to his baby in palawa kani inspires orchestral project",
    "publish_date": "Fri, 09 May 2025 22:18:17 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "As Dewayne Everettsmith held his firstborn child in 2010, the Palawa man had a burning wish.\n\n\"I was sitting there at 3 o'clock in the morning, and he was crying and I looked at him, and I wished in that moment I could sing to him in language,\" he recalls.\n\nIt was a desire he couldn't fulfil.\n\nWARNING: Aboriginal and Torres Strait Islander readers are advised the following story contains an image of a person who has died.\n\nFor Everettsmith, his latest project is a celebration of culture, but also a response to the intergenerational trauma carried by many First Nations people. (ABC News: Luke Bowden)\n\nWhile Lutruwita/Tasmania once had many unique Aboriginal languages, the impact of colonisation has silenced all but a small collection of ancient words.\n\n\"I didn't have that knowledge at that time, nor the songs to sing to him in language,\" the 37-year-old singer-songwriter said.\n\nIt was a stark realisation that sparked an idea.\n\n\"How do I embed the opportunity, and that cultural strength and resilience, [so] that my children can sing to their children in language, and so on and so on and so on?\"\n\nThat nascent idea has since grown into an ambitious project fusing classical music with palawa kani — the revived language of Tasmanian Aboriginal people.\n\n\" The ultimate dream is … [to] keep language alive and culture alive. \"\n\nThe album also includes a track titled Lutruwita, which Everettsmith hopes will become an anthem for the island and a message of resilience. (ABC News: Ebony ten Broeke)\n\nCollaboration described as 'watershed moment'\n\nThe project has brought Everettsmith to Hobart's Federation Concert Hall — the home of the Tasmanian Symphony Orchestra (TSO).\n\nThe musical institution has been playing since 1948, but its collaboration with Everettsmith is like no other.\n\n\"This is a watershed moment for this orchestra,\" TSO chief executive Caroline Sharpen said.\n\n\" This orchestra has been around for 77 years, and without a doubt, [this] is one of the most important projects that we've ever done. \"\n\nThe project is titled Songs of Ceremony: Reawakening songs in palawa kani.\n\nIt's a collaborative work overseen by Everettsmith, conductor and arranger Erkki Veltheim and producer Michael Hohnen from Skinnyfish Music.\n\nThe initial phase involves the recording of a full-length album in palawa kani.\n\nThey hope to then premiere the songs with a performance on country for the Tasmanian Aboriginal community next year.\n\nCaroline Sharpen says the album is \"without a doubt … one of the most important projects that we've ever done\". (ABC News: Maren Preuss)\n\nFurther public and school concerts across the state will follow in 2027, with the possibility to also go further afield.\n\nSharpen said one of the most \"exciting and enriching\" aspects of the project will be sharing the songs with school students.\n\n\" [It will] be just such a wonderful way, through music, of bringing people together. \"\n\nEverettsmith and the orchestra at work. (ABC News: Ebony ten Broeke)\n\nEverettsmith performs during a recording session. (ABC News: Ebony ten Broeke)\n\nSongs inspired by personal journey\n\nEverittsmith is an accomplished singer-songwriter, who released the first commercially available palawa kani song in 2014.\n\nOne of his other songs was featured in a global advertising campaign by Tourism Australia in 2012.\n\nLoading YouTube content\n\nFor Everettsmith, his latest project with the orchestra is a celebration of culture.\n\nBut it's also a deeply personal response to the intergenerational trauma carried by many First Nations people.\n\nAt birth, he said his father rejected him \"because he didn't want to have a black child\".\n\nThen, at the age of five, his mother — a member of the Stolen Generations — put him up for adoption amid her struggle with substance abuse.\n\n\" She was addicted to speed, and that was a way that she was able to control and heal her trauma. \"\n\nEverettsmith said he was fortunate to be taken in by a loving Aboriginal family related to Fanny Smith, the last known fluent speaker of one of the original Tasmanian Aboriginal languages.\n\nThe recordings of Fanny Smith are among the earliest ever made in Australia. (Supplied: Tasmanian Archives)\n\n\"I was brought up strong in culture,\" he said. \"And that's where my love of music was able to shine.\"\n\nIt wasn't until he was 17 that Everettsmith reconnected with his birth mother at a town square in Hobart.\n\nAs the pair sat on a park bench surrounded by colonial-era statues, he asked his mother why she hadn't kept him.\n\n\" She looked me dead in the eye, without even second-guessing herself, she just said to me, 'I couldn't be your parent, I couldn't give up drugs to be your parent.' \"\n\nIt broke his heart at the time, but Everettsmith said her honesty helped him better understand the oppression and trauma she had experienced.\n\n\"It was a moment that forever changed the way that I started seeing the world,\" he said.\n\n\"But also, in particular, seeing my mother and seeing the role of mothers in our lives.\"\n\nEverettsmith wants the project to be a unifying force between Aboriginal and non-Aboriginal people in Lutruwita/Tasmania and beyond. (ABC News: Maren Preuss)\n\nSong dedicated to mother\n\nAmong the dozen or so tracks that will feature on the album is an ode to his mother, called \"ningi-mana\", or \"my mother\".\n\n\"It's a song that I wrote to my mother that acknowledges her tears, that [says], 'I see your tears, I see your fears.'\n\n\" Because I never got to have that acknowledgement — she had overdosed before I got to have a realisation of what I know now. \"\n\nAnother song is inspired by the wax cylinder recordings of Fanny Smith, which are inscribed on the UNESCO Australian Memory of the World Register.\n\nPart of the Fanny Smith installation at the Tasmanian Museum and Art Gallery. (ABC News: Luke Bowden)\n\nMade in 1899 and 1903, they were the first and only audio recordings of one of the original Tasmanian Aboriginal languages.\n\n\"I've taken a melody, expanded it, created a whole new song in our [palawa kani] language today,\" Everettsmith said.\n\nWax cylinders, which pre-date phonograph records, were the medium used to preserve Fanny Smith's voice recordings. (ABC News: Luke Bowden)\n\nThe album also includes a track titled Lutruwita, which Everettsmith hopes will become an anthem for the island and a message of resilience.\n\n\"How amazing would it be to take this back to England, play this song on that country and go, 'Hey, we're still here.'\"\n\nEverettsmith and the TSO hope to premiere the songs with a performance on country for the Tasmanian Aboriginal community next year. (ABC News: Ebony ten Broeke)\n\nUltimately, Everettsmith wants the project to be a unifying force between Aboriginal and non-Aboriginal people in Lutruwita/Tasmania and beyond.\n\n\"It's not about competition, it's about contribution,\" he said.\n\n\"Come and immerse yourself in our culture, there's nothing to be afraid of, there's nothing we're going to take from you.\n\n\"What we want to do is gift you an opportunity to connect to a culture and a language that you will have nowhere else.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-10/us-measles-outbreak/105277230",
    "title": "Measles outbreaks reported in 11 US states, surpassing 1,000 cases",
    "publish_date": "Fri, 09 May 2025 22:17:37 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "The United States has reported more than 1,000 measles cases across 11 states, with Texas accounting for the vast majority of these cases, according to the national public health agency.\n\nThe Centers for Disease Control and Prevention (CDC) said 14 outbreaks had been recorded this year, with 93 per cent of confirmed cases being outbreak-associated.\n\nAs of May 9, Texas's state health department has confirmed 709 cases, 92 per cent of which have been hospitalised over the course of the outbreak, which began three months ago.\n\n\"There have been two fatalities in school-aged children who lived in the outbreak area [West Texas],\" the health department said in a statement.\n\n\" The children [aged six and eight] were not vaccinated and had no known underlying conditions. \"\n\nThe state department said it was working with local health departments to investigate the outbreak.\n\nOther states with active outbreaks — which the CDC defines as three or more related cases — include New Mexico, Oklahoma, Kansas, Indiana, Michigan, Montana, North Dakota, Ohio, Pennsylvania and Tennessee.\n\nFifty-seven per cent of Texas’s cases were in Gaines County, which has a population of 22,892, where the virus had been spreading in a close-knit, under-vaccinated community, the Associated Press (AP) reported.\n\nThe US has reported a surge in measles, with more than 1,000 cases detected as of May. (AP: Julio Cortez)\n\nThe county has had 403 cases since late January — just over 1.7 per cent of the county’s residents, it said.\n\nSo far, three deaths — including an unvaccinated adult in New Mexico who died of a measles-related illness — have been confirmed in 2025.\n\nMeasles outbreaks in Americas\n\nNorth America has two other ongoing outbreaks, all of which are caused by the same measles strain, according to the AP.\n\nOne outbreak in Ontario, Canada, has resulted in 1,440 cases from mid-October through May 6, representing a 197-case increase in a week.\n\nThe Mexican state of Chihuahua reported 1,041 measles cases and one death as of Friday, local time, according to data from the state health ministry.\n\nThe World Health Organization (WHO) said a total of more than 2,300 measles cases were detected in six countries in North America and South America since January 2025, an 11-fold increase compared to the same period in the previous year.\n\nGeographical distribution of the confirmed measles cases between January 1 and April 18, 2025. (Supplied: World Health Organization)\n\nThose six countries include Canada, the USA, Mexico, Argentina, Brazil and Belize.\n\n\"The majority of cases have occurred among people between 1 and 29 years [old], who are either unvaccinated or have an unknown vaccination status,\" the WHO said.\n\n\"Additionally, most cases are imported or linked to importation.\"\n\nAustralian doctors warn of global measles outbreak\n\nIn April, medical professionals urged travellers to stay vigilant as Australia deals with a local surge of measles, sparked by a global rise in cases amid declining childhood vaccination rates.\n\nDoctors told the ABC that the number one defence against the spread of measles was immunisation.\n\nAccording to the Department of Health and Aged Care, Australia has reported 71 measles cases across six states and territories, excluding Tasmania and the Australian Capital Territory, as of May 9.\n\nABC/AP",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-10/85-yo-rockclimbing-instructor-no-toes-fingers/105254938",
    "title": "How Armando found a new way to climb after frostbite took his fingers",
    "publish_date": "Fri, 09 May 2025 22:16:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "Watching him traversing his way up the face of the limestone cliff overlooking the Queanbeyan River, it's hard to tell that Armando Corvini has no fingers or toes.\n\nIn a sport famous for requiring strong fingers and forearms, Mr Corvini has had to re-learn rock climbing after a severe accident in the Himalayas that he says divides his life into two.\n\nArmando Corvini has developed a new style of rock climbing since losing all his toes and fingers. (ABC News: James Tugwell)\n\nThe 85-year-old is climbing the wall with large pruning scissors clipped to his harness to trim the prickly blackberry bushes getting in the way of the young children he is teaching to climb.\n\nThe youngsters watch on in awe as Mr Corvini precisely picks out the next handhold and pulls himself up.\n\nA week earlier, Mr Corvini led a group of about 40 students caving near Wee Jasper.\n\nBut while that was fun, rock climbing has always had his heart.\n\nA love affair\n\nMr Corvini says his relationship with rock climbing \"is almost like a love story\".\n\nNow a teacher, Mr Corvini shares his passion for rock climbing with children. (ABC News: James Tugwell)\n\nHe first climbed as an 18-year-old with ten fingers and toes in the Dolomites near his childhood home of Trieste, Italy.\n\nHe knew immediately he was hooked.\n\n\"When I started climbing, I saw the light,\" he said.\n\nCanberra Climbers Association vice president, and assistant belayer, Brian Mattick said in Italy, Mr Corvini was \"climbing the hardest routes of the day\".\n\nCanberra Climbers Association vice president Brian Mattick says Mr Corvini was tackling some of the hardest climbs in the Dolomites. (ABC News: James Tugwell)\n\n\"In those days you took a lot more risks than you do these days,\" Mr Mattick said.\n\n\" They're pretty ambitious ascents he was climbing. \"\n\nThe flattest continent on earth\n\nHowever, Mr Corvini left his mountaineering gear behind when he migrated to Australia in 1966.\n\n\"Armando, your climbing career is over because Australia is the flattest continent in the world and there are no mountains there,\" he recalls being told by the president of his Italian alpine club.\n\nYet, when Mr Corvini discovered rock climbers in the Blue Mountains, his passion returned with fire.\n\nHe was soon attacking peaks in New Zealand and the Himalayas.\n\nArmando Corvini ascending to Camp 1 on his Mt Pumori expedition in 1988. (Supplied: Armando Corvini)\n\nHe summitted the 7,161-metre tall Mount Pumori near the Everest region at the age of 49, before tackling several other Nepalese mountains taller than 6,000 metres.\n\nAs with all love stories, the more Mr Corvini fell in love with the mountains, the more he exposed himself to risk.\n\nArmando Corvini became obsessed with summitting mountains overseas. (Supplied: Armando Corvini)\n\nA frozen disaster\n\nIn 1994, Mr Corvini led a group of Canberra-based mountaineers on the first Australian ascent of the south and southwest ridges of the 6,812-metre-tall Ama Dablam in the heart of the Nepalese Himalayas.\n\nSir Edmund Hillary — the first man to summit Mt Everest — declared Ama Dablam \"beautiful but unclimbable\" in 1953.\n\nSir Edmund Hillary declared Ama Dablam \"beautiful but unclimbable\" in 1953. (ABC News: James Tugwell)\n\n\"Every mountain and every climb has its challenges,\" Mr Corvini said.\n\n\"But Ama Dablam was the hardest climb of my life.\"\n\nThe trip encountered issues from the start.\n\nMr Corvini was forced to belay three people at a time and the planned five-day trip ran into 10 days.\n\n\"We ran out of food. The weather was terrible,\" Mr Corvini said.\n\nWhen the expedition returned to base camp and Mr Corvini pulled off his boots and gloves, his fingers and toes were badly frostbitten.\n\nAt the age of 56, he lost nine fingers and all his toes.\n\nArmando's love for high mountain peaks ended in disaster in Nepal. (Supplied: Armando Corvini)\n\nHe spent four months on the 10th floor of the Canberra Hospital thinking he'd never climb again.\n\n\"I remember looking out the window at Isaacs Ridge thinking 'I wonder if I will ever be able to walk there one day',\" he said.\n\n\"So, my first goal was to walk there.\n\n\"When I came out of hospital, I had to think about what I wanted to do with my life.\"\n\nRelearning to climb\n\nAfter an 18-month recovery, Mr Corvini started volunteering as a gym instructor with the YMCA, coaching children with physical disabilities.\n\nHe noticed the centre had a climbing wall and began climbing every week. Soon, reluctantly, he agreed to become an instructor.\n\nThe next week, he nervously stood in front of a class of six students with what was left of his thumbs hooked onto his harness to hide his lack of fingers as he began his first ever lesson.\n\nEverything was going well.\n\nThen Mr Corvini pulled out some ropes to show the students how to tie knots.\n\nArmando's new climbing students were shocked when they first saw he didn't have fingers. (ABC News: James Tugwell)\n\n\"When they saw my hands, their faces dropped. You can imagine what they thought about me,\" he said.\n\nThe next week he showed them how to traverse a wall and \"from that time everything went extremely well\".\n\n\"Don't look at me for style. I've got my own style of climbing,\" he said.\n\nNowadays he says he often has cute interactions with young students asking about his hands. (ABC News: James Tugwell)\n\n\"Obviously I can't do anything that is very smooth, but my hands are very strong.\n\n\" I've had two lives: my life when I was very strong and nothing would stop me and the second life when I've become visibly disabled. \"\n\nPassing on the love\n\nHe may no longer be able to tackle the most difficult routes at the crag, but Mr Corvini gets a new-found sense of joy from passing his love on to others.\n\nHe's been guiding for more than 20 years, now runs his own outdoor adventure business and has just published a memoir of his adventures.\n\nThere's no place Armando would rather be than belaying while his students learn to climb. (ABC News: James Tugwell)\n\nSitting on a rock belaying, neck cranked back watching one of his students climb in preparation to represent the ACT at the National Youth Climbing Championships, Mr Corvini is as happy as ever.\n\nAssistant guide Penelope Jones said the children always love him.\n\nAssistant guide Penelope Jones says everyone loves Armando. (ABC News: James Tugwell)\n\n\"Everyone loves Armando,\" she said.\n\n\"He loves climbing and it's infectious.\n\n\"Some people are afraid of getting old, but I always think if I'm old and like Armando, then that would be great.\"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-10/homeless-youth-calls-for-better-access-to-housing-during-inquiry/105269810",
    "title": "Worker makes plea to housing inquiry before going home to his tent",
    "publish_date": "Fri, 09 May 2025 21:52:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "Anthony Rowse loves the feeling of working with his hands.\n\nThe 25-year-old spends his days making skip bins for trailers and harvesting equipment near Ballarat in Victoria's west.\n\nBut that sense of achievement can quickly evaporate when he goes back to Lake Burumbeet and prepares for a cold night in his tent.\n\n\"The other night I caught a rat making its way into the tent,\" Mr Rowse said.\n\nMr Rowse said his best mate, Ghost, a three-year-old husky-ridgeback cross, was his only companion.\n\n\"I caught it [the rat] but Ghost wanted to play with it and she let it go,\" he said.\n\n\" I found it hiding in one of my cups trying to stay warm. \"\n\nGhost rests in Mr Rowse's tent. (Supplied: Anthony Rowse)\n\nFacing homelessness\n\nMr Rowse spent most of his adult life living in his family home in Ballarat, an hour and a half north-west of Melbourne.\n\nBut he faced housing instability for the first time after the death of his mother and the end of a long-term relationship.\n\nMr Rowse took advice from a coworker and began camping at the lake.\n\nHe has been there on and off for the past couple of years, despite efforts to secure more permanent housing.\n\n\"I'm just getting knocked back and back,\" he said.\n\n\"They say I've got no rental history. And it's expensive.\n\n\"I'd love a house.\"\n\nLong-term camping grounds are becoming a place to call \"home\" for an increasing number of the homeless.\n\nOne homelessness worker told the ABC he had seen a \"200 per cent increase\" in temporary residents at camping spots across the state.\n\nAnswers sought\n\nA state government parliamentary inquiry is underway across regional Victoria seeking input on ways to address the country's housing and homelessness crisis.\n\nMembers have asked where the most urgent need for housing is, the workforce challenges in constructing homes and the need for accommodation for regional workers in key sectors.\n\nDamian Stock says the gap between rental prices and income has increased. (Supplied)\n\nDamian Stock, chief executive of ARC Justice, a service that provides legal help and tenancy advocacy support to people in Central and Northern Victoria, told the inquiry the gap between rental prices and income had increased significantly in regional Victoria.\n\n\"It's the worst it's ever been,\" Mr Stock told the inquiry during a hearing in Ballarat.\n\nHe discussed the need for tax incentives for investors who provided long-term rentals and investment in crisis, transitional and social housing.\n\n\"Victoria has the lowest rate of investing in social housing in Australia,\" he said.\n\n\"There's a real role for the government to directly invest in public housing … it's been a decline over the past three decades of any investments directly into public housing.\"\n\n'Bursting at the seams'\n\nThe state government released an ambitious target in 2024 to create 2.2 million new homes by 2051, 47,000 of which would be in Ballarat.\n\nCommittee member Martha Haylett, the Labor MP for Ripon, said developers were concerned about meeting those targets.\n\n\"There's worry that our Victorian government targets about how much we need to build in our more populated areas, like central Ballarat, versus out in paddocks where there is nothing,\" Ms Haylett said.\n\nIn 2020, western Victorian company AME Systems bought a hotel in Ararat in a last-ditch effort to fill a chronic labour and housing shortage.\n\nThe company is still struggling to find worker accommodation.\n\nMartha Haylett says there are concerns about meeting housing targets. (ABC Central Victoria: Sarah Lawrence)\n\nBauenort Management director, Anton Pound, has developed large-scale sites in Ballarat over the past decade.\n\nHe told the inquiry he had built about 90 per cent of homes on greenfield sites, including the established areas of Ballarat.\n\nMr Pound told the inquiry the government's target to boost Ballarat's infill developments to 60 per cent was not achievable.\n\n\"It's a Melbourne based policy that is being pushed into the regions, when the dynamics around housing and the reasons for moving to regional Victoria are not the same,\" he said.\n\nMr Pound said he supported a transition, but it needed to be slow.\n\n\"It's too big a step,\" he said.\n\n\"In the meantime we just need to find a way to house these people.\"\n\nNeed for urgency\n\nAda Watson is an outreach worker who checks in with Anthony Rowse on a weekly basis, providing him with vouchers, food and support.\n\nShe said something needed to be done.\n\n\"I'd love to see a huge stockpile of achievable and affordable housing without it being so hard for people to get a home,\" Ms Watson said.\n\nShe said she had seen a rise in the number of families sleeping rough.\n\n\"Mums with kids or mums and dads with kids … sometimes I jump into bed at night and think about it,\" she said.\n\nAda Watson hopes for a better future for vulnerable people. (ABC Ballarat: Rochelle Kirkham)\n\nIf there's no houses for them to move into, we just have to come out and give food to make life a little easier for them.\"\n\nMr Rowse said there needed to be more homes available for those sleeping rough.\n\n\"You've got a warm home, safe at night, no animals coming in, you've got a place where you actually belong, a place that feels like home,\" he said.\n\nMeanwhile, Uniting Church community services organisation, Uniting Vic.Tas, warns it is facing a funding crisis for its homeless outreach program in Ballarat and the Central Highlands.\n\nA spokesman said the state-funded Street to Home program was the only outreach program for people sleeping rough in Ballarat, Moorabool, Golden Plains, Hepburn, Ararat and Pyrenees, but was not guaranteed funding beyond June 30.\n\n\"We see people living in areas with no access to clean, running water or flushing toilets,\" he said.\n\n\"Families with children, people fleeing family violence, elderly people, people with disabilities terminal illnesses and they are sleeping on the streets, in cars, tents, dilapidated caravans and squatting in abandoned buildings.\n\n\"Demand for homelessness services across the Ballarat region is higher than ever and that's why we not only need funding for Street to Home beyond this financial year, but long-term certainty to ensure the program continues well into the future.\"",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/politics/federal/australian-federal-election-2025-live-results-victoria-key-swing-seats-news-updates-start-time-liberal-labor-independent-teal-kooyong-goldstein-wills-bruce-zoe-daniel-tim-wilson-peter-khalil-samantha-ratnam-julian-hill-zahid-safi-monique-ryan-amelia-hamer-20250502-p5lw46.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victoria hot seats LIVE results: Ryan’s lead dips slightly as count continues in Kooyong; Peter Khalil, Julian Hill join ALP colleagues in Canberra",
    "publish_date": "Sat, 10 May 2025 11:31:07 +1000",
    "category": "finance",
    "authors": [
      "Rachael Dexter",
      "Charlotte Grieve",
      "Clay Lucas",
      "Cara Waters"
    ],
    "text": "It didn’t feel like a defining moment at the time. But looking back, it probably was.\n\nAs week two of the campaign for Wills drew to a close, Labor’s Peter Khalil stood on an outdoor basketball court in North Fitzroy, announcing $3.7 million to rebuild Linear Park, which includes one of the busiest bike paths in the country.\n\nOnce an old rail line, it became green space under former Wills MP and prime minister Bob Hawke. Now, here Khalil was with Yarra Council’s socialist mayor Steve Jolly promising to help rebuild it.\n\nAbout 100 people were gathered, far more than the few dozen at a debate in Fawkner the day before that Khalil had skipped. But this time, he’d shown up – in the heart of Greens territory, flanked by Boomers who’d ventured out from their multi-million-dollar homes on this sunny Sunday afternoon. Some were familiar from when I covered this area for The Melbourne Times 20 years ago.\n\nThe spending pledges didn’t stop at Linear Park: Gillon Oval, Fawkner Netball Club, Merri Creek – all were promised serious money. Khalil was offering a powerful marginal seat message: “I’m in government, I can bring home the goods.”\n\nFormer state Labor MP Carlo Carli put it plainly: “This was a masterful campaign based around this idea that ‘A Labor government can deliver, and here I am, ready to deliver’.”\n\nLabor MP Peter Khalil has won re-election in Wills. Credit: Gus McCubbing\n\nIt worked in the richer southern end of the electorate, where voters who long ago came over to the Greens could be persuaded back to Labor with two key messages: don’t risk Dutton, and keep the good stuff flowing.\n\nBut in the north of the seat – where many voters are Muslim, rent, or have grown tired of Labor taking them for granted – it was a different story.\n\nHere, Greens candidate Samantha Ratnam – who quit state parliament to run for the federal seat – made a strong pitch, promising to address rent hikes, the climate catastrophe, soaring costs and Gaza.\n\nIn a campaign where three Greens including leader Adam Bandt – and even Liberal leader Peter Dutton – were swept aside by Labor, Ratnam drove a 7 per cent swing against the party, pushing this once-safe seat to the brink. Against the national tide and a flat Labor incumbent, she turned Wills into a key contest.\n\nFor months, alongside her campaign, a group called Muslim Votes Matter had been urging voters to punish Labor explicitly over Gaza – at mosques, markets and community events.\n\nGreens candidate Samantha Ratnam, pictured with outgoing Greens leader Adam Bandt, at Brunswick East Primary School during the campaign. Credit: Getty\n\nTheir effort boiled over in week one of pre-polling, when a Labor staffer and a Palestinian activist clashed over a protest sign. Police were called.\n\nThe Greens picked up big swings in the Muslim-majority north. They even won a booth – John Fawkner Secondary College – for the first time, with a stunning 28 per cent swing on the two-party vote.\n\nWas it Gaza? Was it housing affordability pushing younger Greens voters into the outer north? Was it climate inaction? Probably all three and more. And yet, it wasn’t enough. Like all the times before that the Greens said they might win it, Wills didn’t flip.\n\nLabor’s showing in Wills though was notably weak compared to neighbouring Melbourne where the party notched a nine per cent swing and toppled Bandt. In Wills, Labor hung on by its fingernails, relying on incumbency, funding promises and fear of Peter Dutton to scrape over the line.\n\nOne of the most insightful interviews of this campaign was with Phil Cleary, who knows Wills as well as anyone. He believed Gaza could influence the vote. The former independent MP and Coburg football legend held the seat from 1992 to 1996 after Hawke resigned. He remains the only non-Labor MP ever to do so.\n\nKhalil, Cleary said, “is a victim of a party that won’t use words like genocide and won’t talk strongly about the killing of women and children in Gaza”. But Cleary wasn’t sure it would cost Labor the seat; he lost to the machine himself and knows how ruthless and effective ALP campaigning can be.\n\nFormer independent MP for Wills Phil Cleary. Credit: Luis Enrique Ascui\n\nBy the final week, Labor’s message came into focus as it used its financial might to blitz the seat with letterboxing and direct mail. One penned by Julia Gillard stuck tightly to the script: every seat lost helped Dutton become PM. Khalil still had PTSD from 2019, he said, when the ALP expected to win government and was beaten by Scott Morrison and his “miracle”.\n\nPre-polling was relentless. I was at the Brunswick booth every day bar one, and Khalil and Ratnam were both there each day that I visited.\n\nAnd while pre-poll in Brunswick was always a theatre of democracy, sometimes it was also farce.\n\nTake Romeo – a One Nation volunteer whose surname I never learned – wandering the line with an Australian flag and sometimes, inexplicably, an Italian one too.\n\nHe would chant “One flag, One Nation”. Could there be a suburb in Australia less welcoming to such sentiment than Brunswick? A man in a Collingwood jumper – notably Indigenous player Bobby Hill’s number 23 – pelted him with eggs.\n\nRomeo shrugged it off, but a couple of days later when he told me someone had threatened to shoot him, he went home, fashioned two metal plates into an ad hoc bulletproof jacket he placed over his shirt, then returned to the booth.\n\nOne Nation volunteer, Romeo, with his armour.\n\nOne Nation’s candidate got a 1 per cent swing, reaching 3.5 per cent of the primary vote. So it appears there’s room for everyone in Australian democracy it seems – even in Brunswick.\n\nThis is the third time I’ve covered one seat for an entire campaign like this. By the final days, it gives you clarity you don’t expect when you start. You come to understand the jostling, the ground game, and how broader issues – war, climate, housing, the cost of a cup of coffee – land differently from one suburb to the next.\n\nIn the end, that moment in North Fitzroy – a Labor MP promising money for a bike path – was more than a local funding pledge. It was a case study in how politics still works here: tangible, transactional, and attentive to who turns up.\n\nThe Greens harnessed fury over Gaza. They tapped disillusionment on climate. They tried to create a wave to surf home – only to find Labor knew Dutton was a tsunami. And Labor, when threatened, can still marshall money, endorsements and machine-like discipline.\n\nWills didn’t fall. But it shifted. Gaza cracked something open in the north where Labor’s hold can no longer be assumed. The Greens are now within 2 per cent of taking this seat. If their candidate in the next election is weaker, maybe the margin returns to Labor. But in a seat named after a failed explorer, I suspect this electorate is ready to chart a new course – even if, this time, it decided to wait a little longer.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/victoria/the-age-photos-of-the-week-may-10-2025-20250510-p5ly3h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Age photos of the week, May 10, 2025",
    "publish_date": "Sat, 10 May 2025 11:30:16 +1000",
    "category": "finance",
    "authors": [],
    "text": "12/20\n\nRosie Cuppaidge, with her 14-month-old daughter Ione, says we should be discouraging screens among kids in general and believes there should be enough going on in childcare that screens shouldn’t be needed. Credit:Paul Jeffers",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/afl/why-warner-brothers-are-revelling-in-afl-anonymity-in-sydney-20250507-p5lxdl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Warner brothers are revelling in AFL ‘anonymity’ in Sydney",
    "publish_date": "Sat, 10 May 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Jonathan Drennan"
    ],
    "text": "“Even if you are just going out for dinner with your family or something in the off-season [in Perth], I guess there is a lot more attention on you,” Corey said.\n\nIn Sydney, the Warner brothers can walk near their home in Coogee and remain largely anonymous. Back home in Perth, it is impossible to escape from their day job.\n\nBoth brothers loved their upbringing in Perth and return whenever there is a viable gap in their schedule. Sydney can never replace the family and friends they miss, but it has given them a different perspective on their daily lives.\n\nEarlier this year, before signing their respective two-year contract extensions at the Sydney Swans, Chad and Corey Warner thought long and hard about what the club and the city meant to them.\n\n“I think it’s definitely a benefit for us in Sydney here; you can go out with your mates, or go out for dinner, go to the beach, and you can just be a different person and not like an AFL player, and not have all the attention on you for a bit when you’re away from the club. But it’s definitely a reminder when you go back to Perth.”\n\nCorey and Chad Warner at Swans headquarters before Saturday’s game against Essendon. Credit: Dominic Lorrimer\n\nSince his breakthrough season in 2022 when he made the All-Australian squad, Chad has gradually become used to the level of interest in his career at home. The star midfielder seriously considered offers to move home to the Dockers and Eagles, but understood that his life would change dramatically.\n\n“On the weekend, we went out because Dad was over for the [Giants] game, and went out to the [Coogee] Pav to have a few beers, and you never do anything wrong, but I feel like [in] Perth they’d be trying to find something that you’re doing wrong, so that is really annoying,” Chad said.\n\n“Even coaches over there – I think at the moment the Freo coach [Justin Longmuir] is copping it a lot – and I think it’s really, really tough in that regard, too, because fans are pretty ruthless over there. And I think a lot of the time they want to blame, and just want to keep blaming and blaming, and I think the coach at the moment is kind of falling victim to that a bit.”",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/who-stole-my-recipe-maehashi-and-bellamy-must-realise-they-re-already-cooked-20250508-p5lxoj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Who stole my recipe? Maehashi and Bellamy must realise they’re already cooked",
    "publish_date": "Sat, 10 May 2025 09:30:00 +1000",
    "category": "finance",
    "authors": [
      "Malcolm Knox"
    ],
    "text": "If a famous chef wanted to publish a cookbook that was actually useful, it might be called How to Cook When You Haven’t Left Enough Time And Don’t Know Where Anything Is.\n\nIt would have chapters titled: “Where’s The F---ing Cornflour?” and “Why Is the Person Who Hid the Cornflour Not Answering Their Phone?” or “What is Cornflour anyway and Can I Just Use Flour Instead? Where’s the F---ing Flour? Oh S---, Is It Wrong To Use Self-Raising Flour!”\n\nIllustration by Dionne Gain Credit:\n\nThis is such a brilliant idea for a million-selling cookbook, you’d copyright it. Only, I Hate To Cook has been done. There are websites called “57 Recipes”, “100 Super-Easy Healthy Dinners for People Who Hate to Cook”. A service called “I Hate Cooking” comes to your home and cooks ingredients they’ve told you to buy (unless you hate grocery shopping even more than cooking). Jamie Oliver’s 15-Minute Meals are for people who hate cooking. Gordon Ramsay’s TV career is for people who hate being in kitchens.\n\nThe challenge for cookbooks is that everything’s already been done, done and done again. Less the bad ideas than the good ones, like how to make a caramel slice. The current stink setting off smoke alarms in Australia’s best-selling kitchens is whether Brooke (Bake with Brooki) Bellamy has re-hashed Nagi (RecipeTin Eats) Maehashi’s caramel slice and baklava recipes. Bellamy also has been accused of cutting and pasting Bill Granger’s Portuguese tart and Sally McKenney’s vanilla cake.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/wallabies-stars-issue-plea-for-maligned-prop-to-take-on-lions-20250509-p5lxvn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wallabies stars issue plea for maligned prop to take on Lions",
    "publish_date": "Sat, 10 May 2025 09:26:30 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Wallabies star Lukhan Salakaia-Loto has launched an emphatic defence of embattled Test teammate and close friend Taniela Tupou – issuing a stern message to selectors ahead of the British and Irish Lions series.\n\n“Look, if there’s any chance we have of winning a Lions series and home World Cup, he has to be involved,” the Queensland Reds lock declared.\n\nTupou’s form has been heavily scrutinised in the 2025 Super Rugby Pacific campaign, unable to recapture the brand that made him one of the globe’s most ferocious props.\n\nTaniela Tupou’s place in the Wallabies squad is under threat. Credit: Getty Images\n\nConfidence is now seemingly at an all-time low for the 28-year-old, who landed on the public radar in childhood when footage of “Tongan Thor” went viral.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/world/new-details-about-pope-leo-emerge-20250510-p5ly31.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "New details about Pope Leo emerge",
    "publish_date": "Sat, 10 May 2025 08:04:46 +1000",
    "category": "finance",
    "authors": [],
    "text": "New details about Pope Leo emerge\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/afl/mcgovern-rocked-in-brutal-collision-20250510-p5ly2u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "McGovern rocked in brutal collision",
    "publish_date": "Sat, 10 May 2025 06:18:12 +1000",
    "category": "sports",
    "authors": [],
    "text": "McGovern rocked in brutal collision\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/obrien-puts-knights-on-notice-20250510-p5ly2t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "O'Brien puts Knights on notice",
    "publish_date": "Sat, 10 May 2025 06:12:58 +1000",
    "category": "finance",
    "authors": [],
    "text": "O'Brien puts Knights on notice\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/queensland/a-test-proved-mia-had-been-drugged-but-many-other-victims-never-know-for-sure-20250507-p5lx8a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A test proved Mia had been drugged. But many other victims never know for sure",
    "publish_date": "Sat, 10 May 2025 06:00:00 +1000",
    "category": "finance",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Mia* was out for drinks with her colleagues in Brisbane’s Fortitude Valley three years ago when her drink was spiked. She had switched to water about 10pm, not wanting to drink too much at the work event at a Brunswick Street Mall bar. But half an hour later, the then 24-year-old started feeling “super nauseous”. “Everyone was asking me if I was OK, if I had drunk too much. I was confused because I had stopped drinking,” Mia recalls. She left the bar and returned to her office, where she collapsed at her desk. “My body felt really heavy. I could move, but my movements weren’t very controlled. I don’t think I could have stood up properly and walked unassisted without falling over.” She called her partner to come pick her up, and made it home safe.\n\nAdvertisement\n\nA few days later, Mia decided to see a GP and ask for a drug test. It returned positive for benzodiazepines, a depressant drug with a sedative effect used to treat anxiety and insomnia. “I suspected I was spiked because I’ve been given benzodiazepines and reacted poorly to them in the past,” she says. “They make me mentally foggy for a few days afterwards, which is how I was feeling.” Loading It’s uncommon for drink-spiking victims to have their experience validated by a toxicology test. “A lot of people usually start piecing it together but then by the time they go [to get tested], it’s too late for anything to realistically show up,” she says. Health professionals say there is a narrow window to test for drugs. For most substances associated with drink spiking, the ideal timeframe is between 12 and 72 hours, though some drugs leave the body in as little as three hours. Some who believe they have been spiked will head to an emergency department, but Queensland Health say hospitals “will not routinely facilitate testing for drink spiking due to impact on treatment times”. “Our emergency departments treat patients based on their symptoms to ensure they receive the best care possible, and toxicology tests are generally not required to guide treatment,” a spokesperson said. They can, however, refer patients to police for forensic testing.\n\nAdvertisement\n\nQueensland Police say that once a complaint is received, “an investigation will commence” and testing will be organised if needed. In Queensland, emergency departments do not routinely test for drink spiking. Credit: Dion Georgopoulos The Alcohol and Drug Foundation chief executive Dr Erin Lalor AM says drink spiking has always been under-reported in Australia, with victims often fearful they’ll be blamed for what happened, “especially if they were already drinking or taking other drugs”. But what if there was a faster way to determine if a drink has been spiked, even before the victim or the perpetrator leaves a venue? Troy Stewart is the managing director of SureScreen Diagnostics Australia, the company behind a new rapid drink-spiking test. He believes these devices are the missing component to address the issue. The device is designed to detect drugs commonly associated with drink spiking, including GHB, ketamine and 22 types of benzodiazepines, within minutes, not hours. While no single test can guarantee a drink is safe, Stewart says SureScreen Diagnostics’ technology has performed significantly better than other products, particularly with variables such as milk products and fruit juices.\n\nAdvertisement\n\nStewart has spent the last 12 months lobbying governments and other stakeholders to help stock the tests in venues across the country. In high-risk precincts, such as Fortitude Valley, he wants the government to fund a pilot trial that could see them distributed to every bar. Loading “If venues have these devices on hand, it means that anyone who suspects their drink has been tampered with can approach a staff member to have their beverage tested immediately,” he says. In the New South Wales city of Albury, a trial of the devices in the area’s clubs and pubs has seen early signs of success. Nine days after the trial began in February, patrons saw something being added to a woman’s drink. “They reported that to security and security then very swiftly checked video footage and validated what they had seen,” Albury Liquor Accord chair Craig Kidd says. “They approached the victim and took their drink to get tested. It returned a positive result – twice.”\n\nAdvertisement\n\nKidd says the victim was taken to a hospital in Albury with the tests, where police were also called. NSW police used the security footage to identify the perpetrator, who was found and charged with possessing illicit substances. The Multi-Lined Rapid Beverage Test (MRBT) can detect over 20 substances commonly associated with drink spiking. Credit: Markus Ravik “We’re hoping by having the drink spiking devices available during this trial, we can normalise that you should report it,” Kidd says. Stewart has presented to Hervey Bay, Maryborough, Gympie, Bundaberg, Gladstone and Chinchilla liquor accords, and contacted Queensland’s chief police, health, justice and youth ministers. He says they’ve been receptive, but as yet, no Queensland cities have signed up for a trial like the one in NSW. Kidd says Albury’s trial began in response to reports, largely spread across social media, about incidents of suspected drink spiking. “The local press picked up on that ... but it was really hard to quantify.”\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/national/labor-has-the-mandate-to-think-big-and-seize-opportunity-20250508-p5lxn1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Labor has the mandate to think big and seize opportunity",
    "publish_date": "Sat, 10 May 2025 05:51:00 +1000",
    "category": "finance",
    "authors": [
      "The Age'S View"
    ],
    "text": "“Move us away from fossil fuels and into a future of clean energy and exports”; “far-reaching policies on housing”; “a tax system that is fair and equitable” ; “public schools and health funded so no one is left behind”; “at least begin getting rid of negative gearing”; “address the treatment of refugees and asylum seekers”.\n\nThe Labor Party’s unprecedented achievement of winning a second term with an increased majority has The Age’s letter writers thinking big. Prime Minister Anthony Albanese and Treasurer Jim Chalmers are sitting on a freshly won heap of political capital, they argue; surely now is the time to start adding items to their shopping list for the next three years and even beyond?\n\nTreasurer Jim Chalmers on election night. Credit: ABC\n\nOn election night, Chalmers acknowledged “impatience” in the community when it comes to “our big national challenges”, but when asked about major tax reform, he demurred, insisting that “our agenda is the one that we took to the people” and pointing to the numbers in the Senate – which are not so clearly in Labor’s favour – to qualify any talk of greater ambition.\n\nThe priorities Chalmers reiterated on election night – housing supply, transforming how we generate energy, increasing productivity – are certainly first-order tasks and ones where Labor could be accused of so far tinkering at the edges rather than making the kind of profound policy shifts the situation demands.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/culture/music/we-have-our-sights-set-on-world-domination-how-spacey-jane-became-australia-s-biggest-band-20250505-p5lwor.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘We have our sights set on world domination’: How Spacey Jane became Australia’s biggest band",
    "publish_date": "Sat, 10 May 2025 05:30:00 +1000",
    "category": "entertainment",
    "authors": [
      "Jules Lefevre"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In August 2022, Caleb Harper was sitting in his underwear in a sweltering room in Los Angeles, willing the air-conditioner to work. The Spacey Jane frontman had just begun scribbling down the first lines of a song that would become August, the first track to emerge from their third album. But it wasn’t coming easily in the 40-degree heat and the song ended up sitting on the shelf for about 18 months, Harper occasionally pulling it down to tweak a line here or there. Other songs came and were put to tape, the album was nearly tied up, but August remained out-of-reach. “I had a counter melody that wasn’t working,” Harper says over Zoom from Los Angeles, air-conditioning working this time. “I ended up writing it on the last morning, and Peppa [Lane, bassist] and I went in and sang it that day.” That final counter melody carries out the track with the floating refrain “if that makes sense?“, which the band then lifted for the album’s title. “It really bookends that period,” Harper says, noting its meaning shifted considerably over the writing period, from a meditation on leaving Australia to predicting the beginning of a breakup. “It’s a hard listen, honestly.” Spacey Jane on stage in Melbourne in December 2021, after the breakout success of Booster Seat. Credit: Getty August, like the rest of If That Makes Sense, was written and recorded over two years in LA – the first time the Perth band had recorded outside Australia. It was a big deal for the quartet (Harper and Lane are joined by drummer Kieran Lama and guitarist Ashton Hardman-Le Cornu), who have been synonymous with the Australian indie rock scene since their jangly, vulnerable 2020 debut album Sunlight. Sunlight was borne from the runaway single Booster Seat, which reached #2 in that year’s Hottest 100, behind Glass Animals’ Heat Waves. The band would become frequent Hottest 100 lurkers: in the 2022 countdown, following their second album Here Comes Everybody, they featured six times, three of those coming in the top 10. In 2022, the band was the third-biggest seller of vinyl for the year, behind Taylor Swift and Harry Styles. They’ve ridden this wave of popularity on numerous sold-out tours of the country, and are comfortable standalone headliners for the biggest local festivals. There aren’t many bigger bands in Australian music right now, if any.\n\nAdvertisement\n\nFollowing the gruelling touring schedule for Here Comes Everybody (which had really stretched back years to the start of Sunlight), the band’s management stepped in and told them to take a break. “It started as quite a difficult thing,” Harper says. “It was almost counterintuitive … We are a band that considers our job to play shows. It was almost like the music served that. Now we’ve gone through a process of unlearning that and figuring out how to focus on making this record and pulling this world together first. And also giving the market a bit of space, from a business perspective. “But once we hopped off that train, we were all freaked out. Especially, because we were living all around the world, we didn’t see each other as much.” Like many Australian artists before him, Harper landed in LA and endured the merry-go-round of songwriting sessions – a process he called “f---ing terrifying”. “I’d always been protective of the songwriting process, and it always has been in my bedroom,” he says. “I didn’t know how to advocate for ideas that I liked, and I didn’t know how to say no to things I didn’t like. I would often not put forward ideas at all because I was just like, ‘If they don’t like it, that’s embarrassing’. But now I find it’s liberating to have that conflict of ideas. I’m grateful that I went through that transition.” It’s easy to understand Harper’s apprehension. His lyrics have always been intensely personal, and the songs on If That Makes Sense feature some wrenching moments. On the churning single All the Noise, Harper reflects on his upbringing: “And that was the way that they gave to me … A promise that I would hurt everybody that I ever meet”. Then there’s the shouted, tortured mantra in So Much Taller: “You’ll never be enough and you’ll never be loved, and the fact you tried is embarrassing enough”. Recent single Through My Teeth obliquely references Harper shedding his religious upbringing and throwing himself headlong into partying at university. A lot of the album pulls in this direction and sifts through the various answers to the question: what happens when you have to drag your trauma into adulthood? “Being out here,” Harper says after a pause, after we bring up Through My Teeth, “it’s almost like pulling myself out of my present life in Australia made the past compress, like the last 26 years of my life were all just in one accessible bank in a way that they hadn’t been before”.\n\nAdvertisement\n\n“All of a sudden things didn’t seem as far away – not that they were any clearer,” he says. “I still have trouble recalling much of my childhood, as I think a lot of people do, especially if they have negative things associated with that … Your brain tends to bury things or contort them. But I think a lot of it became far clearer or more in my face than it had been before.” Being away from Australia pulled some things into focus, but it also brought with it a lot of homesickness and guilt. “I think family is the main one,” Harper answers, when I ask where the guilt comes from. “There’s already a host of issues and contentious things there. Being away is an interesting escape from that. “But sometimes I take too much liberty when it comes to escaping things back home. Like I’m really bad at messaging my friends back, I’m really bad at calling my dad … and that’s just something that weighs on me a lot. Relationships suffer, and you feel like it’s your fault.” ‘We’d be kicking ourselves if we didn’t try [to break overseas].’ Caleb Harper, frontman of Spacey Jane Sonically, If That Makes Sense doesn’t deviate wildly from the Spacey Jane playbook, but the band have beefed things up considerably with undercurrents of synths and layers upon layers of guitars and vocals. It’s the result of taking a longer time in the studio, and the presence of big-time producer Mike Crossey (Arctic Monkeys, the 1975, Wolf Alice). “We didn’t shy away from producing it, like really producing it,” Harper says. “It was like, ‘Let’s put everything in here that we like and make it feel as big and wide as possible’.” The band also ran the entire record through tape at the end, a process that rounds out the sound and makes it feel richer, warmer (like the difference between an MP3 file and a vinyl record).\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/coalitions-quota-question-as-labor-swears-in-record-number-of-women/dgvvi54km",
    "title": "The Coalition's 'hard, fast' quota question as Labor swears in record number of women",
    "publish_date": "Sat, 10 May 2025 01:15:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "A record number of women helped Labor secure its landslide election win, raising questions around how the Coalition can boost its gender diversity.\n\n\n\n\n\nLabor women will outnumber men in the lower house for the first time, with at least 15 newly elected MPs contributing to the 48 of 90 seats already called for the major party.\n\n\n\n\n\nNew faces in parliament include Renee Coffey, representing Griffith after defeating the Greens' Max Chandler-Mather , Jo Briskey who succeeds former NDIS minister Bill Shorten in Maribyrnong, and Ash Ambihaipahar, who takes over Barton from former Indigenous Australians minister Linda Burney, who has retired.\n\n\n\n\n\nWomen's Minister Katy Gallagher told ABC's RN it's a testament to Labor's continued work towards gender equality over three decades, having introduced quotas in 1994.\n\n\n\n\n\n\"The thing about gender equality in the Labor Party is everyone in the caucus is for gender equality. That conversation or that argument has been won,\" Gallagher said on Wednesday.\n\n\n\nA record-breaking number of women have been elected to Australia's parliament, with a major share coming from Labor's ranks in the House of Representatives. Source: SBS News Labor MPs will join a historic 48th parliament with at least 67 women making up the lower house, an increase from 58 in 2022 and 40 under a Morrison-led government.\n\n\n\n\n\nHowever, that number could rise as high as 72 depending on the final results in Bean, Longman, Monash, and Bullwinkel.\n\n\n\n\n\nCatherine Hunter, CEO of the Diversity Council of Australia, told SBS News this election marked a major milestone for gender diversity in parliament, with diversity more broadly \"essential for a healthy democracy\".\n\n\n\n\n\n\"When people making decisions reflect the diversity of the Australian community, the policies they create are more likely to be more inclusive, more effective, and ultimately, fairer,\" she said.\n\n\n\n\n\nShe said lived experience is critical to making decisions, otherwise leaders risk \"overlooking or misunderstanding the realities facing huge sections of the population\".\n\n\n\n\n\nSo, how does Australia compare to the rest of the world?\n\n\n\nCoalition faces quota pressures as women representation drops\n\nWhile Labor's gender diversity continues to grow, the Coalition went backwards at this election.\n\n\n\n\n\nIt elected seven women MPs out of 40, a decrease from nine in 2022. It may be boosted slightly by Gisele Kapterian, if she retains the tightly contested seat of Bradfield in NSW.\n\n\n\n\n\nThis is due to Bridget Archer losing Bass and Jenny Ware losing Hughes, as well as men replacing retiring MPs Karen Andrews in McPherson and Nola Marino in Forrest.\n\n\n\n\n\nOf the 10 independents currently projected to enter parliament, seven are women.\n\n\n\n\n\nFormer Liberal frontbencher Simon Birmingham argues the Coalition should consider \"hard, fast and ambitious\" quotas for women in parliament, with representation so low.\n\n\n\n\n\n\"I struggle to think of any alternatives if there's to be a new direction that truly demonstrates change and truly guarantees that the party will better reflect the composition of modern society,\" he said in a post on LinkedIn.\n\n\n\n\n\nFormer Liberal NSW premier Barry O'Farrell said it is important that political parties reflect the community they represent, with more diversity both culturally and in terms of gender.\n\n\n\n\n\nPressed on women quotas specifically, he told SBS News the Liberals \"need to increase its diversity in all areas\".\n\n\n\nA record number of women will represent Australians in the federal parliament, a considerable uptick from the 58 women who were elected to the 47th parliament. Source: SBS News Michelle Ryan is the director of the Global Institute for Women's Leadership at The Australian National University.\n\n\n\n\n\nShe told SBS News that alongside quotas, the Coalition needs to consider where it's placing its women candidates, avoiding the glass cliff.\n\n\n\n\n\nThe glass cliff refers to women being given leadership opportunities during difficult times or times of crises, but in a political context, can refer to being placed in more difficult contests.\n\n\n\n\n\n\"We did an analysis last election and what we saw is that women are more likely than men to be placed in risky and precarious seats, so ones that are basically either unwinnable or difficult to win or hold,\" she said.\n\n\n\n\n\n\"They do differ by party as well. For the Coalition, women were much more likely to be in those unwinnable seats.\"\n\n\n\nSource: SBS News\n\nHow does Australia compare to the rest of the world?\n\nAustralia does \"pretty well relative to its comparators\", according to Ryan.\n\n\n\n\n\nShe said Scandinavian countries such as Finland, which has had three women prime ministers, and Switzerland, which has had five women presidents, often lead perceptions around gender diversity.\n\n\n\n\n\nHowever, parliaments like Rwanda, which in 2024 had 50 per cent representation, often surprise the public.\n\n\n\n\n\n\"So that's partly due to quotas. It's partly to do with genocide, where many men were killed. So the reasons for representation are often different,\" she said.\n\n\n\n\n\nShe said this includes the rise of women to head of state due to marriage or being the daughter of a previous prime minister.\n\n\n\n\n\nOther countries with at least half of their parliament or lower house made up of women include Cuba, Nicaragua, Andorra, Mexico and the United Arab Emirates, according to UN Women.\n\n\n\n\n\nUN Women calculates that globally, only 27.2 per cent of parliamentarians in single or lower houses are women, with monarchy-based systems excluded from the count.\n\n\n\n\n\nDespite a mammoth election year globally in 2024, 107 countries have yet to have a woman as the head of state.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-the-role-of-non-medical-interventions-in-managing-chronic-pain/p1ed6x4ws",
    "title": "INTERVIEW: The role of non-medical interventions in managing chronic pain",
    "publish_date": "Fri, 9 May 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/hysterectomy-the-word-that-fails-women-suffering-heavy-periods/4e36logjg",
    "title": "Hysterectomy: the word that fails women suffering heavy periods",
    "publish_date": "Fri, 9 May 2025 21:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nMenstruation can be disruptive for many, but for some women it can be crippling.\n\n\n\n\n\n\"I'd get out the door and I would flood to the point where I'd have to come back and change again. And I'd literally just sit down and cry and think, 'I can't do this anymore' Because it was ruining every aspect of my life.\"\n\n\n\n\n\nSixty-year-old Michelle Watts is recounting a ski trip - one of many occasions where she bled through layers of clothing.\n\n\n\n\n\nMichelle suffered from heavy menstrual bleeding for 18 months from 2021, which the Australian Commission on Safety and Quality in Healthcare defines as excessive menstrual blood loss that interferes with a woman's quality of life.\n\n\n\n\n\n\"I was about as sad as I could ever be because everything was, everything was impossible to do in my eyes by the end. I couldn't go swimming with my friends anymore, swimming became challenging, going to the gym became challenging. All those things that I loved to do, I just couldn't do.\"\n\n\n\n\n\nAfter many failed treatments, Michelle finally underwent a uterectomy, traditionally known as a hysterectomy.\n\n\n\n\n\nBut the original terminology for this procedure is causing concern among some specialists, due to its links to the Greek word 'hysteria'.\n\n\n\n\n\nDr Talat Uppal is a Gynaecologist and Director at Women's Health Road - and is in the process of changing the language.\n\n\n\n\n\n\"It was really thought to explain a lot of the concerns women might have had.... both on the emotional and physical front, which was actually not factual and not found to be correct.\"\n\n\n\n\n\nOne in four people who menstruate suffer from heavy menstrual bleeding, and two thirds of those experience iron deficiency.\n\n\n\n\n\nYet less than half of women suffering from the condition visit a doctor.\n\n\n\n\n\n\"Traditionally or historically women have been left out of research. And sometimes even the animals in the labs were male animals. And so this is a long historical background of disadvantage of not including women. And we really want to change that narrative when it comes to heavy bleeding.\"\n\n\n\n\n\nDr Uppal welcomes a number of measures in the government's multi-million dollar investment in women's health, but would like to see more attention given to this issue.\n\n\n\n\n\n\"I think it's just part of that silence around heavy menstrual bleeding... and I don't think it's deliberate, I feel it's just a culture where it's not front of mind.\"\n\n\n\n\n\nMichelle believes a lack of awareness is why she struggled to receive adequate care for months.\n\n\n\n\n\n\"It's just been so normalised....and I don't think it should be, I don't think it's normal. And it's really hard to get any information because it's just taken as 'well you're a woman, this is what happens.\"\n\n\n\n\n\nShe can't imagine what her life would have looked like without undergoing the procedure, now relishing the active lifestyle she was forced to sacrifice.\n\n\n\n\n\n\"My ability to participate in skiing, running, swimming... all of the things that I wanted to enjoy, that's all possible again, I never have to worry about that ever again, it's like an absolute new lease of life.\"\n\n\n\n\n\nIt's part of an international effort to make medical language more accurate.\n\n\n\n\n\nHelping lead the change is the CSIRO, who are responsible for updating global standards for clinical terminology.\n\n\n\n\n\nKatrina Ebril is the Interoperability Lead with the Australian e-Health research centre at the CSIRO, and says this change is a first when it comes to women's bodies.\n\n\n\n\n\n\"It's definitely time to change... and we do this for other procedures. And it is a uterectomy, let's call it what it is, and start to use that much more positive language and much more language that aligns to what the actual procedure is.\"\n\n\n\n\n\nFor women like Michelle, removing taboos around menstruation is key to making treatment more accessible, and encouraging others to seek help.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-connecting-migrants-with-employers/7em2dsdul",
    "title": "INTERVIEW: Connecting migrants with employers",
    "publish_date": "Fri, 9 May 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/labors-new-frontbench-confirmed-leadership-contests-underway-for-greens-liberals-and-nationals/6c78qxekm",
    "title": "Labor's new frontbench confirmed; leadership contests underway for Greens, Liberals and Nationals",
    "publish_date": "Fri, 9 May 2025 09:57:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"OK, for this hugely expanded Labour caucus. Let's give it up for Australia's Prime Minister”\n\n\n\n\n\nA rockstar welcome... for the leader who led the landslide.\n\n\n\n\n\n\"We don't seek power for its own sake. Not to decide who's in what part of the building. We seek power in order to deliver for the poeple who need Labor to be in government.\"\n\n\n\n\n\nAs the vote count is finalised for the lower house seats, one thing is certain: more women in federal parliament than ever before.\n\n\n\n\n\nFor Labor, six more women have been elected in Queensland alone.\n\n\n\n\n\nMr Albanese says that is something to be proud of.\n\n\n\n\n\n\"I look around this room and I see a representative group. A majority of women, up to - we're still counting of course - but at least 57 per cent women”\n\n\n\n\n\nMr Albanese has also announced his new ministry.\n\n\n\n\n\nAttorney-General Mark Dreyfus and Science and Industry Minister Ed Husic will no longer be on the frontbench.\n\n\n\n\n\nThe new additions include: Tim Ayres and Jess Walsh.\n\n\n\n\n\nTreasurer Jim Chalmers says he is sympathetic.\n\n\n\n\n\n\"We've got too many good people for the spots that we have. You know, I feel for those two guys. It's always difficult when you've got as much talent as we have to fit everyone in.\"\n\n\n\n\n\nFormer Labor Prime Minister Paul Keating was outraged, describing the demotion in a statement as an appalling denial of Ed Husic's diligence and application.\n\n\n\n\n\nThe optics of this decision are challenging for Labor, which promotes itself as the party of inclusion and diversity.\n\n\n\n\n\nDeputy Prime Minister Richard Marles has defended Anthony Albanese's decision.\n\n\n\n\n\n\"Only 30 spots are available. Inevitably there are more people who could serve as really effective ministers... And it can be tough, but we need to balance stability with renewal.\"\n\n\n\n\n\nMeanwhile, the Opposition is seeking to rebuild after its election loss.\n\n\n\n\n\nThe two candidates confirming their intentions to run for the leadership are opposition spokesman for treasury affairs Angus Taylor; and deputy leader Sussan Ley [[Lee]].\n\n\n\n\n\nThey both delivered their pitches - Sussan Ley:\n\n\n\n\n\n\"I'm not going to take a backwards step. We can be successful. We can win the next election, and this is a moment to look forward.\"\n\n\n\n\n\nand Angus Taylor:\n\n\n\n\n\n\"I've rebuilt businesses. I've fought on the frontlines of tough debates. I know what it takes to lead, unify and deliver.”\n\n\n\n\n\nThe Nationals are still reeling from the defection of Jacinta Nampijinpa Price to the Liberal Party, while David Littleproud is now facing a contest over his job as leader of the junior Coalition party.\n\n\n\n\n\nAs a member of the Country Liberal Party, Ms Price can choose to sit with either the Liberals or Nationals.\n\n\n\n\n\nShe says she believes she can have a greater impact by switching to the Liberals.\n\n\n\n\n\nNationals Senate leader Bridget McKenzie told Sky News she is disappointed.\n\n\n\n\n\n\"Yeah absolutely. I think it's a devastating loss to our party room, particularly our Senate party room. We're a tight team. We're a close knit team. We fought many battles together, and whilst we're strong Coalitionists, we are very, very separate parties. And so it's very disappointing news that Jacinta has decided to head over to the Liberals.\"\n\n\n\n\n\nThe Greens are also yet to choose a new leader, but acting leader Nick McKim says they're ready to wield the Senate balance of power.\n\n\n\n\n\n\"The Prime Minister's comments have more than a whiff of arrogance and hubris and we have no intention of taking our riding instructions from an arrogant prime minister.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/video/flagship-mother-multiverse-portrait-of-maternal-conjurer-wins-archibald-prize/g27tiqtwp",
    "title": "Flagship Mother Multiverse! Portrait of maternal 'conjurer' wins Archibald prize",
    "publish_date": "Fri, 9 May 2025 09:41:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/australian-catholics-wake-up-to-a-new-pontiff/jr9x94qb7",
    "title": "Australian Catholics wake up to a new pontiff",
    "publish_date": "Fri, 9 May 2025 09:37:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/indian-premier-league-ipl-suspended-amid-india-pakistan-conflict/rfrh6140f",
    "title": "Australian players dash to fly home as Indian Premier League postponed amid India-Pakistan conflict",
    "publish_date": "Fri, 9 May 2025 08:05:10 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's highest-profile cricket stars are scrambling to fly out of India, with the Indian Premier League (IPL) suspended due to the country's escalating conflict with Pakistan.\n\n\n\n\n\nAfter players woke up Friday uneasy and uncertain on their immediate future, Indian officials announced after lunch the league would be suspended for one week with immediate effect.\n\n\n\n\n\nIt came as bosses of the world's most popular cricket tournament met the morning after a match in Dharamsala was abandoned amid air raid warnings in the area.\n\n\n\n\n\nSeveral Australian players have begun moving towards airports, with some to fly out as early as Friday.\n\n\n\n\n\nOthers are facing logistical hurdles to leave the country due to airport closures, including bus rides of up to four hours before eight-hour train trips for some players.\n\n\n\nThe Board of Control for Cricket in India (BCCI) secretary Devajit Saikia confirmed in a statement the decision was made after teams confirmed concerns from their players about the tournament continuing.\n\n\n\n\n\nFriday's decision to suspend the IPL came as the Pakistan Super League (PSL) was moved to Dubai, with six Australians featuring in that competition.\n\n\n\n\n\nThe PSL's move is expected to clear the path for overseas players to see out the tournament, with Australians David Warner, Sean Abbott and Ben Dwarshuis among those featuring.\n\n\n\n\n\n\"The safety and welfare of our players and staff is always a core priority and we support today's decision by the BCCI,\" Cricket Australia CEO Todd Greenberg said.\n\n\n\n\n\n\"We continue to work closely with the Australian Government, PCB and BCCI and are maintaining regular communication with players and support staff in both India and Pakistan.\"\n\n\n\nThe suspension of the IPL will leave a number of questions, including whether the lucrative league will resume after a week or indeed at all this year.\n\n\n\n\n\nIf it does resume, there is also no guarantee overseas players would return and be available.\n\n\n\n\n\nSome 12 games remain in the competition, along with a four-game finals series.\n\n\n\n\n\nQuestions will also linger over the ramifications regarding player payments, given all teams have up to two matches left to play out.\n\n\n\n\n\nSome Australian players were understood to be keen to exit the country, but were also concerned about what it could mean for future chances if they did quit the league.\n\n\n\nThe Punjab Kings, coached by former Australian captain Ricky Ponting, leaving after the ground they were playing in was evacuated. Source: AP / Ashwini Bhatia Test captain Pat Cummins, fellow fast bowlers Josh Hazlewood and Mitchell Starc, and star batter Travis Head are among the Australians featuring in the tournament.\n\n\n\n\n\nMarcus Stoinis, Josh Inglis, Mitch Marsh, Nathan Ellis, Aaron Hardie and Xavier Bartlett are among other Australians still playing, while numerous compatriots are also represented within coaching staff and media covering the competition.\n\n\n\n\n\nFor Test players, the suspension is likely to mean unexpected time at home before next month's World Test Championship final in England and a subsequent tour of the West Indies.\n\n\n\n\n\nThe need to suspend the tournament was made clear when air-raid warnings prompted the Ricky Ponting-coached Punjab Kings' match against Starc's Delhi side to be abandoned on Thursday night as the stadium was evacuated.\n\n\n\nAirports in Dharamsala and Chandigarh — where the Kings are based — have been closed for civilian and commercial use since Wednesday, while others across India's north-western corridor are also out of bounds to the cricketers.\n\n\n\n\n\nThree IPL franchises — Chennai Super Kings, Sunrisers Hyderabad, and Rajasthan Royals — are already out of finals contention.\n\n\n\n\n\nCricket Australia (CA) has been across the situation in India and Pakistan since 26 people were killed and 17 injured in an attack in the Kashmir region late last month.\n\n\n\n\n\n\"We continue to closely monitor the situation in Pakistan and India, including obtaining regular advice and updates from the Australian government, the PCB [Pakistan Cricket Board], BCCI and local government authorities, and maintaining communication with our players and support staff currently in the region,\" a CA spokesperson said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/a-north-american-pope-india-pakistan-escalation-and-dolphins-wtf/prn2zdf8k",
    "title": "An American Pope, India-Pakistan escalation and Dolphins WTF?!",
    "publish_date": "Fri, 9 May 2025 07:22:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/many-australians-unaware-of-blood-cancer-symptoms-research-finds/dawnfhk62",
    "title": "Many Australians unaware of blood cancer symptoms, research finds",
    "publish_date": "Fri, 9 May 2025 06:08:23 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nCan you name a single blood cancer symptom?\n\n\n\n\n\nThat's a question being asked by the Leukaemia Foundation, which says its own research reveals that 4 out of 5 Australians cannot name a single symptom.\n\n\n\n\n\nBill Stavreski, the head of research at Leukaemia Foundation, says there are seven symptoms to look out for.\n\n\n\n\n\n\"That includes recurrent infections, increased fatigue, pain in bones and joints, excessive night sweats and enlarged lymph nodes. So generally, around the neck and groin region. One of the other symptoms is unexplained weight loss. So if you are losing weight but not changing your diet, not exercising, but you are seeing it on the scale; then that is a tell-table sign of a possible blood cancer.\"\n\n\n\n\n\nThe Foundation says there has been a 79 per cent jump in the incidence of blood cancer in the past 20 years.\n\n\n\n\n\nBlood cancer impacts all age groups including children, teenagers and adults.\n\n\n\n\n\nProud Brinja-Yuin woman Kerry Boyenga is an author and teacher of the Indigenous language, Dhurga.\n\n\n\n\n\nShe was diagnosed with the blood cancer non-Hodgkin lymphoma in 2017 and thankfully survived her diagnosis.\n\n\n\n\n\nHer main symptom was a tumour in the left-hand side of her neck which grew to be the size of a tennis ball.\n\n\n\n\n\nDoctors put it down to a side effect of an existing autoimmune illness that Kerry had - which initially delayed her diagnosis.\n\n\n\n\n\n\"I first noticed something was wrong in December of 2016. It wasn't until June 2017 that it was actually diagnosed. It was quite some time before anybody did take it seriously. I completely understand that. Yes, I had this disorder and I am getting swollen glands. Because I have had it for as long as I've had it, but I've never had one that had grown to the size that it was. And it was really quite frightening and it's horrendous to look at it. When I look at it now, I look at the photos and I think: 'oh my God, was that really me?' So it was stage two by the time I was diagnosed.\"\n\n\n\n\n\nDespite being in remission, Kerry still lives with the physical, psychological, and financial impacts of her diagnosis.\n\n\n\n\n\nKerry has had vision issues in her left eye, cardiac issues, and a type of shingles, which has meant she's had to reduce her workload.\n\n\n\n\n\nDespite all of this, she feels incredibly grateful for the support shown to her from family, friends and her local community.\n\n\n\n\n\n\"I think that's because of the support that I had with my family, my husband, most importantly, and my son. But my colleagues, I worked in a Catholic school at the time. They cooked all of our meals because I'd gone from 90 kilos down to 63, I think I was. So I couldn't do anything and I certainly wasn't eating. And I think that all had to do with the beautiful people that were in my life. It was just beautiful. It just shows in these sort of hard times that people can be really beautiful and caring.\"\n\n\n\n\n\nWhile screening programs have improved dramatically for cancers like bowel, skin, breast and prostate; there is no standard screening process for detecting blood cancer.\n\n\n\n\n\nBill Stavreski says blood tests are often the first clinical indication that something is wrong.\n\n\n\n\n\n\"When you go to your GP and ask for a blood test, a full blood count should be able to provide an indication if there is anything wrong. So that might be looking at red cells or white cells - either they're too low or they're too high. So that should be an indication that it could possibly be blood cancer.\"\n\n\n\n\n\nProfessor Ian Olver is a cancer researcher at the University of Adelaide.\n\n\n\n\n\nHe says there have been great developments in the treatment of many cancers, with immunotherapy showing positive results.\n\n\n\n\n\n\"Well, certainly with childhood (cancers), leukaemia treatments have done incredibly well over the last few years. Not quite so well with adults. But we're starting to improve the treatments, particularly as we're starting to introduce immunotherapy with our chemotherapy. So I think we can be optimistic that as the years go by, there is potential to cure these diseases will be greater. Or at least control them, so someone can have a normal lifespan.\"\n\n\n\n\n\nThe good news is like many cancers, the sooner someone is diagnosed with blood cancer, the greater their chances of surviving the disease.\n\n\n\n\n\nBill Stavreski again.\n\n\n\n\n\n\"It's important to take action quickly and go see your doctor. Delaying seeing your doctor will mean delaying diagnosis (and) delaying treatment. And unfortunately, if there is a delay in diagnosis, survival rates, positive outcomes really are reduced.\"\n\n\n\n\n\nKerry has been in remission for years now. And she says she is doing all the right things to keep on top of her health.\n\n\n\n\n\n\"I have been in remission for seven-and-a-half years. So I am heading into my eighth year. And it can come back. It may not. I am just really grateful that here I am; and I've still got an extra right years when it could have been over sooner, you know?.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/politics/federal/australian-federal-election-2025-live-results-victoria-key-swing-seats-news-updates-start-time-liberal-labor-independent-teal-kooyong-goldstein-wills-bruce-zoe-daniel-tim-wilson-peter-khalil-samantha-ratnam-julian-hill-zahid-safi-monique-ryan-amelia-hamer-20250502-p5lw46.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victoria hot seats LIVE results: Ryan’s lead dips slightly as count continues in Kooyong; Peter Khalil, Julian Hill join ALP colleagues in Canberra",
    "publish_date": "Sat, 10 May 2025 11:31:07 +1000",
    "category": "finance",
    "authors": [
      "Rachael Dexter",
      "Charlotte Grieve",
      "Clay Lucas",
      "Cara Waters"
    ],
    "text": "It didn’t feel like a defining moment at the time. But looking back, it probably was.\n\nAs week two of the campaign for Wills drew to a close, Labor’s Peter Khalil stood on an outdoor basketball court in North Fitzroy, announcing $3.7 million to rebuild Linear Park, which includes one of the busiest bike paths in the country.\n\nOnce an old rail line, it became green space under former Wills MP and prime minister Bob Hawke. Now, here Khalil was with Yarra Council’s socialist mayor Steve Jolly promising to help rebuild it.\n\nAbout 100 people were gathered, far more than the few dozen at a debate in Fawkner the day before that Khalil had skipped. But this time, he’d shown up – in the heart of Greens territory, flanked by Boomers who’d ventured out from their multi-million-dollar homes on this sunny Sunday afternoon. Some were familiar from when I covered this area for The Melbourne Times 20 years ago.\n\nThe spending pledges didn’t stop at Linear Park: Gillon Oval, Fawkner Netball Club, Merri Creek – all were promised serious money. Khalil was offering a powerful marginal seat message: “I’m in government, I can bring home the goods.”\n\nFormer state Labor MP Carlo Carli put it plainly: “This was a masterful campaign based around this idea that ‘A Labor government can deliver, and here I am, ready to deliver’.”\n\nLabor MP Peter Khalil has won re-election in Wills. Credit: Gus McCubbing\n\nIt worked in the richer southern end of the electorate, where voters who long ago came over to the Greens could be persuaded back to Labor with two key messages: don’t risk Dutton, and keep the good stuff flowing.\n\nBut in the north of the seat – where many voters are Muslim, rent, or have grown tired of Labor taking them for granted – it was a different story.\n\nHere, Greens candidate Samantha Ratnam – who quit state parliament to run for the federal seat – made a strong pitch, promising to address rent hikes, the climate catastrophe, soaring costs and Gaza.\n\nIn a campaign where three Greens including leader Adam Bandt – and even Liberal leader Peter Dutton – were swept aside by Labor, Ratnam drove a 7 per cent swing against the party, pushing this once-safe seat to the brink. Against the national tide and a flat Labor incumbent, she turned Wills into a key contest.\n\nFor months, alongside her campaign, a group called Muslim Votes Matter had been urging voters to punish Labor explicitly over Gaza – at mosques, markets and community events.\n\nGreens candidate Samantha Ratnam, pictured with outgoing Greens leader Adam Bandt, at Brunswick East Primary School during the campaign. Credit: Getty\n\nTheir effort boiled over in week one of pre-polling, when a Labor staffer and a Palestinian activist clashed over a protest sign. Police were called.\n\nThe Greens picked up big swings in the Muslim-majority north. They even won a booth – John Fawkner Secondary College – for the first time, with a stunning 28 per cent swing on the two-party vote.\n\nWas it Gaza? Was it housing affordability pushing younger Greens voters into the outer north? Was it climate inaction? Probably all three and more. And yet, it wasn’t enough. Like all the times before that the Greens said they might win it, Wills didn’t flip.\n\nLabor’s showing in Wills though was notably weak compared to neighbouring Melbourne where the party notched a nine per cent swing and toppled Bandt. In Wills, Labor hung on by its fingernails, relying on incumbency, funding promises and fear of Peter Dutton to scrape over the line.\n\nOne of the most insightful interviews of this campaign was with Phil Cleary, who knows Wills as well as anyone. He believed Gaza could influence the vote. The former independent MP and Coburg football legend held the seat from 1992 to 1996 after Hawke resigned. He remains the only non-Labor MP ever to do so.\n\nKhalil, Cleary said, “is a victim of a party that won’t use words like genocide and won’t talk strongly about the killing of women and children in Gaza”. But Cleary wasn’t sure it would cost Labor the seat; he lost to the machine himself and knows how ruthless and effective ALP campaigning can be.\n\nFormer independent MP for Wills Phil Cleary. Credit: Luis Enrique Ascui\n\nBy the final week, Labor’s message came into focus as it used its financial might to blitz the seat with letterboxing and direct mail. One penned by Julia Gillard stuck tightly to the script: every seat lost helped Dutton become PM. Khalil still had PTSD from 2019, he said, when the ALP expected to win government and was beaten by Scott Morrison and his “miracle”.\n\nPre-polling was relentless. I was at the Brunswick booth every day bar one, and Khalil and Ratnam were both there each day that I visited.\n\nAnd while pre-poll in Brunswick was always a theatre of democracy, sometimes it was also farce.\n\nTake Romeo – a One Nation volunteer whose surname I never learned – wandering the line with an Australian flag and sometimes, inexplicably, an Italian one too.\n\nHe would chant “One flag, One Nation”. Could there be a suburb in Australia less welcoming to such sentiment than Brunswick? A man in a Collingwood jumper – notably Indigenous player Bobby Hill’s number 23 – pelted him with eggs.\n\nRomeo shrugged it off, but a couple of days later when he told me someone had threatened to shoot him, he went home, fashioned two metal plates into an ad hoc bulletproof jacket he placed over his shirt, then returned to the booth.\n\nOne Nation volunteer, Romeo, with his armour.\n\nOne Nation’s candidate got a 1 per cent swing, reaching 3.5 per cent of the primary vote. So it appears there’s room for everyone in Australian democracy it seems – even in Brunswick.\n\nThis is the third time I’ve covered one seat for an entire campaign like this. By the final days, it gives you clarity you don’t expect when you start. You come to understand the jostling, the ground game, and how broader issues – war, climate, housing, the cost of a cup of coffee – land differently from one suburb to the next.\n\nIn the end, that moment in North Fitzroy – a Labor MP promising money for a bike path – was more than a local funding pledge. It was a case study in how politics still works here: tangible, transactional, and attentive to who turns up.\n\nThe Greens harnessed fury over Gaza. They tapped disillusionment on climate. They tried to create a wave to surf home – only to find Labor knew Dutton was a tsunami. And Labor, when threatened, can still marshall money, endorsements and machine-like discipline.\n\nWills didn’t fall. But it shifted. Gaza cracked something open in the north where Labor’s hold can no longer be assumed. The Greens are now within 2 per cent of taking this seat. If their candidate in the next election is weaker, maybe the margin returns to Labor. But in a seat named after a failed explorer, I suspect this electorate is ready to chart a new course – even if, this time, it decided to wait a little longer.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/victoria/the-age-photos-of-the-week-may-10-2025-20250510-p5ly3h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Age photos of the week, May 10, 2025",
    "publish_date": "Sat, 10 May 2025 11:30:16 +1000",
    "category": "finance",
    "authors": [],
    "text": "12/20\n\nRosie Cuppaidge, with her 14-month-old daughter Ione, says we should be discouraging screens among kids in general and believes there should be enough going on in childcare that screens shouldn’t be needed. Credit:Paul Jeffers",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/afl/why-warner-brothers-are-revelling-in-afl-anonymity-in-sydney-20250507-p5lxdl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Warner brothers are revelling in AFL ‘anonymity’ in Sydney",
    "publish_date": "Sat, 10 May 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Jonathan Drennan"
    ],
    "text": "“Even if you are just going out for dinner with your family or something in the off-season [in Perth], I guess there is a lot more attention on you,” Corey said.\n\nIn Sydney, the Warner brothers can walk near their home in Coogee and remain largely anonymous. Back home in Perth, it is impossible to escape from their day job.\n\nBoth brothers loved their upbringing in Perth and return whenever there is a viable gap in their schedule. Sydney can never replace the family and friends they miss, but it has given them a different perspective on their daily lives.\n\nEarlier this year, before signing their respective two-year contract extensions at the Sydney Swans, Chad and Corey Warner thought long and hard about what the club and the city meant to them.\n\n“I think it’s definitely a benefit for us in Sydney here; you can go out with your mates, or go out for dinner, go to the beach, and you can just be a different person and not like an AFL player, and not have all the attention on you for a bit when you’re away from the club. But it’s definitely a reminder when you go back to Perth.”\n\nCorey and Chad Warner at Swans headquarters before Saturday’s game against Essendon. Credit: Dominic Lorrimer\n\nSince his breakthrough season in 2022 when he made the All-Australian squad, Chad has gradually become used to the level of interest in his career at home. The star midfielder seriously considered offers to move home to the Dockers and Eagles, but understood that his life would change dramatically.\n\n“On the weekend, we went out because Dad was over for the [Giants] game, and went out to the [Coogee] Pav to have a few beers, and you never do anything wrong, but I feel like [in] Perth they’d be trying to find something that you’re doing wrong, so that is really annoying,” Chad said.\n\n“Even coaches over there – I think at the moment the Freo coach [Justin Longmuir] is copping it a lot – and I think it’s really, really tough in that regard, too, because fans are pretty ruthless over there. And I think a lot of the time they want to blame, and just want to keep blaming and blaming, and I think the coach at the moment is kind of falling victim to that a bit.”",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/who-stole-my-recipe-maehashi-and-bellamy-must-realise-they-re-already-cooked-20250508-p5lxoj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Who stole my recipe? Maehashi and Bellamy must realise they’re already cooked",
    "publish_date": "Sat, 10 May 2025 09:30:00 +1000",
    "category": "finance",
    "authors": [
      "Malcolm Knox"
    ],
    "text": "If a famous chef wanted to publish a cookbook that was actually useful, it might be called How to Cook When You Haven’t Left Enough Time And Don’t Know Where Anything Is.\n\nIt would have chapters titled: “Where’s The F---ing Cornflour?” and “Why Is the Person Who Hid the Cornflour Not Answering Their Phone?” or “What is Cornflour anyway and Can I Just Use Flour Instead? Where’s the F---ing Flour? Oh S---, Is It Wrong To Use Self-Raising Flour!”\n\nIllustration by Dionne Gain Credit:\n\nThis is such a brilliant idea for a million-selling cookbook, you’d copyright it. Only, I Hate To Cook has been done. There are websites called “57 Recipes”, “100 Super-Easy Healthy Dinners for People Who Hate to Cook”. A service called “I Hate Cooking” comes to your home and cooks ingredients they’ve told you to buy (unless you hate grocery shopping even more than cooking). Jamie Oliver’s 15-Minute Meals are for people who hate cooking. Gordon Ramsay’s TV career is for people who hate being in kitchens.\n\nThe challenge for cookbooks is that everything’s already been done, done and done again. Less the bad ideas than the good ones, like how to make a caramel slice. The current stink setting off smoke alarms in Australia’s best-selling kitchens is whether Brooke (Bake with Brooki) Bellamy has re-hashed Nagi (RecipeTin Eats) Maehashi’s caramel slice and baklava recipes. Bellamy also has been accused of cutting and pasting Bill Granger’s Portuguese tart and Sally McKenney’s vanilla cake.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/wallabies-stars-issue-plea-for-maligned-prop-to-take-on-lions-20250509-p5lxvn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wallabies stars issue plea for maligned prop to take on Lions",
    "publish_date": "Sat, 10 May 2025 09:26:30 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Wallabies star Lukhan Salakaia-Loto has launched an emphatic defence of embattled Test teammate and close friend Taniela Tupou – issuing a stern message to selectors ahead of the British and Irish Lions series.\n\n“Look, if there’s any chance we have of winning a Lions series and home World Cup, he has to be involved,” the Queensland Reds lock declared.\n\nTupou’s form has been heavily scrutinised in the 2025 Super Rugby Pacific campaign, unable to recapture the brand that made him one of the globe’s most ferocious props.\n\nTaniela Tupou’s place in the Wallabies squad is under threat. Credit: Getty Images\n\nConfidence is now seemingly at an all-time low for the 28-year-old, who landed on the public radar in childhood when footage of “Tongan Thor” went viral.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/world/new-details-about-pope-leo-emerge-20250510-p5ly31.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "New details about Pope Leo emerge",
    "publish_date": "Sat, 10 May 2025 08:04:46 +1000",
    "category": "finance",
    "authors": [],
    "text": "New details about Pope Leo emerge\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/afl/mcgovern-rocked-in-brutal-collision-20250510-p5ly2u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "McGovern rocked in brutal collision",
    "publish_date": "Sat, 10 May 2025 06:18:12 +1000",
    "category": "sports",
    "authors": [],
    "text": "McGovern rocked in brutal collision\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/obrien-puts-knights-on-notice-20250510-p5ly2t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "O'Brien puts Knights on notice",
    "publish_date": "Sat, 10 May 2025 06:12:58 +1000",
    "category": "finance",
    "authors": [],
    "text": "O'Brien puts Knights on notice\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/queensland/a-test-proved-mia-had-been-drugged-but-many-other-victims-never-know-for-sure-20250507-p5lx8a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A test proved Mia had been drugged. But many other victims never know for sure",
    "publish_date": "Sat, 10 May 2025 06:00:00 +1000",
    "category": "finance",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Mia* was out for drinks with her colleagues in Brisbane’s Fortitude Valley three years ago when her drink was spiked. She had switched to water about 10pm, not wanting to drink too much at the work event at a Brunswick Street Mall bar. But half an hour later, the then 24-year-old started feeling “super nauseous”. “Everyone was asking me if I was OK, if I had drunk too much. I was confused because I had stopped drinking,” Mia recalls. She left the bar and returned to her office, where she collapsed at her desk. “My body felt really heavy. I could move, but my movements weren’t very controlled. I don’t think I could have stood up properly and walked unassisted without falling over.” She called her partner to come pick her up, and made it home safe.\n\nAdvertisement\n\nA few days later, Mia decided to see a GP and ask for a drug test. It returned positive for benzodiazepines, a depressant drug with a sedative effect used to treat anxiety and insomnia. “I suspected I was spiked because I’ve been given benzodiazepines and reacted poorly to them in the past,” she says. “They make me mentally foggy for a few days afterwards, which is how I was feeling.” Loading It’s uncommon for drink-spiking victims to have their experience validated by a toxicology test. “A lot of people usually start piecing it together but then by the time they go [to get tested], it’s too late for anything to realistically show up,” she says. Health professionals say there is a narrow window to test for drugs. For most substances associated with drink spiking, the ideal timeframe is between 12 and 72 hours, though some drugs leave the body in as little as three hours. Some who believe they have been spiked will head to an emergency department, but Queensland Health say hospitals “will not routinely facilitate testing for drink spiking due to impact on treatment times”. “Our emergency departments treat patients based on their symptoms to ensure they receive the best care possible, and toxicology tests are generally not required to guide treatment,” a spokesperson said. They can, however, refer patients to police for forensic testing.\n\nAdvertisement\n\nQueensland Police say that once a complaint is received, “an investigation will commence” and testing will be organised if needed. In Queensland, emergency departments do not routinely test for drink spiking. Credit: Dion Georgopoulos The Alcohol and Drug Foundation chief executive Dr Erin Lalor AM says drink spiking has always been under-reported in Australia, with victims often fearful they’ll be blamed for what happened, “especially if they were already drinking or taking other drugs”. But what if there was a faster way to determine if a drink has been spiked, even before the victim or the perpetrator leaves a venue? Troy Stewart is the managing director of SureScreen Diagnostics Australia, the company behind a new rapid drink-spiking test. He believes these devices are the missing component to address the issue. The device is designed to detect drugs commonly associated with drink spiking, including GHB, ketamine and 22 types of benzodiazepines, within minutes, not hours. While no single test can guarantee a drink is safe, Stewart says SureScreen Diagnostics’ technology has performed significantly better than other products, particularly with variables such as milk products and fruit juices.\n\nAdvertisement\n\nStewart has spent the last 12 months lobbying governments and other stakeholders to help stock the tests in venues across the country. In high-risk precincts, such as Fortitude Valley, he wants the government to fund a pilot trial that could see them distributed to every bar. Loading “If venues have these devices on hand, it means that anyone who suspects their drink has been tampered with can approach a staff member to have their beverage tested immediately,” he says. In the New South Wales city of Albury, a trial of the devices in the area’s clubs and pubs has seen early signs of success. Nine days after the trial began in February, patrons saw something being added to a woman’s drink. “They reported that to security and security then very swiftly checked video footage and validated what they had seen,” Albury Liquor Accord chair Craig Kidd says. “They approached the victim and took their drink to get tested. It returned a positive result – twice.”\n\nAdvertisement\n\nKidd says the victim was taken to a hospital in Albury with the tests, where police were also called. NSW police used the security footage to identify the perpetrator, who was found and charged with possessing illicit substances. The Multi-Lined Rapid Beverage Test (MRBT) can detect over 20 substances commonly associated with drink spiking. Credit: Markus Ravik “We’re hoping by having the drink spiking devices available during this trial, we can normalise that you should report it,” Kidd says. Stewart has presented to Hervey Bay, Maryborough, Gympie, Bundaberg, Gladstone and Chinchilla liquor accords, and contacted Queensland’s chief police, health, justice and youth ministers. He says they’ve been receptive, but as yet, no Queensland cities have signed up for a trial like the one in NSW. Kidd says Albury’s trial began in response to reports, largely spread across social media, about incidents of suspected drink spiking. “The local press picked up on that ... but it was really hard to quantify.”\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/labor-has-the-mandate-to-think-big-and-seize-opportunity-20250508-p5lxn1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Labor has the mandate to think big and seize opportunity",
    "publish_date": "Sat, 10 May 2025 05:51:00 +1000",
    "category": "finance",
    "authors": [
      "The Age'S View"
    ],
    "text": "“Move us away from fossil fuels and into a future of clean energy and exports”; “far-reaching policies on housing”; “a tax system that is fair and equitable” ; “public schools and health funded so no one is left behind”; “at least begin getting rid of negative gearing”; “address the treatment of refugees and asylum seekers”.\n\nThe Labor Party’s unprecedented achievement of winning a second term with an increased majority has The Age’s letter writers thinking big. Prime Minister Anthony Albanese and Treasurer Jim Chalmers are sitting on a freshly won heap of political capital, they argue; surely now is the time to start adding items to their shopping list for the next three years and even beyond?\n\nTreasurer Jim Chalmers on election night. Credit: ABC\n\nOn election night, Chalmers acknowledged “impatience” in the community when it comes to “our big national challenges”, but when asked about major tax reform, he demurred, insisting that “our agenda is the one that we took to the people” and pointing to the numbers in the Senate – which are not so clearly in Labor’s favour – to qualify any talk of greater ambition.\n\nThe priorities Chalmers reiterated on election night – housing supply, transforming how we generate energy, increasing productivity – are certainly first-order tasks and ones where Labor could be accused of so far tinkering at the edges rather than making the kind of profound policy shifts the situation demands.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/culture/music/we-have-our-sights-set-on-world-domination-how-spacey-jane-became-australia-s-biggest-band-20250505-p5lwor.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘We have our sights set on world domination’: How Spacey Jane became Australia’s biggest band",
    "publish_date": "Sat, 10 May 2025 05:30:00 +1000",
    "category": "entertainment",
    "authors": [
      "Jules Lefevre"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In August 2022, Caleb Harper was sitting in his underwear in a sweltering room in Los Angeles, willing the air-conditioner to work. The Spacey Jane frontman had just begun scribbling down the first lines of a song that would become August, the first track to emerge from their third album. But it wasn’t coming easily in the 40-degree heat and the song ended up sitting on the shelf for about 18 months, Harper occasionally pulling it down to tweak a line here or there. Other songs came and were put to tape, the album was nearly tied up, but August remained out-of-reach. “I had a counter melody that wasn’t working,” Harper says over Zoom from Los Angeles, air-conditioning working this time. “I ended up writing it on the last morning, and Peppa [Lane, bassist] and I went in and sang it that day.” That final counter melody carries out the track with the floating refrain “if that makes sense?“, which the band then lifted for the album’s title. “It really bookends that period,” Harper says, noting its meaning shifted considerably over the writing period, from a meditation on leaving Australia to predicting the beginning of a breakup. “It’s a hard listen, honestly.” Spacey Jane on stage in Melbourne in December 2021, after the breakout success of Booster Seat. Credit: Getty August, like the rest of If That Makes Sense, was written and recorded over two years in LA – the first time the Perth band had recorded outside Australia. It was a big deal for the quartet (Harper and Lane are joined by drummer Kieran Lama and guitarist Ashton Hardman-Le Cornu), who have been synonymous with the Australian indie rock scene since their jangly, vulnerable 2020 debut album Sunlight. Sunlight was borne from the runaway single Booster Seat, which reached #2 in that year’s Hottest 100, behind Glass Animals’ Heat Waves. The band would become frequent Hottest 100 lurkers: in the 2022 countdown, following their second album Here Comes Everybody, they featured six times, three of those coming in the top 10. In 2022, the band was the third-biggest seller of vinyl for the year, behind Taylor Swift and Harry Styles. They’ve ridden this wave of popularity on numerous sold-out tours of the country, and are comfortable standalone headliners for the biggest local festivals. There aren’t many bigger bands in Australian music right now, if any.\n\nAdvertisement\n\nFollowing the gruelling touring schedule for Here Comes Everybody (which had really stretched back years to the start of Sunlight), the band’s management stepped in and told them to take a break. “It started as quite a difficult thing,” Harper says. “It was almost counterintuitive … We are a band that considers our job to play shows. It was almost like the music served that. Now we’ve gone through a process of unlearning that and figuring out how to focus on making this record and pulling this world together first. And also giving the market a bit of space, from a business perspective. “But once we hopped off that train, we were all freaked out. Especially, because we were living all around the world, we didn’t see each other as much.” Like many Australian artists before him, Harper landed in LA and endured the merry-go-round of songwriting sessions – a process he called “f---ing terrifying”. “I’d always been protective of the songwriting process, and it always has been in my bedroom,” he says. “I didn’t know how to advocate for ideas that I liked, and I didn’t know how to say no to things I didn’t like. I would often not put forward ideas at all because I was just like, ‘If they don’t like it, that’s embarrassing’. But now I find it’s liberating to have that conflict of ideas. I’m grateful that I went through that transition.” It’s easy to understand Harper’s apprehension. His lyrics have always been intensely personal, and the songs on If That Makes Sense feature some wrenching moments. On the churning single All the Noise, Harper reflects on his upbringing: “And that was the way that they gave to me … A promise that I would hurt everybody that I ever meet”. Then there’s the shouted, tortured mantra in So Much Taller: “You’ll never be enough and you’ll never be loved, and the fact you tried is embarrassing enough”. Recent single Through My Teeth obliquely references Harper shedding his religious upbringing and throwing himself headlong into partying at university. A lot of the album pulls in this direction and sifts through the various answers to the question: what happens when you have to drag your trauma into adulthood? “Being out here,” Harper says after a pause, after we bring up Through My Teeth, “it’s almost like pulling myself out of my present life in Australia made the past compress, like the last 26 years of my life were all just in one accessible bank in a way that they hadn’t been before”.\n\nAdvertisement\n\n“All of a sudden things didn’t seem as far away – not that they were any clearer,” he says. “I still have trouble recalling much of my childhood, as I think a lot of people do, especially if they have negative things associated with that … Your brain tends to bury things or contort them. But I think a lot of it became far clearer or more in my face than it had been before.” Being away from Australia pulled some things into focus, but it also brought with it a lot of homesickness and guilt. “I think family is the main one,” Harper answers, when I ask where the guilt comes from. “There’s already a host of issues and contentious things there. Being away is an interesting escape from that. “But sometimes I take too much liberty when it comes to escaping things back home. Like I’m really bad at messaging my friends back, I’m really bad at calling my dad … and that’s just something that weighs on me a lot. Relationships suffer, and you feel like it’s your fault.” ‘We’d be kicking ourselves if we didn’t try [to break overseas].’ Caleb Harper, frontman of Spacey Jane Sonically, If That Makes Sense doesn’t deviate wildly from the Spacey Jane playbook, but the band have beefed things up considerably with undercurrents of synths and layers upon layers of guitars and vocals. It’s the result of taking a longer time in the studio, and the presence of big-time producer Mike Crossey (Arctic Monkeys, the 1975, Wolf Alice). “We didn’t shy away from producing it, like really producing it,” Harper says. “It was like, ‘Let’s put everything in here that we like and make it feel as big and wide as possible’.” The band also ran the entire record through tape at the end, a process that rounds out the sound and makes it feel richer, warmer (like the difference between an MP3 file and a vinyl record).\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 30
  }
]