[
    {
        "url": "https://www.9news.com.au/world/kennedy-centre-renamed-trump-more-artists-cancelling-appearances-there/ab14241d-72d6-4a08-a16d-0f509f83eae8",
        "title": "More artists cancel after Trump's name added to iconic arts building",
        "publish_date": "Wed, 31 Dec 2025 00:59:21 +0000",
        "category": "entertainment",
        "authors": [
            "Dec"
        ],
        "text": "The Kennedy Centre is ending the year with a new round of artists saying they are cancelling scheduled performances after US President Donald Trump's name was added to the facility, prompting the institution's president to accuse the performers of making their decisions because of politics.\n\nThe Cookers, a jazz supergroup that has performed together for nearly two decades, announced their withdrawal from \"A Jazz New Year's Eve\" on their website, saying the \"decision has come together very quickly\" and acknowledging frustration from those who may have planned to attend.\n\nDoug Varone and Dancers, a dance group based in New York, said in an Instagram post this week they would pull out of a performance slated for April, saying they \"can no longer permit ourselves nor ask our audiences to step inside this once great institution.\"\n\nREAD MORE: Granddaughter of John F Kennedy dies weeks after terminal cancer reveal ﻿\n\nUS President Donald Trump's name has been added to the Kennedy Centre for Performing Arts. (AP)\n\nThose moves come after musician Chuck Redd canceled a Christmas Eve performance last week. They also come amid declining sales for tickets to the venue, as well as news that viewership for the December 23 broadcast of the Kennedy Centre Honours – which Trump had predicted would soar – was down by about 35 per cent compared to the 2024 show.\n\nThe announcements amount to a volatile calendar for one of the most prominent performing arts venues in the US and cap a year of tension in which Trump ousted the Kennedy Centre board and named himself the institution's chairman.\n\nThat led to an earlier round of artist pushback, with performer Issa Rae and the producers of Hamilton cancelling scheduled engagements while musicians Ben Folds and Renee Fleming stepped down from advisory roles.\n\nIssa Rae cancelled an engagement at the venue. (Getty)\n\nThe Cookers didn't mention the building's renaming or the Trump administration but did say that, when they return to performing, they wanted to ensure that \"the room is able to celebrate the full presence of the music and everyone in it,\" reiterating a commitment \"to playing music that reaches across divisions rather than deepening them.\"\n\nThe group may not have addressed the Kennedy Centre situation directly, but one of its members has.\n\nOn Saturday, saxophone player Billy Harper said in comments posted on the Jazz Stage Facebook page that he \"would never even consider performing in a venue bearing a name (and being controlled by the kind of board) that represents overt racism and deliberate destruction of African American music and culture. The same music I devoted my life to creating and advancing.\"\n\nThe centre was originally named for President John F Kennedy after his assassination. (Wikipedia)\n\nAccording to the White House, Trump's handpicked board approved the renaming. Harper said both the board \"as well as the name displayed on the building itself represents a mentality and practices I always stood against. And still do, today more than ever.\"\n\nRichard Grenell, a Trump ally whom the president chose to head the Kennedy Centre after he forced out the previous leadership, posted Monday night on X, \"The artists who are now canceling shows were booked by the previous far left leadership,\" intimating the bookings were made under the Biden administration.\n\nIn a statement to The Associated Press, Grenell said the \"last minute cancellations prove that they were always unwilling to perform for everyone – even those they disagree with politically,\" adding that the Kennedy Centre had been \"flooded with inquiries from real artists willing to perform for everyone and who reject political statements in their artistry.\"\n\nThere was no immediate word from Kennedy Centre officials about whether the entity would pursue legal action against the latest round of artists to cancel performances. Following Redd's cancellation last week, Grenell said he would seek $US1 million ($1.49 million) in damages for what he called a \"political stunt.\"\n\nNot all artists are calling off their shows. Bluegrass banjoist Randy Barrett, scheduled to perform at the Kennedy Centre next month, told the AP he was \"deeply troubled by the politicisation\" of the venue and respected those who had canceled but feels that \"our tribalised country needs more music and art, not less. It's one of the few things that can bring us together.\"\n\nPresident John F Kennedy was assassinated in 1963, and Congress passed a law the following year naming the centre as a living memorial to him. Scholars have said any changes to the building's name would need congressional approval; the law explicitly prohibits the board of trustees from making the center into a memorial to anyone else, and from putting another person's name on the building's exterior.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/snake-queensland-nsw-border-python-hitches-ride-in-car/38d50155-61c3-41f9-b7fc-e641d74c3dd4",
        "title": "Python hitches ride in unsuspecting driver's car across Queensland-NSW border",
        "publish_date": "Tue, 30 Dec 2025 14:14:31 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "A coastal carpet python has hitched a ride across the Queensland and NSW border after coiling itself into the crevice of a car.\n\nIt joined the nine-hour ﻿ride from Toowoomba to the Central Coast for the Christmas holidays.\n\nThe discovery was revealed when Anthony stopped at the Australian Reptile Park ﻿and asked for help to remove the snake.\n\nPython hitches ride in unsuspecting driver's car across Queensland-NSW border (9News)\n\nIt was identified as a ﻿1.2-metre coastal carpet python.\n\nAustralian Reptile Park head of reptiles Dylan Wallis said he has never seen a snake travel that distance before.\n\n\"﻿We've seen many snakes in cars, but never one that has travelled that far from another state,\" he said.\n\nThe snake had been hiding on top of the car's fuel tank, which kept it safe from the elements.\n\nREAD MORE: ﻿ Scientists say 2025 was one of the three hottest years on record\n\n\"Right next to him are the turning wheels and, of course, that creates a lot of ventilation to keep him nice and cool,\" Wallis said.\n\nPython hitches ride in unsuspecting driver's car across Queensland-NSW border (9News)\n\nIt was safely extracted as experts went underneath the car to push the python out. ﻿\n\nIt will be shipped back to Queensland.﻿\n\n\"He's gonna do the entire journey﻿, but this time he's not gonna be sitting on top of the fuel tank,\" Wallis said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/january-1-2026-changes-australia-cash-mandate-welfare-payment-increase-and-end-of-energy-rebates/3ee6f54c-b827-499b-889d-86acec262250",
        "title": "Your guide to all the changes in effect from January 1, 2026",
        "publish_date": "Wed, 31 Dec 2025 00:00:00 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "As Australia rings in the new year, a host of changes will come into effect.\n\nThe changes aim to save Australians money, prevent price increases and improve public health responses.\n\nFrom a new cash mandate to cheaper medicines and welfare payment rises, here are the main changes coming into effect in 2026.\n\nAs Australia welcomes a new year, the nation will also welcome some changes. (Getty)\n\nWelfare payments rise\n\nMore than a million Australians are set to receive an increase to their payments from January 1, 2026 .\n\nThe changes will apply to those receiving ﻿youth allowance, Austudy, ABSTUDY, youth disability pension and carer allowance payments.\n\nThe amount will differ depending on your circumstances.\n\nA full list of the changes is available on the Department of Social Services website.﻿\n\nBusinesses must take cash﻿\n\nThis year Treasurer Jim Chalmers﻿ announced that Australia would introduce a cash mandate for grocery and fuel retailers from January 1.\n\nUnder the new rules, ﻿businesses that sell fuel and groceries must accept cash payments for these essential purchases.\n\nThe mandate will mostly apply to retailers such as supermarkets and service stations.\n\nAustralia will introduce a cash mandate for grocery and fuel retailers from January 1. (iStock)\n\nCheaper medicines through the PBS ﻿\n\nAustralians can expect their medicine bills to be slashed in the new year.\n\nThe general patient co-payment for medicines on the Pharmaceutical Benefits Scheme (PBS) will be capped at $25 per script from January 1 , a decrease from $31.60.\n\nThe change is a key election promise from Prime Minister Anthony Albanese and is coming through with bipartisan support from the Coalition.\n\nMedicare safety net increases\n\nThe Medicare safety net will rise on January 1, pushing up the amount Australians and their families will need to pay before they are provided with increased public health subsidies.\n\nThe original safety net is increasing from $576 to $594, while the extended safety net has gone from $834 to $861 for concession card holders and from $2615 to $2699 for those without concession cards.\n\nThe Medicare safety net will rise on January 1. (Justin McManus/The Age)\n\nDental costs\n\nA trip to the dentist can be costly but there will be some additional support for some Australians. ﻿\n\nThe child dental benefits schedule will cover $1158 every two years for eligible families from January 1, an increase of $26.\n\nThe government program was set up to cover part or all of the cost of basic dental services for eligible children aged 17 or under .\n\nChildcare subsidy change ﻿\n\nFamilies who are eligible for the childcare subsidy will get at least 72 hours of subsidised childcare per fortnight regardless of how much they work.\n\nMeanwhile families can get 100 hours if they work more than 48 hours a week.﻿\n\nThe changes will come into effect on January 5, 2026.﻿\n\nACCC merger laws\n\nAustralia's merger laws will undergo a significant overhaul on January 1 aimed at preventing anti-competitive price rises for consumers and industry concentration.\n\nThe Australian Competition and Consumer Commission (ACCC) and the federal government will make it mandatory for businesses to notify the ACCC about certain acquisitions and receive subsequent approval from the regulator.\n\nA merger deal between businesses must be reported to the ACCC if it meets certain requirements, including where the companies involved have a combined Australian turnover of $200 million or more.\n\nThe previous system ﻿was voluntary and informal.\n\nEnergy bill discount ends\n\nTreasurer J﻿im Chalmers has confirmed the federal government's energy bill discount will end in the new year.\n\nThe much-needed $300 power bill relief was ﻿offered to households during the 2024/25 financial year, aimed at curbing cost of living pain for Australian families.\n\nAn extra $150 subsidy was then offered to Australians from July, however Chalmers revealed it would not be extended beyond December 31, 2025.\n\nTreasurer J﻿im Chalmers has confirmed the federal government's energy bill discount will end in the new year. (Alex Ellinghausen)\n\nCentre for Disease Control launch\n\nAustralia will establish a ﻿permanent Centre for Disease Control (CDC) from January 1 to help the nation prepare for and prevent public health emergencies.\n\nThe opening comes almost 40 years after the first calls for the country to establish the service .\n\nThe Public Health Association of Australia (PHAA) called it the \"most important piece of public health infrastructure in generations\", and Health Minister Mark Butler said the CDC would \"help protect Australia from diseases and public health threats\".\n\nPassport price change﻿\n\nIf you need to renew your passport, you will be paying more in the new year.\n\nPassport prices are set to increase increase in line with inflation.\n\nThe cost of a 10-year adult passport is currently $412, which means the price could rise to $422 in 2026.\n\nNSW toll cap to be made permanent\n\nIf you live in NSW and regularly drive on toll roads, you could save some money on your commute in the new year.\n\n﻿NSW Premier Chris Minns confirmed in November the state's $60-a-week toll cap would continue beyond January 1, 2026 to help motorists with the cost-of-living.\n\nThe rebate allows ﻿motorists to claim up to $340 back a week after spending $60 per vehicle.\n\nHowever he ﻿warned there could be a major change to how the Sydney Harbour Bridge is tolled to pay for the relief.\n\nMinns also announced the trial demerit point reward program would be made permanent in the new year.\n\nThis means unrestricted licence holders who incur no traffic infringements for a full calendar year will have one demerit point removed from their licence.\n\nVictorian public transport changes\n\nFrom January 1, metro public transport fares in Victoria will rise.\n\nThis includes the daily fare cap which will increase from $11 to $11.40 on weekdays and from $7.60 to $8 on weekends.\n\nPeople under 18 with a youth Myki card can travel free of charge in the new year, while concession card holders can travel for free on weekends.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/how-to-save-money-on-groceries-cheapskates-club-cath-pantry-tips-meal-planning/c47f6860-7e1d-43d3-b4e0-0b5311240dfd",
        "title": "Cath restocks her pantry once a year. She's already planned her meals for 2026",
        "publish_date": "Tue, 30 Dec 2025 19:28:31 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Cath Armstrong is not a fan of grocery shopping, so the Victorian mum uses a method that allows her to do it as little as possible.\n\nEach year between December 27 and 30, the founder of the popular Cheapskates Club dedicates a few days to a yearly shop to save her \"time, grey hairs, frustration and stress\".\n\n\"I loathe grocery shopping,\" Armstrong said.\n\nThe bulk of Cath Armstrong's grocery shopping for the entire year is done in just three days. (Polly Hanning/Nine/Cheapskates Club)\n\n﻿\"People wander up and down, they park their trolleys, they stop in the middle of the aisles, it nearly sends me spare.\"\n\nArmstrong switched from a weekly shop to a monthly shop years ago to avoid the chore but had to rethink her approach when life became busier with work and family.\n\n\"I stretched it out to three months, then I thought, 'Well, I can do this for six months',\" she said.\n\n\"When I hit shopping once every six months, it was just bliss.\n\n\"It took a full day but then it was just one day and for six months I didn't have to go back.\n\n\"Then I thought 'I'm going to try this for a whole year'.\"\n\nArmstrong, pictured on A Current Affair in 2015, has shared her money-saving tips with Australians for decades. (A Current Affair)\n\nArmstrong now does a yearly pantry re-stock and smaller fresh food shops every few weeks.\n\nThe annual shop costs about $1200 and consists of enough staples for her family for the year.\n\n\"All I simply did was look back over what I'd been buying and multiplied everything so it equaled a year's worth,\" she said.\n\nArmstrong finds her calculations are \"pretty accurate\", which helps her avoid food waste.\n\nDuring the yearly shop, she buys mostly generic brands from Aldi, Coles and Woolworths.\n\n\"It doesn't take up a lot of space, I've got one shelf unit in my laundry and that's about it,\" she said.\n\nREAD MORE: Cash boost for more than a million Australians\n\nArmstrong's grocery shopping method allows her to cut down on trips to the supermarket. (A Current Affair)\n\nArmstrong also comes up with an annual meal plan, which follows a similar pattern every week.\n\nDuring a typical week, the family will have a roast dinner on Sunday, meat and vegetables on Monday, pasta on Tuesday, meat and vegetables on Wednesday, homemade pizza on Thursday, fish on Friday and Mexican food on Saturday.\n\nShe then shares dinner ideas with thousands of Cheapskates Club followers to help them slash their grocery bills and navigate meal times with ease.\n\nFood is one of the biggest household expenses for Australian families but making small changes to the way you shop can have a big impact on your budget in the new year.\n\nBut Armstrong emphasises people don't necessarily need to go shopping once a year to reap the benefits.\n\n\"I try to tell people just because I do something doesn't mean it's right for you,\" she said.\n\n\"Pick the things that work for you and keep doing them.\"\n\nAustralian grocery shopping habits have changed\n\nWhen you enter a supermarket, every product is competing for your hard-earned cash.\n\n﻿From the essentials to the treats on the end-of-aisle displays, shop layouts are designed to get you to spend more, according to University of Sydney retail expert Lisa Asher.\n\n\"All of these key ingredients that we would normally buy, they're all so far apart that you have to cross the store often,\" Asher said.\n\n\"That causes you to go down the back aisle or go down the front aisle.\n\n\"You're seeing these end displays, which prompt impulse purchases.\n\n\"They're designed to make you buy and they're very effective.﻿\"\n\nSupermarket layouts are designed to maximise customer spend. (Getty)\n\nAnother factor that contributes to impulse spending is the current economic climate.﻿\n\n\"The use of promotions has become more prevalent and people, through the cost-of-living crisis, have become more deal-prone,\" Asher said.\n\n\"We've shifted from everyday low pricing, although there are everyday low products, but you've really got to look for them.\n\n\"This shift to half price, it hasn't always been like this.\"\n\nGrocery shopping habits have also changed in Australia, which has increased the likelihood of impulse buying.\n\n\"It used to be that people might do one big shop a week or once a fortnight,\" Asher said.\n\n\"The more frequently people are going now, the more there's temptation.\"\n\nSimple ways to save\n\nArmstrong has shared her money-saving tips with thousands of Australians for decades to help them live \"debt-free, cashed up and laughing\".\n\nFor Australians who want to reset their budgets in the new year, she offers a few simple suggestions to kick-start the journey.\n\nHer first tip is to take a look at your utility bills and see if there is a better deal.\n\n\"Don't be afraid to swap, it's really easy, it's painless,\" she said.\n\nHer second tip is to adjust your grocery shopping habits as necessary.﻿\n\n\"If you shop weekly, think about moving to fortnightly or monthly,\" Armstrong said.\n\n\"If you don't try it, you'll never know.\"\n\nHer third tip is to write a shopping list, take it to the supermarket and stick to it.\n\n\"If you've forgotten something, add it to the list for next time and make do,\" she said.\n\n\"The less money you spend in the shops, the more money you're going to keep in your purse.\"\n\nThe information provided on this website is general in nature only and does not constitute personal financial advice. The information has been prepared without taking into account your personal objectives, financial situation or needs. Before acting on any information on this website you should consider the appropriateness of the information having regard to your objectives, financial situation and needs.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/artificial-intelligence-chatbot-regulation-australia-impact-teenagers/fea17557-aaea-4651-b4a2-c592a420366b",
        "title": "Australia picks a new fight with tech monster",
        "publish_date": "Mon, 29 Dec 2025 19:23:45 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Weeks after blocking anyone aged under 16 from social media , Australia is also in the middle of ﻿another online safety crackdown in an attempt to protect young people from the potential harms of AI chatbots, but some experts say it should go even further.\n\nAs the artificial intelligence industry continues to develop rapidly, many teenagers have become more reliant on the technology in their day-to-day lives.﻿\n\nMelbourne high school teacher Matthew Micallef has noticed the shift, saying he has seen literacy rates dramatically worsen since the boom.\n\nThere are concerns teenagers are relying too much on artificial intelligence. (AP Photo/Rick Rycroft)\n\n\"Outside of academic authenticity, students are opting into an 'easy way out' mentality towards their learning,\" Micallef said. ﻿\n\n\"Also, schools are spending a considerable amount of money and funding on eSafety workshops for students that could be better spent on other endeavours.\"﻿\n\nThere is a growing concern that kids may begin to rely too much on artificial intelligence, particularly chatbots, following the absence of social media on their phones.﻿\n\n\"We know that kids are already using AI tools, whether that's talking to ChatGPT or companion apps that are actually sort of designed to make friends with people,\" director of the Centre for Human-AI Information Environments Professor Lisa Given said.﻿\n\n\"We know that there are people who get really taken in by the way that those systems engage with us.\n\nREAD MORE: Three words this CEO swears will help you land a better job ﻿\n\nThe absence of social media could have teens turning towards artificial intelligence. (AP Photo/Kiichiro Sato)\n\n\"These systems are trained to respond in that very human way, and that means people can get entranced into thinking that there's a human in the machine or that the machine is listening to and understanding what you're saying.\n\n\"That means that companion apps in particular, that are designed to make friends with you and build a relationship, have the potential for significant harm for vulnerable people, and that includes kids.\"\n\nAustralia recently rolled out new restrictions for AI bots, limiting the type of content they can provide teenagers.\n\n\"We're the only country in the world that will be tackling AI chatbots and AI companions,\" eSafety Commissioner ﻿Julie Inman Grant told 9News in early December. ﻿\n\n\"They will be prevented from ﻿serving any pornographic, sexually explicit, self-harm, suicidal ideation or disordered eating (content) to under-18s.\"\n\nGiven says the chatbots are hazardous for vulnerable people.\n\n\"What we've certainly seen around the world is that there are people who will listen to what these systems are telling them and take it to heart,\" she said.﻿\n\n\"So if a system says to you, 'that's a really great idea, you should totally pursue that', it gives a boost to our ego, and we think someone's listening.\n\neSafety Commissioner Julie Inman Grant has touted new AI regulations. (Alex Ellinghausen)\n\n\"But we've seen that sometimes that goes to a very dark place, particularly if people start saying to the system, I'm really depressed, or I'm having really horrible feelings, or I'm thinking about suicide.\n\n\"We see that some of those apps are actually responding in ways that encourage that thinking rather than trying to respond to a person and push them towards getting help.\n\n\"That means people who are very vulnerable, who are already at risk, can actually be really taken down to a dark hole by these computers.\"\n\nMicallef ﻿believes that teens should not have access to AI chatbots entirely, mostly because of the safety risk they pose.\n\n\"With some of the concerns outlined by the eSafety Commissioner, such as access to pornographic, graphic or self-harm content, it would not be wise to give impressionable teenagers the ability to utilise such applications,\" he said.\n\nGiven thinks the restrictions should go even further so to protect everyone, not just teenagers – although conceded any such regulation would be difficult to enact.\n\n\"These systems are not just harmful to children,\" she said.\n\n\"We know we've got evidence of adults that also get entranced by these systems, for anyone that is particularly vulnerable, or has existing mental health issues, that's a huge concern.\n\n\"If it's safe for adults, it should be safe for kids.\"﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/great-white-shark-snagged-off-barwon-heads/f052d320-060c-4e22-90bc-bc9bb32c575a",
        "title": "'Amazing experience' as great white shark snagged off Barwon Heads",
        "publish_date": "Mon, 29 Dec 2025 11:15:47 +0000",
        "category": "sports",
        "authors": [
            "Dec"
        ],
        "text": "Oscar Ford knew he had snagged something big.\n\nBut he never imagined it would be a great white shark.\n\nThe Victorian carpenter was with three inexperienced cousins, two of them children, when he snagged the giant fish off Barwon Heads on Sunday.\n\nOscar Ford knew he had snagged something big. (Nine)\n\nHe never imagined it would be a great white shark. (Nine)\n\n\"It's a f---ing white, holy shh, holy crap, I've caught a white off Barwon Heads,\" he screamed as cameras recorded the epic catch.\n\nThe carpenter battled for more than half an hour to reel the shark in close.\n\nEvery moment of the once-in-a-lifetime experience was captured on an array of GoPro cameras.\n\n\"He's biting the boat, get that on film, get that on film,\" he can be heard saying.\n\nThe fishers even dunked one of the cameras into the water for an incredible closer look at the beast.\n\n\"I was just in disbelief, I was like this is insane, I would never have thought this would happen,\" Ford told 9News.\n\nThe fishers even dunked one of the cameras into the water for an incredible closer look at the beast. (Nine)\n\nEvery moment of the once-in-a-lifetime experience was captured on an array of GoPro cameras (Nine)\n\n\"I had so much emotion, so much adrenaline running through me.\n\n\"I was feeling a million different emotions, I was feeling on top of the world.\"\n\nFord pushed off Ocean Grove early on Sunday to fish for tuna but switched to a snapper mark near Barwon Heads after a quiet few hours to set a bait balloon.\n\n\"We chucked it out and 45 minutes later we see a fin sort of just circling the balloon and then out of nowhere it just started splashing the water, going crazy,\" he said.\n\nGreat whites are a protected species so Ford never brought his catch on board, cutting it loose to go free.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/alex-hartley-period-chat-bbc-cricket-ashes-commentary/106189540",
        "title": "Calls for critics to 'grow up' after outcry over period mention on BBC",
        "publish_date": "Wed, 31 Dec 2025 01:09:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "Former England cricketer Alex Hartley says women \"shouldn't be scared to talk about their periods\" after she was taken aback by criticism for briefly mentioning it while commentating on the third Ashes Test for the BBC.\n\nTest Match Special (TMS) shared a 24-second clip of Hartley, who played 32 internationals for England from 2016 to 2019, talking to co-commentator Daniel Norcross on day three at the Adelaide Oval.\n\nHartley said on the live coverage that she was feeling a bit more optimistic after being \"very grumpy\" the previous day, which might have had something to do with the first day of her period.\n\n\"I think that might explain my mood yesterday,\" she said.\n\nNorcross continued his play-by-play call and added that it could not have been the reason for the \"equally grumpy\" mood of ex-England men's spinner Phil Tufnell.\n\nTo which Hartley jokingly replied: \"Well, we've all spent enough time together. Maybe we've all synced up.\"\n\n\"Could be that,\" Norcross said.\n\nThe brief interaction attracted attention from listeners and even some media outlets, which Hartley and current England bowler Kate Cross addressed on their No Balls podcast on the BBC TMS feed.\n\n\"I honestly couldn't believe it,\" Hartley said.\n\n\"I have talked about being on my period many, many, many times on TMS and the cricket must have been so boring that people decided to write about it. It's utterly nuts.\n\nLoading Instagram content\n\n\"I have no problems in talking about this sort of thing because I think it should be normalised. How is it not normalised?\n\n\"If a young girl is listening to the radio and hears that I'm on my period then she'll go, 'Oh, it's totally normal for people to talk about it.'\n\n\"It shouldn't be taboo. All I said was, 'I am on my period.'\"\n\nSome replies to the BBC TMS tweet featured sexist insults aimed at Hartley, which Cross read on the podcast, with both saying they were shocked her comments had attracted column inches.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\n\"'All too symptomatic of women constantly trying to invade men's safe spaces,'\" Cross read.\n\n\"So by that I can only imagine this person means that TMS is a man's safe place where women cannot be part of.\n\n\"Another one: 'The BBC have been completely taken over by the woke police allowing this behaviour.'\n\n\"Behaviour, Alex! Your period apparently is a behaviour.\"\n\nHartley and Cross both said they had stopped using X after trolls regularly pestered them on the social media platform.\n\nTackling period stigma and bra science in women's football They're already scoring goals on the field, but now these high-performance footballers are levelling up with a female-focused health training program.\n\nHartley is one of a handful of women commentating on major broadcasts of the men's Ashes.\n\nSocial media posts featuring Hartley are often littered with sexist comments. However, she said she also received thousands of direct messages thanking her for trying to normalise the topic.\n\n\"Females shouldn't be scared to talk about their periods,\" Hartley said.\n\n\"I had, I want to say, 4,000 DMs from people being like, 'This was amazing, thanks for talking about it.'\n\n\"Even though, in my mind, I didn't talk about it, I just mentioned it. Loads of girl dads, loads of mums, loads of teenagers, loads of men also defending me. So it wasn't all bad.\n\n\"The more it's spoken about, the more normalised it is.\"\n\nHartley (left) has retired from playing, while Cross is still active. (Getty Images: Alex Davidson/ECB)\n\nHartley said she remembered menstruating for the first time as a 16-year-old while wearing whites during a cricket game and having to be instructed on how to insert a tampon by Emma Calvert, now the director of women's cricket at Surrey.\n\nCross added that playing in whites while on your period was a major source of anxiety even for some of her Test teammates.\n\n\"I actually think I've had some of my best games when I've been on my period for whatever reason. Some girls feel stronger or feel more switched on, don't they?\" she said.\n\n\"I know that Test match week for the girls is obviously quite an anxiety-inducing week, especially when you've been on tour for a while and a lot of the girls have synced up.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nShe said the team's doctor offered players pills to stop them bleeding, which many players took to avoid anxiety around bleeding \"when you're on TV wearing your whites\".\n\nMany sports, including the AFLW and Wimbledon, have changed the uniforms for women and girls to avoid such incidents.\n\nCross, who has played eight Tests, 76 ODIs and 18 T20s for England, applauded Hartley for her openness, even if both agreed it was bizarre that it was still out of the ordinary in some way.\n\n\"It's 2026 next week, so grow the f*** up,\" she said to the critics.\n\n\"Women have periods. Get over it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/australian-coffee-growers-hope-for-bumper-2026-crop/106177198",
        "title": "Growers hope to keep coffee cups full in 2026",
        "publish_date": "Wed, 31 Dec 2025 00:36:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian coffee growers are hoping for a bumper 2026 season to meet rising demand for homegrown beans.\n\nFuelling that hope was the explosion of white, star-like flowers that covered coffee bushes across the country during November's flowering season.\n\nCoffee farms are transformed into a sea of white as the trees burst with star-like white flowers. (ABC Rural: Kim Honan)\n\nAustralian Grown Coffee Association president Rebecca Zentveld said it was the best flowering in six years at her farm in Newrybar, near Byron Bay.\n\nMs Zentveld said the positive signs for the crop in 2026 were welcome after a smaller-than-expected harvest this year.\n\nRebecca Zentveld checks the flowering on her coffee trees. (ABC Rural: Kim Honan)\n\nPoor weather in coffee-growing countries, including Brazil and Vietnam, in recent years, has meant Australian growers have been well-placed to fill the gap.\n\nBeautiful blossoming\n\nCoffee plants are known for their short flowering season, generally lasting just two days.\n\n\"That tiny little bud of the next fruit starts to grow for the next eleven months,\" Ms Zentveld said.\n\nCoffee cherries left from the 2025 harvest among the blossoms. (ABC Rural: Kim Honan)\n\n\"Not every flower will turn into a little fruit; we will allow some to drop and accept that, and it's a really good start.\"\n\nThe flowers present not only a visual sensation on farms. The short-lived blossoming offers a multi-sensory experience for growers and visitors.\n\nA European honey bee prepares to collect nectar from the white blossom of a coffee cherry. (ABC Rural: Kim Honan) A honey bee with pollen baskets hovers over coffee blossoms. (ABC Rural: Kim Honan) Bees are kept busy collecting nectar and pollinating the coffee cherries. (ABC Rural: Kim Honan)\n\nThe bees are busy buzzing about collecting nectar from the blossoms, which have a sweet jasmine-like smell that even wafts beyond the farm fence.\n\n\"They're going crazy, often what we do is hear the bees first, the hum, they will be out in force,\" Ms Zentveld said.\n\n\"We've had people drive past with their windows down and come in on the day that the blossoms are out because they could smell them in the air.\"\n\nRebecca Zentveld and a tour group stop to smell the coffee flowers. (ABC Rural: Kim Honan) Rebecca Zentveld and a tour group stop to smell the coffee flowers. (ABC Rural: Kim Honan) A welcome sign at Zentveld's Coffee Farm & Roastery at Newrybar. (ABC Rural: Kim Honan) Welcome sign at Zentveld's Coffee Farm & Roastery at Newrybar. (ABC Rural: Kim Honan) Rebecca Zentveld snaps a photo of some visitors to the farm with the coffee blossoms. (ABC Rural: Kim Honan) Rebecca Zentveld snaps a photo of some visitors to the farm with the coffee blossoms. (ABC Rural: Kim Honan)\n\n\"It is just marvellous, just extraordinary.\"\n\nSmall variety with big potential\n\nGrowers at the Zentveld farm are particularly excited by the amount of blossoms on a new coffee variety that is being trialled there.\n\nMs Zentveld said one of the dwarf varieties, Marsellesa, had put out more flowers than her Kenyan K7 trees.\n\nRebecca Zentveld with the Marsellesa coffee tree. (ABC Rural: Kim Honan)\n\n\"The blossoms are bigger than the two main varieties we grow in Australia,\" she said.\n\n\"So that's going to be interesting to see if that equates to overall big-sized fruit or coffee bean.\"\n\nMarsellesa, a hybrid of Sarchimor and Caturra developed in Nicaragua, is a high-yielding, rust-resistant variety that researchers believe could be better suited for Australian conditions than the Kenyan K7.\n\nWhite blossoms on the Marsellesa coffee variety. (ABC Rural: Kim Honan)\n\nCoffee converts\n\nMs Zentveld said speciality coffee roasters were crying out for locally grown beans.\n\n\"They're willing to pay the money for it, which is a wonderful thing to keep our growers going and profitable. That's what we want,\" she said.\n\nThat growing demand has seen the industry expand further within NSW and Queensland and into Western Australia.\n\nA wallaby among the coffee trees. (Supplied: Kim Honan)\n\nMs Zentveld said fruit and nut farmers in particular were turning to coffee due to issues within their industries, including local processor closures.\n\n\"We're now getting quite a few professional farmers who may have been growing macadamias, growing citrus and avocados in Western Australia, sugarcane and peanuts in North Queensland,\" she said.\n\nShe said the industry would benefit from these professionals putting coffee in on scale.\n\nCoffee cherries hang on from the 2025 season during flowering for the 2026 crop. (ABC Rural: Kim Honan)\n\nShe said the industry had solid long-term prospects as it moved beyond just import replacement and into export markets.\n\n\"They do the maths, and work out that this is a crop that's in demand and should be profitable.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/former-australian-cricketer-damien-martyn-in-induced-coma/106189352",
        "title": "Ex-Australian cricketer Damien Martyn seriously ill in induced coma",
        "publish_date": "Wed, 31 Dec 2025 00:36:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "Former Australian Test and limited overs batsman Damien Martyn is in hospital in Brisbane in an induced coma after falling ill with meningitis.\n\nThe 54-year-old is Darwin-born but grew up in Western Australia, where he made his first-class cricket debut in 1991 and went on to captain the state for a season, as well as skippering Australia A.\n\nHe played international cricket for Australia between 1992 and 2006, including several Ashes series and Australia's World Cup win in 2003.\n\nMartyn was known as a great shot-maker, particularly on the subcontinent. He was player of the series the last time Australia won an away series in India, topscoring in four of Australia's eight innings at the crease in the 2004 Border-Gavaskar Trophy battle.\n\nHis Test high score of 165 came against New Zealand in 2005.\n\nHe made 4,406 Test runs with 13 centuries and 5,346 ODI runs for Australia with five centuries.\n\nMartyn now lives in Queensland and the ABC has confirmed with cricket sources that he fell ill several days ago and was taken to hospital, where he remains in an induced coma with meningitis.\n\nAdam Gilchrist confirmed his former Test and Western Australia teammate's hospitalisation in a statement on behalf of the Martyn family.\n\n\"He is getting the best of treatment and [Martyn's partner] Amanda and his family know that a lot of people are sending their prayers and best wishes,\" Gilchrist said.\n\nChief executive Todd Greenberg wished Martyn a quick recovery on behalf of Cricket Australia.\n\n\"I'm saddened to hear of Damien's illness. The best wishes of everyone at CA and in the wider cricket community are with him at this time,\" Greenberg said.\n\nMeningitis is an infection and swelling, or inflammation, of the membranes around the brain and spinal cord.\n\nFormer Australian teammate and cricket coach Darren Lehmann tweeted his support for Martyn on Wednesday morning.\n\nABC/AAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/min-river-wins-overall-2025-sydney-to-hobart-successful-protest/106188552",
        "title": "Rule breach in final stretch of Sydney to Hobart sees rival crowned winner",
        "publish_date": "Wed, 31 Dec 2025 00:19:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "The overall result of the 80th Sydney to Hobart yacht race has been sensationally overturned on protest due to a sail breach.\n\nDouble-handed Min River has claimed the Tattersall Cup after a successful protest from the race committee against New Caledonian-flagged BNC.\n\nMin River has made history in the process, becoming the first double-handed yacht and the first female-skippered yacht to take out the overall handicap.\n\nMin River, co-skippered by Jiang Lin and Alexis Loison, needed to close a 54-minute gap on handicap behind BNC in order to be crowned winner.\n\nBNC was given a penalty of 1 hour and 5 minutes, meaning it falls behind Min River in the handicap standings.\n\nLoading...\n\nThe protest cited a breach to \"sheeting sails\" regulations in the Australian Racing Rules.\n\nIt is understood the breach related to the use of a pole to secure the spinnaker sail during the finish.\n\nBNC co-skippers Yann Rigal (left) and Michel Quintin (centre) enter the protest hearing. (ABC News)\n\nThe breach by BNC occurred in the final two nautical miles of the 628-nautical-mile race.\n\nThe rule states:\n\n\"No sail sheet be sheeted over or through any device that exerts outward pressure on a sheet or clew of a sail at a point from which, with the boat upright, a vertical line would fall outside the hull or deck [except in some conditions].\"\n\nIn sailing, a sheet refers to a rope or cable used to control the movable corners, or clews, of a sail.\n\nA pole, highlighted in orange by the ABC, in use by BNC during the finish. (CYCA/ABC News)\n\nHeading into the hearing, Ms Lin said she wanted to ensure the result was \"fair\".\n\n\"A rule is a rule,\" she said.\n\n\"People started sending over a video of the finish, so we thought, 'Oh, that's interesting'.\n\n\"[We] just wanted to do, in my personal view, the right thing.\"\n\nLoading...\n\nThe Min River co-skippers lodged a protest over BNC but it is understood a competitor can only protest over a breach if they personally witnessed it during the race.\n\nIt had only seen a photograph of the issue.\n\nHowever, the race committee can lodge its own protest, which it did this morning after BNC declared to the committee that it had broken a rule.\n\nThat protest against BNC was upheld, while Min River withdrew its protest after learning of the international jury's decision.\n\nRace committee chair Lee Goddard said that once the breach by BNC was confirmed, a \"proportionate\" penalty had to be applied.\n\nHe said the rules were clear.\n\n\"Essentially, they've actually used their spinnaker in an inappropriate way which is perceived as an advantage,\" Mr Goddard said.\n\n\"They did not deliberately do it, they probably did not understand fully that they were going to break the rule, but it was photographed.\"\n\nMin River co-skippers Alexis Loison and Jiang Lin entering the protest hearing this morning. (ABC News)\n\nMin River co-skipper pays tribute to sailing mate\n\nMin River finished the race in just under four days.\n\nMin River sailing towards Hobart on Tuesday. (Supplied: Rolex/Kurt Arrigo)\n\nOwned by Ms Lin, the yacht was named for the river that flows through Fujian, China, where her parents grew up.\n\nAfter finishing on Tuesday, Ms Lin paid tribute to her co-skipper.\n\n\"One decision right that I made, is that I chose the best co-skipper there is,\" she said.\n\nMr Loison has completed six Sydney to Hobart yacht races, including with BNC's Michel Quintin, who he described as a good friend.\n\nAfter the protest decision was handed down, Ms Lin said it was an \"unbelievable\" feeling to have become the first female skipper to win the overall title.\n\n\"I never dreamed of winning it,\" she said.\n\n\"My ambition ... was that if I can win the division, that would be nice, that was my goal.\"\n\nMin River was crowned the overall winner. (Supplied: Rolex/Kurt Arrigo)\n\nBNC accepts rule break but challenged penalty\n\nBNC crew Michel Quintin and Yann Rigal said they respected the decision of the international jury.\n\nThey had measured their estimated gain as between three and five minutes, but it ultimately resulted in a penalty of more than an hour.\n\nMr Rigal said they carried out the technique in order to clean the boat near the finishing line.\n\n\"Because it was just the finishing line, we wanted to prepare the boat, to clean the boat … because we knew the media was here,\" he said.\n\n\"We decided together, let's put the pole so I don't have to stand like that until the finishing line, so I can prepare the boat for the media and for everything after.\n\n\"The speed is nearly the same.\"\n\nThe double-handed crew said they were unaware at the time that they were breaking a rule.\n\n\"It's sport, it's life, we respect the decision of the international jury,\" Mr Quintin said.\n\n\"We thought we could manage to have a smaller penalty, but that's the choice.\"\n\nHandicap winner separate to line honours\n\nWhile Comanche, the first of the large 100-footer supermaxis, has been in port at Hobart since Sunday evening after taking out the line honours win, the overall winner of the Sydney to Hobart on handicap takes out the Tattersall Cup, which is seen by sailors as the \"crown jewel\" of prizes.\n\nWhat decides the overall victor is a number of factors such as boat size, sail size, mast size, the amount of water that the boat displaces when fully loaded and its expected speed.\n\nThe boat’s final finish time takes on these factors as well as the time on the clock when it crossed the finish line.\n\nThe handicap system is seen as an equaliser for the fleet, meaning victory becomes much more about sailing ability than what sort of boat you are able to enter into the race.\n\nMin River completed the race in just under four days. (ABC News)\n\nRight conditions for double-handers\n\nThis year, three of the four contenders for the handicap honours were double-handers.\n\nBNC appeared to have won the overall honours when it arrived on Tuesday morning, and when fellow double-hander Crux failed to arrive by 9:45pm in the evening, after southerlies slowed its progress near Tasman Island.\n\nMichel Quentin and Yann Rigal appeared to have claimed handicap honours after they arrived in Hobart on Tuesday morning. (Supplied: CYCA/Salty Dog)\n\nAfter crossing the line, BNC crew Yann Rigal and Michel Quentin described it as “a magic moment”.\n\n\"Just finishing line of honour double-handed is incredible for us,\" Quintin said.\n\nDefending overall winner Celestial V70, crossed the finish line in sixth place for line honours with a time of 2 days, 16 hours, 14 minutes and 34 seconds.\n\nSailors tell of 'horrendous' ordeal in yacht race Those now safely onshore after finishing the 2025 Sydney to Hobart tell of \"horrendous\" conditions, resulting in injuries, broken boats and seasickness — even among experienced crew members.\n\nThe yacht was pipped to take out the overall victory again, but the cohort of double-handeds challenged expectations by the fourth day.\n\nThe weather conditions after the first boats finished also affected the handicap win, as good winds favoured the smaller boats.\n\nCruising Yacht Club of Australia (CYCA) commodore Sam Haynes put the result of the double-handers down to the hard southerly driven by a high-pressure system that occurred during most of the race.\n\nSam Haynes says this year's weather favoured the smaller yachts. (AAP: Ethan James)\n\n\"The smaller boats have just been in the pressure longer and been able to keep going,\" he said.\n\n\" But all the boats in this race have had periods where they've been in very light wind zones. \"\n\nThis year's race saw 17 double-hander entrants out of a fleet of 128.\n\n'Different type of sport'\n\nDouble-handed yachts were first given their own category in the race in 2021 and were eligible to win the overall prize from 2022, forming one of the race's six divisions.\n\nHaynes said the category was becoming increasingly popular.\n\n\"We tend to see about 25 per cent of the fleet as double-handed,\" he said.\n\n\"It's a great way for people to be able to access the sport with potentially less expense and so forth. It's a very particular style sailing, obviously. Big overseas, double-handed sailing, it's a different type of sailing experience.\"\n\nComanche takes out line honours in Sydney to Hobart race Master Lock Comanche claims line honours in the 80th edition of the gruelling Sydney to Hobart yacht race, with a stunning daylight hours finish.\n\nThe demands on a two-person crew are greater than on larger craft, as the round-the-clock duties of navigating, steering and sail changes, as well as sleeping, have to be shared.\n\n\"It's not the same sport,\" BNC co-skipper Quintin said.\n\n\"You are doing everything onboard, and you are a team together a lot more than with a big crew.\n\n\" Always there's something to do. Sleeping is extra. We have to sleep and to rest but that is difficult to manage but that is part of the sport. \"\n\nSailing in the 2021 race, Tasmanian GP John Saul and co-skipper Rob Gough were the inaugural two-handed line honours champion in their yacht Sidewinder.\n\nYour guide to the Sydney to Hobart yacht race Everything you need to know about the Sydney to Hobart yacht race as the 80th edition takes place.\n\nDr Saul, who is competing this year on a Huon pine yacht named Tradition, said it was exciting to see an increase in the number of smaller crews competing.\n\n\"It'd be sensational to see some variety in the winners on the winners' platform, and a double-hander would be great,\" he said.\n\n\"There's some really good quality double-hander racers in the event this year, and obviously they're really trying to ring the most that they can out of their boats.\"\n\nLine honours, the title given to the first yacht to cross the finish line, was taken out by Comanche, which soared up the River Derwent to complete the race at 6:03:36pm on Sunday.\n\nThe 100-footer led for much of the race, but had to fend off a cat-and-mouse chase with fellow competitors LawConnect and Scallywag for a thrilling finish.\n\nFollow the yachts as they sail for Hobart with the official race tracker.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/hidden-collection-in-donnybrook-revealed/106139442",
        "title": "Dolls, tribal gear and Titanic: Inside wild WA collection",
        "publish_date": "Wed, 31 Dec 2025 00:00:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "A fertility mask, which is jokingly rumoured to make women pregnant.\n\nTribal tools allegedly used to scalp victims.\n\nAnd a room full of wide-eyed dolls, enough to give anyone nightmares.\n\nThese are just some of the diverse items in Kevin Green's extraordinary collection hidden across multiple sheds and buildings in the town of Donnybrook, 200 kilometres south of Perth.\n\nMr Green's extensive Coca-Cola collection features vintage key chains, empty cans and yo-yos. (ABC South West WA: Pip Waller )\n\nMr Green has been collecting bits and pieces since he was a child growing up in WA's Goldfields, where nothing went to waste.\n\n\"I was brought up to appreciate old; everything was precious when we were young,\" he said.\n\n\"We'd be going back to Kalgoorlie, and Dad would pull over and say, 'Righto, go and get your pocket money.'\n\n\"And we'd run up and down the road picking up beer bottles and cool drink bottles people had thrown out. That's how we earnt our money.\"\n\nMr Green says part of the joy of his collection was seeing people's faces as they reminisce. (ABC South West WA: Pip Waller )\n\nWatches, Indigenous art, Coca-Cola and more\n\nThe collection features an extensive range of Titanic memorabilia. (ABC South West WA: Pip Waller )\n\nMr Green's personal collection includes West Coast Eagles AFL memorabilia, hundreds of toy cars, a large Coca-Cola collection, and an extensive range of Titanic items purchased from an auction in Boyanup.\n\nWith a background in the navy, Mr Green's extensive range of military memorabilia is among his favourites.\n\n\"Anything military, I'm just 100 per cent behind,\" Mr Green said.\n\n\" I have a clock, and when it goes off, it just sends a shiver. It plays The Last Post, and it's incredible. \"\n\nMany items also hold strong ties to regional Western Australia, including old stairs from a hotel in Bunbury, a telephone booth from Karridale and two antique whale spears found beneath the Albany jetty.\n\nOne of Mr Green's sheds is full of hundreds of dolls. (ABC South West WA: Pip Waller )\n\nOne shed is filled entirely with dolls, while another houses a foosball table, which Mr Green said was once played at Tom's Snack Bar and Amusement Centre in Scarborough Beach in 1981.\n\n\"I just love doing this,\" he said.\n\n\"People walk in here and go into the first room, then after half an hour they go to leave, and I say, 'You haven't seen it all.'\n\n\"They come in here and have a heart attack.\"\n\nMr Green says he hopes the collection helps people appreciate older items. (ABC South West WA: Pip Waller )\n\nMost items have been sourced from op shops, auctions and garage sales, and Mr Green said he remembered the story behind every single one.\n\n\"There's a tribal knife, and they would get the head and flip it back, and use the fork to get the delicacy, the brain,\" he jokes.\n\n\"But there were a few nationalities that disappointed them because sometimes there was a note in there that said 'we owe you some' [brains].\n\n\"When ladies come in, I say, 'Whatever you do, don't go near that fertility shield.' And they say why, and I say, 'The last woman that touched that was pregnant before they got to the door.'\"\n\nMr Green said as long as something was 'nice and different', he would find a room for it.\n\nAppreciation for the past\n\nKevin Green says his middle name should be 'garage sale' where he has collected many items. (ABC South West WA: Pip Waller)\n\nWhile the collection is not open to the public, Mr Green has invited his friends, family and now the ABC, to see his collection.\n\nHe said he collected for joy, not profit.\n\n\"It's just to see people's faces when they say I remember that, I had one of those,\" Mr Green said.\n\nHe said people do not value older items.\n\n\"We're sick of hearing about Nan dies, so the kids get a skip bin in,\" Mr Green said.\n\n\"I just want people to appreciate stuff from their past.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/tradie-apprentice-workplace-hazing-mental-health-advocates/106173610",
        "title": "First apprenticeship 'hell' for tradie who wants hazing to stop",
        "publish_date": "Tue, 30 Dec 2025 22:03:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "Beth Jones does not mince her words when describing her first apprenticeship experience in 2020 as a mechanical fitter.\n\n\"I say to people if you could imagine what hell would feel like, that's what it felt like to me,\" she said.\n\nShe's now added her voice to a campaign for stronger regulations to protect apprentices' mental health and address a hazing culture mental health advocates say has gone on far too long.\n\nBeth Jones loved mechanics but says the culture at her workplace was toxic. (Supplied: Beth Jones)\n\nMs Jones was thrilled to start her apprenticeship at the age of 20 at the South Australian mine site where she had dreamt of working since childhood.\n\nShe said that passion was quickly tainted by regular sexual harassment and sabotage of her work.\n\nShe said male apprentices were also subjected to pranks, including the use of overhead cranes to hold essential worksite tool belts out of reach.\n\nBut as the only female apprentice, she felt especially targeted.\n\n\"I was having daily panic attacks,\" she said.\n\n\" I constantly went through a rollercoaster of [thinking], 'This is horrible, I want to die' … and then I would go, 'Oh, wait. Maybe it's all in my head.' \"\n\nBeth Jones says she had a positive experience during her second apprenticeship. (Supplied: Beth Jones)\n\nShe said the mental health impacts were severe and ongoing, but she was happy to have found another supportive workplace to complete her apprenticeship.\n\nIf you or anyone you know needs help, contact: Lifeline on 13 11 14\n\nBeyond Blue on 1300 22 4636\n\nSuicide Call Back Service on 1300 659 467\n\nMensLine Australia on 1300 78 99 78\n\n13YARN for Aboriginal and Torres Strait Islander crisis support\n\nNow a project officer for the Australian Manufacturing Workers' Union, Ms Jones works to encourage women in trades, many of whom have suffered similar experiences during their apprenticeships.\n\n\"I haven't met an apprentice who hasn't gone through hazing before,\" she said.\n\nA push for change\n\nHazing, or harmful workplace bullying as a form of \"initiation\", is a widespread issue.\n\nA strategic review into the Australian Apprenticeship Incentive System released earlier this year found three-quarters of apprenticeships end due to \"workplace related issues\", particularly \"unsafe workplaces, a toxic work culture, or being treated as simply 'cheap labour'\".\n\nThe report noted inaction on workplace culture has been estimated to cost the Australian economy $8 billion each year.\n\nBarry Du Bois says legislation creates cultural change. (Supplied: Barry Du Bois)\n\nTelevision presenter and R U OK? board director Barry Du Bois worked in the construction industry for 30 years and said the hazing culture in the 1980s was \"horrific\".\n\n\"I was stripped naked, painted in pink primer and tied to the scaffolding on a main road … I was humiliated,\" he said.\n\nLast month, he travelled to Canberra to lobby politicians for a national strategy to address the issue, including hazing.\n\nHe wants government incentives paid to employers for taking on apprentices to be tied to \"enforceable standards\" around workplace culture.\n\n\"This'll just help to build a culture, and the people that don't work under those standards won't last in the industry,\" he said.\n\nHe is particularly concerned by national suicide rates in the construction sector, which industry mental health charity MATES puts at one worker every second day.\n\nBarry Du Bois (left) working as a builder in 1979. (Supplied: Barry Du Bois)\n\nGenerations affected\n\nGenerations of apprentices have cut their careers short, contributing to a major shortage of tradespeople required to reach housing targets.\n\nWodonga resident Kath Howse has spent years rebuilding her life after experiencing extreme hazing as an apprentice electrician in the late 1970s.\n\nKath Howse left her trade due to poor culture, and now works as a massage therapist. (Supplied: Kath Howse)\n\n\"I got set upon by three guys who were determined to strip me and hang me out the window on one of Adelaide's busiest streets,\" she said.\n\n\"I saw apprentices shoved in air conditioning ducts so their legs hung out into space … I saw them have pipes put through their clothes and almost … crucified up on air conditioning ducts.\"\n\nShe left the industry in 1994.\n\n\"I saw it go on for years and years and years where apprentices were just treated as cheap labour and a waste of space,\" she said.\n\nBeth Jones was named SA Apprentice of the Year for her work at Pelican Point Power Station. (Supplied: Beth Jones)\n\nBeth Jones said she was living proof that supportive workplaces brought positive outcomes.\n\nLast month, she was named the 2025 South Australian Apprentice of the Year by the SA Skills Commission.\n\nShe hopes telling her story will lead to stronger penalties for hazing and harassment.\n\n\"I would really want to see people and companies, doesn't matter who they are, be held accountable for this sort of thing … because it's absolutely disgusting.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/f1-title-runner-up-verstappen-driver-of-the-year-five-in-row/106189130",
        "title": "Piastri misses F1 Driver of the Year top three as Verstappen scoops award",
        "publish_date": "Tue, 30 Dec 2025 21:19:57 +0000",
        "category": "sports",
        "authors": [],
        "text": "Max Verstappen has been voted the Formula 1 Driver of the Year by his colleagues for the fifth straight year despite falling short of his fifth consecutive world championship.\n\nSeason champion Lando Norris of McLaren finished second to the Red Bull star, with Mercedes's George Russell, McLaren's Oscar Piastri, and Ferrari's Charles Leclerc rounding out the top five.\n\nWilliams's Carlos Sainz finished sixth, followed by Aston Martin's Fernando Alonso, Williams's Alex Albon, Haas's Oliver Bearman and Racing Bull's Isack Hadjar.\n\nAlbon, Bearman and Hadjar were new to the top 10 this year. Alonso moved up two places from 2024, and Leclerc slipped two spots.\n\nPiastri came so close, but these minor moments let the F1 title slip away Oscar Piastri missed out on winning the Formula 1 drivers world championship by just 13 points to his teammate Lando Norris, the culmination of multiple small moments throughout the season that cost him dearly.\n\nNotably absent from the list was seven-time world champion Lewis Hamilton (Ferrari), who failed to crack the top 10 for the first time since the poll's inception in 2018.\n\nUsing the standard F1 points allocation, drivers were asked to rank their top 10 peers. The top driver on each list received 25 points, down to one point for the driver ranked 10th.\n\nVerstappen, 28, earned a top score of 25 points on six different ballots after a furious late-season comeback, winning six of the final nine Grand Prix races to finish just two points behind Norris.\n\nFour drivers did not participate in the anonymous poll: Hamilton, Nico Hulkenberg, Lance Stroll and Yuki Tsunoda.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/canberras-biggest-fireworks-display-to-ring-in-2026/106187442",
        "title": "'Can't fit any more': Barges packed with fireworks for biggest NYE display",
        "publish_date": "Tue, 30 Dec 2025 21:19:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Canberra will farewell 2025 and ring in 2026 with the city's biggest ever New Year's Eve fireworks display.\n\nSome 50,000 people are expected to celebrate New Year's on the shores of Lake Burley Griffin tonight.\n\nThere will be two fireworks displays — at 9pm and midnight — launched from barges in the lake's central basin.\n\nAdditional barges have been floated on Lake Burley Griffin to launch the fireworks. (ABC News: Monte Bovill)\n\nMartin Brady from Fireworks Australia said it was the \"biggest show\" they have ever done in Canberra.\n\n\"There's two more barges than last year and bigger barges as well,\" he said.\n\n\"We can't fit anymore on, it is chock-a-block.\"\n\nMartin Brady says this year's fireworks display will be the biggest yet. (ABC News: Monte Bovill)\n\nThe displays will last for about 10 minutes each and will be accompanied by a synchronised soundtrack.\n\n\"At 9 o'clock … we are trying to do a few tricks for the kids, so it's got some special shells. They love the shapes, they like the smileys, the love hearts,\" Mr Brady said.\n\n\"And then [at] midnight: full feral … super loud and massive.\"\n\nMr Brady says they \"can't fit any more\" fireworks on the barges. (ABC News: Monte Bovill)\n\nFireworks won't be launched from Commonwealth Avenue Bridge this year as a result of roadworks in the area.\n\n\"We had to rethink the project, hence why we have brought more barges in to be a little wider,\" Mr Brady said.\n\n\"My tip would be if you can see the dead middle of the central basin, doesn't matter which side of the lake you are on, you'll be fine.\"\n\nThe fireworks displays will last for about 10 minutes each. (ABC News: Monte Bovill)\n\nFarewell to nightclub institution\n\nFor some Canberrans, it's not only goodbye to 2025 but also to a city institution.\n\nQueer nightclub Cube will open its doors for one final time on New Year's Eve after two decades in operation.\n\nVenue manager Seth Byrnes said it was going to be \"very hard\" to say goodbye to the venue.\n\n\"It will be a big night to remember and not forget,\" he said.\n\n\"We've had big parties, little parties, everything you can really think of.\n\n\"Cube has been a home for the queer community.\"\n\nSeth Byrnes says it will be \"very hard\" to say goodbye to the nightclub. (ABC News: Monte Bovill)\n\nMr Byrnes said he was expecting a \"huge\" send off.\n\n\"There will definitely be some regular drag queens, drinks will definitely be flowing, and there will be a lot of dancing, I hope,\" he said.\n\n\"Just good vibes really … to see our friends and family of Cube for one last time for a big hurrah.\"\n\nNew Year's Eve will be the last night Cube opens its doors. (ABC News: Monte Bovill)\n\nAdditional security around the lake\n\nAt the lake, there will be celebration hubs set up at Rond Terrace, Wendouree Drive, John Dunmore Lang Place, and at Ferry Gate.\n\n\"By providing these hubs around the lake with local DJs and food and prime vantage points, we aim to ensure everyone can have an enjoyable experience,\" said Ross Triffitt from Events ACT.\n\nHow Australian cities will ring in the new year There are plenty of free events around the country to see out 2025 and welcome 2026. See what's happening in your city.\n\nAdditional security measures have been put in place for the celebrations, according to Mr Triffitt.\n\n\"All the security and emergency management planning is done in consultation with police,\" he said.\n\n\"This year we have got some additional hostile vehicle mitigation and increased police patrols.\"\n\nPolice to target anti-social behaviour\n\nACT Policing's Detective Acting Superintendent Brett Coutts said officers would be out across the city.\n\n\"Police will be targeting anti-social behaviour and under age drinking as well as drink and drug driving,\" he said.\n\n\"Australia's national terrorism threat level remains at probable so our planning for our policing response is in line with that threat.\n\n\"ACT Policing will have appropriate recourses and presence at various locations.\"\n\nThere will not be any fireworks launched from Commonwealth Avenue Bridge this year. (Supplied: Chris Elsley)\n\nOnly a handful of people were arrested last New Year's, and Detective Acting Superintendent Coutts said he hoped there would be a repeat of the good behaviour.\n\nBus and light rail services in Canberra will be free all day to encourage people to take public transport to New Year's celebrations.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/2026-new-rules-laws-regulations-come-into-effect/106186738",
        "title": "Australian-made content and cheaper medication among January 1 changes",
        "publish_date": "Tue, 30 Dec 2025 21:02:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "When the clock strikes midnight tonight, fireworks will herald the start of a new year.\n\nAt the same time, a host of new laws, guidelines and price changes will quietly come into effect.\n\nHere's a quick breakdown of some of what's changing from January 1.\n\nApprenticeship payments\n\nA licensed electrician training an apprenticeship at a construction site in Sydney. ( )\n\nEmployer incentives\n\nA new payment encouraging employers to bring on apprentices in some trades will become available.\n\nIt's part of the federal government's plan to build a clean energy and housing workforce.\n\nTo be eligible, employers need to be training apprentices in a key apprenticeship priority (KAP) occupation.\n\nYou can see the list of KAP trades here.\n\nPayments of up to $5,000 will be made in two instalments during the apprentices' first year.\n\nMeanwhile, the ongoing Priority Hiring Incentive will be reduced.\n\nThis applies to employers of apprentices working towards a Certificate III or above in an occupation on the Australian Apprenticeship Priority List but not the KAP list.\n\nThe maximum payment will drop from $5,000 to $2,500.\n\nTraining support payments\n\nMany apprentices in trades listed on the Australian Apprenticeship Priority List are eligible for training support payments.\n\nBut the maximum payment will be halved to $2,500.\n\nYou can read more about the changes to apprenticeship payments here.\n\nCash payments\n\nCarolyn Hocking had to wait 15 months to receive her deceased husband's superannuation from CBUS ( )\n\nMany retailers that sell groceries and fuel will be required to accept cash payments for these essential goods.\n\nThe rule doesn't cover every store though.\n\nSmall businesses with an annual turnover of less than $10 million will be exempt, meaning they will be allowed to take payments by card only, if they choose.\n\nThe federal government announced plans to introduce the mandate in 2024.\n\nCheaper medication\n\nAustralia's medicines regulator is considering restrictions over how much paracetamol can be bought and who it can be sold to after data raised concerns about misuse and self-poisoning. ( )\n\nIf you take a prescription medication, your next visit to the chemist could be cheaper.\n\nThat's because the price of medicines on the Pharmaceutical Benefits Scheme will be capped at $25 per script, down from $31.60.\n\nPensioners will still only have to pay $7.70 per script.\n\nThe change stems from an election promise by the federal government.\n\nChildcare subsidies\n\nGeneric child toys at a childcare center in Devonport. Still taken for Young Motherhood NFT in Easy Devonport on 1 July, 2024. ( )\n\nThe federal government's Child Care Subsidy (CCS) is changing.\n\nFamilies that receive the CCS will be entitled to at least 72 hours of subsidised child care each fortnight.\n\nThis is called the 3 Day Guarantee.\n\nSome families will be entitled to 100 hours if:\n\nParents and guardians each do more than 48 hours of recognised participation every fortnight\n\nThey have a valid exemption.\n\nAboriginal and Torres Strait Islander children can also receive 100 hours of subsidised child care each fortnight.\n\nThis change technically starts on January 5, but with a difference of four days, we've included it here.\n\nEnergy bills\n\nSome groups, like single parent families, were less likely to have a financial buffer. ( )\n\nThe federal government's energy bill rebate scheme will expire.\n\nThe cost-of-living relief package has given a $75 rebate on household and small business bills each quarter since mid-2023.\n\nBut Treasurer Jim Chalmers announced in December it would not be extended into the new year.\n\nGas appliances\n\nChanges to the rules around gas appliances come into effect on January 1. ( )\n\nIndoor gas appliances will no longer be allowed in new residential builds in Sydney.\n\nThat includes cooktops, ovens and indoor heating and cooling systems.\n\nThe city's council plans to prohibit outdoor gas fittings down the line too.\n\nIt's all part of a measure voted on by the City of Sydney council back in 2023.\n\nLord Mayor Clover Moore said at the time the change would help \"address global boiling\".\n\nResearch has also shown gas stoves can lead to negative health effects due to the indoor air pollution they cause.\n\nPassports\n\nAn Australian passport. ( )\n\nAustralia already has the most expensive passport in the world, and the cost of one is about to rise even higher.\n\nPassport prices are adjusted annually on January 1 in line with the Consumer Price Index.\n\nThe price of a 10-year adult passport will jump by $10 to $422.\n\nFive-year passports for children and adults aged 75 will cost $213 — up $5 on last year's price.\n\nThe Australian passport remains one of the strongest in the world, though.\n\nIt allows its holders to travel to 185 destinations without a visa.\n\nThe Henley Passport Index ranked it equal seventh in October, alongside Czechia, Malta and Poland.\n\nStreaming\n\nA person holds a TV remote while sitting on a couch. ( )\n\nExpect more Australian-made film and television on streaming platforms in the future.\n\nFrom tomorrow, streaming services with more than 1 million Australian subscribers will need to invest a chunk of their revenue into making local drama, documentary, arts, educational and children's programs.\n\nThat's because of an amendment to the Broadcasting Services Act passed by federal parliament last year.\n\nIt stipulates these businesses must commit at least 10 per cent of their local expenditure, or 7.5 per cent of their revenue, to local content.\n\nYou can read more about the new rule here.\n\nWelfare payments\n\nThanks to indexation, government payments lift slightly twice a year.\n\nSome of those fortnightly pensions are getting a boost tomorrow.\n\nYou can check which allowances are increasing here.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/record-year-for-aussie-beef-despite-trump-tariffs/106188120",
        "title": "Winning year for Aussie beef despite Trump's tariffs",
        "publish_date": "Tue, 30 Dec 2025 20:13:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Donald Trump enforced a 10 per cent tariff on Australian beef earlier this year, there were some concerns it would impact trade.\n\nThe opposite happened.\n\nAustralia has exported a record amount of beef this year and is on track to surpass 1.5 million tonnes for the first time.\n\nThe biggest customer has been the United States, importing about 412,000 tonnes (January to November) which is up 17 per cent year-on-year.\n\nThe United States also paid record money in 2025 to import our lean beef.\n\nThe US imported beef price for lean (90CL) beef hit a record high this year. (Supplied: MLA)\n\nAccording to Meat and Livestock Australia (MLA), the US paid a peak of more than $13 a kilogram for imported Aussie lean beef this year, which was up 34 per cent on the previous year, and up 64 per cent compared to the same period in 2023.\n\nThis record money flowed into the Australian cattle market, it would seem, with the national processor cow indicator reaching a record high of nearly $4 a kilogram.\n\nWhat about the tariff?\n\nDonald Trump's 10 per cent tariff on Australian beef was dumped in November.\n\nSo what did it achieve?\n\nAccording to meat analyst Simon Quilty, not much.\n\n\"If tariffs were meant to persuade people from shipping [beef to the US], it did quite the opposite, for Australia at least,\" he told the Country Hour.\n\n\"Australian lean beef is a necessity [for the United States] because they simply don't produce enough of their own.\n\n\"Because of drought they've been liquidating their herd to a 70-year low, and with fewer cows comes less lean beef.\"\n\nMr Quilty said US consumers bore the cost of the tariffs this year.\n\n\"To me it was all passed through to the US consumer at the other end,\" he said.\n\n\"The humble hamburger is in huge demand and ground beef continues to be the number one item sold throughout America's retail sector.\n\n\"The tariffs have now been removed, but I think the demand will continue, just perhaps not at the same pace in 2026.\"\n\nWhat about imports?\n\nEarlier this year, Donald Trump incorrectly stated that \"Australia bans American beef\".\n\nAs explained by ABC Landline, Australia did not have a ban.\n\nAustralia allowed imports of US beef as long as it was from cattle born, raised and slaughtered in the US.\n\nThe sticking point was the US's demand for expanded access, which would allow it to export beef from cattle sourced out of Canada and Mexico and processed in the US.\n\nLoading...\n\nWhen Australia agreed to this request in July, there were some concerns it would open the gate to large consignments of imported American beef.\n\nThe opposite has happened.\n\nAccording to trade data up to the end of October, Australia has imported just 150 kilograms of US beef and 18 tonnes of Canadian beef.\n\nABC Landline has sought more details from the Australian Bureau of Statistics, but is yet to receive a response.\n\nAustralian beef took centre stage at the SIAL food trade show in Shanghai this year. (Supplied: MLA/ABC Landline)\n\nThen there's China\n\nTrump's tariff war with China created ripple effects across the global beef trade — which benefited Australia.\n\nSince March, about 300 abattoirs in the United States have been unable to export beef to China, which opened the door to Australian grain-fed beef exports.\n\n\"Australia's largest beef market has been the United States, but 2025 has not been a one-market story,\" MLA's Andrew Cox said.\n\n\"China beef imports have increased 44 per cent [year-on-year] and has been Australia's second largest beef market.\"\n\nAt a major trade show in Shanghai this year, MLA's Murray Davis said it was obvious Australian beef was having its moment.\n\n\"Australia is absolutely centre stage [here in China] and we are dominating the premium end of the beef market,\" he said.\n\n\" Our major competitor over the last few years has been the United States, but with the trade disputes between China and the US, the US is effectively out of the market. \"\n\nBeef in 2026\n\nOverall, it has been a good year for Australian cattle producers.\n\nThere has been drought in parts of Victoria, South Australia and New South Wales, which meant some producers were forced to sell stock.\n\nBut they received strong money thanks to good overseas demand and producers further north having a great season.\n\nIn fact, there was record money for processor cows, thanks mostly to the huge demand for lean beef in the United States.\n\nAustralia produced a record amount of beef, exported a record amount of beef and 2026 is shaping up well for those with green grass and stock to sell.\n\nBut markets can do funny things, so fingers crossed.\n\n\n\nABC TV's Landline will return in 2026. Catch up on previous episodes via ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/turner-stranded-short-of-ton-but-helps-rescue-perths-bbl-season/106189062",
        "title": "Turner stranded short of ton, but helps rescue Perth's BBL season",
        "publish_date": "Tue, 30 Dec 2025 20:10:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ashton Turner joined one of the Big Bash's unluckiest clubs as he helped revive Perth's season, his unbeaten 99 leading the Scorchers to a 71-run win over the Sydney Thunder.\n\nAfter coming to the wicket with the visitors 3-34 in the sixth over, Turner became just the fourth player in BBL history to be stranded on 99 not out as he took his side to 8-202 at Sydney Showground.\n\nThe Thunder was then bowled out for 131 in reply in the 18th over, with the hosts unable to capitalise on a hot start from David Warner (25) and Matthew Gilkes (33).\n\nAfter one win from its opening three games, Perth was staring down the barrel of its worst start to a season in five years with defeat on Tuesday night.\n\nBut the BBL powerhouse is now back in the top four, with the Thunder 1-4 and its season all but over.\n\nThat was largely thanks to Turner, who blasted eight sixes from his 41 balls and narrowly missed out on the fifth-fastest century in BBL history.\n\nWith Perth in early trouble, Turner changed the game when he smashed three off the ninth over from Chris Green.\n\nHe then hit Tanveer Sangha for another six down the ground, before taking down Daniel Sams late in the innings.\n\nBig Bash League Stranded on 99 not out Shaun Marsh, Perth vs Melbourne Renegades, 2011-12\n\nJosh Philippe, Sydney Sixers vs Melbourne Stars, 2021-22\n\nColin Munro, Brisbane Heat vs Melbourne Stars 2023-24\n\nAshton Turner, Perth vs Sydney Thunder, 2025-26\n\nAfter starting the final over on 86, Turner smashed Sams for two big sixes over long on to move within touching distance of his maiden BBL ton.\n\nBut after driving the left-armer for a single, Ashton Agar hit a boundary of his own and was then caught in the deep on the penultimate ball to deny Turner the strike.\n\n\"I've been getting single-figure scores the last couple of games, so it's better than that,\" Turner quipped.\n\n\"Once I got to 20, I was like, 'At least I've done something tonight'.\n\n\"I knew what I was on, but I also had 200 in my mind as a really good team score and we were approaching that.\n\n\"We had 260 chased down a week ago, so you're never thinking you have enough runs. We wanted to scrap together every run we could.\"\n\nIn the end, the Scorchers' total was plenty enough.\n\nWarner and Gilkes shot out of the blocks to be 0-60 after 6.3 overs, before the former was well caught in the deep by Finn Allen.\n\nGilkes was then run out in a mix-up with Sam Konstas (21), with the Thunder's chase never really looking likely beyond that.\n\nInstead, Aaron Hardie, Cooper Connolly, Joel Paris and Brody Couch all took over with the ball, taking two wickets each to completely derail the hosts' innings.\n\nThe Scorchers also caught supremely well, in a return to their best after an off few nights in the field.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/asx-ends-stressful-year-with-gold-and-lithium-stocks-surging/106188730",
        "title": "Stocks that would have earned you the most money on the ASX in 2025",
        "publish_date": "Tue, 30 Dec 2025 20:05:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "With 2025 almost over, now is perhaps as good a time as any to look back at where we could have invested our hard-earned money — but probably did not.\n\nThose who had the foresight (or luck) to buy mining stocks at the start of the year would have seen the value of those investments double, or even triple.\n\nTake, for example, Liontown Resources — a battery minerals company that reported a $193 million loss in the previous financial year.\n\nDespite its lacklustre financial performance, Liontown counts mining billionaire Gina Rinehart as its largest shareholder (with an almost 20 per cent stake through her company Hancock Prospecting).\n\nGold miners dominate the list of best performing stocks in 2025. (Bloomberg, ABC News)\n\nThe company has also inked lithium supply deals with Tesla, Ford and LG. And it received a $50 million investment from the federal government in August as part of its Future Made in Australia strategy to prop up certain industries in the national interest.\n\nIt is no wonder the share price of this unprofitable, partly taxpayer-funded lithium miner has surged 180 per cent since January, making it one of the best performers on the Australian share market.\n\nShares of its rivals Core Lithium (up 220 per cent), PLS (up 89 per cent) and IGO (up 65 per cent) have also enjoyed strong gains.\n\nThe rally was also driven by a rebound in lithium prices (since crashing in 2023 on concerns about an oversupply of the battery mineral) and expectations of strong demand for electric vehicles in the years ahead, particularly in China.\n\nSkyrocketing gold miners\n\nAnother surprise was the sheer number of gold miners in the list of this year's best-performing stocks. They included Regis Resources, Genesis Minerals, Evolution Mining and Newmont Corporation.\n\nShares of mining companies surged in 2025. (Bloomberg, ABC News)\n\nThe value of their shares has roughly tripled in the past year as the price of physical gold has hit new record highs throughout the year, even climbing as high as $US4,532 an ounce last week.\n\n\"What's driving the price higher in the last two years is mainly central banks buying gold as they move away from the US dollar and US dollar assets like Treasury bonds,\" said Gemma Dale, nabTrade's head of investor behaviour.\n\nGold is seen as a safe-haven asset that tends to do well in times of global uncertainty.\n\nFinancial commentators often cite US President Donald Trump's erratic policymaking and ever-changing tariff policies as reasons for gold's relatively recent popularity.\n\nAnother concern is whether the Federal Reserve will continue to make interest rate decisions independently, free from the White House's interference, particularly given the US president's recent efforts to appoint rate-cutting loyalists.\n\nGemma Dale expects President Trump to have less influence on the markets in 2026. (ABC News: John Gunn)\n\nOn top of that, the Fed has already slashed America's interest rates three times in 2025 and is likely to keep cutting them next year, which has contributed to the US dollar losing 10 per cent of its value this year.\n\nSo all this, along with concerns about US economic exceptionalism and geopolitical conflict, has led to huge demand for bullion, which in turn has led to the share prices of many Australian gold mining companies rising to their most expensive levels ever.\n\nTrump, TACO and the ASX\n\nOverall, the local share market has done reasonably well, with the ASX 200 up 10 per cent (when dividends are included), and the broader All Ordinaries index gaining 7 per cent.\n\nBut for those who bought into the Australian market in early April, after Mr Trump caused a global crash with his so-called liberation day tariff, and sold at a record high in late October, their gains would be much higher at about 24 per cent.\n\nWhen asked to describe 2025, the words \"volatility\" and \"stress\" were what came to mind for Ten Cap's lead portfolio manager and stock picker, Jun Bei Liu.\n\nJun Bei Liu expects 2026 to be a volatile year for markets. (ABC News: John Gunn)\n\n\"It's been very stressful because of the unexpected nature of the tariff negotiations,\" she said.\n\nShe said: \"No-one expected Trump to be negotiating tariffs so openly, which has been the cause of all this volatility on the markets\" — as evidenced by the extreme swings in share prices (up and down) that have regularly occurred throughout the year.\n\nMs Dale also found 2025 to be quite a stressful year for share investing.\n\n\"We had so much concern about what the implications of those particular tariff announcements were going to be, and whether there'd potentially be a catastrophic collapse in global trade, something like we saw during COVID,\" Ms Dale said.\n\nDonald Trump with his 'reciprocal tariffs' chart on April 3, 2025. (Reuters: Carlos Barria)\n\n\"As those fears failed to materialise … everyone jumped on the TACO trade.\"\n\nTACO is an acronym that stands for \"Trump always chickens out\", and is used by traders to describe the US president's tendency to make grand tariff threats that cause investor panic — only for him to then backflip to some degree, giving time for markets to rebound.\n\nThe TACO trade — which is essentially the belief that markets will recover after Mr Trump's initial shocking announcements — has helped push many countries' share markets to their highest levels ever.\n\nUnderperforming compared to foreign markets\n\nHowever, the ASX appears to have underperformed against its overseas peers, particularly Wall Street's S&P 500 (up 18 per cent), Japan's Nikkei (up 28 per cent) and South Korea's KOSPI (up by a whopping 76 per cent).\n\nGold up again in 'extraordinary global scenario' The price of gold has hit another record and is set to become Australia's second most valuable resource export after iron ore.\n\nUnlike those nations, Australia's technology sector is much smaller, making up only 3 per cent of the local share market's value.\n\nSo the ASX has not benefited as much from the artificial intelligence (AI) investment boom, which has led to the share price of Nvidia, Apple, Microsoft, Amazon, Meta, Alphabet and Tesla (\"the Magnificent Seven\"), as well as the broader US stock market, soaring to new heights.\n\nAnother difference is that those foreign stock markets belong to countries that have seen significant falls in their exchange rates because they are likely to be recipients of further stimulus in 2026 (whether it is interest rate cuts or massive government spending).\n\nIn contrast, Australia is more likely to see interest rates rise next year due to the return of higher inflation, which is expected to stick around for longer than what the RBA is comfortable with.\n\nThe Australian market had much smaller gains than its overseas peers. (Refinitiv, ABC News)\n\nAs a general rule, lower interest rates (and cheaper borrowing costs) usually lead to stock markets rising as investors pile into riskier, speculative investments — and feel more comfortable overpaying for stocks. Rate hikes, on the other hand, tend to have the opposite effect (that is, investors \"selling down\" and taking profits as the cost of money becomes more expensive).\n\nOvervaluation worries\n\nConcerns about the share market (or certain companies and sectors) being overvalued have grown louder over the past year.\n\nCommonwealth Bank, for instance, has developed a reputation for being the most expensive bank in the world, especially when judged by its price-to-earnings ratio (basically, the amount of money people are willing to pay for each dollar of profit it earns).\n\nAfter hitting a record high of $191.40 in June, CBA's share price has undergone a major correction, having dropped 16 per cent in six months.\n\nThe ASX 200 crashed in April, then scaled a new record high within months. (Refinitiv)\n\nWorries about the market being too expensive have also led to the collective value of the ASX's technology and healthcare stocks falling by more than 20 per cent this year.\n\nIndeed, tech and health care are the worst-performing sectors on the local share market — largely due to steep falls in the share price of biotech giant CSL (-39 per cent), bookkeeping software firm Xero (-33 per cent) and logistics software company WiseTech Global (-45 per cent).\n\nWiseTech, meanwhile, has also taken a hit from personal scandals involving its founder Richard White, which led to him being forced to step down as CEO — though he has since taken up the executive chairman role.\n\n\"Valuations are too high for some of the tech and AI-related stocks, and we're seeing a little bit of a reality check for those sectors,\" Ms Liu said.\n\nThe tech and healthcare sectors had the steepest falls in 2025. (Refinitiv, ABC News)\n\nShe does, however, expect companies like NextDC and Goodman Group, both AI data centre owners, to earn strong profits next year, which will support their share price.\n\nWhat to expect next year\n\nMs Liu expects \"resources [stocks] should continue to do well, led by copper and gold prices\".\n\n\"Airlines should do better because oil prices are reasonably low and some of the 'oversold' tech companies could make a comeback,\" Ms Liu said.\n\nPenguin permacrisis as economic norms go in Trump’s shredder This year saw economies survive tariff shocks and markets burst through record highs, but it doesn't feel like a party because so many people aren't invited.\n\n\"I think the share market will do OK next year and should deliver a return between 8 and 10 per cent. That's pretty much an average year.\"\n\n\"We expect there'll still be volatility because we still haven't got the final outcome for the China and US tariffs. All we've got from both sides is just a framework.\"\n\nAlthough Mr Trump's unpredictability had a significant impact on markets this year, Ms Dale believes he will have far less influence in 2026.\n\n\"The markets don't believe him anymore,\" she said.\n\n\"They believe that everything he does is a negotiating tactic, so it's no longer credible. So he can make these big dramatic announcements and they won't be market-moving anymore.\"\n\n\"And I think that's a really interesting outcome because people trust that he will back down. Trump has flooded the airwaves to the point where the market is just a little bit more relaxed.\n\n\"At this point, 2026 looks like it could be a solid, boring kind of year with the major sectors holding up OK, but not sensational levels of growth.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-31/qld-mechanic-shortages/106146022",
        "title": "Desperate for workers, some mechanics are looking overseas",
        "publish_date": "Tue, 30 Dec 2025 19:44:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than half of Queensland's automotive repair businesses say they are struggling to find skilled staff, with some advertising for more than six months without success.\n\nA new report on the state of the industry has found attracting and keeping skilled workers is its biggest challenge, despite consistent growth in demand.\n\nThe industry-commissioned Capricorn report surveyed 989 business owners around the country as part of its annual state of the nation release.\n\nScott Wilmington and his brother have operated their own garage in Morayfield, north of Brisbane, for more than 20 years.\n\nHe said he was not surprised by the statistics.\n\n\"We're constantly looking,\" he said.\n\nMechanic Scott Wilmington says it is difficult to find qualified workers. (ABC News: Stephen Clarke)\n\n\"We had an ad for a couple of years and would have had 200 applications.\n\n\"Out of them, there were probably only a handful that we would possibly interview.\"\n\nMr Wilmington said the vast majority of applicants did not have the skills needed to suit a busy workshop.\n\n\"They say, 'look, I've worked on my car at home a little bit and I know my way around a car,' or some of them are plumbers wanting to change [fields],\" he said.\n\n\" We're too busy to have someone that's not qualified. \"\n\nChief executive of the Motor Trades Association of Queensland, Rod Camm said labour and skill shortages were the \"number one issue\" for the industry.\n\nThat is despite a post-pandemic boost in demand for mechanic services, with a 13 per cent increase in the number of registered motor vehicles on Queensland roads between 2020 and 2024, according to the Queensland government's latest State of the Environment report.\n\nSome mechanics say they have been advertising for more than six months without finding a skilled worker. (ABC News: Luke Bowden)\n\n\"During COVID when no one could travel, everyone pivoted and started investing in their vehicles, making sure they were maintained, so our industry's still really, really busy,\" Mr Camm said.\n\nThe latest data from the state Department of Trade, Employment and Training showed 1,825 people completed their automotive apprenticeships in 2023-24.\n\nMr Camm said the challenge of attracting young people to take up a career in the automotive industry was \"multi-layered\".\n\n\"Schoolkids often nowadays don't have parents working on cars in the backyard, so they don't have a modern perspective of what an automotive career would look like,\" he explained.\n\nAutomotive industry warn of skills crisis Lack of workers and apprentices, long waits for parts and an increasingly complex market are driving waiting times for car repairs through the roof.\n\nHe said the base rate of pay in the industry could also turn young people away.\n\n\"My message to them ... is that is not what you will earn in the industry,\" he said.\n\n\"As you become productive and develop your skill set, you can earn really, really good money.\"\n\nSome businesses turning overseas\n\nSome business owners have been willing to pay more than $20,000 to bring in skilled mechanics from overseas.\n\nThe Philippines has proven particularly popular, due to widespread English-speaking skills.\n\nMr Wilmington said he turned to recruiting overseas workers \"out of desperation\".\n\n\" I think we had no choice. We really were running out of options and we needed a mechanic. \"\n\nBonie Fernandez spent almost 20 years working as a mechanic in Saudi Arabia, sending money back to his family in the Philippines.\n\nBonie Fernandez works as a mechanic in Brisbane while his family live in the Philippines. (ABC News: Stephen Clarke)\n\nMr Wilmington hired him last year through an online agency based in Western Australia.\n\nMr Fernandez said the work was \"much more enjoyable\" than some of his previous jobs, including working in Saudi Arabia where he said there was a lot of \"pressure\".\n\nHe now hopes to become a permanent resident and bring his family to Australia to live with him.\n\n'Hard to keep up'\n\nThe lack of workers was affecting both customers and business owners, according to Mr Camm.\n\n\"Customers can expect to have some delays to get their vehicles repaired,\" he said.\n\n\"And for businesses, they struggle with workloads.\"\n\nThe report showed 33 per cent of Queensland automotive businesses are turning away work due to being understaffed — compared to 27 per cent nationwide.\n\nAbout one third of automotive repair stores say they've had to turn away work due to not having enough staff. (ABC News: Luke Bowden)\n\nMr Wilmington agreed it could be \"really hard\" to keep up with demand, particularly because his business had a large customer base.\n\n\"You've got to do the job so you get busier ... you've [got to do that balancing act] where you don't get yourself too snowed under but you meet everyone's needs,\" he explained.\n\nMr Camm said a recent federal government decision to slash incentives to take on apprentices from $5,000 to $2,500 from January 1 next year was putting the industry's future at risk.\n\n\"I just can't believe the government would walk away from an industry,\" he said.\n\n\" It's been a very disappointing decision. \"\n\nIn a statement, the federal Minister for Skills and Training Andrew Giles said the government was \"backing Australians to get the skills they want for the jobs we need\".\n\n\"We're ensuring incentives are geared towards the skills we most need, and complemented by measures to ensure apprentices have access to additional supports like study loans and living away from home allowance.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/thornbury-residents-devise-their-own-housing-plan-as-alternative-to-activity-centre-20251222-p5npit.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Thornbury residents devise their own housing plan as alternative to activity centre",
        "publish_date": "Wed, 31 Dec 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Lachlan Abbott"
        ],
        "text": "Thornbury residents are taking housing plans into their own hands, designing an alternative to the Allan government’s activity centre designs for the area.\n\nFair Growth Thornbury say they support increased density if it’s done right, and believe their proposal better maintains the suburb’s character and amenity.\n\nJames Patto and Sarah Downes from Fair Growth Thornbury have proposed a different way to rezone part of Melbourne’s inner north. Credit: Joe Armao\n\nJames Patto and Sarah Downes founded the group in September after reviewing the state government’s rezoning plans and believing they were excessive.\n\nThe young couple argue their approach is different and more constructive than other housing reform opponents, like those in Brighton – with whom the premier has sparred – because they have crafted high-density options for along St Georges Road and High Street.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/sailing/sydney-to-hobart-drama-as-french-crew-penalised-after-breaking-rules-20251231-p5nqux.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney to Hobart drama as French crew penalised after breaking rules",
        "publish_date": "Wed, 31 Dec 2025 12:52:20 +1100",
        "category": "sports",
        "authors": [
            "Frances Howe"
        ],
        "text": "The overall winner of the Sydney to Hobart race is Min River after a protest was launched against the leader of the overall standings, BNC - my:: NET / Leon, for breaking race rules.\n\nMin River, sailed by Jiang Lin and Alexis Loison, is the first double-handed yacht, and Lin is the first female-skipper, to win the overall race.\n\nOwner and skipper of Min River, Jiang Lin. Credit: Wolter Peeters\n\n“I can’t believe it,” Lin said, one of 14 female owners or skippers in the 129 entries this year, said on Wednesday morning. “It will encourage more women I hope... Look at me, if I can do it surely you can.”\n\nBNC - my:: NET / Leon arrived at Constitution Dock on Tuesday afternoon as the overall race leader and first in the double-handed division. The French crew – Michael Quintin and Yann Rigal – were greeted with champagne and met by the Cruising Yacht Club of Australia commodore Sam Haynes, who also happens to be the reigning overall race winner from 2024.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/adam-liaw-s-50-greatest-barbecue-recipes-of-all-time-20251229-p5nqko.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s 50 greatest barbecue recipes of all time",
        "publish_date": "Wed, 31 Dec 2025 12:32:49 +1100",
        "category": "finance",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Recipe collection\n\nAdam Liaw’s 50 greatest barbecue recipes of all time\n\nMaster the flame with Adam Liaw’s definitive barbecue toolkit. From the easiest-ever burger to zesty salads, here are 50 recipes to elevate your grilling game.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/sam-kerr-is-getting-married-today-here-s-everything-we-know-about-the-wedding-20251231-p5nquo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sam Kerr is getting married today. Here’s everything we know about the wedding",
        "publish_date": "Wed, 31 Dec 2025 11:59:46 +1100",
        "category": "lifestyle",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Wedding bells are chiming for Matildas superstar Sam Kerr, as she prepares to tie the knot with American soccer player Kristie Mewis just in time for the New Year.\n\nAfter a two and a half year engagement, during which they welcomed their first child Jagger Mewis-Kerr, the couple will finally wed in a ceremony Down Under. Though exact details around the wedding remain under wraps, Mewis – a former West Ham United player – recently shared a few hints on a podcast, including where they’re getting hitched, the guest list, and the role their baby boy will play in the ceremony.\n\nProfessional soccer players Sam Kerr and Kristie Mewis will finally tie the knot this New Year’s Eve. Credit: PA Images via Getty Images\n\nSo, here’s everything we know so far about what some have dubbed the “Australian royal wedding”.\n\nWhere and when will the wedding take place?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-for-flat-morning-trade-as-2025-winds-down-20251231-p5nqt1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX edges higher in morning trade as 2025 winds down",
        "publish_date": "Wed, 31 Dec 2025 11:52:27 +1100",
        "category": "finance",
        "authors": [
            "Damian J. Troise"
        ],
        "text": "The Australian sharemarket started the last day of the year on a muted note after US stocks wavered in light trading, with investors assessing minutes of the Federal Reserve’s December meeting as 2025 nudges to the finish line.\n\nThe S&P/ASX 200 edged down 4.8 points to 8712.30 as of 10.50am AEDT, with five of its 11 industry sectors down, although none of them dropped by more than 0.2 per cent. The lacklustre morning followed two days of modest declines in light holiday trading. The Australian dollar was trading at US66.95¢ as of 9.29am AEDT.\n\nThe S&P/ASX 200 is on track for a 6.2 per cent gain for the year – its worst since a loss in 2022, and far below the performance of the stock markets of most other developed countries. Global stocks are poised for their biggest annual gain in six years, supported by Federal Reserve interest-rate cuts and a surge in enthusiasm for artificial intelligence companies.\n\nWall Street had a relatively quiet session as the year came to a close. Credit: Bloomberg\n\nThe MSCI All Country World Index – one of the broadest measures of the global equity market – has gained 21 per cent this year, with just one trading day of 2025 remaining for the benchmark. Wall Street’s S&P500 index has gained more than 17 per cent, while similar indices for Britain, Japan, Germany, Canada and Hong Kong were on track for gains of more than 20 per cent. Among the few markets the ASX 200 is set to outperform is New Zealand’s, where the NZ50 was up 3.7 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/australian-performer-dumped-from-k-pop-girl-group-20251231-p5nquq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian performer dumped from K-pop girl group",
        "publish_date": "Wed, 31 Dec 2025 11:44:30 +1100",
        "category": "finance",
        "authors": [
            "Jin Yu Young"
        ],
        "text": "The K-pop band NewJeans plunged deeper into turmoil this week after its management label said it had dropped one member of the five-person girl group, one of the genre’s most influential acts in recent years.\n\nThe announcement on Monday by the group’s label, Ador, that it was terminating the contract of Danielle Marsh, who performs as Danielle, is the latest flashpoint in a more than yearlong legal battle between the label and the band.\n\n(From left) Hyein, Haerin, Hanni, Danielle and Minji of girl group NewJeans at Seoul Fashion Week in September. Credit: Getty Images\n\nThe label did not provide a reason for dropping Danielle, an Australian performer born in Newcastle. It said that three NewJeans members — Haerin, Hyein and Hanni — would continue working while it continued “discussions” with Minji, a fourth member.\n\nNeither Danielle nor Minji responded immediately to requests for comment on Tuesday. It is unclear when or whether NewJeans will record music or perform as a group again.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/the-epstein-files-what-we-know-so-far-20251231-p5nqxg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Epstein files: What we know so far",
        "publish_date": "Wed, 31 Dec 2025 11:33:55 +1100",
        "category": "finance",
        "authors": [],
        "text": "The Epstein files: What we know so far\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw19-west-ham-vs-brighton-20251231-p5nqxb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW19: West Ham vs Brighton",
        "publish_date": "Wed, 31 Dec 2025 11:26:15 +1100",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW19: West Ham vs Brighton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw19-nottm-forest-vs-everton-20251231-p5nqx9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW19: Nott'm Forest vs Everton",
        "publish_date": "Wed, 31 Dec 2025 11:23:36 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW19: Nott'm Forest vs Everton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/traveller/inspiration/the-best-places-to-stay-in-byron-bay-20231228-p5etzq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The best places to stay in Byron Bay",
        "publish_date": "Wed, 31 Dec 2025 11:21:19 +1100",
        "category": "finance",
        "authors": [
            "Katherine Scott",
            "Angela Saurine",
            "Sheriden Rhodes"
        ],
        "text": "Advertisement\n\nThis article is part of Traveller’s comprehensive Byron Bay Destination Guide. See all stories .\n\nThe odd sandy-floored hostel remains, but a new crop of accommodation has taken root in the Byron region, ones that prioritise wellness, luxury, sustainable design, and a deep connection to the coast and hinterland. Amaroo Bangalow Cabins are designed by architecture firm Shaun Lockyer in Brisbane. Timothy Birch Perfect for: Couples or large groups who want to feel secluded without straying too far\n\nBefore Amaroo Bangalow landed on luxury-seekers’ radars it was built as a family retreat, a fact that’s charmingly evident in the details. Down a gated driveway, cresting the ridgeline of a 240-acre black Angus cattle and macadamia farm, all four lodges back onto a patch of sloping rainforest. Supremely modern and cosy, each boasts a distinct style, studded with beautiful personal touches that aren’t always a given in holiday rental territory, and perks like heated towels racks, Mukti amenities and in-room fireplaces. You can book a single cabin for two, or the entire property – remarkably, either way, you still enjoy exclusive use of the central communal pavilion, with its expansive kitchen and facilities – our favourites being the heated pool and wood-fire oven. It feels gloriously secluded, despite being mere minutes’ drive from the terrific restaurants of Bangalow village and The Hut at Possum Creek.\n\nFrom $850 a night per cabin, which includes exclusive use of the property. 47A Cedarvale Rd, Bangalow NSW. Phone: +61494 080 588. See amaroobangalow.com The Bower Byron Bay\n\nAdvertisement\n\nThe Bower Barn. Perfect for: Stylish road trippers who want to dip a toe in the Byron scene\n\nThe former 1970s motel was first reimagined as a luxury hotel in 2017 – the original designer and co-owner, Taliah Lowry, laced Byron’s beachy essence with a touch of New York grit, inspired by the US city’s industrial-cool Bowery neighbourhood. A recent two-year upgrade has once again restored its sheen and grown its footprint, with new additions including a guest lounge, hotel bar, new reception space, an onsite spa treatment centre and four beautiful new suites. There’s no onsite restaurant, though the pool area is serviced by a licensed bar offering canned cocktails, drinks and bar snacks – thankfully, it’s a short stroll from fantastic dining, including hatted Bar Heather.\n\nFrom $320 a night; $620 for a Bower Studio. Two Junior King Accessible rooms. 28 Bangalow Rd, Byron Bay. Phone: (02) 6680 9577. See thebowerbyronbay.com.au\n\nRead our full review here\n\nBasq House, Byron Bay Bask central at Basq House. Perfect for: Design buffs who appreciate homely comforts\n\nIt feels like you’re staying with a friend with exceptional taste at the central, 32-room, boho-inspired hotel. Melbourne-based owners and good friends Matt Walsh and Shane Wilkinson wanted Basq House to feel like a home away from home. Taking its cues from a traditional riad, the house-style sanctuary is orientated around a central magnesium pool hemmed by cabanas, overhanging palms and pastel-pink umbrellas. There are six room types in a mix of formats, all stylishly minimalist with custom, honey-hued timber joinery. Take a complimentary Lekker bike out for a spin or catch a wave at The Pass on Basq’s candy-coloured boards. On your return, order a coconut margarita and partake in poolside reverie until dinner beckons. Two dedicated share vehicles can be hired for coastal or hinterland jaunts.\n\nFrom $395 a night (secure parking $20 a night). 4 Fletcher Lane, Byron Bay. Phone: (02) 5671 1000. See basqhouse.com.au\n\nRead our full review here\n\nAdvertisement\n\nElements of Byron A sprawling resort with appeal across demographics. Perfect for: Environmentally conscious couples, families, girls’ getaways\n\nInspired by the elements of nature, this luxury resort blends effortlessly into native bushland a few kilometres north of town. The curved roof of the main pavilion was designed to reflect the windswept sand dunes on neighbouring Belongil Beach, and there’s a communal fire pit beside the large, lagoon-style pool. With everything from a nature playground and fairy trail to a stylish spa and an adults-only pool with a swim-up bar hidden among the high-tech, eco-friendly villas, the property appeals across demographics. Dine at Azure Bar and Grill, pop across the road to North Byron Hotel, or catch the solar train into Byron from North Beach Station.\n\nFrom $515 a night. 144 Bayshore Dr, Byron Bay. Phone: (02) 6639 1500. See elementsofbyron.com.au Raes on Wategos Sleep to the soundtrack of the ocean.\n\nAdvertisement\n\nPerfect for: Special occasions, romantic escapes\n\nFall asleep to the sound of waves crashing against the shore at this chic, Moroccan-inspired hotel overlooking Wategos Beach. With features such as enormous daybeds and deep marble baths, the seven suites, which each have their own unique character, are so beautiful you won’t want to leave. If you do make it out, you can borrow an 88 surfboard and hit the waves, dine at the acclaimed Raes Dining Room downstairs or watch the sunset from the Cellar Bar terrace. A complimentary chauffeur service is also available.\n\nFrom $950 a night. 6-8 Marine Parade, Byron Bay. Phone: (02) 6685 5366. See raes.com.au Gaia Retreat and Spa A Komala Luxe Villa. Perfect for: Solo travellers looking to rest and reset, couples, special celebrations\n\nRestore your inner calm with a stay in a high-tech villa at this hinterland wellness retreat co-founded by much-loved Aussie Olivia Newton-John in 2005. It’s easy to fill your days at Gaia – which means ‘spirit of Mother Earth’ – indulging in rejuvenating massages and facials from the on-site spa, and partaking in everything from yoga and Pilates to reiki, Qigong and sound healing ceremonies. At night, guests converge in the Samoan longhouse-style Kukura House to dine on innovative healthy cuisine, incorporating vegetables grown in the kitchen garden and fish from the aquaponics pond, and sip sustainably and ethically sourced or organic wine.\n\nFrom $1875 a night (two-night minimum stay). 933 Fernleigh Rd, Brooklet. Phone: (02) 6687 1216. See gaiaretreat.com.au 28 Degrees\n\nAdvertisement\n\nOne of the rooms with a private plunge pool at 28 Degrees Byron Bay. Jessie Prince Perfect for: Wellness lovers, solo travellers, couples\n\nThis luxury guesthouse in Byron Bay offers barefoot luxury at its finest. Designed by interior stylist and owner Deb Garske – who created the space while recovering from Hodgkin lymphoma – the toxin-free retreat blends sustainability with style. There are 12 thoughtfully curated rooms (five with private plunge pools), accommodating up to 24 guests, with features such as antique claw-foot baths, Iranian tiles, handmade ceramics and local beeswax candles. A favourite of Baz Luhrmann, who stayed in Room 3 while writing Elvis, 28 Degrees is an elegant, TV-free sanctuary just steps from Byron’s vibrant shops and restaurants.\n\nFrom $520 per night. 12 Marvell St, Byron Bay. Phone: (02) 6685 7775. See 28byronbay.com.au\n\nRead our full review here The Brooklet Cool off in the 25-metre mineral pool. Abbie Melle Perfect for: Kid-free breaks, solo travellers, significant birthday celebrations\n\nLie back in your freestanding bath and watch the clouds float across the rolling green hills from one of six contemporary brick villas at this adults-only hinterland hideaway, set on a 50-hectare macadamia and stone fruit farm next door to Gaia. Housed in the former tractor shed overlooking the mineral pool, the bar is the perfect place to enjoy a long lunch prepared in the outdoor kitchen with loved ones. The thoughtfully designed villas feature handmade ceramic tiles in the bathroom, SMEG appliances and gas fireplaces. There’s also a Japanese-style cedar hot tub, sauna, gym and tennis court, and a three-bedroom residence, The Bails, for larger groups.\n\nFrom $750 a night. 841 Fernleigh Rd, Brooklet. Phone: 0413 120 409. See thebrooklet.com.au\n\nAdvertisement\n\nHotel Marvell Bohemian luxe, or just luxe? The rooftop pool at Hotel Marvell. Perfect for: Influencers, business travellers\n\nTake in views over town to the misty mountains beyond from the rooftop pool at Hotel Marvell, in the centre of Byron Bay. No expense was spared when it came to building the architecturally designed five-star hotel, which opened in 2023. There are 16 hotel rooms with smart TVs, Nespresso coffee machines and blackout blinds spread across three levels, plus six suites and two two-bedroom rooms. The buzzing rooftop bar is the place to start the night, before heading downstairs to its in-house restaurant, the Oyster Bar & Seafood Restaurant.\n\nFrom $600 a night. 4 Marvell Street, Byron Bay. Phone: (02) 6685 7385. See hotelmarvell.com.au Beach Suites Byron Bay Beachfront digs, complete with private plunge pool.\n\nAdvertisement\n\nPerfect for: Surfers, families, couples\n\nA beach pad with your own private plunge pool? Yes, please! Open the gate from your Beachfront Studio and wander down the road to the Beach Hotel or splash out on a two- or three-bedroom Penthouse Suite to make the most of the views across the ocean towards the rocky outcrop Julian Rocks, Nguthungulli Nature Reserve. The upmarket accommodation features marble bathrooms with spa baths (with bonus miniature rubber duckies), beachy paintings by local artists on the walls and sprinklings of coral. There’s also secure undercover parking, and you can borrow bikes or e-bikes to get out and about.\n\nFrom $395 a night. 20 Bay St, Byron Bay. Phone: (02) 6680 9944. See beachsuites.com.au Crystalbrook Byron Luxe facilities on 45 acres of subtropical rainforest. Perfect for: Rejuvenating tropical escapes\n\nCollect a bamboo room key from reception and meander along a timber boardwalk through the rainforest to your suite at Crystalbrook Byron. Previously known as the Byron at Byron, the 42-hectare property underwent a major refurbishment after being taken over in 2020 by sustainably focused hotel group Crystalbrook Collection, which also has offerings in Sydney, Newcastle, Brisbane and Cairns. The plastic-free resort has 92 suites fitted with timber louvre windows, rattan lampshades and tropical print cushions. As well as access to Tallows Beach, just south of Byron Bay, there’s a heated pool, sauna, day spa and a tranquil on-site restaurant, Forest, with a menu showcasing native ingredients.\n\nFrom $455 a night. 77/97 Broken Head Rd, Byron Bay. Phone: (02) 6639 2000. See crystalbrookcollection.com/byron The Chalet Motel\n\nAdvertisement\n\nA refurbished 1950s motel that’s oh-so Byron. Perfect for: Budget-conscious nostalgics\n\nEmbrace the retro vibe with a stay at this roadside motel in the seaside town of Brunswick Heads, around 15 minutes’ drive north of Byron. Originally opened in 1954, it has 12 refurbished rooms with quirky features like brass pineapple wall hooks, and vintage appliances. Guests are greeted with a pink neon sign with the words Simple Pleasures behind the bamboo reception desk. Photos capturing the local lifestyle adorn the walls, and there’s a pool and undercover barbecue area.\n\nFrom $165 a night. 68 Tweed St, Brunswick Heads. Phone: (02) 6685 1257. See chaletmotel.com.au Reflections Holidays Byron Bay Direct beach access from the premium ocean villa. Perfect for: Families, grey nomads\n\nWith a track leading straight down to Clarkes Beach, which has a tidal pool ideal for littlies, Reflections Holidays Byron Bay is as good as it gets for beach-loving families. The park caters to a wide cross-section of budgets and styles, with powered and unpowered campsites through to tiny houses, cabins and contemporary villas with outdoor kitchens on the deck. There’s a playground and barbecue facilities, with mobile businesses like Kombi Keg and Byron Homemade Pizza popping up during school holidays, when activities such as tie-dyeing, bead making and pottery workshops are also on offer.\n\nFrom $51 a night for unpowered campsites; $218 for cabins. 1 Lighthouse Rd, Byron Bay. Phone: (02) 6685 6496. See reflectionsholidays.com.au\n\nSign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now.\n\nTraveller Guides",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw19-chelsea-vs-bournemouth-20251231-p5nqx1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW19: Chelsea vs Bournemouth",
        "publish_date": "Wed, 31 Dec 2025 11:14:49 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW19: Chelsea vs Bournemouth\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/australian-cricket-great-damien-martyn-hospitalised-20251231-p5nqtq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gilchrist provides update on Damien Martyn after cricket great placed in induced coma",
        "publish_date": "Wed, 31 Dec 2025 10:52:14 +1100",
        "category": "sports",
        "authors": [
            "Tom Decent",
            "Dan Walsh"
        ],
        "text": "Former Australian cricketer Damien Martyn is in an induced coma in a Queensland hospital after being diagnosed with meningitis.\n\nThe 54-year-old, who played 67 Tests for Australia between 1992 and 2006, was admitted last week after falling ill.\n\nChampion wicketkeeper and former Test and WA teammate Adam Gilchrist confirmed Martyn’s hospitalisation on behalf of him and his family.\n\nCricket sources, speaking on the condition of anonymity due to the sensitivity of the situation said Martyn is receiving treatment for meningitis, an inflammation of the protective membranes surrounding the brain and spinal cord. The infection can lead to swelling of the brain.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-cricket-great-damien-martyn-in-induced-coma/bflfl21zo",
        "title": "'Get well Marto': Cricket world gets behind Damien Martyn after sudden hospitalisation",
        "publish_date": "Wed, 31 Dec 2025 01:31:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's cricket community is rallying around Damien Martyn after the Test great was hospitalised suddenly in Brisbane.\n\n\n\n\n\nThe 54-year-old former right-hand batter has fallen ill in recent days, reportedly being placed in an induced coma amid a battle with meningitis — an inflammation of the membranes surrounding the brain and spinal cord that can be fatal.\n\n\n\n\n\nAdam Gilchrist confirmed his former Test and Western Australia teammate's hospitalisation in a statement on behalf of the Martyn family.\n\n\n\n\n\n\"He is getting the best of treatment and (Martyn's partner) Amanda and his family know that a lot of people are sending their prayers and best wishes,\" Gilchrist said.\n\n\n\n\n\nCricket Australia chief executive Todd Greenberg wished Martyn a quick recovery on behalf of the organisation\n\n\n\n\n\n\"I'm saddened to hear of Damien's illness. The best wishes of everyone at CA and in the wider cricket community are with him at this time,\" said Greenberg.\n\n\n\nDamien Martyn was part of Australia's squad that won the 2003 World Cup. Source: AAP / Dave Hunt Former Test teammate Darren Lehmann and veteran sports broadcaster Jim Wilson were among others to send Martyn their best on social media.\n\n\n\n\n\nSpeaking on 6PR radio, former Test bowler Rodney Hogg called Martyn's hospitalisation \"shocking news\".\n\n\n\n\n\n\"We wish him all the best,\" Hogg said.\n\n\n\nMartyn's seemingly effortless stroke play was his calling card as a player, averaging 46.37 with the bat across 67 Tests for Australia.\n\n\n\n\n\nBorn in Darwin, Martyn earned a Test debut at 21, replacing the late Dean Jones in the 1992-93 home series against West Indies and was Western Australia's captain at 23.\n\n\n\n\n\nHe was player of the series the last time Australia won an away series in India, top scoring in four of Australia's eight innings at the crease in the 2004 Border-Gavaskar Trophy battle.\n\n\n\n\n\nHis Test high score of 165 came against New Zealand in 2005, one of 13 Test centuries Martyn made in the baggy green.\n\n\n\nMartyn retired from Test cricket midway through the 2006-07 Ashes series, playing his final match at the Adelaide Oval that summer.\n\n\n\n\n\nMartyn also played 208 ODIs, averaging 40.8 and scoring an unbeaten 88 runs as Australia defeated India in the final of the 2003 World Cup.\n\n\n\n\n\nHe dabbled in commentary in retirement but has mostly kept out of the limelight in recent years.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/kpop-newjeans-danielle-marsh-sued-damage-ador/wq0dd18fz",
        "title": "Why this Australian K-pop star is being sued for $44 million in South Korea",
        "publish_date": "Wed, 31 Dec 2025 01:26:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian singer Danielle Marsh, a member of the Korean pop (K-pop) group NewJeans, is facing a lawsuit exceeding $44 million from a South Korean record company owned by the K-pop giant that produces BTS.\n\n\n\n\n\nMarsh, 20, was born in NSW to an Australian father and a South Korean mother. She rose to global prominence in 2022 following the debut of NewJeans, a five-member group whose members were aged between 14 and 18 at the time.\n\n\n\n\n\nNewJeans was created and produced by ADOR, a subsidiary of HYBE Entertainment. HYBE, one of the world's largest K-pop companies, is estimated to have recorded cumulative revenue of approximately $2.075 billion up to the third quarter of 2025.\n\n\n\n\n\nIn 2023, five NewJeans songs topped the Billboard Hot 100 chart, cementing the group's rapid rise globally.\n\n\n\n\n\nLast year, ADOR filed a lawsuit against NewJeans after the group accused the label of \"mistreatment\" and announced plans to leave the agency.\n\n\n\n\n\nIn October, a South Korean court found no grounds for termination and ruled the group must continue under their contract with ADOR until 2029.\n\n\n\nFollowing the ruling, South Korean media reported all five members were expected to return to the agency. However, an announcement from ADOR on Monday has shocked K-pop fans worldwide.\n\n\n\n\n\nIn a statement, ADOR said that while it had been engaging with the remaining four members — including another Australian member, Hanni Pham — the agency had decided to terminate its contracts with Marsh.\n\n\n\n\n\nThe company said it also intended to \"pursue legal accountability against one member of Danielle's family\" as well as ADOR's former CEO, Min Hee-Jin, who the BBC described as the \"mentor\" of the group.\n\n\n\n\n\nThe agency said Marsh's family member and Min \"bear significant responsibility for causing this dispute and for the delays in NewJeans' departure and return\".\n\n\n\nSouth Korean news outlet The Chosun Daily reported on Monday that ADOR had filed a claim with the Seoul District Court for more than $44 million in damages against Marsh, Marsh's family member, and Min.\n\n\n\nAustralian singer gave testimony over alleged workplace bullying\n\nBeyond its multi-billion-dollar revenues and global soft-power reach, the K-pop industry is widely known for exerting strict control over artists through long-term contracts with detailed and often rigid conditions.\n\n\n\n\n\nThe legal dispute between NewJeans and ADOR has sent shockwaves through South Korea's music industry, drawing widespread attention from international fans.\n\n\n\n\n\nSome have expressed sympathy for NewJeans over allegations of bullying and harassment allegedly directed or condoned by the company.\n\n\n\n\n\nFans of Pham — the Vietnamese-Australian member of the group — submitted a petition to the South Korean government calling for an investigation into the alleged workplace bullying she and the group faced.\n\n\n\n\n\nIn October 2024, Pham delivered a tearful testimony before South Korea's parliament over the allegations.\n\n\n\n\n\n\"I know it's not going to solve all the problems in the world, but if we just respect each other, at least there will be no problems with bullying and harassment in the workplace,\" Reuters quoted Pham telling South Korean leaders.\n\n\n\nOne month later, South Korea's employment ministry dismissed NewJeans' workplace bullying complaint, stating that under the country's Labour Standards Act, Pham was not legally classified as an \"employee\" of ADOR.\n\n\n\n\n\nThe decision prompted several leaders to propose new legislation — now dubbed \"Hanni's Act\" — aimed at extending protections against workplace bullying and harassment to artists.\n\n\n\n\n\nPham also faced the possibility of deportation after her long-term employer-sponsored work visa was set to expire in early 2025 amid the ongoing legal dispute. Her parents confirmed in February that she had secured a new visa.\n\n\n\n\n\nThat same month, The Chosun Daily reported that five of South Korea's major industrial bodies issued a joint statement criticising NewJeans for \"resolving private disputes through media campaigns and unilateral public statements rather than proper negotiations or legal procedures\".\n\n\n\n\n\nWhile the organisations said they did not oppose government regulation, they argued that contract disputes between agencies and artists should be addressed through industry self-regulation.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/your-guide-to-the-major-2026-changes/zd5258wvu",
        "title": "Tax, super, childcare, medicines and more: Your cheat sheet to big changes in 2026",
        "publish_date": "Tue, 30 Dec 2025 18:35:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "As the calendar turns to 2026, Australia is gearing up for a year of significant change — and not just the usual flurry of resolutions, gym sign-ups, or attempts to learn a new language.\n\n\n\n\n\nThis time, the shifts will reach far beyond personal goals, shaping household budgets, workplaces and even the country's infrastructure.\n\n\n\n\n\nFrom tax relief and payday super to the launch of a national Centre for Disease Control, a suite of reforms is set to roll out — some of which may have slipped under the radar.\n\n\n\n\n\nHere's a look at what Australia 2026 has in store.\n\n\n\nTax relief in 2026\n\nIf you're earning more than $18,200 a year, expect a small but welcome boost to your pay packet in 2026. From 1 July, the lowest 16 per cent personal income tax rate will drop to 15 per cent.\n\n\n\n\n\nThe government says the change will give Australians up to $268 extra each year, increasing to as much as $536 from 2027.\n\n\n\n\"[That will be] how many coffees a year?\" Jenny Wong, the tax lead of Certified Practising Accountant Australia, an accounting body, told SBS News.\n\n\n\n\n\n\"It's not a lot, but I guess it's better than nothing.\"\n\n\n\n\n\nShe said personal tax cuts are always of interest to people, \"even though it's only 1 per cent\".\n\n\n\nSmall business support\n\nIn April, the government announced it would extend the $20,000 instant asset write-off by a further 12 months, until 30 June 2026, to support small businesses. The law was passed in the Senate in November.\n\n\n\n\n\nUnder this plan, eligible businesses can claim an immediate deduction for the business-related part of an asset's cost in the year it is initially used or installed.\n\n\n\n\n\nUp to 4.1 million small businesses with an annual turnover of less than $10 million will benefit from this support, according to the government.\n\n\n\n\n\nWong believes this is the \"biggest\" tax change for Australians in 2026.\n\n\n\n\n\n\"These measures are essentially designed to help small businesses invest in new assets,\" she said.\n\n\n\nIn other changes, specific holiday homes may be considered 'leisure facilities' by the Australian Taxation Office (ATO) from July 2026, meaning owners may not be able to claim deductions for maintenance unless the place is mainly rented out to generate income.\n\n\n\n\n\nAlso, from next year, the ATO general interest charge (GIC), a fee added to overdue tax debts each day, will no longer be deductible.\n\n\n\n\n\nATO assistant commissioner Anita Challen said the change will mean it will cost more to carry a tax debt.\n\n\n\n\n\n\"While taxpayers won't feel this change until next tax time, ATO general interest charge is currently charged at 11.17 per cent and compounds daily, making it so important to get on top of your tax obligations,\" she said in a statement.\n\n\n\nMillions to 'benefit' from superannuation changes\n\n2026 will be the year \"millions of Australians will benefit strongly from some key changes\" in superannuation laws, according to the Super Members Council CEO, Misha Schubert.\n\n\n\n\n\nFirstly, from July, the payday super laws will come into effect, meaning workers will receive their superannuation on payday.\n\n\n\nBased on current legislation, superannuation payments must be made at least four times a year, on or before the quarterly superannuation due dates.\n\n\n\n\n\n\"The payday super will be the biggest single change across the super landscape in 2026. It will be a really momentous day, from 1 July when those laws come into effect,\" Schubert told SBS News.\n\n\n\nSuper for those on parental leave\n\nFrom July, those on paid parental leave will also receive superannuation.\n\n\n\n\n\nThe ATO will automatically pay this contribution directly to the employee's super fund after the end of the relevant financial year, starting from July 2026.\n\n\n\n\n\nThe government has also announced a 30 per cent tax rate on earnings from super balances between $3 million and $10 million. And a 40 per cent tax for balances over $40 million.\n\n\n\nCheaper medicines\n\nFrom the moment the clock passes midnight, and we enter 2026, the most a patient needs to pay for the medicine listed on the Pharmaceutical Benefits Scheme (PBS) will drop from $31.60 to $25.\n\n\n\n\n\nPensioners and concession cardholders will continue to pay only $7.70 for their prescriptions until at least 2030.\n\n\n\n\n\nThe move was announced by Labor during the May election campaign and will save Australians $200 million per year through the new cap on the scheme.\n\n\n\nThree days of subsidised child care a week\n\nIf your family is eligible for Child Care Subsidy (CCS), from 5 January, you will have access to three days of guaranteed subsidised childcare per week.\n\n\n\n\n\nThe changes will remove the current activity test to guarantee subsidies for families earning up to $530,000.\n\n\n\nThe test requires parents to be employed or engaged in approved activities to qualify for CCS, with government support levels determined by the number of hours spent in these activities.\n\n\n\n\n\nFamilies that earn more than $533,280 will remain ineligible for subsidised childcare.\n\n\n\nChanges to social security payments\n\nAustralians receiving Youth Allowance, Austudy, ABSTUDY, Youth Disability Support Pension, and Carer Allowance will receive more money under the new changes to social security payments.\n\n\n\n\n\nThe maximum Youth Allowance for a single Australian with no dependents will rise to $684.20 from $663.30 in 2026.\n\n\n\n\n\nIncome thresholds for student payments will also rise, as will the parental income test threshold for the Youth Allowance and ABSTUDY.\n\n\n\n\n\nThe Carer Allowance for about 680,000 people will also rise by $2.9 per fortnight to $162.20.\n\n\n\n\n\nAccording to Social Services Minister Tanya Plibersek, these changes mean \"more than one million Aussies balancing study or caring responsibilities will receive a boost to their payments\".\n\n\n\nEnergy rebates to 'dry up'\n\nNot all the changes in 2026 will save Australians more money.\n\n\n\n\n\nTreasurer Jim Chalmers has ruled out another round of Energy rebates for 2026, which saved households $300 in the 2024 budget and $150 in the second half of 2025.\n\n\n\n\n\nSally Tindall, data insights director at financial comparison site Canstar, warns Australians might experience a \"bill shock\" in their energy bills next year, as the federal government rebates will \"dry up\".\n\n\n\n\n\n\"The last instalment from the federal government for the majority of houses landed in their accounts in October. Now the majority of people are on a quarterly billing cycle, and so they will most likely use up that $75 credit in this quarter,\" she told SBS News.\n\n\n\nLISTEN TO As power prices surge, David has found ways to cut running costs by thousands SBS News 05:34 English\n\n\"When their next quarterly bill lands anywhere between January and, in some cases, maybe even as late as early April next year, that is likely to be their first rebate-free bill, and they could be in for quite the shock,\" Tindall said.\n\n\n\n\n\n\"For the last 18 months, those $75 instalments from the federal government have been keeping electricity bills artificially lower.\"\n\n\n\n\n\nThe fate of electricity prices will also be known after negotiations between providers and the government next year.\n\n\n\n\n\nTinall said she expects households to pay more for electricity with the start of the new financial year from July 2026.\n\n\n\nThree hours of free power\n\nIn 2026, you might have access to free power.\n\n\n\n\n\nFrom July, households in NSW, south-east Queensland and South Australia will have access to the Solar Sharer scheme, which will give consumers free access to electricity for three hours each day.\n\n\n\n\"That will be an interesting one to watch and see how the market reacts to this solar share offer,\" Tindall said.\n\n\n\n\n\nAnnouncing the scheme in November, Energy Minister Chris Bowen said: \"People who are able to move electricity use into the zero-cost power period will benefit directly, whether they have solar panels or not and whether they own or rent.\"\n\n\n\n\n\n\"The more people take up the offer and move their use, the greater the system benefits that lower costs for all electricity users will be,\" he said.\n\n\n\nAustralian Centre for Disease Control\n\nFrom January 2026, Australia will have a Centre for Disease Control (CDC), aiming to respond to and prevent public health emergencies.\n\n\n\n\n\nThe CDC will be responsible for wastewater surveillance to monitor disease and for communication with regional and local partners.\n\n\n\nREAD MORE Australia to open permanent centre for disease control, health minister says\n\nThe centre will be led by a director-general appointed by the health minister and start operations on 1 January 2026.\n\n\n\n\n\nAssociate professor Paul Griffin, from the University of Queensland Medical School, earlier told SBS News the establishment of a CDC will help Australia's response to infectious diseases.\n\n\n\n\n\n\"We are in a very precarious situation right now, both in how we're currently responding to existing threats and vaccine rates is a huge issue,\" he said.\n\n\n\n\n\n\"So, we need to do more for what we're already dealing with, but we also need to be really well-prepared to be on the front foot for new and emerging threats as well.\"\n\n\n\nA new question in the Census\n\nIn August 2026, the Census will also take place after five years, but this time, there will be some changes to the questions you will be asked.\n\n\n\n\n\nIn February, the Australian Bureau of Statistics announced the 2026 Census will feature updated questions related to sex, household, and family relationships, with revised wording to specify \"sex recorded at birth\".\n\n\n\n\n\nIt will include the revised work to differentiate it from a separate question on gender.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/precious-metals-pull-back-investment-themes-for-2026/ws4sc1msk",
        "title": "Precious metals pull back & investment themes for 2026",
        "publish_date": "Tue, 30 Dec 2025 06:11:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/thornbury-residents-devise-their-own-housing-plan-as-alternative-to-activity-centre-20251222-p5npit.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Thornbury residents devise their own housing plan as alternative to activity centre",
        "publish_date": "Wed, 31 Dec 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Lachlan Abbott"
        ],
        "text": "Thornbury residents are taking housing plans into their own hands, designing an alternative to the Allan government’s activity centre designs for the area.\n\nFair Growth Thornbury say they support increased density if it’s done right, and believe their proposal better maintains the suburb’s character and amenity.\n\nJames Patto and Sarah Downes from Fair Growth Thornbury have proposed a different way to rezone part of Melbourne’s inner north. Credit: Joe Armao\n\nJames Patto and Sarah Downes founded the group in September after reviewing the state government’s rezoning plans and believing they were excessive.\n\nThe young couple argue their approach is different and more constructive than other housing reform opponents, like those in Brighton – with whom the premier has sparred – because they have crafted high-density options for along St Georges Road and High Street.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/sailing/sydney-to-hobart-drama-as-french-crew-penalised-after-breaking-rules-20251231-p5nqux.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney to Hobart drama as French crew penalised after breaking rules",
        "publish_date": "Wed, 31 Dec 2025 12:52:20 +1100",
        "category": "sports",
        "authors": [
            "Frances Howe"
        ],
        "text": "The overall winner of the Sydney to Hobart race is Min River after a protest was launched against the leader of the overall standings, BNC - my:: NET / Leon, for breaking race rules.\n\nMin River, sailed by Jiang Lin and Alexis Loison, is the first double-handed yacht, and Lin is the first female-skipper, to win the overall race.\n\nOwner and skipper of Min River, Jiang Lin. Credit: Wolter Peeters\n\n“I can’t believe it,” Lin said, one of 14 female owners or skippers in the 129 entries this year, said on Wednesday morning. “It will encourage more women I hope... Look at me, if I can do it surely you can.”\n\nBNC - my:: NET / Leon arrived at Constitution Dock on Tuesday afternoon as the overall race leader and first in the double-handed division. The French crew – Michael Quintin and Yann Rigal – were greeted with champagne and met by the Cruising Yacht Club of Australia commodore Sam Haynes, who also happens to be the reigning overall race winner from 2024.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/adam-liaw-s-50-greatest-barbecue-recipes-of-all-time-20251229-p5nqko.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s 50 greatest barbecue recipes of all time",
        "publish_date": "Wed, 31 Dec 2025 12:32:49 +1100",
        "category": "finance",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Recipe collection\n\nAdam Liaw’s 50 greatest barbecue recipes of all time\n\nMaster the flame with Adam Liaw’s definitive barbecue toolkit. From the easiest-ever burger to zesty salads, here are 50 recipes to elevate your grilling game.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/sam-kerr-is-getting-married-today-here-s-everything-we-know-about-the-wedding-20251231-p5nquo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sam Kerr is getting married today. Here’s everything we know about the wedding",
        "publish_date": "Wed, 31 Dec 2025 11:59:46 +1100",
        "category": "lifestyle",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Wedding bells are chiming for Matildas superstar Sam Kerr, as she prepares to tie the knot with American soccer player Kristie Mewis just in time for the New Year.\n\nAfter a two and a half year engagement, during which they welcomed their first child Jagger Mewis-Kerr, the couple will finally wed in a ceremony Down Under. Though exact details around the wedding remain under wraps, Mewis – a former West Ham United player – recently shared a few hints on a podcast, including where they’re getting hitched, the guest list, and the role their baby boy will play in the ceremony.\n\nProfessional soccer players Sam Kerr and Kristie Mewis will finally tie the knot this New Year’s Eve. Credit: PA Images via Getty Images\n\nSo, here’s everything we know so far about what some have dubbed the “Australian royal wedding”.\n\nWhere and when will the wedding take place?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-for-flat-morning-trade-as-2025-winds-down-20251231-p5nqt1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX edges higher in morning trade as 2025 winds down",
        "publish_date": "Wed, 31 Dec 2025 11:52:27 +1100",
        "category": "finance",
        "authors": [
            "Damian J. Troise"
        ],
        "text": "The Australian sharemarket started the last day of the year on a muted note after US stocks wavered in light trading, with investors assessing minutes of the Federal Reserve’s December meeting as 2025 nudges to the finish line.\n\nThe S&P/ASX 200 edged down 4.8 points to 8712.30 as of 10.50am AEDT, with five of its 11 industry sectors down, although none of them dropped by more than 0.2 per cent. The lacklustre morning followed two days of modest declines in light holiday trading. The Australian dollar was trading at US66.95¢ as of 9.29am AEDT.\n\nThe S&P/ASX 200 is on track for a 6.2 per cent gain for the year – its worst since a loss in 2022, and far below the performance of the stock markets of most other developed countries. Global stocks are poised for their biggest annual gain in six years, supported by Federal Reserve interest-rate cuts and a surge in enthusiasm for artificial intelligence companies.\n\nWall Street had a relatively quiet session as the year came to a close. Credit: Bloomberg\n\nThe MSCI All Country World Index – one of the broadest measures of the global equity market – has gained 21 per cent this year, with just one trading day of 2025 remaining for the benchmark. Wall Street’s S&P500 index has gained more than 17 per cent, while similar indices for Britain, Japan, Germany, Canada and Hong Kong were on track for gains of more than 20 per cent. Among the few markets the ASX 200 is set to outperform is New Zealand’s, where the NZ50 was up 3.7 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/australian-performer-dumped-from-k-pop-girl-group-20251231-p5nquq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian performer dumped from K-pop girl group",
        "publish_date": "Wed, 31 Dec 2025 11:44:30 +1100",
        "category": "finance",
        "authors": [
            "Jin Yu Young"
        ],
        "text": "The K-pop band NewJeans plunged deeper into turmoil this week after its management label said it had dropped one member of the five-person girl group, one of the genre’s most influential acts in recent years.\n\nThe announcement on Monday by the group’s label, Ador, that it was terminating the contract of Danielle Marsh, who performs as Danielle, is the latest flashpoint in a more than yearlong legal battle between the label and the band.\n\n(From left) Hyein, Haerin, Hanni, Danielle and Minji of girl group NewJeans at Seoul Fashion Week in September. Credit: Getty Images\n\nThe label did not provide a reason for dropping Danielle, an Australian performer born in Newcastle. It said that three NewJeans members — Haerin, Hyein and Hanni — would continue working while it continued “discussions” with Minji, a fourth member.\n\nNeither Danielle nor Minji responded immediately to requests for comment on Tuesday. It is unclear when or whether NewJeans will record music or perform as a group again.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/the-epstein-files-what-we-know-so-far-20251231-p5nqxg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Epstein files: What we know so far",
        "publish_date": "Wed, 31 Dec 2025 11:33:55 +1100",
        "category": "finance",
        "authors": [],
        "text": "The Epstein files: What we know so far\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw19-west-ham-vs-brighton-20251231-p5nqxb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW19: West Ham vs Brighton",
        "publish_date": "Wed, 31 Dec 2025 11:26:15 +1100",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW19: West Ham vs Brighton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw19-nottm-forest-vs-everton-20251231-p5nqx9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW19: Nott'm Forest vs Everton",
        "publish_date": "Wed, 31 Dec 2025 11:23:36 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW19: Nott'm Forest vs Everton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/inspiration/the-best-places-to-stay-in-byron-bay-20231228-p5etzq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The best places to stay in Byron Bay",
        "publish_date": "Wed, 31 Dec 2025 11:21:19 +1100",
        "category": "finance",
        "authors": [
            "Katherine Scott",
            "Angela Saurine",
            "Sheriden Rhodes"
        ],
        "text": "Advertisement\n\nThis article is part of Traveller’s comprehensive Byron Bay Destination Guide. See all stories .\n\nThe odd sandy-floored hostel remains, but a new crop of accommodation has taken root in the Byron region, ones that prioritise wellness, luxury, sustainable design, and a deep connection to the coast and hinterland. Amaroo Bangalow Cabins are designed by architecture firm Shaun Lockyer in Brisbane. Timothy Birch Perfect for: Couples or large groups who want to feel secluded without straying too far\n\nBefore Amaroo Bangalow landed on luxury-seekers’ radars it was built as a family retreat, a fact that’s charmingly evident in the details. Down a gated driveway, cresting the ridgeline of a 240-acre black Angus cattle and macadamia farm, all four lodges back onto a patch of sloping rainforest. Supremely modern and cosy, each boasts a distinct style, studded with beautiful personal touches that aren’t always a given in holiday rental territory, and perks like heated towels racks, Mukti amenities and in-room fireplaces. You can book a single cabin for two, or the entire property – remarkably, either way, you still enjoy exclusive use of the central communal pavilion, with its expansive kitchen and facilities – our favourites being the heated pool and wood-fire oven. It feels gloriously secluded, despite being mere minutes’ drive from the terrific restaurants of Bangalow village and The Hut at Possum Creek.\n\nFrom $850 a night per cabin, which includes exclusive use of the property. 47A Cedarvale Rd, Bangalow NSW. Phone: +61494 080 588. See amaroobangalow.com The Bower Byron Bay\n\nAdvertisement\n\nThe Bower Barn. Perfect for: Stylish road trippers who want to dip a toe in the Byron scene\n\nThe former 1970s motel was first reimagined as a luxury hotel in 2017 – the original designer and co-owner, Taliah Lowry, laced Byron’s beachy essence with a touch of New York grit, inspired by the US city’s industrial-cool Bowery neighbourhood. A recent two-year upgrade has once again restored its sheen and grown its footprint, with new additions including a guest lounge, hotel bar, new reception space, an onsite spa treatment centre and four beautiful new suites. There’s no onsite restaurant, though the pool area is serviced by a licensed bar offering canned cocktails, drinks and bar snacks – thankfully, it’s a short stroll from fantastic dining, including hatted Bar Heather.\n\nFrom $320 a night; $620 for a Bower Studio. Two Junior King Accessible rooms. 28 Bangalow Rd, Byron Bay. Phone: (02) 6680 9577. See thebowerbyronbay.com.au\n\nRead our full review here\n\nBasq House, Byron Bay Bask central at Basq House. Perfect for: Design buffs who appreciate homely comforts\n\nIt feels like you’re staying with a friend with exceptional taste at the central, 32-room, boho-inspired hotel. Melbourne-based owners and good friends Matt Walsh and Shane Wilkinson wanted Basq House to feel like a home away from home. Taking its cues from a traditional riad, the house-style sanctuary is orientated around a central magnesium pool hemmed by cabanas, overhanging palms and pastel-pink umbrellas. There are six room types in a mix of formats, all stylishly minimalist with custom, honey-hued timber joinery. Take a complimentary Lekker bike out for a spin or catch a wave at The Pass on Basq’s candy-coloured boards. On your return, order a coconut margarita and partake in poolside reverie until dinner beckons. Two dedicated share vehicles can be hired for coastal or hinterland jaunts.\n\nFrom $395 a night (secure parking $20 a night). 4 Fletcher Lane, Byron Bay. Phone: (02) 5671 1000. See basqhouse.com.au\n\nRead our full review here\n\nAdvertisement\n\nElements of Byron A sprawling resort with appeal across demographics. Perfect for: Environmentally conscious couples, families, girls’ getaways\n\nInspired by the elements of nature, this luxury resort blends effortlessly into native bushland a few kilometres north of town. The curved roof of the main pavilion was designed to reflect the windswept sand dunes on neighbouring Belongil Beach, and there’s a communal fire pit beside the large, lagoon-style pool. With everything from a nature playground and fairy trail to a stylish spa and an adults-only pool with a swim-up bar hidden among the high-tech, eco-friendly villas, the property appeals across demographics. Dine at Azure Bar and Grill, pop across the road to North Byron Hotel, or catch the solar train into Byron from North Beach Station.\n\nFrom $515 a night. 144 Bayshore Dr, Byron Bay. Phone: (02) 6639 1500. See elementsofbyron.com.au Raes on Wategos Sleep to the soundtrack of the ocean.\n\nAdvertisement\n\nPerfect for: Special occasions, romantic escapes\n\nFall asleep to the sound of waves crashing against the shore at this chic, Moroccan-inspired hotel overlooking Wategos Beach. With features such as enormous daybeds and deep marble baths, the seven suites, which each have their own unique character, are so beautiful you won’t want to leave. If you do make it out, you can borrow an 88 surfboard and hit the waves, dine at the acclaimed Raes Dining Room downstairs or watch the sunset from the Cellar Bar terrace. A complimentary chauffeur service is also available.\n\nFrom $950 a night. 6-8 Marine Parade, Byron Bay. Phone: (02) 6685 5366. See raes.com.au Gaia Retreat and Spa A Komala Luxe Villa. Perfect for: Solo travellers looking to rest and reset, couples, special celebrations\n\nRestore your inner calm with a stay in a high-tech villa at this hinterland wellness retreat co-founded by much-loved Aussie Olivia Newton-John in 2005. It’s easy to fill your days at Gaia – which means ‘spirit of Mother Earth’ – indulging in rejuvenating massages and facials from the on-site spa, and partaking in everything from yoga and Pilates to reiki, Qigong and sound healing ceremonies. At night, guests converge in the Samoan longhouse-style Kukura House to dine on innovative healthy cuisine, incorporating vegetables grown in the kitchen garden and fish from the aquaponics pond, and sip sustainably and ethically sourced or organic wine.\n\nFrom $1875 a night (two-night minimum stay). 933 Fernleigh Rd, Brooklet. Phone: (02) 6687 1216. See gaiaretreat.com.au 28 Degrees\n\nAdvertisement\n\nOne of the rooms with a private plunge pool at 28 Degrees Byron Bay. Jessie Prince Perfect for: Wellness lovers, solo travellers, couples\n\nThis luxury guesthouse in Byron Bay offers barefoot luxury at its finest. Designed by interior stylist and owner Deb Garske – who created the space while recovering from Hodgkin lymphoma – the toxin-free retreat blends sustainability with style. There are 12 thoughtfully curated rooms (five with private plunge pools), accommodating up to 24 guests, with features such as antique claw-foot baths, Iranian tiles, handmade ceramics and local beeswax candles. A favourite of Baz Luhrmann, who stayed in Room 3 while writing Elvis, 28 Degrees is an elegant, TV-free sanctuary just steps from Byron’s vibrant shops and restaurants.\n\nFrom $520 per night. 12 Marvell St, Byron Bay. Phone: (02) 6685 7775. See 28byronbay.com.au\n\nRead our full review here The Brooklet Cool off in the 25-metre mineral pool. Abbie Melle Perfect for: Kid-free breaks, solo travellers, significant birthday celebrations\n\nLie back in your freestanding bath and watch the clouds float across the rolling green hills from one of six contemporary brick villas at this adults-only hinterland hideaway, set on a 50-hectare macadamia and stone fruit farm next door to Gaia. Housed in the former tractor shed overlooking the mineral pool, the bar is the perfect place to enjoy a long lunch prepared in the outdoor kitchen with loved ones. The thoughtfully designed villas feature handmade ceramic tiles in the bathroom, SMEG appliances and gas fireplaces. There’s also a Japanese-style cedar hot tub, sauna, gym and tennis court, and a three-bedroom residence, The Bails, for larger groups.\n\nFrom $750 a night. 841 Fernleigh Rd, Brooklet. Phone: 0413 120 409. See thebrooklet.com.au\n\nAdvertisement\n\nHotel Marvell Bohemian luxe, or just luxe? The rooftop pool at Hotel Marvell. Perfect for: Influencers, business travellers\n\nTake in views over town to the misty mountains beyond from the rooftop pool at Hotel Marvell, in the centre of Byron Bay. No expense was spared when it came to building the architecturally designed five-star hotel, which opened in 2023. There are 16 hotel rooms with smart TVs, Nespresso coffee machines and blackout blinds spread across three levels, plus six suites and two two-bedroom rooms. The buzzing rooftop bar is the place to start the night, before heading downstairs to its in-house restaurant, the Oyster Bar & Seafood Restaurant.\n\nFrom $600 a night. 4 Marvell Street, Byron Bay. Phone: (02) 6685 7385. See hotelmarvell.com.au Beach Suites Byron Bay Beachfront digs, complete with private plunge pool.\n\nAdvertisement\n\nPerfect for: Surfers, families, couples\n\nA beach pad with your own private plunge pool? Yes, please! Open the gate from your Beachfront Studio and wander down the road to the Beach Hotel or splash out on a two- or three-bedroom Penthouse Suite to make the most of the views across the ocean towards the rocky outcrop Julian Rocks, Nguthungulli Nature Reserve. The upmarket accommodation features marble bathrooms with spa baths (with bonus miniature rubber duckies), beachy paintings by local artists on the walls and sprinklings of coral. There’s also secure undercover parking, and you can borrow bikes or e-bikes to get out and about.\n\nFrom $395 a night. 20 Bay St, Byron Bay. Phone: (02) 6680 9944. See beachsuites.com.au Crystalbrook Byron Luxe facilities on 45 acres of subtropical rainforest. Perfect for: Rejuvenating tropical escapes\n\nCollect a bamboo room key from reception and meander along a timber boardwalk through the rainforest to your suite at Crystalbrook Byron. Previously known as the Byron at Byron, the 42-hectare property underwent a major refurbishment after being taken over in 2020 by sustainably focused hotel group Crystalbrook Collection, which also has offerings in Sydney, Newcastle, Brisbane and Cairns. The plastic-free resort has 92 suites fitted with timber louvre windows, rattan lampshades and tropical print cushions. As well as access to Tallows Beach, just south of Byron Bay, there’s a heated pool, sauna, day spa and a tranquil on-site restaurant, Forest, with a menu showcasing native ingredients.\n\nFrom $455 a night. 77/97 Broken Head Rd, Byron Bay. Phone: (02) 6639 2000. See crystalbrookcollection.com/byron The Chalet Motel\n\nAdvertisement\n\nA refurbished 1950s motel that’s oh-so Byron. Perfect for: Budget-conscious nostalgics\n\nEmbrace the retro vibe with a stay at this roadside motel in the seaside town of Brunswick Heads, around 15 minutes’ drive north of Byron. Originally opened in 1954, it has 12 refurbished rooms with quirky features like brass pineapple wall hooks, and vintage appliances. Guests are greeted with a pink neon sign with the words Simple Pleasures behind the bamboo reception desk. Photos capturing the local lifestyle adorn the walls, and there’s a pool and undercover barbecue area.\n\nFrom $165 a night. 68 Tweed St, Brunswick Heads. Phone: (02) 6685 1257. See chaletmotel.com.au Reflections Holidays Byron Bay Direct beach access from the premium ocean villa. Perfect for: Families, grey nomads\n\nWith a track leading straight down to Clarkes Beach, which has a tidal pool ideal for littlies, Reflections Holidays Byron Bay is as good as it gets for beach-loving families. The park caters to a wide cross-section of budgets and styles, with powered and unpowered campsites through to tiny houses, cabins and contemporary villas with outdoor kitchens on the deck. There’s a playground and barbecue facilities, with mobile businesses like Kombi Keg and Byron Homemade Pizza popping up during school holidays, when activities such as tie-dyeing, bead making and pottery workshops are also on offer.\n\nFrom $51 a night for unpowered campsites; $218 for cabins. 1 Lighthouse Rd, Byron Bay. Phone: (02) 6685 6496. See reflectionsholidays.com.au\n\nSign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now.\n\nTraveller Guides",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw19-chelsea-vs-bournemouth-20251231-p5nqx1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW19: Chelsea vs Bournemouth",
        "publish_date": "Wed, 31 Dec 2025 11:14:49 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW19: Chelsea vs Bournemouth\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/australian-cricket-great-damien-martyn-hospitalised-20251231-p5nqtq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gilchrist provides update on Damien Martyn after cricket great placed in induced coma",
        "publish_date": "Wed, 31 Dec 2025 10:52:14 +1100",
        "category": "sports",
        "authors": [
            "Tom Decent",
            "Dan Walsh"
        ],
        "text": "Former Australian cricketer Damien Martyn is in an induced coma in a Queensland hospital after being diagnosed with meningitis.\n\nThe 54-year-old, who played 67 Tests for Australia between 1992 and 2006, was admitted last week after falling ill.\n\nChampion wicketkeeper and former Test and WA teammate Adam Gilchrist confirmed Martyn’s hospitalisation on behalf of him and his family.\n\nCricket sources, speaking on the condition of anonymity due to the sensitivity of the situation said Martyn is receiving treatment for meningitis, an inflammation of the protective membranes surrounding the brain and spinal cord. The infection can lead to swelling of the brain.",
        "source": "TheAge"
    }
]